{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Emily Devenport", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "kB/hxLO/txlsqHkEbxmVMVAcCK0=", "id": null, "license": null, "comments": "", "raw_text": "7090 words, short story  Postcards From Monster Island  Sometimes people ask me, “Why didn’t you run?”  “Because I had the Martian Death Flu,” I tell them.  They look at me funny because they’ve seen the footage of people clogging the roads, and the subways and trains, desperate to get out of town the day he waded ashore. I wasn’t in that crowd. I was flat on my back in my studio apartment, blitzed out of my mind with medicine. Two of my cats slept on top of me and my dog was snoring beside us when the whole building began to shake. Some of my books fell off their shelves, and I could hear the dishes clattering in their cupboards. I thought it was an earthquake. I considered dragging myself out of bed and crouching in a doorway.  That impulse didn’t make it past the notion stage. I couldn’t even muster the ambition to be worried as more books tumbled off my shelves and the windows rattled. I only managed a little curiosity when I noticed that the shaking was a side effect of slow, ponderous BOOMs, spaced like colossal footsteps. If the Statue of Liberty took a walk through town, she might make noises like that.  Wow, I thought. This is the weirdest fever dream I’ve ever had. And then I fell asleep again.  All night long I felt the tremors and heard the sirens. Once I awoke to a sound like ten foghorns going off at once. The cry was challenging, yet—oddly lonesome. That was the only time during the night when I believed something might really be going on. I thought I should at least try to get up. And then I passed out.  When the bombs started to drop, I pried my eyes open and squinted at the window. Morning light was trying to penetrate the dust and debris floating in the air. It wasn’t making much headway.  Any normal person would have been thinking about evacuating the scene by that point. But the Martian Death Flu, though not actually from Mars, made me feel anything but normal. For one thing, when I sat up, the room started to spin. For another, my pets let me know in no uncertain terms that they were hungry. Plus my dog needed to potty.  I had to answer my own call of nature first. Halfway to the bathroom, I decided I’d better crawl if I really wanted to get there. Afterward I took more medicine, my head pounding in tune with the bombs going off outside.  The war sounded like it might be about a mile away. My apartment shook more than it had during the night, yet everything was still pretty much intact. My pets didn’t like the noise, but they seemed more worried about their stomachs, so I staggered out of the bathroom and fixed their bowls.  I could barely hold myself upright long enough to do it. Once my dog had eaten, she reminded me that I needed to do something more challenging. I managed to get her collar attached and find the pooper-scooper. Then it was out into the cold, cruel world.  We passed one of my neighbors in the hall: Mr. Abé. He operated an African-clothing shop on our street. As the BOOMs and RAT-TAT-TATs shook our building, I lurched back and forth across the hall, and Mr. Abé gracefully sidestepped me.  “Sorry,” I rasped.  “I hope you feel better soon, Miss Herrmann,” he said. “Terrible racket, isn’t it?”  “Yeah,” I managed, before Peachy almost pulled me off my feet. She had her priorities, and she would tolerate no delay.  Under the circumstances it was crazy to get into the elevator, but I knew I wouldn’t make it down the stairs. I don’t remember how we got outside from there, but we ended up in the alley behind our building. Peachy did her business cautiously, but not as nervously as I expected she would. She stopped from time to time and perked her ears at the sounds of battle. She sniffed out her favorite spots, and I pooper-scooped. Then she pulled me back toward the alley door, and I took a moment to be grateful she wasn’t going to insist on walkies. The way I was feeling, it would have been more like draggies.  Just before we got through the door, that foghorn cry sounded again. It was much louder without the walls of our well-constructed building to muffle it. Both Peachy and I were extremely impressed. Instead of loneliness, this time I heard a note of exasperation.  Peachy trotted through the door and I stumbled after her. I don’t remember how I got rid of the poop I had scooped, but I can only hope I did the right thing with it. I made it back up to our floor and into our little apartment.  I really wanted to fall into bed. I also wanted to throw up. But I made myself grab my phone, and I also snagged the remote. All four of the cats were on the bed by then, but they made room for me once they realized I was about to fall on them.  For several moments I just lay there, the remote and phone still clutched in my hands, my stomach and my head competing for Most Amazingly Wretched Body Part. I waited until I was fairly sure I wasn’t going to throw up, and then I dialed the first of my three jobs.  They were part-time jobs, the best I could find with my new bachelor’s degree in library science, and I juggled them to keep myself afloat. Only one of them paid for sick time, so I had planned to dose myself with the medicine and stagger in to work, regardless of how horrible I felt. That plan had wilted in the painful (and extremely filtered) light of day. I speed-dialed the morning job.  An operator told me the number was no longer in service. I got the same message for the afternoon job. The number for the evening job didn’t even connect with a recording; it just made horrible noises.  I gave up on the phone. “Guess what, gang,” I croaked. “I don’t have to go to work—ever again.”  My building shook, the dishes rattled, and another book fell off the shelf. I should have been worried, possibly even depressed to lose my livelihood. Yet somehow I felt relieved. I knew it wasn’t a rational reaction, but I couldn’t help it.  I pointed the remote at the TV and pushed the ON button.  I didn’t have to surf for a news channel. The story was on all of them. I hadn’t seen that kind of coverage since 9/11 (though I was in the 4th grade at the time, and spent most of my time watching the Cartoon Channel, so maybe I wasn’t an authority on that). Talking heads babbled about the giant creature who had waded ashore, and the bombs that didn’t seem to do anything but annoy it, and the pollution and/or nuclear waste that had probably created it, and the wreckage that used to be our city, and the conference with the president that was supposed to happen any minute (but never did on that night)—and on the bottom of the screen scrolled the words: SCIENTISTS BAFFLED BY BEHEMOTH.  It was hard to get a good look at him with all the smoke, fire, tracers, exploding debris, etc. But I could see bits and pieces. He was colossal (apparently they felt behemoth was easier to spell). He sometimes stood on two legs, sometimes on four, and I couldn’t help comparing him to a giant lemur—except that he had a thick tail that he used to bash things.  Another not-so-lemur-ish characteristic was his hide. Instead of fur, he had these triangular, rocky scales that seemed impervious to everything they hurled at him. No missiles could penetrate that hide. And some of them were really big missiles.  They did no damage to Behemoth. But they did plenty of damage to our city. Just when I thought they would wise up and stop with the bombs, a troops of marines jumped out of an airplane and parachuted onto him. They bounced off too. When they landed, the ones who didn’t get tangled in their parachutes launched grenades at him. He turned and walked away from them, toppling several buildings that had been damaged by the bombs.  “This just in,” said the reporter, who sounded like he might OD on the excitement. “All troops are being withdrawn. Readings on the geiger counters are spiking. The creature seems to be generating dangerous levels of radiation.”  That didn’t sound good. But no one had anything very smart to add, and amazingly, the behemoth story began to suffer from the same problem every other big news story seems to have: endless rehashing of theories and footage, without anything new or intelligent to offer.  I passed out again while waiting for clarification on the radiation thing. It sounded pretty bad, and it also sounded like a good reason to clear out, assuming I could find a way to wrangle four cats and a dog. And my dizzy, flu-bedeviled ass. To where, I couldn’t imagine. Because no shelter was going to take my pets; I had heard about what happened to the pets in New Orleans after that hurricane.  Maybe the radiation wouldn’t reach my part of the city . . .  A few hours later I woke to hear someone on the TV saying that Behemoth wasn’t radioactive all the time, just when a lot of missiles had been fired at him. Like maybe it was a defense mechanism or something. But then they started that old rehash again, and I stopped listening. The only thing that made my ears perk up was a rumor that another giant creature had been spotted over our city, this one in the clouds.  Yes, that was the Cloud Squid. She showed up inside a thunder storm. The rain thrashed us so long, parts of the city flooded. It did clean most of the smoke and debris out of the air, though. You’ve got to look on the bright side.  The bright side was pretty easy for me to see. Because thanks to Behemoth, I wouldn’t have to drag my half-dead carcass out of bed and go to work anytime soon. Sadly, it was that simple. I wondered if I might qualify for some kind of hazard pay, or even radiation disability. When I passed out again, I dreamed I was taking selfies of my new, glow-in-the-dark face, and I kept having to do it over because I couldn’t quite seem to capture the pretty colors of my triangular scales.  When I woke up, my neighbor Frida stood looking down at me. “Bernadette—are you still alive?” she wondered.  This was an ironic question, considering that Frida, who actually did look like Frida Khalo when she wasn’t in Santa Muerta drag, had painted her face to look like a flowery Dia de los Muertos skull. The effect was quite gorgeous, but it looked as if Death herself had paid me a visit. Death carrying a container of chicken soup. Accompanied by a pet ferret on a leash.  “Maybe,” I croaked. I sounded even worse than the last time I had tried to communicate, but I felt better. Not great, but there was a definite improvement; my head wasn’t spinning and my stomach had settled. The chicken soup smelled good.  “Can you sit up?” asked Frida. “I’ll fix you a bowl of this soup and then take Peachy for her walk.”  “You really are a saint, Miss Muerta.” I pushed myself into a sitting position and watched her putter in the kitchen. Frankenferret sat on the foot of the bed, ignoring and being ignored by the cats while she socialized with Peachy, her best walkies buddy. Frida took Peachy out every day while I was at work, and in return she had a key to my place and unlimited borrowing privileges to my extensive library.  Frida is an artist who specializes in skeleton/calavera images, though her repertoire is much broader, including murals for businesses and private homes and illustrations for children’s books. She is a successful artist, which in this day and age means that she barely makes a living and has to rent a studio in our odd little building. But she is living La Vida Loca, and her soup is good. She dished up a bowl and put it on a tray, then waited with her hands on her hips until she was sure I could get it down and keep it there.  “I investigated the water tank on our roof,” she informed me. “I worried there might be gunk in there because of all the smoke and debris from the explosions. You know what I found?”  I swallowed a spoonful of soup and guessed, “Gunk?”  “Nope. Pure rainwater. The cleanest water I’ve ever seen. I have a theory about why, but I’m going to do some investigation when I take these rascals on their walk.”  “Okay.”  Frida herded Peachy and Frankenferret out the door and I reached for the remote. No bombs were going off, so I thought I’d better turn on the TV and find out where things stood.  Once again, the Creature Crisis dominated all stations, but now it was the Cloud Squid they couldn’t get enough of. I watched some very entertaining footage of her evading air force jets and attack helicopters. Every time they fired something at her she darted away, leading them on quite a merry chase. What was not so entertaining was the destruction they caused when their missiles hit what was left of the city. So they weren’t making any more headway against the Cloud Squid than they had against Behemoth. And I learned something else from the news ticker scrolling across the bottom of the TV screen:  DANGER ZONE HAS BEEN CLOSED . . . NO ONE ALLOWED IN OR OUT DUE TO RADIATION THREAT . . .  Closed. Yet I still had electricity, cable, water—all the important stuff. This would make life easier, as long as it lasted. Now that the Danger Zone was closed, I couldn’t leave even if I wanted to, so that simplified things. But if they were isolating us, did that mean they might drop a bomb on us? I mean a really big bomb? As in nuclear? Since we were already kind of radioactive sometimes?  I tried to reassure myself that they would have the common sense to realize the radiation from nuclear bombs would travel, along with dust and debris that would cause a nuclear winter. I tried and tried. And tried.  I gave that up and surfed the channels on the TV, until I found a story that was unfolding in real time. The Cloud Squid and Behemoth had discovered each other.  “It looks as though we’re about to see a battle royale between those two monsters.” The reporter was trying to sound worried, but instead he sounded like this would be the coolest thing ever.  The Cloud Squid eased herself into the airspace over Behemoth, moving almost shyly. She hovered over him, her limbs opening like the petals of a flower. He gazed up, his mouth open, revealing rows of teeth that looked like stalactites (and stalagmites).  Damn, I thought. I didn’t want to see them fight. They were both beautiful in their odd ways. But then something amazing happened.  The Cloud Squid began to flash with color. I remembered the idea of bioluminescence: cephalopods communicating with each other using light and color. It was a glorious sight. Behemoth seemed to think so too, from the way he gazed at her.  And then another amazing thing happened. Behemoth’s hide began to flash with color too. And why would the giant lemur with the rocky skin have bioluminescence? Beats me (though he did come out of the sea).  They flashed colors at each other for maybe twenty minutes. Reporters chattered, baffled by the scene, yet feeling compelled to make inane comments anyway. They were still hoping for a fight, but that wasn’t going to happen. The two creatures stopped flashing colors, and then the Cloud Squid drifted away with her rainstorm. Behemoth sat in the rubble he had been collecting and gazed at the news cameras, and if to say, What do you think of that?  Reporters dutifully started their rehash cycle. After another half hour of that, I turned off the set. I was about to drift off to sleep again when Frida came in with Peachy and Frankenferret.  “Our branch of the subway line is intact,” said Frida. “And as far as I can tell, so are the cables that provide our internet and electricity. If you were willing to walk, you could get from here to the edge of the Danger Zone, but you’d have to cross some flooded parts up to your chest, maybe even up to your neck.”  “Are you planning to leave?” I asked.  She looked surprised. “No way. They’d have to drag me out of here.”  I felt happy to hear that. I doubted anyone else would bring me chicken soup. “So—did you see anyone down there?”  “Nope. Something better.” She pulled her iPad out of her backpack and called up a picture file. “I found another creature.”  The picture she showed me was murky. There was very little light in the tunnel, and the water level was high enough to hide a lot of stuff. But right in the middle of it all, a face grinned at me. “It looks like a friendly dog,” I said. “A giant—happy—water dog.”  “He acts like one, too,” said Frida, calling up more pictures. “You can’t see from these pics, but he’s about the size of a school bus. It’s hard to tell how many legs he has, because the number seems to change—see?” She selected a picture where he seemed to have five limbs, and then another where he might have only three, though in both of them he seemed to have a vaguely tail-shaped appendage. “I call him Mega Whatsis. Sometimes he seems to be solid, but other times he’s kind of gelatinous. Here’s a short video I took on my iPad.”  My stomach stirred uneasily at the thought of looking at something that was sometimes kind of gelatinous, but when I watched Mega Whatsis in the video, I saw a creature who moved confidently, even joyously, both in and out of the water. “Cool!”  “He’s smart,” said Frida. “Watch this next part.”  Frida’s hand appeared in the bottom edge of the picture. She held a cookie out to Mega Whatsis. His colossal head filled the frame until all I could see was a giant nostril sniffing the cookie. He delicately maneuvered the cookie into his mouth, using his rubbery lips, then pulled back for a moment and contemplated the taste, his happy face shifting into thoughtful lines. After another minute, he produced the cookie intact and nudged it back into Frida’s hand.  “It was dry,” said Frida. “No creature slobber on it.”  “Wow. Peachy couldn’t do that.”  Frida pulled up some more pictures on the laptop. “I expected the water down there to be full of waste and toxins. But it was more like natural creek water.”  I remembered what she had said about our water tank. “You think Mega Whatsis cleaned our water? Is that what you went down to investigate?”  She nodded. “But I don’t think it was him. He likes to stay underground. And his water has mud and silt in it.” She closed the picture files and put her pad back into its case. “I’m not telling anyone about this. If those jerks go down there to shoot bombs at Mega Whatsis, they’ll cut off our supply route. And he’s a big sweetheart, there’s no reason to hurt him.”  I decided to keep the radiation argument to myself for the time being. After all, I didn’t have a geiger counter.  Frida undid Peachy’s leash and patted her head. “She’s already gone potty. I’ll see you tomorrow.”  “Thanks,” I said.  After Frida had left, I surfed the TV stations, looking for evidence that anyone besides Frida knew about Mega Whatsis. I didn’t find any—now they were full of politicians arguing about whether or not any more money ought to be spent trying to kill Behemoth and the Cloud Squid. They couldn’t agree on that any more than they could agree on other stuff, so I drifted off to sleep again.  Sometime later, I approached wakefulness like a swimmer floating toward a bright surface. I couldn’t quite open my eyes, but I felt one of the cats lying across my stomach. I petted it, enjoying the velvety feel of its fur and its plump, warm body. I heard purring, but didn’t feel it vibrating in the body I was stroking.  And the fur felt too short. Way too short. Almost like you would expect the fur of a seal to be. I opened my eyes and saw the fat thing stretched across me. It tapered to a narrow tip that was lazily curling to and fro like a cat’s tail. It widened as it crossed my body and continued off the bed, onto the floor, and out the window, most of which was blocked by its bulk.  It was a tentacle.  Two things occurred to me then. The first was that you don’t expect a tentacle to be warm and fuzzy. The second was that the Cloud Squid was probably going to drag me through the window and eat me.  I lay there frozen, waiting for the Squid to make her move. When she ate me, who would take care of Peachy? Who would take care of Sheba, and Buster, and Thugly, and Jingle Monster (four more pets than I had officially declared in my lease agreement)? Would she eat them too? Jingle was grooming the tentacle as if it were another cat. Peachy had rested her head on top of it, and she was snoring again.  I’m not sure how long I lay there arguing with myself. But it was the Cloud Squid who resolved the situation. She used the tip of her tentacle like a hand and gently moved Peachy’s head onto the bed. Then she patted each of the cats and the dog, and slipped away out the window.  I stayed frozen for a few more moments, but I couldn’t resist the urge to look out the window to see where she had gone. I poked my head into mild morning air and the clean smell of recent rain. I saw the tentacle slipping back over the top of the roof. But why was she on the roof?  The water tank, I thought. She’s the one who put the rainwater in there . . .  After all, she moved around in a rain cloud. Maybe the rainwater was a pleasant side effect to one of her visitations. Whatever the reason, I didn’t feel like I wanted to lie in bed anymore. And I was sick of trying to get information out of the stupid talking-heads TV. Instead, I headed for my computer.  I logged onto Facebook. I wasn’t surprised to see that rumors about our creatures dominated the feed. What did surprise me was that there were still plenty of posts about politics, religion, status reports of how people’s diets were going, and pictures of funny cats. Once I got used to that, I composed my own status report and posted it.  To everyone who lives outside the Danger Zone, I said. Please stop bombing us. Don’t send any more troops. And please don’t let them drop an atomic bomb. Stop attacking, period! You’re doing more damage than good.  Once I had posted that, and tweeted an abbreviated version, I got an idea. I logged onto Google Blogger and created a blog called Postcards From Monster Island. It was just a template, but I thought maybe I could get Frida to send me some picture files. As I was plotting and scheming over all this, I realized something.  I felt better. I could breathe. I wasn’t dizzy. My head didn’t hurt. I was snarf-free. And my stomach was no longer my mortal enemy.  So I fed the beasties and took Peachy out for her business. Once we were outside, we even did a little walkies. But our world looked very different now.  A sort of mountain range had grown between my street and Behemoth’s battle zone. It seemed to consist of a combination of ruined buildings and actual rock. Hardly anyone was on the street, which looked largely untouched by the destruction. The temperature was mild, flowers bloomed in pots and window boxes, cooking smells tempted my starved palate, and most of the odd little shops were open, though there could be very few customers these days. The air still had that freshly washed smell, and breezes blew along the new corridor that had been created by Behemoth’s Makeshift Mountains.  Call me weird, but I thought it was an improvement. The noise of traffic was gone too, though I would still hear Behemoth moving big things around, with thuds and groans as stuff fell into place. He didn’t trumpet any challenges, but grumbled to himself, as if thinking aloud. Peachy perked her ears, seeming to understand every word. She even replied a few times.  Once she felt satisfied in every possible way, we came back inside and walked through the empty halls of our building. I wondered how many residents had evacuated. There weren’t that many of us in the first place, maybe around ten people. Our bottom floor had been converted into shops (or maybe the top floors had been converted into apartments, I wasn’t sure). We saw our super just once a month, though he did a good job with repairs. And he had put up bulletin boards next to the elevators, so I saw the note:  MEETING AT HOUDINI’S, UNIT 3C, 1:00 P.M. PLEASE COME AND DISCUSS THE CREATURE SITUATION  The numbering in our building was as eccentric as the residents, so Apartment 3C was on the 2nd floor. The door stood open—someone had stuck a sign on it with an arrow pointing inside.  I pushed the door open further and saw Mr. Abé across the room. He waved from a wingback chair, where he nursed a cup of coffee. As I hesitated on the threshold, Houdini poked his tattooed head around the corner from his kitchen. “Come on in,” he said, with the voice of a carney barker.  Houdini had a magician’s name, but his true passion was the classic sideshow. He honored that tradition with the tattoos that covered him from head to toe, and he split his time between his circus memorabilia shop and a variety of sword-swallowing, fire-eating, knife-juggling gigs. His apartment was dominated by his personal collection, but everything was lovingly displayed, not jumbled together.  Over his couch hung a giant poster featuring all of the lions and tigers in the Barnum & Bailey Circus. Beneath the leaping cats sat Beetle, whose specialty was mounting insects for collectors and museums, and his partner Poe, who did professional skeleton articulation. Both held plates with orange scones made by Oskar, who perched on one arm of the couch, sipping a cup of mint tea. Oscar owned a bakery, and seeing the scones reminded me that my stomach was back to normal.  The gathering was completed by Frida, who fussed at the computer with her occasional boyfriend, Gee, who was a buyer for the Museum of Weird Stuff.  “So . . . ” I took account of my neighbors. “We’re the ones who stayed. Somehow, that doesn’t surprise me.”  Oskar sipped his tea. “Running seemed like a hysterical reaction,” he said. “Like lemmings jumping off a cliff.”  “Yes,” agreed Mr. Abé. “I’ve lived through much worse conflicts. And I can tell you from personal experience that refugee camps are not necessarily better than war zones.”  If you were wondering why two normal guys like Mr. Abé and Oskar would be friends with a tattooed knife juggler, a skull-faced artist, the Bug Guy, the Skeleton Guy, Mr. Weird Stuff, and Crazy Cat/Library Girl, I can only say that Mr. Abé’s remark about refugee camps might explain why he’s willing to look past the surface and put up with our eccentricities. And as for Oskar, baker par excellence, he’s a very nice fellow with a flaw that was well tolerated in Germany, but is decidedly odd in the U.S. Oskar looks like Uncle Fester from The Addams Family. He smiles like him, too.  Houdini snagged a chair for me and for himself. “So here’s why I called the meeting.” His tone was so commanding, even Frida and Gee stopped surfing. “For all intents and purposes, we are now in the Danger Zone. We are stuck here, and we’re the ones getting hurt by the bombs and stuff. We have to start telling the outside world what we want.”  “Won’t they just ignore us?” asked Beetle, around a bit of scone.  “Maybe not,” I said. “We’re what passes for experts now.”  Mr. Abé raised an eyebrow. “Interesting. How did we pull that off?”  But Poe was nodding enthusiastically. “No, we are! I’ve been tweeting about it. I got the president’s office to talk to me—can you believe it?”  “Good.” Houdini waved a hand at Poe as if he were one of his side show performers, and he wanted everyone to step right up. “Because the biggest problem we’ve got is not the creatures. It’s the idiots in Congress who want to drop an A-bomb on us. The only thing we’ve got going for us is that the president is commander in chief, and he thinks it won’t work.”  “But what will he think when he finds out we’ve got three creatures now?” I worried.  “There are more than three,” said Gee. “I think there may be as many as seven in our city alone. So far. Look at the pictures we took.”  Frida tapped the screen to show us action shots. “They’re all doing stuff, but none of them are attacking people. See? There are people in all of these shots—some of them taking pics like we were doing, so it won’t be long until the outside world finds out.”  “Ah, but what are the creatures doing, Miss Muerta? That’s what we need to prove.”  Gee pushed a lock of his blue hair out of his face. “All we have is theories about most of them right now—except for Behemoth. Frida thinks he’s an artist.”  That remark provoked a conspicuous silence. But Frida was undaunted. “You notice he’s been piling debris up? Well, he’s fusing it together in particular ways. Look . . . ” She found the video she wanted and hit play. We watched Behemoth shove debris into piles, then look at it critically. He rearranged things a bit, then pondered it again. When he felt satisfied, he stretched out on the pile and his underside began to glow.  When he stepped away from it, the result was an oddly pleasing amalgam of cityscape and mountain range. I had never seen anything quite like it.  “He’s an artist,” said Frida, with the reverence most people reserve for guys like Michelangelo.  “And I think that’s why radiation levels keep spiking and then falling off. That’s how he’s melting stuff together.”  “All well and good,” Oskar said. “But that will only make people angry when we tell them. They think Behemoth is a monster, like from the movies. They see that he’s giant, he waded ashore and destroyed the city. We know the military did most of that, but that will leave egg on the faces of the politicians and the generals. They will despise us if we point that out.”  I heard him, but something that was unfolding on Frida’s screen snared my attention. “Hey—is that footage you guys took?”  “No,” said Gee. “That’s from YouTube; someone took it with their cell phone the night Behemoth came ashore.”  Behemoth was walking through the city, away from planes that shot missiles at him. An elevated train line stretched across his path; the train was stranded, and full of people. It looked like Behemoth was going to walk right into them, so people were screaming, trying to climb out windows. Then Behemoth paused, pivoted just as another missile was fired at him, and the bridge started to collapse.  “Wait a minute,” I said. “Did you see that? Can you go back and play it again?”  He replayed the segment, then froze it at the crucial moment.  “Wow,” said Frida. “Did I just see that?”  We watched the segment again.  “We’ve got to blitz social media with this clip,” said Frida. “I’ve seen the early part of the footage, but they keep cutting out the end. A lot of people probably haven’t seen the whole thing!”  “And there’s something else we have to do,” I said. “If we want to make them believe that we’re experts, and they should listen to us, we need to work on our bona fides.”  “But how?” wondered Houdini.  I pointed to the image on the screen. “We need to make contact with Behemoth.”  Our trip into the Makeshift Mountains made me wonder if Behemoth and the other creatures were having some positive effect on us after all. It was a challenging climb (though a few parts of Behemoth’s construct still had functioning elevators), yet I was able to troop alongside the others, despite the fact that I had just been very sick. We let Frida and Gee lead the way, since they were the youngest, and since they had also made several forays into those mountains.  For over two hours we wormed our way through mountain passages, walked single file along ridges, climbed in and out of shattered windows and across rooftops and balconies. We could hear Behemoth doing his work. We knew we were close.  “My friends,” Oskar warned, “we hope Behemoth will not hurt us, but what if we’re wrong? What if all those bombs and grenades have taught him to hate us?”  I didn’t have an answer to that, and by then I realized I wasn’t nearly as scared as I should have been. I just wanted to find Behemoth, I wasn’t even thinking about how we should contact him. But we had to do it if we wanted a future. We were bound together with him, for better or worse.  We climbed several rows of steps, some from old structures and some newly formed, until we reached a lookout point. As we made our way around an outcrop on the pinnacle, we came face-to-face with Behemoth. He stood in the valley on the other side of the peak, not more than one hundred yards away from us—a distance he could have crossed in just a few steps. His head was almost level with us.  Those great, golden eyes rolled in our direction and focused on us.  “Oops,” I said.  Yet I didn’t turn to run back down the path. None of us did. And it wasn’t just because we couldn’t have gotten away. Those eyes saw us, and we stared back at them, but it wasn’t an exchange between predator and prey. We, the Oddballs of the City, recognized Behemoth, the Oddball of the World.  We had seen it in that footage when he bumped into the elevated train. The cars began to topple from the track. Behemoth reached out and grabbed the train as it was going down. Once he had it settled more or less on terra firma, he shielded the people from the missiles until they could get out and flee the scene. One guy with a cell phone had caught that moment, and no one said anything about it. But we saw it. And now we were looking him right in his gigantic eyes.  Behemoth opened his mouth and emitted that cry we had heard so often in the last few days. There was no mistaking what he meant by it. I think he tempered it for us, it was gentler. It was still full of loneliness. But a new note had entered that symphony. To me, it sounded like hope.  “What should we do?” wondered Frida.  Without discussing it, we all waved at Behemoth. His ears perked. His pupils expanded, as if he were drinking in the sight. He sighed, and settled down to contemplate us further.  We sat down and ate the lunch Oskar and Houdini had packed for us, where Behemoth could see us. When we had finished, Oskar said, “I can sit with him for a few hours. You guys go home and rest up.”  “I’ll spell you after that,” offered Frida.  And so it went. For the next few days, one of us was always where Behemoth could see us. Once we had established that habit with him, more of the creatures began to come into the open. We waved at them. Cloud Squid waved back with all her tentacles. Mega Whatsis grinned and wagged his vaguely tail-shaped appendage.  But that’s not all we were doing. We started blitzing social media with our posts and pictures.  “Stop attacking!” we pleaded. “We’ve reached an accord with the creatures. We can manage them.”  When outraged people demanded to know just where they were going to rebuild the centers of commerce and culture that had once dominated our city, we pointed out that it would be a hundred times more expensive to rebuild that stuff than it would be to build new centers of commerce somewhere else. In response, we got a lot of flack from trolls. “Do the math!” we pleaded.  Just when we thought no one was listening, the trolling stopped. And the talking heads on TV stopped speculating whether more marines were going to jump out of planes so they could bounce off Behemoth’s teflon hide. Instead, the government started to drop emergency supplies for us along the Neutral Zone. And that’s when I got an email from the president.  We’ll make sure you have electricity and water, he promised. We’ll keep the food and medicine coming, too. Your debts have been settled, and you won’t be paying rent anymore. In return, all that we ask is that you keep managing the creatures. Keep them peaceful. Can you do that?  Yes, I replied, though I felt a little guilty about claiming credit for what seemed more like good luck.  On the other hand, it might be something more than that. It might be the fact that even when the city seemed to be coming down around us, we didn’t want to leave. The more people outside lost hope, the more we gained it. They wanted to throw bombs at Behemoth, we wanted to sit down and have lunch with him. That counted for something.  So—you remember that footage of all the people pouring out of the city the day Behemoth came ashore? Now a lot of people want to come back. Not to live—to see the creatures. So we started Danger Zone Tours. We take selected visitors to multiple stops, including the shops of Mr. Abé, Houdini, and Gee, to Oskar’s bakery and Frida’s gallery, Beetle’s exhibit and Poe’s museum, and to lots of other odd places that have sprung up. We’ve all got some extra cash on the side now.  We take them to see the creatures, too. Ten of them have come out into the open, so far. Mega Whatsis is the usual favorite (though he still doesn’t like cookies).  The last stop on the tour is a spot where people can see Behemoth. When he looks our way, we all wave. People love that. It’s the kind of reverence you would expect to see for whales breaking the surface next to a Greenpeace boat. When our visitors leave us, they talk about how glad they are the creatures showed up to teach us the error of our ways, that we were poisoning our world.  I agree that Nature has a reason for everything it does. If people who live outside of Monster Island think the creatures appeared because we abused the Earth, I won’t try to tell them otherwise. Maybe they’ll behave more responsibly. But I think there’s another reason.  Last night, I went to sit with Behemoth, and the two of us gazed at the stars. We’ve done that a lot, lately. Now that the Danger Zone is dark at night, we can see the Milky Way. Behemoth usually ponders the sky with a combination of wonder and inquiry, but last night was different. Last night, he watched with a vigilance that put me on edge. When Oskar came to spell me at midnight, I didn’t leave. The two of us studied the heavens alongside Behemoth.  Then one of the stars glowed brighter. It glowed so bright, I realized it wasn’t a star. It moved closer; I could see other lights on it. Behemoth stood to his full height, a low rumble sounding deep within his chest. The lights began to flash at him in patterns.  Behemoth’s eyes glowed red, his brows clashed together like thunderclouds, and he fixed that bright light in the sky with his vigilant glare, opened his mouth, and sucked a colossal lungful of air for one of his fog-horn blasts.  This time his cry had no trace of loneliness in it. I wouldn’t even call it a cry. This was a full-throated roar, so loud the farthest stars must have heard it. This was the sound of challenge, the promise of doom to anyone who would threaten our world.  The light flashed white-hot, then streaked across the sky and away from Earth.  “Was that what I think it was?” Oskar asked, warily.  “Yep,” I agreed. “A UFO. I think Behemoth scared it away.”  The creatures aren’t here to destroy us. They’re not even here to rebuke us for our destructive ways. They’re here to defend us.  “The Creature War isn’t over,” I told Oskar. “This is the war that is yet to be fought.”  Oskar settled down for his vigil. “Better tell the others what you saw.”  I climbed back down through the Makeshift Mountains and walked up my street in our remade city, past all the odd shops, new and old, that defined the true character of the Danger Zone, until I arrived home to tend my beasties and compose a letter to the president.  Nine of Emily's novels were published in the U.S. By NAL/Roc, under three pen names. She has also been published in the U.K., Italy, Israel, and China. Her novels are Shade, Larissa, Scorpianne, EggHeads, The Kronos Condition, GodHeads, Broken Time (which was nominated for the Philip K. Dick Award), Belarus, and Enemies. Her new novels, The Night Shifters and Spirits of Glory are in ebook form on Amazon, Smashwords, etc.  Her short stories were published in Asimov's SF Magazine, the Full Spectrum anthology, The Mammoth Book of Kaiju, Uncanny, Cicada, Science Fiction World, Clarkesworld, and Aboriginal SF, whose readers voted her a Boomerang Award.", "text": "7090 words, short story\nPostcards From Monster Island\nSometimes people ask me, “Why didn’t you run?”\n“Because I had the Martian Death Flu,” I tell them.\nThey look at me funny because they’ve seen the footage of people clogging the roads, and the subways and trains, desperate to get out of town the day he waded ashore. I wasn’t in that crowd. I was flat on my back in my studio apartment, blitzed out of my mind with medicine. Two of my cats slept on top of me and my dog was snoring beside us when the whole building began to shake. Some of my books fell off their shelves, and I could hear the dishes clattering in their cupboards. I thought it was an earthquake. I considered dragging myself out of bed and crouching in a doorway.\nThat impulse didn’t make it past the notion stage. I couldn’t even muster the ambition to be worried as more books tumbled off my shelves and the windows rattled. I only managed a little curiosity when I noticed that the shaking was a side effect of slow, ponderous BOOMs, spaced like colossal footsteps. If the Statue of Liberty took a walk through town, she might make noises like that.\nWow, I thought. This is the weirdest fever dream I’ve ever had. And then I fell asleep again.\nAll night long I felt the tremors and heard the sirens. Once I awoke to a sound like ten foghorns going off at once. The cry was challenging, yet—oddly lonesome. That was the only time during the night when I believed something might really be going on. I thought I should at least try to get up. And then I passed out.\nWhen the bombs started to drop, I pried my eyes open and squinted at the window. Morning light was trying to penetrate the dust and debris floating in the air. It wasn’t making much headway.\nAny normal person would have been thinking about evacuating the scene by that point. But the Martian Death Flu, though not actually from Mars, made me feel anything but normal. For one thing, when I sat up, the room started to spin. For another, my pets let me know in no uncertain terms that they were hungry. Plus my dog needed to potty.\nI had to answer my own call of nature first. Halfway to the bathroom, I decided I’d better crawl if I really wanted to get there. Afterward I took more medicine, my head pounding in tune with the bombs going off outside.\nThe war sounded like it might be about a mile away. My apartment shook more than it had during the night, yet everything was still pretty much intact. My pets didn’t like the noise, but they seemed more worried about their stomachs, so I staggered out of the bathroom and fixed their bowls.\nI could barely hold myself upright long enough to do it. Once my dog had eaten, she reminded me that I needed to do something more challenging. I managed to get her collar attached and find the pooper-scooper. Then it was out into the cold, cruel world.\nWe passed one of my neighbors in the hall: Mr. Abé. He operated an African-clothing shop on our street. As the BOOMs and RAT-TAT-TATs shook our building, I lurched back and forth across the hall, and Mr. Abé gracefully sidestepped me.\n“Sorry,” I rasped.\n“I hope you feel better soon, Miss Herrmann,” he said. “Terrible racket, isn’t it?”\n“Yeah,” I managed, before Peachy almost pulled me off my feet. She had her priorities, and she would tolerate no delay.\nUnder the circumstances it was crazy to get into the elevator, but I knew I wouldn’t make it down the stairs. I don’t remember how we got outside from there, but we ended up in the alley behind our building. Peachy did her business cautiously, but not as nervously as I expected she would. She stopped from time to time and perked her ears at the sounds of battle. She sniffed out her favorite spots, and I pooper-scooped. Then she pulled me back toward the alley door, and I took a moment to be grateful she wasn’t going to insist on walkies. The way I was feeling, it would have been more like draggies.\nJust before we got through the door, that foghorn cry sounded again. It was much louder without the walls of our well-constructed building to muffle it. Both Peachy and I were extremely impressed. Instead of loneliness, this time I heard a note of exasperation.\nPeachy trotted through the door and I stumbled after her. I don’t remember how I got rid of the poop I had scooped, but I can only hope I did the right thing with it. I made it back up to our floor and into our little apartment.\nI really wanted to fall into bed. I also wanted to throw up. But I made myself grab my phone, and I also snagged the remote. All four of the cats were on the bed by then, but they made room for me once they realized I was about to fall on them.\nFor several moments I just lay there, the remote and phone still clutched in my hands, my stomach and my head competing for Most Amazingly Wretched Body Part. I waited until I was fairly sure I wasn’t going to throw up, and then I dialed the first of my three jobs.\nThey were part-time jobs, the best I could find with my new bachelor’s degree in library science, and I juggled them to keep myself afloat. Only one of them paid for sick time, so I had planned to dose myself with the medicine and stagger in to work, regardless of how horrible I felt. That plan had wilted in the painful (and extremely filtered) light of day. I speed-dialed the morning job.\nAn operator told me the number was no longer in service. I got the same message for the afternoon job. The number for the evening job didn’t even connect with a recording; it just made horrible noises.\nI gave up on the phone. “Guess what, gang,” I croaked. “I don’t have to go to work—ever again.”\nMy building shook, the dishes rattled, and another book fell off the shelf. I should have been worried, possibly even depressed to lose my livelihood. Yet somehow I felt relieved. I knew it wasn’t a rational reaction, but I couldn’t help it.\nI pointed the remote at the TV and pushed the ON button.\nI didn’t have to surf for a news channel. The story was on all of them. I hadn’t seen that kind of coverage since 9/11 (though I was in the 4th grade at the time, and spent most of my time watching the Cartoon Channel, so maybe I wasn’t an authority on that). Talking heads babbled about the giant creature who had waded ashore, and the bombs that didn’t seem to do anything but annoy it, and the pollution and/or nuclear waste that had probably created it, and the wreckage that used to be our city, and the conference with the president that was supposed to happen any minute (but never did on that night)—and on the bottom of the screen scrolled the words: SCIENTISTS BAFFLED BY BEHEMOTH.\nIt was hard to get a good look at him with all the smoke, fire, tracers, exploding debris, etc. But I could see bits and pieces. He was colossal (apparently they felt behemoth was easier to spell). He sometimes stood on two legs, sometimes on four, and I couldn’t help comparing him to a giant lemur—except that he had a thick tail that he used to bash things.\nAnother not-so-lemur-ish characteristic was his hide. Instead of fur, he had these triangular, rocky scales that seemed impervious to everything they hurled at him. No missiles could penetrate that hide. And some of them were really big missiles.\nThey did no damage to Behemoth. But they did plenty of damage to our city. Just when I thought they would wise up and stop with the bombs, a troops of marines jumped out of an airplane and parachuted onto him. They bounced off too. When they landed, the ones who didn’t get tangled in their parachutes launched grenades at him. He turned and walked away from them, toppling several buildings that had been damaged by the bombs.\n“This just in,” said the reporter, who sounded like he might OD on the excitement. “All troops are being withdrawn. Readings on the geiger counters are spiking. The creature seems to be generating dangerous levels of radiation.”\nThat didn’t sound good. But no one had anything very smart to add, and amazingly, the behemoth story began to suffer from the same problem every other big news story seems to have: endless rehashing of theories and footage, without anything new or intelligent to offer.\nI passed out again while waiting for clarification on the radiation thing. It sounded pretty bad, and it also sounded like a good reason to clear out, assuming I could find a way to wrangle four cats and a dog. And my dizzy, flu-bedeviled ass. To where, I couldn’t imagine. Because no shelter was going to take my pets; I had heard about what happened to the pets in New Orleans after that hurricane.\nMaybe the radiation wouldn’t reach my part of the city . . .\nA few hours later I woke to hear someone on the TV saying that Behemoth wasn’t radioactive all the time, just when a lot of missiles had been fired at him. Like maybe it was a defense mechanism or something. But then they started that old rehash again, and I stopped listening. The only thing that made my ears perk up was a rumor that another giant creature had been spotted over our city, this one in the clouds.\nYes, that was the Cloud Squid. She showed up inside a thunder storm. The rain thrashed us so long, parts of the city flooded. It did clean most of the smoke and debris out of the air, though. You’ve got to look on the bright side.\nThe bright side was pretty easy for me to see. Because thanks to Behemoth, I wouldn’t have to drag my half-dead carcass out of bed and go to work anytime soon. Sadly, it was that simple. I wondered if I might qualify for some kind of hazard pay, or even radiation disability. When I passed out again, I dreamed I was taking selfies of my new, glow-in-the-dark face, and I kept having to do it over because I couldn’t quite seem to capture the pretty colors of my triangular scales.\nWhen I woke up, my neighbor Frida stood looking down at me. “Bernadette—are you still alive?” she wondered.\nThis was an ironic question, considering that Frida, who actually did look like Frida Khalo when she wasn’t in Santa Muerta drag, had painted her face to look like a flowery Dia de los Muertos skull. The effect was quite gorgeous, but it looked as if Death herself had paid me a visit. Death carrying a container of chicken soup. Accompanied by a pet ferret on a leash.\n“Maybe,” I croaked. I sounded even worse than the last time I had tried to communicate, but I felt better. Not great, but there was a definite improvement; my head wasn’t spinning and my stomach had settled. The chicken soup smelled good.\n“Can you sit up?” asked Frida. “I’ll fix you a bowl of this soup and then take Peachy for her walk.”\n“You really are a saint, Miss Muerta.” I pushed myself into a sitting position and watched her putter in the kitchen. Frankenferret sat on the foot of the bed, ignoring and being ignored by the cats while she socialized with Peachy, her best walkies buddy. Frida took Peachy out every day while I was at work, and in return she had a key to my place and unlimited borrowing privileges to my extensive library.\nFrida is an artist who specializes in skeleton/calavera images, though her repertoire is much broader, including murals for businesses and private homes and illustrations for children’s books. She is a successful artist, which in this day and age means that she barely makes a living and has to rent a studio in our odd little building. But she is living La Vida Loca, and her soup is good. She dished up a bowl and put it on a tray, then waited with her hands on her hips until she was sure I could get it down and keep it there.\n“I investigated the water tank on our roof,” she informed me. “I worried there might be gunk in there because of all the smoke and debris from the explosions. You know what I found?”\nI swallowed a spoonful of soup and guessed, “Gunk?”\n“Nope. Pure rainwater. The cleanest water I’ve ever seen. I have a theory about why, but I’m going to do some investigation when I take these rascals on their walk.”\n“Okay.”\nFrida herded Peachy and Frankenferret out the door and I reached for the remote. No bombs were going off, so I thought I’d better turn on the TV and find out where things stood.\nOnce again, the Creature Crisis dominated all stations, but now it was the Cloud Squid they couldn’t get enough of. I watched some very entertaining footage of her evading air force jets and attack helicopters. Every time they fired something at her she darted away, leading them on quite a merry chase. What was not so entertaining was the destruction they caused when their missiles hit what was left of the city. So they weren’t making any more headway against the Cloud Squid than they had against Behemoth. And I learned something else from the news ticker scrolling across the bottom of the TV screen:\nDANGER ZONE HAS BEEN CLOSED . . . NO ONE ALLOWED IN OR OUT DUE TO RADIATION THREAT . . .\nClosed. Yet I still had electricity, cable, water—all the important stuff. This would make life easier, as long as it lasted. Now that the Danger Zone was closed, I couldn’t leave even if I wanted to, so that simplified things. But if they were isolating us, did that mean they might drop a bomb on us? I mean a really big bomb? As in nuclear? Since we were already kind of radioactive sometimes?\nI tried to reassure myself that they would have the common sense to realize the radiation from nuclear bombs would travel, along with dust and debris that would cause a nuclear winter. I tried and tried. And tried.\nI gave that up and surfed the channels on the TV, until I found a story that was unfolding in real time. The Cloud Squid and Behemoth had discovered each other.\n“It looks as though we’re about to see a battle royale between those two monsters.” The reporter was trying to sound worried, but instead he sounded like this would be the coolest thing ever.\nThe Cloud Squid eased herself into the airspace over Behemoth, moving almost shyly. She hovered over him, her limbs opening like the petals of a flower. He gazed up, his mouth open, revealing rows of teeth that looked like stalactites (and stalagmites).\nDamn, I thought. I didn’t want to see them fight. They were both beautiful in their odd ways. But then something amazing happened.\nThe Cloud Squid began to flash with color. I remembered the idea of bioluminescence: cephalopods communicating with each other using light and color. It was a glorious sight. Behemoth seemed to think so too, from the way he gazed at her.\nAnd then another amazing thing happened. Behemoth’s hide began to flash with color too. And why would the giant lemur with the rocky skin have bioluminescence? Beats me (though he did come out of the sea).\nThey flashed colors at each other for maybe twenty minutes. Reporters chattered, baffled by the scene, yet feeling compelled to make inane comments anyway. They were still hoping for a fight, but that wasn’t going to happen. The two creatures stopped flashing colors, and then the Cloud Squid drifted away with her rainstorm. Behemoth sat in the rubble he had been collecting and gazed at the news cameras, and if to say, What do you think of that?\nReporters dutifully started their rehash cycle. After another half hour of that, I turned off the set. I was about to drift off to sleep again when Frida came in with Peachy and Frankenferret.\n“Our branch of the subway line is intact,” said Frida. “And as far as I can tell, so are the cables that provide our internet and electricity. If you were willing to walk, you could get from here to the edge of the Danger Zone, but you’d have to cross some flooded parts up to your chest, maybe even up to your neck.”\n“Are you planning to leave?” I asked.\nShe looked surprised. “No way. They’d have to drag me out of here.”\nI felt happy to hear that. I doubted anyone else would bring me chicken soup. “So—did you see anyone down there?”\n“Nope. Something better.” She pulled her iPad out of her backpack and called up a picture file. “I found another creature.”\nThe picture she showed me was murky. There was very little light in the tunnel, and the water level was high enough to hide a lot of stuff. But right in the middle of it all, a face grinned at me. “It looks like a friendly dog,” I said. “A giant—happy—water dog.”\n“He acts like one, too,” said Frida, calling up more pictures. “You can’t see from these pics, but he’s about the size of a school bus. It’s hard to tell how many legs he has, because the number seems to change—see?” She selected a picture where he seemed to have five limbs, and then another where he might have only three, though in both of them he seemed to have a vaguely tail-shaped appendage. “I call him Mega Whatsis. Sometimes he seems to be solid, but other times he’s kind of gelatinous. Here’s a short video I took on my iPad.”\nMy stomach stirred uneasily at the thought of looking at something that was sometimes kind of gelatinous, but when I watched Mega Whatsis in the video, I saw a creature who moved confidently, even joyously, both in and out of the water. “Cool!”\n“He’s smart,” said Frida. “Watch this next part.”\nFrida’s hand appeared in the bottom edge of the picture. She held a cookie out to Mega Whatsis. His colossal head filled the frame until all I could see was a giant nostril sniffing the cookie. He delicately maneuvered the cookie into his mouth, using his rubbery lips, then pulled back for a moment and contemplated the taste, his happy face shifting into thoughtful lines. After another minute, he produced the cookie intact and nudged it back into Frida’s hand.\n“It was dry,” said Frida. “No creature slobber on it.”\n“Wow. Peachy couldn’t do that.”\nFrida pulled up some more pictures on the laptop. “I expected the water down there to be full of waste and toxins. But it was more like natural creek water.”\nI remembered what she had said about our water tank. “You think Mega Whatsis cleaned our water? Is that what you went down to investigate?”\nShe nodded. “But I don’t think it was him. He likes to stay underground. And his water has mud and silt in it.” She closed the picture files and put her pad back into its case. “I’m not telling anyone about this. If those jerks go down there to shoot bombs at Mega Whatsis, they’ll cut off our supply route. And he’s a big sweetheart, there’s no reason to hurt him.”\nI decided to keep the radiation argument to myself for the time being. After all, I didn’t have a geiger counter.\nFrida undid Peachy’s leash and patted her head. “She’s already gone potty. I’ll see you tomorrow.”\n“Thanks,” I said.\nAfter Frida had left, I surfed the TV stations, looking for evidence that anyone besides Frida knew about Mega Whatsis. I didn’t find any—now they were full of politicians arguing about whether or not any more money ought to be spent trying to kill Behemoth and the Cloud Squid. They couldn’t agree on that any more than they could agree on other stuff, so I drifted off to sleep again.\nSometime later, I approached wakefulness like a swimmer floating toward a bright surface. I couldn’t quite open my eyes, but I felt one of the cats lying across my stomach. I petted it, enjoying the velvety feel of its fur and its plump, warm body. I heard purring, but didn’t feel it vibrating in the body I was stroking.\nAnd the fur felt too short. Way too short. Almost like you would expect the fur of a seal to be. I opened my eyes and saw the fat thing stretched across me. It tapered to a narrow tip that was lazily curling to and fro like a cat’s tail. It widened as it crossed my body and continued off the bed, onto the floor, and out the window, most of which was blocked by its bulk.\nIt was a tentacle.\nTwo things occurred to me then. The first was that you don’t expect a tentacle to be warm and fuzzy. The second was that the Cloud Squid was probably going to drag me through the window and eat me.\nI lay there frozen, waiting for the Squid to make her move. When she ate me, who would take care of Peachy? Who would take care of Sheba, and Buster, and Thugly, and Jingle Monster (four more pets than I had officially declared in my lease agreement)? Would she eat them too? Jingle was grooming the tentacle as if it were another cat. Peachy had rested her head on top of it, and she was snoring again.\nI’m not sure how long I lay there arguing with myself. But it was the Cloud Squid who resolved the situation. She used the tip of her tentacle like a hand and gently moved Peachy’s head onto the bed. Then she patted each of the cats and the dog, and slipped away out the window.\nI stayed frozen for a few more moments, but I couldn’t resist the urge to look out the window to see where she had gone. I poked my head into mild morning air and the clean smell of recent rain. I saw the tentacle slipping back over the top of the roof. But why was she on the roof?\nThe water tank, I thought. She’s the one who put the rainwater in there . . .\nAfter all, she moved around in a rain cloud. Maybe the rainwater was a pleasant side effect to one of her visitations. Whatever the reason, I didn’t feel like I wanted to lie in bed anymore. And I was sick of trying to get information out of the stupid talking-heads TV. Instead, I headed for my computer.\nI logged onto Facebook. I wasn’t surprised to see that rumors about our creatures dominated the feed. What did surprise me was that there were still plenty of posts about politics, religion, status reports of how people’s diets were going, and pictures of funny cats. Once I got used to that, I composed my own status report and posted it.\nTo everyone who lives outside the Danger Zone, I said. Please stop bombing us. Don’t send any more troops. And please don’t let them drop an atomic bomb. Stop attacking, period! You’re doing more damage than good.\nOnce I had posted that, and tweeted an abbreviated version, I got an idea. I logged onto Google Blogger and created a blog called Postcards From Monster Island. It was just a template, but I thought maybe I could get Frida to send me some picture files. As I was plotting and scheming over all this, I realized something.\nI felt better. I could breathe. I wasn’t dizzy. My head didn’t hurt. I was snarf-free. And my stomach was no longer my mortal enemy.\nSo I fed the beasties and took Peachy out for her business. Once we were outside, we even did a little walkies. But our world looked very different now.\nA sort of mountain range had grown between my street and Behemoth’s battle zone. It seemed to consist of a combination of ruined buildings and actual rock. Hardly anyone was on the street, which looked largely untouched by the destruction. The temperature was mild, flowers bloomed in pots and window boxes, cooking smells tempted my starved palate, and most of the odd little shops were open, though there could be very few customers these days. The air still had that freshly washed smell, and breezes blew along the new corridor that had been created by Behemoth’s Makeshift Mountains.\nCall me weird, but I thought it was an improvement. The noise of traffic was gone too, though I would still hear Behemoth moving big things around, with thuds and groans as stuff fell into place. He didn’t trumpet any challenges, but grumbled to himself, as if thinking aloud. Peachy perked her ears, seeming to understand every word. She even replied a few times.\nOnce she felt satisfied in every possible way, we came back inside and walked through the empty halls of our building. I wondered how many residents had evacuated. There weren’t that many of us in the first place, maybe around ten people. Our bottom floor had been converted into shops (or maybe the top floors had been converted into apartments, I wasn’t sure). We saw our super just once a month, though he did a good job with repairs. And he had put up bulletin boards next to the elevators, so I saw the note:\nMEETING AT HOUDINI’S, UNIT 3C, 1:00 P.M. PLEASE COME AND DISCUSS THE CREATURE SITUATION\nThe numbering in our building was as eccentric as the residents, so Apartment 3C was on the 2nd floor. The door stood open—someone had stuck a sign on it with an arrow pointing inside.\nI pushed the door open further and saw Mr. Abé across the room. He waved from a wingback chair, where he nursed a cup of coffee. As I hesitated on the threshold, Houdini poked his tattooed head around the corner from his kitchen. “Come on in,” he said, with the voice of a carney barker.\nHoudini had a magician’s name, but his true passion was the classic sideshow. He honored that tradition with the tattoos that covered him from head to toe, and he split his time between his circus memorabilia shop and a variety of sword-swallowing, fire-eating, knife-juggling gigs. His apartment was dominated by his personal collection, but everything was lovingly displayed, not jumbled together.\nOver his couch hung a giant poster featuring all of the lions and tigers in the Barnum & Bailey Circus. Beneath the leaping cats sat Beetle, whose specialty was mounting insects for collectors and museums, and his partner Poe, who did professional skeleton articulation. Both held plates with orange scones made by Oskar, who perched on one arm of the couch, sipping a cup of mint tea. Oscar owned a bakery, and seeing the scones reminded me that my stomach was back to normal.\nThe gathering was completed by Frida, who fussed at the computer with her occasional boyfriend, Gee, who was a buyer for the Museum of Weird Stuff.\n“So . . . ” I took account of my neighbors. “We’re the ones who stayed. Somehow, that doesn’t surprise me.”\nOskar sipped his tea. “Running seemed like a hysterical reaction,” he said. “Like lemmings jumping off a cliff.”\n“Yes,” agreed Mr. Abé. “I’ve lived through much worse conflicts. And I can tell you from personal experience that refugee camps are not necessarily better than war zones.”\nIf you were wondering why two normal guys like Mr. Abé and Oskar would be friends with a tattooed knife juggler, a skull-faced artist, the Bug Guy, the Skeleton Guy, Mr. Weird Stuff, and Crazy Cat/Library Girl, I can only say that Mr. Abé’s remark about refugee camps might explain why he’s willing to look past the surface and put up with our eccentricities. And as for Oskar, baker par excellence, he’s a very nice fellow with a flaw that was well tolerated in Germany, but is decidedly odd in the U.S. Oskar looks like Uncle Fester from The Addams Family. He smiles like him, too.\nHoudini snagged a chair for me and for himself. “So here’s why I called the meeting.” His tone was so commanding, even Frida and Gee stopped surfing. “For all intents and purposes, we are now in the Danger Zone. We are stuck here, and we’re the ones getting hurt by the bombs and stuff. We have to start telling the outside world what we want.”\n“Won’t they just ignore us?” asked Beetle, around a bit of scone.\n“Maybe not,” I said. “We’re what passes for experts now.”\nMr. Abé raised an eyebrow. “Interesting. How did we pull that off?”\nBut Poe was nodding enthusiastically. “No, we are! I’ve been tweeting about it. I got the president’s office to talk to me—can you believe it?”\n“Good.” Houdini waved a hand at Poe as if he were one of his side show performers, and he wanted everyone to step right up. “Because the biggest problem we’ve got is not the creatures. It’s the idiots in Congress who want to drop an A-bomb on us. The only thing we’ve got going for us is that the president is commander in chief, and he thinks it won’t work.”\n“But what will he think when he finds out we’ve got three creatures now?” I worried.\n“There are more than three,” said Gee. “I think there may be as many as seven in our city alone. So far. Look at the pictures we took.”\nFrida tapped the screen to show us action shots. “They’re all doing stuff, but none of them are attacking people. See? There are people in all of these shots—some of them taking pics like we were doing, so it won’t be long until the outside world finds out.”\n“Ah, but what are the creatures doing, Miss Muerta? That’s what we need to prove.”\nGee pushed a lock of his blue hair out of his face. “All we have is theories about most of them right now—except for Behemoth. Frida thinks he’s an artist.”\nThat remark provoked a conspicuous silence. But Frida was undaunted. “You notice he’s been piling debris up? Well, he’s fusing it together in particular ways. Look . . . ” She found the video she wanted and hit play. We watched Behemoth shove debris into piles, then look at it critically. He rearranged things a bit, then pondered it again. When he felt satisfied, he stretched out on the pile and his underside began to glow.\nWhen he stepped away from it, the result was an oddly pleasing amalgam of cityscape and mountain range. I had never seen anything quite like it.\n“He’s an artist,” said Frida, with the reverence most people reserve for guys like Michelangelo.\n“And I think that’s why radiation levels keep spiking and then falling off. That’s how he’s melting stuff together.”\n“All well and good,” Oskar said. “But that will only make people angry when we tell them. They think Behemoth is a monster, like from the movies. They see that he’s giant, he waded ashore and destroyed the city. We know the military did most of that, but that will leave egg on the faces of the politicians and the generals. They will despise us if we point that out.”\nI heard him, but something that was unfolding on Frida’s screen snared my attention. “Hey—is that footage you guys took?”\n“No,” said Gee. “That’s from YouTube; someone took it with their cell phone the night Behemoth came ashore.”\nBehemoth was walking through the city, away from planes that shot missiles at him. An elevated train line stretched across his path; the train was stranded, and full of people. It looked like Behemoth was going to walk right into them, so people were screaming, trying to climb out windows. Then Behemoth paused, pivoted just as another missile was fired at him, and the bridge started to collapse.\n“Wait a minute,” I said. “Did you see that? Can you go back and play it again?”\nHe replayed the segment, then froze it at the crucial moment.\n“Wow,” said Frida. “Did I just see that?”\nWe watched the segment again.\n“We’ve got to blitz social media with this clip,” said Frida. “I’ve seen the early part of the footage, but they keep cutting out the end. A lot of people probably haven’t seen the whole thing!”\n“And there’s something else we have to do,” I said. “If we want to make them believe that we’re experts, and they should listen to us, we need to work on our bona fides.”\n“But how?” wondered Houdini.\nI pointed to the image on the screen. “We need to make contact with Behemoth.”\nOur trip into the Makeshift Mountains made me wonder if Behemoth and the other creatures were having some positive effect on us after all. It was a challenging climb (though a few parts of Behemoth’s construct still had functioning elevators), yet I was able to troop alongside the others, despite the fact that I had just been very sick. We let Frida and Gee lead the way, since they were the youngest, and since they had also made several forays into those mountains.\nFor over two hours we wormed our way through mountain passages, walked single file along ridges, climbed in and out of shattered windows and across rooftops and balconies. We could hear Behemoth doing his work. We knew we were close.\n“My friends,” Oskar warned, “we hope Behemoth will not hurt us, but what if we’re wrong? What if all those bombs and grenades have taught him to hate us?”\nI didn’t have an answer to that, and by then I realized I wasn’t nearly as scared as I should have been. I just wanted to find Behemoth, I wasn’t even thinking about how we should contact him. But we had to do it if we wanted a future. We were bound together with him, for better or worse.\nWe climbed several rows of steps, some from old structures and some newly formed, until we reached a lookout point. As we made our way around an outcrop on the pinnacle, we came face-to-face with Behemoth. He stood in the valley on the other side of the peak, not more than one hundred yards away from us—a distance he could have crossed in just a few steps. His head was almost level with us.\nThose great, golden eyes rolled in our direction and focused on us.\n“Oops,” I said.\nYet I didn’t turn to run back down the path. None of us did. And it wasn’t just because we couldn’t have gotten away. Those eyes saw us, and we stared back at them, but it wasn’t an exchange between predator and prey. We, the Oddballs of the City, recognized Behemoth, the Oddball of the World.\nWe had seen it in that footage when he bumped into the elevated train. The cars began to topple from the track. Behemoth reached out and grabbed the train as it was going down. Once he had it settled more or less on terra firma, he shielded the people from the missiles until they could get out and flee the scene. One guy with a cell phone had caught that moment, and no one said anything about it. But we saw it. And now we were looking him right in his gigantic eyes.\nBehemoth opened his mouth and emitted that cry we had heard so often in the last few days. There was no mistaking what he meant by it. I think he tempered it for us, it was gentler. It was still full of loneliness. But a new note had entered that symphony. To me, it sounded like hope.\n“What should we do?” wondered Frida.\nWithout discussing it, we all waved at Behemoth. His ears perked. His pupils expanded, as if he were drinking in the sight. He sighed, and settled down to contemplate us further.\nWe sat down and ate the lunch Oskar and Houdini had packed for us, where Behemoth could see us. When we had finished, Oskar said, “I can sit with him for a few hours. You guys go home and rest up.”\n“I’ll spell you after that,” offered Frida.\nAnd so it went. For the next few days, one of us was always where Behemoth could see us. Once we had established that habit with him, more of the creatures began to come into the open. We waved at them. Cloud Squid waved back with all her tentacles. Mega Whatsis grinned and wagged his vaguely tail-shaped appendage.\nBut that’s not all we were doing. We started blitzing social media with our posts and pictures.\n“Stop attacking!” we pleaded. “We’ve reached an accord with the creatures. We can manage them.”\nWhen outraged people demanded to know just where they were going to rebuild the centers of commerce and culture that had once dominated our city, we pointed out that it would be a hundred times more expensive to rebuild that stuff than it would be to build new centers of commerce somewhere else. In response, we got a lot of flack from trolls. “Do the math!” we pleaded.\nJust when we thought no one was listening, the trolling stopped. And the talking heads on TV stopped speculating whether more marines were going to jump out of planes so they could bounce off Behemoth’s teflon hide. Instead, the government started to drop emergency supplies for us along the Neutral Zone. And that’s when I got an email from the president.\nWe’ll make sure you have electricity and water, he promised. We’ll keep the food and medicine coming, too. Your debts have been settled, and you won’t be paying rent anymore. In return, all that we ask is that you keep managing the creatures. Keep them peaceful. Can you do that?\nYes, I replied, though I felt a little guilty about claiming credit for what seemed more like good luck.\nOn the other hand, it might be something more than that. It might be the fact that even when the city seemed to be coming down around us, we didn’t want to leave. The more people outside lost hope, the more we gained it. They wanted to throw bombs at Behemoth, we wanted to sit down and have lunch with him. That counted for something.\nSo—you remember that footage of all the people pouring out of the city the day Behemoth came ashore? Now a lot of people want to come back. Not to live—to see the creatures. So we started Danger Zone Tours. We take selected visitors to multiple stops, including the shops of Mr. Abé, Houdini, and Gee, to Oskar’s bakery and Frida’s gallery, Beetle’s exhibit and Poe’s museum, and to lots of other odd places that have sprung up. We’ve all got some extra cash on the side now.\nWe take them to see the creatures, too. Ten of them have come out into the open, so far. Mega Whatsis is the usual favorite (though he still doesn’t like cookies).\nThe last stop on the tour is a spot where people can see Behemoth. When he looks our way, we all wave. People love that. It’s the kind of reverence you would expect to see for whales breaking the surface next to a Greenpeace boat. When our visitors leave us, they talk about how glad they are the creatures showed up to teach us the error of our ways, that we were poisoning our world.\nI agree that Nature has a reason for everything it does. If people who live outside of Monster Island think the creatures appeared because we abused the Earth, I won’t try to tell them otherwise. Maybe they’ll behave more responsibly. But I think there’s another reason.\nLast night, I went to sit with Behemoth, and the two of us gazed at the stars. We’ve done that a lot, lately. Now that the Danger Zone is dark at night, we can see the Milky Way. Behemoth usually ponders the sky with a combination of wonder and inquiry, but last night was different. Last night, he watched with a vigilance that put me on edge. When Oskar came to spell me at midnight, I didn’t leave. The two of us studied the heavens alongside Behemoth.\nThen one of the stars glowed brighter. It glowed so bright, I realized it wasn’t a star. It moved closer; I could see other lights on it. Behemoth stood to his full height, a low rumble sounding deep within his chest. The lights began to flash at him in patterns.\nBehemoth’s eyes glowed red, his brows clashed together like thunderclouds, and he fixed that bright light in the sky with his vigilant glare, opened his mouth, and sucked a colossal lungful of air for one of his fog-horn blasts.\nThis time his cry had no trace of loneliness in it. I wouldn’t even call it a cry. This was a full-throated roar, so loud the farthest stars must have heard it. This was the sound of challenge, the promise of doom to anyone who would threaten our world.\nThe light flashed white-hot, then streaked across the sky and away from Earth.\n“Was that what I think it was?” Oskar asked, warily.\n“Yep,” I agreed. “A UFO. I think Behemoth scared it away.”\nThe creatures aren’t here to destroy us. They’re not even here to rebuke us for our destructive ways. They’re here to defend us.\n“The Creature War isn’t over,” I told Oskar. “This is the war that is yet to be fought.”\nOskar settled down for his vigil. “Better tell the others what you saw.”\nI climbed back down through the Makeshift Mountains and walked up my street in our remade city, past all the odd shops, new and old, that defined the true character of the Danger Zone, until I arrived home to tend my beasties and compose a letter to the president.\nNine of Emily's novels were published in the U.S. By NAL/Roc, under three pen names. She has also been published in the U.K., Italy, Israel, and China. Her novels are Shade, Larissa, Scorpianne, EggHeads, The Kronos Condition, GodHeads, Broken Time (which was nominated for the Philip K. Dick Award), Belarus, and Enemies. Her new novels, The Night Shifters and Spirits of Glory are in ebook form on Amazon, Smashwords, etc.\nHer short stories were published in Asimov's SF Magazine, the Full Spectrum anthology, The Mammoth Book of Kaiju, Uncanny, Cicada, Science Fiction World, Clarkesworld, and Aboriginal SF, whose readers voted her a Boomerang Award.", "source": "https://clarkesworldmagazine.com/devenport_04_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Postcards From Monster Island by Emily Devenport"}