{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Priya Chand", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VCCcdfnlb5iy5gE1BDPiR57wc0M=", "id": null, "license": null, "comments": "", "raw_text": "6370 words, short story  It Takes a Village  A generation of traumatized fathers was raising a generation of children with trauma in their bones.  We bobbed on Velcro tethers, children clutched against our chests, faces pale in the filtered sunlight reflecting off the planet below. Our gravitational generator always shut off first. Next were the ship’s main systems, everything except emergency life support. We’d learned to conserve our air as it recharged, enough to allow a single person to tell a story. The story.  Necessity. If our children were to survive, they had to understand. We took turns, but the words were always the same.  I waited until the ship’s hum faded, leaving only the sound of our deliberate, slow breathing.  “Three years ago,” I said softly, “we did something bad. We didn’t listen to the AI. We thought we didn’t need it anymore, because we were close to landing. But that was wrong. You can’t stop being careful, ever.” All of us held our children tighter, taking comfort before the horror ahead.  “We hit a rock.” My voice dropped to a whisper. “Our friends were . . . taken.” And so was the playground I’d hoped to show Callo around, and the radiation net that’d powered our AI separately from the main engine, forcing this daily shutdown so it could recharge. “When we found out what happened, we went back. We said sorry. It was too late to save our friends, but the AI told us what to do next.  “We should have listened from the beginning. It’s okay to ask questions.” My heart beat faster. I ignored it. “But you can’t say no to the AI. You can’t put your hands over your ears and pretend you didn’t hear.  “First, the AI told us to make you, because this ship needs people. And then”—my chin lifted toward the massive window—“it sent the mothers to the planet. They’re down there right now, making food and houses for us.” Our distance comms, built centuries after our ancestors left Earth, couldn’t penetrate the planet’s atmosphere. For all we knew, the mothers were dead, or thought we were dead.  “One day,” I said, ears thumping, “we’ll join them. It’ll be just like living inside a holo.” The holochamber was gone. We’d need a better metaphor . . . or we could finally leave this damn ship. We’d stabilized what we could, but what remained of it wouldn’t survive a second collision. It was time to go.  A sigh, then a hum. We repositioned our feet, adjusted the children, and landed gently as the gravity returned.  Thakur and I headed to our shared compartment, his pace slowed by twins. Because they were two, they were on part-rations. Once a week I offered to get Thakur a little extra from Hydroponics, but he always said no. He was right, that was what the AI had allotted him.  But he’d never asked for more.  “Thakur,” I said after we’d tucked the children in and were nestling on the couch.  “Mmm?” Thakur pressed closer to my chest.  “We should get out of here.”  Thakur pushed back and stared into my face. “Did you hear a rumor, Servain? Is something wrong with the ship?”  “No, listen.” I touched his arm. “Catastrophic systems failures—you know they’re a thing.” Until the accident I’d been an engineer, like Thakur. “And we’re orbiting a planet. We don’t know what could happen.” My hand drifted down his body. “I reserved a slot for tomorrow, so we can ask the AI. We’ll do whatever it says, I promise.”  Thakur relaxed. “Alright. Tomorrow.”  We had sex and then went to our separate rooms.  After breakfast in the kitchen, a careful dance that fit our trays and elbows into the limited space, Thakur and I led the way to the AI’s room, children cradled in our arms. Other families filed in behind us, wanting to hear the answer to a question none of them dared ask. Cowards. Sensible, but cowards.  The AI’s question-box was in a small room on its own mooring, a clear bubble that was nearly invisible under the overhead LEDs. I activated its listening mode. “Engaged,” it said. “Ask your question.”  I spoke more slowly than necessary, chewing the words. “Can we go to the planetary settlement?”  The bubble clouded up, processing, its neural net finding connections between ship and old Earth data alike.  It would be a long time before I realized the unintended loophole in my question. Can, not should. The roboticist-historians would’ve never let me use such imprecise phrasing, but they’d been in the library when the implosion happened, and we didn’t have a library anymore.  Patterns drifted across the AI’s bubble.  I remembered going to temple for the first time, babbling with my friends to quell our fear—what if the gods punished us for the time we’d helped Dalia sneak into the ventilation? We’d been in the holochamber on countless occasions, but never like this, lost among intricately carved white pillars that stretched into a distant sky. We’d squirmed out of our parents’ laps, ignoring their attempts to hush us.  Now was nothing like then, holding our own children, waiting on our shared fate. Our tongues were heavy, frozen. The erratic sounds of our breath filled the air, a jagged orchestra.  And most of my friends were gone.  The AI’s bubble cleared. “Yes.”  We got to work. Thakur sealed pipes while I helped wind down Hydroponics, harvesting all we could take without crashing the population, in case we needed to return. By the time I finished, plants carefully bagged, Navigation had prepared the shuttles. I strapped in next to Thakur. We held our children tightly, aided by a jury-rigged mess of extra belts and buckles.  We landed after sunset, so our first glimpse of the planet was splotches of native vegetation in vivid green, illuminated by pools of sparse lighting, the settlement’s low buildings caught in shadow. The old navigation data was right. But had the mothers survived?  There was my answer, running toward me. Aparla, who wrapped me in a hug. “Servain! It’s about damn time.”  “Careful,” I said, lifting Callo free.  Aparla blinked. “You brought Callo with you?”  Warmth first, that she remembered the name of my child. And then ice, depositing quickly. “You really think I’d leave Callo up there?”  Aparla shrugged and turned to Thakur. “I see you brought yours as well. Twins, huh?”  Thakur grinned. “I couldn’t decide!” They laughed as groups split off around us, fathers holding up their children for mothers to coo over.  “Thakur, do you want to join us on a tour?” Aparla smiled at me. “Servain, you don’t get to say no.”  Thakur said, “I think I’d like a rest. I’m a bit tired from carrying these two all day.” He dropped his arms to demonstrate, gently so the children wouldn’t be jostled.  “Ah, you’ll want the medical compound, over there. It’s fully stocked. Not to jinx it, but things have been pretty calm. Here, join Ghalis’ group.” Aparla waved Thakur toward a gaggle of other fathers. I wondered why there weren’t already rooms for us. Maybe the mothers had dismantled them as the silence grew longer.  Aparla turned back to me. “Anyway, Servain,” she said, “let me show you what I’ve been up to. The lab’s this way.”  I resettled Callo and followed her to a building twenty meters down. The metal was dull, durable, and lightweight, unmarked despite its millennia-long journey from Earth. I wondered how this planet felt about being invaded by such alien substances, but there was no one to say. We wouldn’t have landed on a planet with sentients—bad enough what we might do to this one.  Aparla opened the door for me. No scans, no locks, just like above. Cradling Callo tighter, I stepped through.  Aparla’s workspace resembled the ship’s hydroponics lab—no surprise, it was her specialty—but take the bench where we did samples analysis and stretch it out to occupy one side of a vast room, the kind of space I could barely imagine these days. At the far end was her desk, covered in scattered holos. Instead of gesturing me over to see, Aparla pointed to a chair on the other side.  “The plants have been doing well, so I’ve been playing amateur psychologist in my free time.” She blushed, slight tinge on her face, darkened by real sunlight. “Would you mind taking this assessment for me? While you’re still fresh off the ship, so to speak.”  “Alright.” I shifted Callo into her arms. Before I could tell Aparla to be careful with Callo, she’d wriggled one hand free and brought up the test.  “No need to rush,” she said. “I’ll be back soon. Gotta make sure we’re set for dinner.”  I pulled the computer toward me. My body felt light without Callo’s weight. Of course, we had slings, but it felt better to hold our children close. I hoped they drew as much comfort from us as we did them.  The assessment was nothing like I expected. It was basic visual recognition: shapes, colors, and then more complex structures, people and plants and ship components. Maybe I was missing the point. I did my best to answer everything accurately and hit send.  I wasn’t waiting long before Aparla came back in and handed Callo back to me, then pulled out a chair and sat closer than I expected, her eyes locked on me as I fussed over Callo. She said, “There’s nothing wrong with any of your visual processing that we’re seeing . . . ”  “Why would there be?” We’d spent three years restoring a half-shattered ship. I was insulted.  “I’m sorry,” Aparla said, shaking her head. “But you know you’ve been carrying around a frozen embryo, right?”  I hugged Callo’s ovoid, a hermetically sealed container full of clever tech that kept it at the same temperature as liquid nitrogen. “So?”  “So? Servain, you—none of you—had to bring them here. They’re frozen embryos! The comms aren’t working, for all you knew we were dead, killed by something down here! They would’ve been safer on the ship.”  “No,” I said, head shaking, holding Callo tighter. “The AI said we had to take care of the children. We’re the fathers.”  “And we’re the ‘mothers’?” Disdain seethed on her tongue. “Good Earth, Servain! That AI twisted some old-style naming convention and you’ve been going with it? Did you also forget you used to be my wife?”  I blinked. In those early lonely days after the mothers left, there hadn’t been time to dwell on the relationships we’d broken in case we never crossed paths again. It had been one frantic scramble after another, but we’d made it, under the AI’s aegis.  When I didn’t respond, Aparla tried a smile, weak as hydroponic tea. “I’m sure a lot has happened. Let’s join the others, dinner’s up.”  I picked up Callo, this time using the sling that dangled from my shoulder, as essential to my wardrobe as pants, and followed. Aparla glanced at Callo but said nothing.  As we approached the dining area, I drifted around, trying to see if I could go in. Aparla caught my arm. “There’s none of that here, Servain. No more eating in shifts. The dining hall’s big enough for all of us.”  Planets were incredible. I followed Aparla inside. The mothers were spread out, trays organically scattered. I hadn’t seen such a lack of economy in over three years.  “We aren’t producing at capacity yet,” the mother who slopped food onto my plate said. “Now that you’re here, we can start ramping up, but in the meantime, it’s a good thing we have your plants.”  “Thanks,” I said. The AI had told us to bring the plants. She should have thanked it. I would’ve said something, if I wasn’t distracted by the steam rising from my dish. The spices were the same, but fully heated food—I’d missed that.  Aparla and I—and Thakur, once he saw us—sat cross-legged around one of the small tables. Thakur had the twins in their sling as well. I heard more background chatter than I’d heard in ages, all from the mothers. It felt unnatural, not only because they changed topics every time we brought up our children. Where we’d embraced silence, the mothers had tried to fill this unimaginably massive world with noise.  We finished eating and dropped our plates into the recycler. Almost by reflex, Thakur and I huddled with the other fathers. We didn’t know where to go so we stayed clustered, releasing the children from their slings and into our arms. The mothers were watching us, their collective gaze undiluted by their spread across the dining hall.  “We’ll show you where to sleep,” someone said at last, and we shuffled out gratefully behind her, children nestled against us.  Thakur and I looked at each other. “Do we want to share a dorm?” he said.  Our relationship was mostly the warmth of our bodies against each other, comfort and release. The last conversation we’d had on the ship was the most we’d spoken in months.  “Sure,” I said. “It’s worth a try.”  We took a larger room with a double bed. We put the children on the hammocks the mothers had provided, somewhat ungraciously I thought. These were their kids too.  “Aren’t they being weird about the children?” I asked Thakur.  “They’ve been working their butts off on an actual planet,” Thakur said. “Imagine how mind melting that is? Tomorrow we’re going to see a completely open sky. I’d give them a break for now, Servain.”  I went to bed thinking about what it would’ve been like to do everything we had to do to repair the ship, forcing our bodies through a haze of nightmares and the constant aching fear of another mistake, but on land.  We couldn’t sit idly, especially not now the settlement needed expansion. I had the sense the mothers would let us do anything, especially if it distracted us from watching our children.  Tucked in bed next to Thakur for the first time ever, I said, “Will you stay with Waterworks?” Dew collection, irrigation, plumbing—there were so many more choices on a planet.  Thakur’s arm drifted along my back. “That’s not what the AI said I was good at, Servain. I’m going back to Circuits.”  “Oh,” I said. Was I the only one who liked my new role more, no matter where the AI had originally placed me? I shifted away from him and pulled Callo toward me until the ceramic warmed to match the heat of my own body.  All of the original hydroponicists were mothers: the AI had spared no one, planetary sustenance being too critical and more unpredictable than our little ship farm. So I was the only father who joined them, under Aparla’s supervision.  Over the past couple of days, I’d mostly seen the inside of the settlement, all those rooms and buildings stretched out past my imaginings, but this—this was new. Thakur was right, the mothers must’ve been terrified. The holochamber hadn’t captured it. I couldn’t describe it. I’d looked out the ship’s windows thousands of times, but space is mostly empty. This was all substance, grass and soil and rocks and a horizon that ended. There was something unsettling about that middle distance, terrain shrouded in blue haze—out of reach, but reachable, nothing like stars stretching into infinity.  Of course the mothers were comfortable with it now, and assigned me to the field nearest to our settlement, which was also where the Earth plants were, familiar and small. What I’d seen of the native vegetation was leafier and with fluffy lightweight seeds, thanks to the respective absence of predators and pollinators. Otherwise, the underlying biology was familiar. Left-handed amino acids and right-handed sugars, photosynthesis by day and respiration or its carbon fixing alternatives by night. Our bodies couldn’t digest alien botany, nor would our plants thrive in truly alien soil, torn from the bacterial and fungal networks they needed for sustenance. Mars had been a mistake, one that propelled our ancestors onto the ship, generation after generation not knowing if they’d ever find a place for their descendants to thrive.  And now we were here.  “The vertigo was bad when I first landed,” Venkat said to me, reaching past Callo’s sling to pat my elbow. “Don’t try to ride it out, just go inside. It’s like agoraphobia, sort of.”  “Thanks.” I watched her retreat into the distance, quick short strides, turning away before the horizon caught me again. This place was so big we’d need transportation by the time the children were grown. Even that thought dizzied me. I lay down on the earth, pressing my cheek against cool soil, eyes closed. It smelled richer than I’d imagined, although I couldn’t untangle the scents yet.  Once I felt steadier, I got to work, checking each plant for disease with my scanner, making sure everything was healthy. My back sweated where Callo pressed against it. I wondered if it would be alright to put Callo down. But this planet could still be full of unwelcome surprises and caring for our children was paramount.  “How’s the soil?”  I started. There hadn’t been any sound of footsteps—no metal floors. “Aparla, hi.” I caught my breath. “I haven’t started scanning it yet.”  She smiled. “Doing the plants first, huh? Efficient. We should’ve got engineers to help us way sooner.” Her hand landed on mine, warm and callused. Something stirred in the back of my brain. I put my other hand on top of hers.  “You still . . . ” She trailed off. “You’re with Thakur, aren’t you?”  “We bonded on the ship. We’re giving the planet a try. I don’t think you mothers understand.” Remembering what Thakur said last night, I added, “Sorry.”  Aparla snorted. “You’re apologizing for the wrong thing. Don’t you remember why the AI calls us ‘mothers’?”  “Because you are,” I said. Which was my way of admitting I didn’t.  “Because it thinks mothers are ‘homemakers.’” The disdain was even stronger this time. “No other reason. That’s not even what those terms meant on Earth, not by the twenty-second century.”  “So what?”  “So—I, we, we’re worried. You all don’t seem to care that the AI has flaws, its specialty is computation, not . . . I don’t know, building a whole society. We used to make fun of it, and now you’re treating it like gospel. And now—how are you keeping it powered, Servain?”  Before the accident, we hadn’t taken the AI as seriously. It sometimes gave us answers that didn’t make sense—which, I now realized, might be because of their planetary relevance. What if almonds really did heal one’s emotional balance? What were almonds, anyway? Aparla and I had laughed over the advice, given in response to a series of panic attacks that had spread across the ship following the loss of one of our candidate planets.  I was sure she remembered the laughter, but not the context. Without seeing the AI in action, I didn’t know how I could convince her otherwise. How could she, distracted by the smell of real soil and this wide-open sky, understand what it was like during those daily blackouts, the drifting and the silence?  “I don’t know what to tell you,” I said.  “Alright. I’ve got to get back to work.” She stretched, careful not to look at Callo. “Don’t be out here too long without a break. Your UV shield isn’t perfect. You’re on a planet now, all kinds of things can happen in the open air, especially when you’re new. Lakka got heatstroke, it’s unpleasant and takes a long time to go away completely.”  I finished up, guzzling the water someone brought me but never putting Callo down, no. The mothers were so coordinated, trading information and talking among themselves. None of us were like that. Thakur and I didn’t even try to cross paths during the day.  But here, with the mothers pressing in on us, we began talking more.  One day after dinner, we crammed into the double room Thakur and I shared, children nestled more comfortably now that the mothers weren’t staring at us. The room was warm and filled with the sound of breathing. A flash of memory, hundreds of memories, but all the same: I missed our daily sessions on the bridge.  “They’re mocking us,” Daneel said in the soft tones of our oratory. He smacked his fist into his palm. “They aren’t taking the AI seriously at all. I asked about bringing it down here, and they laughed.”  We all shivered or clutched our children for comfort.  “We’ve only been here a few weeks,” Thakur said. “We should talk to them. They’ve forgotten the accident”—a pause, an inhalation—“they’ve spent too much time planetside, they’re losing their instincts for survival. They think the AI is amusing because they haven’t run into any major problems yet.”  We drew our children close. There would be problems. There were always problems, and the best way to avoid them was to listen to the AI.  “We have to help them remember.”  I took lunch with the mothers when we came back from the fields. We called it Hydroponics out of habit, although of course it wasn’t.  “Dirt-ponics?” I laughed. The others laughed with me. It was like reliving my childhood.  Ichiro said, still laughing, “‘Farming,’ I think. It’s been a long time since I saw the vids, they’re still on the ship, aren’t they?”  “Yeah.” I saw my opportunity. “We watch—watched—a new one every Friday. The AI does a great job selecting ones that are right for the moment.”  “I remember it was good at that kind of thing, as long as you didn’t mind getting some very odd half-notions from Earth,” Halva said. She and the other mothers traded grins. To avoid looking stuffy, I smiled.  But as I spent more time outside, and watched my skin turn from dust to soil, contributing to a fully organic ecosystem for the first time in my life, I felt myself expand past the constraints of my old life. My whole being yearned for the sky. I wanted to explore, even, yes, stand atop one of the hazy blue mountains. I wondered how you could grow up on a planet and then live out the rest of your life in a metal box that, at any second, could—  I’d overreached. The horizon blared in my mind’s eye. I dropped to my knees. Shivering, I turned Callo’s sling around my body and lifted Callo out, running my hands across the ceramic like I always did for comfort. Nothing. I wrapped my arms around Callo, trembling, trembling harder, and eventually the tears rolled out of me, hideous wet sobs. I hadn’t cried like this, even as a child. I’d always been surrounded by people. Half of them were dead. Callo wasn’t a person, not even close—might never be a person—  I released Callo and put my dirt-coated hands over my face, letting the earthy scents wash over me. The soil was warm from the sunlight, moist against my knees. I lay back down to let it caress me, wishing it were the touch of a person. But it was still more alive than the ceramic shell inside which Callo lay frozen.  What was I doing? What were any of us fathers doing?  Sudden coolness—something was interfering with the sunlight. Aparla was standing over me, I recognized her concerned huff. “Are you okay?” she said.  I rubbed my eyes, using the heels of my palms to blot out the tear tracks as if she wouldn’t notice. “Yeah,” I said. “The sky got to me. Not as acclimated as I’d like.” I managed a weak giggle.  “I’m sending you back, Servain. Rest.”  I thought about arguing, but I hadn’t been entirely dishonest. I could use the comfort of four walls and a ceiling right now. “Thanks.” Looking around as little as possible, I retreated back into my shared room and put Callo on the table by my bedside and closed my eyes.  Thakur opening the door woke me up. “Oh, sorry, I didn’t realize—why is Callo on the table?” His tone shifted from warm to colder than the inside of Callo’s container.  I sat up. I’ve never been one of those people who needs time or stimulants to return to full functionality. “I—I was tired. Aparla and I were—”  “You left your child unprotected because of a mother?”  “Not unprotected—”  “Callo could fall from here. And then what?”  The containers had flat, gecko-like bases for that exact reason. “Nothing happened, Thakur. Can you please calm down? You’re nearly shouting. Someone’s gonna think there’s an emergency.”  “Calm”—Thakur took a steadying breath. “I can’t believe who you’ve become here, Servain. You remember what we learned from the AI. Our children come first.” He steadied the sling across his chest, nudging the ovoid so it bumped his ribs. I saw the wince.  For the first time I saw the “children” through the mothers’ eyes. The container was just that, a container. There was no reason to drag the contents from place to place. We were inconveniencing ourselves for—what, exactly? The most rigid possible interpretation of the AI’s directive to ensure humanity had a future?  I got up. “This is who I was, Thakur. It’s just, with the emergency . . . ” We hadn’t given ourselves any space to think, to reconsider what we were doing. We told ourselves we could ask questions. Could, not should. Even though we’d grown up knowing the AI was far from omnipotent, we sought comfort in its algorithms.  Thakur and I looked at each other for a long time. Then I packed up my belongings.  “Are you sure you don’t want the double bed?” he said.  Once, when I was young, our main water recycler broke, and we couldn’t shower until the repairs were completed. The first time I stood under the jets I felt a layer of dead skin slough off my body. How strange, to realize I’d come to accept that dry, itchy sensation of my skin being too small as simply the way things were.  I looked at Thakur, pulling the container to his chest, seeking comfort in its presence as if it had any to give, and smiled gently. “You have the twins. You’ll need it more than I do.”  The alarms went off early, so bleary-eyed we all rushed to the medical complex. It was a specially reinforced set of buildings, infirmary and storage and meeting space. We entered the latter, dispersing among the few scattered chairs that weren’t folded up. I wondered if the protocol for emergencies had come from the AI or simply been obvious.  Out of habit, I joined the fathers on the side opposite the mothers, Callo nudging my back. Most of them had their slings turned to the front. My hands shifted, but the container was more comfortable where it was, and—we were planetside now.  Thakur’s gaze raked my chest and then shifted away, which let the others know we’d broken up. Before anyone could ask what happened, there was a sudden push to make space for the lead mother, if you could call her that, and two security officers, at the front of the room. Aina, Trevor, and Vitri. Even as Aina’s eyes raked the room, the mothers were murmuring among themselves, Aparla included, speculating.  Aina quieted the mothers with a wave of her hand, waiting until they’d finished shushing each other to speak. Her voice echoed off the walls. “There’s been a small disruption to one of the power generators. No concerns yet, we’ve got enough stored energy for the next sixty hours. We’re going to stay here while Nabin and Dastana identify the issue. Are there any engineers from the ship who would like to join them? I do have to warn you, there’s a fire risk.”  No one stepped forward. I shifted Callo to my front, and although I knew the calm was really from the bodies near me, I stroked the container like the other fathers were doing. Power disruption. Fire risk. How could she say those things so casually? Sweat ran down Thakur’s face.  I remembered wiping Aparla’s brow when we’d been married. Those little intimacies had never existed between Thakur and me.  Aina’s eyes raked our containers and then returned to our faces. “We do want to get you all involved here, and the emergency’s a good way to understand these weather-based power generators. The underlying mechanisms are pretty different from shipside. Any takers?”  I was a hydroponics specialist now. I mean, a farmer. Either way, not an engineer anymore. If I was honest with myself, it was more of a relief than being away from the ship, no matter that it wasn’t necessarily the best use of my skills. The AI made me an engineer because of my relative talents in math, but I’d always preferred the smell of green things.  But knowledge was a good thing.  But there was nothing that compelled me to go, and we were back with the mothers. Let someone else be responsible for the electronics. I’d rather be responsible for the growing.  Dalia stepped forward. “I’ll go,” he said. There was an eagerness in him I didn’t think I’d seen in years. He slipped the sling off his shoulder, handing it and the container wrapped inside to the nearest mother.  As Dalia followed Trevor out the door, the fathers kept their eyes on Dalia’s container.  Dalia and I still joined the fathers for our conversations, crammed into one of the spare rooms, sharing air and warmth. I was a few seats down from Thakur, trying to remember how I held Callo’s container when I thought of it as Callo.  After the incident—resolved within the hour, some casing had cracked despite the material’s much-vaunted weather tolerance—no one had asked for details of our breakup. They were too aghast at Dalia. He was seated slightly outside the circle. There was something different about the way he held his body, but I couldn’t figure what. The fathers all had their eyes on him.  I couldn’t scrub the image from my own head, the . . . freedom as Dalia went off to risk his life for knowledge.  “What were you thinking?” Xiu Ying said to Dalia, finally breaking the silence.  Dalia’s mouth twisted. “You heard her. It’s not like we can just take apart a working generator when we feel like it. This was a rare opportunity to understand the mechanism.”  “You could have died.” That was the cue to, of course, cling to our containers, hands skating across the ceramic like window washers.  “We were near death all the time on the ship,” Dalia retorted, waving his arms, joggling his shirt. That was when it registered: no carrier, no container. I pushed unkind thoughts about Callo’s weight on my lap to the back of my mind.  “Not like this,” Leluye said, stepping in where Xiu Ying was sputtering. “The AI could have assessed the situation without you all needing to risk yourselves.” To this, Dalia shrugged—he and Leluye were on the same shift, Leluye wasn’t blithering. “But the mothers refuse to entertain the adjustments needed to bring it here. So—we risk ourselves planetside when something goes wrong, and it could be an even bigger accident”—we all shuddered. We couldn’t help it. I suddenly saw ritual in the way we reached for our containers, no different from the prayers some of us said nightly.  The silence continued until Dalia interjected, voice trembling as it hadn’t earlier. “Which isn’t—”  “Which the AI could help us with,” Leluye said, cutting him off. “It was built on a planet. It’s got all kinds of knowledge we don’t understand.” The other fathers nodded forceful assent, chins thrusted. Dalia subsided back into his seat.  Was Leluye right?  I myself had agreed with his sentiment not too long ago. But the mothers remembered growing up with the AI, and they’d been here for three years, and they had no such feelings. With the amount of times we’d all brought up the AI, they would’ve said something if they’d had any sudden insights about its relevance.  Before I could bring that up, Xiu Ying said, “We should leave.” More understated than he’d been on the bridge, but not a whisper.  At last Leluye responded, equally quiet, “How?”  “The shuttles are all on the landing pad. The mothers know we left supplies aboard the ship. We won’t tell them we’re not coming back.” Xiu Ying pulled his chair closer to the center, so the LED caught his soft features and dipped them in shadow.  “This planet is too damn unpredictable. Let’s do it,” Thakur said, hands passing over his twins’ container.  I snuck a glance at Dalia right as he glanced back at me, and while he didn’t look defeated—and I didn’t think I did, either—we were both exhausted. If we said anything, they’d mention the accident, and our brains weren’t ready to push that aside long enough to point out all the problems with going back to a creaking half-corpse of a ship.  “Let’s do it,” Xiu Ying whispered. The fathers murmured assent.  Was it really that simple?  When they went to the mothers and told them it was time to go back, complete the ship’s transformation into salvage—when the mothers asked if some of them should go and the fathers said no, the ship’s changed a lot since the implosion, you won’t know where anything is, it’ll waste time—when I said nothing, because I couldn’t betray the fathers, even though I knew I wasn’t a father anymore, and hadn’t been for a while . . .  Yes. It was.  For old times’ sake, I decided to talk to Thakur after dinner, alone in my room. Callo rested on the hammock the mothers had constructed—a waste of resources, I couldn’t help thinking, with the part of my brain that had blossomed under the light of an actual sun. But at least it would be enough to avoid distracting Thakur with my “carelessness.”  “What is it, Servain?” he said, taking a seat on the chair across from me. His container bulged over his belly.  “I just wanted to—are you really doing this? The engines could fail, or the hull could lose . . . It’s not safe up there,” I blurted, because if I stopped and thought, I’d return to the accident again.  “It’s not safe down here, either,” Thakur said.  He wasn’t exactly wrong. The alarm was the one real emergency we had, but there’d been a few near misses with twisted ankles, a case of pneumonia after a rainstorm—yes, it really can fall from the sky. Unpredictable, but expected planetary behavior. I focused on the latter. To Thakur, it was the former that terrified. The dangers were known, if sometimes inescapable, on a ship.  And I could see his hands trembling, far cry from the boldness that had drawn me to him in those early days—the only one who insisted on keeping both fertilized embryos!—he wouldn’t let himself heal. I wasn’t yet capable of helping anyone else, and he’d run screaming from the mothers.  “Never mind,” I said. “It was good seeing you.”  Thakur nodded, hands seeking comfort from his ceramic-alloy hemisphere. “Goodbye, Servain.”  Eventually he’d activate the twins’ container, him and the other fathers. I had to hope the AI would tell them to come back down here, sooner rather than later, as the ship slowly deteriorated, along with their sense of independence.  Our ancestors had left Earth seeking a new planet. To come so close, and then to leave it—I thought about the months we had spent together, holding each other. I wished we had worked more on easing instead of sharing our trauma, but I doubted I’d even have been capable of that thought on the ship. I’d entrusted my brain to repetition and our rigid interpretation of the AI’s directives. Ship-minded, small, crushed into half the space we should have had.  The next day the fathers were gone.  I was in the medical sector, finding a good place to put Callo’s container until it was ready for activation. As I left the storage area—even if Callo wasn’t a person yet, putting the container next to rolls of bandages and EpiPens seemed a little much—I went back to the infirmary, where I ran into Dalia, receiving treatment for a nasty forearm gash, grit visibly embedded in the torn skin. I couldn’t help looking: no container in sight.  Dalia said wryly, “I wanted a good view of the departing shuttles. I didn’t realize there’d be so much wind on a planet.”  “What’d you do with your child?” I asked him.  He shrugged. “I let Leluye take the container. He wanted two, but he didn’t have the nerve.”  “Oh,” I said. I looked down at Callo’s container.  “I never wanted children,” Dalia said, catching my gaze. “You know how it was when everything first happened, though—I couldn’t think of saying no.” He shivered as the medbot smeared gel across his cleaned wound. “I had to send Yi—it back. I think I had to, otherwise I couldn’t move on.” He shook his head.  None of us were okay. But we had been, once, and could be again. We didn’t have to inflict our trauma on our children, not even if we thought we were saving them from our mistakes. We could build something better. A playground in the soft soil, surrounded by mountains and trees, looking at the stars with excitement, hoping to see meteors consumed in the planet’s atmosphere. “How close!” they’d say, giggling, and eventually, we’d learn to smile, too.  “I understand,” I said, patting Dalia’s good shoulder. I went to find another mother, to help me put Callo somewhere safe until I was ready. Priya Chand is a California transplant living in the Midwest. Her work is inspired by a background in biology, and has previously appeared in magazines including The Magazine of Fantasy & Science Fiction, Analog SF, and Nature Futures. She is also non-fiction editor for issue seven of Reckoning Magazine.", "text": "6370 words, short story\nIt Takes a Village\nA generation of traumatized fathers was raising a generation of children with trauma in their bones.\nWe bobbed on Velcro tethers, children clutched against our chests, faces pale in the filtered sunlight reflecting off the planet below. Our gravitational generator always shut off first. Next were the ship’s main systems, everything except emergency life support. We’d learned to conserve our air as it recharged, enough to allow a single person to tell a story. The story.\nNecessity. If our children were to survive, they had to understand. We took turns, but the words were always the same.\nI waited until the ship’s hum faded, leaving only the sound of our deliberate, slow breathing.\n“Three years ago,” I said softly, “we did something bad. We didn’t listen to the AI. We thought we didn’t need it anymore, because we were close to landing. But that was wrong. You can’t stop being careful, ever.” All of us held our children tighter, taking comfort before the horror ahead.\n“We hit a rock.” My voice dropped to a whisper. “Our friends were . . . taken.” And so was the playground I’d hoped to show Callo around, and the radiation net that’d powered our AI separately from the main engine, forcing this daily shutdown so it could recharge. “When we found out what happened, we went back. We said sorry. It was too late to save our friends, but the AI told us what to do next.\n“We should have listened from the beginning. It’s okay to ask questions.” My heart beat faster. I ignored it. “But you can’t say no to the AI. You can’t put your hands over your ears and pretend you didn’t hear.\n“First, the AI told us to make you, because this ship needs people. And then”—my chin lifted toward the massive window—“it sent the mothers to the planet. They’re down there right now, making food and houses for us.” Our distance comms, built centuries after our ancestors left Earth, couldn’t penetrate the planet’s atmosphere. For all we knew, the mothers were dead, or thought we were dead.\n“One day,” I said, ears thumping, “we’ll join them. It’ll be just like living inside a holo.” The holochamber was gone. We’d need a better metaphor . . . or we could finally leave this damn ship. We’d stabilized what we could, but what remained of it wouldn’t survive a second collision. It was time to go.\nA sigh, then a hum. We repositioned our feet, adjusted the children, and landed gently as the gravity returned.\nThakur and I headed to our shared compartment, his pace slowed by twins. Because they were two, they were on part-rations. Once a week I offered to get Thakur a little extra from Hydroponics, but he always said no. He was right, that was what the AI had allotted him.\nBut he’d never asked for more.\n“Thakur,” I said after we’d tucked the children in and were nestling on the couch.\n“Mmm?” Thakur pressed closer to my chest.\n“We should get out of here.”\nThakur pushed back and stared into my face. “Did you hear a rumor, Servain? Is something wrong with the ship?”\n“No, listen.” I touched his arm. “Catastrophic systems failures—you know they’re a thing.” Until the accident I’d been an engineer, like Thakur. “And we’re orbiting a planet. We don’t know what could happen.” My hand drifted down his body. “I reserved a slot for tomorrow, so we can ask the AI. We’ll do whatever it says, I promise.”\nThakur relaxed. “Alright. Tomorrow.”\nWe had sex and then went to our separate rooms.\nAfter breakfast in the kitchen, a careful dance that fit our trays and elbows into the limited space, Thakur and I led the way to the AI’s room, children cradled in our arms. Other families filed in behind us, wanting to hear the answer to a question none of them dared ask. Cowards. Sensible, but cowards.\nThe AI’s question-box was in a small room on its own mooring, a clear bubble that was nearly invisible under the overhead LEDs. I activated its listening mode. “Engaged,” it said. “Ask your question.”\nI spoke more slowly than necessary, chewing the words. “Can we go to the planetary settlement?”\nThe bubble clouded up, processing, its neural net finding connections between ship and old Earth data alike.\nIt would be a long time before I realized the unintended loophole in my question. Can, not should. The roboticist-historians would’ve never let me use such imprecise phrasing, but they’d been in the library when the implosion happened, and we didn’t have a library anymore.\nPatterns drifted across the AI’s bubble.\nI remembered going to temple for the first time, babbling with my friends to quell our fear—what if the gods punished us for the time we’d helped Dalia sneak into the ventilation? We’d been in the holochamber on countless occasions, but never like this, lost among intricately carved white pillars that stretched into a distant sky. We’d squirmed out of our parents’ laps, ignoring their attempts to hush us.\nNow was nothing like then, holding our own children, waiting on our shared fate. Our tongues were heavy, frozen. The erratic sounds of our breath filled the air, a jagged orchestra.\nAnd most of my friends were gone.\nThe AI’s bubble cleared. “Yes.”\nWe got to work. Thakur sealed pipes while I helped wind down Hydroponics, harvesting all we could take without crashing the population, in case we needed to return. By the time I finished, plants carefully bagged, Navigation had prepared the shuttles. I strapped in next to Thakur. We held our children tightly, aided by a jury-rigged mess of extra belts and buckles.\nWe landed after sunset, so our first glimpse of the planet was splotches of native vegetation in vivid green, illuminated by pools of sparse lighting, the settlement’s low buildings caught in shadow. The old navigation data was right. But had the mothers survived?\nThere was my answer, running toward me. Aparla, who wrapped me in a hug. “Servain! It’s about damn time.”\n“Careful,” I said, lifting Callo free.\nAparla blinked. “You brought Callo with you?”\nWarmth first, that she remembered the name of my child. And then ice, depositing quickly. “You really think I’d leave Callo up there?”\nAparla shrugged and turned to Thakur. “I see you brought yours as well. Twins, huh?”\nThakur grinned. “I couldn’t decide!” They laughed as groups split off around us, fathers holding up their children for mothers to coo over.\n“Thakur, do you want to join us on a tour?” Aparla smiled at me. “Servain, you don’t get to say no.”\nThakur said, “I think I’d like a rest. I’m a bit tired from carrying these two all day.” He dropped his arms to demonstrate, gently so the children wouldn’t be jostled.\n“Ah, you’ll want the medical compound, over there. It’s fully stocked. Not to jinx it, but things have been pretty calm. Here, join Ghalis’ group.” Aparla waved Thakur toward a gaggle of other fathers. I wondered why there weren’t already rooms for us. Maybe the mothers had dismantled them as the silence grew longer.\nAparla turned back to me. “Anyway, Servain,” she said, “let me show you what I’ve been up to. The lab’s this way.”\nI resettled Callo and followed her to a building twenty meters down. The metal was dull, durable, and lightweight, unmarked despite its millennia-long journey from Earth. I wondered how this planet felt about being invaded by such alien substances, but there was no one to say. We wouldn’t have landed on a planet with sentients—bad enough what we might do to this one.\nAparla opened the door for me. No scans, no locks, just like above. Cradling Callo tighter, I stepped through.\nAparla’s workspace resembled the ship’s hydroponics lab—no surprise, it was her specialty—but take the bench where we did samples analysis and stretch it out to occupy one side of a vast room, the kind of space I could barely imagine these days. At the far end was her desk, covered in scattered holos. Instead of gesturing me over to see, Aparla pointed to a chair on the other side.\n“The plants have been doing well, so I’ve been playing amateur psychologist in my free time.” She blushed, slight tinge on her face, darkened by real sunlight. “Would you mind taking this assessment for me? While you’re still fresh off the ship, so to speak.”\n“Alright.” I shifted Callo into her arms. Before I could tell Aparla to be careful with Callo, she’d wriggled one hand free and brought up the test.\n“No need to rush,” she said. “I’ll be back soon. Gotta make sure we’re set for dinner.”\nI pulled the computer toward me. My body felt light without Callo’s weight. Of course, we had slings, but it felt better to hold our children close. I hoped they drew as much comfort from us as we did them.\nThe assessment was nothing like I expected. It was basic visual recognition: shapes, colors, and then more complex structures, people and plants and ship components. Maybe I was missing the point. I did my best to answer everything accurately and hit send.\nI wasn’t waiting long before Aparla came back in and handed Callo back to me, then pulled out a chair and sat closer than I expected, her eyes locked on me as I fussed over Callo. She said, “There’s nothing wrong with any of your visual processing that we’re seeing . . . ”\n“Why would there be?” We’d spent three years restoring a half-shattered ship. I was insulted.\n“I’m sorry,” Aparla said, shaking her head. “But you know you’ve been carrying around a frozen embryo, right?”\nI hugged Callo’s ovoid, a hermetically sealed container full of clever tech that kept it at the same temperature as liquid nitrogen. “So?”\n“So? Servain, you—none of you—had to bring them here. They’re frozen embryos! The comms aren’t working, for all you knew we were dead, killed by something down here! They would’ve been safer on the ship.”\n“No,” I said, head shaking, holding Callo tighter. “The AI said we had to take care of the children. We’re the fathers.”\n“And we’re the ‘mothers’?” Disdain seethed on her tongue. “Good Earth, Servain! That AI twisted some old-style naming convention and you’ve been going with it? Did you also forget you used to be my wife?”\nI blinked. In those early lonely days after the mothers left, there hadn’t been time to dwell on the relationships we’d broken in case we never crossed paths again. It had been one frantic scramble after another, but we’d made it, under the AI’s aegis.\nWhen I didn’t respond, Aparla tried a smile, weak as hydroponic tea. “I’m sure a lot has happened. Let’s join the others, dinner’s up.”\nI picked up Callo, this time using the sling that dangled from my shoulder, as essential to my wardrobe as pants, and followed. Aparla glanced at Callo but said nothing.\nAs we approached the dining area, I drifted around, trying to see if I could go in. Aparla caught my arm. “There’s none of that here, Servain. No more eating in shifts. The dining hall’s big enough for all of us.”\nPlanets were incredible. I followed Aparla inside. The mothers were spread out, trays organically scattered. I hadn’t seen such a lack of economy in over three years.\n“We aren’t producing at capacity yet,” the mother who slopped food onto my plate said. “Now that you’re here, we can start ramping up, but in the meantime, it’s a good thing we have your plants.”\n“Thanks,” I said. The AI had told us to bring the plants. She should have thanked it. I would’ve said something, if I wasn’t distracted by the steam rising from my dish. The spices were the same, but fully heated food—I’d missed that.\nAparla and I—and Thakur, once he saw us—sat cross-legged around one of the small tables. Thakur had the twins in their sling as well. I heard more background chatter than I’d heard in ages, all from the mothers. It felt unnatural, not only because they changed topics every time we brought up our children. Where we’d embraced silence, the mothers had tried to fill this unimaginably massive world with noise.\nWe finished eating and dropped our plates into the recycler. Almost by reflex, Thakur and I huddled with the other fathers. We didn’t know where to go so we stayed clustered, releasing the children from their slings and into our arms. The mothers were watching us, their collective gaze undiluted by their spread across the dining hall.\n“We’ll show you where to sleep,” someone said at last, and we shuffled out gratefully behind her, children nestled against us.\nThakur and I looked at each other. “Do we want to share a dorm?” he said.\nOur relationship was mostly the warmth of our bodies against each other, comfort and release. The last conversation we’d had on the ship was the most we’d spoken in months.\n“Sure,” I said. “It’s worth a try.”\nWe took a larger room with a double bed. We put the children on the hammocks the mothers had provided, somewhat ungraciously I thought. These were their kids too.\n“Aren’t they being weird about the children?” I asked Thakur.\n“They’ve been working their butts off on an actual planet,” Thakur said. “Imagine how mind melting that is? Tomorrow we’re going to see a completely open sky. I’d give them a break for now, Servain.”\nI went to bed thinking about what it would’ve been like to do everything we had to do to repair the ship, forcing our bodies through a haze of nightmares and the constant aching fear of another mistake, but on land.\nWe couldn’t sit idly, especially not now the settlement needed expansion. I had the sense the mothers would let us do anything, especially if it distracted us from watching our children.\nTucked in bed next to Thakur for the first time ever, I said, “Will you stay with Waterworks?” Dew collection, irrigation, plumbing—there were so many more choices on a planet.\nThakur’s arm drifted along my back. “That’s not what the AI said I was good at, Servain. I’m going back to Circuits.”\n“Oh,” I said. Was I the only one who liked my new role more, no matter where the AI had originally placed me? I shifted away from him and pulled Callo toward me until the ceramic warmed to match the heat of my own body.\nAll of the original hydroponicists were mothers: the AI had spared no one, planetary sustenance being too critical and more unpredictable than our little ship farm. So I was the only father who joined them, under Aparla’s supervision.\nOver the past couple of days, I’d mostly seen the inside of the settlement, all those rooms and buildings stretched out past my imaginings, but this—this was new. Thakur was right, the mothers must’ve been terrified. The holochamber hadn’t captured it. I couldn’t describe it. I’d looked out the ship’s windows thousands of times, but space is mostly empty. This was all substance, grass and soil and rocks and a horizon that ended. There was something unsettling about that middle distance, terrain shrouded in blue haze—out of reach, but reachable, nothing like stars stretching into infinity.\nOf course the mothers were comfortable with it now, and assigned me to the field nearest to our settlement, which was also where the Earth plants were, familiar and small. What I’d seen of the native vegetation was leafier and with fluffy lightweight seeds, thanks to the respective absence of predators and pollinators. Otherwise, the underlying biology was familiar. Left-handed amino acids and right-handed sugars, photosynthesis by day and respiration or its carbon fixing alternatives by night. Our bodies couldn’t digest alien botany, nor would our plants thrive in truly alien soil, torn from the bacterial and fungal networks they needed for sustenance. Mars had been a mistake, one that propelled our ancestors onto the ship, generation after generation not knowing if they’d ever find a place for their descendants to thrive.\nAnd now we were here.\n“The vertigo was bad when I first landed,” Venkat said to me, reaching past Callo’s sling to pat my elbow. “Don’t try to ride it out, just go inside. It’s like agoraphobia, sort of.”\n“Thanks.” I watched her retreat into the distance, quick short strides, turning away before the horizon caught me again. This place was so big we’d need transportation by the time the children were grown. Even that thought dizzied me. I lay down on the earth, pressing my cheek against cool soil, eyes closed. It smelled richer than I’d imagined, although I couldn’t untangle the scents yet.\nOnce I felt steadier, I got to work, checking each plant for disease with my scanner, making sure everything was healthy. My back sweated where Callo pressed against it. I wondered if it would be alright to put Callo down. But this planet could still be full of unwelcome surprises and caring for our children was paramount.\n“How’s the soil?”\nI started. There hadn’t been any sound of footsteps—no metal floors. “Aparla, hi.” I caught my breath. “I haven’t started scanning it yet.”\nShe smiled. “Doing the plants first, huh? Efficient. We should’ve got engineers to help us way sooner.” Her hand landed on mine, warm and callused. Something stirred in the back of my brain. I put my other hand on top of hers.\n“You still . . . ” She trailed off. “You’re with Thakur, aren’t you?”\n“We bonded on the ship. We’re giving the planet a try. I don’t think you mothers understand.” Remembering what Thakur said last night, I added, “Sorry.”\nAparla snorted. “You’re apologizing for the wrong thing. Don’t you remember why the AI calls us ‘mothers’?”\n“Because you are,” I said. Which was my way of admitting I didn’t.\n“Because it thinks mothers are ‘homemakers.’” The disdain was even stronger this time. “No other reason. That’s not even what those terms meant on Earth, not by the twenty-second century.”\n“So what?”\n“So—I, we, we’re worried. You all don’t seem to care that the AI has flaws, its specialty is computation, not . . . I don’t know, building a whole society. We used to make fun of it, and now you’re treating it like gospel. And now—how are you keeping it powered, Servain?”\nBefore the accident, we hadn’t taken the AI as seriously. It sometimes gave us answers that didn’t make sense—which, I now realized, might be because of their planetary relevance. What if almonds really did heal one’s emotional balance? What were almonds, anyway? Aparla and I had laughed over the advice, given in response to a series of panic attacks that had spread across the ship following the loss of one of our candidate planets.\nI was sure she remembered the laughter, but not the context. Without seeing the AI in action, I didn’t know how I could convince her otherwise. How could she, distracted by the smell of real soil and this wide-open sky, understand what it was like during those daily blackouts, the drifting and the silence?\n“I don’t know what to tell you,” I said.\n“Alright. I’ve got to get back to work.” She stretched, careful not to look at Callo. “Don’t be out here too long without a break. Your UV shield isn’t perfect. You’re on a planet now, all kinds of things can happen in the open air, especially when you’re new. Lakka got heatstroke, it’s unpleasant and takes a long time to go away completely.”\nI finished up, guzzling the water someone brought me but never putting Callo down, no. The mothers were so coordinated, trading information and talking among themselves. None of us were like that. Thakur and I didn’t even try to cross paths during the day.\nBut here, with the mothers pressing in on us, we began talking more.\nOne day after dinner, we crammed into the double room Thakur and I shared, children nestled more comfortably now that the mothers weren’t staring at us. The room was warm and filled with the sound of breathing. A flash of memory, hundreds of memories, but all the same: I missed our daily sessions on the bridge.\n“They’re mocking us,” Daneel said in the soft tones of our oratory. He smacked his fist into his palm. “They aren’t taking the AI seriously at all. I asked about bringing it down here, and they laughed.”\nWe all shivered or clutched our children for comfort.\n“We’ve only been here a few weeks,” Thakur said. “We should talk to them. They’ve forgotten the accident”—a pause, an inhalation—“they’ve spent too much time planetside, they’re losing their instincts for survival. They think the AI is amusing because they haven’t run into any major problems yet.”\nWe drew our children close. There would be problems. There were always problems, and the best way to avoid them was to listen to the AI.\n“We have to help them remember.”\nI took lunch with the mothers when we came back from the fields. We called it Hydroponics out of habit, although of course it wasn’t.\n“Dirt-ponics?” I laughed. The others laughed with me. It was like reliving my childhood.\nIchiro said, still laughing, “‘Farming,’ I think. It’s been a long time since I saw the vids, they’re still on the ship, aren’t they?”\n“Yeah.” I saw my opportunity. “We watch—watched—a new one every Friday. The AI does a great job selecting ones that are right for the moment.”\n“I remember it was good at that kind of thing, as long as you didn’t mind getting some very odd half-notions from Earth,” Halva said. She and the other mothers traded grins. To avoid looking stuffy, I smiled.\nBut as I spent more time outside, and watched my skin turn from dust to soil, contributing to a fully organic ecosystem for the first time in my life, I felt myself expand past the constraints of my old life. My whole being yearned for the sky. I wanted to explore, even, yes, stand atop one of the hazy blue mountains. I wondered how you could grow up on a planet and then live out the rest of your life in a metal box that, at any second, could—\nI’d overreached. The horizon blared in my mind’s eye. I dropped to my knees. Shivering, I turned Callo’s sling around my body and lifted Callo out, running my hands across the ceramic like I always did for comfort. Nothing. I wrapped my arms around Callo, trembling, trembling harder, and eventually the tears rolled out of me, hideous wet sobs. I hadn’t cried like this, even as a child. I’d always been surrounded by people. Half of them were dead. Callo wasn’t a person, not even close—might never be a person—\nI released Callo and put my dirt-coated hands over my face, letting the earthy scents wash over me. The soil was warm from the sunlight, moist against my knees. I lay back down to let it caress me, wishing it were the touch of a person. But it was still more alive than the ceramic shell inside which Callo lay frozen.\nWhat was I doing? What were any of us fathers doing?\nSudden coolness—something was interfering with the sunlight. Aparla was standing over me, I recognized her concerned huff. “Are you okay?” she said.\nI rubbed my eyes, using the heels of my palms to blot out the tear tracks as if she wouldn’t notice. “Yeah,” I said. “The sky got to me. Not as acclimated as I’d like.” I managed a weak giggle.\n“I’m sending you back, Servain. Rest.”\nI thought about arguing, but I hadn’t been entirely dishonest. I could use the comfort of four walls and a ceiling right now. “Thanks.” Looking around as little as possible, I retreated back into my shared room and put Callo on the table by my bedside and closed my eyes.\nThakur opening the door woke me up. “Oh, sorry, I didn’t realize—why is Callo on the table?” His tone shifted from warm to colder than the inside of Callo’s container.\nI sat up. I’ve never been one of those people who needs time or stimulants to return to full functionality. “I—I was tired. Aparla and I were—”\n“You left your child unprotected because of a mother?”\n“Not unprotected—”\n“Callo could fall from here. And then what?”\nThe containers had flat, gecko-like bases for that exact reason. “Nothing happened, Thakur. Can you please calm down? You’re nearly shouting. Someone’s gonna think there’s an emergency.”\n“Calm”—Thakur took a steadying breath. “I can’t believe who you’ve become here, Servain. You remember what we learned from the AI. Our children come first.” He steadied the sling across his chest, nudging the ovoid so it bumped his ribs. I saw the wince.\nFor the first time I saw the “children” through the mothers’ eyes. The container was just that, a container. There was no reason to drag the contents from place to place. We were inconveniencing ourselves for—what, exactly? The most rigid possible interpretation of the AI’s directive to ensure humanity had a future?\nI got up. “This is who I was, Thakur. It’s just, with the emergency . . . ” We hadn’t given ourselves any space to think, to reconsider what we were doing. We told ourselves we could ask questions. Could, not should. Even though we’d grown up knowing the AI was far from omnipotent, we sought comfort in its algorithms.\nThakur and I looked at each other for a long time. Then I packed up my belongings.\n“Are you sure you don’t want the double bed?” he said.\nOnce, when I was young, our main water recycler broke, and we couldn’t shower until the repairs were completed. The first time I stood under the jets I felt a layer of dead skin slough off my body. How strange, to realize I’d come to accept that dry, itchy sensation of my skin being too small as simply the way things were.\nI looked at Thakur, pulling the container to his chest, seeking comfort in its presence as if it had any to give, and smiled gently. “You have the twins. You’ll need it more than I do.”\nThe alarms went off early, so bleary-eyed we all rushed to the medical complex. It was a specially reinforced set of buildings, infirmary and storage and meeting space. We entered the latter, dispersing among the few scattered chairs that weren’t folded up. I wondered if the protocol for emergencies had come from the AI or simply been obvious.\nOut of habit, I joined the fathers on the side opposite the mothers, Callo nudging my back. Most of them had their slings turned to the front. My hands shifted, but the container was more comfortable where it was, and—we were planetside now.\nThakur’s gaze raked my chest and then shifted away, which let the others know we’d broken up. Before anyone could ask what happened, there was a sudden push to make space for the lead mother, if you could call her that, and two security officers, at the front of the room. Aina, Trevor, and Vitri. Even as Aina’s eyes raked the room, the mothers were murmuring among themselves, Aparla included, speculating.\nAina quieted the mothers with a wave of her hand, waiting until they’d finished shushing each other to speak. Her voice echoed off the walls. “There’s been a small disruption to one of the power generators. No concerns yet, we’ve got enough stored energy for the next sixty hours. We’re going to stay here while Nabin and Dastana identify the issue. Are there any engineers from the ship who would like to join them? I do have to warn you, there’s a fire risk.”\nNo one stepped forward. I shifted Callo to my front, and although I knew the calm was really from the bodies near me, I stroked the container like the other fathers were doing. Power disruption. Fire risk. How could she say those things so casually? Sweat ran down Thakur’s face.\nI remembered wiping Aparla’s brow when we’d been married. Those little intimacies had never existed between Thakur and me.\nAina’s eyes raked our containers and then returned to our faces. “We do want to get you all involved here, and the emergency’s a good way to understand these weather-based power generators. The underlying mechanisms are pretty different from shipside. Any takers?”\nI was a hydroponics specialist now. I mean, a farmer. Either way, not an engineer anymore. If I was honest with myself, it was more of a relief than being away from the ship, no matter that it wasn’t necessarily the best use of my skills. The AI made me an engineer because of my relative talents in math, but I’d always preferred the smell of green things.\nBut knowledge was a good thing.\nBut there was nothing that compelled me to go, and we were back with the mothers. Let someone else be responsible for the electronics. I’d rather be responsible for the growing.\nDalia stepped forward. “I’ll go,” he said. There was an eagerness in him I didn’t think I’d seen in years. He slipped the sling off his shoulder, handing it and the container wrapped inside to the nearest mother.\nAs Dalia followed Trevor out the door, the fathers kept their eyes on Dalia’s container.\nDalia and I still joined the fathers for our conversations, crammed into one of the spare rooms, sharing air and warmth. I was a few seats down from Thakur, trying to remember how I held Callo’s container when I thought of it as Callo.\nAfter the incident—resolved within the hour, some casing had cracked despite the material’s much-vaunted weather tolerance—no one had asked for details of our breakup. They were too aghast at Dalia. He was seated slightly outside the circle. There was something different about the way he held his body, but I couldn’t figure what. The fathers all had their eyes on him.\nI couldn’t scrub the image from my own head, the . . . freedom as Dalia went off to risk his life for knowledge.\n“What were you thinking?” Xiu Ying said to Dalia, finally breaking the silence.\nDalia’s mouth twisted. “You heard her. It’s not like we can just take apart a working generator when we feel like it. This was a rare opportunity to understand the mechanism.”\n“You could have died.” That was the cue to, of course, cling to our containers, hands skating across the ceramic like window washers.\n“We were near death all the time on the ship,” Dalia retorted, waving his arms, joggling his shirt. That was when it registered: no carrier, no container. I pushed unkind thoughts about Callo’s weight on my lap to the back of my mind.\n“Not like this,” Leluye said, stepping in where Xiu Ying was sputtering. “The AI could have assessed the situation without you all needing to risk yourselves.” To this, Dalia shrugged—he and Leluye were on the same shift, Leluye wasn’t blithering. “But the mothers refuse to entertain the adjustments needed to bring it here. So—we risk ourselves planetside when something goes wrong, and it could be an even bigger accident”—we all shuddered. We couldn’t help it. I suddenly saw ritual in the way we reached for our containers, no different from the prayers some of us said nightly.\nThe silence continued until Dalia interjected, voice trembling as it hadn’t earlier. “Which isn’t—”\n“Which the AI could help us with,” Leluye said, cutting him off. “It was built on a planet. It’s got all kinds of knowledge we don’t understand.” The other fathers nodded forceful assent, chins thrusted. Dalia subsided back into his seat.\nWas Leluye right?\nI myself had agreed with his sentiment not too long ago. But the mothers remembered growing up with the AI, and they’d been here for three years, and they had no such feelings. With the amount of times we’d all brought up the AI, they would’ve said something if they’d had any sudden insights about its relevance.\nBefore I could bring that up, Xiu Ying said, “We should leave.” More understated than he’d been on the bridge, but not a whisper.\nAt last Leluye responded, equally quiet, “How?”\n“The shuttles are all on the landing pad. The mothers know we left supplies aboard the ship. We won’t tell them we’re not coming back.” Xiu Ying pulled his chair closer to the center, so the LED caught his soft features and dipped them in shadow.\n“This planet is too damn unpredictable. Let’s do it,” Thakur said, hands passing over his twins’ container.\nI snuck a glance at Dalia right as he glanced back at me, and while he didn’t look defeated—and I didn’t think I did, either—we were both exhausted. If we said anything, they’d mention the accident, and our brains weren’t ready to push that aside long enough to point out all the problems with going back to a creaking half-corpse of a ship.\n“Let’s do it,” Xiu Ying whispered. The fathers murmured assent.\nWas it really that simple?\nWhen they went to the mothers and told them it was time to go back, complete the ship’s transformation into salvage—when the mothers asked if some of them should go and the fathers said no, the ship’s changed a lot since the implosion, you won’t know where anything is, it’ll waste time—when I said nothing, because I couldn’t betray the fathers, even though I knew I wasn’t a father anymore, and hadn’t been for a while . . .\nYes. It was.\nFor old times’ sake, I decided to talk to Thakur after dinner, alone in my room. Callo rested on the hammock the mothers had constructed—a waste of resources, I couldn’t help thinking, with the part of my brain that had blossomed under the light of an actual sun. But at least it would be enough to avoid distracting Thakur with my “carelessness.”\n“What is it, Servain?” he said, taking a seat on the chair across from me. His container bulged over his belly.\n“I just wanted to—are you really doing this? The engines could fail, or the hull could lose . . . It’s not safe up there,” I blurted, because if I stopped and thought, I’d return to the accident again.\n“It’s not safe down here, either,” Thakur said.\nHe wasn’t exactly wrong. The alarm was the one real emergency we had, but there’d been a few near misses with twisted ankles, a case of pneumonia after a rainstorm—yes, it really can fall from the sky. Unpredictable, but expected planetary behavior. I focused on the latter. To Thakur, it was the former that terrified. The dangers were known, if sometimes inescapable, on a ship.\nAnd I could see his hands trembling, far cry from the boldness that had drawn me to him in those early days—the only one who insisted on keeping both fertilized embryos!—he wouldn’t let himself heal. I wasn’t yet capable of helping anyone else, and he’d run screaming from the mothers.\n“Never mind,” I said. “It was good seeing you.”\nThakur nodded, hands seeking comfort from his ceramic-alloy hemisphere. “Goodbye, Servain.”\nEventually he’d activate the twins’ container, him and the other fathers. I had to hope the AI would tell them to come back down here, sooner rather than later, as the ship slowly deteriorated, along with their sense of independence.\nOur ancestors had left Earth seeking a new planet. To come so close, and then to leave it—I thought about the months we had spent together, holding each other. I wished we had worked more on easing instead of sharing our trauma, but I doubted I’d even have been capable of that thought on the ship. I’d entrusted my brain to repetition and our rigid interpretation of the AI’s directives. Ship-minded, small, crushed into half the space we should have had.\nThe next day the fathers were gone.\nI was in the medical sector, finding a good place to put Callo’s container until it was ready for activation. As I left the storage area—even if Callo wasn’t a person yet, putting the container next to rolls of bandages and EpiPens seemed a little much—I went back to the infirmary, where I ran into Dalia, receiving treatment for a nasty forearm gash, grit visibly embedded in the torn skin. I couldn’t help looking: no container in sight.\nDalia said wryly, “I wanted a good view of the departing shuttles. I didn’t realize there’d be so much wind on a planet.”\n“What’d you do with your child?” I asked him.\nHe shrugged. “I let Leluye take the container. He wanted two, but he didn’t have the nerve.”\n“Oh,” I said. I looked down at Callo’s container.\n“I never wanted children,” Dalia said, catching my gaze. “You know how it was when everything first happened, though—I couldn’t think of saying no.” He shivered as the medbot smeared gel across his cleaned wound. “I had to send Yi—it back. I think I had to, otherwise I couldn’t move on.” He shook his head.\nNone of us were okay. But we had been, once, and could be again. We didn’t have to inflict our trauma on our children, not even if we thought we were saving them from our mistakes. We could build something better. A playground in the soft soil, surrounded by mountains and trees, looking at the stars with excitement, hoping to see meteors consumed in the planet’s atmosphere. “How close!” they’d say, giggling, and eventually, we’d learn to smile, too.\n“I understand,” I said, patting Dalia’s good shoulder. I went to find another mother, to help me put Callo somewhere safe until I was ready.\nPriya Chand is a California transplant living in the Midwest. Her work is inspired by a background in biology, and has previously appeared in magazines including The Magazine of Fantasy & Science Fiction, Analog SF, and Nature Futures. She is also non-fiction editor for issue seven of Reckoning Magazine.", "source": "https://clarkesworldmagazine.com/chand_03_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: It Takes a Village by Priya Chand"}