{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Baoshu; Andy Dudak", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "y8j6XU6ZU/Ub880qiNybT+CTpko=", "id": null, "license": null, "comments": "", "raw_text": "8160 words, novelette  The Lighthouse Girl  March 12, 2027  My name is Ling Rourou . . . right Papa? Yes, I am Ling Rourou. Today I am seven years old. Papa’s name is Ling Dong. He gave me this mini laptop as my birthday present. Papa says all I have to do is open it and speak into it, and everything I say will be saved into the diary. So now I will tell about today. Today Papa took me to Disneyland for the whole day. It was so fun! I played in a fairy-tale world, and I even flew a plane. Then Papa took me to eat a very big cake. I had a very wonderful birthday. I promise that Rourou will be with Papa forever!  May 8, 2027  Today Papa took me to my first piano lesson. There were many kids my age to make friends with. I was a little scared at first, but I do not know why. When I sat down I played well. I was better than all the other kids. The teacher asked me if I studied piano, but I really cannot remember studying music before. The teacher said I play better than all the other students, even those who study. He said I could take the advanced course. Papa praised me and said I was his little prodigy. After class he took me to eat ice cream. I really love my Papa!  September 1, 2027  Today I will go to primary school. I do not want to go, but Papa says there are many kids there to be friends with and play with.  At school, all the other kids came with their moms and dads. Why do I have no mom to come with me? The kids on TV have moms too. I ask Papa about this sometimes, but he never tells me where my mom is. Once I asked him and he got a bad look in his eyes and he said I do not have a mom. Why am I the only kid with no mom? I want to ask Papa, but I think it will make him unhappy. I do not dare ask. Actually, it is not so bad, not having a mom. Having my Papa is good enough.  September 6, 2027  Today is Sunday. Papa took me to a place with many stone things sticking out of the ground. Papa said everyone goes to sleep under stones like those, eventually. I was surprised. It seemed like it would be really boring, sleeping there. Papa took me to one of the stone things and we stood before it. Papa said my mom was lying below it. I saw her picture on the stone, and she was more beautiful than any of the other children’s moms. I was so happy. I told Papa to wake Mom up, so I could talk with her. Papa cried. He told me Mom could not talk anymore. But he said she will be with me forever, going wherever I go. I do not understand. Papa cried more. I felt very bad. My heart felt like it would break, so I cried too.  September 20, 2027  Today was the first day of English class. The teacher taught us to sing the letters of the alphabet. I was singing along, and suddenly an English sentence came out of my mouth. I said, “My name is Jessica. What’s your name?” The teacher asked if I had studied English in kindergarten. But I couldn’t remember if I had been to kindergarten. I couldn’t remember anything before I was five years old. The teacher said my English is very good, like a native speaker’s. She suggested I participate in an English competition for children and early teens. I was so happy. The teacher said she will call me Jessica from now on, since I already have an English name. I asked Papa about this when I got home. He just said I’m his little genius, but I don’t understand. There’s so much I don’t remember, so how can I be a genius?  March 12, 2028  Today was my birthday, and Papa took me to the seaside. We rode on a fancy yacht and ate delicious food. Papa gave me one of those walking, talking robot dolls I always see on TV. I love my Papa! Too bad Mom couldn’t be there with us. I wanted to go to that place from last year and see her, but Papa said Mom’s soul is always with us, so there’s no need visit her stone. I asked Papa what Mom’s name was. He said she didn’t have a name. I asked how she couldn’t have a name. “You’re named Ling Dong,” I said. “I’m Ling Rourou. Mom must also have a name.” At last Papa told me her name was Susu. Such a pretty name!  April 5, 2032  Today is Tomb Sweeping Festival. I lied to Dad, saying my Lili toy had wandered off again, but actually I went to see Mom. The last time I saw her was five years ago. I still remembered the place clearly, even though Dad had never brought me back for a second visit. It must be too difficult for him to see the grave, a trigger for his grief. But now I’m grown up. I can go on my own, and I did. I had to see Mom. There was so much I wanted to say to her. But when I arrived at the cemetery I was dumbstruck. The place was much bigger than I remembered it. There were so many gravestones, and I didn’t know how I was going to find Mom. I wandered, crossing the grounds several times. I was about ready to give up, but I finally saw the picture, Mom’s face in the stone, just as I remembered. She must have guided me to her grave, watching from up in heaven. She looked so young in the image, no more than twenty. So beautiful. She kind of looked like me.  Below the image it said, ‘Grave of Chen Susu.’ It had been erected by Mom’s parents, my maternal grandfather and grandmother. When did Mom pass away? The gravestone didn’t say, which was strange. The cemetery seemed old. The surrounding graves were all dated, and were thirty to forty years old. Mom couldn’t have died that long ago. I’m only thirteen. When exactly did she die?  Now it’s night and I’m back, and Dad is still in his study, sitting at his computer, trading stocks and so on. I want to ask him about Mom, but it’s bound to make him unhappy. Better to let it go.  April 7, 2032  Dad went out shopping tonight. I seized the opportunity to search through all the photos in the house. I couldn’t find any of Mom, but I did discover something strange: There are plenty of photos of me after five or six years old, but before that, absolutely nothing. None of me as an infant, and of course none of Mom and I. How can this be? For a few years now, I’ve been thinking about my life before age five. I’ve never recalled anything specific, but there are traces, vague impressions of living in a foreign country, speaking English every day, and being named Jessica. And other friends. Who am I? Where am I from? I hide in my blankets and ask myself questions, and suddenly I feel very afraid.  April 13, 2032  I ran into an old couple today, travelers who asked me for directions. They were amiable and doting old folks. I suddenly had a strange feeling that they were my parents. This was frightening. The husband was short, round-faced, and bald, nothing like Dad. Why did I feel like this man was my father? If I close my eyes it’s like I can recall this other couple, my real parents. This feeling is so scary.  May 16, 2032  I told Lili about my fears. She thought for a bit, then said, “I figured it out! Your father isn’t your biological father.” This seems quite plausible. So, at one time I had other parents, and I lived abroad. Okay, but why did Dad . . . Ling Dong . . . adopt me when I was four or five? There are no old photos of me. I’ve been able to play piano and speak English since I was a kid. I must have learned these things in my previous country. Then Chen Susu is probably not my biological mother. Maybe Dad just chose a gravestone at random, to deceive me. My biological parents, are you still alive? If you’re alive, where are you? Do you know I’m living in a foreign land, following a new father through life?  May 19, 2032  It turns out I’m the world’s silliest fool. Today I reached my breaking point. I charged into Dad’s study and said, “Am I really your daughter? Where are my biological parents?”  Dad was angry at first, but as he heard me out, he began to smile. “You and Lili watch too much TV,” he said. We had spun fantasies based on serial drama plots, he claimed. “We did live in America,” he admitted, “and your English pet name back then was Jessica. When you were four you had a high fever, so you can’t remember your early childhood.”  “But why don’t you have photos of me from then?” I said.  “No photos?” he said, incredulous. He turned on his computer, and sure enough there were my baby photos. Dad said he took many photos back then, but during the move he lost some hard copy albums. But there were still many photos in the computer. I saw a family portrait of me, Mom, and Dad. Mom was hugging me, happily snuggled against Dad’s side.  “If she’s not your mother,” Dad said, “why do you two look so alike?”  I couldn’t deny it. And Dad was so good to me. How could I not be his daughter?  “She fell ill and died that year,” Dad said. “You were still very small.” He choked, sobbing. I told him to stop talking, and I hugged him. I really am such a fool!  April 7, 2035  Something wonderful and intriguing happened today.  A new teacher came to my middle school, 28 or 29 years old, dressed in ostentatious Western fashion. She didn’t teach my class, but when she saw me in the office, she unexpectedly blurted out, “Jessica!” Then she seemed to remember herself. She smiled and said, “Sorry” in English, then in Chinese, “I made a mistake. I thought you were . . . but it’s impossible.”  My heart raced. I said, “What a coincidence. My English name is Jessica.”  This amazed her, and we struck up a conversation. It turns out she’s named Elle. She’s an English teacher from Los Angeles, of Chinese ancestry. She explained that the Jessica she’d been thinking of had been a childhood playmate, a year older than her. They’d grown up together. But Jessica moved when she turned fifteen. That was ten years ago. Obviously, I can’t be Elle’s Jessica.  “So why did you call me by her name?” I asked.  “Because you look so much like her. Like my memory of her, I mean. Like two peas in a pod. But you must be twelve or thirteen years younger than her. So, there’s no way . . . you can be her.”  I’m still baffled and amazed. Although I can’t possibly be Elle’s Jessica, this was such a strange encounter. I asked Elle if she had an old photo of Jessica. Elle said she did, on her computer. She said she will bring it tomorrow for me to see.  April 8, 2035  I’m ill. High fever of forty degrees. No school for me today. Went to the hospital, doctor couldn’t say what was wrong with me. All he could do was reduce my fever to help me convalesce. I might not be able to go to school tomorrow either. I really want to meet Elle again. I still haven’t seen Jessica’s photo.  April 24, 2035  My illness has lasted two weeks. Dad hasn’t let me go to school. I asked him if I’m fatally ill, and he said it is curable, but it will take a long time. Maybe I can return to school next term, but I’m still scared. I feel like he’s holding something back. Would he lie to me? Maybe I’m going to die.  June 16, 2035  That last entry was all pointless worrying. I’m feeling much better. This past month, anyway, I’ve had no problems. I asked Dad if I can return to school, but he said that since I’ve already deferred my studies for two months, I wouldn’t be able to catch up. He wants to take me to Australia for a vacation, to relieve the boredom, and next semester transfer me to an elite private school. When I heard I was going to Australia I was very excited. But I hate to part with my classmates and teachers. Xixi, Mingming, and also teacher Elle. I was just getting to know her, but I feel like we’re kindred spirits. I said I want to return to school next semester, that I can make up my missed classwork. Dad said I could go and ask my teachers, but I think he’s just trying to keep me happy.  September 11, 2035  #private mode#  I want this part of my diary hidden. I need privacy. I . . . don’t know whom I should believe.  We just got back from Australia, and today I got a message from Elle. She found me on the class chat group. She’d heard about my illness and wanted to know how I’m doing. I told her I’m fully recovered. She sent me some photos of she and Jessica. In one they were standing on a suburban lawn, smiling, expressions bright. Elle hadn’t been exaggerating. Jessica looked like my twin!  Behind them was a steepled church. It seemed familiar, though I couldn’t say why. Suddenly a name echoed in my mind: St. Michael. I asked Elle if the church was named St. Michael’s, and she started. “God,” she said, “how did you know that?”  I don’t know how I knew, but coincidence can’t explain it. Jessica and I are somehow deeply connected. Maybe she’s my older sister. My biological mother? Neither of those seem right. I want to ask Dad what’s going on, but then I wonder: How did I recover from that serious illness so suddenly? Does Dad not want me to meet Elle? Was he feeding me some drug or poison on the sly? But how could he have known about Elle? I never told him. Maybe he’s been secretly reading my diary. Maybe he’s been reading it all along. Three years ago, when Lili told me Dad was not my biological father, he knew I would start asking questions, and he showed me those photos to quell my doubts. If he was able to prepare beforehand, fabricating some digital photos would be easy. If Dad has been lying to me all along . . . The thought of it could drive me mad!  September 12, 2035  #private mode#  I couldn’t get to sleep all night. I didn’t fall asleep until dawn, and then I was up at nine.  In the afternoon, Elle and I continued our voice chat. “Do you know who your father is?” she said. I didn’t know how to answer this. Dad was . . . Dad, my father.  “I mean, do you know about his work?”  Dad never goes to work. I know there’s a big computer in his study, but I don’t know what he busies himself with. On the screen, all kinds of data and diagrams constantly stream and pulse. He says he trades in stocks and foreign currencies. I’ve always been impressed with his ability to provide for us by just sitting in his study and trading. As far as I can remember, our little family has never wanted for money.  I summarized all this for Elle. She asked if I had a photo of Dad. Of course, I have many. I opened my hand device and opened a batch. Most were of he and I together. I sent a few to Elle. She immediately looked surprised.  “What?” I said.  “I’ve met your father. He’s . . . he’s Jessica’s father!”  What I felt then was like vertigo. Gasping for breath, I said, “How is that possible?”  “Back then he was about forty years old,” Elle said, “still kind of handsome. He worked in biological research, as far as I know. He was reclusive, didn’t mix with neighbors. I only ran into him twice, when Jessica brought me to her house to play.”  Although Elle doesn’t have a photo of Jessica’s father from that time, her description of him goes a long way toward making me believe. Ultimately the question is . . . what are Jessica and I to each other? Is she really my big sister? Even if we’re sisters, our resemblance is uncanny, especially because we can’t be twins. And how or why did we end up with the same name?  Elle continued asking me about Dad, but I had no answers. It surprised me how little I knew about the most important person in my life. Where is he from? What exactly does he do every day? How did he make me? I know nothing.  Elle said, “Are you sure he’s your biological father? Honestly, you two don’t resemble each other very much.”  My heart pounded in my chest. This was a doubt I’d harbored for years. I was like someone who wakes from a horrific nightmare, discovers everything is back to normal, passes years in comfort, but at last discovers that reality is the dream, and the nightmare is real . . .  Elle wants me to find a way to get a few of Dad’s hairs. A DNA test could determine if we are blood-related.  September 15, 2035  #private mode#  Dad is very against me going back to school. He wants to take me to Paris to live for a few years. Paris! Once upon a time, this news would’ve driven me mad with joy. But now it just leaves me cold. Why does Dad want to flee China? Is he afraid I’ll discover something? Or does he want to take me abroad for some dreadful purpose I can’t imagine?  Although Dad is Chinese (I think?), he doesn’t seem to have relatives here. And he has very little contact with the people around us in our daily life. Is he an escaped convict? A spy? Or he could be a homicidal maniac . . . If I keep obsessing on this, I’ll go crazy.  If I can snatch a few hairs off his pillow, if that can just go smoothly, I will get them to Elle. And I’ll have an answer soon enough. But I already have a premonition . . . that the answer is something I’ll regret knowing.  September 27, 2035  #private mode#  After what seemed like a century, the DNA test results finally arrived. Elle transferred them to me via her hand device. The results confirmed my worst doubts: Dad and I are not blood-related whatsoever. I hid in the bathroom and cried for a while. If Dad asks what’s wrong, I’ll say I’m sad to leave my Chinese friends.  Elle says she’s found a private investigator to look into Dad’s background. But this means I must endure, and worry, and obsess in secret, because I don’t want to alert Dad. He’ll take me to France next month. If we get there and there are things I still haven’t discovered about him, what should I do then?  October 9, 2035  #private mode#  Elle wants to meet with me today. She says she has something important to tell me.  We met in a cafe. Elle produced a thick folder of data, and with a grave expression handed it over. The top page was the CV of someone named Ling Yong. I wondered what this had to do with Dad. Elle sensed my misgivings, and explained:  “Ling Yong is Ling Dong, your . . . father. Or perhaps it’s better to say your foster father. He changed his name. He’s lived in a few different countries, not easy to track. But he left behind traces, allowing the detective to learn his identity.”  “Originally named Ling Yong, born in the 1970s. In 1991 he entered Yanjing University in Beijing, School of Life Sciences. In 1995 he went to the US to study at the University of Pennsylvania for a PhD in biology. He got his doctorate in 2001. Later, at the National University of Mexico, he did postdoctoral research, investigating the DNA of a Caribbean jellyfish species . . . ”  I looked through incomprehensible pages of data. The whole thing seemed to be this Ling Yong person’s dissertation, mostly written in a foreign language. Was this Dad? He seemed like a total stranger.  But a familiar name emerged soon enough.  “When he was at Yanjing University, he met a female student named Chen Susu. Yes, this was your so-called mother. They fell in love quickly, and after graduation they got engaged.”  Dad had never lied about this, at least. Chen Susu was his wife. But was she my mother? Maybe she was, and someone else was my father? After that engagement, almost twenty years passed before I was born. What had gone on in those years?  Elle continued: “Chen Susu did not go abroad with Ling Yong. She stayed in China and continued her studies. This was the 1990s. Internet and hand devices were still in their infancy. It wasn’t easy for these young lovers to maintain contact, which strained their relationship. It’s been over thirty years, so we don’t know exactly what happened. All we know for sure is that Chen Susu was courted by the scion of a rich family. Eventually she chose to break up with Ling Yong, who hurried back to China to save the relationship. They were heard quarreling. Ling Yong then returned to America. Not long after, Chen Susu was reported missing.”  I was forgetting to breathe. My own thoughts were making me sick.  “The police suspected Ling Yong in connection with Susu’s disappearance. Immigration records revealed that he returned to China right when she went missing. Then he quickly left again. Police suspected his love turned to hate, that he kidnapped her, and that Chen Susu had probably been murdered.”  “No!” I blurted. “No matter what they say, Dad’s not capable of murder!”  “If only that were true,” Elle said with a sigh. “Police suspected him, but he was out of the country. Summoning him for interrogation would have been difficult, and there was no conclusive evidence to get him extradited. At last the matter was dropped. Ling Yong might’ve had a guilty conscience, or at least a fear of justice. At any rate, he didn’t return to China for many years. Chen Susu remained missing. Three years later, a hiker in a remote mountain forest discovered the remains of a body. Scattered remains. The body had been . . . dismembered. The head was missing. I’m sorry, Rourou, these details are horrible. Some clothes were found nearby, and they were confirmed to be Chen Susu’s. DNA tests later confirmed the remains were Chen Susu’s. She’d been murdered three years before.”  It was like I’d fallen into an ice cave. Unable to control my shivering, I said, “You can’t mean to say that my Dad . . . that he . . . ”  “I don’t know. The investigation didn’t turn up definitive proof. Chen Susu’s parents naturally suffered and grieved. Her remains were cremated, and then interred . . . in that cemetery plot you visited. Strangely enough, Ling Yong, a few years later, was witnessed bringing a seven- or eight-year-old girl to visit the grave. A Chinese girl, it was reported.”  “Jessica?” I was pretty sure of this guess.  But I’d guessed wrong. “No, this was in 2005 or so. Jessica hadn’t been born yet. This child was named Karla. We did everything possible to find pictures of her, and came up with just one. Look. She and Jessica, and you . . . identical!”  I felt like I was looking at my own childhood face. I felt like I was suffocating.  “Rourou, I have an awful theory. Please try to remain calm. I think you and Jessica and Karla are clones of Chen Susu. Cloning technology emerged a long time ago. Although human cloning has always been forbidden, for a competent biologist like Ling Dong, it would not be difficult.”  “Human clones . . . ” I only understood a bit of this concept from science fiction movies. “You mean to say that my father . . . Ling Dong . . . Ling Yong . . . took cells from Chen Susu, and used them to create us? Why would he do this?”  “He was obsessed with Chen Susu, to a sick degree. She betrayed him, or he felt she had, so he killed her. But he couldn’t stand being parted from her, so he used her cells to create children that looked just like her.”  I couldn’t process this. I struggled to untangle my confusion. “If you’re right about him, one clone would be enough. Why make three of us?”  Elle seemed even more uncomfortable. She lowered her voice. “This is what I wanted to tell you in particular, Rourou. You’re in danger! Karla and Jessica both went missing, one after another. They both went missing at sixteen. Ling Dong moved to a new country each time. The people who knew Karla and Jessica thought they moved with him, of course, but that’s not the case! Only Ling Dong knows what happened to them.”  I shivered. “He says he wants to take me to France. Could it be that . . . ”  “We can’t rule out the possibility.”  “What should I do? Report to the police?”  Elle considered, then grudgingly shook her head. “Approaching the police would be useless. At the moment, it’s all conjecture. There’s no concrete proof. The police would never believe such a bizarre story. But you can’t go home either. So how about this . . . for the time being, you come with me. You should have an American passport. I can take you to the States. Ling Dong won’t be able to find you, guaranteed.”  I hesitated. This was Elle’s side of the story. Maybe Dad was wrongly accused. Maybe there was more information. For instance, if I was a clone, why did I seem to have some of Jessica’s memories?  “I still want to think it over,” I said. “I need to be sure.”  Elle didn’t press me. “Then please be careful. Prepare for the worst. If anything happens, contact me immediately.”  October 10, 2035  My home was starting to seem unfamiliar and sinister. But I was determined to be strong, to act as if nothing had happened, feign nonchalance, and keep Dad in the dark. No, to keep Ling Dong in the dark. Today, the aunty who usually cooks for us asked for leave. Dad busied himself in his study all day. At dinnertime I suggested we go out, so we ended up at a nearby restaurant. We sat down and heard the man and woman at the next table arguing. It was hard to understand, but it seemed a long-distance relationship had led to the young woman being unfaithful. She’d been caught, and now wanted to break up. The young man slapped her in the face, and the girl ran out crying.  Of course, this reminded me of Ling Dong and Chen Susu, and their long-ago romance. I struggled to maintain my composure. Ling Dong had supposedly murdered Chen Susu over a dispute like the one we’d just seen. I thought maybe I could sound him out. “Dad,” I said, “can you believe that girl? How can she be so . . . Cheating, lying, deceiving, it’s pathetic. I think deceivers deserve to die.”  He pounded the table. “Yes,” he said, voice low and forceful, “they really do. So why haven’t I . . . ” He stopped himself, trembling. I’d clearly provoked him. This seemed to confirm Elle’s suspicion: he really was harboring deep-seated hostility toward Chen Susu.  I was shocked, angry, and scared. Was he capable of violence here and now? I had to force a smile. “Never mind Dad. Why get so riled up over other people’s problems? Come on, lets drink a toast.”  Ling Dong sighed and started drinking with me. I tried to lead him out of his foul mood, chatting about our usual father-daughter things, former birthday celebrations, where we’d gone together for fun, the mischievous pranks I’d played on him. All this did was remind me how many warm memories we shared. These weighed on me in our grim new context. The memories were the same, but he had changed.  Ling Dong couldn’t seem to recover. He looked to be stewing in a vile temper. He was drinking rice liquor as if his life depended on it, cup after cup. When we finally left he was three sheets to the wind, so we took a taxi home. He went straight to the sofa and collapsed on it, and began to snore thunderously.  I considered Elle’s theory more or less confirmed. Being back in this house was only increasing my danger. I sent Elle a message, then went upstairs and got my passport, and some cash and clothes, wanting to quietly slip away. But when I passed by the study door, I saw it had been left unlocked. Inside, the computer was still on. I couldn’t help pausing there, one foot in the door. Ling Dong spent every day in there. What was he up to? Was he really just speculating in stocks and currencies? What secrets might be concealed in there?  I glanced toward the living room. Ling Dong was still snoring, well intoxicated. I guessed he’d be asleep until tomorrow morning. I summoned my courage and entered the study, and examined the computer, but just now the machine was locked. A dialog box requested a password. I tried several—Ling Yong, Susu, Jessica—all to no effect. I was forced to give up. I examined the desk, and one corner was indeed occupied by financial records, and books on the stock market, but they looked ignored, the books pristine. Spread out in the center of the desk were papers in English. I paged through a few. It all seemed biology-related. I could barely understand, but one strange word recurred throughout all the papers: Turritopsis dohrnii.  I opened my hand device and looked up the translation. The Chinese word that popped up was dengta shuimu, 灯塔水母, ‘the lighthouse jellyfish.’ A photo of the bioluminescent creature illuminated this name. In English it was ‘the immortal jellyfish.’ A brief introduction was attached: “A species of jellyfish four to five millimeters in size, after sexual maturity they are capable of returning to their sexually immature colonial polyp stage, and they can repeat this cycle indefinitely.”  I didn’t really understand this, only gathering that it was an odd species of jellyfish. Could all these treatises be about one species? I recalled something Elle said yesterday. Ling Dong was indeed a researcher of jellyfish. That part of the investigation report was true. But he hadn’t been a biologist for many years, so why was he still reading these kinds of papers?  I kept paging through the material. I gleaned that it concerned this jellyfish’s physiology and genetics, but I didn’t understand the purpose. The rest of the study yielded no more clues, and I considered giving up. But then my gaze fell upon the computer screen again, and the password field. I sat down in front of the computer, and typed in Turritopsis dohrnii, but once more got an error message. I had just decided to leave when another idea struck. I typed in the same species name, but in all capital letters, and as one word: TURRITOPSISDOHRNII.  To my surprise, the computer unlocked!  I leaned in close and saw the software Ling Dong had been using all these years. I couldn’t really understand it, but it obviously had nothing to do with stocks. I studied it for quite a while, until I recognized organic molecule structures, and simulations of chemical reactions. It all had something to with the lighthouse jellyfish, but I couldn’t understand the specifics.  I minimized the program, and searched the computer. This time I quickly found what I was seeking: four folders labeled S, K, J, and R.  Four names wheeled in my mind: Susu, Karla, Jessica, and . . . Rourou.  I opened S first, my heart hammering away. There were many pictures and videos, all from around forty years ago, taken during the time of Chen Susu and Ling Dong’s romance. The K file documented the growth and life of a small girl into her teens. She looked just like me, though she wore different clothes and hairstyles, and lived in another country. This was Karla. Jessica’s file was similar, but she grew up years after Karla.  I wondered if we were really clones. I got lost in a fever dream, struggling not to lose hope, to keep from drowning.  I opened a video. Jessica was seven or eight years old, celebrating her birthday with Ling Dong—very similar to my own childhood. Only this was twenty years ago. Another video showed Jessica dancing in a school performance. Another showed she and Ling Dong fishing.  I didn’t want to see any more of these fragments of daily life. I’d decided to stop when I found a large batch of videos that seemed different. I opened one marked January 8, 2024, and found something horrific:  Jessica’s naked sixteen-year-old body on a bed, in a place resembling a laboratory. She was apparently unconscious. Ling Dong approached her with a syringe. Jessica woke, struggled a bit, shouted something, but Ling Dong restrained her. She couldn’t overpower him. After the injection, the girl curled into a ball, and sank back into sleep. Ling Dong left soon after. The video was uneventful for a long time. I opened the next video, and saw that Jessica was still unconscious. Rashes of some kind had erupted on her skin. I skipped several videos, and the rashes had become strange mucous membranes, layers covering Jessica’s body.  Days passed, and the transformation grew more extreme. Jessica was no longer human-shaped. The layered membranes had become a sort of cocoon. Her head and face were no longer visible. Ling Dong came every day to observe. About a month later, March 12 as it happened, the cocoon split open, and thick blood plasma—and god knows what other viscous substances—flowed out. A small head emerged. Ling Dong heard the ripping sounds, entered the scene, tore away the cocoon, and picked up a blood-covered child. It looked four or five years old.  “Susu,” Ling Dong said. I couldn’t tell if his tone was sad or joyous. “You really are reborn. What’s a good name for you this time? How about the name of the kitten we raised together . . . Rourou . . . ”  Susu . . . Rourou?  There I was, short of breath yet again. I don’t know how long I stood there dumbfounded. Gazing down at the papers spread on the desk, the words Turritopsis dohrnii again caught my eye.  “ . . . after sexual maturity, they are capable of returning to their sexually immature colonial polyp stage, and they can repeat this cycle indefinitely.”  I finally understood the meaning of this sentence. The lighthouse jellyfish could return to infancy from maturity, and it could do so indefinitely, cycling between the two states, living forever.  I realized I was not a clone.  I was Chen Susu, and Karla, and Jessica.  Ling Dong, in order to punish Chen Susu, made her—me—into a lighthouse jellyfish. His injection caused her to revert to a four or five year old. Then she grew up again, until she was nearly full-grown, and then back she went. Back I went. Forever under his control and influence. With each new incarnation, I’d lost my memories, allowing him to treat me as a daughter. Until the kidnap victim finally rose up to understand the truth.  I was alive, but forever unable to become an adult. I had died, and then I’d returned to the world, and lived with a deranged demon. This was Ling Dong’s penalty for “my” betrayal of him. The world’s most horrific punishment.  I was shaking, could barely stand. I took a few steps back from the desk, and bumped into someone behind me. I turned and found myself looking right into Ling Dong’s gloomy face.  “How did you get in here?” he said, glancing at the video still playing on the computer. His panicked expression twisted into something monstrous.  I pushed him with all my might, and ran out of the study.  “Rourou,” he said, grabbing me. “Listen!” I snatched a humidifier off a table and smashed him in the head with it. He went down, but didn’t lose consciousness like they do in movies. He was struggling to get up.  I fled recklessly outside. Turning a corner at an intersection, I saw Elle’s car. She’d been waiting there a long time. I got into the car and Elle started it. “To the airport,” she said.  “No,” I said. “A police station. I found proof. I want that criminal to pay for everything he’s done to me.”  October 12, 2035  Elle and I reported to the police yesterday. The officers rushed to my former home, but Ling Dong had destroyed the incriminating evidence. Everything on the computer was deleted. Ling Dong tried to paint my claims as the wild fantasy of a young girl. He nearly succeeded. The police didn’t believe my bizarre story.  But Ling Dong was the Ling Yong of years ago, a suspect in Chen Susu’s death. And I was not his biological daughter. The police refused to hand me over to him, instead sending me to a domestic violence shelter. They’ve begun to investigate Ling Dong’s background. He’s finished!  October 15, 2035  Ling Dong has gone missing. The police say he might seek me out for revenge. They’ve advised me to be careful and vigilant. Elle says she can soon take me to America, where, she believes, Ling Dong will never be able to find me. But I’m still very scared. Scared that someday, once more, I will fall under his control. The police had better hurry up and find him!  October 24, 2035  Ling Dong is dead . . .  His body was discovered at sea, already dead many days. He probably killed himself the day he went missing.  When I heard the news I cried, loud and long. Just a month ago, I couldn’t have imagined any of this. This grim end for him. Now he was dead, a demon that would fade away. But he’d been my Dad, my Papa. Like the demon, my father would never return.  The police believe Ling Dong, obsessed with Chen Susu, kidnapped a girl of unclear origin and background, to fill the void. Of course, there are many things they can’t explain, but with Ling Dong dead, the case is effectively closed.  There are journalists with clever noses snooping around behind the scenes. Elle urged me not to tell anyone about the lighthouse jellyfish. If the world believed it, I might be taken away by some agency for scientific experimentation. I would certainly be reduced to a media object, sensationalized and slandered for a lifetime. I feel Elle is right about all this. Actually, I’m starting to doubt myself, to wonder if the video I saw that night was real.  Elle wants a fresh start for me in America. I don’t want to spend her money, but she says she’s got a lot of it, so it doesn’t matter. “Let me help you,” she said. “We’ve been friends for a long time, after all.”  So, I acquiesced. I can only hope that a new start is possible for me.  Sender: Turritopsisling@Kmail.com Time: October 20, 2035 (00:00:00 AM) Recipient: Elle.Li2010@Starmail.com Dear Elle:  This is a scheduled, automatic delivery email. By the time you read this, my body should be at the bottom of the sea, becoming part of the ecosphere’s perpetual cycle. You and I, everyone in fact, must end this way.  Except for Susu.  It seems you already know about her, about Rourou. As for me, it’s time to die. Otherwise the police would soon discover that Rourou’s identity is forged, and investigate my past. They could eventually discover the truth, and Susu would become experimental material for a mob of eager scientists. Or she would be exposed for the world to gawk at, enduring their scrutiny, a freak on display. Either of these outcomes would destroy her. Only my death can end the police investigation.  The truth is not what you and Susu think. There’s another side to the story you can’t even imagine.  35 years ago, I was abroad doing research. I was looking forward to a happy life with my girlfriend. Then Susu suddenly wanted to break up with me. I couldn’t accept this. I abandoned everything and returned to China. Susu had become thin and pallid, withered, and she wouldn’t budge on breaking up. We quarreled, but I couldn’t change her mind. I left in anger, resolved to make a clean break with her. But as soon as I returned to America, I received a phone call from her mother, and learned the truth, which was tenfold worse than a break-up. It turned out Susu had lymphoma. It was already late-stage and terminal when discovered. Incurable. She had kept me in the dark, fabricated a reason to break up with me, to spare me real bereavement. It just happened that someone was pursuing her, a fu er dai, the heir of a nouveau riche family that made its fortune during Deng Xiaoping’s economic opening of the 1980s. But this young scion hadn’t won Susu’s heart. She led him on, using him as part of her act for me.  After learning the truth, I had only one goal: to save Susu by any means possible. Cancer is a cellular change, unbridled cell division and growth, unstoppable, that finally uses up the body’s resources. There was no feasible way to contain this horrific disease, but I had a crazy idea.  I was researching the lighthouse jellyfish. This species can, after sexual maturity, reverse its growth, a radical cellular change, the body becoming a polyp again. Young lighthouse jellyfish emerge from the polyp, and grow up all over again. Through this unceasing cycle, natural death is avoided. I was making headway in my research at the time. I’d found the gene that controls lighthouse jellyfish growth reversal. I hoped this power could check the proliferation of cancer cells.  I extracted the gene and put it in a retrovirus, which would act as a courier. I smuggled a small bottle of my elixir into China. Susu was already critically ill at this point, on her last breath, unconscious, so during our final visit there were no words.  I convinced her desperate parents to try my crazy solution. I injected her. Very soon the cocooning process began, the process Rourou saw on the video. Susu became a strange meat cocoon. Seven days later, the cocoon split open. Inside was a five-year-old girl. She looked like Susu as a child, but she didn’t have Susu’s memories. This was Karla, the product of Susu’s bodily restructuring. Only a core part of the brain was retained, and this too had degenerated.  Inside of the cocoon there was leftover human tissue and bone. I buried these remains in a desolate place where I thought they would never be found. But they were found, of course, years later, after some of them became exposed due to erosion or some other process. They were taken to be the remains of Susu’s dismembered body. This gave rise to the homicide case.  At that time, Susu’s parents and I knew we had to conceal Karla’s existence. Otherwise she would suffer the scrutiny of the world. We sent her to an orphanage, so that Susu’s parents could adopt her and make everything look official. But this presented a problem. Susu hadn’t been found, living or dead. That suiter of hers couldn’t find her. He went to the police in a rage, and I became the number one suspect. Luckily, I’d already returned to my life abroad, leaving the police with no options. I continued my lighthouse jellyfish research in Mexico, but I couldn’t replicate what I’d done to Susu. All my mammalian subjects came out of their cocoons dead. I suspected that Susu’s cancer cells had integrated with the lighthouse genes in some special way, giving rise to a miraculous result. But I couldn’t verify this.  However, those years of research yielded a by-product, an enzyme preparation derived from the lighthouse jellyfish. It invigorates human cells, promoting longevity. Although the effects are negligible compared with true lighthouse immortality, it is useful. I applied for a patent, trusting in tens of millions in profit, decades of financial security for Susu and I.  During these years, I stayed in touch with Susu’s parents. Although Karla came into the world knowing nothing, she still had some life skills and language ability. She quickly developed a four- or five-year-old mentality, even recovering some fragmented memories. Susu’s parents were getting old. Their energy was low, and Karla was coming to resemble Susu. Neighbors and old friends were beginning to talk. After I’d earned some money, I brought Karla to Mexico, so I could look after her. Karla was like a daughter to me at this point. My love for Susu had changed, but hadn’t lessened at all. I vowed to ensure her well-being.  I believed that what had survived of Susu could live on. What was left of her in Karla could persist, and grow once more to adulthood. But at sixteen (or twelve, as it were), she went to sleep and didn’t wake up. Her skin erupted with glutinous membranes that became a cocoon. This confirmed my most horrific conjecture: Susu’s lighthouse genes would continue to express their phenotype. After reaching maturity, she would revert to infancy, and this cycle could not be broken.  I arrived in America and resumed my research, attempting to free Susu—now she was Jessica—from the lighthouse cycle. Eleven years before, when Karla had first evinced signs of cocooning, I’d injected her with my newly-developed elixir, hoping it would suspend the lighthouse process, and I filmed this for research purposes. This was the video that terrified Rourou. All I did was postpone her reversion to childhood. I couldn’t stop it. And then Jessica, in her turn, also underwent rebirth, becoming Rourou . . .  Jessica’s disappearance and Rourou’s emergence caused me plenty of trouble. I was forced to return to China. What happened after that, you two both know. I continued via computer simulation to research lighthouse jellyfish genes and their effect on the human body, but to no avail. Many years passed. Now I’m old. My mental capacity is not sufficient for cutting-edge research. I know I can’t stop the next iteration of the cycle. I must let go, and count myself lucky to have been with Susu. Twelve years from now, when the next cycle begins, I will be too old to play the part of her father. What’s to be done then?  Luckily, she has come across you. Maybe I don’t need to worry about her any more.  Elle, I know you’re a kind-hearted woman. I have no choice but to entrust Susu to your care. She will probably begin the reversion in half a year or so. She will again become a child with no memories or identity. She will know nothing of any of this. Susu’s parents long ago passed away. You are the only one who can help her. Perhaps you can be the mother she always wanted. There’s about twenty million US dollars in her name: savings, real estate, and stocks. After I’m gone, it all belongs to you. The means of accessing it are attached to this email. The funds are more than enough for you to live comfortably, and take care of Susu.  I struggled for a long time with whether to tell Rourou the truth. I finally decided against it. Back when Susu concealed her illness from me, when she preferred my hate to my grief, perhaps her frame of mind was much like mine now. Before she lies dormant again, she may enjoy, for a while, the thought of growing to adulthood. She may hope to begin a normal human life, and dream. And then she will forget. She can live with you, her mother. She can be carefree and never know worry. Isn’t that a kind of happiness?  Regardless of her outer form, it is her happiness that counts.  Last words of Ling Yong.    Originally published in Chinese in Zui Mook, vol 2, April 2017.    Translated and published in partnership with Storycom.   Baoshu is a science fiction and fantasy writer. He has published five novels and dozens of shorter works since 2010, including Three Body X: Redemption of Time, Ruins of Time (winner of the 2014 Chinese Nebula Award for Best Novel), Seven States of the Galaxy: Phantom From an Ancient Empire, and \"Everybody Loves Charles\" (winner of the 2015 Galaxy Award for Best Novella). He lives in Xi'an, China.  Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "text": "8160 words, novelette\nThe Lighthouse Girl\nMarch 12, 2027\nMy name is Ling Rourou . . . right Papa? Yes, I am Ling Rourou. Today I am seven years old. Papa’s name is Ling Dong. He gave me this mini laptop as my birthday present. Papa says all I have to do is open it and speak into it, and everything I say will be saved into the diary. So now I will tell about today. Today Papa took me to Disneyland for the whole day. It was so fun! I played in a fairy-tale world, and I even flew a plane. Then Papa took me to eat a very big cake. I had a very wonderful birthday. I promise that Rourou will be with Papa forever!\nMay 8, 2027\nToday Papa took me to my first piano lesson. There were many kids my age to make friends with. I was a little scared at first, but I do not know why. When I sat down I played well. I was better than all the other kids. The teacher asked me if I studied piano, but I really cannot remember studying music before. The teacher said I play better than all the other students, even those who study. He said I could take the advanced course. Papa praised me and said I was his little prodigy. After class he took me to eat ice cream. I really love my Papa!\nSeptember 1, 2027\nToday I will go to primary school. I do not want to go, but Papa says there are many kids there to be friends with and play with.\nAt school, all the other kids came with their moms and dads. Why do I have no mom to come with me? The kids on TV have moms too. I ask Papa about this sometimes, but he never tells me where my mom is. Once I asked him and he got a bad look in his eyes and he said I do not have a mom. Why am I the only kid with no mom? I want to ask Papa, but I think it will make him unhappy. I do not dare ask. Actually, it is not so bad, not having a mom. Having my Papa is good enough.\nSeptember 6, 2027\nToday is Sunday. Papa took me to a place with many stone things sticking out of the ground. Papa said everyone goes to sleep under stones like those, eventually. I was surprised. It seemed like it would be really boring, sleeping there. Papa took me to one of the stone things and we stood before it. Papa said my mom was lying below it. I saw her picture on the stone, and she was more beautiful than any of the other children’s moms. I was so happy. I told Papa to wake Mom up, so I could talk with her. Papa cried. He told me Mom could not talk anymore. But he said she will be with me forever, going wherever I go. I do not understand. Papa cried more. I felt very bad. My heart felt like it would break, so I cried too.\nSeptember 20, 2027\nToday was the first day of English class. The teacher taught us to sing the letters of the alphabet. I was singing along, and suddenly an English sentence came out of my mouth. I said, “My name is Jessica. What’s your name?” The teacher asked if I had studied English in kindergarten. But I couldn’t remember if I had been to kindergarten. I couldn’t remember anything before I was five years old. The teacher said my English is very good, like a native speaker’s. She suggested I participate in an English competition for children and early teens. I was so happy. The teacher said she will call me Jessica from now on, since I already have an English name. I asked Papa about this when I got home. He just said I’m his little genius, but I don’t understand. There’s so much I don’t remember, so how can I be a genius?\nMarch 12, 2028\nToday was my birthday, and Papa took me to the seaside. We rode on a fancy yacht and ate delicious food. Papa gave me one of those walking, talking robot dolls I always see on TV. I love my Papa! Too bad Mom couldn’t be there with us. I wanted to go to that place from last year and see her, but Papa said Mom’s soul is always with us, so there’s no need visit her stone. I asked Papa what Mom’s name was. He said she didn’t have a name. I asked how she couldn’t have a name. “You’re named Ling Dong,” I said. “I’m Ling Rourou. Mom must also have a name.” At last Papa told me her name was Susu. Such a pretty name!\nApril 5, 2032\nToday is Tomb Sweeping Festival. I lied to Dad, saying my Lili toy had wandered off again, but actually I went to see Mom. The last time I saw her was five years ago. I still remembered the place clearly, even though Dad had never brought me back for a second visit. It must be too difficult for him to see the grave, a trigger for his grief. But now I’m grown up. I can go on my own, and I did. I had to see Mom. There was so much I wanted to say to her. But when I arrived at the cemetery I was dumbstruck. The place was much bigger than I remembered it. There were so many gravestones, and I didn’t know how I was going to find Mom. I wandered, crossing the grounds several times. I was about ready to give up, but I finally saw the picture, Mom’s face in the stone, just as I remembered. She must have guided me to her grave, watching from up in heaven. She looked so young in the image, no more than twenty. So beautiful. She kind of looked like me.\nBelow the image it said, ‘Grave of Chen Susu.’ It had been erected by Mom’s parents, my maternal grandfather and grandmother. When did Mom pass away? The gravestone didn’t say, which was strange. The cemetery seemed old. The surrounding graves were all dated, and were thirty to forty years old. Mom couldn’t have died that long ago. I’m only thirteen. When exactly did she die?\nNow it’s night and I’m back, and Dad is still in his study, sitting at his computer, trading stocks and so on. I want to ask him about Mom, but it’s bound to make him unhappy. Better to let it go.\nApril 7, 2032\nDad went out shopping tonight. I seized the opportunity to search through all the photos in the house. I couldn’t find any of Mom, but I did discover something strange: There are plenty of photos of me after five or six years old, but before that, absolutely nothing. None of me as an infant, and of course none of Mom and I. How can this be? For a few years now, I’ve been thinking about my life before age five. I’ve never recalled anything specific, but there are traces, vague impressions of living in a foreign country, speaking English every day, and being named Jessica. And other friends. Who am I? Where am I from? I hide in my blankets and ask myself questions, and suddenly I feel very afraid.\nApril 13, 2032\nI ran into an old couple today, travelers who asked me for directions. They were amiable and doting old folks. I suddenly had a strange feeling that they were my parents. This was frightening. The husband was short, round-faced, and bald, nothing like Dad. Why did I feel like this man was my father? If I close my eyes it’s like I can recall this other couple, my real parents. This feeling is so scary.\nMay 16, 2032\nI told Lili about my fears. She thought for a bit, then said, “I figured it out! Your father isn’t your biological father.” This seems quite plausible. So, at one time I had other parents, and I lived abroad. Okay, but why did Dad . . . Ling Dong . . . adopt me when I was four or five? There are no old photos of me. I’ve been able to play piano and speak English since I was a kid. I must have learned these things in my previous country. Then Chen Susu is probably not my biological mother. Maybe Dad just chose a gravestone at random, to deceive me. My biological parents, are you still alive? If you’re alive, where are you? Do you know I’m living in a foreign land, following a new father through life?\nMay 19, 2032\nIt turns out I’m the world’s silliest fool. Today I reached my breaking point. I charged into Dad’s study and said, “Am I really your daughter? Where are my biological parents?”\nDad was angry at first, but as he heard me out, he began to smile. “You and Lili watch too much TV,” he said. We had spun fantasies based on serial drama plots, he claimed. “We did live in America,” he admitted, “and your English pet name back then was Jessica. When you were four you had a high fever, so you can’t remember your early childhood.”\n“But why don’t you have photos of me from then?” I said.\n“No photos?” he said, incredulous. He turned on his computer, and sure enough there were my baby photos. Dad said he took many photos back then, but during the move he lost some hard copy albums. But there were still many photos in the computer. I saw a family portrait of me, Mom, and Dad. Mom was hugging me, happily snuggled against Dad’s side.\n“If she’s not your mother,” Dad said, “why do you two look so alike?”\nI couldn’t deny it. And Dad was so good to me. How could I not be his daughter?\n“She fell ill and died that year,” Dad said. “You were still very small.” He choked, sobbing. I told him to stop talking, and I hugged him. I really am such a fool!\nApril 7, 2035\nSomething wonderful and intriguing happened today.\nA new teacher came to my middle school, 28 or 29 years old, dressed in ostentatious Western fashion. She didn’t teach my class, but when she saw me in the office, she unexpectedly blurted out, “Jessica!” Then she seemed to remember herself. She smiled and said, “Sorry” in English, then in Chinese, “I made a mistake. I thought you were . . . but it’s impossible.”\nMy heart raced. I said, “What a coincidence. My English name is Jessica.”\nThis amazed her, and we struck up a conversation. It turns out she’s named Elle. She’s an English teacher from Los Angeles, of Chinese ancestry. She explained that the Jessica she’d been thinking of had been a childhood playmate, a year older than her. They’d grown up together. But Jessica moved when she turned fifteen. That was ten years ago. Obviously, I can’t be Elle’s Jessica.\n“So why did you call me by her name?” I asked.\n“Because you look so much like her. Like my memory of her, I mean. Like two peas in a pod. But you must be twelve or thirteen years younger than her. So, there’s no way . . . you can be her.”\nI’m still baffled and amazed. Although I can’t possibly be Elle’s Jessica, this was such a strange encounter. I asked Elle if she had an old photo of Jessica. Elle said she did, on her computer. She said she will bring it tomorrow for me to see.\nApril 8, 2035\nI’m ill. High fever of forty degrees. No school for me today. Went to the hospital, doctor couldn’t say what was wrong with me. All he could do was reduce my fever to help me convalesce. I might not be able to go to school tomorrow either. I really want to meet Elle again. I still haven’t seen Jessica’s photo.\nApril 24, 2035\nMy illness has lasted two weeks. Dad hasn’t let me go to school. I asked him if I’m fatally ill, and he said it is curable, but it will take a long time. Maybe I can return to school next term, but I’m still scared. I feel like he’s holding something back. Would he lie to me? Maybe I’m going to die.\nJune 16, 2035\nThat last entry was all pointless worrying. I’m feeling much better. This past month, anyway, I’ve had no problems. I asked Dad if I can return to school, but he said that since I’ve already deferred my studies for two months, I wouldn’t be able to catch up. He wants to take me to Australia for a vacation, to relieve the boredom, and next semester transfer me to an elite private school. When I heard I was going to Australia I was very excited. But I hate to part with my classmates and teachers. Xixi, Mingming, and also teacher Elle. I was just getting to know her, but I feel like we’re kindred spirits. I said I want to return to school next semester, that I can make up my missed classwork. Dad said I could go and ask my teachers, but I think he’s just trying to keep me happy.\nSeptember 11, 2035\n#private mode#\nI want this part of my diary hidden. I need privacy. I . . . don’t know whom I should believe.\nWe just got back from Australia, and today I got a message from Elle. She found me on the class chat group. She’d heard about my illness and wanted to know how I’m doing. I told her I’m fully recovered. She sent me some photos of she and Jessica. In one they were standing on a suburban lawn, smiling, expressions bright. Elle hadn’t been exaggerating. Jessica looked like my twin!\nBehind them was a steepled church. It seemed familiar, though I couldn’t say why. Suddenly a name echoed in my mind: St. Michael. I asked Elle if the church was named St. Michael’s, and she started. “God,” she said, “how did you know that?”\nI don’t know how I knew, but coincidence can’t explain it. Jessica and I are somehow deeply connected. Maybe she’s my older sister. My biological mother? Neither of those seem right. I want to ask Dad what’s going on, but then I wonder: How did I recover from that serious illness so suddenly? Does Dad not want me to meet Elle? Was he feeding me some drug or poison on the sly? But how could he have known about Elle? I never told him. Maybe he’s been secretly reading my diary. Maybe he’s been reading it all along. Three years ago, when Lili told me Dad was not my biological father, he knew I would start asking questions, and he showed me those photos to quell my doubts. If he was able to prepare beforehand, fabricating some digital photos would be easy. If Dad has been lying to me all along . . . The thought of it could drive me mad!\nSeptember 12, 2035\n#private mode#\nI couldn’t get to sleep all night. I didn’t fall asleep until dawn, and then I was up at nine.\nIn the afternoon, Elle and I continued our voice chat. “Do you know who your father is?” she said. I didn’t know how to answer this. Dad was . . . Dad, my father.\n“I mean, do you know about his work?”\nDad never goes to work. I know there’s a big computer in his study, but I don’t know what he busies himself with. On the screen, all kinds of data and diagrams constantly stream and pulse. He says he trades in stocks and foreign currencies. I’ve always been impressed with his ability to provide for us by just sitting in his study and trading. As far as I can remember, our little family has never wanted for money.\nI summarized all this for Elle. She asked if I had a photo of Dad. Of course, I have many. I opened my hand device and opened a batch. Most were of he and I together. I sent a few to Elle. She immediately looked surprised.\n“What?” I said.\n“I’ve met your father. He’s . . . he’s Jessica’s father!”\nWhat I felt then was like vertigo. Gasping for breath, I said, “How is that possible?”\n“Back then he was about forty years old,” Elle said, “still kind of handsome. He worked in biological research, as far as I know. He was reclusive, didn’t mix with neighbors. I only ran into him twice, when Jessica brought me to her house to play.”\nAlthough Elle doesn’t have a photo of Jessica’s father from that time, her description of him goes a long way toward making me believe. Ultimately the question is . . . what are Jessica and I to each other? Is she really my big sister? Even if we’re sisters, our resemblance is uncanny, especially because we can’t be twins. And how or why did we end up with the same name?\nElle continued asking me about Dad, but I had no answers. It surprised me how little I knew about the most important person in my life. Where is he from? What exactly does he do every day? How did he make me? I know nothing.\nElle said, “Are you sure he’s your biological father? Honestly, you two don’t resemble each other very much.”\nMy heart pounded in my chest. This was a doubt I’d harbored for years. I was like someone who wakes from a horrific nightmare, discovers everything is back to normal, passes years in comfort, but at last discovers that reality is the dream, and the nightmare is real . . .\nElle wants me to find a way to get a few of Dad’s hairs. A DNA test could determine if we are blood-related.\nSeptember 15, 2035\n#private mode#\nDad is very against me going back to school. He wants to take me to Paris to live for a few years. Paris! Once upon a time, this news would’ve driven me mad with joy. But now it just leaves me cold. Why does Dad want to flee China? Is he afraid I’ll discover something? Or does he want to take me abroad for some dreadful purpose I can’t imagine?\nAlthough Dad is Chinese (I think?), he doesn’t seem to have relatives here. And he has very little contact with the people around us in our daily life. Is he an escaped convict? A spy? Or he could be a homicidal maniac . . . If I keep obsessing on this, I’ll go crazy.\nIf I can snatch a few hairs off his pillow, if that can just go smoothly, I will get them to Elle. And I’ll have an answer soon enough. But I already have a premonition . . . that the answer is something I’ll regret knowing.\nSeptember 27, 2035\n#private mode#\nAfter what seemed like a century, the DNA test results finally arrived. Elle transferred them to me via her hand device. The results confirmed my worst doubts: Dad and I are not blood-related whatsoever. I hid in the bathroom and cried for a while. If Dad asks what’s wrong, I’ll say I’m sad to leave my Chinese friends.\nElle says she’s found a private investigator to look into Dad’s background. But this means I must endure, and worry, and obsess in secret, because I don’t want to alert Dad. He’ll take me to France next month. If we get there and there are things I still haven’t discovered about him, what should I do then?\nOctober 9, 2035\n#private mode#\nElle wants to meet with me today. She says she has something important to tell me.\nWe met in a cafe. Elle produced a thick folder of data, and with a grave expression handed it over. The top page was the CV of someone named Ling Yong. I wondered what this had to do with Dad. Elle sensed my misgivings, and explained:\n“Ling Yong is Ling Dong, your . . . father. Or perhaps it’s better to say your foster father. He changed his name. He’s lived in a few different countries, not easy to track. But he left behind traces, allowing the detective to learn his identity.”\n“Originally named Ling Yong, born in the 1970s. In 1991 he entered Yanjing University in Beijing, School of Life Sciences. In 1995 he went to the US to study at the University of Pennsylvania for a PhD in biology. He got his doctorate in 2001. Later, at the National University of Mexico, he did postdoctoral research, investigating the DNA of a Caribbean jellyfish species . . . ”\nI looked through incomprehensible pages of data. The whole thing seemed to be this Ling Yong person’s dissertation, mostly written in a foreign language. Was this Dad? He seemed like a total stranger.\nBut a familiar name emerged soon enough.\n“When he was at Yanjing University, he met a female student named Chen Susu. Yes, this was your so-called mother. They fell in love quickly, and after graduation they got engaged.”\nDad had never lied about this, at least. Chen Susu was his wife. But was she my mother? Maybe she was, and someone else was my father? After that engagement, almost twenty years passed before I was born. What had gone on in those years?\nElle continued: “Chen Susu did not go abroad with Ling Yong. She stayed in China and continued her studies. This was the 1990s. Internet and hand devices were still in their infancy. It wasn’t easy for these young lovers to maintain contact, which strained their relationship. It’s been over thirty years, so we don’t know exactly what happened. All we know for sure is that Chen Susu was courted by the scion of a rich family. Eventually she chose to break up with Ling Yong, who hurried back to China to save the relationship. They were heard quarreling. Ling Yong then returned to America. Not long after, Chen Susu was reported missing.”\nI was forgetting to breathe. My own thoughts were making me sick.\n“The police suspected Ling Yong in connection with Susu’s disappearance. Immigration records revealed that he returned to China right when she went missing. Then he quickly left again. Police suspected his love turned to hate, that he kidnapped her, and that Chen Susu had probably been murdered.”\n“No!” I blurted. “No matter what they say, Dad’s not capable of murder!”\n“If only that were true,” Elle said with a sigh. “Police suspected him, but he was out of the country. Summoning him for interrogation would have been difficult, and there was no conclusive evidence to get him extradited. At last the matter was dropped. Ling Yong might’ve had a guilty conscience, or at least a fear of justice. At any rate, he didn’t return to China for many years. Chen Susu remained missing. Three years later, a hiker in a remote mountain forest discovered the remains of a body. Scattered remains. The body had been . . . dismembered. The head was missing. I’m sorry, Rourou, these details are horrible. Some clothes were found nearby, and they were confirmed to be Chen Susu’s. DNA tests later confirmed the remains were Chen Susu’s. She’d been murdered three years before.”\nIt was like I’d fallen into an ice cave. Unable to control my shivering, I said, “You can’t mean to say that my Dad . . . that he . . . ”\n“I don’t know. The investigation didn’t turn up definitive proof. Chen Susu’s parents naturally suffered and grieved. Her remains were cremated, and then interred . . . in that cemetery plot you visited. Strangely enough, Ling Yong, a few years later, was witnessed bringing a seven- or eight-year-old girl to visit the grave. A Chinese girl, it was reported.”\n“Jessica?” I was pretty sure of this guess.\nBut I’d guessed wrong. “No, this was in 2005 or so. Jessica hadn’t been born yet. This child was named Karla. We did everything possible to find pictures of her, and came up with just one. Look. She and Jessica, and you . . . identical!”\nI felt like I was looking at my own childhood face. I felt like I was suffocating.\n“Rourou, I have an awful theory. Please try to remain calm. I think you and Jessica and Karla are clones of Chen Susu. Cloning technology emerged a long time ago. Although human cloning has always been forbidden, for a competent biologist like Ling Dong, it would not be difficult.”\n“Human clones . . . ” I only understood a bit of this concept from science fiction movies. “You mean to say that my father . . . Ling Dong . . . Ling Yong . . . took cells from Chen Susu, and used them to create us? Why would he do this?”\n“He was obsessed with Chen Susu, to a sick degree. She betrayed him, or he felt she had, so he killed her. But he couldn’t stand being parted from her, so he used her cells to create children that looked just like her.”\nI couldn’t process this. I struggled to untangle my confusion. “If you’re right about him, one clone would be enough. Why make three of us?”\nElle seemed even more uncomfortable. She lowered her voice. “This is what I wanted to tell you in particular, Rourou. You’re in danger! Karla and Jessica both went missing, one after another. They both went missing at sixteen. Ling Dong moved to a new country each time. The people who knew Karla and Jessica thought they moved with him, of course, but that’s not the case! Only Ling Dong knows what happened to them.”\nI shivered. “He says he wants to take me to France. Could it be that . . . ”\n“We can’t rule out the possibility.”\n“What should I do? Report to the police?”\nElle considered, then grudgingly shook her head. “Approaching the police would be useless. At the moment, it’s all conjecture. There’s no concrete proof. The police would never believe such a bizarre story. But you can’t go home either. So how about this . . . for the time being, you come with me. You should have an American passport. I can take you to the States. Ling Dong won’t be able to find you, guaranteed.”\nI hesitated. This was Elle’s side of the story. Maybe Dad was wrongly accused. Maybe there was more information. For instance, if I was a clone, why did I seem to have some of Jessica’s memories?\n“I still want to think it over,” I said. “I need to be sure.”\nElle didn’t press me. “Then please be careful. Prepare for the worst. If anything happens, contact me immediately.”\nOctober 10, 2035\nMy home was starting to seem unfamiliar and sinister. But I was determined to be strong, to act as if nothing had happened, feign nonchalance, and keep Dad in the dark. No, to keep Ling Dong in the dark. Today, the aunty who usually cooks for us asked for leave. Dad busied himself in his study all day. At dinnertime I suggested we go out, so we ended up at a nearby restaurant. We sat down and heard the man and woman at the next table arguing. It was hard to understand, but it seemed a long-distance relationship had led to the young woman being unfaithful. She’d been caught, and now wanted to break up. The young man slapped her in the face, and the girl ran out crying.\nOf course, this reminded me of Ling Dong and Chen Susu, and their long-ago romance. I struggled to maintain my composure. Ling Dong had supposedly murdered Chen Susu over a dispute like the one we’d just seen. I thought maybe I could sound him out. “Dad,” I said, “can you believe that girl? How can she be so . . . Cheating, lying, deceiving, it’s pathetic. I think deceivers deserve to die.”\nHe pounded the table. “Yes,” he said, voice low and forceful, “they really do. So why haven’t I . . . ” He stopped himself, trembling. I’d clearly provoked him. This seemed to confirm Elle’s suspicion: he really was harboring deep-seated hostility toward Chen Susu.\nI was shocked, angry, and scared. Was he capable of violence here and now? I had to force a smile. “Never mind Dad. Why get so riled up over other people’s problems? Come on, lets drink a toast.”\nLing Dong sighed and started drinking with me. I tried to lead him out of his foul mood, chatting about our usual father-daughter things, former birthday celebrations, where we’d gone together for fun, the mischievous pranks I’d played on him. All this did was remind me how many warm memories we shared. These weighed on me in our grim new context. The memories were the same, but he had changed.\nLing Dong couldn’t seem to recover. He looked to be stewing in a vile temper. He was drinking rice liquor as if his life depended on it, cup after cup. When we finally left he was three sheets to the wind, so we took a taxi home. He went straight to the sofa and collapsed on it, and began to snore thunderously.\nI considered Elle’s theory more or less confirmed. Being back in this house was only increasing my danger. I sent Elle a message, then went upstairs and got my passport, and some cash and clothes, wanting to quietly slip away. But when I passed by the study door, I saw it had been left unlocked. Inside, the computer was still on. I couldn’t help pausing there, one foot in the door. Ling Dong spent every day in there. What was he up to? Was he really just speculating in stocks and currencies? What secrets might be concealed in there?\nI glanced toward the living room. Ling Dong was still snoring, well intoxicated. I guessed he’d be asleep until tomorrow morning. I summoned my courage and entered the study, and examined the computer, but just now the machine was locked. A dialog box requested a password. I tried several—Ling Yong, Susu, Jessica—all to no effect. I was forced to give up. I examined the desk, and one corner was indeed occupied by financial records, and books on the stock market, but they looked ignored, the books pristine. Spread out in the center of the desk were papers in English. I paged through a few. It all seemed biology-related. I could barely understand, but one strange word recurred throughout all the papers: Turritopsis dohrnii.\nI opened my hand device and looked up the translation. The Chinese word that popped up was dengta shuimu, 灯塔水母, ‘the lighthouse jellyfish.’ A photo of the bioluminescent creature illuminated this name. In English it was ‘the immortal jellyfish.’ A brief introduction was attached: “A species of jellyfish four to five millimeters in size, after sexual maturity they are capable of returning to their sexually immature colonial polyp stage, and they can repeat this cycle indefinitely.”\nI didn’t really understand this, only gathering that it was an odd species of jellyfish. Could all these treatises be about one species? I recalled something Elle said yesterday. Ling Dong was indeed a researcher of jellyfish. That part of the investigation report was true. But he hadn’t been a biologist for many years, so why was he still reading these kinds of papers?\nI kept paging through the material. I gleaned that it concerned this jellyfish’s physiology and genetics, but I didn’t understand the purpose. The rest of the study yielded no more clues, and I considered giving up. But then my gaze fell upon the computer screen again, and the password field. I sat down in front of the computer, and typed in Turritopsis dohrnii, but once more got an error message. I had just decided to leave when another idea struck. I typed in the same species name, but in all capital letters, and as one word: TURRITOPSISDOHRNII.\nTo my surprise, the computer unlocked!\nI leaned in close and saw the software Ling Dong had been using all these years. I couldn’t really understand it, but it obviously had nothing to do with stocks. I studied it for quite a while, until I recognized organic molecule structures, and simulations of chemical reactions. It all had something to with the lighthouse jellyfish, but I couldn’t understand the specifics.\nI minimized the program, and searched the computer. This time I quickly found what I was seeking: four folders labeled S, K, J, and R.\nFour names wheeled in my mind: Susu, Karla, Jessica, and . . . Rourou.\nI opened S first, my heart hammering away. There were many pictures and videos, all from around forty years ago, taken during the time of Chen Susu and Ling Dong’s romance. The K file documented the growth and life of a small girl into her teens. She looked just like me, though she wore different clothes and hairstyles, and lived in another country. This was Karla. Jessica’s file was similar, but she grew up years after Karla.\nI wondered if we were really clones. I got lost in a fever dream, struggling not to lose hope, to keep from drowning.\nI opened a video. Jessica was seven or eight years old, celebrating her birthday with Ling Dong—very similar to my own childhood. Only this was twenty years ago. Another video showed Jessica dancing in a school performance. Another showed she and Ling Dong fishing.\nI didn’t want to see any more of these fragments of daily life. I’d decided to stop when I found a large batch of videos that seemed different. I opened one marked January 8, 2024, and found something horrific:\nJessica’s naked sixteen-year-old body on a bed, in a place resembling a laboratory. She was apparently unconscious. Ling Dong approached her with a syringe. Jessica woke, struggled a bit, shouted something, but Ling Dong restrained her. She couldn’t overpower him. After the injection, the girl curled into a ball, and sank back into sleep. Ling Dong left soon after. The video was uneventful for a long time. I opened the next video, and saw that Jessica was still unconscious. Rashes of some kind had erupted on her skin. I skipped several videos, and the rashes had become strange mucous membranes, layers covering Jessica’s body.\nDays passed, and the transformation grew more extreme. Jessica was no longer human-shaped. The layered membranes had become a sort of cocoon. Her head and face were no longer visible. Ling Dong came every day to observe. About a month later, March 12 as it happened, the cocoon split open, and thick blood plasma—and god knows what other viscous substances—flowed out. A small head emerged. Ling Dong heard the ripping sounds, entered the scene, tore away the cocoon, and picked up a blood-covered child. It looked four or five years old.\n“Susu,” Ling Dong said. I couldn’t tell if his tone was sad or joyous. “You really are reborn. What’s a good name for you this time? How about the name of the kitten we raised together . . . Rourou . . . ”\nSusu . . . Rourou?\nThere I was, short of breath yet again. I don’t know how long I stood there dumbfounded. Gazing down at the papers spread on the desk, the words Turritopsis dohrnii again caught my eye.\n“ . . . after sexual maturity, they are capable of returning to their sexually immature colonial polyp stage, and they can repeat this cycle indefinitely.”\nI finally understood the meaning of this sentence. The lighthouse jellyfish could return to infancy from maturity, and it could do so indefinitely, cycling between the two states, living forever.\nI realized I was not a clone.\nI was Chen Susu, and Karla, and Jessica.\nLing Dong, in order to punish Chen Susu, made her—me—into a lighthouse jellyfish. His injection caused her to revert to a four or five year old. Then she grew up again, until she was nearly full-grown, and then back she went. Back I went. Forever under his control and influence. With each new incarnation, I’d lost my memories, allowing him to treat me as a daughter. Until the kidnap victim finally rose up to understand the truth.\nI was alive, but forever unable to become an adult. I had died, and then I’d returned to the world, and lived with a deranged demon. This was Ling Dong’s penalty for “my” betrayal of him. The world’s most horrific punishment.\nI was shaking, could barely stand. I took a few steps back from the desk, and bumped into someone behind me. I turned and found myself looking right into Ling Dong’s gloomy face.\n“How did you get in here?” he said, glancing at the video still playing on the computer. His panicked expression twisted into something monstrous.\nI pushed him with all my might, and ran out of the study.\n“Rourou,” he said, grabbing me. “Listen!” I snatched a humidifier off a table and smashed him in the head with it. He went down, but didn’t lose consciousness like they do in movies. He was struggling to get up.\nI fled recklessly outside. Turning a corner at an intersection, I saw Elle’s car. She’d been waiting there a long time. I got into the car and Elle started it. “To the airport,” she said.\n“No,” I said. “A police station. I found proof. I want that criminal to pay for everything he’s done to me.”\nOctober 12, 2035\nElle and I reported to the police yesterday. The officers rushed to my former home, but Ling Dong had destroyed the incriminating evidence. Everything on the computer was deleted. Ling Dong tried to paint my claims as the wild fantasy of a young girl. He nearly succeeded. The police didn’t believe my bizarre story.\nBut Ling Dong was the Ling Yong of years ago, a suspect in Chen Susu’s death. And I was not his biological daughter. The police refused to hand me over to him, instead sending me to a domestic violence shelter. They’ve begun to investigate Ling Dong’s background. He’s finished!\nOctober 15, 2035\nLing Dong has gone missing. The police say he might seek me out for revenge. They’ve advised me to be careful and vigilant. Elle says she can soon take me to America, where, she believes, Ling Dong will never be able to find me. But I’m still very scared. Scared that someday, once more, I will fall under his control. The police had better hurry up and find him!\nOctober 24, 2035\nLing Dong is dead . . .\nHis body was discovered at sea, already dead many days. He probably killed himself the day he went missing.\nWhen I heard the news I cried, loud and long. Just a month ago, I couldn’t have imagined any of this. This grim end for him. Now he was dead, a demon that would fade away. But he’d been my Dad, my Papa. Like the demon, my father would never return.\nThe police believe Ling Dong, obsessed with Chen Susu, kidnapped a girl of unclear origin and background, to fill the void. Of course, there are many things they can’t explain, but with Ling Dong dead, the case is effectively closed.\nThere are journalists with clever noses snooping around behind the scenes. Elle urged me not to tell anyone about the lighthouse jellyfish. If the world believed it, I might be taken away by some agency for scientific experimentation. I would certainly be reduced to a media object, sensationalized and slandered for a lifetime. I feel Elle is right about all this. Actually, I’m starting to doubt myself, to wonder if the video I saw that night was real.\nElle wants a fresh start for me in America. I don’t want to spend her money, but she says she’s got a lot of it, so it doesn’t matter. “Let me help you,” she said. “We’ve been friends for a long time, after all.”\nSo, I acquiesced. I can only hope that a new start is possible for me.\nSender: Turritopsisling@Kmail.com\nTime: October 20, 2035 (00:00:00 AM)\nRecipient: Elle.Li2010@Starmail.com\nDear Elle:\nThis is a scheduled, automatic delivery email. By the time you read this, my body should be at the bottom of the sea, becoming part of the ecosphere’s perpetual cycle. You and I, everyone in fact, must end this way.\nExcept for Susu.\nIt seems you already know about her, about Rourou. As for me, it’s time to die. Otherwise the police would soon discover that Rourou’s identity is forged, and investigate my past. They could eventually discover the truth, and Susu would become experimental material for a mob of eager scientists. Or she would be exposed for the world to gawk at, enduring their scrutiny, a freak on display. Either of these outcomes would destroy her. Only my death can end the police investigation.\nThe truth is not what you and Susu think. There’s another side to the story you can’t even imagine.\n35 years ago, I was abroad doing research. I was looking forward to a happy life with my girlfriend. Then Susu suddenly wanted to break up with me. I couldn’t accept this. I abandoned everything and returned to China. Susu had become thin and pallid, withered, and she wouldn’t budge on breaking up. We quarreled, but I couldn’t change her mind. I left in anger, resolved to make a clean break with her. But as soon as I returned to America, I received a phone call from her mother, and learned the truth, which was tenfold worse than a break-up. It turned out Susu had lymphoma. It was already late-stage and terminal when discovered. Incurable. She had kept me in the dark, fabricated a reason to break up with me, to spare me real bereavement. It just happened that someone was pursuing her, a fu er dai, the heir of a nouveau riche family that made its fortune during Deng Xiaoping’s economic opening of the 1980s. But this young scion hadn’t won Susu’s heart. She led him on, using him as part of her act for me.\nAfter learning the truth, I had only one goal: to save Susu by any means possible. Cancer is a cellular change, unbridled cell division and growth, unstoppable, that finally uses up the body’s resources. There was no feasible way to contain this horrific disease, but I had a crazy idea.\nI was researching the lighthouse jellyfish. This species can, after sexual maturity, reverse its growth, a radical cellular change, the body becoming a polyp again. Young lighthouse jellyfish emerge from the polyp, and grow up all over again. Through this unceasing cycle, natural death is avoided. I was making headway in my research at the time. I’d found the gene that controls lighthouse jellyfish growth reversal. I hoped this power could check the proliferation of cancer cells.\nI extracted the gene and put it in a retrovirus, which would act as a courier. I smuggled a small bottle of my elixir into China. Susu was already critically ill at this point, on her last breath, unconscious, so during our final visit there were no words.\nI convinced her desperate parents to try my crazy solution. I injected her. Very soon the cocooning process began, the process Rourou saw on the video. Susu became a strange meat cocoon. Seven days later, the cocoon split open. Inside was a five-year-old girl. She looked like Susu as a child, but she didn’t have Susu’s memories. This was Karla, the product of Susu’s bodily restructuring. Only a core part of the brain was retained, and this too had degenerated.\nInside of the cocoon there was leftover human tissue and bone. I buried these remains in a desolate place where I thought they would never be found. But they were found, of course, years later, after some of them became exposed due to erosion or some other process. They were taken to be the remains of Susu’s dismembered body. This gave rise to the homicide case.\nAt that time, Susu’s parents and I knew we had to conceal Karla’s existence. Otherwise she would suffer the scrutiny of the world. We sent her to an orphanage, so that Susu’s parents could adopt her and make everything look official. But this presented a problem. Susu hadn’t been found, living or dead. That suiter of hers couldn’t find her. He went to the police in a rage, and I became the number one suspect. Luckily, I’d already returned to my life abroad, leaving the police with no options. I continued my lighthouse jellyfish research in Mexico, but I couldn’t replicate what I’d done to Susu. All my mammalian subjects came out of their cocoons dead. I suspected that Susu’s cancer cells had integrated with the lighthouse genes in some special way, giving rise to a miraculous result. But I couldn’t verify this.\nHowever, those years of research yielded a by-product, an enzyme preparation derived from the lighthouse jellyfish. It invigorates human cells, promoting longevity. Although the effects are negligible compared with true lighthouse immortality, it is useful. I applied for a patent, trusting in tens of millions in profit, decades of financial security for Susu and I.\nDuring these years, I stayed in touch with Susu’s parents. Although Karla came into the world knowing nothing, she still had some life skills and language ability. She quickly developed a four- or five-year-old mentality, even recovering some fragmented memories. Susu’s parents were getting old. Their energy was low, and Karla was coming to resemble Susu. Neighbors and old friends were beginning to talk. After I’d earned some money, I brought Karla to Mexico, so I could look after her. Karla was like a daughter to me at this point. My love for Susu had changed, but hadn’t lessened at all. I vowed to ensure her well-being.\nI believed that what had survived of Susu could live on. What was left of her in Karla could persist, and grow once more to adulthood. But at sixteen (or twelve, as it were), she went to sleep and didn’t wake up. Her skin erupted with glutinous membranes that became a cocoon. This confirmed my most horrific conjecture: Susu’s lighthouse genes would continue to express their phenotype. After reaching maturity, she would revert to infancy, and this cycle could not be broken.\nI arrived in America and resumed my research, attempting to free Susu—now she was Jessica—from the lighthouse cycle. Eleven years before, when Karla had first evinced signs of cocooning, I’d injected her with my newly-developed elixir, hoping it would suspend the lighthouse process, and I filmed this for research purposes. This was the video that terrified Rourou. All I did was postpone her reversion to childhood. I couldn’t stop it. And then Jessica, in her turn, also underwent rebirth, becoming Rourou . . .\nJessica’s disappearance and Rourou’s emergence caused me plenty of trouble. I was forced to return to China. What happened after that, you two both know. I continued via computer simulation to research lighthouse jellyfish genes and their effect on the human body, but to no avail. Many years passed. Now I’m old. My mental capacity is not sufficient for cutting-edge research. I know I can’t stop the next iteration of the cycle. I must let go, and count myself lucky to have been with Susu. Twelve years from now, when the next cycle begins, I will be too old to play the part of her father. What’s to be done then?\nLuckily, she has come across you. Maybe I don’t need to worry about her any more.\nElle, I know you’re a kind-hearted woman. I have no choice but to entrust Susu to your care. She will probably begin the reversion in half a year or so. She will again become a child with no memories or identity. She will know nothing of any of this. Susu’s parents long ago passed away. You are the only one who can help her. Perhaps you can be the mother she always wanted. There’s about twenty million US dollars in her name: savings, real estate, and stocks. After I’m gone, it all belongs to you. The means of accessing it are attached to this email. The funds are more than enough for you to live comfortably, and take care of Susu.\nI struggled for a long time with whether to tell Rourou the truth. I finally decided against it. Back when Susu concealed her illness from me, when she preferred my hate to my grief, perhaps her frame of mind was much like mine now. Before she lies dormant again, she may enjoy, for a while, the thought of growing to adulthood. She may hope to begin a normal human life, and dream. And then she will forget. She can live with you, her mother. She can be carefree and never know worry. Isn’t that a kind of happiness?\nRegardless of her outer form, it is her happiness that counts.\nLast words of Ling Yong.\nOriginally published in Chinese in Zui Mook, vol 2, April 2017.\nTranslated and published in partnership with Storycom.\nBaoshu is a science fiction and fantasy writer. He has published five novels and dozens of shorter works since 2010, including Three Body X: Redemption of Time, Ruins of Time (winner of the 2014 Chinese Nebula Award for Best Novel), Seven States of the Galaxy: Phantom From an Ancient Empire, and \"Everybody Loves Charles\" (winner of the 2015 Galaxy Award for Best Novella). He lives in Xi'an, China.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "source": "https://clarkesworldmagazine.com/bao_01_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Lighthouse Girl by Baoshu, translated by Andy Dudak"}