{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "LFuhZXy6oCGmZHqRkGThyxpPgTc=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: After the Dirty Dozen  It looks like October has swung back around already. That means Clarkesworld has turned twelve and is now in its thirteenth year. Good thing we’re not superstitious! However, it occurs to me that I’m a bit overdue on another, “where we’re going” editorials, so this seems like a good time to jump in and do that.  Six years—or half the life of the magazine—ago, I added reprints to each issue as a way of saying “thank you” for the kindness readers showed my family and I after my heart attack. Gardner Dozois was brought in as Reprint Editor and he handled that side of the house until his passing earlier this year. Since then, I’ve been selecting the reprints and giving some thought to their future place in Clarkesworld.  At any given time, we have a specific goal that new subscriptions or Patreon pledges are put towards. In the past, this has included things like more stories, an equipment budget for the podcast, pay raises for staff, etc.. The new goal is to begin converting those reprints to slots for more original fiction. Given the significant difference in costs, this will slowly fade in as the number of supporters increases. Unless everyone manages to surprise me, it will be some time before we’re able to replace both reprints with originals, therefore I’ve broken it into chunks. The first target converts one reprint to an original in every other issue.  The reason for moving in this direction is simple. Original fiction is the heart of Clarkesworld. The more space we have for it, the more flexibility we have in what we can publish. You might have noticed that we quietly experimented with a few novellas in the past year. We’d like to be able to up our word count limits and do that more often. New—and different—voices are also important to us. Being able to take more stories from open submissions is a very big positive in our eyes. We never solicit original fiction, so this actually creates more opportunities for us to publish new authors.  But why remove reprints when you can just add more stories?  \r\n  Moving money from the reprint budget to the original fiction budget allows us to incorporate these changes much more quickly.  Increasing our overall page count would have significant cost ramifications on the print edition.  I have a second magazine, Forever, that is entirely focused on reprints and might be able to grow to include what is displaced from here. Forever didn’t exist when the reprints were first introduced. If it did, I probably would have done things differently.  While we’re working towards that goal, a few other projects will continue to bubble in the background. The biggest of these is somewhat timely, given this month’s anniversary, so I’ll announce it slightly ahead of schedule.  Clarkesworld was originally launched as a companion magazine to Clarkesworld Books, an online genre bookstore I ran for several years. The bookstore closed about a year later, but I found that I couldn’t give up the magazine. That’s why we’re still here. If all goes as planned, a Kickstarter campaign will be launched later this month (EDITOR’S NOTE 10/16: We're moving the campaign launch to January to simplify tax issues) to reboot Clarkesworld Books as a translation-focused, short story-oriented, science fiction imprint of Wyrm Publishing. This imprint will allow us to build on the success we’ve had with our Chinese authors and create additional opportunities for authors from other countries. Specifically, the campaign will help fund our first collection, A Hundred Ghosts Parade Tonight and Other Stories by Xia Jia.  Xia Jia is a name that should be familiar to Clarkesworld readers. Over the years, we’ve published several of her stories and I’m not ashamed to admit that I’m a big fan of her work. I couldn’t be more pleased to have her first English language collection—which will include several previously untranslated stories—as Clarkesworld Books’ first title. If we hit stretch goals, we might even see another project announced.  I hope that some of you will consider supporting it when the campaign launches.  It wouldn’t be right to end this month’s anniversary issue editorial without giving a big thank you to everyone: staff, authors, artists, readers, listeners . . . this place doesn’t exist without you and I’m so grateful for every day it does.  All the best,  -Neil Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: After the Dirty Dozen\nIt looks like October has swung back around already. That means Clarkesworld has turned twelve and is now in its thirteenth year. Good thing we’re not superstitious! However, it occurs to me that I’m a bit overdue on another, “where we’re going” editorials, so this seems like a good time to jump in and do that.\nSix years—or half the life of the magazine—ago, I added reprints to each issue as a way of saying “thank you” for the kindness readers showed my family and I after my heart attack. Gardner Dozois was brought in as Reprint Editor and he handled that side of the house until his passing earlier this year. Since then, I’ve been selecting the reprints and giving some thought to their future place in Clarkesworld.\nAt any given time, we have a specific goal that new subscriptions or Patreon pledges are put towards. In the past, this has included things like more stories, an equipment budget for the podcast, pay raises for staff, etc.. The new goal is to begin converting those reprints to slots for more original fiction. Given the significant difference in costs, this will slowly fade in as the number of supporters increases. Unless everyone manages to surprise me, it will be some time before we’re able to replace both reprints with originals, therefore I’ve broken it into chunks. The first target converts one reprint to an original in every other issue.\nThe reason for moving in this direction is simple. Original fiction is the heart of Clarkesworld. The more space we have for it, the more flexibility we have in what we can publish. You might have noticed that we quietly experimented with a few novellas in the past year. We’d like to be able to up our word count limits and do that more often. New—and different—voices are also important to us. Being able to take more stories from open submissions is a very big positive in our eyes. We never solicit original fiction, so this actually creates more opportunities for us to publish new authors.\nBut why remove reprints when you can just add more stories?\n- Moving money from the reprint budget to the original fiction budget allows us to incorporate these changes much more quickly.\n- Increasing our overall page count would have significant cost ramifications on the print edition.\n- I have a second magazine, Forever, that is entirely focused on reprints and might be able to grow to include what is displaced from here. Forever didn’t exist when the reprints were first introduced. If it did, I probably would have done things differently.\nWhile we’re working towards that goal, a few other projects will continue to bubble in the background. The biggest of these is somewhat timely, given this month’s anniversary, so I’ll announce it slightly ahead of schedule.\nClarkesworld was originally launched as a companion magazine to Clarkesworld Books, an online genre bookstore I ran for several years. The bookstore closed about a year later, but I found that I couldn’t give up the magazine. That’s why we’re still here. If all goes as planned, a Kickstarter campaign will be launched later this month (EDITOR’S NOTE 10/16: We're moving the campaign launch to January to simplify tax issues) to reboot Clarkesworld Books as a translation-focused, short story-oriented, science fiction imprint of Wyrm Publishing. This imprint will allow us to build on the success we’ve had with our Chinese authors and create additional opportunities for authors from other countries. Specifically, the campaign will help fund our first collection, A Hundred Ghosts Parade Tonight and Other Stories by Xia Jia.\nXia Jia is a name that should be familiar to Clarkesworld readers. Over the years, we’ve published several of her stories and I’m not ashamed to admit that I’m a big fan of her work. I couldn’t be more pleased to have her first English language collection—which will include several previously untranslated stories—as Clarkesworld Books’ first title. If we hit stretch goals, we might even see another project announced.\nI hope that some of you will consider supporting it when the campaign launches.\nIt wouldn’t be right to end this month’s anniversary issue editorial without giving a big thank you to everyone: staff, authors, artists, readers, listeners . . . this place doesn’t exist without you and I’m so grateful for every day it does.\nAll the best,\n-Neil\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_10_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: After the Dirty Dozen by Neil Clarke"}