{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "N K Jemisin", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "eaVH8lh+Esipu9y7NsqToKzovYE=", "id": null, "license": null, "comments": "", "raw_text": "7840 words, novelette  Stone Hunger  Once there was a girl who lived in a beautiful place full of beautiful people who made beautiful things. Then the world broke.  Now the girl is older, and colder, and hungrier. From the shelter of a dead tree, she watches as a city—a rich one, big, with high strong walls and well-guarded gates—winches its roof into place against the falling chill of night. The girl has never seen anything like this city’s roof. She’s watched the city for days, fascinated by its ribcage of metal tracks and the strips of sewn, oiled material they pull along it. They must put out most of their fires when they do this, or they would choke on smoke—but perhaps with the strips in place, the city retains warmth enough to make fires unnecessary.  It will be nice to be warm again. The girl shifts her weight from one fur-wrapped thigh to the other, her only concession to anticipation.  The tree in whose skeletal branches she crouches is above the city, on a high ridge, and it is one of the few still standing. The city has to burn something, after all, and the local ground does not have the flavor of coal-land, sticky veins of pent smoky bitterness lacing through cool bedrock. In the swaths of forest the city-dwellers have taken, even the stumps are gone; nothing wasted. The rest has been left relatively unmolested, though the girl has noted a suspicious absence of deadfall and kindling-wood on the shadowed forest floor below. Perhaps they’ve left this stand of trees as a windbreak, or to keep the ridge stable. Whatever their reasons, the city-dwellers’ forethought works in her favor. They will not see her stalking them, waiting for an opportunity, until it is too late.  And perhaps, if she is lucky—  No. She has never been lucky. The girl closes her eyes again, tasting the land and the city. It is the most distinctive city she has ever encountered. Such a complexity of sweets and meats and bitters and . . . sour.  Hmm.  Perhaps.  The girl settles her back against the trunk of the tree, wraps the tattered blanket from her pack more closely around herself, and sleeps.  Dawn comes as a thinning of the gray sky. There has been no sun for years.  The girl wakes because of hunger: a sharp pang of it, echo of long-ago habit. Once, she ate breakfast in the mornings. Unsated, the pang eventually fades to its usual omnipresent ache.  Hunger is good, though. Hunger will help.  The girl sits up, feeling imminence like an intensifying itch. It’s coming. She climbs down from the tree—easily; handholds were gnawed into the trunk by ground animals in the early years, before that species disappeared—and walks to the edge of the ridge. Dangerous to do this, stand on a ridge with a shake coming, but she needs to scout for an ideal location. Besides; she knows the shake isn’t close. Yet.  There.  The walk down into the valley is more difficult than she expects. There are no paths. She has to half-climb, half-slide down dry runnels in the rock face which are full of loose gravel-sized ash. And she is not at her best after starving for eight days. Her limbs go weak now and again. There will be food in the city, she reminds herself, and moves a little faster.  She makes it to the floor of the valley and crouches behind a cluster of rocks near the half-dried-up river. The city gates are still hundreds of feet away, but there are familiar notches along its walls. Lookouts, perhaps with longviewers; she knows from experience that cities have the resources to make good glass—and good weapons. Any closer and they’ll see her, unless something distracts them.  Once there was a girl who waited. And then, at last, the distraction arrives. A shake.  The epicenter is not nearby. That’s much farther north: yet another reverberation of the rivening that destroyed the world. Doesn’t matter. The girl breathes hard and digs her fingers into the dried riverbed as power rolls toward her. She tastes the vanguard of it sliding along her tongue, leaving a residue to savor, like thick and sticky treats—  (It is not real, what she tastes. She knows this. Her father once spoke of it as the sound of a chorus, or a cacophony; she’s heard others complain of foul smells, painful sensations. For her, it is food. This seems only appropriate.)  —and it is easy—delicious!—to reach further down. To visualize herself opening her mouth and lapping at that sweet flow of natural force. She sighs and relaxes into the rarity of pleasure, unafraid for once, letting her guard down shamelessly and guiding the energy with only the merest brush of her will. A tickle, not a push. A lick.  Around the girl, pebbles rattle. She splays herself against the ground like an insect, fingernails scraping rock, ear pressed hard to the cold and gritty stone.  Stone. Stone.  Stone like gummy fat, like slick warm syrups she vaguely remembers licking from her fingers, stone flowing, pushing, curling, slow and inexorable as toffee. Then this oncoming power, the wave that ripples the stone, stops against the great slab of bedrock that comprises this valley and its surrounding mountains. The wave wants to go around, spend its energy elsewhere, but the girl sucks against this resistance. It takes awhile. On the ground, she writhes in place and smacks her lips and makes a sound: “Ummmah.”  Then the  Oh, the pressure  Once there was a girl who ground her teeth against prrrrrresssure  bursts, the inertia breaks, and the wave of force ripples into the valley. The land seems to inhale, rising and groaning beneath her, and it is hers, it’s hers. She controls it. The girl laughs; she can’t help herself. It feels so good to be full, in one way or another.  A jagged crack steaming with friction opens and widens from where the girl lies to the foot of the ridge on which she spent the previous night. The entire face of the cliff splits off and disintegrates, gathering momentum and strength as it avalanches toward the city’s southern wall. The girl adds force in garnishing dollops, oh-so-carefully. Too much and she will smash the entire valley into rubble, city and all, leaving nothing useful. She does not destroy; she merely damages. But just enough and—  The shake stops.  The girl feels the interference at once. The sweet flow solidifies; something taints its flavor in a way that makes her recoil. Hints of bitter and sharp—  —and vinegar, at last, for certain, she isn’t imagining it this time, vinegar—  —and then all the marvelous power she has claimed dissipates. There is no compensatory force; nothing uses it. It’s simply gone. Someone else has beaten her to the banquet and eaten all the treats. But the girl no longer cares that her plan has failed.  “I found you.” She pushes herself up from the dry riverbed, her hair dripping flecks of ash. She is trembling, not just with hunger anymore, her eyes fixed on the city’s unbroken wall. “I found you.”  The momentum of the shake rolls onward, passing beyond the girl’s reach. Though the ground has stopped moving, the ridge rockslide cannot be stopped: boulders and trees, including the tree that sheltered the girl the night before, break loose and tumble down to slam against the city’s protective wall, probably cracking it. But this is nowhere near the level of damage that the girl had hoped for. How will she get inside? She must get inside, now.  Ah—the gates of the city crank open. A way in. But the city dwellers are angry now. They might kill her, or worse.  She rises, runs. The days without food have left her little strength and poor speed, but fear supplies some fuel. Yet the stones turn against her now, and she stumbles, slips on loose rocks. She knows better than to waste time looking back.  Hooves drum the ground, a thousand tiny shakes that refuse to obey her will.  Once there was a girl who awoke in a prison cell.  It’s dark, but she can see the metal grate of a door not far off. The bed is softer than anything she’s slept on in months, and the air is warm. Or she is warm. She evaluates the fever that burns under her skin and concludes that it is dangerously high. She’s not hungry, either, though her belly is as empty as ever. A bad sign.  This may have something to do with the fact that her leg aches like a low, monotonous scream. Two screams. Her upper thigh burns, but the knee feels as though shards of ice have somehow inserted themselves into the joint. She wants to try and flex it, see if it can move enough to bear her weight, but it hurts so much already that she is afraid to try.  She remains still, listening before opening her eyes, a habit that has saved her life before. Distant sound of voices, echoing along corridors that stink of rust and mildewed mortar. No breath or movement nearby. Sitting up carefully, the girl touches the cloth that covers her. Scratchy, patchy. Warmer than her own blanket, wherever that is. She will steal this one, if she can, when she escapes.  Then she freezes, startled, because there is someone in the room with her. A man.  But the man does not move, does not even breathe; just stands there. And now she can see that what she thought was skin is marble. A statue. A statue?  It’s hard to think through the clamor of fever and pain, even the air sounds loud in her ears, but she decides at last that the city-dwellers have peculiar taste in art.  She hurts. She’s tired. She sleeps.  “You tried to kill us,” says a woman’s voice.  The girl blinks awake again, disoriented for a moment. A lantern burns something smoky in a sconce above her. Her fever has faded. She’s still thirsty, but not as parched as before. A memory comes to her of people in the room, tending her wounds, giving her broth tinged with bitterness; this memory is distant and strange. She must have been half delirious at the time. She’s still hungry—she is always hungry—but that need, too, is not as bad as it was. Even the fire and ice in her leg have subsided.  The girl turns to regard her visitor. The woman sits straddling an old wooden chair, her arms propped on its back. The girl does not have enough experience of other people to guess her age. Older than herself; not elderly. And big, with broad shoulders made broader by layers of clothing and fur, heavy black boots. Her hair, a poufing mane as gray and stiff as ash-killed grass, has been thickened further by plaits and knots which are either decoration or an attempt to keep the mass of it out of her eyes. Her face is broad and angular, her skin sallow-brown like the girl’s own.  (The statue that was in the corner is gone. Once there was a girl who hallucinated while in a fever.)  “You would’ve torn down half our southern wall,” the woman continues. “Probably destroyed one or more storecaches. That kind of thing is enough to kill a city these days. Wounds draw scavengers.”  This is true. It would not have been her intention, of course. She tries to be a successful parasite, not killing off her host; she inflicts only enough damage to get inside undetected. And while the city was busy repairing itself and fighting off the enemies who would have come, the girl could have survived unnoticed within its walls for some time. She has done this elsewhere. She could have prowled its alleys, nibbled at its foundations, searching always for the taste of vinegar. He is here somewhere.  And if she fails to find him in time, if he does to this city what he has done elsewhere . . . well. She would not kill a city herself, but she’ll fatten herself off the carcass before she takes up his trail again. Anything else would be wasteful.  The woman waits a moment, then sighs as if she expected no response. “I’m Ykka. I assume you have no name?”  “Of course I have a name,” the girl snaps.  Ykka waits. Then she snorts. “You look, what, fourteen? Underfed, so let’s say eighteen. You were a small child when the Rivening happened, but you’re not feral now—much—so someone must have raised you for awhile afterward. Who?”  The girl turns away in disinterest. “You going to kill me?”  “What will you do if I say yes?”  The girl sets her jaw. The walls of her cell are panels of steel bolted together, and the floor is joined planks of wood over a dirt floor. But such thin metal. So little wood. She imagines squeezing her tongue between the slats of the floor, licking away the layers of filth underneath—she’s eaten worse—and finally touching the foundation. Concrete. Through that, she can touch the valley floor. The stone will be flavorless and cold, cold enough to make her tongue stick, because there’s nothing to heat it up—no shake or aftershake. And the valley is nowhere near a fault or hotspot, so no blows or bubbles, either. But there are other ways to warm stone. Other warmth and movement she can use.  Using the warmth and movement of the air around her, for example. Or the warmth and movement within a living body. If she takes this from Ykka, it won’t give her much. Not enough for a real shake; she would need more people for that. But she might be able to jolt the floor of her cell, warp that metal door enough to jiggle the lock free. Ykka will be dead, but some things cannot be helped.  The girl reaches for Ykka, her mouth watering in spite of herself—  A clashing flavor interrupts her. Spice like cinnamon. Not so bad. But the bite of the spice grows sharper as she tries to grasp the power, until suddenly it is fire and burning and a crisp green taste that makes her eyes water and her guts churn—  With a gasp, the girl snaps her eyes open. The woman smiles, and the back of the girl’s neck prickles with belated, jarring recognition.  “Answer enough,” Ykka says lightly, though there is cold fury in her eyes. “We’ll have to move you to a better cell if you have the sensitivity to work through steel and wood. Lucky for us you’ve been too weak to try before now.” She pauses. “If you had succeeded just now, would you have only killed me? Or the whole city?”  Still shocked to find herself in the company of her own, the girl answers honestly before she can think not to. “Not the whole city. I don’t kill cities.”  “What is that, some kind of integrity?” Ykka snorts a laugh.  There’s no point in answering the question. “I would’ve just killed as many people as I needed to get loose.”  “And then what?”  The girl shrugs. “Find something to eat. Somewhere warm to hole up.” She does not add, find the vinegar man. It will make no sense to Ykka anyway.  “Food, warmth, and shelter. Such simple wants.” There is mockery in Ykka’s voice, and it annoys the girl. “You could do with fresh clothes. A good wash. Someone to talk to, maybe, so you can start thinking of other people as valuable.”  The girl scowls. “What do you want from me?”  “To see if you’re useful.” At the girl’s frown, Ykka looks her up and down, perhaps sizing her up. The girl does not have the same bottlebrush hair as Ykka, just scraggling brown stuff she chops off with her knife whenever it gets long enough to annoy. She is small and lean and quick, when she is not injured. No telling what Ykka thinks of these traits. No telling why she cares. The girl just hopes she does not appear weak.  “Have you done this to other cities?” Ykka asks.  The question is so patently stupid that there’s no point in answering. After a moment Ykka nods. “Thought so. You seem to know what you’re about.”  “I learned early how it was done.”  “Oh?”  The girl decides she has said enough. But before she can make a point of silence, there is another ripple across her perception, followed by something that is unmistakably a jolt within the earth. Specks of mortar trickle from beneath a loose panel on the cell wall. Another shake? No, the deep earth is still cold. That jolt was more shallow, delicate, just a goosebump on the world’s skin.  “You can ask what that was,” Ykka says, noticing her confusion. “I might even answer.”  The girl sets her jaw and Ykka laughs, getting to her feet. She is even bigger than she seemed while sitting, a solid six feet or more. Pureblooded Sanzed; half the races of the world have that bottlebrush hair, but the size is the giveaway. Sanzed breed for strength, so they can protect themselves when the world turns hard.  “You left the southern ridge unstable,” Ykka says. “We needed to make repairs.” Then she waits, one hand on her hip, while the girl makes the necessary connections. It doesn’t take long. The woman is like her. (Taste of savory pepper stinging her mouth still. Disgusting.) But someone entirely different caused that shift a moment ago, and although their presence is like melon—pale, delicate, flavorlessly cloying—it holds a faint aftertaste of blood.  Two in one city? Their kind know better. Hard enough for one wolf to hide among the sheep. But wait—there were two more, right when she split the southern ridge. One of them was a different taste altogether, bitter, something she has never eaten so she cannot name it. The other was the vinegar man.  Four in one city. And this woman is so very interested in her usefulness. She stares at Ykka. No one would do that.  Ykka shakes her head, amusement fading. “I think you’re a waste of time and food,” she says, “but it’s not my decision alone. If you try to harm the city again we’ll feel it, and we’ll stop you, and then we’ll kill you. But if you don’t cause trouble, we’ll know you’re at least trainable. Oh—and stay off the leg if you ever want to walk again.”  Then Ykka goes to the grate-door and barks something in another language. A man comes down the hall and lets her out. The two of them look in at the girl for a long moment before heading down the hall and through another door.  In the new silence, the girl sits up. This must be done slowly; she is very weak. Her bedding reeks of fever sweat, though it is dry now. When she throws off the patch-blanket, she sees that she has no pants on. There is a bandage around her right thigh at the midpoint: the wound underneath radiates infection-lines, though they seem to be fading. Her knee has also been wrapped tightly with wide leather bandages. She tries to flex it and a sickening ripple of pain radiates up and down the leg, like aftershocks from her own personal rivening. What did she do to it? She remembers running from people on horseback. Falling, amid rocks as jagged as knives.  The vinegar man will not linger long in this city. She knows this from having tracked his spoor for years. Sometimes there are survivors in the towns he’s murdered, who—if they can be persuaded to speak—tell of the wanderer who camped outside the gates, asking to be let in but not moving on when refused. Waiting, perhaps for a few days; hiding if the townsfolk drove him away. Then strolling in, smug and unmolested, when the walls fell. She has to find him quickly because if he’s here, this city is doomed, and she doesn’t want to be anywhere near its death throes.  Continuing to push against the bandages’ tension, the girl manages to bend the knee perhaps twenty degrees before something that should not move that way slides to one side. There is a wet click from somewhere within the joint. Her stomach is empty. She is glad for this as she almost retches from the pain. The heaves pass. She will not be escaping the room, or hunting down the vinegar man, anytime soon.  But when she looks up, someone is in the room with her again. The statue she hallucinated.  It is a statue, her mind insists—though, plainly, it is not a hallucination. Study of a man in contemplation: tall, gracefully poised, the head tilted to one side with a frank and thoughtful expression moulded into its face. That face is marbled gray and white, though inset with eyes of—she guesses—alabaster and onyx. The artist who sculpted this creation has applied incredible detail, even carving lashes and little lines in the lips. Once, the girl knew beauty when she saw it.  She also thinks that the statue was not present a moment ago. In fact, she’s certain of this.  “Would you like to leave?” the statue asks, and the girl scrambles back as much as her damaged leg—and the wall—allows.  There is a pause.  “S-stone-eater,” she whispers.  “Girl.” Its lips do not move when it speaks. The voice comes from somewhere within its torso. The stories say that the stuff of a stone-eater’s body is not quite rock, but still far different from—and less flexible than—flesh.  The stories also say that stone-eaters do not exist, except in stories about stone-eaters. The girl licks her lips.  “What . . . ” Her voice breaks. She pulls herself up straighter and flinches when she forgets her knee. It very much does not want to be forgotten. She focuses on other things. “Leave?”  The stone-eater’s head does not move, but its eyes shift ever-so-slightly. Tracking her. She has the sudden urge to hide under the blanket to escape its gaze, but then what if she peeks out and finds the creature right in front of her, peering back in?  “They’ll move you to a more secure cell, soon.” It is shaped like a man, but her mind refuses to apply the pronoun to something so obviously not human. “You’ll have a harder time reaching stone there. I can take you to bare ground.”  “Why?”  “So that you can destroy the city, if you still want to.” Casual, calm, its voice. It is indestructible, the stories say. One cannot stop a stone-eater, only get out of its way.  “You’ll have to fight Ykka and the others, however,” it continues. “This is their city, after all.”  This is almost enough to distract the girl from the stone-eater’s looming strangeness. “No one would do that,” she says, stubborn. The world hates what she is; she learned that early on. Those of her kind eat the power of the earth and spit it back as force and destruction. When the earth is quiet they eat anything else they can find—the warmth of the air, the movement of living things—to achieve the same effect. They cannot live among ordinary people. They would be discovered with the first shake, or the first murder.  The stone-eater moves, and seeing this causes chilly sweat to rise on the girl’s skin. It is slow, stiff. She hears a faint sound like the grind of a tomb’s cover-stone. Now the creature faces her, and its thoughtful expression has become wry.  “There are twenty-three of you in this city,” it says. “And many more of the other kind, of course.” Ordinary people, she guesses by its dismissive tone. Hard to tell, because her mind has set its teeth in that first sentence. Twenty-three. Twenty-three.  Belatedly, she realizes the stone-eater is still waiting for an answer to its question. “H-how would you take me out of the cell?” she asks.  “I’d carry you.”  Let the stone-eater touch her. She tries not to let it see her shudder, but its lips adjust in a subtle way. Now the statue has a carved, slight smile. The monster is amused to be found monstrous.  “I’ll return later,” it says. “When you’re stronger.”  Then its form, which does not vibrate on her awareness the way people do but is instead as still and solid as a mountain—shimmers. She can see through it. It drops into the floor as though a hole has opened under its feet, although the grimy wooden slats are perfectly solid.  The girl takes several deep breaths and sits back against the wall. The metal is cold through her clothing.  They move the girl to a cell whose floor is wood over metal. The walls are wood too, and padded with leather sewn over thick layers of cotton. There are chains set into the floor here, but thankfully they do not use them on her.  They bring the girl food: broth with yeast flakes, coarse flat cakes that taste of fungus, sprouted grains wrapped in dried leaves. She eats and grows stronger. After several days have passed, during which the girl’s digestive system begins cautiously working again, the guards give her crutches. While they watch, she experiments until she can use them reliably, with minimal pain. Then they bring her to a room where naked people scrub themselves around a shallow pool of circulating steaming water. When she has finished bathing, the guards card her hair for lice. (She has none. Lice come from being around other people.) Finally they give her clothing: undershorts, loose pants of some sort of plant fiber, a second tighter pair of pants made of animal skin, two shirts, a bra she’s too scrawny to need, fur-lined shoes. She dons it all, greedily. It’s nice to be warm.  They bring her back to her cell, and the girl climbs carefully into the bed. She’s stronger, but still weak; she tires easily. The knee cannot bear her weight yet. The crutches are worse than useless—she cannot sneak anywhere while noisily levering herself about. The frustration of this chews at her, because the vinegar man is out there, and she fears he will leave—or strike—before she can heal. Yet flesh is flesh, and hers has endured too much of late. It demands its due. She can do nothing but obey.  After she rests for a time, however, she becomes aware that something vast and mountain-still and familiar is in the room again. She opens her eyes to see the stone-eater still and silent in front of the cell’s door. This time it has a hand upraised, the palm open and ready. An invitation.  The girl sits up. “Can you help me find someone?”  “Who?”  “A man. A man, like—” She has no idea how to communicate it in a way the stone-eater will understand. Does it even distinguish between one human and another? She has no idea how it thinks.  “Like you?” the stone-eater prompts, when she trails off.  She fights back the urge to immediately reject this characterization. “Another who can do what I do, yes.” One of twenty-three. This is a problem she never expected to have.  The stone-eater is silent for a moment. “Share him with me.”  The girl does not understand this. But its hand is still there, proffered, waiting, so she pushes herself to her feet and, with the aid of the crutches, hobbles over. When she reaches for its hand, there is an instant in which every part of her revolts against the notion of touching its strange marbled skin. Bad enough to stand near where she can see that it does not breathe, notice that it does not blink, realize her every instinct warns against tasting it with that part of herself that knows stone. She thinks that if she tries, its flavor will be bitter almonds and burning sulfur, and then she will die.  And yet.  Reluctantly, she thinks of the beautiful place, which she has not allowed herself to remember for years. Once upon a time there was a girl who had food every day and warmth all the time, and in that place were people who gave these things to her, unasked, completely free. They gave her other things, too—things she does not want now, does not need anymore, like companionship and a name and feelings beyond hunger and anger. That place is gone, now. Murdered. Only she remains, to avenge it.  She takes the stone-eater’s hand. Its skin is cool and yields slightly to the touch; her arms break out in gooseflesh, and the skin of her palm crawls. She hopes it does not notice.  It waits, until she recalls its request. So she closes her eyes and remembers the vinegar man’s sharp-sweet taste, and hopes that it can somehow feel this through her skin.  “Ah,” the stone-eater says. “I do know that one.”  The girl licks her lips. “I’m going to kill him.”  “You’re going to try.” Its smile is a fixed thing.  “Why are you helping me?”  “I told you. The others will fight you.”  This makes no sense. “Why don’t you destroy the city yourself, if you hate it so much?”  “I don’t hate the city. I have no interest in destroying it.” Its hand tightens ever-so-slightly, a hint of pressure from the deepest places of the earth. “Shall I take you to him?”  It is a warning, and a promise. The girl understands: she must accept its offer now, or it will be rescinded. And in the end, it doesn’t matter why the stone-eater helps her.  “Take me to him,” she says.  The stone-eater pulls her closer, folding its free arm around her shoulders with the slow, grinding inexorability of a glacier. She stands trembling against its solid inhumanity, looking into its too-white, too-dark eyes and clutching her crutches tight with her arms. It hasn’t ever stopped smiling. She notices, and does not know why she notices, that it smiles with its lips closed.  “Don’t be afraid,” it says without opening its mouth, and the world blurs around her. There is a stifling sense of enclosure and pressure, of friction-induced heat, a flicking darkness and a feel of deep earth moving around her, so close that she cannot just taste it; she also feels and breathes and is it.  Then they stand in a quiet courtyard of the city. The girl looks around, startled by the sudden return of light and cold air and spaciousness, and does not even notice the stone-eater’s movements this time as it slowly releases her and steps back. It is daytime. The city’s roof is rolled back and the sky is its usual melancholy gray, weeping ashen snow. From inside, the city feels smaller than she’d imagined. The buildings are low but close together, nearly all of them squat and round and dome-shaped. She’s seen this style of building in other cities; good for conserving heat and withstanding shakes.  No one else is around. The girl turns to the stone-eater, tense.  “There.” Its arm is already raised, pointing to a building at the end of a narrow road. It is a larger dome than the rest, with smaller subsidiaries branching off its sides. “He’s on the second floor.”  The girl watches the stone-eater for a moment longer and it watches her back, a gently-smiling signpost. That way to revenge. She turns and follows its pointing finger.  No one notices her as she crutches along, though she is a stranger; this means the city’s big enough that not everyone knows everyone else. The people she passes are of many races, many ages. Sanzed like Ykka predominate, or maybe they are Cebaki; she never learned tell one from another. There are many black-lipped Regwo, and one Shearar woman with big moon-pale eyes. The girl wonders if they know of the twenty-three. (Twenty-four, her mind corrects.) They must. Her kind cannot live among ordinary people without eventually revealing themselves. Usually they can’t live among ordinary people at all—and yet here, somehow, they do.  Yet as she passes narrower streets and gaps in the buildings, she glimpses something else, something worse, that suddenly explains why no one’s worried about twenty-four people who each could destroy a city on a whim. In the shadows, on the sidewalks, nearly camouflaged by the ash-colored walls: too-still standing figures. Statues whose eyes shift to follow her. Many of them: she counts a dozen before she makes herself stop.  Once there was a city full of monsters, of whom the girl was just another one.  No one stops her from going into the large dome. Inside, this building is warmer than the one in which she was imprisoned. People move in and out of it freely, some in knots of twos and threes, talking, carrying tools or paper. As the girl moves through its corridors, she spies small ceramic braziers in each room which emit a fragrant scent as well as heat. There are stacks of long-dead flowers in the kindling piles.  The stairs nearly kill her. It takes some time to figure out a method of crutching her way up that does not force her to bend the damaged knee. She stops after the third set to lean against a wall, trembling and sweating. The days of steady food have helped, but she is still healing, and she has never been physically strong. It will not do for her to meet the vinegar man and collapse at his feet.  “You all right?”  The girl blinks damp hair out of her eyes. She’s in a wide corridor lined by braziers; there is a long, patterned rug—pre-rivening luxury—beneath her feet. The man standing there is as small as she is, which is the only reason she does not react by jerking away from his nearness. He’s nearly as pale as the stone-eater, though his skin is truly skin and his hair is stiff because he is probably part Sanzed. He has a cheerful face, which is set in polite concern as he watches her.  And the girl flinches when she instinctively reaches out to taste her surroundings and he tastes of sharp, sour vinegar, the flavor of smelly pickles and old preserved things and wine gone rancid, and it is him, it is him, she knows his taste.  “I’m from Arquin,” she blurts. The smile freezes on the man’s face, making her think of the stone-eater again.  Once there was a city called Arquin, far to the south. It had been a city of artists and thinkers, a beautiful place full of beautiful people, of whom the girl’s parents were two. When the world broke—as it often breaks, as the rivening is only the latest exemplary apocalypse of many—Arquin buttoned up against the chill and locked its gates and hunkered down to endure until the world healed and grew warm again. The city had prepared well. Its storecaches were full, its defenses layered and strong; it could have lasted a long time. But then a stranger came to town.  Taut silence, in the wake of the girl’s pronouncement.  The man recovers first. His nostrils flare, and he straightens as if to cloak himself in discomfort. “Everyone did what they had to do, back then,” he says. “You’d have done it too, if you were me.”  Is there a hint of apology in his voice? Accusation? The girl bares her teeth. She has not tried to reach the stone beneath the city since she met Ykka. But she reaches now, tracing the pillars in the walls down to the foundation of the building and then deeper, finding and swallowing sweet-mint bedrock cool into herself. There isn’t much. There have been no shakes today. But what little power there is is a balm, soothing away the past few days’ helplessness and fear.  The vinegar man stumbles back against the corridor’s other wall, reacting to the girl’s touch on the bedrock as if to an insult. All at once the sourness of him floods forth like spit, trying to revolt her into letting go. She wants to; he’s ruining the taste. But she scowls and bites more firmly into the power, making it hers, refusing to withdraw. His eyes narrow.  Someone comes into the corridor from one of the rooms that branch off it. This stranger says something, loudly; the girl registers that he is calling for Ykka. She barely hears the words. Stone dust is in her mouth. The grind of the deep rock is in her ears. The vinegar man presses in, trying again to wrest control from the girl, and the girl hates him for this. How many years has she spent hungry, cold, afraid, because of him? No, no, she does not begrudge him that, not really, not when she has done just as many terrible things, he’s completely right to say you would too, you did too—but now? Right now, all she wants is power. Is that so much to ask? It’s all he’s left her.  And she will shake this whole valley to rubble before she lets him take one more thing that is hers.  The rough-sanded wood of the crutches bites into her hands as she bites into imagined stone to brace herself. The earth is still now, its power too deep to reach, and at such times there’s nothing left to feed on save the thin gruel of smaller movements, lesser heat. The rose-flavored coals of the nearby braziers. The jerky twitchy strength of limbs and eyes and breathing chests. And, too, she can sup motions for which there are no names: all the infinitesimal floating morsels of the air, all the jittery particles of solid matter. The smaller, fast-swirling motes that comprise these particles.  (Somewhere, outside the earth, there are more people nearby. Other tastes begin to tease her senses: melon, warm beef stew, familiar peppers. The others mean to stop her. She must finish this quickly.)  “Don’t you dare,” says the vinegar man. The floor shakes, the whole building rattles with the warning force of his rage. Vibrations drum against the girl’s feet. “I won’t let you—”  He has no chance to finish the warning. The girl remembers soured wine that she once drank after finding it in a crushed Arquin storehouse. She’d been so hungry that she needed something, anything, to keep going. The stuff had tasted of rich malts and hints of fruit. Desperation made even vinegar taste good.  The air in the room grows cold. A circle of frost, radiating out from the girl’s feet, rimes the patterned rug. The vinegar man stands within this circle. (Others in the corridor exclaim and back off as the circle grows.) He cries out as frost forms in his hair, on his eyebrows. His lips turn blue; his fingers stiffen. There’s more to it than cold: as the girl devours the space between his molecules, the very motion of his atoms, the man’s flesh becomes something different, condensing, hardening. In the earth where flavors dwell, he fights; acid burns the girl’s throat and roils her belly. Her own ears go numb, and her knee throbs with the cold hard enough to draw tears from her eyes.  But she has swallowed far worse things than pain. And this is the lesson the vinegar man inadvertently taught her when he killed her future, and made her nothing more than a parasite like himself. He is older, crueler, more experienced, perhaps stronger, but survival has never really been the province of the fittest. Merely the hungriest.  Once the vinegar man is dead, Ykka arrives. She steps into the icy circle without fear, though there is a warning-tang of crisp green and red heat when the girl turns to face her. The girl backs off. She can’t handle another fight right now.  “Congratulations,” Ykka drawls, when the girl pulls her awareness out of the earth and wearily, awkwardly, sits down. (The floor is very cold against her backside.) “Got that out of your system?”  A bit dazed, the girl tries to process the words. A small crowd of people stands in the corridor, beyond the icy circle; they are murmuring and staring at her. A black-haired woman, as small and lithe as Ykka is large and immovable, has entered the circle with Ykka; she goes over to the vinegar man and peers at him as if hoping to find anything left of value. There’s nothing, though. The girl has left as much of him as he left of her life, on a long-ago day in a once-beautiful place. He’s not even a man anymore, just a gray-brown, crumbly lump of ex-flesh half-huddled against the corridor wall. His face is all eyes and bared teeth, one hand an upraised claw.  Beyond Ykka and the crowd, the girl sees something that clears her thoughts at once: the stone-eater, just beyond the others. Watching her and smiling, statue-still.  “He’s dead,” the black-haired woman says, turning to Ykka. She sounds more annoyed than angry.  “Yes, I rather thought so,” Ykka replies. “So what was that all about?”  The girl belatedly realizes Ykka is talking to her. She is exhausted, physically—but inside, her whole being brims with strength and heat and satisfaction. It makes her lightheaded, and a little giddy, so she opens her mouth to speak and laughs instead. Even to her own ears, the sound is unsteady, unnerving.  The black-haired woman utters a curse in some language the girl does not know and pulls a knife, plainly intending to rid the city of the girl’s mad menace. “Wait,” Ykka says.  The woman glares at her. “This little monster just killed Thoroa—”  “Wait,” Ykka says again, harder, and this time she stares the black-haired woman down until the furious tension in the woman’s shoulders sags into defeat. Then Ykka faces the girl again. Her breath puffs in the chilly air when she speaks. “Why?”  The girl can only shake her head. “He owed me.”  “Owed you what? Why?”  She shakes her head again, wishing they would just kill her and get it over with.  Ykka watches her for a long moment, her hard face unreadable. When she speaks again, her voice is softer. “You said you learned early how it was done.”  The black-haired woman looks sharply at her. “We’ve all done what we had to, to survive.”  “True,” said Ykka. “And sometimes those things come back to bite us.”  “She killed a citizen of this city—”  “He owed her. How many people do you owe, hmm? You want to pretend we don’t all deserve to die for some reason or another?”  The black-haired woman does not answer.  “A city of people like us,” the girl says. She’s still giddy. It would be easy to make the city shake now, vent the giddiness, but that would force them to kill her when for some impossible reason they seem to be hesitating. “It’ll never work. They used to hunt us down before the rivening for good reason.”  Ykka smiles as though she knows what the girl is feeling. “They hunt us down now, in most places, for good reason. After all, only one of us could have done this.” She gestures vaguely toward the north, where a great jagged red-bleeding crack across the continent has destroyed the world. “But maybe if they didn’t treat us like monsters, we wouldn’t be monsters. I want us to try living like people for awhile, see how that goes.”  “Going great so far,” mutters the black-haired woman, looking at the stone corpse of the vinegar man. Thoroa. Whichever.  Ykka shrugs, but her eyes narrow at the girl. “Someone will probably come looking for you, too, one day.”  The girl gazes steadily back, because she has always understood this. She’ll do what she has to do, until she can’t anymore.  But all at once the girl snaps alert, because the stone-eater is now standing over her. Everyone in the corridor jerks in surprise. None of them saw it move.  “Thank you,” it says.  The girl licks her lips, not looking away. One does not turn one’s back on a predator. “Welcome.” She does not ask why it thanks her.  “And these,” Ykka says from beyond the creature, with a sigh which may or may not be resigned, “are our motivation to live together peacefully.”  Most of the braziers in the corridor are dark, extinguished by the girl in her desperate grab for power. Only the ones at either far end of the corridor, well beyond the ice-circle, remain lit. These silhouette the stone-eater’s face—though the girl can easily imagine its carved-marble smile.  Wordlessly Ykka comes over, as does the black-haired woman. They help the girl to her feet, all three of them watching the stone-eater warily. The stone-eater doesn’t move, either to impede them or to get out of the way. It just keeps standing there until they carry the girl away. Others in the hall, bystanders who did not choose to flee while monsters battled nearby, file out as well—quickly. This is only partly because the corridor is freezing.  “Are you throwing me out of the city?” the girl asks. They have set her down at the foot of the steps. She fumbles with the crutches because her hands are shaking in delayed reaction to the cold and the near-death experience. If they throw her out now, wounded, she’ll die slowly. She would rather they kill her, than face that.  “Don’t know yet,” Ykka says. “You want to go?”  The girl is surprised to be asked. It is strange to have options. She looks up, then, as a sound from above startles her: they are rolling the city’s roof shut against the coming night. As the strips of roofing slide into place, the city grows dimmer, although people move along the streets lighting standing lanterns she did not notice before. The roof locks into place with a deep, echoing snap. Already, without cool outside air blowing through the city, it feels warmer.  “I want to stay,” the girl hears herself say.  Ykka sighs. The black-haired woman just shakes her head. But they do not call the guards, and when they hear a sound from upstairs, all three of them walk away together, by unspoken mutual agreement. The girl has no idea where they’re going. She doesn’t think the other two women do, either. It’s just understood that they should all be somewhere else.  Because the girl keeps seeing the corridor they just left, in the moment before they carried her down stairs. She’d glanced back, see. The stone-eater had moved again; it stood beside Thoroa’s petrified corpse. Its hand rested on his shoulder, companionably. And this time as it smiled, it flashed tiny, perfect, diamond teeth.  The girl takes a deep breath to banish this image from her mind.  Then she asks of Ykka as they walk, “Is there anything to eat?” N. K. Jemisin is a Brooklyn author whose short fiction and novels have been multiply nominated for the Hugo and the Nebula, shortlisted for the Crawford and the Tiptree, and have won the Locus Award for Best First Novel. Her speculative works range from fantasy to science fiction to the undefinable; her themes include the intersections of race and gender, resistance to oppression, and the coolness of Stuff Blowing Up. She is a member of the Altered Fluid writing group, and a graduate of the Viable Paradise writing workshop. Her latest novel, The Shadowed Sun, was published in June 2012 from Orbit Books, and she's hard at work on a new series due to begin in 2014.", "text": "7840 words, novelette\nStone Hunger\nOnce there was a girl who lived in a beautiful place full of beautiful people who made beautiful things. Then the world broke.\nNow the girl is older, and colder, and hungrier. From the shelter of a dead tree, she watches as a city—a rich one, big, with high strong walls and well-guarded gates—winches its roof into place against the falling chill of night. The girl has never seen anything like this city’s roof. She’s watched the city for days, fascinated by its ribcage of metal tracks and the strips of sewn, oiled material they pull along it. They must put out most of their fires when they do this, or they would choke on smoke—but perhaps with the strips in place, the city retains warmth enough to make fires unnecessary.\nIt will be nice to be warm again. The girl shifts her weight from one fur-wrapped thigh to the other, her only concession to anticipation.\nThe tree in whose skeletal branches she crouches is above the city, on a high ridge, and it is one of the few still standing. The city has to burn something, after all, and the local ground does not have the flavor of coal-land, sticky veins of pent smoky bitterness lacing through cool bedrock. In the swaths of forest the city-dwellers have taken, even the stumps are gone; nothing wasted. The rest has been left relatively unmolested, though the girl has noted a suspicious absence of deadfall and kindling-wood on the shadowed forest floor below. Perhaps they’ve left this stand of trees as a windbreak, or to keep the ridge stable. Whatever their reasons, the city-dwellers’ forethought works in her favor. They will not see her stalking them, waiting for an opportunity, until it is too late.\nAnd perhaps, if she is lucky—\nNo. She has never been lucky. The girl closes her eyes again, tasting the land and the city. It is the most distinctive city she has ever encountered. Such a complexity of sweets and meats and bitters and . . . sour.\nHmm.\nPerhaps.\nThe girl settles her back against the trunk of the tree, wraps the tattered blanket from her pack more closely around herself, and sleeps.\nDawn comes as a thinning of the gray sky. There has been no sun for years.\nThe girl wakes because of hunger: a sharp pang of it, echo of long-ago habit. Once, she ate breakfast in the mornings. Unsated, the pang eventually fades to its usual omnipresent ache.\nHunger is good, though. Hunger will help.\nThe girl sits up, feeling imminence like an intensifying itch. It’s coming. She climbs down from the tree—easily; handholds were gnawed into the trunk by ground animals in the early years, before that species disappeared—and walks to the edge of the ridge. Dangerous to do this, stand on a ridge with a shake coming, but she needs to scout for an ideal location. Besides; she knows the shake isn’t close. Yet.\nThere.\nThe walk down into the valley is more difficult than she expects. There are no paths. She has to half-climb, half-slide down dry runnels in the rock face which are full of loose gravel-sized ash. And she is not at her best after starving for eight days. Her limbs go weak now and again. There will be food in the city, she reminds herself, and moves a little faster.\nShe makes it to the floor of the valley and crouches behind a cluster of rocks near the half-dried-up river. The city gates are still hundreds of feet away, but there are familiar notches along its walls. Lookouts, perhaps with longviewers; she knows from experience that cities have the resources to make good glass—and good weapons. Any closer and they’ll see her, unless something distracts them.\nOnce there was a girl who waited. And then, at last, the distraction arrives. A shake.\nThe epicenter is not nearby. That’s much farther north: yet another reverberation of the rivening that destroyed the world. Doesn’t matter. The girl breathes hard and digs her fingers into the dried riverbed as power rolls toward her. She tastes the vanguard of it sliding along her tongue, leaving a residue to savor, like thick and sticky treats—\n(It is not real, what she tastes. She knows this. Her father once spoke of it as the sound of a chorus, or a cacophony; she’s heard others complain of foul smells, painful sensations. For her, it is food. This seems only appropriate.)\n—and it is easy—delicious!—to reach further down. To visualize herself opening her mouth and lapping at that sweet flow of natural force. She sighs and relaxes into the rarity of pleasure, unafraid for once, letting her guard down shamelessly and guiding the energy with only the merest brush of her will. A tickle, not a push. A lick.\nAround the girl, pebbles rattle. She splays herself against the ground like an insect, fingernails scraping rock, ear pressed hard to the cold and gritty stone.\nStone. Stone.\nStone like gummy fat, like slick warm syrups she vaguely remembers licking from her fingers, stone flowing, pushing, curling, slow and inexorable as toffee. Then this oncoming power, the wave that ripples the stone, stops against the great slab of bedrock that comprises this valley and its surrounding mountains. The wave wants to go around, spend its energy elsewhere, but the girl sucks against this resistance. It takes awhile. On the ground, she writhes in place and smacks her lips and makes a sound: “Ummmah.”\nThen the\nOh, the pressure\nOnce there was a girl who ground her teeth against prrrrrresssure\nbursts, the inertia breaks, and the wave of force ripples into the valley. The land seems to inhale, rising and groaning beneath her, and it is hers, it’s hers. She controls it. The girl laughs; she can’t help herself. It feels so good to be full, in one way or another.\nA jagged crack steaming with friction opens and widens from where the girl lies to the foot of the ridge on which she spent the previous night. The entire face of the cliff splits off and disintegrates, gathering momentum and strength as it avalanches toward the city’s southern wall. The girl adds force in garnishing dollops, oh-so-carefully. Too much and she will smash the entire valley into rubble, city and all, leaving nothing useful. She does not destroy; she merely damages. But just enough and—\nThe shake stops.\nThe girl feels the interference at once. The sweet flow solidifies; something taints its flavor in a way that makes her recoil. Hints of bitter and sharp—\n—and vinegar, at last, for certain, she isn’t imagining it this time, vinegar—\n—and then all the marvelous power she has claimed dissipates. There is no compensatory force; nothing uses it. It’s simply gone. Someone else has beaten her to the banquet and eaten all the treats. But the girl no longer cares that her plan has failed.\n“I found you.” She pushes herself up from the dry riverbed, her hair dripping flecks of ash. She is trembling, not just with hunger anymore, her eyes fixed on the city’s unbroken wall. “I found you.”\nThe momentum of the shake rolls onward, passing beyond the girl’s reach. Though the ground has stopped moving, the ridge rockslide cannot be stopped: boulders and trees, including the tree that sheltered the girl the night before, break loose and tumble down to slam against the city’s protective wall, probably cracking it. But this is nowhere near the level of damage that the girl had hoped for. How will she get inside? She must get inside, now.\nAh—the gates of the city crank open. A way in. But the city dwellers are angry now. They might kill her, or worse.\nShe rises, runs. The days without food have left her little strength and poor speed, but fear supplies some fuel. Yet the stones turn against her now, and she stumbles, slips on loose rocks. She knows better than to waste time looking back.\nHooves drum the ground, a thousand tiny shakes that refuse to obey her will.\nOnce there was a girl who awoke in a prison cell.\nIt’s dark, but she can see the metal grate of a door not far off. The bed is softer than anything she’s slept on in months, and the air is warm. Or she is warm. She evaluates the fever that burns under her skin and concludes that it is dangerously high. She’s not hungry, either, though her belly is as empty as ever. A bad sign.\nThis may have something to do with the fact that her leg aches like a low, monotonous scream. Two screams. Her upper thigh burns, but the knee feels as though shards of ice have somehow inserted themselves into the joint. She wants to try and flex it, see if it can move enough to bear her weight, but it hurts so much already that she is afraid to try.\nShe remains still, listening before opening her eyes, a habit that has saved her life before. Distant sound of voices, echoing along corridors that stink of rust and mildewed mortar. No breath or movement nearby. Sitting up carefully, the girl touches the cloth that covers her. Scratchy, patchy. Warmer than her own blanket, wherever that is. She will steal this one, if she can, when she escapes.\nThen she freezes, startled, because there is someone in the room with her. A man.\nBut the man does not move, does not even breathe; just stands there. And now she can see that what she thought was skin is marble. A statue. A statue?\nIt’s hard to think through the clamor of fever and pain, even the air sounds loud in her ears, but she decides at last that the city-dwellers have peculiar taste in art.\nShe hurts. She’s tired. She sleeps.\n“You tried to kill us,” says a woman’s voice.\nThe girl blinks awake again, disoriented for a moment. A lantern burns something smoky in a sconce above her. Her fever has faded. She’s still thirsty, but not as parched as before. A memory comes to her of people in the room, tending her wounds, giving her broth tinged with bitterness; this memory is distant and strange. She must have been half delirious at the time. She’s still hungry—she is always hungry—but that need, too, is not as bad as it was. Even the fire and ice in her leg have subsided.\nThe girl turns to regard her visitor. The woman sits straddling an old wooden chair, her arms propped on its back. The girl does not have enough experience of other people to guess her age. Older than herself; not elderly. And big, with broad shoulders made broader by layers of clothing and fur, heavy black boots. Her hair, a poufing mane as gray and stiff as ash-killed grass, has been thickened further by plaits and knots which are either decoration or an attempt to keep the mass of it out of her eyes. Her face is broad and angular, her skin sallow-brown like the girl’s own.\n(The statue that was in the corner is gone. Once there was a girl who hallucinated while in a fever.)\n“You would’ve torn down half our southern wall,” the woman continues. “Probably destroyed one or more storecaches. That kind of thing is enough to kill a city these days. Wounds draw scavengers.”\nThis is true. It would not have been her intention, of course. She tries to be a successful parasite, not killing off her host; she inflicts only enough damage to get inside undetected. And while the city was busy repairing itself and fighting off the enemies who would have come, the girl could have survived unnoticed within its walls for some time. She has done this elsewhere. She could have prowled its alleys, nibbled at its foundations, searching always for the taste of vinegar. He is here somewhere.\nAnd if she fails to find him in time, if he does to this city what he has done elsewhere . . . well. She would not kill a city herself, but she’ll fatten herself off the carcass before she takes up his trail again. Anything else would be wasteful.\nThe woman waits a moment, then sighs as if she expected no response. “I’m Ykka. I assume you have no name?”\n“Of course I have a name,” the girl snaps.\nYkka waits. Then she snorts. “You look, what, fourteen? Underfed, so let’s say eighteen. You were a small child when the Rivening happened, but you’re not feral now—much—so someone must have raised you for awhile afterward. Who?”\nThe girl turns away in disinterest. “You going to kill me?”\n“What will you do if I say yes?”\nThe girl sets her jaw. The walls of her cell are panels of steel bolted together, and the floor is joined planks of wood over a dirt floor. But such thin metal. So little wood. She imagines squeezing her tongue between the slats of the floor, licking away the layers of filth underneath—she’s eaten worse—and finally touching the foundation. Concrete. Through that, she can touch the valley floor. The stone will be flavorless and cold, cold enough to make her tongue stick, because there’s nothing to heat it up—no shake or aftershake. And the valley is nowhere near a fault or hotspot, so no blows or bubbles, either. But there are other ways to warm stone. Other warmth and movement she can use.\nUsing the warmth and movement of the air around her, for example. Or the warmth and movement within a living body. If she takes this from Ykka, it won’t give her much. Not enough for a real shake; she would need more people for that. But she might be able to jolt the floor of her cell, warp that metal door enough to jiggle the lock free. Ykka will be dead, but some things cannot be helped.\nThe girl reaches for Ykka, her mouth watering in spite of herself—\nA clashing flavor interrupts her. Spice like cinnamon. Not so bad. But the bite of the spice grows sharper as she tries to grasp the power, until suddenly it is fire and burning and a crisp green taste that makes her eyes water and her guts churn—\nWith a gasp, the girl snaps her eyes open. The woman smiles, and the back of the girl’s neck prickles with belated, jarring recognition.\n“Answer enough,” Ykka says lightly, though there is cold fury in her eyes. “We’ll have to move you to a better cell if you have the sensitivity to work through steel and wood. Lucky for us you’ve been too weak to try before now.” She pauses. “If you had succeeded just now, would you have only killed me? Or the whole city?”\nStill shocked to find herself in the company of her own, the girl answers honestly before she can think not to. “Not the whole city. I don’t kill cities.”\n“What is that, some kind of integrity?” Ykka snorts a laugh.\nThere’s no point in answering the question. “I would’ve just killed as many people as I needed to get loose.”\n“And then what?”\nThe girl shrugs. “Find something to eat. Somewhere warm to hole up.” She does not add, find the vinegar man. It will make no sense to Ykka anyway.\n“Food, warmth, and shelter. Such simple wants.” There is mockery in Ykka’s voice, and it annoys the girl. “You could do with fresh clothes. A good wash. Someone to talk to, maybe, so you can start thinking of other people as valuable.”\nThe girl scowls. “What do you want from me?”\n“To see if you’re useful.” At the girl’s frown, Ykka looks her up and down, perhaps sizing her up. The girl does not have the same bottlebrush hair as Ykka, just scraggling brown stuff she chops off with her knife whenever it gets long enough to annoy. She is small and lean and quick, when she is not injured. No telling what Ykka thinks of these traits. No telling why she cares. The girl just hopes she does not appear weak.\n“Have you done this to other cities?” Ykka asks.\nThe question is so patently stupid that there’s no point in answering. After a moment Ykka nods. “Thought so. You seem to know what you’re about.”\n“I learned early how it was done.”\n“Oh?”\nThe girl decides she has said enough. But before she can make a point of silence, there is another ripple across her perception, followed by something that is unmistakably a jolt within the earth. Specks of mortar trickle from beneath a loose panel on the cell wall. Another shake? No, the deep earth is still cold. That jolt was more shallow, delicate, just a goosebump on the world’s skin.\n“You can ask what that was,” Ykka says, noticing her confusion. “I might even answer.”\nThe girl sets her jaw and Ykka laughs, getting to her feet. She is even bigger than she seemed while sitting, a solid six feet or more. Pureblooded Sanzed; half the races of the world have that bottlebrush hair, but the size is the giveaway. Sanzed breed for strength, so they can protect themselves when the world turns hard.\n“You left the southern ridge unstable,” Ykka says. “We needed to make repairs.” Then she waits, one hand on her hip, while the girl makes the necessary connections. It doesn’t take long. The woman is like her. (Taste of savory pepper stinging her mouth still. Disgusting.) But someone entirely different caused that shift a moment ago, and although their presence is like melon—pale, delicate, flavorlessly cloying—it holds a faint aftertaste of blood.\nTwo in one city? Their kind know better. Hard enough for one wolf to hide among the sheep. But wait—there were two more, right when she split the southern ridge. One of them was a different taste altogether, bitter, something she has never eaten so she cannot name it. The other was the vinegar man.\nFour in one city. And this woman is so very interested in her usefulness. She stares at Ykka. No one would do that.\nYkka shakes her head, amusement fading. “I think you’re a waste of time and food,” she says, “but it’s not my decision alone. If you try to harm the city again we’ll feel it, and we’ll stop you, and then we’ll kill you. But if you don’t cause trouble, we’ll know you’re at least trainable. Oh—and stay off the leg if you ever want to walk again.”\nThen Ykka goes to the grate-door and barks something in another language. A man comes down the hall and lets her out. The two of them look in at the girl for a long moment before heading down the hall and through another door.\nIn the new silence, the girl sits up. This must be done slowly; she is very weak. Her bedding reeks of fever sweat, though it is dry now. When she throws off the patch-blanket, she sees that she has no pants on. There is a bandage around her right thigh at the midpoint: the wound underneath radiates infection-lines, though they seem to be fading. Her knee has also been wrapped tightly with wide leather bandages. She tries to flex it and a sickening ripple of pain radiates up and down the leg, like aftershocks from her own personal rivening. What did she do to it? She remembers running from people on horseback. Falling, amid rocks as jagged as knives.\nThe vinegar man will not linger long in this city. She knows this from having tracked his spoor for years. Sometimes there are survivors in the towns he’s murdered, who—if they can be persuaded to speak—tell of the wanderer who camped outside the gates, asking to be let in but not moving on when refused. Waiting, perhaps for a few days; hiding if the townsfolk drove him away. Then strolling in, smug and unmolested, when the walls fell. She has to find him quickly because if he’s here, this city is doomed, and she doesn’t want to be anywhere near its death throes.\nContinuing to push against the bandages’ tension, the girl manages to bend the knee perhaps twenty degrees before something that should not move that way slides to one side. There is a wet click from somewhere within the joint. Her stomach is empty. She is glad for this as she almost retches from the pain. The heaves pass. She will not be escaping the room, or hunting down the vinegar man, anytime soon.\nBut when she looks up, someone is in the room with her again. The statue she hallucinated.\nIt is a statue, her mind insists—though, plainly, it is not a hallucination. Study of a man in contemplation: tall, gracefully poised, the head tilted to one side with a frank and thoughtful expression moulded into its face. That face is marbled gray and white, though inset with eyes of—she guesses—alabaster and onyx. The artist who sculpted this creation has applied incredible detail, even carving lashes and little lines in the lips. Once, the girl knew beauty when she saw it.\nShe also thinks that the statue was not present a moment ago. In fact, she’s certain of this.\n“Would you like to leave?” the statue asks, and the girl scrambles back as much as her damaged leg—and the wall—allows.\nThere is a pause.\n“S-stone-eater,” she whispers.\n“Girl.” Its lips do not move when it speaks. The voice comes from somewhere within its torso. The stories say that the stuff of a stone-eater’s body is not quite rock, but still far different from—and less flexible than—flesh.\nThe stories also say that stone-eaters do not exist, except in stories about stone-eaters. The girl licks her lips.\n“What . . . ” Her voice breaks. She pulls herself up straighter and flinches when she forgets her knee. It very much does not want to be forgotten. She focuses on other things. “Leave?”\nThe stone-eater’s head does not move, but its eyes shift ever-so-slightly. Tracking her. She has the sudden urge to hide under the blanket to escape its gaze, but then what if she peeks out and finds the creature right in front of her, peering back in?\n“They’ll move you to a more secure cell, soon.” It is shaped like a man, but her mind refuses to apply the pronoun to something so obviously not human. “You’ll have a harder time reaching stone there. I can take you to bare ground.”\n“Why?”\n“So that you can destroy the city, if you still want to.” Casual, calm, its voice. It is indestructible, the stories say. One cannot stop a stone-eater, only get out of its way.\n“You’ll have to fight Ykka and the others, however,” it continues. “This is their city, after all.”\nThis is almost enough to distract the girl from the stone-eater’s looming strangeness. “No one would do that,” she says, stubborn. The world hates what she is; she learned that early on. Those of her kind eat the power of the earth and spit it back as force and destruction. When the earth is quiet they eat anything else they can find—the warmth of the air, the movement of living things—to achieve the same effect. They cannot live among ordinary people. They would be discovered with the first shake, or the first murder.\nThe stone-eater moves, and seeing this causes chilly sweat to rise on the girl’s skin. It is slow, stiff. She hears a faint sound like the grind of a tomb’s cover-stone. Now the creature faces her, and its thoughtful expression has become wry.\n“There are twenty-three of you in this city,” it says. “And many more of the other kind, of course.” Ordinary people, she guesses by its dismissive tone. Hard to tell, because her mind has set its teeth in that first sentence. Twenty-three. Twenty-three.\nBelatedly, she realizes the stone-eater is still waiting for an answer to its question. “H-how would you take me out of the cell?” she asks.\n“I’d carry you.”\nLet the stone-eater touch her. She tries not to let it see her shudder, but its lips adjust in a subtle way. Now the statue has a carved, slight smile. The monster is amused to be found monstrous.\n“I’ll return later,” it says. “When you’re stronger.”\nThen its form, which does not vibrate on her awareness the way people do but is instead as still and solid as a mountain—shimmers. She can see through it. It drops into the floor as though a hole has opened under its feet, although the grimy wooden slats are perfectly solid.\nThe girl takes several deep breaths and sits back against the wall. The metal is cold through her clothing.\nThey move the girl to a cell whose floor is wood over metal. The walls are wood too, and padded with leather sewn over thick layers of cotton. There are chains set into the floor here, but thankfully they do not use them on her.\nThey bring the girl food: broth with yeast flakes, coarse flat cakes that taste of fungus, sprouted grains wrapped in dried leaves. She eats and grows stronger. After several days have passed, during which the girl’s digestive system begins cautiously working again, the guards give her crutches. While they watch, she experiments until she can use them reliably, with minimal pain. Then they bring her to a room where naked people scrub themselves around a shallow pool of circulating steaming water. When she has finished bathing, the guards card her hair for lice. (She has none. Lice come from being around other people.) Finally they give her clothing: undershorts, loose pants of some sort of plant fiber, a second tighter pair of pants made of animal skin, two shirts, a bra she’s too scrawny to need, fur-lined shoes. She dons it all, greedily. It’s nice to be warm.\nThey bring her back to her cell, and the girl climbs carefully into the bed. She’s stronger, but still weak; she tires easily. The knee cannot bear her weight yet. The crutches are worse than useless—she cannot sneak anywhere while noisily levering herself about. The frustration of this chews at her, because the vinegar man is out there, and she fears he will leave—or strike—before she can heal. Yet flesh is flesh, and hers has endured too much of late. It demands its due. She can do nothing but obey.\nAfter she rests for a time, however, she becomes aware that something vast and mountain-still and familiar is in the room again. She opens her eyes to see the stone-eater still and silent in front of the cell’s door. This time it has a hand upraised, the palm open and ready. An invitation.\nThe girl sits up. “Can you help me find someone?”\n“Who?”\n“A man. A man, like—” She has no idea how to communicate it in a way the stone-eater will understand. Does it even distinguish between one human and another? She has no idea how it thinks.\n“Like you?” the stone-eater prompts, when she trails off.\nShe fights back the urge to immediately reject this characterization. “Another who can do what I do, yes.” One of twenty-three. This is a problem she never expected to have.\nThe stone-eater is silent for a moment. “Share him with me.”\nThe girl does not understand this. But its hand is still there, proffered, waiting, so she pushes herself to her feet and, with the aid of the crutches, hobbles over. When she reaches for its hand, there is an instant in which every part of her revolts against the notion of touching its strange marbled skin. Bad enough to stand near where she can see that it does not breathe, notice that it does not blink, realize her every instinct warns against tasting it with that part of herself that knows stone. She thinks that if she tries, its flavor will be bitter almonds and burning sulfur, and then she will die.\nAnd yet.\nReluctantly, she thinks of the beautiful place, which she has not allowed herself to remember for years. Once upon a time there was a girl who had food every day and warmth all the time, and in that place were people who gave these things to her, unasked, completely free. They gave her other things, too—things she does not want now, does not need anymore, like companionship and a name and feelings beyond hunger and anger. That place is gone, now. Murdered. Only she remains, to avenge it.\nShe takes the stone-eater’s hand. Its skin is cool and yields slightly to the touch; her arms break out in gooseflesh, and the skin of her palm crawls. She hopes it does not notice.\nIt waits, until she recalls its request. So she closes her eyes and remembers the vinegar man’s sharp-sweet taste, and hopes that it can somehow feel this through her skin.\n“Ah,” the stone-eater says. “I do know that one.”\nThe girl licks her lips. “I’m going to kill him.”\n“You’re going to try.” Its smile is a fixed thing.\n“Why are you helping me?”\n“I told you. The others will fight you.”\nThis makes no sense. “Why don’t you destroy the city yourself, if you hate it so much?”\n“I don’t hate the city. I have no interest in destroying it.” Its hand tightens ever-so-slightly, a hint of pressure from the deepest places of the earth. “Shall I take you to him?”\nIt is a warning, and a promise. The girl understands: she must accept its offer now, or it will be rescinded. And in the end, it doesn’t matter why the stone-eater helps her.\n“Take me to him,” she says.\nThe stone-eater pulls her closer, folding its free arm around her shoulders with the slow, grinding inexorability of a glacier. She stands trembling against its solid inhumanity, looking into its too-white, too-dark eyes and clutching her crutches tight with her arms. It hasn’t ever stopped smiling. She notices, and does not know why she notices, that it smiles with its lips closed.\n“Don’t be afraid,” it says without opening its mouth, and the world blurs around her. There is a stifling sense of enclosure and pressure, of friction-induced heat, a flicking darkness and a feel of deep earth moving around her, so close that she cannot just taste it; she also feels and breathes and is it.\nThen they stand in a quiet courtyard of the city. The girl looks around, startled by the sudden return of light and cold air and spaciousness, and does not even notice the stone-eater’s movements this time as it slowly releases her and steps back. It is daytime. The city’s roof is rolled back and the sky is its usual melancholy gray, weeping ashen snow. From inside, the city feels smaller than she’d imagined. The buildings are low but close together, nearly all of them squat and round and dome-shaped. She’s seen this style of building in other cities; good for conserving heat and withstanding shakes.\nNo one else is around. The girl turns to the stone-eater, tense.\n“There.” Its arm is already raised, pointing to a building at the end of a narrow road. It is a larger dome than the rest, with smaller subsidiaries branching off its sides. “He’s on the second floor.”\nThe girl watches the stone-eater for a moment longer and it watches her back, a gently-smiling signpost. That way to revenge. She turns and follows its pointing finger.\nNo one notices her as she crutches along, though she is a stranger; this means the city’s big enough that not everyone knows everyone else. The people she passes are of many races, many ages. Sanzed like Ykka predominate, or maybe they are Cebaki; she never learned tell one from another. There are many black-lipped Regwo, and one Shearar woman with big moon-pale eyes. The girl wonders if they know of the twenty-three. (Twenty-four, her mind corrects.) They must. Her kind cannot live among ordinary people without eventually revealing themselves. Usually they can’t live among ordinary people at all—and yet here, somehow, they do.\nYet as she passes narrower streets and gaps in the buildings, she glimpses something else, something worse, that suddenly explains why no one’s worried about twenty-four people who each could destroy a city on a whim. In the shadows, on the sidewalks, nearly camouflaged by the ash-colored walls: too-still standing figures. Statues whose eyes shift to follow her. Many of them: she counts a dozen before she makes herself stop.\nOnce there was a city full of monsters, of whom the girl was just another one.\nNo one stops her from going into the large dome. Inside, this building is warmer than the one in which she was imprisoned. People move in and out of it freely, some in knots of twos and threes, talking, carrying tools or paper. As the girl moves through its corridors, she spies small ceramic braziers in each room which emit a fragrant scent as well as heat. There are stacks of long-dead flowers in the kindling piles.\nThe stairs nearly kill her. It takes some time to figure out a method of crutching her way up that does not force her to bend the damaged knee. She stops after the third set to lean against a wall, trembling and sweating. The days of steady food have helped, but she is still healing, and she has never been physically strong. It will not do for her to meet the vinegar man and collapse at his feet.\n“You all right?”\nThe girl blinks damp hair out of her eyes. She’s in a wide corridor lined by braziers; there is a long, patterned rug—pre-rivening luxury—beneath her feet. The man standing there is as small as she is, which is the only reason she does not react by jerking away from his nearness. He’s nearly as pale as the stone-eater, though his skin is truly skin and his hair is stiff because he is probably part Sanzed. He has a cheerful face, which is set in polite concern as he watches her.\nAnd the girl flinches when she instinctively reaches out to taste her surroundings and he tastes of sharp, sour vinegar, the flavor of smelly pickles and old preserved things and wine gone rancid, and it is him, it is him, she knows his taste.\n“I’m from Arquin,” she blurts. The smile freezes on the man’s face, making her think of the stone-eater again.\nOnce there was a city called Arquin, far to the south. It had been a city of artists and thinkers, a beautiful place full of beautiful people, of whom the girl’s parents were two. When the world broke—as it often breaks, as the rivening is only the latest exemplary apocalypse of many—Arquin buttoned up against the chill and locked its gates and hunkered down to endure until the world healed and grew warm again. The city had prepared well. Its storecaches were full, its defenses layered and strong; it could have lasted a long time. But then a stranger came to town.\nTaut silence, in the wake of the girl’s pronouncement.\nThe man recovers first. His nostrils flare, and he straightens as if to cloak himself in discomfort. “Everyone did what they had to do, back then,” he says. “You’d have done it too, if you were me.”\nIs there a hint of apology in his voice? Accusation? The girl bares her teeth. She has not tried to reach the stone beneath the city since she met Ykka. But she reaches now, tracing the pillars in the walls down to the foundation of the building and then deeper, finding and swallowing sweet-mint bedrock cool into herself. There isn’t much. There have been no shakes today. But what little power there is is a balm, soothing away the past few days’ helplessness and fear.\nThe vinegar man stumbles back against the corridor’s other wall, reacting to the girl’s touch on the bedrock as if to an insult. All at once the sourness of him floods forth like spit, trying to revolt her into letting go. She wants to; he’s ruining the taste. But she scowls and bites more firmly into the power, making it hers, refusing to withdraw. His eyes narrow.\nSomeone comes into the corridor from one of the rooms that branch off it. This stranger says something, loudly; the girl registers that he is calling for Ykka. She barely hears the words. Stone dust is in her mouth. The grind of the deep rock is in her ears. The vinegar man presses in, trying again to wrest control from the girl, and the girl hates him for this. How many years has she spent hungry, cold, afraid, because of him? No, no, she does not begrudge him that, not really, not when she has done just as many terrible things, he’s completely right to say you would too, you did too—but now? Right now, all she wants is power. Is that so much to ask? It’s all he’s left her.\nAnd she will shake this whole valley to rubble before she lets him take one more thing that is hers.\nThe rough-sanded wood of the crutches bites into her hands as she bites into imagined stone to brace herself. The earth is still now, its power too deep to reach, and at such times there’s nothing left to feed on save the thin gruel of smaller movements, lesser heat. The rose-flavored coals of the nearby braziers. The jerky twitchy strength of limbs and eyes and breathing chests. And, too, she can sup motions for which there are no names: all the infinitesimal floating morsels of the air, all the jittery particles of solid matter. The smaller, fast-swirling motes that comprise these particles.\n(Somewhere, outside the earth, there are more people nearby. Other tastes begin to tease her senses: melon, warm beef stew, familiar peppers. The others mean to stop her. She must finish this quickly.)\n“Don’t you dare,” says the vinegar man. The floor shakes, the whole building rattles with the warning force of his rage. Vibrations drum against the girl’s feet. “I won’t let you—”\nHe has no chance to finish the warning. The girl remembers soured wine that she once drank after finding it in a crushed Arquin storehouse. She’d been so hungry that she needed something, anything, to keep going. The stuff had tasted of rich malts and hints of fruit. Desperation made even vinegar taste good.\nThe air in the room grows cold. A circle of frost, radiating out from the girl’s feet, rimes the patterned rug. The vinegar man stands within this circle. (Others in the corridor exclaim and back off as the circle grows.) He cries out as frost forms in his hair, on his eyebrows. His lips turn blue; his fingers stiffen. There’s more to it than cold: as the girl devours the space between his molecules, the very motion of his atoms, the man’s flesh becomes something different, condensing, hardening. In the earth where flavors dwell, he fights; acid burns the girl’s throat and roils her belly. Her own ears go numb, and her knee throbs with the cold hard enough to draw tears from her eyes.\nBut she has swallowed far worse things than pain. And this is the lesson the vinegar man inadvertently taught her when he killed her future, and made her nothing more than a parasite like himself. He is older, crueler, more experienced, perhaps stronger, but survival has never really been the province of the fittest. Merely the hungriest.\nOnce the vinegar man is dead, Ykka arrives. She steps into the icy circle without fear, though there is a warning-tang of crisp green and red heat when the girl turns to face her. The girl backs off. She can’t handle another fight right now.\n“Congratulations,” Ykka drawls, when the girl pulls her awareness out of the earth and wearily, awkwardly, sits down. (The floor is very cold against her backside.) “Got that out of your system?”\nA bit dazed, the girl tries to process the words. A small crowd of people stands in the corridor, beyond the icy circle; they are murmuring and staring at her. A black-haired woman, as small and lithe as Ykka is large and immovable, has entered the circle with Ykka; she goes over to the vinegar man and peers at him as if hoping to find anything left of value. There’s nothing, though. The girl has left as much of him as he left of her life, on a long-ago day in a once-beautiful place. He’s not even a man anymore, just a gray-brown, crumbly lump of ex-flesh half-huddled against the corridor wall. His face is all eyes and bared teeth, one hand an upraised claw.\nBeyond Ykka and the crowd, the girl sees something that clears her thoughts at once: the stone-eater, just beyond the others. Watching her and smiling, statue-still.\n“He’s dead,” the black-haired woman says, turning to Ykka. She sounds more annoyed than angry.\n“Yes, I rather thought so,” Ykka replies. “So what was that all about?”\nThe girl belatedly realizes Ykka is talking to her. She is exhausted, physically—but inside, her whole being brims with strength and heat and satisfaction. It makes her lightheaded, and a little giddy, so she opens her mouth to speak and laughs instead. Even to her own ears, the sound is unsteady, unnerving.\nThe black-haired woman utters a curse in some language the girl does not know and pulls a knife, plainly intending to rid the city of the girl’s mad menace. “Wait,” Ykka says.\nThe woman glares at her. “This little monster just killed Thoroa—”\n“Wait,” Ykka says again, harder, and this time she stares the black-haired woman down until the furious tension in the woman’s shoulders sags into defeat. Then Ykka faces the girl again. Her breath puffs in the chilly air when she speaks. “Why?”\nThe girl can only shake her head. “He owed me.”\n“Owed you what? Why?”\nShe shakes her head again, wishing they would just kill her and get it over with.\nYkka watches her for a long moment, her hard face unreadable. When she speaks again, her voice is softer. “You said you learned early how it was done.”\nThe black-haired woman looks sharply at her. “We’ve all done what we had to, to survive.”\n“True,” said Ykka. “And sometimes those things come back to bite us.”\n“She killed a citizen of this city—”\n“He owed her. How many people do you owe, hmm? You want to pretend we don’t all deserve to die for some reason or another?”\nThe black-haired woman does not answer.\n“A city of people like us,” the girl says. She’s still giddy. It would be easy to make the city shake now, vent the giddiness, but that would force them to kill her when for some impossible reason they seem to be hesitating. “It’ll never work. They used to hunt us down before the rivening for good reason.”\nYkka smiles as though she knows what the girl is feeling. “They hunt us down now, in most places, for good reason. After all, only one of us could have done this.” She gestures vaguely toward the north, where a great jagged red-bleeding crack across the continent has destroyed the world. “But maybe if they didn’t treat us like monsters, we wouldn’t be monsters. I want us to try living like people for awhile, see how that goes.”\n“Going great so far,” mutters the black-haired woman, looking at the stone corpse of the vinegar man. Thoroa. Whichever.\nYkka shrugs, but her eyes narrow at the girl. “Someone will probably come looking for you, too, one day.”\nThe girl gazes steadily back, because she has always understood this. She’ll do what she has to do, until she can’t anymore.\nBut all at once the girl snaps alert, because the stone-eater is now standing over her. Everyone in the corridor jerks in surprise. None of them saw it move.\n“Thank you,” it says.\nThe girl licks her lips, not looking away. One does not turn one’s back on a predator. “Welcome.” She does not ask why it thanks her.\n“And these,” Ykka says from beyond the creature, with a sigh which may or may not be resigned, “are our motivation to live together peacefully.”\nMost of the braziers in the corridor are dark, extinguished by the girl in her desperate grab for power. Only the ones at either far end of the corridor, well beyond the ice-circle, remain lit. These silhouette the stone-eater’s face—though the girl can easily imagine its carved-marble smile.\nWordlessly Ykka comes over, as does the black-haired woman. They help the girl to her feet, all three of them watching the stone-eater warily. The stone-eater doesn’t move, either to impede them or to get out of the way. It just keeps standing there until they carry the girl away. Others in the hall, bystanders who did not choose to flee while monsters battled nearby, file out as well—quickly. This is only partly because the corridor is freezing.\n“Are you throwing me out of the city?” the girl asks. They have set her down at the foot of the steps. She fumbles with the crutches because her hands are shaking in delayed reaction to the cold and the near-death experience. If they throw her out now, wounded, she’ll die slowly. She would rather they kill her, than face that.\n“Don’t know yet,” Ykka says. “You want to go?”\nThe girl is surprised to be asked. It is strange to have options. She looks up, then, as a sound from above startles her: they are rolling the city’s roof shut against the coming night. As the strips of roofing slide into place, the city grows dimmer, although people move along the streets lighting standing lanterns she did not notice before. The roof locks into place with a deep, echoing snap. Already, without cool outside air blowing through the city, it feels warmer.\n“I want to stay,” the girl hears herself say.\nYkka sighs. The black-haired woman just shakes her head. But they do not call the guards, and when they hear a sound from upstairs, all three of them walk away together, by unspoken mutual agreement. The girl has no idea where they’re going. She doesn’t think the other two women do, either. It’s just understood that they should all be somewhere else.\nBecause the girl keeps seeing the corridor they just left, in the moment before they carried her down stairs. She’d glanced back, see. The stone-eater had moved again; it stood beside Thoroa’s petrified corpse. Its hand rested on his shoulder, companionably. And this time as it smiled, it flashed tiny, perfect, diamond teeth.\nThe girl takes a deep breath to banish this image from her mind.\nThen she asks of Ykka as they walk, “Is there anything to eat?”\nN. K. Jemisin is a Brooklyn author whose short fiction and novels have been multiply nominated for the Hugo and the Nebula, shortlisted for the Crawford and the Tiptree, and have won the Locus Award for Best First Novel. Her speculative works range from fantasy to science fiction to the undefinable; her themes include the intersections of race and gender, resistance to oppression, and the coolness of Stuff Blowing Up. She is a member of the Altered Fluid writing group, and a graduate of the Viable Paradise writing workshop. Her latest novel, The Shadowed Sun, was published in June 2012 from Orbit Books, and she's hard at work on a new series due to begin in 2014.", "source": "https://clarkesworldmagazine.com/jemisin_07_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Stone Hunger by N. K. Jemisin"}