{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "+anX0dV2YqzcAFMD3s0/s74JEog=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Chicken Little and the Death of Short Fiction  Every few months, leagues of Chicken Littles run to the rooftop to proclaim the impending death of short fiction. Fueled by annually declining subscription numbers for the “big three” genre magazines or the announcement of the closure of another, these reactions have some grounding, but fail to take the big picture into consideration.  Let’s start with the “big three” since they are the most popular target in this saga. For those not in the know, we’re talking about Analog, Asimov’s and The Magazine of Fantasy and Science Fiction (F&SF), the three magazines you’re most likely to find at a newsstand or bookstore. Asimov’s, at thirty-one years, is the baby of the bunch and they all are, as a whole, the old guard, time-tested survivors of an age where genre magazine readerships were considerably higher. Today the concern is over their more recent declines and whether or not those numbers can sustain continued publication. From my position as an outsider, it certainly appears that there is reason to be concerned.  The Littles would have you believe that the recent problems with the subscription numbers are tied to the health of short fiction as a whole. After all, just look at the number of failed markets listed at Ralan.com. (Ralan.com is one of the best sites to check for information about genre short fiction markets.) While they choose to look at that information as the second sign of the coming apocalypse, I simply see it as a reflection of new market realities.  Changes in technology have made it increasingly easy for the average person to launch a magazine and as a result, there has been a boom in the number of new markets over the last few years. Decreased risk in launching magazines has led to some “interesting” endeavors and many have failed. This should not be a cause for alarm. What we are seeing is a move from a few well-planned entries into the market to more of a shotgun approach representing a variety of different business models and philosophies. This is particularly true with the online markets, where a “standard” or best model has yet to prove itself. I have no doubt that for some time the failure rate will continue to be stunning. That said, some attempts will hit the target and the market will be better for it. This is evolution at work.  As someone who publishes an online magazine, I’ll admit to having a bias, but I don’t think that anyone would argue with me when I say that online publications have made significant gains in the last decade. You’ll find a lot more established authors published in online venues, the best paying markets are online, and judging from conversations with other online publishers, our readership, while smaller than our print cousins, is growing. Here are some other interesting facts:   A significant number of print publishers have launched online publications: Baen (Baen’s Universe), Subterranean (Subterranean), Prime (Fantasy Magazine), Tor (not yet, but they say really soon now), and Wyrm (Clarkesworld).  Well-known authors Orson Scott Card and Rudy Rucker have launched their own publications. (Intergalactic Medicine Show and Flurb, respectively)  The magazine with the 2nd largest readership/listenership is EscapePod. It boasts a download rate of over 18k per issue. (#1 is Analog)  Online magazines do not have the distribution issues print magazines have. Issues are instantly available around the world and accessible by more people than they would have been in print.  It should also be noted within the context of this discussion that there is a greater variety of short fiction markets now than ever and not at the expense of print magazines. We have a wealth of excellent small press print zines (like Electric Velocipede, Lady Churchill’s Rosebud Wristlet, Shimmer, and Sybil’s Garage) and many good online magazines (like Lone Star Stories, Abyss & Apex, Strange Horizons, Farrago’s Wainscot, in addition those already mentioned). No, the market is certainly not hurting for good fiction, places to read it, or enthusiastic fans to enjoy them.  If it isn’t the market causing the “big three’s” woes, then what is it? I think it is safe to say that we can hold the publications themselves somewhat responsible. In the last twenty years, we’ve seen the rise of a new generation of readers that have had a very different entertainment experience than their parents. The market has been changed by these people. Have magazines been keeping pace, standing still, or falling behind? Let’s take a look at Weird Tales.  This magazine was much farther down the spiral than the “big three” is at present. They were bleeding subscribers at a near-fatal rate when the publisher woke up and realized that they had to do something. Weird Tales, like many others, had remained relatively unchanged during the last two decades, and the market had moved on. They had become a time capsule, a magazine for your father’s generation.  Over the last year, Weird Tales has virtually reinvented itself. They overhauled their design, reorganized and replaced staff, embraced the internet, and targeted their marketing. Initial reports indicate that their efforts are paying off. Their subscriptions are up significantly and they’ve been attracting positive attention from circles that might not have considered paying much attention to a genre magazine. It’s a very promising start and an excellent example of how to embrace change.  Obviously, any insinuation here is an oversimplification of the problems the “big three” face. Things are always more complicated than they appear from the outside. A good solution for one, may only be a first step for another. All we can do is hope that each is being proactive in dealing with their problems. In the end, however, each publication has the responsibility to deal with its own problems. We shouldn’t be so quick to blame the market if something bad happens.  So, this has been my turn on the rooftop. It’s up to you to decide if I’m just another one of the crazies screaming or someone who made a few good points. As a huge fan of short fiction, it’s distressing to see so many beloved magazines come and go, but I refuse to go to that dark place. I look to the new guard to move us forward and the old guard to rise to the occasion, but I don’t expect this to happen without casualties. It’s time to judge the health of the market by the successes, not the failures. We’re supposed to learn from failures, not make them the standard by which we judge things.  What do you think? Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nChicken Little and the Death of Short Fiction\nEvery few months, leagues of Chicken Littles run to the rooftop to proclaim the impending death of short fiction. Fueled by annually declining subscription numbers for the “big three” genre magazines or the announcement of the closure of another, these reactions have some grounding, but fail to take the big picture into consideration.\nLet’s start with the “big three” since they are the most popular target in this saga. For those not in the know, we’re talking about Analog, Asimov’s and The Magazine of Fantasy and Science Fiction (F&SF), the three magazines you’re most likely to find at a newsstand or bookstore. Asimov’s, at thirty-one years, is the baby of the bunch and they all are, as a whole, the old guard, time-tested survivors of an age where genre magazine readerships were considerably higher. Today the concern is over their more recent declines and whether or not those numbers can sustain continued publication. From my position as an outsider, it certainly appears that there is reason to be concerned.\nThe Littles would have you believe that the recent problems with the subscription numbers are tied to the health of short fiction as a whole. After all, just look at the number of failed markets listed at Ralan.com. (Ralan.com is one of the best sites to check for information about genre short fiction markets.) While they choose to look at that information as the second sign of the coming apocalypse, I simply see it as a reflection of new market realities.\nChanges in technology have made it increasingly easy for the average person to launch a magazine and as a result, there has been a boom in the number of new markets over the last few years. Decreased risk in launching magazines has led to some “interesting” endeavors and many have failed. This should not be a cause for alarm. What we are seeing is a move from a few well-planned entries into the market to more of a shotgun approach representing a variety of different business models and philosophies. This is particularly true with the online markets, where a “standard” or best model has yet to prove itself. I have no doubt that for some time the failure rate will continue to be stunning. That said, some attempts will hit the target and the market will be better for it. This is evolution at work.\nAs someone who publishes an online magazine, I’ll admit to having a bias, but I don’t think that anyone would argue with me when I say that online publications have made significant gains in the last decade. You’ll find a lot more established authors published in online venues, the best paying markets are online, and judging from conversations with other online publishers, our readership, while smaller than our print cousins, is growing. Here are some other interesting facts:\nA significant number of print publishers have launched online publications: Baen (Baen’s Universe), Subterranean (Subterranean), Prime (Fantasy Magazine), Tor (not yet, but they say really soon now), and Wyrm (Clarkesworld).\nWell-known authors Orson Scott Card and Rudy Rucker have launched their own publications. (Intergalactic Medicine Show and Flurb, respectively)\nThe magazine with the 2nd largest readership/listenership is EscapePod. It boasts a download rate of over 18k per issue. (#1 is Analog)\nOnline magazines do not have the distribution issues print magazines have. Issues are instantly available around the world and accessible by more people than they would have been in print.\nIt should also be noted within the context of this discussion that there is a greater variety of short fiction markets now than ever and not at the expense of print magazines. We have a wealth of excellent small press print zines (like Electric Velocipede, Lady Churchill’s Rosebud Wristlet, Shimmer, and Sybil’s Garage) and many good online magazines (like Lone Star Stories, Abyss & Apex, Strange Horizons, Farrago’s Wainscot, in addition those already mentioned). No, the market is certainly not hurting for good fiction, places to read it, or enthusiastic fans to enjoy them.\nIf it isn’t the market causing the “big three’s” woes, then what is it? I think it is safe to say that we can hold the publications themselves somewhat responsible. In the last twenty years, we’ve seen the rise of a new generation of readers that have had a very different entertainment experience than their parents. The market has been changed by these people. Have magazines been keeping pace, standing still, or falling behind? Let’s take a look at Weird Tales.\nThis magazine was much farther down the spiral than the “big three” is at present. They were bleeding subscribers at a near-fatal rate when the publisher woke up and realized that they had to do something. Weird Tales, like many others, had remained relatively unchanged during the last two decades, and the market had moved on. They had become a time capsule, a magazine for your father’s generation.\nOver the last year, Weird Tales has virtually reinvented itself. They overhauled their design, reorganized and replaced staff, embraced the internet, and targeted their marketing. Initial reports indicate that their efforts are paying off. Their subscriptions are up significantly and they’ve been attracting positive attention from circles that might not have considered paying much attention to a genre magazine. It’s a very promising start and an excellent example of how to embrace change.\nObviously, any insinuation here is an oversimplification of the problems the “big three” face. Things are always more complicated than they appear from the outside. A good solution for one, may only be a first step for another. All we can do is hope that each is being proactive in dealing with their problems. In the end, however, each publication has the responsibility to deal with its own problems. We shouldn’t be so quick to blame the market if something bad happens.\nSo, this has been my turn on the rooftop. It’s up to you to decide if I’m just another one of the crazies screaming or someone who made a few good points. As a huge fan of short fiction, it’s distressing to see so many beloved magazines come and go, but I refuse to go to that dark place. I look to the new guard to move us forward and the old guard to rise to the occasion, but I don’t expect this to happen without casualties. It’s time to judge the health of the market by the successes, not the failures. We’re supposed to learn from failures, not make them the standard by which we judge things.\nWhat do you think?\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_06_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Chicken Little and the Death of Short Fiction by Neil Clarke"}