{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sam J Miller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yHh7/0VES54PQ1Yc3Blz4JXckpg=", "id": null, "license": null, "comments": "", "raw_text": "5680 words, short story, REPRINT  Last Gods  The Gods were circling when the sun rose, nine long patches of black that did not brighten with the sea as the sky lit up. I watched Them, Their knife-blade fins like polished onyx slicing the surface, formation shifting but the huge old matriarch always at the head. They swam between the sunken buildings, dwarfing the concrete bunkers, sketching intricate patterns that only They—and the Watcher in the tower—and I, slinking away on the ragged hill behind the town—could comprehend.  I saw my Gods, and my gut went sour.  It’s fine. It’s not your responsibility. You asked another Watcher to take your shift.  But she was a drunk, and everyone knew it. And if the warning didn’t sound—if boats were boarded while They were in the water—people would die. And it would be on me. And the village that had taken me in, sheltered and fed me in spite of my missing arms, would cast me out.  I watched my Gods, and I could taste the bell rope between my teeth. Plastic and bracken and the sweat of the other Watchers, men and women with hands. My head jerked, acting out the signal even though I was shirking my duty. Two tolls, then three, repeating: the signal that said They are here, Their formation indicates They mean us no harm, but no boats may be boarded. My neck ached. My jaw burned. And my face went red and hot, because I wasn’t in the tower, because I was skulking from the town like an outcast unbeliever. I watched the Gods, the beauty of Them, Their black implacable bulk, the white patch above and behind the eyes, and my whole body tingled with joy. And with shame.  The bell would sound. It had to. The village would come awake. Fishermen would scrape away ice and mutter prayers, and fling offerings to the Gods. Fires would be kindled, voices and laughter unleashed. This was a day like any other.  Except . . . not.  Because Kelb had come to my cabin last night. Knocked at my window. Told me to meet him at sunrise outside of town. Told me he was going . . . somewhere.  I told him yes. Even though everyone knew there was no Somewhere. Nowhere left on land to go. No animals still living, no cities away from the water still inhabited, nothing but icy poisoned wind and scorched rock. I told him yes, even though I knew I risked losing everything. I told him yes because I could not tell him no, not ever, and that had been true when I was eight and he was ten, my maimed foster brother’s only friend. I told him yes because everything Kelb did was rough, brutish, beautiful. Every morning I watched from the tower as he stumbled from his cabin, peeled off his shirt, scooped cold salt water over his black-furred torso. Kelb was oblivious to the cruelty of it, this display of fine muscled flesh and limber arms, oblivious to the hunger in my eyes, oblivious to me as anything other than the sad armless little sixteen-year-old sister of his dead best friend.  Our town looked so tiny, standing outside of it. I hurried, into the landscape of snow and sharp black rocks and bent sticks that people said had once been trees. I wanted to be out of earshot, so that if I didn’t hear the bells it might have been because I was too far away. And not because my replacement had failed miserably, and my life was over. My stomach tightened with the same old empty lonely feeling that always followed the ecstasy of a visit from our Gods.  But this time the emptiness did not go as deep as it could have. Because strapped to my back, cold and sharp and heavy, was the cymbal of Summoning. Burdening me down and buoying me up. An egregious sin, and a source of salvation. I had taken it on a mad reckless reasonless suicidal impulse, lifting it off the wall with one expert foot and placing it on the floor atop my torso wrap and lying on top of it and tying it tight with my feet, but feeling it there I was glad I had.  Over the hill, in a down-swoop of land that could have been the cresting of a wave, was Kelb. A dark blur at first, swelling into a man as I approached. Squatting, his bare red hands assembling from snow something forbidden. Hearing me, not looking up.  “Stop that,” I said. I kicked the little house apart and he laughed.  “Oh Adze. There’s no ocean in sight. Your precious Gods can’t see what we do.”  “They see everything,” I whispered. His blasphemy never failed to redden my cheeks with a mingling of fear and desire.  He hugged me hello, then stepped back. Put his hands on my shoulders, and then on my stumps. A gesture somewhere between brotherly and . . . not. And it occurred to me, for the first time, that maybe he did know how I felt about him. Maybe he counted on it.  “Eat,” he said, pressing a square of bladderwrack jerky into my mouth.  Around his neck he wore a thick plait of braided seaweed, studded with shards of broken glass. Not the worn-down, safe, pretty sea glass that most of us used as jewelry. This was jagged stuff, cruel and dangerous, salvaged from the factory wrecks to the south. Only thick, strong skin and superhuman confidence kept it from cutting him.  “If I ever needed any more proof that the Gods hate us, bladderwrack jerky would do the trick,” he said.  “Shh,” I said. “You shouldn’t say things like that. Where are we going, anyway?  “To see someone,” he said, stepping faster to keep pace with me. Armless as I was, no man had legs to match mine.  “No one lives on land,” I said. “And anyway what do you need me for?”  “Does it ever get frustrating?” Kelb asked, after putting another square into my mouth. “Having to depend on other people?”  “What do you mean?”  “You know. No arms. Not being able to do anything for yourself.”  I laughed. “No. That’s what it means, to be part of a community.”  “But they landlocked you. Stuck you in the tower—”  “They took me in,” I said. “A crippled orphan—they gave me a place. A role. And I’m not stuck. I rotate shifts with three other women. And anyway they’re considering me for the Priesthood.”  Or they were. Before this.  “Pssh,” he said, and I didn’t know if he was scoffing at the idea that they’d ever extend such an honor to crippled unworthy me, or at the idea that anyone would want to be part of the Priesthood in the first place.  Of course he didn’t understand. Kelb’s weirdness was part of why I liked him so much. He thought like most of my neighbors think, only more so. He was hungrier. His dad had been different too. The Gods killed him, for making a net. Nets are one of the many things men are not allowed to build. Cages are another. We still see birds, sometimes—scrawny, sickly things, flying lost from some faraway place where there still might be insects or seed plants—but the last time someone succeeded in catching and caging one, the Gods destroyed her home before the day was done.  I was lucky, in a way. My maiming marked me as forever outside, locked me away from their greed and their blasphemy. I could not share their constant, crippling hunger for more.  “Who is this supposed someone we’re going to see?” I asked, when the bladderwrack was done and Kelb seemed to have nothing else to say.  “A trader.”  Two days before, out on the ocean, our fishing party met another village’s. I had heard the Priesthood whispering about it. Different towns had different Priesthoods, different customs, and contact frequently spread crazy ideas. I wondered if this fictional trader was one of them.  “Look,” he said, scooping up a fistful of snow. He held it out to me, palm up. Poked it with a finger of his other hand, showed me the scraps and flakes of colored plastic. One was larger than the others, showed what might have been a hand. “Snow is different on land. It keeps things.”  “That’s why we shouldn’t be here,” I said, giving his hand a swift kick to spill the snow back to the ground.  “I always forget what a devil you can be with those legs,” he said.  We walked faster.  Travel over land wasn’t explicitly forbidden, but the Gods frowned upon it. The inland cities were swallowed when the seas began to rise; all that was left was high frozen barren land poisoned by war and waste. The coastal cities still stood, huge buildings rising rusting from the sea, home to humans so barbaric the Gods would not allow them even the smallest of boats.  “I’m surprised you came,” he said. “And happy. Always held out hope that Schoon’s sister would have a little of his rebel spirit.”  Schoon’s rebel spirit got him killed, I did not say, because the name still hurt in my mouth.  We walked between high drifts of snow. We crossed smooth patches of ice, and treacherous stretches of sharp slippery stones. I shivered and prayed, thinking back to that last glimpse of my village. How the smoke rising from our homes looked thinner, flimsier, like our fires could not keep out the cold for long. The bunkers had been built back when men still thought they could outsmart the sea, find a safe place to carry on the sinful lives that had displeased the Gods so much that They made the sea swallow up all that we had. Those men never finished their safe place. They vanished like sand under the waves, fighting and clawing for the last little bit of land. Only a handful learned that the only way to survive was to make peace with the sea. And with the Gods. And that meant a Priesthood to learn what behavior angered Them, and keep each settlement in line. Because Gods never gave warnings. If we displeased Them, we died.  “Used to be the land was as rich as the sea,” Kelb said, as we entered a wide snowless space, pointing out to the blasted ash-colored hills.  “That’s what they say,” I said.  “You don’t believe it?”  I shrugged. “It’s one of those things where even if it’s true, there doesn’t seem to be much point in mooning over it.”  “Still. It’s nice to think that once there was food other than fish and seaweed. You know they used to call this place New Jersey.”  Shushing his blasphemies got tiresome after a while, so I said nothing. But naming things implied ownership, conquest, and it made me shiver. He turned to take in the landscape, and for the first time I noticed the sealskin bag he carried on his back, so full it bulged.  “What’s in there?” I asked.  “You might have been born out here,” he said. “One of the land settlements.”  “There’s no such thing.”  They say I was four when I came, the cauterization scars on my arm stumps still raw and weeping. I had no memory of my life before the village took me in, handed off from another people that met ours at sea, on the hunt—people with no fixed village, who traveled with the ice by canoe and slept in temporary homes. They hadn’t spoken what we speak, but they offered goods to reward the family who took me in. My father was good-hearted and hungry, and had taken in Schoon the same way. He said I wasn’t one of the people who had handed me off—the skin tone didn’t match—and I wondered for the millionth time who my people were, whether they were holier than we, what they did with my arms when they chopped them off, how strict and wise their Priesthood, whether my deep love for the Gods and my lack of thing-hunger came from them.  “There’s a man,” Kelb said, yielding to the pressure of my resentful silence, “who lives out this way. He has something I want.”  “What?”  Kelb kept walking.  “How does he live?” I asked. “On land. What does he eat?”  “People bring him food. They want what he has.”  “Is it something forbidden?”  “Let’s just say the Gods wouldn’t like it.”  A net, a cage, a metal blade? Kelb saw my face, and laughed. “Wake up, little sister. There are plenty of people who think like me. Who think the Gods are just a bunch of dumb animals, and that if we ever want to have a shot at a real life for our people, we have to get over this fear of Them.”  I shut my eyes and prayed. I prayed that the Gods would forgive his blasphemy, and I prayed that he was wrong. I knew not everyone shared my reverence, but could people seriously think they could act in opposition to the will of the Gods? That kind of craziness could anger Them enough to wipe us all out.  I prayed for strength, too. Because somehow his blasphemy made him more beautiful, and echoed inside my head, seductively.  I should have cared more, about who this man was we were visiting and what he had. But I didn’t. Because I didn’t ever want us to get there.  We passed buildings, bare wood against the earth. Some in shambles, some still standing.  “Sorry you’re too big for me to carry on my shoulders,” he said, slowing down at my thousandth stumble.  “Like you were so good at it,” I said. “You weren’t that much older than me.”  “True, true. If Schoon had lived—”  Kelb didn’t finish the sentence. I didn’t ask. I could imagine dozens of ways it could have ended, some wonderful. As long as he left it unfinished I could hope it would have been one of the wonderful ones. I was almost startled to see that some small part of me really believed we could be together. That he wanted me the way I wanted him.  Eventually we reached a wide flat swath of ice. Black and clear of snow. The going here was easier, although I could see Kelb was uncomfortable. His head darted around like a minnow, watching for cracks and soft spots and sudden eruptions of divine vengeance from beneath.  Sunset surprised me. Had we really been walking so long? We left the ice, crossed sand. I whispered the twilight prayer and let the dark come upon me, enter me, take away my sight and return me to the primal union of all with all.  “I can’t navigate without the sun,” Kelb said. “We need to stop and get some sleep.”  We found a cabin quickly enough, one of the empty and decrepit ones. The familiar freezing wind sliced through where a wall had been, but we had furs for warmth, and we were both exhausted.  But once we were laid out on the floor Kelb fell instantly asleep, and I found I could not follow. My mind swam dolphin-fast, circling truths I didn’t want to arrive at. What he was—what he really was, this boy I loved, this strange and twisted man. What I was—the kind of person who would steal the cymbal of Summoning, the kind of person that saw Kelb for who he was and wanted him anyway.  Carrying that kind of hate inside, he would not last long. Nothing in his life could ever eclipse his anger at the Gods. Not love, not me, not ever. And still, I wanted him. Even though I knew he was doomed, knew he was out of balance with the world, still I hungered for him.  “Kelb,” I whispered, wanting hands more than I had ever wanted them before. There was no end to the places I could have put them. People did so many things with their hands, to the people they desired. Instead I snuggled under his fur blanket, spooned my body in behind his. “Kelb,” I said again, lips against his ear. He turned, awake and alert and erect. My beautiful, damned boy. He did not need me. How could he know need, with hands like that? They moved up and down me, insatiably hungry. He was separate, savage, alone. And as my mouth gnawed desperately at his chest and stomach, arms and hands, I saw, for the first time, how my own hunger exceeded his.  In the morning he kissed my forehead, helped me dress. Kelb showed none of the shame and contempt that I knew men often had, after showing someone such a secret part of themselves . . . but he still avoided eye contact, and said little.  “What’s up with that?” he said, tapping the cymbal strapped to my back. “Gonna summon your Gods to come make everything better? Gonna hold an impromptu solstice ceremony?”  “Just felt like having it,” I said. “You never know. Doesn’t the sound of the cymbal cheer you up?”  “Risky business,” he said, covering his goose pimpled torso with a shirt. “Get caught taking that out of the village and they’ll kick you out for sure. Maybe offer you up to Them for good measure.”  I tried to think of something to say that would be remotely true and at least a little funny, but since I still didn’t know what my reasons were for bringing it I said nothing.  “Must be nice,” he said, gruffly, but also tenderly, wincing as he shouldered his bag. “Not to ever have to carry things. Not to be burdened down.”  “It is nice,” I said. He waited for the follow-up, where I complained about how hard it was, but I had no complaints. Having hands made you put your faith and love in what you could hold to yourself and whisper Mine. And I was different. Or that’s what I had been telling myself. Until last night. Until I saw how deep my own wanting went.  “What’s in the bag?” I asked, mostly just to shake loose a train of thought that was taking me nowhere nice.  “Trade goods,” he said. “He’s not going to just give me what I want.”  By the time we got to the cabin with smoke curling up from it, the sun was high above us. An old man sat outside, in a bright ridiculous purple plastic chair. The sea-scroungers sometimes came back to the village with that kind of plastic absurdity—long pink birds and green pigs and giant balls—but representations were forbidden and we’d shred them in the gear wheels and melt the flakes in a vat to make waterproof sheeting and crude work clothes.  “Greetings, travelers,” he said.  “Are you Zimm?”  “I am,” he said, and stood, and bowed. “And you must be Kelb. The one who frowns all the time, and wears glass shards like an idiot, and wants to kill the Gods.”  Of course it was all bluff and bluster, standard man-talk to make himself seem strong. But how could such ugliness be mistaken for strength? The Gods swept fat seals and whole schools of fish into the reach of our hunters; They kept us safe from storms and kept our Shore clear of toxic animals. Perhaps I was spoiled, having been spared the society of men.  Zimm asked “You come to trade?”  “I do.”  He ushered us in. The cabin was packed with hundreds of boxes, different sizes and shapes and colors. At a table, he set a small metal cylinder. Then he stabbed at it with a queer sort of knife, until the top lay raggedly open. A sweet, funny smell filled the room.  “Corn,” he said, tilting the top to show us. Small triangles, the brightest shade of yellow I had ever seen. Bright like the sun was supposed to be, behind the toxic forever-clouds.  “Cans,” Kelb said, picking up a cylinder from the stack. “I’ve never seen them like this.”  I marveled at it too. The rusted husks of cans were everywhere; I had never imagined them in any other state.  “I’ve got a lot of things you’ve never seen before.”  The man made me nervous. He ate in front of us, right from the can. Gave me a spoonful; smiled lewdly as he slid it into my mouth; enjoyed the squirmy look on my face as I bit down on the bright yellow wrong-tasting triangles. They were crunchy like kelp polyps, but the sea-taste that made food food was missing.  “Girl doesn’t have a name?” he asked.  Something protective flexed in Kelb. He tightened, the way a man in a canoe might when a meat-whale breached.  “I’m Adze,” I said.  “You two brother and sister?”  “No,” Kelb said curtly, but said no more. He leaned slightly across the table, and his face was stormy and I loved him so much my body hurt. Zimm shrugged, and we kept eating.  Squares of thin fabric hung on his walls, covered in lines and colors. Kelb saw it, and stood. “Is that . . . it?”  “That’s it,” the man said. “What you heard about. Why you came.”  “What’s it?” I asked.  “Paper,” Kelb said, and stood. “Can I touch it?”  “Touch away.”  “That’s paper?” I asked.  It looked so flimsy, so harmless. I had imagined some drug or weapon, some magic tool of long-dead gods.  What I knew about paper: that the old world had run on it, that it had helped men make the planet a living hell and finally destroy it. That people clung to it, even after everything. Carried pieces of it with them; wept over it, drew strength from it. With paper, somehow, men could make things even the Gods feared. And only the settlements whose Priesthoods banned paper altogether survived.  But this—this stuff could not have kept my nose warm. How could it harm a God, or destroy a planet?  “So what are you looking for?” Zimm said. “Books? Photographs? Words? Pictures?”  “I want something that will prove what I already know. That the Gods are nothing but animals. No different from anything else in the sea.”  “You’re an idiot,” I whispered, but he was too focused on Zimm’s smiling nodding head.  From one of his hundreds of boxes, the old man pulled a small square. When he set it down on the table, I saw that the square was made of many many pieces of paper, stacked together. “Something like this?” he said, and handed one piece to Kelb.  This was a smile I had never seen before. The smile I knew lurked somewhere inside of my scowling handsome friend. The one I dreamed that someday I would lure to the surface. A smile of pure and mighty happiness. I shivered inside, seeing it now. Maybe paper was magic. How else could something sit in a box for ages, yet emerge and make men feel things?  “Is this what I think it is?”  Zimm nodded. “The Gods, as our prisoners.”  Kelb held it up for me. The square showed a God. But wrong, somehow. Flat and tiny, as though seen from far away. Captured. Caught inside this fearsome paper stuff.  “Orca,” Zimm said, tracing his finger along four strange symbols in a corner. An old name for the Gods, one that made me quiver with the intimacy it implied. The hubris, to limit them to one word.  In the paper, a God leapt from water bluer than any sea or sky had ever been. It leapt through a giant circle, held by two humans. More humans surrounded it, seated in high chairs. They looked down on it. They smiled. They cheered. It belonged to them; their pet, like the seal pups we sometimes raised when the weather was good and the sea was bountiful.  “No,” I said, sick to my stomach, turning away.  “Get enough of these and it’ll be easy to get the whole village on your side,” Zimm told Kelb, handing him more. “I even got some that show Gods getting killed, cut up, tortured, you name it. Show these around and everybody will start sharpening their spears.”  Kelb turned from paper to paper. I shut my eyes, to hide from what his face was doing.  Eventually, abruptly, Zimm snatched the stack of papers back. Looked at Kelb, then at me. His eyes hurt like harpoons must hurt. “What have you got for it?”  Kelb said nothing. Looked at the floor. Looked at his hands. And in his silence, I knew. Finally. Why I was there. Why he had asked me.  “I’ll give you all the pictures you want,” Zimm said. “For her.”  He didn’t flinch. The proposition didn’t shock him. It had been his plan all along.  “Kelb,” I said, or tried to say, but fear had left my mouth waterless.  “You could have corn every day,” Zimm said, reaching out to touch me. I kicked his leg, hard. He cried out in pain, then laughed. Not pleasantly. Took a step closer.  “Stop,” Kelb said, and unbuckled his sack, dumped its contents on the table. Seal meat, cured and smoked. Dried fish. An unspeakable sum. More than Kelb could ever have stockpiled. Some of it had to be stolen. That much meat meant people would starve.  “I get that much food for the spoonful of corn I fed her,” Zimm said. “Richer settlements to the North pay me plenty. I want her.”  Kelb counted out three cards. “That much food for these,” he said, his voice a child’s. “Or no deal.” He stood up straighter, made his face hard.  “Fine,” Zimm said, making a great show of undisappointment. “Never was one for damaged goods anyway.”  And then Kelb’s hand was on my shoulder, steering me towards the exit. “We’re leaving.”  The cold had never been so cold. My mouth hurt from the metal sweetness of the “corn,” and from how hard I fought to keep from screaming obscenities at Kelb. The Shore glittered, at the bottom of a steep hill to our right. Black dots circled. I wondered if the Gods could see us from there; know who we were and where we lived and what we had done. What was in Kelb’s heart.  “What changed your mind?” I asked, starting down the hill. “You brought me to sell to him. Didn’t you?”  Kelb said nothing.  “Was it the sex? Would you have handed me over if last night hadn’t happened?”  I kept my head down and blundered forward, into bitter wind. We reached the flat expanse of ice after an hour or many of walking.  “Adze,” he said.  “No!” I called, stepping onto the ice.  “Adze,” he said, and I ran. He followed, repeating my name with every breath. Finally I let him overtake me. His hands grasped my shoulders. His hands were so big, so strong. “I’m sorry,” he said. “Okay. I’m sorry. I never—I didn’t . . . ”  “You’re a liar,” I said. I tried to wriggle free, but he would not let me. “You’re insane. I was stupid not to see it. I saw you how I wanted to see you. How I used to see you, when you were the only one who would be nice to Schoon and me, because we were orphans, we were damaged.”  Kelb pulled me tighter. He hugged me. He wept. He never wept when Schoon died. “I’m sorry,” he said, over and over, until it wasn’t about Zimm and his horrible paper or his plan to sell me anymore.  It would have been easy to kick him in the crotch or knees, incapacitate him, take the cards from his bag, chew them up and spit them out, flee back to the village. I told myself the reason I didn’t was because I couldn’t make it back alone, but I knew that was half the truth or less. The whole truth was that I still loved him, wanted him, couldn’t bear the hurt of him hating me. And the whole truth was that we were the same.  The sweet kind child-Kelb was real, but so was the savage monster. Kelb was both. A gentle boy who loved me fiercely, and a wicked murderer who would sell me into slavery. An idealist who loved humanity and wanted us to be free of backwards superstition . . . who didn’t care who died in the pursuit of his ideals.  Kelb was both, and so was I. A devout believer and a wicked sinner.  We were the same. We were animals who wished we were more than that.  The gods were just animals.  I shook free of him. I shut my eyes. If he brought those cards back, he’d endanger everyone. “Go,” I said, knowing what needed to be done to save my village, and wanting desperately not to know. “I’ll catch up. I want some space.”  He nodded, kissed my forehead, went. I squatted, and sat. We were out where the ice was thinnest, a skin of blue-green above unthinkable depths. I prayed, but felt nothing. I waited until he had gone too far to come back and stop me. With my teeth I tore off my sealskin boots, unwrapped my footwrappings. My toes deftly opened my jacket, burrowed deep to unwrap my torso. I shimmied until the cymbal came loose. I lifted it, flipped it over so the smooth bottom was flush with the ice. So the ice would act as an amplifier.  I lay on my back and rested my ankle on the cymbal. I lifted my leg and brought it down as hard as I could, striking the cymbal with a force no other human could match.  “Adze!” Kelb cried, stopped short by the hollow ring, which wobbled in the air but would sound clear as singing through the water under the ice.  I stood up. I lifted my leg to point accusingly in his direction. He ran towards me, towards land, but he was very far away from both.  I thought about shouting I’m sorry, but what was the point? What did it matter what I was?  A black shape passed beneath me, majestic and immense. I shut my eyes and kept my leg extended. I was not afraid. I was the bearer of the cymbal. They would trust me.  A crack split the air. A sharp black head broke the ice between us, then dove. The God spiraled her body beneath the water, shoving her tail out of the water and bringing it down hard against the broken edges of the ice. Cracks fanned out.  “Adze, please!” Kelb called. More loud cracks; the snouts of two more Gods shattering through the ice in front of me. I stood my ground, standing over my warm clothes, shivering.  He stopped running. He stared at me, close enough now that I could see the pain on his face. See the fear—and then, something worse than fear. Something he’d never felt before: belief. Final, fatal, too-late belief. What cruelty, I thought, that he should find his in in the moment that I lose mine.  Kelb sobbed, once, then turned and ran again.  He ran even though he knew it was folly, because it might buy him a few more minutes of life. A thousand times we had seen seals behave the same way, when the Gods separated them from their rookeries, trapped them out on the ice and then tipped the ice to spill them into their mouths.  In a matter of moments he stood on a massive separate sheet. Raw ocean roiled all around him. I counted twenty fins, circling.  I expected Kelb to scream, kick, curse, fight. Die flailing at the Gods the way he had lived his whole life. But Kelb merely walked to the edge of the ice and knelt. His eyes shut. His lips moved. Praying or apologizing or promising. I wouldn’t let myself look away. I watched them slap the water with their tails, in great synchronized sweeps, one after the other, until the churning water destabilized the ice and Kelb spilled into the sea. One came up from beneath him, held him in its jaws almost delicately. Kelb did not fight. He turned to look at me one last time, his mouth a sideways squiggle, either smile or frown, before the matriarch grabbed hold of the upper half of him and pulled.  Some villages believe that if a God drags you down, you become one of them. And maybe that’s true for them. But for us, when they pull us under, we die.  The way back to land was long, and riddled with broken ice. If they wanted to kill me I was going to die.  I stood up, walked to the pink-frothing edge of the ice. I showed my puny armless self to the Gods. The matriarch rose and held position, exposing her entire gorgeous head. Blood still stained her teeth. If I had hands, I could have reached out and touched her.  For forty seconds, she stared at me. Her eyes pierced through to what I had somehow failed to see before this day. She was an animal, and so was I. She was not a God, and I had not been chosen for divine protection. I wasn’t better or purer or more full of faith than anyone else. I was a wicked, sinful creature, born out of balance and bound there, like all my accursed kind. Hungry even when full. Wanting, always. Defined by the wanting and damned by it. Inventing Gods to give meaning to our lives, and shape to our hungers, but they could not stop us from destroying everything, including ourselves, including them. My armlessness, my inability to ever hurt them, was the only reason to let me live.  She withdrew, then. Slid back through the ice. Cried out underwater to her brothers and sisters. I stood there, shivering and wet beneath a useless sun, and watched my Gods abandon me.    Originally published in Drowned Worlds, edited by Jonathan Strahan. Sam J. Miller is a writer and a community organizer. His debut novel The Art of Starving (HarperTeen) was one of NPR's Best Books of 2017, and won the Andre Norton Award. His current novel, Blackfish City (Ecco Press; Orbit) is an Entertainment Weekly \"Must Read\" and was called \"an action-packed science fiction thriller\" and \"surprisingly heartwarming\" by the Washington Post. He's a graduate of the Clarion Science Fiction & Fantasy Writers Workshop, and a winner of the Shirley Jackson Award. He lives in New York City.", "text": "5680 words, short story, REPRINT\nLast Gods\nThe Gods were circling when the sun rose, nine long patches of black that did not brighten with the sea as the sky lit up. I watched Them, Their knife-blade fins like polished onyx slicing the surface, formation shifting but the huge old matriarch always at the head. They swam between the sunken buildings, dwarfing the concrete bunkers, sketching intricate patterns that only They—and the Watcher in the tower—and I, slinking away on the ragged hill behind the town—could comprehend.\nI saw my Gods, and my gut went sour.\nIt’s fine. It’s not your responsibility. You asked another Watcher to take your shift.\nBut she was a drunk, and everyone knew it. And if the warning didn’t sound—if boats were boarded while They were in the water—people would die. And it would be on me. And the village that had taken me in, sheltered and fed me in spite of my missing arms, would cast me out.\nI watched my Gods, and I could taste the bell rope between my teeth. Plastic and bracken and the sweat of the other Watchers, men and women with hands. My head jerked, acting out the signal even though I was shirking my duty. Two tolls, then three, repeating: the signal that said They are here, Their formation indicates They mean us no harm, but no boats may be boarded. My neck ached. My jaw burned. And my face went red and hot, because I wasn’t in the tower, because I was skulking from the town like an outcast unbeliever. I watched the Gods, the beauty of Them, Their black implacable bulk, the white patch above and behind the eyes, and my whole body tingled with joy. And with shame.\nThe bell would sound. It had to. The village would come awake. Fishermen would scrape away ice and mutter prayers, and fling offerings to the Gods. Fires would be kindled, voices and laughter unleashed. This was a day like any other.\nExcept . . . not.\nBecause Kelb had come to my cabin last night. Knocked at my window. Told me to meet him at sunrise outside of town. Told me he was going . . . somewhere.\nI told him yes. Even though everyone knew there was no Somewhere. Nowhere left on land to go. No animals still living, no cities away from the water still inhabited, nothing but icy poisoned wind and scorched rock. I told him yes, even though I knew I risked losing everything. I told him yes because I could not tell him no, not ever, and that had been true when I was eight and he was ten, my maimed foster brother’s only friend. I told him yes because everything Kelb did was rough, brutish, beautiful. Every morning I watched from the tower as he stumbled from his cabin, peeled off his shirt, scooped cold salt water over his black-furred torso. Kelb was oblivious to the cruelty of it, this display of fine muscled flesh and limber arms, oblivious to the hunger in my eyes, oblivious to me as anything other than the sad armless little sixteen-year-old sister of his dead best friend.\nOur town looked so tiny, standing outside of it. I hurried, into the landscape of snow and sharp black rocks and bent sticks that people said had once been trees. I wanted to be out of earshot, so that if I didn’t hear the bells it might have been because I was too far away. And not because my replacement had failed miserably, and my life was over. My stomach tightened with the same old empty lonely feeling that always followed the ecstasy of a visit from our Gods.\nBut this time the emptiness did not go as deep as it could have. Because strapped to my back, cold and sharp and heavy, was the cymbal of Summoning. Burdening me down and buoying me up. An egregious sin, and a source of salvation. I had taken it on a mad reckless reasonless suicidal impulse, lifting it off the wall with one expert foot and placing it on the floor atop my torso wrap and lying on top of it and tying it tight with my feet, but feeling it there I was glad I had.\nOver the hill, in a down-swoop of land that could have been the cresting of a wave, was Kelb. A dark blur at first, swelling into a man as I approached. Squatting, his bare red hands assembling from snow something forbidden. Hearing me, not looking up.\n“Stop that,” I said. I kicked the little house apart and he laughed.\n“Oh Adze. There’s no ocean in sight. Your precious Gods can’t see what we do.”\n“They see everything,” I whispered. His blasphemy never failed to redden my cheeks with a mingling of fear and desire.\nHe hugged me hello, then stepped back. Put his hands on my shoulders, and then on my stumps. A gesture somewhere between brotherly and . . . not. And it occurred to me, for the first time, that maybe he did know how I felt about him. Maybe he counted on it.\n“Eat,” he said, pressing a square of bladderwrack jerky into my mouth.\nAround his neck he wore a thick plait of braided seaweed, studded with shards of broken glass. Not the worn-down, safe, pretty sea glass that most of us used as jewelry. This was jagged stuff, cruel and dangerous, salvaged from the factory wrecks to the south. Only thick, strong skin and superhuman confidence kept it from cutting him.\n“If I ever needed any more proof that the Gods hate us, bladderwrack jerky would do the trick,” he said.\n“Shh,” I said. “You shouldn’t say things like that. Where are we going, anyway?\n“To see someone,” he said, stepping faster to keep pace with me. Armless as I was, no man had legs to match mine.\n“No one lives on land,” I said. “And anyway what do you need me for?”\n“Does it ever get frustrating?” Kelb asked, after putting another square into my mouth. “Having to depend on other people?”\n“What do you mean?”\n“You know. No arms. Not being able to do anything for yourself.”\nI laughed. “No. That’s what it means, to be part of a community.”\n“But they landlocked you. Stuck you in the tower—”\n“They took me in,” I said. “A crippled orphan—they gave me a place. A role. And I’m not stuck. I rotate shifts with three other women. And anyway they’re considering me for the Priesthood.”\nOr they were. Before this.\n“Pssh,” he said, and I didn’t know if he was scoffing at the idea that they’d ever extend such an honor to crippled unworthy me, or at the idea that anyone would want to be part of the Priesthood in the first place.\nOf course he didn’t understand. Kelb’s weirdness was part of why I liked him so much. He thought like most of my neighbors think, only more so. He was hungrier. His dad had been different too. The Gods killed him, for making a net. Nets are one of the many things men are not allowed to build. Cages are another. We still see birds, sometimes—scrawny, sickly things, flying lost from some faraway place where there still might be insects or seed plants—but the last time someone succeeded in catching and caging one, the Gods destroyed her home before the day was done.\nI was lucky, in a way. My maiming marked me as forever outside, locked me away from their greed and their blasphemy. I could not share their constant, crippling hunger for more.\n“Who is this supposed someone we’re going to see?” I asked, when the bladderwrack was done and Kelb seemed to have nothing else to say.\n“A trader.”\nTwo days before, out on the ocean, our fishing party met another village’s. I had heard the Priesthood whispering about it. Different towns had different Priesthoods, different customs, and contact frequently spread crazy ideas. I wondered if this fictional trader was one of them.\n“Look,” he said, scooping up a fistful of snow. He held it out to me, palm up. Poked it with a finger of his other hand, showed me the scraps and flakes of colored plastic. One was larger than the others, showed what might have been a hand. “Snow is different on land. It keeps things.”\n“That’s why we shouldn’t be here,” I said, giving his hand a swift kick to spill the snow back to the ground.\n“I always forget what a devil you can be with those legs,” he said.\nWe walked faster.\nTravel over land wasn’t explicitly forbidden, but the Gods frowned upon it. The inland cities were swallowed when the seas began to rise; all that was left was high frozen barren land poisoned by war and waste. The coastal cities still stood, huge buildings rising rusting from the sea, home to humans so barbaric the Gods would not allow them even the smallest of boats.\n“I’m surprised you came,” he said. “And happy. Always held out hope that Schoon’s sister would have a little of his rebel spirit.”\nSchoon’s rebel spirit got him killed, I did not say, because the name still hurt in my mouth.\nWe walked between high drifts of snow. We crossed smooth patches of ice, and treacherous stretches of sharp slippery stones. I shivered and prayed, thinking back to that last glimpse of my village. How the smoke rising from our homes looked thinner, flimsier, like our fires could not keep out the cold for long. The bunkers had been built back when men still thought they could outsmart the sea, find a safe place to carry on the sinful lives that had displeased the Gods so much that They made the sea swallow up all that we had. Those men never finished their safe place. They vanished like sand under the waves, fighting and clawing for the last little bit of land. Only a handful learned that the only way to survive was to make peace with the sea. And with the Gods. And that meant a Priesthood to learn what behavior angered Them, and keep each settlement in line. Because Gods never gave warnings. If we displeased Them, we died.\n“Used to be the land was as rich as the sea,” Kelb said, as we entered a wide snowless space, pointing out to the blasted ash-colored hills.\n“That’s what they say,” I said.\n“You don’t believe it?”\nI shrugged. “It’s one of those things where even if it’s true, there doesn’t seem to be much point in mooning over it.”\n“Still. It’s nice to think that once there was food other than fish and seaweed. You know they used to call this place New Jersey.”\nShushing his blasphemies got tiresome after a while, so I said nothing. But naming things implied ownership, conquest, and it made me shiver. He turned to take in the landscape, and for the first time I noticed the sealskin bag he carried on his back, so full it bulged.\n“What’s in there?” I asked.\n“You might have been born out here,” he said. “One of the land settlements.”\n“There’s no such thing.”\nThey say I was four when I came, the cauterization scars on my arm stumps still raw and weeping. I had no memory of my life before the village took me in, handed off from another people that met ours at sea, on the hunt—people with no fixed village, who traveled with the ice by canoe and slept in temporary homes. They hadn’t spoken what we speak, but they offered goods to reward the family who took me in. My father was good-hearted and hungry, and had taken in Schoon the same way. He said I wasn’t one of the people who had handed me off—the skin tone didn’t match—and I wondered for the millionth time who my people were, whether they were holier than we, what they did with my arms when they chopped them off, how strict and wise their Priesthood, whether my deep love for the Gods and my lack of thing-hunger came from them.\n“There’s a man,” Kelb said, yielding to the pressure of my resentful silence, “who lives out this way. He has something I want.”\n“What?”\nKelb kept walking.\n“How does he live?” I asked. “On land. What does he eat?”\n“People bring him food. They want what he has.”\n“Is it something forbidden?”\n“Let’s just say the Gods wouldn’t like it.”\nA net, a cage, a metal blade? Kelb saw my face, and laughed. “Wake up, little sister. There are plenty of people who think like me. Who think the Gods are just a bunch of dumb animals, and that if we ever want to have a shot at a real life for our people, we have to get over this fear of Them.”\nI shut my eyes and prayed. I prayed that the Gods would forgive his blasphemy, and I prayed that he was wrong. I knew not everyone shared my reverence, but could people seriously think they could act in opposition to the will of the Gods? That kind of craziness could anger Them enough to wipe us all out.\nI prayed for strength, too. Because somehow his blasphemy made him more beautiful, and echoed inside my head, seductively.\nI should have cared more, about who this man was we were visiting and what he had. But I didn’t. Because I didn’t ever want us to get there.\nWe passed buildings, bare wood against the earth. Some in shambles, some still standing.\n“Sorry you’re too big for me to carry on my shoulders,” he said, slowing down at my thousandth stumble.\n“Like you were so good at it,” I said. “You weren’t that much older than me.”\n“True, true. If Schoon had lived—”\nKelb didn’t finish the sentence. I didn’t ask. I could imagine dozens of ways it could have ended, some wonderful. As long as he left it unfinished I could hope it would have been one of the wonderful ones. I was almost startled to see that some small part of me really believed we could be together. That he wanted me the way I wanted him.\nEventually we reached a wide flat swath of ice. Black and clear of snow. The going here was easier, although I could see Kelb was uncomfortable. His head darted around like a minnow, watching for cracks and soft spots and sudden eruptions of divine vengeance from beneath.\nSunset surprised me. Had we really been walking so long? We left the ice, crossed sand. I whispered the twilight prayer and let the dark come upon me, enter me, take away my sight and return me to the primal union of all with all.\n“I can’t navigate without the sun,” Kelb said. “We need to stop and get some sleep.”\nWe found a cabin quickly enough, one of the empty and decrepit ones. The familiar freezing wind sliced through where a wall had been, but we had furs for warmth, and we were both exhausted.\nBut once we were laid out on the floor Kelb fell instantly asleep, and I found I could not follow. My mind swam dolphin-fast, circling truths I didn’t want to arrive at. What he was—what he really was, this boy I loved, this strange and twisted man. What I was—the kind of person who would steal the cymbal of Summoning, the kind of person that saw Kelb for who he was and wanted him anyway.\nCarrying that kind of hate inside, he would not last long. Nothing in his life could ever eclipse his anger at the Gods. Not love, not me, not ever. And still, I wanted him. Even though I knew he was doomed, knew he was out of balance with the world, still I hungered for him.\n“Kelb,” I whispered, wanting hands more than I had ever wanted them before. There was no end to the places I could have put them. People did so many things with their hands, to the people they desired. Instead I snuggled under his fur blanket, spooned my body in behind his. “Kelb,” I said again, lips against his ear. He turned, awake and alert and erect. My beautiful, damned boy. He did not need me. How could he know need, with hands like that? They moved up and down me, insatiably hungry. He was separate, savage, alone. And as my mouth gnawed desperately at his chest and stomach, arms and hands, I saw, for the first time, how my own hunger exceeded his.\nIn the morning he kissed my forehead, helped me dress. Kelb showed none of the shame and contempt that I knew men often had, after showing someone such a secret part of themselves . . . but he still avoided eye contact, and said little.\n“What’s up with that?” he said, tapping the cymbal strapped to my back. “Gonna summon your Gods to come make everything better? Gonna hold an impromptu solstice ceremony?”\n“Just felt like having it,” I said. “You never know. Doesn’t the sound of the cymbal cheer you up?”\n“Risky business,” he said, covering his goose pimpled torso with a shirt. “Get caught taking that out of the village and they’ll kick you out for sure. Maybe offer you up to Them for good measure.”\nI tried to think of something to say that would be remotely true and at least a little funny, but since I still didn’t know what my reasons were for bringing it I said nothing.\n“Must be nice,” he said, gruffly, but also tenderly, wincing as he shouldered his bag. “Not to ever have to carry things. Not to be burdened down.”\n“It is nice,” I said. He waited for the follow-up, where I complained about how hard it was, but I had no complaints. Having hands made you put your faith and love in what you could hold to yourself and whisper Mine. And I was different. Or that’s what I had been telling myself. Until last night. Until I saw how deep my own wanting went.\n“What’s in the bag?” I asked, mostly just to shake loose a train of thought that was taking me nowhere nice.\n“Trade goods,” he said. “He’s not going to just give me what I want.”\nBy the time we got to the cabin with smoke curling up from it, the sun was high above us. An old man sat outside, in a bright ridiculous purple plastic chair. The sea-scroungers sometimes came back to the village with that kind of plastic absurdity—long pink birds and green pigs and giant balls—but representations were forbidden and we’d shred them in the gear wheels and melt the flakes in a vat to make waterproof sheeting and crude work clothes.\n“Greetings, travelers,” he said.\n“Are you Zimm?”\n“I am,” he said, and stood, and bowed. “And you must be Kelb. The one who frowns all the time, and wears glass shards like an idiot, and wants to kill the Gods.”\nOf course it was all bluff and bluster, standard man-talk to make himself seem strong. But how could such ugliness be mistaken for strength? The Gods swept fat seals and whole schools of fish into the reach of our hunters; They kept us safe from storms and kept our Shore clear of toxic animals. Perhaps I was spoiled, having been spared the society of men.\nZimm asked “You come to trade?”\n“I do.”\nHe ushered us in. The cabin was packed with hundreds of boxes, different sizes and shapes and colors. At a table, he set a small metal cylinder. Then he stabbed at it with a queer sort of knife, until the top lay raggedly open. A sweet, funny smell filled the room.\n“Corn,” he said, tilting the top to show us. Small triangles, the brightest shade of yellow I had ever seen. Bright like the sun was supposed to be, behind the toxic forever-clouds.\n“Cans,” Kelb said, picking up a cylinder from the stack. “I’ve never seen them like this.”\nI marveled at it too. The rusted husks of cans were everywhere; I had never imagined them in any other state.\n“I’ve got a lot of things you’ve never seen before.”\nThe man made me nervous. He ate in front of us, right from the can. Gave me a spoonful; smiled lewdly as he slid it into my mouth; enjoyed the squirmy look on my face as I bit down on the bright yellow wrong-tasting triangles. They were crunchy like kelp polyps, but the sea-taste that made food food was missing.\n“Girl doesn’t have a name?” he asked.\nSomething protective flexed in Kelb. He tightened, the way a man in a canoe might when a meat-whale breached.\n“I’m Adze,” I said.\n“You two brother and sister?”\n“No,” Kelb said curtly, but said no more. He leaned slightly across the table, and his face was stormy and I loved him so much my body hurt. Zimm shrugged, and we kept eating.\nSquares of thin fabric hung on his walls, covered in lines and colors. Kelb saw it, and stood. “Is that . . . it?”\n“That’s it,” the man said. “What you heard about. Why you came.”\n“What’s it?” I asked.\n“Paper,” Kelb said, and stood. “Can I touch it?”\n“Touch away.”\n“That’s paper?” I asked.\nIt looked so flimsy, so harmless. I had imagined some drug or weapon, some magic tool of long-dead gods.\nWhat I knew about paper: that the old world had run on it, that it had helped men make the planet a living hell and finally destroy it. That people clung to it, even after everything. Carried pieces of it with them; wept over it, drew strength from it. With paper, somehow, men could make things even the Gods feared. And only the settlements whose Priesthoods banned paper altogether survived.\nBut this—this stuff could not have kept my nose warm. How could it harm a God, or destroy a planet?\n“So what are you looking for?” Zimm said. “Books? Photographs? Words? Pictures?”\n“I want something that will prove what I already know. That the Gods are nothing but animals. No different from anything else in the sea.”\n“You’re an idiot,” I whispered, but he was too focused on Zimm’s smiling nodding head.\nFrom one of his hundreds of boxes, the old man pulled a small square. When he set it down on the table, I saw that the square was made of many many pieces of paper, stacked together. “Something like this?” he said, and handed one piece to Kelb.\nThis was a smile I had never seen before. The smile I knew lurked somewhere inside of my scowling handsome friend. The one I dreamed that someday I would lure to the surface. A smile of pure and mighty happiness. I shivered inside, seeing it now. Maybe paper was magic. How else could something sit in a box for ages, yet emerge and make men feel things?\n“Is this what I think it is?”\nZimm nodded. “The Gods, as our prisoners.”\nKelb held it up for me. The square showed a God. But wrong, somehow. Flat and tiny, as though seen from far away. Captured. Caught inside this fearsome paper stuff.\n“Orca,” Zimm said, tracing his finger along four strange symbols in a corner. An old name for the Gods, one that made me quiver with the intimacy it implied. The hubris, to limit them to one word.\nIn the paper, a God leapt from water bluer than any sea or sky had ever been. It leapt through a giant circle, held by two humans. More humans surrounded it, seated in high chairs. They looked down on it. They smiled. They cheered. It belonged to them; their pet, like the seal pups we sometimes raised when the weather was good and the sea was bountiful.\n“No,” I said, sick to my stomach, turning away.\n“Get enough of these and it’ll be easy to get the whole village on your side,” Zimm told Kelb, handing him more. “I even got some that show Gods getting killed, cut up, tortured, you name it. Show these around and everybody will start sharpening their spears.”\nKelb turned from paper to paper. I shut my eyes, to hide from what his face was doing.\nEventually, abruptly, Zimm snatched the stack of papers back. Looked at Kelb, then at me. His eyes hurt like harpoons must hurt. “What have you got for it?”\nKelb said nothing. Looked at the floor. Looked at his hands. And in his silence, I knew. Finally. Why I was there. Why he had asked me.\n“I’ll give you all the pictures you want,” Zimm said. “For her.”\nHe didn’t flinch. The proposition didn’t shock him. It had been his plan all along.\n“Kelb,” I said, or tried to say, but fear had left my mouth waterless.\n“You could have corn every day,” Zimm said, reaching out to touch me. I kicked his leg, hard. He cried out in pain, then laughed. Not pleasantly. Took a step closer.\n“Stop,” Kelb said, and unbuckled his sack, dumped its contents on the table. Seal meat, cured and smoked. Dried fish. An unspeakable sum. More than Kelb could ever have stockpiled. Some of it had to be stolen. That much meat meant people would starve.\n“I get that much food for the spoonful of corn I fed her,” Zimm said. “Richer settlements to the North pay me plenty. I want her.”\nKelb counted out three cards. “That much food for these,” he said, his voice a child’s. “Or no deal.” He stood up straighter, made his face hard.\n“Fine,” Zimm said, making a great show of undisappointment. “Never was one for damaged goods anyway.”\nAnd then Kelb’s hand was on my shoulder, steering me towards the exit. “We’re leaving.”\nThe cold had never been so cold. My mouth hurt from the metal sweetness of the “corn,” and from how hard I fought to keep from screaming obscenities at Kelb. The Shore glittered, at the bottom of a steep hill to our right. Black dots circled. I wondered if the Gods could see us from there; know who we were and where we lived and what we had done. What was in Kelb’s heart.\n“What changed your mind?” I asked, starting down the hill. “You brought me to sell to him. Didn’t you?”\nKelb said nothing.\n“Was it the sex? Would you have handed me over if last night hadn’t happened?”\nI kept my head down and blundered forward, into bitter wind. We reached the flat expanse of ice after an hour or many of walking.\n“Adze,” he said.\n“No!” I called, stepping onto the ice.\n“Adze,” he said, and I ran. He followed, repeating my name with every breath. Finally I let him overtake me. His hands grasped my shoulders. His hands were so big, so strong. “I’m sorry,” he said. “Okay. I’m sorry. I never—I didn’t . . . ”\n“You’re a liar,” I said. I tried to wriggle free, but he would not let me. “You’re insane. I was stupid not to see it. I saw you how I wanted to see you. How I used to see you, when you were the only one who would be nice to Schoon and me, because we were orphans, we were damaged.”\nKelb pulled me tighter. He hugged me. He wept. He never wept when Schoon died. “I’m sorry,” he said, over and over, until it wasn’t about Zimm and his horrible paper or his plan to sell me anymore.\nIt would have been easy to kick him in the crotch or knees, incapacitate him, take the cards from his bag, chew them up and spit them out, flee back to the village. I told myself the reason I didn’t was because I couldn’t make it back alone, but I knew that was half the truth or less. The whole truth was that I still loved him, wanted him, couldn’t bear the hurt of him hating me. And the whole truth was that we were the same.\nThe sweet kind child-Kelb was real, but so was the savage monster. Kelb was both. A gentle boy who loved me fiercely, and a wicked murderer who would sell me into slavery. An idealist who loved humanity and wanted us to be free of backwards superstition . . . who didn’t care who died in the pursuit of his ideals.\nKelb was both, and so was I. A devout believer and a wicked sinner.\nWe were the same. We were animals who wished we were more than that.\nThe gods were just animals.\nI shook free of him. I shut my eyes. If he brought those cards back, he’d endanger everyone. “Go,” I said, knowing what needed to be done to save my village, and wanting desperately not to know. “I’ll catch up. I want some space.”\nHe nodded, kissed my forehead, went. I squatted, and sat. We were out where the ice was thinnest, a skin of blue-green above unthinkable depths. I prayed, but felt nothing. I waited until he had gone too far to come back and stop me. With my teeth I tore off my sealskin boots, unwrapped my footwrappings. My toes deftly opened my jacket, burrowed deep to unwrap my torso. I shimmied until the cymbal came loose. I lifted it, flipped it over so the smooth bottom was flush with the ice. So the ice would act as an amplifier.\nI lay on my back and rested my ankle on the cymbal. I lifted my leg and brought it down as hard as I could, striking the cymbal with a force no other human could match.\n“Adze!” Kelb cried, stopped short by the hollow ring, which wobbled in the air but would sound clear as singing through the water under the ice.\nI stood up. I lifted my leg to point accusingly in his direction. He ran towards me, towards land, but he was very far away from both.\nI thought about shouting I’m sorry, but what was the point? What did it matter what I was?\nA black shape passed beneath me, majestic and immense. I shut my eyes and kept my leg extended. I was not afraid. I was the bearer of the cymbal. They would trust me.\nA crack split the air. A sharp black head broke the ice between us, then dove. The God spiraled her body beneath the water, shoving her tail out of the water and bringing it down hard against the broken edges of the ice. Cracks fanned out.\n“Adze, please!” Kelb called. More loud cracks; the snouts of two more Gods shattering through the ice in front of me. I stood my ground, standing over my warm clothes, shivering.\nHe stopped running. He stared at me, close enough now that I could see the pain on his face. See the fear—and then, something worse than fear. Something he’d never felt before: belief. Final, fatal, too-late belief. What cruelty, I thought, that he should find his in in the moment that I lose mine.\nKelb sobbed, once, then turned and ran again.\nHe ran even though he knew it was folly, because it might buy him a few more minutes of life. A thousand times we had seen seals behave the same way, when the Gods separated them from their rookeries, trapped them out on the ice and then tipped the ice to spill them into their mouths.\nIn a matter of moments he stood on a massive separate sheet. Raw ocean roiled all around him. I counted twenty fins, circling.\nI expected Kelb to scream, kick, curse, fight. Die flailing at the Gods the way he had lived his whole life. But Kelb merely walked to the edge of the ice and knelt. His eyes shut. His lips moved. Praying or apologizing or promising. I wouldn’t let myself look away. I watched them slap the water with their tails, in great synchronized sweeps, one after the other, until the churning water destabilized the ice and Kelb spilled into the sea. One came up from beneath him, held him in its jaws almost delicately. Kelb did not fight. He turned to look at me one last time, his mouth a sideways squiggle, either smile or frown, before the matriarch grabbed hold of the upper half of him and pulled.\nSome villages believe that if a God drags you down, you become one of them. And maybe that’s true for them. But for us, when they pull us under, we die.\nThe way back to land was long, and riddled with broken ice. If they wanted to kill me I was going to die.\nI stood up, walked to the pink-frothing edge of the ice. I showed my puny armless self to the Gods. The matriarch rose and held position, exposing her entire gorgeous head. Blood still stained her teeth. If I had hands, I could have reached out and touched her.\nFor forty seconds, she stared at me. Her eyes pierced through to what I had somehow failed to see before this day. She was an animal, and so was I. She was not a God, and I had not been chosen for divine protection. I wasn’t better or purer or more full of faith than anyone else. I was a wicked, sinful creature, born out of balance and bound there, like all my accursed kind. Hungry even when full. Wanting, always. Defined by the wanting and damned by it. Inventing Gods to give meaning to our lives, and shape to our hungers, but they could not stop us from destroying everything, including ourselves, including them. My armlessness, my inability to ever hurt them, was the only reason to let me live.\nShe withdrew, then. Slid back through the ice. Cried out underwater to her brothers and sisters. I stood there, shivering and wet beneath a useless sun, and watched my Gods abandon me.\nOriginally published in Drowned Worlds, edited by Jonathan Strahan.\nSam J. Miller is a writer and a community organizer. His debut novel The Art of Starving (HarperTeen) was one of NPR's Best Books of 2017, and won the Andre Norton Award. His current novel, Blackfish City (Ecco Press; Orbit) is an Entertainment Weekly \"Must Read\" and was called \"an action-packed science fiction thriller\" and \"surprisingly heartwarming\" by the Washington Post. He's a graduate of the Clarion Science Fiction & Fantasy Writers Workshop, and a winner of the Shirley Jackson Award. He lives in New York City.", "source": "https://clarkesworldmagazine.com/miller_07_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Last Gods by Sam J. Miller"}