{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Brian Trent", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "tNgGjJpTVmAr6raWF30qG0+aO+o=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Eternal Lives on Hard-Drives?   Dominique’s beloved father died two weeks before his sixtieth birthday. The present she bought him is still wrapped, a collection of his favorite Dirty Harry movies on DVD. He would have loved to watch them again after so many years.  Driving home from the hospital where Dad took his final breaths, Dominique sighs and begins making calls to family and friends. There will be no funeral. No burial. No cremation. Rather, Dominique’s calls are to set up plans for her father’s return, as soon as the insurance claim is approved and his digitally stored consciousness can be downloaded into a cloned body.  Dominique’s mother confirms that the last time Dad got saved was two years ago. Which means when he returns, he’ll have no memory of the cruise they took together last summer. Mercifully, he also won’t remember who accidentally knocked a can of red paint all over his golf clubs last Christmas.  Two years of life will have to be retold. But he’ll have life again. And those Dirty Harry movies won’t stay wrapped up forever. Dad will get to watch them, thanks to a technology not terribly different from the way those very DVDs are able to be watched and re-watched for all time. The human brain is the most complex device in the universe. An elaborate network of roughly 100 billion neurons, it stores our thoughts, feelings, dreams, fears, lusts, quirks, and memories. The Egyptians were obsessed with immortality and took extreme measures to preserve the body from decay, even storing its organs in neat canopic jars. Yet the brain they threw away. Believing that the seat of consciousness was in the chest, they saw no purpose in preserving the skull’s most important resident. Ignobly, it was tossed out with the trash. A cerebral system of 100 billion neurons is an advanced network configuration, but it is still a finite system. When Clint Eastwood pulls his .357 magnum and asks a punk if he feels lucky, there is a finite information set making it possible for that scene to be stored and played. This information is compressed on disc. We need only pop it into a DVD player, and it’s ready for resurrection.  Why should the information within the human brain be so different? It might not fit onto yesterday’s floppy, but perhaps on tomorrow’s hard-drives.  It will probably happen, says Dr. Christoff Koch, professor of biology and engineering at the California Institute of Technology in Southern California. Koch spent four years as a post-doctoral fellow at the Artificial Intelligence Laboratory and at the Brain and Cognitive Sciences department at MIT. He is also a visiting Professor at the Institute for Neuroinformatics at the University of Zürich.  Speaking of mental downloads, Koch says, “It is conceivable. It depends on your theory of consciousness, and on your technological platform. If you think consciousness is primarily information, then it’s something that will eventually happen. If you have a more ethereal definition of consciousness then this wouldn’t apply.”  This technological platform is a daunting task for today’s computers, certainly. Yet in Lausanne, Switzerland scientists have just recently managed to simulate an entire neocortical column inside a computer. Call it a very real first step.  That step came out of Project Blue Brain, a joint initiative since 2005 pairing IBM and the Federale de Lausanne Ecole Polytechnique (EPFL) to craft a working digital model of brain function using IBMs powerful Blue Gene supercomputer.  Within a year, the project had created a functional model of the neocortical column which, according to the researchers’ website, “can reconstruct biologically accurate neurons based on detailed experimental data, and automatically connect them in a biological manner, a task that involves positioning around 30 million synapses in precise 3D locations.” 1 This virtual neocortical column contained 10,000 neurons.  The implications speak for themselves. With the immense strides in processing power each year, Project Blue Brain expects to eventually reverse engineer the entire human brain.  And why not? We’re already doing body-uploading courtesy of the Visible Human Project (VHP.)  In what sounds like something out of Tron, the VHP digitally records an entire human body as the physical copy is sliced up, section by section. The grand result is a corpse rendered in digital.  The VHP is a research project by The National Library of Medicine. It is the “creation of complete, anatomically detailed, three-dimensional representations of the normal male and female human bodies,” the project team states. Acquisition of transverse CT, MR and cryosection images of representative male and female cadavers has been completed. 2  Of course the brain is many orders of magnitude more complex than the body which houses it. Yet even here, this kind of virtual simulation has been done in a basic way by the researchers behind the Digital Brain Atlas. Hoping to aid neurosurgical training and technique, the stated objective of this atlas is “to visualize spatially complex structures.” 3  Science-fiction has dabbled in this area; from the ROM-encoded personalities in William Gibsons Neuromancer to the pattern buffer of Star Trek. Surely getting an appropriately powerful storage medium is just half the battle. What remains is how to capture neurological data to be stored in the first place. At the very least, a method of connecting your organic brain to a computer to facilitate data transmission is required.  Fortunately, we’re already there.  Cyborgs are no longer science-fiction. After becoming paralyzed from a stab wound to his neck, Matthew Nagle volunteered to become one.  Nagle was the first test-subject to have an aspirin-sized device called BrainGate implanted in his head. Developed by Cyberkinetics in conjunction with the Department of Neuroscience at Brown University, BrainGate takes neural commands that originate in the brain and converts them to computer commands.  These neural commands are “not so complicated that we can’t read out the little pulses of the brain,” says Dr. John Donoghue of Cyberkinetics. “It can be interpreted.”  Nagle was able to control an onscreen cursor by “thinking” it to move, and could also access email, change TV channels, and play basic video games with the power of thought itself. 4  The eventual application is to allow paralyzed people to move prosthetic limbs as effortlessly as the real thing. University of Pittsburgh researchers have already shown this is possible with monkeys, as a 2004 experiment demonstrated. By wiring the monkeys brain to a microchip, researchers were able to demonstrate that the monkey could operate a robotic arm through thought alone, and feed itself. 5  In the same way, science has given blind people the first real chance to see again. Available now are devices which can transmit light to the brains visual processing center, bypassing optic nerve damage. Presently this only works for people who once had vision, since their brains know how to process visual information. 6  The greater implication of this brain-computer linkage is seldom mentioned. If you can think commands into a microchip, then surely that information can be saved. Why not then think your entire brain onto a storage device? A flash-drive for the soul?  In transhumanist circles, Ray Kurzweil is a prophet from the future or a god from Olympus.  Kurzweil is a best-selling author, computer scientist, and inventor. He is also a fierce advocate for life-extension and nanotechnology, and he makes no efforts to play it subtle. In an interview with David Jay Brown, Kurzweil waxes digital about the future of humanity.  “Today we already have computers that are placed inside peoples brains, that replace diseased parts of the brain, like the neural implant for Parkinson’s disease. The latest generation of that implant allows you download new software to your neural implant from outside the patient—and that’s not an experiment, that’s an FDA approved therapy.” 7  Kurzweil’s vision of tomorrow is one in which uploadable consciousness is a way of life. Counting on the continued increase in computer processing speed, Kurzweil foresees this technology as around the proverbial corner within a few decades.  Dr. Koch, who has worked on Project Blue Brain, is more cautious.  “It could happen in our own lifetime,” Koch says. “Or it could be 100 or 200 years from now.”  Koch compares research in this area to astronomy.  “Every time astronomers examine the stars, they increase our knowledge of the universe. Every time we look at the brain, we see more detail.”  It is this massive amount of detail that presently eludes scientists. In the film The Sixth Day, the brain’s internal structures could be quickly photographed through an eye exam. In reality, it won’t be that simple.  However, scientists are getting better at it. In March of 2009 scientists at Wellcome Trust Center for Neuroimaging at University College London reported that they have developed a way of “seeing” a person’s thoughts. By looking at brain data, the researchers were able to read the part of the brain which deals with memory and navigation.8  Is a stored consciousness as good as the original?  The very question ties into another: What theoretical method for storing such incredible amounts of data would be used? The compression methods used for a Dirty Harry film are typically lossy. JPEG and MPEG are common examples. Put simply, similar blocks of data are bunched together, a great deal is tossed away, and the differences between data groupings are used to reconstruct the general appearance of the original. It’s approximation, not replication.  Even fractal compression operates on a variation of this principle. Data is herded together by its similarities. From a high altitude of observation, the average day in an average life becomes a predictable topography—we don’t generally live like Indiana Jones swinging through wildly different adventures but rather tend to run in usual grooves.  Nonetheless, doesn’t a closer analysis of such average days reveal distinctions?  Superficially, our daily patterns become predictable yet each day we do change, think, and grow in unique ways. The person we are at the beginning of a year is not the person who exists by the end. A lossy compression would dismiss these nuances in favor of a generic data topography.  Lossless data compression is different. Rather than creating an approximation of the subject, it preserves all information. A ZIP file is the popular example.  But is the most advanced ZIP file of a human brain actually a human brain? Is it you?  The philosopher John Locke once said if you can remember thinking about something, then you are the same person who did the thinking to begin with. So too does the famous Cartesian proof agree. “I still think,” our digital soul might say, “Therefore I still am.”  Even allowing for this, however, we must wrestle with some ugly implications mind-uploading brings to the forefront.  If the total contents of the brain can be dropped into a spreadsheet, all possible chess moves are revealed. A society with this power has ready-made blueprints for the ultimate ant farm. Creativity, individuality, and surprise become regulated modules. Artists and freethinkers are the people who download the best app.  Eventually even that distinction fades. Artists and freethinkers are the app. Human behavior fits into a future accountants chart, and the job title Editor takes on awful new significance.  In Stephen King’s short story “Word Processor of the Gods,” the titular device was able to delete or insert things into the real world. Now picture behavioral engineering done the same way with uploaded consciousness. It starts with rapists and murderers: a rehabilitation system reviews the digital profile, and edits or deletes certain behaviors. In time, profile edits extend into any other category marked “deviation.”  The end result? Free will’s last stand. Byron succumbs to binary.  Legal definitions would need revising, too. Does habeas corpus apply to someone without a corpus? Is it still protected by due process?  Better yet, does due process cover a thousand copies of yourself? If an exact copy commits murder, is the original recording responsible? And if you murder someone in digital, is it really murder or an act without consequence . . . comparable to blowing away a teammate in a game of Halo?  These queries barely scratch the surface. The invisible man in H.G. Wells’ novel wasn’t born psychotic; he voluntarily chose to become a sociopath after living in a world that held no constraints for him. In effect, his indiscernible body meant no body and no consequences. While he considered his state to be transcendence above his peers—a popular theme in science-fiction—he was instead divorced from humanity in more ways than one.  If any of these fears have merit, why risk it?  We might ask people like Dominique who have lost loved ones.  At the very least, mind-uploading would be a preservation against entropy and death (if it works). The uploaded mind would then wait, frozen like a fly in amber, until downloaded into a newly-repaired or cloned body. Or it could be accessed while still on computer; we can imagine a live person interacting in a virtual world with the consciousness of the recently deceased. Our fictional Dominique, for instance, might be able to converse with Dad through a type of Second Life program, where Dad’s consciousness waits until a corporal body is ready for reinsertion. Purgatory version 2.0.  Eventually, a kind of Library of Humanity is formed. The entire species is backed up. Had such a technology been available millennia ago, the minds of Plato, Archimedes, or da Vinci would be accessible to us as teachers today. So might Caligula or Hitler.  Yet the impetus to defy oblivion has been with us since our prehistory; one of the oldest stories ever told is the Epic of Gilgamesh about a man’s desperate quest for immortality. Mind-uploading suggests the great fulfillment of that dream.  Might we live to see a future where the phrase “have you been saved?” means something quite different from what it does today?  References:  2 - Visible Human Project www.nlm.nih.gov/research/visible/visible_human.html  6 - Bionic Eye Could Restore Sight  thefutureofthings.com/news/1152/new-bionic-eye-could-restore-sight.html 7 - Ray Kurzweil Interview by David Jay Brown www.kurzweilai.net/meme/frame.html?main=/articles/art0648.html?m%3D5  Brian Trent is a genre-spanning writer of both fiction and nonfiction. His work has appeared multiple times in Clarkesworld, Electric Velocipede, Strange Horizons, Atomjack, The Humanist (including a cover piece on human longevity research,) Boston Literary Magazine, The Copperfield Review, The Eclectic Muse, Bewildering Stories, Writer's Digest, and many others. He twice won Honorable Mention in the L. Ron Hubbard's Writers of the Future contest last year, and was a panelist at Yale's science-fiction symposium \"Literary Visions.\"", "text": "Non-Fiction\nEternal Lives on Hard-Drives?\nDominique’s beloved father died two weeks before his sixtieth birthday. The present she bought him is still wrapped, a collection of his favorite Dirty Harry movies on DVD. He would have loved to watch them again after so many years.\nDriving home from the hospital where Dad took his final breaths, Dominique sighs and begins making calls to family and friends. There will be no funeral. No burial. No cremation. Rather, Dominique’s calls are to set up plans for her father’s return, as soon as the insurance claim is approved and his digitally stored consciousness can be downloaded into a cloned body.\nDominique’s mother confirms that the last time Dad got saved was two years ago. Which means when he returns, he’ll have no memory of the cruise they took together last summer. Mercifully, he also won’t remember who accidentally knocked a can of red paint all over his golf clubs last Christmas.\nTwo years of life will have to be retold. But he’ll have life again. And those Dirty Harry movies won’t stay wrapped up forever. Dad will get to watch them, thanks to a technology not terribly different from the way those very DVDs are able to be watched and re-watched for all time.\nThe human brain is the most complex device in the universe. An elaborate network of roughly 100 billion neurons, it stores our thoughts, feelings, dreams, fears, lusts, quirks, and memories. The Egyptians were obsessed with immortality and took extreme measures to preserve the body from decay, even storing its organs in neat canopic jars. Yet the brain they threw away. Believing that the seat of consciousness was in the chest, they saw no purpose in preserving the skull’s most important resident. Ignobly, it was tossed out with the trash.\nA cerebral system of 100 billion neurons is an advanced network configuration, but it is still a finite system. When Clint Eastwood pulls his .357 magnum and asks a punk if he feels lucky, there is a finite information set making it possible for that scene to be stored and played. This information is compressed on disc. We need only pop it into a DVD player, and it’s ready for resurrection.\nWhy should the information within the human brain be so different? It might not fit onto yesterday’s floppy, but perhaps on tomorrow’s hard-drives.\nIt will probably happen, says Dr. Christoff Koch, professor of biology and engineering at the California Institute of Technology in Southern California. Koch spent four years as a post-doctoral fellow at the Artificial Intelligence Laboratory and at the Brain and Cognitive Sciences department at MIT. He is also a visiting Professor at the Institute for Neuroinformatics at the University of Zürich.\nSpeaking of mental downloads, Koch says, “It is conceivable. It depends on your theory of consciousness, and on your technological platform. If you think consciousness is primarily information, then it’s something that will eventually happen. If you have a more ethereal definition of consciousness then this wouldn’t apply.”\nThis technological platform is a daunting task for today’s computers, certainly. Yet in Lausanne, Switzerland scientists have just recently managed to simulate an entire neocortical column inside a computer. Call it a very real first step.\nThat step came out of Project Blue Brain, a joint initiative since 2005 pairing IBM and the Federale de Lausanne Ecole Polytechnique (EPFL) to craft a working digital model of brain function using IBMs powerful Blue Gene supercomputer.\nWithin a year, the project had created a functional model of the neocortical column which, according to the researchers’ website, “can reconstruct biologically accurate neurons based on detailed experimental data, and automatically connect them in a biological manner, a task that involves positioning around 30 million synapses in precise 3D locations.” 1 This virtual neocortical column contained 10,000 neurons.\nThe implications speak for themselves. With the immense strides in processing power each year, Project Blue Brain expects to eventually reverse engineer the entire human brain.\nAnd why not? We’re already doing body-uploading courtesy of the Visible Human Project (VHP.)\nIn what sounds like something out of Tron, the VHP digitally records an entire human body as the physical copy is sliced up, section by section. The grand result is a corpse rendered in digital.\nThe VHP is a research project by The National Library of Medicine. It is the “creation of complete, anatomically detailed, three-dimensional representations of the normal male and female human bodies,” the project team states. Acquisition of transverse CT, MR and cryosection images of representative male and female cadavers has been completed. 2\nOf course the brain is many orders of magnitude more complex than the body which houses it. Yet even here, this kind of virtual simulation has been done in a basic way by the researchers behind the Digital Brain Atlas. Hoping to aid neurosurgical training and technique, the stated objective of this atlas is “to visualize spatially complex structures.” 3\nScience-fiction has dabbled in this area; from the ROM-encoded personalities in William Gibsons Neuromancer to the pattern buffer of Star Trek. Surely getting an appropriately powerful storage medium is just half the battle. What remains is how to capture neurological data to be stored in the first place. At the very least, a method of connecting your organic brain to a computer to facilitate data transmission is required.\nFortunately, we’re already there.\nCyborgs are no longer science-fiction. After becoming paralyzed from a stab wound to his neck, Matthew Nagle volunteered to become one.\nNagle was the first test-subject to have an aspirin-sized device called BrainGate implanted in his head. Developed by Cyberkinetics in conjunction with the Department of Neuroscience at Brown University, BrainGate takes neural commands that originate in the brain and converts them to computer commands.\nThese neural commands are “not so complicated that we can’t read out the little pulses of the brain,” says Dr. John Donoghue of Cyberkinetics. “It can be interpreted.”\nNagle was able to control an onscreen cursor by “thinking” it to move, and could also access email, change TV channels, and play basic video games with the power of thought itself. 4\nThe eventual application is to allow paralyzed people to move prosthetic limbs as effortlessly as the real thing. University of Pittsburgh researchers have already shown this is possible with monkeys, as a 2004 experiment demonstrated. By wiring the monkeys brain to a microchip, researchers were able to demonstrate that the monkey could operate a robotic arm through thought alone, and feed itself. 5\nIn the same way, science has given blind people the first real chance to see again. Available now are devices which can transmit light to the brains visual processing center, bypassing optic nerve damage. Presently this only works for people who once had vision, since their brains know how to process visual information. 6\nThe greater implication of this brain-computer linkage is seldom mentioned. If you can think commands into a microchip, then surely that information can be saved. Why not then think your entire brain onto a storage device? A flash-drive for the soul?\nIn transhumanist circles, Ray Kurzweil is a prophet from the future or a god from Olympus.\nKurzweil is a best-selling author, computer scientist, and inventor. He is also a fierce advocate for life-extension and nanotechnology, and he makes no efforts to play it subtle. In an interview with David Jay Brown, Kurzweil waxes digital about the future of humanity.\n“Today we already have computers that are placed inside peoples brains, that replace diseased parts of the brain, like the neural implant for Parkinson’s disease. The latest generation of that implant allows you download new software to your neural implant from outside the patient—and that’s not an experiment, that’s an FDA approved therapy.” 7\nKurzweil’s vision of tomorrow is one in which uploadable consciousness is a way of life. Counting on the continued increase in computer processing speed, Kurzweil foresees this technology as around the proverbial corner within a few decades.\nDr. Koch, who has worked on Project Blue Brain, is more cautious.\n“It could happen in our own lifetime,” Koch says. “Or it could be 100 or 200 years from now.”\nKoch compares research in this area to astronomy.\n“Every time astronomers examine the stars, they increase our knowledge of the universe. Every time we look at the brain, we see more detail.”\nIt is this massive amount of detail that presently eludes scientists. In the film The Sixth Day, the brain’s internal structures could be quickly photographed through an eye exam. In reality, it won’t be that simple.\nHowever, scientists are getting better at it. In March of 2009 scientists at Wellcome Trust Center for Neuroimaging at University College London reported that they have developed a way of “seeing” a person’s thoughts. By looking at brain data, the researchers were able to read the part of the brain which deals with memory and navigation.8\nIs a stored consciousness as good as the original?\nThe very question ties into another: What theoretical method for storing such incredible amounts of data would be used? The compression methods used for a Dirty Harry film are typically lossy. JPEG and MPEG are common examples. Put simply, similar blocks of data are bunched together, a great deal is tossed away, and the differences between data groupings are used to reconstruct the general appearance of the original. It’s approximation, not replication.\nEven fractal compression operates on a variation of this principle. Data is herded together by its similarities. From a high altitude of observation, the average day in an average life becomes a predictable topography—we don’t generally live like Indiana Jones swinging through wildly different adventures but rather tend to run in usual grooves.\nNonetheless, doesn’t a closer analysis of such average days reveal distinctions?\nSuperficially, our daily patterns become predictable yet each day we do change, think, and grow in unique ways. The person we are at the beginning of a year is not the person who exists by the end. A lossy compression would dismiss these nuances in favor of a generic data topography.\nLossless data compression is different. Rather than creating an approximation of the subject, it preserves all information. A ZIP file is the popular example.\nBut is the most advanced ZIP file of a human brain actually a human brain? Is it you?\nThe philosopher John Locke once said if you can remember thinking about something, then you are the same person who did the thinking to begin with. So too does the famous Cartesian proof agree. “I still think,” our digital soul might say, “Therefore I still am.”\nEven allowing for this, however, we must wrestle with some ugly implications mind-uploading brings to the forefront.\nIf the total contents of the brain can be dropped into a spreadsheet, all possible chess moves are revealed. A society with this power has ready-made blueprints for the ultimate ant farm. Creativity, individuality, and surprise become regulated modules. Artists and freethinkers are the people who download the best app.\nEventually even that distinction fades. Artists and freethinkers are the app. Human behavior fits into a future accountants chart, and the job title Editor takes on awful new significance.\nIn Stephen King’s short story “Word Processor of the Gods,” the titular device was able to delete or insert things into the real world. Now picture behavioral engineering done the same way with uploaded consciousness. It starts with rapists and murderers: a rehabilitation system reviews the digital profile, and edits or deletes certain behaviors. In time, profile edits extend into any other category marked “deviation.”\nThe end result? Free will’s last stand. Byron succumbs to binary.\nLegal definitions would need revising, too. Does habeas corpus apply to someone without a corpus? Is it still protected by due process?\nBetter yet, does due process cover a thousand copies of yourself? If an exact copy commits murder, is the original recording responsible? And if you murder someone in digital, is it really murder or an act without consequence . . . comparable to blowing away a teammate in a game of Halo?\nThese queries barely scratch the surface. The invisible man in H.G. Wells’ novel wasn’t born psychotic; he voluntarily chose to become a sociopath after living in a world that held no constraints for him. In effect, his indiscernible body meant no body and no consequences. While he considered his state to be transcendence above his peers—a popular theme in science-fiction—he was instead divorced from humanity in more ways than one.\nIf any of these fears have merit, why risk it?\nWe might ask people like Dominique who have lost loved ones.\nAt the very least, mind-uploading would be a preservation against entropy and death (if it works). The uploaded mind would then wait, frozen like a fly in amber, until downloaded into a newly-repaired or cloned body. Or it could be accessed while still on computer; we can imagine a live person interacting in a virtual world with the consciousness of the recently deceased. Our fictional Dominique, for instance, might be able to converse with Dad through a type of Second Life program, where Dad’s consciousness waits until a corporal body is ready for reinsertion. Purgatory version 2.0.\nEventually, a kind of Library of Humanity is formed. The entire species is backed up. Had such a technology been available millennia ago, the minds of Plato, Archimedes, or da Vinci would be accessible to us as teachers today. So might Caligula or Hitler.\nYet the impetus to defy oblivion has been with us since our prehistory; one of the oldest stories ever told is the Epic of Gilgamesh about a man’s desperate quest for immortality. Mind-uploading suggests the great fulfillment of that dream.\nMight we live to see a future where the phrase “have you been saved?” means something quite different from what it does today?\nReferences:\n2 - Visible Human Project www.nlm.nih.gov/research/visible/visible_human.html\n6 - Bionic Eye Could Restore Sight\nthefutureofthings.com/news/1152/new-bionic-eye-could-restore-sight.html\n7 - Ray Kurzweil Interview by David Jay Brown www.kurzweilai.net/meme/frame.html?main=/articles/art0648.html?m%3D5\nBrian Trent is a genre-spanning writer of both fiction and nonfiction. His work has appeared multiple times in Clarkesworld, Electric Velocipede, Strange Horizons, Atomjack, The Humanist (including a cover piece on human longevity research,) Boston Literary Magazine, The Copperfield Review, The Eclectic Muse, Bewildering Stories, Writer's Digest, and many others. He twice won Honorable Mention in the L. Ron Hubbard's Writers of the Future contest last year, and was a panelist at Yale's science-fiction symposium \"Literary Visions.\"", "source": "https://clarkesworldmagazine.com/trent_08_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Eternal Lives on Hard-Drives? by Brian Trent"}