{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1160sckNDKdGwE9SSVBxR8pEAic=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Braided Together: A Conversation with Erin Hoffman  Erin Hoffman's first novel, The Sword of Fire and Sea, opens on an island. And the brief paragraph reveals most of what we need to know about the central character:   Though the coastal island of Siane's Eye was lush with whispering palms and tropical flowers too exotic for the names of men, the wind that swept ever outward from its alabaster monuments came chill as a lifetime of penance. It prickled Vidarian's skin, but he hardened himself to it; the Sisters would not see a Rulorat captain hiding his hands like a saltless boy.  Throughout The Sword of Fire and Sea, conflict prickles Vidarian's skin, but he hardens himself to it—he stands his ground, rises to the occasion, and exceeds even his own expectations. There is a confidence and surety to Hoffman's prose that suggests mid-career or late-career, but surely not debut novelist.  Hoffman has, indeed, been around for awhile, working primarily in the video game design industry. You may have heard of her referred to as EA Spouse, in reference to her game industry quality of life activism, or as \"the Upton Sinclair of the game industry\" as they've called her at The Escapist. You may have heard of her as a \"secret Enchanted Griffon,\" or recently as the author of Sword of Fire and Sea released this month by Pyr Books.  In short, Hoffman is a gamer, a designer, and a novelist... she is also a \"she,\" which is not uncommon in the world of speculative fiction, but surely is in a gaming industry that traditionally has been dominated by men.  From 2008 to last year, Hoffman was the Lead Designer at HumaNature Studios, a small, independent game studio that makes games and apps \"that are charming and playful, and that help people connect with each other in expressive and creative ways.\" HNS puts particular emphasis on developing games that appeal to women and to \"non-gamer types.\" She currently is a Lead Systems Designer at Zynga, whose primary audience is also female and non-traditional gamers.  A graduate of Rensselaer Polytechnic Institute with a major in Philosophy, Hoffman is known to say and write things that either make you grin or gnash your teeth. Here, she explains the name of her game design consulting business, Philomath Games:   Game development, like all disciplines, shares a general unifying philosophy. But what I found during my explorations in philosophy was that a love of knowledge — the philein sophia — can make a person shut down. If knowledge is your goal, if having it gives you superiority, there is a tendency to achieve that knowledge or level of expertise and then stop, rigorously defending the position that one strove so mightily to earn.  Philomathy, by contrast — the love of learning — never stops. There are no plateaus in learning, only a continuing process. This rather Buddhist idea is how I approach my career and my life, so it felt right to name my little one woman band after it.  For Hoffman, there is no stopping... Her career has been marked by a willingness to push and pull, to stretch, collaborate, and combine old ideas (and technologies) with new in even newer ways. She is very much the Designer at Play, but also a Designer on a Mission—a mission that in no small way involves having loads of fun doing what she loves. Her desire for better ways of creating better games and better lives in a rapidly changing world has lead her to step on some toes and to poke more than a few people in the eye. Not only does she love learning, she despises injustices and, dang it, does something about them when she sees them.  It's no wonder that her novel, Sword of Fire and Sea, tells the story of Vidarian and Ariadel who rise to the challenge of saving the world—and the magic in that world—before universes collide.  Hoffman has written a classic Epic Fantasy that reads like the Adventure Fantasy of yesteryear while seeming utterly new at the same time—fast-paced fantasy with depth and grandness, an immersive secondary world, broad sweep and high stakes. Ultimately, like good fiction of any genre, Sword of Fire and Sea is about making hard decisions that matter—to the individual, to his friends, to the world.  Hoffman has worked on such games as Kung Fu Panda World (Lead Designer), PuzzleSmash: Book of Secrets (Creative Director), and GoPets: Vacation Island (Lead Designer). She got her start in game design from 1999 to 2004 as an Assistant Game Designer, Races Assistant, and World Builder on Simutronics' DragonRealms. Her table-top credits include an unreleased RPG called Black9.  Over the last decade or so, Hoffman has become increasingly interested — obsessed with? — the nature of story and games and how the two realms \"braid together in ways [she] didn't expect.\"  Below, we talk at length about writing, breaking rules, playing in natively game-like worlds, motivating characters, and the complex interweaving of game and story.   What do you enjoy about designing games (of any sort)? And how does that enjoyment differ from playing them?  Wow. That's actually quite a difficult question. There is so much I enjoy. Half of it is that it's a big logic puzzle of sorts — you start with a problem (how do we create feeling X given constraints Y?), and iterate, and bake, and meditate until eventually, generally after great toil but sometimes in utter random serendipity, the exact right answer pops out of the ether. The other half is more purely expressive — what emotions should we create, and how do we pair those emotions with moments — of realization, of challenge, of insight, of triumph, of regret — all of which games are especially good at.  All this is quite different from playing games. I like playing games, very much — especially older \"feel\"-oriented games from mid-generation consoles like the Sega Genesis — but I'm at a point in my game designing career that I feel like I'm searching for something, that the design is so important that it's hard for me to turn off the creating/analyzing part of my brain when I play a game. I think that this is probably a phase, albeit a long one.  What do you enjoy about writing fiction?  Many things in many different dimensions. I like finishing things and inspecting them, polishing them. I like creating things. I feel like if I can perfect something on the page — the something is usually an idea in some form, an animated metaphor — it has a chance of lasting, of becoming itself in other media (music, screen, game). I like the alchemy of crafting emotional experiences. I really like when I get it right and I hear from a reader that they experienced this complex progression of puzzlement and revelation and wonder exactly as I was hoping they would. That's the best part.  Where does a novel usually start for you—image, plot, character, historical event, somewhere else altogether? And how do you develop the novel from there?  Stories seem to have two \"starts\" for me (I'll spare you a lengthy biographical ramble about the presence of dichotomies throughout my life). The first start is the emotional start, where a character (or a species) usually peeks up and goes \"Hello! Write me plz!\" I say, \"Well, that's nice,\" and put them in a cupboard. They don't get to come out again until I know what their story is, and why it is.  Once I know that, I start working on the plot, which involves a lot of time and a collection of terrifying dentistry tools. Also, frequently, animals, and long hikes in the woods. At some point it will all click together and I start fleshing out a detailed outline. I am one of those obsessive outliners. I very rarely start work on something until I know all the \"big moments\" in the book and the fine detail on at least the first third. Things change, of course, but almost never so drastically that my original outline would be unrecognizable. The actual writing process is when I jam in as many cool things as I can think of. Like the telepathic whales. The two halves of this come together when, as has happened a few times, characters I created for a specific purpose insist on coming back and being more important than they were supposed to be. They're uppity, characters are.  What makes for a compelling protagonist in general and a compelling Epic Fantasy hero in particular? How did you go about creating Vidarian and Ariadel?  It's funny, this question feels like something of a trap. There is probably no one right answer and yet there are dozens of wrong ones. (I'm imagining a dozen authors out there wagging their fingers at me as I answer this.) And I think that characters should be people (even if they are not human) and so it feels somewhat unfair to judge them as worthy or unworthy. But I think the callous answer is that a well-rendered protagonist is exactly who he or she needs to be, as dictated by his or her circumstances.  This may be less true for other forms of fiction, but I think it is true for Epic Fantasy. Forces in the world collide, and the protagonist is the one person who is more caught in the middle than anyone else. They may not be chosen by a conscious watchmaker, but they are 'chosen' by circumstance, by the laws of physics. And they have to deal with being chosen, and you paint in their background to make the how of their dealing as interesting and meaningful as possible. You lay down the bricks of their experiences to make their choices as difficult as possible. And then you lacquer it over to make it all look effortless.  What are some of the main things readers of Epic Fantasy are looking for? And how do you both meet and subvert those expectations in The Sword of Fire and Sea?  Well, here's the thing. I'm moving at heretically high speed in Sword, and in its follow-ons, Lance of Earth and Sky and Shield of Sea and Space. I showed my synopsis to a writing group once and they all told me I was absolutely insane, that the plot couldn't fit in one book. And I think in terms of many current expectations of Epic Fantasy they're probably right. But I'm really writing adventure fantasy, even though it is also epic, and my lodestars are the speed and engagement that books like Treasure Island had, and what Elmore Leonard says about writing (\"I leave out the parts people skip\"). That's what I'm trying to do here. And I'm so thrilled when a reader or reviewer responds to it. What I'd say, also, to the \"you can't do Epic Fantasy that way\" is that we used to! Before the (as my husband calls them) kitten crusher fantasies of Jordan (and like many thousands I loved the first four Wheel of Time books) there were tightly-paced epic adventure trilogies. Magic's Pawn, Dragonflight, and, as Lou Anders pointed out, Michael Moorcock's Eternal Champion books. I'm reaching back to that tradition and writing books for people who like to fly through pages and be enthralled by book two even if they haven't read book one. And for people who like to know where a book series ends, and that it ends.  What goes into the creation of a compelling antagonist?  Well-done antagonists are invariably more interesting than protagonists, or maybe that's my rule-breaker bias. But how you build the antagonist is at least as important as how you build the protagonist. Most readers will project themselves into the protagonist, and fill in what you leave out — but the antagonist has to be meticulously detailed and bulletproof.  The kind of antagonist you create really depends on the kind of story you're telling. Do they represent the establishment, or the insurrection? The good-intention-gone-astray, or the psychopath? The system, or the monster?  I think you can tell a lot about an author by their antagonists. One of the most important things that I know of from a creator standpoint is that, as an author, you must love your antagonist. It's easy to love a protagonist, even if they drive you crazy. It's harder to love the bad guy. But I think better fiction comes out when you do.  Come to think of it, what is Sword of Fire and Sea about, anyway?  Everything! A world in peril! A chaos goddess! Gryphons! True love! The price of magic! Truth, justice, and telepathic whales!  Okay, knowing that that may not be terribly helpful, and that even if the book was about everything you probably wouldn't believe me: I think the book is about breaking rules. And I don't mean that in the frivolous fifth grader sense. It's about how hard it is to break rules, how no one has all the answers (especially the people who tell you that they do), and how we have to go on making decisions and living our lives anyway. It's about fearlessness, and legacy, and being true to what you believe in. It's about making really hard choices when the world itself is against you.  (So, you see? It's about everything.)  Is there anything you wish you'd known before you took the plunge into writing The Sword of Fire and Sea?  Probably that the end of part two would be incredibly difficult. I think this is not uncommon, though different writers tend to have different troughs. I go through this awful period where I'm convinced it's all garbage and everyone will hate it and I'll lose everyone who loves me. It's completely irrational, of course. And I say it only because I'm pretty sure other people go through it too, and the urge to quit at that moment is at its most ferocious. But the only thing that really solves it is to keep going forward. What makes it hard — as my husband can attest to from watching me go through this story after story — is that because it's so deeply inside your head you're convinced that you're right, and that this kind of deep depressive voice is actually the clear-headed one. And even knowing that this happens, it still feels real every time, and it seems to happen every time. I have to fight my way through it word by word like chiseling through rock. Then I hit the beginning of the last-seven-chapters point and everything starts to fly. That part makes it worth it. It can't be said enough that it's very important to finish things.  In what ways is your recent novel Sword of Fire and Sea a game? Or, at least, like a game?  In many ways. The world actually began as a shared universe for an online email- and chat-based RPG. I had a dice system for rolling up new characters. This was when I was a teenager. For some reason that I still don't quite understand I had an urge to make my own world and write in it rather than joining one of the many fan writing groups (which were great and I did participate in some of those, too). Our writing group at its peak had about forty people in it playing all over the world. When I set about to become a Serious Writer I put all of it aside, only to return several years later and find that there was a lot in that world that I still cared about deeply. I did a massive update on it — set a story about 1,600 years in the future from where we had been writing, filled in a ton of things that had happened in the interim, changed around a bunch of world dynamics — and Sword was born. There are hints throughout of the \"older world\" for anyone who knows it and is looking carefully, and I think the \"new world\" is richer for them.  My favorite worlds have always been natively game-like. In their basic world rules you immediately want to interact with them. When you know that Anne McCaffrey's Pern has five types of colored dragons, you immediately want to match yourself to one. When you know that in Piers Anthony's Xanth every person has a unique magical talent, you want to pick out a talent for yourself. These rule structures are very game-like and enhance the poetry of a world. In addition to making it accessible, they give you a framework that exposes the theme and meaning in a world much more clearly than worlds that do not have these structures. Character classes are extremely powerful things.  Wait, can you expand on \"natively game-like\" some more?  Ah. In both of those worlds, their most fundamental world-rules (Xanth: talents; Pern: dragons) set in the reader's mind an expectation. The rules themselves act as foreshadowing. If you know that riders of gold queen dragons are powerful, you wonder what will happen when a \"nobody\" manages to bond with one. The premise of the first Xanth book is a protagonist who is ostensibly born without a talent. These stories play on inherent expectations you have when the world is described in the simplest possible way. Games do the same thing.  In a game world, you have a setting, and objects within it; you inspect the setting, develop an expectation about what will happen if you interact with it in a particular way; enact that interaction; and revise your expectations for your next interaction based on the result of your first interaction. James Paul Gee describes this as the way in which games tap a learning and mastery process that parallels the scientific method. The same basic things are at work in the infamous \"gun on the mantelpiece\" in storytelling.  [Note: Hoffman is referring to the following \"rule\" of storytelling: If there is a gun on the mantelpiece early in the story, it better go off by the end of the story. Conversely, if the gun goes off in end, it sure as heck better have been on the mantelpiece in the beginning.]  What are some of the game mechanics of Andovar? And how do those mechanics tell the story?  In the beginning (so as not to spoil), the core mechanic set has to do with elemental magic and its role in the world. We begin in a world where the major influencers and power-brokers are or were at one time elemental magic users. But this magic has greatly diminished over time, and so its practitioners turned to the elemental goddesses for more power, becoming priestesses. Magic has also become very compartmentalized; almost all humans at this point have an elemental lineage in their blood, and if they cross those elemental boundaries — if a fire woman has a child with a water man, for instance — the children run a high risk of a malady called blood plague, which can kill them all the way into their mid-twenties. This means that most political boundaries are now drawn along elemental lines. Gryphons, who hold even more ancient knowledge than the priestesses, interact only with the priestesshoods now and are unknown to the wider population. There is a gate between worlds, and this becomes important later in disrupting the balance of power in the world. The hero, Vidarian Rulorat, is the last survivor of his family, which controversially crossed those elemental boundaries in his great-grandparents' time. So that is the expectation set.  What new design techniques (or wisdom) did you bring to Andovar after all those years of designing video games?  Probably the most challenging thing was expanding the world in such a way as to take some of the very familiar mythological figures — gryphons, centaurs, dragons — and cast them in a way that connected with the world systems. Andovar has always been a sort of metaverse that bridges multiple worlds, so there is a 'logic' behind everything fantastical in it. Then there was the challenge of making these elements inclusive enough — creating a broad palette for people to play with in their minds while reading — and modern enough, in terms of the expectations we now have from the cross-pollination of all kinds of other media, and how we can connect with it so rapidly in the internet age.  And what can novels teach designers—and game-masters—about games?  Oh, lots. One big thing has to do with motivation. If you're reading a book and the main character doesn't have a deep and burning motivation — something they want more than anything else — the book often becomes flat and forgettable. The trick for a game-master is of course pulling this motivation out of the player's character. It's more complicated because this motivation can't just be imposed. But that driving focal point can keep a game on track. Similarly, villains are best constructed when their driving motivations are both plausible — even sympathetic — and directly oppose the motivations of the party.  When you have motivation, conflict (from within the party and without), and escalation, you have a spine for an adventure that can be continually engaging.  Does a novelist play games with or on a reader?  Good ones do. I'd even go so far as to say that most of the success of J. K. Rowling and Dan Brown both have to do with the games they play with the reader, setting you up to expect certain things, fulfilling some and reversing others. To ridiculously oversimplify those works. But in both, you keep reading because you want to find out what happens next — not because you have no idea, but because you have hypotheses.  But aren't novels more linear and games more... non-linear?  You know, I know we've always held the line on this linear-versus-non-linear thing when it comes to games, but games are still experienced linearly by the players. Because (most of us) experience time from this moment to the next, linearly, all of our expectations and indeed our internal physics and metaphysics are based on this view of reality. If a game doesn't make sense in the linear path the player experiences it through — even if there are many other possible paths — it's going to be unsatisfying. This is mainly why interactive fiction is so difficult; our expectation mechanisms remain the same, and we're essentially writing a dozen braided stories simultaneously.  How have social networks like Facebook changed the nature of on-line gaming and even table-top gaming?  I think the broader question that actually impacts our creative lives more deeply is how the interconnectedness and high-speed propagation of information — from the internet, now optimized by social networks, Twitter, etc. — has impacted the generation, spread, and success of all creative properties. It's pretty comprehensive. Creative properties have to be more \"meta\" than they've ever been before. Whereas previously you would have a video game audience, a SF book audience, a film geek audience, a heavy metal audience, you now have hybrid highly erudite audiences that love a cloud of things: Firefly, Paranoia, Lost, Portal, Pirates of the Caribbean. This creates an inherently different creative cocktail with sophisticated influences and expectations. As a creator it seems like you're under a lot more pressure to be aware of these things than you used to be. It also means that the work is becoming more complex. On the upside, it seems to mean that audiences are more welcoming and open-minded to new things than they used to be.  Generally, though, I think it's important not to look at the impact of a specific thing — like Facebook — on a genre, but to ask what the driving mass desire behind that thing is (greater instantaneous flow-like connection across a super-geographical space), and try to figure out new ways to use it.  For lack of a more subtle way to ask... Have things changed much over the last five years for women—heck, for men and women—in the gaming industry? And why aren't there more women designers, do you suppose?  I think they've changed quite a bit, both for women and many under-represented groups — cultural minorities across the board. Every once in awhile I'll look around at work or at a conference and realize with a sort of sinking feeling how far we have to go — but many gains have been made. When you see places like Google and Zynga developing \"it gets better\" videos, and the IGDA opening up a new diversity Special Interest Group, there is progress. And for women especially I think it's safe to say there have never been more female video game designers, and I think and hope there will be more in the future. We seem to be seeing more women in colleges interested in game design, and that's exciting.  As for why there are so few, I think it amounts to cultural momentum — because the small groups that started the media — board games, video games, pen and paper RPGs — were Caucasian men, they have been the cultural focal point. If an industry doesn't take specific action to be inclusive and grow diversity, it doesn't happen. Which is why seeing critical mass subcultures growing in the various genders and cultures is a very hopeful sign, because they will protect and advocate to more of their own peers. Now if we could cross more socio-economic boundaries, we'd really be going somewhere... I have this crazy idea about teaching game design classes in anti-recidivism programs...  How can a storyteller—whether a game designer, novelist or graphic novelist, or more and more often a storyteller who works in many media—take fuller advantage of the desire for \"greater instantaneous flow-like connection across a super-geographical space\"?  The full potential of it is complex, but the beginning of it is just to engage. We are fortunate to be witnessing the earliest growth of these networks, and so they are still foreign enough to most of the population that simple adoption and engagement is fairly rare. Properties that so much as step into the stream win great support with not much effort. It's important to recognize and adopt the etiquette — provide good content, do not spam, reciprocate, engage personally, follow back, etc. At this point being present — within the new culture, not treating it like another kind of magazine ad — is a good enough start to differentiate. And I think once you start to do this, ideas naturally emerge in how to use the medium itself in applicable ways. For RPGs there are countless possibilities, from making Facebook accounts for characters to building puzzles into twitter to running massively participatory democratic choose-your-own-adventure stories... All technology is a paintbrush...  So Andovar started as a chat-based multiverse and became the setting for a novel. Have you tried to do anything else with Andovar?  I'm in the process of doing a few different things with it. I would like to see ebook choice adventure stories (you click links to make \"decisions\" and navigate through a branching story) for it and am working on one. I'd like to put together an entry for one of the interactive fiction contests. And my end goal with all of these worlds is to bring new accessibility to text-based online RPGs and reinvigorate the text-based world. So — a lot.  The challenges are many. One of the biggest ones is just keeping track of how everything is used once it becomes participatory. I've been a part of enough worlds at this point that I'm keenly aware of the deep ways that players invest themselves into worlds that they play in, and it's a great and necessary challenge to make sure that that investment of self is rewarded and never abused. I've written about violations of that self in the online space (\"Someone Stole My Magic Sword\") — it's a very complicated challenge at scale.  Lastly, what do you see in the future for RPGs?  The next big sea change is really going to be augmented reality, though I'm not currently clear on how long that technology will take to really break mainstream. Once it does it is likely to do big and interesting things to RPGs, to the point that when it evens out we won't be able to think of RPGs in quite the same way. I am still waiting for greater adoption of the old top-down RPG (think early Final Fantasy, Phantasy Star) as an expressive art engine. There are a lot of these types of games on the Nintendo DS but their developers for some reason keep thinking they need to do weird things with the combat mechanics, to the point of breaking the bubble of the story. Left to my own devices I would have a heck of a good time just creating Phantasy Star style RPGs. I am also still waiting for a Nethack MMO.  What's next for you in terms of fiction writing?  The Chaos Knight, primarily! I started this thing, and now I've got to finish it. I like to think Vidarian and Ariadel deserve the right ending. I'm also working on a short story for the next Homeless Moon chapbook, and continuing to worldbuild and marinate on the outlines of another Andovar trilogy after Chaos Knight is done. Then there are other books and worlds that peck at my brain periodically. That there are so many worlds is part of why I'm obsessed with the idea of a multi-platform social network metaverse super-MUD. Which, at the moment, is also fiction.  Any parting words?  Thanks very much for inviting me! I'm sure I said any number of heretical things. Corrections or further engagement very welcome via my website (erinhoffman.com) or Andovar's Facebook page, where there are cute griffin giveaways. Sword of Fire and Sea is available on Amazon now! Readers have tremendous power over the fates of authors via their purchasing decisions. Like many who read Clarkesworld, I would just like to keep creating worlds...  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nBraided Together: A Conversation with Erin Hoffman\nErin Hoffman's first novel, The Sword of Fire and Sea, opens on an island. And the brief paragraph reveals most of what we need to know about the central character:\nThough the coastal island of Siane's Eye was lush with whispering palms and tropical flowers too exotic for the names of men, the wind that swept ever outward from its alabaster monuments came chill as a lifetime of penance. It prickled Vidarian's skin, but he hardened himself to it; the Sisters would not see a Rulorat captain hiding his hands like a saltless boy.\nThroughout The Sword of Fire and Sea, conflict prickles Vidarian's skin, but he hardens himself to it—he stands his ground, rises to the occasion, and exceeds even his own expectations. There is a confidence and surety to Hoffman's prose that suggests mid-career or late-career, but surely not debut novelist.\nHoffman has, indeed, been around for awhile, working primarily in the video game design industry. You may have heard of her referred to as EA Spouse, in reference to her game industry quality of life activism, or as \"the Upton Sinclair of the game industry\" as they've called her at The Escapist. You may have heard of her as a \"secret Enchanted Griffon,\" or recently as the author of Sword of Fire and Sea released this month by Pyr Books.\nIn short, Hoffman is a gamer, a designer, and a novelist... she is also a \"she,\" which is not uncommon in the world of speculative fiction, but surely is in a gaming industry that traditionally has been dominated by men.\nFrom 2008 to last year, Hoffman was the Lead Designer at HumaNature Studios, a small, independent game studio that makes games and apps \"that are charming and playful, and that help people connect with each other in expressive and creative ways.\" HNS puts particular emphasis on developing games that appeal to women and to \"non-gamer types.\" She currently is a Lead Systems Designer at Zynga, whose primary audience is also female and non-traditional gamers.\nA graduate of Rensselaer Polytechnic Institute with a major in Philosophy, Hoffman is known to say and write things that either make you grin or gnash your teeth. Here, she explains the name of her game design consulting business, Philomath Games:\nGame development, like all disciplines, shares a general unifying philosophy. But what I found during my explorations in philosophy was that a love of knowledge — the philein sophia — can make a person shut down. If knowledge is your goal, if having it gives you superiority, there is a tendency to achieve that knowledge or level of expertise and then stop, rigorously defending the position that one strove so mightily to earn.\nPhilomathy, by contrast — the love of learning — never stops. There are no plateaus in learning, only a continuing process. This rather Buddhist idea is how I approach my career and my life, so it felt right to name my little one woman band after it.\nFor Hoffman, there is no stopping... Her career has been marked by a willingness to push and pull, to stretch, collaborate, and combine old ideas (and technologies) with new in even newer ways. She is very much the Designer at Play, but also a Designer on a Mission—a mission that in no small way involves having loads of fun doing what she loves. Her desire for better ways of creating better games and better lives in a rapidly changing world has lead her to step on some toes and to poke more than a few people in the eye. Not only does she love learning, she despises injustices and, dang it, does something about them when she sees them.\nIt's no wonder that her novel, Sword of Fire and Sea, tells the story of Vidarian and Ariadel who rise to the challenge of saving the world—and the magic in that world—before universes collide.\nHoffman has written a classic Epic Fantasy that reads like the Adventure Fantasy of yesteryear while seeming utterly new at the same time—fast-paced fantasy with depth and grandness, an immersive secondary world, broad sweep and high stakes. Ultimately, like good fiction of any genre, Sword of Fire and Sea is about making hard decisions that matter—to the individual, to his friends, to the world.\nHoffman has worked on such games as Kung Fu Panda World (Lead Designer), PuzzleSmash: Book of Secrets (Creative Director), and GoPets: Vacation Island (Lead Designer). She got her start in game design from 1999 to 2004 as an Assistant Game Designer, Races Assistant, and World Builder on Simutronics' DragonRealms. Her table-top credits include an unreleased RPG called Black9.\nOver the last decade or so, Hoffman has become increasingly interested — obsessed with? — the nature of story and games and how the two realms \"braid together in ways [she] didn't expect.\"\nBelow, we talk at length about writing, breaking rules, playing in natively game-like worlds, motivating characters, and the complex interweaving of game and story.\nWhat do you enjoy about designing games (of any sort)? And how does that enjoyment differ from playing them?\nWow. That's actually quite a difficult question. There is so much I enjoy. Half of it is that it's a big logic puzzle of sorts — you start with a problem (how do we create feeling X given constraints Y?), and iterate, and bake, and meditate until eventually, generally after great toil but sometimes in utter random serendipity, the exact right answer pops out of the ether. The other half is more purely expressive — what emotions should we create, and how do we pair those emotions with moments — of realization, of challenge, of insight, of triumph, of regret — all of which games are especially good at.\nAll this is quite different from playing games. I like playing games, very much — especially older \"feel\"-oriented games from mid-generation consoles like the Sega Genesis — but I'm at a point in my game designing career that I feel like I'm searching for something, that the design is so important that it's hard for me to turn off the creating/analyzing part of my brain when I play a game. I think that this is probably a phase, albeit a long one.\nWhat do you enjoy about writing fiction?\nMany things in many different dimensions. I like finishing things and inspecting them, polishing them. I like creating things. I feel like if I can perfect something on the page — the something is usually an idea in some form, an animated metaphor — it has a chance of lasting, of becoming itself in other media (music, screen, game). I like the alchemy of crafting emotional experiences. I really like when I get it right and I hear from a reader that they experienced this complex progression of puzzlement and revelation and wonder exactly as I was hoping they would. That's the best part.\nWhere does a novel usually start for you—image, plot, character, historical event, somewhere else altogether? And how do you develop the novel from there?\nStories seem to have two \"starts\" for me (I'll spare you a lengthy biographical ramble about the presence of dichotomies throughout my life). The first start is the emotional start, where a character (or a species) usually peeks up and goes \"Hello! Write me plz!\" I say, \"Well, that's nice,\" and put them in a cupboard. They don't get to come out again until I know what their story is, and why it is.\nOnce I know that, I start working on the plot, which involves a lot of time and a collection of terrifying dentistry tools. Also, frequently, animals, and long hikes in the woods. At some point it will all click together and I start fleshing out a detailed outline. I am one of those obsessive outliners. I very rarely start work on something until I know all the \"big moments\" in the book and the fine detail on at least the first third. Things change, of course, but almost never so drastically that my original outline would be unrecognizable. The actual writing process is when I jam in as many cool things as I can think of. Like the telepathic whales. The two halves of this come together when, as has happened a few times, characters I created for a specific purpose insist on coming back and being more important than they were supposed to be. They're uppity, characters are.\nWhat makes for a compelling protagonist in general and a compelling Epic Fantasy hero in particular? How did you go about creating Vidarian and Ariadel?\nIt's funny, this question feels like something of a trap. There is probably no one right answer and yet there are dozens of wrong ones. (I'm imagining a dozen authors out there wagging their fingers at me as I answer this.) And I think that characters should be people (even if they are not human) and so it feels somewhat unfair to judge them as worthy or unworthy. But I think the callous answer is that a well-rendered protagonist is exactly who he or she needs to be, as dictated by his or her circumstances.\nThis may be less true for other forms of fiction, but I think it is true for Epic Fantasy. Forces in the world collide, and the protagonist is the one person who is more caught in the middle than anyone else. They may not be chosen by a conscious watchmaker, but they are 'chosen' by circumstance, by the laws of physics. And they have to deal with being chosen, and you paint in their background to make the how of their dealing as interesting and meaningful as possible. You lay down the bricks of their experiences to make their choices as difficult as possible. And then you lacquer it over to make it all look effortless.\nWhat are some of the main things readers of Epic Fantasy are looking for? And how do you both meet and subvert those expectations in The Sword of Fire and Sea?\nWell, here's the thing. I'm moving at heretically high speed in Sword, and in its follow-ons, Lance of Earth and Sky and Shield of Sea and Space. I showed my synopsis to a writing group once and they all told me I was absolutely insane, that the plot couldn't fit in one book. And I think in terms of many current expectations of Epic Fantasy they're probably right. But I'm really writing adventure fantasy, even though it is also epic, and my lodestars are the speed and engagement that books like Treasure Island had, and what Elmore Leonard says about writing (\"I leave out the parts people skip\"). That's what I'm trying to do here. And I'm so thrilled when a reader or reviewer responds to it. What I'd say, also, to the \"you can't do Epic Fantasy that way\" is that we used to! Before the (as my husband calls them) kitten crusher fantasies of Jordan (and like many thousands I loved the first four Wheel of Time books) there were tightly-paced epic adventure trilogies. Magic's Pawn, Dragonflight, and, as Lou Anders pointed out, Michael Moorcock's Eternal Champion books. I'm reaching back to that tradition and writing books for people who like to fly through pages and be enthralled by book two even if they haven't read book one. And for people who like to know where a book series ends, and that it ends.\nWhat goes into the creation of a compelling antagonist?\nWell-done antagonists are invariably more interesting than protagonists, or maybe that's my rule-breaker bias. But how you build the antagonist is at least as important as how you build the protagonist. Most readers will project themselves into the protagonist, and fill in what you leave out — but the antagonist has to be meticulously detailed and bulletproof.\nThe kind of antagonist you create really depends on the kind of story you're telling. Do they represent the establishment, or the insurrection? The good-intention-gone-astray, or the psychopath? The system, or the monster?\nI think you can tell a lot about an author by their antagonists. One of the most important things that I know of from a creator standpoint is that, as an author, you must love your antagonist. It's easy to love a protagonist, even if they drive you crazy. It's harder to love the bad guy. But I think better fiction comes out when you do.\nCome to think of it, what is Sword of Fire and Sea about, anyway?\nEverything! A world in peril! A chaos goddess! Gryphons! True love! The price of magic! Truth, justice, and telepathic whales!\nOkay, knowing that that may not be terribly helpful, and that even if the book was about everything you probably wouldn't believe me: I think the book is about breaking rules. And I don't mean that in the frivolous fifth grader sense. It's about how hard it is to break rules, how no one has all the answers (especially the people who tell you that they do), and how we have to go on making decisions and living our lives anyway. It's about fearlessness, and legacy, and being true to what you believe in. It's about making really hard choices when the world itself is against you.\n(So, you see? It's about everything.)\nIs there anything you wish you'd known before you took the plunge into writing The Sword of Fire and Sea?\nProbably that the end of part two would be incredibly difficult. I think this is not uncommon, though different writers tend to have different troughs. I go through this awful period where I'm convinced it's all garbage and everyone will hate it and I'll lose everyone who loves me. It's completely irrational, of course. And I say it only because I'm pretty sure other people go through it too, and the urge to quit at that moment is at its most ferocious. But the only thing that really solves it is to keep going forward. What makes it hard — as my husband can attest to from watching me go through this story after story — is that because it's so deeply inside your head you're convinced that you're right, and that this kind of deep depressive voice is actually the clear-headed one. And even knowing that this happens, it still feels real every time, and it seems to happen every time. I have to fight my way through it word by word like chiseling through rock. Then I hit the beginning of the last-seven-chapters point and everything starts to fly. That part makes it worth it. It can't be said enough that it's very important to finish things.\nIn what ways is your recent novel Sword of Fire and Sea a game? Or, at least, like a game?\nIn many ways. The world actually began as a shared universe for an online email- and chat-based RPG. I had a dice system for rolling up new characters. This was when I was a teenager. For some reason that I still don't quite understand I had an urge to make my own world and write in it rather than joining one of the many fan writing groups (which were great and I did participate in some of those, too). Our writing group at its peak had about forty people in it playing all over the world. When I set about to become a Serious Writer I put all of it aside, only to return several years later and find that there was a lot in that world that I still cared about deeply. I did a massive update on it — set a story about 1,600 years in the future from where we had been writing, filled in a ton of things that had happened in the interim, changed around a bunch of world dynamics — and Sword was born. There are hints throughout of the \"older world\" for anyone who knows it and is looking carefully, and I think the \"new world\" is richer for them.\nMy favorite worlds have always been natively game-like. In their basic world rules you immediately want to interact with them. When you know that Anne McCaffrey's Pern has five types of colored dragons, you immediately want to match yourself to one. When you know that in Piers Anthony's Xanth every person has a unique magical talent, you want to pick out a talent for yourself. These rule structures are very game-like and enhance the poetry of a world. In addition to making it accessible, they give you a framework that exposes the theme and meaning in a world much more clearly than worlds that do not have these structures. Character classes are extremely powerful things.\nWait, can you expand on \"natively game-like\" some more?\nAh. In both of those worlds, their most fundamental world-rules (Xanth: talents; Pern: dragons) set in the reader's mind an expectation. The rules themselves act as foreshadowing. If you know that riders of gold queen dragons are powerful, you wonder what will happen when a \"nobody\" manages to bond with one. The premise of the first Xanth book is a protagonist who is ostensibly born without a talent. These stories play on inherent expectations you have when the world is described in the simplest possible way. Games do the same thing.\nIn a game world, you have a setting, and objects within it; you inspect the setting, develop an expectation about what will happen if you interact with it in a particular way; enact that interaction; and revise your expectations for your next interaction based on the result of your first interaction. James Paul Gee describes this as the way in which games tap a learning and mastery process that parallels the scientific method. The same basic things are at work in the infamous \"gun on the mantelpiece\" in storytelling.\n[Note: Hoffman is referring to the following \"rule\" of storytelling: If there is a gun on the mantelpiece early in the story, it better go off by the end of the story. Conversely, if the gun goes off in end, it sure as heck better have been on the mantelpiece in the beginning.]\nWhat are some of the game mechanics of Andovar? And how do those mechanics tell the story?\nIn the beginning (so as not to spoil), the core mechanic set has to do with elemental magic and its role in the world. We begin in a world where the major influencers and power-brokers are or were at one time elemental magic users. But this magic has greatly diminished over time, and so its practitioners turned to the elemental goddesses for more power, becoming priestesses. Magic has also become very compartmentalized; almost all humans at this point have an elemental lineage in their blood, and if they cross those elemental boundaries — if a fire woman has a child with a water man, for instance — the children run a high risk of a malady called blood plague, which can kill them all the way into their mid-twenties. This means that most political boundaries are now drawn along elemental lines. Gryphons, who hold even more ancient knowledge than the priestesses, interact only with the priestesshoods now and are unknown to the wider population. There is a gate between worlds, and this becomes important later in disrupting the balance of power in the world. The hero, Vidarian Rulorat, is the last survivor of his family, which controversially crossed those elemental boundaries in his great-grandparents' time. So that is the expectation set.\nWhat new design techniques (or wisdom) did you bring to Andovar after all those years of designing video games?\nProbably the most challenging thing was expanding the world in such a way as to take some of the very familiar mythological figures — gryphons, centaurs, dragons — and cast them in a way that connected with the world systems. Andovar has always been a sort of metaverse that bridges multiple worlds, so there is a 'logic' behind everything fantastical in it. Then there was the challenge of making these elements inclusive enough — creating a broad palette for people to play with in their minds while reading — and modern enough, in terms of the expectations we now have from the cross-pollination of all kinds of other media, and how we can connect with it so rapidly in the internet age.\nAnd what can novels teach designers—and game-masters—about games?\nOh, lots. One big thing has to do with motivation. If you're reading a book and the main character doesn't have a deep and burning motivation — something they want more than anything else — the book often becomes flat and forgettable. The trick for a game-master is of course pulling this motivation out of the player's character. It's more complicated because this motivation can't just be imposed. But that driving focal point can keep a game on track. Similarly, villains are best constructed when their driving motivations are both plausible — even sympathetic — and directly oppose the motivations of the party.\nWhen you have motivation, conflict (from within the party and without), and escalation, you have a spine for an adventure that can be continually engaging.\nDoes a novelist play games with or on a reader?\nGood ones do. I'd even go so far as to say that most of the success of J. K. Rowling and Dan Brown both have to do with the games they play with the reader, setting you up to expect certain things, fulfilling some and reversing others. To ridiculously oversimplify those works. But in both, you keep reading because you want to find out what happens next — not because you have no idea, but because you have hypotheses.\nBut aren't novels more linear and games more... non-linear?\nYou know, I know we've always held the line on this linear-versus-non-linear thing when it comes to games, but games are still experienced linearly by the players. Because (most of us) experience time from this moment to the next, linearly, all of our expectations and indeed our internal physics and metaphysics are based on this view of reality. If a game doesn't make sense in the linear path the player experiences it through — even if there are many other possible paths — it's going to be unsatisfying. This is mainly why interactive fiction is so difficult; our expectation mechanisms remain the same, and we're essentially writing a dozen braided stories simultaneously.\nHow have social networks like Facebook changed the nature of on-line gaming and even table-top gaming?\nI think the broader question that actually impacts our creative lives more deeply is how the interconnectedness and high-speed propagation of information — from the internet, now optimized by social networks, Twitter, etc. — has impacted the generation, spread, and success of all creative properties. It's pretty comprehensive. Creative properties have to be more \"meta\" than they've ever been before. Whereas previously you would have a video game audience, a SF book audience, a film geek audience, a heavy metal audience, you now have hybrid highly erudite audiences that love a cloud of things: Firefly, Paranoia, Lost, Portal, Pirates of the Caribbean. This creates an inherently different creative cocktail with sophisticated influences and expectations. As a creator it seems like you're under a lot more pressure to be aware of these things than you used to be. It also means that the work is becoming more complex. On the upside, it seems to mean that audiences are more welcoming and open-minded to new things than they used to be.\nGenerally, though, I think it's important not to look at the impact of a specific thing — like Facebook — on a genre, but to ask what the driving mass desire behind that thing is (greater instantaneous flow-like connection across a super-geographical space), and try to figure out new ways to use it.\nFor lack of a more subtle way to ask... Have things changed much over the last five years for women—heck, for men and women—in the gaming industry? And why aren't there more women designers, do you suppose?\nI think they've changed quite a bit, both for women and many under-represented groups — cultural minorities across the board. Every once in awhile I'll look around at work or at a conference and realize with a sort of sinking feeling how far we have to go — but many gains have been made. When you see places like Google and Zynga developing \"it gets better\" videos, and the IGDA opening up a new diversity Special Interest Group, there is progress. And for women especially I think it's safe to say there have never been more female video game designers, and I think and hope there will be more in the future. We seem to be seeing more women in colleges interested in game design, and that's exciting.\nAs for why there are so few, I think it amounts to cultural momentum — because the small groups that started the media — board games, video games, pen and paper RPGs — were Caucasian men, they have been the cultural focal point. If an industry doesn't take specific action to be inclusive and grow diversity, it doesn't happen. Which is why seeing critical mass subcultures growing in the various genders and cultures is a very hopeful sign, because they will protect and advocate to more of their own peers. Now if we could cross more socio-economic boundaries, we'd really be going somewhere... I have this crazy idea about teaching game design classes in anti-recidivism programs...\nHow can a storyteller—whether a game designer, novelist or graphic novelist, or more and more often a storyteller who works in many media—take fuller advantage of the desire for \"greater instantaneous flow-like connection across a super-geographical space\"?\nThe full potential of it is complex, but the beginning of it is just to engage. We are fortunate to be witnessing the earliest growth of these networks, and so they are still foreign enough to most of the population that simple adoption and engagement is fairly rare. Properties that so much as step into the stream win great support with not much effort. It's important to recognize and adopt the etiquette — provide good content, do not spam, reciprocate, engage personally, follow back, etc. At this point being present — within the new culture, not treating it like another kind of magazine ad — is a good enough start to differentiate. And I think once you start to do this, ideas naturally emerge in how to use the medium itself in applicable ways. For RPGs there are countless possibilities, from making Facebook accounts for characters to building puzzles into twitter to running massively participatory democratic choose-your-own-adventure stories... All technology is a paintbrush...\nSo Andovar started as a chat-based multiverse and became the setting for a novel. Have you tried to do anything else with Andovar?\nI'm in the process of doing a few different things with it. I would like to see ebook choice adventure stories (you click links to make \"decisions\" and navigate through a branching story) for it and am working on one. I'd like to put together an entry for one of the interactive fiction contests. And my end goal with all of these worlds is to bring new accessibility to text-based online RPGs and reinvigorate the text-based world. So — a lot.\nThe challenges are many. One of the biggest ones is just keeping track of how everything is used once it becomes participatory. I've been a part of enough worlds at this point that I'm keenly aware of the deep ways that players invest themselves into worlds that they play in, and it's a great and necessary challenge to make sure that that investment of self is rewarded and never abused. I've written about violations of that self in the online space (\"Someone Stole My Magic Sword\") — it's a very complicated challenge at scale.\nLastly, what do you see in the future for RPGs?\nThe next big sea change is really going to be augmented reality, though I'm not currently clear on how long that technology will take to really break mainstream. Once it does it is likely to do big and interesting things to RPGs, to the point that when it evens out we won't be able to think of RPGs in quite the same way. I am still waiting for greater adoption of the old top-down RPG (think early Final Fantasy, Phantasy Star) as an expressive art engine. There are a lot of these types of games on the Nintendo DS but their developers for some reason keep thinking they need to do weird things with the combat mechanics, to the point of breaking the bubble of the story. Left to my own devices I would have a heck of a good time just creating Phantasy Star style RPGs. I am also still waiting for a Nethack MMO.\nWhat's next for you in terms of fiction writing?\nThe Chaos Knight, primarily! I started this thing, and now I've got to finish it. I like to think Vidarian and Ariadel deserve the right ending. I'm also working on a short story for the next Homeless Moon chapbook, and continuing to worldbuild and marinate on the outlines of another Andovar trilogy after Chaos Knight is done. Then there are other books and worlds that peck at my brain periodically. That there are so many worlds is part of why I'm obsessed with the idea of a multi-platform social network metaverse super-MUD. Which, at the moment, is also fiction.\nAny parting words?\nThanks very much for inviting me! I'm sure I said any number of heretical things. Corrections or further engagement very welcome via my website (erinhoffman.com) or Andovar's Facebook page, where there are cute griffin giveaways. Sword of Fire and Sea is available on Amazon now! Readers have tremendous power over the fates of authors via their purchasing decisions. Like many who read Clarkesworld, I would just like to keep creating worlds...\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/hoffman_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Braided Together: A Conversation with Erin Hoffman by Jeremy L. C. Jones"}