{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JVSTOqREnhShE6in8FUSKADZehg=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Behind the Scenes Tour  Last month, I provided the numbers behind Clarkesworld, but numbers alone don’t give you the whole story of what it takes to produce this magazine. As promised, this month I will not only reveal some of what goes on behind the scenes but who is responsible for each issue.  Original Fiction  As mentioned in my previous editorial, we receive seven to eight hundred short story submissions per month. The first pass through these stories is conducted by the ever amazing and patient slush readers, (Cynthia Bermudez, John Emery DeLong, Terra Lemay, Aimee Picchi) and me. I’m reading approximately 40-50% of those stories and the slush readers comment on the remainder. Stories are then rejected or moved onto the next round.  Sean Wallace and I handle the next round. A story doesn’t get published unless we both agree on it. While we have similar taste, I’m more likely to be the “no” vote. This process typically whittles the pile down to between two and five stories. Additionally, a few stories throughout the year are via invitation. This happened with much greater frequency during our first few years.  Once we’ve decided to purchase a story, I send out acceptance letters and contracts. The next stage involves editing the story (the amount of which varies wildly), layout, and initial proofreading.  Reprint Fiction  Since April, Gardner Dozois has been responsible for the selection of each month’s reprints. We have some basic guidelines for the age and length of the stories he can choose, but otherwise, the only other criteria he has is that the story isn’t currently available in another magazine or the author’s website. (I don’t like to step on the heels of other publications. I just don’t find it polite.) After we’ve verified that the stories meet our criteria, Gardner contacts the author and, if they are interested, contracts the story. The story, contract, author bio, and photo are then passed to me for layout and proofreading.  Non-Fiction  Kate Baker is our non-fiction editor. Each month, she receives a number of pitches or solicits opinion pieces from potential contributors. If the query sounds like a good fit for Clarkesworld, she’ll request a finished copy of the article and make a final decision. Additionally, Daniel Abraham completes a unique Another Word column every other month with the gaps filled by other invited industry professionals. Approved projects are then contracted and the editing process commences. When the lead article or Another Word opinion column is complete, Kate sends the completed works, contracts, bios, and photos to me for layout and proofreading. Together, Kate and I also work on fine-tuning my editorial each month.  Our interviews are usually handled by Jeremy L. C. Jones, typically in consultation with me and later edited by Kate.  Podcasts  In addition to her non-fiction responsibilities, Kate Baker narrates, hosts, and produces each episode of our podcast. Five times per month, she closes the door to her TARDIS recording booth and records for forty-five minutes to an hour depending on the length of the story. She spends another two or three hours on each file, editing out all the mistakes and spaces within the recording, adds some original music, and sends me a file to preview. I then add the finished product to our website and push into our distribution channels.  Art  Every month, I spend hours searching through a wide variety of online art sites and portfolios that artists have sent along. When I locate a suitable piece, I do a quick search to make sure it hasn’t been previously used as cover art and then contact the artist to see of the rights are available. Quite often rights are already reserved for a game or book, so this process can be quite time-consuming. If the rights are available and the artist interested, I’ll send them a contract and start mocking up the cover in InDesign.  Production  I’m responsible for the web, ebook, print, and subscription files for each issue. Most of the content received from authors and other contributors is delivered in Word format. I use a program called Dreamweaver to create the html files for the website and load them into our system.  From there, I have home-grown programs to convert the HTML and various indexes to the EPUB and Amazon subscription feed formats. (The final 5% of the work is done by hand.) The EPUB files are then converted to MOBI—for standalone Kindle ebooks—and RTF—for import into InDesign to make our print edition PDFs. The InDesign files are then restyled and converted to PDF for submission to the company that produces our iPad and Android apps.   Podcast episodes are added to our website as they become available. Links to individual podcast episodes are then manually dropped into the apps.  Finances  I’ve saved the boring part of the business for me. I manage the books, issue payments (via check or PayPal), and track the income from ebooks, subscriptions, print editions, donations, advertising, and anything else we come up with. And of course, there’s the taxes . . .  And that ends our tour. The gift shop is down the hall. Have a happy holiday season and an amazing new year!  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Behind the Scenes Tour\nLast month, I provided the numbers behind Clarkesworld, but numbers alone don’t give you the whole story of what it takes to produce this magazine. As promised, this month I will not only reveal some of what goes on behind the scenes but who is responsible for each issue.\nOriginal Fiction\nAs mentioned in my previous editorial, we receive seven to eight hundred short story submissions per month. The first pass through these stories is conducted by the ever amazing and patient slush readers, (Cynthia Bermudez, John Emery DeLong, Terra Lemay, Aimee Picchi) and me. I’m reading approximately 40-50% of those stories and the slush readers comment on the remainder. Stories are then rejected or moved onto the next round.\nSean Wallace and I handle the next round. A story doesn’t get published unless we both agree on it. While we have similar taste, I’m more likely to be the “no” vote. This process typically whittles the pile down to between two and five stories. Additionally, a few stories throughout the year are via invitation. This happened with much greater frequency during our first few years.\nOnce we’ve decided to purchase a story, I send out acceptance letters and contracts. The next stage involves editing the story (the amount of which varies wildly), layout, and initial proofreading.\nReprint Fiction\nSince April, Gardner Dozois has been responsible for the selection of each month’s reprints. We have some basic guidelines for the age and length of the stories he can choose, but otherwise, the only other criteria he has is that the story isn’t currently available in another magazine or the author’s website. (I don’t like to step on the heels of other publications. I just don’t find it polite.) After we’ve verified that the stories meet our criteria, Gardner contacts the author and, if they are interested, contracts the story. The story, contract, author bio, and photo are then passed to me for layout and proofreading.\nNon-Fiction\nKate Baker is our non-fiction editor. Each month, she receives a number of pitches or solicits opinion pieces from potential contributors. If the query sounds like a good fit for Clarkesworld, she’ll request a finished copy of the article and make a final decision. Additionally, Daniel Abraham completes a unique Another Word column every other month with the gaps filled by other invited industry professionals. Approved projects are then contracted and the editing process commences. When the lead article or Another Word opinion column is complete, Kate sends the completed works, contracts, bios, and photos to me for layout and proofreading. Together, Kate and I also work on fine-tuning my editorial each month.\nOur interviews are usually handled by Jeremy L. C. Jones, typically in consultation with me and later edited by Kate.\nPodcasts\nIn addition to her non-fiction responsibilities, Kate Baker narrates, hosts, and produces each episode of our podcast. Five times per month, she closes the door to her TARDIS recording booth and records for forty-five minutes to an hour depending on the length of the story. She spends another two or three hours on each file, editing out all the mistakes and spaces within the recording, adds some original music, and sends me a file to preview. I then add the finished product to our website and push into our distribution channels.\nArt\nEvery month, I spend hours searching through a wide variety of online art sites and portfolios that artists have sent along. When I locate a suitable piece, I do a quick search to make sure it hasn’t been previously used as cover art and then contact the artist to see of the rights are available. Quite often rights are already reserved for a game or book, so this process can be quite time-consuming. If the rights are available and the artist interested, I’ll send them a contract and start mocking up the cover in InDesign.\nProduction\nI’m responsible for the web, ebook, print, and subscription files for each issue. Most of the content received from authors and other contributors is delivered in Word format. I use a program called Dreamweaver to create the html files for the website and load them into our system.\nFrom there, I have home-grown programs to convert the HTML and various indexes to the EPUB and Amazon subscription feed formats. (The final 5% of the work is done by hand.) The EPUB files are then converted to MOBI—for standalone Kindle ebooks—and RTF—for import into InDesign to make our print edition PDFs. The InDesign files are then restyled and converted to PDF for submission to the company that produces our iPad and Android apps.\nPodcast episodes are added to our website as they become available. Links to individual podcast episodes are then manually dropped into the apps.\nFinances\nI’ve saved the boring part of the business for me. I manage the books, issue payments (via check or PayPal), and track the income from ebooks, subscriptions, print editions, donations, advertising, and anything else we come up with. And of course, there’s the taxes . . .\nAnd that ends our tour. The gift shop is down the hall. Have a happy holiday season and an amazing new year!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_12_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Behind the Scenes Tour by Neil Clarke"}