{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5eMrmXMtRpnmoJ7fIJ4HbSW203I=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Nanobots and Braincases: A Conversation with Tochi Onyebuchi  The future is always closer than we think: Star Trek’s communicators to smartphones; Aldous Huxley’s soma to Prozac; Ray Bradbury’s seashells to earbuds. Tochi Onyebuchi is a science fiction author with a head full of visions, from automated police response to brains used as media storage to mechs piloted by vengeful women. A master of dystopia, his visions encompass the fantastic as well as the all-too-possible.  Riot Baby is a powerful, compact novella about siblings Ella and Kev, one with growing powers, the other thrown in prison. They must negotiate their fragile relationship with each other as Ella grapples with how she should use her increasingly dangerous abilities. The narrative journey moves through a visionary America grounded in the realities of our time, delivering both effective social critique and good science fiction.  War Girls Onyii and Ify are young sisters caught in the Nigerian Civil War—in 2172. They scavenge and fight when they must, until they are separated in an attack. What follows is an action-driven but complex story about culture, conflict, and identity. It’s also a harrowing tale of survival and family in a postnuclear disaster world.  Born in Massachusetts and raised in Connecticut, Tochi Onyebuchi is a consummate New Englander and “proud member of the Toonami Generation.” He graduated from Yale University, New York University’s Tisch School of the Arts, Columbia Law School, and L’institut d’études politiques with a masters degree in Global Business Law. He lives in Connecticut, where he works in the tech industry. His fiction has appeared in Asimov’s Science Fiction, Lightspeed Magazine, Uncanny Magazine, Omenana, Obsidian Journal, and more. Novella “Dust to Dust” and short story “Screamers” both landed on the Locus Recommended Reading list. His debut novel, Beasts Made of Night, won the Ilube Nommo Award for Best Speculative Fiction Novel. War Girls (Razorbill, October 2019) is a 2019 Cybils Awards finalist. Riot Baby (Tor.com Publishing, Jan 2020) is featured on a host of “must-read” lists, including Book Riot’s and SyFy Wire’s.   Both Riot Baby and War Girls blend science fiction with anime motifs, while still pulling off narratives that comport serious gravitas. How do you strike that balance?  That’s a really good question. For me, it comes down to narrative logic. Dreams and nightmares, no matter how much their thermodynamic laws may differ from that of our lived reality, bear an internal logic, and it’s an internal logic I see in the speculative fiction I read and watch, so my aim (subconsciously, at least) has been to create a story with internal logic.  As a kid, I watched X-Men: The Animated Series, and in maybe the second or third episode, Magneto tries to break Beast out of a prison cell after Beast has been captured during a failed operation on a Sentinel facility. And Magneto’s hovering in the air, surrounded by a sphere of sparking electricity, and this hairy blue man is crouching on his haunches, and they have this whole discussion about separatism versus integration. Gundam Wing introduced me to the concepts of pacifism and total war. So, it never struck me as strange or absurd to have fantastical elements of a story as vehicles for dealing with serious issues. I mean, Gundam pilots average, like, fifteen years old! It all had a narrative logic that I grokked early on in life.  Much of my early diet as a storyteller was manga and anime. Akira by Katsuhiro Otomo and Blade of the Immortal by Hiroaki Samura. It never occurred to me that self-reattaching severed limbs and cities falling out of the sky couldn’t be vessels for human drama. There’s so much imagination there, and that has always been among the most important elements of story to me.  Can you talk a bit about the process of breaking into the publishing industry? What was it like, how did it happen; were there lows, and if so, how did you deal with them?  I’ll start by saying I am SO happy I’m not breaking in during the Age of Twitter. I was neurotic enough during my own analog era that I would’ve gone mad doing it now. I probably started trying to get published in the early 2000s or so. And back then, it seemed the model in the specfic world was 1) write short stories, 2) pub those stories in places like Abyss & Apex or Ideomancer or Asimov’s, 3) use your short stories to get the attention of an agent, 4) show that agent the novel you’ve had cooking this whole time.  That was the process I witnessed at that age and with what limited exposure I had, but I was very impatient. I wanted a book on a shelf. So, instead of learning how to write short fiction and developing material and creds there, I spent most of my time on novels, writing book after book after book, averaging a novel a year for probably a decade and a half. My thinking at the time was: instead of work on the novel that got rejected, let me just write a better novel.  Before websites like AgentQuery came along, I would peruse the Acknowledgements page of books I liked to see which agents got thanked. I would then look them up either online or in the annual Writer’s Market Guide to Literary Agents that I would save up every year to buy. (Them joints were like $26 a pop and I didn’t have that kind of money as a kid!) I’d research their submission guidelines, put together a query letter and synopsis, and mail them out with a self-addressed stamped envelope. I chuckle now at the fact that I was paying for my own rejections.  But while I was slogging through novel rejections, an idea for a short would occur to me and I’d dash it off and sub it. “Dust to Dust” started out as a short story in John Crowley’s Intermediate Fiction Writing class in college. I think I subbed it at a few places, then let it collect . . . well . . . dust. Then, years later, I saw some novella-length sub requests on a website that served as a compendium for short fiction markets. So, I decided to expand the story, in part because I’d run out of short fiction markets to sub it to.  Did a ton of research on the Cold War in Eastern Europe, and I workshopped the novella in pieces through the Online Writing Workshop for Science Fiction, Fantasy, and Horror (I’d been a member since middle school when it was sponsored by Del Rey and I was basically writing poorly-disguised Robert Jordan and Hiroaki Samura fan fic). Subbed it to a few places, and struck gold with the editor of the Panverse anthology series. Dario requested a round of edits and I happily obliged (the story was much stronger for it), and that was my first specfic sale. Before that, I’d sold a spy story to Crimespree Magazine (good luck finding it) and payment was two contributor copies that I never received.  “Zen,” I wrote to procrastinate for my Constitutional Law final, then sat on it for a while before subbing, and I couldn’t believe it actually sold. It felt like an anomaly.  “Place of Worship” was a sort of redo of an earlier short story that I couldn’t sell, and I wrote it more as an exorcism than anything else. I’d been going through some personal trials and tribulations in film school and going into law school, and writing that story served as catharsis. It seemed too literary for most specfic markets, and its novelette length seemed to make an even more difficult sell. But I shot my shot with Asimov’s, in part because they’d made things much easier with the move to online submissions, and, by God, Sheila said yes. That was the biggest check I’d received for my writing at that point and I nearly broke down in tears in the law school student service lobby.  The first draft of “Screamers” was written in 2010. It sold in 2016.  I started trying to get my stories published in maybe 2003 or so, and by 2014, I’d sold four stories, been paid money for three. And all this time, I’m picking up novel rejections. I’m easily past one hundred at this point (One book picked up nineteen rejections, another eighteen, another twenty-six, another picked up fifty-eight, and on and on).  Beasts Made of Night came about as a result of a chance meeting with Tiff Liao, who would later become my editor on the project. She was a law school classmate’s college roommate and we met at a party my first semester of law school and began our friendship. This was in 2012. In 2015, after graduating from law school, I was struggling to sell Goliath, which I’d written that spring, and she offered to take a look at it. We chatted and Goliath didn’t sell but she opened the door to YA for me, and I started writing Beasts Made of Night and the rest, as they say, is history.  There was never a time when I said to myself I’d hang up my cleats, but I did tell myself that if I didn’t sell a book by a certain age, I’d at least slow down a little. I’d been writing like my life depended on it, but as the realities of a legal career began to solidify around me, I told myself that I’d start to prioritize that and background the writing a bit, but there was never any thought given to pressing pause or, Heaven forbid, “stop” on my ambition to be published. I loved writing too much. Loved writing for writing’s sake. It was my favorite thing in the world, and still is. I couldn’t dream of a life where I didn’t have that. And that’s what kept me going through all the rejections, that and the fact that while I was querying, I was already working on the next, better thing. And I was always in love with what I was writing, even if none of the decision makers were yet.  Does SF/F do something or work in some way that is different than non-genre fiction? Or are the definitions arbitrary and meaningless?  I get that there’s a marketing impetus behind genre definitions. People need to know where in the bookstore to put all the books. Problems abound, however, when those distinctions become imbued with moral or intellectual judgments or when taxonomy becomes hierarchy. Personally, I appreciate the distinctions, in part because genres tend to operate with their own internal logic. Thrillers and detective fiction have their tropes and the subversion of those tropes works most powerfully when there’s an awareness of the tropes to begin with. Romance novels offer very specific contractual terms to a reader. Science fiction and fantasy novels are constantly in conversation with each other, in a much more concentrated fashion than what’s found in what we call literary fiction. It isn’t so much that classification is useless (I think it’s helpful to know exactly what is meant by “magical realism,” for instance), so much as I think the imbuing of any qualitative judgment on the basis of that classification is repugnant and meaningless. Mystic River the movie won Oscars, but Mystic River the book would’ve been laughed out of any Pulitzer conversation, which is a crying shame, because that is a beautiful fucking book.  SF/F is powerful, for me, because it operates as reality and metaphor at the same time. All our stories are about us. Stories about androids and aliens are stories about us. Stories about time travel and Terminators are stories about us. You can use SF/F to make a point, a warning, a premonition and Trojan horse it with lasers or underwater cities or what have you. You can also have fun. That’s a thing I have to keep reminding myself with SF/F, is that it enables what few other genres offer, which is what I saw Elizabeth Bear once call sensawunda. We even got our own word for it.  I don’t think sense of wonder should always come with the adjectival “childlike” before it. At all ages, we need and deserve it. And SF/F is the only genre I know that has a definitional mandate to provide it. I have yet to read the work of literary fiction or crime fiction or romance fiction that’s shown me what it’s like when a city falls from the sky.  Do you feel like genre is seeing significant changes in attitudes toward publishing POC and, in particular, African voices/works?  It feels particularly fortuitous to be asked this question days after Orbit Books acquired a magnificent trilogy inspired by ancient West African empires from Suyi Davies Okungbowa. Dr. Nnedi Okorafor has been in the trenches fighting battles for those of us who’ve come after for a long, long time now, and it fills me with such joy to see her getting the roses she’s getting now. And in the diaspora, you have Nisi Shawl’s Everfair (2016). On top of that, Tade Thompson wins the Arthur C. Clarke Award for Rosewater and Marlon James lands on the National Book Award shortlist for Black Leopard, Red Wolf, so it’s definitely an interesting and exciting time for stories of/by Africans.  Whether diasporic or continental, authors are reaching a prominence we haven’t seen before, which is particularly heartening. And this isn’t even to mention the monster success that was Tomi Adeyemi’s Children of Blood and Bone, that being an excellent example of what it looks like when a publishing house actually puts its money behind a title and actively works to see it succeed. The Black Panther movie certainly served to convince decision makers and those holding purse strings that stories connected to the African continent could prove profitable, that there’s a market for them. Also, too, we can’t forget the work that Nalo Hopkinson and Tobias Buckell have been doing, Hopkinson for more than two decades.  But there is a ton of complication in the above part of my answer. Because the majority of the authors I just named are diaspora, whether based in the US, the UK, or the Caribbean. The vast majority of speculative fiction by continental Africans still hasn’t made it to the US, not because it doesn’t exist, but because of structural barriers domestically and a veritable lack of interest in stories from them on the part of USians. Penguin Random House has a South Africa branch, but they don’t accept science fiction submissions. And what other Big 5 house has a presence on the continent?  On the other side of the Atlantic, Cassava Republic (Nigeria) has an office in the UK but, to my knowledge, hasn’t been able to set one up in the US. NB Publishers is largely limited to South Africa’s book market as far as I can tell. So, if a continental African author like Helon Habila or Jennifer Makumbi wants a Western readership, they have to go through New York, London, or Paris. Now this opens out onto a larger discussion about whether to make more space for continental African writers in Western literary spaces or whether to contribute to the building of a more robust and versatile and adaptive publishing apparatus on a continent that houses about 1.3 billion people and about 3,000 ethnic groups speaking 2,100 different languages.  I will say that, as far as genre spaces in the US, what I’ve noticed shares a bit of DNA with silkpunk and much East Asian-inspired specfic, is that it has rushed into a long-gestating hunger for non-Western fantasy and science fiction. Which is so refreshing after techno-orientalist fare like Blade Runner and Firefly and, arguably, Star Wars. As much as publishing likes to lose money, I do hope they recognize the opportunity presented by continuing and expanding opportunities for writers of non-Western backgrounds to tell stories inspired and influenced by those backgrounds.  Is it important for fiction to discuss social issues—is it a necessary part of fiction? Or is it possible to write stories that are just “fun” stories, without a social or political stance?  I think it’s a thing that happens whether the author intends it to or not. No work of fiction is apolitical. Strip a first-person shooter of any markers of religion or nationality and you’ll still have an interactive experience that tells you repeatedly that the only way to solve this puzzle is to shoot at it. Social issues may not be explicitly discussed in a particular work or alluded to, but voice is as much about what you leave out as it is about what you leave in.  However unconscious your decision, if there are no queer people included in the future you’ve imagined, that is a statement. If the only people who can be heroes and major antagonists in your stories are descended from familial lines, that too is a statement. There’s no escaping it, because there is no escaping the reader who will read that in your story. So, you might as well be intentional in setting up the terms of the discussion.  There’s the perception (largely from doom-mongers) that stories that make statements can’t also be fun. It’s either tentpole action flicks or ponderous Oscar-bait. But, as being a Millennial has taught me, we can multitask. As a writer, I write the stories I want to read. Also, my existence is a politicized fact in America. Being a Black man has a say in my experience at school(s), on the street, on Twitter; it flavors my interactions with classmates (especially being on scholarship), literature, police, the ballot box, everywhere. And it’s always cool when a story can meet me there. Also, too, a lot of this boils down to the reader. You can choose not to engage in the anti-war messaging of The Lord of the Rings or the gender politics of The Wheel of Time or ideas of genetic determinism in Star Wars. That doesn’t mean that those who do are less right or correct or valid than you. For the most part, there is no score being kept regarding our reading experiences.  Discussion of social issues doesn’t need a work’s permission to happen. It is out of the author’s hands at that point.  There’s nothing Hajime Isayama or Yasuko Kobayashi can do to prevent an anti-Semitic reading of the second half of season three of Attack on Titan. Doesn’t mean that’s the only reading, and it doesn’t mean that the reverse reading, a reading that sees in that very same story a condemnation of Nazism, is any less valid.  You have an MFA in screenwriting from Tisch. What was your “learning to write” process? Did you simply adapt what you learned in screenwriting to the novel form? Did you take more classes, workshops, do critique circles? Was Tisch a good environment for speculative works?  It was largely emulation. When I was in high school, I think, I bought this book whose title was, I think, How to Write a Damn Good Novel, and it picked specific books and gave a pretty cosmetic analysis as to why they were good and what they did right. Among those books were The Godfather by Mario Puzo and John le Carré’s The Spy Who Came in from the Cold. I remember nothing from that book, but the books it chose as examples were highly instructive. So I learned how most painters do, by emulation. I saw what I liked and I tried to emulate that in my own fiction. I studied the craft through its products, reading and reading and reading, but I wouldn’t really learn story structure or any of its building blocks (at least, in the Western tradition) until film school. Before then, I had no idea what a three-act structure was or how central it was to the Western storytelling tradition.  Film school taught me stories’ building blocks re structure of the larger work but also within scene. Film school is why I’m always hunting for the conflict in a scene and it has helped me more easily discover who in my story is meant to be the protagonist. I started asking questions like “who has the most to lose in this situation” and “how do these characters’ desires and purposes collide in this scene” and “where is the friction here.” Learning how to write plays taught me scene breakdowns and how to play with rhythms, and I then applied all of that to my prose (though I still write stage plays and screenplays). Most of the speculative I wrote during that period was on my own time, not because of any restrictions in the program, but because I also wanted to use that period to stretch my wings genre-wise. In my last semester, I ended up writing a Civil War-era Western, a family drama, and a crime thriller about a Kosovar Albanian arms dealer, all feature-length screenplays. So many things I learned during the course of that semester made their way into my fiction, in ways both explicit and implicit.  Are there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?  My Act III’s are HORRIBLE! At least, during the first draft, they’re always too short and, though I know the very, very last part or line, I’m always stumbling toward the finish line.  For me, your characters are stunning. How do you write interesting, compelling characters that feel grounded in the real world?  Thank you! I try to choose who I think is, situationally, the most interesting character. Who has the most to lose or who’s at the bottom of the pile, so to speak? One reason I’m less interested these days in stories that foreground white characters is that in white stories there is categorically less conflict and drama than in a story with a nonwhite protagonist or with non-white characters. In True Detective’s third season, Mahershala Ali’s character was originally white. He auditioned for the part nonetheless and lobbied for the character to be changed, and that change made for a much more interesting show because now, during the course of the investigation that runs through the season, there are all these little interactions and gestures and expressions of a dynamic that wouldn’t have been there if his character were white.  One moment when Ali and Stephen Dorff’s character go to interview a disappeared child’s father, the father instinctively turns to Dorff’s character, believing he’s the lead, and there’s a moment when he realizes Ali’s character is running point on the investigation, and that is such a small, powerful moment. The show isn’t a story about race per se, but it’s always there, an added level of drama that allows for particular moments of high tension. Story-wise, it’s magnificent. Imagine if Buffy were a hetero cis white male. So many of the inter-relational dynamics of the show would have been rendered less compelling.  So, there’s situational thinking to my choices, but I also want characters who struggle internally and who enter the story with that struggle. Taj is the best at what he does, but that thing is literally what will kill him, and being good at it exacts a physical and spiritual tax on him. Onyii loves Ify more than anything in the world and knows some measure of peace with her, but she self-identifies as a proficient killer. Also, she’s, for all intents and purposes, a child. So not only are these characters spinning against the way the world turns, they’re spinning against the way they turn. That friction makes for compelling characters. Keeping them firmly planted in their worlds is a result of me constantly chasing that conflict and drama in my stories.  You have also commented that the forthcoming Goliath, a book you wrote before Beasts Made of Night, was the first book you wrote with a Black protagonist. Does this mean there are other unpublished books and stories you wrote that do not have a Black protagonist? More importantly, what happened or changed that made you start writing with Nigerian viewpoints and Black protagonists?  Everything I wrote before Goliath featured a white protagonist. It’s simply what I was reading. One book has, for its hero, a tortured former Mossad agent, and that stemmed from my much-abated obsession with Daniel Silva’s Gabriel Allon novels. (The virulent Islamophobia that started to appear turned me off greatly.)  Goliath was actually the outgrowth of a short story I wrote in 2013, “Still Life with Hammers, a Broom, & a Brick Stacker” that was published in Obsidian: Literature & Arts in the African Diaspora in 2016. I was living in Palestine at the time, working with a prisoners’ rights organization, and I found myself in the midst of an imagined short story collection, of which I’d envisioned “Place of Worship” and “Zen and the Art of an Android Beatdown” to be a part. All the stories would feature characters on a single space colony, and the stories would be intertwined through the use of recurring characters. A mosaic novel. I thought, why not have a story about the people left behind on Earth, playing with the idea that all the people in space are generally white. So I wrote “Still Life” . . . and couldn’t sell it anywhere.  I sat on it and, a few years later, thought I could build the world out a bit and expand the story. I thought to write a sort of slim, amorphous book reminiscent of Tinkers by Paul Harding where every sentence would hold its own crystallized beauty. It was going to be a literary novel with a speculative premise (back then, I still held those demarcations in mind!), and it came out at a cool 57k words, WAY too short for the speculative market but just right, I figured, for a literary novel. I got my longest, wordiest rejections for that book, which meant I was making progress. Small press publishers were asking if I had anything else; that sort of thing. Goliath was the best thing I had written and it was the first story I wrote to feature Black characters. I don’t know which way the causal arrow points, but I do believe the two things are related. I was writing into experience in a way I wasn’t before.  As far as the Nigerian element, Tiffany Liao, my initial editor for Beasts Made of Night, was the first to push me to really take ownership of my story like that. Beasts was initially a little more generic in its setting. A lot of the main elements were there, but the culture in the book wasn’t terribly specific. Tiff encouraged me to make the story mine in that respect, to imbue the place and the story with more of myself, and it blossomed as a result. I felt like I’d unlocked a new superpower. That gave me the encouragement to make my next project so specifically Nigerian, so Nigerian in fact that it would tackle one of the most verboten topics in Nigerian society: the civil war.  In a neat bit of circularity, one of the markets that rejected “Still Life” will be publishing Goliath.  War Girls puts female characters up front, with two main POV characters: Onyii and Ify. Riot Baby switches between Ella and Kev and actually opens with Ella, although Kev becomes the more prominent viewpoint. Is centering female points of view a deliberate choice, or is it more a matter of what feels right for the story?  The initial choice is deliberate, and the rest of the story spins out from that choice. I want to write things I haven’t seen before or haven’t seen enough of, and these stories with Black female characters front and center are foremost among them. I think, with a lot more stories than people think, you can make the choice to have your protagonist be from a certain demographic, whether the choice is about race or gender or religion or disability. And the task of the storyteller is to make the story make sense from that choice. The rocket ship can be whatever shape you want. And you have the power to alter the laws of physics however you need in order to ensure that ship’s safe launch off the launchpad.  On your website you say, “Short stories are tough as hell to write.” What is the biggest challenge for you in writing short fiction? What is the short story you are most proud of, and why?  For a long time, my short stories would spin out into novels, as though it were all out of my control. When I was a kid, I wrote this short about an assassin with a metal arm that blew up into a whole novel (that borrowed HEAVILY from Metal Gear Solid 2: Sons of Liberty) that then exploded into a four-book series. So, for me, the challenge has always been in having a full world exhibited within the confines of 7,500 words or less, which requires a lot of writing-by-implication and, usually, tight focus on one character. Almost all of my earlier work was multi-POV. That was actually a super tough thing to deal with while writing Beasts, staying within Taj’s POV for the entirety of the story. So, it’s kind of heartening to see my longer published work start to expand, viewpoint-wise. Beasts Made of Night and Crown of Thunder were limited to one POV. War Girls and Riot Baby each sport two POVs, and Goliath promises a few more than that.  As far as the short work I’m proudest of, I vacillate between “Place of Worship” and “Still Life.” I love both because I’m obsessed with prose styling. John Crowley’s Little, Big is an ideal I’m constantly reaching toward. It’s actually unfair how beautifully that whole-ass book is written. Every sentence sings. “Place of Worship” might edge ahead because 1) “Still Life” grew into a whole, new thing and 2) “Place of Worship” was and remains to this day the most personal story I’ve ever written. I wrote into my fears for that story pretty hard, and I was always worried that it wouldn’t be considered science-fictional enough for professional markets, so the payoff when it sold was particularly huge.  What is important or special to you about both Riot Baby and War Girls, what do you really want readers to know about these works?  I want readers to know that these works sell, and I want them to buy more (into) stories about Black people by Black people. Editors who read, agents who read, publicity departments that read, publishing house presidents who read, cover designers who read, I want them to know that stories like War Girls and Riot Baby sell and are a net good for the literary ecosystem. And I want them to buy more of these stories and to pay more for them. (Especially if I’m writing them :: wink :: .)  I think what’s special about these stories is that they don’t center the white experience and they weren’t written for the White Gaze. Some days, that sounds like a small thing. Some days, it sounds like the loudest thing on the planet.  What can you tell us about Goliath? What is important, special, and different about it? Do you have other stories or projects coming up?  Oh, it’s such a special book. The most structurally daring thing I’ve written. I really feel like I was firing on all cylinders writing it. Ostensibly, it’s a postapocalyptic saga about a group of brick stackers trying to make a way in New Haven in the face of . . . some changes. But it’s got so much of America in there. And there’s one bit in there (that I hope survives edits) that is the most titanic thing that’s ever come out of me.  And it’s set in a city I know and love that isn’t New York.  As far as what I have coming up, later this year is the sequel to War Girls from Razorbill. Then confirmed for next year is my first longform nonfiction outing, a book called (S)kinfolk, which is, on its face, a critical analysis of Chimamanda Ngozi Adichie’s Americanah but also does triple duty as memoir and sociocultural inquiry. It’s about my mother’s journey to this country as well as my own sentimental and political education regarding Blackness in America, and I’m super proud of it. That’s forthcoming from Fiction Advocate.  What have you read in genre lately (short or long) that really excited you, that you want everyone to read?  This Is How You Lose the Time War by Amal El-Mohtar and Max Gladstone turned me inside out. It felt, for the first time in a long time, like a book written specifically for me. And it felt, perhaps more importantly, like Max and Amal had so much fun writing it. They truly gave us a gift with that book.  I also have to say, I’m jonesing hard for Hao Jingfang’s Vagabonds. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nNanobots and Braincases: A Conversation with Tochi Onyebuchi\nThe future is always closer than we think: Star Trek’s communicators to smartphones; Aldous Huxley’s soma to Prozac; Ray Bradbury’s seashells to earbuds. Tochi Onyebuchi is a science fiction author with a head full of visions, from automated police response to brains used as media storage to mechs piloted by vengeful women. A master of dystopia, his visions encompass the fantastic as well as the all-too-possible.\nRiot Baby is a powerful, compact novella about siblings Ella and Kev, one with growing powers, the other thrown in prison. They must negotiate their fragile relationship with each other as Ella grapples with how she should use her increasingly dangerous abilities. The narrative journey moves through a visionary America grounded in the realities of our time, delivering both effective social critique and good science fiction.\nWar Girls Onyii and Ify are young sisters caught in the Nigerian Civil War—in 2172. They scavenge and fight when they must, until they are separated in an attack. What follows is an action-driven but complex story about culture, conflict, and identity. It’s also a harrowing tale of survival and family in a postnuclear disaster world.\nBorn in Massachusetts and raised in Connecticut, Tochi Onyebuchi is a consummate New Englander and “proud member of the Toonami Generation.” He graduated from Yale University, New York University’s Tisch School of the Arts, Columbia Law School, and L’institut d’études politiques with a masters degree in Global Business Law. He lives in Connecticut, where he works in the tech industry. His fiction has appeared in Asimov’s Science Fiction, Lightspeed Magazine, Uncanny Magazine, Omenana, Obsidian Journal, and more. Novella “Dust to Dust” and short story “Screamers” both landed on the Locus Recommended Reading list. His debut novel, Beasts Made of Night, won the Ilube Nommo Award for Best Speculative Fiction Novel. War Girls (Razorbill, October 2019) is a 2019 Cybils Awards finalist. Riot Baby (Tor.com Publishing, Jan 2020) is featured on a host of “must-read” lists, including Book Riot’s and SyFy Wire’s.\nBoth Riot Baby and War Girls blend science fiction with anime motifs, while still pulling off narratives that comport serious gravitas. How do you strike that balance?\nThat’s a really good question. For me, it comes down to narrative logic. Dreams and nightmares, no matter how much their thermodynamic laws may differ from that of our lived reality, bear an internal logic, and it’s an internal logic I see in the speculative fiction I read and watch, so my aim (subconsciously, at least) has been to create a story with internal logic.\nAs a kid, I watched X-Men: The Animated Series, and in maybe the second or third episode, Magneto tries to break Beast out of a prison cell after Beast has been captured during a failed operation on a Sentinel facility. And Magneto’s hovering in the air, surrounded by a sphere of sparking electricity, and this hairy blue man is crouching on his haunches, and they have this whole discussion about separatism versus integration. Gundam Wing introduced me to the concepts of pacifism and total war. So, it never struck me as strange or absurd to have fantastical elements of a story as vehicles for dealing with serious issues. I mean, Gundam pilots average, like, fifteen years old! It all had a narrative logic that I grokked early on in life.\nMuch of my early diet as a storyteller was manga and anime. Akira by Katsuhiro Otomo and Blade of the Immortal by Hiroaki Samura. It never occurred to me that self-reattaching severed limbs and cities falling out of the sky couldn’t be vessels for human drama. There’s so much imagination there, and that has always been among the most important elements of story to me.\nCan you talk a bit about the process of breaking into the publishing industry? What was it like, how did it happen; were there lows, and if so, how did you deal with them?\nI’ll start by saying I am SO happy I’m not breaking in during the Age of Twitter. I was neurotic enough during my own analog era that I would’ve gone mad doing it now. I probably started trying to get published in the early 2000s or so. And back then, it seemed the model in the specfic world was 1) write short stories, 2) pub those stories in places like Abyss & Apex or Ideomancer or Asimov’s, 3) use your short stories to get the attention of an agent, 4) show that agent the novel you’ve had cooking this whole time.\nThat was the process I witnessed at that age and with what limited exposure I had, but I was very impatient. I wanted a book on a shelf. So, instead of learning how to write short fiction and developing material and creds there, I spent most of my time on novels, writing book after book after book, averaging a novel a year for probably a decade and a half. My thinking at the time was: instead of work on the novel that got rejected, let me just write a better novel.\nBefore websites like AgentQuery came along, I would peruse the Acknowledgements page of books I liked to see which agents got thanked. I would then look them up either online or in the annual Writer’s Market Guide to Literary Agents that I would save up every year to buy. (Them joints were like $26 a pop and I didn’t have that kind of money as a kid!) I’d research their submission guidelines, put together a query letter and synopsis, and mail them out with a self-addressed stamped envelope. I chuckle now at the fact that I was paying for my own rejections.\nBut while I was slogging through novel rejections, an idea for a short would occur to me and I’d dash it off and sub it. “Dust to Dust” started out as a short story in John Crowley’s Intermediate Fiction Writing class in college. I think I subbed it at a few places, then let it collect . . . well . . . dust. Then, years later, I saw some novella-length sub requests on a website that served as a compendium for short fiction markets. So, I decided to expand the story, in part because I’d run out of short fiction markets to sub it to.\nDid a ton of research on the Cold War in Eastern Europe, and I workshopped the novella in pieces through the Online Writing Workshop for Science Fiction, Fantasy, and Horror (I’d been a member since middle school when it was sponsored by Del Rey and I was basically writing poorly-disguised Robert Jordan and Hiroaki Samura fan fic). Subbed it to a few places, and struck gold with the editor of the Panverse anthology series. Dario requested a round of edits and I happily obliged (the story was much stronger for it), and that was my first specfic sale. Before that, I’d sold a spy story to Crimespree Magazine (good luck finding it) and payment was two contributor copies that I never received.\n“Zen,” I wrote to procrastinate for my Constitutional Law final, then sat on it for a while before subbing, and I couldn’t believe it actually sold. It felt like an anomaly.\n“Place of Worship” was a sort of redo of an earlier short story that I couldn’t sell, and I wrote it more as an exorcism than anything else. I’d been going through some personal trials and tribulations in film school and going into law school, and writing that story served as catharsis. It seemed too literary for most specfic markets, and its novelette length seemed to make an even more difficult sell. But I shot my shot with Asimov’s, in part because they’d made things much easier with the move to online submissions, and, by God, Sheila said yes. That was the biggest check I’d received for my writing at that point and I nearly broke down in tears in the law school student service lobby.\nThe first draft of “Screamers” was written in 2010. It sold in 2016.\nI started trying to get my stories published in maybe 2003 or so, and by 2014, I’d sold four stories, been paid money for three. And all this time, I’m picking up novel rejections. I’m easily past one hundred at this point (One book picked up nineteen rejections, another eighteen, another twenty-six, another picked up fifty-eight, and on and on).\nBeasts Made of Night came about as a result of a chance meeting with Tiff Liao, who would later become my editor on the project. She was a law school classmate’s college roommate and we met at a party my first semester of law school and began our friendship. This was in 2012. In 2015, after graduating from law school, I was struggling to sell Goliath, which I’d written that spring, and she offered to take a look at it. We chatted and Goliath didn’t sell but she opened the door to YA for me, and I started writing Beasts Made of Night and the rest, as they say, is history.\nThere was never a time when I said to myself I’d hang up my cleats, but I did tell myself that if I didn’t sell a book by a certain age, I’d at least slow down a little. I’d been writing like my life depended on it, but as the realities of a legal career began to solidify around me, I told myself that I’d start to prioritize that and background the writing a bit, but there was never any thought given to pressing pause or, Heaven forbid, “stop” on my ambition to be published. I loved writing too much. Loved writing for writing’s sake. It was my favorite thing in the world, and still is. I couldn’t dream of a life where I didn’t have that. And that’s what kept me going through all the rejections, that and the fact that while I was querying, I was already working on the next, better thing. And I was always in love with what I was writing, even if none of the decision makers were yet.\nDoes SF/F do something or work in some way that is different than non-genre fiction? Or are the definitions arbitrary and meaningless?\nI get that there’s a marketing impetus behind genre definitions. People need to know where in the bookstore to put all the books. Problems abound, however, when those distinctions become imbued with moral or intellectual judgments or when taxonomy becomes hierarchy. Personally, I appreciate the distinctions, in part because genres tend to operate with their own internal logic. Thrillers and detective fiction have their tropes and the subversion of those tropes works most powerfully when there’s an awareness of the tropes to begin with. Romance novels offer very specific contractual terms to a reader. Science fiction and fantasy novels are constantly in conversation with each other, in a much more concentrated fashion than what’s found in what we call literary fiction. It isn’t so much that classification is useless (I think it’s helpful to know exactly what is meant by “magical realism,” for instance), so much as I think the imbuing of any qualitative judgment on the basis of that classification is repugnant and meaningless. Mystic River the movie won Oscars, but Mystic River the book would’ve been laughed out of any Pulitzer conversation, which is a crying shame, because that is a beautiful fucking book.\nSF/F is powerful, for me, because it operates as reality and metaphor at the same time. All our stories are about us. Stories about androids and aliens are stories about us. Stories about time travel and Terminators are stories about us. You can use SF/F to make a point, a warning, a premonition and Trojan horse it with lasers or underwater cities or what have you. You can also have fun. That’s a thing I have to keep reminding myself with SF/F, is that it enables what few other genres offer, which is what I saw Elizabeth Bear once call sensawunda. We even got our own word for it.\nI don’t think sense of wonder should always come with the adjectival “childlike” before it. At all ages, we need and deserve it. And SF/F is the only genre I know that has a definitional mandate to provide it. I have yet to read the work of literary fiction or crime fiction or romance fiction that’s shown me what it’s like when a city falls from the sky.\nDo you feel like genre is seeing significant changes in attitudes toward publishing POC and, in particular, African voices/works?\nIt feels particularly fortuitous to be asked this question days after Orbit Books acquired a magnificent trilogy inspired by ancient West African empires from Suyi Davies Okungbowa. Dr. Nnedi Okorafor has been in the trenches fighting battles for those of us who’ve come after for a long, long time now, and it fills me with such joy to see her getting the roses she’s getting now. And in the diaspora, you have Nisi Shawl’s Everfair (2016). On top of that, Tade Thompson wins the Arthur C. Clarke Award for Rosewater and Marlon James lands on the National Book Award shortlist for Black Leopard, Red Wolf, so it’s definitely an interesting and exciting time for stories of/by Africans.\nWhether diasporic or continental, authors are reaching a prominence we haven’t seen before, which is particularly heartening. And this isn’t even to mention the monster success that was Tomi Adeyemi’s Children of Blood and Bone, that being an excellent example of what it looks like when a publishing house actually puts its money behind a title and actively works to see it succeed. The Black Panther movie certainly served to convince decision makers and those holding purse strings that stories connected to the African continent could prove profitable, that there’s a market for them. Also, too, we can’t forget the work that Nalo Hopkinson and Tobias Buckell have been doing, Hopkinson for more than two decades.\nBut there is a ton of complication in the above part of my answer. Because the majority of the authors I just named are diaspora, whether based in the US, the UK, or the Caribbean. The vast majority of speculative fiction by continental Africans still hasn’t made it to the US, not because it doesn’t exist, but because of structural barriers domestically and a veritable lack of interest in stories from them on the part of USians. Penguin Random House has a South Africa branch, but they don’t accept science fiction submissions. And what other Big 5 house has a presence on the continent?\nOn the other side of the Atlantic, Cassava Republic (Nigeria) has an office in the UK but, to my knowledge, hasn’t been able to set one up in the US. NB Publishers is largely limited to South Africa’s book market as far as I can tell. So, if a continental African author like Helon Habila or Jennifer Makumbi wants a Western readership, they have to go through New York, London, or Paris. Now this opens out onto a larger discussion about whether to make more space for continental African writers in Western literary spaces or whether to contribute to the building of a more robust and versatile and adaptive publishing apparatus on a continent that houses about 1.3 billion people and about 3,000 ethnic groups speaking 2,100 different languages.\nI will say that, as far as genre spaces in the US, what I’ve noticed shares a bit of DNA with silkpunk and much East Asian-inspired specfic, is that it has rushed into a long-gestating hunger for non-Western fantasy and science fiction. Which is so refreshing after techno-orientalist fare like Blade Runner and Firefly and, arguably, Star Wars. As much as publishing likes to lose money, I do hope they recognize the opportunity presented by continuing and expanding opportunities for writers of non-Western backgrounds to tell stories inspired and influenced by those backgrounds.\nIs it important for fiction to discuss social issues—is it a necessary part of fiction? Or is it possible to write stories that are just “fun” stories, without a social or political stance?\nI think it’s a thing that happens whether the author intends it to or not. No work of fiction is apolitical. Strip a first-person shooter of any markers of religion or nationality and you’ll still have an interactive experience that tells you repeatedly that the only way to solve this puzzle is to shoot at it. Social issues may not be explicitly discussed in a particular work or alluded to, but voice is as much about what you leave out as it is about what you leave in.\nHowever unconscious your decision, if there are no queer people included in the future you’ve imagined, that is a statement. If the only people who can be heroes and major antagonists in your stories are descended from familial lines, that too is a statement. There’s no escaping it, because there is no escaping the reader who will read that in your story. So, you might as well be intentional in setting up the terms of the discussion.\nThere’s the perception (largely from doom-mongers) that stories that make statements can’t also be fun. It’s either tentpole action flicks or ponderous Oscar-bait. But, as being a Millennial has taught me, we can multitask. As a writer, I write the stories I want to read. Also, my existence is a politicized fact in America. Being a Black man has a say in my experience at school(s), on the street, on Twitter; it flavors my interactions with classmates (especially being on scholarship), literature, police, the ballot box, everywhere. And it’s always cool when a story can meet me there. Also, too, a lot of this boils down to the reader. You can choose not to engage in the anti-war messaging of The Lord of the Rings or the gender politics of The Wheel of Time or ideas of genetic determinism in Star Wars. That doesn’t mean that those who do are less right or correct or valid than you. For the most part, there is no score being kept regarding our reading experiences.\nDiscussion of social issues doesn’t need a work’s permission to happen. It is out of the author’s hands at that point.\nThere’s nothing Hajime Isayama or Yasuko Kobayashi can do to prevent an anti-Semitic reading of the second half of season three of Attack on Titan. Doesn’t mean that’s the only reading, and it doesn’t mean that the reverse reading, a reading that sees in that very same story a condemnation of Nazism, is any less valid.\nYou have an MFA in screenwriting from Tisch. What was your “learning to write” process? Did you simply adapt what you learned in screenwriting to the novel form? Did you take more classes, workshops, do critique circles? Was Tisch a good environment for speculative works?\nIt was largely emulation. When I was in high school, I think, I bought this book whose title was, I think, How to Write a Damn Good Novel, and it picked specific books and gave a pretty cosmetic analysis as to why they were good and what they did right. Among those books were The Godfather by Mario Puzo and John le Carré’s The Spy Who Came in from the Cold. I remember nothing from that book, but the books it chose as examples were highly instructive. So I learned how most painters do, by emulation. I saw what I liked and I tried to emulate that in my own fiction. I studied the craft through its products, reading and reading and reading, but I wouldn’t really learn story structure or any of its building blocks (at least, in the Western tradition) until film school. Before then, I had no idea what a three-act structure was or how central it was to the Western storytelling tradition.\nFilm school taught me stories’ building blocks re structure of the larger work but also within scene. Film school is why I’m always hunting for the conflict in a scene and it has helped me more easily discover who in my story is meant to be the protagonist. I started asking questions like “who has the most to lose in this situation” and “how do these characters’ desires and purposes collide in this scene” and “where is the friction here.” Learning how to write plays taught me scene breakdowns and how to play with rhythms, and I then applied all of that to my prose (though I still write stage plays and screenplays). Most of the speculative I wrote during that period was on my own time, not because of any restrictions in the program, but because I also wanted to use that period to stretch my wings genre-wise. In my last semester, I ended up writing a Civil War-era Western, a family drama, and a crime thriller about a Kosovar Albanian arms dealer, all feature-length screenplays. So many things I learned during the course of that semester made their way into my fiction, in ways both explicit and implicit.\nAre there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?\nMy Act III’s are HORRIBLE! At least, during the first draft, they’re always too short and, though I know the very, very last part or line, I’m always stumbling toward the finish line.\nFor me, your characters are stunning. How do you write interesting, compelling characters that feel grounded in the real world?\nThank you! I try to choose who I think is, situationally, the most interesting character. Who has the most to lose or who’s at the bottom of the pile, so to speak? One reason I’m less interested these days in stories that foreground white characters is that in white stories there is categorically less conflict and drama than in a story with a nonwhite protagonist or with non-white characters. In True Detective’s third season, Mahershala Ali’s character was originally white. He auditioned for the part nonetheless and lobbied for the character to be changed, and that change made for a much more interesting show because now, during the course of the investigation that runs through the season, there are all these little interactions and gestures and expressions of a dynamic that wouldn’t have been there if his character were white.\nOne moment when Ali and Stephen Dorff’s character go to interview a disappeared child’s father, the father instinctively turns to Dorff’s character, believing he’s the lead, and there’s a moment when he realizes Ali’s character is running point on the investigation, and that is such a small, powerful moment. The show isn’t a story about race per se, but it’s always there, an added level of drama that allows for particular moments of high tension. Story-wise, it’s magnificent. Imagine if Buffy were a hetero cis white male. So many of the inter-relational dynamics of the show would have been rendered less compelling.\nSo, there’s situational thinking to my choices, but I also want characters who struggle internally and who enter the story with that struggle. Taj is the best at what he does, but that thing is literally what will kill him, and being good at it exacts a physical and spiritual tax on him. Onyii loves Ify more than anything in the world and knows some measure of peace with her, but she self-identifies as a proficient killer. Also, she’s, for all intents and purposes, a child. So not only are these characters spinning against the way the world turns, they’re spinning against the way they turn. That friction makes for compelling characters. Keeping them firmly planted in their worlds is a result of me constantly chasing that conflict and drama in my stories.\nYou have also commented that the forthcoming Goliath, a book you wrote before Beasts Made of Night, was the first book you wrote with a Black protagonist. Does this mean there are other unpublished books and stories you wrote that do not have a Black protagonist? More importantly, what happened or changed that made you start writing with Nigerian viewpoints and Black protagonists?\nEverything I wrote before Goliath featured a white protagonist. It’s simply what I was reading. One book has, for its hero, a tortured former Mossad agent, and that stemmed from my much-abated obsession with Daniel Silva’s Gabriel Allon novels. (The virulent Islamophobia that started to appear turned me off greatly.)\nGoliath was actually the outgrowth of a short story I wrote in 2013, “Still Life with Hammers, a Broom, & a Brick Stacker” that was published in Obsidian: Literature & Arts in the African Diaspora in 2016. I was living in Palestine at the time, working with a prisoners’ rights organization, and I found myself in the midst of an imagined short story collection, of which I’d envisioned “Place of Worship” and “Zen and the Art of an Android Beatdown” to be a part. All the stories would feature characters on a single space colony, and the stories would be intertwined through the use of recurring characters. A mosaic novel. I thought, why not have a story about the people left behind on Earth, playing with the idea that all the people in space are generally white. So I wrote “Still Life” . . . and couldn’t sell it anywhere.\nI sat on it and, a few years later, thought I could build the world out a bit and expand the story. I thought to write a sort of slim, amorphous book reminiscent of Tinkers by Paul Harding where every sentence would hold its own crystallized beauty. It was going to be a literary novel with a speculative premise (back then, I still held those demarcations in mind!), and it came out at a cool 57k words, WAY too short for the speculative market but just right, I figured, for a literary novel. I got my longest, wordiest rejections for that book, which meant I was making progress. Small press publishers were asking if I had anything else; that sort of thing. Goliath was the best thing I had written and it was the first story I wrote to feature Black characters. I don’t know which way the causal arrow points, but I do believe the two things are related. I was writing into experience in a way I wasn’t before.\nAs far as the Nigerian element, Tiffany Liao, my initial editor for Beasts Made of Night, was the first to push me to really take ownership of my story like that. Beasts was initially a little more generic in its setting. A lot of the main elements were there, but the culture in the book wasn’t terribly specific. Tiff encouraged me to make the story mine in that respect, to imbue the place and the story with more of myself, and it blossomed as a result. I felt like I’d unlocked a new superpower. That gave me the encouragement to make my next project so specifically Nigerian, so Nigerian in fact that it would tackle one of the most verboten topics in Nigerian society: the civil war.\nIn a neat bit of circularity, one of the markets that rejected “Still Life” will be publishing Goliath.\nWar Girls puts female characters up front, with two main POV characters: Onyii and Ify. Riot Baby switches between Ella and Kev and actually opens with Ella, although Kev becomes the more prominent viewpoint. Is centering female points of view a deliberate choice, or is it more a matter of what feels right for the story?\nThe initial choice is deliberate, and the rest of the story spins out from that choice. I want to write things I haven’t seen before or haven’t seen enough of, and these stories with Black female characters front and center are foremost among them. I think, with a lot more stories than people think, you can make the choice to have your protagonist be from a certain demographic, whether the choice is about race or gender or religion or disability. And the task of the storyteller is to make the story make sense from that choice. The rocket ship can be whatever shape you want. And you have the power to alter the laws of physics however you need in order to ensure that ship’s safe launch off the launchpad.\nOn your website you say, “Short stories are tough as hell to write.” What is the biggest challenge for you in writing short fiction? What is the short story you are most proud of, and why?\nFor a long time, my short stories would spin out into novels, as though it were all out of my control. When I was a kid, I wrote this short about an assassin with a metal arm that blew up into a whole novel (that borrowed HEAVILY from Metal Gear Solid 2: Sons of Liberty) that then exploded into a four-book series. So, for me, the challenge has always been in having a full world exhibited within the confines of 7,500 words or less, which requires a lot of writing-by-implication and, usually, tight focus on one character. Almost all of my earlier work was multi-POV. That was actually a super tough thing to deal with while writing Beasts, staying within Taj’s POV for the entirety of the story. So, it’s kind of heartening to see my longer published work start to expand, viewpoint-wise. Beasts Made of Night and Crown of Thunder were limited to one POV. War Girls and Riot Baby each sport two POVs, and Goliath promises a few more than that.\nAs far as the short work I’m proudest of, I vacillate between “Place of Worship” and “Still Life.” I love both because I’m obsessed with prose styling. John Crowley’s Little, Big is an ideal I’m constantly reaching toward. It’s actually unfair how beautifully that whole-ass book is written. Every sentence sings. “Place of Worship” might edge ahead because 1) “Still Life” grew into a whole, new thing and 2) “Place of Worship” was and remains to this day the most personal story I’ve ever written. I wrote into my fears for that story pretty hard, and I was always worried that it wouldn’t be considered science-fictional enough for professional markets, so the payoff when it sold was particularly huge.\nWhat is important or special to you about both Riot Baby and War Girls, what do you really want readers to know about these works?\nI want readers to know that these works sell, and I want them to buy more (into) stories about Black people by Black people. Editors who read, agents who read, publicity departments that read, publishing house presidents who read, cover designers who read, I want them to know that stories like War Girls and Riot Baby sell and are a net good for the literary ecosystem. And I want them to buy more of these stories and to pay more for them. (Especially if I’m writing them :: wink :: .)\nI think what’s special about these stories is that they don’t center the white experience and they weren’t written for the White Gaze. Some days, that sounds like a small thing. Some days, it sounds like the loudest thing on the planet.\nWhat can you tell us about Goliath? What is important, special, and different about it? Do you have other stories or projects coming up?\nOh, it’s such a special book. The most structurally daring thing I’ve written. I really feel like I was firing on all cylinders writing it. Ostensibly, it’s a postapocalyptic saga about a group of brick stackers trying to make a way in New Haven in the face of . . . some changes. But it’s got so much of America in there. And there’s one bit in there (that I hope survives edits) that is the most titanic thing that’s ever come out of me.\nAnd it’s set in a city I know and love that isn’t New York.\nAs far as what I have coming up, later this year is the sequel to War Girls from Razorbill. Then confirmed for next year is my first longform nonfiction outing, a book called (S)kinfolk, which is, on its face, a critical analysis of Chimamanda Ngozi Adichie’s Americanah but also does triple duty as memoir and sociocultural inquiry. It’s about my mother’s journey to this country as well as my own sentimental and political education regarding Blackness in America, and I’m super proud of it. That’s forthcoming from Fiction Advocate.\nWhat have you read in genre lately (short or long) that really excited you, that you want everyone to read?\nThis Is How You Lose the Time War by Amal El-Mohtar and Max Gladstone turned me inside out. It felt, for the first time in a long time, like a book written specifically for me. And it felt, perhaps more importantly, like Max and Amal had so much fun writing it. They truly gave us a gift with that book.\nI also have to say, I’m jonesing hard for Hao Jingfang’s Vagabonds.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/onyebuchi_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Nanobots and Braincases: A Conversation with Tochi Onyebuchi by Arley Sorg"}