{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nika Murphy", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "D5Bwgh/nDMd325AkEu1dkldFQe4=", "id": null, "license": null, "comments": "", "raw_text": "4880 words, short story  The Art of Navigating an Affair in a Time Rift  In this timeline, crayons litter the kitchen table. Red for Mars. Pink and orange for clouds. Cerulean for the dot in the sky I call home, in this timeline. Jeannie sticks out her tongue when she colors. Her knuckles turn white as she rubs the crayons to nubs. She hands the picture to me as flakes of wax fall to the floor like confetti.  “It’s beautiful, Jeannie,” I say and kiss her forehead. She smells like earth after the rain. I hang it next to the others on the fridge. Her drawings overlap my sketches. Two artists in the family, as my husband likes to say. Jeannie runs outside to play. I tiptoe to the front of the house and push the blinds back an inch.  Joseph, the man who moved in across the street last year, dug a koi fishpond in his front yard and planted bamboo ten meters high. The lady on the corner crocheted him a stuffed panda that hangs from one of the trees. In some timelines, the panda is a dragon. In one timeline, the dragon has eaten all the koi. In that agonizing timeline, Joseph does not want me at all.  In most timelines, though, I borrow Joseph’s comic books. He borrows my postapocalyptic paperbacks. We talk about robots and Bradbury and art. He’s out there now. Shirtless. Feeding the fish. Their mouths breach the water in hungry little O’s.  My husband pulls into the driveway, blocking my view with the Jeep.  He gives me a kiss when he walks in and asks about Jeannie.  “She’s out back,” I say.  “You’ve got Outlier testing in an hour, Audra. You said you’d get her ready,” Paul says, his Texas drawl more prominent when he loses his patience.  “Sorry, I lost track of time,” I say.  Paul smiles, and his dimples melt away my thoughts. When I married him right out of high school, I never expected him to amount to anything. I always underestimated him, even before the rift sent us all into parallel timelines, before me and other Outliers pinballed in and out of pocket universes while the rest shifted into cozy sister dimensions. When he made Varsity or when the Space Force promoted him. I thought, at some point, he’d fail, and I’d no longer have to justify why we were together.  “It’s okay,” he says and gathers up the crayons. His perfection stands so tall, it towers over me and leaves me in shadow.  My nose tickles as if I’m about to sneeze, and I shift into another dimension. Not all transitions through the rift are gentle. Gentle means life will be more or less normal here.  In this timeline, Jeannie is at school and Paul is at the Institute. The phone buzzes. It’s Joseph. My entire body burns when I see his name on the screen. My insides curdle and petrify. My heart beats against my chest like a moth against a lamp. I shiver and answer the call.  “Come over,” he says in a voice like snow on the sidewalk. Soft, sibilant, gray. He knows I am alone. I press the phone to my ear and soak in his sound waves.  I grab some books and the comics I borrowed and walk across the street. He leaves the door open for me. Johnny Cash’s voice crackles from the stereo. He sings “I’m on Fire.”  “That’s how I feel when I know you are close,” Joseph says. I don’t respond. He takes my books and comics. Incense burns in the window and fills the house with a blurry haze. I want to drown in this smell.  “Do you have something new for me?”  “Try this,” he says and hands me Superman with a Soviet hammer and sickle on his chest. When I try to take it, he doesn’t let go. “For your thoughts.”  “How about a penny instead?”  “How about a dance?”  Joseph tosses the comic on a chair. Its pages flip open and flutter. I want to dance, but I ask for a rain check instead.  He stands and watches me and sighs.  Hours slip by like brushstrokes. We talk about new shows and old films. We sit on the floor and flip through art books. We study each other. I memorize the wrinkles around his eyes. The shape of his lips. The scar on his eyebrow. We try not to touch. But the tips of my fingers meet his, and his skin electrifies me. Skin like packed powder. Like it could crumble and blow away if we give in and embrace.  The rift scratches at my periphery. Smudges the edges of my mind with dry bristles.  “I have to go,” I say, but I don’t move.  The rift takes me anyway.  Paul and Jeannie walk in front of me down the Institute halls. Boys and girls in lab coats who can’t possibly be old enough to study or work here walk past. I wonder if I looked like that before I graduated college.  Paul is explaining how the machine stimulates your neurons to realign your consciousness to your “dimension of origin.” He may as well be speaking Japanese. I majored in Art History. In some timelines, I am the one explaining the rift to Jeannie while Paul stares blankly at the back of my head.  Dr. Kuzbari greets us with clipboard in hand and escorts us to the Neurotemporal Alignment Lab. We go over the standard questions, and I wait for Paul and Jeannie to finish their sessions.  “Your turn, Mrs. Cobb,” she says even though I tell her to call me Audra. I shoot a glance back to Paul.  “You’ll do great,” Paul smiles and gives me two thumbs up.  Dr. Kuzbari waits for me to sit in the leather chair before elevating it. She gives me the feedback helmet and lets me put it on myself. Then she clicks it into the humming machine behind me and checks the sensors for what seems like an hour.  I hate this room. The ecru walls suffocate me. The lights dim and monitors flicker and beep like a techno music video. The helmet’s headphones squeeze my ears, and they begin to ache. I try to readjust in the recliner, but it squeaks and snaps and I worry I broke it.  “Just relax,” the doctor says. She positions the visor over my eyes. “Almost ready,” she says in her lilting accent as she types nonstop.  “How long have you been doing this?” I say.  “Thirty years now. I was a neuropsychiatrist in my old timeline.”  “You seem so young.” I shift my weight but find no comfort.  “Thank you,” she says, and the typing finally stops. “You may feel some discomfort when the helmet activates the rift. This is normal.”  The visor flashes green dots, and I feel like I’ve been yanked inside out. I brace myself for what comes next.  The shift is violent, and I pray my time in this place will be swift. The noises and lights disappear and leave me in a void. It’s not black or white, but colorless, like the back of my eyelids. Then walls appear one by one. My walls. My house. I walk to the window and watch for Joseph to appear. He steps out on the porch and waves at me. I wave back.  Thank gods. There are timelines where Joseph does not exist. Timelines where I am a lizard in a terrarium in my own house watching on as my husband makes love to another wife. Where my child is but stardust. Living through those rifts, however momentary, feels like being pressed through a sieve.  Suddenly, the house starts to shake. The floor pulsates, shelves spit out books, and paintings jump from the walls like crickets. I try to hang on. I bang my fist against the window, but Joseph only waves.  The vibrations thump and the windows explode. Glass snows on my hair and bounces on the rug. The house levitates. I reach through the broken window and cut my hand on a shard of glass. The blood flows down my arm, down the stucco, and evaporates in the fireball of rocket boosters below. My house transforms into a rocket amid liftoff. I lean out of the window and call for help, but Joseph only waves.  Joseph waves goodbye.  I scream, but my voice dissolves in the roar of the flames. I sob, but the wind dries my face.  When the boosters sputter through the last layers of the atmosphere and the house is quiet again, I wade through the floating rubble to the kitchen. Curtains billow in a zero-gravity breeze, but my feet stick to the floor. Jeannie plucks crayons from the air and draws three-dimensional crystal domes. Paul takes me in his arms and grooms glass chunks out of my hair. He kisses my forehead, and I nestle into the nook between his shoulder and his heart.  Guilt overwhelms me, and I pull away. I run to the open window and jump.  Dr. Kuzbari switches the visor and headphones off. My eyes burn as they adjust to the light in the room, in a foreign timeline. My joints ache in the Martian gravity.  I sigh.  I hate Mars.  “What did the doc say?” Paul asks on the ride home. The weak Martian sun sets behind the passing trees in an autumnal blur. A Mango Tango crayon rolls across the floor mat.  “She wants to run some tests. She thinks I’m manipulating the machine, well, not me, my brain. She thinks my brain is controlling the shifts.”  “You’re in good hands with her. She’s the leading expert in the field. Anyway, it won’t be much longer. They’re days away from calculating a solution to the rift. We could go home soon. To our own timeline.”  Home. I stare out the window at Phobos and Deimos. Pimples in the burned Martian sky.  “Remember when we lived on Earth?”  Paul intertwines our fingers and kisses my hand. The sight of his profile untangles my thoughts.  “In another timeline?” he asks.  “You don’t remember?”  “It’s enough to know we were all together.”  “I’m hungry,” Jeannie yells from the backseat. We pick up a pizza and Jeannie recites all the new words she learned in school. We giggle when she mispronounces terrafoam and Valla Marinara. In every timeline, their laughter eclipses all my resentments until they shrink to asteroids crashing into the sun.  A few days later, I’m back at the Institute for another session. Beige walls close in on me. Dr. Kuzbari straps me to a gyroscopic chair. It’s supposed to help with the nausea. Instead, I feel like an actor stuck on the set of a foreign horror movie.  Lights, camera, shift, the sensation of being sucked through a straw.  This seems familiar. I’ve seen this in another timeline. My house. Again, we take off into the sky. Again, the agony of Joseph’s goodbye. Then Jeannie and her domes. Paul and his love. I run to the window, swat the debris away like gnats, and jump through. But the transition doesn’t save me.  I fall and fall toward Earth, all blue and brown and cotton candy wrapped. Her gravity pulls me closer. The wind and cold penetrate my bones.  “Audra,” Earth whispers. My name echoes on her breath and draws me in. I close my eyes and let her jet streams carry me.  Paul catches me in mid-flight and jerks me upward. He wears a Superman cape. The symbol on his chest shines brighter than the sun. When I squint, a picture of our family emerges. I beg him not to take me back, but he pumps one fist in the air and heads toward the red dot in the sky while I struggle to break free.  I am still screaming when Dr. Kuzbari removes my visor, and the rift spits me back into the lab. She loosens my restraints, brings me a glass of water, and waits for me to calm down, for my heart rate to slow, for my breathing to steady. Then she speaks.  “You want to tell me what is happening with you?”  “I don’t know.”  “You can tell me. Whatever it is.”  “I don’t want to go home,” I blurt out. She leans forward in her chair.  “A common sentiment among Outliers,” she says. “Tell me, can you control your jumps?”  “Is that possible?”  “Is it?” She leans back, disappointment oozing from her tone. She pauses, hesitant to say whatever itches at her.  “Tell me about the man. The neighbor,” she says at last.  The words don’t form. I gather my things.  “If you find me, the old me, here at the Institute, will you talk to me? To her?”  “The neuropsychiatrist?” I think on it but leave without answering.  Once outside, I run and keep running. I can be home in fifteen minutes if I keep going, so I do. I run and run all the way to my street, and I collapse at Joseph’s door. I knock, but he doesn’t answer. I call but he doesn’t pick up. I sit back against his door and cry. The rift squeezes my lungs, and I shift again.  The koi fish play and chase each other until they swirl into a ribbon of color cutting through the pond. The ribbon coils around the bamboo trees and shoots into the sky like a drunken rainbow.  Tears drip down my face, then hopscotch into the pond. Even if I could control the damned rift, what would I do? I can’t split myself in half and live in familial bliss with Paul and Jeannie while my quantum twin dives into Joseph’s bed and never again comes up for air. The two Audras would obliterate each other and create a black hole that swallows the entire universe.  Paul pulls up and helps Jeannie out of the car. He shoos her inside before I can say hi.  “What the heck is going on?” he asks, his accent thick and cartoonish.  “I don’t know,” I say.  “You scared me half to death. Doctor Kuzbari said you shouldn’t be left alone.”  I don’t disagree.  Paul talks but I have trouble listening. I hear him say words like “adverse effects” and “gravitational collapse,” but all I can focus on is Joseph’s door.  “Audra, are you listening to me?” Paul snaps his fingers, and I look into his blue-gray eyes. I want to smooth the worry in his brow. To make our lives perfect again. He hugs me the way he does in my favorite timelines, and I don’t pull away until he does.  It’s wrong, but sometimes I imagine Joseph when Paul makes love to me. I don’t open my eyes until we are done. Afterward, I feel so guilty, I shower for forty-five minutes. But not in Martian timelines. On Mars, we use synthetic towels to scrub our skin to conserve water. You can get used to any timeline, Paul says. Nothing ever bothers him.  On Earth, wisps of steam trail behind me as I step out of the bathroom. They follow me into the bedroom.  “You are so beautiful,” Paul says. I crawl back into bed and fall asleep in the crook of his arm.  A knock on the bedroom door wakes me deep in the night.  “Mommy.” Jeannie whimpers from behind the locked door.  “I’ll get it.” Paul starts to get up.  “No, it’s my turn,” I say.  “Let me. You need your rest.”  I’m already up, bathrobe on. “Next time.”  The dim light of the hallway forms long shadows on the hardwood, on the walls, on the ceiling. I pick Jeannie up and tell her that skinny giants are following us on the way to her room. They writhe and shrivel into the corners. Jeannie giggles and nuzzles her head in my neck. Her eyelashes tickle my skin, and her tears soak through my nightgown.  “I had a bad dream,” she mumbles.  “Me too,” I say and stroke her hair, rubbing the tangles between my fingers. I tuck her in and lie next to her. The shadows snake along the edges of the room.  “What did you dream, Mommy?”  “I dreamed we lived on Mars, but it was too hot, and we all dried out and turned into dust.”  “That’s silly. It’s always cold on Mars because the sun is too far away,” Jeannie says. “The virgin sucks out all the heat.”  I hold back laughter. Shadows bobble and grin and drip from the windowsills and light fixtures. “Virga,” I correct her.  “I think the Virga is beautiful,” she says and wiggles her tiny fingers to make pretend rain fall from the pretend sky.  I wiggle my fingers with her, and the rift opens like a book. My muscles tense against its pull but relax when Jeannie snuggles against me. Her love is gravity and tethers me to her, to this timeline. Clouds form beneath the glow-in-the-dark stars on the ceiling. The temperature in the room drops to freezing. Our breath puffs out of our nostrils and mouths like steampunk robots. Brilliant snowflakes fall from the clouds but dissipate before touching us. “Virga,” I whisper.  We watch the snow twinkle for a while until the rift closes, and we both fall asleep.  Smells of bacon and coffee climb the stairs and wake me. I follow the scent to the kitchen and join Paul and Jeannie for family breakfast. We look like a cereal commercial.  Except the scene is all askew. The walls tilt and the floorboards pulsate.  “How do you want your eggs?” Paul asks.  “Over easy,” I say. But before the words leave my mouth, the steaming plate appears in front of me. I break the yolk with my fork, and it oozes and swirls onto the table and onto the floor and sparkles as it winds its way through the dining room to the living room and up the stairs. I want to follow it, but Paul stops me.  “Where are you going? Aren’t we going to talk about the R-I-F-T?”  “Daddy, I know how to spell rift,” Jeannie says and pouts at us.  “The Institute has found a way to close it,” he says. “We can finally go back.”  Go back.  The words echo and reverberate through the house. The egg yolk path glistens in my periphery and my fingertips tingle. Once the rift closes, we go back. Back to before the rift ruptured. Back to when Joseph first moved in and before we . . .  Before.  I have to tell Joseph.  I excuse myself and follow the shining egg yolk toward the door. It loops around and goes up the stairs, but I ignore it and stumble out into the front yard. I look up and down the street, and I know I am looking for something. For a pond. But it’s not there. Paul comes outside and takes my hand.  “What are you looking for, Audra?”  “I think, a house. Wasn’t there a house right there?” I ask and point across the street to the slide and swings and monkey bars sprouting like time lapse weeds from the empty spot where Joseph’s house stood yesterday.  “You forgot again, didn’t you?” Paul says and smiles. The kind of smile I give Jeannie when she mixes up her left and right shoes.  “I’m sorry,” I say. Maybe Joseph was always part of the rift. Maybe it’s better this way and eventually I will forget he ever existed. Forget I ever wanted to tear my heart out and let him devour it.  “It’s always been this way, baby,” Paul says and hugs me and walks me back into the house.  Isn’t this what I wanted? Without Joseph, everything fits. Everything makes sense. My life. My family. My place in the world. I am a good wife in this timeline. A good mother. I smile.  “It’s perfect,” I lie.  The kitchen is still sideways. And the egg yolk path still beckons me upstairs.  The Laser Lemon yolk breathes and whispers as it meanders up each step. I follow its glimmering trail until I reach Jeannie’s bedroom door. A blinding white light flashes through the cracks. I put my hand on the knob, but I don’t turn it.  If I turn the knob, this world will melt away. If I turn around, I can stay here. Jeannie and Paul call my name from behind the door. They yell, scream, “Audra!” “Mommy!”  I turn the knob and walk through the barrier of light, but Paul and Jeannie aren’t there. I am. I am asleep in Jeannie’s bed. I run over to my sleeping self and shake her.  “Wake up, Audra,” I say.  She opens her eyes, and we collide into another timeline together.  Dr. Kuzbari’s neuropsychiatric office is small and dark. A sliver of window. A yellowing vine on the sill. Dust caresses the overflowing bookshelves. The room smells of oiled brass and turmeric. She walks in with two mugs and hands me one, then sits with the cup in front of her as the steam obscures her face.  “Are you ready to tell me about the man?”  I breathe in the spiced tea and take a sip. It burns my tongue.  “He’s my neighbor. We haven’t . . . We haven’t done anything.”  “It’s an emotional affair?”  “It’s not love,” I clarify.  “Lust then? That’s certainly simpler.”  “No.” I blow on my tea to cool it. “It’s like a worm that has burrowed its way into my stomach and claws and bites me until I feed it moments with him.”  “Limerence,” she says. “Not so simple after all.”  We sit in silence and sip our teas for a minute.  “In my timeline, you’re a famous neurophysicist. You’ll close the rift.”  She smirks as her eyes search the distance. I wonder which timeline she would prefer if given the choice. Her face turns solemn. She leans forward. Pushes her mug aside. “You can have him,” she says.  “What do you mean?”  “You can have the man, the neighbor, in this timeline and every other, if that is what you want.”  “But?”  “No but. You can choose him.”  “But I’ll lose my family.”  “Yes.”  No.  A frayed thread tickles my neck like Jeannie’s lashes. I tug and the rift unravels.  I jump through razor wire to another dimension.  Smells of bacon and coffee climb the stairs and wake me. I follow the scent to the kitchen and join Paul and Jeannie for family breakfast.  “How do you want your eggs?” Paul asks.  “Over easy,” I say. “No, wait.” This is all wrong. “Don’t we need to talk about L-O-V-E?”  Jeannie pouts at me.  “What about?” Paul says.  Something is stuck in my throat, and I can’t respond. I get up from the table and run out the front door across the street to Joseph’s. I knock and ring the bell and knock again, and he answers, but I can’t breathe, and I can’t tell him what I think because my mind is all pictures and colors and the light from outside is so very bright that I can’t see.  “What’s wrong, Audra? Tell me. Please tell me,” Joseph says with his hands around my shoulders, searching with his eyes, and it’s his face when he makes love to me in my imagination.  “I want to stay with you, but I can’t,” I say and collapse into his arms, and I sob as he cradles me back and forth and runs his fingers through my hair.  “Stay with me,” he says. “Stay.”  “I can’t. I’m sorry.”  “Please don’t go.”  “Goodbye.”  I walk back to my house and lock myself in the upstairs bathroom. I run hot water in the bath and the sink until steam covers the mirror, and I can no longer see my reflection.  I must find a way to be with Joseph and with Paul and with Jeannie. Surely, there are dimensions where I have unbounded wealth, fame, superpowers. Dimensions where I can destroy worlds or build them. Where I can live forever. If I can just focus and keep the rift open long enough, I can find a way to keep them all.  Paul knocks on the door.  “Talk to me, Audra,” he says. His voice is distorted, so I turn off the faucets to hear him better, but I don’t unlock the door.  “I don’t know what to say.” Water droplets snake down the mirror and plop into the standing water. “I don’t know what to do.”  “Sure you do. Let me in, baby.”  The faucets drip. It sounds like the world after rain.  “I just need a little more time.”  “The man across the street.” There’s pain and hesitation in his voice. “Are you . . . ?”  “No, never,” I say. “In any of the timelines, I swear.”  “Because I would understand. He’s more like you. I mean, you know what I mean. I’m not. I’m not like that. But I know you. I know you love your family. I love you so much, Audra. I’ve loved you since I was fourteen years old. You’re the only woman I ever loved, and I don’t know how to save us, but I’ll find a way.”  “You don’t need to save us, Paul. You’re not Superman.”  “I know. I know. Will you let me in?”  “Go away, please. I want to be alone.”  “Okay. I’ll be here whenever you’re ready to come out. I’ll always be here for you.”  I wait until his footsteps fade away. I peek under the door to check, and see Jeannie’s eye staring back at me.  “Mommy, are you okay?”  “Yes, baby, I’m taking a bath.”  “No, you’re not. I can see your feet.”  I smile.  “I made you a picture.” She slides it under the door.  Me, Paul, and Jeannie in front of our house. She’s starting to grasp perspective and shadow. Much better than I did at her age.  I cry and let the tears of pride, of shame, evaporate in the steam as my heart squeezes out its last shard of resistance.  The rift pulses in my ears and opens doors to lives where Joseph and I dance in orbit around each other. Cold lives where nothing shines except when we are together. And even then, the heat we generate is tepid. Like putting a hand in the fireplace and finding fake fire, plastic wood, glass embers. Lives where I am never truly satisfied. Not without Paul and Jeannie.  Without them, I’m a shell made up of sketches and vinyl records and yellowed pages. Without them, I am empty.  It’s impossible. There is no dimension or timeline before or after the rift where I get to have them all. But there are an infinity of timelines where Paul loves me, where Jeannie came from my body and inherited my love of art. Where I am loved whole, shell and brain and sinew. None of those timelines include Joseph.  I step into the tub and submerge myself. The water washes away the murk swirling in my brain and the rift shines white like a blank canvas. I breathe out and the air bubbles paint a door. I step through.  Dr. Kuzbari operates the rift machine. Paul stands off to the side, but I know he is there. I know he will see everything on the monitors.  “See you at home, Mommy,” Jeannie says.  The straps around my waist and my wrists are loose. Kuzbari’s got me hooked to an oxygen mask and an IV and a host of machines. A thousand electrodes protrude from my head.  “Alright, Mrs. Cobb, we are ready, how about you?” says the doc, resting the visor on my forehead.  “Blast off,” I say.  “Godspeed,” she whispers in Earth’s voice.  I close my eyes and let the beige walls fall away one last time.  My street stretches in a slight curve to the west. The sun sets behind a group of mismatched houses and trees, old and tall. Spanish moss hangs in thick curtains from the branches. The sky is all the colors of Jupiter at once soaked in summer air.  Joseph stands at the edge of his koi pond. I want to go to him. To lose myself for hours in comics and music and carelessness. To yearn and drown in the yearning, suspended in the margin between despair and wild abandon, a space where happiness always lies beyond the horizon. But the waning light from the sun shines on my house and leaves Joseph’s in the dark. So, I go home.  As I step inside, the rift closes behind me and melts away.  Colored pencils roll across the kitchen table. Jeannie’s tongue sticks out as she adds sunglasses to the yellow sun.  “That’s clever, Jeannie.” I breathe in her scent as I kiss the top of her head. She smells of home.  Paul comes in and kisses me.  “Did you see our new neighbor is diggin’ a pond?” Paul shakes his head. “Imagine the mosquitoes!”  “Can we get pizza for dinner?” Jeannie asks.  Something catches in my throat, but it’s gone in a blink along with trillions of memories.", "text": "4880 words, short story\nThe Art of Navigating an Affair in a Time Rift\nIn this timeline, crayons litter the kitchen table. Red for Mars. Pink and orange for clouds. Cerulean for the dot in the sky I call home, in this timeline. Jeannie sticks out her tongue when she colors. Her knuckles turn white as she rubs the crayons to nubs. She hands the picture to me as flakes of wax fall to the floor like confetti.\n“It’s beautiful, Jeannie,” I say and kiss her forehead. She smells like earth after the rain. I hang it next to the others on the fridge. Her drawings overlap my sketches. Two artists in the family, as my husband likes to say. Jeannie runs outside to play. I tiptoe to the front of the house and push the blinds back an inch.\nJoseph, the man who moved in across the street last year, dug a koi fishpond in his front yard and planted bamboo ten meters high. The lady on the corner crocheted him a stuffed panda that hangs from one of the trees. In some timelines, the panda is a dragon. In one timeline, the dragon has eaten all the koi. In that agonizing timeline, Joseph does not want me at all.\nIn most timelines, though, I borrow Joseph’s comic books. He borrows my postapocalyptic paperbacks. We talk about robots and Bradbury and art. He’s out there now. Shirtless. Feeding the fish. Their mouths breach the water in hungry little O’s.\nMy husband pulls into the driveway, blocking my view with the Jeep.\nHe gives me a kiss when he walks in and asks about Jeannie.\n“She’s out back,” I say.\n“You’ve got Outlier testing in an hour, Audra. You said you’d get her ready,” Paul says, his Texas drawl more prominent when he loses his patience.\n“Sorry, I lost track of time,” I say.\nPaul smiles, and his dimples melt away my thoughts. When I married him right out of high school, I never expected him to amount to anything. I always underestimated him, even before the rift sent us all into parallel timelines, before me and other Outliers pinballed in and out of pocket universes while the rest shifted into cozy sister dimensions. When he made Varsity or when the Space Force promoted him. I thought, at some point, he’d fail, and I’d no longer have to justify why we were together.\n“It’s okay,” he says and gathers up the crayons. His perfection stands so tall, it towers over me and leaves me in shadow.\nMy nose tickles as if I’m about to sneeze, and I shift into another dimension. Not all transitions through the rift are gentle. Gentle means life will be more or less normal here.\nIn this timeline, Jeannie is at school and Paul is at the Institute. The phone buzzes. It’s Joseph. My entire body burns when I see his name on the screen. My insides curdle and petrify. My heart beats against my chest like a moth against a lamp. I shiver and answer the call.\n“Come over,” he says in a voice like snow on the sidewalk. Soft, sibilant, gray. He knows I am alone. I press the phone to my ear and soak in his sound waves.\nI grab some books and the comics I borrowed and walk across the street. He leaves the door open for me. Johnny Cash’s voice crackles from the stereo. He sings “I’m on Fire.”\n“That’s how I feel when I know you are close,” Joseph says. I don’t respond. He takes my books and comics. Incense burns in the window and fills the house with a blurry haze. I want to drown in this smell.\n“Do you have something new for me?”\n“Try this,” he says and hands me Superman with a Soviet hammer and sickle on his chest. When I try to take it, he doesn’t let go. “For your thoughts.”\n“How about a penny instead?”\n“How about a dance?”\nJoseph tosses the comic on a chair. Its pages flip open and flutter. I want to dance, but I ask for a rain check instead.\nHe stands and watches me and sighs.\nHours slip by like brushstrokes. We talk about new shows and old films. We sit on the floor and flip through art books. We study each other. I memorize the wrinkles around his eyes. The shape of his lips. The scar on his eyebrow. We try not to touch. But the tips of my fingers meet his, and his skin electrifies me. Skin like packed powder. Like it could crumble and blow away if we give in and embrace.\nThe rift scratches at my periphery. Smudges the edges of my mind with dry bristles.\n“I have to go,” I say, but I don’t move.\nThe rift takes me anyway.\nPaul and Jeannie walk in front of me down the Institute halls. Boys and girls in lab coats who can’t possibly be old enough to study or work here walk past. I wonder if I looked like that before I graduated college.\nPaul is explaining how the machine stimulates your neurons to realign your consciousness to your “dimension of origin.” He may as well be speaking Japanese. I majored in Art History. In some timelines, I am the one explaining the rift to Jeannie while Paul stares blankly at the back of my head.\nDr. Kuzbari greets us with clipboard in hand and escorts us to the Neurotemporal Alignment Lab. We go over the standard questions, and I wait for Paul and Jeannie to finish their sessions.\n“Your turn, Mrs. Cobb,” she says even though I tell her to call me Audra. I shoot a glance back to Paul.\n“You’ll do great,” Paul smiles and gives me two thumbs up.\nDr. Kuzbari waits for me to sit in the leather chair before elevating it. She gives me the feedback helmet and lets me put it on myself. Then she clicks it into the humming machine behind me and checks the sensors for what seems like an hour.\nI hate this room. The ecru walls suffocate me. The lights dim and monitors flicker and beep like a techno music video. The helmet’s headphones squeeze my ears, and they begin to ache. I try to readjust in the recliner, but it squeaks and snaps and I worry I broke it.\n“Just relax,” the doctor says. She positions the visor over my eyes. “Almost ready,” she says in her lilting accent as she types nonstop.\n“How long have you been doing this?” I say.\n“Thirty years now. I was a neuropsychiatrist in my old timeline.”\n“You seem so young.” I shift my weight but find no comfort.\n“Thank you,” she says, and the typing finally stops. “You may feel some discomfort when the helmet activates the rift. This is normal.”\nThe visor flashes green dots, and I feel like I’ve been yanked inside out. I brace myself for what comes next.\nThe shift is violent, and I pray my time in this place will be swift. The noises and lights disappear and leave me in a void. It’s not black or white, but colorless, like the back of my eyelids. Then walls appear one by one. My walls. My house. I walk to the window and watch for Joseph to appear. He steps out on the porch and waves at me. I wave back.\nThank gods. There are timelines where Joseph does not exist. Timelines where I am a lizard in a terrarium in my own house watching on as my husband makes love to another wife. Where my child is but stardust. Living through those rifts, however momentary, feels like being pressed through a sieve.\nSuddenly, the house starts to shake. The floor pulsates, shelves spit out books, and paintings jump from the walls like crickets. I try to hang on. I bang my fist against the window, but Joseph only waves.\nThe vibrations thump and the windows explode. Glass snows on my hair and bounces on the rug. The house levitates. I reach through the broken window and cut my hand on a shard of glass. The blood flows down my arm, down the stucco, and evaporates in the fireball of rocket boosters below. My house transforms into a rocket amid liftoff. I lean out of the window and call for help, but Joseph only waves.\nJoseph waves goodbye.\nI scream, but my voice dissolves in the roar of the flames. I sob, but the wind dries my face.\nWhen the boosters sputter through the last layers of the atmosphere and the house is quiet again, I wade through the floating rubble to the kitchen. Curtains billow in a zero-gravity breeze, but my feet stick to the floor. Jeannie plucks crayons from the air and draws three-dimensional crystal domes. Paul takes me in his arms and grooms glass chunks out of my hair. He kisses my forehead, and I nestle into the nook between his shoulder and his heart.\nGuilt overwhelms me, and I pull away. I run to the open window and jump.\nDr. Kuzbari switches the visor and headphones off. My eyes burn as they adjust to the light in the room, in a foreign timeline. My joints ache in the Martian gravity.\nI sigh.\nI hate Mars.\n“What did the doc say?” Paul asks on the ride home. The weak Martian sun sets behind the passing trees in an autumnal blur. A Mango Tango crayon rolls across the floor mat.\n“She wants to run some tests. She thinks I’m manipulating the machine, well, not me, my brain. She thinks my brain is controlling the shifts.”\n“You’re in good hands with her. She’s the leading expert in the field. Anyway, it won’t be much longer. They’re days away from calculating a solution to the rift. We could go home soon. To our own timeline.”\nHome. I stare out the window at Phobos and Deimos. Pimples in the burned Martian sky.\n“Remember when we lived on Earth?”\nPaul intertwines our fingers and kisses my hand. The sight of his profile untangles my thoughts.\n“In another timeline?” he asks.\n“You don’t remember?”\n“It’s enough to know we were all together.”\n“I’m hungry,” Jeannie yells from the backseat. We pick up a pizza and Jeannie recites all the new words she learned in school. We giggle when she mispronounces terrafoam and Valla Marinara. In every timeline, their laughter eclipses all my resentments until they shrink to asteroids crashing into the sun.\nA few days later, I’m back at the Institute for another session. Beige walls close in on me. Dr. Kuzbari straps me to a gyroscopic chair. It’s supposed to help with the nausea. Instead, I feel like an actor stuck on the set of a foreign horror movie.\nLights, camera, shift, the sensation of being sucked through a straw.\nThis seems familiar. I’ve seen this in another timeline. My house. Again, we take off into the sky. Again, the agony of Joseph’s goodbye. Then Jeannie and her domes. Paul and his love. I run to the window, swat the debris away like gnats, and jump through. But the transition doesn’t save me.\nI fall and fall toward Earth, all blue and brown and cotton candy wrapped. Her gravity pulls me closer. The wind and cold penetrate my bones.\n“Audra,” Earth whispers. My name echoes on her breath and draws me in. I close my eyes and let her jet streams carry me.\nPaul catches me in mid-flight and jerks me upward. He wears a Superman cape. The symbol on his chest shines brighter than the sun. When I squint, a picture of our family emerges. I beg him not to take me back, but he pumps one fist in the air and heads toward the red dot in the sky while I struggle to break free.\nI am still screaming when Dr. Kuzbari removes my visor, and the rift spits me back into the lab. She loosens my restraints, brings me a glass of water, and waits for me to calm down, for my heart rate to slow, for my breathing to steady. Then she speaks.\n“You want to tell me what is happening with you?”\n“I don’t know.”\n“You can tell me. Whatever it is.”\n“I don’t want to go home,” I blurt out. She leans forward in her chair.\n“A common sentiment among Outliers,” she says. “Tell me, can you control your jumps?”\n“Is that possible?”\n“Is it?” She leans back, disappointment oozing from her tone. She pauses, hesitant to say whatever itches at her.\n“Tell me about the man. The neighbor,” she says at last.\nThe words don’t form. I gather my things.\n“If you find me, the old me, here at the Institute, will you talk to me? To her?”\n“The neuropsychiatrist?” I think on it but leave without answering.\nOnce outside, I run and keep running. I can be home in fifteen minutes if I keep going, so I do. I run and run all the way to my street, and I collapse at Joseph’s door. I knock, but he doesn’t answer. I call but he doesn’t pick up. I sit back against his door and cry. The rift squeezes my lungs, and I shift again.\nThe koi fish play and chase each other until they swirl into a ribbon of color cutting through the pond. The ribbon coils around the bamboo trees and shoots into the sky like a drunken rainbow.\nTears drip down my face, then hopscotch into the pond. Even if I could control the damned rift, what would I do? I can’t split myself in half and live in familial bliss with Paul and Jeannie while my quantum twin dives into Joseph’s bed and never again comes up for air. The two Audras would obliterate each other and create a black hole that swallows the entire universe.\nPaul pulls up and helps Jeannie out of the car. He shoos her inside before I can say hi.\n“What the heck is going on?” he asks, his accent thick and cartoonish.\n“I don’t know,” I say.\n“You scared me half to death. Doctor Kuzbari said you shouldn’t be left alone.”\nI don’t disagree.\nPaul talks but I have trouble listening. I hear him say words like “adverse effects” and “gravitational collapse,” but all I can focus on is Joseph’s door.\n“Audra, are you listening to me?” Paul snaps his fingers, and I look into his blue-gray eyes. I want to smooth the worry in his brow. To make our lives perfect again. He hugs me the way he does in my favorite timelines, and I don’t pull away until he does.\nIt’s wrong, but sometimes I imagine Joseph when Paul makes love to me. I don’t open my eyes until we are done. Afterward, I feel so guilty, I shower for forty-five minutes. But not in Martian timelines. On Mars, we use synthetic towels to scrub our skin to conserve water. You can get used to any timeline, Paul says. Nothing ever bothers him.\nOn Earth, wisps of steam trail behind me as I step out of the bathroom. They follow me into the bedroom.\n“You are so beautiful,” Paul says. I crawl back into bed and fall asleep in the crook of his arm.\nA knock on the bedroom door wakes me deep in the night.\n“Mommy.” Jeannie whimpers from behind the locked door.\n“I’ll get it.” Paul starts to get up.\n“No, it’s my turn,” I say.\n“Let me. You need your rest.”\nI’m already up, bathrobe on. “Next time.”\nThe dim light of the hallway forms long shadows on the hardwood, on the walls, on the ceiling. I pick Jeannie up and tell her that skinny giants are following us on the way to her room. They writhe and shrivel into the corners. Jeannie giggles and nuzzles her head in my neck. Her eyelashes tickle my skin, and her tears soak through my nightgown.\n“I had a bad dream,” she mumbles.\n“Me too,” I say and stroke her hair, rubbing the tangles between my fingers. I tuck her in and lie next to her. The shadows snake along the edges of the room.\n“What did you dream, Mommy?”\n“I dreamed we lived on Mars, but it was too hot, and we all dried out and turned into dust.”\n“That’s silly. It’s always cold on Mars because the sun is too far away,” Jeannie says. “The virgin sucks out all the heat.”\nI hold back laughter. Shadows bobble and grin and drip from the windowsills and light fixtures. “Virga,” I correct her.\n“I think the Virga is beautiful,” she says and wiggles her tiny fingers to make pretend rain fall from the pretend sky.\nI wiggle my fingers with her, and the rift opens like a book. My muscles tense against its pull but relax when Jeannie snuggles against me. Her love is gravity and tethers me to her, to this timeline. Clouds form beneath the glow-in-the-dark stars on the ceiling. The temperature in the room drops to freezing. Our breath puffs out of our nostrils and mouths like steampunk robots. Brilliant snowflakes fall from the clouds but dissipate before touching us. “Virga,” I whisper.\nWe watch the snow twinkle for a while until the rift closes, and we both fall asleep.\nSmells of bacon and coffee climb the stairs and wake me. I follow the scent to the kitchen and join Paul and Jeannie for family breakfast. We look like a cereal commercial.\nExcept the scene is all askew. The walls tilt and the floorboards pulsate.\n“How do you want your eggs?” Paul asks.\n“Over easy,” I say. But before the words leave my mouth, the steaming plate appears in front of me. I break the yolk with my fork, and it oozes and swirls onto the table and onto the floor and sparkles as it winds its way through the dining room to the living room and up the stairs. I want to follow it, but Paul stops me.\n“Where are you going? Aren’t we going to talk about the R-I-F-T?”\n“Daddy, I know how to spell rift,” Jeannie says and pouts at us.\n“The Institute has found a way to close it,” he says. “We can finally go back.”\nGo back.\nThe words echo and reverberate through the house. The egg yolk path glistens in my periphery and my fingertips tingle. Once the rift closes, we go back. Back to before the rift ruptured. Back to when Joseph first moved in and before we . . .\nBefore.\nI have to tell Joseph.\nI excuse myself and follow the shining egg yolk toward the door. It loops around and goes up the stairs, but I ignore it and stumble out into the front yard. I look up and down the street, and I know I am looking for something. For a pond. But it’s not there. Paul comes outside and takes my hand.\n“What are you looking for, Audra?”\n“I think, a house. Wasn’t there a house right there?” I ask and point across the street to the slide and swings and monkey bars sprouting like time lapse weeds from the empty spot where Joseph’s house stood yesterday.\n“You forgot again, didn’t you?” Paul says and smiles. The kind of smile I give Jeannie when she mixes up her left and right shoes.\n“I’m sorry,” I say. Maybe Joseph was always part of the rift. Maybe it’s better this way and eventually I will forget he ever existed. Forget I ever wanted to tear my heart out and let him devour it.\n“It’s always been this way, baby,” Paul says and hugs me and walks me back into the house.\nIsn’t this what I wanted? Without Joseph, everything fits. Everything makes sense. My life. My family. My place in the world. I am a good wife in this timeline. A good mother. I smile.\n“It’s perfect,” I lie.\nThe kitchen is still sideways. And the egg yolk path still beckons me upstairs.\nThe Laser Lemon yolk breathes and whispers as it meanders up each step. I follow its glimmering trail until I reach Jeannie’s bedroom door. A blinding white light flashes through the cracks. I put my hand on the knob, but I don’t turn it.\nIf I turn the knob, this world will melt away. If I turn around, I can stay here. Jeannie and Paul call my name from behind the door. They yell, scream, “Audra!” “Mommy!”\nI turn the knob and walk through the barrier of light, but Paul and Jeannie aren’t there. I am. I am asleep in Jeannie’s bed. I run over to my sleeping self and shake her.\n“Wake up, Audra,” I say.\nShe opens her eyes, and we collide into another timeline together.\nDr. Kuzbari’s neuropsychiatric office is small and dark. A sliver of window. A yellowing vine on the sill. Dust caresses the overflowing bookshelves. The room smells of oiled brass and turmeric. She walks in with two mugs and hands me one, then sits with the cup in front of her as the steam obscures her face.\n“Are you ready to tell me about the man?”\nI breathe in the spiced tea and take a sip. It burns my tongue.\n“He’s my neighbor. We haven’t . . . We haven’t done anything.”\n“It’s an emotional affair?”\n“It’s not love,” I clarify.\n“Lust then? That’s certainly simpler.”\n“No.” I blow on my tea to cool it. “It’s like a worm that has burrowed its way into my stomach and claws and bites me until I feed it moments with him.”\n“Limerence,” she says. “Not so simple after all.”\nWe sit in silence and sip our teas for a minute.\n“In my timeline, you’re a famous neurophysicist. You’ll close the rift.”\nShe smirks as her eyes search the distance. I wonder which timeline she would prefer if given the choice. Her face turns solemn. She leans forward. Pushes her mug aside. “You can have him,” she says.\n“What do you mean?”\n“You can have the man, the neighbor, in this timeline and every other, if that is what you want.”\n“But?”\n“No but. You can choose him.”\n“But I’ll lose my family.”\n“Yes.”\nNo.\nA frayed thread tickles my neck like Jeannie’s lashes. I tug and the rift unravels.\nI jump through razor wire to another dimension.\nSmells of bacon and coffee climb the stairs and wake me. I follow the scent to the kitchen and join Paul and Jeannie for family breakfast.\n“How do you want your eggs?” Paul asks.\n“Over easy,” I say. “No, wait.” This is all wrong. “Don’t we need to talk about L-O-V-E?”\nJeannie pouts at me.\n“What about?” Paul says.\nSomething is stuck in my throat, and I can’t respond. I get up from the table and run out the front door across the street to Joseph’s. I knock and ring the bell and knock again, and he answers, but I can’t breathe, and I can’t tell him what I think because my mind is all pictures and colors and the light from outside is so very bright that I can’t see.\n“What’s wrong, Audra? Tell me. Please tell me,” Joseph says with his hands around my shoulders, searching with his eyes, and it’s his face when he makes love to me in my imagination.\n“I want to stay with you, but I can’t,” I say and collapse into his arms, and I sob as he cradles me back and forth and runs his fingers through my hair.\n“Stay with me,” he says. “Stay.”\n“I can’t. I’m sorry.”\n“Please don’t go.”\n“Goodbye.”\nI walk back to my house and lock myself in the upstairs bathroom. I run hot water in the bath and the sink until steam covers the mirror, and I can no longer see my reflection.\nI must find a way to be with Joseph and with Paul and with Jeannie. Surely, there are dimensions where I have unbounded wealth, fame, superpowers. Dimensions where I can destroy worlds or build them. Where I can live forever. If I can just focus and keep the rift open long enough, I can find a way to keep them all.\nPaul knocks on the door.\n“Talk to me, Audra,” he says. His voice is distorted, so I turn off the faucets to hear him better, but I don’t unlock the door.\n“I don’t know what to say.” Water droplets snake down the mirror and plop into the standing water. “I don’t know what to do.”\n“Sure you do. Let me in, baby.”\nThe faucets drip. It sounds like the world after rain.\n“I just need a little more time.”\n“The man across the street.” There’s pain and hesitation in his voice. “Are you . . . ?”\n“No, never,” I say. “In any of the timelines, I swear.”\n“Because I would understand. He’s more like you. I mean, you know what I mean. I’m not. I’m not like that. But I know you. I know you love your family. I love you so much, Audra. I’ve loved you since I was fourteen years old. You’re the only woman I ever loved, and I don’t know how to save us, but I’ll find a way.”\n“You don’t need to save us, Paul. You’re not Superman.”\n“I know. I know. Will you let me in?”\n“Go away, please. I want to be alone.”\n“Okay. I’ll be here whenever you’re ready to come out. I’ll always be here for you.”\nI wait until his footsteps fade away. I peek under the door to check, and see Jeannie’s eye staring back at me.\n“Mommy, are you okay?”\n“Yes, baby, I’m taking a bath.”\n“No, you’re not. I can see your feet.”\nI smile.\n“I made you a picture.” She slides it under the door.\nMe, Paul, and Jeannie in front of our house. She’s starting to grasp perspective and shadow. Much better than I did at her age.\nI cry and let the tears of pride, of shame, evaporate in the steam as my heart squeezes out its last shard of resistance.\nThe rift pulses in my ears and opens doors to lives where Joseph and I dance in orbit around each other. Cold lives where nothing shines except when we are together. And even then, the heat we generate is tepid. Like putting a hand in the fireplace and finding fake fire, plastic wood, glass embers. Lives where I am never truly satisfied. Not without Paul and Jeannie.\nWithout them, I’m a shell made up of sketches and vinyl records and yellowed pages. Without them, I am empty.\nIt’s impossible. There is no dimension or timeline before or after the rift where I get to have them all. But there are an infinity of timelines where Paul loves me, where Jeannie came from my body and inherited my love of art. Where I am loved whole, shell and brain and sinew. None of those timelines include Joseph.\nI step into the tub and submerge myself. The water washes away the murk swirling in my brain and the rift shines white like a blank canvas. I breathe out and the air bubbles paint a door. I step through.\nDr. Kuzbari operates the rift machine. Paul stands off to the side, but I know he is there. I know he will see everything on the monitors.\n“See you at home, Mommy,” Jeannie says.\nThe straps around my waist and my wrists are loose. Kuzbari’s got me hooked to an oxygen mask and an IV and a host of machines. A thousand electrodes protrude from my head.\n“Alright, Mrs. Cobb, we are ready, how about you?” says the doc, resting the visor on my forehead.\n“Blast off,” I say.\n“Godspeed,” she whispers in Earth’s voice.\nI close my eyes and let the beige walls fall away one last time.\nMy street stretches in a slight curve to the west. The sun sets behind a group of mismatched houses and trees, old and tall. Spanish moss hangs in thick curtains from the branches. The sky is all the colors of Jupiter at once soaked in summer air.\nJoseph stands at the edge of his koi pond. I want to go to him. To lose myself for hours in comics and music and carelessness. To yearn and drown in the yearning, suspended in the margin between despair and wild abandon, a space where happiness always lies beyond the horizon. But the waning light from the sun shines on my house and leaves Joseph’s in the dark. So, I go home.\nAs I step inside, the rift closes behind me and melts away.\nColored pencils roll across the kitchen table. Jeannie’s tongue sticks out as she adds sunglasses to the yellow sun.\n“That’s clever, Jeannie.” I breathe in her scent as I kiss the top of her head. She smells of home.\nPaul comes in and kisses me.\n“Did you see our new neighbor is diggin’ a pond?” Paul shakes his head. “Imagine the mosquitoes!”\n“Can we get pizza for dinner?” Jeannie asks.\nSomething catches in my throat, but it’s gone in a blink along with trillions of memories.", "source": "https://clarkesworldmagazine.com/murphy_06_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Art of Navigating an Affair in a Time Rift by Nika Murphy"}