{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Eric M Witchey", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "NYxz30hnaG4ZWlRA+UGJDVcEHMg=", "id": null, "license": null, "comments": "", "raw_text": "2370 words, short story  Can You See Me Now?  Two miles of sea water overhead pretty well filtered out the ill effects of sunlight and mankind. Alone in her hard suit, lights on for safety, Lori’s boots settled and held in the pale, diatomaceous silt cover over the San Bernardino Highway. Helmet speakers trickled distant Vivaldi into her ears, and her feeder tube pumped nutrients in accordance with strict protocols for preservation of cultural authenticity. She’d gotten the job because she fit the restored hard suit and because her body was a perfect museum piece, a monument to the ancient submerged civilization of Los Angeles.  She was forty minutes out on her commute after leaving suburb dome one. She knew the route well enough. She walked it every day of the week except Sixth and Seventh. Evenings, Sixth, and Seventh she did H&H, Home-and-Hearth duty, in her Hollywood bungalow diorama.  First through Fifth, she did commute and hard-shell welding on oil pumps.  Her equipment was archaic. The cumbersome hard shell suit with its jutting bumpers and lights made for a slow commute, and sometimes she’d let herself keel over just to demonstrate how hard it must have been for ancient Angelinos to go to work every day—millions of them. No wonder traffic had often halted for hours at a time.  No matter how many times she read the old texts, data from laser-etched, polymer, digital disc fragments discovered in the silt, she couldn’t really imagine millions of people. Nobody could really imagine millions of people on the highway in hard suits, bumper-to-bumper, stretched up and down the highway heading off to serve in the major industries of the time: making films, drilling wells, making wars, and selling drugs. It was her job to represent all of them.  Sometimes, on special occasions—translate, when people who influenced funding came to inspect the cultural preserve—there would be five or six other hard suits on the highway.  Once, because of her careful and realistic stumbles, she’d been chosen to work with the famous decryptologist, Doctor Argos Chew. For six months, she worked side-by-side with the man who had first figured out how to read the ancient texts. They actually simulated a fender bender, including the road rage firefight and celebratory goat barbeque.  Not today, though. Today, she was on her own like most days; and she was, like most days, going to weld a support spar on a pipe fitting for upstream production of fossil fuels.  She flipped on her brights. The expected circle of white light appeared. An oarfish undulated slowly through her field of vision. Several tube worms retracted into the smooth, pale silt. The rocking, seahorse shape of an oil well pump, her destination, loomed ahead of her. By the numbers, she hit her turn signal, lit up her tail lights, and plodded along the restored off ramp.  “Lori.” The word appeared on the cell phone view of her faceplate display. She held her hand to her head like the texts said she would have.  The words scrolled across her faceplate. “Solo?”  “Yes,” she said. The words appeared in a separate response line. “Who?”  “Aaron here.”  “What?”  “GTTP?”  “Got Time To Play, NOT.” She moved up to her favorite pipe fitting, one that would allow full view of her work if there were any visitors to the observation domes or remote library viewing centers.  While appearing to clean the pipe fitting, she looked over the fusion splitter box at the base of the rocker pump. It provided the power to keep the pump rocking up and down like a steel seahorse bobbing for plankton. Tiny bubbles streamed up from the box, the oxygen by-product of sucking in sea water and separating hydrogen from oxygen.  The pump would rust and turn to silt before that little box gave up trying to convert the ocean into hydrogen fuel. It would run forever if nobody recycled it.  She ignited her torch finger. Her face plate darkened to filter out the blinding glare of her torch, and she set her finger to the pipes.  “Don’t be like that, babe.”  “Your babe, NOT,” she answered. Aaron was not part of the preserve. He was illegal, and he broke in on her channel while she worked. He tried to pretend he was part of the time/place illusion.  “Mall noon Starbucks?”  She almost broke character to laugh. Like he could get into the preserve. Still, he was on channel now, and she was working, and somebody might be watching today.  “Venice Beach noon. Skating. Sorry.”  “Meet sweet. Skate 4 2?”  “Natch.”  “Sweat and wrestle steady?”  “Your business, NOT,” she said. “WORK-ing.”  “Suit hot?” he asked.  She knew where he was going. Phone sex was not part of her work script. No matter that Doctor Argos said all California Girls loved to have phone sex and got paid for it. No matter that she was considered an expert because she had practiced with Argos.  Today, she wanted to be alone. She had hoped for the quiet place she only found in her hard suit while welding.  “Gawd, Aaron,” she said. “1 track mind.”  “Luvly Lori. 1 track. Repeat play 4ever.”  “Buh-bye.” She hung up. Vivaldi ended. Cold, green silence filled her helmet. She switched off her welder and lights and let the darkness of the deeps embrace her. Heartbeats echoed in her ears, and the cold outside her suit made tiny inroads into her flesh.  In the silence, she wondered what Aaron’s life must be like. She wondered why he wanted to talk to a historian like her at all. He went to some trouble to make his illegal calls.  She pretended to adjust her welding finger, as if her reproduction could actually break.  He must have one of those high-stress jobs—likely a Progeny Projection Consultant or a Future Futures Trader—one of those guys who sold his brain early on and lived in the ether fulltime. Maybe he had no body at all.  Phone sex wasn’t so bad, really. Sometimes on Bungalow duty she performed with her polymates. Terry, their norm geek-hubby, was pretty good at it. Anella, their bisubmissive accountant, was a true artist, though she wasn’t recognized for her work because she didn’t have Lori’s credentials.  She finished yaddaing her welder, checked her time out heads-up, and turned back toward the preserve dome complex. Twenty minutes of actual work was all the people of LA were allowed before they had to commute again.  Sometimes, she wished she could stay out forever, and sometimes she thought she might. She had a theory that the Angelinos would have too, and that was why they were only allowed to work for twenty minutes a day.  Going back to the noise and crowds of the domes and towers wasn’t the part of historical research that she liked. Still, she turned. She walked, trudged, and even threw in a potentially traffic snarling fall just in case somebody was watching her. She had to keep her rep as an obsessive for authentic detail.  H&H duty on Sixth: script said she was alone all day. Three-way phone sex at lunch. Waiting for Cableguy. Computer crashing. Neighborhood watch gunfight. Sixth was a no-brainer. Normal Angelino day. Mostly, she got to spend it eating, pacing, and cursing Cableguy—well, at least after ten she got to curse Cableguy.  By ten, she was up, caffeinating, and pacing in her terrycloth robe. She’d brushed her blond hair out so it feathered over her shoulder blades the way it was supposed to. Her sun bleaching was in. She was in the groove, and she hoped somebody was watching today, somebody to make all her research, training, and hard work worth it.  The doorbell rang.  The doorbell wasn’t supposed to ring. Cableguy wasn’t supposed to show up.  She went to the door, stood on bare tiptoes, and peered through the peephole. It might, after all, have been a random attacker. Sometimes, especially if dignitaries were on-site, Admin might budget in a little extra realism.  It was Cableguy. He had the truck. He had the uniform. She didn’t recognize the researcher playing him—a newbie.  Last thing she needed was a newbie to mess up the historical accuracy of her H&H shift. At least he had the hat and toolbox. He was, all-in-all, a great Cableguy: tall and lean; dark, short hair. His sharp jaw-line worked on chewing gum, and practiced glances at his watch and side-to-side made him look impatient.  He rang the doorbell again.  She opened the door.  “Sweet meet,” he said. “Cableguy.”  She caught the name on his uniform tag. “Aaron.” She almost broke character. She almost told him to go away, to get out of the dome and the preserve before he got arrested. Almost, but not quite. Breaking character would only draw criticism no matter how screwy things got. Criticism meant more training, less research, less time alone in her hard suit, less time pacing—less time to herself. Someone might be watching. No matter what, she had to look good, look her period LA part.  She flipped her hair, giggled, and said, “Come in. The sets are over there.” She gestured to her requisite five TV sets—one for each room of the house. They sat in a row on an altar at the far end of her tile-and-plush living room. At the end of the row, they even had a palm-sized, waterproof watchman for the bathroom. In addition to room support, each set represented one of the five major uses: gaming, webbing, dissemination of dissatisfaction, news obsession, and babysitting.  The watchman ran a constant loop of Mouse illusions.  “What’s the problem, ma’am?” he asked.  “Two hundred and fifty-six channels and nothing on.” At least he knew the Cableguy script. He might even make her look good.  “I’ll see what I can do.” He headed to the sets. Tools settled on the carpet, he pulled his pants down far enough to show his butt crack, then he bent and fiddled with the sets.  She began to think maybe Aaron was a professional, an actual historian. He seemed to know what he was doing.  “Can I get you something to drink?” she asked.  “Bottled water would be nice.” He stayed focused on the sets. “Universal remote?”  “Yeah-huh.” She went to the kitchen for a bottle of water. When she came back, he acted like he had fixed the cable feeds. The sets flickered, each with their own representation of life in LA.  She handed him the water.  He smiled.  Fingers touched. He was definitely on script.  During their sex scene, she got her lips up to his ear. “What the hell do you think you’re doing? You can get recycled for this.”  “Research,” he said. “Grad school.”  She gasped and moaned slightly out of time, doing her breathless best to stay in character.  Afterward, nestled up against him, waiting for the five minutes before he would play out the “Got more homes to service” end to their scene, she whispered, “You aren’t authorized, are you?”  “Not.” He pulled her closer to him, tighter and warmer.  Two days later, on First, Argos told Lori she had a special assignment, but she hadn’t been given a script. She’d been told authenticity would depend on surprise. She was coming off shift and stripping out of her hard suit when a camera crew arrived. It was a full-on truck and uplink unit with roving cameramen and a blue-suited Talentbimbo replica. Lori was surprised. A Warhol Moment with a full-unit vid crew meant serious funding. Somebody had pulled strings.  Talentbimbo, a Sino-Hispanic homogenized, accent-free woman with silky, shiny, bouncy-flow hair stepped up and said, “Action.” Talentbimbo pushed a long-handled mike between them. “Lori Welder,” she said, “Do you have any comment on the capture of the Cableguy Rapist?”  She finished racking her suit. She hoped someone was watching, someone could see how cool she was, how authentic, how well she played for the crew.  This wasn’t planned history, but it was sure as hell funded. Good work could mean bigger things for her. More solitude. “No comment,” she said.  “Our sources suggest you had secret communications with him.”  She froze, suppressing a grin. Somebody had been watching.  “Who are your sources?” Lori asked.  “We have transcripts of your cell phone sex addiction extra-polyamorous affair.” Talentbimbo twisted her perfect, plastic face into a smirk. “Lori Welder, do you care to comment now?”  She squared off with Talentbimbo. “He isn’t a rapist.”  “He used a scanner to listen to dispatch calls, wore the Cableguy uniform, made a replica of a Cableguy truck, and used the public trust in Cableguy to gain access to the homes of young women like yourself.”  “Aaron would never rape anyone,” she said. “He’s a good man and a great Cableguy.”  “Now you admit that you knew him?”  She remembered a political axiom from her period polisci class. Denial causes downfall. If caught, become the victim to gain public sympathy. “Of course,” she said. “I knew him. I love him.”  “Well.” Talentbimbo pulled the mike back. “There it is. Another victim of this monster, but this one claims she loved him.”  Lori grabbed the mike. “Aaron!” she exclaimed. “Baby, if you can hear me, I’ll wait for you. I swear it. I’ll write. I’ll visit! I love you, Baby.”  Talentbimbo made a show of wrestling for the mike. She made the cut sign several times, then the lights went dim. Talentbimbo gave Lori a very real dirty look.  Lori realized she had adlibbed right off the map of her colleague’s education and experience. She squared her shoulders, made a show of standing up straight, then strode past the news crew. Passing Talentbimbo, she whispered, “Good girls who love bad boys.”  The news lady lit up. She had a new line of research, and she knew it. Lori had a new stage and likely some better diorama work coming up. No doubt, Aaron would get his degrees, and if she played things right they’d pull a grant for conjugal visits, letter reproduction, and maybe even an escape and helicopter chase.  She hoped someone was watching. History didn’t get more real than this. Eric Witchey's fiction has appeared nationally and internationally in magazines and anthologies. He has published in multiple genres under several names. His how-to articles have appeared in The Writer Magazine, Writer's Digest Magazine, Writer's Northwest Magazine, Northwest Ink, and in a number of on-line publications. His fiction has won recognition from Writers of The Future, New Century Writers, Writer's Digest, and www.ralan.com. When not teaching or writing, he restores antique HO locomotives or tosses bits of feather and pointy wire at laughing trout.", "text": "2370 words, short story\nCan You See Me Now?\nTwo miles of sea water overhead pretty well filtered out the ill effects of sunlight and mankind. Alone in her hard suit, lights on for safety, Lori’s boots settled and held in the pale, diatomaceous silt cover over the San Bernardino Highway. Helmet speakers trickled distant Vivaldi into her ears, and her feeder tube pumped nutrients in accordance with strict protocols for preservation of cultural authenticity. She’d gotten the job because she fit the restored hard suit and because her body was a perfect museum piece, a monument to the ancient submerged civilization of Los Angeles.\nShe was forty minutes out on her commute after leaving suburb dome one. She knew the route well enough. She walked it every day of the week except Sixth and Seventh. Evenings, Sixth, and Seventh she did H&H, Home-and-Hearth duty, in her Hollywood bungalow diorama.\nFirst through Fifth, she did commute and hard-shell welding on oil pumps.\nHer equipment was archaic. The cumbersome hard shell suit with its jutting bumpers and lights made for a slow commute, and sometimes she’d let herself keel over just to demonstrate how hard it must have been for ancient Angelinos to go to work every day—millions of them. No wonder traffic had often halted for hours at a time.\nNo matter how many times she read the old texts, data from laser-etched, polymer, digital disc fragments discovered in the silt, she couldn’t really imagine millions of people. Nobody could really imagine millions of people on the highway in hard suits, bumper-to-bumper, stretched up and down the highway heading off to serve in the major industries of the time: making films, drilling wells, making wars, and selling drugs. It was her job to represent all of them.\nSometimes, on special occasions—translate, when people who influenced funding came to inspect the cultural preserve—there would be five or six other hard suits on the highway.\nOnce, because of her careful and realistic stumbles, she’d been chosen to work with the famous decryptologist, Doctor Argos Chew. For six months, she worked side-by-side with the man who had first figured out how to read the ancient texts. They actually simulated a fender bender, including the road rage firefight and celebratory goat barbeque.\nNot today, though. Today, she was on her own like most days; and she was, like most days, going to weld a support spar on a pipe fitting for upstream production of fossil fuels.\nShe flipped on her brights. The expected circle of white light appeared. An oarfish undulated slowly through her field of vision. Several tube worms retracted into the smooth, pale silt. The rocking, seahorse shape of an oil well pump, her destination, loomed ahead of her. By the numbers, she hit her turn signal, lit up her tail lights, and plodded along the restored off ramp.\n“Lori.” The word appeared on the cell phone view of her faceplate display. She held her hand to her head like the texts said she would have.\nThe words scrolled across her faceplate. “Solo?”\n“Yes,” she said. The words appeared in a separate response line. “Who?”\n“Aaron here.”\n“What?”\n“GTTP?”\n“Got Time To Play, NOT.” She moved up to her favorite pipe fitting, one that would allow full view of her work if there were any visitors to the observation domes or remote library viewing centers.\nWhile appearing to clean the pipe fitting, she looked over the fusion splitter box at the base of the rocker pump. It provided the power to keep the pump rocking up and down like a steel seahorse bobbing for plankton. Tiny bubbles streamed up from the box, the oxygen by-product of sucking in sea water and separating hydrogen from oxygen.\nThe pump would rust and turn to silt before that little box gave up trying to convert the ocean into hydrogen fuel. It would run forever if nobody recycled it.\nShe ignited her torch finger. Her face plate darkened to filter out the blinding glare of her torch, and she set her finger to the pipes.\n“Don’t be like that, babe.”\n“Your babe, NOT,” she answered. Aaron was not part of the preserve. He was illegal, and he broke in on her channel while she worked. He tried to pretend he was part of the time/place illusion.\n“Mall noon Starbucks?”\nShe almost broke character to laugh. Like he could get into the preserve. Still, he was on channel now, and she was working, and somebody might be watching today.\n“Venice Beach noon. Skating. Sorry.”\n“Meet sweet. Skate 4 2?”\n“Natch.”\n“Sweat and wrestle steady?”\n“Your business, NOT,” she said. “WORK-ing.”\n“Suit hot?” he asked.\nShe knew where he was going. Phone sex was not part of her work script. No matter that Doctor Argos said all California Girls loved to have phone sex and got paid for it. No matter that she was considered an expert because she had practiced with Argos.\nToday, she wanted to be alone. She had hoped for the quiet place she only found in her hard suit while welding.\n“Gawd, Aaron,” she said. “1 track mind.”\n“Luvly Lori. 1 track. Repeat play 4ever.”\n“Buh-bye.” She hung up. Vivaldi ended. Cold, green silence filled her helmet. She switched off her welder and lights and let the darkness of the deeps embrace her. Heartbeats echoed in her ears, and the cold outside her suit made tiny inroads into her flesh.\nIn the silence, she wondered what Aaron’s life must be like. She wondered why he wanted to talk to a historian like her at all. He went to some trouble to make his illegal calls.\nShe pretended to adjust her welding finger, as if her reproduction could actually break.\nHe must have one of those high-stress jobs—likely a Progeny Projection Consultant or a Future Futures Trader—one of those guys who sold his brain early on and lived in the ether fulltime. Maybe he had no body at all.\nPhone sex wasn’t so bad, really. Sometimes on Bungalow duty she performed with her polymates. Terry, their norm geek-hubby, was pretty good at it. Anella, their bisubmissive accountant, was a true artist, though she wasn’t recognized for her work because she didn’t have Lori’s credentials.\nShe finished yaddaing her welder, checked her time out heads-up, and turned back toward the preserve dome complex. Twenty minutes of actual work was all the people of LA were allowed before they had to commute again.\nSometimes, she wished she could stay out forever, and sometimes she thought she might. She had a theory that the Angelinos would have too, and that was why they were only allowed to work for twenty minutes a day.\nGoing back to the noise and crowds of the domes and towers wasn’t the part of historical research that she liked. Still, she turned. She walked, trudged, and even threw in a potentially traffic snarling fall just in case somebody was watching her. She had to keep her rep as an obsessive for authentic detail.\nH&H duty on Sixth: script said she was alone all day. Three-way phone sex at lunch. Waiting for Cableguy. Computer crashing. Neighborhood watch gunfight. Sixth was a no-brainer. Normal Angelino day. Mostly, she got to spend it eating, pacing, and cursing Cableguy—well, at least after ten she got to curse Cableguy.\nBy ten, she was up, caffeinating, and pacing in her terrycloth robe. She’d brushed her blond hair out so it feathered over her shoulder blades the way it was supposed to. Her sun bleaching was in. She was in the groove, and she hoped somebody was watching today, somebody to make all her research, training, and hard work worth it.\nThe doorbell rang.\nThe doorbell wasn’t supposed to ring. Cableguy wasn’t supposed to show up.\nShe went to the door, stood on bare tiptoes, and peered through the peephole. It might, after all, have been a random attacker. Sometimes, especially if dignitaries were on-site, Admin might budget in a little extra realism.\nIt was Cableguy. He had the truck. He had the uniform. She didn’t recognize the researcher playing him—a newbie.\nLast thing she needed was a newbie to mess up the historical accuracy of her H&H shift. At least he had the hat and toolbox. He was, all-in-all, a great Cableguy: tall and lean; dark, short hair. His sharp jaw-line worked on chewing gum, and practiced glances at his watch and side-to-side made him look impatient.\nHe rang the doorbell again.\nShe opened the door.\n“Sweet meet,” he said. “Cableguy.”\nShe caught the name on his uniform tag. “Aaron.” She almost broke character. She almost told him to go away, to get out of the dome and the preserve before he got arrested. Almost, but not quite. Breaking character would only draw criticism no matter how screwy things got. Criticism meant more training, less research, less time alone in her hard suit, less time pacing—less time to herself. Someone might be watching. No matter what, she had to look good, look her period LA part.\nShe flipped her hair, giggled, and said, “Come in. The sets are over there.” She gestured to her requisite five TV sets—one for each room of the house. They sat in a row on an altar at the far end of her tile-and-plush living room. At the end of the row, they even had a palm-sized, waterproof watchman for the bathroom. In addition to room support, each set represented one of the five major uses: gaming, webbing, dissemination of dissatisfaction, news obsession, and babysitting.\nThe watchman ran a constant loop of Mouse illusions.\n“What’s the problem, ma’am?” he asked.\n“Two hundred and fifty-six channels and nothing on.” At least he knew the Cableguy script. He might even make her look good.\n“I’ll see what I can do.” He headed to the sets. Tools settled on the carpet, he pulled his pants down far enough to show his butt crack, then he bent and fiddled with the sets.\nShe began to think maybe Aaron was a professional, an actual historian. He seemed to know what he was doing.\n“Can I get you something to drink?” she asked.\n“Bottled water would be nice.” He stayed focused on the sets. “Universal remote?”\n“Yeah-huh.” She went to the kitchen for a bottle of water. When she came back, he acted like he had fixed the cable feeds. The sets flickered, each with their own representation of life in LA.\nShe handed him the water.\nHe smiled.\nFingers touched. He was definitely on script.\nDuring their sex scene, she got her lips up to his ear. “What the hell do you think you’re doing? You can get recycled for this.”\n“Research,” he said. “Grad school.”\nShe gasped and moaned slightly out of time, doing her breathless best to stay in character.\nAfterward, nestled up against him, waiting for the five minutes before he would play out the “Got more homes to service” end to their scene, she whispered, “You aren’t authorized, are you?”\n“Not.” He pulled her closer to him, tighter and warmer.\nTwo days later, on First, Argos told Lori she had a special assignment, but she hadn’t been given a script. She’d been told authenticity would depend on surprise. She was coming off shift and stripping out of her hard suit when a camera crew arrived. It was a full-on truck and uplink unit with roving cameramen and a blue-suited Talentbimbo replica. Lori was surprised. A Warhol Moment with a full-unit vid crew meant serious funding. Somebody had pulled strings.\nTalentbimbo, a Sino-Hispanic homogenized, accent-free woman with silky, shiny, bouncy-flow hair stepped up and said, “Action.” Talentbimbo pushed a long-handled mike between them. “Lori Welder,” she said, “Do you have any comment on the capture of the Cableguy Rapist?”\nShe finished racking her suit. She hoped someone was watching, someone could see how cool she was, how authentic, how well she played for the crew.\nThis wasn’t planned history, but it was sure as hell funded. Good work could mean bigger things for her. More solitude. “No comment,” she said.\n“Our sources suggest you had secret communications with him.”\nShe froze, suppressing a grin. Somebody had been watching.\n“Who are your sources?” Lori asked.\n“We have transcripts of your cell phone sex addiction extra-polyamorous affair.” Talentbimbo twisted her perfect, plastic face into a smirk. “Lori Welder, do you care to comment now?”\nShe squared off with Talentbimbo. “He isn’t a rapist.”\n“He used a scanner to listen to dispatch calls, wore the Cableguy uniform, made a replica of a Cableguy truck, and used the public trust in Cableguy to gain access to the homes of young women like yourself.”\n“Aaron would never rape anyone,” she said. “He’s a good man and a great Cableguy.”\n“Now you admit that you knew him?”\nShe remembered a political axiom from her period polisci class. Denial causes downfall. If caught, become the victim to gain public sympathy. “Of course,” she said. “I knew him. I love him.”\n“Well.” Talentbimbo pulled the mike back. “There it is. Another victim of this monster, but this one claims she loved him.”\nLori grabbed the mike. “Aaron!” she exclaimed. “Baby, if you can hear me, I’ll wait for you. I swear it. I’ll write. I’ll visit! I love you, Baby.”\nTalentbimbo made a show of wrestling for the mike. She made the cut sign several times, then the lights went dim. Talentbimbo gave Lori a very real dirty look.\nLori realized she had adlibbed right off the map of her colleague’s education and experience. She squared her shoulders, made a show of standing up straight, then strode past the news crew. Passing Talentbimbo, she whispered, “Good girls who love bad boys.”\nThe news lady lit up. She had a new line of research, and she knew it. Lori had a new stage and likely some better diorama work coming up. No doubt, Aaron would get his degrees, and if she played things right they’d pull a grant for conjugal visits, letter reproduction, and maybe even an escape and helicopter chase.\nShe hoped someone was watching. History didn’t get more real than this.\nEric Witchey's fiction has appeared nationally and internationally in magazines and anthologies. He has published in multiple genres under several names. His how-to articles have appeared in The Writer Magazine, Writer's Digest Magazine, Writer's Northwest Magazine, Northwest Ink, and in a number of on-line publications. His fiction has won recognition from Writers of The Future, New Century Writers, Writer's Digest, and www.ralan.com. When not teaching or writing, he restores antique HO locomotives or tosses bits of feather and pointy wire at laughing trout.", "source": "https://clarkesworldmagazine.com/witchey_09_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Can You See Me Now? by Eric M. Witchey"}