{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Naomi Kritzer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9nBWHMZTIIVHx+jsqJnfiX2cs/A=", "id": null, "license": null, "comments": "", "raw_text": "10910 words, novelette  Monster  2021 Finalist: Hugo Award for Best Novelette  No one at the Guiyang airport speaks English. I have the UTranslator app on my phone, and before I left my colleague Jeanine said that it had worked fine for her. But she’d also said she’d never had trouble finding an English speaker in China. And her trips were to Shanghai and Beijing.  “I’m going to the Guizhou province,” I’d said.  “Where?” she said, pulling out her phone to look up a map.  “Like the Oklahoma of China,” I said. Southern-ish, rural, inland, poor. Not where the foreign tourists usually go.  At the baggage claim, there’s a yellow lab sniffing bags, trotting happily back and forth along the conveyor belt as it snakes into the airport. The dog looks deeply pleased with his work, and I am startled to see him sit down on the belt next to a suitcase, which is the standard signal dogs give when they’re flagging something. I look around, wondering if I’m about to see an arrest. No one seems perturbed. Also, no one claims the bag; a short time later it winds past me and I see that its wheels are wrapped and it has no handle. The suitcase is a decoy, riding the belt endlessly to give the dog something to react to on days with no would-be smugglers. I wonder what they put inside it.  My suitcase elicits no response from the dog. I’m irrationally relieved.  In Guiyang, the responses from the UTranslator app get me a lot of very confused looks unless I keep it to single-word requests. “Bathroom?” gets me pointed in the right direction. “Newspaper?” gets me to a newsstand. Of course, all the papers for sale are in Chinese and I can’t tell which are going to be filled with news from Beijing and Shanghai and which might have local stories. I buy two papers anyway.  “Where can I hire a car to take me to Danzhai?” is not a successful sort of query but “taxi?” eventually gets me to the right spot. It takes time to make it clear that I really do want to go all the way to Danzhai (it’s two-and-a-half hours away), but we finally set off.  I didn’t sleep well on the plane, and I very much want to sleep in the car, but I’m too keyed up. I stare out at the wide smooth highway that tunnels straight through the hills and bridges the valleys, trying to catch glimpses of China beyond the guardrails, barely absorbing anything.  All I want from the newspapers is the answer to one question: have there been any more bodies? I hover my phone over the characters, slowly parsing out headlines about trade agreements, a train accident, a pair of extremely old identical twins who are celebrating their birthday.  “Why are you going to Guizhou?” Jeanine had asked.  “Because no one I know has ever been there,” I said. This was a lie. I’m here to find Andrew.  I met Andrew my sophomore year of high school.  I was a nerd, which back in the 1980s was the actual opposite of cool (as opposed to now, when it’s simply another variety of it). I spent middle school being bullied for my preference for books over people and sweatpants over jeans. Any time I stopped for a drink from the water fountain, my classmates would yank my pants down; the school administrators all insisted that if I just ignored them instead of crying, this would stop. When I started high school, I caved and started wearing blue jeans, even though I hated the way the waistband dug into my sides when I sat.  Freshman year of high school, I spent my lunch periods eating with a few girls I called my friends, who’d more-or-less tolerated me in middle school. Sometimes we hung out on weekends at the mall, where the other girls would coo over “adorable” clothing and I’d self-consciously stroke the scratchy fabric and pretend I wished my mother would give me a clothing allowance instead of just buying me the same L.L.Bean turtlenecks again and again because she knew they had soft tags and I’d wear them.  Andrew was in both my chemistry class and my precalculus class, and he noticed that I spent a big part of the day reading books under my desk. He started asking me each morning what I’d brought to read. Initially I wasn’t sure whether his curious tone was the fake-curious voice other kids sometimes used right before they turned into complete assholes. After multiple classes passed and he didn’t snatch my books away to wipe a booger on them or anything like that, I started feeling a bit less wary. My books were all science fiction, and all came from my neighborhood library, which mostly meant Isaac Asimov, Piers Anthony, and all the older Anne McCaffrey.  “You should read this,” Andrew said one day, and handed me a paperback. “It’s mine. Don’t crack the spine. You’ll like it.”  It was a copy of Neuromancer by William Gibson. The next day, I sat with him at lunch.  Danzhai Wanda Tourist Village is possibly the strangest place I’ve ever been.  Everything around me looks quaint and old, but in fact it was built from scratch just a few years ago to showcase local ethnic cultures and attract tourists to the area. Local people are employed to wear traditional costumes, walk the street playing traditional instruments, make and sell traditional crafts. It reminds me of a Renaissance festival.  Many of the women in traditional clothing are wearing silver hats with delicately formed butterflies on the top and a jingly fringe right above their eyes. Other women wear their long hair scraped up high into something almost like a bouffant, but with silver ornaments and oversized flowers pinned in. They wear beautifully embroidered jackets and skirts, and silver belts, and large silver necklaces that look like someone cut a circle and hammered the silver out into a crescent. Everything jingles as they move. I wonder if the metal jewelry is heavy, if the clothing is uncomfortable, how much is prescribed, and how much is left up to them.  The men and women minding the shops are mostly wearing more ordinary clothes, although a few have the hairstyle with a smaller ornament pinned in. I can’t tell whether the tourists shopping in the stores are from other parts of China, or just other parts of Guizhou.  UTranslate doesn’t work any better here than at the airport. Fortunately, the hotel has a sign in English over the door telling me it’s a hotel, and “Room?” is easy enough to understand.  I know I’m not going to find Andrew today. It’s going to take time. Today my job is to check into the hotel, not nap, and adjust to the time change. This would all be easier if I’d arrived in early evening rather than midmorning. I resolutely leave my suitcase on the bed instead of lying down myself and go back outside.  At the end of the street there’s a public square, and three young women have set up a table with carved drinking horns and little bowls of what I’m pretty sure is a potent alcoholic beverage. Two have the silver hats; the third has the hair ornaments. They are beckoning visitors over and feeding people the drink out of the horns. I am quickly jostled up to the front, where one of the women smiles and sings a song as she pours the drink into my mouth.  You could poison a lot of people this way I think as I swallow obediently and then wonder what sort of person I am to even think such a thing. The alcohol is strong, and I hope it’s not rude if I stop drinking. The ladies don’t stop smiling when I pull my head back, so if I’m being rude, they’re too polite to mention it.  I like meeting new people, one of the affirmations they made me repeat back when I went to therapy years ago, pops into my head. “Xie xie,” I say, the one word of Chinese I know: thank you.  “Thank you,” I said to Andrew when I gave him back the book. “It was great.” I’d brought along one of my own paperbacks to lend him, one I’d bought on my own rather than checking it out from the library—Startide Rising.  “If you used a bookmark instead of putting your books facedown they’d last longer,” he told me when he finished it.  “Sometimes I dog-ear the pages,” I said.  “You do realize that makes you an actual monster.”  “It’s my book! I can fold down corners if I want!” Sometimes I’d fold down corners just so I could easily get back to a particular page to reread it. I didn’t tell Andrew that I occasionally even did that with library books. Just the older library books I checked out again and again, though—especially the story collections from the bottom shelf. Not the new books.  Andrew had a girlfriend, a goth girl named Nadine who went to the other school, and she had a whole cluster of nerdy friends. Suddenly on the weekends I had something to do, and when Star Trek IV came out I had people to see it with. Since none of us had much money, we spent most of our weekend afternoons haunting local parks or the family rooms of the kids with more absent parents. Having an entire group of friends was a shocking novelty to me. The friends I’d had before were willing to put up with how weird I was. Never before had I had friends who were weird with me.  Andrew was my closest friend in the group: he loaned me books and comics, made movie recommendations. I rented Alien on video because he’d recommended it so highly. Also Blade Runner. He was brilliant but lazy, sliding by with adequate grades because he didn’t want to do the work. “High school is pointless,” he said. “I already know everything they’re telling us. There will actually be things for me to learn once I get to college.”  There were a lot of on-again off-again romances in the group—two kids would get together, spend a couple of weekends holding hands (or making out while the rest of us yelled “get a room!”), amicably break up.  When Andrew and Nadine broke up, Nadine disappeared from the group.  Months later, I ran into Nadine waiting tables at a diner near the U. I was by myself, with a stack of books and homework and $10 for bottomless coffee and a big plate of fries. “Nadine!” I said, delighted, when she came to my table. “I haven’t seen you in forever!”  “Oh, hi,” she said, giving me a faint smile. “Yeah, guess it’s been a while.”  “How are you? I’ve missed you.”  “You have? Huh, okay.” She took out her pad. “I’m actually working, so . . . do you know what you want?”  I gave her my order and let her take my menu and tried to shake off my hurt feelings. She was busy; I was a customer; I didn’t want to be a pest. I spread out my Spanish vocabulary cards and worked on them as I dipped fries into ketchup one by one and ate them, flipping them around so I didn’t double-dip even though I was the only one at the table. She came around twice to refill my coffee and water, not making eye contact, and finally stopped, my mug still in her hand, and said, “Are you still hanging out with Andrew?”  “Yeah,” I said, a little hesitant. He had a new girlfriend. Was she jealous? Was that what this was about? I wasn’t the one dating him. I wasn’t into him that way.  “You know he has a dead rabbit in his freezer? Or did. He was going to dissect it.”  Nadine clearly expected a response, but my main question was, was she saying he killed the rabbit or did he just find a dead one, because . . . I mean, we cut up animals in advanced biology. They were from a supply house, of course, not picked up off the street, but . . . I didn’t know how disturbed to be about the whole idea.  “He wanted me to watch,” Nadine added.  “Ugh,” I said, sympathetically.  “He talked about wanting to know what everything looks like on the inside. Everything. Just . . . I don’t know, Cecily. Be careful, I guess.”  “Is that why you disappeared?” I asked.  She gave me a look that I couldn’t identify. Pity? Exasperation? “Yeah, Cecily,” she said, flatly. “That’s why I disappeared. Do you need anything else or should I bring you the check?”  I had been planning to get a slice of pie, but there was something about Nadine’s glare that made me antsy. I decided to just go. “Check,” I said. “Thanks.”  She took my money up to the register and brought me the change. “Keep it,” I said.  “Thanks,” she said, and put the change in her apron. And then stood there, chewing on her lip and staring at me. “Don’t be alone with him,” she blurted out, finally, as I started to gather up my books.  “Why?” I asked.  “You just don’t want to be alone with him. Trust me.”  I’d been alone with him dozens of times, and nothing bad had ever happened to me. “Okay,” I said, not arguing. “Thanks.”  I didn’t tell Andrew I’d run into Nadine. The next time I wanted to get French fries and coffee and a booth to do homework while I was near the U, I chose a different diner.  To order in the Danzhai restaurants, I point at things other people are eating. I have a whole roast fish, still on the bone, in a rich sauce; I have eggplant with ground pork in a sauce that runs red with chilies and oil; I have plates of some sort of green vegetable that looks vaguely like turnip greens but with florets.  Dozens of vegetables came from the same wild herb, Brassica oleracea; we selected for flowers to get broccoli, buds to get brussels sprouts, leaves to get cabbage, roots to get kohlrabi. If this is Chinese broccoli, which seems likely, that’s yet another cultivar of the same plant. I wonder how long it takes to go from B. oleracea to ornamental kale through old-fashioned trait selection. I eat it with chopsticks, thinking about what steps I’d go through to get from ornamental kale to cauliflower in a day, using gene editing. Leaves, flowers, color, roots . . . I wonder how much I’d forget to do, what the results would be. I can’t think of any new B. oleracea cultivars that gene editing has brought us—maybe because we already had every variation that seemed like a good idea to anyone, developed the old-fashioned way.  We’ve always done this, some shadow in my mind whispers. I shake off the thought.  When I eat at the hotel, I get the same waitress again and again, not because she speaks English but because she’s a little less easily frustrated by a customer who doesn’t speak any Chinese. “You should just bring me something you think I’ll like,” I tell her. “I’m not fussy.” UTranslate balks at this, so I try the word “anything,” and then “you choose for me,” with an expansive gesture.  She brings me out a soup, with fish chunks bobbing in it and slices of tomato in a rich red broth. “Perfect,” I say, and she smiles back, clearly pleased with my reaction. A little while later she brings out a glass of black tea. The tea farm is somewhere near here, and I can see the leaves unfurling in the water like those children’s toys that go from a tiny little capsule to a full-sized giraffe-shaped sponge when you drop them in water.  There is a theater in the tourist village that hosts a daily performance reenacting the legend of the Golden Pheasant Girl. This is apparently a well-known local legend. There’s a statue outside of a woman mid-transformation, and on a hill nearby there’s a metal statue of a golden bird. Actual male golden pheasants are very showy, with feathers shading yellow to gold to red. The females are the dull brown of most girl birds.  I buy a ticket to the show. They gesture for me to wait and spend five minutes digging out an English-language program that includes a summary of what I’m about to watch.  The buildings here are mostly unheated, and the theater is as cold as everywhere else. There’s a handy little plastic clapper on each armrest, though, so I can use that to applaud while keeping my gloves on.  The stage itself has video screens built into the sides and along the back, which they use for some of the theatrical magic. There’s a lot of dance and song, puppetry, smoke effects. In the story, the people flee the losing side of a war, crossing a giant river, and resettle somewhere that they are safe but have no food. There’s a beautiful wedding sequence and then both the man and the women leave to seek out a magical tree that gives the seeds of every known plant.  In the staging, the tree is silver and resembles the hats the women here wear; I’m not sure if those hats are supposed to symbolize the tree or vice versa because the program doesn’t tell me. Both the man and the woman reach the tree and are told that one of them will be given the gift of the seeds but the other will be demanded as a sacrifice.  Both try to be the sacrifice; the man is pushed back as the woman’s sacrifice is accepted. She ascends to the back center of the backdrop and then raises her arms to be transformed into wings; lights, video, and flying wires are used to change her into the golden pheasant for the performance, although she looks rather more like a phoenix. The man, temporarily forgotten, regains the spotlight as she flies away and he’s blown back by the wind from her wings. Weeping, he takes the seeds back to his people.  I find myself thinking about how you would transform a human woman into a golden pheasant with gene editing and wrench my thoughts away from that particular abyss. Instead, the ballet over, I find a shop in Danzhai that has newspapers and buy another stack, then take them back to my room and spread them out on my bed to hunt through for stories about bodies. This time I find one, but it’s a domestic murder-suicide in Xi’an and nothing about it sounds particularly mysterious. I wonder how much I’m missing just from UTranslate’s obstinacy.  Combing through newspapers fills me with tension because it’s simultaneously passive and time-consuming. The whole trip is like that: passive and time-consuming, and I’m on edge, and don’t know what to do. They were so confident that Andrew would seek me out, if I came. I am less and less sure that they were right.  When I check my e-mail one last time before I go to bed, I have an e-mail from a mysterious address that says, Just like the story, sometimes sacrifice is required, Cecily, if everyone else is to survive.  I reply immediately: “Where are you?”  “Andrew? Andrew!”  We were at Andrew’s house, in the family room, watching a James Bond movie. I remember it was a James Bond movie, but not which movie. His mother stormed in and furiously shut off the TV. “A C?” she snapped. “A C minus?”  “I guess my report card came,” he said, staring out the window and not looking at either his mother or at me.  “If you would just do the homework and turn it in—”  “I already know everything that’s on the homework. They want me to do the same problem 40 times in a row until I die from tedium.”  “I’m sorry your schoolwork does not hold your interest,” his mother snapped, “but my job is not one hundred percent intellectually stimulating, either, and if I decided to just never go to boring meetings I would be fired.”  Andrew’s family was Chinese, but Chinese American for a number of generations. He liked to describe his mother as a grades-obsessed dragon lady. Even though I was generally on Andrew’s side, I knew this wasn’t fair. When it came to grades, his mother was basically exactly like my mother. My mom threw a fit when I let my grades slip in middle school. (I was trying to fit in. It didn’t work.)  “What is it going to take to get you to work up to your potential?” his mom demanded. “Or at least in the near vicinity of your potential? The same metropolitan area as your potential?”  “Maybe classes that weren’t so boring,” Andrew mumbled. “I need to walk Cecily home, I’ll be back in a few.” I finished gathering up my coat and Andrew slipped out the door after me.  “Sorry,” I said, uselessly, as we walked back to my house, six blocks away.  “Not your thing to be sorry for,” he said. “My mom is my mom. I’ll never be the kid she wanted.”  I thought about that as we walked, whether I was the kid my parents had wanted. The summer I was ten, my father tried to get me to learn to play tennis. He took me to the tennis court on the weekends and he signed me up for classes. I went to the classes and swung my racket and practiced with my father and remained absolutely terrible at tennis. At the end of the summer he let me quit. Would he have preferred a kid who was good at tennis? Probably, actually. But he didn’t yell at me about it. He gave away my racket and never brought it up again.  Possibly my mother would have liked a girl who liked wearing uncomfortable pretty clothing. When I was little she would buy me dresses made from stiff, crunchy fabrics with lace on them. I remembered one enormous fight when I was eight: she’d wanted me to dress up for a family wedding. Her promises of wedding cake and a Shirley Temple children’s cocktail got me as far as the car; when I started crying and asking to turn around because the seams itched, she swore that if I just ignored the itching, it would go away. This was a lie, just like with teasing. When we got to the church, I sat down sobbing on the big stone steps leading to the front door and refused to go inside. My father wound up taking me home.  There was a park about halfway between my house and Andrew’s house, a weird little former quarry with a stone formation called a “council ring” that looked like a good place to hold a very outdoorsy meeting, or possibly sacrifice a goat since there was a big stone in the middle. We sat down on the low stone wall of the ring. Andrew smoked a clove cigarette, which his mother would have been even more furious about than his grades.  “Sorry we didn’t get to finish the movie.”  “I can kind of guess how it went.”  “Sure, but we missed some good action sequences.”  I shrugged. “It’s not that big a deal. Are you going to be OK when you get home?”  “There’ll be a lot more yelling, but it’ll stop once I tell her I’ll work harder in school, which of course I won’t, but she won’t know that.”  I laughed. Andrew always made me laugh.  “I think you’re the only person who understands me,” he said.  “I feel the same way,” I said. “I mean, that you’re the only person who understands me, not that I’m the only person who understands you.”  “I knew what you meant.”  “Well, that stands to reason, right?”  I was angry at his mother, and a little bit at him—would it actually kill him to do his homework?—and I felt awkward and embarrassed at having seen the fight, but the conversation at the council ring felt like a grace note in the day, anyway.  “Say, do you think you could let me copy the precalculus homework?” Andrew asked. “In the mornings, before we go to class? Just to get my mother off my back. I don’t care about my grades.”  “Sure,” I said. “No problem.”  In the morning, my e-mail has an e-mail from a friend back in the US asking if I’m going to see the Great Wall of China while I’m here. I send back a note offering probably-too-much explanation of Chinese geography: I am currently as far from the Great Wall of China as she is from the Grand Canyon. She lives in Portland, Oregon. If someone came to visit her in Portland, would she suggest they hit the Grand Canyon while they were there? China, like the US, is very big. I look at my block of text, delete it, and say, “it would be about a 17-hour drive from where I am. So, no.”  There’s nothing from Andrew. I go downstairs for breakfast and load up my plate with two fried eggs and four of the Chinese-style steamed rolls, baozi. I spot a fellow westerner across the room; he’s the first white person I’ve seen since I arrived in Danzhai. He looks either jet lagged or extremely hungover. Possibly both.  After I’ve finished breakfast I check my e-mail again and debate whether to send another message to the mystery address. I decide it’s a little too soon and go out to walk around Danzhai again.  I brought Chinese currency with me—a stack of pink bills with Mao smiling benignly on them. Mao is a lot less popular in China than he once was, but he’s still on the money. I suppose this is also true of George Washington in the US. Anyway, having brought money, it seems reasonable to spend some.  I like the long, quilted coats that the clothing stores are selling, and the fabric is soft, but they’re all sewn for smaller women with narrower shoulders than I have. Even the vests don’t fit me properly. I admire a jointed silver fish at a jewelry store, embroidered purses, handmade bird cages that are lovely and interesting but would be very difficult to get home. They do batik here, all dyed in a blue dye that’s almost the same shade as denim, and I buy a batik tablecloth.  At that night’s dinner at the hotel, the other westerner is looking less hungover and catches my eye. “Join me?” he invites, in British-accented English. I pull up a chair across from him. “I’m Tom Lewis.”  “Cecily,” I say, and we shake hands.  “What brings you to Danzhai?”  “I could ask you the same question. I wanted to go somewhere unusual, somewhere no one I knew had ever been.”  “You picked well, then. I’m a travel writer. Not sure if I’m going to write up this place or not; it’s a bit of a bore.”  I bristle instinctively, even though I haven’t found what I’m looking for. “What do you find interesting?”  He rattles off a dozen cities I’ve never been to and tells me about the night life in Kuala Lumpur. I think he’s trying to impress me. I wonder if he tries to impress everyone he meets, or just women, or just white women? He snaps his fingers at the waitress and I cringe, worried that the waitress is going to think that we’re together. He orders something in Chinese and says to me, “what are you having?”  I tell him I’d like the whole fish, and he translates that into Chinese for me.  “Why doesn’t UTranslate work here?” I ask.  “The makers are having some sort of fight with China’s Great Firewall,” he says. “You should’ve come last week, the problem it’s having is new.”  “Is there another app that will work?”  “The official Chinese app is having some sort of dispute with the keepers of the app store, so no. What is it you’re planning to do tomorrow? Perhaps I can be of assistance.”  What I want to say is, I’d rather get by with a Chinese-English paper dictionary from the 1980s than drag along someone who snaps his fingers at waitstaff but I never actually have the guts to be quite that confrontational, so I just laugh awkwardly and say nothing.  “Have you gone to see the prison?” he asks.  “The what?” I say, not entirely certain I’ve heard correctly.  “There’s a former mercury mine about a half hour from here. It’s been used as a movie set a few times. There’s an abandoned town to one side, an abandoned prison to the other. Hire a driver and you can give yourself a tour. I mean, you’ll have to get out once you’re there. The roads are all overgrown. It’s picturesque, if you like that sort of thing. My friend Percival Abbot—you might know of him?—did a photography exhibition on it a few months back.”  Our food arrives and we have an awkward meal together. I have not heard of Percival Abbot, although a quick Internet search when Tom steps away from the table confirms he is, in fact, a photographer whose website telegraphs that I really should have heard of him.  “Are you thinking of going to soak in the spa later?” Tom asks as we’re finishing dinner.  “No,” I say, even though I immediately think, Spa? I don’t really want Tom’s uninvited company.  “Don’t touch me,” I said to Marc, the boy who’d just gotten in the lunch line behind me.  “As I’d want to, Fartknocker.” My last name was Grantz; how this got turned into “Fartknocker” by my tormenters was a mystery to me.  I felt his hand on my ass as I raised my tray so the lunch server could put my food on it. I flushed hot with fury. “I told you not to touch me,” I said.  “I didn’t. Maybe your clothes want to flee your foul body, Fartknocker.”  I had pulled the tray down and was holding it in front of me; at that, I whirled, turned it sideways, and hurled French fries, hamburger, and the tray into his sneering face.  My mother came to pick me up from the principal’s office, looking harried and frustrated. “I don’t want to hear it,” she said as I followed her down the stairs and out to the car. “You need to stop letting people get your goat. He just wanted a reaction from you and he got one, didn’t he?”  Also grease and ketchup all over his shirt, and maybe that would discourage him from tormenting me where ignoring him hadn’t? I burst into tears, because that was what I always did when I got angry enough, and said, “I wish I’d kicked him in the balls.”  “Don’t do that, either,” Mom said. “Your grades are really good, Cecily, but if you’ve got a serious disciplinary record it’s going to be hard for you to get into college.”  Andrew came over after school, since Mom had said I was grounded but hadn’t said I wasn’t allowed to have visitors. “Boys are the worst,” I said.  “Football players are the worst,” he corrected.  “Does Marc play football?” I never knew who played what. It just wasn’t interesting enough to keep track of.  “Probably.”  “I hope he gets hit by a bus.”  “Yeah, about that. We’ve got to talk about your technique, Cecily. Throwing a tray is very showy and all but it wasn’t going to do any real damage. You have to hit people like that where it hurts.”  “Do you think I should have kicked him in the nuts, instead?”  “Testicles are actually a smaller target than most people think. No, revenge is a dish best served cold.”  We talked for hours about things we could do to Marc: laxatives in his food, stink bombs in his locker or slipped into the pocket of his letterman’s jacket, infect him with head lice. None of these ideas were particularly practical: we didn’t have access to his food, we didn’t know of anyone with an active case of head lice, he’d certainly notice if either of us slipped a stink bomb into his pocket. That was fine, though. Revenge, for me, was a dish best imagined and never served up at all. If I was going to do anything, it would be a hurled tray in a moment of anger, not a carefully crafted boutique-quality revenge plot.  Andrew got roughed up, a few weeks later, supposedly for looking at another boy in the locker room for a few seconds too long when they were changing after gym class. It was Marc with one of his teammates.  “The frustrating thing,” he confided, “is that even if I can get laxatives into his food, he won’t know why he’s being punished. He’ll just think he’s eaten something that disagreed with him. I wish I could hit him back hard enough in the moment to make him sorry he’d messed with me.”  “You could learn a martial art, maybe.” Thanks to the success of the Karate Kid movie there were about 8 million karate schools in our town alone.  “Unlike in the movies,” Andrew said, “you have to take classes for years before you’re actually any good. Also, I’m pretty sure if you beat someone up at school they’ll kick you out, even if they richly deserved it.”  “Also, if you’ve got a serious disciplinary record it could keep you out of college,” I said, like my mother had.  Andrew sighed. “All I want is to make the people who deserve to suffer, suffer,” he said. “Is that really so much to ask?”  Two weeks after that, Marc’s car, sitting in the student parking lot, went up in flames. No one seemed to know what had caused it. I asked Andrew if it was him, and he raised his eyebrows and said “whatever would make you think that?” instead of answering. And he was right: if it was him, Marc had no idea why he’d been punished.  The spa, it turns out, is in a separate building from the hotel, and I have to go out into the street to get there. Once I’m there, the attendant checks my room key, then shows me a locker room with complimentary slippers that are barely half the size of my feet. I change into my bathing suit and venture out the far door.  There are two pools, steam rising from the water. The website mentioned a hot spring. I wonder if this is actually spring water, or if they heat it somewhere and pipe it in? I’m a little shocked by just how hot the water is; initially it’s too hot to immerse myself in, so I stick just my feet in the water and then ease the rest of myself in as I adjust to it.  There’s a button you can press to turn the soaking pool into a whirlpool, and I try it. The bubbles are nice but the noise is a little like sitting next to a blender. I decide to just soak.  Somewhere out there is Andrew. He knows I’m here. He knows I want to find him. I imagine him striding into the spa, right now, as unlikely as that is. What would I say to him?  How did I ever believe that I knew you?  Instead, it’s Tom who strolls in. “Oh, hello,” he says. “I heard you changed your mind! Isn’t the water nice?”  I sigh and make a noncommittal, non-conversational sort of noise, hoping he’ll take the hint and settle into the other pool. He climbs into mine, of course, and sits down next to me.  “What do you mean that you heard I changed my mind?” I ask, since apparently conversation is inevitable.  “I asked at the front desk where the other westerner had headed. You’re rather conspicuous, my dear.”  “You don’t say.”  He prattles on for a while about some beach in Thailand that’s so popular with British tourists there are more white people there than Thai people, and then moves on to the question of authenticity and whether that’s something you should even be trying to seek out. I smile and nod, which is all he seems to particularly want from me.  At least, it’s all he wants from me until he scoots in closer and suggests we go out for a drink. I rocket out of the pool like the water has suddenly turned to acid, and retreat to my hotel room, with its locked door.  It’s not until I get there that I wonder if he’s not a travel writer. If he’s actually here for the same reason I am. If he’s looking for Andrew.  The summer after my sophomore year of college, I had a research fellowship to work with a biochemistry professor there. I’d gone to a small, highly competitive, intensely nerdy college. It felt like I’d spent my whole life up to that point as a fish out of water, leaping from jar to cup to puddle in a desperate bid to stay alive, and suddenly I’d found my way to the ocean. To water, to other fish, to the place I’d always belonged but never had been able to find. That was college, for me.  Not so much for Andrew. He’d applied to that same college, but he hadn’t gotten in. He hadn’t initially gotten into the flagship state university, either; his grades were too low. He’d enrolled at the local community college, then transferred to the state university after a year. He was doing okay, but he had big classes, few friends, professors who were unimpressed by his estimation of himself.  I visited home for just two weeks at the end of the summer. Andrew and I met up at a local park and he told me stories about his summer working at the local pool. He’d gotten lifeguard certification but, he told me cheerfully, he was probably the world’s worst lifeguard, using his dark sunglasses to conceal naps.  “What if someone actually gets into trouble?” I said.  “They’d better yell loud enough to wake me up, then,” Andrew said in a cheerful tone.  People who are drowning can’t yell. They have water in their lungs; that’s literally what drowning means. I didn’t want to scold him. Surely no one had actually died on his watch, or I’d have heard. Also, I was never certain when he was joking. I forced a laugh, told myself this was definitely a joke, and described the research fellowship a bit. We were doing DNA sequencing, using one of the first automated machines for that purpose; I was studying the genome of a bacteria that mostly just lives harmlessly on human skin but can on occasion cause raging infections of various kinds, or food poisoning. I found the fact that it could be harmless or deadly really fascinating. It took me longer than it probably should have to realize that Andrew was a lot less interested than I was.  “You really are a nerd,” he said, finally. I wasn’t sure I was right that I was hearing contempt in his voice—I mean, this was Andrew. My best friend. My best friend from high school, anyway. I’d told him earlier about Beth, my best friend in college, who grew up in Arkansas and liked to crochet mathematical forms. I’d brought along a yarn stellated rhombic dodecahedron she’d made me for my birthday. I wondered if I should show that to Andrew, like I’d planned, or if that would make him angrier. More contemptuous.  What’s wrong with me, I thought, and then I thought, there’s nothing wrong with me. The problem here is him. He’s acting like an asshole.  I made some excuses and left.  We didn’t talk for twenty years.  Genetics became my life’s work. Sequencing, first, through my undergraduate years and the beginning of graduate school. Genetic engineering, starting midway through graduate school and continuing through my postdoctoral work and my years at the university. CRISPR, when CRISPR became available, was just one more tool, but a particularly fascinating one. My focus was genetic diseases in humans.  There are basically two approaches to genetic diseases. The first is to test people—this has gotten cheaper and easier every year—and discourage carriers from having genetic children with other carriers. If one parent carries the gene for cystic fibrosis, but the other doesn’t, none of their children will have the disease. The problem with this approach is that because carriers will continue to have children with noncarriers, the genes themselves stay in the population and at least a few babies with genetic diseases are more or less inevitable. (Please note, I’m not talking about eliminating neurodiversity from the population, or anything that could possibly be a reasonable human variation. I’m talking about diseases that cause years of misery and an inevitable early death, like cystic fibrosis, or diseases that just kill any child unlucky enough to have them, like Tay-Sachs.) The second approach is to step into the genome with the tools we have and simply fix it. If we use something like CRISPR to edit an embryo’s genome, we can not only ensure that the child born from that embryo will not have Tay-Sachs or cystic fibrosis, we can ensure that they will also not grow up to pass along that particular gene.  Using techniques like this on humans beyond the embryo stage is years away. Or at least, I assumed it was years away.  Andrew got back in touch through Facebook. When I friended him back, he sent me a private message—CECILY, wow, when I found out your family had moved out of town I thought I’d never catch up with you again. What are you up to these days?  I’m a professor at Johns Hopkins, and Andrew was a lot more enthusiastic about my work now than the last time we talked, which was reassuring; he’d matured, clearly. And we’d both grown up; I was no longer the angry, insecure girl I’d been at that point in my life. I’d found my place in the world a long time ago.  We started chatting regularly again. Andrew told me about his job at a biotech start-up. It had taken him a lot longer to get through college and it didn’t sound like he’d gotten through a doctoral program, but skills count for more outside of academia and he’d always had an abundance of intelligence and creativity. He’d signed a nondisclosure agreement, he said. As head researcher at a university lab, I had not.  “I would give anything to see that paper you’re working on,” he said one day, after I’d told him about the research I was doing into whether gene-editing technology—not CRISPR, but I’d started with CRISPR—could be used beyond the embryonic stage.  I sent it to him.  When the FBI agent came to my lab, I assumed she was looking for my colleague Jeanine, who developed a process for recovering DNA from centuries-old bones. She was not. “Dr. Cecily Grantz?” she asked. “Do you have a few minutes?”  I looked at the clock on my desk and said, “I have a class to teach later today, but not until 2 PM. How can I help you?”  She closed my door, and pulled up a chair, like a student looking for help with a confusing assignment. “I’m Agent Locke,” she said. “I’m here to ask you a few questions about someone I think you know.”  What’s Andrew done, I thought.  On some level, I must have known all along.  Agent Locke showed me photos: Andrew’s one-person lab, with a tidy row of molecular printers directly adjacent to a hospital bed with restraint straps dangling down. The home freezer where he kept genetic samples for his record-keeping. And the bodies. The bodies that had torn themselves apart as his serum had wreaked its horrifying havoc. There were many bodies. He’d run test, after test, after test.  He’d lured in homeless teenagers. Do you need a place to stay? read an e-mail message he’d sent to two dozen separate runaways. I’m here for you.  There was a video interview with a girl who’d survived, barely. “I was an A-student,” she said in thick speech with a tongue that no longer wanted to cooperate. “My ex-boyfriend was stalking me. I had no way to protect myself. I wanted to be strong. He promised me this would make me strong.”  He’d used my research for this. Then adjusted the serum. Improved it. Changed his approach. Found more test subjects.  Left their bodies in shallow graves.  Agent Locke wanted to see what I’d sent to Andrew. I gave her everything I had.  I never knew him, I thought. Not really.  He was confident in the serum, Agent Locke told me before she left. In the end, he’d used it on himself. It had given him inhuman speed, reflexes, and strength. He’d used them to escape the armed officers who’d come to arrest him. “He broke their necks,” she said, matter-of-factly, “with his bare hands.”  The morning is cold and windy, and I put on extra layers before finding a car to take me to the abandoned mining town.  The town isn’t entirely abandoned, nor are the residents actually a secret: a clothesline runs across the former town square, with four T-shirts and two pairs of pants drying in the morning air. As I hike up a narrow trail past a four-story apartment building, a dog waits calmly in the doorway of the apartments, not approaching, his tail slowly waving back and forth.  I think I can guess which buildings have inhabitants just based on where the satellite dishes are and where the glass windows are intact. I follow a trail up the hill. My socks and leggings get covered in tiny burrs; I also spot four patches that have been cleared of weeds and planted with something that might be that B. oleracea cultivar I’ve eaten every night at dinner.  Back down the hill, near the river, I look over at the rusted wreckage of a very ruined car and step inside what appears to have once been an auditorium.  If Andrew is here, he’s given no sign.  The driver takes me through a mine shaft cut straight through the mountain and to the disused prison on the other side. This prison was abandoned in the 1970s, along with the mine; as with the town, there are nonetheless people living here. They grudgingly open up the gates when the driver bangs on the door and yells at them.  They are using the prison as a chicken farm. The doors to the empty cells all stand empty; inside, they reek of chicken droppings. When I step inside one, a chicken gabbles at me nervously and flaps her way to the other side of the cell, leaving a feather drifting in the air.  Most of the buildings in this part of China are unheated. Certainly a prison would have been no exception, and the visceral unpleasantness overwhelms me for a moment. I wonder if the prisoners here were criminals, or political prisoners, victims of the Cultural Revolution, who they were.  I briefly imagine Andrew here.  It’s what he deserves battles with no one deserves this. I don’t even know what justice would look like after what he’s done.  Anyway, he’s not here. The longer I stand here the more certain I am that he would never hide in a prison. I can go.  When I arrive back at Danzhai Village, I can see a crowd gathering on the square outside the performance space: there’s music and dancing. They’re wearing traditional clothes but the music sounds more modern. I walk up for a closer look and get pulled into the dance by a smiling lady with a silver hat. There are choreographed steps that the locals are all following, although tourists who join in are all given enthusiastic encouragement. I feel foreign, heavy-footed, and stupid, but let them egg me on for a few minutes. “Good try!” one of them says in sympathetic English.  The statue of the Golden Pheasant Girl looms over all of us, lit by little spotlights as the sky grows dark.  When your people are starving, and the gods or dragons or magical tree demands a sacrifice, you might volunteer yourself; you might race to be the first to volunteer yourself, to spare someone you love.  I leave the square, walk down to the edge of the river, and think about monsters.  Nadine tried to tell me. Andrew himself tried to tell me. Did I turn away from these warnings because on some level it felt like being the one person the monster would never harm made me special?  How sure are you that this will work? Jeanine asked when I told her a little about the plan, when she agreed to keep an eye on my lab when I left for the two-week winter break. What if they’re wrong about whether he values you?  That’s not why I’ve been dreading finding him. I’m confident he won’t hurt me. I’ve been dreading finding him because I’m here to turn on him. To betray him.  Because that is what you do when your friend is a monster. Truly a monster—not a part-time monster like a werewolf who can be contained with proper precautions, not a misunderstood monster like the Beast from the fairy tale, but a monster. You don’t defend them. You don’t deny it. You do what you have to do.  That doesn’t mean you want to do it.  Back in my room, I pull up my social media and post some pictures I’ve taken: the chickens at the prison, the big empty room in the ghost town that used to be an auditorium. There were some Chinese characters painted in red on the crumbling wall, and now that I’m at my computer I plug that photo into a translation program and find out that the words say “NO SMOKING.”  Maybe, I think, I’ve looked hard enough. Maybe I can just go home. Tell them I couldn’t find him.  Then I see the picture I took of the clothesline strung across the village square. There’s a pair of pants hung neatly by the ankles, but for the first time I take a closer look at the shirts. There are six: two work shirts, four T-shirts. The T-shirts have printing on them.  There’s one with a TARDIS; one with a dragon; one with a math joke.  He was there. He was there. I just didn’t recognize the signal.  I lie awake that night for hours, still drawn by that thought I had earlier: I don’t have to go through with this. I could spend another day walking around Danzhai and go home pretending I tried my best. I fall into fitful sleep about halfway through the night, then wake at some very early hour because of a commotion in the hallway outside.  I put on my glasses, open my door, and step out to see what’s going on.  A few doors down from mine, a room is open, light spilling out, hotel staff crowding frantically around. One of the women sees me, and she gestures for me to come. She pulls out her phone and speaks into it: it translates her words into flat, British-accented English. “You speak English. Please tell this man that we have called for a doctor.”  My door shuts behind me, and my heart pounds as I follow her down the hall.  In his hotel room, Tom is lying on the floor, writhing in pain. Around him are things the hotel staff have brought to try to help—a kettle of hot water, a bowl of ice, towels, a bottle of pills, a bottle of alcohol. He’s barely conscious. I can see the veins in his forehead bulging out like swollen twigs, the blood inside black and thick. It’s the serum—the unfinished, fatal version. I wonder how Andrew got it into him. I can guess why: I was right. Tom isn’t a “travel writer,” he came here to find Andrew.  The staff backs off and lets me speak to him. I’m not sure he’s conscious. “They’ve called an ambulance,” I say. “They told me to tell you that a doctor is coming.”  Tom opens his eyes a sliver, looks at me. “It’s not going to help, is it? It’s not.” His tongue isn’t cooperating; his throat is thick and his voice is raspy.  There have been some survivors. I don’t think he’s going to be one of them. I don’t want to tell him that, so I ask, “Do you want me to tell anyone where you are?”  He tries to gesture toward his nightstand. His arm flops to the side. “My wallet.”  I take it down and open it. It’s a thin, impersonal wallet—no pictures of children, no coffee shop or grocery store loyalty cards. Just a UK driver’s license, two credit cards, and a wad of cash. Plus a single handwritten index card saying “if found . . . ” on it, with an e-mail address and a phone number. “There,” he whispers.  “Who’s this going to reach?” I ask.  He tries to speak, and for a moment can’t. I think I see his lips forming “MI6,” but what comes out, in the end is just, “They’re no threat to you.” His eyes close and a moment later he starts gasping, the air catching on the edges like burrs on clothing as his throat swells. If he could control his hands he’d be grasping desperately at his throat. I stand up and back away, putting the wallet down on his bed.  “Where is the doctor?” I ask the staff, not sure if anyone can understand me. “He needs a doctor right now or he’s going to die.”  The ambulance has arrived outside and the Chinese EMTs—or whatever they’re called here—run to Tom’s hotel room. I clear out, give them space to work, and am standing back in my own hotel room as they bring him out a few minutes later. Silent, and covered by a sheet.  The staff member who frantically brought me to Tom’s side knocks on my door a few minutes later. She has a tray with tea, and sliced melon, and the steamed buns they serve at breakfast. Also a newspaper, because she’s seen me buying newspapers, and I flinch a little at the sight of it. I certainly don’t need that today.  Her face is tearstained and filled with guilt and shame. I want to reassure her that this catastrophe in her hotel was not her fault, but I don’t want to dig myself into a hole I won’t be able to get out of if anyone comes asking questions, so I say xie xie and let her go.  Today, the clothesline is empty. I go to the entrance of the building that has the satellite dishes, hand the dog a treat I’ve brought along to increase the chances of friendship, and make my way down the hallway.  This building is inhabited, but it’s filthy. There are doors that are closed; other doors are open, with trash spilling out. I can smell peppers and rice cooking, overlaying the smells of mildew and dry rot. Somewhere in the building, there’s a TV on. I know it’s a TV just from the buoyant tone of the voices. TV Announcer Voice is one of those weird cultural constants.  When I reach door 28, I knock on it. Twenty-eight was my favorite number when I was a kid. (It’s a perfect number. That means that if you break it down into its factors, and add those numbers together, you get the number again. 1+ 2 + 4 + 7 + 14 = 28. Andrew didn’t much care about perfect numbers, but he listened to me talk about them.)  He answers the door.  I’m not entirely sure what to expect, but I’m surprised to see that he’s shaved and clean, so “unshaven” was apparently what I was expecting. His hair is a lot grayer than in the pictures he had on his social media. “Cecily,” he says, and his voice sounds exactly like I remember, which is also, in its own way, a surprise. “Come in.” He steps back from the door and I follow him into the apartment.  There’s a table, two rickety chairs, a large cask of water, a small gas burner. He puts water on to boil, and silently makes tea for both of us. I watch the leaves unfurl, not speaking.  “You came all this way,” he says. “I’m sorry I can’t offer you nicer surroundings.”  Unbidden, the image of the bed with the straps rises up in my mind and I bow my head over my tea and pretend to drink it. He watches me, and I look up in time to see his face shift. He thought I’d come to help him. Or to warn him. Or just to see him. But he knows, now.  “How soon are they coming?” he asks.  “I don’t know,” I say.  He looks up at the ceiling, blinks back tears.  “Why not just kill me?” he asks. “Why betray me?”  “I seriously considered that option,” I say. “But I was going to have to pass through Chinese customs. Also, I’m really not a violent person. Imagine me coming at you with a gun, even if I could get it through Chinese security. Or a knife.”  Tears spill down his cheeks. “I’ve seen you throw a tray full of food into someone’s face.”  He doesn’t flinch away from my hand as I reach out, wipe his tears away with my thumb. “Yeah, and remember how ineffective that was? I got a trip to the principal’s office out of it, that was it.” I wipe his tears off on the side of my pants. “Why did you do it, Andrew?”  “I told you years ago. I wanted to be strong.”  “But to sacrifice all those people. You didn’t go seeking out the football players who were sexually harassing girls in the cafeteria line and assaulting boys in the locker room.”  “No. I looked for people who needed to be strong. I looked for the people I wanted to help.”  It’s strange how easy it is to talk to him. Still. Here. My tea is growing cold on the table by my hand. “Why did you come here?”  “I had to get out of the US before the bulletin went out. I speak Mandarin Chinese and around here, I thought maybe I could pass myself off as being from some other part of China. This region is where my grandfather came from, the one who immigrated to the US. It’s quiet. I thought I could hide here, and maybe no one would come after me.”  “They’d have followed you to the ends of the earth, Andrew.”  He hears a hint in my voice, even though I didn’t mean to put one there.  “Do they want my formula?”  I don’t answer, which is answer enough. He laughs. A little bitterly, a little triumphantly.  “Well,” he says. “I guess I have a bargaining chip after all.”  “Didn’t you assume that from the beginning?”  “You never know,” he says. “People have been known to waste what’s right in front of them.”  It’s true. They have.  He picks up his tea, and his teacup slips out of his sweat-slicked, unsteady hand, crashing to the floor. He stares after it, at his hands, which are shaking. He touches his face, feeling the sweat on his cheeks, and he looks at me. I stand up, realizing that staying as long as I did may have been a mistake.  “They’re not coming,” he says. “You’re the only one. Why—what did you do to me—what’s happening?”  I step away, and he reaches out and grabs my wrists. I can feel his inhuman strength, and I wonder if I’m about to find out just how wrong I was that he wouldn’t turn it against me.  “The FBI came first. They told me what you’d done. The CIA came second. And they wanted me to make you an offer—to tell you that if you gave me your formula to bring back to the US, and it was useful to them, you could come home. There’d be no charges. They knew you were here, but they thought I’d be able to approach you.”  “But instead,” he says, “You decided to kill me.”  “I demanded your notes. I said I needed whatever they had so that I could tell—or at least guess—before leaving China whether you were giving me fake information. They gave me what they had. I designed a bacterium that’s harmless to most humans. Harmless, in fact, to any human who hasn’t had the serum. It’s fatal to you. It undoes, but only partially, what your serum did for you.”  “I don’t need to kill you,” he whispers. “They’ll kill you.”  “Maybe,” I say. “I’m going to tell them that your serum wasn’t as good as you thought. That you died from its effects. Hopefully that’ll discourage them from further research.”  “What if it doesn’t? What if they just start with the notes I left behind? You don’t think the US Military will kill thousands to get this serum?”  “No,” I say, honestly. “Not because they aren’t evil. But because in the end, even the strongest, fastest, smartest human is still a human, and still the weakest link in the chain.”  Overcome with dizziness, Andrew lurches to the side, grabbing his table for support; he tries to lower himself back to his chair, but misses, and lands hard on the floor. His window to kill me has probably closed.  He covers his face with his hands, and then says, “You’re a terrible liar. You’re the worst liar I’ve ever met. You barely fooled me for five minutes and I don’t think you’ll be able to fool the people who sent you.”  “Maybe not,” I say. “But if your serum dies with you, it’ll still be worth it.”  He laughs, very faintly, and waves toward a corner. “My laptop,” he says. “Password is your name.”  His clothes are soaked with his sweat, and now he’s starting to cough, as his lungs fill with fluid released from their own cells. He gasps for air, like Tom did. Unlike Tom, his eyes are open. Open, and fixed on me. I watch as the whites of his eyes turn red, then black, as the blood vessels in them hemorrhage.  One summer day when we were sixteen or seventeen, we went to a park and climbed up onto the roof of the picnic shelter and watched the sunset, and watched the sky grow dark, and then lay on the warm roof and looked up at the sky and watched for falling stars. It was the night of a meteor shower and my parents weren’t willing to let me stay out all night to watch it at its height (which was supposed to be three to five AM) unless I wanted to do that from our backyard, but they were willing to let me stay out until midnight, so that’s how late we stayed.  “Are you going to wish on the falling stars?” he asked.  “That seems silly,” I said. “I mean, they’re not anything magical. They’re caused by debris from a comet. They just look cool.”  “You’re so scientific,” he said, complaining a little. “I bet you wished on shooting stars when you were little.”  “Yeah,” I say.  “So what did you wish for when you were little?” he asked, when I didn’t elaborate.  “I wished for a friend,” I said. “It wasn’t just falling stars, either. First star of the night, white horses, whatever. I always wished for a friend.”  The story I’m going to tell is that he was dead when I arrived.  Andrew’s right that I’m not a very accomplished liar. But this is a simple lie.  They will definitely want his laptop. But he’s given me the password—and that means I can ensure that the data is unrecoverable, even if he didn’t.  I take gloves out of my pocket, pour out my tea, and return the cup to the cabinet, thinking about the step I’m about to take. Laptops are often very personal. Mine has my work in progress, but it also has notes, journal entries, letters, musings, poetry.  I would very much like to take the time to read all the things on Andrew’s laptop that are not his research notes for the serum.  But I’ve already murdered my friend; if I don’t destroy his notes, that will have been for nothing. So I wake the laptop, unlock it. I format the hard drive, then encrypt the formatted drive, making a fist and tapping the keyboard randomly to create a key for the encryption. Then I close the laptop and slip it into my bag to bring home, and sit down at the table, and wait for the rise and fall of Andrew’s chest to stop. Naomi Kritzer has been writing science fiction and fantasy for over twenty years. Her YA novel Catfishing on CatNet (based on her short story “Cat Pictures Please”) won the 2020 Lodestar Award, Edgar Award, and Minnesota Book Award. Her latest book, Chaos on CatNet, came out from Tor Teen in April 2021. Naomi lives in St. Paul, Minnesota with her spouse, two kids, and three cats. The number of cats is subject to change without notice.", "text": "10910 words, novelette\nMonster\n2021 Finalist: Hugo Award for Best Novelette\nNo one at the Guiyang airport speaks English. I have the UTranslator app on my phone, and before I left my colleague Jeanine said that it had worked fine for her. But she’d also said she’d never had trouble finding an English speaker in China. And her trips were to Shanghai and Beijing.\n“I’m going to the Guizhou province,” I’d said.\n“Where?” she said, pulling out her phone to look up a map.\n“Like the Oklahoma of China,” I said. Southern-ish, rural, inland, poor. Not where the foreign tourists usually go.\nAt the baggage claim, there’s a yellow lab sniffing bags, trotting happily back and forth along the conveyor belt as it snakes into the airport. The dog looks deeply pleased with his work, and I am startled to see him sit down on the belt next to a suitcase, which is the standard signal dogs give when they’re flagging something. I look around, wondering if I’m about to see an arrest. No one seems perturbed. Also, no one claims the bag; a short time later it winds past me and I see that its wheels are wrapped and it has no handle. The suitcase is a decoy, riding the belt endlessly to give the dog something to react to on days with no would-be smugglers. I wonder what they put inside it.\nMy suitcase elicits no response from the dog. I’m irrationally relieved.\nIn Guiyang, the responses from the UTranslator app get me a lot of very confused looks unless I keep it to single-word requests. “Bathroom?” gets me pointed in the right direction. “Newspaper?” gets me to a newsstand. Of course, all the papers for sale are in Chinese and I can’t tell which are going to be filled with news from Beijing and Shanghai and which might have local stories. I buy two papers anyway.\n“Where can I hire a car to take me to Danzhai?” is not a successful sort of query but “taxi?” eventually gets me to the right spot. It takes time to make it clear that I really do want to go all the way to Danzhai (it’s two-and-a-half hours away), but we finally set off.\nI didn’t sleep well on the plane, and I very much want to sleep in the car, but I’m too keyed up. I stare out at the wide smooth highway that tunnels straight through the hills and bridges the valleys, trying to catch glimpses of China beyond the guardrails, barely absorbing anything.\nAll I want from the newspapers is the answer to one question: have there been any more bodies? I hover my phone over the characters, slowly parsing out headlines about trade agreements, a train accident, a pair of extremely old identical twins who are celebrating their birthday.\n“Why are you going to Guizhou?” Jeanine had asked.\n“Because no one I know has ever been there,” I said. This was a lie. I’m here to find Andrew.\nI met Andrew my sophomore year of high school.\nI was a nerd, which back in the 1980s was the actual opposite of cool (as opposed to now, when it’s simply another variety of it). I spent middle school being bullied for my preference for books over people and sweatpants over jeans. Any time I stopped for a drink from the water fountain, my classmates would yank my pants down; the school administrators all insisted that if I just ignored them instead of crying, this would stop. When I started high school, I caved and started wearing blue jeans, even though I hated the way the waistband dug into my sides when I sat.\nFreshman year of high school, I spent my lunch periods eating with a few girls I called my friends, who’d more-or-less tolerated me in middle school. Sometimes we hung out on weekends at the mall, where the other girls would coo over “adorable” clothing and I’d self-consciously stroke the scratchy fabric and pretend I wished my mother would give me a clothing allowance instead of just buying me the same L.L.Bean turtlenecks again and again because she knew they had soft tags and I’d wear them.\nAndrew was in both my chemistry class and my precalculus class, and he noticed that I spent a big part of the day reading books under my desk. He started asking me each morning what I’d brought to read. Initially I wasn’t sure whether his curious tone was the fake-curious voice other kids sometimes used right before they turned into complete assholes. After multiple classes passed and he didn’t snatch my books away to wipe a booger on them or anything like that, I started feeling a bit less wary. My books were all science fiction, and all came from my neighborhood library, which mostly meant Isaac Asimov, Piers Anthony, and all the older Anne McCaffrey.\n“You should read this,” Andrew said one day, and handed me a paperback. “It’s mine. Don’t crack the spine. You’ll like it.”\nIt was a copy of Neuromancer by William Gibson. The next day, I sat with him at lunch.\nDanzhai Wanda Tourist Village is possibly the strangest place I’ve ever been.\nEverything around me looks quaint and old, but in fact it was built from scratch just a few years ago to showcase local ethnic cultures and attract tourists to the area. Local people are employed to wear traditional costumes, walk the street playing traditional instruments, make and sell traditional crafts. It reminds me of a Renaissance festival.\nMany of the women in traditional clothing are wearing silver hats with delicately formed butterflies on the top and a jingly fringe right above their eyes. Other women wear their long hair scraped up high into something almost like a bouffant, but with silver ornaments and oversized flowers pinned in. They wear beautifully embroidered jackets and skirts, and silver belts, and large silver necklaces that look like someone cut a circle and hammered the silver out into a crescent. Everything jingles as they move. I wonder if the metal jewelry is heavy, if the clothing is uncomfortable, how much is prescribed, and how much is left up to them.\nThe men and women minding the shops are mostly wearing more ordinary clothes, although a few have the hairstyle with a smaller ornament pinned in. I can’t tell whether the tourists shopping in the stores are from other parts of China, or just other parts of Guizhou.\nUTranslate doesn’t work any better here than at the airport. Fortunately, the hotel has a sign in English over the door telling me it’s a hotel, and “Room?” is easy enough to understand.\nI know I’m not going to find Andrew today. It’s going to take time. Today my job is to check into the hotel, not nap, and adjust to the time change. This would all be easier if I’d arrived in early evening rather than midmorning. I resolutely leave my suitcase on the bed instead of lying down myself and go back outside.\nAt the end of the street there’s a public square, and three young women have set up a table with carved drinking horns and little bowls of what I’m pretty sure is a potent alcoholic beverage. Two have the silver hats; the third has the hair ornaments. They are beckoning visitors over and feeding people the drink out of the horns. I am quickly jostled up to the front, where one of the women smiles and sings a song as she pours the drink into my mouth.\nYou could poison a lot of people this way I think as I swallow obediently and then wonder what sort of person I am to even think such a thing. The alcohol is strong, and I hope it’s not rude if I stop drinking. The ladies don’t stop smiling when I pull my head back, so if I’m being rude, they’re too polite to mention it.\nI like meeting new people, one of the affirmations they made me repeat back when I went to therapy years ago, pops into my head. “Xie xie,” I say, the one word of Chinese I know: thank you.\n“Thank you,” I said to Andrew when I gave him back the book. “It was great.” I’d brought along one of my own paperbacks to lend him, one I’d bought on my own rather than checking it out from the library—Startide Rising.\n“If you used a bookmark instead of putting your books facedown they’d last longer,” he told me when he finished it.\n“Sometimes I dog-ear the pages,” I said.\n“You do realize that makes you an actual monster.”\n“It’s my book! I can fold down corners if I want!” Sometimes I’d fold down corners just so I could easily get back to a particular page to reread it. I didn’t tell Andrew that I occasionally even did that with library books. Just the older library books I checked out again and again, though—especially the story collections from the bottom shelf. Not the new books.\nAndrew had a girlfriend, a goth girl named Nadine who went to the other school, and she had a whole cluster of nerdy friends. Suddenly on the weekends I had something to do, and when Star Trek IV came out I had people to see it with. Since none of us had much money, we spent most of our weekend afternoons haunting local parks or the family rooms of the kids with more absent parents. Having an entire group of friends was a shocking novelty to me. The friends I’d had before were willing to put up with how weird I was. Never before had I had friends who were weird with me.\nAndrew was my closest friend in the group: he loaned me books and comics, made movie recommendations. I rented Alien on video because he’d recommended it so highly. Also Blade Runner. He was brilliant but lazy, sliding by with adequate grades because he didn’t want to do the work. “High school is pointless,” he said. “I already know everything they’re telling us. There will actually be things for me to learn once I get to college.”\nThere were a lot of on-again off-again romances in the group—two kids would get together, spend a couple of weekends holding hands (or making out while the rest of us yelled “get a room!”), amicably break up.\nWhen Andrew and Nadine broke up, Nadine disappeared from the group.\nMonths later, I ran into Nadine waiting tables at a diner near the U. I was by myself, with a stack of books and homework and $10 for bottomless coffee and a big plate of fries. “Nadine!” I said, delighted, when she came to my table. “I haven’t seen you in forever!”\n“Oh, hi,” she said, giving me a faint smile. “Yeah, guess it’s been a while.”\n“How are you? I’ve missed you.”\n“You have? Huh, okay.” She took out her pad. “I’m actually working, so . . . do you know what you want?”\nI gave her my order and let her take my menu and tried to shake off my hurt feelings. She was busy; I was a customer; I didn’t want to be a pest. I spread out my Spanish vocabulary cards and worked on them as I dipped fries into ketchup one by one and ate them, flipping them around so I didn’t double-dip even though I was the only one at the table. She came around twice to refill my coffee and water, not making eye contact, and finally stopped, my mug still in her hand, and said, “Are you still hanging out with Andrew?”\n“Yeah,” I said, a little hesitant. He had a new girlfriend. Was she jealous? Was that what this was about? I wasn’t the one dating him. I wasn’t into him that way.\n“You know he has a dead rabbit in his freezer? Or did. He was going to dissect it.”\nNadine clearly expected a response, but my main question was, was she saying he killed the rabbit or did he just find a dead one, because . . . I mean, we cut up animals in advanced biology. They were from a supply house, of course, not picked up off the street, but . . . I didn’t know how disturbed to be about the whole idea.\n“He wanted me to watch,” Nadine added.\n“Ugh,” I said, sympathetically.\n“He talked about wanting to know what everything looks like on the inside. Everything. Just . . . I don’t know, Cecily. Be careful, I guess.”\n“Is that why you disappeared?” I asked.\nShe gave me a look that I couldn’t identify. Pity? Exasperation? “Yeah, Cecily,” she said, flatly. “That’s why I disappeared. Do you need anything else or should I bring you the check?”\nI had been planning to get a slice of pie, but there was something about Nadine’s glare that made me antsy. I decided to just go. “Check,” I said. “Thanks.”\nShe took my money up to the register and brought me the change. “Keep it,” I said.\n“Thanks,” she said, and put the change in her apron. And then stood there, chewing on her lip and staring at me. “Don’t be alone with him,” she blurted out, finally, as I started to gather up my books.\n“Why?” I asked.\n“You just don’t want to be alone with him. Trust me.”\nI’d been alone with him dozens of times, and nothing bad had ever happened to me. “Okay,” I said, not arguing. “Thanks.”\nI didn’t tell Andrew I’d run into Nadine. The next time I wanted to get French fries and coffee and a booth to do homework while I was near the U, I chose a different diner.\nTo order in the Danzhai restaurants, I point at things other people are eating. I have a whole roast fish, still on the bone, in a rich sauce; I have eggplant with ground pork in a sauce that runs red with chilies and oil; I have plates of some sort of green vegetable that looks vaguely like turnip greens but with florets.\nDozens of vegetables came from the same wild herb, Brassica oleracea; we selected for flowers to get broccoli, buds to get brussels sprouts, leaves to get cabbage, roots to get kohlrabi. If this is Chinese broccoli, which seems likely, that’s yet another cultivar of the same plant. I wonder how long it takes to go from B. oleracea to ornamental kale through old-fashioned trait selection. I eat it with chopsticks, thinking about what steps I’d go through to get from ornamental kale to cauliflower in a day, using gene editing. Leaves, flowers, color, roots . . . I wonder how much I’d forget to do, what the results would be. I can’t think of any new B. oleracea cultivars that gene editing has brought us—maybe because we already had every variation that seemed like a good idea to anyone, developed the old-fashioned way.\nWe’ve always done this, some shadow in my mind whispers. I shake off the thought.\nWhen I eat at the hotel, I get the same waitress again and again, not because she speaks English but because she’s a little less easily frustrated by a customer who doesn’t speak any Chinese. “You should just bring me something you think I’ll like,” I tell her. “I’m not fussy.” UTranslate balks at this, so I try the word “anything,” and then “you choose for me,” with an expansive gesture.\nShe brings me out a soup, with fish chunks bobbing in it and slices of tomato in a rich red broth. “Perfect,” I say, and she smiles back, clearly pleased with my reaction. A little while later she brings out a glass of black tea. The tea farm is somewhere near here, and I can see the leaves unfurling in the water like those children’s toys that go from a tiny little capsule to a full-sized giraffe-shaped sponge when you drop them in water.\nThere is a theater in the tourist village that hosts a daily performance reenacting the legend of the Golden Pheasant Girl. This is apparently a well-known local legend. There’s a statue outside of a woman mid-transformation, and on a hill nearby there’s a metal statue of a golden bird. Actual male golden pheasants are very showy, with feathers shading yellow to gold to red. The females are the dull brown of most girl birds.\nI buy a ticket to the show. They gesture for me to wait and spend five minutes digging out an English-language program that includes a summary of what I’m about to watch.\nThe buildings here are mostly unheated, and the theater is as cold as everywhere else. There’s a handy little plastic clapper on each armrest, though, so I can use that to applaud while keeping my gloves on.\nThe stage itself has video screens built into the sides and along the back, which they use for some of the theatrical magic. There’s a lot of dance and song, puppetry, smoke effects. In the story, the people flee the losing side of a war, crossing a giant river, and resettle somewhere that they are safe but have no food. There’s a beautiful wedding sequence and then both the man and the women leave to seek out a magical tree that gives the seeds of every known plant.\nIn the staging, the tree is silver and resembles the hats the women here wear; I’m not sure if those hats are supposed to symbolize the tree or vice versa because the program doesn’t tell me. Both the man and the woman reach the tree and are told that one of them will be given the gift of the seeds but the other will be demanded as a sacrifice.\nBoth try to be the sacrifice; the man is pushed back as the woman’s sacrifice is accepted. She ascends to the back center of the backdrop and then raises her arms to be transformed into wings; lights, video, and flying wires are used to change her into the golden pheasant for the performance, although she looks rather more like a phoenix. The man, temporarily forgotten, regains the spotlight as she flies away and he’s blown back by the wind from her wings. Weeping, he takes the seeds back to his people.\nI find myself thinking about how you would transform a human woman into a golden pheasant with gene editing and wrench my thoughts away from that particular abyss. Instead, the ballet over, I find a shop in Danzhai that has newspapers and buy another stack, then take them back to my room and spread them out on my bed to hunt through for stories about bodies. This time I find one, but it’s a domestic murder-suicide in Xi’an and nothing about it sounds particularly mysterious. I wonder how much I’m missing just from UTranslate’s obstinacy.\nCombing through newspapers fills me with tension because it’s simultaneously passive and time-consuming. The whole trip is like that: passive and time-consuming, and I’m on edge, and don’t know what to do. They were so confident that Andrew would seek me out, if I came. I am less and less sure that they were right.\nWhen I check my e-mail one last time before I go to bed, I have an e-mail from a mysterious address that says, Just like the story, sometimes sacrifice is required, Cecily, if everyone else is to survive.\nI reply immediately: “Where are you?”\n“Andrew? Andrew!”\nWe were at Andrew’s house, in the family room, watching a James Bond movie. I remember it was a James Bond movie, but not which movie. His mother stormed in and furiously shut off the TV. “A C?” she snapped. “A C minus?”\n“I guess my report card came,” he said, staring out the window and not looking at either his mother or at me.\n“If you would just do the homework and turn it in—”\n“I already know everything that’s on the homework. They want me to do the same problem 40 times in a row until I die from tedium.”\n“I’m sorry your schoolwork does not hold your interest,” his mother snapped, “but my job is not one hundred percent intellectually stimulating, either, and if I decided to just never go to boring meetings I would be fired.”\nAndrew’s family was Chinese, but Chinese American for a number of generations. He liked to describe his mother as a grades-obsessed dragon lady. Even though I was generally on Andrew’s side, I knew this wasn’t fair. When it came to grades, his mother was basically exactly like my mother. My mom threw a fit when I let my grades slip in middle school. (I was trying to fit in. It didn’t work.)\n“What is it going to take to get you to work up to your potential?” his mom demanded. “Or at least in the near vicinity of your potential? The same metropolitan area as your potential?”\n“Maybe classes that weren’t so boring,” Andrew mumbled. “I need to walk Cecily home, I’ll be back in a few.” I finished gathering up my coat and Andrew slipped out the door after me.\n“Sorry,” I said, uselessly, as we walked back to my house, six blocks away.\n“Not your thing to be sorry for,” he said. “My mom is my mom. I’ll never be the kid she wanted.”\nI thought about that as we walked, whether I was the kid my parents had wanted. The summer I was ten, my father tried to get me to learn to play tennis. He took me to the tennis court on the weekends and he signed me up for classes. I went to the classes and swung my racket and practiced with my father and remained absolutely terrible at tennis. At the end of the summer he let me quit. Would he have preferred a kid who was good at tennis? Probably, actually. But he didn’t yell at me about it. He gave away my racket and never brought it up again.\nPossibly my mother would have liked a girl who liked wearing uncomfortable pretty clothing. When I was little she would buy me dresses made from stiff, crunchy fabrics with lace on them. I remembered one enormous fight when I was eight: she’d wanted me to dress up for a family wedding. Her promises of wedding cake and a Shirley Temple children’s cocktail got me as far as the car; when I started crying and asking to turn around because the seams itched, she swore that if I just ignored the itching, it would go away. This was a lie, just like with teasing. When we got to the church, I sat down sobbing on the big stone steps leading to the front door and refused to go inside. My father wound up taking me home.\nThere was a park about halfway between my house and Andrew’s house, a weird little former quarry with a stone formation called a “council ring” that looked like a good place to hold a very outdoorsy meeting, or possibly sacrifice a goat since there was a big stone in the middle. We sat down on the low stone wall of the ring. Andrew smoked a clove cigarette, which his mother would have been even more furious about than his grades.\n“Sorry we didn’t get to finish the movie.”\n“I can kind of guess how it went.”\n“Sure, but we missed some good action sequences.”\nI shrugged. “It’s not that big a deal. Are you going to be OK when you get home?”\n“There’ll be a lot more yelling, but it’ll stop once I tell her I’ll work harder in school, which of course I won’t, but she won’t know that.”\nI laughed. Andrew always made me laugh.\n“I think you’re the only person who understands me,” he said.\n“I feel the same way,” I said. “I mean, that you’re the only person who understands me, not that I’m the only person who understands you.”\n“I knew what you meant.”\n“Well, that stands to reason, right?”\nI was angry at his mother, and a little bit at him—would it actually kill him to do his homework?—and I felt awkward and embarrassed at having seen the fight, but the conversation at the council ring felt like a grace note in the day, anyway.\n“Say, do you think you could let me copy the precalculus homework?” Andrew asked. “In the mornings, before we go to class? Just to get my mother off my back. I don’t care about my grades.”\n“Sure,” I said. “No problem.”\nIn the morning, my e-mail has an e-mail from a friend back in the US asking if I’m going to see the Great Wall of China while I’m here. I send back a note offering probably-too-much explanation of Chinese geography: I am currently as far from the Great Wall of China as she is from the Grand Canyon. She lives in Portland, Oregon. If someone came to visit her in Portland, would she suggest they hit the Grand Canyon while they were there? China, like the US, is very big. I look at my block of text, delete it, and say, “it would be about a 17-hour drive from where I am. So, no.”\nThere’s nothing from Andrew. I go downstairs for breakfast and load up my plate with two fried eggs and four of the Chinese-style steamed rolls, baozi. I spot a fellow westerner across the room; he’s the first white person I’ve seen since I arrived in Danzhai. He looks either jet lagged or extremely hungover. Possibly both.\nAfter I’ve finished breakfast I check my e-mail again and debate whether to send another message to the mystery address. I decide it’s a little too soon and go out to walk around Danzhai again.\nI brought Chinese currency with me—a stack of pink bills with Mao smiling benignly on them. Mao is a lot less popular in China than he once was, but he’s still on the money. I suppose this is also true of George Washington in the US. Anyway, having brought money, it seems reasonable to spend some.\nI like the long, quilted coats that the clothing stores are selling, and the fabric is soft, but they’re all sewn for smaller women with narrower shoulders than I have. Even the vests don’t fit me properly. I admire a jointed silver fish at a jewelry store, embroidered purses, handmade bird cages that are lovely and interesting but would be very difficult to get home. They do batik here, all dyed in a blue dye that’s almost the same shade as denim, and I buy a batik tablecloth.\nAt that night’s dinner at the hotel, the other westerner is looking less hungover and catches my eye. “Join me?” he invites, in British-accented English. I pull up a chair across from him. “I’m Tom Lewis.”\n“Cecily,” I say, and we shake hands.\n“What brings you to Danzhai?”\n“I could ask you the same question. I wanted to go somewhere unusual, somewhere no one I knew had ever been.”\n“You picked well, then. I’m a travel writer. Not sure if I’m going to write up this place or not; it’s a bit of a bore.”\nI bristle instinctively, even though I haven’t found what I’m looking for. “What do you find interesting?”\nHe rattles off a dozen cities I’ve never been to and tells me about the night life in Kuala Lumpur. I think he’s trying to impress me. I wonder if he tries to impress everyone he meets, or just women, or just white women? He snaps his fingers at the waitress and I cringe, worried that the waitress is going to think that we’re together. He orders something in Chinese and says to me, “what are you having?”\nI tell him I’d like the whole fish, and he translates that into Chinese for me.\n“Why doesn’t UTranslate work here?” I ask.\n“The makers are having some sort of fight with China’s Great Firewall,” he says. “You should’ve come last week, the problem it’s having is new.”\n“Is there another app that will work?”\n“The official Chinese app is having some sort of dispute with the keepers of the app store, so no. What is it you’re planning to do tomorrow? Perhaps I can be of assistance.”\nWhat I want to say is, I’d rather get by with a Chinese-English paper dictionary from the 1980s than drag along someone who snaps his fingers at waitstaff but I never actually have the guts to be quite that confrontational, so I just laugh awkwardly and say nothing.\n“Have you gone to see the prison?” he asks.\n“The what?” I say, not entirely certain I’ve heard correctly.\n“There’s a former mercury mine about a half hour from here. It’s been used as a movie set a few times. There’s an abandoned town to one side, an abandoned prison to the other. Hire a driver and you can give yourself a tour. I mean, you’ll have to get out once you’re there. The roads are all overgrown. It’s picturesque, if you like that sort of thing. My friend Percival Abbot—you might know of him?—did a photography exhibition on it a few months back.”\nOur food arrives and we have an awkward meal together. I have not heard of Percival Abbot, although a quick Internet search when Tom steps away from the table confirms he is, in fact, a photographer whose website telegraphs that I really should have heard of him.\n“Are you thinking of going to soak in the spa later?” Tom asks as we’re finishing dinner.\n“No,” I say, even though I immediately think, Spa? I don’t really want Tom’s uninvited company.\n“Don’t touch me,” I said to Marc, the boy who’d just gotten in the lunch line behind me.\n“As I’d want to, Fartknocker.” My last name was Grantz; how this got turned into “Fartknocker” by my tormenters was a mystery to me.\nI felt his hand on my ass as I raised my tray so the lunch server could put my food on it. I flushed hot with fury. “I told you not to touch me,” I said.\n“I didn’t. Maybe your clothes want to flee your foul body, Fartknocker.”\nI had pulled the tray down and was holding it in front of me; at that, I whirled, turned it sideways, and hurled French fries, hamburger, and the tray into his sneering face.\nMy mother came to pick me up from the principal’s office, looking harried and frustrated. “I don’t want to hear it,” she said as I followed her down the stairs and out to the car. “You need to stop letting people get your goat. He just wanted a reaction from you and he got one, didn’t he?”\nAlso grease and ketchup all over his shirt, and maybe that would discourage him from tormenting me where ignoring him hadn’t? I burst into tears, because that was what I always did when I got angry enough, and said, “I wish I’d kicked him in the balls.”\n“Don’t do that, either,” Mom said. “Your grades are really good, Cecily, but if you’ve got a serious disciplinary record it’s going to be hard for you to get into college.”\nAndrew came over after school, since Mom had said I was grounded but hadn’t said I wasn’t allowed to have visitors. “Boys are the worst,” I said.\n“Football players are the worst,” he corrected.\n“Does Marc play football?” I never knew who played what. It just wasn’t interesting enough to keep track of.\n“Probably.”\n“I hope he gets hit by a bus.”\n“Yeah, about that. We’ve got to talk about your technique, Cecily. Throwing a tray is very showy and all but it wasn’t going to do any real damage. You have to hit people like that where it hurts.”\n“Do you think I should have kicked him in the nuts, instead?”\n“Testicles are actually a smaller target than most people think. No, revenge is a dish best served cold.”\nWe talked for hours about things we could do to Marc: laxatives in his food, stink bombs in his locker or slipped into the pocket of his letterman’s jacket, infect him with head lice. None of these ideas were particularly practical: we didn’t have access to his food, we didn’t know of anyone with an active case of head lice, he’d certainly notice if either of us slipped a stink bomb into his pocket. That was fine, though. Revenge, for me, was a dish best imagined and never served up at all. If I was going to do anything, it would be a hurled tray in a moment of anger, not a carefully crafted boutique-quality revenge plot.\nAndrew got roughed up, a few weeks later, supposedly for looking at another boy in the locker room for a few seconds too long when they were changing after gym class. It was Marc with one of his teammates.\n“The frustrating thing,” he confided, “is that even if I can get laxatives into his food, he won’t know why he’s being punished. He’ll just think he’s eaten something that disagreed with him. I wish I could hit him back hard enough in the moment to make him sorry he’d messed with me.”\n“You could learn a martial art, maybe.” Thanks to the success of the Karate Kid movie there were about 8 million karate schools in our town alone.\n“Unlike in the movies,” Andrew said, “you have to take classes for years before you’re actually any good. Also, I’m pretty sure if you beat someone up at school they’ll kick you out, even if they richly deserved it.”\n“Also, if you’ve got a serious disciplinary record it could keep you out of college,” I said, like my mother had.\nAndrew sighed. “All I want is to make the people who deserve to suffer, suffer,” he said. “Is that really so much to ask?”\nTwo weeks after that, Marc’s car, sitting in the student parking lot, went up in flames. No one seemed to know what had caused it. I asked Andrew if it was him, and he raised his eyebrows and said “whatever would make you think that?” instead of answering. And he was right: if it was him, Marc had no idea why he’d been punished.\nThe spa, it turns out, is in a separate building from the hotel, and I have to go out into the street to get there. Once I’m there, the attendant checks my room key, then shows me a locker room with complimentary slippers that are barely half the size of my feet. I change into my bathing suit and venture out the far door.\nThere are two pools, steam rising from the water. The website mentioned a hot spring. I wonder if this is actually spring water, or if they heat it somewhere and pipe it in? I’m a little shocked by just how hot the water is; initially it’s too hot to immerse myself in, so I stick just my feet in the water and then ease the rest of myself in as I adjust to it.\nThere’s a button you can press to turn the soaking pool into a whirlpool, and I try it. The bubbles are nice but the noise is a little like sitting next to a blender. I decide to just soak.\nSomewhere out there is Andrew. He knows I’m here. He knows I want to find him. I imagine him striding into the spa, right now, as unlikely as that is. What would I say to him?\nHow did I ever believe that I knew you?\nInstead, it’s Tom who strolls in. “Oh, hello,” he says. “I heard you changed your mind! Isn’t the water nice?”\nI sigh and make a noncommittal, non-conversational sort of noise, hoping he’ll take the hint and settle into the other pool. He climbs into mine, of course, and sits down next to me.\n“What do you mean that you heard I changed my mind?” I ask, since apparently conversation is inevitable.\n“I asked at the front desk where the other westerner had headed. You’re rather conspicuous, my dear.”\n“You don’t say.”\nHe prattles on for a while about some beach in Thailand that’s so popular with British tourists there are more white people there than Thai people, and then moves on to the question of authenticity and whether that’s something you should even be trying to seek out. I smile and nod, which is all he seems to particularly want from me.\nAt least, it’s all he wants from me until he scoots in closer and suggests we go out for a drink. I rocket out of the pool like the water has suddenly turned to acid, and retreat to my hotel room, with its locked door.\nIt’s not until I get there that I wonder if he’s not a travel writer. If he’s actually here for the same reason I am. If he’s looking for Andrew.\nThe summer after my sophomore year of college, I had a research fellowship to work with a biochemistry professor there. I’d gone to a small, highly competitive, intensely nerdy college. It felt like I’d spent my whole life up to that point as a fish out of water, leaping from jar to cup to puddle in a desperate bid to stay alive, and suddenly I’d found my way to the ocean. To water, to other fish, to the place I’d always belonged but never had been able to find. That was college, for me.\nNot so much for Andrew. He’d applied to that same college, but he hadn’t gotten in. He hadn’t initially gotten into the flagship state university, either; his grades were too low. He’d enrolled at the local community college, then transferred to the state university after a year. He was doing okay, but he had big classes, few friends, professors who were unimpressed by his estimation of himself.\nI visited home for just two weeks at the end of the summer. Andrew and I met up at a local park and he told me stories about his summer working at the local pool. He’d gotten lifeguard certification but, he told me cheerfully, he was probably the world’s worst lifeguard, using his dark sunglasses to conceal naps.\n“What if someone actually gets into trouble?” I said.\n“They’d better yell loud enough to wake me up, then,” Andrew said in a cheerful tone.\nPeople who are drowning can’t yell. They have water in their lungs; that’s literally what drowning means. I didn’t want to scold him. Surely no one had actually died on his watch, or I’d have heard. Also, I was never certain when he was joking. I forced a laugh, told myself this was definitely a joke, and described the research fellowship a bit. We were doing DNA sequencing, using one of the first automated machines for that purpose; I was studying the genome of a bacteria that mostly just lives harmlessly on human skin but can on occasion cause raging infections of various kinds, or food poisoning. I found the fact that it could be harmless or deadly really fascinating. It took me longer than it probably should have to realize that Andrew was a lot less interested than I was.\n“You really are a nerd,” he said, finally. I wasn’t sure I was right that I was hearing contempt in his voice—I mean, this was Andrew. My best friend. My best friend from high school, anyway. I’d told him earlier about Beth, my best friend in college, who grew up in Arkansas and liked to crochet mathematical forms. I’d brought along a yarn stellated rhombic dodecahedron she’d made me for my birthday. I wondered if I should show that to Andrew, like I’d planned, or if that would make him angrier. More contemptuous.\nWhat’s wrong with me, I thought, and then I thought, there’s nothing wrong with me. The problem here is him. He’s acting like an asshole.\nI made some excuses and left.\nWe didn’t talk for twenty years.\nGenetics became my life’s work. Sequencing, first, through my undergraduate years and the beginning of graduate school. Genetic engineering, starting midway through graduate school and continuing through my postdoctoral work and my years at the university. CRISPR, when CRISPR became available, was just one more tool, but a particularly fascinating one. My focus was genetic diseases in humans.\nThere are basically two approaches to genetic diseases. The first is to test people—this has gotten cheaper and easier every year—and discourage carriers from having genetic children with other carriers. If one parent carries the gene for cystic fibrosis, but the other doesn’t, none of their children will have the disease. The problem with this approach is that because carriers will continue to have children with noncarriers, the genes themselves stay in the population and at least a few babies with genetic diseases are more or less inevitable. (Please note, I’m not talking about eliminating neurodiversity from the population, or anything that could possibly be a reasonable human variation. I’m talking about diseases that cause years of misery and an inevitable early death, like cystic fibrosis, or diseases that just kill any child unlucky enough to have them, like Tay-Sachs.) The second approach is to step into the genome with the tools we have and simply fix it. If we use something like CRISPR to edit an embryo’s genome, we can not only ensure that the child born from that embryo will not have Tay-Sachs or cystic fibrosis, we can ensure that they will also not grow up to pass along that particular gene.\nUsing techniques like this on humans beyond the embryo stage is years away. Or at least, I assumed it was years away.\nAndrew got back in touch through Facebook. When I friended him back, he sent me a private message—CECILY, wow, when I found out your family had moved out of town I thought I’d never catch up with you again. What are you up to these days?\nI’m a professor at Johns Hopkins, and Andrew was a lot more enthusiastic about my work now than the last time we talked, which was reassuring; he’d matured, clearly. And we’d both grown up; I was no longer the angry, insecure girl I’d been at that point in my life. I’d found my place in the world a long time ago.\nWe started chatting regularly again. Andrew told me about his job at a biotech start-up. It had taken him a lot longer to get through college and it didn’t sound like he’d gotten through a doctoral program, but skills count for more outside of academia and he’d always had an abundance of intelligence and creativity. He’d signed a nondisclosure agreement, he said. As head researcher at a university lab, I had not.\n“I would give anything to see that paper you’re working on,” he said one day, after I’d told him about the research I was doing into whether gene-editing technology—not CRISPR, but I’d started with CRISPR—could be used beyond the embryonic stage.\nI sent it to him.\nWhen the FBI agent came to my lab, I assumed she was looking for my colleague Jeanine, who developed a process for recovering DNA from centuries-old bones. She was not. “Dr. Cecily Grantz?” she asked. “Do you have a few minutes?”\nI looked at the clock on my desk and said, “I have a class to teach later today, but not until 2 PM. How can I help you?”\nShe closed my door, and pulled up a chair, like a student looking for help with a confusing assignment. “I’m Agent Locke,” she said. “I’m here to ask you a few questions about someone I think you know.”\nWhat’s Andrew done, I thought.\nOn some level, I must have known all along.\nAgent Locke showed me photos: Andrew’s one-person lab, with a tidy row of molecular printers directly adjacent to a hospital bed with restraint straps dangling down. The home freezer where he kept genetic samples for his record-keeping. And the bodies. The bodies that had torn themselves apart as his serum had wreaked its horrifying havoc. There were many bodies. He’d run test, after test, after test.\nHe’d lured in homeless teenagers. Do you need a place to stay? read an e-mail message he’d sent to two dozen separate runaways. I’m here for you.\nThere was a video interview with a girl who’d survived, barely. “I was an A-student,” she said in thick speech with a tongue that no longer wanted to cooperate. “My ex-boyfriend was stalking me. I had no way to protect myself. I wanted to be strong. He promised me this would make me strong.”\nHe’d used my research for this. Then adjusted the serum. Improved it. Changed his approach. Found more test subjects.\nLeft their bodies in shallow graves.\nAgent Locke wanted to see what I’d sent to Andrew. I gave her everything I had.\nI never knew him, I thought. Not really.\nHe was confident in the serum, Agent Locke told me before she left. In the end, he’d used it on himself. It had given him inhuman speed, reflexes, and strength. He’d used them to escape the armed officers who’d come to arrest him. “He broke their necks,” she said, matter-of-factly, “with his bare hands.”\nThe morning is cold and windy, and I put on extra layers before finding a car to take me to the abandoned mining town.\nThe town isn’t entirely abandoned, nor are the residents actually a secret: a clothesline runs across the former town square, with four T-shirts and two pairs of pants drying in the morning air. As I hike up a narrow trail past a four-story apartment building, a dog waits calmly in the doorway of the apartments, not approaching, his tail slowly waving back and forth.\nI think I can guess which buildings have inhabitants just based on where the satellite dishes are and where the glass windows are intact. I follow a trail up the hill. My socks and leggings get covered in tiny burrs; I also spot four patches that have been cleared of weeds and planted with something that might be that B. oleracea cultivar I’ve eaten every night at dinner.\nBack down the hill, near the river, I look over at the rusted wreckage of a very ruined car and step inside what appears to have once been an auditorium.\nIf Andrew is here, he’s given no sign.\nThe driver takes me through a mine shaft cut straight through the mountain and to the disused prison on the other side. This prison was abandoned in the 1970s, along with the mine; as with the town, there are nonetheless people living here. They grudgingly open up the gates when the driver bangs on the door and yells at them.\nThey are using the prison as a chicken farm. The doors to the empty cells all stand empty; inside, they reek of chicken droppings. When I step inside one, a chicken gabbles at me nervously and flaps her way to the other side of the cell, leaving a feather drifting in the air.\nMost of the buildings in this part of China are unheated. Certainly a prison would have been no exception, and the visceral unpleasantness overwhelms me for a moment. I wonder if the prisoners here were criminals, or political prisoners, victims of the Cultural Revolution, who they were.\nI briefly imagine Andrew here.\nIt’s what he deserves battles with no one deserves this. I don’t even know what justice would look like after what he’s done.\nAnyway, he’s not here. The longer I stand here the more certain I am that he would never hide in a prison. I can go.\nWhen I arrive back at Danzhai Village, I can see a crowd gathering on the square outside the performance space: there’s music and dancing. They’re wearing traditional clothes but the music sounds more modern. I walk up for a closer look and get pulled into the dance by a smiling lady with a silver hat. There are choreographed steps that the locals are all following, although tourists who join in are all given enthusiastic encouragement. I feel foreign, heavy-footed, and stupid, but let them egg me on for a few minutes. “Good try!” one of them says in sympathetic English.\nThe statue of the Golden Pheasant Girl looms over all of us, lit by little spotlights as the sky grows dark.\nWhen your people are starving, and the gods or dragons or magical tree demands a sacrifice, you might volunteer yourself; you might race to be the first to volunteer yourself, to spare someone you love.\nI leave the square, walk down to the edge of the river, and think about monsters.\nNadine tried to tell me. Andrew himself tried to tell me. Did I turn away from these warnings because on some level it felt like being the one person the monster would never harm made me special?\nHow sure are you that this will work? Jeanine asked when I told her a little about the plan, when she agreed to keep an eye on my lab when I left for the two-week winter break. What if they’re wrong about whether he values you?\nThat’s not why I’ve been dreading finding him. I’m confident he won’t hurt me. I’ve been dreading finding him because I’m here to turn on him. To betray him.\nBecause that is what you do when your friend is a monster. Truly a monster—not a part-time monster like a werewolf who can be contained with proper precautions, not a misunderstood monster like the Beast from the fairy tale, but a monster. You don’t defend them. You don’t deny it. You do what you have to do.\nThat doesn’t mean you want to do it.\nBack in my room, I pull up my social media and post some pictures I’ve taken: the chickens at the prison, the big empty room in the ghost town that used to be an auditorium. There were some Chinese characters painted in red on the crumbling wall, and now that I’m at my computer I plug that photo into a translation program and find out that the words say “NO SMOKING.”\nMaybe, I think, I’ve looked hard enough. Maybe I can just go home. Tell them I couldn’t find him.\nThen I see the picture I took of the clothesline strung across the village square. There’s a pair of pants hung neatly by the ankles, but for the first time I take a closer look at the shirts. There are six: two work shirts, four T-shirts. The T-shirts have printing on them.\nThere’s one with a TARDIS; one with a dragon; one with a math joke.\nHe was there. He was there. I just didn’t recognize the signal.\nI lie awake that night for hours, still drawn by that thought I had earlier: I don’t have to go through with this. I could spend another day walking around Danzhai and go home pretending I tried my best. I fall into fitful sleep about halfway through the night, then wake at some very early hour because of a commotion in the hallway outside.\nI put on my glasses, open my door, and step out to see what’s going on.\nA few doors down from mine, a room is open, light spilling out, hotel staff crowding frantically around. One of the women sees me, and she gestures for me to come. She pulls out her phone and speaks into it: it translates her words into flat, British-accented English. “You speak English. Please tell this man that we have called for a doctor.”\nMy door shuts behind me, and my heart pounds as I follow her down the hall.\nIn his hotel room, Tom is lying on the floor, writhing in pain. Around him are things the hotel staff have brought to try to help—a kettle of hot water, a bowl of ice, towels, a bottle of pills, a bottle of alcohol. He’s barely conscious. I can see the veins in his forehead bulging out like swollen twigs, the blood inside black and thick. It’s the serum—the unfinished, fatal version. I wonder how Andrew got it into him. I can guess why: I was right. Tom isn’t a “travel writer,” he came here to find Andrew.\nThe staff backs off and lets me speak to him. I’m not sure he’s conscious. “They’ve called an ambulance,” I say. “They told me to tell you that a doctor is coming.”\nTom opens his eyes a sliver, looks at me. “It’s not going to help, is it? It’s not.” His tongue isn’t cooperating; his throat is thick and his voice is raspy.\nThere have been some survivors. I don’t think he’s going to be one of them. I don’t want to tell him that, so I ask, “Do you want me to tell anyone where you are?”\nHe tries to gesture toward his nightstand. His arm flops to the side. “My wallet.”\nI take it down and open it. It’s a thin, impersonal wallet—no pictures of children, no coffee shop or grocery store loyalty cards. Just a UK driver’s license, two credit cards, and a wad of cash. Plus a single handwritten index card saying “if found . . . ” on it, with an e-mail address and a phone number. “There,” he whispers.\n“Who’s this going to reach?” I ask.\nHe tries to speak, and for a moment can’t. I think I see his lips forming “MI6,” but what comes out, in the end is just, “They’re no threat to you.” His eyes close and a moment later he starts gasping, the air catching on the edges like burrs on clothing as his throat swells. If he could control his hands he’d be grasping desperately at his throat. I stand up and back away, putting the wallet down on his bed.\n“Where is the doctor?” I ask the staff, not sure if anyone can understand me. “He needs a doctor right now or he’s going to die.”\nThe ambulance has arrived outside and the Chinese EMTs—or whatever they’re called here—run to Tom’s hotel room. I clear out, give them space to work, and am standing back in my own hotel room as they bring him out a few minutes later. Silent, and covered by a sheet.\nThe staff member who frantically brought me to Tom’s side knocks on my door a few minutes later. She has a tray with tea, and sliced melon, and the steamed buns they serve at breakfast. Also a newspaper, because she’s seen me buying newspapers, and I flinch a little at the sight of it. I certainly don’t need that today.\nHer face is tearstained and filled with guilt and shame. I want to reassure her that this catastrophe in her hotel was not her fault, but I don’t want to dig myself into a hole I won’t be able to get out of if anyone comes asking questions, so I say xie xie and let her go.\nToday, the clothesline is empty. I go to the entrance of the building that has the satellite dishes, hand the dog a treat I’ve brought along to increase the chances of friendship, and make my way down the hallway.\nThis building is inhabited, but it’s filthy. There are doors that are closed; other doors are open, with trash spilling out. I can smell peppers and rice cooking, overlaying the smells of mildew and dry rot. Somewhere in the building, there’s a TV on. I know it’s a TV just from the buoyant tone of the voices. TV Announcer Voice is one of those weird cultural constants.\nWhen I reach door 28, I knock on it. Twenty-eight was my favorite number when I was a kid. (It’s a perfect number. That means that if you break it down into its factors, and add those numbers together, you get the number again. 1+ 2 + 4 + 7 + 14 = 28. Andrew didn’t much care about perfect numbers, but he listened to me talk about them.)\nHe answers the door.\nI’m not entirely sure what to expect, but I’m surprised to see that he’s shaved and clean, so “unshaven” was apparently what I was expecting. His hair is a lot grayer than in the pictures he had on his social media. “Cecily,” he says, and his voice sounds exactly like I remember, which is also, in its own way, a surprise. “Come in.” He steps back from the door and I follow him into the apartment.\nThere’s a table, two rickety chairs, a large cask of water, a small gas burner. He puts water on to boil, and silently makes tea for both of us. I watch the leaves unfurl, not speaking.\n“You came all this way,” he says. “I’m sorry I can’t offer you nicer surroundings.”\nUnbidden, the image of the bed with the straps rises up in my mind and I bow my head over my tea and pretend to drink it. He watches me, and I look up in time to see his face shift. He thought I’d come to help him. Or to warn him. Or just to see him. But he knows, now.\n“How soon are they coming?” he asks.\n“I don’t know,” I say.\nHe looks up at the ceiling, blinks back tears.\n“Why not just kill me?” he asks. “Why betray me?”\n“I seriously considered that option,” I say. “But I was going to have to pass through Chinese customs. Also, I’m really not a violent person. Imagine me coming at you with a gun, even if I could get it through Chinese security. Or a knife.”\nTears spill down his cheeks. “I’ve seen you throw a tray full of food into someone’s face.”\nHe doesn’t flinch away from my hand as I reach out, wipe his tears away with my thumb. “Yeah, and remember how ineffective that was? I got a trip to the principal’s office out of it, that was it.” I wipe his tears off on the side of my pants. “Why did you do it, Andrew?”\n“I told you years ago. I wanted to be strong.”\n“But to sacrifice all those people. You didn’t go seeking out the football players who were sexually harassing girls in the cafeteria line and assaulting boys in the locker room.”\n“No. I looked for people who needed to be strong. I looked for the people I wanted to help.”\nIt’s strange how easy it is to talk to him. Still. Here. My tea is growing cold on the table by my hand. “Why did you come here?”\n“I had to get out of the US before the bulletin went out. I speak Mandarin Chinese and around here, I thought maybe I could pass myself off as being from some other part of China. This region is where my grandfather came from, the one who immigrated to the US. It’s quiet. I thought I could hide here, and maybe no one would come after me.”\n“They’d have followed you to the ends of the earth, Andrew.”\nHe hears a hint in my voice, even though I didn’t mean to put one there.\n“Do they want my formula?”\nI don’t answer, which is answer enough. He laughs. A little bitterly, a little triumphantly.\n“Well,” he says. “I guess I have a bargaining chip after all.”\n“Didn’t you assume that from the beginning?”\n“You never know,” he says. “People have been known to waste what’s right in front of them.”\nIt’s true. They have.\nHe picks up his tea, and his teacup slips out of his sweat-slicked, unsteady hand, crashing to the floor. He stares after it, at his hands, which are shaking. He touches his face, feeling the sweat on his cheeks, and he looks at me. I stand up, realizing that staying as long as I did may have been a mistake.\n“They’re not coming,” he says. “You’re the only one. Why—what did you do to me—what’s happening?”\nI step away, and he reaches out and grabs my wrists. I can feel his inhuman strength, and I wonder if I’m about to find out just how wrong I was that he wouldn’t turn it against me.\n“The FBI came first. They told me what you’d done. The CIA came second. And they wanted me to make you an offer—to tell you that if you gave me your formula to bring back to the US, and it was useful to them, you could come home. There’d be no charges. They knew you were here, but they thought I’d be able to approach you.”\n“But instead,” he says, “You decided to kill me.”\n“I demanded your notes. I said I needed whatever they had so that I could tell—or at least guess—before leaving China whether you were giving me fake information. They gave me what they had. I designed a bacterium that’s harmless to most humans. Harmless, in fact, to any human who hasn’t had the serum. It’s fatal to you. It undoes, but only partially, what your serum did for you.”\n“I don’t need to kill you,” he whispers. “They’ll kill you.”\n“Maybe,” I say. “I’m going to tell them that your serum wasn’t as good as you thought. That you died from its effects. Hopefully that’ll discourage them from further research.”\n“What if it doesn’t? What if they just start with the notes I left behind? You don’t think the US Military will kill thousands to get this serum?”\n“No,” I say, honestly. “Not because they aren’t evil. But because in the end, even the strongest, fastest, smartest human is still a human, and still the weakest link in the chain.”\nOvercome with dizziness, Andrew lurches to the side, grabbing his table for support; he tries to lower himself back to his chair, but misses, and lands hard on the floor. His window to kill me has probably closed.\nHe covers his face with his hands, and then says, “You’re a terrible liar. You’re the worst liar I’ve ever met. You barely fooled me for five minutes and I don’t think you’ll be able to fool the people who sent you.”\n“Maybe not,” I say. “But if your serum dies with you, it’ll still be worth it.”\nHe laughs, very faintly, and waves toward a corner. “My laptop,” he says. “Password is your name.”\nHis clothes are soaked with his sweat, and now he’s starting to cough, as his lungs fill with fluid released from their own cells. He gasps for air, like Tom did. Unlike Tom, his eyes are open. Open, and fixed on me. I watch as the whites of his eyes turn red, then black, as the blood vessels in them hemorrhage.\nOne summer day when we were sixteen or seventeen, we went to a park and climbed up onto the roof of the picnic shelter and watched the sunset, and watched the sky grow dark, and then lay on the warm roof and looked up at the sky and watched for falling stars. It was the night of a meteor shower and my parents weren’t willing to let me stay out all night to watch it at its height (which was supposed to be three to five AM) unless I wanted to do that from our backyard, but they were willing to let me stay out until midnight, so that’s how late we stayed.\n“Are you going to wish on the falling stars?” he asked.\n“That seems silly,” I said. “I mean, they’re not anything magical. They’re caused by debris from a comet. They just look cool.”\n“You’re so scientific,” he said, complaining a little. “I bet you wished on shooting stars when you were little.”\n“Yeah,” I say.\n“So what did you wish for when you were little?” he asked, when I didn’t elaborate.\n“I wished for a friend,” I said. “It wasn’t just falling stars, either. First star of the night, white horses, whatever. I always wished for a friend.”\nThe story I’m going to tell is that he was dead when I arrived.\nAndrew’s right that I’m not a very accomplished liar. But this is a simple lie.\nThey will definitely want his laptop. But he’s given me the password—and that means I can ensure that the data is unrecoverable, even if he didn’t.\nI take gloves out of my pocket, pour out my tea, and return the cup to the cabinet, thinking about the step I’m about to take. Laptops are often very personal. Mine has my work in progress, but it also has notes, journal entries, letters, musings, poetry.\nI would very much like to take the time to read all the things on Andrew’s laptop that are not his research notes for the serum.\nBut I’ve already murdered my friend; if I don’t destroy his notes, that will have been for nothing. So I wake the laptop, unlock it. I format the hard drive, then encrypt the formatted drive, making a fist and tapping the keyboard randomly to create a key for the encryption. Then I close the laptop and slip it into my bag to bring home, and sit down at the table, and wait for the rise and fall of Andrew’s chest to stop.\nNaomi Kritzer has been writing science fiction and fantasy for over twenty years. Her YA novel Catfishing on CatNet (based on her short story “Cat Pictures Please”) won the 2020 Lodestar Award, Edgar Award, and Minnesota Book Award. Her latest book, Chaos on CatNet, came out from Tor Teen in April 2021. Naomi lives in St. Paul, Minnesota with her spouse, two kids, and three cats. The number of cats is subject to change without notice.", "source": "https://clarkesworldmagazine.com/kritzer_01_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Monster by Naomi Kritzer"}