{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kim Stanley Robinson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "EJwVp9zuwdmhAjwI0wQaV+2U584=", "id": null, "license": null, "comments": "", "raw_text": "11740 words, novelette, REPRINT  Mercurial   “She rules all of Oz,” said Dorothy, “and so she rules your city and you, because you are in the Winkie Country, which is part of the Land of Oz.”  “It may be,” returned the High Coco-Lorum, “for we do not study geography and have never inquired whether we live in the Land of Oz or not. And any Ruler who rules us from a distance, and unknown to us, is welcome to the job.”  —L. Frank Baum, The Lost Princess of Oz  I am not, despite the appearances, fond of crime detection. In the past, it is true, I occasionally accompanied my friend Freya Grindavik as she solved her cases, and admittedly this watsoning gave me some good material for the little tales I have written for the not-very-discriminating markets on Mars and Titan. But after the “Case of the Golden Sphere of the Lion of Mercury,” in which I ended up hanged by the feet from the clear dome of Terminator, two hundred meters above the rooftops of the city, my native lack of enthusiasm rose to the fore. And following the unfortunate “Adventure of the Vulcan Accelerator,” when Freya’s arch-foe Jan Johannsen tied us to a pile of hay under a large magnifying glass in a survival tent, there to await Mercury’s fierce dawn, I put my foot down: no more detecting. That, so to speak, was the last straw.  So when I agreed to accompany Freya to the Solday party of Heidi van Seegeren, it was against my better judgment. But Freya assured me there would be no business involved; and despite the obvious excesses, I enjoy a Solday party as much as the next esthete. So when she came by my villa, I was ready.  “Make haste,” she said. “We’re late, and I must be before Heidi’s Monet when the Great Gates are opened. I adore that painting.”  “Your infatuation is no secret,” I said, panting as I trailed her through the crowded streets of the city. Freya, as those of you who have read my earlier tales know, is two and a half meters tall, and broad-shouldered; she barged through the shoals of Solday celebrants rather like a whale, and I, pilot-fish-like, dodged in her wake. She led me through a group of Grays, who with carpetbeaters were busy pounding rugs saturated with yellow dust. As I coughed and brushed off my fine burgundy suit, I said, “My feeling is that you have taken me to view that antique canvas once or twice too often.”  She looked at me sternly. “As you will see, on Solday it transcends even its usual beauty. You look like a bee drowning in pollen, Nathaniel.”  “Whose fault is that?” I demanded, brushing my suit fastidiously.  We came to the gate in the wall surrounding Van Seegeren’s town villa, and Freya banged on it loudly. The gate was opened by a scowling man. He was nearly a meter shorter than Freya, and had a balding head that bulged rather like the dome of the city. In a mincing voice he said, “Invitations?”  “What’s this?” said Freya. “We have permanent invitations from Heidi.”  “I’m sorry,” the man said coolly. “Ms. Van Seegeren has decided her Solday parties have gotten overcrowded, and this time she sent out invitations, and instructed me to let in only those who have them.”  “Then there has been a mistake,” Freya declared. “Get Heidi on the intercom, and she will instruct you to let me in. I am Freya Grindavik, and this is Nathaniel Sebastian.”  “I’m sorry,” the man said, quite unapologetically. “Every person turned away says the same thing, and Ms. Van Seegeren prefers not to be disturbed so frequently.”  “She’ll be more disturbed to hear we’ve been held up,” Freya shifted toward the man. “And who might you be?”  “I am Sander Musgrave, Ms. Van Seegeren’s private secretary.”  “How come I’ve never met you?”  “Ms. Van Seegeren hired me two months ago,” Musgrave said, and stepped back so he could look Freya in the eye without straining his neck. “That is immaterial, however—”  “I’ve been Heidi’s friend for over forty years,” Freya said slowly, once again shifting forward to lean over the man. “And I would wager she values her friends more than her secretaries.”  Musgrave stepped back indignantly. “I’m sorry!” he snapped. “I have my orders! Good day!”  But alas for him, Freya was now standing well in the gateway, and she seemed uninclined to move; she merely cocked her head at him. Musgrave comprehended his problem, and his mouth twitched uncertainly.  The impasse was broken when Van Seegeren’s maid Lucinda arrived from the street. “Oh, hello, Freya, Nathaniel. What are you doing out here?”  “This new Malvolio of yours is barring our entrance,” Freya said.  “Oh, Musgrave,” said Lucinda. “Let these two in, or the boss will be mad.”  Musgrave retreated with a deep scowl. “I’ve studied the ancients, Ms. Grindavik,” he said sullenly. “You need not insult me.”  “Malvolio was a tragic character,” Freya assured him. “Read Charles Lamb’s essay concerning the matter.”  “I certainly will,” Musgrave said stiffly, and hurried to the villa, giving us a last poisonous look.  “Of course, Lamb’s father,” Freya said absently, staring after the man, “was a house servant. Lucinda, who is that?”  Lucinda rolled her eyes. “The boss hired him to restore some of her paintings, and get the records in order. I wish she hadn’t.”  The bell in the gate sounded. “I’ve got it, Musgrave,” Lucinda shouted at the villa. She opened the gate, revealing the artist Harvey Washburn.  “So you do,” said Harvey, blinking. He was high again; a bottle of the White Brother hung from his hand. “Freya! Nathaniel! Happy Solday to you—have a drink?”  We refused the offer, and then followed Harvey around the side of the villa, exchanging a glance. I felt sorry for Harvey. Most of Mercury’s great collectors came to Harvey’s showings, but they dissected his every brushstroke for influences, and told him what he should be painting, and then among themselves they called his work amateurish and unoriginal, and never bought a single canvas. I was never surprised to see him drinking.  We rounded the side of the big villa and stepped onto the white stone patio, which was made of a giant slab of England’s Dover cliffs, cut out and transported to Mercury entire. Malvolio Musgrave had spoken the truth about Heidi reducing the size of her Solday party: where often the patio had been jammed, there were now fewer than a dozen people. I spotted George Butler, Heidi’s friend and rival art collector, and Arnold Ohman, the art dealer who had obtained for many of Mercury’s collectors their ancient masterpieces from Earth. As I greeted them Freya led us all across the patio to the back wall of the villa, which was also fronted with white slabs of the Dover cliffs. There, all alone, hung Claude Monet’s Rouen Cathedral—Sun Effect. “Look at it, Nathaniel!” Freya commanded me. “Isn’t it beautiful?”  I looked at it. Now you must understand that, as owner of the Gallery Orientale, and by deepest personal esthetic conviction, I am a connoisseur of Chinese art, a style in which a dozen artfully spontaneous brushstrokes can serve to delineate a mountain or two, several trees, a small village and its inhabitants, and perhaps some birds. Given my predilection, you will not be surprised to learn that to look at the antique rectangle of color that Freya so admired was to risk damaging my eyes. Thick scumbled layers of grainy paint scarcely revealed the cathedral of the title, which wavered under a blast of light so intense that I doubted Mercury’s midday could compete with it. Small blobs of every color served to represent both the indistinct stone and a pebbly sky, both were composed of combinations principally of white, yellow, and purple, though as I say every other color made an appearance.  “Stunning,” I said, with a severe squint. “Are you sure this Monet wasn’t a bit nearsighted?”  Freya glared at me, ignoring Butler’s chuckles. “I suppose your comment might have been funny the first time you made it. To children, anyway.”  “But I heard it was actually true,” I said, shielding my eyes with one hand. “Monet was nearsighted, and so, like Goya, his vision affected his painting—”  “I should hope so,” Harvey said solemnly.  “—so all he could see were those blobs of color; isn’t that sad?”  Freya shook her head. “You won’t get a rise out of me today, Nathaniel. You’ll have to think up your dinner conversation by yourself.”  Momentarily stopped by this riposte, I retired with Arnold Ohman to Heidi’s patio bar. After dialing drinks from the bartender we sat on the blocks of Dover cliffs that made up the patio’s outer wall. We toasted Solday, and contemplated the clouds of yellow talc that swirled over the orange tile rooftops below us. For those of you who have never visited it, Terminator is an oval city. The forward half of the city is flat, and projects out under the clear dome. The rear half of the oval is terraced, and rises to the tall Dawn Wall which supports the upper rim of the dome, and shields the city from the perpetually rising sun. The Great Gates of Terminator are near the top of the Dawn Wall, and when they are opened shafts of Sol’s overwhelming light spear through the city’s air, illuminating everything in a yellow brilliance. Heidi van Seegeren’s villa was about halfway up the terraced slope; we looked upon gray stone walls, orange tile roofs, and the dusty vines and lemon trees of the terrace gardens that dotted the city. Outside the dome the twelve big tracks of the city extended off to the horizon, circling the planet like a slender silver wedding band. It was a fine view, and I lifted my glass remembering that Claude Monet wasn’t there to paint it. For sometimes, if you ask me, reality is enough.  Ohman downed his drink in one swallow. Rumor had it that he was borrowing heavily to finance one of his big Terran purchases; it was whispered he was planning to buy the closed portion of the Louvre—or the Renaissance room of the Vatican museum—or Amsterdam’s Van Gogh collection. But rumors like that circulated around Arnold continuously. He was that kind of dealer. It was unlikely any of them were true; still, his silence seemed to reveal a certain tension.  “Look at the way Freya is soaking in that painting you got for Heidi,” I said, to lift his spirits. Freya’s face was within centimeters of the canvas, where she could examine it blob by blob; the people behind her could see nothing but her white-blond hair. Ohman smiled at the sight. He had brought the Monet back from his most recent Terran expedition, and apparently it had been a great struggle to obtain it. Both the English family that owned it and the British government had had to be paid enormous sums to secure its release, and only the fact that Mercury was universally considered humanity’s greatest art museum had cleared the matter with the courts. It had been one of Arnold’s finest hours.  Now he said, “Maybe we should pull her away a bit, so that others can see.”  “If both of us tug on her it may work,” I said. We stood and went to her side. Harvey Washburn, looking flushed and frazzled, joined us, and we convinced Freya to share the glory. Ohman and Butler conferred over something, and entered the villa through the big French doors that led into the concert room. Inside, Heidi’s orchestra rolled up and down the scales of Moussorgsky’s Hut of Baba Yaga. That meant it was close to the time when the Great Gates would open (Heidi always gets inside information about this).  Sure enough, as Moussorgsky’s composition burst from The Hut of Baba Yaga into The Great Gates of Kiev, two splinters of white light split the air under the dome. Shouts and fanfares rose everywhere, nearly drowning the amplified sound of our orchestra. Slowly the Great Gates opened, and as they did the shafts of light grew to thick buttery gold bars of air. By their rich, nearly blinding glare, Heidi van Seegeren made her first entrance from her villa, timing her steps to the exaggerated Maazel ritard that her conductor Hiu employed every Solday when Pictures at an Exhibition was performed. This ritard shifted the music from the merely grandiose to the utterly bombastical, and it took Heidi over a minute to cross her own narrow patio; but I suppose it was not entirely silly, given the ritual nature of the moment, and the flood of light that was making the air appear a thick, quite tangible gel. What with the light, and the uproar created by the keening Grays and the many orchestras in the neighborhood, each playing their own overture or fanfare (the Coriolan came from one side of us, the 1812 from the other), it was a complex and I might even say noisy esthetic moment, and the last thing I needed was to take another look at the Monet monstrosity, but Freya would not have it otherwise.  “You’ve never seen it when the Great Gates are opened,” she said. “That was the whole point in bringing you here today.”  “I see.” Actually I barely saw anything; as Freya had guided me by the arm to the painting I had accidentally looked directly at the incandescent yellow bars of sunlight and brilliant blue afterimages bounced in my sight. I heard rather than saw Harvey Washburn join us. Many blinks later I was able to join the others in devoting my attention to the big canvas.  Well. The Monet positively glowed in the dense, lambent air; it gave off light like a lamp, vibrating with a palpable energy of its own. At the sight of it even I was impressed.  “Yes,” I admitted to Freya and Harvey, “I can see how precisely he placed all those little chunks of color, and I can see how sharp and solid the cathedral is under all that goo, but it’s like Solday, you know, it’s a heightened effect. The result is garish, really; it’s too much.”  “But this is a painting of midday,” Harvey said. “And as you can see, midday can get pretty garish.”  “But this is Terminator! The Grays have put a lot of talc in the air to make it look this way!”  “So what?” Freya demanded impatiently. “Stop thinking so much, Nathaniel. Just look at it. See it. Isn’t it beautiful? Haven’t you felt things look that way sometimes, seeing stone in sunlight?”  “Well . . . ” And, since I am a strictly honest person, if I had said anything at all I would have had to admit that it did have a power about it. It drew the eye; it poured light onto us as surely as the beams of sunlight extending from the gates in the Dawn Wall to the curved side of the clear dome.  “Well?” Freya demanded.  “Well yes,” I said. “Yes I see that cathedral front—I feel it. But there must have been quite a heat wave in old Rouen. It’s as if Monet had seen Terminator on Solday, the painting fits so well with this light.”  “No,” Freya said, but her left eye was squinted, a sign she was thinking.  Harvey said, “We make the conditions of light in Terminator, and so it is an act of the imagination, like this painting. You shouldn’t be surprised if there are similarities: We value this light because the old masters created it on their canvases.”  I shook my head, and indicated the brassy bedlam around us. “No. I believe we made this one up ourselves.”  Freya and Harvey laughed, with the giddiness that Solday inspires.  Suddenly a loud screech came from inside the villa. Freya hurried across the patio into the music room, and I followed her. Both of us, however, had forgotten the arrangements that Heidi made on Soldays to cast the brilliant light throughout her home, and as we ran past the silenced orchestra into a hallway we were blasted by light from a big mirror carefully placed in the villa’s central atrium. Screams still echoed from somewhere inside, but we could only stumble blindly through bright pulsing afterimages, retinal Monets if you will, while unidentified persons bowled into us, and mirrors crashed to the floor. And the atrium was raised, so that occasional steps up in the hallway tripped us.  “Murder!” someone cried. “Murder! There he goes!” And with that a whole group of us were off down the halls like hounds—blind hounds—baying after unknown prey. A figure leaped from behind a mirror glaring white, and Freya and I tackled it just inside the atrium.  When my vision swam back I saw it was George Butler. “What’s going on?” he asked, very politely for a man who had just been jumped on by Freya Grindavik.  “Don’t ask us,” Freya said irritably.  “Murder!” shrieked Lucinda, from the hallway that led from the atrium directly back to the patio. We jumped up and crowded into the hallway. Just beyond a mirror shattered into many pieces lay a man’s body; apparently he had been crawling toward the patio when he collapsed, and one arm and finger extended ahead of him, still pointing to the patio. Freya approached, gingerly turned the body’s head. “It’s that Musgrave fellow,” she said, blinking to clear her sight. “He’s dead, all right. Struck on the head with the mirror there, no doubt.”  Heidi van Seegeren joined us. “What’s going on?”  “That was my question,” George Butler said.  Freya explained the situation to her.  “Call the police,” Heidi said to Lucinda. “And I suppose no one should leave.”  I sighed.  And so crime detection ensnared me once again. I helped Freya by circulating on the patio, calming the shocked and nervous guests. “Um, excuse me, very sorry to inform you, yes, sorry—hard to believe, yes—somebody had it in for the secretary Musgrave, it appears”—all the while watching to see if anyone would jump, or turn pale, or start to run when I told them. Then, of course, I had to lead gently to the idea that everyone had gone from guest to suspect, soon to be questioned by Freya and the police. “No, no, of course you’re not suspected of anything, farthest thing from our minds, it’s just that Freya wants to know if there’s anything you saw that would help,” and so on. Then I had to do the difficult scheduling of Freya’s interviews, at the same time I was supposed to keep an eye out for anything suspicious.  Oh, the watson does the dirty work, all right. No wonder we always look dense when the detective unveils the solutions; we never have the time even to get the facts straight, much less meditate on their meaning. All I got that day were fragments: Lucinda whispered to me that Musgrave had worked for George Butler before Heidi hired him. Harvey Washburn told me that Musgrave had once been an artist, and that he had only recently moved to Mercury from Earth; this was his first Solday. That didn’t give him much time to be hired by Butler, fired, and then hired by Van Seegeren. But was that of significance?  Late in the day I spoke with one of the police officers handling the case. She was relieved to have the help of Freya Grindavik. Terminator’s police force is small, and often relies on the help of the city’s famous detective for the more difficult cases. The officer gave me a general outline of what they had learned: Lucinda had heard a shout for help, had stepped into the atrium and seen a bloodied figure crawling down the hallway toward the patio. She had screamed and run for help, but only in the hallway was clear vision possible, and she had quickly gotten lost. After that, chaos; everyone at the party had a different tale of confusion.  Following that conversation I had nothing more to do, so I got all the sequestered guests coffee, and helped pick up some of the broken hall mirrors, and passed some time prowling Heidi’s villa, getting down on my hands and knees with the police robots to inspect a stain or two.  When Freya was finished with her interrogations, she promised Heidi and the police that she would see the case to its end—at least provisionally: “I only do this for entertainment,” she told them irritably. “I’ll stay with it as long as it entertains me. And I shall entertain myself with it.”  “That’s all right,” said the police, who had heard this before. “Just so long as you’ll take the case.” Freya nodded, and we left.  The Solday celebration was long since over; the Great Gates were closed, and once again through the dome shone the black sky. I said to Freya, “Did you hear about Musgrave working for Butler? And how he came from Earth just recently?” For you see, once on the scent I am committed to seeing a case solved.  “Please, Nathaniel,” Freya said. “I heard all of that and more. Musgrave stole the concept of Harvey Washburn’s first series of paintings, he blackmailed both Butler and our host Heidi to obtain his jobs from them—or so I deduce, from their protestations, and from certain facts concerning their recent questionable merger that I am privy to. And he tried to assault Lucinda, who is engaged to the cook Delaurence—” She let out a long sigh. “Motives are everywhere.”  Bemused, I said, “It seems this Musgrave was a thoroughly despicable sort.”  “Yes. An habitual blackmailer.”  “Nothing suggests itself to you?”  “No. Not only that, but it seems almost every person at the party had a good alibi for the moment of the murder! Oh, I don’t know why I agree to solve these things. Here I am committed to this head-bashing, and my best clue is something that you suggested.”  “I wasn’t aware that I had suggested anything!”  “There is a fresh perspective to ignorance that can be very helpful.”  “So it is important that Musgrave just arrived from Earth?”  She laughed. “Let’s stop in the Plaza Dubrovnik and get something to eat. I’m starving.”  Almost three weeks passed without a word from Freya, and I began to suspect that she was ignoring the case. Freya has no real sense of right and wrong, you see; she regards her cases as games, to be tossed aside if they prove too taxing. More than once she has cheerfully admitted defeat, and blithely forgotten any promises she may have made. She is not a moral person.  So I dropped by her home near Plaza Dubrovnik one evening, to rouse her from her irresponsible indifference. When she answered the door there were paint smudges on her face and hands.  “Freya,” I scolded her. “How could you take up an entirely new hobby when there is a case to be solved?”  “Generously I allow you entrance after such a false accusation,” she said. “But you will have to eat your words.”  She led me downstairs to her basement laboratory, which extended the entire length and breadth of her villa.  There on a big white-topped table lay Heidi van Seegeren’s Monet, looking like the three-dimensional geologic map of some minerally blessed country.  “What’s this?” I exclaimed. “Why is this here?”  “I believe it is a fake,” she said shortly, returning to a computer console.  “Wait a moment!” I cried. On the table around the painting were rolls of recording chart paper, lab notebooks, and what looked like black-and-white photos of the painting. “What do you mean?”  After tapping at the console she turned to me. “I mean I believe it’s a fake!”  “But I thought art forgery was extinct. It is too easy to discover a fake.”  “Ha!” She waved a finger at me angrily. “You pick a bad time to say so. It is a common opinion, of course, but not necessarily true.”  I regarded the canvas more closely. “What makes you think this a fake? I thought it was judged a masterpiece of its period.”  “Something you said first caused me to question it,” she said. “You mentioned that the painting seemed to have been created by an artist familiar with the light of Terminator. This seemed true to me, and it caused me to reflect that one of the classic signs of a fake was anachronistic sensibility—that is to say, the forger injects into his vision of the past some element of his time that is so much a part of his sensibility that he cannot perceive it. Thus the Victorians faked Renaissance faces with a sentimentality that only they could not immediately see.”  “I see.” I nodded sagely. “It did seem that cathedral had been struck with Solday light, didn’t it?”  “Yes. The trouble is, I have been able to find no sign of forgery in the physical properties of the painting.” She shook her head. “And after three weeks of uninterrupted chemical analysis, that is beginning to worry me.”  “But Freya,” I said, as something occurred to me. “Does all this have a bearing on the Musgrave murder?”  “I think so,” she replied. “And if not, it is certainly more interesting. But I believe it does.”  I nodded. “So what, exactly, have you found?”  She smiled ironically. “You truly want to know? Well. The best test for anachronisms is the polonium 210, radium 226 equilibrium—”  “Please, Freya. No jargon.”  “Jargon!” She raised an eyebrow to scorn me. “There is no such thing. Intelligence is like mold in a Petri dish—as it eats ever deeper into the agar of reality, language has to expand with it to describe what has been digested. Each specialty provides the new vocabulary for its area of feeding, and gets accused of fabricating jargon by those who know no better. I’m surprised to hear such nonsense from you. Or perhaps not.”  “Very well,” I said, hands up. “Still, you must communicate your meaning to me.”  “I shall. First I analyzed the canvas. The material and its weave match the characteristics of the canvas made by the factory outside Paris that provided Monet throughout the painting of the Rouen cathedral series. Both the fabric and the glue appear very old, though there is no precise dating technique for them. And there was no trace of solvents that might have been used to strip paint off a genuine canvas of the period.  “I then turned to the paint. Follow so far?” she asked sharply. “Paint?”  “You may proceed without further sarcasm, unless unable to control yourself.”  “The palette of an artist as famous as Monet has been studied in detail, so that we know he preferred cadmium yellow to chromium yellow or Naples yellow, that he tended to use Prussian blue rather than cobalt blue, and so on.” She tapped the flecks of blue at the base of the cathedral. “Prussian blue.”  “You’ve taken paint off the canvas?”  “How else test it? But I took very small samples, I assure you. Whatever the truth concerning the work, it remains a masterpiece, and I would not mar it. Besides, most of my tests were on the white paint, of which there is a great quantity, as you can see.”  I leaned over to stare more closely at the canvas. “Why the white paint?”  “Because lead white is one of the best dating tools we have. The manufacturing methods used to make it changed frequently around Monet’s time, and each change in method altered the chemical composition of the paint. After 1870, for instance, the cheaper zinc white was used to adulterate lead white, so there should be over one percent zinc in Monet’s lead white.”  “And is that what you found?”  “Yes. The atomic absorption spectrum showed—” She dug around in the pile of chart paper on the table. “Well, take my word for it—”  “I will.”  “Nearly twelve percent. And the silver content for late-nineteenth-century lead white should be around four parts per million, the copper content about sixty parts per million. So it is with this paint. There is no insoluble antimony component, as there would be if the paint had been manufactured after 1940. The X-ray diffraction pattern”—she unrolled a length of chart paper and showed me where three sharp peaks in a row had been penned by the machine—“is exactly right, and there is the proper balance of polonium 210 and radium 226. That’s very important, by the way, because when lead white is manufactured the radioactive balance of some of its elements is upset, and it takes a good three hundred years for them to decay back to equilibrium. And this paint is indeed back to that equilibrium.”  “So the paints are Monet’s,” I concluded. “Doesn’t that prove the work authentic?”  “Perhaps,” Freya admitted. “But as I was doing all this analysis, it occurred to me that a modern forger has just as much information concerning Monet’s palette as I do. With a modern laboratory it would be possible to use such information as a recipe, so to speak, and then to synthesize paints that would match the recipe exactly. Even the radioactively decayed lead white could be arranged, by avoiding the procedures that disrupt the radioactive balance in the first place!”  “Wouldn’t that be terrifically complicated?”  Freya stared at me. “Obviously, Nathaniel, we are dealing with a very, very meticulous faker here. But how else could it be done, in this day and age? Why else do it at all? The complete faker must take care to anticipate every test available, and then in a modern laboratory create the appropriate results for every one of them. It’s admirable!”  “Assuming there ever was such a forger,” I said dubiously. “It seems to me that what you have actually done here is prove the painting genuine.”  “I don’t think so.”  “But even with these paints made by recipe, as you call them, the faker would still have to paint the painting!”  “Exactly. Conceive the painting, and execute it. It becomes very impressive, I confess.” She walked around the table to look at the work from the correct angle. “I do believe this is one of the best of the Rouen cathedral series—astonishing, that a forger would be capable of it.”  “That brings up another matter,” I said. “Doesn’t this work have a five-hundred-year-old pedigree? How could a whole history have been provided for it?”  “Good question. But I believe I have discovered the way. Let’s go upstairs—you interrupted my preparations for lunch, and I’m hungry.”  I followed her to her extensive kitchen, and sat in the window nook that overlooked the tile rooftops of the lower city while she finished chopping up the vegetables for a large salad.  “Do you know the painting’s history?” Freya asked, looking up from a dissected head of lettuce.  I shook my head. “Up until now the thing has not been of overwhelming interest to me.”  “A confession of faulty esthetics. The work was photographed at the original exhibit in 1895, Durand-Ruel photo 5828 L8451. All of the information appended to the photo fits our painting—same name, size, signature location. Then for a century it disappeared. Odd. But it turned out to have been in the estate of an Evans family, in Aylesbury, England. When the family had some conservation work done on one corner it returned to public knowledge, and was photographed for a dozen books of the twenty-first and twenty-second centuries. After that it slipped back into obscurity, but it is as well documented as any of the series belonging to private estates.”  “Exactly my point,” I said. “How could such a history be forged?”  As Freya mixed the salad she smiled. “I sat and thought about that for quite some time myself. But consider it freshly, Nathaniel. How do we know what we know of the past?”  “Well,” I said, somewhat at a loss. “From data banks, I suppose. And books—documents—historians—”  “From historians!” She laughed. She provided us both with bowls, and sat across from me. As I filled mine she said, “So we want to know something of the past. We go to our library and sit at its terminal. We call up general reference works, or a bibliographical index, and we choose, if we want, books that we would like to have in our hands. We type in the appropriate code, our printer prints up the appropriate book, and the volume slides out of the computer into our waiting grasp.” She paused to fork down several mouthfuls of salad. “So we learn about the past using computer programs. And a clever programmer, you see, can change a program. It would be possible to insert extra pages into these old books on Monet, and thus add the forged painting to the record of the past.”  I paused, a cherry tomato hovering before my mouth. “But—”  “I searched for an original of any of these books containing photos of our painting,” Freya said. “I called all over Mercury, and to several incunabulists in libraries on Earth—you wouldn’t believe the phone bill I’ve run up. But the original printings of these art volumes were very small, and although first editions probably remain somewhere, they are not to be found. Certainly there are no first editions of these books on Mercury, and none immediately locatable on Earth. It began to seem a very unlikely coincidence, as if these volumes contained pictures of our painting precisely because they existed only in the data banks, and thus could be altered without discovery.”  She attended to her salad, and we finished eating in silence. All the while my mind was spinning furiously, and when we were done I said, “What about the original exhibit photo?”  She nodded, pleased with me. “That, apparently, is genuine. But the Durand-Ruel photos include four or five paintings that have never been seen since. In that sense the Rouen cathedral series is a good one for a faker; from the first it has never been clear how many cathedrals Monet painted. The usual number given is thirty-two, but there are more in the Durand-Ruel list, and a faker could examine the list and use one of the lost items as a prescription for his fake. Providing a later history with the aid of these obscure art books would result in a fairly complete pedigree.”  “But could such an addition to the data banks be made?”  “It would be easiest done on Earth,” Freya said. “But there is no close security guarding the banks containing old art books. No one expects them to be tampered with.”  “It’s astonishing,” I said with a wave of my fork, “it is baroque, it is byzantine in its ingenuity!”  “Yes,” she said. “Beautiful, in a way.”  “However,” I pointed out to her, “you have no proof—only this perhaps overly complex theory. You have found no first edition of a book to confirm that the computer-generated volumes add Heidi’s painting, and you have found no physical anachronism in the painting itself.”  Gloomily she clicked her fork against her empty salad bowl, then rose to refill it. “It is a problem,” she admitted. “Also, I have been working on the assumption that Sandor Musgrave discovered evidence of the forgery. But I can’t find it.”  Never let it be said that Nathaniel Sebastian has not performed a vital role in Freya Grindavik’s great feats of detection. I was the first to notice the anachronism of sensibility in Heidi’s painting; and now I had a truly inspired idea. “He was pointing to the patio!” I exclaimed. “Musgrave, in his last moment, struggled to point to the patio!”  “I had observed that,” Freya said, unimpressed.  “But Heidi’s patio—you know—it is formed out of blocks of the Dover cliffs! And thus Musgrave indicated England! Is it not possible? The Monet was owned by Englishmen until Heidi purchased it—perhaps Musgrave meant to convey that the original owners were the forgers!”  Freya’s mouth hung open in surprise, and her left eye was squinted shut. I leaped from the window nook in triumph. “I’ve solved it! I’ve solved a mystery at last.”  Freya looked up at me and laughed.  “Come now, Freya, you must admit I have given you the vital clue.”  She stood up, suddenly all business. “Yes, yes, indeed you have. Now out with you, Nathaniel; I have work to do.”  “So I did give you the vital clue?” I asked. “Musgrave was indicating the English owners?”  As she ushered me to her door Freya laughed. “As a detective your intuition is matched only by your confidence. Now leave me to work, and I will be in contact with you soon, I assure you.” And with that she urged me into the street, and I was left to consider the case alone.  Freya was true to her word, and only two days after our crucial luncheon she knocked on the door of my town villa. “Come along,” she said. “I’ve asked Arnold Ohman for an appointment; I want to ask him some questions about the Evans family. The city is passing the Monet museum, however, and he asked us to meet him out there.”  I readied myself quickly, and we proceeded to North Station. We arrived just in time to step across the gap between the two platforms, and then we were on the motionless deck of one of the outlying stations that Terminator is always passing. There we rented a car and sped west, paralleling the dozen massive cylindrical rails over which the city slides. Soon we had left Terminator behind, and when we were seventy or eighty kilometers onto the nightside of Mercury we turned to the north, to Monet Crater.  Terminator’s tracks lie very close to the thirtieth degree of latitude, in the northern hemisphere, and Monet Crater is not far from them. We crossed Endeavor Rupes rapidly, and passed between craters named after the great artists, writers, and composers of Earth’s glorious past: traversing a low pass between Holbein and Gluck, looking down at Melville and the double crater of Rodin. “I think I understand why a modern artist on Mercury might turn to forgery,” Freya said. “We are dwarfed by the past as we are by this landscape.”  “But it is still a crime,” I insisted. “If it were done often, we would not be able to distinguish the authentic from the fake.”  Freya did not reply.  I drove our car up a short rise, and we entered the sub-mercurial garage of the Monet museum, which is set deep in the southern rim of the immense crater named after the artist. One long wall of the museum is a window facing out over the crater floor, so that the central knot of peaks is visible, and the curving inner wall of the crater defines the horizon in the murky distance. Shutters slid down to protect these windows from the heat of Mercury’s long day, but now they were open and the black wasteland of the planet formed a strange backdrop to the colorful paintings that filled the long rooms of the museum.  There were many Monet originals there, but the canvases of the Rouen cathedral series were almost all reproductions, set in one long gallery. As Freya and I searched for Arnold we also viewed them.  “You see, they’re not just various moments of a single day,” Freya said.  “Not unless it was a very strange day for weather.” The three reproductions before us all depicted foggy days: two bluish and underwater-looking, the third a bright burning-off of yellow noontime fog. Obviously these were from a different day than the ones across the room, where a cool clear morning gave way to a midday that looked as if the sun were just a few feet above the cathedral. The museum had classified the series in color groups: “Blue Group,” “White Group,” “Yellow Group,” and so on. To my mind that system was stupid—it told you nothing you couldn’t immediately see. I myself classified them according to weather. There was a clear day that got very hot; a clear winter day, the air chill and pure; a foggy day; and a day when a rainstorm had grown and then broken.  When I told Freya of my system she applauded it. “So Heidi’s painting goes from the king of the White Group to the hottest moment of the hot day.”  “Exactly. It’s the most extreme in terms of sunlight blasting the stone into motes of color.”  “And thus the forger extends Monet’s own thinking, you see,” she said, a bit absently. “But I don’t see Arnold, and I think we have visited every room.”  “Could he be late?”  “We are already quite late ourselves. I wonder if he has gone back.”  “It seems unlikely,” I said.  Purposefully we toured the museum one more time, and I ignored the color-splashed canvases standing before the dark crater, to search closely in all the various turns of the galleries. No Arnold.  “Come along,” Freya said. “I suspect he stayed in Terminator, and now I want to speak with him more than ever.”  So we returned to the garage, got back in our car, and drove out onto Mercury’s bare, baked surface once again. Half an hour later we had Terminator’s tracks in sight. They stretched before us from horizon to horizon, twelve fat silvery cylinders set five meters above the ground on narrow pylons. To the east, rolling over the flank of Valazquez Crater so slowly that we could not perceive its movement without close attention, came the city itself, a giant clear half-egg filled with the colors of rooftops, gardens, and the gray stone of the building crowding the terraced Dawn Wall.  “We’ll have to go west to the next station,” I said. Then I saw something, up on the city track nearest us: spread-eagled over the top of the big cylinder was a human form in a light green daysuit. I stopped the car. “Look!”  Freya peered out her window. “We’d better go investigate.”  We struggled quickly into the car’s emergency daysuits, clamped on the helmets, and slipped through the car’s lock onto the ground. A ladder led us up the nearest cylinder pylon and through a tunnel in the cylinder itself. Once on top we could stand safely on the broad hump of the rail.  The figure we had seen was only thirty meters away from us, and we hurried to it.  It was Arnold, spread in cruciform fashion over the cylinder’s top, secured in place by three large suction plates that had been cuffed to his wrists and ankles, and then stuck to the cylinder. Arnold turned from his contemplation of the slowly approaching city, and looked at us wide-eyed through his faceplate. Freya reached down and turned on his helmet intercom.  “—am I glad to see you!” Arnold cried, voice harsh. “These plates won’t move!”  “Tied to the tracks, eh?” Freya said.  “Yes!”  “Who put you here?”  “I don’t know! I went out to meet you at the Monet museum, and the last thing I remember I was in the garage there. When I came to, I was here.”  “Does your head hurt?” I inquired.  “Yes. Like I was gassed, though, not hit. But—the city—it just came over the horizon a short time ago. Perhaps we could dispense with discussion until I am freed?”  “Relax,” Freya said, nudging one of the plates with her boot. “Are you sure you don’t know who did this, Arnold?”  “Of course! That’s what I just said! Please, Freya, can’t we talk after I get loose?”  “In a hurry, Arnold?” Freya asked.  “Of course.”  “No need to be too worried,” I assured him. “If we can’t free you the cowcatchers will be out to pry you loose.” I tried lifting a plate, but could not move it. “Surely they will find a way—it’s their job, after all.”  “True,” Arnold said.  “Usually true,” said Freya. “Arnold is probably not aware that the cowcatchers have become rather unreliable recently. Some weeks ago a murderer tied his victim to a track just as you have been, Arnold, and then somehow disengaged the cowcatchers’ sensors. The unfortunate victim was shaved into molecules by one of the sleeves of the city. It was kept quiet to avoid any attempted repetitions, but since then the cowcatchers’ sensors have continued to function erratically, and two or three suicides have been entirely too successful.”  “Perhaps this isn’t the best moment to tell us about this,” I suggested to Freya.  Arnold choked over what I took to be his agreement.  “Well,” Freya said, “I thought I should make the situation clear. Now listen, Arnold. We need to talk.”  “Please,” Arnold said. “Free me first, then talk.”  “No, no—”  “But Terminator is only a kilometer away!”  “Your perspective from that angle is deceptive,” Freya told him. “The city is at least three kilometers away.”  “More like two,” I said, as I could now make out individual rooftops under the Dawn Wall. In fact the city glowed like a big glass lamp, and illuminated the entire landscape with a faint green radiance.  “And at three point four kilometers an hour,” Freya said, “that gives us almost an hour, doesn’t it. So listen to me, Arnold. The Monet cathedral that you sold to Heidi is a fake.”  “What?” Arnold cried. “It certainly is not! And I insist this isn’t the time—”  “It is a fake. Now I want you to tell me the truth, or I will leave you here to test the cowcatchers.” She leaned over to stare down at Arnold face to face. “I know who painted the fake, as well.”  Helplessly Arnold stared up at her.  “He put you on the track here, didn’t he.”  Arnold squeezed his eyes shut, nodded slowly. “I think so.”  “So if you want to be let up, you must swear to me that you will abide by my plan for dealing with this forger. You will follow my instructions, understand?”  “I understand.”  “Do you agree?”  “I agree,” Arnold said, forcing the words out. “Now let me up!”  “All right,” Freya straightened.  “How are we going to do it?” I asked.  Freya shrugged. “I don’t know.”  At this Arnold howled, he shouted recriminations, he began to wax hysterical—  “Shut up!” Freya exclaimed. “You’re beginning to sound like a man who has made too many brightside crossings. These suction plates are little different from children’s darts.” She leaned down, grasped a plate, pulled up with all of her considerable strength. No movement. “Hmm,” she said thoughtfully.  “Freya,” Arnold said.  “One moment,” she replied, and walked back down the hump of the cylinder to the ladder tunnel, there to disappear down it.  “She’s left me,” Arnold groaned. “Left me to be crushed.”  “I don’t think so,” I said. “No doubt she has gone to the car to retrieve some useful implement.” I kicked heartily at the plate holding Arnold’s feet to the cylinder, and even managed to slide it a few centimeters down the curve, which had the effect of making Arnold suddenly taller. But other than that I made no progress.  When Freya returned she carried a bar bent at one end. “Crowbar,” she explained to us.  “But where did you get it?”  “From the car’s tool chest, naturally. Here.” She stepped over Arnold. “If we just insinuate this end of it under your cuffs, I believe we’ll have enough leverage to do the trick. The cylinder being curved, the plates’ grasp should be weakened . . . about here.” She jammed the short end of the bar under the edge of the footplates’ cuff, and pulled on the upper end of it. Over the intercom, breathless silence; her fair cheeks reddened; then suddenly Arnold’s legs flew up and over his head, leaving his arms twisted and his neck at an awkward angle. At the same time Freya staggered off the cylinder, performed a neat somersault and landed on her feet, on the ground below us. While she made her way back up to us I tried to ease the weight on Arnold’s neck, but by his squeaks of distress I judged he was still uncomfortable. Freya rejoined us, and quickly wedged her crowbar under Arnold’s right wrist cuff, and freed it. That left Arnold hanging down the side of the cylinder by his left wrist; but with one hard crank Freya popped that plate free as well, and Arnold disappeared. By leaning over we could just see him, collapsed in a heap on the ground. “Are you all right?” Freya asked. He groaned for an answer.  I looked up and saw that Terminator was nearly upon us. Almost involuntarily I proceeded to the ladder tunnel; Freya followed me, and we descended to the ground. “Disturbing not to be able to trust the cowcatchers,” I remarked as my heartbeat slowed.  “Nathaniel,” Freya said, looking exasperated. “I made all that up, you know that.”  “Ah. Yes, of course.”  As we rejoined Arnold he was just struggling to a seated position. “My ankle,” he said. Then the green wash of light from Terminator disappeared, as did the night sky; the city slid over us, and we were encased in a gloom interrupted by an occasional running light. All twelve of the city’s big tracks had disappeared, swallowed by the sleeves in the city’s broad metallic foundation. Only the open slots that allowed passage over the pylons showed where the sleeves were; for a moment in the darkness it seemed we stood between two worlds held apart by a field of pylons.  Meanwhile the city slid over us soundlessly, propelled by the expansion of the tracks themselves. You see, the alloy composing the tracks is capable of withstanding the 425 degree Centigrade heat of the Mercurial day, but the cylinders do expand just a bit in this heat. Here in the Terminator is the forward edge of the cylinders’ expansion, and the smooth-sided sleeves above us at that moment fit so snugly over the cylinders that as the cylinders expand, the city is pushed forward toward the cooler, thinner railing to the west; and so the city is propelled by the sun, while never being fully exposed to it. The motive force is so strong, in fact, that resistance to it arranged in the sleeves generates the enormous reserves of energy that Terminator has sold so successfully to the rest of civilization.  Though I had understood this mechanism for decades, I had never before observed it from this angle, and despite the fact that I was somewhat uneasy to be standing under our fair city, I was also fascinated to see its broad, knobby silver underside gliding majestically westward. For a long time I did nothing but stare at it.  “We’d better get to the car,” Freya said. “The sun will be up very soon after the city passes, and then we’ll be in trouble.”  Since Arnold was still cuffed to the plates, and had at least a sprained ankle, walking with him slung between us was a slow process. While we were at it the Dawn Wall passed over us, and suddenly the twelve tracks and the stars between them were visible again. “Now we’d better hurry,” said Freya. Above us the very top of the Dawn Wall flared a brilliant white; sunlight was striking that surface, only two hundred meters above us. Dawn was not far away. In the glare of reflected light we could see the heavily tire-printed ground under the cylinders perfectly, and for a while our eyes were nearly overwhelmed. “Look!” Freya cried, shielding her eyes with one hand and pointing up at the sun-washed slope of the city wall with the other. “It’s the inspiration of our Monet, don’t you think?”  Despite our haste, the great Rouen cathedral of Mercury pulled away from us. “This won’t do,” Freya said. “Only a bit more to the car, but we have to hurry. Here, Arnold, let me carry you—” and she ran, carrying Arnold piggyback, the rest of the way to the car. As we maneuvered him through the lock, a tongue of the sun’s corona licked briefly over the horizon, blinding us. I felt scorched; my throat was dry. We were now at the dawn edge of the Terminator zone, and east-facing slopes burned white while west-facing slopes were still a perfect black, creating a chaotic patchwork that was utterly disorienting. We rolled into the car after Arnold, and quickly drove west, passing the city, returning to the night zone, and arriving at a station where we could make the transfer into the city again. Freya laughed at my expression as we crossed the gap. “Well, Nathaniel,” she said, “home again.”  The very next day Freya arranged for those concerned with the case to assemble on Heidi’s patio again. Four police officials were there, and one took notes. The painting of the cathedral of Rouen was back in its place on the villa wall; George Butler and Harvey Washburn stood before it, while Arnold Ohman and Heidi paced by the patio’s edge. Lucinda and Delaurence, the cook, watched from behind the patio bar.  Freya called us to order. She was wearing a severe blue dress, and her white-blond hair was drawn into a tight braid that fell down her back. Sternly she said, “I will suggest to you an explanation for the death of Sandor Musgrave. All of you except for the police and Mr. Sebastian were to one extent or another suspected of killing him, so I know this will be of great interest to you.”  Naturally there was an uneasy stir among those listening.  “Several of you had reason to hate Musgrave, or to fear him. The man was a blackmailer by profession, and on Earth he had obtained evidence of illegalities in the merger Heidi and George made five years ago, that gave him leverage over both of you. This and motives for the rest of you were well established during the initial investigation, and we need not recapitulate the details.  “It is also true, however, that subsequent investigations have confirmed that all of you had alibis for the moment when Musgrave was struck down. Lucinda and Delaurence were together in the kitchen until Lucinda left to investigate the shout she heard; this was confirmed by caterers hired for the Solday party. Heidi left the patio shortly before Musgrave was found, but she was consulting with Hiu and the orchestra during the time in question. George Butler went into the house with Arnold Ohman, but they were together for most of the time they were inside. Eventually George left to go to the bathroom, but luckily for him the orchestra’s first clarinetist was there to confirm his presence. And fortunately for Mr. Ohman, I myself could see him from the patio, standing in the hallway until the very moment when Lucinda screamed.  “So you see—” Freya paused, eyed us one by one, ran a finger along the frame of the big painting. “The problem took on a new aspect. It became clear that, while many had a motive to kill Musgrave, no one had the opportunity. This caused me to reconsider. How, exactly, had Musgrave been killed? He was struck on the head by the frame of one of Heidi’s hall mirrors. Though several mirrors were broken in the melee following Lucinda’s screams, we know the one that struck Musgrave; it was at the bend in the hallway leading from the atrium to the patio. And it was only a couple of meters away from a step down in the hallway.”  Freya took a large house plan from a table and set it before the policeman. “Sandor Musgrave, you will recall, was new to Mercury. He had never seen a Solday celebration. When the Great Gates opened and the reflected light filled this villa, my suggestion is that he was overwhelmed by fright. Lucinda heard him cry for help—perhaps he thought the house was burning down. He panicked, rushed out of the study, and blindly began to run for the patio. Unable to see the step down or the mirror, he must have pitched forward, and his left temple struck the frame with a fatal blow. He crawled a few steps farther, then collapsed and died.”  Heidi stepped forward. “So Musgrave died by accident?”  “This is my theory. And it explains how it was that no one had the opportunity to kill him. In fact, no one did kill him.” She turned to the police. “I trust you will follow up on this suggestion?”  “Yes,” said the one taking notes. “Death declared accidental by consulting investigator. Proceed from there.” He exchanged glances with his colleagues. “We are satisfied this explains the facts of the case.”  Heidi surveyed the silent group. “To tell you the truth, I am very relieved.” She turned to Delaurence. “Let’s open the bar. It would be morbid to celebrate an accidental death, but here we can say we are celebrating the absence of a murder.”  The others gave a small cheer of relief, and we surrounded the bartender.  A few days later Freya asked me to accompany her to North Station. “I need your assistance.”  “Very well,” I said. “Are you leaving Terminator?”  “Seeing someone off.”  When we entered the station’s big waiting room, she inspected the crowd, then cried, “Arnold!” and crossed the room to him. Arnold saw her and grimaced. “Oh, Arnold,” she said, and leaned over to kiss him on each cheek. “I’m very proud of you.”  Arnold shook his head, and greeted me mournfully. “You’re a hard woman, Freya,” he told her. “Stop behaving so cheerfully; you make me sick. You know perfectly well this is exile of the worst sort.”  “But Arnold,” Freya said, “Mercury is not the whole of civilization. In fact it could be considered culturally dead, an immense museum to the past that has no real life at all.”  “Which is why you choose to live here, I’m sure,” he said bitterly.  “Well of course it does have some pleasures. But the really vital centers of any civilization are on the frontier. Arnold, and that’s where you’re going.”  Arnold looked completely disgusted.  “But Arnold,” I said. “Where are you going?”  “Pluto,” he said curtly.  “Pluto?” I exclaimed. “But whatever for? What will you do there?”  He shrugged. “Dig ditches, I suppose.”  Freya laughed. “You certainly will not.” She addressed me. “Arnold has decided, very boldly I might add, to abandon his safe career as a dealer here on Mercury, to become a real artist on the frontier.”  “But why?”  Freya wagged a finger at Arnold. “You must write us often.”  Arnold made a strangled growl. “Damn you, Freya. I refuse. I refuse to go.”  “You don’t have that option,” Freya said. “Remember the chalk, Arnold. The chalk was your signature.”  Arnold hung his head, defeated. The city interfaced with the spaceport station. “It isn’t fair,” Arnold said. “What am I going to do out on those barbaric outworlds?”  “You’re going to live,” Freya said sternly. “You’re going to live and you’re going to paint. No more hiding. Understand?”  I, at any rate, was beginning to.  “You should be thanking me profusely,” Freya went on, “but I’ll concede you’re upset and wait for gratitude by mail.” She put a hand on Arnold’s shoulder, and pushed him affectionately toward the crossing line. “Remember to write.”  “But,” Arnold said, a panicked expression on his face. “But—”  “Enough!” Freya said. “Be gone! Or else.”  Arnold sagged, and stepped across the divide between the stations. Soon the city left the spaceport station behind.  “Well,” Freya said. “That’s done.”  I stared at her. “You just helped a murderer to escape!”  She lifted an eyebrow. “Exile is a very severe punishment; in fact in my cultural tradition it was the usual punishment for murder committed in anger or self-defense.”  I waved a hand dismissively. “This isn’t the Iceland of Eric the Red. And it wasn’t self-defense—Sandor Musgrave was outright murdered.”  “Well,” she said. “I never liked him.”  I told you before; she has no sense of right and wrong. It is a serious defect in a detective. I could only wave my arms in incoherent outrage; and my protests have never carried much weight with Freya, who claims not even to believe them.  We left the station. “What’s that you were saying to Arnold about chalk?” I said, curiosity getting the better of me.  “That’s the clue you provided, Nathaniel—somewhat transformed. As you reminded me, Musgrave was pointing at the patio, and Heidi’s patio is made of a block of the Dover cliffs. Dover cliffs, as you know, are composed of chalk. So I returned to the painting, and cut through the back to retrieve samples of the chalk used in the underdrawing, which had been revealed to me by infrared photography.” She turned a corner and led me uptown. “Chalk, you see, has its own history of change. In Monet’s time chalk was made from natural sources, not from synthetics. Sure enough, the chalk I took from the canvas was a natural chalk. But natural chalk, being composed of marine ooze, is littered with the fossil remains of unicellular algae called coccoliths. These coccoliths are different depending upon the source of the chalk. Monet used Rouen chalk, appropriately enough, which was filled with the coccoliths Maslovella bamesae and Cricolithus pemmatoidens. The coccoliths in our painting, however, are Neococcolithes dubius. Very dubious indeed—for this is a North American chalk, first mined in Utah in 1924.”  “So Monet couldn’t have used this chalk! And there you had your proof that the painting is a fake.”  “Exactly.”  I said doubtfully. “It seems a subtle clue for the dying Musgrave to conceive of.”  “Perhaps,” Freya said cheerfully. “Perhaps he was only pointing in the direction of the patio by the accident of his final movements. But it was sufficient that the coincidence gave me the idea. The solution of a crime often depends upon imaginary clues.”  “But how did you know Arnold was the forger?” I asked. “And why, after taking the trouble to concoct all those paints, did he use the wrong chalk?”  “The two matters are related. It could be that Arnold only knew he needed a natural chalk, and used the first convenient supply without knowing there are differences between them. In that case it was a mistake—his only mistake. But it seems unlike Arnold to me, and I think rather that it was the forger’s signature. In effect, the forger said, if you take a slide of the chalk trapped underneath the paint, and magnify it five thousand times with an electron microscope, you will find me. This chalk never used by Monet is my sign. For on some level every forger hopes to be discovered, if only in the distant future—to receive credit for the work.  “So I knew we had a forger on Mercury, and I was already suspicious of Arnold, since he was the dealer who brought the painting to Mercury, and since he was the only guest at Heidi’s party with the opportunity to kill Musgrave; he was missing during the crucial moments—”  “You are a liar!”  “And it seems Arnold was getting desperate; I searched among his recent bills, and found one for three suction plates. So when we found him on the track I was quite sure.”  “He stuck himself to the track?”  “Yes. The one on his right wrist was electronically controlled, so after setting the other two he tripped the third between his teeth. He hoped that we would discover him there after missing him at the museum, and think that there was someone else who wished him harm. And if not, the cowcatchers would pull him free. It was a silly plan, but he was desperate after I set up that appointment with him. When I confronted him with all this, after we rescued him from the tracks, he broke down and confessed. Sandor Musgrave had discovered that the Monet was a fake while blackmailing the Evans family in England, and after forcing Heidi to give him a job, he worked on the painting in secret until he found proof. Then he blackmailed Arnold into bankruptcy, and when on Solday he pressed Arnold for more money, Arnold lost his composure and took advantage of the confusion caused by the opening of the Great Gates to smack Musgrave on the head with one of Heidi’s mirrors.”  I wagged a finger under her nose. “And you set him free. You’ve gone too far this time, Freya Grindavik.”  She shook her head. “If you consider Arnold’s case a bit longer, you might change your mind. Arnold Ohman has been the most important art dealer on Mercury for over sixty years. He sold the Vermeer collection to George Butler, and the Goyas to Terminator West Gallery, and the Pissarros to the museum in Homer Crater, and those Chinese landscapes you love so much to the city park, and the Kandinskys to the Lion of the Grays. Most of the finest paintings on Mercury were brought here by Arnold Ohman.”  “So?”  “So how many of those, do you think, were painted by Arnold himself?”  I stopped dead in the street, stunned at the very idea. “But—but that only makes it worse! Inestimably worse! It means there are fakes all over the planet!”  “Probably so. And no one wants to hear that. But it also means Arnold Ohman is a very great artist. And in our age that is no easy feat. Can you imagine the withering reception his painting would have received if he had done original work? He would have ended up like Harvey Washburn and all the rest of them who wander around the galleries like dogs. The great art of the past crashes down on our artists like meteors, so that their minds resemble the blasted landscape we roll over. Now Arnold has escaped that fate, and his work is universally admired, even loved. That Monet, for instance—it isn’t just that it passes for one of the cathedral series; it could be argued that it is the best of them. Now is this a level of greatness that Arnold could have achieved—would have been allowed to achieve—if he had done original work on this museum planet? Impossible. He was forced to forge old masters to be able to fully express his genius.”  “All this is no excuse for forgery or murder.”  But Freya wasn’t listening. “Now that I’ve exiled him, he may go on forging old paintings, but he may begin painting something new. That possibility surely justified ameliorating his punishment for killing such a parasite as Musgrave. And there is Mercury’s reputation as art museum of the system to consider . . . ”  I refused to honor her opinions with a reply, and looking around, I saw that during our conversation she had led me far up the terraces. “Where are we going?”  “To Heidi’s,” she said. And she had the grace to look a little shamefaced—for a moment, anyway. “I need your help moving something.”  “Oh, no.”  “Well,” Freya explained, “when I told Heidi some of the facts of the case, she insisted on giving me a token of her gratitude, and she overrode all my refusals, so . . . I was forced to accept.” She rang the wall bell.  “You’re joking,” I said.  “Not at all. Actually, I think Heidi preferred not to own a painting she knew to be a fake, you see. So I did her a favor by taking it off her hands.”  When Delaurence let us in, we found he had almost finished securing Rouen Cathedral—Sun Effect in a big plastic box. “We’ll finish this,” Freya told him.  While we completed the boxing I told Freya what I thought of her conduct. “You’ve taken liberties with the law—you lied right and left—”  “Well boxed,” she said. “Let’s go before Heidi changes her mind.”  “And I suppose you’re proud of yourself.”  “Of course. A lot of lab work went into this.”  We maneuvered the big box through the gate and into the street, and carried it upright between us, like a short flat coffin. We reached Freya’s villa, and immediately she set to work unboxing the painting. When she had freed it she set it on top of a couch, resting against the wall.  Shaking with righteous indignation, I cried, “That thing isn’t a product of the past! It isn’t authentic. It is only a fake. Claude Monet didn’t paint it.”  Freya looked at me with a mild frown, as if confronting a slightly dense and very stubborn child. “So what?”  After I had lectured her on her immorality a good deal more, and heard all of her patient agreement, I ran out of steam. “Well,” I muttered, “you may have destroyed all my faith in you, and damaged Mercury’s art heritage forever, but at least I’ll get a good story out of it.” This was some small comfort. “I believe I’ll call it The Case of the Thirty-third Cathedral of Rouen.”  “What’s this?” she exclaimed. “No, of course not!” And then she insisted that I keep everything she had told me that day a secret.  I couldn’t believe it. Bitterly I said, “You’re like those forgers. You want somebody to witness your cleverness, and I’m the one who is stuck with it.”  She immediately agreed, but went on to list all the reasons no one else could ever learn of the affair—how so many people would be hurt—including her, I added acerbically—how so many valuable collections would be ruined, how her plan to transform Arnold into a respectable honest Plutonian artist would collapse, and so on and so forth, for nearly an hour. Finally I gave up and conceded to her wishes, so that the upshot of it was I promised not to write down a single word concerning this particular adventure of ours, and I promised furthermore to say nothing of the entire affair, and to keep it a complete secret, forever and ever.  But I don’t suppose it will do any harm to tell you.    Originally published in Universe 15, edited by Terry Carr, 1985. Kim Stanley Robinson is an American science fiction writer living in Davis, California. He has won two Hugo Awards, three Nebula Awards, the Campbell Memorial Award, and a World Fantasy Award for his work. His latest novels are Aurora, Shaman, 2312, Galileo's Dream, Green Earth, and New York 2140.", "text": "11740 words, novelette, REPRINT\nMercurial\n“She rules all of Oz,” said Dorothy, “and so she rules your city and you, because you are in the Winkie Country, which is part of the Land of Oz.”\n“It may be,” returned the High Coco-Lorum, “for we do not study geography and have never inquired whether we live in the Land of Oz or not. And any Ruler who rules us from a distance, and unknown to us, is welcome to the job.”\n—L. Frank Baum, The Lost Princess of Oz\nI am not, despite the appearances, fond of crime detection. In the past, it is true, I occasionally accompanied my friend Freya Grindavik as she solved her cases, and admittedly this watsoning gave me some good material for the little tales I have written for the not-very-discriminating markets on Mars and Titan. But after the “Case of the Golden Sphere of the Lion of Mercury,” in which I ended up hanged by the feet from the clear dome of Terminator, two hundred meters above the rooftops of the city, my native lack of enthusiasm rose to the fore. And following the unfortunate “Adventure of the Vulcan Accelerator,” when Freya’s arch-foe Jan Johannsen tied us to a pile of hay under a large magnifying glass in a survival tent, there to await Mercury’s fierce dawn, I put my foot down: no more detecting. That, so to speak, was the last straw.\nSo when I agreed to accompany Freya to the Solday party of Heidi van Seegeren, it was against my better judgment. But Freya assured me there would be no business involved; and despite the obvious excesses, I enjoy a Solday party as much as the next esthete. So when she came by my villa, I was ready.\n“Make haste,” she said. “We’re late, and I must be before Heidi’s Monet when the Great Gates are opened. I adore that painting.”\n“Your infatuation is no secret,” I said, panting as I trailed her through the crowded streets of the city. Freya, as those of you who have read my earlier tales know, is two and a half meters tall, and broad-shouldered; she barged through the shoals of Solday celebrants rather like a whale, and I, pilot-fish-like, dodged in her wake. She led me through a group of Grays, who with carpetbeaters were busy pounding rugs saturated with yellow dust. As I coughed and brushed off my fine burgundy suit, I said, “My feeling is that you have taken me to view that antique canvas once or twice too often.”\nShe looked at me sternly. “As you will see, on Solday it transcends even its usual beauty. You look like a bee drowning in pollen, Nathaniel.”\n“Whose fault is that?” I demanded, brushing my suit fastidiously.\nWe came to the gate in the wall surrounding Van Seegeren’s town villa, and Freya banged on it loudly. The gate was opened by a scowling man. He was nearly a meter shorter than Freya, and had a balding head that bulged rather like the dome of the city. In a mincing voice he said, “Invitations?”\n“What’s this?” said Freya. “We have permanent invitations from Heidi.”\n“I’m sorry,” the man said coolly. “Ms. Van Seegeren has decided her Solday parties have gotten overcrowded, and this time she sent out invitations, and instructed me to let in only those who have them.”\n“Then there has been a mistake,” Freya declared. “Get Heidi on the intercom, and she will instruct you to let me in. I am Freya Grindavik, and this is Nathaniel Sebastian.”\n“I’m sorry,” the man said, quite unapologetically. “Every person turned away says the same thing, and Ms. Van Seegeren prefers not to be disturbed so frequently.”\n“She’ll be more disturbed to hear we’ve been held up,” Freya shifted toward the man. “And who might you be?”\n“I am Sander Musgrave, Ms. Van Seegeren’s private secretary.”\n“How come I’ve never met you?”\n“Ms. Van Seegeren hired me two months ago,” Musgrave said, and stepped back so he could look Freya in the eye without straining his neck. “That is immaterial, however—”\n“I’ve been Heidi’s friend for over forty years,” Freya said slowly, once again shifting forward to lean over the man. “And I would wager she values her friends more than her secretaries.”\nMusgrave stepped back indignantly. “I’m sorry!” he snapped. “I have my orders! Good day!”\nBut alas for him, Freya was now standing well in the gateway, and she seemed uninclined to move; she merely cocked her head at him. Musgrave comprehended his problem, and his mouth twitched uncertainly.\nThe impasse was broken when Van Seegeren’s maid Lucinda arrived from the street. “Oh, hello, Freya, Nathaniel. What are you doing out here?”\n“This new Malvolio of yours is barring our entrance,” Freya said.\n“Oh, Musgrave,” said Lucinda. “Let these two in, or the boss will be mad.”\nMusgrave retreated with a deep scowl. “I’ve studied the ancients, Ms. Grindavik,” he said sullenly. “You need not insult me.”\n“Malvolio was a tragic character,” Freya assured him. “Read Charles Lamb’s essay concerning the matter.”\n“I certainly will,” Musgrave said stiffly, and hurried to the villa, giving us a last poisonous look.\n“Of course, Lamb’s father,” Freya said absently, staring after the man, “was a house servant. Lucinda, who is that?”\nLucinda rolled her eyes. “The boss hired him to restore some of her paintings, and get the records in order. I wish she hadn’t.”\nThe bell in the gate sounded. “I’ve got it, Musgrave,” Lucinda shouted at the villa. She opened the gate, revealing the artist Harvey Washburn.\n“So you do,” said Harvey, blinking. He was high again; a bottle of the White Brother hung from his hand. “Freya! Nathaniel! Happy Solday to you—have a drink?”\nWe refused the offer, and then followed Harvey around the side of the villa, exchanging a glance. I felt sorry for Harvey. Most of Mercury’s great collectors came to Harvey’s showings, but they dissected his every brushstroke for influences, and told him what he should be painting, and then among themselves they called his work amateurish and unoriginal, and never bought a single canvas. I was never surprised to see him drinking.\nWe rounded the side of the big villa and stepped onto the white stone patio, which was made of a giant slab of England’s Dover cliffs, cut out and transported to Mercury entire. Malvolio Musgrave had spoken the truth about Heidi reducing the size of her Solday party: where often the patio had been jammed, there were now fewer than a dozen people. I spotted George Butler, Heidi’s friend and rival art collector, and Arnold Ohman, the art dealer who had obtained for many of Mercury’s collectors their ancient masterpieces from Earth. As I greeted them Freya led us all across the patio to the back wall of the villa, which was also fronted with white slabs of the Dover cliffs. There, all alone, hung Claude Monet’s Rouen Cathedral—Sun Effect. “Look at it, Nathaniel!” Freya commanded me. “Isn’t it beautiful?”\nI looked at it. Now you must understand that, as owner of the Gallery Orientale, and by deepest personal esthetic conviction, I am a connoisseur of Chinese art, a style in which a dozen artfully spontaneous brushstrokes can serve to delineate a mountain or two, several trees, a small village and its inhabitants, and perhaps some birds. Given my predilection, you will not be surprised to learn that to look at the antique rectangle of color that Freya so admired was to risk damaging my eyes. Thick scumbled layers of grainy paint scarcely revealed the cathedral of the title, which wavered under a blast of light so intense that I doubted Mercury’s midday could compete with it. Small blobs of every color served to represent both the indistinct stone and a pebbly sky, both were composed of combinations principally of white, yellow, and purple, though as I say every other color made an appearance.\n“Stunning,” I said, with a severe squint. “Are you sure this Monet wasn’t a bit nearsighted?”\nFreya glared at me, ignoring Butler’s chuckles. “I suppose your comment might have been funny the first time you made it. To children, anyway.”\n“But I heard it was actually true,” I said, shielding my eyes with one hand. “Monet was nearsighted, and so, like Goya, his vision affected his painting—”\n“I should hope so,” Harvey said solemnly.\n“—so all he could see were those blobs of color; isn’t that sad?”\nFreya shook her head. “You won’t get a rise out of me today, Nathaniel. You’ll have to think up your dinner conversation by yourself.”\nMomentarily stopped by this riposte, I retired with Arnold Ohman to Heidi’s patio bar. After dialing drinks from the bartender we sat on the blocks of Dover cliffs that made up the patio’s outer wall. We toasted Solday, and contemplated the clouds of yellow talc that swirled over the orange tile rooftops below us. For those of you who have never visited it, Terminator is an oval city. The forward half of the city is flat, and projects out under the clear dome. The rear half of the oval is terraced, and rises to the tall Dawn Wall which supports the upper rim of the dome, and shields the city from the perpetually rising sun. The Great Gates of Terminator are near the top of the Dawn Wall, and when they are opened shafts of Sol’s overwhelming light spear through the city’s air, illuminating everything in a yellow brilliance. Heidi van Seegeren’s villa was about halfway up the terraced slope; we looked upon gray stone walls, orange tile roofs, and the dusty vines and lemon trees of the terrace gardens that dotted the city. Outside the dome the twelve big tracks of the city extended off to the horizon, circling the planet like a slender silver wedding band. It was a fine view, and I lifted my glass remembering that Claude Monet wasn’t there to paint it. For sometimes, if you ask me, reality is enough.\nOhman downed his drink in one swallow. Rumor had it that he was borrowing heavily to finance one of his big Terran purchases; it was whispered he was planning to buy the closed portion of the Louvre—or the Renaissance room of the Vatican museum—or Amsterdam’s Van Gogh collection. But rumors like that circulated around Arnold continuously. He was that kind of dealer. It was unlikely any of them were true; still, his silence seemed to reveal a certain tension.\n“Look at the way Freya is soaking in that painting you got for Heidi,” I said, to lift his spirits. Freya’s face was within centimeters of the canvas, where she could examine it blob by blob; the people behind her could see nothing but her white-blond hair. Ohman smiled at the sight. He had brought the Monet back from his most recent Terran expedition, and apparently it had been a great struggle to obtain it. Both the English family that owned it and the British government had had to be paid enormous sums to secure its release, and only the fact that Mercury was universally considered humanity’s greatest art museum had cleared the matter with the courts. It had been one of Arnold’s finest hours.\nNow he said, “Maybe we should pull her away a bit, so that others can see.”\n“If both of us tug on her it may work,” I said. We stood and went to her side. Harvey Washburn, looking flushed and frazzled, joined us, and we convinced Freya to share the glory. Ohman and Butler conferred over something, and entered the villa through the big French doors that led into the concert room. Inside, Heidi’s orchestra rolled up and down the scales of Moussorgsky’s Hut of Baba Yaga. That meant it was close to the time when the Great Gates would open (Heidi always gets inside information about this).\nSure enough, as Moussorgsky’s composition burst from The Hut of Baba Yaga into The Great Gates of Kiev, two splinters of white light split the air under the dome. Shouts and fanfares rose everywhere, nearly drowning the amplified sound of our orchestra. Slowly the Great Gates opened, and as they did the shafts of light grew to thick buttery gold bars of air. By their rich, nearly blinding glare, Heidi van Seegeren made her first entrance from her villa, timing her steps to the exaggerated Maazel ritard that her conductor Hiu employed every Solday when Pictures at an Exhibition was performed. This ritard shifted the music from the merely grandiose to the utterly bombastical, and it took Heidi over a minute to cross her own narrow patio; but I suppose it was not entirely silly, given the ritual nature of the moment, and the flood of light that was making the air appear a thick, quite tangible gel. What with the light, and the uproar created by the keening Grays and the many orchestras in the neighborhood, each playing their own overture or fanfare (the Coriolan came from one side of us, the 1812 from the other), it was a complex and I might even say noisy esthetic moment, and the last thing I needed was to take another look at the Monet monstrosity, but Freya would not have it otherwise.\n“You’ve never seen it when the Great Gates are opened,” she said. “That was the whole point in bringing you here today.”\n“I see.” Actually I barely saw anything; as Freya had guided me by the arm to the painting I had accidentally looked directly at the incandescent yellow bars of sunlight and brilliant blue afterimages bounced in my sight. I heard rather than saw Harvey Washburn join us. Many blinks later I was able to join the others in devoting my attention to the big canvas.\nWell. The Monet positively glowed in the dense, lambent air; it gave off light like a lamp, vibrating with a palpable energy of its own. At the sight of it even I was impressed.\n“Yes,” I admitted to Freya and Harvey, “I can see how precisely he placed all those little chunks of color, and I can see how sharp and solid the cathedral is under all that goo, but it’s like Solday, you know, it’s a heightened effect. The result is garish, really; it’s too much.”\n“But this is a painting of midday,” Harvey said. “And as you can see, midday can get pretty garish.”\n“But this is Terminator! The Grays have put a lot of talc in the air to make it look this way!”\n“So what?” Freya demanded impatiently. “Stop thinking so much, Nathaniel. Just look at it. See it. Isn’t it beautiful? Haven’t you felt things look that way sometimes, seeing stone in sunlight?”\n“Well . . . ” And, since I am a strictly honest person, if I had said anything at all I would have had to admit that it did have a power about it. It drew the eye; it poured light onto us as surely as the beams of sunlight extending from the gates in the Dawn Wall to the curved side of the clear dome.\n“Well?” Freya demanded.\n“Well yes,” I said. “Yes I see that cathedral front—I feel it. But there must have been quite a heat wave in old Rouen. It’s as if Monet had seen Terminator on Solday, the painting fits so well with this light.”\n“No,” Freya said, but her left eye was squinted, a sign she was thinking.\nHarvey said, “We make the conditions of light in Terminator, and so it is an act of the imagination, like this painting. You shouldn’t be surprised if there are similarities: We value this light because the old masters created it on their canvases.”\nI shook my head, and indicated the brassy bedlam around us. “No. I believe we made this one up ourselves.”\nFreya and Harvey laughed, with the giddiness that Solday inspires.\nSuddenly a loud screech came from inside the villa. Freya hurried across the patio into the music room, and I followed her. Both of us, however, had forgotten the arrangements that Heidi made on Soldays to cast the brilliant light throughout her home, and as we ran past the silenced orchestra into a hallway we were blasted by light from a big mirror carefully placed in the villa’s central atrium. Screams still echoed from somewhere inside, but we could only stumble blindly through bright pulsing afterimages, retinal Monets if you will, while unidentified persons bowled into us, and mirrors crashed to the floor. And the atrium was raised, so that occasional steps up in the hallway tripped us.\n“Murder!” someone cried. “Murder! There he goes!” And with that a whole group of us were off down the halls like hounds—blind hounds—baying after unknown prey. A figure leaped from behind a mirror glaring white, and Freya and I tackled it just inside the atrium.\nWhen my vision swam back I saw it was George Butler. “What’s going on?” he asked, very politely for a man who had just been jumped on by Freya Grindavik.\n“Don’t ask us,” Freya said irritably.\n“Murder!” shrieked Lucinda, from the hallway that led from the atrium directly back to the patio. We jumped up and crowded into the hallway. Just beyond a mirror shattered into many pieces lay a man’s body; apparently he had been crawling toward the patio when he collapsed, and one arm and finger extended ahead of him, still pointing to the patio. Freya approached, gingerly turned the body’s head. “It’s that Musgrave fellow,” she said, blinking to clear her sight. “He’s dead, all right. Struck on the head with the mirror there, no doubt.”\nHeidi van Seegeren joined us. “What’s going on?”\n“That was my question,” George Butler said.\nFreya explained the situation to her.\n“Call the police,” Heidi said to Lucinda. “And I suppose no one should leave.”\nI sighed.\nAnd so crime detection ensnared me once again. I helped Freya by circulating on the patio, calming the shocked and nervous guests. “Um, excuse me, very sorry to inform you, yes, sorry—hard to believe, yes—somebody had it in for the secretary Musgrave, it appears”—all the while watching to see if anyone would jump, or turn pale, or start to run when I told them. Then, of course, I had to lead gently to the idea that everyone had gone from guest to suspect, soon to be questioned by Freya and the police. “No, no, of course you’re not suspected of anything, farthest thing from our minds, it’s just that Freya wants to know if there’s anything you saw that would help,” and so on. Then I had to do the difficult scheduling of Freya’s interviews, at the same time I was supposed to keep an eye out for anything suspicious.\nOh, the watson does the dirty work, all right. No wonder we always look dense when the detective unveils the solutions; we never have the time even to get the facts straight, much less meditate on their meaning. All I got that day were fragments: Lucinda whispered to me that Musgrave had worked for George Butler before Heidi hired him. Harvey Washburn told me that Musgrave had once been an artist, and that he had only recently moved to Mercury from Earth; this was his first Solday. That didn’t give him much time to be hired by Butler, fired, and then hired by Van Seegeren. But was that of significance?\nLate in the day I spoke with one of the police officers handling the case. She was relieved to have the help of Freya Grindavik. Terminator’s police force is small, and often relies on the help of the city’s famous detective for the more difficult cases. The officer gave me a general outline of what they had learned: Lucinda had heard a shout for help, had stepped into the atrium and seen a bloodied figure crawling down the hallway toward the patio. She had screamed and run for help, but only in the hallway was clear vision possible, and she had quickly gotten lost. After that, chaos; everyone at the party had a different tale of confusion.\nFollowing that conversation I had nothing more to do, so I got all the sequestered guests coffee, and helped pick up some of the broken hall mirrors, and passed some time prowling Heidi’s villa, getting down on my hands and knees with the police robots to inspect a stain or two.\nWhen Freya was finished with her interrogations, she promised Heidi and the police that she would see the case to its end—at least provisionally: “I only do this for entertainment,” she told them irritably. “I’ll stay with it as long as it entertains me. And I shall entertain myself with it.”\n“That’s all right,” said the police, who had heard this before. “Just so long as you’ll take the case.” Freya nodded, and we left.\nThe Solday celebration was long since over; the Great Gates were closed, and once again through the dome shone the black sky. I said to Freya, “Did you hear about Musgrave working for Butler? And how he came from Earth just recently?” For you see, once on the scent I am committed to seeing a case solved.\n“Please, Nathaniel,” Freya said. “I heard all of that and more. Musgrave stole the concept of Harvey Washburn’s first series of paintings, he blackmailed both Butler and our host Heidi to obtain his jobs from them—or so I deduce, from their protestations, and from certain facts concerning their recent questionable merger that I am privy to. And he tried to assault Lucinda, who is engaged to the cook Delaurence—” She let out a long sigh. “Motives are everywhere.”\nBemused, I said, “It seems this Musgrave was a thoroughly despicable sort.”\n“Yes. An habitual blackmailer.”\n“Nothing suggests itself to you?”\n“No. Not only that, but it seems almost every person at the party had a good alibi for the moment of the murder! Oh, I don’t know why I agree to solve these things. Here I am committed to this head-bashing, and my best clue is something that you suggested.”\n“I wasn’t aware that I had suggested anything!”\n“There is a fresh perspective to ignorance that can be very helpful.”\n“So it is important that Musgrave just arrived from Earth?”\nShe laughed. “Let’s stop in the Plaza Dubrovnik and get something to eat. I’m starving.”\nAlmost three weeks passed without a word from Freya, and I began to suspect that she was ignoring the case. Freya has no real sense of right and wrong, you see; she regards her cases as games, to be tossed aside if they prove too taxing. More than once she has cheerfully admitted defeat, and blithely forgotten any promises she may have made. She is not a moral person.\nSo I dropped by her home near Plaza Dubrovnik one evening, to rouse her from her irresponsible indifference. When she answered the door there were paint smudges on her face and hands.\n“Freya,” I scolded her. “How could you take up an entirely new hobby when there is a case to be solved?”\n“Generously I allow you entrance after such a false accusation,” she said. “But you will have to eat your words.”\nShe led me downstairs to her basement laboratory, which extended the entire length and breadth of her villa.\nThere on a big white-topped table lay Heidi van Seegeren’s Monet, looking like the three-dimensional geologic map of some minerally blessed country.\n“What’s this?” I exclaimed. “Why is this here?”\n“I believe it is a fake,” she said shortly, returning to a computer console.\n“Wait a moment!” I cried. On the table around the painting were rolls of recording chart paper, lab notebooks, and what looked like black-and-white photos of the painting. “What do you mean?”\nAfter tapping at the console she turned to me. “I mean I believe it’s a fake!”\n“But I thought art forgery was extinct. It is too easy to discover a fake.”\n“Ha!” She waved a finger at me angrily. “You pick a bad time to say so. It is a common opinion, of course, but not necessarily true.”\nI regarded the canvas more closely. “What makes you think this a fake? I thought it was judged a masterpiece of its period.”\n“Something you said first caused me to question it,” she said. “You mentioned that the painting seemed to have been created by an artist familiar with the light of Terminator. This seemed true to me, and it caused me to reflect that one of the classic signs of a fake was anachronistic sensibility—that is to say, the forger injects into his vision of the past some element of his time that is so much a part of his sensibility that he cannot perceive it. Thus the Victorians faked Renaissance faces with a sentimentality that only they could not immediately see.”\n“I see.” I nodded sagely. “It did seem that cathedral had been struck with Solday light, didn’t it?”\n“Yes. The trouble is, I have been able to find no sign of forgery in the physical properties of the painting.” She shook her head. “And after three weeks of uninterrupted chemical analysis, that is beginning to worry me.”\n“But Freya,” I said, as something occurred to me. “Does all this have a bearing on the Musgrave murder?”\n“I think so,” she replied. “And if not, it is certainly more interesting. But I believe it does.”\nI nodded. “So what, exactly, have you found?”\nShe smiled ironically. “You truly want to know? Well. The best test for anachronisms is the polonium 210, radium 226 equilibrium—”\n“Please, Freya. No jargon.”\n“Jargon!” She raised an eyebrow to scorn me. “There is no such thing. Intelligence is like mold in a Petri dish—as it eats ever deeper into the agar of reality, language has to expand with it to describe what has been digested. Each specialty provides the new vocabulary for its area of feeding, and gets accused of fabricating jargon by those who know no better. I’m surprised to hear such nonsense from you. Or perhaps not.”\n“Very well,” I said, hands up. “Still, you must communicate your meaning to me.”\n“I shall. First I analyzed the canvas. The material and its weave match the characteristics of the canvas made by the factory outside Paris that provided Monet throughout the painting of the Rouen cathedral series. Both the fabric and the glue appear very old, though there is no precise dating technique for them. And there was no trace of solvents that might have been used to strip paint off a genuine canvas of the period.\n“I then turned to the paint. Follow so far?” she asked sharply. “Paint?”\n“You may proceed without further sarcasm, unless unable to control yourself.”\n“The palette of an artist as famous as Monet has been studied in detail, so that we know he preferred cadmium yellow to chromium yellow or Naples yellow, that he tended to use Prussian blue rather than cobalt blue, and so on.” She tapped the flecks of blue at the base of the cathedral. “Prussian blue.”\n“You’ve taken paint off the canvas?”\n“How else test it? But I took very small samples, I assure you. Whatever the truth concerning the work, it remains a masterpiece, and I would not mar it. Besides, most of my tests were on the white paint, of which there is a great quantity, as you can see.”\nI leaned over to stare more closely at the canvas. “Why the white paint?”\n“Because lead white is one of the best dating tools we have. The manufacturing methods used to make it changed frequently around Monet’s time, and each change in method altered the chemical composition of the paint. After 1870, for instance, the cheaper zinc white was used to adulterate lead white, so there should be over one percent zinc in Monet’s lead white.”\n“And is that what you found?”\n“Yes. The atomic absorption spectrum showed—” She dug around in the pile of chart paper on the table. “Well, take my word for it—”\n“I will.”\n“Nearly twelve percent. And the silver content for late-nineteenth-century lead white should be around four parts per million, the copper content about sixty parts per million. So it is with this paint. There is no insoluble antimony component, as there would be if the paint had been manufactured after 1940. The X-ray diffraction pattern”—she unrolled a length of chart paper and showed me where three sharp peaks in a row had been penned by the machine—“is exactly right, and there is the proper balance of polonium 210 and radium 226. That’s very important, by the way, because when lead white is manufactured the radioactive balance of some of its elements is upset, and it takes a good three hundred years for them to decay back to equilibrium. And this paint is indeed back to that equilibrium.”\n“So the paints are Monet’s,” I concluded. “Doesn’t that prove the work authentic?”\n“Perhaps,” Freya admitted. “But as I was doing all this analysis, it occurred to me that a modern forger has just as much information concerning Monet’s palette as I do. With a modern laboratory it would be possible to use such information as a recipe, so to speak, and then to synthesize paints that would match the recipe exactly. Even the radioactively decayed lead white could be arranged, by avoiding the procedures that disrupt the radioactive balance in the first place!”\n“Wouldn’t that be terrifically complicated?”\nFreya stared at me. “Obviously, Nathaniel, we are dealing with a very, very meticulous faker here. But how else could it be done, in this day and age? Why else do it at all? The complete faker must take care to anticipate every test available, and then in a modern laboratory create the appropriate results for every one of them. It’s admirable!”\n“Assuming there ever was such a forger,” I said dubiously. “It seems to me that what you have actually done here is prove the painting genuine.”\n“I don’t think so.”\n“But even with these paints made by recipe, as you call them, the faker would still have to paint the painting!”\n“Exactly. Conceive the painting, and execute it. It becomes very impressive, I confess.” She walked around the table to look at the work from the correct angle. “I do believe this is one of the best of the Rouen cathedral series—astonishing, that a forger would be capable of it.”\n“That brings up another matter,” I said. “Doesn’t this work have a five-hundred-year-old pedigree? How could a whole history have been provided for it?”\n“Good question. But I believe I have discovered the way. Let’s go upstairs—you interrupted my preparations for lunch, and I’m hungry.”\nI followed her to her extensive kitchen, and sat in the window nook that overlooked the tile rooftops of the lower city while she finished chopping up the vegetables for a large salad.\n“Do you know the painting’s history?” Freya asked, looking up from a dissected head of lettuce.\nI shook my head. “Up until now the thing has not been of overwhelming interest to me.”\n“A confession of faulty esthetics. The work was photographed at the original exhibit in 1895, Durand-Ruel photo 5828 L8451. All of the information appended to the photo fits our painting—same name, size, signature location. Then for a century it disappeared. Odd. But it turned out to have been in the estate of an Evans family, in Aylesbury, England. When the family had some conservation work done on one corner it returned to public knowledge, and was photographed for a dozen books of the twenty-first and twenty-second centuries. After that it slipped back into obscurity, but it is as well documented as any of the series belonging to private estates.”\n“Exactly my point,” I said. “How could such a history be forged?”\nAs Freya mixed the salad she smiled. “I sat and thought about that for quite some time myself. But consider it freshly, Nathaniel. How do we know what we know of the past?”\n“Well,” I said, somewhat at a loss. “From data banks, I suppose. And books—documents—historians—”\n“From historians!” She laughed. She provided us both with bowls, and sat across from me. As I filled mine she said, “So we want to know something of the past. We go to our library and sit at its terminal. We call up general reference works, or a bibliographical index, and we choose, if we want, books that we would like to have in our hands. We type in the appropriate code, our printer prints up the appropriate book, and the volume slides out of the computer into our waiting grasp.” She paused to fork down several mouthfuls of salad. “So we learn about the past using computer programs. And a clever programmer, you see, can change a program. It would be possible to insert extra pages into these old books on Monet, and thus add the forged painting to the record of the past.”\nI paused, a cherry tomato hovering before my mouth. “But—”\n“I searched for an original of any of these books containing photos of our painting,” Freya said. “I called all over Mercury, and to several incunabulists in libraries on Earth—you wouldn’t believe the phone bill I’ve run up. But the original printings of these art volumes were very small, and although first editions probably remain somewhere, they are not to be found. Certainly there are no first editions of these books on Mercury, and none immediately locatable on Earth. It began to seem a very unlikely coincidence, as if these volumes contained pictures of our painting precisely because they existed only in the data banks, and thus could be altered without discovery.”\nShe attended to her salad, and we finished eating in silence. All the while my mind was spinning furiously, and when we were done I said, “What about the original exhibit photo?”\nShe nodded, pleased with me. “That, apparently, is genuine. But the Durand-Ruel photos include four or five paintings that have never been seen since. In that sense the Rouen cathedral series is a good one for a faker; from the first it has never been clear how many cathedrals Monet painted. The usual number given is thirty-two, but there are more in the Durand-Ruel list, and a faker could examine the list and use one of the lost items as a prescription for his fake. Providing a later history with the aid of these obscure art books would result in a fairly complete pedigree.”\n“But could such an addition to the data banks be made?”\n“It would be easiest done on Earth,” Freya said. “But there is no close security guarding the banks containing old art books. No one expects them to be tampered with.”\n“It’s astonishing,” I said with a wave of my fork, “it is baroque, it is byzantine in its ingenuity!”\n“Yes,” she said. “Beautiful, in a way.”\n“However,” I pointed out to her, “you have no proof—only this perhaps overly complex theory. You have found no first edition of a book to confirm that the computer-generated volumes add Heidi’s painting, and you have found no physical anachronism in the painting itself.”\nGloomily she clicked her fork against her empty salad bowl, then rose to refill it. “It is a problem,” she admitted. “Also, I have been working on the assumption that Sandor Musgrave discovered evidence of the forgery. But I can’t find it.”\nNever let it be said that Nathaniel Sebastian has not performed a vital role in Freya Grindavik’s great feats of detection. I was the first to notice the anachronism of sensibility in Heidi’s painting; and now I had a truly inspired idea. “He was pointing to the patio!” I exclaimed. “Musgrave, in his last moment, struggled to point to the patio!”\n“I had observed that,” Freya said, unimpressed.\n“But Heidi’s patio—you know—it is formed out of blocks of the Dover cliffs! And thus Musgrave indicated England! Is it not possible? The Monet was owned by Englishmen until Heidi purchased it—perhaps Musgrave meant to convey that the original owners were the forgers!”\nFreya’s mouth hung open in surprise, and her left eye was squinted shut. I leaped from the window nook in triumph. “I’ve solved it! I’ve solved a mystery at last.”\nFreya looked up at me and laughed.\n“Come now, Freya, you must admit I have given you the vital clue.”\nShe stood up, suddenly all business. “Yes, yes, indeed you have. Now out with you, Nathaniel; I have work to do.”\n“So I did give you the vital clue?” I asked. “Musgrave was indicating the English owners?”\nAs she ushered me to her door Freya laughed. “As a detective your intuition is matched only by your confidence. Now leave me to work, and I will be in contact with you soon, I assure you.” And with that she urged me into the street, and I was left to consider the case alone.\nFreya was true to her word, and only two days after our crucial luncheon she knocked on the door of my town villa. “Come along,” she said. “I’ve asked Arnold Ohman for an appointment; I want to ask him some questions about the Evans family. The city is passing the Monet museum, however, and he asked us to meet him out there.”\nI readied myself quickly, and we proceeded to North Station. We arrived just in time to step across the gap between the two platforms, and then we were on the motionless deck of one of the outlying stations that Terminator is always passing. There we rented a car and sped west, paralleling the dozen massive cylindrical rails over which the city slides. Soon we had left Terminator behind, and when we were seventy or eighty kilometers onto the nightside of Mercury we turned to the north, to Monet Crater.\nTerminator’s tracks lie very close to the thirtieth degree of latitude, in the northern hemisphere, and Monet Crater is not far from them. We crossed Endeavor Rupes rapidly, and passed between craters named after the great artists, writers, and composers of Earth’s glorious past: traversing a low pass between Holbein and Gluck, looking down at Melville and the double crater of Rodin. “I think I understand why a modern artist on Mercury might turn to forgery,” Freya said. “We are dwarfed by the past as we are by this landscape.”\n“But it is still a crime,” I insisted. “If it were done often, we would not be able to distinguish the authentic from the fake.”\nFreya did not reply.\nI drove our car up a short rise, and we entered the sub-mercurial garage of the Monet museum, which is set deep in the southern rim of the immense crater named after the artist. One long wall of the museum is a window facing out over the crater floor, so that the central knot of peaks is visible, and the curving inner wall of the crater defines the horizon in the murky distance. Shutters slid down to protect these windows from the heat of Mercury’s long day, but now they were open and the black wasteland of the planet formed a strange backdrop to the colorful paintings that filled the long rooms of the museum.\nThere were many Monet originals there, but the canvases of the Rouen cathedral series were almost all reproductions, set in one long gallery. As Freya and I searched for Arnold we also viewed them.\n“You see, they’re not just various moments of a single day,” Freya said.\n“Not unless it was a very strange day for weather.” The three reproductions before us all depicted foggy days: two bluish and underwater-looking, the third a bright burning-off of yellow noontime fog. Obviously these were from a different day than the ones across the room, where a cool clear morning gave way to a midday that looked as if the sun were just a few feet above the cathedral. The museum had classified the series in color groups: “Blue Group,” “White Group,” “Yellow Group,” and so on. To my mind that system was stupid—it told you nothing you couldn’t immediately see. I myself classified them according to weather. There was a clear day that got very hot; a clear winter day, the air chill and pure; a foggy day; and a day when a rainstorm had grown and then broken.\nWhen I told Freya of my system she applauded it. “So Heidi’s painting goes from the king of the White Group to the hottest moment of the hot day.”\n“Exactly. It’s the most extreme in terms of sunlight blasting the stone into motes of color.”\n“And thus the forger extends Monet’s own thinking, you see,” she said, a bit absently. “But I don’t see Arnold, and I think we have visited every room.”\n“Could he be late?”\n“We are already quite late ourselves. I wonder if he has gone back.”\n“It seems unlikely,” I said.\nPurposefully we toured the museum one more time, and I ignored the color-splashed canvases standing before the dark crater, to search closely in all the various turns of the galleries. No Arnold.\n“Come along,” Freya said. “I suspect he stayed in Terminator, and now I want to speak with him more than ever.”\nSo we returned to the garage, got back in our car, and drove out onto Mercury’s bare, baked surface once again. Half an hour later we had Terminator’s tracks in sight. They stretched before us from horizon to horizon, twelve fat silvery cylinders set five meters above the ground on narrow pylons. To the east, rolling over the flank of Valazquez Crater so slowly that we could not perceive its movement without close attention, came the city itself, a giant clear half-egg filled with the colors of rooftops, gardens, and the gray stone of the building crowding the terraced Dawn Wall.\n“We’ll have to go west to the next station,” I said. Then I saw something, up on the city track nearest us: spread-eagled over the top of the big cylinder was a human form in a light green daysuit. I stopped the car. “Look!”\nFreya peered out her window. “We’d better go investigate.”\nWe struggled quickly into the car’s emergency daysuits, clamped on the helmets, and slipped through the car’s lock onto the ground. A ladder led us up the nearest cylinder pylon and through a tunnel in the cylinder itself. Once on top we could stand safely on the broad hump of the rail.\nThe figure we had seen was only thirty meters away from us, and we hurried to it.\nIt was Arnold, spread in cruciform fashion over the cylinder’s top, secured in place by three large suction plates that had been cuffed to his wrists and ankles, and then stuck to the cylinder. Arnold turned from his contemplation of the slowly approaching city, and looked at us wide-eyed through his faceplate. Freya reached down and turned on his helmet intercom.\n“—am I glad to see you!” Arnold cried, voice harsh. “These plates won’t move!”\n“Tied to the tracks, eh?” Freya said.\n“Yes!”\n“Who put you here?”\n“I don’t know! I went out to meet you at the Monet museum, and the last thing I remember I was in the garage there. When I came to, I was here.”\n“Does your head hurt?” I inquired.\n“Yes. Like I was gassed, though, not hit. But—the city—it just came over the horizon a short time ago. Perhaps we could dispense with discussion until I am freed?”\n“Relax,” Freya said, nudging one of the plates with her boot. “Are you sure you don’t know who did this, Arnold?”\n“Of course! That’s what I just said! Please, Freya, can’t we talk after I get loose?”\n“In a hurry, Arnold?” Freya asked.\n“Of course.”\n“No need to be too worried,” I assured him. “If we can’t free you the cowcatchers will be out to pry you loose.” I tried lifting a plate, but could not move it. “Surely they will find a way—it’s their job, after all.”\n“True,” Arnold said.\n“Usually true,” said Freya. “Arnold is probably not aware that the cowcatchers have become rather unreliable recently. Some weeks ago a murderer tied his victim to a track just as you have been, Arnold, and then somehow disengaged the cowcatchers’ sensors. The unfortunate victim was shaved into molecules by one of the sleeves of the city. It was kept quiet to avoid any attempted repetitions, but since then the cowcatchers’ sensors have continued to function erratically, and two or three suicides have been entirely too successful.”\n“Perhaps this isn’t the best moment to tell us about this,” I suggested to Freya.\nArnold choked over what I took to be his agreement.\n“Well,” Freya said, “I thought I should make the situation clear. Now listen, Arnold. We need to talk.”\n“Please,” Arnold said. “Free me first, then talk.”\n“No, no—”\n“But Terminator is only a kilometer away!”\n“Your perspective from that angle is deceptive,” Freya told him. “The city is at least three kilometers away.”\n“More like two,” I said, as I could now make out individual rooftops under the Dawn Wall. In fact the city glowed like a big glass lamp, and illuminated the entire landscape with a faint green radiance.\n“And at three point four kilometers an hour,” Freya said, “that gives us almost an hour, doesn’t it. So listen to me, Arnold. The Monet cathedral that you sold to Heidi is a fake.”\n“What?” Arnold cried. “It certainly is not! And I insist this isn’t the time—”\n“It is a fake. Now I want you to tell me the truth, or I will leave you here to test the cowcatchers.” She leaned over to stare down at Arnold face to face. “I know who painted the fake, as well.”\nHelplessly Arnold stared up at her.\n“He put you on the track here, didn’t he.”\nArnold squeezed his eyes shut, nodded slowly. “I think so.”\n“So if you want to be let up, you must swear to me that you will abide by my plan for dealing with this forger. You will follow my instructions, understand?”\n“I understand.”\n“Do you agree?”\n“I agree,” Arnold said, forcing the words out. “Now let me up!”\n“All right,” Freya straightened.\n“How are we going to do it?” I asked.\nFreya shrugged. “I don’t know.”\nAt this Arnold howled, he shouted recriminations, he began to wax hysterical—\n“Shut up!” Freya exclaimed. “You’re beginning to sound like a man who has made too many brightside crossings. These suction plates are little different from children’s darts.” She leaned down, grasped a plate, pulled up with all of her considerable strength. No movement. “Hmm,” she said thoughtfully.\n“Freya,” Arnold said.\n“One moment,” she replied, and walked back down the hump of the cylinder to the ladder tunnel, there to disappear down it.\n“She’s left me,” Arnold groaned. “Left me to be crushed.”\n“I don’t think so,” I said. “No doubt she has gone to the car to retrieve some useful implement.” I kicked heartily at the plate holding Arnold’s feet to the cylinder, and even managed to slide it a few centimeters down the curve, which had the effect of making Arnold suddenly taller. But other than that I made no progress.\nWhen Freya returned she carried a bar bent at one end. “Crowbar,” she explained to us.\n“But where did you get it?”\n“From the car’s tool chest, naturally. Here.” She stepped over Arnold. “If we just insinuate this end of it under your cuffs, I believe we’ll have enough leverage to do the trick. The cylinder being curved, the plates’ grasp should be weakened . . . about here.” She jammed the short end of the bar under the edge of the footplates’ cuff, and pulled on the upper end of it. Over the intercom, breathless silence; her fair cheeks reddened; then suddenly Arnold’s legs flew up and over his head, leaving his arms twisted and his neck at an awkward angle. At the same time Freya staggered off the cylinder, performed a neat somersault and landed on her feet, on the ground below us. While she made her way back up to us I tried to ease the weight on Arnold’s neck, but by his squeaks of distress I judged he was still uncomfortable. Freya rejoined us, and quickly wedged her crowbar under Arnold’s right wrist cuff, and freed it. That left Arnold hanging down the side of the cylinder by his left wrist; but with one hard crank Freya popped that plate free as well, and Arnold disappeared. By leaning over we could just see him, collapsed in a heap on the ground. “Are you all right?” Freya asked. He groaned for an answer.\nI looked up and saw that Terminator was nearly upon us. Almost involuntarily I proceeded to the ladder tunnel; Freya followed me, and we descended to the ground. “Disturbing not to be able to trust the cowcatchers,” I remarked as my heartbeat slowed.\n“Nathaniel,” Freya said, looking exasperated. “I made all that up, you know that.”\n“Ah. Yes, of course.”\nAs we rejoined Arnold he was just struggling to a seated position. “My ankle,” he said. Then the green wash of light from Terminator disappeared, as did the night sky; the city slid over us, and we were encased in a gloom interrupted by an occasional running light. All twelve of the city’s big tracks had disappeared, swallowed by the sleeves in the city’s broad metallic foundation. Only the open slots that allowed passage over the pylons showed where the sleeves were; for a moment in the darkness it seemed we stood between two worlds held apart by a field of pylons.\nMeanwhile the city slid over us soundlessly, propelled by the expansion of the tracks themselves. You see, the alloy composing the tracks is capable of withstanding the 425 degree Centigrade heat of the Mercurial day, but the cylinders do expand just a bit in this heat. Here in the Terminator is the forward edge of the cylinders’ expansion, and the smooth-sided sleeves above us at that moment fit so snugly over the cylinders that as the cylinders expand, the city is pushed forward toward the cooler, thinner railing to the west; and so the city is propelled by the sun, while never being fully exposed to it. The motive force is so strong, in fact, that resistance to it arranged in the sleeves generates the enormous reserves of energy that Terminator has sold so successfully to the rest of civilization.\nThough I had understood this mechanism for decades, I had never before observed it from this angle, and despite the fact that I was somewhat uneasy to be standing under our fair city, I was also fascinated to see its broad, knobby silver underside gliding majestically westward. For a long time I did nothing but stare at it.\n“We’d better get to the car,” Freya said. “The sun will be up very soon after the city passes, and then we’ll be in trouble.”\nSince Arnold was still cuffed to the plates, and had at least a sprained ankle, walking with him slung between us was a slow process. While we were at it the Dawn Wall passed over us, and suddenly the twelve tracks and the stars between them were visible again. “Now we’d better hurry,” said Freya. Above us the very top of the Dawn Wall flared a brilliant white; sunlight was striking that surface, only two hundred meters above us. Dawn was not far away. In the glare of reflected light we could see the heavily tire-printed ground under the cylinders perfectly, and for a while our eyes were nearly overwhelmed. “Look!” Freya cried, shielding her eyes with one hand and pointing up at the sun-washed slope of the city wall with the other. “It’s the inspiration of our Monet, don’t you think?”\nDespite our haste, the great Rouen cathedral of Mercury pulled away from us. “This won’t do,” Freya said. “Only a bit more to the car, but we have to hurry. Here, Arnold, let me carry you—” and she ran, carrying Arnold piggyback, the rest of the way to the car. As we maneuvered him through the lock, a tongue of the sun’s corona licked briefly over the horizon, blinding us. I felt scorched; my throat was dry. We were now at the dawn edge of the Terminator zone, and east-facing slopes burned white while west-facing slopes were still a perfect black, creating a chaotic patchwork that was utterly disorienting. We rolled into the car after Arnold, and quickly drove west, passing the city, returning to the night zone, and arriving at a station where we could make the transfer into the city again. Freya laughed at my expression as we crossed the gap. “Well, Nathaniel,” she said, “home again.”\nThe very next day Freya arranged for those concerned with the case to assemble on Heidi’s patio again. Four police officials were there, and one took notes. The painting of the cathedral of Rouen was back in its place on the villa wall; George Butler and Harvey Washburn stood before it, while Arnold Ohman and Heidi paced by the patio’s edge. Lucinda and Delaurence, the cook, watched from behind the patio bar.\nFreya called us to order. She was wearing a severe blue dress, and her white-blond hair was drawn into a tight braid that fell down her back. Sternly she said, “I will suggest to you an explanation for the death of Sandor Musgrave. All of you except for the police and Mr. Sebastian were to one extent or another suspected of killing him, so I know this will be of great interest to you.”\nNaturally there was an uneasy stir among those listening.\n“Several of you had reason to hate Musgrave, or to fear him. The man was a blackmailer by profession, and on Earth he had obtained evidence of illegalities in the merger Heidi and George made five years ago, that gave him leverage over both of you. This and motives for the rest of you were well established during the initial investigation, and we need not recapitulate the details.\n“It is also true, however, that subsequent investigations have confirmed that all of you had alibis for the moment when Musgrave was struck down. Lucinda and Delaurence were together in the kitchen until Lucinda left to investigate the shout she heard; this was confirmed by caterers hired for the Solday party. Heidi left the patio shortly before Musgrave was found, but she was consulting with Hiu and the orchestra during the time in question. George Butler went into the house with Arnold Ohman, but they were together for most of the time they were inside. Eventually George left to go to the bathroom, but luckily for him the orchestra’s first clarinetist was there to confirm his presence. And fortunately for Mr. Ohman, I myself could see him from the patio, standing in the hallway until the very moment when Lucinda screamed.\n“So you see—” Freya paused, eyed us one by one, ran a finger along the frame of the big painting. “The problem took on a new aspect. It became clear that, while many had a motive to kill Musgrave, no one had the opportunity. This caused me to reconsider. How, exactly, had Musgrave been killed? He was struck on the head by the frame of one of Heidi’s hall mirrors. Though several mirrors were broken in the melee following Lucinda’s screams, we know the one that struck Musgrave; it was at the bend in the hallway leading from the atrium to the patio. And it was only a couple of meters away from a step down in the hallway.”\nFreya took a large house plan from a table and set it before the policeman. “Sandor Musgrave, you will recall, was new to Mercury. He had never seen a Solday celebration. When the Great Gates opened and the reflected light filled this villa, my suggestion is that he was overwhelmed by fright. Lucinda heard him cry for help—perhaps he thought the house was burning down. He panicked, rushed out of the study, and blindly began to run for the patio. Unable to see the step down or the mirror, he must have pitched forward, and his left temple struck the frame with a fatal blow. He crawled a few steps farther, then collapsed and died.”\nHeidi stepped forward. “So Musgrave died by accident?”\n“This is my theory. And it explains how it was that no one had the opportunity to kill him. In fact, no one did kill him.” She turned to the police. “I trust you will follow up on this suggestion?”\n“Yes,” said the one taking notes. “Death declared accidental by consulting investigator. Proceed from there.” He exchanged glances with his colleagues. “We are satisfied this explains the facts of the case.”\nHeidi surveyed the silent group. “To tell you the truth, I am very relieved.” She turned to Delaurence. “Let’s open the bar. It would be morbid to celebrate an accidental death, but here we can say we are celebrating the absence of a murder.”\nThe others gave a small cheer of relief, and we surrounded the bartender.\nA few days later Freya asked me to accompany her to North Station. “I need your assistance.”\n“Very well,” I said. “Are you leaving Terminator?”\n“Seeing someone off.”\nWhen we entered the station’s big waiting room, she inspected the crowd, then cried, “Arnold!” and crossed the room to him. Arnold saw her and grimaced. “Oh, Arnold,” she said, and leaned over to kiss him on each cheek. “I’m very proud of you.”\nArnold shook his head, and greeted me mournfully. “You’re a hard woman, Freya,” he told her. “Stop behaving so cheerfully; you make me sick. You know perfectly well this is exile of the worst sort.”\n“But Arnold,” Freya said, “Mercury is not the whole of civilization. In fact it could be considered culturally dead, an immense museum to the past that has no real life at all.”\n“Which is why you choose to live here, I’m sure,” he said bitterly.\n“Well of course it does have some pleasures. But the really vital centers of any civilization are on the frontier. Arnold, and that’s where you’re going.”\nArnold looked completely disgusted.\n“But Arnold,” I said. “Where are you going?”\n“Pluto,” he said curtly.\n“Pluto?” I exclaimed. “But whatever for? What will you do there?”\nHe shrugged. “Dig ditches, I suppose.”\nFreya laughed. “You certainly will not.” She addressed me. “Arnold has decided, very boldly I might add, to abandon his safe career as a dealer here on Mercury, to become a real artist on the frontier.”\n“But why?”\nFreya wagged a finger at Arnold. “You must write us often.”\nArnold made a strangled growl. “Damn you, Freya. I refuse. I refuse to go.”\n“You don’t have that option,” Freya said. “Remember the chalk, Arnold. The chalk was your signature.”\nArnold hung his head, defeated. The city interfaced with the spaceport station. “It isn’t fair,” Arnold said. “What am I going to do out on those barbaric outworlds?”\n“You’re going to live,” Freya said sternly. “You’re going to live and you’re going to paint. No more hiding. Understand?”\nI, at any rate, was beginning to.\n“You should be thanking me profusely,” Freya went on, “but I’ll concede you’re upset and wait for gratitude by mail.” She put a hand on Arnold’s shoulder, and pushed him affectionately toward the crossing line. “Remember to write.”\n“But,” Arnold said, a panicked expression on his face. “But—”\n“Enough!” Freya said. “Be gone! Or else.”\nArnold sagged, and stepped across the divide between the stations. Soon the city left the spaceport station behind.\n“Well,” Freya said. “That’s done.”\nI stared at her. “You just helped a murderer to escape!”\nShe lifted an eyebrow. “Exile is a very severe punishment; in fact in my cultural tradition it was the usual punishment for murder committed in anger or self-defense.”\nI waved a hand dismissively. “This isn’t the Iceland of Eric the Red. And it wasn’t self-defense—Sandor Musgrave was outright murdered.”\n“Well,” she said. “I never liked him.”\nI told you before; she has no sense of right and wrong. It is a serious defect in a detective. I could only wave my arms in incoherent outrage; and my protests have never carried much weight with Freya, who claims not even to believe them.\nWe left the station. “What’s that you were saying to Arnold about chalk?” I said, curiosity getting the better of me.\n“That’s the clue you provided, Nathaniel—somewhat transformed. As you reminded me, Musgrave was pointing at the patio, and Heidi’s patio is made of a block of the Dover cliffs. Dover cliffs, as you know, are composed of chalk. So I returned to the painting, and cut through the back to retrieve samples of the chalk used in the underdrawing, which had been revealed to me by infrared photography.” She turned a corner and led me uptown. “Chalk, you see, has its own history of change. In Monet’s time chalk was made from natural sources, not from synthetics. Sure enough, the chalk I took from the canvas was a natural chalk. But natural chalk, being composed of marine ooze, is littered with the fossil remains of unicellular algae called coccoliths. These coccoliths are different depending upon the source of the chalk. Monet used Rouen chalk, appropriately enough, which was filled with the coccoliths Maslovella bamesae and Cricolithus pemmatoidens. The coccoliths in our painting, however, are Neococcolithes dubius. Very dubious indeed—for this is a North American chalk, first mined in Utah in 1924.”\n“So Monet couldn’t have used this chalk! And there you had your proof that the painting is a fake.”\n“Exactly.”\nI said doubtfully. “It seems a subtle clue for the dying Musgrave to conceive of.”\n“Perhaps,” Freya said cheerfully. “Perhaps he was only pointing in the direction of the patio by the accident of his final movements. But it was sufficient that the coincidence gave me the idea. The solution of a crime often depends upon imaginary clues.”\n“But how did you know Arnold was the forger?” I asked. “And why, after taking the trouble to concoct all those paints, did he use the wrong chalk?”\n“The two matters are related. It could be that Arnold only knew he needed a natural chalk, and used the first convenient supply without knowing there are differences between them. In that case it was a mistake—his only mistake. But it seems unlike Arnold to me, and I think rather that it was the forger’s signature. In effect, the forger said, if you take a slide of the chalk trapped underneath the paint, and magnify it five thousand times with an electron microscope, you will find me. This chalk never used by Monet is my sign. For on some level every forger hopes to be discovered, if only in the distant future—to receive credit for the work.\n“So I knew we had a forger on Mercury, and I was already suspicious of Arnold, since he was the dealer who brought the painting to Mercury, and since he was the only guest at Heidi’s party with the opportunity to kill Musgrave; he was missing during the crucial moments—”\n“You are a liar!”\n“And it seems Arnold was getting desperate; I searched among his recent bills, and found one for three suction plates. So when we found him on the track I was quite sure.”\n“He stuck himself to the track?”\n“Yes. The one on his right wrist was electronically controlled, so after setting the other two he tripped the third between his teeth. He hoped that we would discover him there after missing him at the museum, and think that there was someone else who wished him harm. And if not, the cowcatchers would pull him free. It was a silly plan, but he was desperate after I set up that appointment with him. When I confronted him with all this, after we rescued him from the tracks, he broke down and confessed. Sandor Musgrave had discovered that the Monet was a fake while blackmailing the Evans family in England, and after forcing Heidi to give him a job, he worked on the painting in secret until he found proof. Then he blackmailed Arnold into bankruptcy, and when on Solday he pressed Arnold for more money, Arnold lost his composure and took advantage of the confusion caused by the opening of the Great Gates to smack Musgrave on the head with one of Heidi’s mirrors.”\nI wagged a finger under her nose. “And you set him free. You’ve gone too far this time, Freya Grindavik.”\nShe shook her head. “If you consider Arnold’s case a bit longer, you might change your mind. Arnold Ohman has been the most important art dealer on Mercury for over sixty years. He sold the Vermeer collection to George Butler, and the Goyas to Terminator West Gallery, and the Pissarros to the museum in Homer Crater, and those Chinese landscapes you love so much to the city park, and the Kandinskys to the Lion of the Grays. Most of the finest paintings on Mercury were brought here by Arnold Ohman.”\n“So?”\n“So how many of those, do you think, were painted by Arnold himself?”\nI stopped dead in the street, stunned at the very idea. “But—but that only makes it worse! Inestimably worse! It means there are fakes all over the planet!”\n“Probably so. And no one wants to hear that. But it also means Arnold Ohman is a very great artist. And in our age that is no easy feat. Can you imagine the withering reception his painting would have received if he had done original work? He would have ended up like Harvey Washburn and all the rest of them who wander around the galleries like dogs. The great art of the past crashes down on our artists like meteors, so that their minds resemble the blasted landscape we roll over. Now Arnold has escaped that fate, and his work is universally admired, even loved. That Monet, for instance—it isn’t just that it passes for one of the cathedral series; it could be argued that it is the best of them. Now is this a level of greatness that Arnold could have achieved—would have been allowed to achieve—if he had done original work on this museum planet? Impossible. He was forced to forge old masters to be able to fully express his genius.”\n“All this is no excuse for forgery or murder.”\nBut Freya wasn’t listening. “Now that I’ve exiled him, he may go on forging old paintings, but he may begin painting something new. That possibility surely justified ameliorating his punishment for killing such a parasite as Musgrave. And there is Mercury’s reputation as art museum of the system to consider . . . ”\nI refused to honor her opinions with a reply, and looking around, I saw that during our conversation she had led me far up the terraces. “Where are we going?”\n“To Heidi’s,” she said. And she had the grace to look a little shamefaced—for a moment, anyway. “I need your help moving something.”\n“Oh, no.”\n“Well,” Freya explained, “when I told Heidi some of the facts of the case, she insisted on giving me a token of her gratitude, and she overrode all my refusals, so . . . I was forced to accept.” She rang the wall bell.\n“You’re joking,” I said.\n“Not at all. Actually, I think Heidi preferred not to own a painting she knew to be a fake, you see. So I did her a favor by taking it off her hands.”\nWhen Delaurence let us in, we found he had almost finished securing Rouen Cathedral—Sun Effect in a big plastic box. “We’ll finish this,” Freya told him.\nWhile we completed the boxing I told Freya what I thought of her conduct. “You’ve taken liberties with the law—you lied right and left—”\n“Well boxed,” she said. “Let’s go before Heidi changes her mind.”\n“And I suppose you’re proud of yourself.”\n“Of course. A lot of lab work went into this.”\nWe maneuvered the big box through the gate and into the street, and carried it upright between us, like a short flat coffin. We reached Freya’s villa, and immediately she set to work unboxing the painting. When she had freed it she set it on top of a couch, resting against the wall.\nShaking with righteous indignation, I cried, “That thing isn’t a product of the past! It isn’t authentic. It is only a fake. Claude Monet didn’t paint it.”\nFreya looked at me with a mild frown, as if confronting a slightly dense and very stubborn child. “So what?”\nAfter I had lectured her on her immorality a good deal more, and heard all of her patient agreement, I ran out of steam. “Well,” I muttered, “you may have destroyed all my faith in you, and damaged Mercury’s art heritage forever, but at least I’ll get a good story out of it.” This was some small comfort. “I believe I’ll call it The Case of the Thirty-third Cathedral of Rouen.”\n“What’s this?” she exclaimed. “No, of course not!” And then she insisted that I keep everything she had told me that day a secret.\nI couldn’t believe it. Bitterly I said, “You’re like those forgers. You want somebody to witness your cleverness, and I’m the one who is stuck with it.”\nShe immediately agreed, but went on to list all the reasons no one else could ever learn of the affair—how so many people would be hurt—including her, I added acerbically—how so many valuable collections would be ruined, how her plan to transform Arnold into a respectable honest Plutonian artist would collapse, and so on and so forth, for nearly an hour. Finally I gave up and conceded to her wishes, so that the upshot of it was I promised not to write down a single word concerning this particular adventure of ours, and I promised furthermore to say nothing of the entire affair, and to keep it a complete secret, forever and ever.\nBut I don’t suppose it will do any harm to tell you.\nOriginally published in Universe 15, edited by Terry Carr, 1985.\nKim Stanley Robinson is an American science fiction writer living in Davis, California. He has won two Hugo Awards, three Nebula Awards, the Campbell Memorial Award, and a World Fantasy Award for his work. His latest novels are Aurora, Shaman, 2312, Galileo's Dream, Green Earth, and New York 2140.", "source": "https://clarkesworldmagazine.com/robinson_02_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mercurial by Kim Stanley Robinson"}