{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gord Sellar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "db+iJKoaBmi4tGvzKNGYaa8pWhQ=", "id": null, "license": null, "comments": "", "raw_text": "3970 words, short story  Of Melei, of Ulthar  Haunted went Melei that evening into the streets of Ulthar, haunted by what she had seen in the dream-voyage of the night before; desert fires burning distant across the dark and dusty plain, and an immense black silhouette of some enormous outcropping of rock rising up, upward into the sky to blot out the tiny flickering stars across half of the heavens. In a dream, too, had she heard voices echoing against the stone walls of buildings crammed together along narrow streets, voices laden with care and worry, crying her name out into the blackness of deepening night.  Her name—but not Melei, not that name she used in waking—had crouched in wait beneath her tongue; perhaps it was only natural, in the dreaming, in this other world, to be called something else. That name, strange in her mouth, cold and quivering when she nearly whispered it to herself, was hers. And why not? She was alone, she lived alone, and with nobody shared the secrets of her nocturnal voyages, for who would call her anything but mad . . . ?  So that awake, by the lengthening hours of that slow, still-warm autumn endlessness, Melei stalked the cozy, jumbled streets of Ulthar. Listlessly; suffering through a sunny afternoon as faraway gleam of dreamt flames in darkness, and the tempo of faint faraway cries and chanting, haunted her waking mind.  Cats—for in Ulthar, where there was one, there were ten—traipsed past in little dainty-footed troupes, eyeing her with the wary look of beings that glimpsed her dark secret as no human could. She yielded the road to them just as everyone in Ulthar did, occasionally stooping to rub one behind the ear. Briefly, just until its tail batted back against her elbow and it turned its head slightly before going on along its carefree, shiftless way. Always one with black and white patches, always with white paws, she knelt to touch those chiaroscuro beasts with the slightest hesitation only, with a trepidation she prayed nobody noticed, most of all the beasts themselves. And yet she was sure in her heart’s blood that they knew. They knew.  And then, round some corner would she follow the troupe of cats, and find a pack of soldiers standing together. Staring at her from behind grilled black faceplates. She would stop, as other citizens did not, and stare into those night-dark eyes, glimpse the dark folds of eyelids surrounding those bold orbs, and sigh gently and slowly to herself, for these people looked to her like the folk of her dreams, almost. Swarthy, yes, and smelling of exotic, perplexing spices. Beside them, in the street, as clouds drifted in overhead, over the tops of gods-haunted mountains, she took comfort in that strange aroma, the hint of myrrh and tehenna and cinnamon, the broad brown lips pursed stern. The foreign soldiers looked at this bold young woman with wonder, for none of Ulthar had done as she, pausing to gaze into their eyes with something like recognition, perhaps, or fascination, in their own.  Only Melei.  She gazed thus, for a few brief moments, upon these strange and ever-surly foreigners, as a wanderer sometimes, but only sometimes, looks upon the walls of the city where her people have dwelt since forgotten ages. In dreaming, she often had seen folk like these, sat at fires and eaten with them, sung songs she only half-understood, songs shared with that hopeful, dire world which filled her waking days with longing.  But no songs now. Instead, she whispered a word to them, a single word in her own language. One of them, in his fluted blue steel armor, shrugged slightly. They looked at one another, and then at her again, the expectation being that she would move on.  “Atal,” she asked them, a name, a single word so pathopoeic that the warriors could do nothing but ache from it, and she nodded her fair head past them, to a distant gate behind, up to the high temple carved from hillstone there, where ancient Atal was, in those days, thought still to linger. His image had been painted last as a priest in repose, feeble and centuries-worn Atal in white robes, shaven head resting upon a stone pillow; his eyes full of longing, staring up from the canvas. Melei had seen the picture in a public hall, gazed reverently on it for an hour while closing her eyes and opening them again, over and over until the image was stamped upon her mind perfectly, indelibly.  The soldiers only pursed their dark, broad lips harder and shook their heads. They nodded down the road. Not towards wherever Atal now was, if indeed the old priest lived still; these footmen of the new conqueror were directing her nowhere except away. Melei gazed upon them a moment more. What songs had they sung as boys? What games had they played amidst fires burning among the darkling foothills surrounding the great peaks of the south? Slowly, she turned and followed a quiet old striped tomcat away, along a gutter. But she heard them speak of her, then, to one another.  And then, suddenly, Ulthar was no longer tinged by her dreams, no longer dressed in that enchantment she had smuggled back from the world of her slumbering voyages. As the soldiers spoke with muted words at once utterly gibberish and completely familiar, she gave up on her earlier half-fancies that she might even have understood them, at least the sense in them, if only she could have heard their voices a little more clearly. It was a lie. They were not mystical creatures. They were quotidian men of muscle and sinew, and Ulthar was simply a holding in their masters’ empire.  And Melei longed for more.  She felt their eyes upon her as she wandered down the road, and round a corner, her eyes searching the sky for the first stars, that she might turn homeward and settle herself down to the repose and reverie that only sleep could bring her.  The black night-ocean roared beneath, broad and noisy with the lapping of waves that she could hear clear as children’s voices, so silently did she glide through the deep, familiar sepia that always preceded sunrise on these flights.  The ocean was new: often, she had soared above grasslands, occasionally among the buildings of a smog-choked city, but tonight, this dream-morning, she found herself above some expansive southern ocean. Below, from time to time, a lumbering darkness could be seen, spilling light from tiny windows, luminance far different from any reflection of the whole and simple face of the single crescent moon above her. These were windows in the hulls of lumbering ships that crawled across the ruined sea.  As sepia slowly burnt into orange with the coming of the morning sun, Melei spied the coast ahead. It was an immense and hideous metal graveyard, the hulls and decks of broken ships protruding from the sand, their bare bones laid out as if upon an examiner’s table. Among them gathered labouring men, already at work hauling enormous rusty chains and ruined slabs of metal ashore. The ships looked as if they had been hewn in half by some enormous, awful blade and left to bleed into the ocean. For the waters, too, were sullied here, stained black and putrid. The rancid stink of the waters wafted up into the air, and Melei gasped in stunned disbelief.  This was not the same site as she had visited in previous dream-flights, though the people shared the same dark hue of skin, wore the same resignation on their faces. A man beneath her dropped his load, a gargantuan link of chain slamming down onto his leg, and he collapsed upon the poisoned sand with a cry so loud she could hear it as she soared past.  It was exquisite, wrenching but enchanting. It was a place where mistakes mattered, and this was why Melei kept returning. Because this world was one of consequences and dire meanings, godless and hard and amazing. But this beach was not the precise place she sought. In Ulthar, Melei was a mere seamstress, a needle-girl who day in and day out walked the streets careful not to step in cat shit. But in this strange world, she found herself possessed of powers beyond anything a real person in Ulthar could have boasted in millennia. She could soar in the sky, and she could go anywhere.  And there was a place that she was seeking, these nights.  Below her, a fence surrounded an enormous tent village. Men shouted, and there was a violent clattering sound, and screams. She saw people running, people clothed in white that shone against their dark flesh. To Melei they were unspeakably beautiful in their terror. Running for their lives, panicked. She felt her tears welling up. Such awful lives; and yet they held onto them so desperately. What humbling beauty, what endless rapture, that beings could live that way, in a world so starved of magic and gods. It enchanted her, as she swooped down low enough to brush her fingertips against the tattered hems of a few of the dingy white shirts that ran long enough to reach down past the knees of the scrambling men and women.  Melei concentrated, and suddenly spun in the air, soaring now into the northwest. There was a city there that she had read of in secret books hidden in the drab tearooms of Ulthar, books only secret because nobody read them—for the denizens of Ulthar spoke only of the failed expeditions to unearth Kadath, old dead Kadath, and of gossip in the wracked court of Ulthar that was now under Southern rule. But Melei had read on fragile, forgotten pages of the wild tangled passage-roads that ran between the great grey monoliths of that old city on the coast, the city with the unbroken towers and the bridges and the streets laden with music and voices and wavering lights. Across an ocean, it lay: unutterably far by the standards of these folk; but for a dream-traveler, its bright roads and bustling noise lay within reach, if the will was strong.  If only she could find that strange and mystic polis . . . nobody had done so in aeons of dreaming, not in the lifetimes even of gods. The sky swallowed her, and she soared into it not lightly, but as an arrow soars toward its victim’s death: unstoppable, unabashed, and filled with the most resolute certainty imaginable.  Excrescences thick and strange rose from the drowned streets, wafting steamily up from broad, jagged-barred holes in the ground, and Melei swept down into the fog of the broken city. This was the place, but no longer the city of the pages, not the city about the magnificences of which had been whispered and scribbled out by dream-wanderers in ancient tomes long-lost. This polis had changed, its million secret details discarded like the flimsy skin of an ancient serpent drifting through the slow eternity of its being.  The city had, by some horrid magic or doom, been drowned, and slain. Ruined, its towering spirit smashed apart, the smithereens tossed into cold water and frozen away into bitter ice.  Here, a great library stood encrusted in ice that gleamed chill as diamonds in darkness; and before it, barges poled by men in thick woolen coats, shivering and calling out in their strange tongues, baleful cries. Old men and women gathered upon the library steps and huddled at its high windows as flakes of snow fell enormous and faintly grey with the ash of fires half a world away.  And there, further along, the great old temples of the last true religion in that world, the fanatic cult-houses of the worshippers of the magical curve, the endless blessed marketeers and insatiable blood-hungry pirates of water and light and time. There, these rectangular temples of lost merchandises stood with windows smashed, empty from lootings, empty except for the poor useless souls who took refuge in their icy halls remaining since the cult had loosed its foul and terrible powers upon the world, and toppled everything that humankind had once built up.  Thence flew Melei, deeper into the city, over crumbled steel bridges and the steeples of abandoned, burnt-down churches. She heard singing, not of human voices, not of ghosts—for this world, haunted though its inhabitants’ faces were, was a place bereft of stalking ghŭls and spirits hungrily wandering. No, not like the frightening lands that lay distant from Ulthar; nothing like the shadowy passes near high Old Kadath or the caverns of B’thaniss. Only the wretched faces of the living gazed out through the smashed-glass windows. The voice she heard was none other than her own, crying out her exultant terror.  An open square between the broken buildings spread out below her, and she wondered whether this had been a park, or the base of some enormous destroyed temple, or perhaps that square where, in ancient frigid nights, the folk of the city had gathered to witness the death-knell of the ending year and cry out jubilant with the beginning of the new. No hint suggested which guess might be correct.  She thought again of living here, in this strange world of cold consequences, as often she had before. Shivering—not from cold, for her dreaming self was swaddled in thick, warm wool, and something of the power of her dream-voyaging shielded her from the worst of the awful, ruined clime—but rather from a titillation derived less from horror at the ruined city, or that such ruination was possible, than out of the purer terror that shook her upon witnessing the magnificent finality of the fact of the ruination itself.  Broken buildings slumbered all around her as she flew past, and she marveled that this world was thus; a place where ruinations could be visited upon mighty civilizations in a generation, yet where the people here would endure on, shivering and hungry, fighting to continue. Whisperings of the fate of Sarnath bubbled up from the silence of her forgotten childhood, but there peered no specters from the windows of this city, at least none that had died. Only the pale and sallow faces of the hungry stared out at her, living scavengers looking out, lit by fires and shame.  Terror. The terror of finding oneself before a mountain to be scaled, a mountain the height of a dozen nations piled upon one another, end to end, boasting whole civilizations and waste lands between them, upon a slope rising unceasingly upward into the sky. The terror of looking upon the ocean stirred into a raging turmoil of violence. Terror at confronting the great secret of this world: that all things had endings, all things could be destroyed just as they had once, long ago, been built up. That terror swept through Melei, thrilled her.  That was when her name in this world, that other name, pierced up into her tongue, begging again to be spoken and seal itself upon her.  She bit her tongue, bit down into it so hard that it ached and bled a little. To say the name . . . to consign herself among the living shades . . . such a temptation . . .  The name fought relentlessly. It would be said, she realized, someday. She would come to live here, in this drowned city of humbling, awful beauty. It would be her home, someday, taking her into its brutal black arms like a lover would do, grinding its iciness against her shivering flesh.  Still she fought, clenching her teeth and grinding them together so violently that she felt they might break off in her mouth. She pushed herself upward, into the sky, letting go of the city even as she stared into the watery canal gridwork of its forgotten, worthless streets. She let herself ascend, into the foul clouds that were heavy with strange poisons, up into the cold nebulousness that lay beyond them, falling away from this awful and lovely world that was her constant obsession, this place of strange meanings and consequences and cruel finalities.  The city and all of its broken, awful grandeur blurred into a mere patch of indistinct darkness dotted with scattered open fires, blending into the surrounding darkness and becoming nothingness as she fell upward, outward; away from the world once again.  Melei’s eyes opened slowly as the sunrise just finished and serene Ulthar gradually stirred from its long nocturnal slumber. She slid her prodigious bedding aside, and took up her scribbling-notebook in one hand, searching for the words that would draw the magnificently drab colors across from that other world into hers.  A troupe of cats passed by her window, miaowing gleefully at one another, and she rose to peer out at them, as if to divine some portent from the colors of their coats; but they were a motley pack, impossible to read even for a girl as bright as Melei.  Waking, dreaming. She felt as if a woman torn between two lovers—one of them calm, and sweet, and still and good, and the other magnificent, stone-muscled and taciturn and bold enough to seize her and pull her close to him in the darkness of night.  She set the notebook down, ruminating. There was a choice coming. She would have to choose a name. Said she, in that world, “Melei,” then her dark lover would listen, and hear, and understand what her heart said. The delicious torture would end, and he would send her home . . . never to return. Yet said she that other name, that strange name that even now squirmed beneath her tongue, prickling her mouth and fighting to be pronounced in the sunny morning calm of Ulthar, then her dark lover would seize her, all at once, and carry her off into the delightful terror of the world of her dreams, leaving the streets of Ulthar forever empty of her.  She could feel the city’s ache, at the very thought of her leaving. The city’s ache, or perhaps it was her own.  No harm could come of writing the name, she decided. She had written it upon her own palm, in different scripts, one by one, and not a thing had happened save that she had dreamt of the other world sooner, and more fiercely, each time. She could write it upon a page, she was sure. It was not the same as saying it. She could still decide. Melei, or . . .  She took a quill, unlidded a jar of sepia ink, and touched the quill’s tip into the inky darkness. Without speaking—with her jaw locked firmly, to guard against accidental pronouncement—she touched the tip of the quill against the gently yellowed page. The dawn sunlight cast a shadow from the feather quill, throwing a line of gentle shading across the page and into her lap. She shut her eyes, and opened them, and shut them again, and once more opened them, so as to let the shadow find a place in her heart’s memory.  She realized, then, she was building up a storehouse of memories already. The faces of the swarthy guards. The troupes of cats mewing happily all around her. She had stopped hating Ulthar, wincing at the summery stink of the cat turds and grumbling at the foreign power that ruled the place. She had found the kind of love that wells up one when she abandons her lover for another, her world for another’s; that sort of love that is rooted in impossibility that cannot be prevented even by sorrow, even by fear, even by the movement of the shadow across a page as the sun slips up into the sky.  She did not write the name, but instead rose, scribbling-book still in hand, and went back to her window. The sweetest cottages of Ulthar lay just there, empty of terror but touching in their way, stirring memories of the games she had played in these dusty streets during what felt like another life. Laughter and the voices of children who had somehow become half-forgotten friends, folk whose faces that she had seen not once in ages and ages.  And Melei knew, then, that she would say the name. Perhaps not that night. Not so soon as that, she told herself. But she would say it, and go, and old Ulthar would continue on without her, as it had done before her birth, with its cats and gentle sunny days and whispering old women and men.  She filled a basin with warm water, and carried it to a high table in her room, her feet padding upon the wooden planks of the floor. Outside, a bird sang a snatch of birdsong she had heard dozens of times before, though she could not name what type of bird it was. She splashed the water on her face, delighting in its gentle warmth, steeling herself.  For there would be precious little warmth like this in the other world, in the arms of her dark dream lover.  And then she donned a bright and comfortable silk, light in shade to suit the warm day, and crossed the threshold of her home, going out into a street that smelled of blooming cherry flowers and apple orchards that had been planted by the Southerners. There, in the street, a trio of cats gazed up at her, curiously eyeing her approach with heads tilted one way or another. They seemed, like all cats in Ulthar, almost as if they wished to ask her something, or to dispense some holy secret to her, but if indeed this was so, they said nothing, their own jaws as firmly locked as hers had been minutes before.  An old man made his way down the street, comfortable and calm though his back was a little bent. He smiled at her, and a cock crowed in the distance, and Melei closed her eyes. And opened them again.  And closed them.  And opened them again, committing every breath of it, every shade and tiny noise and scent, to the strongest urn in the storehouse of her memory. The voices of children long gone echoed, now, within that storehouse, and the image of her mother baking sour bread, and the laughter of cats—for in Ulthar, by nights, cats do laugh, though only the most blessed ever hear it more than once—and the sunrises, the sunrises that had saddened her so often.  Perplexed, she went through the streets, dazed, eyes and heart drinking Ulthar in deeply and constantly until she was drunk with the place. It was her farewell kiss to the world of her birth, a kiss of the eyes upon the forehead. It was her last embrace of the little city, day-long as she wandered and rambled from shop to temple to the current doorsteps of present friends and the abandoned doorways of friends long-lost. She met those she had once loved, and said nothing of leave-taking, though she wondered if they could see it in her eyes. Yet she asked not a soul as she spoke to them of nothings, of needle work and gossip and of the latest news from other cities and lands. As she walked those quiet, calm streets, her footsteps tapping gently the beat of her last ballad to Ulthar, she realized she loved this city, loved it unceasingly and would do so evermore though she would not live here any longer.  For as the sun began slowly to draw itself down unto the horizon, and the shadows lengthened across the streets as another shadow had done upon her page that morning, the name beneath Melei’s tongue stirred once more, this final time irresistibly . . . Gord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies.", "text": "3970 words, short story\nOf Melei, of Ulthar\nHaunted went Melei that evening into the streets of Ulthar, haunted by what she had seen in the dream-voyage of the night before; desert fires burning distant across the dark and dusty plain, and an immense black silhouette of some enormous outcropping of rock rising up, upward into the sky to blot out the tiny flickering stars across half of the heavens. In a dream, too, had she heard voices echoing against the stone walls of buildings crammed together along narrow streets, voices laden with care and worry, crying her name out into the blackness of deepening night.\nHer name—but not Melei, not that name she used in waking—had crouched in wait beneath her tongue; perhaps it was only natural, in the dreaming, in this other world, to be called something else. That name, strange in her mouth, cold and quivering when she nearly whispered it to herself, was hers. And why not? She was alone, she lived alone, and with nobody shared the secrets of her nocturnal voyages, for who would call her anything but mad . . . ?\nSo that awake, by the lengthening hours of that slow, still-warm autumn endlessness, Melei stalked the cozy, jumbled streets of Ulthar. Listlessly; suffering through a sunny afternoon as faraway gleam of dreamt flames in darkness, and the tempo of faint faraway cries and chanting, haunted her waking mind.\nCats—for in Ulthar, where there was one, there were ten—traipsed past in little dainty-footed troupes, eyeing her with the wary look of beings that glimpsed her dark secret as no human could. She yielded the road to them just as everyone in Ulthar did, occasionally stooping to rub one behind the ear. Briefly, just until its tail batted back against her elbow and it turned its head slightly before going on along its carefree, shiftless way. Always one with black and white patches, always with white paws, she knelt to touch those chiaroscuro beasts with the slightest hesitation only, with a trepidation she prayed nobody noticed, most of all the beasts themselves. And yet she was sure in her heart’s blood that they knew. They knew.\nAnd then, round some corner would she follow the troupe of cats, and find a pack of soldiers standing together. Staring at her from behind grilled black faceplates. She would stop, as other citizens did not, and stare into those night-dark eyes, glimpse the dark folds of eyelids surrounding those bold orbs, and sigh gently and slowly to herself, for these people looked to her like the folk of her dreams, almost. Swarthy, yes, and smelling of exotic, perplexing spices. Beside them, in the street, as clouds drifted in overhead, over the tops of gods-haunted mountains, she took comfort in that strange aroma, the hint of myrrh and tehenna and cinnamon, the broad brown lips pursed stern. The foreign soldiers looked at this bold young woman with wonder, for none of Ulthar had done as she, pausing to gaze into their eyes with something like recognition, perhaps, or fascination, in their own.\nOnly Melei.\nShe gazed thus, for a few brief moments, upon these strange and ever-surly foreigners, as a wanderer sometimes, but only sometimes, looks upon the walls of the city where her people have dwelt since forgotten ages. In dreaming, she often had seen folk like these, sat at fires and eaten with them, sung songs she only half-understood, songs shared with that hopeful, dire world which filled her waking days with longing.\nBut no songs now. Instead, she whispered a word to them, a single word in her own language. One of them, in his fluted blue steel armor, shrugged slightly. They looked at one another, and then at her again, the expectation being that she would move on.\n“Atal,” she asked them, a name, a single word so pathopoeic that the warriors could do nothing but ache from it, and she nodded her fair head past them, to a distant gate behind, up to the high temple carved from hillstone there, where ancient Atal was, in those days, thought still to linger. His image had been painted last as a priest in repose, feeble and centuries-worn Atal in white robes, shaven head resting upon a stone pillow; his eyes full of longing, staring up from the canvas. Melei had seen the picture in a public hall, gazed reverently on it for an hour while closing her eyes and opening them again, over and over until the image was stamped upon her mind perfectly, indelibly.\nThe soldiers only pursed their dark, broad lips harder and shook their heads. They nodded down the road. Not towards wherever Atal now was, if indeed the old priest lived still; these footmen of the new conqueror were directing her nowhere except away. Melei gazed upon them a moment more. What songs had they sung as boys? What games had they played amidst fires burning among the darkling foothills surrounding the great peaks of the south? Slowly, she turned and followed a quiet old striped tomcat away, along a gutter. But she heard them speak of her, then, to one another.\nAnd then, suddenly, Ulthar was no longer tinged by her dreams, no longer dressed in that enchantment she had smuggled back from the world of her slumbering voyages. As the soldiers spoke with muted words at once utterly gibberish and completely familiar, she gave up on her earlier half-fancies that she might even have understood them, at least the sense in them, if only she could have heard their voices a little more clearly. It was a lie. They were not mystical creatures. They were quotidian men of muscle and sinew, and Ulthar was simply a holding in their masters’ empire.\nAnd Melei longed for more.\nShe felt their eyes upon her as she wandered down the road, and round a corner, her eyes searching the sky for the first stars, that she might turn homeward and settle herself down to the repose and reverie that only sleep could bring her.\nThe black night-ocean roared beneath, broad and noisy with the lapping of waves that she could hear clear as children’s voices, so silently did she glide through the deep, familiar sepia that always preceded sunrise on these flights.\nThe ocean was new: often, she had soared above grasslands, occasionally among the buildings of a smog-choked city, but tonight, this dream-morning, she found herself above some expansive southern ocean. Below, from time to time, a lumbering darkness could be seen, spilling light from tiny windows, luminance far different from any reflection of the whole and simple face of the single crescent moon above her. These were windows in the hulls of lumbering ships that crawled across the ruined sea.\nAs sepia slowly burnt into orange with the coming of the morning sun, Melei spied the coast ahead. It was an immense and hideous metal graveyard, the hulls and decks of broken ships protruding from the sand, their bare bones laid out as if upon an examiner’s table. Among them gathered labouring men, already at work hauling enormous rusty chains and ruined slabs of metal ashore. The ships looked as if they had been hewn in half by some enormous, awful blade and left to bleed into the ocean. For the waters, too, were sullied here, stained black and putrid. The rancid stink of the waters wafted up into the air, and Melei gasped in stunned disbelief.\nThis was not the same site as she had visited in previous dream-flights, though the people shared the same dark hue of skin, wore the same resignation on their faces. A man beneath her dropped his load, a gargantuan link of chain slamming down onto his leg, and he collapsed upon the poisoned sand with a cry so loud she could hear it as she soared past.\nIt was exquisite, wrenching but enchanting. It was a place where mistakes mattered, and this was why Melei kept returning. Because this world was one of consequences and dire meanings, godless and hard and amazing. But this beach was not the precise place she sought. In Ulthar, Melei was a mere seamstress, a needle-girl who day in and day out walked the streets careful not to step in cat shit. But in this strange world, she found herself possessed of powers beyond anything a real person in Ulthar could have boasted in millennia. She could soar in the sky, and she could go anywhere.\nAnd there was a place that she was seeking, these nights.\nBelow her, a fence surrounded an enormous tent village. Men shouted, and there was a violent clattering sound, and screams. She saw people running, people clothed in white that shone against their dark flesh. To Melei they were unspeakably beautiful in their terror. Running for their lives, panicked. She felt her tears welling up. Such awful lives; and yet they held onto them so desperately. What humbling beauty, what endless rapture, that beings could live that way, in a world so starved of magic and gods. It enchanted her, as she swooped down low enough to brush her fingertips against the tattered hems of a few of the dingy white shirts that ran long enough to reach down past the knees of the scrambling men and women.\nMelei concentrated, and suddenly spun in the air, soaring now into the northwest. There was a city there that she had read of in secret books hidden in the drab tearooms of Ulthar, books only secret because nobody read them—for the denizens of Ulthar spoke only of the failed expeditions to unearth Kadath, old dead Kadath, and of gossip in the wracked court of Ulthar that was now under Southern rule. But Melei had read on fragile, forgotten pages of the wild tangled passage-roads that ran between the great grey monoliths of that old city on the coast, the city with the unbroken towers and the bridges and the streets laden with music and voices and wavering lights. Across an ocean, it lay: unutterably far by the standards of these folk; but for a dream-traveler, its bright roads and bustling noise lay within reach, if the will was strong.\nIf only she could find that strange and mystic polis . . . nobody had done so in aeons of dreaming, not in the lifetimes even of gods. The sky swallowed her, and she soared into it not lightly, but as an arrow soars toward its victim’s death: unstoppable, unabashed, and filled with the most resolute certainty imaginable.\nExcrescences thick and strange rose from the drowned streets, wafting steamily up from broad, jagged-barred holes in the ground, and Melei swept down into the fog of the broken city. This was the place, but no longer the city of the pages, not the city about the magnificences of which had been whispered and scribbled out by dream-wanderers in ancient tomes long-lost. This polis had changed, its million secret details discarded like the flimsy skin of an ancient serpent drifting through the slow eternity of its being.\nThe city had, by some horrid magic or doom, been drowned, and slain. Ruined, its towering spirit smashed apart, the smithereens tossed into cold water and frozen away into bitter ice.\nHere, a great library stood encrusted in ice that gleamed chill as diamonds in darkness; and before it, barges poled by men in thick woolen coats, shivering and calling out in their strange tongues, baleful cries. Old men and women gathered upon the library steps and huddled at its high windows as flakes of snow fell enormous and faintly grey with the ash of fires half a world away.\nAnd there, further along, the great old temples of the last true religion in that world, the fanatic cult-houses of the worshippers of the magical curve, the endless blessed marketeers and insatiable blood-hungry pirates of water and light and time. There, these rectangular temples of lost merchandises stood with windows smashed, empty from lootings, empty except for the poor useless souls who took refuge in their icy halls remaining since the cult had loosed its foul and terrible powers upon the world, and toppled everything that humankind had once built up.\nThence flew Melei, deeper into the city, over crumbled steel bridges and the steeples of abandoned, burnt-down churches. She heard singing, not of human voices, not of ghosts—for this world, haunted though its inhabitants’ faces were, was a place bereft of stalking ghŭls and spirits hungrily wandering. No, not like the frightening lands that lay distant from Ulthar; nothing like the shadowy passes near high Old Kadath or the caverns of B’thaniss. Only the wretched faces of the living gazed out through the smashed-glass windows. The voice she heard was none other than her own, crying out her exultant terror.\nAn open square between the broken buildings spread out below her, and she wondered whether this had been a park, or the base of some enormous destroyed temple, or perhaps that square where, in ancient frigid nights, the folk of the city had gathered to witness the death-knell of the ending year and cry out jubilant with the beginning of the new. No hint suggested which guess might be correct.\nShe thought again of living here, in this strange world of cold consequences, as often she had before. Shivering—not from cold, for her dreaming self was swaddled in thick, warm wool, and something of the power of her dream-voyaging shielded her from the worst of the awful, ruined clime—but rather from a titillation derived less from horror at the ruined city, or that such ruination was possible, than out of the purer terror that shook her upon witnessing the magnificent finality of the fact of the ruination itself.\nBroken buildings slumbered all around her as she flew past, and she marveled that this world was thus; a place where ruinations could be visited upon mighty civilizations in a generation, yet where the people here would endure on, shivering and hungry, fighting to continue. Whisperings of the fate of Sarnath bubbled up from the silence of her forgotten childhood, but there peered no specters from the windows of this city, at least none that had died. Only the pale and sallow faces of the hungry stared out at her, living scavengers looking out, lit by fires and shame.\nTerror. The terror of finding oneself before a mountain to be scaled, a mountain the height of a dozen nations piled upon one another, end to end, boasting whole civilizations and waste lands between them, upon a slope rising unceasingly upward into the sky. The terror of looking upon the ocean stirred into a raging turmoil of violence. Terror at confronting the great secret of this world: that all things had endings, all things could be destroyed just as they had once, long ago, been built up. That terror swept through Melei, thrilled her.\nThat was when her name in this world, that other name, pierced up into her tongue, begging again to be spoken and seal itself upon her.\nShe bit her tongue, bit down into it so hard that it ached and bled a little. To say the name . . . to consign herself among the living shades . . . such a temptation . . .\nThe name fought relentlessly. It would be said, she realized, someday. She would come to live here, in this drowned city of humbling, awful beauty. It would be her home, someday, taking her into its brutal black arms like a lover would do, grinding its iciness against her shivering flesh.\nStill she fought, clenching her teeth and grinding them together so violently that she felt they might break off in her mouth. She pushed herself upward, into the sky, letting go of the city even as she stared into the watery canal gridwork of its forgotten, worthless streets. She let herself ascend, into the foul clouds that were heavy with strange poisons, up into the cold nebulousness that lay beyond them, falling away from this awful and lovely world that was her constant obsession, this place of strange meanings and consequences and cruel finalities.\nThe city and all of its broken, awful grandeur blurred into a mere patch of indistinct darkness dotted with scattered open fires, blending into the surrounding darkness and becoming nothingness as she fell upward, outward; away from the world once again.\nMelei’s eyes opened slowly as the sunrise just finished and serene Ulthar gradually stirred from its long nocturnal slumber. She slid her prodigious bedding aside, and took up her scribbling-notebook in one hand, searching for the words that would draw the magnificently drab colors across from that other world into hers.\nA troupe of cats passed by her window, miaowing gleefully at one another, and she rose to peer out at them, as if to divine some portent from the colors of their coats; but they were a motley pack, impossible to read even for a girl as bright as Melei.\nWaking, dreaming. She felt as if a woman torn between two lovers—one of them calm, and sweet, and still and good, and the other magnificent, stone-muscled and taciturn and bold enough to seize her and pull her close to him in the darkness of night.\nShe set the notebook down, ruminating. There was a choice coming. She would have to choose a name. Said she, in that world, “Melei,” then her dark lover would listen, and hear, and understand what her heart said. The delicious torture would end, and he would send her home . . . never to return. Yet said she that other name, that strange name that even now squirmed beneath her tongue, prickling her mouth and fighting to be pronounced in the sunny morning calm of Ulthar, then her dark lover would seize her, all at once, and carry her off into the delightful terror of the world of her dreams, leaving the streets of Ulthar forever empty of her.\nShe could feel the city’s ache, at the very thought of her leaving. The city’s ache, or perhaps it was her own.\nNo harm could come of writing the name, she decided. She had written it upon her own palm, in different scripts, one by one, and not a thing had happened save that she had dreamt of the other world sooner, and more fiercely, each time. She could write it upon a page, she was sure. It was not the same as saying it. She could still decide. Melei, or . . .\nShe took a quill, unlidded a jar of sepia ink, and touched the quill’s tip into the inky darkness. Without speaking—with her jaw locked firmly, to guard against accidental pronouncement—she touched the tip of the quill against the gently yellowed page. The dawn sunlight cast a shadow from the feather quill, throwing a line of gentle shading across the page and into her lap. She shut her eyes, and opened them, and shut them again, and once more opened them, so as to let the shadow find a place in her heart’s memory.\nShe realized, then, she was building up a storehouse of memories already. The faces of the swarthy guards. The troupes of cats mewing happily all around her. She had stopped hating Ulthar, wincing at the summery stink of the cat turds and grumbling at the foreign power that ruled the place. She had found the kind of love that wells up one when she abandons her lover for another, her world for another’s; that sort of love that is rooted in impossibility that cannot be prevented even by sorrow, even by fear, even by the movement of the shadow across a page as the sun slips up into the sky.\nShe did not write the name, but instead rose, scribbling-book still in hand, and went back to her window. The sweetest cottages of Ulthar lay just there, empty of terror but touching in their way, stirring memories of the games she had played in these dusty streets during what felt like another life. Laughter and the voices of children who had somehow become half-forgotten friends, folk whose faces that she had seen not once in ages and ages.\nAnd Melei knew, then, that she would say the name. Perhaps not that night. Not so soon as that, she told herself. But she would say it, and go, and old Ulthar would continue on without her, as it had done before her birth, with its cats and gentle sunny days and whispering old women and men.\nShe filled a basin with warm water, and carried it to a high table in her room, her feet padding upon the wooden planks of the floor. Outside, a bird sang a snatch of birdsong she had heard dozens of times before, though she could not name what type of bird it was. She splashed the water on her face, delighting in its gentle warmth, steeling herself.\nFor there would be precious little warmth like this in the other world, in the arms of her dark dream lover.\nAnd then she donned a bright and comfortable silk, light in shade to suit the warm day, and crossed the threshold of her home, going out into a street that smelled of blooming cherry flowers and apple orchards that had been planted by the Southerners. There, in the street, a trio of cats gazed up at her, curiously eyeing her approach with heads tilted one way or another. They seemed, like all cats in Ulthar, almost as if they wished to ask her something, or to dispense some holy secret to her, but if indeed this was so, they said nothing, their own jaws as firmly locked as hers had been minutes before.\nAn old man made his way down the street, comfortable and calm though his back was a little bent. He smiled at her, and a cock crowed in the distance, and Melei closed her eyes. And opened them again.\nAnd closed them.\nAnd opened them again, committing every breath of it, every shade and tiny noise and scent, to the strongest urn in the storehouse of her memory. The voices of children long gone echoed, now, within that storehouse, and the image of her mother baking sour bread, and the laughter of cats—for in Ulthar, by nights, cats do laugh, though only the most blessed ever hear it more than once—and the sunrises, the sunrises that had saddened her so often.\nPerplexed, she went through the streets, dazed, eyes and heart drinking Ulthar in deeply and constantly until she was drunk with the place. It was her farewell kiss to the world of her birth, a kiss of the eyes upon the forehead. It was her last embrace of the little city, day-long as she wandered and rambled from shop to temple to the current doorsteps of present friends and the abandoned doorways of friends long-lost. She met those she had once loved, and said nothing of leave-taking, though she wondered if they could see it in her eyes. Yet she asked not a soul as she spoke to them of nothings, of needle work and gossip and of the latest news from other cities and lands. As she walked those quiet, calm streets, her footsteps tapping gently the beat of her last ballad to Ulthar, she realized she loved this city, loved it unceasingly and would do so evermore though she would not live here any longer.\nFor as the sun began slowly to draw itself down unto the horizon, and the shadows lengthened across the streets as another shadow had done upon her page that morning, the name beneath Melei’s tongue stirred once more, this final time irresistibly . . .\nGord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies.", "source": "https://clarkesworldmagazine.com/sellar_10_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Of Melei, of Ulthar by Gord Sellar"}