{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lavie Tidhar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Z6z28AmCAtTeYDZ1WS71oo2uB9s=", "id": null, "license": null, "comments": "", "raw_text": "3700 words, short story  304 Adolph Hitler Strasse  When they came for Hershele Ostropol it was not at night but in the middle of the afternoon, and they came quiet and with no warning, with just a polite knock on the door. He had taken it to be the postman, carrying a late delivery of one of his special magazines; but the two who stood in the doorway wore no uniforms, and only their eyes betrayed who, and what, they were.  They called him by his real name, which was Hanzi, but they knew who he really was and he knew then that it was over; the knowledge washed him in lethargy, and a sense of futility made him open his hands as if in a shrug, his fat fingers opening limply, sweat dampening his palms.  They had interrupted him writing, it was another one of his stories. The computer was left switched on in his small study (Granddad’s old room), and his special books and magazines lay in plain view on the desk.  He knew then that it was over; and he went with them without a fight and let them steer him into the dark Mercedes that waited for him, as he knew it would, outside.  How it began, how Hanzi Himmler first came to assume the identity of Hershele Ostropol, he could hardly articulate. But it can be pinpointed to two events that both happened close together: he was given the new computer, and he caught his grandfather with a prostitute.  The computer was a Bulgarian Pravetz. Along with the modem the computer came with a small communications program and a list of telephone numbers for several Bulletin Board Systems in and around Berlin. The first time Hanzi connected to a BBS was late on the night of his birthday, when his parents were sleeping and he had the telephone line to himself. He dialed the first number on the list, and found himself confronted with a colorful welcome screen.  On the BBS, Hanzi discovered that night, he could download small programs, and text files and even code, and he could post messages on the BBS which other people could then read. He chose his first identity that night, his first login name. He wanted Nighthawk, but ended up being Nighthawk1 as the first name was already taken.  Hanzi didn’t care. He read the public posts, and he downloaded a text file that contained a hundred and eleven dirty jokes and, more importantly, he also downloaded a file containing the telephone numbers of many other BBSs.  For him, it was a discovery. He felt like Ernst Schafer must have felt on his expedition to Tibet to prove the origin of the Aryan race, as if he too were an explorer in a new and mysterious land. He had found a door to a new world, and everything was suddenly possible.  Everything . . . Granddad, Hauptabschnittsleiter Himmler, lived with his son and daughter-in-law in the solitary room on the ground floor by the garden. He was once a distinguished Head Section Leader, but had retired many years back and now spent most of his time in his room, unseen by his family. He was not a well man, and Hanzi knew Herr and Frau Himmler worried about him.  Hanzi returned home early one day from school, with a sore throat and a headache that buzzed little flies on the inside of his skull. His parents were away, and Granddad should have been asleep in his room. But he wasn’t.  As Hanzi came through the door he heard strange sounds coming from his grandfather’s room towards the back. He listened carefully, the words and the sounds making him feel strange, though he couldn’t then define what it was he felt, exactly. It took him a while to realize they were the sounds of sex.  He edged his way down the corridor. His head still hurt and an uncomfortable erection was building in the pants of his khaki uniform. The door to Granddad’s room was ajar, and light spilled out from it onto the darkened corridor. The voices were louder, and more persistent. Granddad, and a woman. She was shouting something, and as he came closer he could hear the words, so clear that they cut through his mind like sharp crystal, and remained there forever. They had the tang of well-rehearsed, stock lines, though he only understood that later.  “You disgust me! You sick, perverted old man! You’re nothing but a dirty Jew!”  Through the open door Hanzi saw Hauptabschnittsleiter Himmler crouching naked on the bed, his thin, wrinkled buttocks raised in the air. Above him stood a middle-aged woman dressed in the old uniforms of an S.S. officer, holding a riding crop in her hand. As she spoke she hit the old man hard against his rear, making him scream.  “What are you? I said, what are you, animal?”  “I’m a Jew!” the old man cried. “I’m a dirty Jew!”  “And what do we do to dirty, disgusting Jews?” the woman asked. Hanzi caught sight of her sagging white breasts below the open leather coat. She had bright red nipples that looked squished over the pale twin mounds of her chest. It made him feel both scared and excited.  “Punish them!” the old man said. He was breathing rapidly, and his voice was muffled now, his speech unclear. Hanzi saw his grandfather’s face turn against the white fluffy pillow it was resting on. The old man looked back at the aged S.S. officer. A little drool rested at the left corner of his mouth. “Punish me, mistress . . . ” he said. “Spank me. Hurt me!”  The woman, whose face had so far remained calm, almost bored while the old man’s face was turned away, had now assumed a new expression: she smiled slowly, licking her red lips as she exposed yellowing teeth. “You should have gone to the gas chambers,” she said. “You disgust me.” The riding crop went up, came down again with a sharp whack.  “Yes,” the old man said. “Yes. Yes!”  Something sticky and warm spread in Hanzi’s undergarments, and he shuddered and bit his fist until it hurt.  He stood there for a long moment, mortified. Inside the room the noise slowly abated. He looked inside—and saw that the woman was looking directly at him now—and she was smiling.  She reached her hand out—he always remembered the long pale fingers, the bright red varnish on the nails—and gently shut the door.  “That’d be fifty Reichsmarks again, Herr Himler,” he heard her say through the closed door.  “Thank you, Helga, yes,” Hanzi heard his grandfather say. His voice had regained its old authority; he sounded nothing like the pathetic creature that begged to be spanked. “I shall expect you again the same time next week.” Hanzi retreated at the sounds of movement from inside. A moment later he could hear the door open, and the clicking of heels against the floor.  “Make sure . . . ” he heard the old man say, and the woman laughed, and said, “I know, I know, I’ll go through the back door.”  Hanzi waited in the kitchen, afraid to move, afraid to make a sound, until he heard the back door open and close. His grandfather had not come out of his room.  Finally, he went up to his room, and switched on the computer.  At the library Hanzi found pictures of Jews in a large, leather-bound book on one of the top shelves. They were of grotesque-looking creatures, alien and frightening. He stared at them, repulsed, fascinated—he couldn’t have described the feelings he felt. Not then. He also stared down the librarian’s top, trying to see her breasts when he thought she wouldn’t notice him.  On another visit, the librarian showed him an old documentary film, Fritz Hippler’s The Eternal Jew, and its images of hordes upon hordes of rats drowning in sewers filled Hanzi with frightened fascination.  “There is not much information.” The librarian sighed, and she removed her glasses and wiped them with the hem of her sweater. “It’s better that way.”  “Yes, Miss,” Hanzi said. Yet something drew him to find out more, a dark fascination that grew inside him like an obsidian rose and made him spend himself alone in bed at night. Sometimes he thought of the pictures, and sometimes of the librarian, removing her glasses and lifting up her sweater, revealing soft pale skin underneath.  That day, after watching the film, he logged in to several of the local BBSs and posted a brief message on each, asking about those strange, forgotten beings, the Jews.  Nothing happened the first day, or the one after. In fact, a full week passed before he had a reply.  A private message. It contained a telephone number, and a login name and a password.  He sat in his room. His parents were asleep. He dialed the number, and connected to the the Judenhacker BBS.  The judenhackers called it Slash. It stood for the “/” sign in Jewish/Nazi stories. They gathered to re-imagine the relationship with that vanished, mysterious race, writing stories with titles such as “the Stalag of Death”, telling stories of concentration camps, of stalags, where sadistic Aryan female guards were captured by their former slaves the Jews, recreating powerful sexual fantasies from third-hand memories of a time that was gone and would not come again.  All quiet, Hanzi thought. The house was secure. He was alone.  On his head he wore a homemade yarmulke, and pinned to his cheeks were long pretend side curls, and as he masturbated he nodded his head to a prayer he didn’t know.  I’m seventeen , he thought as he covered himself up, a vague lack of satisfaction irritating at him. The stories were no longer enough. I should . . .  He chose a pen name for himself that night, a handle: Hershele Ostropol, after a forgotten Jewish legend of a storyteller. Already, he knew what he wanted to do, what his purpose was, and that night he sat in front of the keyboard and wrote his first story, and published it in the morning.  It was called The Last Jew and the Virgins of the Rhein.  The Last Jew and the Virgins of the Rhein, Part I By Hershele Ostropol The Jewish youth lies in wait for hours on end . . . spying on the unsuspicious German girl he plans to seduce . . . He wants to contaminate her blood and remove her from the bosom of her own people.—Adolf Hitler, Mein Kampf  He drove carefully over the blasted roads and into Paris, avoiding with ease the few checkpoints the army had thrown up half-heartedly outside the city. The war had ended, after all. They had won. There were no more Jews.  He parked the Volkswagen in the darkened Latin Quarter, on the left side of the Seine from Notre Dame. He stepped out of the car into the cool air, inhaling the scent of sewage and roasting chestnuts on the breeze. For a moment he remembered a time before the war, when he visited Paris with Miriam and the baby . . . He forced the memory away and began marching into the maze of alleyways and shuttered shops that was the Quartier Latin.  There. It was an ancient stone building, its windows carefully blank. He stood in the shadows and watched.  There was a sentry on duty outside the heavy oak door. A solitary working streetlamp cast a hazy glow over the entrance, and he watched, carefully observing, as the striking young girl stood up and stamped her feet on the ground. She was blonde, a pure-blooded Aryan. Her golden hair was cut short at the shoulders, spilling over pale, delicate cheekbones. She wore a tailored black coat that opened momentarily when she moved, revealing dark leather, the flash of a white thigh. He looked closer, observing, memorizing: long silk stockings stretched over those long, beautiful legs—and a black sleek handgun was strapped to one thigh.  Virgins of the Rhein. He felt a shiver of apprehension run down his back. He had to remind himself the girl was a cold-blooded assassin; attractive—and deadly.  The door opened, spilling more light onto the pavement, and he heard the momentary sound of laughter and piano music from inside. A second girl was framed in the doorway, and his eyes traveled over her long, muscular body that was clad only in a body-hugging black dress, extenuating her firm, large breasts and flat stomach.  The girl marched down the steps and stood facing the guard. She snapped a sharp salute that was followed by the other guard.  “All quiet, Helga?”  “All quiet Ma’am!”  The tall blonde nodded. Her lips were bright red, and when she smiled they revealed between them rows of white teeth. “Go back inside, Helga. I’ll take over for a while. You’re needed in the basement to help with the prisoners.”  “Ma’am!” The guard, Helga, snapped another salute, and smiled at her superior. Her tongue ran over her lips slowly, as if she was already contemplating her job inside the thick walls of the building. The two women stood close to each other, their faces almost touching. “Go,” the tall blonde murmured. “The prisoners . . . need you. Leave them alive.”  “For a while longer,” Helga whispered. The two women’s lips touched lightly, almost hungry.  “Go,” the leggy blonde said. She laid long, delicate fingers on Helga’s shoulders and stripped her slowly of her long coat. The hidden watcher felt himself getting aroused almost against his will as Helga’s perfect form was revealed. The tall blonde covered herself with the coat. “Go,” she said again, and this time it was a command.  Helga obeyed. She walked up the steps and disappeared inside the mansion, closing the door behind her. The hidden watcher looked at the woman that remained.  It was time to act.  He stepped out of the shadows and walked briskly towards the blonde woman . . .  TO BE CONTINUED.  Hershele sat in the basement of the Technische Universität Berlin , the converted computer lab. He was working, but it wasn’t on homework, though he had to hand in an assignment in the morning. The assignment was about a new kind of viral electronic mail that the papers were calling Goebbels Mail, a kind of mass advertising of products. Hanzi didn’t care. He was writing.  The lab was empty, warm. Outside the snow fell, and through the window he could dimly see his beat-up Volkswagen being covered in white. It was silent, comforting, safe.  He stood and looked around, but could see no one. He slipped the yarmulke from his pocket and put it on his head. He sat in front of the keyboard and felt a tingle in his fingers, and down below.  His story had been well accepted, he thought, and it made him smile. It was the feedback that almost drove him now, more than the other kind of gratification.  There was a lively debate about his story on the BBS, ranging from the congratulatory “keep going, it’s really good,” to the nitpickers (it was an old English word. It came from slavery, when there were still African people to enslave) who argued over the minute details of the story, on whether the clothes were right for the period, to Hershele’s choice of car for his character. But there was interest, and several more discreet messages who assured him his story was affecting them in the same way slash stories have always affected him. “Too softcore,” was another comment, and so, now, Hershele allowed himself greater liberty as he began to write the shorter, second part of what he was already planning would become an on-going series.  Tucked away in the basement, Hershele forgot his audience and wrote only for himself, a metal Star-of-David pressing painfully into his palm as excitement made him close his fingers in an involuntary fist.  The Last Jew and the Virgins of the Rhein, Part II By Hershele Ostropol “Stop!” the blonde woman said, pointing the carbine in his chest. Her cat eyes examined him leisurely, almost hungrily.  The Last Jew raised his hands calmly to shoulder height. In his left hand he was clutching a brown wallet: the paperwork inside it had cost him a small fortune several months ago from an old forger in Nice.  “Standartenfuehrer Walther Viter, S.S.,” he said.  His eyes followed the blonde’s heaving chest, followed exposed contours of her breasts up to her face, to the eyes widening in surprise, to the red tongue moistening her full lips. Surprise? Anticipation? A touch of fear?  He lowered his hands and watched the blonde raise the carbine. “Colonel, I did not know . . . ”  He saw the subversive light in her eyes and didn’t hesitate. There was only one way to act from the start and he didn’t hesitate, he reached out and grabbed the blonde, pulling her closer to him, his hands resting on her breasts, his erection pressed again her soft back side. “Do not underestimate me, Fraulein,” he said softly as she squirmed against his body, “I am here to inspect, and to judge. The hand of the S.S.—” and here he shoved his hand between the blonde’s legs, feeling her hidden mound grow moist against his finger—“reaches a long, long way.”  He released her and watched her sway. “Lead on,” he said, and motioned for her to proceed him up the stairs to the mansion. Almost as an afterthought he picked up the carbine and pointed it between the blonde’s eyes. “Don’t make me repeat myself,” he said. He watched in silence as she wriggled up the stairs, her smooth ass moving sensuously against the leather.  He followed her into the headquarters of the Virgins of the Rhein, and closed the door softly against the darkness outside.  TO BE CONTINUED.  “Yes, of course I was pleased with the Last Jew’s fake German identity—the colonel’s name I made from adding together the names of Fredrick Viter and Walther Rauff, both rather obscure historical figures. The contents were harder, the sense of something major happening almost—or so I like to think—palpable,” Hanzi said. He was sitting in a coffee shop on Göring Strasse with his friend.  His friend was also a colleague. They worked for Deutsche Bank together. His name was Hermann.  “I also enjoyed your Nazi Biker Sluts—Why Won’t You Come Out Tonight? ” Hermann now said. “Quite risqué, I thought.”  “I hope so,” Hanzi said. They were quite alone. No one was listening.  “And I thought Nazi Super Sex Toys Last All Summer Long was almost poetic,” Hermann said. He was something of a fan, and he began to look shiny with perspiration. “Too bad the Last Jew had to come to an end.”  “I couldn’t keep it up,” Hanzi said. The last installment of The Last Jew and the Virgins of the Rhein was published just as he got the job. His parents had died soon after, in a train crash when they went to visit relatives in Vienna, and Hanzi stayed to live alone in the family home.  “I also liked your monograph on The Fetishizing and Eroticizing of the Jew,” Hermann said. “Thought provoking.” He coughed and looked at his feet. “So what are you working on now?”  Hanzi smiled. It was a strange, almost ethereal smile. “I’ll show you,” he said. “Meet me next week, at the house.”  They drank the rest of their coffee in silence and admired the girls who passed them by.  The house was at number 304, Adolf Hitler Strasse. It was a comfortable white-fenced house in a quiet suburb of Berlin, with neatly-trimmed lawn at the front. But when Hermann arrived there, Hanzi was gone.  His last story was found on his desk, uncompleted. Hermann found the house undisturbed, the door open, Hanzi’s ancient Pravetz still turned on, the word-processing program still running, the story uncompleted on the screen. Hanzi’s special books and magazines lay in plain sight over the desk: it was as if Hanzi, perhaps getting up to answer a knock on the door, had then simply disappeared.  The story was called Hershele Ostropol in the Stalag of Death, and it began like so:  Hershele Ostropol in the Stalag of Death  When they came for him it was not at night but in the middle of the afternoon, and the two women came quiet and with no warning, with just a polite knock on the door. He had taken it to be the postman, carrying a late delivery of one of his special magazines; but the two who stood in the doorway wore no uniforms, and only their eyes betrayed who, and what, they were.  Hanzi knew then that it was over; the knowledge washed him in lethargy, and a sense of futility made him open his hands as if in a shrug, his slim fingers opening limply, sweat dampening his palms.  They had interrupted him writing, it was another one of his stories. The computer was left switched on in his small study, and his special books and magazines lay in plain view on the desk.  He knew then that it was over; and he went with them without a fight and let them steer him into the dark Mercedes that waited for him, as he knew it would, outside.  The two female S.S. colonels sat opposite him in the car, leather skirts riding up their pale thighs. Their lips were colorless, without lipstick, and their blonde hair gathered like dew on their shoulders.  “What will you do with me?” he whispered, unconsciously licking his lips. The woman on his left had brought out a horse whip and was stroking it, almost tenderly.  “What will we do with you?” she asked. A gold swastika plunged from her neck into her bosom, hung on a thin necklace. She looked out of the window. “We will teach you what it really means,” she said, “to be treated like a Jew.”  The car purred as it went into motion; and soon it was gone from Adolf Hitler Strasse, heading towards . . .  TO BE CONTINUED.  THE END. Lavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize.", "text": "3700 words, short story\n304 Adolph Hitler Strasse\nWhen they came for Hershele Ostropol it was not at night but in the middle of the afternoon, and they came quiet and with no warning, with just a polite knock on the door. He had taken it to be the postman, carrying a late delivery of one of his special magazines; but the two who stood in the doorway wore no uniforms, and only their eyes betrayed who, and what, they were.\nThey called him by his real name, which was Hanzi, but they knew who he really was and he knew then that it was over; the knowledge washed him in lethargy, and a sense of futility made him open his hands as if in a shrug, his fat fingers opening limply, sweat dampening his palms.\nThey had interrupted him writing, it was another one of his stories. The computer was left switched on in his small study (Granddad’s old room), and his special books and magazines lay in plain view on the desk.\nHe knew then that it was over; and he went with them without a fight and let them steer him into the dark Mercedes that waited for him, as he knew it would, outside.\nHow it began, how Hanzi Himmler first came to assume the identity of Hershele Ostropol, he could hardly articulate. But it can be pinpointed to two events that both happened close together: he was given the new computer, and he caught his grandfather with a prostitute.\nThe computer was a Bulgarian Pravetz. Along with the modem the computer came with a small communications program and a list of telephone numbers for several Bulletin Board Systems in and around Berlin. The first time Hanzi connected to a BBS was late on the night of his birthday, when his parents were sleeping and he had the telephone line to himself. He dialed the first number on the list, and found himself confronted with a colorful welcome screen.\nOn the BBS, Hanzi discovered that night, he could download small programs, and text files and even code, and he could post messages on the BBS which other people could then read. He chose his first identity that night, his first login name. He wanted Nighthawk, but ended up being Nighthawk1 as the first name was already taken.\nHanzi didn’t care. He read the public posts, and he downloaded a text file that contained a hundred and eleven dirty jokes and, more importantly, he also downloaded a file containing the telephone numbers of many other BBSs.\nFor him, it was a discovery. He felt like Ernst Schafer must have felt on his expedition to Tibet to prove the origin of the Aryan race, as if he too were an explorer in a new and mysterious land. He had found a door to a new world, and everything was suddenly possible.\nEverything . . . Granddad, Hauptabschnittsleiter Himmler, lived with his son and daughter-in-law in the solitary room on the ground floor by the garden. He was once a distinguished Head Section Leader, but had retired many years back and now spent most of his time in his room, unseen by his family. He was not a well man, and Hanzi knew Herr and Frau Himmler worried about him.\nHanzi returned home early one day from school, with a sore throat and a headache that buzzed little flies on the inside of his skull. His parents were away, and Granddad should have been asleep in his room. But he wasn’t.\nAs Hanzi came through the door he heard strange sounds coming from his grandfather’s room towards the back. He listened carefully, the words and the sounds making him feel strange, though he couldn’t then define what it was he felt, exactly. It took him a while to realize they were the sounds of sex.\nHe edged his way down the corridor. His head still hurt and an uncomfortable erection was building in the pants of his khaki uniform. The door to Granddad’s room was ajar, and light spilled out from it onto the darkened corridor. The voices were louder, and more persistent. Granddad, and a woman. She was shouting something, and as he came closer he could hear the words, so clear that they cut through his mind like sharp crystal, and remained there forever. They had the tang of well-rehearsed, stock lines, though he only understood that later.\n“You disgust me! You sick, perverted old man! You’re nothing but a dirty Jew!”\nThrough the open door Hanzi saw Hauptabschnittsleiter Himmler crouching naked on the bed, his thin, wrinkled buttocks raised in the air. Above him stood a middle-aged woman dressed in the old uniforms of an S.S. officer, holding a riding crop in her hand. As she spoke she hit the old man hard against his rear, making him scream.\n“What are you? I said, what are you, animal?”\n“I’m a Jew!” the old man cried. “I’m a dirty Jew!”\n“And what do we do to dirty, disgusting Jews?” the woman asked. Hanzi caught sight of her sagging white breasts below the open leather coat. She had bright red nipples that looked squished over the pale twin mounds of her chest. It made him feel both scared and excited.\n“Punish them!” the old man said. He was breathing rapidly, and his voice was muffled now, his speech unclear. Hanzi saw his grandfather’s face turn against the white fluffy pillow it was resting on. The old man looked back at the aged S.S. officer. A little drool rested at the left corner of his mouth. “Punish me, mistress . . . ” he said. “Spank me. Hurt me!”\nThe woman, whose face had so far remained calm, almost bored while the old man’s face was turned away, had now assumed a new expression: she smiled slowly, licking her red lips as she exposed yellowing teeth. “You should have gone to the gas chambers,” she said. “You disgust me.” The riding crop went up, came down again with a sharp whack.\n“Yes,” the old man said. “Yes. Yes!”\nSomething sticky and warm spread in Hanzi’s undergarments, and he shuddered and bit his fist until it hurt.\nHe stood there for a long moment, mortified. Inside the room the noise slowly abated. He looked inside—and saw that the woman was looking directly at him now—and she was smiling.\nShe reached her hand out—he always remembered the long pale fingers, the bright red varnish on the nails—and gently shut the door.\n“That’d be fifty Reichsmarks again, Herr Himler,” he heard her say through the closed door.\n“Thank you, Helga, yes,” Hanzi heard his grandfather say. His voice had regained its old authority; he sounded nothing like the pathetic creature that begged to be spanked. “I shall expect you again the same time next week.” Hanzi retreated at the sounds of movement from inside. A moment later he could hear the door open, and the clicking of heels against the floor.\n“Make sure . . . ” he heard the old man say, and the woman laughed, and said, “I know, I know, I’ll go through the back door.”\nHanzi waited in the kitchen, afraid to move, afraid to make a sound, until he heard the back door open and close. His grandfather had not come out of his room.\nFinally, he went up to his room, and switched on the computer.\nAt the library Hanzi found pictures of Jews in a large, leather-bound book on one of the top shelves. They were of grotesque-looking creatures, alien and frightening. He stared at them, repulsed, fascinated—he couldn’t have described the feelings he felt. Not then. He also stared down the librarian’s top, trying to see her breasts when he thought she wouldn’t notice him.\nOn another visit, the librarian showed him an old documentary film, Fritz Hippler’s The Eternal Jew, and its images of hordes upon hordes of rats drowning in sewers filled Hanzi with frightened fascination.\n“There is not much information.” The librarian sighed, and she removed her glasses and wiped them with the hem of her sweater. “It’s better that way.”\n“Yes, Miss,” Hanzi said. Yet something drew him to find out more, a dark fascination that grew inside him like an obsidian rose and made him spend himself alone in bed at night. Sometimes he thought of the pictures, and sometimes of the librarian, removing her glasses and lifting up her sweater, revealing soft pale skin underneath.\nThat day, after watching the film, he logged in to several of the local BBSs and posted a brief message on each, asking about those strange, forgotten beings, the Jews.\nNothing happened the first day, or the one after. In fact, a full week passed before he had a reply.\nA private message. It contained a telephone number, and a login name and a password.\nHe sat in his room. His parents were asleep. He dialed the number, and connected to the the Judenhacker BBS.\nThe judenhackers called it Slash. It stood for the “/” sign in Jewish/Nazi stories. They gathered to re-imagine the relationship with that vanished, mysterious race, writing stories with titles such as “the Stalag of Death”, telling stories of concentration camps, of stalags, where sadistic Aryan female guards were captured by their former slaves the Jews, recreating powerful sexual fantasies from third-hand memories of a time that was gone and would not come again.\nAll quiet, Hanzi thought. The house was secure. He was alone.\nOn his head he wore a homemade yarmulke, and pinned to his cheeks were long pretend side curls, and as he masturbated he nodded his head to a prayer he didn’t know.\nI’m seventeen , he thought as he covered himself up, a vague lack of satisfaction irritating at him. The stories were no longer enough. I should . . .\nHe chose a pen name for himself that night, a handle: Hershele Ostropol, after a forgotten Jewish legend of a storyteller. Already, he knew what he wanted to do, what his purpose was, and that night he sat in front of the keyboard and wrote his first story, and published it in the morning.\nIt was called The Last Jew and the Virgins of the Rhein.\nThe Last Jew and the Virgins of the Rhein, Part I\nBy Hershele Ostropol\nThe Jewish youth lies in wait for hours on end . . . spying on the unsuspicious German girl he plans to seduce . . . He wants to contaminate her blood and remove her from the bosom of her own people.—Adolf Hitler, Mein Kampf\nHe drove carefully over the blasted roads and into Paris, avoiding with ease the few checkpoints the army had thrown up half-heartedly outside the city. The war had ended, after all. They had won. There were no more Jews.\nHe parked the Volkswagen in the darkened Latin Quarter, on the left side of the Seine from Notre Dame. He stepped out of the car into the cool air, inhaling the scent of sewage and roasting chestnuts on the breeze. For a moment he remembered a time before the war, when he visited Paris with Miriam and the baby . . . He forced the memory away and began marching into the maze of alleyways and shuttered shops that was the Quartier Latin.\nThere. It was an ancient stone building, its windows carefully blank. He stood in the shadows and watched.\nThere was a sentry on duty outside the heavy oak door. A solitary working streetlamp cast a hazy glow over the entrance, and he watched, carefully observing, as the striking young girl stood up and stamped her feet on the ground. She was blonde, a pure-blooded Aryan. Her golden hair was cut short at the shoulders, spilling over pale, delicate cheekbones. She wore a tailored black coat that opened momentarily when she moved, revealing dark leather, the flash of a white thigh. He looked closer, observing, memorizing: long silk stockings stretched over those long, beautiful legs—and a black sleek handgun was strapped to one thigh.\nVirgins of the Rhein. He felt a shiver of apprehension run down his back. He had to remind himself the girl was a cold-blooded assassin; attractive—and deadly.\nThe door opened, spilling more light onto the pavement, and he heard the momentary sound of laughter and piano music from inside. A second girl was framed in the doorway, and his eyes traveled over her long, muscular body that was clad only in a body-hugging black dress, extenuating her firm, large breasts and flat stomach.\nThe girl marched down the steps and stood facing the guard. She snapped a sharp salute that was followed by the other guard.\n“All quiet, Helga?”\n“All quiet Ma’am!”\nThe tall blonde nodded. Her lips were bright red, and when she smiled they revealed between them rows of white teeth. “Go back inside, Helga. I’ll take over for a while. You’re needed in the basement to help with the prisoners.”\n“Ma’am!” The guard, Helga, snapped another salute, and smiled at her superior. Her tongue ran over her lips slowly, as if she was already contemplating her job inside the thick walls of the building. The two women stood close to each other, their faces almost touching. “Go,” the tall blonde murmured. “The prisoners . . . need you. Leave them alive.”\n“For a while longer,” Helga whispered. The two women’s lips touched lightly, almost hungry.\n“Go,” the leggy blonde said. She laid long, delicate fingers on Helga’s shoulders and stripped her slowly of her long coat. The hidden watcher felt himself getting aroused almost against his will as Helga’s perfect form was revealed. The tall blonde covered herself with the coat. “Go,” she said again, and this time it was a command.\nHelga obeyed. She walked up the steps and disappeared inside the mansion, closing the door behind her. The hidden watcher looked at the woman that remained.\nIt was time to act.\nHe stepped out of the shadows and walked briskly towards the blonde woman . . .\nTO BE CONTINUED.\nHershele sat in the basement of the Technische Universität Berlin , the converted computer lab. He was working, but it wasn’t on homework, though he had to hand in an assignment in the morning. The assignment was about a new kind of viral electronic mail that the papers were calling Goebbels Mail, a kind of mass advertising of products. Hanzi didn’t care. He was writing.\nThe lab was empty, warm. Outside the snow fell, and through the window he could dimly see his beat-up Volkswagen being covered in white. It was silent, comforting, safe.\nHe stood and looked around, but could see no one. He slipped the yarmulke from his pocket and put it on his head. He sat in front of the keyboard and felt a tingle in his fingers, and down below.\nHis story had been well accepted, he thought, and it made him smile. It was the feedback that almost drove him now, more than the other kind of gratification.\nThere was a lively debate about his story on the BBS, ranging from the congratulatory “keep going, it’s really good,” to the nitpickers (it was an old English word. It came from slavery, when there were still African people to enslave) who argued over the minute details of the story, on whether the clothes were right for the period, to Hershele’s choice of car for his character. But there was interest, and several more discreet messages who assured him his story was affecting them in the same way slash stories have always affected him. “Too softcore,” was another comment, and so, now, Hershele allowed himself greater liberty as he began to write the shorter, second part of what he was already planning would become an on-going series.\nTucked away in the basement, Hershele forgot his audience and wrote only for himself, a metal Star-of-David pressing painfully into his palm as excitement made him close his fingers in an involuntary fist.\nThe Last Jew and the Virgins of the Rhein, Part II\nBy Hershele Ostropol\n“Stop!” the blonde woman said, pointing the carbine in his chest. Her cat eyes examined him leisurely, almost hungrily.\nThe Last Jew raised his hands calmly to shoulder height. In his left hand he was clutching a brown wallet: the paperwork inside it had cost him a small fortune several months ago from an old forger in Nice.\n“Standartenfuehrer Walther Viter, S.S.,” he said.\nHis eyes followed the blonde’s heaving chest, followed exposed contours of her breasts up to her face, to the eyes widening in surprise, to the red tongue moistening her full lips. Surprise? Anticipation? A touch of fear?\nHe lowered his hands and watched the blonde raise the carbine. “Colonel, I did not know . . . ”\nHe saw the subversive light in her eyes and didn’t hesitate. There was only one way to act from the start and he didn’t hesitate, he reached out and grabbed the blonde, pulling her closer to him, his hands resting on her breasts, his erection pressed again her soft back side. “Do not underestimate me, Fraulein,” he said softly as she squirmed against his body, “I am here to inspect, and to judge. The hand of the S.S.—” and here he shoved his hand between the blonde’s legs, feeling her hidden mound grow moist against his finger—“reaches a long, long way.”\nHe released her and watched her sway. “Lead on,” he said, and motioned for her to proceed him up the stairs to the mansion. Almost as an afterthought he picked up the carbine and pointed it between the blonde’s eyes. “Don’t make me repeat myself,” he said. He watched in silence as she wriggled up the stairs, her smooth ass moving sensuously against the leather.\nHe followed her into the headquarters of the Virgins of the Rhein, and closed the door softly against the darkness outside.\nTO BE CONTINUED.\n“Yes, of course I was pleased with the Last Jew’s fake German identity—the colonel’s name I made from adding together the names of Fredrick Viter and Walther Rauff, both rather obscure historical figures. The contents were harder, the sense of something major happening almost—or so I like to think—palpable,” Hanzi said. He was sitting in a coffee shop on Göring Strasse with his friend.\nHis friend was also a colleague. They worked for Deutsche Bank together. His name was Hermann.\n“I also enjoyed your Nazi Biker Sluts—Why Won’t You Come Out Tonight? ” Hermann now said. “Quite risqué, I thought.”\n“I hope so,” Hanzi said. They were quite alone. No one was listening.\n“And I thought Nazi Super Sex Toys Last All Summer Long was almost poetic,” Hermann said. He was something of a fan, and he began to look shiny with perspiration. “Too bad the Last Jew had to come to an end.”\n“I couldn’t keep it up,” Hanzi said. The last installment of The Last Jew and the Virgins of the Rhein was published just as he got the job. His parents had died soon after, in a train crash when they went to visit relatives in Vienna, and Hanzi stayed to live alone in the family home.\n“I also liked your monograph on The Fetishizing and Eroticizing of the Jew,” Hermann said. “Thought provoking.” He coughed and looked at his feet. “So what are you working on now?”\nHanzi smiled. It was a strange, almost ethereal smile. “I’ll show you,” he said. “Meet me next week, at the house.”\nThey drank the rest of their coffee in silence and admired the girls who passed them by.\nThe house was at number 304, Adolf Hitler Strasse. It was a comfortable white-fenced house in a quiet suburb of Berlin, with neatly-trimmed lawn at the front. But when Hermann arrived there, Hanzi was gone.\nHis last story was found on his desk, uncompleted. Hermann found the house undisturbed, the door open, Hanzi’s ancient Pravetz still turned on, the word-processing program still running, the story uncompleted on the screen. Hanzi’s special books and magazines lay in plain sight over the desk: it was as if Hanzi, perhaps getting up to answer a knock on the door, had then simply disappeared.\nThe story was called Hershele Ostropol in the Stalag of Death, and it began like so:\nHershele Ostropol in the Stalag of Death\nWhen they came for him it was not at night but in the middle of the afternoon, and the two women came quiet and with no warning, with just a polite knock on the door. He had taken it to be the postman, carrying a late delivery of one of his special magazines; but the two who stood in the doorway wore no uniforms, and only their eyes betrayed who, and what, they were.\nHanzi knew then that it was over; the knowledge washed him in lethargy, and a sense of futility made him open his hands as if in a shrug, his slim fingers opening limply, sweat dampening his palms.\nThey had interrupted him writing, it was another one of his stories. The computer was left switched on in his small study, and his special books and magazines lay in plain view on the desk.\nHe knew then that it was over; and he went with them without a fight and let them steer him into the dark Mercedes that waited for him, as he knew it would, outside.\nThe two female S.S. colonels sat opposite him in the car, leather skirts riding up their pale thighs. Their lips were colorless, without lipstick, and their blonde hair gathered like dew on their shoulders.\n“What will you do with me?” he whispered, unconsciously licking his lips. The woman on his left had brought out a horse whip and was stroking it, almost tenderly.\n“What will we do with you?” she asked. A gold swastika plunged from her neck into her bosom, hung on a thin necklace. She looked out of the window. “We will teach you what it really means,” she said, “to be treated like a Jew.”\nThe car purred as it went into motion; and soon it was gone from Adolf Hitler Strasse, heading towards . . .\nTO BE CONTINUED.\nTHE END.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize.", "source": "https://clarkesworldmagazine.com/tidhar_10_06/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: 304 Adolph Hitler Strasse by Lavie Tidhar"}