{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Brenda Cooper", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "sWhk5u1ViZkqZ6Yvr9zRe2vuKE0=", "id": null, "license": null, "comments": "", "raw_text": "2730 words, short story  My Father's Singularity  In my first memory of my father, we are sitting on the porch, shaded from the burning sun’s assault on our struggling orchards. My father is leaning back in his favorite wooden rocker, sipping a cold beer with a half-naked lady on the label, and saying, “Paul, you’re going to see the most amazing things. You will live forever.” He licks his lips, the way our dogs react to treats, his breath coming faster. “You will do things I can’t even imagine.” He pauses, and we watch a flock of geese cross the sky. When he speaks again, he sounds wistful. “You won’t ever have to die.”  The next four of five memories are variations on that conversation, punctuated with the heat and sweat of work, and the smell of seasons passing across the land.  I never emerged from this particular conversation with him feeling like I knew what he meant. It was clear he thought it would happen to me and not to him, and that he had mixed feelings about that, happy for me and sad for himself. But he was always certain.  Sometimes he told me that I’d wake up one morning and all the world around me would be different. Other nights, he said, “Maybe there’ll be a door, a shining door, and you’ll go through it and you’ll be better than human.” He always talked about it the most right before we went into Seattle, which happened about twice a year, when the pass was open and the weather wasn’t threatening our crops.  The whole idea came to him out of books so old they were bound paper with no moving parts, and from a brightly-colored magazine that eventually disintegrated from being handled. My father’s hands were big and rough and his calluses wore the words off the paper.  Two beings always sat at his feet. Me, growing up, and a dog, growing old. He adopted them at mid-life or they came to him, a string of one dog at a time, always connected so that a new one showed within a week of the old one’s death. He and his dogs were a mutual admiration society. They liked me fine, but they never adored me. They encouraged me to run my fingers through their stiff fur or their soft fur, or their wet, matted fur if they’d been out in the orchard sprinklers, but they were in doggie heaven when he touched them. They became completely still and their eyes softened and filled with warmth.  I’m not talking about the working dogs. We always had a pair of border collies for the sheep, but they belonged to the sheep and the sheep belonged to them and we were just the fence and the feeders for that little ecosystem.  These dogs were his children just like me, although he never suggested they would see the singularity. I would go beyond and they would stay and he and the dogs accepted that arrangement even if I didn’t.  I murmured confused assent when my father said words about how I’d become whatever comes after humans.  Only once did I find enough courage to tell him what was in my heart. I’d been about ten, and I remember how cold my hands felt clutching a glass of iced lemonade while heat-sweat poured down the back of neck. When he told me I would be different, I said, “No, Dad. I want to be like you when I grow up.” He was the kindness in my life, the smile that met me every morning and made me eggs with the yolks barely soft and toast that melted butter without burning.  He shook his head, and patted his dog, and said, “You are luckier than that.”  His desire for me to be different than him was the deepest rejection possible, and I bled for the wounds.  After the fifth year in seven that climate-freak storms wrecked the apples—this time with bone-crushing ice that set the border collies crazed with worry—I knew I’d have to leave if I was ever going to support my father. Not by crossing the great divide of humanity to become the seed of some other species, but to get schooled away from the slow life of farming sheep and Jonagolds. The farm could go on without me. We had the help of two immigrant families that each owned an acre of land that was once ours.  Letting my father lose the farm wasn’t a choice I could even imagine. I’d go over to Seattle and go to school. After, I’d get a job and send money home, the way the Mexican’s did when I was little and before the government gave them part of our land to punish us. Not that we were punished. We liked the Ramirez’s and the Alvarez’s. They, too, needed me to save the farm.  But that’s not this story. Except that Mona Alvarez drove me to Leavenworth to catch the silver Amtrak train, her black hair flying away from her lipstick-black lips, and her black painted fingernails clutching the treacherous steering wheel of our old diesel truck. She was so beautiful I decided right then that I would miss her almost as much as I would miss my father and the bending apple trees and the working dogs and the sheep. Maybe I would miss Mona even more.  Mona, however, might not miss me. She waved once after she dropped me off, and then she and the old truck were gone and I waited amid the electric cars and the old tourists with camera hats and data jewelry and the faint marks of implants in the soft skin between their thumbs and their index fingers. They looked like they saw everything and nothing all at once. If they came to our farm the coyotes and the re-patriated wolves would run them down fast.  On the other end of the train ride, I found the University of Washington, now sprawled all across Seattle, a series of classes and meet ups and virtual lessons that spidered out from the real brick buildings. An old part of the campus still squatted by the Montlake Cut, watching over water and movement that looked like water spiders but was truly lines of people with oars on nanofab boats as thin as paper.  Our periodic family trips to Seattle hadn’t really prepared me for being a student. The first few years felt like running perpetually uphill, my brain just not going as fast as everyone else’s.  I went home every year. Mona married one of the Ramirez boys and had two babies by the time three years had passed, and her beauty changed to a quiet softness with no time to paint her lips or her nails. Still, she was prettier than the sticks for girls that chewed calorie-eating gum and did their homework while they ran to Gasworks Park and back on the Burke-Gilman Trail, muttering answers to flashcards painted on their retinas with light.  I didn’t date those girls; I wouldn’t have known how to interrupt the speed of their lives and ask them out. I dated storms of data and new implants and the rush of ideas until by my senior year I was actually keeping up.  When I graduated, I got a job in genetics that paid well enough for me to live in an artist’s loft in a green built row above Lake Union. I often climbed onto the garden roof and sat on an empty bench and watched the Space Needle change decorations every season and the little wooden boats sailing on the still lake below me. But mostly I watched over my experiments, playing with new medical implants to teach children creativity and to teach people docked for old age in the University hospital how to talk again, how to remember.  I did send money home. Mona’s husband died in a flash-flood one fall. Her face took on a sadness that choked in my throat, and I started paying her to take care of my father.  He still sat on the patio and talked about the singularity, and I managed not to tell him how quaint the old idea sounded. I recognized myself, would always recognize myself. In spite of the slow speed of the farm, a big piece of me was always happiest at home, even though I couldn’t be there more than a day or so at a time. I can’t explain that—how the best place in the world spit me out after a day or so.  Maybe I believed too much happiness would kill me, or change me. Or maybe I just couldn’t move slow enough to breath in the apple air any more. Whatever the reason, the city swept me back fast, folding me in its dancing ads and shimmering opportunities and art.  Dad didn’t really need me anyway. He had the Mexicans and he still always had a dog, looking lovingly up at him. Max, then OwlFace, then Blue. His fingers had turned to claws and he had cataracts scraped from his eyes twice, but he still worked with the harvest, still carried a bushel basket and still found fruit buried deep in the trees.  I told myself he was happy.  Then one year, he startled when I walked up on the porch and his eyes filled with fear.  I hadn’t changed. I mean, not much. I had a new implant, I had a bigger cloud, researchers under me, so much money that what I sent my father—what he needed for the whole orchard—was the same as a night out at a concert and dinner at Canlis. But I was still me, and Blue—the current dog—accepted me, and Mona’s oldest son called me “Uncle Paul” on his way out to tend the sheep.  I told my father to pack up and come with me.  He ran his fingers through the fur on Blue’s square head. “I used to have a son, but he left.” He sounded certain. “He became the next step for us. For humans.”  He was looking right at me, even looking in my eyes, and there was truly no recognition there. His look made me cold to the spine, cold to the ends of my fingers even with the sun driving sweat down my back.  I kissed his forehead. I found Mona and told her I’d be back in a few weeks and she should have him packed up.  Her eyes were beautiful and terrible with reproach as she declared, “He doesn’t want to leave.”  “I can help him.”  “Can you make him young, like you?”  Her hair had gone gray at the edges, lost the magnificent black that had glistened in the sun like her goth lipstick all those years ago. God, how could I have been so selfish? I could have given her some of what I had.  But I liked her better touched by pain and age and staying part of my past. Like the act of saving them didn’t.  I hadn’t known that until that very moment, when I suddenly hated myself for the wrinkles around her eyes and the way her shoulders bent in a little bit even though she was only fifty-seven like me. “I’ll bring you some, too. I can get some of the best nano-meds available.” Hell, I’d designed some of them, but Mona wouldn’t understand that. “I can get creams that will erase the wrinkles from your hands.”  She sighed. “Why don’t you just leave us?”  Because then I would have no single happy place. “Because I need my father. I need to know how he’s doing.”  “I can tell you from here.”  My throat felt thick. “I’ll be back in a week.” I turned away before she could see the inexplicable tears in my eyes. By then I flew back and forth, and it was a relief to focus down on the gauges in my head, flying manual until I got close enough to Seattle airspace that the feds grabbed the steering from me and there was nothing to do but look down at the forest and the green resort playgrounds of Cle Elum below me and to try not to think too hard about my dad or about Mona Alvarez and her sons.  I had moved into a condo on Alki Beach, and I had a view all the way to Canada. For two days after I returned, the J-pod whales cavorted offshore, great elongated yin and yang symbols rising and falling through the waters of Puget Sound.  The night before I went back for Mona and my father, I watched the boardwalk below me. People walked dogs and rollerbladed and bicycled and a few of the chemical-sick walked inside of big rolling bubbles like the hamster I’d had when I was a kid. Even nano-medicine and the clever delivery of genetically matched and married designer solutions couldn’t save everyone.  I wish I could say that I felt sorry for the people in the bubbles, and I suppose in some distant way I did. But nothing bad had ever happened to me. I didn’t get sick. I’d never married or divorced. I had nice dates sometimes, and excellent season tickets for Seattle Arts and Lectures.  I flew Mona back with my father. We tried to take Blue, but the dog balked at getting in the car, and raced away, lost in the apple trees in no time. Mona looked sick and said, “We should wait.”  I glanced at my father’s peaceful face. He had never cried when his dogs died or left, and now he had a small smile, and I had the fleeting thought that maybe he was proud of Blue for choosing the farm and the sheep and the brown-skinned boys. “Will your sons care for the dog?”  “Their children love him.”  So we arrived back in West Seattle, me and Mona and my father.  I got busy crafting medicine to fix my father. These things didn’t take long—time moved fast in the vast cloud of data I had security rights for. I crunched my father’s DNA and RNA and proteins and the specifics of his blood in no time, and told the computers what to do while I set all of us out a quiet dinner on the biggest of the decks. Mona commented on the salty scent of Puget Sound and watched the fast little ferries zip back and forth in the water and refused to meet my eyes.  Dad simply stared at the water.  “He needs a dog,” she said.  “I know.” I queried from right there, sending a bot out to look. It reported fairly fast. “I’ll be right back. Can you watch him?”  She looked startled.  An hour later I picked Nanny up at Sea-Tac, a middle-aged golden retriever, service-trained, a dog with no job since most every disease except the worst allergies to modernity could be fixed.  Mona looked awed almost to fear when I showed up with the dog, but she smiled and uncovered the dinner I’d left waiting.  Nanny and Dad were immediately enchanted with each other, her love for him the same as every other dog’s in his life, cemented the minute she smelled him. I didn’t understand, but if it had been any other way, I would have believed him lost.  The drugs I designed for him didn’t work. It happens that way sometimes. Not often. But some minds can’t accept the changes we can make. In the very old, it can kill them. Dad was too strong to die, although Mona looked at me one day, after they had been with me long enough that the wrinkles around her eyes had lost depth but not so long that they had left her face entirely. “You changed him. He’s worse.”  I might have. How would I know?  But I do know I lost my anchor in the world. Nothing in my life had been my singularity. I hadn’t crossed into a new humanity like he prophesied over and over. I hadn’t left him behind.  Instead, he left me behind. He recognized Nanny every day, and she him. But he never again called me Paul, or told me how I would step beyond him. Brenda Cooper writes SF, fantasy, poetry, and an occasional non-fiction essay. She is particularly interested in robotics, climate change, and the social change that must go hand in hand with fixing the human relationship to the natural world. She is the Director of Information Technology at Lease Crutcher Lewis, a premier Pacific Northwest builder. Her love of technology, science, and science fiction combines to drive her interest in the future.  Brenda lives in Washington State with her wife, Toni, and their multiple border collies, some of whom actually get to herd sheep. She loves to exercise, garden, read, and talk with friends.", "text": "2730 words, short story\nMy Father's Singularity\nIn my first memory of my father, we are sitting on the porch, shaded from the burning sun’s assault on our struggling orchards. My father is leaning back in his favorite wooden rocker, sipping a cold beer with a half-naked lady on the label, and saying, “Paul, you’re going to see the most amazing things. You will live forever.” He licks his lips, the way our dogs react to treats, his breath coming faster. “You will do things I can’t even imagine.” He pauses, and we watch a flock of geese cross the sky. When he speaks again, he sounds wistful. “You won’t ever have to die.”\nThe next four of five memories are variations on that conversation, punctuated with the heat and sweat of work, and the smell of seasons passing across the land.\nI never emerged from this particular conversation with him feeling like I knew what he meant. It was clear he thought it would happen to me and not to him, and that he had mixed feelings about that, happy for me and sad for himself. But he was always certain.\nSometimes he told me that I’d wake up one morning and all the world around me would be different. Other nights, he said, “Maybe there’ll be a door, a shining door, and you’ll go through it and you’ll be better than human.” He always talked about it the most right before we went into Seattle, which happened about twice a year, when the pass was open and the weather wasn’t threatening our crops.\nThe whole idea came to him out of books so old they were bound paper with no moving parts, and from a brightly-colored magazine that eventually disintegrated from being handled. My father’s hands were big and rough and his calluses wore the words off the paper.\nTwo beings always sat at his feet. Me, growing up, and a dog, growing old. He adopted them at mid-life or they came to him, a string of one dog at a time, always connected so that a new one showed within a week of the old one’s death. He and his dogs were a mutual admiration society. They liked me fine, but they never adored me. They encouraged me to run my fingers through their stiff fur or their soft fur, or their wet, matted fur if they’d been out in the orchard sprinklers, but they were in doggie heaven when he touched them. They became completely still and their eyes softened and filled with warmth.\nI’m not talking about the working dogs. We always had a pair of border collies for the sheep, but they belonged to the sheep and the sheep belonged to them and we were just the fence and the feeders for that little ecosystem.\nThese dogs were his children just like me, although he never suggested they would see the singularity. I would go beyond and they would stay and he and the dogs accepted that arrangement even if I didn’t.\nI murmured confused assent when my father said words about how I’d become whatever comes after humans.\nOnly once did I find enough courage to tell him what was in my heart. I’d been about ten, and I remember how cold my hands felt clutching a glass of iced lemonade while heat-sweat poured down the back of neck. When he told me I would be different, I said, “No, Dad. I want to be like you when I grow up.” He was the kindness in my life, the smile that met me every morning and made me eggs with the yolks barely soft and toast that melted butter without burning.\nHe shook his head, and patted his dog, and said, “You are luckier than that.”\nHis desire for me to be different than him was the deepest rejection possible, and I bled for the wounds.\nAfter the fifth year in seven that climate-freak storms wrecked the apples—this time with bone-crushing ice that set the border collies crazed with worry—I knew I’d have to leave if I was ever going to support my father. Not by crossing the great divide of humanity to become the seed of some other species, but to get schooled away from the slow life of farming sheep and Jonagolds. The farm could go on without me. We had the help of two immigrant families that each owned an acre of land that was once ours.\nLetting my father lose the farm wasn’t a choice I could even imagine. I’d go over to Seattle and go to school. After, I’d get a job and send money home, the way the Mexican’s did when I was little and before the government gave them part of our land to punish us. Not that we were punished. We liked the Ramirez’s and the Alvarez’s. They, too, needed me to save the farm.\nBut that’s not this story. Except that Mona Alvarez drove me to Leavenworth to catch the silver Amtrak train, her black hair flying away from her lipstick-black lips, and her black painted fingernails clutching the treacherous steering wheel of our old diesel truck. She was so beautiful I decided right then that I would miss her almost as much as I would miss my father and the bending apple trees and the working dogs and the sheep. Maybe I would miss Mona even more.\nMona, however, might not miss me. She waved once after she dropped me off, and then she and the old truck were gone and I waited amid the electric cars and the old tourists with camera hats and data jewelry and the faint marks of implants in the soft skin between their thumbs and their index fingers. They looked like they saw everything and nothing all at once. If they came to our farm the coyotes and the re-patriated wolves would run them down fast.\nOn the other end of the train ride, I found the University of Washington, now sprawled all across Seattle, a series of classes and meet ups and virtual lessons that spidered out from the real brick buildings. An old part of the campus still squatted by the Montlake Cut, watching over water and movement that looked like water spiders but was truly lines of people with oars on nanofab boats as thin as paper.\nOur periodic family trips to Seattle hadn’t really prepared me for being a student. The first few years felt like running perpetually uphill, my brain just not going as fast as everyone else’s.\nI went home every year. Mona married one of the Ramirez boys and had two babies by the time three years had passed, and her beauty changed to a quiet softness with no time to paint her lips or her nails. Still, she was prettier than the sticks for girls that chewed calorie-eating gum and did their homework while they ran to Gasworks Park and back on the Burke-Gilman Trail, muttering answers to flashcards painted on their retinas with light.\nI didn’t date those girls; I wouldn’t have known how to interrupt the speed of their lives and ask them out. I dated storms of data and new implants and the rush of ideas until by my senior year I was actually keeping up.\nWhen I graduated, I got a job in genetics that paid well enough for me to live in an artist’s loft in a green built row above Lake Union. I often climbed onto the garden roof and sat on an empty bench and watched the Space Needle change decorations every season and the little wooden boats sailing on the still lake below me. But mostly I watched over my experiments, playing with new medical implants to teach children creativity and to teach people docked for old age in the University hospital how to talk again, how to remember.\nI did send money home. Mona’s husband died in a flash-flood one fall. Her face took on a sadness that choked in my throat, and I started paying her to take care of my father.\nHe still sat on the patio and talked about the singularity, and I managed not to tell him how quaint the old idea sounded. I recognized myself, would always recognize myself. In spite of the slow speed of the farm, a big piece of me was always happiest at home, even though I couldn’t be there more than a day or so at a time. I can’t explain that—how the best place in the world spit me out after a day or so.\nMaybe I believed too much happiness would kill me, or change me. Or maybe I just couldn’t move slow enough to breath in the apple air any more. Whatever the reason, the city swept me back fast, folding me in its dancing ads and shimmering opportunities and art.\nDad didn’t really need me anyway. He had the Mexicans and he still always had a dog, looking lovingly up at him. Max, then OwlFace, then Blue. His fingers had turned to claws and he had cataracts scraped from his eyes twice, but he still worked with the harvest, still carried a bushel basket and still found fruit buried deep in the trees.\nI told myself he was happy.\nThen one year, he startled when I walked up on the porch and his eyes filled with fear.\nI hadn’t changed. I mean, not much. I had a new implant, I had a bigger cloud, researchers under me, so much money that what I sent my father—what he needed for the whole orchard—was the same as a night out at a concert and dinner at Canlis. But I was still me, and Blue—the current dog—accepted me, and Mona’s oldest son called me “Uncle Paul” on his way out to tend the sheep.\nI told my father to pack up and come with me.\nHe ran his fingers through the fur on Blue’s square head. “I used to have a son, but he left.” He sounded certain. “He became the next step for us. For humans.”\nHe was looking right at me, even looking in my eyes, and there was truly no recognition there. His look made me cold to the spine, cold to the ends of my fingers even with the sun driving sweat down my back.\nI kissed his forehead. I found Mona and told her I’d be back in a few weeks and she should have him packed up.\nHer eyes were beautiful and terrible with reproach as she declared, “He doesn’t want to leave.”\n“I can help him.”\n“Can you make him young, like you?”\nHer hair had gone gray at the edges, lost the magnificent black that had glistened in the sun like her goth lipstick all those years ago. God, how could I have been so selfish? I could have given her some of what I had.\nBut I liked her better touched by pain and age and staying part of my past. Like the act of saving them didn’t.\nI hadn’t known that until that very moment, when I suddenly hated myself for the wrinkles around her eyes and the way her shoulders bent in a little bit even though she was only fifty-seven like me. “I’ll bring you some, too. I can get some of the best nano-meds available.” Hell, I’d designed some of them, but Mona wouldn’t understand that. “I can get creams that will erase the wrinkles from your hands.”\nShe sighed. “Why don’t you just leave us?”\nBecause then I would have no single happy place. “Because I need my father. I need to know how he’s doing.”\n“I can tell you from here.”\nMy throat felt thick. “I’ll be back in a week.” I turned away before she could see the inexplicable tears in my eyes. By then I flew back and forth, and it was a relief to focus down on the gauges in my head, flying manual until I got close enough to Seattle airspace that the feds grabbed the steering from me and there was nothing to do but look down at the forest and the green resort playgrounds of Cle Elum below me and to try not to think too hard about my dad or about Mona Alvarez and her sons.\nI had moved into a condo on Alki Beach, and I had a view all the way to Canada. For two days after I returned, the J-pod whales cavorted offshore, great elongated yin and yang symbols rising and falling through the waters of Puget Sound.\nThe night before I went back for Mona and my father, I watched the boardwalk below me. People walked dogs and rollerbladed and bicycled and a few of the chemical-sick walked inside of big rolling bubbles like the hamster I’d had when I was a kid. Even nano-medicine and the clever delivery of genetically matched and married designer solutions couldn’t save everyone.\nI wish I could say that I felt sorry for the people in the bubbles, and I suppose in some distant way I did. But nothing bad had ever happened to me. I didn’t get sick. I’d never married or divorced. I had nice dates sometimes, and excellent season tickets for Seattle Arts and Lectures.\nI flew Mona back with my father. We tried to take Blue, but the dog balked at getting in the car, and raced away, lost in the apple trees in no time. Mona looked sick and said, “We should wait.”\nI glanced at my father’s peaceful face. He had never cried when his dogs died or left, and now he had a small smile, and I had the fleeting thought that maybe he was proud of Blue for choosing the farm and the sheep and the brown-skinned boys. “Will your sons care for the dog?”\n“Their children love him.”\nSo we arrived back in West Seattle, me and Mona and my father.\nI got busy crafting medicine to fix my father. These things didn’t take long—time moved fast in the vast cloud of data I had security rights for. I crunched my father’s DNA and RNA and proteins and the specifics of his blood in no time, and told the computers what to do while I set all of us out a quiet dinner on the biggest of the decks. Mona commented on the salty scent of Puget Sound and watched the fast little ferries zip back and forth in the water and refused to meet my eyes.\nDad simply stared at the water.\n“He needs a dog,” she said.\n“I know.” I queried from right there, sending a bot out to look. It reported fairly fast. “I’ll be right back. Can you watch him?”\nShe looked startled.\nAn hour later I picked Nanny up at Sea-Tac, a middle-aged golden retriever, service-trained, a dog with no job since most every disease except the worst allergies to modernity could be fixed.\nMona looked awed almost to fear when I showed up with the dog, but she smiled and uncovered the dinner I’d left waiting.\nNanny and Dad were immediately enchanted with each other, her love for him the same as every other dog’s in his life, cemented the minute she smelled him. I didn’t understand, but if it had been any other way, I would have believed him lost.\nThe drugs I designed for him didn’t work. It happens that way sometimes. Not often. But some minds can’t accept the changes we can make. In the very old, it can kill them. Dad was too strong to die, although Mona looked at me one day, after they had been with me long enough that the wrinkles around her eyes had lost depth but not so long that they had left her face entirely. “You changed him. He’s worse.”\nI might have. How would I know?\nBut I do know I lost my anchor in the world. Nothing in my life had been my singularity. I hadn’t crossed into a new humanity like he prophesied over and over. I hadn’t left him behind.\nInstead, he left me behind. He recognized Nanny every day, and she him. But he never again called me Paul, or told me how I would step beyond him.\nBrenda Cooper writes SF, fantasy, poetry, and an occasional non-fiction essay. She is particularly interested in robotics, climate change, and the social change that must go hand in hand with fixing the human relationship to the natural world. She is the Director of Information Technology at Lease Crutcher Lewis, a premier Pacific Northwest builder. Her love of technology, science, and science fiction combines to drive her interest in the future.\nBrenda lives in Washington State with her wife, Toni, and their multiple border collies, some of whom actually get to herd sheep. She loves to exercise, garden, read, and talk with friends.", "source": "https://clarkesworldmagazine.com/cooper_06_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: My Father's Singularity by Brenda Cooper"}