{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert Reed", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "zT5W7uZtXD3cvf35abUTDcs0/Lo=", "id": null, "license": null, "comments": "", "raw_text": "6300 words, short story  Poubelle  1  Security AIs heard whimpering, diagnosed the source, then alerted the rest of the household. A baby moggie had fallen inside one of the nearby recycling hubs. Of course the children hurried outside to see, and being noble souls, they dragged the half-suffocated creature out of the garbage. But the rescue had barely begun. Social agencies needed to be alerted. Whose baby was this, and why would they abandon the poor thing? DNA identified a local couple as parents, but tragically, those moggies had died days earlier in a fire that might or might not have been arson. The Venerable police claimed to be investigating, but there were no viable leads, and they didn’t care to offer explanations for why the public security AIs had failed, or how that little orphan managed to crawl past each of the hub’s safety hatches.  As a courtesy, the household received a comprehensive list of public orphanages. In addition, private shelters made bids to raise the child. But moggie babies, particularly those from wicked circumstances, demanded heroic amounts of developmental help. The best facilities would accept her only if suitable donations were made, and this particular Family already knew too well what it was like to have their good hearts abused.  Why not keep the girl here instead?  Not only the children asked that question. Several adults, charmed by this pretty little Venerable, admitted that the household had lived too long without a moggie. That’s why they officially adopted her. Wetware lawyers appealed to the courts. Digital forms were filled out and filed. The Family’s very public intention was to spoil the girl with long baths, rich food, and pristine water. Add to that some significant pampering from attentive machines, plus the occasional hard affection from the children. And because every moggie deserved to be literate, the precious girl was taught to speak, read, and write a simple but very respectable language.  French. One of the original Earth tongues was picked for the very best reason: The Father of All’s ancestors came from that tiny patch of left-behind ground.  AI teachers settled on a Parisian French—a particularly lofty strain of that utterly extinct tongue.  Poubelle. That’s what the children named their moggie. A lovely word to certain ears, and descriptive too.  “Poubelle” meant “trash can.”  For six thousand days, one Venerable human lived in the rarest moggie heaven. A massaging bed dominated her spacious warm room. She had toys and tutors, libraries, and a full wardrobe. Her daily clothes included clumsy, brightly colored costumes worn without complaint. But she was allowed to dress herself too. Like tonight. For her own fine reasons, she had put on trousers and slippers and a tight-fitting red shirt. Talking dolls and mathematical puzzles begged to be played with. She ignored them. With her Family scattered, she stood alone, waiting impatiently beside one of the home’s minor portals. An ear that had been called “jolie” was pressed against what wasn’t a true door. Muted sounds drifted in from the outdoors. Animal wails, animal singing, and once, in the distance, a feral moggie cursing some grave injustice.  None of those noises mattered. What she wanted arrived with a sudden stillness, the nearby world abruptly closing its many mouths.  Of course it might not be Him. After all, the world was full of dangerous souls, and the moggie had learned how to swallow her hopes.  But the silence ended with a familiar voice, low in timbre, very close, using a language so much harsher than Old French. And after the final yip, he added, “Trash can.”  Opening her purse, Poubelle checked on her money and the little revolver, then pulled the long knife from the hilt riding her belt.  A convincing smile filled that pretty teenage face. Then came the plea, “I want to be outside. And I promise, promise to be very, very careful.”  Everyone heard her. Nobody reacted.  “Please please please,” she kept calling out.  Yet nothing happened. As expected. Brandishing the knife, she began to strike what wasn’t a door and would never show damage. But futile gestures helped to remind others that she was feral-born, and when frantic, she was likely to harm herself with that nickel-steel blade.  The children spoke among themselves. These were Perpetuals, and Poubelle would never learn more than a few words of their dense, thoroughly contrived language. But her smiles and piercing screams had their own meaning. Those young gods couldn’t ignore the caterwauling, and that’s why an older child known as Fret made a special trip to open the portal for silly Poubelle.  A long grove of Haumea walnuts filled that portion of the yard, and in the shadows, standing tall, was a wild reynard.  “Here I am,” he called out.  In the shrill tongue of great predators.  2  Perpetuals were the rarest people. Born rich and immortal, they came into life bearing lofty, ridiculously intricate names. The lucky few were able to choose shorthand designations. Brief, crisp, perfect. But most of the common names came out of random nonsense. Like a certain child who complains about dangers nobody else can see—mortal hazards that don’t exist today and likely never will. Barely more than a baby, the girl relentlessly bombarded her Family with outlandish scenarios, even when older siblings teased her for being ridiculous. Then one day, an exasperated grand-great-mother said, “Oh my, you’re such a fret, Fret.” A single offhand remark, but that proved to be a decisive moment, and that’s why the girl was called Fret today and might be for the next one hundred billion years.  Some children rebelled against their labels.  Not this one. Not only did she accept the syllable, but Fret embraced her role as the Family’s official pessimist. Just a few hundred years old, half-grown, and knowing nothing but joy and enlightenment, Fret continued to conjure up despairs enthusiastically shared with everyone she loved.  “Define these mortal hazards,” her siblings demanded.  With many of the adults listening on the sly.  “What are you so afraid of, Fret?”  Clear, easy-to-refute scenarios should be avoided. That’s what the girl learned early on. And to always project confidence while dispensing her warnings.  “Our enemies are gathering,” she might say. “Right now, over the horizon, they’re plotting against the Family. Against me.”  “But there aren’t any horizons,” the littlest babies complained. “We see everywhere and everyone. Always and forever.”  Of course adults and the older children knew what she meant. “The horizon” was an expression, and even the most formidable eye had limitations.  Someone always attacked Fret with old logic and happy numbers.  “So how old is our world?” they asked.  A precise birthdate existed. “Twenty million years and an afternoon,” was the girl’s sarcastic answer.  “And how long have we been in this world?”  “Twenty million years, minus a few mornings.”  “And who are ‘we?’”  “Humanity.”  “And here, just in this one new world . . . how many human species peacefully coexist?”  There was a precise count, but it was more important to irritate her audience. “Just two of us,” Fret said. “The mortals, and us.”  Perpetuals didn’t like the word, “Mortal.” In the wrong circumstance, they were just as mortal as anyone else. “Venerables’’ was the title given to that multitude of human-based species sporting wet brains and brief life spans. Trillions of them shared this world and the rest of the solar system with a few million bioceramic minds. They were the ageless, durable Perpetuals . . . except of course none of them, not even the Father of All, was truly and forever invincible.  Say what you want about Fret’s ravings, the girl told gripping stories packed with rich details and just enough plausibility. “The status quo only looks strong,” she often claimed. Then she would imagine prophets or new human species who would unite the Venerables. Or she’d describe some minor injustice that would create a chaotic mob, and that mob would attack them with plasma torches and fission bombs. And worst of all? The Venerables would drag this smug Family out of their mansion, then strip them of their ridiculous wealth.  Apocalyptic stories were fun to hear and fun to dismiss.  And Fret’s motives always deserved to be attacked.  “You don’t believe your own words,” she was told. “This is nothing but fun for you. This is your favorite game. Isn’t that right, little one?”  Maybe yes, maybe no. But Fret’s beliefs belonged to her, and she insisted on keeping them secret.  On the best days, a frustrated grand-great would come forward, unveiling the latest society model and n-dimensional forecasts. “See? We are loved. You are safe. So shut up please, darling.” This kind of information was normally kept away from children, and it was fascinating stuff. Tax policies. Bribe policies. Welfare rivers, plus advertising campaigns. With comprehensive tallies of the solar system’s resources, present and future, proving that trillions more Venerables could live well enough, with a billion Perpetuals overseeing this very disciplined chaos.  “As long as there is a Creation,” said those self-assured voices, “this is where we will stand.”  “And when does the Creation end?” Fret asked.  “A trillion days from today,” was one stubborn answer.  No doubt about it, elaborate plans were at work. The human colonists—both varieties—had cobbled together a civilization leaning hard on caste systems and the proven rules of ecology. And the foundation beneath everything? Confidence. Every adult confidently assured her that the plan was proven and perfect. Doubt was nothing but a childhood disease, and that’s why the girl couldn’t sleep happily through the night. Believe it or not, she would grow out of this affliction, living a happy life that would end just short of Forever.  “I don’t believe you,” Fret often said.  “So prove us wrong,” they said.  There were many reasons worth mentioning. Important points of concern and lesser troubles that kept changing rank from day to day. But good ideas didn’t matter to entities far older than one baby girl. And while the girl realized that she didn’t know everything, she also remembered that when set against a universe rich with knowledge and experience, these smug adults knew just a little more than she did.  That’s what terrified Fret most of all.  “Cling to whatever nightmare you want,” the others told her. “But that doesn’t diminish what is real.”  “Agreed,” said the fearful child.  Letting them see her tremble.  3  “There you are,” Trash can called out.  A security shimmer clung to the girl, and then she pulled free. Except there was no leaving the mansion behind. Where the Perpetuals lived, surfaces and pets were scrubbed to a micro-sterile level. What the girl carried was the distinct odor of nothing—empty hair, sanitary breath, and ass scrubbed clean by eager machines. There was also the question of her health, which was considerable and peculiarly attractive. The reynard always suffered a stubborn longing for this creature . . . urges a little sexual and more than a little parental . . . and which of those instincts was worst . . . ?  Moggies were ancestral enough to pass for an Earthly human.  While the reynard was something else entirely.  Using the City’s ruling dialect, he called her, “Trash can.”  “My reynard,” she replied, in his language.  Offering the most human piece of himself, his right hand claimed her little hand, shaking it vigorously—a politeness taught to her when they first met, and now a tradition that always made her grin and laugh.  She was a predictable ape, and he would never stop appreciating that.  “Where tonight?” was her standard first question.  Genuine nights didn’t exist for this world.  “Hunting, then different fun,” he promised.  But first, they had to escape the heirloom trees. The reynard despised the darkness under these massive branches and the hard black nuts rumored to be delicious but not belonging to him. The City beyond was his home, his garden. Leading her past the last demon wall, they emerged into a vibrant, fabulous landscape—plastic buildings and glass needles pushing high, while a trillion kilometers of catacombs lay underfoot. By day, the dwarf sun was a faint smear of heat encased inside solar collectors and flare collectors. But the sun had just set, ten billion bright windows helping to light the scene, helped along by advertisements targeting the vulnerable and spotlights deployed by public police and private militias. Except nobody dared to try selling insurance to the reynard, or to question his movements, or in any way risk his anger. That’s because he was a considerably important human. Not a thousandth as powerful as any Perpetual, but still an authentic lord marching with purpose through this gorgeous pasture.  “Hunting” was exactly what it always had been. The prey were small, cautious bodies left vulnerable between hiding places. Chasing them was Trash can’s joy, and she was rather good at it. Hard shouts and slashing gestures with her toy knife were enough to scare most victims. Like tonight. A mated pair of hamish gophers panicked, running exactly where they were expected to run, into a sub-ground runway, straight at the other half of this effective team.  The reynard didn’t need knives or noise. His famous face is his weapon, delivering a reputation built over the years. Yes, these little souls could turn and run away again, and one of them might escape. But that left the spouse to suffer untold miseries, and they were a loving couple. Neither would abandon the mate, and seeing the reynard, they accepted their shared doom.  “Stop,” he said.  Instantly, yes.  “Kneel.”  To the pavement, knees, and pursed lips too.  “And beg for your next breaths.”  Not that they were physically endangered. Reynards were capable of murder, but nobody this small could ever be in mortal danger. Harassments. That’s what the gophers were afraid of. Legal maneuvers. Evil gossip wrapped in the worst kinds of truth. Those were the looming fates, and their enthusiastic begging was well underway when Trash can grabbed them from behind, shaking their little necks.  A few moments later, two hunters emerged from the runway with the single key to a well-stocked locker. Common foods and sweetened water became a dinner enjoyed by the moggie, tolerated by the reynard, and then after marking the locker’s corners with their fragrant urine, they took a capcar to the next adventure.  The girl’s favorite club was popular with raptors, reynards, and other high carnivores. A few moggies were allowed to watch the fun from the back hallways, but only one moggie was welcomed on the dance floor. Bottled aviaries sang tunes that would be old next week, forgotten next month, then rediscovered in ten or fifty years.  One splendid raptor guided Trash can across the dance floor, his ceremonial wings spread wide, leaving the reynard free to move where he needed to be, taking care of various bits of business.  “Success never ends,” the great proverb warns. And it was well worth adding, “Only the fool takes these words as a comfort.”  The tiny newborn sun was on the other side of the world when his moggie came off the dance floor to find him.  “I’m tired,” she announced.  “And thirsty,” he guessed.  “Somewhere quiet,” she said.  He named an even more exclusive business where pure water was mixed with a multitude of joyful drugs.  “Yes,” she said.  He said, “This way.”  They left through a lesser doorway, emerging on a street that she had never walked before. Yet there was nothing but confidence in her stride. The late-hour wilderness stood around them, never quiet but plainly resting. Two hundred million sentient residents lived in this corner of the First World: Prey and predators, thoughtful AIs and idiot machines. And there was also one towering structure filled with Perpetuals. Which, from the reynard’s point of view, was one tower too many.  If only scaring the gods was as easy as scaring a couple gophers.  Wishes and success. When hasn’t life been defined by those two measures?  Walking behind the moggie, the reynard used French.  “Poubelle.”  She turned, taking a backward step before stopping entirely. Then in that extinct, half-lovely language, she asked, “Vous connaissez Francais?”  He knew her language better than she spoke his, yes.  Now the reynard whispered more words, but not in French.  “I have her, right here, in my sights.”  The girl smiled, stubbornly ignoring what she heard and the obvious dark tone.  “I’ll take the moggie now,” he said.  Her smile vanished. From her purse, that little predator pulled out a savage pretend gun. A gift from the gods, supplied more for their comfort than as a precaution . . . and the poor girl didn’t even suspect that her weapon had been disabled.  The reynard said nothing.  “What are you doing?” she asked. In both of their languages.  For the first time, the reynard placed his less-human hand against her shoulder, and he pressed down until he had proved just how strong he was and how weak she would always be.  4  Poubelle didn’t come home by morning.  Fret was the first to worry, which was entirely reasonable. Better than her siblings, she appreciated those archaic curves and holes, including that mostly lovely, sometimes overly loud voice. But most of all, Fret had opened the portal, letting the girl run wild in a world full of teeth and rage.  “We need to find her,” she declared.  The house AIs reworked that appeal, subtracting Fret from the solution. “We’ll look for our moggie.”  “My moggie,” she said.  A statement wisely left unchallenged. Drones and smart flies were tossed into the atmosphere. A trillion public conversations, recorded as a matter of habit, reconstructed portions of the girl’s final evening. The last sighting? On an obscure public street, the reynard grabbing Poubelle against her will . . . and with that, the Family’s high eyes reached across the First World. But with strict limitations in place. The landscape in question was unwelcoming and shrouded in ancient laws. Yes, inconveniences like that could be set aside, but only if an adult Perpetual saw important or convenient reasons. The AIs refused to make any request involving “our moggie.” Indeed, a final, far more critical issue had to be addressed.  “We’re certain you know this. But by the Codes of Self-awareness, Poubelle is considered to be an emancipated adult.”  Fret was studying multiple rivers of data, but she had cognitive resources to hear the insult riding inside that flat statement.  “On the other hand, you aren’t grown up,” the machines were reminding her. “Thus, your freedoms don’t match the moggie’s freedoms.”  Fret closed her eyes.  “That reynard,” she said. “He knows where Poubelle is.”  “We cannot find him,” the AIs warned.  “Look deeper.”  “There is no ‘deeper,’ Fret. We’re at our limits here.”  “But Poubelle is in trouble.”  “You’re talking about a sentient organism with inalienable rights, and we must respect those rights. We know you don’t want to hear this—”  “Don’t say it.”  “Little Miss Trash can is an emancipated citizen of the world.”  “Except she lives here.”  “Except when she leaves us. Which is almost every evening, as of late.”  “She’s my moggie,” Fret insisted.  The machines responded with a unified chorus. “First, let’s mention how slavery is not permitted. Legally speaking, our household has graciously supplied refuge to a helpless orphan, and each of us should be commended for enduring her shit and her singing. But she’s mature now. Emancipated. According to every court, she can do whatever she wants to do, with whomever she chooses.”  “She’s inside a deep hole. Hurt.”  “Possibly yes, but as a consequence of entirely free actions. And in this scenario, you have no responsibilities.”  Fret had stopped asking an army of sensors for more data. She had found what she needed, and her next step was to tell the house, “All right. I’ll stop worrying about my missing friend.”  The house had to recognize the lie. But then again, Fret didn’t need to be believed. She was the clear master in this relationship, free to tell any lie before doing exactly what she wanted to do.  Slipping into another portion of the house, she closed portal tubes and security shimmers before assembling what she needed. First, a collection of intriguing gifts that would prove tempting to reynards and other crime bosses. And second, she designed a sophisticated hull with enough room inside to hold the soul of one mostly grown-up Perpetual.  Bold actions always made Fret happy, particularly when she knew that she was right.  Poubelle’s portal gave way with a touch. Would anyone care enough to try and stop her? She hoped so. In one elaborate daydream, Fret’s immediate parents stood in her path, listing the ways she was sentimental and ridiculous, and then she lectured them about how evil they were, living among all of these impoverished, badly ignored cousins.  But nobody took the trouble to intervene.  Fret found herself outdoors, standing motionless in the shade of walnut trees—a grove built to thrive in this half-G gravity and the deep, rigorously terraformed atmosphere. Behind her, the great house was a column of premium hyperfiber bathed in soft white light, its foundation reaching into a mantle still being born, while its roof punched through the atmosphere’s diamond ceiling.  Whenever she left home, Fret felt extra alive. She had no reason to be afraid; the law and her own invincibility always kept her safe. But then again, that’s why the moggie amazed her so much. A corporeal little girl like that, small and weak in every dimension, yet when night came, Poubelle could become frantic, desperate to escape from the safest realm in existence.  “How could I ever be so brave?” Fret asked the final tree.  Then one more step was taken, and to every eye she looked like another pretty and very young little moggie.  5  Another window had been pushed open, but instead of offering a yard full of walnut trees, this window left the galaxy within humanity’s reach.  The Great Ship made that possible. Millions of years ago, Fret’s ancestors discovered a world-sized starship, abandoned and free for the taking. Every intelligent species was welcome to ride inside the Ship’s luxurious quarters. All they had to do was surrender wealth, knowledge, and maybe a few empty worlds. With one stroke of good fortune, humanity found herself in a golden age. Yet just a thousand centuries later, with no warning whatsoever, the Great Ship was stolen and then taken out of the galaxy, accelerating toward the Virgo Cluster.  That one fine window had been slammed shut.  Yet humanity continued to thrive. Rich colony worlds built new starships that followed the galaxy’s spiral arms. Empty worlds and difficult worlds were claimed and terraformed, and once those places filled up, subsequent generations went out searching for fresh challenges. Some colonies failed quickly. Other settlements died over the aeons. But there were spectacular successes, enough to make the Milky Way into a human paradise, and that was true even when the Great Ship had become little more than legend.  One unusually ambitious boy was born in a crowded world.  He had an intricate long name and a childhood nickname, but at some point he began to call himself, “The Father of All.”  “I want a solar system of my own,” he said.  In that, not an uncommon dream.  “No, this isn’t fantasy. I have a plan.” Then he would explain portions of his plan, offering just enough to make most people laugh at him or simply walk away.  But a few of his peers said, “Yes, why not?”  Why not? Because The Father of All was an impoverished nobody among the immortals. And his followers were the same, or worse. Between them, they couldn’t afford a third-hand tug, much less the necessary machinery to terraform one home out of a dead bolide. But there were thriving Venerable communities on several nearby worlds. These were humans who refused bioceramic brains and immortality, who lived for two or three busy centuries and then happily fell into an old age defined by dignity and celebration. In addition, the Venerables had inventive habits and frugal natures, and because of that, they not only could afford a suitable starship, they could equip it with the tools necessary to rebuild dozens of worlds.  That’s where the Father found his funding. An empty solar system was identified, a substantial comet was encased in hyperfiber and rockets, and then adventurous Venerables took their aging bodies into liquid argon baths, expecting to be awakened on the new home, perhaps in just another thousand years.  And that’s how one man’s dream became real.  With a crew of loyal followers, The Father of All aimed for the proposed colony worlds. But he kept moving. The populated heart of the galaxy was abandoned. The Father aimed at a thread of dust and star grit that had only just begun to collapse on itself. A weather forecast. That’s what guided him. Measuring the push of radiation and the tug of gravity, he could drift into this very empty place, waiting with a patience found only with the most gifted or most crazed souls.  For the sake of their health, the Venerables were eventually brought out of hibernation, and when told about the ultimate plan, they screamed.  But what could be done?  They went back into the frigid argon, and they were awakened again, allowed to breathe and scream before surrendering to the situation all over again.  By and large, Venerables are talented at facing ugly inevitables.  Besides, the immortal asshole kept promising to honor their agreement.  Twenty thousand centuries had to pass before a suitable solar system was born. By then, the Great Ship had vanished between the galaxies, never to return. Humanity was an infestation still racing across the Milky Way. And one self-named human set himself up as a king and god and ultimate father, overseeing an empire that consumed the terrestrial baby worlds, then every other planet and moon and shard of ice orbiting around an M-class sun that burned softly, ready to endure for another hundred billion years.  6  The girl stood in line like every hopeful moggie. Dressed for dancing, armed with a pistol and two hypodermic crossbows, she was pretending patience while waiting for her chance to step inside.  The club’s manager was an old raptor long-retired from hard work. This job was a plum given to someone who had proven to be loyal and trustworthy, and she didn’t welcome uninvited hazards waiting at her door.  She woke the reynard with the news.  He sat up, stood up. Dressed. Looked at the feeds.  “Which god is it?” she asked.  He offered a piece of the whole name, then said, “Fret.”  “Just as you predicted,” she said.  And he responded by reminding her, “I’ve made a lot of forecasts here.”  They were half a kilometer below the club, inside a catacomb shielded by the best Venerable deceptions. Pounding the ashes out of a favorite pipe, the manager stuffed the bowl with fresh pleasures, lit the mess, and inhaled until the fire wanted to burn on its own. “I’m letting you play this out,” she said. “But if I see real trouble, then I’ll sure as hell—”  “Warn the Council of Wolves. You promised me. Yeah, I know.”  No matter how important, reynards and raptors were just local predators. Larger, less patient packs were scattered from here to the edge of the solar system. Complicated politics. That’s what gave birth to human life, and all these millions of years only served to make everything into an always grander mess.  “So,” said the manager. “Do I let her inside, or not?”  “Not.”  “Thank you,” she said.  Then after a few calming puffs, she added, “There’s a key inside that purse of hers. What do you think is inside the matching locker?”  “Coaxings. Fine little gifts for us to give back to her little pet. No doubt.”  “No doubt.”  Watching his victim, the reynard thought, “My god, she is a beauty.”  “Are you taking her bribes?”  “Everything, and then I’ll give them to you. Off the books.”  “Well,” the old lady said. “That’s gracious of you.”  The reynard found his shoes and started for the door.  “I can’t help but notice,” she said. “What you want with this foolish Perpetual . . . it’s never been explained to me . . . ”  Pausing, he turned around to offer a bold little smile.  “Opportunities. Openings. Possibilities that I never dared to wish for,” he said. “That’s why I stuffed the baby inside the dumpster to start with.”  7  Fret never imagined that this experience could be so ridiculously fun. As another hopeful partier standing in the drippy beginnings of a long fierce rain, she was surrounded by rough conversations and busy brief lives that never stopped spinning around the essence of life: Love, Food, Shelter, Worth. There weren’t any lessons to be learned. Nothing she witnessed changed what she knew or assumed on any other day. But the scene was rich with details that kept revealing themselves with every hard stare and nuanced analysis. The young man standing beside her, for instance. He had come walking back along the line, begging for space. That round fat-rich face and the scent of his pearl-colored skin marked him as an immigrant from the ice realms of the Outer Reaches. His voice had obvious troubles with the local dialects too. So yes, of course Fret stepped a little ways forward, offering him a slice of the pavement that she had defended all evening now.  The boy had a story to tell, shorn of detail but blessed with enthusiasm. Grateful for this audience, he began to fall in love with the moggie stranger, and even though it was a little cruel, Fret led him on.  “I’d love to visit your home world,” she said.  “I would take you, if I had the money,” he said. “But there isn’t enough left to get me anywhere anymore.”  “I’m the same,” she said.  “Too bad,” he said, trying to laugh away his hopes.  “But you’re happy enough here,” she added.  “This moment I am. Yeah, sure.”  She laughed at that quite a lot, including his painfully obvious manner.  Then fresh motions caught her attention, and when her eyes were abandoning him, the boy grew worried.  “I bet you don’t know where I grew up,” he said.  Fret said, “You already told me.”  “No. I mean who adopted me and cared for me until I was grown.”  Maybe this would become a worthwhile topic. But a familiar profile had just emerged from the club, apparently for no reason but to hurry out of sight. Was it the reynard? An array of sensors promised that her guess, her hope, was correct. The brute who came to the house last night had reappeared, abandoning his day’s den for rain and distant thunder.  Interrupting the storyteller, she said, “Sorry. I see someone who owes me quite a lot. I need to run.”  “Oh, I’ll go with you,” he gamely volunteered.  “No,” seemed too rude to be left on its own. So Fret handed over a chit of compressed capital. Not enough to buy the boy his own lightsail, but adequate for passage to any place beyond this wet little avenue.  Her quarry was a locally famous predator, powerful in so many ways, but the reynard was being chased by an ageless, nearly indestructible creature.  “I’ll begin with threats,” Fret told herself. “The Family attorneys, our local police. Collective suits filed on behalf of thousands of victims . . . oh, that would make his little life unbearable . . . ”  The reynard turned down another narrow street.  “Hopefully, he’ll get angry enough to hit me.”  Her moggie-shaped hull was full of tools, each capable of responding to threats with not-quite-fatal violence.  “Then I’ll offer him a little something, out of pity, and when my girl’s returned to me, safe and wiser, I’ll cheat him on the ransom too.”  Beautiful thoughts, swift and sweet. Though the most likely resolution remained that two parties would negotiate for a few moments, then gratefully move past this foolishness.  Another intersection, and the reynard paused. Fret expected him to glance over a shoulder, but he didn’t. That tall figure of meat and armor, spun boron and servomotors, pretended to be a statue until she stopped too. Then he was running, breaking into a hard sprint, scrambling up one plastic wall to make the next sharp turn, then surging to even higher speeds.  Fret’s best run was barely fast enough to catch up. Two more turns, two more tiny roadways, then they were back on a wide avenue full of Venerables. Fragile bodies were shouting and scattering, and that’s when the girl went airborne, up high and then slamming the reynard to the ground, pinning the mechanical arm while laughing at his face, getting in position to drive the other knee against the heaving chest.  “Give her back to me,” she said.  High overhead, that carefully terraformed atmosphere had been generating bolts of lightning. Not huge discharges, but intercepted by steel spikes scattered across the City, then channeled and compressed inside an industrial capacitor. And now a wicked portion of that power burped free—a white-hot blast fierce enough to disable Fret’s hull while flinging her through the nearest window.  Two seconds passed before her security systems came back online.  “Now I’ll make you pay.”  That’s what Fret meant to say. But someone else had just stepped from the darkest corner of this otherwise empty room. Poubelle. And brandishing the controller, the wicked little moggie pushed the big fire-colored button for a second time. Just to prove that the first strike wasn’t a fluke.  The next burst was ten times worse.  Fret’s hull was quite dead.  And the reynard was kneeling beside her. Smiling. Speaking. In the Perpetuals’ dense language, he said, “I agree with you, Fret. Oh, I do. The Family should be terrified. But it won’t be a new species of human coming for your siblings and those sweet grand-greats. And it won’t be a Venerable prophet, and our idiot hatred won’t matter in the end. No, this is who is utterly dangerous, and utterly magnificent.”  With that, he picked up her dead hand, straightening one finger.  Which he pointed at the girl lying helpless on the filthy, wonderful world.  8  Welcome news arrived with the morning, and the household began to celebrate. Most of the children pushed aside games and deep immersions, or they left their AI teachers in mid-lecture, racing to the ground-level floor and a certain large space that was already decorating itself for the party. This was going to be a marvelous day. After a string of what must have been astonishing adventures, their hero was returning home. At last. Missing for twenty days, given up on by almost everyone, and that’s why even the younger adults came to watch, standing at the back of the happy room, smiling as much as anyone.  A treasured piece of the Family stepped through the demon walls and into the walnut grove, and reaching the portal, she began to knock and kick, calling out, “Je suis désolé.”  But the portal wouldn’t open. A few small disasters had triggered more paranoid levels of security, and none of the celebrants had permission to overrule anything. Pleas were sent upstairs. Nobody responded. Young children turned to the adults, several suggesting that The Father of All might willingly intercede.  “You call out to him,” one mother joked.  Nervous giggles dissolved into a final silence.  Then one courageous boy reached for the portal. Expecting nothing else, he let the booby trap remove his hand, and then picking the hand off the floor, he pressed it against his fresh stump while once more begging for someone’s decency.  And all that while, the girl standing under the walnuts repeated, “Je suis désolé.”  “I’m sorry,” she was saying with that precious French. “I’m sorry. I’m sorry. I’m sorry.”  At last, one of grand-great-mothers arrived. She was a tall confident beauty and an avid traveler who had visited every important world in the solar system, meeting every Perpetual worth the effort. She was also a genius when it came to dispensing nicknames for the Family. Rumors claimed that she was The Father’s favorite, and it was worth noting that at some point in life, everybody wished they could be her, if only for a day.  The ancient woman stepped up to the portal, two fingers and a coded signal causing it to unseal and slowly pull open.  That was when the children looked at each other, taking inventory.  “Where’s Fret?” they wanted to know.  “Still hiding in her room, licking her little wounds,” others said.  The harshest, richest kinds of laughter filled the room as the lost girl returned to them. But Poubelle didn’t come alone. The tight trousers worn when she left were even tighter now, a baby moggie riding above her hips.  “It’s a girl,” she said, answering the question before it was asked.  “And her father’s a beautiful boy from the Outer Reaches,” she added.  Then with her own marvelous confidence, Poubelle declared, “My daughter will be the second generation in a long line of pretty pet moggies.”  A moment of prophecy that would prove true. For one hundred and six centuries, this girl’s descendants smiled when they were happy, wore the funny pretty silly costumes when required, and on the day when the Family finally turned against each other, they pretended to be surprised.  They pretended to be sorry.  But always making ready for the next spectacular new world. Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "text": "6300 words, short story\nPoubelle\n1\nSecurity AIs heard whimpering, diagnosed the source, then alerted the rest of the household. A baby moggie had fallen inside one of the nearby recycling hubs. Of course the children hurried outside to see, and being noble souls, they dragged the half-suffocated creature out of the garbage. But the rescue had barely begun. Social agencies needed to be alerted. Whose baby was this, and why would they abandon the poor thing? DNA identified a local couple as parents, but tragically, those moggies had died days earlier in a fire that might or might not have been arson. The Venerable police claimed to be investigating, but there were no viable leads, and they didn’t care to offer explanations for why the public security AIs had failed, or how that little orphan managed to crawl past each of the hub’s safety hatches.\nAs a courtesy, the household received a comprehensive list of public orphanages. In addition, private shelters made bids to raise the child. But moggie babies, particularly those from wicked circumstances, demanded heroic amounts of developmental help. The best facilities would accept her only if suitable donations were made, and this particular Family already knew too well what it was like to have their good hearts abused.\nWhy not keep the girl here instead?\nNot only the children asked that question. Several adults, charmed by this pretty little Venerable, admitted that the household had lived too long without a moggie. That’s why they officially adopted her. Wetware lawyers appealed to the courts. Digital forms were filled out and filed. The Family’s very public intention was to spoil the girl with long baths, rich food, and pristine water. Add to that some significant pampering from attentive machines, plus the occasional hard affection from the children. And because every moggie deserved to be literate, the precious girl was taught to speak, read, and write a simple but very respectable language.\nFrench. One of the original Earth tongues was picked for the very best reason: The Father of All’s ancestors came from that tiny patch of left-behind ground.\nAI teachers settled on a Parisian French—a particularly lofty strain of that utterly extinct tongue.\nPoubelle. That’s what the children named their moggie. A lovely word to certain ears, and descriptive too.\n“Poubelle” meant “trash can.”\nFor six thousand days, one Venerable human lived in the rarest moggie heaven. A massaging bed dominated her spacious warm room. She had toys and tutors, libraries, and a full wardrobe. Her daily clothes included clumsy, brightly colored costumes worn without complaint. But she was allowed to dress herself too. Like tonight. For her own fine reasons, she had put on trousers and slippers and a tight-fitting red shirt. Talking dolls and mathematical puzzles begged to be played with. She ignored them. With her Family scattered, she stood alone, waiting impatiently beside one of the home’s minor portals. An ear that had been called “jolie” was pressed against what wasn’t a true door. Muted sounds drifted in from the outdoors. Animal wails, animal singing, and once, in the distance, a feral moggie cursing some grave injustice.\nNone of those noises mattered. What she wanted arrived with a sudden stillness, the nearby world abruptly closing its many mouths.\nOf course it might not be Him. After all, the world was full of dangerous souls, and the moggie had learned how to swallow her hopes.\nBut the silence ended with a familiar voice, low in timbre, very close, using a language so much harsher than Old French. And after the final yip, he added, “Trash can.”\nOpening her purse, Poubelle checked on her money and the little revolver, then pulled the long knife from the hilt riding her belt.\nA convincing smile filled that pretty teenage face. Then came the plea, “I want to be outside. And I promise, promise to be very, very careful.”\nEveryone heard her. Nobody reacted.\n“Please please please,” she kept calling out.\nYet nothing happened. As expected. Brandishing the knife, she began to strike what wasn’t a door and would never show damage. But futile gestures helped to remind others that she was feral-born, and when frantic, she was likely to harm herself with that nickel-steel blade.\nThe children spoke among themselves. These were Perpetuals, and Poubelle would never learn more than a few words of their dense, thoroughly contrived language. But her smiles and piercing screams had their own meaning. Those young gods couldn’t ignore the caterwauling, and that’s why an older child known as Fret made a special trip to open the portal for silly Poubelle.\nA long grove of Haumea walnuts filled that portion of the yard, and in the shadows, standing tall, was a wild reynard.\n“Here I am,” he called out.\nIn the shrill tongue of great predators.\n2\nPerpetuals were the rarest people. Born rich and immortal, they came into life bearing lofty, ridiculously intricate names. The lucky few were able to choose shorthand designations. Brief, crisp, perfect. But most of the common names came out of random nonsense. Like a certain child who complains about dangers nobody else can see—mortal hazards that don’t exist today and likely never will. Barely more than a baby, the girl relentlessly bombarded her Family with outlandish scenarios, even when older siblings teased her for being ridiculous. Then one day, an exasperated grand-great-mother said, “Oh my, you’re such a fret, Fret.” A single offhand remark, but that proved to be a decisive moment, and that’s why the girl was called Fret today and might be for the next one hundred billion years.\nSome children rebelled against their labels.\nNot this one. Not only did she accept the syllable, but Fret embraced her role as the Family’s official pessimist. Just a few hundred years old, half-grown, and knowing nothing but joy and enlightenment, Fret continued to conjure up despairs enthusiastically shared with everyone she loved.\n“Define these mortal hazards,” her siblings demanded.\nWith many of the adults listening on the sly.\n“What are you so afraid of, Fret?”\nClear, easy-to-refute scenarios should be avoided. That’s what the girl learned early on. And to always project confidence while dispensing her warnings.\n“Our enemies are gathering,” she might say. “Right now, over the horizon, they’re plotting against the Family. Against me.”\n“But there aren’t any horizons,” the littlest babies complained. “We see everywhere and everyone. Always and forever.”\nOf course adults and the older children knew what she meant. “The horizon” was an expression, and even the most formidable eye had limitations.\nSomeone always attacked Fret with old logic and happy numbers.\n“So how old is our world?” they asked.\nA precise birthdate existed. “Twenty million years and an afternoon,” was the girl’s sarcastic answer.\n“And how long have we been in this world?”\n“Twenty million years, minus a few mornings.”\n“And who are ‘we?’”\n“Humanity.”\n“And here, just in this one new world . . . how many human species peacefully coexist?”\nThere was a precise count, but it was more important to irritate her audience. “Just two of us,” Fret said. “The mortals, and us.”\nPerpetuals didn’t like the word, “Mortal.” In the wrong circumstance, they were just as mortal as anyone else. “Venerables’’ was the title given to that multitude of human-based species sporting wet brains and brief life spans. Trillions of them shared this world and the rest of the solar system with a few million bioceramic minds. They were the ageless, durable Perpetuals . . . except of course none of them, not even the Father of All, was truly and forever invincible.\nSay what you want about Fret’s ravings, the girl told gripping stories packed with rich details and just enough plausibility. “The status quo only looks strong,” she often claimed. Then she would imagine prophets or new human species who would unite the Venerables. Or she’d describe some minor injustice that would create a chaotic mob, and that mob would attack them with plasma torches and fission bombs. And worst of all? The Venerables would drag this smug Family out of their mansion, then strip them of their ridiculous wealth.\nApocalyptic stories were fun to hear and fun to dismiss.\nAnd Fret’s motives always deserved to be attacked.\n“You don’t believe your own words,” she was told. “This is nothing but fun for you. This is your favorite game. Isn’t that right, little one?”\nMaybe yes, maybe no. But Fret’s beliefs belonged to her, and she insisted on keeping them secret.\nOn the best days, a frustrated grand-great would come forward, unveiling the latest society model and n-dimensional forecasts. “See? We are loved. You are safe. So shut up please, darling.” This kind of information was normally kept away from children, and it was fascinating stuff. Tax policies. Bribe policies. Welfare rivers, plus advertising campaigns. With comprehensive tallies of the solar system’s resources, present and future, proving that trillions more Venerables could live well enough, with a billion Perpetuals overseeing this very disciplined chaos.\n“As long as there is a Creation,” said those self-assured voices, “this is where we will stand.”\n“And when does the Creation end?” Fret asked.\n“A trillion days from today,” was one stubborn answer.\nNo doubt about it, elaborate plans were at work. The human colonists—both varieties—had cobbled together a civilization leaning hard on caste systems and the proven rules of ecology. And the foundation beneath everything? Confidence. Every adult confidently assured her that the plan was proven and perfect. Doubt was nothing but a childhood disease, and that’s why the girl couldn’t sleep happily through the night. Believe it or not, she would grow out of this affliction, living a happy life that would end just short of Forever.\n“I don’t believe you,” Fret often said.\n“So prove us wrong,” they said.\nThere were many reasons worth mentioning. Important points of concern and lesser troubles that kept changing rank from day to day. But good ideas didn’t matter to entities far older than one baby girl. And while the girl realized that she didn’t know everything, she also remembered that when set against a universe rich with knowledge and experience, these smug adults knew just a little more than she did.\nThat’s what terrified Fret most of all.\n“Cling to whatever nightmare you want,” the others told her. “But that doesn’t diminish what is real.”\n“Agreed,” said the fearful child.\nLetting them see her tremble.\n3\n“There you are,” Trash can called out.\nA security shimmer clung to the girl, and then she pulled free. Except there was no leaving the mansion behind. Where the Perpetuals lived, surfaces and pets were scrubbed to a micro-sterile level. What the girl carried was the distinct odor of nothing—empty hair, sanitary breath, and ass scrubbed clean by eager machines. There was also the question of her health, which was considerable and peculiarly attractive. The reynard always suffered a stubborn longing for this creature . . . urges a little sexual and more than a little parental . . . and which of those instincts was worst . . . ?\nMoggies were ancestral enough to pass for an Earthly human.\nWhile the reynard was something else entirely.\nUsing the City’s ruling dialect, he called her, “Trash can.”\n“My reynard,” she replied, in his language.\nOffering the most human piece of himself, his right hand claimed her little hand, shaking it vigorously—a politeness taught to her when they first met, and now a tradition that always made her grin and laugh.\nShe was a predictable ape, and he would never stop appreciating that.\n“Where tonight?” was her standard first question.\nGenuine nights didn’t exist for this world.\n“Hunting, then different fun,” he promised.\nBut first, they had to escape the heirloom trees. The reynard despised the darkness under these massive branches and the hard black nuts rumored to be delicious but not belonging to him. The City beyond was his home, his garden. Leading her past the last demon wall, they emerged into a vibrant, fabulous landscape—plastic buildings and glass needles pushing high, while a trillion kilometers of catacombs lay underfoot. By day, the dwarf sun was a faint smear of heat encased inside solar collectors and flare collectors. But the sun had just set, ten billion bright windows helping to light the scene, helped along by advertisements targeting the vulnerable and spotlights deployed by public police and private militias. Except nobody dared to try selling insurance to the reynard, or to question his movements, or in any way risk his anger. That’s because he was a considerably important human. Not a thousandth as powerful as any Perpetual, but still an authentic lord marching with purpose through this gorgeous pasture.\n“Hunting” was exactly what it always had been. The prey were small, cautious bodies left vulnerable between hiding places. Chasing them was Trash can’s joy, and she was rather good at it. Hard shouts and slashing gestures with her toy knife were enough to scare most victims. Like tonight. A mated pair of hamish gophers panicked, running exactly where they were expected to run, into a sub-ground runway, straight at the other half of this effective team.\nThe reynard didn’t need knives or noise. His famous face is his weapon, delivering a reputation built over the years. Yes, these little souls could turn and run away again, and one of them might escape. But that left the spouse to suffer untold miseries, and they were a loving couple. Neither would abandon the mate, and seeing the reynard, they accepted their shared doom.\n“Stop,” he said.\nInstantly, yes.\n“Kneel.”\nTo the pavement, knees, and pursed lips too.\n“And beg for your next breaths.”\nNot that they were physically endangered. Reynards were capable of murder, but nobody this small could ever be in mortal danger. Harassments. That’s what the gophers were afraid of. Legal maneuvers. Evil gossip wrapped in the worst kinds of truth. Those were the looming fates, and their enthusiastic begging was well underway when Trash can grabbed them from behind, shaking their little necks.\nA few moments later, two hunters emerged from the runway with the single key to a well-stocked locker. Common foods and sweetened water became a dinner enjoyed by the moggie, tolerated by the reynard, and then after marking the locker’s corners with their fragrant urine, they took a capcar to the next adventure.\nThe girl’s favorite club was popular with raptors, reynards, and other high carnivores. A few moggies were allowed to watch the fun from the back hallways, but only one moggie was welcomed on the dance floor. Bottled aviaries sang tunes that would be old next week, forgotten next month, then rediscovered in ten or fifty years.\nOne splendid raptor guided Trash can across the dance floor, his ceremonial wings spread wide, leaving the reynard free to move where he needed to be, taking care of various bits of business.\n“Success never ends,” the great proverb warns. And it was well worth adding, “Only the fool takes these words as a comfort.”\nThe tiny newborn sun was on the other side of the world when his moggie came off the dance floor to find him.\n“I’m tired,” she announced.\n“And thirsty,” he guessed.\n“Somewhere quiet,” she said.\nHe named an even more exclusive business where pure water was mixed with a multitude of joyful drugs.\n“Yes,” she said.\nHe said, “This way.”\nThey left through a lesser doorway, emerging on a street that she had never walked before. Yet there was nothing but confidence in her stride. The late-hour wilderness stood around them, never quiet but plainly resting. Two hundred million sentient residents lived in this corner of the First World: Prey and predators, thoughtful AIs and idiot machines. And there was also one towering structure filled with Perpetuals. Which, from the reynard’s point of view, was one tower too many.\nIf only scaring the gods was as easy as scaring a couple gophers.\nWishes and success. When hasn’t life been defined by those two measures?\nWalking behind the moggie, the reynard used French.\n“Poubelle.”\nShe turned, taking a backward step before stopping entirely. Then in that extinct, half-lovely language, she asked, “Vous connaissez Francais?”\nHe knew her language better than she spoke his, yes.\nNow the reynard whispered more words, but not in French.\n“I have her, right here, in my sights.”\nThe girl smiled, stubbornly ignoring what she heard and the obvious dark tone.\n“I’ll take the moggie now,” he said.\nHer smile vanished. From her purse, that little predator pulled out a savage pretend gun. A gift from the gods, supplied more for their comfort than as a precaution . . . and the poor girl didn’t even suspect that her weapon had been disabled.\nThe reynard said nothing.\n“What are you doing?” she asked. In both of their languages.\nFor the first time, the reynard placed his less-human hand against her shoulder, and he pressed down until he had proved just how strong he was and how weak she would always be.\n4\nPoubelle didn’t come home by morning.\nFret was the first to worry, which was entirely reasonable. Better than her siblings, she appreciated those archaic curves and holes, including that mostly lovely, sometimes overly loud voice. But most of all, Fret had opened the portal, letting the girl run wild in a world full of teeth and rage.\n“We need to find her,” she declared.\nThe house AIs reworked that appeal, subtracting Fret from the solution. “We’ll look for our moggie.”\n“My moggie,” she said.\nA statement wisely left unchallenged. Drones and smart flies were tossed into the atmosphere. A trillion public conversations, recorded as a matter of habit, reconstructed portions of the girl’s final evening. The last sighting? On an obscure public street, the reynard grabbing Poubelle against her will . . . and with that, the Family’s high eyes reached across the First World. But with strict limitations in place. The landscape in question was unwelcoming and shrouded in ancient laws. Yes, inconveniences like that could be set aside, but only if an adult Perpetual saw important or convenient reasons. The AIs refused to make any request involving “our moggie.” Indeed, a final, far more critical issue had to be addressed.\n“We’re certain you know this. But by the Codes of Self-awareness, Poubelle is considered to be an emancipated adult.”\nFret was studying multiple rivers of data, but she had cognitive resources to hear the insult riding inside that flat statement.\n“On the other hand, you aren’t grown up,” the machines were reminding her. “Thus, your freedoms don’t match the moggie’s freedoms.”\nFret closed her eyes.\n“That reynard,” she said. “He knows where Poubelle is.”\n“We cannot find him,” the AIs warned.\n“Look deeper.”\n“There is no ‘deeper,’ Fret. We’re at our limits here.”\n“But Poubelle is in trouble.”\n“You’re talking about a sentient organism with inalienable rights, and we must respect those rights. We know you don’t want to hear this—”\n“Don’t say it.”\n“Little Miss Trash can is an emancipated citizen of the world.”\n“Except she lives here.”\n“Except when she leaves us. Which is almost every evening, as of late.”\n“She’s my moggie,” Fret insisted.\nThe machines responded with a unified chorus. “First, let’s mention how slavery is not permitted. Legally speaking, our household has graciously supplied refuge to a helpless orphan, and each of us should be commended for enduring her shit and her singing. But she’s mature now. Emancipated. According to every court, she can do whatever she wants to do, with whomever she chooses.”\n“She’s inside a deep hole. Hurt.”\n“Possibly yes, but as a consequence of entirely free actions. And in this scenario, you have no responsibilities.”\nFret had stopped asking an army of sensors for more data. She had found what she needed, and her next step was to tell the house, “All right. I’ll stop worrying about my missing friend.”\nThe house had to recognize the lie. But then again, Fret didn’t need to be believed. She was the clear master in this relationship, free to tell any lie before doing exactly what she wanted to do.\nSlipping into another portion of the house, she closed portal tubes and security shimmers before assembling what she needed. First, a collection of intriguing gifts that would prove tempting to reynards and other crime bosses. And second, she designed a sophisticated hull with enough room inside to hold the soul of one mostly grown-up Perpetual.\nBold actions always made Fret happy, particularly when she knew that she was right.\nPoubelle’s portal gave way with a touch. Would anyone care enough to try and stop her? She hoped so. In one elaborate daydream, Fret’s immediate parents stood in her path, listing the ways she was sentimental and ridiculous, and then she lectured them about how evil they were, living among all of these impoverished, badly ignored cousins.\nBut nobody took the trouble to intervene.\nFret found herself outdoors, standing motionless in the shade of walnut trees—a grove built to thrive in this half-G gravity and the deep, rigorously terraformed atmosphere. Behind her, the great house was a column of premium hyperfiber bathed in soft white light, its foundation reaching into a mantle still being born, while its roof punched through the atmosphere’s diamond ceiling.\nWhenever she left home, Fret felt extra alive. She had no reason to be afraid; the law and her own invincibility always kept her safe. But then again, that’s why the moggie amazed her so much. A corporeal little girl like that, small and weak in every dimension, yet when night came, Poubelle could become frantic, desperate to escape from the safest realm in existence.\n“How could I ever be so brave?” Fret asked the final tree.\nThen one more step was taken, and to every eye she looked like another pretty and very young little moggie.\n5\nAnother window had been pushed open, but instead of offering a yard full of walnut trees, this window left the galaxy within humanity’s reach.\nThe Great Ship made that possible. Millions of years ago, Fret’s ancestors discovered a world-sized starship, abandoned and free for the taking. Every intelligent species was welcome to ride inside the Ship’s luxurious quarters. All they had to do was surrender wealth, knowledge, and maybe a few empty worlds. With one stroke of good fortune, humanity found herself in a golden age. Yet just a thousand centuries later, with no warning whatsoever, the Great Ship was stolen and then taken out of the galaxy, accelerating toward the Virgo Cluster.\nThat one fine window had been slammed shut.\nYet humanity continued to thrive. Rich colony worlds built new starships that followed the galaxy’s spiral arms. Empty worlds and difficult worlds were claimed and terraformed, and once those places filled up, subsequent generations went out searching for fresh challenges. Some colonies failed quickly. Other settlements died over the aeons. But there were spectacular successes, enough to make the Milky Way into a human paradise, and that was true even when the Great Ship had become little more than legend.\nOne unusually ambitious boy was born in a crowded world.\nHe had an intricate long name and a childhood nickname, but at some point he began to call himself, “The Father of All.”\n“I want a solar system of my own,” he said.\nIn that, not an uncommon dream.\n“No, this isn’t fantasy. I have a plan.” Then he would explain portions of his plan, offering just enough to make most people laugh at him or simply walk away.\nBut a few of his peers said, “Yes, why not?”\nWhy not? Because The Father of All was an impoverished nobody among the immortals. And his followers were the same, or worse. Between them, they couldn’t afford a third-hand tug, much less the necessary machinery to terraform one home out of a dead bolide. But there were thriving Venerable communities on several nearby worlds. These were humans who refused bioceramic brains and immortality, who lived for two or three busy centuries and then happily fell into an old age defined by dignity and celebration. In addition, the Venerables had inventive habits and frugal natures, and because of that, they not only could afford a suitable starship, they could equip it with the tools necessary to rebuild dozens of worlds.\nThat’s where the Father found his funding. An empty solar system was identified, a substantial comet was encased in hyperfiber and rockets, and then adventurous Venerables took their aging bodies into liquid argon baths, expecting to be awakened on the new home, perhaps in just another thousand years.\nAnd that’s how one man’s dream became real.\nWith a crew of loyal followers, The Father of All aimed for the proposed colony worlds. But he kept moving. The populated heart of the galaxy was abandoned. The Father aimed at a thread of dust and star grit that had only just begun to collapse on itself. A weather forecast. That’s what guided him. Measuring the push of radiation and the tug of gravity, he could drift into this very empty place, waiting with a patience found only with the most gifted or most crazed souls.\nFor the sake of their health, the Venerables were eventually brought out of hibernation, and when told about the ultimate plan, they screamed.\nBut what could be done?\nThey went back into the frigid argon, and they were awakened again, allowed to breathe and scream before surrendering to the situation all over again.\nBy and large, Venerables are talented at facing ugly inevitables.\nBesides, the immortal asshole kept promising to honor their agreement.\nTwenty thousand centuries had to pass before a suitable solar system was born. By then, the Great Ship had vanished between the galaxies, never to return. Humanity was an infestation still racing across the Milky Way. And one self-named human set himself up as a king and god and ultimate father, overseeing an empire that consumed the terrestrial baby worlds, then every other planet and moon and shard of ice orbiting around an M-class sun that burned softly, ready to endure for another hundred billion years.\n6\nThe girl stood in line like every hopeful moggie. Dressed for dancing, armed with a pistol and two hypodermic crossbows, she was pretending patience while waiting for her chance to step inside.\nThe club’s manager was an old raptor long-retired from hard work. This job was a plum given to someone who had proven to be loyal and trustworthy, and she didn’t welcome uninvited hazards waiting at her door.\nShe woke the reynard with the news.\nHe sat up, stood up. Dressed. Looked at the feeds.\n“Which god is it?” she asked.\nHe offered a piece of the whole name, then said, “Fret.”\n“Just as you predicted,” she said.\nAnd he responded by reminding her, “I’ve made a lot of forecasts here.”\nThey were half a kilometer below the club, inside a catacomb shielded by the best Venerable deceptions. Pounding the ashes out of a favorite pipe, the manager stuffed the bowl with fresh pleasures, lit the mess, and inhaled until the fire wanted to burn on its own. “I’m letting you play this out,” she said. “But if I see real trouble, then I’ll sure as hell—”\n“Warn the Council of Wolves. You promised me. Yeah, I know.”\nNo matter how important, reynards and raptors were just local predators. Larger, less patient packs were scattered from here to the edge of the solar system. Complicated politics. That’s what gave birth to human life, and all these millions of years only served to make everything into an always grander mess.\n“So,” said the manager. “Do I let her inside, or not?”\n“Not.”\n“Thank you,” she said.\nThen after a few calming puffs, she added, “There’s a key inside that purse of hers. What do you think is inside the matching locker?”\n“Coaxings. Fine little gifts for us to give back to her little pet. No doubt.”\n“No doubt.”\nWatching his victim, the reynard thought, “My god, she is a beauty.”\n“Are you taking her bribes?”\n“Everything, and then I’ll give them to you. Off the books.”\n“Well,” the old lady said. “That’s gracious of you.”\nThe reynard found his shoes and started for the door.\n“I can’t help but notice,” she said. “What you want with this foolish Perpetual . . . it’s never been explained to me . . . ”\nPausing, he turned around to offer a bold little smile.\n“Opportunities. Openings. Possibilities that I never dared to wish for,” he said. “That’s why I stuffed the baby inside the dumpster to start with.”\n7\nFret never imagined that this experience could be so ridiculously fun. As another hopeful partier standing in the drippy beginnings of a long fierce rain, she was surrounded by rough conversations and busy brief lives that never stopped spinning around the essence of life: Love, Food, Shelter, Worth. There weren’t any lessons to be learned. Nothing she witnessed changed what she knew or assumed on any other day. But the scene was rich with details that kept revealing themselves with every hard stare and nuanced analysis. The young man standing beside her, for instance. He had come walking back along the line, begging for space. That round fat-rich face and the scent of his pearl-colored skin marked him as an immigrant from the ice realms of the Outer Reaches. His voice had obvious troubles with the local dialects too. So yes, of course Fret stepped a little ways forward, offering him a slice of the pavement that she had defended all evening now.\nThe boy had a story to tell, shorn of detail but blessed with enthusiasm. Grateful for this audience, he began to fall in love with the moggie stranger, and even though it was a little cruel, Fret led him on.\n“I’d love to visit your home world,” she said.\n“I would take you, if I had the money,” he said. “But there isn’t enough left to get me anywhere anymore.”\n“I’m the same,” she said.\n“Too bad,” he said, trying to laugh away his hopes.\n“But you’re happy enough here,” she added.\n“This moment I am. Yeah, sure.”\nShe laughed at that quite a lot, including his painfully obvious manner.\nThen fresh motions caught her attention, and when her eyes were abandoning him, the boy grew worried.\n“I bet you don’t know where I grew up,” he said.\nFret said, “You already told me.”\n“No. I mean who adopted me and cared for me until I was grown.”\nMaybe this would become a worthwhile topic. But a familiar profile had just emerged from the club, apparently for no reason but to hurry out of sight. Was it the reynard? An array of sensors promised that her guess, her hope, was correct. The brute who came to the house last night had reappeared, abandoning his day’s den for rain and distant thunder.\nInterrupting the storyteller, she said, “Sorry. I see someone who owes me quite a lot. I need to run.”\n“Oh, I’ll go with you,” he gamely volunteered.\n“No,” seemed too rude to be left on its own. So Fret handed over a chit of compressed capital. Not enough to buy the boy his own lightsail, but adequate for passage to any place beyond this wet little avenue.\nHer quarry was a locally famous predator, powerful in so many ways, but the reynard was being chased by an ageless, nearly indestructible creature.\n“I’ll begin with threats,” Fret told herself. “The Family attorneys, our local police. Collective suits filed on behalf of thousands of victims . . . oh, that would make his little life unbearable . . . ”\nThe reynard turned down another narrow street.\n“Hopefully, he’ll get angry enough to hit me.”\nHer moggie-shaped hull was full of tools, each capable of responding to threats with not-quite-fatal violence.\n“Then I’ll offer him a little something, out of pity, and when my girl’s returned to me, safe and wiser, I’ll cheat him on the ransom too.”\nBeautiful thoughts, swift and sweet. Though the most likely resolution remained that two parties would negotiate for a few moments, then gratefully move past this foolishness.\nAnother intersection, and the reynard paused. Fret expected him to glance over a shoulder, but he didn’t. That tall figure of meat and armor, spun boron and servomotors, pretended to be a statue until she stopped too. Then he was running, breaking into a hard sprint, scrambling up one plastic wall to make the next sharp turn, then surging to even higher speeds.\nFret’s best run was barely fast enough to catch up. Two more turns, two more tiny roadways, then they were back on a wide avenue full of Venerables. Fragile bodies were shouting and scattering, and that’s when the girl went airborne, up high and then slamming the reynard to the ground, pinning the mechanical arm while laughing at his face, getting in position to drive the other knee against the heaving chest.\n“Give her back to me,” she said.\nHigh overhead, that carefully terraformed atmosphere had been generating bolts of lightning. Not huge discharges, but intercepted by steel spikes scattered across the City, then channeled and compressed inside an industrial capacitor. And now a wicked portion of that power burped free—a white-hot blast fierce enough to disable Fret’s hull while flinging her through the nearest window.\nTwo seconds passed before her security systems came back online.\n“Now I’ll make you pay.”\nThat’s what Fret meant to say. But someone else had just stepped from the darkest corner of this otherwise empty room. Poubelle. And brandishing the controller, the wicked little moggie pushed the big fire-colored button for a second time. Just to prove that the first strike wasn’t a fluke.\nThe next burst was ten times worse.\nFret’s hull was quite dead.\nAnd the reynard was kneeling beside her. Smiling. Speaking. In the Perpetuals’ dense language, he said, “I agree with you, Fret. Oh, I do. The Family should be terrified. But it won’t be a new species of human coming for your siblings and those sweet grand-greats. And it won’t be a Venerable prophet, and our idiot hatred won’t matter in the end. No, this is who is utterly dangerous, and utterly magnificent.”\nWith that, he picked up her dead hand, straightening one finger.\nWhich he pointed at the girl lying helpless on the filthy, wonderful world.\n8\nWelcome news arrived with the morning, and the household began to celebrate. Most of the children pushed aside games and deep immersions, or they left their AI teachers in mid-lecture, racing to the ground-level floor and a certain large space that was already decorating itself for the party. This was going to be a marvelous day. After a string of what must have been astonishing adventures, their hero was returning home. At last. Missing for twenty days, given up on by almost everyone, and that’s why even the younger adults came to watch, standing at the back of the happy room, smiling as much as anyone.\nA treasured piece of the Family stepped through the demon walls and into the walnut grove, and reaching the portal, she began to knock and kick, calling out, “Je suis désolé.”\nBut the portal wouldn’t open. A few small disasters had triggered more paranoid levels of security, and none of the celebrants had permission to overrule anything. Pleas were sent upstairs. Nobody responded. Young children turned to the adults, several suggesting that The Father of All might willingly intercede.\n“You call out to him,” one mother joked.\nNervous giggles dissolved into a final silence.\nThen one courageous boy reached for the portal. Expecting nothing else, he let the booby trap remove his hand, and then picking the hand off the floor, he pressed it against his fresh stump while once more begging for someone’s decency.\nAnd all that while, the girl standing under the walnuts repeated, “Je suis désolé.”\n“I’m sorry,” she was saying with that precious French. “I’m sorry. I’m sorry. I’m sorry.”\nAt last, one of grand-great-mothers arrived. She was a tall confident beauty and an avid traveler who had visited every important world in the solar system, meeting every Perpetual worth the effort. She was also a genius when it came to dispensing nicknames for the Family. Rumors claimed that she was The Father’s favorite, and it was worth noting that at some point in life, everybody wished they could be her, if only for a day.\nThe ancient woman stepped up to the portal, two fingers and a coded signal causing it to unseal and slowly pull open.\nThat was when the children looked at each other, taking inventory.\n“Where’s Fret?” they wanted to know.\n“Still hiding in her room, licking her little wounds,” others said.\nThe harshest, richest kinds of laughter filled the room as the lost girl returned to them. But Poubelle didn’t come alone. The tight trousers worn when she left were even tighter now, a baby moggie riding above her hips.\n“It’s a girl,” she said, answering the question before it was asked.\n“And her father’s a beautiful boy from the Outer Reaches,” she added.\nThen with her own marvelous confidence, Poubelle declared, “My daughter will be the second generation in a long line of pretty pet moggies.”\nA moment of prophecy that would prove true. For one hundred and six centuries, this girl’s descendants smiled when they were happy, wore the funny pretty silly costumes when required, and on the day when the Family finally turned against each other, they pretended to be surprised.\nThey pretended to be sorry.\nBut always making ready for the next spectacular new world.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "source": "https://clarkesworldmagazine.com/reed_06_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Poubelle by Robert Reed"}