{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "wrwKOuDD3lmLdvh4Wv9jsqAy2rE=", "id": null, "license": null, "comments": "", "raw_text": "Interview  A Whole New Wonderful Nightmare: A Conversation with Sam J. Miller  When Sam J. Miller was in preschool, they asked him what he wanted to be when he grew up. He said, “Tyrannosaurus rex.”  Miller was born in Hudson, NY, and he escaped when he was eighteen. Trained to be a butcher, the family shop went under; Walmart took over the town. Miller went to Rutgers University, studied cinema studies and Russian language and literature, and perhaps more importantly, met his future husband. He also converted to vegetarianism.  Sam J. Miller’s very first published story came out in 1997, in a local anthology called Out of the Catskills. From 1997 to 2008 he was getting published steadily, “usually in tiny zines no one ever read or magazines that folded immediately upon publishing my stuff or websites that crashed and burned. Or gay erotica anthologies.”  In 2012, Miller attended the Clarion Science Fiction and Fantasy Writers’ Workshop. Immediately after, his work began to consistently appear in notable venues. 2013 publications included “The Beasts We Want to Be” in Electric Velocipede, “Sabi, Wabi, Aware, Yugen” in Daily Science Fiction, and Shirley Jackson Award-winner “57 Reasons for the Slate Quarry Suicides” in Lightspeed.  His name continued to land on awards lists. Miller was a Sturgeon and Nebula awards finalist for “We Are the Cloud” (Lightspeed, 2014), a World Fantasy Award finalist for “The Heat of Us: Notes Toward an Oral History” (Uncanny, 2015), a Shirley Jackson Award nominee for “Angel, Monster, Man” (Nightmare, 2016), a Sturgeon, Shirley Jackson, and Nebula Awards finalist for “Things with Beards” (Clarkesworld, 2016). Most recently, “Let All the Children Boogie,” posted at Tor.com, was a 2021 Nebula finalist. “It’s about a bunch of my usual obsessions—queer teenage love and mysterious late night radio broadcasts and maybe time-traveling superintelligences? But mostly it’s about David Bowie and Iggy Pop’s ‘The Passenger,’ and the lonesome magic way music can break you out of the bubble of your body.”  All four of Sam J. Miller’s books landed on the Locus Awards Recommended Reading lists. Debut novel, The Art of Starving, came out in 2017 with HarperTeen. Tapping into his own experiences with an eating disorder, he delivered a powerful narrative that resonated with many readers. The book was a Crawford and Lodestar finalist and won an Andre Norton Award. Blackfish City was published by HarperCollins imprint Ecco in 2018, earning a Nebula Award nomination and winning a John W. Campbell Memorial Award.  Miller brought his love of dinosaurs into novel Destroy All Monsters, published by HarperTeen in 2019 to positive reviews. In his 2020 novel The Blade Between, published by Ecco, he revisited his childhood home of Hudson. “It’s a great microcosm for America as a whole because it’s full of good people who do bad things, and vice versa, and all the racism and homophobia and toxic masculinity that are so essential to understanding the fucked-up American moment we currently find ourselves in are on full display in Hudson.”  Miller is known as an outspoken activist and community organizer. “When I’m not trying to smash the system via somewhat-subversive stories, I’m trying to smash the system by organizing poor people to fight collectively for social justice. I spent fifteen years as a community organizer at Picture the Homeless, where I played a part in organizing billions of amazing protests and events, helped win over one hundred and twenty policy and legislative victories, and I coordinated the writing of a major report that was required reading in urban planning courses at Columbia University—and was banned in New York State prisons.”  Sam J. Miller’s debut collection is Boys, Beasts & Men, just out (June, 2022) from Tachyon Publications.   What were the books, stories, or authors that were important to you when you first started getting into genre fiction, and do you see their influence in the things that you write?  I think of Ray Bradbury and Octavia Butler as my science fiction mom and dad, they’re the ones who got me most excited about the possibilities of the genre, and the ones that I see on the page the most to this day. Bradbury showed me all the ways the world can be wonderful and gave me that sense of excitement and poetry that I still try to carry forward. And Octavia Butler showed me all the ways the world can be terrible, and the ways that people can fight back, and how science fiction can be a form of activism.  You’ve been writing and publishing since roughly 2003, but you really hit the scene in 2013. You’ve been publishing short fiction consistently since then. You’ve also been publishing books consistently since your 2017 debut, The Art of Starving. You’ve had a book come out every year except for 2021. What does it take to stay in the game and to sustain a career?  Listen, I’m not saying you have to have a bottomless hole of insecurity and loneliness and an undying thirst for attention and external validation to make it as a writer, but in my case, it sure did help! I think above all you have to really love the act of fiction, as a reader and as a writer, and you have to be committed to doing it no matter what happens. That includes rejection, failure, difficulty . . . but it also includes the ups as well as the downs. You might have a great year—or two—or five—but everything ebbs and flows, and you’re never done, you never feel like, Okay, I’m good, I’ve achieved everything I need to achieve, and I can take a break. At least, I don’t.  Are there important differences in the way you approach writing novels compared to the way you approach shorter work?  No, they both tend to spring up like mystery seeds that got planted in the soil of my brain . . . and I’ll spend a day or a week or a decade tending to it, watering it, watching it wither, watching it thrive, forgetting about it, obsessing over it, before I can figure out what it will be. The orcamancer from Blackfish City showed up one day in my head, and I spent a long time thinking she wanted to be a short story, before it was clear to me her story was so big it needed a novel.  For me, your work usually combines intriguing characters who are grounded—who feel real—with interesting ideas, plus a compelling problem. It’s a lot to manage, but you pull it off seamlessly, delivering consistently great fiction. What is the key to effectively pulling all these elements together?  Awwww, thank you so much for saying so! Ultimately, I like a challenge. I love to set myself ambitious goals for weird big complicated little stories that try to do a lot. Sometimes I think I am successful, and I pulled it all off. Sometimes I think I was . . . less so. But that’s a subjective perspective, and there have definitely been stories of mine that I personally felt were less strong—but got a great response—and others that I was more proud of and didn’t get much attention—so at the end of the day we’re all just readers, with blind spots and biases and triggers, so I take comfort in the total absence of objective standards of artistic merit.  Right out the gate you won a Shirley Jackson Award for “57 Reasons for the Slate Quarry Suicides,” and you’ve been on awards ballots and mentions ever since. Do awards and acclaim have an impact on your writing or process?  I wish I was strong enough to not need them, or to say, “awards don’t matter,” but . . . yeah, it goes back to the bottomless hole of insecurity and self-doubt and need for external validation, lol. Writing can feel so lonely. Any form of recognition just reminds me that someone somewhere connected with my work, and that’s so rare and special.  What was “breaking in” like for you, and how did it happen? At what point did you feel like you had broken in?  “Breaking in” is actually a very apt euphemism here, because it truly did feel like intruding upon a space that wasn’t necessarily meant for me. Even though I had always loved the work of queer speculative authors like Samuel Delany and Tom Disch, I didn’t see a ton of queer stuff getting published and celebrated, and I definitely spent a long time shopping around queer SFF novels nobody wanted. There were so many milestones along the way, however, and every tiny zine publication or rejection-with-comments from a major outlet felt important and transformative. Honestly, I’d say it wasn’t until I won the Nebula Award for The Art of Starving that I felt like I could chill a tiny bit. But that only lasted a week or so.  Your debut collection, Boys, Beasts & Men, goes all the way back to 2013 publications, such as “The Beasts We Want to Be” and “57 Reasons for the Slate Quarry Suicides,” but also offers newer pieces such as “Sun in an Empty Room.” Looking at this spectrum of work over the course of a decade, do you see specific ways in which your writing has changed?  My prime directive when it comes to writing short fiction is never to repeat myself, which means that over the twenty-five years since I first published a short story in a raggedy little local anthology, I have tried to set myself increasingly challenging goals, and push myself to attempt new and difficult things with my stories. So, there is definitely a bedrock of Me that’s resonant throughout these stories, but there’s also a shifting evolution in terms of what I can accomplish with tone and theme and framework and formal conceit and just generally trying to constantly make better use of the awesome tool kit that speculative fiction gives us all.  The collection features fourteen stories, which is just under half of the short fiction you have out. How were stories selected? Is there an organizational principle at work—is it a “best of” or do selections follow a theme?  The organizing principle in Boys, Beasts & Men is the age of the protagonist, going from the eight-year-old boy who narrates “Allosaurus Burgers” (the first story in the book) to the antique couch who narrates “Sun in an Empty Room” (the last). I definitely tried to include as many stories that seemed to resonate with readers as possible, but I also wanted to tell a unified story about how the world makes us monsters, so I omitted many stories that seemed less directly connected to that core theme.  What can you tell us about “Sun in an Empty Room”—without “spoiling” the read too much?  It’s my white whale, the thing I spent years and years trying to land. I wrote it in 2008, and it was rejected by ninety-nine literary and speculative journals. And it’s how I met the awesome Fran Wilde. I submitted it to Apex when she was a slush reader there, and she tried her best to get it published, but then-editor-in-chief Lynne M. Thomas wasn’t feeling it. But Fran sent me a super encouraging note (this was before I made my first pro sale and was really struggling, so encouraging words went a looooong way!), and we’re buddies to this day.  Lynne went on to cofound Uncanny Magazine and published my story “The Heat Of Us” (also included in Boys, Beasts & Men), and we’re buddies too, so . . . keep on going, even when it sucks, the pain of rejection can make you better, and sometimes the people who tell you No now will one day be your friends.  If readers looked at three stories in this book, what would you want them to be, and why?  Well, when I got the ARC I reread “Shucked” for the first time since submitting it to F&SF, and I was . . . kinda impressed? Whoever I was when I wrote it, he was pretty great. And I think “Things With Beards” might be the most me story I’ve written. Finally, there’s a framing story that incorporates every story in the book into one cohesive narrative (hopefully), and that’s made up of short vignettes before and after every story, and I think it’s pretty cool.  Which, for you, were the stories that were most challenging to write? What made them challenging, and how did you face those challenges?  Each story is a whole new wonderful nightmare. I can’t say that any of them were particularly easy to write, but, also, I enjoy the process so much that I’m hard-pressed to say they were difficult. Like it’s like playing a really hard really great video game—even when it’s kicking your ass, it’s still a ton of fun.  Looking at your career so far, are there themes and ideas in your fiction that you often come back to, that stand out as more important to you, or about which you feel passionate?  My work is always about how humans are amazing, and how they are terrible. How much great cool stuff we do, and how much atrocity. And how even really awesome people do really shitty things. These stories look at that through the lens of patriarchy, toxic masculinity, queerness, and complicity and resistance, which just never gets boring to me lol.  Is there anything else you’d like readers to know about this book?  That the incredible Amal El-Mohtar wrote the introduction! And it’s amazing! Seriously made me choke up when I read it. In 2014, when my short story “We Are the Cloud” (included in the collection) was published in Lightspeed, it got some super homophobic reviews, which suuuuuuuuucked—any LGBTQIA+ SFF writer can tell you that queering the genre means coming up against a whole lot of really vicious trolls—and Amal wrote the most beautiful review/defense of the story; that’s how I knew she’d be the perfect person to do the introduction.  Are there stories over the course of your career that you were especially happy with, that you felt very strongly about, but that, for whatever reasons, just didn’t get noticed the way other pieces did?  TONS!! It’s a constant source of puzzlement, what hits and what doesn’t. What factors go into that. But then again, you never know—life is long, and things have a way of coming and going, including stories. I thought my Tor.com story “The Future of Hunger in the Age of Programmable Matter” kinda sank like a stone, but then it got included in a Japanese anthology of the world’s best science fiction shorts from the 2010s, so . . . you never know. And you gotta just keep going.  What else are you working on now, and what do you have coming up that you can tell us about?  My pandemic project was to teach myself programming so I could make a video game. That’s coming along nicely—it’s a very queer RPG. And I am hard at work on a new novel. And short stories. All the things, really. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nA Whole New Wonderful Nightmare: A Conversation with Sam J. Miller\nWhen Sam J. Miller was in preschool, they asked him what he wanted to be when he grew up. He said, “Tyrannosaurus rex.”\nMiller was born in Hudson, NY, and he escaped when he was eighteen. Trained to be a butcher, the family shop went under; Walmart took over the town. Miller went to Rutgers University, studied cinema studies and Russian language and literature, and perhaps more importantly, met his future husband. He also converted to vegetarianism.\nSam J. Miller’s very first published story came out in 1997, in a local anthology called Out of the Catskills. From 1997 to 2008 he was getting published steadily, “usually in tiny zines no one ever read or magazines that folded immediately upon publishing my stuff or websites that crashed and burned. Or gay erotica anthologies.”\nIn 2012, Miller attended the Clarion Science Fiction and Fantasy Writers’ Workshop. Immediately after, his work began to consistently appear in notable venues. 2013 publications included “The Beasts We Want to Be” in Electric Velocipede, “Sabi, Wabi, Aware, Yugen” in Daily Science Fiction, and Shirley Jackson Award-winner “57 Reasons for the Slate Quarry Suicides” in Lightspeed.\nHis name continued to land on awards lists. Miller was a Sturgeon and Nebula awards finalist for “We Are the Cloud” (Lightspeed, 2014), a World Fantasy Award finalist for “The Heat of Us: Notes Toward an Oral History” (Uncanny, 2015), a Shirley Jackson Award nominee for “Angel, Monster, Man” (Nightmare, 2016), a Sturgeon, Shirley Jackson, and Nebula Awards finalist for “Things with Beards” (Clarkesworld, 2016). Most recently, “Let All the Children Boogie,” posted at Tor.com, was a 2021 Nebula finalist. “It’s about a bunch of my usual obsessions—queer teenage love and mysterious late night radio broadcasts and maybe time-traveling superintelligences? But mostly it’s about David Bowie and Iggy Pop’s ‘The Passenger,’ and the lonesome magic way music can break you out of the bubble of your body.”\nAll four of Sam J. Miller’s books landed on the Locus Awards Recommended Reading lists. Debut novel, The Art of Starving, came out in 2017 with HarperTeen. Tapping into his own experiences with an eating disorder, he delivered a powerful narrative that resonated with many readers. The book was a Crawford and Lodestar finalist and won an Andre Norton Award. Blackfish City was published by HarperCollins imprint Ecco in 2018, earning a Nebula Award nomination and winning a John W. Campbell Memorial Award.\nMiller brought his love of dinosaurs into novel Destroy All Monsters, published by HarperTeen in 2019 to positive reviews. In his 2020 novel The Blade Between, published by Ecco, he revisited his childhood home of Hudson. “It’s a great microcosm for America as a whole because it’s full of good people who do bad things, and vice versa, and all the racism and homophobia and toxic masculinity that are so essential to understanding the fucked-up American moment we currently find ourselves in are on full display in Hudson.”\nMiller is known as an outspoken activist and community organizer. “When I’m not trying to smash the system via somewhat-subversive stories, I’m trying to smash the system by organizing poor people to fight collectively for social justice. I spent fifteen years as a community organizer at Picture the Homeless, where I played a part in organizing billions of amazing protests and events, helped win over one hundred and twenty policy and legislative victories, and I coordinated the writing of a major report that was required reading in urban planning courses at Columbia University—and was banned in New York State prisons.”\nSam J. Miller’s debut collection is Boys, Beasts & Men, just out (June, 2022) from Tachyon Publications.\nWhat were the books, stories, or authors that were important to you when you first started getting into genre fiction, and do you see their influence in the things that you write?\nI think of Ray Bradbury and Octavia Butler as my science fiction mom and dad, they’re the ones who got me most excited about the possibilities of the genre, and the ones that I see on the page the most to this day. Bradbury showed me all the ways the world can be wonderful and gave me that sense of excitement and poetry that I still try to carry forward. And Octavia Butler showed me all the ways the world can be terrible, and the ways that people can fight back, and how science fiction can be a form of activism.\nYou’ve been writing and publishing since roughly 2003, but you really hit the scene in 2013. You’ve been publishing short fiction consistently since then. You’ve also been publishing books consistently since your 2017 debut, The Art of Starving. You’ve had a book come out every year except for 2021. What does it take to stay in the game and to sustain a career?\nListen, I’m not saying you have to have a bottomless hole of insecurity and loneliness and an undying thirst for attention and external validation to make it as a writer, but in my case, it sure did help! I think above all you have to really love the act of fiction, as a reader and as a writer, and you have to be committed to doing it no matter what happens. That includes rejection, failure, difficulty . . . but it also includes the ups as well as the downs. You might have a great year—or two—or five—but everything ebbs and flows, and you’re never done, you never feel like, Okay, I’m good, I’ve achieved everything I need to achieve, and I can take a break. At least, I don’t.\nAre there important differences in the way you approach writing novels compared to the way you approach shorter work?\nNo, they both tend to spring up like mystery seeds that got planted in the soil of my brain . . . and I’ll spend a day or a week or a decade tending to it, watering it, watching it wither, watching it thrive, forgetting about it, obsessing over it, before I can figure out what it will be. The orcamancer from Blackfish City showed up one day in my head, and I spent a long time thinking she wanted to be a short story, before it was clear to me her story was so big it needed a novel.\nFor me, your work usually combines intriguing characters who are grounded—who feel real—with interesting ideas, plus a compelling problem. It’s a lot to manage, but you pull it off seamlessly, delivering consistently great fiction. What is the key to effectively pulling all these elements together?\nAwwww, thank you so much for saying so! Ultimately, I like a challenge. I love to set myself ambitious goals for weird big complicated little stories that try to do a lot. Sometimes I think I am successful, and I pulled it all off. Sometimes I think I was . . . less so. But that’s a subjective perspective, and there have definitely been stories of mine that I personally felt were less strong—but got a great response—and others that I was more proud of and didn’t get much attention—so at the end of the day we’re all just readers, with blind spots and biases and triggers, so I take comfort in the total absence of objective standards of artistic merit.\nRight out the gate you won a Shirley Jackson Award for “57 Reasons for the Slate Quarry Suicides,” and you’ve been on awards ballots and mentions ever since. Do awards and acclaim have an impact on your writing or process?\nI wish I was strong enough to not need them, or to say, “awards don’t matter,” but . . . yeah, it goes back to the bottomless hole of insecurity and self-doubt and need for external validation, lol. Writing can feel so lonely. Any form of recognition just reminds me that someone somewhere connected with my work, and that’s so rare and special.\nWhat was “breaking in” like for you, and how did it happen? At what point did you feel like you had broken in?\n“Breaking in” is actually a very apt euphemism here, because it truly did feel like intruding upon a space that wasn’t necessarily meant for me. Even though I had always loved the work of queer speculative authors like Samuel Delany and Tom Disch, I didn’t see a ton of queer stuff getting published and celebrated, and I definitely spent a long time shopping around queer SFF novels nobody wanted. There were so many milestones along the way, however, and every tiny zine publication or rejection-with-comments from a major outlet felt important and transformative. Honestly, I’d say it wasn’t until I won the Nebula Award for The Art of Starving that I felt like I could chill a tiny bit. But that only lasted a week or so.\nYour debut collection, Boys, Beasts & Men, goes all the way back to 2013 publications, such as “The Beasts We Want to Be” and “57 Reasons for the Slate Quarry Suicides,” but also offers newer pieces such as “Sun in an Empty Room.” Looking at this spectrum of work over the course of a decade, do you see specific ways in which your writing has changed?\nMy prime directive when it comes to writing short fiction is never to repeat myself, which means that over the twenty-five years since I first published a short story in a raggedy little local anthology, I have tried to set myself increasingly challenging goals, and push myself to attempt new and difficult things with my stories. So, there is definitely a bedrock of Me that’s resonant throughout these stories, but there’s also a shifting evolution in terms of what I can accomplish with tone and theme and framework and formal conceit and just generally trying to constantly make better use of the awesome tool kit that speculative fiction gives us all.\nThe collection features fourteen stories, which is just under half of the short fiction you have out. How were stories selected? Is there an organizational principle at work—is it a “best of” or do selections follow a theme?\nThe organizing principle in Boys, Beasts & Men is the age of the protagonist, going from the eight-year-old boy who narrates “Allosaurus Burgers” (the first story in the book) to the antique couch who narrates “Sun in an Empty Room” (the last). I definitely tried to include as many stories that seemed to resonate with readers as possible, but I also wanted to tell a unified story about how the world makes us monsters, so I omitted many stories that seemed less directly connected to that core theme.\nWhat can you tell us about “Sun in an Empty Room”—without “spoiling” the read too much?\nIt’s my white whale, the thing I spent years and years trying to land. I wrote it in 2008, and it was rejected by ninety-nine literary and speculative journals. And it’s how I met the awesome Fran Wilde. I submitted it to Apex when she was a slush reader there, and she tried her best to get it published, but then-editor-in-chief Lynne M. Thomas wasn’t feeling it. But Fran sent me a super encouraging note (this was before I made my first pro sale and was really struggling, so encouraging words went a looooong way!), and we’re buddies to this day.\nLynne went on to cofound Uncanny Magazine and published my story “The Heat Of Us” (also included in Boys, Beasts & Men), and we’re buddies too, so . . . keep on going, even when it sucks, the pain of rejection can make you better, and sometimes the people who tell you No now will one day be your friends.\nIf readers looked at three stories in this book, what would you want them to be, and why?\nWell, when I got the ARC I reread “Shucked” for the first time since submitting it to F&SF, and I was . . . kinda impressed? Whoever I was when I wrote it, he was pretty great. And I think “Things With Beards” might be the most me story I’ve written. Finally, there’s a framing story that incorporates every story in the book into one cohesive narrative (hopefully), and that’s made up of short vignettes before and after every story, and I think it’s pretty cool.\nWhich, for you, were the stories that were most challenging to write? What made them challenging, and how did you face those challenges?\nEach story is a whole new wonderful nightmare. I can’t say that any of them were particularly easy to write, but, also, I enjoy the process so much that I’m hard-pressed to say they were difficult. Like it’s like playing a really hard really great video game—even when it’s kicking your ass, it’s still a ton of fun.\nLooking at your career so far, are there themes and ideas in your fiction that you often come back to, that stand out as more important to you, or about which you feel passionate?\nMy work is always about how humans are amazing, and how they are terrible. How much great cool stuff we do, and how much atrocity. And how even really awesome people do really shitty things. These stories look at that through the lens of patriarchy, toxic masculinity, queerness, and complicity and resistance, which just never gets boring to me lol.\nIs there anything else you’d like readers to know about this book?\nThat the incredible Amal El-Mohtar wrote the introduction! And it’s amazing! Seriously made me choke up when I read it. In 2014, when my short story “We Are the Cloud” (included in the collection) was published in Lightspeed, it got some super homophobic reviews, which suuuuuuuuucked—any LGBTQIA+ SFF writer can tell you that queering the genre means coming up against a whole lot of really vicious trolls—and Amal wrote the most beautiful review/defense of the story; that’s how I knew she’d be the perfect person to do the introduction.\nAre there stories over the course of your career that you were especially happy with, that you felt very strongly about, but that, for whatever reasons, just didn’t get noticed the way other pieces did?\nTONS!! It’s a constant source of puzzlement, what hits and what doesn’t. What factors go into that. But then again, you never know—life is long, and things have a way of coming and going, including stories. I thought my Tor.com story “The Future of Hunger in the Age of Programmable Matter” kinda sank like a stone, but then it got included in a Japanese anthology of the world’s best science fiction shorts from the 2010s, so . . . you never know. And you gotta just keep going.\nWhat else are you working on now, and what do you have coming up that you can tell us about?\nMy pandemic project was to teach myself programming so I could make a video game. That’s coming along nicely—it’s a very queer RPG. And I am hard at work on a new novel. And short stories. All the things, really.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/miller_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Whole New Wonderful Nightmare: A Conversation with Sam J. Miller by Arley Sorg"}