{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "3lK4FEib6qfuY+fKVrUIekFINEI=", "id": null, "license": null, "comments": "", "raw_text": "Interview  A Novel Possibility: A Conversation with Mary Robinette Kowal  Mary Robinette Kowal is the author of the story collection Scenting The Dark & Other Stories, and the novel Shades of Milk & Honey. In her words, she is a writer \"interested in people and their relationships.\"  Her short story \"Evil Robot Monkey\" was nominated for the 2009 Hugo. Typical of Kowal's fiction, the story is, first and foremost, a pleasure to read. It is seamless, whole and complete. At the heart of the story are the characters Sly and Vern, an augmented chimp and a compassionate handler, respectively.  For fans of Kowal's short fiction, the novel Shades of Milk & Honey is her usual blend of beautiful prose and striking characters. The difference, of course, is that the story stretches over hundred of pages. This is a welcome relief for readers who wish her stories would go on forever. Set in an alternate Regency England, Shared of Milk and Honey has been praised as a blend of magic (known as glamour) and the sensibilities of Jane Austen.  Below, Kowal and I talk about her magical double life as a puppeteer and fiction writer.   What sort of puppetry do you do?  I work in a wide variety of forms. Over the past twenty years, I would basically work any puppet that someone paid me to do which means I've handled hand, marionette, rod, shadow, body puppets... a little bit of everything.  What's it like when things are going well?  It's like magic. When you can bring an inanimate object to life and have the audience totally commit to that, it is absolute magic.  Poorly?  It is really painful. Literally. Puppetry often hurts a lot because to get the figure to do what you want it to, particularly with something like a body puppet, involves pushing your body to the absolute limit.  What is the coolest part of the whole process?  What I love best is assisting on a multiple person puppet. There's a moment when all the performers are so invested in the character that we think the same thoughts. It's the closest one comes to telepathy.  How is the process similar and dissimilar to writing?  I actually have a whole giant essay on this. Basically, the act of creating a character is the same in both forms. What the character looks at shows you what they are thinking about. The order in which you look at things carries meaning. The pacing with which things take place speaks to the emotion of the moment.  Is there a landmark piece of fiction in your career? Can you talk some about the writing of it?  \"Salt of the Earth\" is the first story I wrote after taking Orson Scott Card's Literary BootCamp. Before that I always felt like I backed into complete stories by accident. This is the first one that I wrote on purpose.  With Shades of Milk & Honey, what came first — character, setting, plot, image, sight, sound, or something else? And how did it grow from there?  It started as a flash fiction exercise. There was a verse about a face made for fortune. From there I decided that it was about two sisters in love with the same man and that one was beautiful and the other wasn't. I wanted it to be in the Regency and with magic. Everything followed from there. I got about a thousand words into it and realized that I had a novel possibility so I set it aside and ruminated for awhile.  You were born and raised in North Carolina and are now living on the west coast. What of the south shows up in your fiction? Do you miss the south?  I suspect that it shows up in my use of language and pacing but I lived in a fairly anomalous area, the Research Triangle Park, which had a lot of transplants from other regions. Largely, I don't miss it or rather, if there is nostalgia then it is for the south as I perceived it as a child, which bears little relation to the larger experience.  Who are you reading these days? Whose work excites you?  I just finished Brent Weeks' The Black Prism and thoroughly enjoyed it. I'm enjoying his work, Cherie Priest, Paolo Bacigalupi and am recently on a Nancy Kress kick.  If you could see around corners and into the future, what do you think the literary landscape will look like in ten years?  Bwhahahaha! I have no idea. I could speculate an increase in first-person narratives because they play better in audio, but that's just me writing SF and passing it off as an answer to an interview question.  What's next for you?  I'm designing puppets for a production of Neil Gaiman's Odd and the Frost Giants for Stages Theater in Houston. I'm also about two chapters into a new novel with a completely different magic system, also a historical but this time in 1907 and the American South. And short stories, of course.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nA Novel Possibility: A Conversation with Mary Robinette Kowal\nMary Robinette Kowal is the author of the story collection Scenting The Dark & Other Stories, and the novel Shades of Milk & Honey. In her words, she is a writer \"interested in people and their relationships.\"\nHer short story \"Evil Robot Monkey\" was nominated for the 2009 Hugo. Typical of Kowal's fiction, the story is, first and foremost, a pleasure to read. It is seamless, whole and complete. At the heart of the story are the characters Sly and Vern, an augmented chimp and a compassionate handler, respectively.\nFor fans of Kowal's short fiction, the novel Shades of Milk & Honey is her usual blend of beautiful prose and striking characters. The difference, of course, is that the story stretches over hundred of pages. This is a welcome relief for readers who wish her stories would go on forever. Set in an alternate Regency England, Shared of Milk and Honey has been praised as a blend of magic (known as glamour) and the sensibilities of Jane Austen.\nBelow, Kowal and I talk about her magical double life as a puppeteer and fiction writer.\nWhat sort of puppetry do you do?\nI work in a wide variety of forms. Over the past twenty years, I would basically work any puppet that someone paid me to do which means I've handled hand, marionette, rod, shadow, body puppets... a little bit of everything.\nWhat's it like when things are going well?\nIt's like magic. When you can bring an inanimate object to life and have the audience totally commit to that, it is absolute magic.\nPoorly?\nIt is really painful. Literally. Puppetry often hurts a lot because to get the figure to do what you want it to, particularly with something like a body puppet, involves pushing your body to the absolute limit.\nWhat is the coolest part of the whole process?\nWhat I love best is assisting on a multiple person puppet. There's a moment when all the performers are so invested in the character that we think the same thoughts. It's the closest one comes to telepathy.\nHow is the process similar and dissimilar to writing?\nI actually have a whole giant essay on this. Basically, the act of creating a character is the same in both forms. What the character looks at shows you what they are thinking about. The order in which you look at things carries meaning. The pacing with which things take place speaks to the emotion of the moment.\nIs there a landmark piece of fiction in your career? Can you talk some about the writing of it?\n\"Salt of the Earth\" is the first story I wrote after taking Orson Scott Card's Literary BootCamp. Before that I always felt like I backed into complete stories by accident. This is the first one that I wrote on purpose.\nWith Shades of Milk & Honey, what came first — character, setting, plot, image, sight, sound, or something else? And how did it grow from there?\nIt started as a flash fiction exercise. There was a verse about a face made for fortune. From there I decided that it was about two sisters in love with the same man and that one was beautiful and the other wasn't. I wanted it to be in the Regency and with magic. Everything followed from there. I got about a thousand words into it and realized that I had a novel possibility so I set it aside and ruminated for awhile.\nYou were born and raised in North Carolina and are now living on the west coast. What of the south shows up in your fiction? Do you miss the south?\nI suspect that it shows up in my use of language and pacing but I lived in a fairly anomalous area, the Research Triangle Park, which had a lot of transplants from other regions. Largely, I don't miss it or rather, if there is nostalgia then it is for the south as I perceived it as a child, which bears little relation to the larger experience.\nWho are you reading these days? Whose work excites you?\nI just finished Brent Weeks' The Black Prism and thoroughly enjoyed it. I'm enjoying his work, Cherie Priest, Paolo Bacigalupi and am recently on a Nancy Kress kick.\nIf you could see around corners and into the future, what do you think the literary landscape will look like in ten years?\nBwhahahaha! I have no idea. I could speculate an increase in first-person narratives because they play better in audio, but that's just me writing SF and passing it off as an answer to an interview question.\nWhat's next for you?\nI'm designing puppets for a production of Neil Gaiman's Odd and the Frost Giants for Stages Theater in Houston. I'm also about two chapters into a new novel with a completely different magic system, also a historical but this time in 1907 and the American South. And short stories, of course.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/kowal_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Novel Possibility: A Conversation with Mary Robinette Kowal by Jeremy L. C. Jones"}