{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alvaro Zinos-Amaro", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "voya7JzZlz64cDG3vMB0BZJT+N4=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Anywhere with Pillars: A Conversation with Jo Walton  Jo Walton has published ten novels, three poetry collections and an essay collection, with another two novels due out in 2015. She won the John W. Campbell Award for Best New Writer in 2002, the World Fantasy Award in 2004 for Tooth and Claw, and the Hugo and Nebula awards in 2012 for Among Others. She comes from Wales but lives in Montreal where the food and books are much better. She writes science fiction and fantasy, reads a lot, talks about books, and eats great food. She plans to live to be ninety-nine and write a book every year.  I first learned of Jo Walton’s work when I heard about Tooth and Claw. Dragons by way of Anthony Trollope? I was hooked. After that I regularly sought out her fiction, and Jo’s fiery Tor.com posts quickly became an addiction. It was therefore a real treat, though a bit unnerving, to moderate her on a panel about the Retro Hugos at the most recent Worldcon. I shouldn’t have worried. The panel went well—all I had to do was get out of the way of Jo and the other participants. In fact, it went well enough for Jo to take time out of her busy schedule a few months later to answer some questions for me . . .   I love your character names. What’s your process for coming up with them, and how early or late does it happen in your overall creative process?  Many of my characters arrive with names. Others don’t. Early in the process of a project I’ll make an alphabetized list of culture-appropriate names, and grab one when I need it. Often I’ll know already where in the alphabet I want the name to come, and sometimes the kind of sounds I want, because I’ll have an idea of the character’s personality. If I don’t, if it’s a case of somebody coming through the door with a gun and I snatch a name at random, they’ll get a lot of their personality from being called Wendy, with its wide open beginning and snapped shut end, and its roots in J.M. Barrie.  The question of how somebody whose parents named them after the motherly little girl who did want to grow up got to the point of picking up that gun and be coming through the door with it will be part of the character’s history. This will (naturally) be completely invisible to the reader in most cases, but it’s very useful to me when it comes to how a character will talk and behave.  Names always come very early in the process. If I have to change a character name it’s a huge painful thing, and it changes the character. I think about names a lot. Names are charged and powerful and pull in different directions. They have historical and mythological resonance, they have sound resonance, and they have class resonance—whether the reader recognizes that or not. They also have dates, when you’re working in this world. Someone named Ashley is a certain age and class, for instance. In a different world, then the reader won’t already know what a name denotes, but it will still have that kind of context, and I’ll be thinking about that. You can use names to do worldbuilding and convey context—people from different societies will have different kinds of names.  After reading your posts for Tor.com, I’m curious if you maintain a reading log that tracks your reading activity, including the titles of the books you’ve read and when you’ve finished them (and how many times you’ve read them!).  No, I don’t. I read for pleasure, keeping databases would be boring. I do have a Goodreads account and I do update it sometimes. I certainly don’t track how many times I’ve read something, whatever for?  There’s a competitive element to the way some people talk about reading—x many books, x many times read—that is really strange to me. I’ve been accused of boasting about how fast I read when I mention it on Tor.com, so I’ve stopped talking about it. I really do read entirely for fun.  What are the two or three books you think you’ve re-read most often in your life? How many times roughly have you re-read them, and do you expect to continue returning to these titles with the same fervor in the future?  The problem is not that they lose their appeal, the problem is that I learn them by heart, so I can’t read them any more, because I can recite them. I can’t sink into them and be caught up because I know all the words.  Things I’ve read the most times—The Lord of the Rings. Cherryh’s Union/Alliance books. Bujold’s Miles books. The Dispossessed. Stars in My Pockets Like Grains of Sand. Rosemary Kirstein’s Steerswoman books. Mary Renault.  I don’t let myself read things more than once a year, so theoretically I haven’t read anything more than fifty times, but I didn’t institute that rule until I started having problems with how often I was reading Cyteen so I don’t know.  Each of your books or trilogies seems to tackle new forms or sub-genres, keeping readers delightfully on their toes. In several posts you’ve mentioned your enjoyment of military SF, by authors such as Jerry Pournelle or David Weber. Is military SF something you might consider for a future project?  You never know. But I find SF much more difficult than fantasy, because for fantasy you have history to lean on, and for SF you have to make it all up.  Setting really informs your fiction: you evoke a strong sense of place in all of your stories. I imagine you’re good at researching places, or well traveled, or most likely a combination of both. What are some of the places you’ve most enjoyed visiting—“anywhere with pillars,” as one character teases in your forthcoming The Just City (2015)?  I’m not all that well traveled. My friend the thriller writer Jon Evans has been everywhere. I’ve been to quite a lot of places in Europe, and generally when I travel in North America I go by train, which means I see a lot more places and landscapes than people who fly.  Place is very important to me, and in fact all the places in all my books are real and I have been to them. I need to feel a sense of connection to a place to write about it. But that can happen quite fast. In 2011 I spent a week in Florence staying with my friend Ada Palmer (whose brilliant Dogs of Peace is coming out from Tor next year) and I just fell in love with it, and it has been appearing in everything I’ve written since, including things set in Heaven, on generation starships, and in Plato’s Republic. I have been back there every year since.  What are a few destinations you’ve never traveled to but you would like to visit in the future?  Of course, I’d like to go everywhere . . . I want to go to Naples, and Istanbul, and lots of places in Asia, and to other planets, and of course Ithaca, but only the Ship of Fools is traveling there this year . . .  In your novel, Among Others, to what degree were the authors and books a conscious choice on your part, designed to help illuminate the character of Mori to the reader, and to what degree were they instinctively autobiographical, drawn directly from your own memories of reading?  Lots of both. My memories of reading and my reactions to books when I was that age really guided me a lot—and her likes and dislikes are very congruent with mine when I was that age. But what she reads when and her response to it was definitely chosen deliberately—for instance Babel 17 being the book she is halfway through at the time when she chooses not to die, when Babel 17 is about communication and connection.  I’m curious if you also read what we might think of as “associational” SF books—that is, books written by SF authors that are not SF. I’m thinking particularly of nonfiction, but also non-genre novels by primarily genre authors. If so, do you have any favorites?  Yes, of course I do. Dan Simmons Phases of Gravity, Susan Palwick’s Mending the Moon, John Brunner’s The Great Steamboat Race, Keith Roberts’s The Boat of Fate, L. Sprague de Camp’s An Elephant for Aristotle, everything Marge Piercy and Margaret Atwood and Kazuo Ishiguro and Doris Lessing and Anthony Burgess wrote that wasn’t SF . . . no, wait, that wasn’t what you’re asking!  As for nonfiction, I guess I have read Le Guin and Delany and Tolkien’s essays, but I can’t think of much else. Most of the non fiction I read is history and biography and things.  Given your fascination with classical philosophy and mythology, I’m curious if you’ve read other SF writer’s takes on some of these raw materials—Dan Simmons’ Ilium and Olympos, to quote a recent example, or others?  I haven’t read those. I can’t think of much actually. Lots of historical fiction that’s on the edge of fantasy—Mary Renault especially.  Any others besides Renault?  More classical historical fiction on the edge of fantasy—Gillian Bradshaw, Georgia Sallska’s Priam’s Daughter, Alfred Duggan.  In one your posts on Tor.com you classified book series according to four broad categories (I’m using my own words here):  1) single books split up into multiple volumes on publication 2) series where each book is self-contained but reading them in the correct order is recommended 3) series that can be read in any order, but which benefit from cumulative reading 4) series made of up self-contained volumes that are completely independent of each other. I noticed that your website refers to your next novel, The Just City, as the first of the new three-book Thessaly series. Which of the above categories best describes this forthcoming series (or did you invent a fifth one)? And at what point in the development of the ideas/characters did you realize it would be three volumes? It’s a type 2 series, definitely.  Each book is self-contained, and I could have stopped at the end of book one, or at the end of book two. When I’d finished The Just City, I knew I’d have to either write an extra chapter covering some things left dangling, or write a sequel. I thought about it, and wrote The Philosopher Kings. Then when I’d finished that, it could have been enough, but then I looked through a solar telescope in the Lowell Observatory in Flagstaff and knew I had to write the third one.  So are you currently working on the third volume, Necessity?  Yes, I am working on Necessity, or I would be if I wasn’t doing this interview.  Alvaro is the co-author, with Robert Silverberg, of When the Blue Shift Comes, which received a starred review from Library Journal. Alvaro's short fiction and poetry have appeared or are forthcoming in Analog, Nature, Galaxy's Edge, Apex and other venues, and Alvaro was nominated for the 2013 Rhysling Award. Alvaro's reviews, critical essays and interviews have appeared in The Los Angeles Review of Books, Strange Horizons, SF Signal, The New York Review of Science Fiction, Foundation, and other markets. Alvaro currently edits the blog for Locus.", "text": "Interview\nAnywhere with Pillars: A Conversation with Jo Walton\nJo Walton has published ten novels, three poetry collections and an essay collection, with another two novels due out in 2015. She won the John W. Campbell Award for Best New Writer in 2002, the World Fantasy Award in 2004 for Tooth and Claw, and the Hugo and Nebula awards in 2012 for Among Others. She comes from Wales but lives in Montreal where the food and books are much better. She writes science fiction and fantasy, reads a lot, talks about books, and eats great food. She plans to live to be ninety-nine and write a book every year.\nI first learned of Jo Walton’s work when I heard about Tooth and Claw. Dragons by way of Anthony Trollope? I was hooked. After that I regularly sought out her fiction, and Jo’s fiery Tor.com posts quickly became an addiction. It was therefore a real treat, though a bit unnerving, to moderate her on a panel about the Retro Hugos at the most recent Worldcon. I shouldn’t have worried. The panel went well—all I had to do was get out of the way of Jo and the other participants. In fact, it went well enough for Jo to take time out of her busy schedule a few months later to answer some questions for me . . .\nI love your character names. What’s your process for coming up with them, and how early or late does it happen in your overall creative process?\nMany of my characters arrive with names. Others don’t. Early in the process of a project I’ll make an alphabetized list of culture-appropriate names, and grab one when I need it. Often I’ll know already where in the alphabet I want the name to come, and sometimes the kind of sounds I want, because I’ll have an idea of the character’s personality. If I don’t, if it’s a case of somebody coming through the door with a gun and I snatch a name at random, they’ll get a lot of their personality from being called Wendy, with its wide open beginning and snapped shut end, and its roots in J.M. Barrie.\nThe question of how somebody whose parents named them after the motherly little girl who did want to grow up got to the point of picking up that gun and be coming through the door with it will be part of the character’s history. This will (naturally) be completely invisible to the reader in most cases, but it’s very useful to me when it comes to how a character will talk and behave.\nNames always come very early in the process. If I have to change a character name it’s a huge painful thing, and it changes the character. I think about names a lot. Names are charged and powerful and pull in different directions. They have historical and mythological resonance, they have sound resonance, and they have class resonance—whether the reader recognizes that or not. They also have dates, when you’re working in this world. Someone named Ashley is a certain age and class, for instance. In a different world, then the reader won’t already know what a name denotes, but it will still have that kind of context, and I’ll be thinking about that. You can use names to do worldbuilding and convey context—people from different societies will have different kinds of names.\nAfter reading your posts for Tor.com, I’m curious if you maintain a reading log that tracks your reading activity, including the titles of the books you’ve read and when you’ve finished them (and how many times you’ve read them!).\nNo, I don’t. I read for pleasure, keeping databases would be boring. I do have a Goodreads account and I do update it sometimes. I certainly don’t track how many times I’ve read something, whatever for?\nThere’s a competitive element to the way some people talk about reading—x many books, x many times read—that is really strange to me. I’ve been accused of boasting about how fast I read when I mention it on Tor.com, so I’ve stopped talking about it. I really do read entirely for fun.\nWhat are the two or three books you think you’ve re-read most often in your life? How many times roughly have you re-read them, and do you expect to continue returning to these titles with the same fervor in the future?\nThe problem is not that they lose their appeal, the problem is that I learn them by heart, so I can’t read them any more, because I can recite them. I can’t sink into them and be caught up because I know all the words.\nThings I’ve read the most times—The Lord of the Rings. Cherryh’s Union/Alliance books. Bujold’s Miles books. The Dispossessed. Stars in My Pockets Like Grains of Sand. Rosemary Kirstein’s Steerswoman books. Mary Renault.\nI don’t let myself read things more than once a year, so theoretically I haven’t read anything more than fifty times, but I didn’t institute that rule until I started having problems with how often I was reading Cyteen so I don’t know.\nEach of your books or trilogies seems to tackle new forms or sub-genres, keeping readers delightfully on their toes. In several posts you’ve mentioned your enjoyment of military SF, by authors such as Jerry Pournelle or David Weber. Is military SF something you might consider for a future project?\nYou never know. But I find SF much more difficult than fantasy, because for fantasy you have history to lean on, and for SF you have to make it all up.\nSetting really informs your fiction: you evoke a strong sense of place in all of your stories. I imagine you’re good at researching places, or well traveled, or most likely a combination of both. What are some of the places you’ve most enjoyed visiting—“anywhere with pillars,” as one character teases in your forthcoming The Just City (2015)?\nI’m not all that well traveled. My friend the thriller writer Jon Evans has been everywhere. I’ve been to quite a lot of places in Europe, and generally when I travel in North America I go by train, which means I see a lot more places and landscapes than people who fly.\nPlace is very important to me, and in fact all the places in all my books are real and I have been to them. I need to feel a sense of connection to a place to write about it. But that can happen quite fast. In 2011 I spent a week in Florence staying with my friend Ada Palmer (whose brilliant Dogs of Peace is coming out from Tor next year) and I just fell in love with it, and it has been appearing in everything I’ve written since, including things set in Heaven, on generation starships, and in Plato’s Republic. I have been back there every year since.\nWhat are a few destinations you’ve never traveled to but you would like to visit in the future?\nOf course, I’d like to go everywhere . . . I want to go to Naples, and Istanbul, and lots of places in Asia, and to other planets, and of course Ithaca, but only the Ship of Fools is traveling there this year . . .\nIn your novel, Among Others, to what degree were the authors and books a conscious choice on your part, designed to help illuminate the character of Mori to the reader, and to what degree were they instinctively autobiographical, drawn directly from your own memories of reading?\nLots of both. My memories of reading and my reactions to books when I was that age really guided me a lot—and her likes and dislikes are very congruent with mine when I was that age. But what she reads when and her response to it was definitely chosen deliberately—for instance Babel 17 being the book she is halfway through at the time when she chooses not to die, when Babel 17 is about communication and connection.\nI’m curious if you also read what we might think of as “associational” SF books—that is, books written by SF authors that are not SF. I’m thinking particularly of nonfiction, but also non-genre novels by primarily genre authors. If so, do you have any favorites?\nYes, of course I do. Dan Simmons Phases of Gravity, Susan Palwick’s Mending the Moon, John Brunner’s The Great Steamboat Race, Keith Roberts’s The Boat of Fate, L. Sprague de Camp’s An Elephant for Aristotle, everything Marge Piercy and Margaret Atwood and Kazuo Ishiguro and Doris Lessing and Anthony Burgess wrote that wasn’t SF . . . no, wait, that wasn’t what you’re asking!\nAs for nonfiction, I guess I have read Le Guin and Delany and Tolkien’s essays, but I can’t think of much else. Most of the non fiction I read is history and biography and things.\nGiven your fascination with classical philosophy and mythology, I’m curious if you’ve read other SF writer’s takes on some of these raw materials—Dan Simmons’ Ilium and Olympos, to quote a recent example, or others?\nI haven’t read those. I can’t think of much actually. Lots of historical fiction that’s on the edge of fantasy—Mary Renault especially.\nAny others besides Renault?\nMore classical historical fiction on the edge of fantasy—Gillian Bradshaw, Georgia Sallska’s Priam’s Daughter, Alfred Duggan.\nIn one your posts on Tor.com you classified book series according to four broad categories (I’m using my own words here):\n1) single books split up into multiple volumes on publication\n2) series where each book is self-contained but reading them in the correct order is recommended\n3) series that can be read in any order, but which benefit from cumulative reading\n4) series made of up self-contained volumes that are completely independent of each other.\nI noticed that your website refers to your next novel, The Just City, as the first of the new three-book Thessaly series. Which of the above categories best describes this forthcoming series (or did you invent a fifth one)? And at what point in the development of the ideas/characters did you realize it would be three volumes?\nIt’s a type 2 series, definitely.\nEach book is self-contained, and I could have stopped at the end of book one, or at the end of book two. When I’d finished The Just City, I knew I’d have to either write an extra chapter covering some things left dangling, or write a sequel. I thought about it, and wrote The Philosopher Kings. Then when I’d finished that, it could have been enough, but then I looked through a solar telescope in the Lowell Observatory in Flagstaff and knew I had to write the third one.\nSo are you currently working on the third volume, Necessity?\nYes, I am working on Necessity, or I would be if I wasn’t doing this interview.\nAlvaro is the co-author, with Robert Silverberg, of When the Blue Shift Comes, which received a starred review from Library Journal. Alvaro's short fiction and poetry have appeared or are forthcoming in Analog, Nature, Galaxy's Edge, Apex and other venues, and Alvaro was nominated for the 2013 Rhysling Award. Alvaro's reviews, critical essays and interviews have appeared in The Los Angeles Review of Books, Strange Horizons, SF Signal, The New York Review of Science Fiction, Foundation, and other markets. Alvaro currently edits the blog for Locus.", "source": "https://clarkesworldmagazine.com/walton_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Anywhere with Pillars: A Conversation with Jo Walton by Alvaro Zinos-Amaro"}