{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alexander Lumans", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "DL21DTvTd5M4aH/g7maHxxintPA=", "id": null, "license": null, "comments": "", "raw_text": "5430 words, short story  All the Things the Moon Is Not  A call comes over the vidchannel: “Murph, you sitting down?”  “Always.” At the moment I’m standing in my darkened cabin at base camp in Mare Nubium. By headlamp only I carve a chess piece—a knight—out of moon rock. I’d crushed one earlier after Tchaikovsky called me out on a dumb move.  The screen and radio cut out. I switch channels, then switch back to hear: “Get up. You need to see this.” Tamsen sounds serious. She always sounds serious. It’s one of the things I like most about her.  “I’m busy.” I keep sanding the knight’s head. When no response follows, just space static, I give in. “What is it?”  More static, then: “The Russians.”  I blow on the knight. Moondust reels through the headlamp’s beam. I think it beautiful. I’d carved this set my first month here on the moon. The dust I compare to stars. The space between them, too, is beautiful. And the same old lines are running through my head—Goodnight room, goodnight moon—the ones I’d read in bed to my daughters. I grab the mic: “Tell Tchaikovsky he needs to ready his Nastoyka supply.”  Tchaikovsky is a mold pirate, the one thing we have in the way of a rival. But he’s also a good chess player. He studied his masters. Knew openings I’d never heard of. He’s the only distraction here that keeps me honest. Down on Earth, who has the calm or the fire for chess anymore? Since our four-man crew arrived late last August to harvest the Dreammold!, I’ve been in two modes: defend and defend again. Whether it’s harvesting, carving, or playing, give it 98%. I’ve always been one to open my games with the tried and true; Sicilian Defense all the way. Only recently have I begun to wonder if this is the right way to go about it. Tchaikovsky and I have an unfriendly wager: loser ponies up a bottle of their nation’s choicest liquor. By my count, I’ve handed over seventeen handles of Maker’s Mark. And he? Not a drop of vodka.  In four weeks the transport will be here to take us home. I want to win, for once. I want things to go my way.  “We found their ship.”  “There’s plenty of mold out there,” I tell her. “Let the little cosmonaut stake his claim.” I’ve given up playing moon ranger. A year in one-sixth gravity and white rooms and the company of little love does that to good intentions.  This time, not even static.  “Tamsen.” I set the knight on d5. “Tamsen?”  “—the problem.” I only catch this last part. But I am busy. A good kind of busy. In eight moves, I’ll have the Russian mated—Rg2++—even after losing my queen early on. And now Tamsen, with whatever problem there is, has carved that good feeling out of me.  In Buggy 2, I zoom south to her position at the edge of Tycho Crater. It’s where we go for the best mold harvesting. I can throw a rock into the crater and watch the moldripples go on for miles: yellowyellowyellow. “Twenty-eight days,” I remind myself.  Tamsen’s standing by Buggy 1, big gloved hands on her big suited hips. She’s radioed the rest of the crew too. Bouncing around in our suits, the four of us resemble primitive undersea divers with portholes for masks and twin oxygen tanks. Spitzer’s busy poking the mold. When I used to hear the Rockies’ announcer describe a batter with “warning track power,” I didn’t realize I was imagining Spitzer. Long-limbed and morally impulsive, he’s always asking me, “When do I get to stab the flagpole into something?” Vinegar Tom—he’s just staring into the crater. I’m thankful for our helmets. Yesterday, I’d walked in on him and Tamsen fucking in her room—they didn’t see me—and now I don’t want to look him in the face for the rest of the mission. Not out of shame, but because he got to her first, because it made me realize I’ve always hated this planet. Him. His copy of Desperate Passage: The Donner Party’s Perilous Journey West that he intently flips through in the mess hall like he’s studying one of the buggies’ operation manuals.  Tamsen taps her helmet. I tap mine back. The vidchannel and radio have been fritzing. We haven’t talked with mission control since Tuesday and we don’t know what’s wrong with the transmitter. All we hear back is fuzz.  Beyond her and the others, at the crater’s edge, I see Tchaikovsky’s ship. And I see the mold; that is the problem. What had been his illegal operation is now covered in the Dreammold!, utterly and completely. It’s as if Tycho burped up some fantastic wave that came crashing down mid-ops. The scene reminds me of Denver, the day after.  I draw a finger across my neck, point at the Russians’ ship, and then shrug. We bounce over to it and pry open the bay door. The vessel’s guts are clogged with as much yellow gunk as the outer shell is coated.  A flash in me of something Tchaikovsky’d said after taking my queen: “Ze bigger zey are, Afraham Lincoln, ze more it rains rats and clogs.” He was forever butchering Americanisms, but sometimes I had to admire the results. They made as much sense on the moon as anything else did back home.  Fifty feet from the Russian’s ship, Tamsen’s waving me over. She stands calf-deep in mold on the crater’s rim. At her feet is a single set of boot tracks. It leads from the ruined ship out into Tycho’s depths.  Back at base camp, I stare at the same game from before.  “So the mold is moving,” says Vinegar Tom from behind me. His voice always sounds surprisingly nasal; surprising because he’s missing his nose. It makes his bucked teeth stand out all the more. “Now we don’t have to drive as far to get it.”  I’m too preoccupied to respond and too besieged to care.  “You had your games with the Commie, I know. It’s terrible. A bad way to go. But we’ve all seen terrible things on the news.” I can hear the smirk in his voice, smell the vinegar on his breath. He’d quit the space program to be a butcher in Ohio, but when The Drought killed that industry, he came trudging back to Cape Canaveral. “Though I suppose some of us have seen it up close,” he goes on. “Been able to smell the terrible.” He reaches around from behind me and flicks over the white king.  “That’s my king, asshole.”  “I know.”  After I finish wiping the blood from Vinegar Tom’s lip off my elbow, I say, “Touch my game again, see what happens.”  He looks down at the board, then at me, as if considering it. He’s short and brash and sporadically clean-shaven. Exactly the kind of man I can picture behind a meat counter. The skinfolds where his nose should be remind me of how the Rocky Mountains look on military raised-relief maps. “If we have to eat each other at some point between now and the 30th,” he says, “I’m going to make you eat me.”  An hour later, I set the white king upright. Eight moves: 37. Qb3 Rd1+ 38. Kg2 Rd2+ 39. Kg3 Ne3 40. Qxe3 Rg2++. I pick up my newest knight. The jawline is clean, the eyes sharp notches. Calmly, I hurl it at the cabin wall. It hits hard and slowly fragments.  I imagine the conversation at NASA went something like this:  “Sir, the moon is shiny.”  “It’s always been shiny.”  “No, sir, there are shiny parts.”  “Today is not April Fool’s Day.”  “Telescope Two picked them up.”  “Shiny parts?”  “We thought it was silver.”  “Moonsilver. That has a good ring to it.”  “It’s not silver.”  “Okay. Mercury, rhodium, zinc, what isn’t it?”  “Telescope Two is a very good telescope.”  “Moonsilver.”  “First, sir, it’s important that we keep this a secret.”  “I agree. Everyone likes jewelry. Everyone’s a magpie.”  “That’s not what we mean.”  “Tell me already. You’re killing me here!”  “It’s water.”  “Is water shiny?”  “We found shiny water. On the moon.”  “Shit.”  “That’s what we’re supposed to say: ‘shit.’ We said you wouldn’t say that.”  “Who knows about this?”  “Everyone. Everyone’s a magpie for this kind of news.”  “And you’re sure it’s not April Fool’s?”  “We’re sure it’s not silver.”  “Shit.”  By then, The Drought had settled in, five long years and still holding strong. Ice, Aquafina, and public pools were all things of the past. The U.S.’s initial investigative moonlanding found plenty of water. And it found what was growing in the water, too: the mold. We sampled it, brought it to Florida, found it useful. So the U.S. pushed through amendments to the TRIPS agreement to include protections for other planets’ resources. And they shipped the four of us up here to harvest it for a year until the next round of crewmen arrives.  We know it’s been almost a year because of the calendar in the mess hall. Each month features a new war poster.  “Ten fingers good! Eight claws bad!”  “Use your thumbs! Recycle your scrap metal and keep the MegaHun at bay!”  “When you live alone, you live with Megafauns.”  Vinegar Tom says they’re invigorating. I’m sick of them. But there’s little else to focus on between sleeping and eating and sporing and fighting and fucking. And work.  The word Dreammold! once summoned in me the image of a fantasyland of iridescent clouds. Now I can’t think of a less suitable name. It’s this terrible yellow, with the look of cauliflower heads but the consistency of dry, packed snow.  Our only tools: large meat cleavers, T-handle baling hooks, and what’s essentially a giant George Foreman. Everything’s run on solar, even the powercyclers that pump out our CO2. I’d be thrilled by the technology if I thought it’d actually save me.  Step 1: Cut four-by-four squares out of the moldline.  Step 2: Hook the square on both sides and lift free.  Step 3: Place in grill box and seal shut.  The box broils the mold and compresses it. These hard pancakes go into storage until the semi-monthly unmanned cargo capsule arrives. Then we unload the capsule’s supplies (dried food, Maker’s Mark, oxygen tanks) before stacking the pancakes in its bay and sending it back to be fashioned into fuel, fixodent, and firearms for the Megafaun War.  The hordes hit Denver three days before I was scheduled for liftoff. I was there. Home with my family, eating chocolate chip waffles. The first wave struck late that morning. Wild pigs with mammoth tusks and armor plating. The ground shook. The South Platte sewage flowed backward. Then the rest of the Megafauns streamed out of the mountains, as if they’d been hiding there for centuries, breeding, tripling in size. So thirsty and fast. The winged kind broke into the top floor of the CenturyLink Tower. Fifty-point elks and shaggy aardvarks nested in INVESCO Field. Horned bears with snouts shaped like ice cream scoops covered the suburbs in blood and fur. They came for my family—wife, daughter, younger daughter, youngest daughter, our fox terrier Ralph, me—but we hid in the basement. I thought we’d be fine with a barricaded door. Before dark, I went upstairs for food with Ralph on my heels. Only, he bolted through the doggy door. I found myself chasing him down the street, imagining my daughters’ streaming faces if I had to tell them I lost Ralphie. A block down, heavy grunts sounded from someone’s garage. I had to run home empty-handed. But when I came back down into the basement, arms full of consolation Fruit Roll-Ups and Zebra Cakes and no dog, all I came back to was this big hole. Taken, and not even with a loud crashing I could replay in my head. Just nothing nowhere forever. It must have only taken seconds. I sat down on the stairs. I only thought I heard barking. I ate three Fruit Roll-Ups. I ate six Zebra Cakes. I waited. And when they didn’t come back, I slept in my youngest daughter’s bed, saying, goodnight nobody.  In the mess hall, Tamsen and Spitzer are seated on the floor by the powercycler vent. Contact with mission control is still nil. On the calendar, the 30th is circled in red. This month’s poster: a picture of a salivating mastodon-wolf looming over the caption: “The world cannot exist half-slave and half-food: Fight for Freedom!” Vinegar Tom sits backward on a chair, slouched forward and smiling wide at me. It doesn’t help my already sour mood: no more chess, no more liquor, even the prospect of shipping off-planet seems impossibly far away, as if we wouldn’t survive each other’s company another day. The three of them pass around foil stripped from an air duct and a twin-pronged nosetube and a lighter rigged from the grill box’s heatcoils.  “Keep sporing,” I say as I crouch between them, “and you’ll sour the meat.”  After Spitzer discovered you could freebase the mold—“sporing,” he named it—I opted out. How do you go 98% while spun on fungus? It’s practically a Class-1 drug, complete with four-hour euphoria, hallucinatory episodes, tingling. It also had a nasty tendency to gum up Vinegar Tom’s intestinal system if he didn’t take the right precautions. Yes, people need outlets.  “Can we go claim some mountain in the name of us?”  “Can I please plant the flagpole?”  “Can we sleep together now?”  Sporing also does wonders for the skin. The three of them are tinted gold, Tamsen the deepest. She has dark blonde hair to match, arms and legs that I’d only assumed were well-toned until recently, and a small tight face I started wanting to kiss too late. She sprinkles more spores onto the foil strip, clicks the lighter until the coils at its tip redden. Then, positioning the tube in her nose, she inhales deeply. These are the only times I ever see her relax. Relaxed people—lazy people—worry me.  Tamsen looks straight into my eyes and says, “You’re a lovely man.” This has all the meaning in the world, and none of it. “Has anyone ever told you how lovely you are?” I try to forget her moans, the image of her body thrusting under Vinegar Tom’s. How she could go for a guy without a nose was beyond me. “I mean it, Murph. You’re glorious.” She passes the foil to Vinegar Tom and leans back against the wall. “Like a baby’s mobile. The kind with the lights and funny animals.”  Spitzer laughs at her. I want her to go back to being serious. My wife was serious.  “You want to hear something fucked up?” asks Vinegar Tom.  I don’t.  “When the Donner Party got stranded in those mountains, they say they only fed the body parts to the youngest children. The youngest children, like three-year-olds. They did it even though they knew help was on the way. Isn’t that fucked up?”  Tamsen kicks his chair, but not hard enough to knock it over. “Has anyone ever told you how morbid you are?” Her eyes are lit up, her face radiant with spores.  Spitzer clucks his tongue and swings his arms together like a batter. “Another moon shot for Noseless Tom Jackson.” He, too, is shining.  The air vent kicks into a louder second powercycling stage. It sounds like a roar coming from the drooling, tusked wolf on the wall. I feel my lungs squeeze in. After a year, even the canned oxygen has begun to taste stale.  “That Dreammold!’s something else,” Vinegar Tom finally says. “All that canary yellow.” He reaches under his chair for two bottles: one of industrial-grade white vinegar and one of Pepto-Bismol. The vinegar kills the spores in his stomach; the pink stuff keeps the vinegar’s acid from eating more holes. He takes chugs from both bottles and grimaces after each.  Tamsen says, “It’s mustard, if anything.”  “Mustard?” Spitzer throws up his arms. “It’s gamboge. Pure gamboge yellow.”  I say, “I always thought it looked like cheese.”  They stare at me—“Cheese.”—they shake their heads.  “It’s goldenrod.”  “No, it’s a mix of lemon and sunglow.”  “Call it Peridot.”  “In some language somewhere, it means ‘precious’ and ‘ripe.’”  “Freedom yellow.”  “Yellow-bellied coward.”  “Macaroni and cheese,” I amend.  Vinegar Tom claps me on the back. “Like Tamsen says, you’re a lovely guy, but the moon ain’t made of cheese.” Everyone but me exchanges chuckles between spore passes. They take solace in this negative definition: it’s not cheese.  I stand up. They watch me with big pupils, sclera yellow at the corners. Tamsen says to stay, holding out the foil and lighter. On the calendar, the 16th, today, is already crossed out. Fifteen more days of what? With Tchaikovsky gone, they’re all I have. “Hell,” I say, crouching back down and reaching for Tamsen, “I am lovely, aren’t I?”  I take out Buggy 2. I tell the others I’m going for a drive through Hell’s Half Acre. I tell myself, if I can cut through the mold inside Tchaikovsky’s ship, there might still be some vodka left to sip on. I’m sporing like fuck.  The moon looks dead and nothing and grayscale, all everywhere forever. Rilles, ash cones, dark-halo craters, basaltic lowland seas, a deep regolith of iron and magnesium. The whole Oceanus Procellarum. It’s enough to lie down and never get back up, but not right now. Right now, there’s all this water, inside the moon, where we can’t even see it. And this mold, canary or freedom or piss yellow, is growing out of it, growing right now! I drive straight toward Tycho, fast. Leave it all behind. I drive and lean back in my seat and am satisfactorily lightweight because instead of thinking about the moon, I’m thinking about what’s gone. Denver. Donner Pass. Nights in winter. I’m reciting lines over a defunct vidchannel: “Goodnight clocks and goodnight socks, goodnight little house and goodnight mouse.”  I daze out. My eyes close while I speed across an ancient seabed. Crystal clear, I remember lying in their bed, the nightlamp warming my face, their cold feet crowding around mine. My wife comes in to check on us. I don’t need her to smile to know that if the world ended at that exact moment, there’d be nothing she’d change. When I open my eyes, all thoughts go, like air through a crack in my helmet.  There’s the moldline, as sick and as yellow as ever.  The latitude’s all wrong; the Russian’s ship is still four miles south. But here, at the edge of that advancing fungal bloom, stands Tchaikovsky.  It’s him all right. Not flesh and silver and Kevlar; instead, he’s made of mold, completely and utterly.  Mold: Jesus.  After I climb out of the buggy, I don’t know whether to ask him for the secret of sustainable water or cleave him to pieces.  “Ve vant to vin,” he says in a gurgling version of his accent. How I can hear him with the radio out, I am at a loss to explain. He opens his fist to reveal a toppled king piece carved of mold. I think of Vinegar Tom knocking over my own king and that dredges up all the ire the sporing had anchored down.  “You’re not going to vin this time,” I say. “No hallucination could, cosmonaut or not.”  “No hallucination.” He pounds his inflated chest once with a fist that could easily be mistaken for a cheese wheel. “Ze cosmetic is ready!”  “That’s what a hallucination would say.”  He shrugs.  I don’t have the patience for this kind of high. My eyes itch, my sinuses suddenly burn. I tilt my head back until it passes. All across the sky, stars flash. In-between them don’t flash millions of other stars, dark, as if forgotten or not even there. Below, the Earth looks painted on space. Out of the blue, I miss things. Afternoon thunderstorms. Playgrounds and fruit snacks. Creaky wooden stairs.  The euphoria’s already slipping. I find myself unable to walk away without asking, “What’s happening? What’s the Dreammold! doing?”  “It grows, vhat else?”  “But you. It. I don’t know.”  “I, zis part.” He flashes a peace sign before he joins the two fingers. “It is me.”  I look down at where his feet should be: only mold. “Do you still have all that vodka on your ship?”  “Does ze sleepy dog lie?”  “Great,” I say. “You’ve got seven moves to win.”  When the Russian laughs, the whole sea of mold ripples behind him. “Zis is good, Afraham Lincoln,” nodding his helmet as he goes on, “Free ze slaves, you can. But do not beat zer kitchens before zey are handbaskets.”  I have no idea what that means. But where his mix-ups were once amusing, now they’re sad, screwy lessons. More than ever, I wish I was standing in front of my wife.  He raises his arm to pound to his chest again, but then stops. Sometimes, even Tchaikovsky knows he’s made a mistake. “Zis, no, I am meanings somezing else. How you say, every cloud has dead horse.”  I taught my wife chess before she was my wife. It was a struggle at first. She wanted to flirt and I wanted her to be quiet. “You’re getting better.” I told her this when she wasn’t. But when I made the offhand wager that if she ever beat me I’d marry her, then she caught on quickly. She was always black. She favored the horsies. “Chess,” I once taught her, “is about all the moves you don’t make.” Sometimes we’d leave the game for the morning, having found each other’s feet under the table and then our clothes on the floor. One night she told me, “I think it’s more about the moves you can’t make anymore.” I said, “Maybe, honey,” to which she answered, “They tell you the next move.” I didn’t argue; instead, I tried thinking her way for once. That night she beat me for the first time.  When I return to the moldline with the chessboard, Tchaikovsky is gone and I’m missing my only knight. Vinegar Tom, I’m sure. When I get back to base, I’ll dump out all his Pepto-Bismol. For now, I don’t have any tools to carve a new piece. But there’s the mold, of which I grab a handful. I measure out the perfect size.  “You ever seen one up close?” Spitzer asks.  The four of us are north of Tycho, cutting mold squares and tossing them into the grill box. With the base radio still dead, we’ve had to break out the two-way walkie-talkies in our emergency kits. Thankfully, with a week to go, this is our last harvest load.  “I’ve seen pictures,” says Tamsen.  “The Megafaun Wars,” Spitzer says between strokes. “Sounds so far away.”  “One kissed me on the nose before I chopped it off.” I’ll believe a butcher on this.  I keep cleaving into the mold. Every fifth chop I wipe down the bladeface.  “Murph?”  I throw down my cleaver and I take up two baling hooks and I lift the mold square with a heavy grunt.  “He’s seen them all right,” says Vinegar Tom as he wipes off his own cleaver. “Old Murph had them over for breakfast one morning.” I picture his bucked-tooth grin in the darkness of his helmet. “Thing was, those Megafauns didn’t like his wife’s cooking. They sent it back; they wanted something fresh, something—”  The mold square in my grip doesn’t hit the ground before I’m already lunging for the bastard, ready to broil him in the grill box. As my head bangs into his chest, we both lose our footing. We hit the mold in a slow freefall—me punching his kidneys with the T-hook handles and him beating down on my back with the cleaver’s butt. Our suits are so thick we can’t really feel it, but it feels good to punch what’s soft and alive. Tamsen and Spitzer shout. Vinegar Tom slams my helmet with his and I pin his arms down in a bearhug. Then something tackles the both of us. We go rolling. Deeper into the mold, we punch and roll until we can’t anymore. Now all I can see is Tom’s name patch and all I can feel is something moving underneath us, then not. Tamsen keeps shouting.  We bury Spitzer in his suit. It was strange how we hadn’t even heard him gasp when the T-hook cracked his helmet. It only took seconds, I imagine.  I lock myself in my cabin. I flick off my radio. The walls are too close to pace more than four steps. I can’t sleep. Don’t want to eat. Don’t want to be near anybody but the Russian and even that sounds like an ordeal. I sit down at the same old chess game and plan the same old moves. Rd1+, Rd2+, Ne3, Rg2++.  I flip the game board into the air. The pieces scatter. I carve whatever pleasure I can out of stomping and grinding and smashing them until I’m surrounded by a gray haze. At this point I turn off the light, switch on my headlamp, and imagine my body atomizing in space, all everywhere forever.  A knock at my cabin door.  Tamsen: “You want to spore?”  Ten minutes later, I’m calm, cool. Tamsen’s yellow eyes glaze over as she sits on the bed opposite me. She cried while we buried Spitzer. I told her over the radio to pull it together, get serious. I’m sure she blames me. But there’s no sign of it now. I have to hand it to her, she would make a lovely lady to share a house and a family and a pet with. “Has anyone ever told you . . . ” but then I don’t know what I’m trying to ask.  “Told me what?”  Rising moments of sheer ecstatic nothing. Then: “Do you know any stories?”  “Only the worst.”  “I remember one, that’s all.”  “Better be a good one.”  “Goodnight comb and goodnight brush.”  Tamsen sprinkles more spores onto the foil strip. “Weird beginning.”  “Goodnight nobody and goodnight mush.”  Tamsen burns the spores, inhales, hands it off.  “Goodnight to the old lady whispering—” With the next toke, the sinus burn fades into this raincloud drizzle inside my face. It’s a slick, puffy kind of high. I can’t remember the rest. Instead: “I saw you and Tom.”  Tamsen goes into a loud coughing fit.  I shrug a little. “It’s fine. We’re all leaving soon.”  After she recovers, there’s this look on her tinted face that says all the things I haven’t thought of yet: that she already knows, that she’s sorry it happened this way, that if this wasn’t the moon and the Earth wasn’t dry and the animals down there weren’t huge and thirsty, we wouldn’t be up here, we wouldn’t even be us. I lean over to hand her the foil and lighter, but then I stay close. There is a place, on her jaw, that is still colored a fine peach, a place that I am now kissing, it and only it.  Another knock on the door.  Vinegar Tom comes in, Desperate Passage in hand. His skin practically glows. “You don’t look so hot,” I say, my voice catching on my lips still shaped around the kiss.  He looks from me to Tamsen then back to me. If he had a nose, it would have twitched with suspicion. Instead, there’s just a ripple in the folds. He’s in shorts and a muscle shirt. “I feel goddamn hot.”  Tamsen says, “Lay off the spores then.”  I can feel his eyes boring into me. “What are you two doing?” He looks worried.  “I never know,” I say. “Whatever we’re supposed to be doing.”  “Hatching a plan on where to bury me next, no doubt.”  “No doubt,” Tamsen says. “Debating how to cook you.”  “What parts to eat for dessert,” I add.  He reaches into his pocket. For a knife, no doubt, or an ice scream scoop. Defending myself is the last thing this tingling body’s ready for. Instead, Vinegar Tom throws something small at me. It hits my shoulder and lands in my lap: the black knight. “Left this in Buggy 2,” he says, “and we’re out of Pepto.”  Tamsen tells him there might be some in Buggy 1. He gives her another eyeful, says without looking at me, “Remember, Murph, if it was cheese out there, this’d be a whole different ball game,” then leaves without shutting the door.  Tamsen stands quickly, saying she ought to help him.  “Wait.”  She does, but the look from before has vanished. Now it’s just yellowyellowyellow again. Even the spot on her jaw. “I killed Spitzer, didn’t I.”  “Would I let a killer kiss me?”  “You’d leave one here by himself.”  “You’re right,” she says. “I would.”  The day before the transport’s arrival, I take another ride toward Tycho. By habit I bring the chessboard and the one knight with me. The moldline’s only ten miles from base camp and traveling upward of a mile every twelve hours. More and more I’ve decided that when the transport comes, I’m not going to get on it.  There’ll be the ride back with Tamsen and Tom, them sporing, maybe them trying to fuck one last time in zero-G, the life they’ll probably lead together if the vinegar doesn’t eat his insides, and then my house in Denver, the hole in my basement, no Ralphie. It’s death to stay up here, sure, but no different down there.  At the moldline, before I even climb out of Buggy 2, there’s Tchaikovsky. Something about that yellow makes him look exceedingly jolly, one capable of cartoon physics. “Come, come, let finish vhat ve began.” I expect him to burst into soap bubbles or grow nine feathery tails.  “Can’t. Lost all the pieces.”  “But you have not lost your hands, no?”  On our knees, we mold a new set together.  I lose.  Not because I was wrong about mate in eight moves—that’s entirely true.  I lost because he had me in seven. Because in the penultimate step, I moved my only knight and opened up the diagonal for his queen to slip in: Qf7++. He knew my plan all along.  I flick over my black king. “Checkmate.”  He nods.  “I’m going to stay here.”  “Ah, yis, more game.”  “No,” I say. “When the transport comes, I’m staying.” I feel overwhelmingly important.  Tchaikovsky sighs. He plays with one of his pawns. “You have heard Laika, no?”  A little.  “Laika you know is happy pioneer, big star.” He sweeps his hands over his head. Then he points at the Earth. “Real Laika?—she vas stray. Real Laika vas picked off streets of Moscow and put cage. No one vanted zis dog back, not after space. She vas flash in pan, already wodka under ze cake. Real Laika vas meant to die.”  “That’s terrible.” The flatness of my own voice unnerves me. I don’t want to talk.  “Is fine. She vas stray, no? Stray is hard life. Space death: very zimple.” He starts setting up the board again; I don’t have it in me for one more loss. “But it is day ’til launch. Real Laika ready. Ze stray is ready! Then scientist take Laika home. He let Laika play with childs. Scientist say, ‘I vanted to do somezing nice for her.’ Childs laugh. Laika love.”  “So she had a good last day; so what?”  “Only good day, Afraham Lincoln. Vithout zis day, she is happy pioneer to beyond. But now she knows.” Tchaikovsky twists his finished pieces so they all face forward, face me. “Childs. Toys. Laughs. Laika vants to come back to zis one good day.”  The chessboard’s empty spaces, Mare Nubium and the sea of yellow mold, the Earth above the horizon like a cheap sticker on a tinted window—a man stands practically weightless in all these gravities, remembering only how his daughters once asked him if dogs knew human words.  “It’s not a place I want to go back to.”  “But it is place,” Tchaikovsky says, pushing his king’s pawn to e4. “And ze moon—ze moon is not.”  I sit down in front of the board. I pick up my black knight. Its slope and eye-notch, this craftsmanship, all are meticulously fine, each one better than the last carving’s. Instead of pushing the bishop’s pawn forward—c6—in the Sicilian Defense, I swing my knight out first.  Rubbing his hands together like big paws, Tchaikovsky looks pleased with my decision. “You are getting better.” Alexander Lumans graduated from the M.F.A. Fiction Program at Southern Illinois University Carbondale. His short fiction has been published in or is forthcoming from Brain Harvest, Story Quarterly, Blackbird, The Normal School, Cincinnati Review, American Short Fiction, Surreal South '11, and The Book of Villains, among other magazines and anthologies. He was a Tennessee Williams Scholar at the 2010 Sewanee Writers' Conference and he won the 2011 Barry Hannah Fiction Prize from The Yalobusha Review. He also recently completed a fellowship at the MacDowell Colony. He now lives and teaches in Boulder, CO. His very first short fiction publication was in Clarkesworld over five years ago.", "text": "5430 words, short story\nAll the Things the Moon Is Not\nA call comes over the vidchannel: “Murph, you sitting down?”\n“Always.” At the moment I’m standing in my darkened cabin at base camp in Mare Nubium. By headlamp only I carve a chess piece—a knight—out of moon rock. I’d crushed one earlier after Tchaikovsky called me out on a dumb move.\nThe screen and radio cut out. I switch channels, then switch back to hear: “Get up. You need to see this.” Tamsen sounds serious. She always sounds serious. It’s one of the things I like most about her.\n“I’m busy.” I keep sanding the knight’s head. When no response follows, just space static, I give in. “What is it?”\nMore static, then: “The Russians.”\nI blow on the knight. Moondust reels through the headlamp’s beam. I think it beautiful. I’d carved this set my first month here on the moon. The dust I compare to stars. The space between them, too, is beautiful. And the same old lines are running through my head—Goodnight room, goodnight moon—the ones I’d read in bed to my daughters. I grab the mic: “Tell Tchaikovsky he needs to ready his Nastoyka supply.”\nTchaikovsky is a mold pirate, the one thing we have in the way of a rival. But he’s also a good chess player. He studied his masters. Knew openings I’d never heard of. He’s the only distraction here that keeps me honest. Down on Earth, who has the calm or the fire for chess anymore? Since our four-man crew arrived late last August to harvest the Dreammold!, I’ve been in two modes: defend and defend again. Whether it’s harvesting, carving, or playing, give it 98%. I’ve always been one to open my games with the tried and true; Sicilian Defense all the way. Only recently have I begun to wonder if this is the right way to go about it. Tchaikovsky and I have an unfriendly wager: loser ponies up a bottle of their nation’s choicest liquor. By my count, I’ve handed over seventeen handles of Maker’s Mark. And he? Not a drop of vodka.\nIn four weeks the transport will be here to take us home. I want to win, for once. I want things to go my way.\n“We found their ship.”\n“There’s plenty of mold out there,” I tell her. “Let the little cosmonaut stake his claim.” I’ve given up playing moon ranger. A year in one-sixth gravity and white rooms and the company of little love does that to good intentions.\nThis time, not even static.\n“Tamsen.” I set the knight on d5. “Tamsen?”\n“—the problem.” I only catch this last part. But I am busy. A good kind of busy. In eight moves, I’ll have the Russian mated—Rg2++—even after losing my queen early on. And now Tamsen, with whatever problem there is, has carved that good feeling out of me.\nIn Buggy 2, I zoom south to her position at the edge of Tycho Crater. It’s where we go for the best mold harvesting. I can throw a rock into the crater and watch the moldripples go on for miles: yellowyellowyellow. “Twenty-eight days,” I remind myself.\nTamsen’s standing by Buggy 1, big gloved hands on her big suited hips. She’s radioed the rest of the crew too. Bouncing around in our suits, the four of us resemble primitive undersea divers with portholes for masks and twin oxygen tanks. Spitzer’s busy poking the mold. When I used to hear the Rockies’ announcer describe a batter with “warning track power,” I didn’t realize I was imagining Spitzer. Long-limbed and morally impulsive, he’s always asking me, “When do I get to stab the flagpole into something?” Vinegar Tom—he’s just staring into the crater. I’m thankful for our helmets. Yesterday, I’d walked in on him and Tamsen fucking in her room—they didn’t see me—and now I don’t want to look him in the face for the rest of the mission. Not out of shame, but because he got to her first, because it made me realize I’ve always hated this planet. Him. His copy of Desperate Passage: The Donner Party’s Perilous Journey West that he intently flips through in the mess hall like he’s studying one of the buggies’ operation manuals.\nTamsen taps her helmet. I tap mine back. The vidchannel and radio have been fritzing. We haven’t talked with mission control since Tuesday and we don’t know what’s wrong with the transmitter. All we hear back is fuzz.\nBeyond her and the others, at the crater’s edge, I see Tchaikovsky’s ship. And I see the mold; that is the problem. What had been his illegal operation is now covered in the Dreammold!, utterly and completely. It’s as if Tycho burped up some fantastic wave that came crashing down mid-ops. The scene reminds me of Denver, the day after.\nI draw a finger across my neck, point at the Russians’ ship, and then shrug. We bounce over to it and pry open the bay door. The vessel’s guts are clogged with as much yellow gunk as the outer shell is coated.\nA flash in me of something Tchaikovsky’d said after taking my queen: “Ze bigger zey are, Afraham Lincoln, ze more it rains rats and clogs.” He was forever butchering Americanisms, but sometimes I had to admire the results. They made as much sense on the moon as anything else did back home.\nFifty feet from the Russian’s ship, Tamsen’s waving me over. She stands calf-deep in mold on the crater’s rim. At her feet is a single set of boot tracks. It leads from the ruined ship out into Tycho’s depths.\nBack at base camp, I stare at the same game from before.\n“So the mold is moving,” says Vinegar Tom from behind me. His voice always sounds surprisingly nasal; surprising because he’s missing his nose. It makes his bucked teeth stand out all the more. “Now we don’t have to drive as far to get it.”\nI’m too preoccupied to respond and too besieged to care.\n“You had your games with the Commie, I know. It’s terrible. A bad way to go. But we’ve all seen terrible things on the news.” I can hear the smirk in his voice, smell the vinegar on his breath. He’d quit the space program to be a butcher in Ohio, but when The Drought killed that industry, he came trudging back to Cape Canaveral. “Though I suppose some of us have seen it up close,” he goes on. “Been able to smell the terrible.” He reaches around from behind me and flicks over the white king.\n“That’s my king, asshole.”\n“I know.”\nAfter I finish wiping the blood from Vinegar Tom’s lip off my elbow, I say, “Touch my game again, see what happens.”\nHe looks down at the board, then at me, as if considering it. He’s short and brash and sporadically clean-shaven. Exactly the kind of man I can picture behind a meat counter. The skinfolds where his nose should be remind me of how the Rocky Mountains look on military raised-relief maps. “If we have to eat each other at some point between now and the 30th,” he says, “I’m going to make you eat me.”\nAn hour later, I set the white king upright. Eight moves: 37. Qb3 Rd1+ 38. Kg2 Rd2+ 39. Kg3 Ne3 40. Qxe3 Rg2++. I pick up my newest knight. The jawline is clean, the eyes sharp notches. Calmly, I hurl it at the cabin wall. It hits hard and slowly fragments.\nI imagine the conversation at NASA went something like this:\n“Sir, the moon is shiny.”\n“It’s always been shiny.”\n“No, sir, there are shiny parts.”\n“Today is not April Fool’s Day.”\n“Telescope Two picked them up.”\n“Shiny parts?”\n“We thought it was silver.”\n“Moonsilver. That has a good ring to it.”\n“It’s not silver.”\n“Okay. Mercury, rhodium, zinc, what isn’t it?”\n“Telescope Two is a very good telescope.”\n“Moonsilver.”\n“First, sir, it’s important that we keep this a secret.”\n“I agree. Everyone likes jewelry. Everyone’s a magpie.”\n“That’s not what we mean.”\n“Tell me already. You’re killing me here!”\n“It’s water.”\n“Is water shiny?”\n“We found shiny water. On the moon.”\n“Shit.”\n“That’s what we’re supposed to say: ‘shit.’ We said you wouldn’t say that.”\n“Who knows about this?”\n“Everyone. Everyone’s a magpie for this kind of news.”\n“And you’re sure it’s not April Fool’s?”\n“We’re sure it’s not silver.”\n“Shit.”\nBy then, The Drought had settled in, five long years and still holding strong. Ice, Aquafina, and public pools were all things of the past. The U.S.’s initial investigative moonlanding found plenty of water. And it found what was growing in the water, too: the mold. We sampled it, brought it to Florida, found it useful. So the U.S. pushed through amendments to the TRIPS agreement to include protections for other planets’ resources. And they shipped the four of us up here to harvest it for a year until the next round of crewmen arrives.\nWe know it’s been almost a year because of the calendar in the mess hall. Each month features a new war poster.\n“Ten fingers good! Eight claws bad!”\n“Use your thumbs! Recycle your scrap metal and keep the MegaHun at bay!”\n“When you live alone, you live with Megafauns.”\nVinegar Tom says they’re invigorating. I’m sick of them. But there’s little else to focus on between sleeping and eating and sporing and fighting and fucking. And work.\nThe word Dreammold! once summoned in me the image of a fantasyland of iridescent clouds. Now I can’t think of a less suitable name. It’s this terrible yellow, with the look of cauliflower heads but the consistency of dry, packed snow.\nOur only tools: large meat cleavers, T-handle baling hooks, and what’s essentially a giant George Foreman. Everything’s run on solar, even the powercyclers that pump out our CO2. I’d be thrilled by the technology if I thought it’d actually save me.\nStep 1: Cut four-by-four squares out of the moldline.\nStep 2: Hook the square on both sides and lift free.\nStep 3: Place in grill box and seal shut.\nThe box broils the mold and compresses it. These hard pancakes go into storage until the semi-monthly unmanned cargo capsule arrives. Then we unload the capsule’s supplies (dried food, Maker’s Mark, oxygen tanks) before stacking the pancakes in its bay and sending it back to be fashioned into fuel, fixodent, and firearms for the Megafaun War.\nThe hordes hit Denver three days before I was scheduled for liftoff. I was there. Home with my family, eating chocolate chip waffles. The first wave struck late that morning. Wild pigs with mammoth tusks and armor plating. The ground shook. The South Platte sewage flowed backward. Then the rest of the Megafauns streamed out of the mountains, as if they’d been hiding there for centuries, breeding, tripling in size. So thirsty and fast. The winged kind broke into the top floor of the CenturyLink Tower. Fifty-point elks and shaggy aardvarks nested in INVESCO Field. Horned bears with snouts shaped like ice cream scoops covered the suburbs in blood and fur. They came for my family—wife, daughter, younger daughter, youngest daughter, our fox terrier Ralph, me—but we hid in the basement. I thought we’d be fine with a barricaded door. Before dark, I went upstairs for food with Ralph on my heels. Only, he bolted through the doggy door. I found myself chasing him down the street, imagining my daughters’ streaming faces if I had to tell them I lost Ralphie. A block down, heavy grunts sounded from someone’s garage. I had to run home empty-handed. But when I came back down into the basement, arms full of consolation Fruit Roll-Ups and Zebra Cakes and no dog, all I came back to was this big hole. Taken, and not even with a loud crashing I could replay in my head. Just nothing nowhere forever. It must have only taken seconds. I sat down on the stairs. I only thought I heard barking. I ate three Fruit Roll-Ups. I ate six Zebra Cakes. I waited. And when they didn’t come back, I slept in my youngest daughter’s bed, saying, goodnight nobody.\nIn the mess hall, Tamsen and Spitzer are seated on the floor by the powercycler vent. Contact with mission control is still nil. On the calendar, the 30th is circled in red. This month’s poster: a picture of a salivating mastodon-wolf looming over the caption: “The world cannot exist half-slave and half-food: Fight for Freedom!” Vinegar Tom sits backward on a chair, slouched forward and smiling wide at me. It doesn’t help my already sour mood: no more chess, no more liquor, even the prospect of shipping off-planet seems impossibly far away, as if we wouldn’t survive each other’s company another day. The three of them pass around foil stripped from an air duct and a twin-pronged nosetube and a lighter rigged from the grill box’s heatcoils.\n“Keep sporing,” I say as I crouch between them, “and you’ll sour the meat.”\nAfter Spitzer discovered you could freebase the mold—“sporing,” he named it—I opted out. How do you go 98% while spun on fungus? It’s practically a Class-1 drug, complete with four-hour euphoria, hallucinatory episodes, tingling. It also had a nasty tendency to gum up Vinegar Tom’s intestinal system if he didn’t take the right precautions. Yes, people need outlets.\n“Can we go claim some mountain in the name of us?”\n“Can I please plant the flagpole?”\n“Can we sleep together now?”\nSporing also does wonders for the skin. The three of them are tinted gold, Tamsen the deepest. She has dark blonde hair to match, arms and legs that I’d only assumed were well-toned until recently, and a small tight face I started wanting to kiss too late. She sprinkles more spores onto the foil strip, clicks the lighter until the coils at its tip redden. Then, positioning the tube in her nose, she inhales deeply. These are the only times I ever see her relax. Relaxed people—lazy people—worry me.\nTamsen looks straight into my eyes and says, “You’re a lovely man.” This has all the meaning in the world, and none of it. “Has anyone ever told you how lovely you are?” I try to forget her moans, the image of her body thrusting under Vinegar Tom’s. How she could go for a guy without a nose was beyond me. “I mean it, Murph. You’re glorious.” She passes the foil to Vinegar Tom and leans back against the wall. “Like a baby’s mobile. The kind with the lights and funny animals.”\nSpitzer laughs at her. I want her to go back to being serious. My wife was serious.\n“You want to hear something fucked up?” asks Vinegar Tom.\nI don’t.\n“When the Donner Party got stranded in those mountains, they say they only fed the body parts to the youngest children. The youngest children, like three-year-olds. They did it even though they knew help was on the way. Isn’t that fucked up?”\nTamsen kicks his chair, but not hard enough to knock it over. “Has anyone ever told you how morbid you are?” Her eyes are lit up, her face radiant with spores.\nSpitzer clucks his tongue and swings his arms together like a batter. “Another moon shot for Noseless Tom Jackson.” He, too, is shining.\nThe air vent kicks into a louder second powercycling stage. It sounds like a roar coming from the drooling, tusked wolf on the wall. I feel my lungs squeeze in. After a year, even the canned oxygen has begun to taste stale.\n“That Dreammold!’s something else,” Vinegar Tom finally says. “All that canary yellow.” He reaches under his chair for two bottles: one of industrial-grade white vinegar and one of Pepto-Bismol. The vinegar kills the spores in his stomach; the pink stuff keeps the vinegar’s acid from eating more holes. He takes chugs from both bottles and grimaces after each.\nTamsen says, “It’s mustard, if anything.”\n“Mustard?” Spitzer throws up his arms. “It’s gamboge. Pure gamboge yellow.”\nI say, “I always thought it looked like cheese.”\nThey stare at me—“Cheese.”—they shake their heads.\n“It’s goldenrod.”\n“No, it’s a mix of lemon and sunglow.”\n“Call it Peridot.”\n“In some language somewhere, it means ‘precious’ and ‘ripe.’”\n“Freedom yellow.”\n“Yellow-bellied coward.”\n“Macaroni and cheese,” I amend.\nVinegar Tom claps me on the back. “Like Tamsen says, you’re a lovely guy, but the moon ain’t made of cheese.” Everyone but me exchanges chuckles between spore passes. They take solace in this negative definition: it’s not cheese.\nI stand up. They watch me with big pupils, sclera yellow at the corners. Tamsen says to stay, holding out the foil and lighter. On the calendar, the 16th, today, is already crossed out. Fifteen more days of what? With Tchaikovsky gone, they’re all I have. “Hell,” I say, crouching back down and reaching for Tamsen, “I am lovely, aren’t I?”\nI take out Buggy 2. I tell the others I’m going for a drive through Hell’s Half Acre. I tell myself, if I can cut through the mold inside Tchaikovsky’s ship, there might still be some vodka left to sip on. I’m sporing like fuck.\nThe moon looks dead and nothing and grayscale, all everywhere forever. Rilles, ash cones, dark-halo craters, basaltic lowland seas, a deep regolith of iron and magnesium. The whole Oceanus Procellarum. It’s enough to lie down and never get back up, but not right now. Right now, there’s all this water, inside the moon, where we can’t even see it. And this mold, canary or freedom or piss yellow, is growing out of it, growing right now! I drive straight toward Tycho, fast. Leave it all behind. I drive and lean back in my seat and am satisfactorily lightweight because instead of thinking about the moon, I’m thinking about what’s gone. Denver. Donner Pass. Nights in winter. I’m reciting lines over a defunct vidchannel: “Goodnight clocks and goodnight socks, goodnight little house and goodnight mouse.”\nI daze out. My eyes close while I speed across an ancient seabed. Crystal clear, I remember lying in their bed, the nightlamp warming my face, their cold feet crowding around mine. My wife comes in to check on us. I don’t need her to smile to know that if the world ended at that exact moment, there’d be nothing she’d change. When I open my eyes, all thoughts go, like air through a crack in my helmet.\nThere’s the moldline, as sick and as yellow as ever.\nThe latitude’s all wrong; the Russian’s ship is still four miles south. But here, at the edge of that advancing fungal bloom, stands Tchaikovsky.\nIt’s him all right. Not flesh and silver and Kevlar; instead, he’s made of mold, completely and utterly.\nMold: Jesus.\nAfter I climb out of the buggy, I don’t know whether to ask him for the secret of sustainable water or cleave him to pieces.\n“Ve vant to vin,” he says in a gurgling version of his accent. How I can hear him with the radio out, I am at a loss to explain. He opens his fist to reveal a toppled king piece carved of mold. I think of Vinegar Tom knocking over my own king and that dredges up all the ire the sporing had anchored down.\n“You’re not going to vin this time,” I say. “No hallucination could, cosmonaut or not.”\n“No hallucination.” He pounds his inflated chest once with a fist that could easily be mistaken for a cheese wheel. “Ze cosmetic is ready!”\n“That’s what a hallucination would say.”\nHe shrugs.\nI don’t have the patience for this kind of high. My eyes itch, my sinuses suddenly burn. I tilt my head back until it passes. All across the sky, stars flash. In-between them don’t flash millions of other stars, dark, as if forgotten or not even there. Below, the Earth looks painted on space. Out of the blue, I miss things. Afternoon thunderstorms. Playgrounds and fruit snacks. Creaky wooden stairs.\nThe euphoria’s already slipping. I find myself unable to walk away without asking, “What’s happening? What’s the Dreammold! doing?”\n“It grows, vhat else?”\n“But you. It. I don’t know.”\n“I, zis part.” He flashes a peace sign before he joins the two fingers. “It is me.”\nI look down at where his feet should be: only mold. “Do you still have all that vodka on your ship?”\n“Does ze sleepy dog lie?”\n“Great,” I say. “You’ve got seven moves to win.”\nWhen the Russian laughs, the whole sea of mold ripples behind him. “Zis is good, Afraham Lincoln,” nodding his helmet as he goes on, “Free ze slaves, you can. But do not beat zer kitchens before zey are handbaskets.”\nI have no idea what that means. But where his mix-ups were once amusing, now they’re sad, screwy lessons. More than ever, I wish I was standing in front of my wife.\nHe raises his arm to pound to his chest again, but then stops. Sometimes, even Tchaikovsky knows he’s made a mistake. “Zis, no, I am meanings somezing else. How you say, every cloud has dead horse.”\nI taught my wife chess before she was my wife. It was a struggle at first. She wanted to flirt and I wanted her to be quiet. “You’re getting better.” I told her this when she wasn’t. But when I made the offhand wager that if she ever beat me I’d marry her, then she caught on quickly. She was always black. She favored the horsies. “Chess,” I once taught her, “is about all the moves you don’t make.” Sometimes we’d leave the game for the morning, having found each other’s feet under the table and then our clothes on the floor. One night she told me, “I think it’s more about the moves you can’t make anymore.” I said, “Maybe, honey,” to which she answered, “They tell you the next move.” I didn’t argue; instead, I tried thinking her way for once. That night she beat me for the first time.\nWhen I return to the moldline with the chessboard, Tchaikovsky is gone and I’m missing my only knight. Vinegar Tom, I’m sure. When I get back to base, I’ll dump out all his Pepto-Bismol. For now, I don’t have any tools to carve a new piece. But there’s the mold, of which I grab a handful. I measure out the perfect size.\n“You ever seen one up close?” Spitzer asks.\nThe four of us are north of Tycho, cutting mold squares and tossing them into the grill box. With the base radio still dead, we’ve had to break out the two-way walkie-talkies in our emergency kits. Thankfully, with a week to go, this is our last harvest load.\n“I’ve seen pictures,” says Tamsen.\n“The Megafaun Wars,” Spitzer says between strokes. “Sounds so far away.”\n“One kissed me on the nose before I chopped it off.” I’ll believe a butcher on this.\nI keep cleaving into the mold. Every fifth chop I wipe down the bladeface.\n“Murph?”\nI throw down my cleaver and I take up two baling hooks and I lift the mold square with a heavy grunt.\n“He’s seen them all right,” says Vinegar Tom as he wipes off his own cleaver. “Old Murph had them over for breakfast one morning.” I picture his bucked-tooth grin in the darkness of his helmet. “Thing was, those Megafauns didn’t like his wife’s cooking. They sent it back; they wanted something fresh, something—”\nThe mold square in my grip doesn’t hit the ground before I’m already lunging for the bastard, ready to broil him in the grill box. As my head bangs into his chest, we both lose our footing. We hit the mold in a slow freefall—me punching his kidneys with the T-hook handles and him beating down on my back with the cleaver’s butt. Our suits are so thick we can’t really feel it, but it feels good to punch what’s soft and alive. Tamsen and Spitzer shout. Vinegar Tom slams my helmet with his and I pin his arms down in a bearhug. Then something tackles the both of us. We go rolling. Deeper into the mold, we punch and roll until we can’t anymore. Now all I can see is Tom’s name patch and all I can feel is something moving underneath us, then not. Tamsen keeps shouting.\nWe bury Spitzer in his suit. It was strange how we hadn’t even heard him gasp when the T-hook cracked his helmet. It only took seconds, I imagine.\nI lock myself in my cabin. I flick off my radio. The walls are too close to pace more than four steps. I can’t sleep. Don’t want to eat. Don’t want to be near anybody but the Russian and even that sounds like an ordeal. I sit down at the same old chess game and plan the same old moves. Rd1+, Rd2+, Ne3, Rg2++.\nI flip the game board into the air. The pieces scatter. I carve whatever pleasure I can out of stomping and grinding and smashing them until I’m surrounded by a gray haze. At this point I turn off the light, switch on my headlamp, and imagine my body atomizing in space, all everywhere forever.\nA knock at my cabin door.\nTamsen: “You want to spore?”\nTen minutes later, I’m calm, cool. Tamsen’s yellow eyes glaze over as she sits on the bed opposite me. She cried while we buried Spitzer. I told her over the radio to pull it together, get serious. I’m sure she blames me. But there’s no sign of it now. I have to hand it to her, she would make a lovely lady to share a house and a family and a pet with. “Has anyone ever told you . . . ” but then I don’t know what I’m trying to ask.\n“Told me what?”\nRising moments of sheer ecstatic nothing. Then: “Do you know any stories?”\n“Only the worst.”\n“I remember one, that’s all.”\n“Better be a good one.”\n“Goodnight comb and goodnight brush.”\nTamsen sprinkles more spores onto the foil strip. “Weird beginning.”\n“Goodnight nobody and goodnight mush.”\nTamsen burns the spores, inhales, hands it off.\n“Goodnight to the old lady whispering—” With the next toke, the sinus burn fades into this raincloud drizzle inside my face. It’s a slick, puffy kind of high. I can’t remember the rest. Instead: “I saw you and Tom.”\nTamsen goes into a loud coughing fit.\nI shrug a little. “It’s fine. We’re all leaving soon.”\nAfter she recovers, there’s this look on her tinted face that says all the things I haven’t thought of yet: that she already knows, that she’s sorry it happened this way, that if this wasn’t the moon and the Earth wasn’t dry and the animals down there weren’t huge and thirsty, we wouldn’t be up here, we wouldn’t even be us. I lean over to hand her the foil and lighter, but then I stay close. There is a place, on her jaw, that is still colored a fine peach, a place that I am now kissing, it and only it.\nAnother knock on the door.\nVinegar Tom comes in, Desperate Passage in hand. His skin practically glows. “You don’t look so hot,” I say, my voice catching on my lips still shaped around the kiss.\nHe looks from me to Tamsen then back to me. If he had a nose, it would have twitched with suspicion. Instead, there’s just a ripple in the folds. He’s in shorts and a muscle shirt. “I feel goddamn hot.”\nTamsen says, “Lay off the spores then.”\nI can feel his eyes boring into me. “What are you two doing?” He looks worried.\n“I never know,” I say. “Whatever we’re supposed to be doing.”\n“Hatching a plan on where to bury me next, no doubt.”\n“No doubt,” Tamsen says. “Debating how to cook you.”\n“What parts to eat for dessert,” I add.\nHe reaches into his pocket. For a knife, no doubt, or an ice scream scoop. Defending myself is the last thing this tingling body’s ready for. Instead, Vinegar Tom throws something small at me. It hits my shoulder and lands in my lap: the black knight. “Left this in Buggy 2,” he says, “and we’re out of Pepto.”\nTamsen tells him there might be some in Buggy 1. He gives her another eyeful, says without looking at me, “Remember, Murph, if it was cheese out there, this’d be a whole different ball game,” then leaves without shutting the door.\nTamsen stands quickly, saying she ought to help him.\n“Wait.”\nShe does, but the look from before has vanished. Now it’s just yellowyellowyellow again. Even the spot on her jaw. “I killed Spitzer, didn’t I.”\n“Would I let a killer kiss me?”\n“You’d leave one here by himself.”\n“You’re right,” she says. “I would.”\nThe day before the transport’s arrival, I take another ride toward Tycho. By habit I bring the chessboard and the one knight with me. The moldline’s only ten miles from base camp and traveling upward of a mile every twelve hours. More and more I’ve decided that when the transport comes, I’m not going to get on it.\nThere’ll be the ride back with Tamsen and Tom, them sporing, maybe them trying to fuck one last time in zero-G, the life they’ll probably lead together if the vinegar doesn’t eat his insides, and then my house in Denver, the hole in my basement, no Ralphie. It’s death to stay up here, sure, but no different down there.\nAt the moldline, before I even climb out of Buggy 2, there’s Tchaikovsky. Something about that yellow makes him look exceedingly jolly, one capable of cartoon physics. “Come, come, let finish vhat ve began.” I expect him to burst into soap bubbles or grow nine feathery tails.\n“Can’t. Lost all the pieces.”\n“But you have not lost your hands, no?”\nOn our knees, we mold a new set together.\nI lose.\nNot because I was wrong about mate in eight moves—that’s entirely true.\nI lost because he had me in seven. Because in the penultimate step, I moved my only knight and opened up the diagonal for his queen to slip in: Qf7++. He knew my plan all along.\nI flick over my black king. “Checkmate.”\nHe nods.\n“I’m going to stay here.”\n“Ah, yis, more game.”\n“No,” I say. “When the transport comes, I’m staying.” I feel overwhelmingly important.\nTchaikovsky sighs. He plays with one of his pawns. “You have heard Laika, no?”\nA little.\n“Laika you know is happy pioneer, big star.” He sweeps his hands over his head. Then he points at the Earth. “Real Laika?—she vas stray. Real Laika vas picked off streets of Moscow and put cage. No one vanted zis dog back, not after space. She vas flash in pan, already wodka under ze cake. Real Laika vas meant to die.”\n“That’s terrible.” The flatness of my own voice unnerves me. I don’t want to talk.\n“Is fine. She vas stray, no? Stray is hard life. Space death: very zimple.” He starts setting up the board again; I don’t have it in me for one more loss. “But it is day ’til launch. Real Laika ready. Ze stray is ready! Then scientist take Laika home. He let Laika play with childs. Scientist say, ‘I vanted to do somezing nice for her.’ Childs laugh. Laika love.”\n“So she had a good last day; so what?”\n“Only good day, Afraham Lincoln. Vithout zis day, she is happy pioneer to beyond. But now she knows.” Tchaikovsky twists his finished pieces so they all face forward, face me. “Childs. Toys. Laughs. Laika vants to come back to zis one good day.”\nThe chessboard’s empty spaces, Mare Nubium and the sea of yellow mold, the Earth above the horizon like a cheap sticker on a tinted window—a man stands practically weightless in all these gravities, remembering only how his daughters once asked him if dogs knew human words.\n“It’s not a place I want to go back to.”\n“But it is place,” Tchaikovsky says, pushing his king’s pawn to e4. “And ze moon—ze moon is not.”\nI sit down in front of the board. I pick up my black knight. Its slope and eye-notch, this craftsmanship, all are meticulously fine, each one better than the last carving’s. Instead of pushing the bishop’s pawn forward—c6—in the Sicilian Defense, I swing my knight out first.\nRubbing his hands together like big paws, Tchaikovsky looks pleased with my decision. “You are getting better.”\nAlexander Lumans graduated from the M.F.A. Fiction Program at Southern Illinois University Carbondale. His short fiction has been published in or is forthcoming from Brain Harvest, Story Quarterly, Blackbird, The Normal School, Cincinnati Review, American Short Fiction, Surreal South '11, and The Book of Villains, among other magazines and anthologies. He was a Tennessee Williams Scholar at the 2010 Sewanee Writers' Conference and he won the 2011 Barry Hannah Fiction Prize from The Yalobusha Review. He also recently completed a fellowship at the MacDowell Colony. He now lives and teaches in Boulder, CO. His very first short fiction publication was in Clarkesworld over five years ago.", "source": "https://clarkesworldmagazine.com/lumans_05_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: All the Things the Moon is Not by Alexander Lumans"}