{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Greg Egan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5dmwS+l1ThLsfIaUTG/W+v04B2w=", "id": null, "license": null, "comments": "", "raw_text": "10010 words, novelette  Dream Factory  1  “Any pets?” Justine asked, glancing up from the checklist on her phone.  “No,” James replied, hopeful that this might count in his favor, though it was hard to read his interrogator’s demeanor. She’d said she was a law student, and he could already imagine her in a courtroom, calmly trapping duplicitous witnesses in the web of their own lies. Her two current housemates, both philosophy majors, were sitting on the couch beside her, but whatever they were doing on their own phones seemed entirely unrelated to the interview.  “Any allergies?” Justine continued.  “Umm, only pollen. As far as I know.”  “I meant allergies to pets,” Justine explained. “We have a cat, Pawpaw. Though if you have any serious food allergies, that would be good to know, too.”  James said, “We had a cat when I was a kid. I’m definitely not allergic to cats. Or peanuts.”  “Can you pay two weeks’ rent in advance, plus one more for the security deposit?”  “Yes.”  At the mention of rent, Ferouz and Lisa looked up. They exchanged glances with Justine; none of them seemed to need spoken language to confer.  Justine said, “Welcome to number 37.”  “Thank you.” James transferred the money, and when the real estate agent’s computer responded with a receipt acknowledging that his name had been added to the lease, he felt the tension in his shoulders ebbing away. He’d only had three more days left to find a new place.  As the interview panel rose to their feet, a small black-and-white cat padded into the room, tail high, mewing. Lisa crouched down and stroked its head, and it immediately began purring loudly and pressing back against her fingers.  “Wow, he’s affectionate,” James observed. “Or she?”  “He, but he’s neutered,” Ferouz replied.  “You should introduce yourself,” Lisa suggested. When she stepped away, the cat turned around and stared up at her pleadingly, so James quickly squatted down and took her place. Pawpaw responded as enthusiastically as he had to the more familiar human, rubbing his skull against James’ knuckles as if nothing could be more satisfying.  James couldn’t help smiling, but then he realized that the odd changes in texture he’d noticed were not tangled bits of fur, but small lumps beneath the skin. “Has he got ticks or something? On his head?” Maybe all this rubbing was about trying to dislodge the parasites or at least deal with the itch.  Lisa laughed. “No, that’s the interface.”  “I’m sorry?”  She gestured with her hands spread above her skull. “The Bluetooth antennas for the electrodes.”  “You put electrodes in your cat’s brain?”  “Noemi had them installed,” Ferouz interjected. “Pawpaw was hers. But then she had to leave the country, and she couldn’t take him with her.”  “Okay.” James didn’t want to assume it would be safe to bad-mouth the housemate he was replacing; they might have all adored her and entirely approved of her decision.  “She only did it so he wouldn’t attack the native wildlife,” Lisa said, taking over stroking duty. “It would be cruel to keep him locked up inside; the software stops him catching birds when he goes out.”  “Wouldn’t a bell on his collar do the same?”  “The studies show that this is four times more effective. And it doesn’t bother him at all. I mean, does he look miserable to you?”  “No,” James admitted. The cat was purring madly. But was that a genuine response to the company of the housemates, or just the software in his collar dictating how he felt?  The whole thing made him queasy, but what was he supposed to do? Make plans to spirit Pawpaw away to a deprogramming facility? Give up his place here and spend the next month trying to claw his money back, so he could feel virtuous while changing nothing?  There were a million worse things happening every day, and the cat wasn’t suffering in any ordinary sense of the word. Lecturing these people about a situation they hadn’t even chosen themselves would just make him seem obnoxious and set him up for a miserable tenancy until they managed to eject him.  “Can I move in today?” he asked.  2  “Remember the product rule?” James prompted Leon. “The swimming pool, with both sides getting larger?”  “No,” Leon replied stubbornly. “You never told me anything about a swimming pool.”  James knew better than to contradict him. “If you increase the lengths of both sides of a swimming pool, the biggest change in the area will come along the sides: the length of one side times the change in the other, plus the length of the second side times the change in the first.” He sketched the rectangles, for the ninth or tenth time.  “Yeah, but the water will just get lower,” Leon pointed out. “Which is where your whole argument falls down. You’re ignoring the conservation of water.” He tipped his chair back and regarded James with triumphant contempt.  “So what’s the slope of x times cos x?” James pressed him. “If you don’t think you need the product rule, find it another way, but there has to be an answer.”  Leon disagreed. “It’s a trick question. You can’t just multiply anything you want. x is an angle, but cos x is something else. It’s like multiplying apples and oranges.”  “You mean like . . . newtons and meters? Or persons and hours?”  “Exactly,” Leon agreed. “It’s just a word salad.”  When his person-hour was up, Mrs. Cooper walked James out onto the verandah and addressed him quietly. “I’m sorry, but Leon’s failed four tests in a row now. It’s just not working out for us.”  James said, “Okay. I understand.” There was no point telling her that her son was a lazy, entitled prick, and that no tutor in the world would ever summon better results from him. “Can I still list you as a reference?”  She grimaced. “If anyone asks about you, I can only be honest, and I’m not sure that would do you much good.”  “All right. But if we’re being honest, Leon isn’t trying at all.”  Mrs. Cooper laughed. “Your job was to make him passionate about the subject! His teachers couldn’t do it, which was why I was paying you.” She shook her head, bemused, and walked back into the house.  “Maybe next time hire a supermodel,” James muttered. “A cocaine-dealing supermodel, who’ll tell him how calculus will make him rich.” The cicadas ignored him.  It was a stinking hot night, and as he sat at the bus stop, he could smell his own sweat fermenting, drowning out the floral notes from the suburb’s manicured gardens. He wished he could go home and grab a shower before his shift but because the bus timetable had changed, it was impossible. At the restaurant, in the staff toilet, he splashed water on his face and torso, then he put on his uniform and walked out into the furnace of the kitchen.  “Any chance of more hours?” he asked Ken, when he came around checking on the burger line.  Ken snorted. “I offered you more hours a month ago, and you said it would make you too tired for your lectures.”  “But if I could start earlier . . . ”  “I don’t need people earlier.”  “All right,” James decided. “Any time, then.”  “We’ve got everyone we need, right now. But I’ll let you know.”  “Thanks.”  On the bus home, James skimmed through the employment listings. Before Leon, his students Chris and Andrea had both been a joy to teach, curious and eager, just needing someone with the patience to reframe what they couldn’t always grasp the first time. But there were no tutoring jobs on offer close enough that he could make them fit in with his schedule.  It was after midnight when he entered the house; with everyone else asleep, he felt more like a burglar than a fellow resident. As he poured himself a glass of water, Pawpaw appeared and began performing tight figure eights around his feet. He opened the back door then waited for the cat to bury his feces and return.  “Go back in with Lisa,” James whispered, with a shooing gesture. She always left her door slightly open, and he gathered Papaw usually slept on her bed since Noemi had departed. But his own verticality seemed to render him more interesting; it was all he could do to slip into his room and close the door.  As he lay in the dark, sleep seemed impossible; he kept rerunning the calculations for the time that remained until the water flowing into his own financial swimming pool was overtaken by the quantity pouring out. But then he noticed the pool expanding, each side growing without the level dropping, the volume of water magically increasing to fill the extra room.  3  James woke to the sound of someone playing Leonard Cohen’s “Hallelujah” on a tinny electric keyboard. “Make it stop!” he bellowed; newcomer or not, there were some things he shouldn’t have to put up with. When the dirge continued, he leaped out of bed and stomped into the kitchen.  The keyboard sat on the table, but the player seemed to have fled. All he could see was Pawpaw standing over it, treading on keys at random.  Except the keys the cat was pressing weren’t random. The rhythm was halting, as it had been from the start, but as far as James could tell the melody was note-perfect.  Lisa, crouched in a corner with her phone held up to record everything, burst out laughing. Pawpaw stopped playing and began mewing plaintively, apparently confused by the mixed messages from his audience.  “That’s a post!” Lisa announced.  “Whatever fresh hell this is, leave me out of it,” James snarled.  “Oh, come on, the expression on your face was priceless!”  Ferouz entered the kitchen, smiling. “We were trying out the new collar app last night, saying, wait until James sees this . . . ”  James realized he’d slept through his alarm or shut it off on autopilot; he had a lecture in forty minutes. He took a shower and grabbed a muesli bar to eat at the bus stop.  Lisa emailed him a link to her video. On the bus, James tried to get it taken down, on the basis that he hadn’t consented to being recorded, but after the YouTube Complaints app had confirmed that his current face was indeed a “probable match” to his face fifteen minutes before, it also determined that he was an “incidental bystander” in the contested material, and ruled that imposing his wishes would be “unduly onerous on the content creator, and/or disproportionately chilling for free speech.”  “You may still tag your likeness here with nonbinding reuse advice,” the app added helpfully. “Just check one or more of the following. This image is inappropriate for general media release if I am (a) arrested, (b) deceased, (c) a victim of crime.”  When he arrived at the campus, he sprinted to the lecture theater and managed to reach a seat in the back before the demerit siren sounded. The Machine Learning classes had been packed for the first four or five weeks, full of people who fondly imagined that the course would enable them to found their own billion-dollar start-ups, but as the truth sank in, the numbers had thinned. Some of the methods they were studying could be extremely useful for certain kinds of problems, but there were no magic bullets, and the most noisily hyped commercial applications were pure snake oil.  After the lecture, as he joined the students filing out, someone touched his shoulder. He turned and saw Sarah frowning at him. “You look terrible,” she said. “Did you find a new place or are you sleeping on someone’s couch?”  “I found a place,” he insisted. “It’s not perfect, but . . . ”  “What?”  He described the morning’s musical interlude, but that wasn’t actually the reason he was tired. “I lost a tutoring job last night,” he added. All his troubles sounded petty when he spelled them out this way, but the line from David Copperfield was hard to argue with. How many shillings was he away from misery?  “Are you still working at the casino?” he asked, as they emerged into the glare of the courtyard.  “Yeah. I’ll let you know if there are any openings.”  “Thanks. Though I’d rather just take them for a few grand, if you can swing it. What’s the point of a computer science degree if I can’t even empty out a poker machine?”  Sarah nodded. “I’ll see what I can do. But maybe you should practice first by hacking the cat.”  “The cat’s been through enough.”  “Exactly,” she agreed. “Hack it so those clowns can’t keep messing with it.”  “I’m not sure I want to start a feud with people I have to live with.”  “Cover your tracks!” she urged him. “You think they’re going to hire a digital forensics team to find out why their kitty’s stopped doing party tricks?”  “I wouldn’t put it past them. Lisa has sixty thousand followers on YouTube.”  “That’s not going to pay for anything,” Sarah scoffed.  “I know, but I think she has rich parents, and she really likes the likes.”  They were approaching the library. “Is everything okay with you?” James asked. In between their banter he was sure he’d sensed something nagging at her.  “I broke up with Andrew last week,” she said.  “I’m sorry. How long were you together?”  “Seven months. But I met someone on the weekend, so there’s that.”  “Okay. That’s . . . efficient.”  Sarah smiled and replied in a Tennessee Williams drawl, “I have always depended on the strangeness of Tinder.”  James glanced toward the entrance to the library. “I have an assignment due.”  “Okay. I’ll see you around.”  4  James was in the kitchen, cooking pasta, when a small blue-and-white marble rolled between his feet and rebounded off the cupboard beneath the sink.  “That’s a goal!” Ferouz proclaimed from the doorway. Pawpaw stood in front of him, wearing tiny roller skates and holding a miniature hockey stick in his mouth. Lisa was off to one side, recording, as always.  James said nothing, but Lisa caught the look on his face and launched into a defense. “He loves doing these videos! It’s an enriching experience for him!”  “You ever thought of getting him a toy mouse?” James suggested. “One of those motorized ones he could chase around the house?”  “Eew, that would be creepy,” Lisa declared.  Pawpaw began to slip on the linoleum; he looked alarmed for a moment but managed to flop down on his side. Ferouz approached and took the skates off. “We’re the ones who pay for his food and vet bills,” he pointed out. “Justine doesn’t help. We could have just sent him to a shelter when Noemi moved out.”  “So what if I pay my share?” James asked rashly. “Would I get a say in how he’s treated?”  Lisa did not look happy, but Ferouz replied, “You’d get an equal vote.”  James pondered the proposition. If he wanted to have the collar turned off, Ferouz and Lisa would vote him down, but maybe he could chip away at their bloc by starting with smaller issues.  “If I agree to pay a third of his upkeep, and I buy a toy mouse, will you vote to let him play with it?” It wouldn’t be so bad going for broke if he was guaranteed at least one success.  Ferouz did not seem discomfited at all. Maybe he was looking for a chance to save money, while still holding on to the balance of power—and needling Lisa would just be a bonus. “It’s a deal,” he replied.  James ordered the mouse online; it arrived three days later. He unpacked it and tested it in his room. It had obstacle detectors and motion sensors that allowed it to give a reasonably convincing imitation of a creature trying to sneak along out of sight, freezing if it came under scrutiny, fleeing if it was pursued. At least it was a pure dumb robot, incapable of actual fear or pain. He’d read that the military were still perfecting their cyborg surveillance rats and pigeons, but every species posed its own set of challenges, and so far the only consumer product the research had spawned had been for cats.  He inactivated the mouse and carried it to the living room. Lisa and Ferouz were playing a video game that appeared to involve zombies driving racing cars; Pawpaw was nuzzling Lisa’s calves, and she occasionally reached down and stroked his head.  James placed the mouse on the floor and switched it on with the remote. It scurried across the carpet and hid behind the monitor stand. Pawpaw didn’t react, but Ferouz turned to James. “Ah, you got it! Cool.”  He paused the game, and Lisa picked up her phone.  James stood in the doorway, feeling slightly foolish; the mouse wasn’t moving, and Pawpaw was yet to show the slightest interest in this lump of plastic covered in synthetic fur. The mouse’s courage level could be set on a scale from zero to toxoplasmosis; he raised it a notch. With no actual goal, it nonetheless left its sheltered spot and began a cautious traversal of the skirting boards.  As the mouse scrabbled across a discarded pizza menu, the crinkling paper made Pawpaw’s ears prick up. The cat turned and stared, and James could see him tracking and assessing the intruder from where he stood. But he still wasn’t stalking it. James dialed up the mouse’s brazenness again; it veered away from the wall and dared to attempt to cut across the corner of the room.  Pawpaw jumped up onto the couch, cowering against Lisa, who was recording everything. The cat squirmed around and peeked again, then buried his head in the space between the backrest and the cushions.  Ferouz burst out laughing but waited until Lisa had finished her video to avoid spoiling the soundtrack with his gloating. “Did you get what you wanted?” he asked James. “Looking out for the poor tortured animal’s interests?”  James didn’t reply, but as angry as he was, he could only blame his own lack of research. How had he supposed the collar kept native rats safe? Some magical species-specific filter? Or just a powerful aversion to every kind of stimulus that normally characterized prey?  Ferouz said, “Domesticated really means domesticated now; he’s not some half-neotenous would-be jaguar who just tolerates us for the sake of an easy life. He’s our widdul puddy cat, and if we want to dress him up as Santa and pimp him out on YouTube, he’ll have no choice but to love every minute of it. If you have a problem with that, you can fuck right off.”  James powered the mouse down and took it back to his room. Wherever his stubbornness was trying to lead him, he really did not have time to go there. What he needed to do now was swallow his pride, find more work, and keep his head clear for the sake of his studies. If he still had the urge to salve his conscience, he could give a few dollars to an animal shelter. Everything else was out of his hands.  5  “Go back to Lisa!” James pleaded. It was two in the morning, and he was asleep on his feet, but Pawpaw wouldn’t let him take a step without, not so much following him, as weaving between his ankles in a shackling maneuver that made it impossible to go anywhere without his pursuer arriving simultaneously.  “All right, I give up.” He let the cat into his room. Pawpaw jumped up onto the bed and began digging his front claws into the sheet.  James opened his mouth to scold him, but then decided he didn’t care. And who knew to what degree the collar would amplify his displeasure?  But that question didn’t have to remain unanswered.  He sat down and booted up his laptop, then went and made a cup of coffee. Pawpaw didn’t follow him into the kitchen; it seemed he was content with having been granted access to the previously forbidden haven.  When James returned, the cat was curled up on the end of the bed. As he unbuckled the collar, he half-expected an ear-splitting alarm to go off on Lisa’s phone, rousing her to furious vengeance, but nothing disturbed the night’s silence. Pawpaw scratched some of his newly uncovered fur with his back foot, then appeared to doze off completely.  The collar talked to the electrodes with Bluetooth and the home network with Wi-Fi. The default password for the admin account was stamped into the plastic; the dye in the hollow that had made it readable was gone, but a pencil rubbing revealed it easily. Neither Noemi nor anyone else had bothered to change it.  James made copies of all the apps and decompiled them with a tool that produced source code with helpful annotations, rendering the structure of the programs easy to discern. As a bonus, the apps called hundreds of routines in a dynamically linked library that needed actual names, rather than raw binary addresses, to be specified in the file at hand, so the code was peppered with invocations that bordered on the self-explanatory: InstallPreyMotionResponder, RampAversiveStimulus, TriggerPositiveAffect.  The Keyboard Maestro app was actually a cross between an augmented reality system and a bad drug trip, in which a nameless, formless, sense-of-something-moving appeared overlaid on each key as required, compelling the victim to reach out and swipe at it. You could encode whatever piece of kitsch you wanted played into a series of impressions of having not quite glimpsed a cockroach burrowing through from another dimension. James remembered teasing his own cat, Silver, with a spot of reflected sunlight that she’d chased across the floor, but at least she’d always had the option of walking away.  Once he had a sense of what the apps were doing, the question was what the best way to undermine them would be. If he simply blocked them all from running, Lisa and Ferouz would just take the collar to be repaired. Even if he could avoid being blamed for the sabotage, any victory would be short-lived.  He needed something more like a slow fade-out, which could plausibly be explained by the cat gradually habituating to the signals from the collar, or the performance of the electrodes degrading. He looked up the warranty conditions; if anything went wrong after thirty days, you were on your own, regardless—but once the problem shifted from the collar to the electrodes, the cost of any remedy would be astronomically greater. There weren’t that many vets who did the surgery in the first place but finding one who would dive back into the skull in order to address, not a swelling or infection arising from the implants, but merely a lack of compliance by the animal, would raise hurdles that even the most deranged petfluencer might balk at.  The collar ran a common variant of Linux for wearable devices that tens of thousands of people had already had reason to mess with. James found a description online for a fairly simple way to unlock the bootloader, and then he installed new firmware that let him run unsigned code. All he had to do now was modify a few low-level library routines, so that the signals to the electrodes tapered down to nothing over the next couple of weeks. Aside from aiding in the subterfuge, that would probably be easier for Pawpaw than going cold turkey.  He made the changes, but then wondered how he could verify that he’d actually done what he thought he had. So far, this was all just symbols on the laptop’s screen. Pawpaw was breathing slowly and deeply, his head twitching slightly every now and then. It seemed cruel to wake him just to test the apps’ potency for various settings of the fade-out parameter.  What was going on inside his skull, right now? James hesitated, but then laughed off his qualms and wrote a small program that extracted all the available data and displayed a summary in real time. He couldn’t create an image of the cat’s visual field, but he could track which kinds of objects and motions were being hallucinated and the actions that the motor cortex would be producing if not for the paralysis of sleep.  Pawpaw was dreaming of something scurrying across the ground. The usual background process that made him fear his natural prey was no longer running on the collar, and, at least in this state, he had not internalized the conditioning: he was stalking the animal, not fleeing from it, and the electrodes’ crude emotional register declared that he was both excited and focused.  James watched the dream unfold. There were episodes of pursuit, and the dispatching of prey, but also affectionate tousling with animals of the dreamer’s own size, as if he was reliving wrestling with his siblings. Larger figures strode across the landscape too, eliciting a more complicated response, part fearful, part fraternal.  It was mesmerizing . . . but the household would be awake soon, and James needed to be sure that his changes to the library really could damp down the prodding from the electrodes. He injected a keyboard-cockroach into Pawpaw’s dream, at full strength, and saw the swipe response it evoked. Then he set the dial to zero and tried again; there was nothing. At fifty percent, the dreamer noticed the incursion, but the reaction was tentative. The apps would lose their grip slowly, their decay seeming more like natural causes than foul play.  James rebooted the collar and put it back in place. Pawpaw stirred and eyed him resentfully.  “Two weeks and all the crap will be out of your head,” James promised.  6  “A kernel machine generalizes this approach, identifying the separating hyperplane without explicitly mapping the raw data into a higher-dimensional feature space.”  James already knew the material, but he didn’t dare surrender to exhaustion and close his eyes when the facial monitors were primed to record every lapse of attention. So he stared at the whiteboard intently, even as he tuned out the lecturer and began free associating, hoping to stay on the right side of the separating hyperplane.  Maybe he could grab a nap on the grass at lunch time. He couldn’t afford to miss his shift tonight; he was already scraping along the bottom of his bank account, skirting the edges of his credit card’s interest-free zone. He’d been given as many hours at the restaurant as he could hope for, but even if he could find more work, he didn’t have the time for it.  What he needed was a way to earn money in his sleep. Would anyone pay to watch him lying in bed, through a webcam, with no sexual content at all? Probably not—even if it was a thing, the market would already be flooded. Were there tasks he could do on Mechanical Turk without being awake? Maybe check an audio stream for the sound of children being tortured; the content moderation bots weren’t up to that yet. Would he grimace detectably if he heard an atrocity? Some fraction of the time, he might, but it seemed unlikely that he could do it reliably. And how did they get away with calling it “Mechanical Turk” anyway, as if eighteenth century orientalist shit was just fine if it was a historical reference? Why hadn’t anyone launched a competitor called “Mechanical Habsburg”?  It was too hard to get information in and out of his skull while he slept. But Pawpaw had a channel wide open, twenty-four hours a day. While the cat was dreaming, he could also be . . . saving self-driving cars from collisions? Millions of cats had been hit by cars, but so had millions of human pedestrians; both species were still better at object detection than any car without lidar.  The siren sounded for the end of the lecture. James gathered his things and headed out, letting his idiotic fantasy slip away. The electrodes in the cat’s brain couldn’t induce detailed visual perceptions; the best they could manage were vague intimations. Whatever feats Pawpaw could perform in his sleep, he was never going to earn his keep as a node in the global network of computing resources.  In the courtyard, James caught up with Sarah and described his adventures with the collar’s software.  “I didn’t think you’d actually do it!” she said. They found a patch of shade and sat on the low wall. “You should think about the other cats, though. You might have unplugged one, but what about the rest?”  “I was going to move on to the American President’s First Kitten, but then I realized they’d whisk me off to a black site the moment it refused to play ‘The Star-Spangled Banner.’”  “I’m serious.”  “Okay, but how? Getting malware onto the app store is beyond me. Maybe if I had a free month or two I could learn what I needed, but . . . ”  “What about non-malware, then?” Sarah suggested. “A genuine app, as far as the collar is concerned—but one that might dissuade the owners themselves from running the other apps?”  James was on the verge of retorting that social engineering wasn’t always easier than malware, when a possibility crystallized in his mind. “Instead of entertaining them by jumping through hoops, what if the cat could show them what it was dreaming of doing?”  Sarah was skeptical. “You said all you could extract was a kind of textual running commentary.”  “I did. But if artificial neural networks are good at anything, it’s confabulation. Feed those prompts I saw this morning into the right kind of image generator and maybe half the demographic who think that their pet being goaded into playing Pachelbel’s Canon is adorable might either get a jolt of empathy when they grasp what it would rather be doing—or if that’s too much to hope for, find something trippy enough, or twee enough, in the neural net’s imagery to scratch the same itch.”  Sarah didn’t reply. James was so tired that he started to wonder if he’d actually spoken or just spelled out the proposal in his head.  “You should do it,” she said finally. “I’ll help, if you like.”  “I’m dead on my feet right now,” James admitted.  She smiled. “I can see that. Maybe next week?”  “Absolutely.”  It was insane, but it wasn’t impossible; once he’d caught up on his sleep, they could probably find a few hours between lectures to start putting the app together. And he’d completed the hardest part already: he had a direct line to Pawpaw’s brain. He could log the cat’s dreams, build up a data set, and then start to work out what kind of shiny distractions he could dangle in front of the humans in the hope of overcoming their primal compulsions and rendering them fit for a domestic life in the company of another species.  7  “Stupid animal,” Lisa muttered, scowling at her phone. Pawpaw walked past her and rubbed his head satisfyingly against a table leg before strolling over to his food bowl.  James kept quiet, but later that night he went through the activity logs from the collar and saw that Lisa had run the diagnostics three times in the last twenty-four hours. All the reports were listing no faults, of course. He had no idea what she’d do when Pawpaw’s immunity to the apps proved to be more than a temporary glitch, but even if she was willing to shell out the money for a new collar, he’d found a Bluetooth exploit that could mess with the electrodes directly. The puppet show was over—in this house, at least.  He started up the latest iteration of the dream app. After feedback from the beta testers, he’d made the style transfer much smoother; he could even slide mid-playback between different forms of pastiche now, from van Gogh to Francis Bacon, from Watership Down to Studio Ghibli.  He leaned back and watched the customized Dream Cat (emerald-eyed, dainty, black-and-white coat) padding through a wheat field beneath a swirling starry night. When the stalks of the crop rustled, the Cat paused and crouched down low. The tension after each small sound made it clear that it had been wise not to try to add musical embellishments; the YouTubers could smother their versions with anything they wanted once they got it in their editing suites, but even though the unadorned original was ninety-five percent concocted, it had a kind of aesthetic unity.  When the Cat finally pounced, this style spared the viewer from explicit gore, but it still portrayed the act with no ambiguity. The Dream Cat played with his prey, then tore it apart. While the dream-logging portion of the app was running, it would disable everything else on the collar; there would be no punishment meted out for these transgressions. The owner would see their pet’s idea of normal behavior—and with luck, that might sway some of them into offering a substitute during waking hours. An information screen on the app explained how the imposed aversion to prey-seeking could be shut off while the animal was indoors, expanding the possibilities for play. Telling people to throw away the collars completely would be sure to get the app rejected by the store but encouraging them to change one simple default wouldn’t threaten the whole business model. If anyone’s conscience took them further, that was up to them.  James heard scratching at the door. He let Pawpaw in, expecting the cat to curl up on the bed, but instead he circled around the room restlessly.  “What is it?”  Pawpaw stopped beside his desk, rubbing his head against the drawers. James opened the top drawer and took out the toy mouse. “Really? You knew it was in there?”  He switched the mouse on, then placed it on the floor. Pawpaw stared at it, but it remained frozen.  James dialed up the mouse’s risk-taking behavior, and it scurried away. Pawpaw went after it, but it managed to escape into the space beneath the closet. The cat stretched a paw into the dark gap a few times, then concluded that this was unlikely to be fruitful, and sat back to wait.  This was all just an artifice, too, but holding out for the cat’s right to ravage actual wildlife would be untenable. There had to be some pragmatic balance between allowing domesticated animals to follow their instincts, entirely untrammeled, and forcing them to submit to whatever humans found amusing. “One must imagine Pawpaw happy,” James suggested in his best David Attenborough voice.  His laptop pinged; he had a message from Sarah.  “Are we ready to submit?”  James could easily imagine spending another week or two just playing with the style selector, but they’d reached the point of diminishing returns.  “The code’s ready,” he replied. “But we still don’t have a name.” They’d kept putting it off while they tackled more important things.  “Any ideas?”  He’d thought of half a dozen, but none of them really grabbed him. He trusted Sarah’s judgment more than his own; she’d usually had more sleep.  “You decide.”  8  James was pouring rancid fryer oil into the tank in the alley behind the restaurant when the email arrived. “Congratulations! Your app Ghost Cat has now passed verification and is live on the Collar Store!”  On the bus home, he checked the statistics; there’d been three downloads in the past two hours. He and Sarah needed five hundred to break even on the fee for their developer’s account. He refreshed the page a few times, but the count hadn’t budged when he collapsed into bed, and in the morning, he resolved not to look again for at least a week.  “Nineteen sales!” Sarah announced cheerfully, when he ran into her the next day.  James laughed. “Oh well. It wasn’t a complete waste: we can probably recycle it as an undergraduate project.”  “How’s Pawpaw doing?” she asked.  “Fine. Lisa and Ferouz have lost interest in him completely; all he does now is eat, sleep, and chase the mouse. I showed him his old roller skates once, just out of curiosity, and he looked at me like I’d shat on the carpet.”  “Ha.” Sarah hesitated. “You know how we weren’t going to advertise?”  James steeled himself for a fight. “We can’t afford it. Seriously! I’ve already sunk more into this than I can spare.”  “I’ve already paid for it myself,” she replied. “I won’t ask you to split the fee unless we go into profit.”  “Who’s the advertisement with?”  “A woman named Frida with a YouTube channel called Fully Wired Kitten. Ten times more followers than Lisa. She wanted fifty dollars and a free copy of the app, to test it and run a review.”  “So she might not even like it?” James didn’t want to harangue Sarah when she was bearing the whole cost of the strategy, but it sounded like a grift either way: if payment guaranteed a positive “review” then Frida was cheating her audience out of an honest assessment—but if it didn’t, how could she justify the fee?  Sarah said, “We’ll find out soon enough. It’s going out tonight, around ten o’clock.”  When he arrived at the restaurant, James switched his phone off, so he wouldn’t give in to the masochistic urge to monitor events he had no power to control. There’d been a time when he would have claimed that the raison d’être of any software he wrote would be to fulfill some user’s genuine, preexisting need. But almost every app was a kind of weapon now, however grand or petty the cultural skirmishes it enabled. He didn’t regret the payload he was trying to deliver, but now that he’d committed to a strategy of manipulation, he’d stepped into a world that he’d once vowed he’d never be a part of.  The griller was beeping; one of the patties was stuck. “Are you fixing that?” Ken called to him.  “I’m on it!” James replied.  When he finished the shift, he kept his phone off; he didn’t have the stomach for the near-certainty of bad news. When he woke the next morning, any itch of curiosity, and even the desire to tear away the bandage quickly, had all but vanished. He fed Pawpaw and ate breakfast without switching on his laptop or his phone.  He felt calm as he left the house. The lectures he attended seemed imbued with a startling new clarity, as if he’d updated the prescription on his glasses.  “James? Where have you been?”  Sarah stood in front of him, with a look on her face that might have made sense if he’d fallen from the sky after a decade’s unexplained absence.  “Here. I just . . . ” He pointed back toward the lecture theater.  “I’ve been trying to reach you all morning!”  James couldn’t read her expression. “Is there a bug in the app? Are we turning all the cats catatonic?”  “Don’t be ridiculous.”  “Why are you so upset, then? We got a bad review, the app bombed. It’s not the end of the world.”  Sarah said, “You really haven’t checked again, since Frida panned it?”  James was silent; he’d guessed one thing correctly, but what was he missing?  “After the review went out,” Sarah explained, “someone saw the clip on Fully Wired Kitten of the dream that was supposed to damn the whole thing . . . and reached the opposite conclusion.”  “Okay. So not all the commenters agreed with Frida.”  “I’m not talking about some random commenter. Calista saw the clip. Calista disagreed. She bought the app and ran it for her own cat and loved it.”  “Who’s Calista?” James caught himself. “You don’t mean . . . the singer?”  “Yes.”  “I probably shouldn’t call her that, when she’s ninety percent auto-tune, ten percent sighing.”  “She’s won four Grammys,” Sarah replied. “I don’t like her songs either, but she has fifty million followers. Since she posted about the app, we’ve had ten thousand downloads.”  James absorbed this revelation. Their cut on each sale was about a dollar, so five thousand each. He could probably afford to reduce his shifts, maybe drop the last two hours and finish at eleven, the way he used to. “Not bad for an undergraduate project,” he joked. Money aside, the number of downloads was only two percent of the half million collars currently installed, so they hadn’t exactly liberated the wired cats of the world from their oppressors. But if a celebrity was championing dream-watching, that might yet shift the balance a little further.  On the bus to the restaurant, he watched both posts, immune to Frida’s scorn. “What this app spews out is nothing but a form of face-swapping revenge porn!” she fumed. “This is not my Prince Whiskers at all. Over the last few months, you and I have been on a marvelous journey with him that uncovered so many of his hidden talents: as a jazz musician, a fashion model, an imperfect but ever-striving pastry chef. Now these ham-fisted morons are trying to foist a cartoonish parody of the feline character onto all of our beloved companions.”  Calista’s take was different. “Finally seeing into Lady Lydia’s soul, not only does this prove that she has always been my spirit animal, it has empowered me to fully embrace my own dark, predatory instincts. Expect new tracks that take you where no human can walk alone; only our mingled essence can survive the way of the carnivore.”  9  “I’m giving two weeks’ notice,” James said, clutching his hairnet awkwardly in one hand. “I hope you can get someone to replace me by then.”  “You’ll come back when you need the money,” Ken predicted.  “Maybe.”  “What? Someone died and left you an inheritance?”  “I got a couple of tutoring jobs,” James lied. “The rate’s pretty good, so it works out better. And I can get more sleep.”  For a second, Ken looked envious. “Okay,” he said. “Good luck.”  “I’ll stick around for two more weeks,” James promised.  Outside the restaurant he strolled through the humid night, relieved but weary. He’d parked the car eight blocks away, afraid of having to explain the purchase if a fellow worker saw him with it. “You’re dealing drugs now, right?” “No.” “Then how could you . . . ?” “It’s a long story.”  It was only a ten-minute drive to his new place. Inside, when he switched on the light, Pawpaw and Phantom stirred briefly, but remained curled up on the couch together.  The light was still on in Sarah’s room, so he knocked on the door. “Come in,” she said. She was in bed, but she was looking at something on her laptop.  “I gave notice,” James told her, standing in the doorway.  “Finally!”  He shrugged. “I was never sure our sales weren’t going to tank. I mean, the hype can’t last forever.”  “We have something better than hype: controversy.” Sarah turned the laptop around to show him the screen; she’d been watching a clip from a US talk show. “They interviewed an animal behaviorist, who explained that the Ghost Cat dreams are just embellishments that shouldn’t be taken literally.”  “You mean, exactly what we admit ourselves in the disclaimer?”  “Yeah, but it’s nice to know that even people with PhDs don’t read terms and conditions. And on the plus side, he also said the electrodes themselves should be banned.”  “You think that’s going to happen?”  “Eventually,” Sarah replied. “But no one made it a priority when the things first came out, so I can’t see any jurisdiction rushing through legislation, just because the hardware’s getting more attention thanks to a more benign use.”  “And one bad singer.”  “Be nice. Calista’s catching all the flak from the old-school collar users, while we hide behind our brand name. Has anyone released a diss track about you, lately?”  “Not that I’m aware of.” James gathered up his courage. “So maybe we’ve got a window. A few months in which we can . . . leverage this.” Sarah didn’t reply immediately, and he felt his face burning, as if he’d just confessed to an unspeakable crime.  “You mean go after venture capital?”  “Yes.”  “I’ve been thinking about that myself,” she confessed. “But I always thought you were committed to a life of open-source projects for philanthropic foundations.”  James frowned. “Are you mocking me?”  “Absolutely.” She smiled. “Anyway, if some VC is willing to fund us because a pop star threw a spotlight on Ghost Cat, so long as the new project has merit there’s nothing to feel guilty about. We’re the ones who struck a blow for animal liberation, aren’t we?”  “Maybe.”  “So.” Sarah set her laptop aside. “What’s the project? What’s the pitch?”  10  “Suppose your grandmother lives in a sprawling retirement complex,” James began. “There are six different gates by which a vehicle can enter. One is fifty meters from her front door; the others might not even give access to her location. But every time she calls a taxi, or a rideshare—or an ambulance—and gives her full address as a resident within the complex, some half-baked Geographical Information System from one of the big providers redirects the vehicle to what it wrongly thinks is the correct street address for the whole complex. The wrong gate, on the wrong street.”  Celia Davenport interrupted him. “Surely Google have this covered?”  “You’d think so,” James replied, “but they don’t. This isn’t hypothetical.” He scrolled to the survey results on his deck. “Six percent of our respondents said they’ve experienced problems due to GIS errors, ranging from having to stand in an alley in the rain to collect a supposedly home-delivered pizza, to ambulances delayed because they’re unable to locate their patients. And it’s not just summoning vehicles: three percent of people who try to type their true postal address into a web form are told it doesn’t exist, so they’re forced to abandon the interaction, or accept some approximation such as dropping the suffix that specifies the halves of a duplex. So the effects range from nuisance level to life-threatening, but even misdirected parcels add up to millions of dollars in lost productivity. These systems are marvelous when they’re accurate, but when they’re not, they’re like an invisible brick wall.”  “So what’s the solution?” Davenport pressed him. “How do you train your networks to do a better job than everyone else?”  “We don’t make it a machine-learning problem at all,” James replied. “We buy access to multiple databases, we identify the discrepancies between them, and we classify and remedy the problems using traditional, robust, deterministic code. I don’t care if someone has a neural net that gets ninety-five percent of addresses right. I’m aiming for software with so few errors that the dozen or so cases per million it can’t deal with can be handled manually by a staff of two or three.”  He waited for the shockingly sane proposal to sink in. He wasn’t pitching a mash-up of sexy buzzwords. He wasn’t claiming to cure death or world hunger. He wasn’t even hoping to get millions of people hooked on some vacuous time-sink they’d never even known they’d wanted before. He just aimed to do one job properly that no one else could be bothered getting right.  Davenport grilled him, but after his rehearsals with Sarah he was well prepared. Finally, she said, “I’ll get back to you in a couple of days, but I think we’d be willing to partner in your pilot program, if you can match us dollar for dollar on the costs.”  “All right.” That wasn’t quite what James had anticipated, but the revenue from Ghost Cat ought to cover his share. “I’ll look forward to hearing from you.”  When he’d hung up the call, all the implications that would flow from a favorable decision began to seem a lot more real. For a start, he’d have to drop out of his degree—with most of the debt remaining, but no qualification to show for it. There was no way he’d have time to run even the pilot program and keep studying.  He’d always laughed at the aspiring tech moguls sitting in the lecture theaters beside him, convinced that they were about to make their fortune from the latest overblown trend. But his project was solid: it solved a real problem that wasn’t going away. Just because it was a celebrity endorsement for fabricated imagery of cats’ dreams that had brought him here, that didn’t mean his feet weren’t still planted firmly on the ground.  11  “I noticed something today,” Sarah said, as she joined James at the dinner table. “You know how we’ve been getting roughly the same sales for the last twelve weeks?”  James smiled. “Yeah, but I’ve been trying not to dwell on it, because I’m sure it can’t last. To be honest, I thought we’d saturate the market much sooner.”  “So why do you think the sales are holding up so well?”  “Because Calista’s side is winning people over?”  “They’re not, though,” Sarah replied bluntly. “There’s still a huge number of collar owners who aren’t buying Ghost Cat. They’re not being won over.”  James was confused. “So who are we selling to?”  “Brand new collar owners,” she said. “People who are putting electrodes into their cats’ brains, because it’s more fashionable now. Thanks to Calista, but . . . also thanks to us.”  James said, “I don’t believe that. The numbers must have been growing anyway.”  Sarah took out her laptop and showed him a plot. The sales of new collars had spiked a week or so after Calista’s post; it had dropped back since then, but it was still almost fifty percent higher than it had been before.  “Fuck. Fuck!” James stood up and walked away from the table. “Why did you have to tell me that?”  “Seriously? You wish I’d kept my mouth shut?”  It took him a few heartbeats to calm down enough to relent. “No,” he said. “I’m sorry. But . . . ” Even if the new collar owners were wholly uninterested in puppetry, the surgery itself was risky. And once they got bored with their cats’ dreams, would they really eschew all the other novelties the electrodes enabled?  “Just imagine what Celia Davenport will think, if we tell her we’re pulling the plug on the app that’s keeping us afloat while we work on Abode . . . because it grew the market too much.” He could forget about anyone ever taking a pitch from him again.  Sarah said, “Even if we pull the app, there are clones like Oneiro that have all the same features. We’re on top because we were first, and the price is reasonable, and Calista touted us. But if Ghost Cat vanishes, it won’t kill the trend.”  James couldn’t argue with that. “So what do we do?” Accept that things had spiraled out of their control and just keep taking the money? He glanced over at Pawpaw and Phantom, happily gorging themselves on sheep liver. Nature was a bloodbath, and humans were shit; if he and Sarah were treating their own pets well enough, maybe that was the most they had a right to aspire to.  Sarah said, “I have an idea. But it’s pretty extreme.”  “A way to slow down the sales of new collars?”  “Yes. Maybe even get the electrodes outlawed and put the kibosh on any canine version in the works.”  “Is it legal?”  “Ummm . . . ”  “Can we cover our tracks?”  Sarah hesitated. “Probably.”  James braced himself. “Will we have an alibi with Davenport, when our revenue dries up?” If she canceled her investment, he could live with that; he could reenroll in his degree and treat the whole entrepreneurial detour as a fever dream. But if she believed he’d flat out lied to her, that could mean anything from permanent unemployability to a jail term for fraud.  Sarah said, “Of all the people she might blame for the death of Ghost Cat, I think we’ll be a long way down the list.”  12  “We need to make it look like there are two versions of the app,” Sarah stressed. “One that actually worked and did everything it claimed to do. Then someone took that version, kept the user interface and enough of the original code to pass a superficial inspection, but stripped out all the true functionality and added a sting in the tail.”  “That’s a lot of work,” James protested. “And it’s not as if anyone’s going to take the broken version to Consumer Affairs.”  Sarah said, “If this all pans out, don’t you think there’ll be competent tech journalists looking into it, eventually? If they examine the app we actually release, and it looks like it was written from scratch as a kind of poisoned honeypot, the spin on the story will be completely different than if it looks like someone used a preexisting app with an established user base as camouflage for the same thing.”  James took their plates over to the sink and started washing up. “Do you think there is an actual preexisting app, with an established user base?”  “There might well be,” Sarah replied. “But do you want to go on the dark web and search for it? It’s risky enough faking something like this; do you want to get caught downloading the real thing?”  “No,” James conceded.  Since he was already familiar with apps from the Collar Store, the first part of the coding fell to him. He tried to think of the task functionally, breaking it down into the gathering of the user’s preferences, and then the means by which the sensors in the collar and the signals sent to the electrodes could be used to enact the required result. It was instrumentality in its purest form: line after line of code that treated the collared animal as a device to which a series of commands could be sent.  After three days, he was numb, but he had something that he believed looked like a genuine attempt to achieve the goals they wished to mimic. When he passed it to Sarah, he said, “Make sure you eviscerate the fuck out of this. If someone ‘fixes’ it and makes it work . . . ”  She said, “I’ll gut it so the cuts don’t show, but they’re still completely fatal. I promise.”  James had a long shower, then went to bed.  He spent the next week working on the Abode database, unsure if it was now just a kind of cover, or if he might yet stand a chance of getting it running. Sarah still had lectures to attend and assignments to complete, so her half of the shadow project took her longer. But on the weekend, she spent the whole of Saturday disabling and booby-trapping his app, and on Sunday morning they reconvened.  James said, “Okay, people might create shit like this. But who would be stupid enough to draw attention to it?” If the dark web did harbor non-defanged cousins of the app they’d written, even at the height of media interest in the collars this fact had not been splashed across the home screens of every news site. So how were they meant to bring their own version to prominence without tipping their hand?  “There’s a precedent for evangelism,” Sarah replied. “Believe me, you don’t want to wade through the results of that web search, but . . . a while back, there was a British crackpot named Jasper Mellick, whose fifteen seconds of infamy came when a couple of universities sued him for squatting on domain names that were slight misspellings of their own and redirecting all the traffic to his BLTZ manifesto.”  “BLTZ? Is that a rap group?”  “Better Living Through Zoophilia. His long loony screed praising the utilitarian benefits of genetically engineering animals that would enjoy having sex with people.”  “Umm . . . you’re not suggesting we frame him for the app?”  Sarah said, “He’s dead. But the Internet hasn’t quite washed away every trace of him. If we use the BLTZ name, and quote from the manifesto, we can make it seem as if he still has anonymous disciples willing to go all out to spread the message.”  “So we make a video, with masks and ranting?”  “Yes.”  “Synthetic voice or disguised voice?”  “Disguised synthetic voice,” Sarah decided. “It has to sound like a disguised voice, or the media won’t take it seriously.”  The masked figure was CGI, of course, with glimpses of eyelids blinking behind the holes. “We are ushering in a new age of universal flourishing,” the mask read from Mellick’s manifesto. “When no one, man or beast, need be sad, frustrated, or lonely.”  They put the video, and the butchered app, out onto the torrents and IPFS, then sprinkled links to the video in comments to half a dozen posts in the Ghost Cat flame wars. A couple of hours later, it had started garnering some attention—and while it was easy for anyone to check that the app it referred to actually existed, the need to hack the bootloader in a collar in order to run it, and a reluctance by most people to even touch the cursed thing with six-foot tongs, meant the claims in the video were spreading much faster and wider than the truth that some or all copies of the app (who could say?) had been corrupted with malware that would freeze the cat’s Bluetooth.  James said, “When your grandchildren ask you—”  “No,” Sarah cut him off. “Neither of us are ever going to speak of this again. If it works, it works; if it doesn’t, we did our best. But no bragging, ever. If we don’t end up in court, we take this to our graves.”  13  “If you can keep him calm and hold him still for about five minutes,” Dr. Feldman said, “we’ll only need a local anesthetic.”  James said, “I think that’ll work.”  He stroked Pawpaw’s neck, then gripped the back of his head tightly; the vet slipped the needle into the skin midway between the three antennas. Pawpaw looked startled, then annoyed, but he didn’t go berserk, and James didn’t let him pull free until the needle was out.  “Okay. Now just try to get him to relax while that takes effect.”  “Sure.”  Dr. Feldman dropped the hypodermic into his sharps bin. “This is the tenth of these procedures I’ve done this week; everyone’s rushing to get ahead of the ban. I wish people had thought a bit more before they buried wires in their pets’ skulls in the first place.”  “I inherited him like this,” James protested. “It wasn’t my idea.”  Dr. Feldman said nothing, but still managed to convey with one eloquently skeptical glance: that’s what they all say.  For each antenna, he made a small incision, snipped the active circuitry off with something that looked like a small pair of bolt-cutters, then deburred the top of what remained with a polishing tool and stitched up the cut. Pawpaw grew increasingly impatient: doing this weird shit once was just human-level annoying, but again? And then again?  “Okay, we’re done.” Dr. Feldman handed James a pamphlet on wound care.  James got Pawpaw back into the cage for the ride home. When Silver’s cancer had been judged incurable, he’d carried her body home in the cage he’d brought her in, and he’d sworn he’d never have a pet again. But here he was.  At the bus stop, he poked a finger through the wires and stroked the top of Pawpaw’s nose. “It’s going to sting when the anesthetic wears off,” he said. “But not for long. Just take it easy. It’s almost over now.”", "text": "10010 words, novelette\nDream Factory\n1\n“Any pets?” Justine asked, glancing up from the checklist on her phone.\n“No,” James replied, hopeful that this might count in his favor, though it was hard to read his interrogator’s demeanor. She’d said she was a law student, and he could already imagine her in a courtroom, calmly trapping duplicitous witnesses in the web of their own lies. Her two current housemates, both philosophy majors, were sitting on the couch beside her, but whatever they were doing on their own phones seemed entirely unrelated to the interview.\n“Any allergies?” Justine continued.\n“Umm, only pollen. As far as I know.”\n“I meant allergies to pets,” Justine explained. “We have a cat, Pawpaw. Though if you have any serious food allergies, that would be good to know, too.”\nJames said, “We had a cat when I was a kid. I’m definitely not allergic to cats. Or peanuts.”\n“Can you pay two weeks’ rent in advance, plus one more for the security deposit?”\n“Yes.”\nAt the mention of rent, Ferouz and Lisa looked up. They exchanged glances with Justine; none of them seemed to need spoken language to confer.\nJustine said, “Welcome to number 37.”\n“Thank you.” James transferred the money, and when the real estate agent’s computer responded with a receipt acknowledging that his name had been added to the lease, he felt the tension in his shoulders ebbing away. He’d only had three more days left to find a new place.\nAs the interview panel rose to their feet, a small black-and-white cat padded into the room, tail high, mewing. Lisa crouched down and stroked its head, and it immediately began purring loudly and pressing back against her fingers.\n“Wow, he’s affectionate,” James observed. “Or she?”\n“He, but he’s neutered,” Ferouz replied.\n“You should introduce yourself,” Lisa suggested. When she stepped away, the cat turned around and stared up at her pleadingly, so James quickly squatted down and took her place. Pawpaw responded as enthusiastically as he had to the more familiar human, rubbing his skull against James’ knuckles as if nothing could be more satisfying.\nJames couldn’t help smiling, but then he realized that the odd changes in texture he’d noticed were not tangled bits of fur, but small lumps beneath the skin. “Has he got ticks or something? On his head?” Maybe all this rubbing was about trying to dislodge the parasites or at least deal with the itch.\nLisa laughed. “No, that’s the interface.”\n“I’m sorry?”\nShe gestured with her hands spread above her skull. “The Bluetooth antennas for the electrodes.”\n“You put electrodes in your cat’s brain?”\n“Noemi had them installed,” Ferouz interjected. “Pawpaw was hers. But then she had to leave the country, and she couldn’t take him with her.”\n“Okay.” James didn’t want to assume it would be safe to bad-mouth the housemate he was replacing; they might have all adored her and entirely approved of her decision.\n“She only did it so he wouldn’t attack the native wildlife,” Lisa said, taking over stroking duty. “It would be cruel to keep him locked up inside; the software stops him catching birds when he goes out.”\n“Wouldn’t a bell on his collar do the same?”\n“The studies show that this is four times more effective. And it doesn’t bother him at all. I mean, does he look miserable to you?”\n“No,” James admitted. The cat was purring madly. But was that a genuine response to the company of the housemates, or just the software in his collar dictating how he felt?\nThe whole thing made him queasy, but what was he supposed to do? Make plans to spirit Pawpaw away to a deprogramming facility? Give up his place here and spend the next month trying to claw his money back, so he could feel virtuous while changing nothing?\nThere were a million worse things happening every day, and the cat wasn’t suffering in any ordinary sense of the word. Lecturing these people about a situation they hadn’t even chosen themselves would just make him seem obnoxious and set him up for a miserable tenancy until they managed to eject him.\n“Can I move in today?” he asked.\n2\n“Remember the product rule?” James prompted Leon. “The swimming pool, with both sides getting larger?”\n“No,” Leon replied stubbornly. “You never told me anything about a swimming pool.”\nJames knew better than to contradict him. “If you increase the lengths of both sides of a swimming pool, the biggest change in the area will come along the sides: the length of one side times the change in the other, plus the length of the second side times the change in the first.” He sketched the rectangles, for the ninth or tenth time.\n“Yeah, but the water will just get lower,” Leon pointed out. “Which is where your whole argument falls down. You’re ignoring the conservation of water.” He tipped his chair back and regarded James with triumphant contempt.\n“So what’s the slope of x times cos x?” James pressed him. “If you don’t think you need the product rule, find it another way, but there has to be an answer.”\nLeon disagreed. “It’s a trick question. You can’t just multiply anything you want. x is an angle, but cos x is something else. It’s like multiplying apples and oranges.”\n“You mean like . . . newtons and meters? Or persons and hours?”\n“Exactly,” Leon agreed. “It’s just a word salad.”\nWhen his person-hour was up, Mrs. Cooper walked James out onto the verandah and addressed him quietly. “I’m sorry, but Leon’s failed four tests in a row now. It’s just not working out for us.”\nJames said, “Okay. I understand.” There was no point telling her that her son was a lazy, entitled prick, and that no tutor in the world would ever summon better results from him. “Can I still list you as a reference?”\nShe grimaced. “If anyone asks about you, I can only be honest, and I’m not sure that would do you much good.”\n“All right. But if we’re being honest, Leon isn’t trying at all.”\nMrs. Cooper laughed. “Your job was to make him passionate about the subject! His teachers couldn’t do it, which was why I was paying you.” She shook her head, bemused, and walked back into the house.\n“Maybe next time hire a supermodel,” James muttered. “A cocaine-dealing supermodel, who’ll tell him how calculus will make him rich.” The cicadas ignored him.\nIt was a stinking hot night, and as he sat at the bus stop, he could smell his own sweat fermenting, drowning out the floral notes from the suburb’s manicured gardens. He wished he could go home and grab a shower before his shift but because the bus timetable had changed, it was impossible. At the restaurant, in the staff toilet, he splashed water on his face and torso, then he put on his uniform and walked out into the furnace of the kitchen.\n“Any chance of more hours?” he asked Ken, when he came around checking on the burger line.\nKen snorted. “I offered you more hours a month ago, and you said it would make you too tired for your lectures.”\n“But if I could start earlier . . . ”\n“I don’t need people earlier.”\n“All right,” James decided. “Any time, then.”\n“We’ve got everyone we need, right now. But I’ll let you know.”\n“Thanks.”\nOn the bus home, James skimmed through the employment listings. Before Leon, his students Chris and Andrea had both been a joy to teach, curious and eager, just needing someone with the patience to reframe what they couldn’t always grasp the first time. But there were no tutoring jobs on offer close enough that he could make them fit in with his schedule.\nIt was after midnight when he entered the house; with everyone else asleep, he felt more like a burglar than a fellow resident. As he poured himself a glass of water, Pawpaw appeared and began performing tight figure eights around his feet. He opened the back door then waited for the cat to bury his feces and return.\n“Go back in with Lisa,” James whispered, with a shooing gesture. She always left her door slightly open, and he gathered Papaw usually slept on her bed since Noemi had departed. But his own verticality seemed to render him more interesting; it was all he could do to slip into his room and close the door.\nAs he lay in the dark, sleep seemed impossible; he kept rerunning the calculations for the time that remained until the water flowing into his own financial swimming pool was overtaken by the quantity pouring out. But then he noticed the pool expanding, each side growing without the level dropping, the volume of water magically increasing to fill the extra room.\n3\nJames woke to the sound of someone playing Leonard Cohen’s “Hallelujah” on a tinny electric keyboard. “Make it stop!” he bellowed; newcomer or not, there were some things he shouldn’t have to put up with. When the dirge continued, he leaped out of bed and stomped into the kitchen.\nThe keyboard sat on the table, but the player seemed to have fled. All he could see was Pawpaw standing over it, treading on keys at random.\nExcept the keys the cat was pressing weren’t random. The rhythm was halting, as it had been from the start, but as far as James could tell the melody was note-perfect.\nLisa, crouched in a corner with her phone held up to record everything, burst out laughing. Pawpaw stopped playing and began mewing plaintively, apparently confused by the mixed messages from his audience.\n“That’s a post!” Lisa announced.\n“Whatever fresh hell this is, leave me out of it,” James snarled.\n“Oh, come on, the expression on your face was priceless!”\nFerouz entered the kitchen, smiling. “We were trying out the new collar app last night, saying, wait until James sees this . . . ”\nJames realized he’d slept through his alarm or shut it off on autopilot; he had a lecture in forty minutes. He took a shower and grabbed a muesli bar to eat at the bus stop.\nLisa emailed him a link to her video. On the bus, James tried to get it taken down, on the basis that he hadn’t consented to being recorded, but after the YouTube Complaints app had confirmed that his current face was indeed a “probable match” to his face fifteen minutes before, it also determined that he was an “incidental bystander” in the contested material, and ruled that imposing his wishes would be “unduly onerous on the content creator, and/or disproportionately chilling for free speech.”\n“You may still tag your likeness here with nonbinding reuse advice,” the app added helpfully. “Just check one or more of the following. This image is inappropriate for general media release if I am (a) arrested, (b) deceased, (c) a victim of crime.”\nWhen he arrived at the campus, he sprinted to the lecture theater and managed to reach a seat in the back before the demerit siren sounded. The Machine Learning classes had been packed for the first four or five weeks, full of people who fondly imagined that the course would enable them to found their own billion-dollar start-ups, but as the truth sank in, the numbers had thinned. Some of the methods they were studying could be extremely useful for certain kinds of problems, but there were no magic bullets, and the most noisily hyped commercial applications were pure snake oil.\nAfter the lecture, as he joined the students filing out, someone touched his shoulder. He turned and saw Sarah frowning at him. “You look terrible,” she said. “Did you find a new place or are you sleeping on someone’s couch?”\n“I found a place,” he insisted. “It’s not perfect, but . . . ”\n“What?”\nHe described the morning’s musical interlude, but that wasn’t actually the reason he was tired. “I lost a tutoring job last night,” he added. All his troubles sounded petty when he spelled them out this way, but the line from David Copperfield was hard to argue with. How many shillings was he away from misery?\n“Are you still working at the casino?” he asked, as they emerged into the glare of the courtyard.\n“Yeah. I’ll let you know if there are any openings.”\n“Thanks. Though I’d rather just take them for a few grand, if you can swing it. What’s the point of a computer science degree if I can’t even empty out a poker machine?”\nSarah nodded. “I’ll see what I can do. But maybe you should practice first by hacking the cat.”\n“The cat’s been through enough.”\n“Exactly,” she agreed. “Hack it so those clowns can’t keep messing with it.”\n“I’m not sure I want to start a feud with people I have to live with.”\n“Cover your tracks!” she urged him. “You think they’re going to hire a digital forensics team to find out why their kitty’s stopped doing party tricks?”\n“I wouldn’t put it past them. Lisa has sixty thousand followers on YouTube.”\n“That’s not going to pay for anything,” Sarah scoffed.\n“I know, but I think she has rich parents, and she really likes the likes.”\nThey were approaching the library. “Is everything okay with you?” James asked. In between their banter he was sure he’d sensed something nagging at her.\n“I broke up with Andrew last week,” she said.\n“I’m sorry. How long were you together?”\n“Seven months. But I met someone on the weekend, so there’s that.”\n“Okay. That’s . . . efficient.”\nSarah smiled and replied in a Tennessee Williams drawl, “I have always depended on the strangeness of Tinder.”\nJames glanced toward the entrance to the library. “I have an assignment due.”\n“Okay. I’ll see you around.”\n4\nJames was in the kitchen, cooking pasta, when a small blue-and-white marble rolled between his feet and rebounded off the cupboard beneath the sink.\n“That’s a goal!” Ferouz proclaimed from the doorway. Pawpaw stood in front of him, wearing tiny roller skates and holding a miniature hockey stick in his mouth. Lisa was off to one side, recording, as always.\nJames said nothing, but Lisa caught the look on his face and launched into a defense. “He loves doing these videos! It’s an enriching experience for him!”\n“You ever thought of getting him a toy mouse?” James suggested. “One of those motorized ones he could chase around the house?”\n“Eew, that would be creepy,” Lisa declared.\nPawpaw began to slip on the linoleum; he looked alarmed for a moment but managed to flop down on his side. Ferouz approached and took the skates off. “We’re the ones who pay for his food and vet bills,” he pointed out. “Justine doesn’t help. We could have just sent him to a shelter when Noemi moved out.”\n“So what if I pay my share?” James asked rashly. “Would I get a say in how he’s treated?”\nLisa did not look happy, but Ferouz replied, “You’d get an equal vote.”\nJames pondered the proposition. If he wanted to have the collar turned off, Ferouz and Lisa would vote him down, but maybe he could chip away at their bloc by starting with smaller issues.\n“If I agree to pay a third of his upkeep, and I buy a toy mouse, will you vote to let him play with it?” It wouldn’t be so bad going for broke if he was guaranteed at least one success.\nFerouz did not seem discomfited at all. Maybe he was looking for a chance to save money, while still holding on to the balance of power—and needling Lisa would just be a bonus. “It’s a deal,” he replied.\nJames ordered the mouse online; it arrived three days later. He unpacked it and tested it in his room. It had obstacle detectors and motion sensors that allowed it to give a reasonably convincing imitation of a creature trying to sneak along out of sight, freezing if it came under scrutiny, fleeing if it was pursued. At least it was a pure dumb robot, incapable of actual fear or pain. He’d read that the military were still perfecting their cyborg surveillance rats and pigeons, but every species posed its own set of challenges, and so far the only consumer product the research had spawned had been for cats.\nHe inactivated the mouse and carried it to the living room. Lisa and Ferouz were playing a video game that appeared to involve zombies driving racing cars; Pawpaw was nuzzling Lisa’s calves, and she occasionally reached down and stroked his head.\nJames placed the mouse on the floor and switched it on with the remote. It scurried across the carpet and hid behind the monitor stand. Pawpaw didn’t react, but Ferouz turned to James. “Ah, you got it! Cool.”\nHe paused the game, and Lisa picked up her phone.\nJames stood in the doorway, feeling slightly foolish; the mouse wasn’t moving, and Pawpaw was yet to show the slightest interest in this lump of plastic covered in synthetic fur. The mouse’s courage level could be set on a scale from zero to toxoplasmosis; he raised it a notch. With no actual goal, it nonetheless left its sheltered spot and began a cautious traversal of the skirting boards.\nAs the mouse scrabbled across a discarded pizza menu, the crinkling paper made Pawpaw’s ears prick up. The cat turned and stared, and James could see him tracking and assessing the intruder from where he stood. But he still wasn’t stalking it. James dialed up the mouse’s brazenness again; it veered away from the wall and dared to attempt to cut across the corner of the room.\nPawpaw jumped up onto the couch, cowering against Lisa, who was recording everything. The cat squirmed around and peeked again, then buried his head in the space between the backrest and the cushions.\nFerouz burst out laughing but waited until Lisa had finished her video to avoid spoiling the soundtrack with his gloating. “Did you get what you wanted?” he asked James. “Looking out for the poor tortured animal’s interests?”\nJames didn’t reply, but as angry as he was, he could only blame his own lack of research. How had he supposed the collar kept native rats safe? Some magical species-specific filter? Or just a powerful aversion to every kind of stimulus that normally characterized prey?\nFerouz said, “Domesticated really means domesticated now; he’s not some half-neotenous would-be jaguar who just tolerates us for the sake of an easy life. He’s our widdul puddy cat, and if we want to dress him up as Santa and pimp him out on YouTube, he’ll have no choice but to love every minute of it. If you have a problem with that, you can fuck right off.”\nJames powered the mouse down and took it back to his room. Wherever his stubbornness was trying to lead him, he really did not have time to go there. What he needed to do now was swallow his pride, find more work, and keep his head clear for the sake of his studies. If he still had the urge to salve his conscience, he could give a few dollars to an animal shelter. Everything else was out of his hands.\n5\n“Go back to Lisa!” James pleaded. It was two in the morning, and he was asleep on his feet, but Pawpaw wouldn’t let him take a step without, not so much following him, as weaving between his ankles in a shackling maneuver that made it impossible to go anywhere without his pursuer arriving simultaneously.\n“All right, I give up.” He let the cat into his room. Pawpaw jumped up onto the bed and began digging his front claws into the sheet.\nJames opened his mouth to scold him, but then decided he didn’t care. And who knew to what degree the collar would amplify his displeasure?\nBut that question didn’t have to remain unanswered.\nHe sat down and booted up his laptop, then went and made a cup of coffee. Pawpaw didn’t follow him into the kitchen; it seemed he was content with having been granted access to the previously forbidden haven.\nWhen James returned, the cat was curled up on the end of the bed. As he unbuckled the collar, he half-expected an ear-splitting alarm to go off on Lisa’s phone, rousing her to furious vengeance, but nothing disturbed the night’s silence. Pawpaw scratched some of his newly uncovered fur with his back foot, then appeared to doze off completely.\nThe collar talked to the electrodes with Bluetooth and the home network with Wi-Fi. The default password for the admin account was stamped into the plastic; the dye in the hollow that had made it readable was gone, but a pencil rubbing revealed it easily. Neither Noemi nor anyone else had bothered to change it.\nJames made copies of all the apps and decompiled them with a tool that produced source code with helpful annotations, rendering the structure of the programs easy to discern. As a bonus, the apps called hundreds of routines in a dynamically linked library that needed actual names, rather than raw binary addresses, to be specified in the file at hand, so the code was peppered with invocations that bordered on the self-explanatory: InstallPreyMotionResponder, RampAversiveStimulus, TriggerPositiveAffect.\nThe Keyboard Maestro app was actually a cross between an augmented reality system and a bad drug trip, in which a nameless, formless, sense-of-something-moving appeared overlaid on each key as required, compelling the victim to reach out and swipe at it. You could encode whatever piece of kitsch you wanted played into a series of impressions of having not quite glimpsed a cockroach burrowing through from another dimension. James remembered teasing his own cat, Silver, with a spot of reflected sunlight that she’d chased across the floor, but at least she’d always had the option of walking away.\nOnce he had a sense of what the apps were doing, the question was what the best way to undermine them would be. If he simply blocked them all from running, Lisa and Ferouz would just take the collar to be repaired. Even if he could avoid being blamed for the sabotage, any victory would be short-lived.\nHe needed something more like a slow fade-out, which could plausibly be explained by the cat gradually habituating to the signals from the collar, or the performance of the electrodes degrading. He looked up the warranty conditions; if anything went wrong after thirty days, you were on your own, regardless—but once the problem shifted from the collar to the electrodes, the cost of any remedy would be astronomically greater. There weren’t that many vets who did the surgery in the first place but finding one who would dive back into the skull in order to address, not a swelling or infection arising from the implants, but merely a lack of compliance by the animal, would raise hurdles that even the most deranged petfluencer might balk at.\nThe collar ran a common variant of Linux for wearable devices that tens of thousands of people had already had reason to mess with. James found a description online for a fairly simple way to unlock the bootloader, and then he installed new firmware that let him run unsigned code. All he had to do now was modify a few low-level library routines, so that the signals to the electrodes tapered down to nothing over the next couple of weeks. Aside from aiding in the subterfuge, that would probably be easier for Pawpaw than going cold turkey.\nHe made the changes, but then wondered how he could verify that he’d actually done what he thought he had. So far, this was all just symbols on the laptop’s screen. Pawpaw was breathing slowly and deeply, his head twitching slightly every now and then. It seemed cruel to wake him just to test the apps’ potency for various settings of the fade-out parameter.\nWhat was going on inside his skull, right now? James hesitated, but then laughed off his qualms and wrote a small program that extracted all the available data and displayed a summary in real time. He couldn’t create an image of the cat’s visual field, but he could track which kinds of objects and motions were being hallucinated and the actions that the motor cortex would be producing if not for the paralysis of sleep.\nPawpaw was dreaming of something scurrying across the ground. The usual background process that made him fear his natural prey was no longer running on the collar, and, at least in this state, he had not internalized the conditioning: he was stalking the animal, not fleeing from it, and the electrodes’ crude emotional register declared that he was both excited and focused.\nJames watched the dream unfold. There were episodes of pursuit, and the dispatching of prey, but also affectionate tousling with animals of the dreamer’s own size, as if he was reliving wrestling with his siblings. Larger figures strode across the landscape too, eliciting a more complicated response, part fearful, part fraternal.\nIt was mesmerizing . . . but the household would be awake soon, and James needed to be sure that his changes to the library really could damp down the prodding from the electrodes. He injected a keyboard-cockroach into Pawpaw’s dream, at full strength, and saw the swipe response it evoked. Then he set the dial to zero and tried again; there was nothing. At fifty percent, the dreamer noticed the incursion, but the reaction was tentative. The apps would lose their grip slowly, their decay seeming more like natural causes than foul play.\nJames rebooted the collar and put it back in place. Pawpaw stirred and eyed him resentfully.\n“Two weeks and all the crap will be out of your head,” James promised.\n6\n“A kernel machine generalizes this approach, identifying the separating hyperplane without explicitly mapping the raw data into a higher-dimensional feature space.”\nJames already knew the material, but he didn’t dare surrender to exhaustion and close his eyes when the facial monitors were primed to record every lapse of attention. So he stared at the whiteboard intently, even as he tuned out the lecturer and began free associating, hoping to stay on the right side of the separating hyperplane.\nMaybe he could grab a nap on the grass at lunch time. He couldn’t afford to miss his shift tonight; he was already scraping along the bottom of his bank account, skirting the edges of his credit card’s interest-free zone. He’d been given as many hours at the restaurant as he could hope for, but even if he could find more work, he didn’t have the time for it.\nWhat he needed was a way to earn money in his sleep. Would anyone pay to watch him lying in bed, through a webcam, with no sexual content at all? Probably not—even if it was a thing, the market would already be flooded. Were there tasks he could do on Mechanical Turk without being awake? Maybe check an audio stream for the sound of children being tortured; the content moderation bots weren’t up to that yet. Would he grimace detectably if he heard an atrocity? Some fraction of the time, he might, but it seemed unlikely that he could do it reliably. And how did they get away with calling it “Mechanical Turk” anyway, as if eighteenth century orientalist shit was just fine if it was a historical reference? Why hadn’t anyone launched a competitor called “Mechanical Habsburg”?\nIt was too hard to get information in and out of his skull while he slept. But Pawpaw had a channel wide open, twenty-four hours a day. While the cat was dreaming, he could also be . . . saving self-driving cars from collisions? Millions of cats had been hit by cars, but so had millions of human pedestrians; both species were still better at object detection than any car without lidar.\nThe siren sounded for the end of the lecture. James gathered his things and headed out, letting his idiotic fantasy slip away. The electrodes in the cat’s brain couldn’t induce detailed visual perceptions; the best they could manage were vague intimations. Whatever feats Pawpaw could perform in his sleep, he was never going to earn his keep as a node in the global network of computing resources.\nIn the courtyard, James caught up with Sarah and described his adventures with the collar’s software.\n“I didn’t think you’d actually do it!” she said. They found a patch of shade and sat on the low wall. “You should think about the other cats, though. You might have unplugged one, but what about the rest?”\n“I was going to move on to the American President’s First Kitten, but then I realized they’d whisk me off to a black site the moment it refused to play ‘The Star-Spangled Banner.’”\n“I’m serious.”\n“Okay, but how? Getting malware onto the app store is beyond me. Maybe if I had a free month or two I could learn what I needed, but . . . ”\n“What about non-malware, then?” Sarah suggested. “A genuine app, as far as the collar is concerned—but one that might dissuade the owners themselves from running the other apps?”\nJames was on the verge of retorting that social engineering wasn’t always easier than malware, when a possibility crystallized in his mind. “Instead of entertaining them by jumping through hoops, what if the cat could show them what it was dreaming of doing?”\nSarah was skeptical. “You said all you could extract was a kind of textual running commentary.”\n“I did. But if artificial neural networks are good at anything, it’s confabulation. Feed those prompts I saw this morning into the right kind of image generator and maybe half the demographic who think that their pet being goaded into playing Pachelbel’s Canon is adorable might either get a jolt of empathy when they grasp what it would rather be doing—or if that’s too much to hope for, find something trippy enough, or twee enough, in the neural net’s imagery to scratch the same itch.”\nSarah didn’t reply. James was so tired that he started to wonder if he’d actually spoken or just spelled out the proposal in his head.\n“You should do it,” she said finally. “I’ll help, if you like.”\n“I’m dead on my feet right now,” James admitted.\nShe smiled. “I can see that. Maybe next week?”\n“Absolutely.”\nIt was insane, but it wasn’t impossible; once he’d caught up on his sleep, they could probably find a few hours between lectures to start putting the app together. And he’d completed the hardest part already: he had a direct line to Pawpaw’s brain. He could log the cat’s dreams, build up a data set, and then start to work out what kind of shiny distractions he could dangle in front of the humans in the hope of overcoming their primal compulsions and rendering them fit for a domestic life in the company of another species.\n7\n“Stupid animal,” Lisa muttered, scowling at her phone. Pawpaw walked past her and rubbed his head satisfyingly against a table leg before strolling over to his food bowl.\nJames kept quiet, but later that night he went through the activity logs from the collar and saw that Lisa had run the diagnostics three times in the last twenty-four hours. All the reports were listing no faults, of course. He had no idea what she’d do when Pawpaw’s immunity to the apps proved to be more than a temporary glitch, but even if she was willing to shell out the money for a new collar, he’d found a Bluetooth exploit that could mess with the electrodes directly. The puppet show was over—in this house, at least.\nHe started up the latest iteration of the dream app. After feedback from the beta testers, he’d made the style transfer much smoother; he could even slide mid-playback between different forms of pastiche now, from van Gogh to Francis Bacon, from Watership Down to Studio Ghibli.\nHe leaned back and watched the customized Dream Cat (emerald-eyed, dainty, black-and-white coat) padding through a wheat field beneath a swirling starry night. When the stalks of the crop rustled, the Cat paused and crouched down low. The tension after each small sound made it clear that it had been wise not to try to add musical embellishments; the YouTubers could smother their versions with anything they wanted once they got it in their editing suites, but even though the unadorned original was ninety-five percent concocted, it had a kind of aesthetic unity.\nWhen the Cat finally pounced, this style spared the viewer from explicit gore, but it still portrayed the act with no ambiguity. The Dream Cat played with his prey, then tore it apart. While the dream-logging portion of the app was running, it would disable everything else on the collar; there would be no punishment meted out for these transgressions. The owner would see their pet’s idea of normal behavior—and with luck, that might sway some of them into offering a substitute during waking hours. An information screen on the app explained how the imposed aversion to prey-seeking could be shut off while the animal was indoors, expanding the possibilities for play. Telling people to throw away the collars completely would be sure to get the app rejected by the store but encouraging them to change one simple default wouldn’t threaten the whole business model. If anyone’s conscience took them further, that was up to them.\nJames heard scratching at the door. He let Pawpaw in, expecting the cat to curl up on the bed, but instead he circled around the room restlessly.\n“What is it?”\nPawpaw stopped beside his desk, rubbing his head against the drawers. James opened the top drawer and took out the toy mouse. “Really? You knew it was in there?”\nHe switched the mouse on, then placed it on the floor. Pawpaw stared at it, but it remained frozen.\nJames dialed up the mouse’s risk-taking behavior, and it scurried away. Pawpaw went after it, but it managed to escape into the space beneath the closet. The cat stretched a paw into the dark gap a few times, then concluded that this was unlikely to be fruitful, and sat back to wait.\nThis was all just an artifice, too, but holding out for the cat’s right to ravage actual wildlife would be untenable. There had to be some pragmatic balance between allowing domesticated animals to follow their instincts, entirely untrammeled, and forcing them to submit to whatever humans found amusing. “One must imagine Pawpaw happy,” James suggested in his best David Attenborough voice.\nHis laptop pinged; he had a message from Sarah.\n“Are we ready to submit?”\nJames could easily imagine spending another week or two just playing with the style selector, but they’d reached the point of diminishing returns.\n“The code’s ready,” he replied. “But we still don’t have a name.” They’d kept putting it off while they tackled more important things.\n“Any ideas?”\nHe’d thought of half a dozen, but none of them really grabbed him. He trusted Sarah’s judgment more than his own; she’d usually had more sleep.\n“You decide.”\n8\nJames was pouring rancid fryer oil into the tank in the alley behind the restaurant when the email arrived. “Congratulations! Your app Ghost Cat has now passed verification and is live on the Collar Store!”\nOn the bus home, he checked the statistics; there’d been three downloads in the past two hours. He and Sarah needed five hundred to break even on the fee for their developer’s account. He refreshed the page a few times, but the count hadn’t budged when he collapsed into bed, and in the morning, he resolved not to look again for at least a week.\n“Nineteen sales!” Sarah announced cheerfully, when he ran into her the next day.\nJames laughed. “Oh well. It wasn’t a complete waste: we can probably recycle it as an undergraduate project.”\n“How’s Pawpaw doing?” she asked.\n“Fine. Lisa and Ferouz have lost interest in him completely; all he does now is eat, sleep, and chase the mouse. I showed him his old roller skates once, just out of curiosity, and he looked at me like I’d shat on the carpet.”\n“Ha.” Sarah hesitated. “You know how we weren’t going to advertise?”\nJames steeled himself for a fight. “We can’t afford it. Seriously! I’ve already sunk more into this than I can spare.”\n“I’ve already paid for it myself,” she replied. “I won’t ask you to split the fee unless we go into profit.”\n“Who’s the advertisement with?”\n“A woman named Frida with a YouTube channel called Fully Wired Kitten. Ten times more followers than Lisa. She wanted fifty dollars and a free copy of the app, to test it and run a review.”\n“So she might not even like it?” James didn’t want to harangue Sarah when she was bearing the whole cost of the strategy, but it sounded like a grift either way: if payment guaranteed a positive “review” then Frida was cheating her audience out of an honest assessment—but if it didn’t, how could she justify the fee?\nSarah said, “We’ll find out soon enough. It’s going out tonight, around ten o’clock.”\nWhen he arrived at the restaurant, James switched his phone off, so he wouldn’t give in to the masochistic urge to monitor events he had no power to control. There’d been a time when he would have claimed that the raison d’être of any software he wrote would be to fulfill some user’s genuine, preexisting need. But almost every app was a kind of weapon now, however grand or petty the cultural skirmishes it enabled. He didn’t regret the payload he was trying to deliver, but now that he’d committed to a strategy of manipulation, he’d stepped into a world that he’d once vowed he’d never be a part of.\nThe griller was beeping; one of the patties was stuck. “Are you fixing that?” Ken called to him.\n“I’m on it!” James replied.\nWhen he finished the shift, he kept his phone off; he didn’t have the stomach for the near-certainty of bad news. When he woke the next morning, any itch of curiosity, and even the desire to tear away the bandage quickly, had all but vanished. He fed Pawpaw and ate breakfast without switching on his laptop or his phone.\nHe felt calm as he left the house. The lectures he attended seemed imbued with a startling new clarity, as if he’d updated the prescription on his glasses.\n“James? Where have you been?”\nSarah stood in front of him, with a look on her face that might have made sense if he’d fallen from the sky after a decade’s unexplained absence.\n“Here. I just . . . ” He pointed back toward the lecture theater.\n“I’ve been trying to reach you all morning!”\nJames couldn’t read her expression. “Is there a bug in the app? Are we turning all the cats catatonic?”\n“Don’t be ridiculous.”\n“Why are you so upset, then? We got a bad review, the app bombed. It’s not the end of the world.”\nSarah said, “You really haven’t checked again, since Frida panned it?”\nJames was silent; he’d guessed one thing correctly, but what was he missing?\n“After the review went out,” Sarah explained, “someone saw the clip on Fully Wired Kitten of the dream that was supposed to damn the whole thing . . . and reached the opposite conclusion.”\n“Okay. So not all the commenters agreed with Frida.”\n“I’m not talking about some random commenter. Calista saw the clip. Calista disagreed. She bought the app and ran it for her own cat and loved it.”\n“Who’s Calista?” James caught himself. “You don’t mean . . . the singer?”\n“Yes.”\n“I probably shouldn’t call her that, when she’s ninety percent auto-tune, ten percent sighing.”\n“She’s won four Grammys,” Sarah replied. “I don’t like her songs either, but she has fifty million followers. Since she posted about the app, we’ve had ten thousand downloads.”\nJames absorbed this revelation. Their cut on each sale was about a dollar, so five thousand each. He could probably afford to reduce his shifts, maybe drop the last two hours and finish at eleven, the way he used to. “Not bad for an undergraduate project,” he joked. Money aside, the number of downloads was only two percent of the half million collars currently installed, so they hadn’t exactly liberated the wired cats of the world from their oppressors. But if a celebrity was championing dream-watching, that might yet shift the balance a little further.\nOn the bus to the restaurant, he watched both posts, immune to Frida’s scorn. “What this app spews out is nothing but a form of face-swapping revenge porn!” she fumed. “This is not my Prince Whiskers at all. Over the last few months, you and I have been on a marvelous journey with him that uncovered so many of his hidden talents: as a jazz musician, a fashion model, an imperfect but ever-striving pastry chef. Now these ham-fisted morons are trying to foist a cartoonish parody of the feline character onto all of our beloved companions.”\nCalista’s take was different. “Finally seeing into Lady Lydia’s soul, not only does this prove that she has always been my spirit animal, it has empowered me to fully embrace my own dark, predatory instincts. Expect new tracks that take you where no human can walk alone; only our mingled essence can survive the way of the carnivore.”\n9\n“I’m giving two weeks’ notice,” James said, clutching his hairnet awkwardly in one hand. “I hope you can get someone to replace me by then.”\n“You’ll come back when you need the money,” Ken predicted.\n“Maybe.”\n“What? Someone died and left you an inheritance?”\n“I got a couple of tutoring jobs,” James lied. “The rate’s pretty good, so it works out better. And I can get more sleep.”\nFor a second, Ken looked envious. “Okay,” he said. “Good luck.”\n“I’ll stick around for two more weeks,” James promised.\nOutside the restaurant he strolled through the humid night, relieved but weary. He’d parked the car eight blocks away, afraid of having to explain the purchase if a fellow worker saw him with it. “You’re dealing drugs now, right?” “No.” “Then how could you . . . ?” “It’s a long story.”\nIt was only a ten-minute drive to his new place. Inside, when he switched on the light, Pawpaw and Phantom stirred briefly, but remained curled up on the couch together.\nThe light was still on in Sarah’s room, so he knocked on the door. “Come in,” she said. She was in bed, but she was looking at something on her laptop.\n“I gave notice,” James told her, standing in the doorway.\n“Finally!”\nHe shrugged. “I was never sure our sales weren’t going to tank. I mean, the hype can’t last forever.”\n“We have something better than hype: controversy.” Sarah turned the laptop around to show him the screen; she’d been watching a clip from a US talk show. “They interviewed an animal behaviorist, who explained that the Ghost Cat dreams are just embellishments that shouldn’t be taken literally.”\n“You mean, exactly what we admit ourselves in the disclaimer?”\n“Yeah, but it’s nice to know that even people with PhDs don’t read terms and conditions. And on the plus side, he also said the electrodes themselves should be banned.”\n“You think that’s going to happen?”\n“Eventually,” Sarah replied. “But no one made it a priority when the things first came out, so I can’t see any jurisdiction rushing through legislation, just because the hardware’s getting more attention thanks to a more benign use.”\n“And one bad singer.”\n“Be nice. Calista’s catching all the flak from the old-school collar users, while we hide behind our brand name. Has anyone released a diss track about you, lately?”\n“Not that I’m aware of.” James gathered up his courage. “So maybe we’ve got a window. A few months in which we can . . . leverage this.” Sarah didn’t reply immediately, and he felt his face burning, as if he’d just confessed to an unspeakable crime.\n“You mean go after venture capital?”\n“Yes.”\n“I’ve been thinking about that myself,” she confessed. “But I always thought you were committed to a life of open-source projects for philanthropic foundations.”\nJames frowned. “Are you mocking me?”\n“Absolutely.” She smiled. “Anyway, if some VC is willing to fund us because a pop star threw a spotlight on Ghost Cat, so long as the new project has merit there’s nothing to feel guilty about. We’re the ones who struck a blow for animal liberation, aren’t we?”\n“Maybe.”\n“So.” Sarah set her laptop aside. “What’s the project? What’s the pitch?”\n10\n“Suppose your grandmother lives in a sprawling retirement complex,” James began. “There are six different gates by which a vehicle can enter. One is fifty meters from her front door; the others might not even give access to her location. But every time she calls a taxi, or a rideshare—or an ambulance—and gives her full address as a resident within the complex, some half-baked Geographical Information System from one of the big providers redirects the vehicle to what it wrongly thinks is the correct street address for the whole complex. The wrong gate, on the wrong street.”\nCelia Davenport interrupted him. “Surely Google have this covered?”\n“You’d think so,” James replied, “but they don’t. This isn’t hypothetical.” He scrolled to the survey results on his deck. “Six percent of our respondents said they’ve experienced problems due to GIS errors, ranging from having to stand in an alley in the rain to collect a supposedly home-delivered pizza, to ambulances delayed because they’re unable to locate their patients. And it’s not just summoning vehicles: three percent of people who try to type their true postal address into a web form are told it doesn’t exist, so they’re forced to abandon the interaction, or accept some approximation such as dropping the suffix that specifies the halves of a duplex. So the effects range from nuisance level to life-threatening, but even misdirected parcels add up to millions of dollars in lost productivity. These systems are marvelous when they’re accurate, but when they’re not, they’re like an invisible brick wall.”\n“So what’s the solution?” Davenport pressed him. “How do you train your networks to do a better job than everyone else?”\n“We don’t make it a machine-learning problem at all,” James replied. “We buy access to multiple databases, we identify the discrepancies between them, and we classify and remedy the problems using traditional, robust, deterministic code. I don’t care if someone has a neural net that gets ninety-five percent of addresses right. I’m aiming for software with so few errors that the dozen or so cases per million it can’t deal with can be handled manually by a staff of two or three.”\nHe waited for the shockingly sane proposal to sink in. He wasn’t pitching a mash-up of sexy buzzwords. He wasn’t claiming to cure death or world hunger. He wasn’t even hoping to get millions of people hooked on some vacuous time-sink they’d never even known they’d wanted before. He just aimed to do one job properly that no one else could be bothered getting right.\nDavenport grilled him, but after his rehearsals with Sarah he was well prepared. Finally, she said, “I’ll get back to you in a couple of days, but I think we’d be willing to partner in your pilot program, if you can match us dollar for dollar on the costs.”\n“All right.” That wasn’t quite what James had anticipated, but the revenue from Ghost Cat ought to cover his share. “I’ll look forward to hearing from you.”\nWhen he’d hung up the call, all the implications that would flow from a favorable decision began to seem a lot more real. For a start, he’d have to drop out of his degree—with most of the debt remaining, but no qualification to show for it. There was no way he’d have time to run even the pilot program and keep studying.\nHe’d always laughed at the aspiring tech moguls sitting in the lecture theaters beside him, convinced that they were about to make their fortune from the latest overblown trend. But his project was solid: it solved a real problem that wasn’t going away. Just because it was a celebrity endorsement for fabricated imagery of cats’ dreams that had brought him here, that didn’t mean his feet weren’t still planted firmly on the ground.\n11\n“I noticed something today,” Sarah said, as she joined James at the dinner table. “You know how we’ve been getting roughly the same sales for the last twelve weeks?”\nJames smiled. “Yeah, but I’ve been trying not to dwell on it, because I’m sure it can’t last. To be honest, I thought we’d saturate the market much sooner.”\n“So why do you think the sales are holding up so well?”\n“Because Calista’s side is winning people over?”\n“They’re not, though,” Sarah replied bluntly. “There’s still a huge number of collar owners who aren’t buying Ghost Cat. They’re not being won over.”\nJames was confused. “So who are we selling to?”\n“Brand new collar owners,” she said. “People who are putting electrodes into their cats’ brains, because it’s more fashionable now. Thanks to Calista, but . . . also thanks to us.”\nJames said, “I don’t believe that. The numbers must have been growing anyway.”\nSarah took out her laptop and showed him a plot. The sales of new collars had spiked a week or so after Calista’s post; it had dropped back since then, but it was still almost fifty percent higher than it had been before.\n“Fuck. Fuck!” James stood up and walked away from the table. “Why did you have to tell me that?”\n“Seriously? You wish I’d kept my mouth shut?”\nIt took him a few heartbeats to calm down enough to relent. “No,” he said. “I’m sorry. But . . . ” Even if the new collar owners were wholly uninterested in puppetry, the surgery itself was risky. And once they got bored with their cats’ dreams, would they really eschew all the other novelties the electrodes enabled?\n“Just imagine what Celia Davenport will think, if we tell her we’re pulling the plug on the app that’s keeping us afloat while we work on Abode . . . because it grew the market too much.” He could forget about anyone ever taking a pitch from him again.\nSarah said, “Even if we pull the app, there are clones like Oneiro that have all the same features. We’re on top because we were first, and the price is reasonable, and Calista touted us. But if Ghost Cat vanishes, it won’t kill the trend.”\nJames couldn’t argue with that. “So what do we do?” Accept that things had spiraled out of their control and just keep taking the money? He glanced over at Pawpaw and Phantom, happily gorging themselves on sheep liver. Nature was a bloodbath, and humans were shit; if he and Sarah were treating their own pets well enough, maybe that was the most they had a right to aspire to.\nSarah said, “I have an idea. But it’s pretty extreme.”\n“A way to slow down the sales of new collars?”\n“Yes. Maybe even get the electrodes outlawed and put the kibosh on any canine version in the works.”\n“Is it legal?”\n“Ummm . . . ”\n“Can we cover our tracks?”\nSarah hesitated. “Probably.”\nJames braced himself. “Will we have an alibi with Davenport, when our revenue dries up?” If she canceled her investment, he could live with that; he could reenroll in his degree and treat the whole entrepreneurial detour as a fever dream. But if she believed he’d flat out lied to her, that could mean anything from permanent unemployability to a jail term for fraud.\nSarah said, “Of all the people she might blame for the death of Ghost Cat, I think we’ll be a long way down the list.”\n12\n“We need to make it look like there are two versions of the app,” Sarah stressed. “One that actually worked and did everything it claimed to do. Then someone took that version, kept the user interface and enough of the original code to pass a superficial inspection, but stripped out all the true functionality and added a sting in the tail.”\n“That’s a lot of work,” James protested. “And it’s not as if anyone’s going to take the broken version to Consumer Affairs.”\nSarah said, “If this all pans out, don’t you think there’ll be competent tech journalists looking into it, eventually? If they examine the app we actually release, and it looks like it was written from scratch as a kind of poisoned honeypot, the spin on the story will be completely different than if it looks like someone used a preexisting app with an established user base as camouflage for the same thing.”\nJames took their plates over to the sink and started washing up. “Do you think there is an actual preexisting app, with an established user base?”\n“There might well be,” Sarah replied. “But do you want to go on the dark web and search for it? It’s risky enough faking something like this; do you want to get caught downloading the real thing?”\n“No,” James conceded.\nSince he was already familiar with apps from the Collar Store, the first part of the coding fell to him. He tried to think of the task functionally, breaking it down into the gathering of the user’s preferences, and then the means by which the sensors in the collar and the signals sent to the electrodes could be used to enact the required result. It was instrumentality in its purest form: line after line of code that treated the collared animal as a device to which a series of commands could be sent.\nAfter three days, he was numb, but he had something that he believed looked like a genuine attempt to achieve the goals they wished to mimic. When he passed it to Sarah, he said, “Make sure you eviscerate the fuck out of this. If someone ‘fixes’ it and makes it work . . . ”\nShe said, “I’ll gut it so the cuts don’t show, but they’re still completely fatal. I promise.”\nJames had a long shower, then went to bed.\nHe spent the next week working on the Abode database, unsure if it was now just a kind of cover, or if he might yet stand a chance of getting it running. Sarah still had lectures to attend and assignments to complete, so her half of the shadow project took her longer. But on the weekend, she spent the whole of Saturday disabling and booby-trapping his app, and on Sunday morning they reconvened.\nJames said, “Okay, people might create shit like this. But who would be stupid enough to draw attention to it?” If the dark web did harbor non-defanged cousins of the app they’d written, even at the height of media interest in the collars this fact had not been splashed across the home screens of every news site. So how were they meant to bring their own version to prominence without tipping their hand?\n“There’s a precedent for evangelism,” Sarah replied. “Believe me, you don’t want to wade through the results of that web search, but . . . a while back, there was a British crackpot named Jasper Mellick, whose fifteen seconds of infamy came when a couple of universities sued him for squatting on domain names that were slight misspellings of their own and redirecting all the traffic to his BLTZ manifesto.”\n“BLTZ? Is that a rap group?”\n“Better Living Through Zoophilia. His long loony screed praising the utilitarian benefits of genetically engineering animals that would enjoy having sex with people.”\n“Umm . . . you’re not suggesting we frame him for the app?”\nSarah said, “He’s dead. But the Internet hasn’t quite washed away every trace of him. If we use the BLTZ name, and quote from the manifesto, we can make it seem as if he still has anonymous disciples willing to go all out to spread the message.”\n“So we make a video, with masks and ranting?”\n“Yes.”\n“Synthetic voice or disguised voice?”\n“Disguised synthetic voice,” Sarah decided. “It has to sound like a disguised voice, or the media won’t take it seriously.”\nThe masked figure was CGI, of course, with glimpses of eyelids blinking behind the holes. “We are ushering in a new age of universal flourishing,” the mask read from Mellick’s manifesto. “When no one, man or beast, need be sad, frustrated, or lonely.”\nThey put the video, and the butchered app, out onto the torrents and IPFS, then sprinkled links to the video in comments to half a dozen posts in the Ghost Cat flame wars. A couple of hours later, it had started garnering some attention—and while it was easy for anyone to check that the app it referred to actually existed, the need to hack the bootloader in a collar in order to run it, and a reluctance by most people to even touch the cursed thing with six-foot tongs, meant the claims in the video were spreading much faster and wider than the truth that some or all copies of the app (who could say?) had been corrupted with malware that would freeze the cat’s Bluetooth.\nJames said, “When your grandchildren ask you—”\n“No,” Sarah cut him off. “Neither of us are ever going to speak of this again. If it works, it works; if it doesn’t, we did our best. But no bragging, ever. If we don’t end up in court, we take this to our graves.”\n13\n“If you can keep him calm and hold him still for about five minutes,” Dr. Feldman said, “we’ll only need a local anesthetic.”\nJames said, “I think that’ll work.”\nHe stroked Pawpaw’s neck, then gripped the back of his head tightly; the vet slipped the needle into the skin midway between the three antennas. Pawpaw looked startled, then annoyed, but he didn’t go berserk, and James didn’t let him pull free until the needle was out.\n“Okay. Now just try to get him to relax while that takes effect.”\n“Sure.”\nDr. Feldman dropped the hypodermic into his sharps bin. “This is the tenth of these procedures I’ve done this week; everyone’s rushing to get ahead of the ban. I wish people had thought a bit more before they buried wires in their pets’ skulls in the first place.”\n“I inherited him like this,” James protested. “It wasn’t my idea.”\nDr. Feldman said nothing, but still managed to convey with one eloquently skeptical glance: that’s what they all say.\nFor each antenna, he made a small incision, snipped the active circuitry off with something that looked like a small pair of bolt-cutters, then deburred the top of what remained with a polishing tool and stitched up the cut. Pawpaw grew increasingly impatient: doing this weird shit once was just human-level annoying, but again? And then again?\n“Okay, we’re done.” Dr. Feldman handed James a pamphlet on wound care.\nJames got Pawpaw back into the cage for the ride home. When Silver’s cancer had been judged incurable, he’d carried her body home in the cage he’d brought her in, and he’d sworn he’d never have a pet again. But here he was.\nAt the bus stop, he poked a finger through the wires and stroked the top of Pawpaw’s nose. “It’s going to sting when the anesthetic wears off,” he said. “But not for long. Just take it easy. It’s almost over now.”", "source": "https://clarkesworldmagazine.com/egan_04_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dream Factory by Greg Egan"}