{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "bfY7qkaWWHDSaT2YKvfeInwkAe8=", "id": null, "license": null, "comments": "", "raw_text": "Interview  A Terrifying Mix of Honesty and Rigor: A Conversation with Kij Johnson  Kij Johnson didn't really want to be thought of as \"a tentacle-porn girl,\" but she knew her story, \"Spar,\" worked as a story so she sent it off.  Last month, \"Spar\" was nominated as a finalist for the 2009 Nebula Awards in the short story category.  \"This is a story I love,\" Johnson says below, \"without liking it at all.\"  \"Spar\" is disturbing. There's weird sex. And tentacles. And there's relentless beauty — of craftsmanship, of the imagination — and... something other than beauty, too.  Johnson is an award-winning writer of novels and short fiction — she has taken the Theodore Sturgeon Memorial Award, the Crawford Award, and the World Fantasy Award. Her novels include Fudoki and The Fox Woman, both from Tor Books. She's also an essayist, an accomplished poet, and a highly respected teacher.  Since the late 1980s, Johnson has worked throughout the industry, at places like Dark Horse Comics, Wizards of the Coast, and Tor Books.  But at heart she's a storyteller.  Johnson can pull you into a story so fast you want to scream — for the joy of it, the mastery, the thrill, the excitement of being in the hands of a great writer: \"Aimee's big trick is that she makes 26 monkeys vanish onstage.\" Or, you might scream for other, more visceral reasons: \"In the tiny lifeboat, she and the alien fuck endlessly, relentlessly.\"  Kij Johnson, says Jeff VanderMeer, is \"a wonderful writer who takes big chances and has a gigantic imagination.\" \"Spar,\" according to VanderMeer is \"crazy-ass brilliant work.\"  Johnson's risk-taking pays off.Readers reap the rewards. Below, Johnson and I talk about \"Spar,\" writing, and sex with aliens.   \"Spar\" has garnered a good bit of attention. Readers have been both repelled and compelled at the first paragraph, the language, the subject matter. How'd you happen to write it?  It's really different from most of my other stuff, isn't it? Or not, actually.  Stories for me are always a slough of apparently unrelated ideas, often gathered over years. \"Spar\" is like that.  Years and years ago I wrote a draft of a first-contact story, but stalled out when I started to think through the challenges of communication with any sort of alien intelligence. Dogs are an alien intelligence with which we share (some) biology and similar group dynamics. They do something we ask, \"sit,\" for instance, but their motives for sitting are not necessarily the motives we like to ascribe to them. If it's hard to understand what forms a dog's understanding, how much harder to understand a truly alien intelligence?  So I put that on the back burner.  Next piece: Over the past few years, I've been writing a bunch of meditative stories — \"At the Mouth of the River of Bees,\" \"The Evolution of Trickster Stories among the Dogs of North Park after the Change,\" \"The Cat who Walked a Thousand Miles\" — even \"26 Monkeys, also the Abyss\" is at heart a contemplative story. I wondered if I was falling into the rut of careful craft. I was afraid that my writing was getting a little too glossy.  When I use glossy referring to writing, I usually mean smooth prose — craft — sometimes at the expense of the underlying truth that makes something art.  I wanted to write something aggressively non-glossy. I joked that it could be about a human and an alien in a lifeboat who fucked all the time because they were bored. But that wasn't much of a plot, when you got right down to it, so it remained a joke. Onto the back burner.  Last piece: summer of 2009 I was thinking about the ways relationships come apart. It's always about lack of communication, isn't it? And then everything fell together: a story about what can happen as the people we love turn into non-communicative aliens with whom we share a bed. And a story about sex with an alien because it's that or die of boredom. All the other things — the weird Stockholm Syndrome dynamic; the fear of leaving a familiar situation, however horrific; the cruelty that comes from familiarity — evolved in the rewrite. It's interesting to me how what I saw as the primary and very obvious theme of the story is the one people notice least.  The first sentence came first, and then the rest in a five-day rush, including rewriting as I went. I spent a lot of time crafting the story to make it appear un-crafted and non-glossy. The irony does not escape me.  Despite the completely disparate content, \"Spar\" has a lot of stylistic similarities with other stories of mine. In \"26 Monkeys,\" I was exploring how far I can break up scene structure and still have a story. I have also been stripping out some of the lush prose that I tried in stories like \"River of Bees,\" — \"26 Monkeys\" was also part of this — to see what my writing looks like in a simpler mode. \"Spar\" is a direct result of this thinking.  In \"26 Monkeys\", what did breaking up the scene structure reveal to you about the nature of scenes? Did doing this inform \"Spar\" or other subsequent stores?  Most of the scenes in \"26 Monkeys\" are not scenes at all, if one considers a scene a small story arc where a question is posited or an action attempted with a result that changes the larger story in some fashion. Most of the pieces don't even pretend they are conventional storytelling, as vignettes often do. But they each contain part of what is in a conventional scene, however unorthodox the presentation. Descriptions, characterization setting, thematic statement, statement of conflict, clear problems and their resolution — they're all there, and if you put them together, you get a unified story arc.  \"Spar\" breaks it down farther still; there's almost no storyline, and things that are events are stripped to the bone, leaving in at least one case a single sentence. To tell this story more conventionally would make it either erotic or porn, depending on my intention. I mean it to be neither.  I love seeing what happens to a story when you take out the standard elements, but for this to work, the underlying emotions have to become commensurately stronger. Spar's style would just be artifice if the story were just about the narrator's inability to communicate with her husband.  What were the most difficult decisions you had to make in writing \"Spar\"?  The hardest was sending it out at all. It's deeply unpleasant as a story, offensive on many levels. I knew it worked as a story, but I wasn't sure how it would be read and I wasn't thrilled to be thought of as a tentacle-porn girl. There are a couple of sections that I hated, but they were effective and in they stayed. This is a story I love without liking it at all.  In some ways I'm the lucky one, because having written it I can walk away. Readers are stuck with it in their minds. Makes me wonder, what is a short story's job?  I can't say. I know that for my writing, I hope I change the reader in some way — make her see something or experience something she would not otherwise, and may not want to. What I write may or may not be entertaining, but my goal going in is usually not entertainment — it's exploring themes and people and styles I am curious about. I'm always happy when people like reading it and get what I'm doing. Most of my fiction does what I want it to because (except in a couple of cases) I don't send it out before it does so. Is it challenging working with editors when you are pushing so many limits?  Not really. They either buy it or they don't. I think it's more challenging for the editors sometimes. I know that Neil Clarke asked for input from at least one person outside the magazine before he made the decision.  You've been on both sides of the desk, what is the ideal writer/editor relationship? When does it work best? Work the worst?  Well, that's hard for me to say, since my editors have made minimal revisions. What I need most (which is a very, very careful copy edit for things like repetitive words) may not be what others need. I do think that steady contact is important. It's really easy for writers (and by \"writers,\" I mean \"me\") to disconnect from things like deadlines.   I will clarify that most of my editorial work was actually production work — managing editor as the person who puts all the materials together, not as a creative input — so from that side of things, what mattered to me most was that the authors get their stuff in on time. What does writing poetry allow you to do that writing prose does not? How is your process different when writing poetry? Do you feel more or less comfortable in either genre?  I am really just starting to think again about poetry after some years away, so I don't have a good answer for you. Poetry is a terrifying mix of artistic rigor and honesty, but then, that's what I have been striving toward in my fiction, so maybe it won't be so bad.  You've worked at such a wide variety of places in publishing — WotC, Tor, Black Horse. How is the speculative fiction world different now than it was when you made you first sale in the late 1980s? Which changes are for the better?  The world is a lot more open to it now, though they don't like the name yet, do they? There are many talented or brilliant writers working in the interstices of the literary and speculative genres, and this has improved both genres. There's room now for Michael Chabon to write alternate history and detective stories, and for me to write stories that are primarily about relationships.   There's a huge range of fantasy and SF that evolved within the gaming and the fanfic worlds, and that has opened up new writers, readers and viewers. I love this, though I suppose other people are seeing it as the death of quality speculative fiction — but there's no reason a dark space adventure involving a lot of killing should be held to a lower standard than Kelly Link. Any thoughts on \"Spar\" being a Nebula finalist?  I am thrilled. It's a difficult story to read, and it's hard to see past the graphic aspects to what the story is really about, which is how communication fails in relationships.  What's next?  Oh, who knows? I owe a short story and a novel. And I am starting grad school this fall, I hope, to complete a degree. We'll see.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nA Terrifying Mix of Honesty and Rigor: A Conversation with Kij Johnson\nKij Johnson didn't really want to be thought of as \"a tentacle-porn girl,\" but she knew her story, \"Spar,\" worked as a story so she sent it off.\nLast month, \"Spar\" was nominated as a finalist for the 2009 Nebula Awards in the short story category.\n\"This is a story I love,\" Johnson says below, \"without liking it at all.\"\n\"Spar\" is disturbing. There's weird sex. And tentacles. And there's relentless beauty — of craftsmanship, of the imagination — and... something other than beauty, too.\nJohnson is an award-winning writer of novels and short fiction — she has taken the Theodore Sturgeon Memorial Award, the Crawford Award, and the World Fantasy Award. Her novels include Fudoki and The Fox Woman, both from Tor Books. She's also an essayist, an accomplished poet, and a highly respected teacher.\nSince the late 1980s, Johnson has worked throughout the industry, at places like Dark Horse Comics, Wizards of the Coast, and Tor Books.\nBut at heart she's a storyteller.\nJohnson can pull you into a story so fast you want to scream — for the joy of it, the mastery, the thrill, the excitement of being in the hands of a great writer: \"Aimee's big trick is that she makes 26 monkeys vanish onstage.\" Or, you might scream for other, more visceral reasons: \"In the tiny lifeboat, she and the alien fuck endlessly, relentlessly.\"\nKij Johnson, says Jeff VanderMeer, is \"a wonderful writer who takes big chances and has a gigantic imagination.\" \"Spar,\" according to VanderMeer is \"crazy-ass brilliant work.\"\nJohnson's risk-taking pays off.Readers reap the rewards. Below, Johnson and I talk about \"Spar,\" writing, and sex with aliens.\n\"Spar\" has garnered a good bit of attention. Readers have been both repelled and compelled at the first paragraph, the language, the subject matter. How'd you happen to write it?\nIt's really different from most of my other stuff, isn't it? Or not, actually.\nStories for me are always a slough of apparently unrelated ideas, often gathered over years. \"Spar\" is like that.\nYears and years ago I wrote a draft of a first-contact story, but stalled out when I started to think through the challenges of communication with any sort of alien intelligence. Dogs are an alien intelligence with which we share (some) biology and similar group dynamics. They do something we ask, \"sit,\" for instance, but their motives for sitting are not necessarily the motives we like to ascribe to them. If it's hard to understand what forms a dog's understanding, how much harder to understand a truly alien intelligence?\nSo I put that on the back burner.\nNext piece: Over the past few years, I've been writing a bunch of meditative stories — \"At the Mouth of the River of Bees,\" \"The Evolution of Trickster Stories among the Dogs of North Park after the Change,\" \"The Cat who Walked a Thousand Miles\" — even \"26 Monkeys, also the Abyss\" is at heart a contemplative story. I wondered if I was falling into the rut of careful craft. I was afraid that my writing was getting a little too glossy.\nWhen I use glossy referring to writing, I usually mean smooth prose — craft — sometimes at the expense of the underlying truth that makes something art.\nI wanted to write something aggressively non-glossy. I joked that it could be about a human and an alien in a lifeboat who fucked all the time because they were bored. But that wasn't much of a plot, when you got right down to it, so it remained a joke. Onto the back burner.\nLast piece: summer of 2009 I was thinking about the ways relationships come apart. It's always about lack of communication, isn't it? And then everything fell together: a story about what can happen as the people we love turn into non-communicative aliens with whom we share a bed. And a story about sex with an alien because it's that or die of boredom. All the other things — the weird Stockholm Syndrome dynamic; the fear of leaving a familiar situation, however horrific; the cruelty that comes from familiarity — evolved in the rewrite. It's interesting to me how what I saw as the primary and very obvious theme of the story is the one people notice least.\nThe first sentence came first, and then the rest in a five-day rush, including rewriting as I went. I spent a lot of time crafting the story to make it appear un-crafted and non-glossy. The irony does not escape me.\nDespite the completely disparate content, \"Spar\" has a lot of stylistic similarities with other stories of mine. In \"26 Monkeys,\" I was exploring how far I can break up scene structure and still have a story. I have also been stripping out some of the lush prose that I tried in stories like \"River of Bees,\" — \"26 Monkeys\" was also part of this — to see what my writing looks like in a simpler mode. \"Spar\" is a direct result of this thinking.\nIn \"26 Monkeys\", what did breaking up the scene structure reveal to you about the nature of scenes? Did doing this inform \"Spar\" or other subsequent stores?\nMost of the scenes in \"26 Monkeys\" are not scenes at all, if one considers a scene a small story arc where a question is posited or an action attempted with a result that changes the larger story in some fashion. Most of the pieces don't even pretend they are conventional storytelling, as vignettes often do. But they each contain part of what is in a conventional scene, however unorthodox the presentation. Descriptions, characterization setting, thematic statement, statement of conflict, clear problems and their resolution — they're all there, and if you put them together, you get a unified story arc.\n\"Spar\" breaks it down farther still; there's almost no storyline, and things that are events are stripped to the bone, leaving in at least one case a single sentence. To tell this story more conventionally would make it either erotic or porn, depending on my intention. I mean it to be neither.\nI love seeing what happens to a story when you take out the standard elements, but for this to work, the underlying emotions have to become commensurately stronger. Spar's style would just be artifice if the story were just about the narrator's inability to communicate with her husband.\nWhat were the most difficult decisions you had to make in writing \"Spar\"?\nThe hardest was sending it out at all. It's deeply unpleasant as a story, offensive on many levels. I knew it worked as a story, but I wasn't sure how it would be read and I wasn't thrilled to be thought of as a tentacle-porn girl. There are a couple of sections that I hated, but they were effective and in they stayed. This is a story I love without liking it at all.\nIn some ways I'm the lucky one, because having written it I can walk away. Readers are stuck with it in their minds.\nMakes me wonder, what is a short story's job?\nI can't say. I know that for my writing, I hope I change the reader in some way — make her see something or experience something she would not otherwise, and may not want to. What I write may or may not be entertaining, but my goal going in is usually not entertainment — it's exploring themes and people and styles I am curious about. I'm always happy when people like reading it and get what I'm doing. Most of my fiction does what I want it to because (except in a couple of cases) I don't send it out before it\ndoes so.\nIs it challenging working with editors when you are pushing so many limits?\nNot really. They either buy it or they don't. I think it's more challenging for the editors sometimes. I know that Neil Clarke asked for input from at least one person outside the magazine before he made the decision.\nYou've been on both sides of the desk, what is the ideal writer/editor relationship? When does it work best? Work the worst?\nWell, that's hard for me to say, since my editors have made minimal revisions. What I need most (which is a very, very careful copy edit for things like repetitive words) may not be what others need. I do think that steady contact is important. It's really easy for writers (and by \"writers,\" I mean \"me\") to disconnect from things like deadlines.\nI will clarify that most of my editorial work was actually production work — managing editor as the person who puts all the materials together, not as a creative input — so from that side of things, what mattered to me most was that the authors get their stuff in on time.\nWhat does writing poetry allow you to do that writing prose does not? How is your process different when writing poetry? Do you feel more or less comfortable in either genre?\nI am really just starting to think again about poetry after some years away, so I don't have a good answer for you. Poetry is a terrifying mix of artistic rigor and honesty, but then, that's what I have been striving toward in my fiction, so maybe it won't be so bad.\nYou've worked at such a wide variety of places in publishing — WotC, Tor, Black Horse. How is the speculative fiction world different now than it was when you made you first sale in the late 1980s? Which changes are for the better?\nThe world is a lot more open to it now, though they don't like the name yet, do they? There are many talented or brilliant writers working in the interstices of the literary and speculative genres, and this has improved both genres. There's room now for Michael Chabon to write alternate history and detective stories, and for me to write stories that are primarily about relationships.\nThere's a huge range of fantasy and SF that evolved within the gaming and the fanfic worlds, and that has opened up new writers, readers and viewers. I love this, though I suppose other people are seeing it as the death of quality speculative fiction — but there's no reason a dark space adventure involving a lot of killing should be held to a lower standard than Kelly Link.\nAny thoughts on \"Spar\" being a Nebula finalist?\nI am thrilled. It's a difficult story to read, and it's hard to see past the graphic aspects to what the story is really about, which is how communication fails in relationships.\nWhat's next?\nOh, who knows? I owe a short story and a novel. And I am starting grad school this fall, I hope, to complete a degree. We'll see.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/johnson_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Terrifying Mix of Honesty and Rigor: A Conversation with Kij Johnson by Jeremy L. C. Jones"}