{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "E N Díaz", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "EFZDCm1dMjxRVUexuIizYQAFkt0=", "id": null, "license": null, "comments": "", "raw_text": "3530 words, short story  Just One Step, and Then the Next  Doña Chuy was sitting in her living room, the heavy smell of the summer rains wafting in through the open door. She hated that smell, but the house was too warm, and her air conditioner no longer worked, so she had to leave windows and doors open to keep it cool. She didn’t worry about anyone coming in, not anymore. She wasn’t fearless, just tired. She didn’t have anything else to lose, so anyone was welcome to the crumbs.  Doña Chuy placed her needle and cloth napkin next to her on the cream-colored sofa. The room was illuminated by a single lamp right next to her, casting the rectangular room half in warm yellow light and the other half in long, flickering shadows. No, the shadows didn’t flicker; her pounding head made everything look as if she were underwater.  Usually, she could embroider for hours, her long nimble fingers moved like a spider’s legs on her spinning web. Now, though, she got tired just walking to the living room, her hands perpetually shaking. Plus, it wasn’t easy to do the job with just one eye.  Absentmindedly, she brushed her fingertips over the edge of the medical tape. The hit had burst her eye like an overripe guava fruit slamming against concrete. She didn’t remember much of what happened afterward, having blacked out almost instantly. At near seventy, Doña Chuy didn’t know if her bad memory was the result of old age or State violence.  She had been helped home from the medical unit by some of her few remaining neighbors, mostly elderly people like herself. One of them waited on a chair next to her bed, embroidering a cloth napkin with steady hands. A lot of people had left the city, or tried to, at least. They headed to the border, which was only a couple of hours drive north.  Later, we’d discover that our people were being detained by US authorities and simply handed back to our military. Some civilians on the other side even made a sport out of hunting refugees, like animals. How many can you catch in a week, a month. Bonus if you caught a complete family. Better if there’s only children.  Doña Chuy didn’t understand a lot about politics. She had no formal education and felt rather dizzied by the way in which the world just rushed forward without caring about the backlash. All she knew is what she saw and what she could grasp from what her family told her. Two of her children had gone to university, and some of her grandchildren even went to study in the capital, Antigua. They are smart, smart people.  When all the commotion started on Independence Day, the younger ones immediately wanted to flee. The president had been shot while he gave el grito in an homage to the Catholic priest who supposedly started the whole independence movement. He had collapsed on the balcony of the national palace, his wife and guards rushing to him before the broadcast cut to black. Doña Chuy had watched on the State-gifted screen, transfixed by that impossible and incongruous moment.  She had lived a long life, and she was no stranger to acts of senseless violence. But this, this was different. She couldn’t make sense of it, the moment eluding her comprehension as if she were trying to trap air between her hands.  All through her neighborhood, there was silence. Then, as if coming from very far away, voices began raising. At last, the shouting and commotion broke out. People came out of their houses and rushed to their neighbors’ doors, some of their faces sporting red smudges of paint, Ixtec’s flag now erased.  Nobody knew what to do, how to act. Doña Chuy felt her wrist phone vibrating madly, all her children trying to reach her at the same time. Estación Samoa was still a relatively small city in northern Ixtec. It was the third largest in the whole state, but that didn’t mean much if you compared it to other cities in the country. Northern states had a reputation of being very large, but not a lot of people lived there. Not everyone was a fan of the extreme weather. Most of her children had moved to the central states, near the capital.  After the assassination, the next few days vibrated with a sort of unhinged energy. Politicians argued and posted frantically on their social media, engaging with the general public in an attempt to throw blame at each other. Several mourned the president and several more said he had it coming. Peasants die the same way, was the general opinion of the largest conservative party, Partido Esperanza de México. They despised the president due to fact that he came from one of the poor coastal cities of Ixtec, and his accent seemed to reflect his modest upbringing at that.  Doña Chuy remembered them from a few months back, when members of PEM protested his presidency by setting up tents outside of the National Palace, and then went away and ordered their staff to keep their place. Now they were calling for change, for true change. They were saying that leaving the vice-president in charge was unfair and unconstitutional, even though it was quite the opposite. It wasn’t surprising watching vultures picking at a corpse, but it was surprising watching so many people clap for them.  Doña Chuy woke up one day feeling tired from all the shit going around, so she decided to enjoy an audiobook instead of obsessing over politics online and on the phone with her children.  She was a huge fan of audiobooks, listening to them on her wrist phone. Reading physical books had always tired her, making her fall asleep after just a few paragraphs. But she had loved them ever since she was a child. She loved stories, yes, in every shape and form, but there was something particularly magical to her about the weight of a book in her hands. A world waiting and whispering, its weight a promise of things to come.  But Doña Chuy had never had any money to buy them. The books she had were the ones someone else threw away, and they weren’t many. So, the habit of reading, of dreaming on paper, never really took hold.  It was her son Ramón who showed her the wonderful world of audiobooks. They reminded her of those times when her grandmother would listen to novelas on the radio while she cooked. She thought she could use some of that, that feeling of being back in her village, in her grandmother’s tiny, printed house, sneaking around to sip mamá Pancha’s coffee.  Doña Chuy tried playing an audiobook, but something was wrong. It marked error every time she tried to open it. She tried calling her son Ramón to ask for help, but a pop-up screen said loud and clear: please enter the permit code to proceed with the call.  Doña Chuy frowned and tried again, sure that her bill was covered. She had just paid it. Please enter the permit code to proceed with the call.  She tried the screen next, but every channel was blank. She went outside to her neighbors.  “You need a permit code, now,” her neighbor la Cuata told her. She was trying to comfort her screaming toddler, bouncing it against her hip, itsfat little face covered in snot and tears. The circles under la Cuata’s eyes looked purple, more like bruises, against her pale brown flesh. “It will be sent to you when they’ve looked through all your history, and you are deemed compliant.”  “Compliant?” Doña Chuy asked, beginning to worry. Some of the audiobooks she listened to were very violent indeed. La Cuata shook her head when she told her about her worries. Usually, she would have laughed and mocked the old woman and her inability to understand technology. This time, she looked barely there, her mind fixed somewhere far away.  “It means you don’t have conversations or materials that go against them,” she said, swatting mosquitoes half-heartedly.  Doña Chuy nodded and went back to her house, wanting to ask who they were,but she thought it best to leave la Cuata alone, let her come back from that faraway place in her eyes. That was the last time Doña Chuy ever saw her. She still dreamed of her little girl, with her fat, snot-covered face. They took the whole family.  That same day, her permit code appeared on her wrist phone. She immediately called her son, Ramón, who lived the closest to her, just a couple hours away in the State capital.  “I’m coming to get you,” he had said, as soon as she’d picked up. He sounded winded, things clashing in the background. “Didn’t you watch the official statement, vieja? It’s the military, they’ve organized a temporary military junta until elections can be called. Said the country is a mess and too biased, said we needed impartial eyes. Bullshit, utter fucking bullshit. I’m coming to get you. I might take longer since they are running checkpoints now. I’ll be there by tonight. Wait for me,” he said, and she felt a cold fear spread through her. She might not know a lot about politics, but the military involved in anything had her blood running cold.  Doña Chuy hung up and went straight to packing, trying to be as efficient as she could, but allowing sentimentality to lead her some. She didn’t know how long until she’d be back, so she wanted to know she would be set. She took yarn and needle, her bible and glasses, and some comfortable clothes. She really didn’t know what to expect.  She got her bag and her yarn, planning to finish a cloth napkin she’d been working on as she waited, and sat in her living room. The hours ticked away, the audiobooks she still had access to played, one after the other—they were short or already half finished. She was done with the bowl fruit pattern on the cloth napkin and was wondering if she should start another one. Her son should be almost home.  She looked out her window, the gauzy curtains drawn, and saw through the white metal bars it was already pitch-black outside. The city lights hadn’t been turned on. She dialed her son’s number and dialed it and dialed it. At last, it didn’t even go through.  By dawn, she had alerted every single member of the family. Pero cómo se le ocurre, he is probably just stuck at one of the retenes, there is nothing to worry about, qué irresponsable. Listening to her children distracted her some, but she felt the ground slipping from under her. She sat alone in her living room and did the only thing she could: she hoped.  She hoped her son would show up, running to the window every time she heard a car and feeling a knife to her gut when they passed her house. Later, when she felt particularly tired or had just woken up from a night of restless sleep, she would still rush to the window, her imagination playing cruel tricks on her. She wished she could live inside those moments, those brief and joyous moments of delusion, lunacy. But then the seconds would turn, and she would be struck coldly out of that delusion by reality.  Her son never came home.  Now, looking down at her cloth napkin with her one good eye, she couldn’t help but think of him. He had been the youngest and most rebellious, and sometimes the most distant. He hadn’t cared much about respect just for the sake of respect, so he had challenged her every time he felt it was just. She had tried to teach him silence when it was for his own good, but she ended up just making him angry, resentful. He wanted to speak out more.  Doña Chuy wondered, time without number, if it was all her fault. She could imagine Ramón saying exactly the wrong thing at exactly the wrong moment and then . . . She chastised herself, telling herself that she should have been stricter, tried harder to teach him to be quiet and obey, and then . . . I would have killed him sooner. That thought jolted her and then froze her, making her wish she could escape her body and mind for a second, just one second.  In the days following Ramón’s disappearance, things in the city became worse. People started going missing, pulled out of their homes, jobs, taken right in the middle of the street in plain daylight. If anybody tried to look for their missing ones—as Doña Chuy did several times—they were told there was no record of anyone being taken. Military men and women could now be found everywhere, giving this information in their clipped, icy tones.  Doña Chuy’s other children wanted to come and get her, but she refused them without discussion. Even if they didn’t say it, they were planning to attempt leaving Ixtec, and she wasn’t going anywhere without Ramón.  At some point, time ceased having any meaning for her, and Doña Chuy simply crashed. The momentum that had been carrying her forward let up. All the blatantly false noes and the cruel abuse and threats hurled at her by the military when she insisted didn’t make her feel scared, it made her feel hopeless. Again and again, things were being taken from them, because the people at the top could, and now they didn’t even pretend they wouldn’t. She felt bone-tired.  For days, she didn’t even look out the window when she heard their vans approaching. They mostly came during the night, dressed as civilians, stealing away another struggling, bloodied body. She couldn’t get out of bed. She was stuck inside this thick fog of confusion, denial, and fear, so much fear, that made simple movements a challenge. She couldn’t move without feeling her whole body cramping up, her belly tingling as if she might throw up, her forehead being stabbed by icy blades. She barely ate, didn’t see the point in washing.  Doña Chuy felt the whole world closing in and, soon, it was going to choke her. She had to do something, do something or perish under that colossal weight.  It wasn’t bravery, not really. It was just one step, and then the next.  She printed the photos at home and took a basket full of her embroidered cloth napkins. The market near her home looked empty, the smell of cooking oil and spices wafting heavy in the warm summer breeze. The park at the center of the square, where traveling merchants usually placed their carts and tables, sported not even half the people that would usually be there. The shops and restaurants on the first floor of the brightly colored houses were also sparsely filled. It was a beautiful, clear summer day.  Doña Chuy walked down to the park, already a fine film of sweat coating her wrinkled face. She picked a spot under a tree near the center and waited. It was still early morning, so she was not expecting a lot of people to show up until later.  Slowly, like a rising tide, people began showing up. She sold them the embroidered cloth napkins and gave them a photo of her son, asking them if they had seen him and if by any chance they did, her address would be on the back. More and more people began to show up. That day, she left with her basket completely empty.  She visited other markets, other little plazas and parks. She couldn’t go too far because she wouldn’t make it home before curfew. And she didn’t go to the big central plazas or markets, fearing she’d be caught sooner. Everywhere she went, she began receiving photos from strangers that told her, begged her, if she could help them share the photo of their son, daughter, mother, father, aunt, uncle, friend, lover. Everyone was disappearing. Everyone was being taken. She accepted every single photograph.  Wrist phones and the Internet were no longer reliable, so using social media was out of the question. She didn’t realize people, young brave people, were filming her. They had found a way, as the young always do, to be able to upload material and share it internationally, trying to let the world hear what was going on. And maybe, just maybe, the world would care this time.  It was nearly impossible for locals to get into any social media without consequences, but some still managed. Better technology could mean more freedom, or sometimes a better-equipped prison.  They were there filming her when it happened. By that point people knew of the old woman with her basket selling her embroidered cloth napkins. Several other such ladies also were beginning to pop around the whole city. She was in one of her usual venues, a small park of squalid trees, when they approached her.  The sun was blazing in the sky. The strong breeze blowing was just a cruel blast of heat in the face on that suffocating day. They were dressed in uniforms this time. Two women. Their uniforms were navy blue and sharp, newly issued along with their slick equipment. The weapons and all their equipment came from our neighbors up north, but that everybody knew, even before.  People remained around Doña Chuy, because they knew it would be worse if they tried to run. You couldn’t outrun them, you couldn’t escape them, they owned everything. The only thing you could do was face them, for the last thing that they owned was your body, your fear for your body. One must never allow them that.  The two women took Doña Chuy’s basket and emptied the contents on the floor, black and white photos spilling out on the grass. Several embroidered cloth napkins weighted the papers down, preventing them from blowing away. Proof, there on the floor was proof.  The women screamed at Doña Chuy, yelling something about a permit while they kicked the photos and the napkins around. Not a single photo was blown away by the wind.  Doña Chuy did not feel fearless, as a lot of people would call her afterward. People thought moments like that made you fearless because they wished for such a thing to be possible, attainable. They wished to believe that at some point, one lets go of fear and overcomes it, surpasses it. That was not true for Doña Chuy. She was completely and profoundly afraid, standing right at the center of her fear, not a single step beyond it. But she was also standing right at the center of her rage.  Doña Chuy stood her ground while one of the two women yelled again right in her face about some bullshit permit, spit hitting her face.  “I do not need a permit to look for my son.”  She spoke the words in her usual even tone, something barely above a whisper. But the graveyard silence around her carried the words loud and clear across the whole park. For a few seconds, nothing happened. The two women were used to fear, to people cowering back, or to violence, people rushing forward and attacking. They were not used to this calm statement of truth, unshaken, loud and clear. They recovered fast, though.  Doña Chuy heard the wind whistling and suddenly there was burst of searing white light that seemed to precede the butt of the gun slamming against her face. Everything went dark. She didn’t know what happened afterward, just faintly remembered someone, several someones, screaming.  She woke up inside a gray room illuminated with artificial white light, her head pounding viciously from the inside, and something thick slushing through her veins.  Doña Chuy was alone in that small gray room, the smell of alcohol and blood strong in her nostrils. She was alone in that small gray room, alone. And for the first time in a while, Doña Chuy allowed herself to cry, very quietly.  A soft rain had begun to fall, the wind blowing it inside Doña Chuy’s house. She needed to get up and close the damn door, swipe the floor. She couldn’t add a fall to her current state. This time, she wasn’t sure she would make it. Plus, lying in bed immobilized when there were so many things to do—she couldn’t afford that.  Now, she knew of the other women walking the streets, sharing photos, and selling embroidered cloth napkins. They were like her, looking for someone loved, someone lost, stolen. Violence could always steal the physical, do away with everything that was, but memory remained. And memory, no matter how much time passed, was always a promise.  Doña Chuy got up and closed the door, listening to the rain knocking on the metal door like tiny pebbles, asking to be let in. She sat back down and picked up her needle and cloth napkin. She was embroidering poppies, the red an easy color to see with her one good eye. There were others right now helping, organizing. She needed to do her part, too. E. N. Díaz is a Mexican non-binary author of speculative fiction. Their short story “Mamá Chayo’s Magic Lesson” can be found in The Magazine of Fantasy & Science Fiction. Their work focuses on people not often center spot in this type of fiction. They are often inspired by the members of their family and the stories told by them of fantastic occurrences in everyday life. It is just a family fact that one of their great-aunts used to box with a bear in a family circus. They write in both English and Spanish.", "text": "3530 words, short story\nJust One Step, and Then the Next\nDoña Chuy was sitting in her living room, the heavy smell of the summer rains wafting in through the open door. She hated that smell, but the house was too warm, and her air conditioner no longer worked, so she had to leave windows and doors open to keep it cool. She didn’t worry about anyone coming in, not anymore. She wasn’t fearless, just tired. She didn’t have anything else to lose, so anyone was welcome to the crumbs.\nDoña Chuy placed her needle and cloth napkin next to her on the cream-colored sofa. The room was illuminated by a single lamp right next to her, casting the rectangular room half in warm yellow light and the other half in long, flickering shadows. No, the shadows didn’t flicker; her pounding head made everything look as if she were underwater.\nUsually, she could embroider for hours, her long nimble fingers moved like a spider’s legs on her spinning web. Now, though, she got tired just walking to the living room, her hands perpetually shaking. Plus, it wasn’t easy to do the job with just one eye.\nAbsentmindedly, she brushed her fingertips over the edge of the medical tape. The hit had burst her eye like an overripe guava fruit slamming against concrete. She didn’t remember much of what happened afterward, having blacked out almost instantly. At near seventy, Doña Chuy didn’t know if her bad memory was the result of old age or State violence.\nShe had been helped home from the medical unit by some of her few remaining neighbors, mostly elderly people like herself. One of them waited on a chair next to her bed, embroidering a cloth napkin with steady hands. A lot of people had left the city, or tried to, at least. They headed to the border, which was only a couple of hours drive north.\nLater, we’d discover that our people were being detained by US authorities and simply handed back to our military. Some civilians on the other side even made a sport out of hunting refugees, like animals. How many can you catch in a week, a month. Bonus if you caught a complete family. Better if there’s only children.\nDoña Chuy didn’t understand a lot about politics. She had no formal education and felt rather dizzied by the way in which the world just rushed forward without caring about the backlash. All she knew is what she saw and what she could grasp from what her family told her. Two of her children had gone to university, and some of her grandchildren even went to study in the capital, Antigua. They are smart, smart people.\nWhen all the commotion started on Independence Day, the younger ones immediately wanted to flee. The president had been shot while he gave el grito in an homage to the Catholic priest who supposedly started the whole independence movement. He had collapsed on the balcony of the national palace, his wife and guards rushing to him before the broadcast cut to black. Doña Chuy had watched on the State-gifted screen, transfixed by that impossible and incongruous moment.\nShe had lived a long life, and she was no stranger to acts of senseless violence. But this, this was different. She couldn’t make sense of it, the moment eluding her comprehension as if she were trying to trap air between her hands.\nAll through her neighborhood, there was silence. Then, as if coming from very far away, voices began raising. At last, the shouting and commotion broke out. People came out of their houses and rushed to their neighbors’ doors, some of their faces sporting red smudges of paint, Ixtec’s flag now erased.\nNobody knew what to do, how to act. Doña Chuy felt her wrist phone vibrating madly, all her children trying to reach her at the same time. Estación Samoa was still a relatively small city in northern Ixtec. It was the third largest in the whole state, but that didn’t mean much if you compared it to other cities in the country. Northern states had a reputation of being very large, but not a lot of people lived there. Not everyone was a fan of the extreme weather. Most of her children had moved to the central states, near the capital.\nAfter the assassination, the next few days vibrated with a sort of unhinged energy. Politicians argued and posted frantically on their social media, engaging with the general public in an attempt to throw blame at each other. Several mourned the president and several more said he had it coming. Peasants die the same way, was the general opinion of the largest conservative party, Partido Esperanza de México. They despised the president due to fact that he came from one of the poor coastal cities of Ixtec, and his accent seemed to reflect his modest upbringing at that.\nDoña Chuy remembered them from a few months back, when members of PEM protested his presidency by setting up tents outside of the National Palace, and then went away and ordered their staff to keep their place. Now they were calling for change, for true change. They were saying that leaving the vice-president in charge was unfair and unconstitutional, even though it was quite the opposite. It wasn’t surprising watching vultures picking at a corpse, but it was surprising watching so many people clap for them.\nDoña Chuy woke up one day feeling tired from all the shit going around, so she decided to enjoy an audiobook instead of obsessing over politics online and on the phone with her children.\nShe was a huge fan of audiobooks, listening to them on her wrist phone. Reading physical books had always tired her, making her fall asleep after just a few paragraphs. But she had loved them ever since she was a child. She loved stories, yes, in every shape and form, but there was something particularly magical to her about the weight of a book in her hands. A world waiting and whispering, its weight a promise of things to come.\nBut Doña Chuy had never had any money to buy them. The books she had were the ones someone else threw away, and they weren’t many. So, the habit of reading, of dreaming on paper, never really took hold.\nIt was her son Ramón who showed her the wonderful world of audiobooks. They reminded her of those times when her grandmother would listen to novelas on the radio while she cooked. She thought she could use some of that, that feeling of being back in her village, in her grandmother’s tiny, printed house, sneaking around to sip mamá Pancha’s coffee.\nDoña Chuy tried playing an audiobook, but something was wrong. It marked error every time she tried to open it. She tried calling her son Ramón to ask for help, but a pop-up screen said loud and clear: please enter the permit code to proceed with the call.\nDoña Chuy frowned and tried again, sure that her bill was covered. She had just paid it. Please enter the permit code to proceed with the call.\nShe tried the screen next, but every channel was blank. She went outside to her neighbors.\n“You need a permit code, now,” her neighbor la Cuata told her. She was trying to comfort her screaming toddler, bouncing it against her hip, itsfat little face covered in snot and tears. The circles under la Cuata’s eyes looked purple, more like bruises, against her pale brown flesh. “It will be sent to you when they’ve looked through all your history, and you are deemed compliant.”\n“Compliant?” Doña Chuy asked, beginning to worry. Some of the audiobooks she listened to were very violent indeed. La Cuata shook her head when she told her about her worries. Usually, she would have laughed and mocked the old woman and her inability to understand technology. This time, she looked barely there, her mind fixed somewhere far away.\n“It means you don’t have conversations or materials that go against them,” she said, swatting mosquitoes half-heartedly.\nDoña Chuy nodded and went back to her house, wanting to ask who they were,but she thought it best to leave la Cuata alone, let her come back from that faraway place in her eyes. That was the last time Doña Chuy ever saw her. She still dreamed of her little girl, with her fat, snot-covered face. They took the whole family.\nThat same day, her permit code appeared on her wrist phone. She immediately called her son, Ramón, who lived the closest to her, just a couple hours away in the State capital.\n“I’m coming to get you,” he had said, as soon as she’d picked up. He sounded winded, things clashing in the background. “Didn’t you watch the official statement, vieja? It’s the military, they’ve organized a temporary military junta until elections can be called. Said the country is a mess and too biased, said we needed impartial eyes. Bullshit, utter fucking bullshit. I’m coming to get you. I might take longer since they are running checkpoints now. I’ll be there by tonight. Wait for me,” he said, and she felt a cold fear spread through her. She might not know a lot about politics, but the military involved in anything had her blood running cold.\nDoña Chuy hung up and went straight to packing, trying to be as efficient as she could, but allowing sentimentality to lead her some. She didn’t know how long until she’d be back, so she wanted to know she would be set. She took yarn and needle, her bible and glasses, and some comfortable clothes. She really didn’t know what to expect.\nShe got her bag and her yarn, planning to finish a cloth napkin she’d been working on as she waited, and sat in her living room. The hours ticked away, the audiobooks she still had access to played, one after the other—they were short or already half finished. She was done with the bowl fruit pattern on the cloth napkin and was wondering if she should start another one. Her son should be almost home.\nShe looked out her window, the gauzy curtains drawn, and saw through the white metal bars it was already pitch-black outside. The city lights hadn’t been turned on. She dialed her son’s number and dialed it and dialed it. At last, it didn’t even go through.\nBy dawn, she had alerted every single member of the family. Pero cómo se le ocurre, he is probably just stuck at one of the retenes, there is nothing to worry about, qué irresponsable. Listening to her children distracted her some, but she felt the ground slipping from under her. She sat alone in her living room and did the only thing she could: she hoped.\nShe hoped her son would show up, running to the window every time she heard a car and feeling a knife to her gut when they passed her house. Later, when she felt particularly tired or had just woken up from a night of restless sleep, she would still rush to the window, her imagination playing cruel tricks on her. She wished she could live inside those moments, those brief and joyous moments of delusion, lunacy. But then the seconds would turn, and she would be struck coldly out of that delusion by reality.\nHer son never came home.\nNow, looking down at her cloth napkin with her one good eye, she couldn’t help but think of him. He had been the youngest and most rebellious, and sometimes the most distant. He hadn’t cared much about respect just for the sake of respect, so he had challenged her every time he felt it was just. She had tried to teach him silence when it was for his own good, but she ended up just making him angry, resentful. He wanted to speak out more.\nDoña Chuy wondered, time without number, if it was all her fault. She could imagine Ramón saying exactly the wrong thing at exactly the wrong moment and then . . . She chastised herself, telling herself that she should have been stricter, tried harder to teach him to be quiet and obey, and then . . . I would have killed him sooner. That thought jolted her and then froze her, making her wish she could escape her body and mind for a second, just one second.\nIn the days following Ramón’s disappearance, things in the city became worse. People started going missing, pulled out of their homes, jobs, taken right in the middle of the street in plain daylight. If anybody tried to look for their missing ones—as Doña Chuy did several times—they were told there was no record of anyone being taken. Military men and women could now be found everywhere, giving this information in their clipped, icy tones.\nDoña Chuy’s other children wanted to come and get her, but she refused them without discussion. Even if they didn’t say it, they were planning to attempt leaving Ixtec, and she wasn’t going anywhere without Ramón.\nAt some point, time ceased having any meaning for her, and Doña Chuy simply crashed. The momentum that had been carrying her forward let up. All the blatantly false noes and the cruel abuse and threats hurled at her by the military when she insisted didn’t make her feel scared, it made her feel hopeless. Again and again, things were being taken from them, because the people at the top could, and now they didn’t even pretend they wouldn’t. She felt bone-tired.\nFor days, she didn’t even look out the window when she heard their vans approaching. They mostly came during the night, dressed as civilians, stealing away another struggling, bloodied body. She couldn’t get out of bed. She was stuck inside this thick fog of confusion, denial, and fear, so much fear, that made simple movements a challenge. She couldn’t move without feeling her whole body cramping up, her belly tingling as if she might throw up, her forehead being stabbed by icy blades. She barely ate, didn’t see the point in washing.\nDoña Chuy felt the whole world closing in and, soon, it was going to choke her. She had to do something, do something or perish under that colossal weight.\nIt wasn’t bravery, not really. It was just one step, and then the next.\nShe printed the photos at home and took a basket full of her embroidered cloth napkins. The market near her home looked empty, the smell of cooking oil and spices wafting heavy in the warm summer breeze. The park at the center of the square, where traveling merchants usually placed their carts and tables, sported not even half the people that would usually be there. The shops and restaurants on the first floor of the brightly colored houses were also sparsely filled. It was a beautiful, clear summer day.\nDoña Chuy walked down to the park, already a fine film of sweat coating her wrinkled face. She picked a spot under a tree near the center and waited. It was still early morning, so she was not expecting a lot of people to show up until later.\nSlowly, like a rising tide, people began showing up. She sold them the embroidered cloth napkins and gave them a photo of her son, asking them if they had seen him and if by any chance they did, her address would be on the back. More and more people began to show up. That day, she left with her basket completely empty.\nShe visited other markets, other little plazas and parks. She couldn’t go too far because she wouldn’t make it home before curfew. And she didn’t go to the big central plazas or markets, fearing she’d be caught sooner. Everywhere she went, she began receiving photos from strangers that told her, begged her, if she could help them share the photo of their son, daughter, mother, father, aunt, uncle, friend, lover. Everyone was disappearing. Everyone was being taken. She accepted every single photograph.\nWrist phones and the Internet were no longer reliable, so using social media was out of the question. She didn’t realize people, young brave people, were filming her. They had found a way, as the young always do, to be able to upload material and share it internationally, trying to let the world hear what was going on. And maybe, just maybe, the world would care this time.\nIt was nearly impossible for locals to get into any social media without consequences, but some still managed. Better technology could mean more freedom, or sometimes a better-equipped prison.\nThey were there filming her when it happened. By that point people knew of the old woman with her basket selling her embroidered cloth napkins. Several other such ladies also were beginning to pop around the whole city. She was in one of her usual venues, a small park of squalid trees, when they approached her.\nThe sun was blazing in the sky. The strong breeze blowing was just a cruel blast of heat in the face on that suffocating day. They were dressed in uniforms this time. Two women. Their uniforms were navy blue and sharp, newly issued along with their slick equipment. The weapons and all their equipment came from our neighbors up north, but that everybody knew, even before.\nPeople remained around Doña Chuy, because they knew it would be worse if they tried to run. You couldn’t outrun them, you couldn’t escape them, they owned everything. The only thing you could do was face them, for the last thing that they owned was your body, your fear for your body. One must never allow them that.\nThe two women took Doña Chuy’s basket and emptied the contents on the floor, black and white photos spilling out on the grass. Several embroidered cloth napkins weighted the papers down, preventing them from blowing away. Proof, there on the floor was proof.\nThe women screamed at Doña Chuy, yelling something about a permit while they kicked the photos and the napkins around. Not a single photo was blown away by the wind.\nDoña Chuy did not feel fearless, as a lot of people would call her afterward. People thought moments like that made you fearless because they wished for such a thing to be possible, attainable. They wished to believe that at some point, one lets go of fear and overcomes it, surpasses it. That was not true for Doña Chuy. She was completely and profoundly afraid, standing right at the center of her fear, not a single step beyond it. But she was also standing right at the center of her rage.\nDoña Chuy stood her ground while one of the two women yelled again right in her face about some bullshit permit, spit hitting her face.\n“I do not need a permit to look for my son.”\nShe spoke the words in her usual even tone, something barely above a whisper. But the graveyard silence around her carried the words loud and clear across the whole park. For a few seconds, nothing happened. The two women were used to fear, to people cowering back, or to violence, people rushing forward and attacking. They were not used to this calm statement of truth, unshaken, loud and clear. They recovered fast, though.\nDoña Chuy heard the wind whistling and suddenly there was burst of searing white light that seemed to precede the butt of the gun slamming against her face. Everything went dark. She didn’t know what happened afterward, just faintly remembered someone, several someones, screaming.\nShe woke up inside a gray room illuminated with artificial white light, her head pounding viciously from the inside, and something thick slushing through her veins.\nDoña Chuy was alone in that small gray room, the smell of alcohol and blood strong in her nostrils. She was alone in that small gray room, alone. And for the first time in a while, Doña Chuy allowed herself to cry, very quietly.\nA soft rain had begun to fall, the wind blowing it inside Doña Chuy’s house. She needed to get up and close the damn door, swipe the floor. She couldn’t add a fall to her current state. This time, she wasn’t sure she would make it. Plus, lying in bed immobilized when there were so many things to do—she couldn’t afford that.\nNow, she knew of the other women walking the streets, sharing photos, and selling embroidered cloth napkins. They were like her, looking for someone loved, someone lost, stolen. Violence could always steal the physical, do away with everything that was, but memory remained. And memory, no matter how much time passed, was always a promise.\nDoña Chuy got up and closed the door, listening to the rain knocking on the metal door like tiny pebbles, asking to be let in. She sat back down and picked up her needle and cloth napkin. She was embroidering poppies, the red an easy color to see with her one good eye. There were others right now helping, organizing. She needed to do her part, too.\nE. N. Díaz is a Mexican non-binary author of speculative fiction. Their short story “Mamá Chayo’s Magic Lesson” can be found in The Magazine of Fantasy & Science Fiction. Their work focuses on people not often center spot in this type of fiction. They are often inspired by the members of their family and the stories told by them of fantastic occurrences in everyday life. It is just a family fact that one of their great-aunts used to box with a bear in a family circus. They write in both English and Spanish.", "source": "https://clarkesworldmagazine.com/diaz_12_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Just One Step, and Then the Next by E. N. Díaz"}