{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nisi Shawl", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "w3nxlDE7x8WG99uhsuVKu10SDGc=", "id": null, "license": null, "comments": "", "raw_text": "9600 words, novelette, REPRINT  Shiomah's Land  I guess I’ll never know for sure whether my mother meant to throw herself to her death beneath the wheels of a god’s carriage. She certainly had something in mind, for she kissed my forehead before she left me, first brushing my dark, unruly locks aside. Then she told me to stay still, and ran off towards the road. It looked to me as though she slipped, though she was actress enough to do that on purpose.  Perhaps she only meant to be maimed, slightly. Stories were told of mortals who had been restored after such accidents and given handsome gifts as well: metals, or strange fabrics. She may have been aiming for these riches.  I didn’t try to stop her, confident that she must know what she was doing. I was very proud of my mother; was she not the greatest glee-woman walking? She taught me all I knew.  Of course, anyone who has passed a Fertility Trial is exceptional, but the thrilling tale my mother told of hers convinced me that she was without match. Apparently she agreed with me, for when she was fit for travel we spent very little time with my father and his people.  I must have been about nine or so when we heard that my father’s people had sent someone out to look for us. Or for me, to be more specific. They had been content to leave me in my mother’s care at first, but I was now big enough to work strongly in the fields. Naturally, we decided to flee.  We took a raft a long way down a river, singing our way to Kimp Sinn, the city. It was said that the walls of Kimp Sinn were lined with foodholes, that one could see the gods on every corner. In a manner of speaking, these marvels were quite true.  Kimp Sinn is on an island in the sea. It is reached (unless you are a god) by a long, waltzing causeway. I still can remember the feeling of exhilaration we shared as my mother and I walked through the blue and white sky, gulls screaming around us.  In the city we found that many people had arrived there before us and were already well entrenched. The plenteous foodholes, which produced more than enough food for all, were controlled by certain individuals and groups. If no one could give them something of value in return for it, the food they could not eat was dumped into the sea. The gulls love Kimp Sinn. Their droppings white-wash the walls.  And as for seeing the gods on every corner, that was almost right, for everywhere there were glowing colored squares busy with flickering images of the gods. Some of them were said to reside upon the mountains of the island. Once in a great while one of their little silver carriages would roll down the hollow god road . . .  Not many considered our “songs, dances, plays, and fooleries” as worth watching above a moment, much less offering goods for the privilege. Not when they could watch the god shows for nothing. That first evening my mother traded her horn earrings for some dairy and ceery for us, some sweet for me, and a little smooth for herself. We had to trade again to get a roof space to sleep on.  The next day we learned to catch and kill rats. There were two foodholes in Kimp Sinn that operated only when a ratskin had been dropped in. The generous caretakers of these places inserted the ratskins for one, taking only part of the food for themselves. Thus we made our way in a place where our work meant nothing.  We were waiting for one of the ships that Kimp Sinn’s natives boasted sometimes came calling to the port. None came for a long time. They told us it was because of storms, though the sea was calm as far as any could see. My mother believed them, she said, “for the sea is very big, Teekoige.” At last a ship came, but it was going North, back toward my father’s home.  As we waited for a Southern voyager, passing the days on the pier and the streets, hunting for rats and trading away our trinkets, I became aware of a secret interaction between my mother and a man named Obelk, one of those who took our ratskins. I got the feeling that he wished her to do something that she would rather not. It must have been something awful, or she would have told me about it, I am sure.  My mother cut off and traded her hair. I remember how heavy and dark it was, like sweet or sorghum.  One day Obelk refused to trade with us. The others did the same, at his foodhole and the other where ratskins were accepted. We could not even get fresh water.  So I know my mother was in a desperate state as we walked alongside the god road. But I do not know what was in her mind. I did not see her expression as she died.  She was thrown high into the air, then came thudding down in the road behind the slowing carriage. I ran screaming to her, but just as I reached her I was seized in a cold grip and lifted from her side. I stopped my screaming then, too frightened to breathe. I was carried to the carriage; up to a window in the wall, a window covered with glass.  Behind the glass I saw a beautiful round white face, appearing to me like a full moon in the night. The moon smiled and said something I couldn’t hear through the glass. The cold grip deposited me in a sort of bin at the back of the carriage, shutting the lid on me and plunging me into total darkness. I felt the carriage move.  I finished crying for my mother. I knew that she must be dead. After the movement had stopped I was taken from the bin by the cold grip, which as I saw belonged to a tall, shiny man, astonishingly costumed all in metal. For some reason I could not fathom, I fell instantly asleep.  When I awoke I was alone, and I felt far away from death, my mother, silver carriages, rats, Kimp Sinn, gulls, the moon, and myself. I know now this was the result of the chemicals with which I had been treated. I lay there then not knowing this and not caring. I finally got up because I had to pee. Hunkering over the slit, I noticed that my locks no longer fell over my shoulders. Feeling with my hand I found that an outrageously short fuzz was all I had covering my head. Also, I was naked (something that had not sunk in while I squatted peeing). I looked around for my clothes, but they were not in sight.  There was a mirror on one wall. At first I did not realize what it was, because I was unaccustomed to such large, clear mirrors. It showed me not only my bony face but my pitiful brown nakedness, the pale sea-colored walls behind me, the slit, the foodhole, and the bedmat from which I had just risen. It acted like a mirror, so I believed it was one. But suddenly it was no longer a mirror; it glowed like the god images on the walls of Kimp Sinn. Like a growing jewel, a picture of the moonface appeared, framed with lavender hair. I looked away.  “Teekoige!” called the picture’s voice. My name, I thought, but I did not respond. “Teekoige? Teekoige!” The image faded.  I turned to the foodhole. It gave me some bean and veg and some nice flavored water. I did some stretches, automatically at first. As my body warmed up, my thoughts began to cohere. I went over recent events. My mother’s death maintained its distance. It was like something I had been sad about a long time ago.  One heard of those who had been actually taken up by the gods. These rare individuals were never again seen by mortal eyes.  In a little while the square called me again. I ignored it. Then it threatened to shut off the foodhole and the sluice for the slit until I “learned to mind my manners.” This provoked me into answering that I did not need to use my manners to deal with a talking picture square. After a brief silence the light dimmed out and the mirror returned again.  Shortly, it began to move, opening inward like a door. I snatched up the sheet from the bedmat to wrap myself in it. I need not have bothered, though; my visitor was also naked. Her skin and hair shining, the god who had killed my mother (but it must have been a very long time ago) said hello to me, half frowning, half smiling.  “Hello, Teekoige, then, if you will have no graven image,” she addressed me.  “Hello—” I replied, with a heavy pause.  She took her cue. “Amma.”  “Hello, Amma, midam,” I said, happy that my mother had taught me something of the ways of the gods. Amma is worshipped for her effect upon moods, storms, accidents, and sudden changes. I curtsied deeply.  “I am sorry about your mother, Teekoige,” she said, as if that took care of everything. For her it did. For me it only brought the realization that my mother may not have been entirely responsible for her own death.  Amma immediately wanted to know why I “would not speak with her over the vee,” gesturing to the mirror. I could not answer her, so she continued. “Why did you manipulate me into coming here? Are you planning to kill me?” she asked with a friendly sneer. “No, of course not; we both know that that is impossible. Why?”  “I will do what you want me to do, midam,” I replied slowly, “but I had no idea I should have treated that trick as though it were a real god. Such a thought never occurred in my head.” I had a lot to learn.  Amma, however, seemed well pleased with my answer. My ignorance was exactly what she wished for, “for I shall not have to unteach you a lot of tiresome misconceptions, like those city-bred mortals.  “My dear girl,” she went on, “you are absolutely perfect. Except for that horrible name.” She clasped her hands together above her breasts, her nipples glowing like large rosy pearls. “You must have a stage name, something more mellifluous and resonant. Shiomah, that is it. Amma’s Shiomah.”  Amma was a merry god, though capricious. Her form was always that of a beautiful, slightly plump woman with hair and skin of varying colors. She used also to remove part of the weight of her hair so that it floated up shimmering behind her head as she walked or glided along. She never cheapened her elegance with so much as a ring. This was a marked divergence from universal custom; even bioservs wore shorts or tunics or something.  Amma created and recorded adventures and dramas that were highly popular among the gods. She had nothing to do with the pictures that moved on the corners of Kimp Sinn. Those, she told me, were Nyglu’s idea, produced by machines.  Machines are the gods’ power. Machines give them their lives and their beauty. Amma showed me large and small machines, simple and complicated ones. Some are inside the gods, some embedded deep within the world, some fly constantly around the sky. Carriages, vees, foodholes, and servs are all machines. Machines speak and listen and reproduce and repair. They are toys and tools and objects of desire.  Amma knew me inside out with the help of these machines. Silver circles embedded in her hand allowed her to instruct them as to her wishes. They gave her all my secrets as I slept. They whispered to me through my dreams, teaching me things I would not remember until I needed to know them. I wore a ring in my ear that spoke her commands to me when she herself was elsewhere.  She controlled me in many ways; at first through my awe and also, I later realized, by using the words and intonations of my mother. After a while I just wanted to please her, and for a very long time she did not even have to threaten me with the punishments she held in readiness.  I controlled nothing, directly. I could not even cause a door to open until Amma ordered a serv to accompany me everywhere, operating its fellow machines for me. Even over this I had less than absolute power. It did nothing that conflicted with its basic paradigms, and often, at first, I gave it impossible instructions.  “Go drown yourself,” I told it one day, in a foul mood after my sixth failure at forming a difficult construction in the Creative Mode (the gods’ most difficult language). I knew perfectly well that the serv was operable under water, but I thought that it would at least try to obey me. Instead it put itself on standby, locking in place and emitting a distressed, hiccupping click. Some device must have alerted Amma, for she came into my room almost immediately, with another serv that deactivated and removed my companion.  “You must not deliberately incapacitate my machines, Shiomah,” she said, calm but stern. Her eyebrows lowered into a lovely frown. “This particular episode does not stem from ignorance, does it?” I shook my head, chagrined. “If this continues, you will be denied all service.”  I glanced around my quarters. They were pleasant: sand-colored, papery-feeling walls, russet and amber appointments, wide windows from which to see the sea. Still, it was no place in which to be involuntarily confined. But I did manage to confound my serv on one other occasion, though not exactly intentionally. It was just that I couldn’t understand why I didn’t miss my mother more, and I thought perhaps if I had something tangible to mourn . . .  This time two units came; one to attend to the damaged serv, the other to accompany me to Amma’s tower. I followed it up, a heavy lump of apprehension inside my chest refusing to respond to the lift of the glide-way.  A rain the color of peridots curtained the entrance to my mistress’ apartment. I stepped through. As sometimes happened, the rain failed to cease falling, and I was drenched.  The sun was at its zenith, and the iris of the tower’s ceiling had contracted to a slit. Below its short overhang, a long window curved continuously, circled by blue sky. Amma sat with her pale green legs curled beneath her, bent forward to look at a display board set in the floor. Raising her face to me, she seemed about to laugh at my wetness, but then a deliberate lack of expression smoothed away the beginnings of her dimples. I took a towel from a knob on the wall behind me and dried myself as I went to sit before her.  “You sent your serv to bring you your mother’s remains,” she half asked, half stated.  “Yes, midam.”  “You knew the task would be difficult. Did you know how difficult?”  “I thought that it could ask for assistance; take a carriage; make inquiries.”  “Inquiries of the gulls? Assistance from the herring? What do you suppose has become of your mother in all the time I have had you?” Her questions brought up that strange numbness in me, stronger than ever, a broad, flat humming that drowned out my answer as I formed it. I suppose I must have imagined the citizens of Kimp Sinn taking her away, burning her, urning her ashes. But the overwhelming nothing that I felt negated all possibilities. I hung my head in silence, ashamed of my speechlessness. How could I know that she had suggested this, had planted in my mind this bland substitute for grief?  “I will tell you what happened, my dear,” Amma said, perhaps moved to some sort of divine contrition by my dumbness. “She was removed and disintegrated by the road’s maintenance mechanisms. By now she is scattered far and wide, and still dispersing.”  She paused, her soft green fingers touching me under my chin, tilting my head upwards. “You were asking for all the birds of the air, all the fish in the sea, every blade of grass upon the dunes, every sandcrab on the beach.” She stopped again, holding my eyes with hers. “Why did not you ask me?”  The spell of numbness had passed at her touch, but still I couldn’t answer. It had come to me that Amma did not want me to have a mother, alive or dead. How could I tell a god she was jealous of a mortal?  “Why did you not take her up in your carriage, with me?” I asked, neglecting to use the honorific. Her eyes narrowed, measuring me closely.  “I thought you might be of use to me,” she replied, dropping her arm, “but I saw no need to carry around a corpse. Would it have been pleasant for you, in that dark, unfamiliar place, crowded in with your mother’s body? I wanted you in the best shape possible, confident, unbroken, trusting yourself against the unknown.” She stood suddenly, and raised me delicately with her fingertips. “Even in shock, your face seemed so dazzlingly young, yearning to see me through my window . . . I thought you might be of use to me,” she repeated, “and it begins to look as though I was right.” Affirming her own good judgment, she nodded, smiling a small but brilliant smile.  To please her, I learned. I learned the shape of the world and the depth of the skies and their ways. I learned the gods’ habits and slow history. Sometimes I came upon obstacles in my search for knowledge: blank walls or steps built up into empty air. Amma approved of my frustration as a sign of my curiosity, helping me when she could and promising that in time I would know all.  Contrary to what my mother had taught me, I learned that individual gods do die. If they are not done in by one of their peers or by some accident during one of their frequent flirtations with death, they do themselves in. Five hundred years is the average lifespan. Many extend this several times, however, by being reborn.  But even this measure can only temporarily rescue a world-weary god. Sooner or later one particular copy will develop such a deeply ingrained disgust for the futile repetitions that the process is discontinued.  I discovered that the gods did not take such a deep interest in the affairs of mortals as was generally supposed. The interest was sporadic, shallow, a matter of fashion. During one of the periods when it was considered stylish to notice mortals, the causeway and the city of Kimp Sinn were built, the scattered foodholes installed about the land to supplement the crops, the Fertility Trials viewed avidly. But the divine population of the island had been steadily decreasing, the wonder of mortal ways having palled centuries ago for most.  The exception to this was the ancient river god, Nyglu, the aforementioned producer of the vee shows of Kimp Sinn. He was also the innovator of the ratskin-trading foodhole. Nyglu’s all-consuming passion was the study of mortals, by means of any and all disciplines. Considered by most a boring eccentric, Nyglu was included in Amma’s circle partly because of some obscure genetic relationship between the two and partly, I think, because of Amma’s taste for the odd and sensational.  Throughout their friendship she had humored his harmless pastimes, learning mortal speech at his insistence. Hearing of my acquisition, he had made her promise that I would be introduced to him at the first opportunity.  Amma held back on this for some time. She relieved me of some of my awe and fed my own good opinion of myself until she felt I was ready. It was her plan that I should confront Nyglu with at least an elementary knowledge of the gods’ languages and etiquettes, and with all my native audacity intact.  The meeting took place in my own quarters: familiar ground for me, new to my interviewer. He stared as though he would like to trap me on his sticky tongue. His eyes glittered beneath large, horny ridges. His skin was rough, wrinkled, and sprinkled with warts. He addressed me in First Speech, the one used with low-order mechanisms and bioservs. “Is it good that you are Amma’s Shiomah?”  “Couldn’t be cleaner,” I replied, using the latest Juvenile Swerve. I switched to Obligatory Contract. “I understand that the information I represent carries some value to you, Mr. Nyglu?”  He actually blinked. Then we got down to negotiations, which went very much, I thought, in my favor. Credit goes to Amma for coaching me in being able to read the face of one so—different. But Nyglu had never needed to be shrewd, as I and my mother had. It was like bargaining with soft wax.  Amma was delighted with the outcome. She rewound the contract and played it through after Nyglu had gone, chuckling at the extent of my boldness. “So he actually paid you for the recordings I made when I found you, before you first woke up? He might have gotten those as a gift from me, had he asked.”  “But I gave him no time to think of asking. And you said that I could offer them, midam.”  “Yes, but it was your idea. And so was this performance you scheduled. I suppose you will need to use a bioserv for at least part of it.”  “If I may.”  She glanced at me from the corner of one mirthful eye. “Of course you may. I wouldn’t miss it for an asteroid.” She returned to scanning the contract. “Very good, especially this last part.”  “The consultant clause?”  “Yes. Nyglu has never been able to get anyone to wade through his material before, so you flatter him, even at this price.”  It bothered me for awhile that I had not asked for a higher fee to review his work, but as my mother always said, it does no harm to have your customer feel he’s gotten the best of the deal. And I certainly did well with what I had won.  The gods lived in weary anarchy, most having rubbed away the edges of their more troublesome desires by way of fulfillment, long ago. Aesthetic and social pressures exercised the only control. Any serious problems that developed (usually with the younger deities) were dealt with by somewhat interested parties, informal groups with as much license to punish the offenders as their own level of annoyance allowed.  Under Amma’s protection I had just about any rights she chose to give me. She bestowed upon me all the privileges and powers she thought I could grasp. I set out to increase my earthly store with an earnest intensity that my protectress found amusing. To the gods, wealth is no more than a diversion. I was a bottomless coinpurse, an everladen tablecloth, for Amma.  She adored the havoc my childish temper and unconventional questions wreaked upon her circle of acquaintances. These occurrences were a little like my earlier effects upon the servs, but for some reason she found them much less irritating.  For instance, once she brought me with her to try out a new toy, a boat a lover had just given her. The lover, a minor god without physical affectations, was called Weyando. He was on board to demonstrate the boat’s principles of operation, as he was the engineer of both the hull and the living sail. Also present was a certain young Lizore, related somehow to Weyando, and apparently to be my charge should Amma and Weyando find themselves too busy to attend to her.  Had she been a mortal I would have judged Lizore to be about four years of age. Actually she had just turned twenty-five, though she was still considered a child by divine standards. Although she appeared properly aloof in the presence of Weyando, her eyes took on a more interested expression the moment she was left in my care.  “Hurry, show me,” she asked at once. “Are your genitals like mine?”  “Somewhat,” I admitted. “Would you like to look at them, midam?”  “Yes, I just said so,” she snapped. “I suppose you will want to see mine? All right, then.” She reached for the hem of her shift.  “No,” I said, “just tell me something, please. Answer a question.”  “A question you shouldn’t ask?” I nodded. “All right.”  “What relation are you to Weyando?” Even I was astounded by my daring. Held distinct from sexual practices, the reproductive secrets of the gods are exactly that. Secrets. This was one of the topics upon which Amma had adamantly insisted that I remain uneducated. Any bioserv that became precocious enough to be coaxed into speculation upon the subject promptly disappeared.  Lizore’s steely eyes glinted with new respect as she answered me. “His eggson is my spermfather.” She looked up at me expectantly, and I nodded in a show of understanding, lifting my hem to her examination.  “We are very nearly identical,” she reported, in a disappointed voice.  I was quite as dissatisfied with my end of the bargain, until Amma explained Lizore’s terms and others just as confusing. But that was much later, when she asked me to have her child.  Weyando’s gift was a success. The water foamed and hissed away below us, constantly changing into itself, showing all the colors of my mistress’ moods. The sun warmed the sail, which turned itself constantly to the heat, a billowing net filled with a wind of light. At night soft breezes pushed against its unfurled membranes, sailing us through the phosphorescent dark.  Day or night, Amma and Weyando were together: guiding the ship, gazing into each others eyes, satisfying themselves with one another’s sight, or sound, or smell, or touch, or taste.  Lizore and I were much in each other’s company. Five days after our first encounter, I posed a question with an impact that far outweighed that of the first one I had asked. As Lizore and I silvered ourselves with glittering scales from the hull, she laughed at some witless pun I made. “Really, Shiomah,” she giggled, “you’re not at all boring. I find it hard to believe you are a mortal.” She said it to praise me, so I tried to hide my offended pride, but my reply came sharply.  “If we mortals are so boring, midam, why did you gods bother to create us? If we are inferior, we are your work.” The paradox struck Lizore just as if I had slapped her baby-fat cheeks. Mortals, she had been taught, were tacky. Stupid, clumsy, disease-ridden—they were all this, and a great deal more that was anything but necessary.  “Come,” she ordered, heading for the stern. At our approach, her spermfather’s eggfather locked the controls and turned to her trouble-filled face. Amma lifted herself up from the deck on one elbow, watching with the expression of one about to be entertained. “Weyando,” Lizore asked, “why do we need mortals? What did we make them for?” A short but devastated silence followed.  Amma rose from her languid pose. “I’ll call the copter,” she said.  “But why did . . . ” Lizore started again querulously.  “Later,” Weyando told her, with a quelling and emphatic glance in my direction.  After her guests left, Amma began to laugh aloud, tickling my ribs till I joined her. Her voice sounded like a wind chime, the separate notes hanging in the air and striking one another like strung shells, soft yet clear.  When we had calmed down a bit, she made me sit with her on a little wooden bench. Then she took me by both hands and explained at length why my question had caused such discomfort.  “The gods do not need mortals at all. For any reason.” At times, she said, there had even been crusades to have them wiped out. “But that’s not at all fashionable now,” Amma reassured me.  “And—” I coaxed her, knowing there must be more.  “Yes. Go ahead.”  “And the gods did not make the mortals.”  She nodded, pleased at my quickness. “The gods—were mortals, at one time.”  “It is not general knowledge. Especially not among children. But, yes, our remote ancestors and yours are one, the same.” Her cheeks dimpled; she was fond of the unorthodox, and I piqued her with my impertinence.  “No doubt these facts had a bearing on the defeat of the drive for our extermination, midam.” She nodded, eyes and hands suddenly intent upon disentangling some snarl in my hair. I continued my conjectures silently for a moment as we skimmed over the still sea.  I myself could see the advantages of maintaining some sort of gene pool. I asked her whether there were any mortals who had been made into gods. I had in mind those who had been “taken up” before me, and of whom I had never heard or seen anything during my time with the gods.  She answered me with irritating equivocation. “Yes. Well, no, not really, although in a way, yes.” I begged saucily for her to be more explicit.  “You know how we grow ourselves again, after we are dead?” I did. “Well, sometimes that is done with mortal flesh, and we turn them into a god that way.” I thought it a rather crooked path to immortality, but I could not disapprove of it when I reflected upon the sort of god that Obelk the rat-trader would make.  I thought again of the foodholes and those who held command over them when I went for the first time to one of Nyglu’s mudrooms. At all his homes he had these moist, dark retreats.  While reviewing here what he had written (more material was available for my scrutiny now that Amma had made the mortal origins of the gods explicit), I asked him his opinion of Kimp Sinn.  He seemed unsure at first of how to answer. “It works well enough, I think,” he equivocated, paddling his webbed feet in a dark pond.  “Well enough at what?” I asked impatiently. I sat cross-legged atop a table of long stone slabs, the driest spot I could find. “What is this city of the gods supposed to do?”  “It—you see, it provides a goal for the ambitious, and even for the less motivated an example—” he broke off and glanced up at me shyly “—of the beauty of our relationship.”  “Our relationship?” I asked incredulously. We spoke Modal Society, but business still formed the main basis of our intercourse, as far as I was concerned.  “I speak generally, of course,” Nyglu hastened to assure me. “Of the relationship between mortals and the gods, the gentle mentoring, the poignant reminder of our slower yet always inevitable decline, experienced in miniature before our eyes by your own people.”  “Oh.” From the divine vantage, all our petty strivings, Obelk’s and my mother’s and those of me myself must look equally vain, foolish, and pointless, and harmless on the whole. “How old are you, Nyglu?” Another of my tactless questions, with a wholly unexpected answer.  Nyglu flopped down on his knees before me. “What matters the difference in our years, charming child? My love for you is ageless.”  I felt lost. Was this a scene from some play in my repertoire? My lines, what were they? Cautiously, I extended my hands. It took a moment for the god to look up from his submissive pose. Then he seized my palms in his slippery grip and touched them several times with his sticky tongue. I withdrew quickly, disguising my disgust.  “Amma,” I managed to pant out in my fright and confusion. “She must not discover us.” And I felt this to be true, no mere excuse for separating myself from him.  “Oh, sweetness, surely not,” he said, his voice sad with longing at the loss of contact. “I can conceal our involvement from her. Trust me. Trust in my powers. Oh, Shiomah, we could make each other so happy.” I didn’t think so. But I let him touch me, just a little. Just a little more.  It was not too long after this that I progressed to the point where Amma felt I was of some use to her in her dramas. I played first for her the role of Juusli, a young god who rebels against the ennui of immortality by refusing to behave in a socially responsible manner. Among Juusli’s foibles was a refusal to allow her body to age into puberty. The piece was years in the making, so Amma had my growth temporarily halted.  Weyando came back to play the part of Jez, a more conventionally-minded contemporary of Juusli’s. No mention was made of the way that I had provoked Lizore’s speculative outburst, but he did not bring his eggson’s eggwife’s daughter to play with me again.  The part of Jez’s spouse, whom Juusli spends much of the piece trying to seduce, was filled by a beautiful bioserv that Amma referred to as a dryad. Amma spent much time with this pale and lovely creature, giving it detailed instructions covering every nuance of its role. The dryad would try to follow her directions exactly, and if the results were not desirable, Amma would once more go over the entire action, changing it if necessary.  Sometimes I believed that the dryad performed poorly on purpose, simply to deprive me of my mistress’ time. Professional pride kept me from following its example.  We spun around the globe, recording different parts of the story in different areas: ruins, deserts, the homes of friends, jungles, lakes, glaciers . . . I saw that the sea was large, that mortals counted for nothing against the world’s immensity. And that though outnumbered six-hundred-to-one, the divine five thousand leave more of a mark upon the earth than the mortal three million, because they are more able to work on the world’s scale.  There was a valley along a dead, dry river. All soil had been stripped from the land by some bored deity, and the bedrock had then been chiseled into tunnels and spires, a maze for the wind. Low, shuddering groans and high sounds that yearned to become music played around us there. Haunting murmurs and keening whistles accompanied every scene. It was easy to portray Juusli’s essential loneliness in this land that mourned for itself.  Once I looked up from the action of one of these scenes and saw to my surprise that tears fell from Amma’s eyes. When she signaled an end to the session, I followed her to the other edge of the plateau we worked upon. As we walked she seemed oblivious to me, but reaching the drop-off she stopped and called me to her.  Her tears left starry trails on her indigo skin, shining like her hyalescent hair. “Your performance is quite moving, Shiomah,” she told me in a low, steady voice. “I am proud.” So was I, for the scene just completed had been rather difficult. Juusli was struggling with the ghosts of her dead selves as they urged her to fling herself to another death. The difficulty lay in creating the physical impression of resistance while wrestling with the air. Departing from her usual procedure, Amma had chosen to screen-animate these devils after the recording, rather than manufacture bioservs which would only be demolished during their plunge into the canyon below. I was glad to have met this challenge so well, but I didn’t think Amma cried for joy in my competence. I waited and hoped for an explanation.  Instead she asked, “If I were to assure you, Shiomah, that you would be given immortality if only you jumped over the edge of this plateau, would you do it?”  I thought of my mother, tossed high into the air, dead, no doubt, before she hit the ground. “No.” I paused, weighing my position. “Of course I would have to, if you commanded me to, wouldn’t I?”  “But you have already answered my question,” she stated, dismissing mine. “Here is another. If I asked you to throw me down there, would you?” I started to speak, but she continued. “If I did not tell you to, but asked, with no authority.”  I could not picture autocratic, arbitrary Amma with no authority, though I tried. “What would become of me, if I did?” I inquired.  My mistress laughed, all melancholy suddenly gone from her manner. “You funny thing! So selfish, so practical. Never mind. I will not ask you to kill me, for you would surely find it an annoying task.” Taking my hand, she returned with me to the others.  A later sequence was recorded on Nyglu’s estate. Before his current obsession took hold of him, Nyglu had been fascinated with the order of amphibians, as his personal appearance showed. Perhaps this is why mortals associated him with rivers, and with fresh water in general. He certainly associated himself with it. Pools, bogs, swamps, and wet places of all sorts made up the bulk of his “grounds.” When we visited he still took great pride in showing the estate to his visitors, pointing out the particular species he had reconstructed from his studies. Some were immense and ugly, others small and subtle, effacing themselves into the dark, decaying backdrop.  There were also experiments, whims come to life. My favorites were the triphibians, a sort of winged salamander. Mottled scarlet and sky blue, one came and perched briefly on my arm then skimmed away. Seeing my delight, Nyglu hatched three eggs for me, and I spent my free time feeding and observing the larvae. Soon I had tame triphibians of my own, but I had to leave them behind when we went to the moon. Nyglu promised that they would be mine again when we returned.  The dryad was packed away in her trunk, and we coptered off to meet Amma’s sky shuttle. Weyando stayed behind; his character, Jez, didn’t appear in the final scenes. As we floated away from the world, its immensity was belittled.  We spent a long time in orbit because of a hitch in the preparations for our landing. An ancient resort on the moon’s surface was to have been restored to habitability without destroying the period flavor of the setting. Some too authentic material used in the repairs had ruptured and released most of the complex’s air. The old oxygen machines below the surface had long since been dismantled, and regular flights to and from Earth had stopped decades ago, at the end of the last space craze. It was a couple of days before more air was brought up. Trouble arose, due, in part, to our long confinement on board the shuttle.  In preparing me for the profession she had chosen for me, that of acting roles in her creations, Amma had given me access to all sorts of old cubes and reels. After I used up all the sleep tapes, she even taught me to read; not pictos like mortal writing, but words composed of letters, like these. While examining some written antiquities during the delay, I learned with real shock that the Earth had once been almost literally covered with mortals.  I ran to Amma in her cabin, craved to see her, was quickly admitted. What atrocity, I demanded of my mistress, had reduced the mortal population fifty-thousand-fold? As I asked this, I actually clutched Amma’s elbow to stop her from turning away from me. She froze.  I whipped my hand away, startled at what I had just done. I had tried to use force to press my will upon a divinity.  But when she again faced me, she was smiling. Sadly. As if she had expected this to happen, while at the same time hoping that it never would. As though I had pleased and pained her both, at once. “I will answer you, Shiomah,” she said, “but first I am going to show you something. Something I ought to have shown you long ago.” She extended her left hand.  Not for the first time I noticed that the sides of her fingers and the edges of her palm were lined with numerous shining dots. “Activation of one of these circuits,” she told me, “will wipe out a selected memory in your brain. I have chosen your mother’s name.” She let this sink in, then went on.  “Activation of a second will deprive you of the use of the centers of conscious volition. And the third,” she promised, “will prevent the operation of your autonomic systems. Do you understand me?”  I nodded. “Yes, midam.”  “Now. There was no disaster, no epidemic, no mass murder of mortals. The current population, my dear, is a result of time and care and thoughtful planning.” She made gestures with her hands like a prince in a story, dispensing coins to a crowd. “Birth control, ample food, lebensraum—the ancient fifty billion never had it so good.” I still had a lot to learn.  It was difficult after the revelation of these threats to reassume the role of Juusli, a character whose last motivation is fear. With relief I removed my pressure suit in the simulated vacuum of the closing act, the heroine succumbing to the hallucinatory call of dust sirens. It was an ambiguous ending, with Juusli unharmed, drifting away with the sirens (specially made bioservs, of course), leaving a sparkling trail of palpable looking dust.  When we returned to Earth, Amma let me age again, though more slowly than mortals are accustomed to do. She used me in other, smaller works, or in the social games she played with the other gods. Sometimes she devoted her enormous energies to my training, sometimes she seemed merely to relax and enjoy my company. Her attentions were far from constant. I would be ignored for months, a year at a time, then taken up again without, apparently, a beat skipped.  One afternoon, when I had been with her nearly fifteen years, she fancied she would make love with me. My body was that of a fourteen-year-old, an awkward, pudgy beauty, but she was attracted. How can the gods ever tire of such pleasure?  In time our desire was heightened by a burgeoning love. My adoration was natural, inevitable even. I think I had only been waiting to release it until I received some sign from her.  As to why she loved me I can only say that not even mortal passions are easily subjected to analysis. Amma’s love was fierce—and ridiculous, on the face of it. I still had pimples, at times. My nose was too long. I thought perhaps she confused me with Juusli, the first character she had created for me.  No deity questioned Amma’s absorption with me. Such fascinations were not unheard of. Sometimes the infatuated god went as far as actually regrowing the mortal undeified, merely in faithful reduplication of the beloved original.  Those foolish gods. They should have known that this would not be enough for Amma.  She contrived to have me conditioned into partial godhood while growing and then secretly disposing of the expected replacement. Immortality was given to me for as long as I can stand it, and the powers of the god machines were made mine.  The sins of my “mortal counterpart” were not visited upon the new Shiomah. Weyando’s eggson’s spermdaughter was again allowed into the circle of my influence. Others that I had alienated upon Amma’s instructions made me welcome in my new guise, with calls of congratulation and invitations to their estates. With all this obligatory gaiety, it was almost a year before we settled in again back on the island.  Amma became more and more attentive. She involved me in the details of her creations, seeking advice on costume and dialogue for her daring depiction of a god in mortal disguise. I decided to have my rooms dismantled, as I spent nearly all my time in hers. Everything was packed away except the terminal when she came to me with her offer of marriage.  I stared at her across the wide, bare floor. She was colored all turquoise, with hair like ethereal jade. She clashed horribly with what was left of the decor.  “Well?” she asked, a little sharply. “Don’t you want to be my wife?”  “Oh yes, yes Amma,” I managed to reply. Since being deified I no longer referred to my mistress as “midam.” “I do, I’ll be so happy, I’ll make you so happy, only I am very much surprised . . . ” I trailed off. I came towards her, one eye on the terminal’s screen. I did love her, and it meant so much to me to please her. She kissed the top of my head and clasped me to her.  “You should be used to receiving surprises from me by now,” she said as she released me, smiling. “In time, you will grow accustomed to my ways, and come to find me quite boring, no doubt.”  I shook my locks in vigorous dissent. “Never, no, never, Amma.” I took her hands in mine and kissed each sea-colored fingertip, saying “You are so sweet, so generous, so full of precious secrets—” I came to one of the little silver circles with which she controlled her underlings.  “Oh, yes, that reminds me,” she said when I did not continue. “I almost forgot to tell you. I’m going to have those signals removed, those ones I told you about on the moon.” I met her eyes. They were dark, gravely serious in her expressive face.  “The ones you said could erase my memory or destroy my nervous system?”  She nodded. “So. Now that you’ve consented to engage yourself to me, there’s no danger of those circuits ever being engaged.” She grinned, suddenly in an impish mood, and I perceived the pun (no pun at all in mortal speech) almost at the same time as I saw the call light blink on the com screen. Pretending to be disgusted with the lowness of her humor, I managed to shove her playfully through the door before she noticed the flashing signal.  As I had expected, it was Nyglu. His warty face showed satisfaction to my trained eyes. “I have the body,” he reported, “and the other arrangements are underway.”  “Very good,” I told him. With the passage of time I had grown used to my deepening contact with Nyglu and the leverage it gave me. “Then you may count on my presence in your mudroom—” I hesitated. Amma had planned to leave for Nyglu’s estate this evening, but there was no telling when I’d be left alone there, now that we were betrothed. “Whenever I can come without Amma knowing,” I hastily amended. Nyglu looked like he wanted to protest, but to whom? Not to me. I switched off the screen and went looking for my mistress.  We were wed in a short but impressive ceremony aboard the ship Amma had been given by Weyando. I begged her to wear some form of clothing, and at last she compromised by causing her hair to cling to her nakedness, covering almost all the right places. By contrast, I was draped in fluttering, dune-colored fabrics designed to hide the tiny scars and other imperfections my body carried. True, we might have said that Amma had caused my replacement to be grown bearing these marks, but I desired to avoid explanations.  The wind sang in the rigging, our only choir. The sky, as ever in those latitudes, was a vaulted dome of blue. The child Lizore joined our hands as we pledged our love, “as long as its life continues.” After kissing one another’s eyelids, we turned to bestow our wedding gifts upon our guests, all of whom, at Amma’s insistence, were present.  As we passed among her friends and relatives, Amma made sketchy introductions to those I had not yet met. “Hayvre, Lizore’s eggmother,” she named one black, black woman who reached out to clasp my hand in one sporting two thumbs. “Elleefaw” was a tiny, shaggy, sexless looking god in spiked heels. I recognized the name as belonging to the deity of unpleasant truths.  “He makes the best monuments. We used the Hill of Glass in my last piece, Elleefaw,” she said to the short, red-furred god. “It was perfect, especially the way it opens and closes like an eye.” Elleefaw nodded his approval of this tribute, running his own sharp eye up and down my pudgy awkwardness. I felt uneasy in his presence, and I wasn’t made more comfortable by the remark he made as he walked way. “Now you’ll each find out what the other is really like,” he announced over his shoulder, clip-clopping off across the deck. But surely we had learned all that in over twenty years?  I was glad to see Nyglu, preferring his familiar strangeness to these upsetting new acquaintances. Our encounters had been curtailed since the betrothal, and he was glad to stay by my side when I asked him to, as a sort of buffer.  “I don’t know why you couldn’t broadcast the ceremony like everyone else does,” he complained to us in a mildly fretful tone. “But I must admit that I am enjoying myself,” he added politely (and perhaps also to prevent Amma from detecting his morose jealousy).  My mistress hadn’t explained to me her reasons for an in-person celebration, but now she said, “This one isn’t for show. This one is going to last.” With a fond look she walked away from me, taking our glasses to be filled with the bright, frothy drink that was being served.  Still disturbed by Elleefaw’s pronouncement, I was silent until Nyglu wondered out loud if anything was wrong. “Do you think everything will change now?” I asked him. I expected denial. His precarious happiness, his treasured times with me, would work to keep him from accepting the possibility of a different course in our lives.  Instead, he shrugged, resigned. “Change,” Nyglu answered, “is Amma’s only constant.”  For several months after our marriage, all remained the same. I continued to work for Amma as before, to make furious or languid love with her, to study and transact my own business. I acquired islands, asteroids, and watersheds entirely my own, as well as other, less common commodities. Nyglu took care of this for me, with all the discretion I relied upon him for.  Then Amma decided that we were going to have a child. The new Shiomah might have asked upon deification how gods were born. Perhaps Amma attributed my lack of curiosity on the subject to habits formed in earlier days. I could hardly tell her of my source. Instead, I massaged her hands, pulling and stroking her pale violet fingers as she recited the possibilities to the tower’s open ceiling, full of stars.  “We can mate as mortals do,” she whispered, “or we can let machines do it for us. Two males can join genetic material, or two females. We can mate with ourselves or with those long dead. Just as soon as you’re ready,” she said, “we’ll start taking the enzymes that neutralize the sterilizing compounds.” She sighed as I dug into the fleshy mound beneath her thumb.  “And then?” I asked. But in answer Amma held her hand to my mouth and brought mine in turn to her delicately nipping teeth. Her excitement at the thought of conception made further details impossible to come by until dawn.  What Amma offered me was the opportunity to impose my genetic message over that of a microscopic animal. The animal would then be injected into a donated sperm cell, and the sperm cell would join with an egg of hers. This was fine with me; I leapt at the chance for another sort of immortality. Amma and I disagreed on only one important point; I wanted her to carry the baby in her own body. Even for just a short while. She would not; not even her innate love of the curious made pregnancy appealing to her.  I offered to bear the child within my own body. She pointed out that to do so would endanger the lie we lived. “Only a mortal would allow itself to be invaded in such a manner,” she declared hotly. Anyway, what did it matter that our wombs were empty; we would still be mothers as the gods saw things.  It mattered to me.  Weeks passed. I took to sulking in my old refuge, the brown and russet rooms I had occupied before our marriage. Gradually I brought the furnishings out of storage, determined to be comfortable in the midst of my self-imposed exile. I avoided Amma, keeping to my own apartments as much as possible.  Finally she came to me, persuasive and proud. I slouched on my couch seat, not looking up as she lowered herself beside me.  “Don’t pout, Shiomah,” she said, putting an arm around me. She laughed. “I could walk to Kimp Sinn on your lower lip.” That made me smile, but I quickly pretended that I never had.  “Our ways are better, you will see,” she continued, coaxingly. Pale blue, she rested like a piece of sky on the brown slopes of my shoulders.  I shook her arm off, standing up and walking away angrily. “Your ways? You have no ways. You do nothing except let things be done for you.” In the silence that followed I felt the presence of Elleefaw, happy that we did no better than he had expected.  “Oh, Amma,” I said remorsefully, turning back to her again.  “Why do you oppose my will?” She was displeased that I had a will, rather than a mere collection of childish whims, that I had walked away from her, that I stood and she sat. Seeing this, I knelt, thus allowing her to continue to be gracious.  “Have I not treated you well, my dear?” she asked. Her fingers sought my hair, toyed with my tangles. “Have I not given you everything you ever desired, and more?” No, I thought, for my mother is gone, and you refuse to take her place. Deaf to my inner voice, Amma continued to talk of how she had spoiled me, ignorant of my deepening resolve.  “So you must understand,” she concluded, “that it will be best for both of us if you yield to me in this.”  “No,” I said, and her hand ceased fondling my locks. “If you make a child this way, it will be without my consent. You will have to kill me then, to keep me from confessing our crime.”  She stood, pushing me away from her. Her celestial face paled, a touch of cirrus in the sky. “You can’t mean it,” she said, quietly appalled. Bestowing immortality directly upon a mortal, as she had done, was inconceivable; the punishment for our deception would be of a kind with it. The gods are jealous.  “But I do mean it,” I said, rising and meeting her eyes without wavering. “No machine or half-animal is going to carry our child, Amma, not while I live.”  She stared until she saw that I was in earnest. Then, for the first time in my life I experienced divine wrath. She stamped the floor with one lovely foot and clenched her fists in front of her angrily heaving breast. “You fool!” she shouted, purple smudging her pale blue cheeks. She laughed harshly, metallically, an untuned gamelon. “You funny, funny fool.” Then she activated the first of the three circuits she had shown me years ago as we orbited the moon and had, of course, never disabled.  My mother’s name is gone, removed from my mind and all my records. And the erasure is permanent and self-reinforcing. Even if someone told me what my mother was called, I would forget the sounds as soon as they were said. Even if I wrote her name here as it was spoken, I would forget it as soon as it was read.  Amma is a capricious god, but thorough.  But shrewd as I am, I had made my preparations. Even as she was proving her remorse by destroying her other controls, I left and fled here.  I do not know if she was fooled by the death of my double. Nyglu was careful, but perhaps she will discover that he hid it for me when she thought she’d had it destroyed.  Perhaps she will not be deceived. Perhaps she will come and test my defenses. For all I can tell, though, she is even now working on another Shiomah, perhaps one just a little less hard-headed. I left her plenty of tissue samples.  It was foresight that made me search out this corner of the world, rich in plant life and rare minerals. It is mine through my efforts, and I have stocked it with my treasures. My horses, and cattle, and machines, and Fertility Manna. My plunder and purchases.  And the men and women, my mortals. I will take very tender care of my little mortals. And they will bless the land in my name.    Originally published in Asimov's Science Fiction, March 2001. Nisi Shawl wrote the 2016 Nebula finalist and Tiptree Honor novel Everfair, and the 2008 Tiptree Award-winning collection Filter House. In 2005 they co-wrote Writing the Other: A Practical Approach, a standard text on inclusive representation in the imaginative genres. Their stories have appeared in Analog and Asimov's magazines and many other publications. Shawl is a founder of the Carl Brandon Society and a Clarion West board member.", "text": "9600 words, novelette, REPRINT\nShiomah's Land\nI guess I’ll never know for sure whether my mother meant to throw herself to her death beneath the wheels of a god’s carriage. She certainly had something in mind, for she kissed my forehead before she left me, first brushing my dark, unruly locks aside. Then she told me to stay still, and ran off towards the road. It looked to me as though she slipped, though she was actress enough to do that on purpose.\nPerhaps she only meant to be maimed, slightly. Stories were told of mortals who had been restored after such accidents and given handsome gifts as well: metals, or strange fabrics. She may have been aiming for these riches.\nI didn’t try to stop her, confident that she must know what she was doing. I was very proud of my mother; was she not the greatest glee-woman walking? She taught me all I knew.\nOf course, anyone who has passed a Fertility Trial is exceptional, but the thrilling tale my mother told of hers convinced me that she was without match. Apparently she agreed with me, for when she was fit for travel we spent very little time with my father and his people.\nI must have been about nine or so when we heard that my father’s people had sent someone out to look for us. Or for me, to be more specific. They had been content to leave me in my mother’s care at first, but I was now big enough to work strongly in the fields. Naturally, we decided to flee.\nWe took a raft a long way down a river, singing our way to Kimp Sinn, the city. It was said that the walls of Kimp Sinn were lined with foodholes, that one could see the gods on every corner. In a manner of speaking, these marvels were quite true.\nKimp Sinn is on an island in the sea. It is reached (unless you are a god) by a long, waltzing causeway. I still can remember the feeling of exhilaration we shared as my mother and I walked through the blue and white sky, gulls screaming around us.\nIn the city we found that many people had arrived there before us and were already well entrenched. The plenteous foodholes, which produced more than enough food for all, were controlled by certain individuals and groups. If no one could give them something of value in return for it, the food they could not eat was dumped into the sea. The gulls love Kimp Sinn. Their droppings white-wash the walls.\nAnd as for seeing the gods on every corner, that was almost right, for everywhere there were glowing colored squares busy with flickering images of the gods. Some of them were said to reside upon the mountains of the island. Once in a great while one of their little silver carriages would roll down the hollow god road . . .\nNot many considered our “songs, dances, plays, and fooleries” as worth watching above a moment, much less offering goods for the privilege. Not when they could watch the god shows for nothing. That first evening my mother traded her horn earrings for some dairy and ceery for us, some sweet for me, and a little smooth for herself. We had to trade again to get a roof space to sleep on.\nThe next day we learned to catch and kill rats. There were two foodholes in Kimp Sinn that operated only when a ratskin had been dropped in. The generous caretakers of these places inserted the ratskins for one, taking only part of the food for themselves. Thus we made our way in a place where our work meant nothing.\nWe were waiting for one of the ships that Kimp Sinn’s natives boasted sometimes came calling to the port. None came for a long time. They told us it was because of storms, though the sea was calm as far as any could see. My mother believed them, she said, “for the sea is very big, Teekoige.” At last a ship came, but it was going North, back toward my father’s home.\nAs we waited for a Southern voyager, passing the days on the pier and the streets, hunting for rats and trading away our trinkets, I became aware of a secret interaction between my mother and a man named Obelk, one of those who took our ratskins. I got the feeling that he wished her to do something that she would rather not. It must have been something awful, or she would have told me about it, I am sure.\nMy mother cut off and traded her hair. I remember how heavy and dark it was, like sweet or sorghum.\nOne day Obelk refused to trade with us. The others did the same, at his foodhole and the other where ratskins were accepted. We could not even get fresh water.\nSo I know my mother was in a desperate state as we walked alongside the god road. But I do not know what was in her mind. I did not see her expression as she died.\nShe was thrown high into the air, then came thudding down in the road behind the slowing carriage. I ran screaming to her, but just as I reached her I was seized in a cold grip and lifted from her side. I stopped my screaming then, too frightened to breathe. I was carried to the carriage; up to a window in the wall, a window covered with glass.\nBehind the glass I saw a beautiful round white face, appearing to me like a full moon in the night. The moon smiled and said something I couldn’t hear through the glass. The cold grip deposited me in a sort of bin at the back of the carriage, shutting the lid on me and plunging me into total darkness. I felt the carriage move.\nI finished crying for my mother. I knew that she must be dead. After the movement had stopped I was taken from the bin by the cold grip, which as I saw belonged to a tall, shiny man, astonishingly costumed all in metal. For some reason I could not fathom, I fell instantly asleep.\nWhen I awoke I was alone, and I felt far away from death, my mother, silver carriages, rats, Kimp Sinn, gulls, the moon, and myself. I know now this was the result of the chemicals with which I had been treated. I lay there then not knowing this and not caring. I finally got up because I had to pee. Hunkering over the slit, I noticed that my locks no longer fell over my shoulders. Feeling with my hand I found that an outrageously short fuzz was all I had covering my head. Also, I was naked (something that had not sunk in while I squatted peeing). I looked around for my clothes, but they were not in sight.\nThere was a mirror on one wall. At first I did not realize what it was, because I was unaccustomed to such large, clear mirrors. It showed me not only my bony face but my pitiful brown nakedness, the pale sea-colored walls behind me, the slit, the foodhole, and the bedmat from which I had just risen. It acted like a mirror, so I believed it was one. But suddenly it was no longer a mirror; it glowed like the god images on the walls of Kimp Sinn. Like a growing jewel, a picture of the moonface appeared, framed with lavender hair. I looked away.\n“Teekoige!” called the picture’s voice. My name, I thought, but I did not respond. “Teekoige? Teekoige!” The image faded.\nI turned to the foodhole. It gave me some bean and veg and some nice flavored water. I did some stretches, automatically at first. As my body warmed up, my thoughts began to cohere. I went over recent events. My mother’s death maintained its distance. It was like something I had been sad about a long time ago.\nOne heard of those who had been actually taken up by the gods. These rare individuals were never again seen by mortal eyes.\nIn a little while the square called me again. I ignored it. Then it threatened to shut off the foodhole and the sluice for the slit until I “learned to mind my manners.” This provoked me into answering that I did not need to use my manners to deal with a talking picture square. After a brief silence the light dimmed out and the mirror returned again.\nShortly, it began to move, opening inward like a door. I snatched up the sheet from the bedmat to wrap myself in it. I need not have bothered, though; my visitor was also naked. Her skin and hair shining, the god who had killed my mother (but it must have been a very long time ago) said hello to me, half frowning, half smiling.\n“Hello, Teekoige, then, if you will have no graven image,” she addressed me.\n“Hello—” I replied, with a heavy pause.\nShe took her cue. “Amma.”\n“Hello, Amma, midam,” I said, happy that my mother had taught me something of the ways of the gods. Amma is worshipped for her effect upon moods, storms, accidents, and sudden changes. I curtsied deeply.\n“I am sorry about your mother, Teekoige,” she said, as if that took care of everything. For her it did. For me it only brought the realization that my mother may not have been entirely responsible for her own death.\nAmma immediately wanted to know why I “would not speak with her over the vee,” gesturing to the mirror. I could not answer her, so she continued. “Why did you manipulate me into coming here? Are you planning to kill me?” she asked with a friendly sneer. “No, of course not; we both know that that is impossible. Why?”\n“I will do what you want me to do, midam,” I replied slowly, “but I had no idea I should have treated that trick as though it were a real god. Such a thought never occurred in my head.” I had a lot to learn.\nAmma, however, seemed well pleased with my answer. My ignorance was exactly what she wished for, “for I shall not have to unteach you a lot of tiresome misconceptions, like those city-bred mortals.\n“My dear girl,” she went on, “you are absolutely perfect. Except for that horrible name.” She clasped her hands together above her breasts, her nipples glowing like large rosy pearls. “You must have a stage name, something more mellifluous and resonant. Shiomah, that is it. Amma’s Shiomah.”\nAmma was a merry god, though capricious. Her form was always that of a beautiful, slightly plump woman with hair and skin of varying colors. She used also to remove part of the weight of her hair so that it floated up shimmering behind her head as she walked or glided along. She never cheapened her elegance with so much as a ring. This was a marked divergence from universal custom; even bioservs wore shorts or tunics or something.\nAmma created and recorded adventures and dramas that were highly popular among the gods. She had nothing to do with the pictures that moved on the corners of Kimp Sinn. Those, she told me, were Nyglu’s idea, produced by machines.\nMachines are the gods’ power. Machines give them their lives and their beauty. Amma showed me large and small machines, simple and complicated ones. Some are inside the gods, some embedded deep within the world, some fly constantly around the sky. Carriages, vees, foodholes, and servs are all machines. Machines speak and listen and reproduce and repair. They are toys and tools and objects of desire.\nAmma knew me inside out with the help of these machines. Silver circles embedded in her hand allowed her to instruct them as to her wishes. They gave her all my secrets as I slept. They whispered to me through my dreams, teaching me things I would not remember until I needed to know them. I wore a ring in my ear that spoke her commands to me when she herself was elsewhere.\nShe controlled me in many ways; at first through my awe and also, I later realized, by using the words and intonations of my mother. After a while I just wanted to please her, and for a very long time she did not even have to threaten me with the punishments she held in readiness.\nI controlled nothing, directly. I could not even cause a door to open until Amma ordered a serv to accompany me everywhere, operating its fellow machines for me. Even over this I had less than absolute power. It did nothing that conflicted with its basic paradigms, and often, at first, I gave it impossible instructions.\n“Go drown yourself,” I told it one day, in a foul mood after my sixth failure at forming a difficult construction in the Creative Mode (the gods’ most difficult language). I knew perfectly well that the serv was operable under water, but I thought that it would at least try to obey me. Instead it put itself on standby, locking in place and emitting a distressed, hiccupping click. Some device must have alerted Amma, for she came into my room almost immediately, with another serv that deactivated and removed my companion.\n“You must not deliberately incapacitate my machines, Shiomah,” she said, calm but stern. Her eyebrows lowered into a lovely frown. “This particular episode does not stem from ignorance, does it?” I shook my head, chagrined. “If this continues, you will be denied all service.”\nI glanced around my quarters. They were pleasant: sand-colored, papery-feeling walls, russet and amber appointments, wide windows from which to see the sea. Still, it was no place in which to be involuntarily confined. But I did manage to confound my serv on one other occasion, though not exactly intentionally. It was just that I couldn’t understand why I didn’t miss my mother more, and I thought perhaps if I had something tangible to mourn . . .\nThis time two units came; one to attend to the damaged serv, the other to accompany me to Amma’s tower. I followed it up, a heavy lump of apprehension inside my chest refusing to respond to the lift of the glide-way.\nA rain the color of peridots curtained the entrance to my mistress’ apartment. I stepped through. As sometimes happened, the rain failed to cease falling, and I was drenched.\nThe sun was at its zenith, and the iris of the tower’s ceiling had contracted to a slit. Below its short overhang, a long window curved continuously, circled by blue sky. Amma sat with her pale green legs curled beneath her, bent forward to look at a display board set in the floor. Raising her face to me, she seemed about to laugh at my wetness, but then a deliberate lack of expression smoothed away the beginnings of her dimples. I took a towel from a knob on the wall behind me and dried myself as I went to sit before her.\n“You sent your serv to bring you your mother’s remains,” she half asked, half stated.\n“Yes, midam.”\n“You knew the task would be difficult. Did you know how difficult?”\n“I thought that it could ask for assistance; take a carriage; make inquiries.”\n“Inquiries of the gulls? Assistance from the herring? What do you suppose has become of your mother in all the time I have had you?” Her questions brought up that strange numbness in me, stronger than ever, a broad, flat humming that drowned out my answer as I formed it. I suppose I must have imagined the citizens of Kimp Sinn taking her away, burning her, urning her ashes. But the overwhelming nothing that I felt negated all possibilities. I hung my head in silence, ashamed of my speechlessness. How could I know that she had suggested this, had planted in my mind this bland substitute for grief?\n“I will tell you what happened, my dear,” Amma said, perhaps moved to some sort of divine contrition by my dumbness. “She was removed and disintegrated by the road’s maintenance mechanisms. By now she is scattered far and wide, and still dispersing.”\nShe paused, her soft green fingers touching me under my chin, tilting my head upwards. “You were asking for all the birds of the air, all the fish in the sea, every blade of grass upon the dunes, every sandcrab on the beach.” She stopped again, holding my eyes with hers. “Why did not you ask me?”\nThe spell of numbness had passed at her touch, but still I couldn’t answer. It had come to me that Amma did not want me to have a mother, alive or dead. How could I tell a god she was jealous of a mortal?\n“Why did you not take her up in your carriage, with me?” I asked, neglecting to use the honorific. Her eyes narrowed, measuring me closely.\n“I thought you might be of use to me,” she replied, dropping her arm, “but I saw no need to carry around a corpse. Would it have been pleasant for you, in that dark, unfamiliar place, crowded in with your mother’s body? I wanted you in the best shape possible, confident, unbroken, trusting yourself against the unknown.” She stood suddenly, and raised me delicately with her fingertips. “Even in shock, your face seemed so dazzlingly young, yearning to see me through my window . . . I thought you might be of use to me,” she repeated, “and it begins to look as though I was right.” Affirming her own good judgment, she nodded, smiling a small but brilliant smile.\nTo please her, I learned. I learned the shape of the world and the depth of the skies and their ways. I learned the gods’ habits and slow history. Sometimes I came upon obstacles in my search for knowledge: blank walls or steps built up into empty air. Amma approved of my frustration as a sign of my curiosity, helping me when she could and promising that in time I would know all.\nContrary to what my mother had taught me, I learned that individual gods do die. If they are not done in by one of their peers or by some accident during one of their frequent flirtations with death, they do themselves in. Five hundred years is the average lifespan. Many extend this several times, however, by being reborn.\nBut even this measure can only temporarily rescue a world-weary god. Sooner or later one particular copy will develop such a deeply ingrained disgust for the futile repetitions that the process is discontinued.\nI discovered that the gods did not take such a deep interest in the affairs of mortals as was generally supposed. The interest was sporadic, shallow, a matter of fashion. During one of the periods when it was considered stylish to notice mortals, the causeway and the city of Kimp Sinn were built, the scattered foodholes installed about the land to supplement the crops, the Fertility Trials viewed avidly. But the divine population of the island had been steadily decreasing, the wonder of mortal ways having palled centuries ago for most.\nThe exception to this was the ancient river god, Nyglu, the aforementioned producer of the vee shows of Kimp Sinn. He was also the innovator of the ratskin-trading foodhole. Nyglu’s all-consuming passion was the study of mortals, by means of any and all disciplines. Considered by most a boring eccentric, Nyglu was included in Amma’s circle partly because of some obscure genetic relationship between the two and partly, I think, because of Amma’s taste for the odd and sensational.\nThroughout their friendship she had humored his harmless pastimes, learning mortal speech at his insistence. Hearing of my acquisition, he had made her promise that I would be introduced to him at the first opportunity.\nAmma held back on this for some time. She relieved me of some of my awe and fed my own good opinion of myself until she felt I was ready. It was her plan that I should confront Nyglu with at least an elementary knowledge of the gods’ languages and etiquettes, and with all my native audacity intact.\nThe meeting took place in my own quarters: familiar ground for me, new to my interviewer. He stared as though he would like to trap me on his sticky tongue. His eyes glittered beneath large, horny ridges. His skin was rough, wrinkled, and sprinkled with warts. He addressed me in First Speech, the one used with low-order mechanisms and bioservs. “Is it good that you are Amma’s Shiomah?”\n“Couldn’t be cleaner,” I replied, using the latest Juvenile Swerve. I switched to Obligatory Contract. “I understand that the information I represent carries some value to you, Mr. Nyglu?”\nHe actually blinked. Then we got down to negotiations, which went very much, I thought, in my favor. Credit goes to Amma for coaching me in being able to read the face of one so—different. But Nyglu had never needed to be shrewd, as I and my mother had. It was like bargaining with soft wax.\nAmma was delighted with the outcome. She rewound the contract and played it through after Nyglu had gone, chuckling at the extent of my boldness. “So he actually paid you for the recordings I made when I found you, before you first woke up? He might have gotten those as a gift from me, had he asked.”\n“But I gave him no time to think of asking. And you said that I could offer them, midam.”\n“Yes, but it was your idea. And so was this performance you scheduled. I suppose you will need to use a bioserv for at least part of it.”\n“If I may.”\nShe glanced at me from the corner of one mirthful eye. “Of course you may. I wouldn’t miss it for an asteroid.” She returned to scanning the contract. “Very good, especially this last part.”\n“The consultant clause?”\n“Yes. Nyglu has never been able to get anyone to wade through his material before, so you flatter him, even at this price.”\nIt bothered me for awhile that I had not asked for a higher fee to review his work, but as my mother always said, it does no harm to have your customer feel he’s gotten the best of the deal. And I certainly did well with what I had won.\nThe gods lived in weary anarchy, most having rubbed away the edges of their more troublesome desires by way of fulfillment, long ago. Aesthetic and social pressures exercised the only control. Any serious problems that developed (usually with the younger deities) were dealt with by somewhat interested parties, informal groups with as much license to punish the offenders as their own level of annoyance allowed.\nUnder Amma’s protection I had just about any rights she chose to give me. She bestowed upon me all the privileges and powers she thought I could grasp. I set out to increase my earthly store with an earnest intensity that my protectress found amusing. To the gods, wealth is no more than a diversion. I was a bottomless coinpurse, an everladen tablecloth, for Amma.\nShe adored the havoc my childish temper and unconventional questions wreaked upon her circle of acquaintances. These occurrences were a little like my earlier effects upon the servs, but for some reason she found them much less irritating.\nFor instance, once she brought me with her to try out a new toy, a boat a lover had just given her. The lover, a minor god without physical affectations, was called Weyando. He was on board to demonstrate the boat’s principles of operation, as he was the engineer of both the hull and the living sail. Also present was a certain young Lizore, related somehow to Weyando, and apparently to be my charge should Amma and Weyando find themselves too busy to attend to her.\nHad she been a mortal I would have judged Lizore to be about four years of age. Actually she had just turned twenty-five, though she was still considered a child by divine standards. Although she appeared properly aloof in the presence of Weyando, her eyes took on a more interested expression the moment she was left in my care.\n“Hurry, show me,” she asked at once. “Are your genitals like mine?”\n“Somewhat,” I admitted. “Would you like to look at them, midam?”\n“Yes, I just said so,” she snapped. “I suppose you will want to see mine? All right, then.” She reached for the hem of her shift.\n“No,” I said, “just tell me something, please. Answer a question.”\n“A question you shouldn’t ask?” I nodded. “All right.”\n“What relation are you to Weyando?” Even I was astounded by my daring. Held distinct from sexual practices, the reproductive secrets of the gods are exactly that. Secrets. This was one of the topics upon which Amma had adamantly insisted that I remain uneducated. Any bioserv that became precocious enough to be coaxed into speculation upon the subject promptly disappeared.\nLizore’s steely eyes glinted with new respect as she answered me. “His eggson is my spermfather.” She looked up at me expectantly, and I nodded in a show of understanding, lifting my hem to her examination.\n“We are very nearly identical,” she reported, in a disappointed voice.\nI was quite as dissatisfied with my end of the bargain, until Amma explained Lizore’s terms and others just as confusing. But that was much later, when she asked me to have her child.\nWeyando’s gift was a success. The water foamed and hissed away below us, constantly changing into itself, showing all the colors of my mistress’ moods. The sun warmed the sail, which turned itself constantly to the heat, a billowing net filled with a wind of light. At night soft breezes pushed against its unfurled membranes, sailing us through the phosphorescent dark.\nDay or night, Amma and Weyando were together: guiding the ship, gazing into each others eyes, satisfying themselves with one another’s sight, or sound, or smell, or touch, or taste.\nLizore and I were much in each other’s company. Five days after our first encounter, I posed a question with an impact that far outweighed that of the first one I had asked. As Lizore and I silvered ourselves with glittering scales from the hull, she laughed at some witless pun I made. “Really, Shiomah,” she giggled, “you’re not at all boring. I find it hard to believe you are a mortal.” She said it to praise me, so I tried to hide my offended pride, but my reply came sharply.\n“If we mortals are so boring, midam, why did you gods bother to create us? If we are inferior, we are your work.” The paradox struck Lizore just as if I had slapped her baby-fat cheeks. Mortals, she had been taught, were tacky. Stupid, clumsy, disease-ridden—they were all this, and a great deal more that was anything but necessary.\n“Come,” she ordered, heading for the stern. At our approach, her spermfather’s eggfather locked the controls and turned to her trouble-filled face. Amma lifted herself up from the deck on one elbow, watching with the expression of one about to be entertained. “Weyando,” Lizore asked, “why do we need mortals? What did we make them for?” A short but devastated silence followed.\nAmma rose from her languid pose. “I’ll call the copter,” she said.\n“But why did . . . ” Lizore started again querulously.\n“Later,” Weyando told her, with a quelling and emphatic glance in my direction.\nAfter her guests left, Amma began to laugh aloud, tickling my ribs till I joined her. Her voice sounded like a wind chime, the separate notes hanging in the air and striking one another like strung shells, soft yet clear.\nWhen we had calmed down a bit, she made me sit with her on a little wooden bench. Then she took me by both hands and explained at length why my question had caused such discomfort.\n“The gods do not need mortals at all. For any reason.” At times, she said, there had even been crusades to have them wiped out. “But that’s not at all fashionable now,” Amma reassured me.\n“And—” I coaxed her, knowing there must be more.\n“Yes. Go ahead.”\n“And the gods did not make the mortals.”\nShe nodded, pleased at my quickness. “The gods—were mortals, at one time.”\n“It is not general knowledge. Especially not among children. But, yes, our remote ancestors and yours are one, the same.” Her cheeks dimpled; she was fond of the unorthodox, and I piqued her with my impertinence.\n“No doubt these facts had a bearing on the defeat of the drive for our extermination, midam.” She nodded, eyes and hands suddenly intent upon disentangling some snarl in my hair. I continued my conjectures silently for a moment as we skimmed over the still sea.\nI myself could see the advantages of maintaining some sort of gene pool. I asked her whether there were any mortals who had been made into gods. I had in mind those who had been “taken up” before me, and of whom I had never heard or seen anything during my time with the gods.\nShe answered me with irritating equivocation. “Yes. Well, no, not really, although in a way, yes.” I begged saucily for her to be more explicit.\n“You know how we grow ourselves again, after we are dead?” I did. “Well, sometimes that is done with mortal flesh, and we turn them into a god that way.” I thought it a rather crooked path to immortality, but I could not disapprove of it when I reflected upon the sort of god that Obelk the rat-trader would make.\nI thought again of the foodholes and those who held command over them when I went for the first time to one of Nyglu’s mudrooms. At all his homes he had these moist, dark retreats.\nWhile reviewing here what he had written (more material was available for my scrutiny now that Amma had made the mortal origins of the gods explicit), I asked him his opinion of Kimp Sinn.\nHe seemed unsure at first of how to answer. “It works well enough, I think,” he equivocated, paddling his webbed feet in a dark pond.\n“Well enough at what?” I asked impatiently. I sat cross-legged atop a table of long stone slabs, the driest spot I could find. “What is this city of the gods supposed to do?”\n“It—you see, it provides a goal for the ambitious, and even for the less motivated an example—” he broke off and glanced up at me shyly “—of the beauty of our relationship.”\n“Our relationship?” I asked incredulously. We spoke Modal Society, but business still formed the main basis of our intercourse, as far as I was concerned.\n“I speak generally, of course,” Nyglu hastened to assure me. “Of the relationship between mortals and the gods, the gentle mentoring, the poignant reminder of our slower yet always inevitable decline, experienced in miniature before our eyes by your own people.”\n“Oh.” From the divine vantage, all our petty strivings, Obelk’s and my mother’s and those of me myself must look equally vain, foolish, and pointless, and harmless on the whole. “How old are you, Nyglu?” Another of my tactless questions, with a wholly unexpected answer.\nNyglu flopped down on his knees before me. “What matters the difference in our years, charming child? My love for you is ageless.”\nI felt lost. Was this a scene from some play in my repertoire? My lines, what were they? Cautiously, I extended my hands. It took a moment for the god to look up from his submissive pose. Then he seized my palms in his slippery grip and touched them several times with his sticky tongue. I withdrew quickly, disguising my disgust.\n“Amma,” I managed to pant out in my fright and confusion. “She must not discover us.” And I felt this to be true, no mere excuse for separating myself from him.\n“Oh, sweetness, surely not,” he said, his voice sad with longing at the loss of contact. “I can conceal our involvement from her. Trust me. Trust in my powers. Oh, Shiomah, we could make each other so happy.” I didn’t think so. But I let him touch me, just a little. Just a little more.\nIt was not too long after this that I progressed to the point where Amma felt I was of some use to her in her dramas. I played first for her the role of Juusli, a young god who rebels against the ennui of immortality by refusing to behave in a socially responsible manner. Among Juusli’s foibles was a refusal to allow her body to age into puberty. The piece was years in the making, so Amma had my growth temporarily halted.\nWeyando came back to play the part of Jez, a more conventionally-minded contemporary of Juusli’s. No mention was made of the way that I had provoked Lizore’s speculative outburst, but he did not bring his eggson’s eggwife’s daughter to play with me again.\nThe part of Jez’s spouse, whom Juusli spends much of the piece trying to seduce, was filled by a beautiful bioserv that Amma referred to as a dryad. Amma spent much time with this pale and lovely creature, giving it detailed instructions covering every nuance of its role. The dryad would try to follow her directions exactly, and if the results were not desirable, Amma would once more go over the entire action, changing it if necessary.\nSometimes I believed that the dryad performed poorly on purpose, simply to deprive me of my mistress’ time. Professional pride kept me from following its example.\nWe spun around the globe, recording different parts of the story in different areas: ruins, deserts, the homes of friends, jungles, lakes, glaciers . . . I saw that the sea was large, that mortals counted for nothing against the world’s immensity. And that though outnumbered six-hundred-to-one, the divine five thousand leave more of a mark upon the earth than the mortal three million, because they are more able to work on the world’s scale.\nThere was a valley along a dead, dry river. All soil had been stripped from the land by some bored deity, and the bedrock had then been chiseled into tunnels and spires, a maze for the wind. Low, shuddering groans and high sounds that yearned to become music played around us there. Haunting murmurs and keening whistles accompanied every scene. It was easy to portray Juusli’s essential loneliness in this land that mourned for itself.\nOnce I looked up from the action of one of these scenes and saw to my surprise that tears fell from Amma’s eyes. When she signaled an end to the session, I followed her to the other edge of the plateau we worked upon. As we walked she seemed oblivious to me, but reaching the drop-off she stopped and called me to her.\nHer tears left starry trails on her indigo skin, shining like her hyalescent hair. “Your performance is quite moving, Shiomah,” she told me in a low, steady voice. “I am proud.” So was I, for the scene just completed had been rather difficult. Juusli was struggling with the ghosts of her dead selves as they urged her to fling herself to another death. The difficulty lay in creating the physical impression of resistance while wrestling with the air. Departing from her usual procedure, Amma had chosen to screen-animate these devils after the recording, rather than manufacture bioservs which would only be demolished during their plunge into the canyon below. I was glad to have met this challenge so well, but I didn’t think Amma cried for joy in my competence. I waited and hoped for an explanation.\nInstead she asked, “If I were to assure you, Shiomah, that you would be given immortality if only you jumped over the edge of this plateau, would you do it?”\nI thought of my mother, tossed high into the air, dead, no doubt, before she hit the ground. “No.” I paused, weighing my position. “Of course I would have to, if you commanded me to, wouldn’t I?”\n“But you have already answered my question,” she stated, dismissing mine. “Here is another. If I asked you to throw me down there, would you?” I started to speak, but she continued. “If I did not tell you to, but asked, with no authority.”\nI could not picture autocratic, arbitrary Amma with no authority, though I tried. “What would become of me, if I did?” I inquired.\nMy mistress laughed, all melancholy suddenly gone from her manner. “You funny thing! So selfish, so practical. Never mind. I will not ask you to kill me, for you would surely find it an annoying task.” Taking my hand, she returned with me to the others.\nA later sequence was recorded on Nyglu’s estate. Before his current obsession took hold of him, Nyglu had been fascinated with the order of amphibians, as his personal appearance showed. Perhaps this is why mortals associated him with rivers, and with fresh water in general. He certainly associated himself with it. Pools, bogs, swamps, and wet places of all sorts made up the bulk of his “grounds.” When we visited he still took great pride in showing the estate to his visitors, pointing out the particular species he had reconstructed from his studies. Some were immense and ugly, others small and subtle, effacing themselves into the dark, decaying backdrop.\nThere were also experiments, whims come to life. My favorites were the triphibians, a sort of winged salamander. Mottled scarlet and sky blue, one came and perched briefly on my arm then skimmed away. Seeing my delight, Nyglu hatched three eggs for me, and I spent my free time feeding and observing the larvae. Soon I had tame triphibians of my own, but I had to leave them behind when we went to the moon. Nyglu promised that they would be mine again when we returned.\nThe dryad was packed away in her trunk, and we coptered off to meet Amma’s sky shuttle. Weyando stayed behind; his character, Jez, didn’t appear in the final scenes. As we floated away from the world, its immensity was belittled.\nWe spent a long time in orbit because of a hitch in the preparations for our landing. An ancient resort on the moon’s surface was to have been restored to habitability without destroying the period flavor of the setting. Some too authentic material used in the repairs had ruptured and released most of the complex’s air. The old oxygen machines below the surface had long since been dismantled, and regular flights to and from Earth had stopped decades ago, at the end of the last space craze. It was a couple of days before more air was brought up. Trouble arose, due, in part, to our long confinement on board the shuttle.\nIn preparing me for the profession she had chosen for me, that of acting roles in her creations, Amma had given me access to all sorts of old cubes and reels. After I used up all the sleep tapes, she even taught me to read; not pictos like mortal writing, but words composed of letters, like these. While examining some written antiquities during the delay, I learned with real shock that the Earth had once been almost literally covered with mortals.\nI ran to Amma in her cabin, craved to see her, was quickly admitted. What atrocity, I demanded of my mistress, had reduced the mortal population fifty-thousand-fold? As I asked this, I actually clutched Amma’s elbow to stop her from turning away from me. She froze.\nI whipped my hand away, startled at what I had just done. I had tried to use force to press my will upon a divinity.\nBut when she again faced me, she was smiling. Sadly. As if she had expected this to happen, while at the same time hoping that it never would. As though I had pleased and pained her both, at once. “I will answer you, Shiomah,” she said, “but first I am going to show you something. Something I ought to have shown you long ago.” She extended her left hand.\nNot for the first time I noticed that the sides of her fingers and the edges of her palm were lined with numerous shining dots. “Activation of one of these circuits,” she told me, “will wipe out a selected memory in your brain. I have chosen your mother’s name.” She let this sink in, then went on.\n“Activation of a second will deprive you of the use of the centers of conscious volition. And the third,” she promised, “will prevent the operation of your autonomic systems. Do you understand me?”\nI nodded. “Yes, midam.”\n“Now. There was no disaster, no epidemic, no mass murder of mortals. The current population, my dear, is a result of time and care and thoughtful planning.” She made gestures with her hands like a prince in a story, dispensing coins to a crowd. “Birth control, ample food, lebensraum—the ancient fifty billion never had it so good.” I still had a lot to learn.\nIt was difficult after the revelation of these threats to reassume the role of Juusli, a character whose last motivation is fear. With relief I removed my pressure suit in the simulated vacuum of the closing act, the heroine succumbing to the hallucinatory call of dust sirens. It was an ambiguous ending, with Juusli unharmed, drifting away with the sirens (specially made bioservs, of course), leaving a sparkling trail of palpable looking dust.\nWhen we returned to Earth, Amma let me age again, though more slowly than mortals are accustomed to do. She used me in other, smaller works, or in the social games she played with the other gods. Sometimes she devoted her enormous energies to my training, sometimes she seemed merely to relax and enjoy my company. Her attentions were far from constant. I would be ignored for months, a year at a time, then taken up again without, apparently, a beat skipped.\nOne afternoon, when I had been with her nearly fifteen years, she fancied she would make love with me. My body was that of a fourteen-year-old, an awkward, pudgy beauty, but she was attracted. How can the gods ever tire of such pleasure?\nIn time our desire was heightened by a burgeoning love. My adoration was natural, inevitable even. I think I had only been waiting to release it until I received some sign from her.\nAs to why she loved me I can only say that not even mortal passions are easily subjected to analysis. Amma’s love was fierce—and ridiculous, on the face of it. I still had pimples, at times. My nose was too long. I thought perhaps she confused me with Juusli, the first character she had created for me.\nNo deity questioned Amma’s absorption with me. Such fascinations were not unheard of. Sometimes the infatuated god went as far as actually regrowing the mortal undeified, merely in faithful reduplication of the beloved original.\nThose foolish gods. They should have known that this would not be enough for Amma.\nShe contrived to have me conditioned into partial godhood while growing and then secretly disposing of the expected replacement. Immortality was given to me for as long as I can stand it, and the powers of the god machines were made mine.\nThe sins of my “mortal counterpart” were not visited upon the new Shiomah. Weyando’s eggson’s spermdaughter was again allowed into the circle of my influence. Others that I had alienated upon Amma’s instructions made me welcome in my new guise, with calls of congratulation and invitations to their estates. With all this obligatory gaiety, it was almost a year before we settled in again back on the island.\nAmma became more and more attentive. She involved me in the details of her creations, seeking advice on costume and dialogue for her daring depiction of a god in mortal disguise. I decided to have my rooms dismantled, as I spent nearly all my time in hers. Everything was packed away except the terminal when she came to me with her offer of marriage.\nI stared at her across the wide, bare floor. She was colored all turquoise, with hair like ethereal jade. She clashed horribly with what was left of the decor.\n“Well?” she asked, a little sharply. “Don’t you want to be my wife?”\n“Oh yes, yes Amma,” I managed to reply. Since being deified I no longer referred to my mistress as “midam.” “I do, I’ll be so happy, I’ll make you so happy, only I am very much surprised . . . ” I trailed off. I came towards her, one eye on the terminal’s screen. I did love her, and it meant so much to me to please her. She kissed the top of my head and clasped me to her.\n“You should be used to receiving surprises from me by now,” she said as she released me, smiling. “In time, you will grow accustomed to my ways, and come to find me quite boring, no doubt.”\nI shook my locks in vigorous dissent. “Never, no, never, Amma.” I took her hands in mine and kissed each sea-colored fingertip, saying “You are so sweet, so generous, so full of precious secrets—” I came to one of the little silver circles with which she controlled her underlings.\n“Oh, yes, that reminds me,” she said when I did not continue. “I almost forgot to tell you. I’m going to have those signals removed, those ones I told you about on the moon.” I met her eyes. They were dark, gravely serious in her expressive face.\n“The ones you said could erase my memory or destroy my nervous system?”\nShe nodded. “So. Now that you’ve consented to engage yourself to me, there’s no danger of those circuits ever being engaged.” She grinned, suddenly in an impish mood, and I perceived the pun (no pun at all in mortal speech) almost at the same time as I saw the call light blink on the com screen. Pretending to be disgusted with the lowness of her humor, I managed to shove her playfully through the door before she noticed the flashing signal.\nAs I had expected, it was Nyglu. His warty face showed satisfaction to my trained eyes. “I have the body,” he reported, “and the other arrangements are underway.”\n“Very good,” I told him. With the passage of time I had grown used to my deepening contact with Nyglu and the leverage it gave me. “Then you may count on my presence in your mudroom—” I hesitated. Amma had planned to leave for Nyglu’s estate this evening, but there was no telling when I’d be left alone there, now that we were betrothed. “Whenever I can come without Amma knowing,” I hastily amended. Nyglu looked like he wanted to protest, but to whom? Not to me. I switched off the screen and went looking for my mistress.\nWe were wed in a short but impressive ceremony aboard the ship Amma had been given by Weyando. I begged her to wear some form of clothing, and at last she compromised by causing her hair to cling to her nakedness, covering almost all the right places. By contrast, I was draped in fluttering, dune-colored fabrics designed to hide the tiny scars and other imperfections my body carried. True, we might have said that Amma had caused my replacement to be grown bearing these marks, but I desired to avoid explanations.\nThe wind sang in the rigging, our only choir. The sky, as ever in those latitudes, was a vaulted dome of blue. The child Lizore joined our hands as we pledged our love, “as long as its life continues.” After kissing one another’s eyelids, we turned to bestow our wedding gifts upon our guests, all of whom, at Amma’s insistence, were present.\nAs we passed among her friends and relatives, Amma made sketchy introductions to those I had not yet met. “Hayvre, Lizore’s eggmother,” she named one black, black woman who reached out to clasp my hand in one sporting two thumbs. “Elleefaw” was a tiny, shaggy, sexless looking god in spiked heels. I recognized the name as belonging to the deity of unpleasant truths.\n“He makes the best monuments. We used the Hill of Glass in my last piece, Elleefaw,” she said to the short, red-furred god. “It was perfect, especially the way it opens and closes like an eye.” Elleefaw nodded his approval of this tribute, running his own sharp eye up and down my pudgy awkwardness. I felt uneasy in his presence, and I wasn’t made more comfortable by the remark he made as he walked way. “Now you’ll each find out what the other is really like,” he announced over his shoulder, clip-clopping off across the deck. But surely we had learned all that in over twenty years?\nI was glad to see Nyglu, preferring his familiar strangeness to these upsetting new acquaintances. Our encounters had been curtailed since the betrothal, and he was glad to stay by my side when I asked him to, as a sort of buffer.\n“I don’t know why you couldn’t broadcast the ceremony like everyone else does,” he complained to us in a mildly fretful tone. “But I must admit that I am enjoying myself,” he added politely (and perhaps also to prevent Amma from detecting his morose jealousy).\nMy mistress hadn’t explained to me her reasons for an in-person celebration, but now she said, “This one isn’t for show. This one is going to last.” With a fond look she walked away from me, taking our glasses to be filled with the bright, frothy drink that was being served.\nStill disturbed by Elleefaw’s pronouncement, I was silent until Nyglu wondered out loud if anything was wrong. “Do you think everything will change now?” I asked him. I expected denial. His precarious happiness, his treasured times with me, would work to keep him from accepting the possibility of a different course in our lives.\nInstead, he shrugged, resigned. “Change,” Nyglu answered, “is Amma’s only constant.”\nFor several months after our marriage, all remained the same. I continued to work for Amma as before, to make furious or languid love with her, to study and transact my own business. I acquired islands, asteroids, and watersheds entirely my own, as well as other, less common commodities. Nyglu took care of this for me, with all the discretion I relied upon him for.\nThen Amma decided that we were going to have a child. The new Shiomah might have asked upon deification how gods were born. Perhaps Amma attributed my lack of curiosity on the subject to habits formed in earlier days. I could hardly tell her of my source. Instead, I massaged her hands, pulling and stroking her pale violet fingers as she recited the possibilities to the tower’s open ceiling, full of stars.\n“We can mate as mortals do,” she whispered, “or we can let machines do it for us. Two males can join genetic material, or two females. We can mate with ourselves or with those long dead. Just as soon as you’re ready,” she said, “we’ll start taking the enzymes that neutralize the sterilizing compounds.” She sighed as I dug into the fleshy mound beneath her thumb.\n“And then?” I asked. But in answer Amma held her hand to my mouth and brought mine in turn to her delicately nipping teeth. Her excitement at the thought of conception made further details impossible to come by until dawn.\nWhat Amma offered me was the opportunity to impose my genetic message over that of a microscopic animal. The animal would then be injected into a donated sperm cell, and the sperm cell would join with an egg of hers. This was fine with me; I leapt at the chance for another sort of immortality. Amma and I disagreed on only one important point; I wanted her to carry the baby in her own body. Even for just a short while. She would not; not even her innate love of the curious made pregnancy appealing to her.\nI offered to bear the child within my own body. She pointed out that to do so would endanger the lie we lived. “Only a mortal would allow itself to be invaded in such a manner,” she declared hotly. Anyway, what did it matter that our wombs were empty; we would still be mothers as the gods saw things.\nIt mattered to me.\nWeeks passed. I took to sulking in my old refuge, the brown and russet rooms I had occupied before our marriage. Gradually I brought the furnishings out of storage, determined to be comfortable in the midst of my self-imposed exile. I avoided Amma, keeping to my own apartments as much as possible.\nFinally she came to me, persuasive and proud. I slouched on my couch seat, not looking up as she lowered herself beside me.\n“Don’t pout, Shiomah,” she said, putting an arm around me. She laughed. “I could walk to Kimp Sinn on your lower lip.” That made me smile, but I quickly pretended that I never had.\n“Our ways are better, you will see,” she continued, coaxingly. Pale blue, she rested like a piece of sky on the brown slopes of my shoulders.\nI shook her arm off, standing up and walking away angrily. “Your ways? You have no ways. You do nothing except let things be done for you.” In the silence that followed I felt the presence of Elleefaw, happy that we did no better than he had expected.\n“Oh, Amma,” I said remorsefully, turning back to her again.\n“Why do you oppose my will?” She was displeased that I had a will, rather than a mere collection of childish whims, that I had walked away from her, that I stood and she sat. Seeing this, I knelt, thus allowing her to continue to be gracious.\n“Have I not treated you well, my dear?” she asked. Her fingers sought my hair, toyed with my tangles. “Have I not given you everything you ever desired, and more?” No, I thought, for my mother is gone, and you refuse to take her place. Deaf to my inner voice, Amma continued to talk of how she had spoiled me, ignorant of my deepening resolve.\n“So you must understand,” she concluded, “that it will be best for both of us if you yield to me in this.”\n“No,” I said, and her hand ceased fondling my locks. “If you make a child this way, it will be without my consent. You will have to kill me then, to keep me from confessing our crime.”\nShe stood, pushing me away from her. Her celestial face paled, a touch of cirrus in the sky. “You can’t mean it,” she said, quietly appalled. Bestowing immortality directly upon a mortal, as she had done, was inconceivable; the punishment for our deception would be of a kind with it. The gods are jealous.\n“But I do mean it,” I said, rising and meeting her eyes without wavering. “No machine or half-animal is going to carry our child, Amma, not while I live.”\nShe stared until she saw that I was in earnest. Then, for the first time in my life I experienced divine wrath. She stamped the floor with one lovely foot and clenched her fists in front of her angrily heaving breast. “You fool!” she shouted, purple smudging her pale blue cheeks. She laughed harshly, metallically, an untuned gamelon. “You funny, funny fool.” Then she activated the first of the three circuits she had shown me years ago as we orbited the moon and had, of course, never disabled.\nMy mother’s name is gone, removed from my mind and all my records. And the erasure is permanent and self-reinforcing. Even if someone told me what my mother was called, I would forget the sounds as soon as they were said. Even if I wrote her name here as it was spoken, I would forget it as soon as it was read.\nAmma is a capricious god, but thorough.\nBut shrewd as I am, I had made my preparations. Even as she was proving her remorse by destroying her other controls, I left and fled here.\nI do not know if she was fooled by the death of my double. Nyglu was careful, but perhaps she will discover that he hid it for me when she thought she’d had it destroyed.\nPerhaps she will not be deceived. Perhaps she will come and test my defenses. For all I can tell, though, she is even now working on another Shiomah, perhaps one just a little less hard-headed. I left her plenty of tissue samples.\nIt was foresight that made me search out this corner of the world, rich in plant life and rare minerals. It is mine through my efforts, and I have stocked it with my treasures. My horses, and cattle, and machines, and Fertility Manna. My plunder and purchases.\nAnd the men and women, my mortals. I will take very tender care of my little mortals. And they will bless the land in my name.\nOriginally published in Asimov's Science Fiction, March 2001.\nNisi Shawl wrote the 2016 Nebula finalist and Tiptree Honor novel Everfair, and the 2008 Tiptree Award-winning collection Filter House. In 2005 they co-wrote Writing the Other: A Practical Approach, a standard text on inclusive representation in the imaginative genres. Their stories have appeared in Analog and Asimov's magazines and many other publications. Shawl is a founder of the Carl Brandon Society and a Clarion West board member.", "source": "https://clarkesworldmagazine.com/shawl_10_17_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Shiomah's Land by Nisi Shawl"}