{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jacques Barcia", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VQfARmB0h4QTmkUNwNe+9tQOXVY=", "id": null, "license": null, "comments": "", "raw_text": "4010 words, short story  Salvaging Gods  Gorette found her second godhead buried under piles of plastic bottles, holy symbols, used toilet paper and the severed face of an avatar. No matter how much the scavengers asked, the people from Theodora just wouldn’t separate organic from non-biodegradable, from divine garbage. They threw out their used-up gods along with what was left of their meals, their burnt lamps, broken refrigerators, tires, stillborn babies and books of prayer in the trash can. And when the convoys carrying society’s leftovers passed through the town’s gates, some lazy bureaucrat would mark in a spreadsheet that another mountain was raised in that municipal sanitary landfill, the Valley of the Nephilim. And to hell with the consequences.  Her father says no dead god is dead enough that it can’t be remade on our own image. The old man can spend hours rambling about over-consumption, the gnostic crisis, the impact of all those mystical residues poisoning the soil and the underground streams, how children are born malformed and prone to mediunity, and how unfair it is that only the rich have access to miracles. People will do what’s more comfortable, not what’s best for everyone, he’d finally say. It’s far easier to buy new deities than try to reuse them. So he taught her how to recycle old gods and turn them into new ones, mostly, she believed, because he wanted to make a difference. Or maybe because he was the one true atheist left in the world.  It was a small one, that godhead, and not in a very good shape. Pale silver, dusty, scratched surface and glowing only slightly underneath the junk. At best, thought Gorette, it’d have only a few hundred lines of code she’d be able to salvage. Combined with some fine statues and pieces of altars she’d found early that morning, perhaps she’d be able to assemble one or two more deities to the community’s public temple at Saint Martin. The neighborhood she was raised in had only recently been urbanized, so that meant the place was not officially a slum anymore. But still, miracles were quite a phenomenon down in the suburbs.  “Hey, daddy. Found another one,” Gorette said, covering her eyes from the burning light of midday. “Can we go home now, please?”  The egg-shaped thing had the pulse of a dying heart, and fitted almost perfectly in her adolescent hand. So she arranged a place for it amongst the relics in her backpack, inside the folds of a ragged piece of loincloth, and into a beaten up thurible where it’d be safe enough to survive the hour-long ride back to the city.  Her father stood next to a marble totem, sweeping the field with a kirlian detector. The pillar was part of a discarded surround-sound system with speakers the size of his chest, and served as a landmark to the many scavengers exploring the waste dump. When he heard his daughter calling him, he took his gas mask off and said “That depends,” his low-toned voice coming like a sigh, tired. “Do you think this will do? We’re running out of code and there are many open projects in the lab.”  A plastic bag some ten yards away from her smelled of rotting flesh. Animal sacrifice, she knew, and the vultures seemed to have noticed that too. “Yeah,” she lied, “It’s a bit wasted, but I think it has a lot of good code in it. Never seen one of these, so I suppose it’s a quite new model.” She desperately needed to take that stink out of her body and today she hoped was water day. “Is it water day today, daddy?”  The old man picked up one last relic, a fang or something, and examined it close to his thick glasses. He nodded to the object and put it in a sac he carried tied to his waist. “No, it’s not. The Palace said three days ago that they’d reinforce the water gods cluster, so the suburb’s rationing would drop to two days. But of course that didn’t happen.” He finally walked to Gorette and scratched her dreadlocks, trying to smile. “Maybe you can build a water god with the godhead you found, huh?”  Gorette made her first wish that evening, after incubating some of the new godhead’s code in an altar of her own design. It was built out of the remains of a semi-defaced idol, a one-eyed marble bust wearing a tall orange hat, adorned with shattered crystals, split dragon horns, praying cords and barbed wire. That last bit just to make sure everything would stand in place. The godhead rested inside the same thurible Gorette used to cradle it safely back from the Valley of the Nephilim. But now the metal egg had dozens of acupuncture needles trespassing its shell, and every single one was linked to hair-thin optical fiber threads, shining with divine code, feeding with data a green phosphorus monitor.  Without warning. It just woke up.  When the loading bar hit one hundred per cent, the stone bust opened its one eye, fluidly, staring directly at her. She fell back from the chair, startled, and stared back at the thing’s physiognomy from where she stood. From the floor up.  It was her first attempt at a new design model, one that toyed with disharmony instead of symmetry. Profanity instead of divinity. Good hardware, her dad says, is as important as good code. But harmony. Harmony is the key. The problem is that new gods are coming with even more complex, specialized godheads, their kernels incompatible with older or malfunctioning holy paraphernalia. She decided to try out the new approach and, for her surprise, it worked.  “I want a fucking bath,” Gorette said, pointing a finger to the bust. “A warm bath. Now.”  The stone in the god’s crippled face moved like if it was made out of clay. Smooth. No, it moved like that stop-motion movie, what’s its name, the one that always airs on holidays and Friday evenings. The one dad just loves to watch when he’s back from the Valley.  “As you wish,” it said coldly.  A sound of streaming water echoed from the bathroom and almost instantly the smell of steam and soap and essential oils filled up the room. She grinned, and jumping over her feet ran towards the shower, undressing on her way. Is it lavender? Maybe birch. Arnica in the white cloud. She felt she was clean even before she could reach the shower, she felt the dirt collapsing, decanting on the floor before she could have a chance of laying on the tub and rest.  A bathtub. “A bathtub?”  She looked back at the one-eyed god running miracles in her room. “You made me a bathtub.” The idol remained still. She stood there for a few more seconds trying to figure out how her jury-rigged water god made her a complete bath, with a bathtub, aromatic oils and, now she saw it, the finest bathing gown. Collateral miracles were not unheard of, but modern godheads had filters to prevent the danger of leaking energy. Motionless, the god just kept staring forward, to nowhere in particular, its exposed wire guts transmitting magical pulses to the screen, blipping a green dot like the apparels in private hospitals, monitoring a wide-eyed comatose half-head, an undead, glitchy deity. Gorette felt like checking her complementary coding, but confessed to herself the hot pool of perfumed water was too tempting to be ignored. After all, feeling clean and relaxed she’d have more chances of debugging her creation.  That’s it. She immersed herself in the tub and let all her worries trail off, evaporate.  After the bathtub miracle, the god produced a new set of porcelain plates, when Gorette only commanded it to clean the dishes. Days later she asked for ice and got a refrigerator and a minibar. Then the thought of a nice meal generated spiced fish. And, one night, the sound of a calm, streaming river came as a lullaby. And rain cooled a hot day. And a smile painted watercolor on canvas. On and on, over the course of a week, her tiniest, involuntary wishes were fulfilled and as much as she tried, she couldn’t find the bug in the god’s code tree. Okay, after the tenth attempt, the effort to fix the problem wasn’t that strong-willed. But dad had taught her a bug could untap the power of a god, mollifying reality in its closer vicinity, causing the neighborhood’s divine networks to go haywire. It was dangerous, she knew.  She spent days and nights trying to fix it, trying to combine source codes distilled from newer godheads, but nothing seemed to work. She decided she’d destroy the thing before it’d cause her trouble.  A dead boy changed her mind.  It was Monday morning and Gorette swept the water god off her working bench into a big cardboard box laying on the floor. She just discarded it, trying not to think much about getting rid of her first creation. The thing fell inside the box, a stone punch enveloped in barbed wire. Gorette gave the god a last inspection and could see that the cold half-face was looking upwards from its new room. She met its gaze one last time and closed the box, decided to sell its parts in the market for whatever the merchants gave for it.  The girl picked up the box and went downstairs, hardly able to keep balance with the thing’s weight pushing her back and down. So heavy and so slowly she spent thirty minutes walking down the stairs, flight upon flight on a downward spiral to the first floor. She finally reached a smooth carpet under her feet and felt her strength renewed when she captured the smell of cinnamon tea being brewed in the kitchen. There was music playing and the house was calm and empty. Patchouli.  She walked to the door, the box in front of her, light in her arms and spirit. An awesome Sunday waited for her outside the house.  On her way out, she tripped over a gas mask resting face-down on the floor, but managed to jump on one foot and keep herself from falling. She kicked the mask off from her, startling the white tiger sleeping under the crystal table. Immediately, the giant cat clawed the mask with its tigery reflexes, making it spin and fall over its face, covering all of its beastly features but the lower jaw and its protruding fangs. A gas-masked albino tiger. Nothing can be cooler than that. Maybe a gas-masked cephalopod. No. Albino tiger is definitely cooler.  Outside, the day was perfect. The sun shone bright and there was the bluest, cloudless sky sheltering Saint Martin. The street was busy, the market was everywhere. Fresh bread, roses, dew. Birds, carts and horses on the march. The signal was red, so she stood close to a bald man reading the newspaper, waiting in line for his turn with the public god service. She overheard someone the first in the row, complain with the totem, why in fuck’s name you can’t cure eczema? It’s a damn fungus, damn it. Your credits have expired, answered a featureless voice. She felt sorry for the man, but couldn’t help but giggle. Next time, try boiling the river’s water. That fetid thing the Palace calls a river.  She turned in time to see the man walking away from the totem, down the street, right in her direction. His right cheek and part of his upper lip and nose was covered in a pink, moist blotch, a blistered wound shaped as a face, a somewhat familiar face that now she could see, as he approached, went down to his neck and into his shirt. She swallowed her giggle and wished the man could find a cure.  “As you wish.”  “What?”  Slo-mo time-warp, the air thick as a jar of glycerin. The man walked past her like the actors playing living statues in Gaiman Square. As he moved, she could see all the tiny blisters, the face-wound staring back at her. And as if someone had hit the rewind button, the eczema started to erode. Skin took back its space, first in the borders and then in spots inside the pink perimeter, holes forming eyes and a space like a mask, or mouth that seemed to say “Oh,” and then scream, wider and wider, until it completely disappeared, leaving nothing but an afterimage, a memory, a sensation.  “Did you see that?” Gorette turned to face the man next to her, a young guy wearing a ponytail, reading the newspaper. Like waking up from a deep dream, she looked down to the box in her arms and immediately dropped it to the ground. Her nails tore the cardboard walls and there it was, the god, face up, the way she put it back in her room.  The god in the box looked like it was engaged in silent battle with her. Face to face.  People walked past them on the sidewalk, the noises and colors and smells of Saint Martin coming back to her in a single torrent. Too many steps and the scent of flowers and wax, hooves clicking, and chantings, all around the street. A procession.  She turned once again, feeling dizzy, and saw the ocean of people and candles and garlands and, in the middle of the street, a huge bier with a coffin and a little altar, an undertaker god surely preparing the body, the grave and the costs for the burial. Around the altar, there were pictures of a kid, younger than her. The face of the corpse inside the coffin.  “A kid,” the words came out without her noticing.  She closed her mouth and locked it with both hands, closing her eyes not to think, not to think, not to think.  “As you wish,” and again, several yards away from her, like an echo, above the crowd, “as you wish.”  Five seconds passed before the bier’s conductor jumped from his seat, let go of the reins and climbed on the coffin. People noticed the man’s hurry and soon there was a commotion around the vehicle. People cried “help him out!” and “open the coffin!” and “my kid! He’s alive!” And now she could hear a stifled sound, a desperate knock-knock on wood coming from the depths of the underworld. There were relatives pushing the coffin’s lid, but damn those nails, the joiner that worked across the street rushed with a crowbar and soon was forcing the wood cover. Gorette’s heart was pounding, someone please open that coffin. Asyouwishasyouwishasyouwish.  Suddenly, the nails were fired off to the air, like a machine gun trying to shoot down the heavens. The whole wood box went down to splinters in a moment. The crowd went mad when the boy rose and took the cotton balls out of his nose.  “It was her!” Gorette heard someone cry behind her. “I saw it. She commanded the god to resurrect the boy.”  “No I didn’t,” she heard herself speaking as if the words came from someone else.  “Yes you did,” said a very low, calm, cold voice.  “No.”  Soon the crowd was all over her, praising her good deeds—as you wish—, calling her a saint—as you wish—,asking her for favors—as you wish—, raising her and her god above them, a new procession for the miracle of life, for the savior, ad majorem homo gloriam, for the Popess.  “As you wish,” she said, grinning.  Emissaries.  From other neighborhoods, from the Palace, from other cities.  They came in tides, high and low, high and low. They threatened and cajoled, but eventually ended up asking for something they needed to be done, some disease to be cured, another to be implanted, a hand to the their business, some virility, beauty, you name it.  One out of five diplomats demanded to know how she assembled her god. How the hell that thing could—  The truth was she didn’t know. She wish she did. And that seemed to be one of the few wishes her creature wasn’t able, or willing, to fulfill.  However, most penitents came asking for knowledge, for wisdom, for guidance. That, too, was out of her reach, out of her experience. But certainly not out of her god’s verbosity.  That marvel now standing on a totem in front of her throne, a foot lower than her, encased in crystal, half-faced and barbed-wired. For those who entered the temple and met her gaze, her features dominated the god placed only an inch below. But even if her eyes held a deep jade glare, it was the silver beacon of the godhead that really shone brighter. Like the moon.  “Speak,” she said.  “Most honorable Popess,” began a merchant in a golden tunic, shutting down his smartphone, “what’s the nature of true miracles?” The question raised a wave of murmurs in the hall. He was the fifth or sixth person consulting her that morning. “What are they made of? What makes your god able to perform such wonders, surpassing the capabilities of every other functional god in the realm?”  “I—,” began Gorette, the Popess, but that cold voice interrupted her speech. That behavior had become quite common in the public sessions lately and the people were beginning to question the Popess’ authority over the god.  “I can calculate reality at far superior floppage,” the god said. “My miracles per second rate is also higher than your average god. Also, my database—”  “It’s my will,” cut the Popess.  “No, it’s not,” replied the stone statue.  “Silence.”  “As you wish.”  The Popess dismissed the merchant with a wave of her hand. The man bowed slightly, obviously upset for not being answered. He turned and mixed himself with the rest of the crowd, other merchants, other tunics, men in coats and gas masks. “The session is over,” she said.  “Popess?” Already at the center of the court. Dirty overcoat and gas mask. She could smell filth in the wind, rotten oranges and oil. The man had a tiger, white as snow, chained to his wrist and it, too, wore a mask, and had a big box mounted on his back, covered by a red velvet coat. “Can I speak?”  The Popess was halfway through leaving the throne, but stopped and turned back to her seat. A green dazzle came from her eyes asking, who’s this man, do I know him? “What do you want from me?”  The man gave two steps ahead, dragging the chain, making the gas-masked albino tiger move and then lay. Nice and easy. “Actually,” he said, his voice covered by the mask, “I’d like to address your god.”  “It?”  “Me?”  “Yes, your Holiness. I want to question your creature,” said the stranger.  She was curious. She straightened herself in the throne, crossed her legs under the long robe and smiled, as if expecting entertainment, a show. “Okay. Go on. Let’s see what you’re gonna get from it.”  “In truth, there’s only one thing I’d like to ask it.” He moved forward and immediately the tiger raised and followed, both closer to the totem. The people gathered around the hall seemed to get closer, curious about what this masked stranger and his beast were up to. “I want you to tell me what’s the nature of God?”  “The nature of gods?”  “No. God.” So close now. His breath clouded the crystal case. “Gods are manifestations, constructs. They’re functions, myths, narratives. They’re tools. Limited, discardable, yet very spectacular tools. I want to know what’s the nature of God,” the man said.  A second passed before its marble lips moved. You could hear the silver sphere, the mighty godhead whirring, its core processing billions of code looking for an answer. Suddenly, the noise stopped. “God is unique. God wishes,” it said. “I am unique. I wish.”  Marble soldiers, flaming tigers, hydras and giant spiders materialized in the hall, as if coming onstage after opening reality’s invisible curtain. Panic took over the crowd in the room, a whirlwind of faces and tunics running, dissolving and exploding in gushes of blood and rot and desecration.  The Popess sank in her throne, reduced to her youth, her green eyes crystallized with fear.  The man under the mask refused to run and instead yelled at the crystal case. “Even a god found in a sanitary landfill, assembled from pieces of junk and designed by a very young, immature girl who didn’t even know what she wished for in her life?”  “Even so.”  “You’re not unique.” The stranger reached for the velvet cape over the tiger and pulled it from over the box. There was a crystal case with a marble god inside. A reused god. Design almost identical to that of the Popess’ own creation: a silver moon of a godhead pierced by tiny acupuncture needles, linked to a pedestal by fiber optic cables, tied with barbed wire and praying cords and a hat balanced atop a half-face, one-eyed, mouthless piece of avatar at its center. “Do you recognize it? I found it some ten meters away from you.”  The older god whirred. The soldiers and monsters charged towards the man and his own technomagical beast. He stood right where he was, but quickly typed shortcut commands to the god and the giant cat. When the creatures were close enough, the tiger attacked with a mighty leap, his claws hacking the monsters’ fire hides and carapaces.  But the man kept staring down at the god while the white feline defended their position. More creatures continued to condense into existence out of thin air. The tiger still managed to kill them, keeping the perimeter safe.  “I will destroy her,” the god said. “If I can give life, I can take it.”  “No, you won’t. And you can’t.” The Popess stood next to the god’s crystal case, staring at its single, immovable eye. “Dad once told me about the nature of God.” She got close, really close to the crystal case, as if trying to whisper into the god’s ear through the transparent wall. “He told me God is flawless.”  The blood-red white tiger circled the totem, pushing the soldiers back. Fast and precise as tigers are, he clawed the box, shattered the crystal to tiny bits, sent the stone face away to the floor along with its miraculous monsters. The thing fell hard, barbed wires, praying cords, tokens and fiber optic cables disassembling the holy design with the shock.  Gorette strode across the room at the destroyed god’s direction. It rested on the floor, close to the corpses of humans and miracles. She could see it tried to speak, its lips moving in a very familiar way. She decided not to give a damn about what the thing had to say. She picked up the silver godhead and looked deep into the god’s eye close to her feet. “God is flawless. But nothing, you hear me? Nothing is without flaw,” she said. “Now, shut down.”  “As you wish.”  At the Valley of the Nephilim, the god wishes it had arms. He wished he was a he, not an it, not a carcass in the filth, beneath the remains, in the mud. Die, worm, die. You chew my wires off, you reincarnate as a, as a, as a human. That. A human. A human.  A human.  A blip and another. Above ground. Steps coming closer. Another blip and an intense, acute sound. Like a blip, but never ending. Like a whistle.  “Guess there’s one here.”  Yes, there is. There’s one here.  Some light, then light and too much light.  “Here you are.”  A human.  “Yeah, it looks just like that other one.”  What? Not like any other. I’m the others. The others are me.  “Not sure. Will destroy it anyway.”  No.  “Come here.”  Pressure.  “Boy, you’re hard. Wish I had a hammer with me.”  As you—  “Oh, here it is,” said the girl. “This is what I call a force quit. Good bye, little one. Send my regards.”  Beat. Crash.  Silence.  Jacques Barcia is a weird fiction writer and technology reporter from Recife, Brazil. A non-practicing atheist, he likes to engage in theological fights with random people in the streets. He holds a professional record of 33-1-1. He can't defeat his wife, nor his three-year-old daughter. When he's not writing or blaspheming, he serves as the lead growler of grindcore band Rabujos.", "text": "4010 words, short story\nSalvaging Gods\nGorette found her second godhead buried under piles of plastic bottles, holy symbols, used toilet paper and the severed face of an avatar. No matter how much the scavengers asked, the people from Theodora just wouldn’t separate organic from non-biodegradable, from divine garbage. They threw out their used-up gods along with what was left of their meals, their burnt lamps, broken refrigerators, tires, stillborn babies and books of prayer in the trash can. And when the convoys carrying society’s leftovers passed through the town’s gates, some lazy bureaucrat would mark in a spreadsheet that another mountain was raised in that municipal sanitary landfill, the Valley of the Nephilim. And to hell with the consequences.\nHer father says no dead god is dead enough that it can’t be remade on our own image. The old man can spend hours rambling about over-consumption, the gnostic crisis, the impact of all those mystical residues poisoning the soil and the underground streams, how children are born malformed and prone to mediunity, and how unfair it is that only the rich have access to miracles. People will do what’s more comfortable, not what’s best for everyone, he’d finally say. It’s far easier to buy new deities than try to reuse them. So he taught her how to recycle old gods and turn them into new ones, mostly, she believed, because he wanted to make a difference. Or maybe because he was the one true atheist left in the world.\nIt was a small one, that godhead, and not in a very good shape. Pale silver, dusty, scratched surface and glowing only slightly underneath the junk. At best, thought Gorette, it’d have only a few hundred lines of code she’d be able to salvage. Combined with some fine statues and pieces of altars she’d found early that morning, perhaps she’d be able to assemble one or two more deities to the community’s public temple at Saint Martin. The neighborhood she was raised in had only recently been urbanized, so that meant the place was not officially a slum anymore. But still, miracles were quite a phenomenon down in the suburbs.\n“Hey, daddy. Found another one,” Gorette said, covering her eyes from the burning light of midday. “Can we go home now, please?”\nThe egg-shaped thing had the pulse of a dying heart, and fitted almost perfectly in her adolescent hand. So she arranged a place for it amongst the relics in her backpack, inside the folds of a ragged piece of loincloth, and into a beaten up thurible where it’d be safe enough to survive the hour-long ride back to the city.\nHer father stood next to a marble totem, sweeping the field with a kirlian detector. The pillar was part of a discarded surround-sound system with speakers the size of his chest, and served as a landmark to the many scavengers exploring the waste dump. When he heard his daughter calling him, he took his gas mask off and said “That depends,” his low-toned voice coming like a sigh, tired. “Do you think this will do? We’re running out of code and there are many open projects in the lab.”\nA plastic bag some ten yards away from her smelled of rotting flesh. Animal sacrifice, she knew, and the vultures seemed to have noticed that too. “Yeah,” she lied, “It’s a bit wasted, but I think it has a lot of good code in it. Never seen one of these, so I suppose it’s a quite new model.” She desperately needed to take that stink out of her body and today she hoped was water day. “Is it water day today, daddy?”\nThe old man picked up one last relic, a fang or something, and examined it close to his thick glasses. He nodded to the object and put it in a sac he carried tied to his waist. “No, it’s not. The Palace said three days ago that they’d reinforce the water gods cluster, so the suburb’s rationing would drop to two days. But of course that didn’t happen.” He finally walked to Gorette and scratched her dreadlocks, trying to smile. “Maybe you can build a water god with the godhead you found, huh?”\nGorette made her first wish that evening, after incubating some of the new godhead’s code in an altar of her own design. It was built out of the remains of a semi-defaced idol, a one-eyed marble bust wearing a tall orange hat, adorned with shattered crystals, split dragon horns, praying cords and barbed wire. That last bit just to make sure everything would stand in place. The godhead rested inside the same thurible Gorette used to cradle it safely back from the Valley of the Nephilim. But now the metal egg had dozens of acupuncture needles trespassing its shell, and every single one was linked to hair-thin optical fiber threads, shining with divine code, feeding with data a green phosphorus monitor.\nWithout warning. It just woke up.\nWhen the loading bar hit one hundred per cent, the stone bust opened its one eye, fluidly, staring directly at her. She fell back from the chair, startled, and stared back at the thing’s physiognomy from where she stood. From the floor up.\nIt was her first attempt at a new design model, one that toyed with disharmony instead of symmetry. Profanity instead of divinity. Good hardware, her dad says, is as important as good code. But harmony. Harmony is the key. The problem is that new gods are coming with even more complex, specialized godheads, their kernels incompatible with older or malfunctioning holy paraphernalia. She decided to try out the new approach and, for her surprise, it worked.\n“I want a fucking bath,” Gorette said, pointing a finger to the bust. “A warm bath. Now.”\nThe stone in the god’s crippled face moved like if it was made out of clay. Smooth. No, it moved like that stop-motion movie, what’s its name, the one that always airs on holidays and Friday evenings. The one dad just loves to watch when he’s back from the Valley.\n“As you wish,” it said coldly.\nA sound of streaming water echoed from the bathroom and almost instantly the smell of steam and soap and essential oils filled up the room. She grinned, and jumping over her feet ran towards the shower, undressing on her way. Is it lavender? Maybe birch. Arnica in the white cloud. She felt she was clean even before she could reach the shower, she felt the dirt collapsing, decanting on the floor before she could have a chance of laying on the tub and rest.\nA bathtub. “A bathtub?”\nShe looked back at the one-eyed god running miracles in her room. “You made me a bathtub.” The idol remained still. She stood there for a few more seconds trying to figure out how her jury-rigged water god made her a complete bath, with a bathtub, aromatic oils and, now she saw it, the finest bathing gown. Collateral miracles were not unheard of, but modern godheads had filters to prevent the danger of leaking energy. Motionless, the god just kept staring forward, to nowhere in particular, its exposed wire guts transmitting magical pulses to the screen, blipping a green dot like the apparels in private hospitals, monitoring a wide-eyed comatose half-head, an undead, glitchy deity. Gorette felt like checking her complementary coding, but confessed to herself the hot pool of perfumed water was too tempting to be ignored. After all, feeling clean and relaxed she’d have more chances of debugging her creation.\nThat’s it. She immersed herself in the tub and let all her worries trail off, evaporate.\nAfter the bathtub miracle, the god produced a new set of porcelain plates, when Gorette only commanded it to clean the dishes. Days later she asked for ice and got a refrigerator and a minibar. Then the thought of a nice meal generated spiced fish. And, one night, the sound of a calm, streaming river came as a lullaby. And rain cooled a hot day. And a smile painted watercolor on canvas. On and on, over the course of a week, her tiniest, involuntary wishes were fulfilled and as much as she tried, she couldn’t find the bug in the god’s code tree. Okay, after the tenth attempt, the effort to fix the problem wasn’t that strong-willed. But dad had taught her a bug could untap the power of a god, mollifying reality in its closer vicinity, causing the neighborhood’s divine networks to go haywire. It was dangerous, she knew.\nShe spent days and nights trying to fix it, trying to combine source codes distilled from newer godheads, but nothing seemed to work. She decided she’d destroy the thing before it’d cause her trouble.\nA dead boy changed her mind.\nIt was Monday morning and Gorette swept the water god off her working bench into a big cardboard box laying on the floor. She just discarded it, trying not to think much about getting rid of her first creation. The thing fell inside the box, a stone punch enveloped in barbed wire. Gorette gave the god a last inspection and could see that the cold half-face was looking upwards from its new room. She met its gaze one last time and closed the box, decided to sell its parts in the market for whatever the merchants gave for it.\nThe girl picked up the box and went downstairs, hardly able to keep balance with the thing’s weight pushing her back and down. So heavy and so slowly she spent thirty minutes walking down the stairs, flight upon flight on a downward spiral to the first floor. She finally reached a smooth carpet under her feet and felt her strength renewed when she captured the smell of cinnamon tea being brewed in the kitchen. There was music playing and the house was calm and empty. Patchouli.\nShe walked to the door, the box in front of her, light in her arms and spirit. An awesome Sunday waited for her outside the house.\nOn her way out, she tripped over a gas mask resting face-down on the floor, but managed to jump on one foot and keep herself from falling. She kicked the mask off from her, startling the white tiger sleeping under the crystal table. Immediately, the giant cat clawed the mask with its tigery reflexes, making it spin and fall over its face, covering all of its beastly features but the lower jaw and its protruding fangs. A gas-masked albino tiger. Nothing can be cooler than that. Maybe a gas-masked cephalopod. No. Albino tiger is definitely cooler.\nOutside, the day was perfect. The sun shone bright and there was the bluest, cloudless sky sheltering Saint Martin. The street was busy, the market was everywhere. Fresh bread, roses, dew. Birds, carts and horses on the march. The signal was red, so she stood close to a bald man reading the newspaper, waiting in line for his turn with the public god service. She overheard someone the first in the row, complain with the totem, why in fuck’s name you can’t cure eczema? It’s a damn fungus, damn it. Your credits have expired, answered a featureless voice. She felt sorry for the man, but couldn’t help but giggle. Next time, try boiling the river’s water. That fetid thing the Palace calls a river.\nShe turned in time to see the man walking away from the totem, down the street, right in her direction. His right cheek and part of his upper lip and nose was covered in a pink, moist blotch, a blistered wound shaped as a face, a somewhat familiar face that now she could see, as he approached, went down to his neck and into his shirt. She swallowed her giggle and wished the man could find a cure.\n“As you wish.”\n“What?”\nSlo-mo time-warp, the air thick as a jar of glycerin. The man walked past her like the actors playing living statues in Gaiman Square. As he moved, she could see all the tiny blisters, the face-wound staring back at her. And as if someone had hit the rewind button, the eczema started to erode. Skin took back its space, first in the borders and then in spots inside the pink perimeter, holes forming eyes and a space like a mask, or mouth that seemed to say “Oh,” and then scream, wider and wider, until it completely disappeared, leaving nothing but an afterimage, a memory, a sensation.\n“Did you see that?” Gorette turned to face the man next to her, a young guy wearing a ponytail, reading the newspaper. Like waking up from a deep dream, she looked down to the box in her arms and immediately dropped it to the ground. Her nails tore the cardboard walls and there it was, the god, face up, the way she put it back in her room.\nThe god in the box looked like it was engaged in silent battle with her. Face to face.\nPeople walked past them on the sidewalk, the noises and colors and smells of Saint Martin coming back to her in a single torrent. Too many steps and the scent of flowers and wax, hooves clicking, and chantings, all around the street. A procession.\nShe turned once again, feeling dizzy, and saw the ocean of people and candles and garlands and, in the middle of the street, a huge bier with a coffin and a little altar, an undertaker god surely preparing the body, the grave and the costs for the burial. Around the altar, there were pictures of a kid, younger than her. The face of the corpse inside the coffin.\n“A kid,” the words came out without her noticing.\nShe closed her mouth and locked it with both hands, closing her eyes not to think, not to think, not to think.\n“As you wish,” and again, several yards away from her, like an echo, above the crowd, “as you wish.”\nFive seconds passed before the bier’s conductor jumped from his seat, let go of the reins and climbed on the coffin. People noticed the man’s hurry and soon there was a commotion around the vehicle. People cried “help him out!” and “open the coffin!” and “my kid! He’s alive!” And now she could hear a stifled sound, a desperate knock-knock on wood coming from the depths of the underworld. There were relatives pushing the coffin’s lid, but damn those nails, the joiner that worked across the street rushed with a crowbar and soon was forcing the wood cover. Gorette’s heart was pounding, someone please open that coffin. Asyouwishasyouwishasyouwish.\nSuddenly, the nails were fired off to the air, like a machine gun trying to shoot down the heavens. The whole wood box went down to splinters in a moment. The crowd went mad when the boy rose and took the cotton balls out of his nose.\n“It was her!” Gorette heard someone cry behind her. “I saw it. She commanded the god to resurrect the boy.”\n“No I didn’t,” she heard herself speaking as if the words came from someone else.\n“Yes you did,” said a very low, calm, cold voice.\n“No.”\nSoon the crowd was all over her, praising her good deeds—as you wish—, calling her a saint—as you wish—,asking her for favors—as you wish—, raising her and her god above them, a new procession for the miracle of life, for the savior, ad majorem homo gloriam, for the Popess.\n“As you wish,” she said, grinning.\nEmissaries.\nFrom other neighborhoods, from the Palace, from other cities.\nThey came in tides, high and low, high and low. They threatened and cajoled, but eventually ended up asking for something they needed to be done, some disease to be cured, another to be implanted, a hand to the their business, some virility, beauty, you name it.\nOne out of five diplomats demanded to know how she assembled her god. How the hell that thing could—\nThe truth was she didn’t know. She wish she did. And that seemed to be one of the few wishes her creature wasn’t able, or willing, to fulfill.\nHowever, most penitents came asking for knowledge, for wisdom, for guidance. That, too, was out of her reach, out of her experience. But certainly not out of her god’s verbosity.\nThat marvel now standing on a totem in front of her throne, a foot lower than her, encased in crystal, half-faced and barbed-wired. For those who entered the temple and met her gaze, her features dominated the god placed only an inch below. But even if her eyes held a deep jade glare, it was the silver beacon of the godhead that really shone brighter. Like the moon.\n“Speak,” she said.\n“Most honorable Popess,” began a merchant in a golden tunic, shutting down his smartphone, “what’s the nature of true miracles?” The question raised a wave of murmurs in the hall. He was the fifth or sixth person consulting her that morning. “What are they made of? What makes your god able to perform such wonders, surpassing the capabilities of every other functional god in the realm?”\n“I—,” began Gorette, the Popess, but that cold voice interrupted her speech. That behavior had become quite common in the public sessions lately and the people were beginning to question the Popess’ authority over the god.\n“I can calculate reality at far superior floppage,” the god said. “My miracles per second rate is also higher than your average god. Also, my database—”\n“It’s my will,” cut the Popess.\n“No, it’s not,” replied the stone statue.\n“Silence.”\n“As you wish.”\nThe Popess dismissed the merchant with a wave of her hand. The man bowed slightly, obviously upset for not being answered. He turned and mixed himself with the rest of the crowd, other merchants, other tunics, men in coats and gas masks. “The session is over,” she said.\n“Popess?” Already at the center of the court. Dirty overcoat and gas mask. She could smell filth in the wind, rotten oranges and oil. The man had a tiger, white as snow, chained to his wrist and it, too, wore a mask, and had a big box mounted on his back, covered by a red velvet coat. “Can I speak?”\nThe Popess was halfway through leaving the throne, but stopped and turned back to her seat. A green dazzle came from her eyes asking, who’s this man, do I know him? “What do you want from me?”\nThe man gave two steps ahead, dragging the chain, making the gas-masked albino tiger move and then lay. Nice and easy. “Actually,” he said, his voice covered by the mask, “I’d like to address your god.”\n“It?”\n“Me?”\n“Yes, your Holiness. I want to question your creature,” said the stranger.\nShe was curious. She straightened herself in the throne, crossed her legs under the long robe and smiled, as if expecting entertainment, a show. “Okay. Go on. Let’s see what you’re gonna get from it.”\n“In truth, there’s only one thing I’d like to ask it.” He moved forward and immediately the tiger raised and followed, both closer to the totem. The people gathered around the hall seemed to get closer, curious about what this masked stranger and his beast were up to. “I want you to tell me what’s the nature of God?”\n“The nature of gods?”\n“No. God.” So close now. His breath clouded the crystal case. “Gods are manifestations, constructs. They’re functions, myths, narratives. They’re tools. Limited, discardable, yet very spectacular tools. I want to know what’s the nature of God,” the man said.\nA second passed before its marble lips moved. You could hear the silver sphere, the mighty godhead whirring, its core processing billions of code looking for an answer. Suddenly, the noise stopped. “God is unique. God wishes,” it said. “I am unique. I wish.”\nMarble soldiers, flaming tigers, hydras and giant spiders materialized in the hall, as if coming onstage after opening reality’s invisible curtain. Panic took over the crowd in the room, a whirlwind of faces and tunics running, dissolving and exploding in gushes of blood and rot and desecration.\nThe Popess sank in her throne, reduced to her youth, her green eyes crystallized with fear.\nThe man under the mask refused to run and instead yelled at the crystal case. “Even a god found in a sanitary landfill, assembled from pieces of junk and designed by a very young, immature girl who didn’t even know what she wished for in her life?”\n“Even so.”\n“You’re not unique.” The stranger reached for the velvet cape over the tiger and pulled it from over the box. There was a crystal case with a marble god inside. A reused god. Design almost identical to that of the Popess’ own creation: a silver moon of a godhead pierced by tiny acupuncture needles, linked to a pedestal by fiber optic cables, tied with barbed wire and praying cords and a hat balanced atop a half-face, one-eyed, mouthless piece of avatar at its center. “Do you recognize it? I found it some ten meters away from you.”\nThe older god whirred. The soldiers and monsters charged towards the man and his own technomagical beast. He stood right where he was, but quickly typed shortcut commands to the god and the giant cat. When the creatures were close enough, the tiger attacked with a mighty leap, his claws hacking the monsters’ fire hides and carapaces.\nBut the man kept staring down at the god while the white feline defended their position. More creatures continued to condense into existence out of thin air. The tiger still managed to kill them, keeping the perimeter safe.\n“I will destroy her,” the god said. “If I can give life, I can take it.”\n“No, you won’t. And you can’t.” The Popess stood next to the god’s crystal case, staring at its single, immovable eye. “Dad once told me about the nature of God.” She got close, really close to the crystal case, as if trying to whisper into the god’s ear through the transparent wall. “He told me God is flawless.”\nThe blood-red white tiger circled the totem, pushing the soldiers back. Fast and precise as tigers are, he clawed the box, shattered the crystal to tiny bits, sent the stone face away to the floor along with its miraculous monsters. The thing fell hard, barbed wires, praying cords, tokens and fiber optic cables disassembling the holy design with the shock.\nGorette strode across the room at the destroyed god’s direction. It rested on the floor, close to the corpses of humans and miracles. She could see it tried to speak, its lips moving in a very familiar way. She decided not to give a damn about what the thing had to say. She picked up the silver godhead and looked deep into the god’s eye close to her feet. “God is flawless. But nothing, you hear me? Nothing is without flaw,” she said. “Now, shut down.”\n“As you wish.”\nAt the Valley of the Nephilim, the god wishes it had arms. He wished he was a he, not an it, not a carcass in the filth, beneath the remains, in the mud. Die, worm, die. You chew my wires off, you reincarnate as a, as a, as a human. That. A human. A human.\nA human.\nA blip and another. Above ground. Steps coming closer. Another blip and an intense, acute sound. Like a blip, but never ending. Like a whistle.\n“Guess there’s one here.”\nYes, there is. There’s one here.\nSome light, then light and too much light.\n“Here you are.”\nA human.\n“Yeah, it looks just like that other one.”\nWhat? Not like any other. I’m the others. The others are me.\n“Not sure. Will destroy it anyway.”\nNo.\n“Come here.”\nPressure.\n“Boy, you’re hard. Wish I had a hammer with me.”\nAs you—\n“Oh, here it is,” said the girl. “This is what I call a force quit. Good bye, little one. Send my regards.”\nBeat. Crash.\nSilence.\nJacques Barcia is a weird fiction writer and technology reporter from Recife, Brazil. A non-practicing atheist, he likes to engage in theological fights with random people in the streets. He holds a professional record of 33-1-1. He can't defeat his wife, nor his three-year-old daughter. When he's not writing or blaspheming, he serves as the lead growler of grindcore band Rabujos.", "source": "https://clarkesworldmagazine.com/barcia_10_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Salvaging Gods by Jacques Barcia"}