{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chang-Gyu Kim; Charles La Shure", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "w06ZifUccXS9XVlna1i3Yxh4Y6I=", "id": null, "license": null, "comments": "", "raw_text": "8400 words, novelette  Sentinel  As usual, and without any external stimulus, Jeong-chae opened his eyes. The first thing to come into view was the ceiling, which was made from lengths of wood that met at an angle to form a gable roof. The lumber had been just barely stripped of its bark with a plane, soaked in water, and then dried before being used as building material. It had not been painted at all. It was nature in its raw form, the ceiling of his very own house, but beneath it Jeong-chae felt no peace at all.  Restricting his movements to the bare minimum, Jeong-chae turned on his side. The hands of his sawtooth-gear-and-spring clock indicated 7:24. Beneath them, other numbers the size of a fingernail turned in mechanical fashion as well, letting him know the remaining life span of the clock. 428. The 8 had already turned back nearly halfway and looked like a zero with horns. 427 days from now, he would have to destroy this clock and build a new one. Coefficient of elasticity, friction, heat radiation. Words like these slipped quickly and instinctively through Jeong-chae’s mind.  He could not sleep anymore, but neither did he get up. He couldn’t yet. Jeong-chae lay still and traced the patterns on the surface of the wood with his eyes. The boundaries of the patterns were infinitely unclear. It looked as if someone had stirred up light and darkness together with a finger. He thought that he had seen a similar sight, similar patterns, in the dream that he’d been dreaming as he slept just a short while ago. He grasped stubbornly at these brief yet infinitely vague memories. If he had to put the flavor of the dream into words, he would say that it was one of longing—longing for a past that he had never once had a chance to experience. Old tales and ancient lives of which he had only heard stories. Of course, made-up stories always contained exaggerations and omissions—that was how they differed from reality—and dreams are a more powerful fiction than any story. Yet even bearing all of that in mind, he thought that the past must have been better than the present. Both common sense and all of his knowledge dictated that those long-ago days could not have been worse than now. If you traced back the history of any given knowledge, you could surmise what life must have been like when it was discovered. In that sense, it was certain that people of old must have experienced far more ease in their lives than now.  Ease?  As soon as the unfamiliar word occurred to him, it felt as if he had bitten down on a pebble in his rice. No one used this word anymore. If there were such a thing as a modern dictionary, the definition of “a calm or relaxed state of mind or attitude” would no doubt be found under “surplus,” and its antonym would be “waste.”  As Jeong-chae lay there lost in thought, he heard the brief but resonant sound of a bell from not too far away. It was the sound that told him it was 7:30 in the morning, and thus time to rise.  Even if he woke up before then, it was important that he leave his bed at the appointed time. Human body temperature dropped during sleep. When people woke up and became active, they generated heat as a result of exercise, returning their body temperature to normal. It was a small amount of heat, but the influence that its influx and outflux had on the world could not be ignored. Therefore, in order to prevent his body from radiating heat in vain, Jeong-chae had waited, thermally insulated blanket pulled up to his neck, for the bell to ring. If waste accumulated, ultimately the “sentinels” that protected their home from the distant annihilation would be put under excessive strain; the greater the strain was, the more rapidly doom would approach.  Only by following the rules could they extend life.  With the smallest of movements, Jeong-chae folded the blanket that had covered him and put it to one side. Then he looked at the column of mercury in the thermometer. The interior temperature was 17 degrees Celsius, which precisely matched his weekly budget. At this rate, it did not seem there would be any need to adjust his heat ration. Jeong-chae turned his gaze to the marble slab that he had leaned up against the wall in one corner of the room. The day’s schedule was written on it, using the black charcoal left after burning his firewood.  Inspect horizon/train trainee: 250 J Obtain lumber (24 x 40 x 200): 400 J Participate in vote: 80 J The first item on the list was related to Jeong-chae’s primary occupation. He was a sentinel technician who daily inspected the horizon, which was where the sentinels stood. All things considered, in terms of keeping this world intact, it was probably the single most important job there was. It was also a job that not just anyone could do. The number of people who properly understood thermodynamics and the operating principles of the sentinels, including Jeong-chae, numbered only 48. Should they lose even one technician, that space would need to be immediately filled by a replacement. For that reason, five reserve personnel were being trained. Today, Jeong-chae was scheduled to teach one of those people.  The second item on the list was related to Jeong-chae’s secondary job as a carpenter. There was no one in this world who didn’t understand what a serious and complicated matter it was to fell a single tree, so it was infrequent that he had to make new furniture or chairs. However, as in any home, regardless of how carefully you looked after something, it would eventually grow old and wear out, and furniture that had been used for so long that a leg broke could not be refurbished through simple repairs alone. Thus, while the demand for lumber was never great, it also never completely ceased.  There had been one time when he had felled an enormous number of trees all at once. The task had been too much to handle alone, so he had needed to get help from other workers. One couple had failed to manage their hearth properly, and their entire house had burned down. At that time, Jeong-chae and many others had needed to set aside their original tasks and move quickly. A rapid transfer of thermal energy had occurred due to the fire, oxides in the air had greatly increased, and the world’s atmosphere had roiled violently. Not only that, but they had to draw an unscheduled amount of water to spray onto the fire so that it would not spread. Naturally, the world’s yearly energy management plans were completely spoiled, and Jeong-chae had needed to adjust each and every one of the sentinels for which he was responsible. They’d also needed to build a new house and furnishings, at the very least, which meant they’d had to greatly revise the forestry management plan as well.  But the lumber needed this time was different. 24 x 40 x 200 was the size of a coffin. As far as Jeong-chae could remember, wood had not been used for this purpose in the last thousand years. Coffins were objects needed by dead people, and no one had died. Since the sentinels had begun to protect and maintain the world, there was only one reason for the population to decrease: those who had been excluded from the total aggregate of the world’s population had walked on their own two feet past the sentinels and beyond the horizon of the world. Needless to say, these people never came back again: the horizon was the end of the world, after all. Thus, they had not needed coffins, since, in point of fact, they hadn’t died. But this time the situation was quite out of the ordinary. It was clear that the individual in question would most likely be using a coffin. There was not a single person living in the world who doubted this. So it was that, over the past several days, people had met in the world’s only lounge, shared their opinions, and come to a conclusion. On the last day, Jeong-chae had stopped by the lounge long after the meeting had started. Sun-gyu, a doctor and a stonemason, not to mention a friend, had summarized for him the decision they had reached. After hearing him out from start to finish, Jeong-chae had calmly agreed.  Sun-gyu had said, “So, make us the coffin. You know the amount of wood you’ll need, so let me know the results of your calculations. And you’ll adjust the sentinels, too, right?”  Jeong-chae had replied that he would. Their conversation had taken longer than expected, and the world council was soon over. When Jeong-chae had risen, Sun-gyu had put a hand on his shoulder and whispered to him, “Make sure the party in question doesn’t know.”  Jeong-chae had replied once again that he understood—though he’d thought it a rather pointless request to make—and left the lounge.  Now, today, he took out the two axes he would need to fell the trees for the coffin and placed them in his leather bag. Inspecting the sentinels and the horizon was his first priority, but since he did not have time to return home afterward, he had to take care of both jobs in a single trip. Jeong-chae recited to himself the total amount of energy he had available to use today, so that he wouldn’t forget it: 730 joules. If the felling of the trees turned out to be harder than expected, he would have to stop working before exceeding 730 joules and return the next day to finish the job. Otherwise, the stability of the world would no doubt be threatened.  Jeong-chae checked once again to make sure that all the fires in his house were out, and then he left for work.  Yeon-gyeong was waiting at the end of the world. She was one of the five trainees learning how to manage the sentinels. As Jeong-chae approached, she caught his eyes and nodded her head slightly in greeting. Jeong-chae returned the greeting and then immediately led the way to the nearest sentinel. This was the first time he had ever actually met Yeon-gyeong, but they had a lot of work to do that day, so there was no time to waste on pleasantries.  “How much energy have you been allotted for training?” he asked Yeon-gyeong as she followed along behind him.  Yeon-gyeong, who had just turned twenty and thus was about ten years his junior, answered, “100 joules.”  It wasn’t all that much. Seeing as it was her first day, Jeong-chae decided that he would just explain the situation to her in simple terms. While he was calculating the distribution of energy, the two of them arrived at their destination.  And so it was that Jeong-chae and Yeon-gyeong came to stand at the end of the world.  The boundary that divided the world from annihilation was not visible to the eye. No one knew exactly whether that boundary was a thin line or broad like a river. They did have some indicators, though: the sentinels. The sentinels stood in a line at a distance of four kilometers from each other, dividing their world from the abyss. There were no signs to warn people against going beyond them. The very act of making such signs would have been a waste of energy. Nonetheless, every single person in the world, even children who had just learned to speak, knew how wicked and deadly the act of recklessly crossing that boundary was. And as long as the sentinels operated normally, such a thing was impossible.  Jeong-chae came here every day to adjust the sentinels, and he often experienced for himself the chill and the emptiness that lay beyond the end of the world. When he touched his fingers to a sentinel control panel, the weight of annihilation, which stretched out from three paces before him to cover all of space except this world, was made evident to him. The sea of vacuum that grew endlessly colder and colder, beyond any scope that Jeong-chae could imagine, pressed down upon him, cruel and heavy. The lights that had filled the universe in days long gone had now lost their strength and remained only as cinders, unable to reach this “world” intact. Thus, only their afterglow dimly knocked against the walls of this world before inevitably crumbling into a slowly sloshing red fog, singing a dirge to mourn the end of all things.  Jeong-chae approached the first sentinel, wiped away some of the pale dust on it with one hand, and read the figure there.  -8.432  Taking into account the margin of error, this did not deviate from the expected figure. Jeong-chae turned his back on the sentinel and spoke to Yeon-gyeong.  “For energy’s sake, today I will just explain things on a common-sense level.”  Yeon-gyeong agreed, as if this were only natural.  Jeong-chae continued. “This little machine you see here, this is all that we can touch of the sentinel. Strictly speaking, this is not the sentinel, but only a control panel. One of the sentinel’s bodies is located near the sun, while the other is located near a black hole three lightyears from here. Our ancient ancestors drew energy from an adjacent universe. The composition of the particles that make up that universe is different from the ones that make up ours, so the energy had to be transformed in order to be used. But, as I’m sure you know, that universe and our universe were far older than our ancestors expected.”  Jeong-chae lowered his gaze. “We realized too late that we didn’t have that much time left. If we were to have a future, we would have to move to a different universe before our universe expanded to the point when all energy dissipated. However, in order to do that, we would need to research, develop, and produce over a long period of time. That would require an enormous amount of energy as well. After calculating, our ancestors concluded that there was insufficient energy to achieve that end. At first, there were many who refused to accept this conclusion, but ultimately everyone agreed. The only path left to us was to conserve as much as we could of what we had left and continue living, even if only for one more day.”  Yeon-gyeong raised her hand slightly and spoke. “I’m told that, long ago, when we only lived here on Earth, people who did not understand ecology and thermodynamic circulation wasted far too much energy. As a result, the earth was struck by warming and climate anomalies. Simply put, the whole universe is in that situation now, right?”  “You’re not wrong to think of it that way. Except for the fact that, back then, we still could have overcome the crisis, but now it is impossible.”  Yeon-gyeong pressed her thin lips tightly together and gave a slight shake of her head. Jeong-chae stepped away from the sentinel and looked out over her head, toward the world. Between the center of the world and the horizon outlined by the sentinels lay the relatively thin Forest of Oblivion. This was where Jeong-chae felled trees. Every time he cut down and chopped up a tree, he felt as if he were cutting another little bit away from the blindfold that protected the people of the world from the horror. The only people who ventured out beyond the forest were the sentinel technicians. After all, everyone simply wished to live as far as possible from annihilation, no matter how short that distance might be. The Forest of Oblivion absorbed sound, as it had always done, and with only the two of them around it was as quiet as could be. Jeong-chae lowered his voice a little more, thinking that it would be a waste of energy to speak loudly.  “The current population of the Earth is 2,458. Our world is a circle with a radius of 187 kilometers. In order to maintain this world, the sentinels are drawing on the last dregs of energy remaining in the universe. But—and I imagine you will know this considering your occupation—energy cannot just be drawn. If it does not circulate, then it cannot be generated, either. The sentinels can regulate that circulation between annihilation and this world; it is that process that you must maintain in the future. If the balance tips too far in one direction, we will be unable to control the sentinels. Then there will no longer be any distinction between this world and annihilation. Thus we must always adjust the input and output.”  Jeong-chae thought that he was focusing too much on theory, so he returned quickly to practicalities: “Every day, when the day’s work is finished, physicists, biologists, and food engineers calculate the amount of energy to be used and the amount of heat that will be produced the next day before giving those figures to us. It is on that basis that the 48 sentinel technicians, like myself, regulate the sentinels’ figures. Here, look.”  Jeong-chae took a leather scroll from his bag and carefully unfurled it. The surface was crammed with numbers written in soot mixed with oil. Yeon-gyeong took the scroll and peered closely at it for some time.  “Those are the results of the calculations I received yesterday. At the very bottom are the expected figures for the sentinels managed by each of the 48 technicians. We come out here and look for ourselves, and if the figures don’t match them, we make adjustments using those dials you see there. Actually, the really important part is how to manipulate those sixteen dials in order to get the figures we need . . . but I’ll explain that tomorrow. Doing it today would be too much for the amount of energy you’ve been budgeted.”  Yeon-gyeong was still staring at the scroll. As Jeong-chae watched her, he remembered something else.  “In general, you can set the sentinels to the figures given to you by the scholars, but there are times when you can’t. Therefore, it’s good for technicians to know how to do the calculations. Even if the whole universe is cooling down, there can still be tiny fluctuations. When that happens, if you know how to do the calculations you can react quickly in a crisis situation.”  Yeon-gyeong carefully rolled up the scroll and handed it back to Jeong-chae, asking, “This sentinel is currently at -8.432, right?”  “That’s right.”  “And you have to adjust it to -7.757?”  “Correct.”  Yeon-gyeong stood next to Jeong-chae and looked at the forest. “Unless my calculations are mistaken, the world is consuming too much energy right now. Beyond the limit of what can be allowed through regulation of the sentinels.”  Jeong-chae paused a moment before he replied. “That’s right.”  “Precisely the amount of energy needed by one person.”  Jeong-chae did not reply this time. Yeon-gyeong did not repeat herself. Jeong-chae picked up his bag and slung it over his shoulder. Judging by the speed of her mental arithmetic, Yeon-gyeong had the necessary qualities to be a sentinel technician, and this was sufficient instruction for one day.  “That’s enough for today. We’ve consumed exactly the correct amount of energy. Your next lesson is three days from now, right? I will teach you then how to actually adjust the sentinels—”  But Yeon-gyeong had absently turned her gaze, spotted something over Jeong-chae’s shoulder, and raised her voice in spite of herself. “What . . . what is that?”  Jeong-chae ignored her widening eyes and finished his sentence. “—so please be here at the same time.”  “Look at that! That shouldn’t be able to exist outside the world!”  Jeong-chae still did not turn to look. He knew that some technicians saw things “that should not be able to exist” out in the annihilation; indeed, he himself was one of them. But technicians did not speak openly about such things. If Yeon-gyeong became a technician, she, too, would come to understand this. But Jeong-chae did not want to speak these words with his own lips.  Yeon-gyeong was not only quick at mental arithmetic, she was also quick on the uptake.  “So . . . I’m not the only one who can see that. I’m right, aren’t I?” After asking once again, she spoke with a determined look on her face. “I’m not leaving until you tell me what it is.”  Threatening someone with a waste of energy was the rudest thing one could do. Jeong-chae sighed and turned to face the annihilation. Red light with a long wavelength was surging slowly, just as before, and spread far and wide like a cloud of mist. But there was a slightly more complex shape visible within it. Two short horizontal lines were shoulders, the longer lines bent at the same angle were two arms, and the wavy lines were hair. Two holes, soft but filled with fierce determination, were its eyes, and the object that opened and closed at regular intervals was a small mouth. It was something Jeong-chae had seen every three or four days for the past four years, but seeing it again caused an ache somewhere deep in his chest, as if he were being shaved with a carpenter’s plane. It felt just as it had the very first time he’d seen it.  The red-tinged Su-hyeon was saying something, there in the annihilation beyond the end of the world. Jeong-chae struggled to watch Su-hyeon as he answered Yeon-gyeong’s question.  “The face of the boundary between the world and annihilation is maintained solely by the power of the sentinels. But the difference between the two sides is not merely one of energy levels. As the universe gets older, its particles disintegrate. Our world prevents that artificially. In other words, matter outside our world is structured differently. Although it has never been definitively established, some of this matter is influenced by the brainwaves of those who draw near. So—”  Realization dawned on Yeon-gyeong’s face, and she interrupted him: “You don’t have to say any more.”  But Jeong-chae continued speaking. She was going to find out anyway, so it might not be bad idea to instruct her in advance, to ensure she did not get flustered while on the job.  “Sometimes, if a technician is thinking deeply about something, such a form can appear. That person there . . . that shape there is my wife. She was disabled, so four years ago she walked out into the annihilation. She consumed far more energy than a normal person, and yet she did less work, and thus it was said that she was accelerating the destruction of the world. So . . . ”  Jeong-chae tried to erase it from his mind, but the figure of his wife Su-hyeon kept appearing. No, he had the cause and effect backward: because he could not drive her from his mind, Su-hyeon kept appearing in the annihilation, trying to say something. Every time he saw her apparition, Jeong-chae begged her forgiveness.  I wanted to walk out there in your place, Su-hyeon. But they said that even if the energy I would have consumed remained, it still would not have been enough to offset the amount you consumed. And that if I went, there would be one less person who could work. But that was nothing more than a justification. I know. I should have gone out there with you. But I couldn’t. I shouldn’t have sent you out into the annihilation alone. It must be so cold and lonely out there.  I’m sorry. I’m so sorry.  Again, Jeong-chae had begged for her forgiveness. Yet the image of Su-hyeon grew no fainter. She remained in his mind just as she had the day before. And he knew that she would be there tomorrow, and the day after that as well.  “You need to know this, Yeon-gyeong. If you continue in this line of work, you might see something—or someone—out there in the annihilation. But as long as you remain in this world, you cannot refuse this job just because you don’t like that idea. You were chosen because you have the right qualities, and only by doing this job can we all keep surviving together. It is the job of the technicians to prevent the end of the world, even as they keep seeing Su-hyeon—as they keep seeing those people. You’d best prepare yourself for that in advance.”  Yeon-gyeong stared at the legless image of Su-hyeon as if she were engraving something in the depths of her heart, and at long last she turned her gaze toward the forest. Jeong-chae said that she could go. Yeon-gyeong quietly complied. She did glance backward a few times before they reached a narrow path through the Forest of Oblivion. When she did this, Jeong-chae gave her the kind of look a parent might give a child during a scolding, and it wasn’t until she disappeared completely into the forest that he began walking toward the next sentinel.  Chopping down the trees needed for the coffin was difficult. Some trees had already been designated for the purpose, so he didn’t have to spend all that much time choosing them. However, the trees contained more moisture than he had expected, and the blade of his ax did not sink in as deeply as he wanted. This suggested that the world’s water was not being regulated in accordance with the calculations. Jeong-chae made a mental note to report this to the environmental scholars as he moved the trees he had felled and split to the edge of the forest. According to his original plan, he was supposed to have brought them closer to his workshop, but doing so surely would have exceeded his energy allowance for the day. Jeong-chae ate a little bit of the salt he’d brought with him to replenish the sodium that had been excreted from his body, buttoned up his clothes to prevent the radiation of any more body heat, and then headed toward the lounge.  There were far more people gathered there than usual. With the exception of infants, children, and six adults, the entirety of the world’s population—2,458 people—was packed into the lounge. Jeong-chae wiped the sweat from his brow with a cotton cloth as he looked for a place to stand at the very back of the room. A man who had been standing by the door and counting the people as they came in gave a signal directing everyone’s attention toward the front.  The person who went up onto the platform to oversee the proceedings was familiar to Jeong-chae: it was Sun-gyu. Since there was no machine or anything like that to amplify his voice, Sun-gyu spoke as loudly as he could. As for the crowd of some two thousand people, thanks to their habit of not wasting energy, they helped matters by not making even the least bit of noise, so that they could hear him clearly. Thus, Jeong-chae could follow exactly what he was saying:  “My name is Kang Sun-gyu, and I was chosen by the drawing of straws. I will be handling the proceedings today. I am sure you all know that you have gathered here today for a vote. Before we take that vote, however, I will briefly explain the situation in which we find ourselves.  “There are a few crucial principles that we live by: that no one without authorization should touch a sentinel; that we should not approach the annihilation; that we should not exceed the energy allowed to us; that each person should calculate and adhere to their own energy allowance; that we must eliminate factors that upset the balance of heat. These principles come before any other values—because if we violate these principles, the world will immediately be faced with a crisis, and if that state persists for too long a period of time, the sentinels will be overloaded and our world will be destroyed.  “There are, following from these principles, some corollary rules as well. Everyone, with the exception of children, must have at least two occupations. It is said that this was not necessary a century ago, but the world has been greatly reduced in size since then, so according to our calculations this conclusion was unavoidable. No one gathered here today is an exception to this rule. Also, if at all possible, we should avoid discussion of the distant future. The most important thing right now is performing our labor day by day; worrying in advance about a tomorrow that is less bright will only have a negative effect on us. Of course, it would also be a waste of energy to worry.”  What Sun-gyu had said was so natural, yet it also simply summarized the operation of the world. Thus, almost everyone nodded in agreement.  “Though it is happening slowly, unfortunately the diminution of the world continues. In accordance with our rules, I will not talk about what might happen in the distant future. Yet no matter how many times we perform the calculations, and no matter how everyone here might restructure their lives, we have reached a point where a decision must be made. For those of you who have just turned twenty and thus only just earned the right to vote, I will speak simply and plainly. In a word, without fail there comes a time when we must reduce our population in order to maintain the world.  “This is the way of the world—that is, the law of nature. There is surely nobody here who wants to reduce our population. However, if we take into consideration the efficiency of the sentinels and the limitations of the world, this conclusion is unavoidable. Fortunately or not, we have clear standards for a situation like this. They are not arbitrary, but have been arrived at naturally, as the result of careful calculations. Some time ago, there was one who insisted that we must eliminate the person whose ratio of productive activity to energy consumption was the lowest, and, although there were some twists and turns along the way, in the end everyone agreed that this was sensible. Since then, this standard has held firm, and as a result we have come to the point where everyone here has gathered to vote.”  Jeong-chae noticed that Sun-gyu had deliberately not mentioned the name of the person who had suggested the principle. Most of the other people gathered there appeared to notice this as well. However, someone quickly and quietly raised a hand. Jeong-chae pushed himself up slightly from the wooden wall against which he had been leaning and peered over to see who it was. It was Yeon-gyeong, whom he had trained just that morning. Jeong-chae only then remembered that she was twenty.  Without any hint of hurry, Sun-gyu very calmly yielded the floor to her, saying, “The woman with her hand raised.”  Yeon-gyeong spoke out in a clear voice. “Are we really all gathered here now? There is someone that I myself know who is not in attendance.”  Sun-gyu replied without hesitation, as if he had foreseen such a question: “You are correct. I was just about to get to that. To eliminate the possibility of error, we gathered nine people, each experts in a different field, and had them calculate and then check their calculations three times. As a result, three people were chosen as the subjects of our vote today. These three individuals are elsewhere right now, and three others are staying with them, one with each, detaining them with a reasonable excuse. We plan to receive the ballots from these six people once everyone here has finished voting.”  Yeon-gyeong’s face hardened. Jeong-chae could see it even from where he was standing. Nonetheless, she replied, “Is this not unjust? As far as I know, in a vote—no, even in a trial—suspects are granted the opportunity to speak in their own defense. If we continue like this, then even a trial would be less . . . ”  Yeon-gyeong stammered, unable to find the right word, but Sun-gyu supplied it for her.  “You may be right,” he said. “It may be that what is taking place here today is not a vote but an act even more cruel than a guilty verdict. I don’t know what to call it, either. Still, we must not be mistaken. We are not—to use an old term—jurors gathered here to convict a suspect. We are gathered here to decide who should be chosen among three individuals for whom the results of our calculations are barely different. There is a margin of error, after all. We need to consider how much they participate in the productive activities needed for food, shelter, and clothing, how much energy they consume in proportion to that—”  “But . . . ” Yeon-gyeong interrupted Sun-gyu once again.  Jeong-chae surmised that one of the subjects of the vote must be someone Yeon-gyeong knew personally. Jeong-chae had been in the same position four years earlier. If there was one difference, it was that there hadn’t even been a vote then. The person chosen in accordance with the traditional process for selecting a representative kept mentioning the greater good, saying that “we must sacrifice the few for the sake of the many,” and had proposed a candidate. Su-hyeon’s name had come up. Jeong-chae had stepped forward and declared that he would walk out into the annihilation in her stead. But his suggestion had not been accepted. Su-hyeon had been unable to move freely under her own power, and someone else would have had to give up that much of their productive activity to take care of her. The problem could not have been solved by Jeong-chae disappearing in her place.  “But a person’s value cannot be determined by calculations alone,” said Yeon-gyeong.  Jeong-chae thought there was something odd about that statement. Now, in this world, a person’s value was indeed determined by calculations. People with low energy efficiency were dangerous beings. Furthermore, the figures of the three candidates chosen as a result of the calculations were said to be more or less the same. Yet Yeon-gyeong was acting as if her acquaintance had already been chosen. Jeong-chae wondered if perhaps . . . and he quietly moved so that he could get a better look at her face. He hadn’t noticed that morning, but when he looked at her now there was something familiar about her. There was a resemblance to a face that Jeong-chae would never forget as long as he lived.  Sun-gyu spoke once again: “I do understand what you mean by that. It might even have been a valid principle long ago. But the world is different now. We have no choice but to deal only with values that can be reduced to numerical figures. We cannot look down from above and judge others, either. That’s not the kind of situation that we’re in. We’re merely numbers that consume yet another number known as energy. We cannot measure values that cannot be seen or touched, so we have no choice but to leave them out of the discussion. In fact, it is for this reason—because we have no need of any emotional appeals or defenses—that we did not bring the individuals in question here today, so we could avoid a commotion and reduce the amount of energy wasted on such things.”  Yeon-gyeong must have been rendered speechless, as she said nothing more. Jeong-chae wondered whether she might flee the lounge, but she stayed right where she was.  “If there are no further questions or objections,” Sun-gyu said, “then let’s continue with the proceedings. It is, after all, nearing the time when we must go to sleep.”  Sun-gyu removed a cloth that had been covering a marble slab at the back of the platform. On it were inscribed the names of the three candidates and their numerical figures. One was an old man over the age of eighty; another had lost an arm and a leg to a falling rock. The last person was not very old at all, and his limbs and brain appeared to be in perfect condition.  Jeong-chae immediately knew which one was Yeon-gyeong’s acquaintance. He also knew why he had seen something familiar in her face. And, finally, he knew why Yeon-gyeong had brought up those ancient arguments once more.  Sun-gyu began to explain the proceedings to the crowd. “The first candidate, Yi Hwan-yong, has difficulty moving normally now, due to old age and infirmity. The second candidate, Choe Ji-ung, is incapable of properly productive activity due to an unfortunate accident. The third candidate, Kim Gyeong-hwan, is unlike the previous two candidates in that he has no physical problems, but, unlike everyone else, he does not have two occupations, and he has refused to work two jobs in the future. Therefore, as the result of these calculations for these three individuals are nearly identical—”  Yeon-gyeong shot up from her seat. “Father is working at a farm in the north even now. It’s not true that he is not engaging in productive activity! And, on top of that, how is it that directing and supervising over two thousand people as their representative isn’t another occupation?”  Sun-gyu had no intention of preventing Yeon-gyeong from speaking, so he simply let her be. Everyone made as much of an effort as possible to prevent uncomfortable situations like that from arising during the vote, but the process served another function beyond the mere selection of an individual: it was also a ritual during which the friends and family of the one selected to walk out into the annihilation came to accept that this outcome was unavoidable. Now, in such a short time, Yeon-gyeong was traveling through that narrow and painful passage.  She seemed to feel something surge up within her and, suddenly unable to continue speaking, she began merely mumbling to herself. Sun-gyu, surely inwardly cursing his ill luck at having drawn the short straw, replied in a gentle voice:  “We have spoken with the three candidates, in accordance with the established procedures. The first two candidates have no means of improving their condition. Kim Gyeong-hwan is different, though. If he had willingly chosen two occupations, today’s vote would not have turned out this way. What was Kim Gyeong-hwan’s original occupation? He was a politician. In other words, Kim Gyeong-hwan is someone who is incapable of holding even a single specialized job in this world. Thus he must supplement his work with simple labor, and significantly heavy labor at that. If he were to accept the results of our calculations and actively participate in labor, then he would be able to contribute 1.4 times the productivity of his energy consumption. Had that been the case, we would have been forced to choose between the remaining two candidates.  “But Kim Gyeong-hwan has rejected this. He has contributed a great deal to the world as a leader, he argues, so shouldn’t that offset his consumption? He also claims that while he can farm as a pastime, he cannot do dirty work like sewage treatment. Such work, he claims, is for ordinary people. Therefore, we have come together today to vote.”  Jeong-chae could not forget that name, Kim Gyeong-hwan. In the measure he had put forward, there had been the so-called “greater good.” Yet Jeong-chae could not shake the thought that what had thrown his wife Su-hyeon out into the annihilation was the decision made by their leader, Kim Gyeong-hwan. It was Kim who had insisted that, in order for the normal people to live, they must first send away the disabled, who consumed even more energy than normal. His conclusion was not so different from what Sun-gyu had just said: send away those who are harmful to the maintenance of the world. Jeong-chae, and those who found themselves in similar circumstances, had offered a counter-argument: Where’s the harm? I’ve said that I will go instead, so why are you stopping me?  Jeong-chae knew, though, that he had failed to drive straight to the heart of the matter: Why is it all of you who get to decide? Are you not using fear to try to eliminate whomever you wish? That’s what he should have said. But he had been unable to do it at the time, and so he remained here in this world while Su-hyeon remained only in his memory and his guilt, swaying like a legless ghost in the dark red light of the annihilation. In this way, the world’s people sympathized with each other’s circumstances or pretended not to see them, living on as a community . . . but politicians were different. Even though the world had shrunk as much as it had, they tried to make themselves exceptions. At least, Kim Gyeong-hwan had been revealed to be such a person. He believed that he was worth more than others, even though he didn’t do any work at all, just because of his title as a representative.  “Anyone who is interested in the detailed calculations may freely come forward before the vote and check the figures written here. If you have any questions about them, please ask the scholars who are waiting at the rear. They will explain things to you as simply as possible. Oh, and please allow me to explain one more thing, just in case. The nine members of the team who carried out these calculations came to the conclusion that, with Kim Gyeong-hwan being the last of our policy-makers, we would not need any more such people in the future. The calculations have been carried out in accordance with the laws of nature. That is to say, that how much of what kind of work an individual can do, and what benefits they can enjoy, are decided by thermodynamics and the environment of our world. Unless we discover some fundamentally different truth and escape our current situation, this fact is unlikely to change.”  Jeong-chae half-recalled a dream of which he had forgotten all the details. Clearly the past had been better than now.  Sun-gyu moistened his lips before continuing. “Alright, then we should begin the vote, starting with those in the front. There are writing utensils in the voting booths, so all you have to do is write a number on the piece of wood you have been given. Anyone who does not participate will be considered to have abstained.”  A tumult broke out in the lounge as people began to talk loudly and get up from their seats. As he’d been standing in a corner, a short distance from the crowd, Jeong-chae was not swept up in the tide of bodies. He caught a glimpse of Yeon-gyeong moving in the opposite direction from everyone else, hurrying out of the room.  A second training session was scheduled for three days after the vote. As he stood beside a sentinel at the edge of the world, Jeong-chae supposed that Yeon-gyeong would not come. He checked the figures on the sentinel: -2.760. The heat transfer between the world and the annihilation had nearly reached equilibrium. Such a change was possible only because the world population had been reduced by one. Jeong-chae carefully adjusted the sixteen dials and accelerated ever so slightly the destruction of the neutrinos that existed within the annihilation. It was clear that, if he manipulated 32 more sentinels in this way, the world would become slightly more stable.  At least, for the time being.  Just as he was about to continue on to the next sentinel, Jeong-chae was startled by a movement in the corner of his eye, and he spun around. It was Yeon-gyeong standing there. She was even more haggard than the last time he’d seen her, and the shadows under her eyes were that much deeper, but Jeong-chae mentioned none of this. Wasting energy on pointless sympathy helped no one.  As Jeong-chae slipped his leather scroll into his bag, Yeon-gyeong said in a hoarse voice, “I guess you’ve finished fixing the first sentinel.”  Jeong-chae replied, “That’s right. We’ll have to go to the next sentinel if I’m to show you how to operate them.”  With that, he began to walk slowly. When one’s heart ached too much, jumping straight into one’s work was one way to soothe it. To be precise, one had to do this, if only to keep the world going. Their world had become so small now that there was no room for delays due to emotions. That’s how much the annihilation pressed in on them all.  Yeon-gyeong asked, “How much energy do you have to spare?”  Jeong-chae quickly performed the mental arithmetic. “About 20 joules.”  Yeon-gyeong nodded. “Can we sit for a moment before we go on?”  Without replying, Jeong-chae sat down. He placed his tool bag in his lap to prevent it from rolling down into the annihilation.  Yeon-gyeong sat down next to him. She lowered her head and then raised it again slowly, staring out at the edge of the hell that embraced the world in an orange glow. “While the vote was taking place, I ran to my father. I thought that if he changed his mind before the end, that it might change the situation as well. I told him that the world is a different place now. And that it would only become more different in the future. I even told him that this was not like him. Was there anything that he couldn’t do to keep on living? Just like everyone else? But he was the same as ever. He said that he was convinced he wasn’t wrong, that he’d lived his life according to his conviction, and that it would be better to die than to give that up. I asked him what this conviction was. He said it was that leaders are different from everyone else. That they are by no means equal. That those people who had chosen him but then later had abandoned him were cowardly traitors.”  Jeong-chae merely listened without any reaction, as unshakable as a slab of marble.  “So I tried another tack to persuade him. I asked him if he was fine with never seeing me again. With leaving me alone in this world. He hesitated for a brief moment. But then he became even more stubborn than before. He said that there were values even greater than affection. It was then that I realized: it didn’t matter how long we talked, we were never going to understand each other.”  Yeon-gyeong leaned toward Jeong-chae and rested her head on his shoulder. He felt her body trembling. She was holding back tears.  “I shouldn’t cry if I want to reduce heat radiation . . . In the end, he turned his back on even me . . . People came last night. They said they would bring him to the end of the world. They asked him if it wouldn’t be better for him to walk out on his own. But Father . . . Father said that he would never go. He asked who had given them the right to do it. They tried to persuade him, but it was no use . . . They brought me outside. For some time there was a commotion, and then everything went silent. Then they . . . they came out with a heavy coffin.”  Yeon-gyeong wept a little more, but then the violent emotion must have passed, as she sat up straight. Jeong-chae said nothing to comfort her, nor did he even place a hand on her shoulder. There was nothing that he could say.  “They must have known Father better than I did. That’s why they prepared the coffin in advance, and they must have also calculated the amount of resources that would be consumed by felling that many trees.”  It had, indeed, been Jeong-chae who had felled the trees, planed the boards, and driven in the nails to make the coffin. But he did not tell her this fact.  Even back in the days when energy had been abundant, leaders or representatives might not have really been necessary. If everyone had properly understood how the world turned, what was beneficial for only a few, and what would be harmful to the whole, then they might not have needed to choose representatives. It was not that difficult to live without them. However, people had chosen this lazy approach for the sake of a petty peace and to make their lives easier, and as a result they had left the decision-making to others. It was only now—now that the universe was dying—that they belatedly realized the truth: that leaders and representatives were poisonous mushrooms that grew thick in the cracks and crevices widened by indolence, and they were a waste of energy. Kim Gyeon-hwan ought to have been sent out of this world long ago. Had he been, then someone else could have lived longer.  Jeong-chae pondered all of this, but he said nothing to Yeon-gyeong.  Yeon-gyeong wiped her eyes with the sleeve of her undyed shirt and stood up. Then she looked out, not so surprised this time, and gazed at the form that maintained a minimum of order within the erratically shimmering annihilation. “Your wife . . . I heard what happened. It was my father who led the way in that decision, four years ago.”  Jeong-chae neither confirmed nor denied what she said, but simply lifted his eyes to look out at the translucent apparition of Su-hyeon. Even if one more person disappeared into the annihilation inside a coffin, even if the world had once more found a brief state of stability, even if no more leaders ever existed in the remaining history of humanity, Su-hyeon would remain there—within memory, within the red abyss, and within that cluster of particles. And she would eternally be opening and closing her mouth, as if she were speaking.  The two of them watched Su-hyeon for a while before leaving that place. They walked toward the next sentinel—to adjust it so that tomorrow, when they would have to rise once again at the appointed hour, could exist.  Throughout that day, Su-hyeon followed the two of them. But the apparition of Kim Gyeong-hwan never appeared. There was, after all, no one who missed him.    Originally published in Korean in Dokjaeja. (Seoul: Bbul, 2010.)  Published with the support of Literature Translation Institute of Korea (LTI Korea). Chang-Gyu Kim is a Korean science fiction writer. In 2005, he won Science-Technology Literature Award for \"Byulsang\" and has since won three other SF awards for \"Update\" (2014), \"Our Banished World\" (2016), and \"All the Amusement Park in the Universe\" (2017). \"Our Banished World\" was translated into English and published in Readymade Bodhisattva in 2019. His short fiction has been collected in two collections, Our Banished World and Samsara. Kim currently teaches Storytelling at a college.", "text": "8400 words, novelette\nSentinel\nAs usual, and without any external stimulus, Jeong-chae opened his eyes. The first thing to come into view was the ceiling, which was made from lengths of wood that met at an angle to form a gable roof. The lumber had been just barely stripped of its bark with a plane, soaked in water, and then dried before being used as building material. It had not been painted at all. It was nature in its raw form, the ceiling of his very own house, but beneath it Jeong-chae felt no peace at all.\nRestricting his movements to the bare minimum, Jeong-chae turned on his side. The hands of his sawtooth-gear-and-spring clock indicated 7:24. Beneath them, other numbers the size of a fingernail turned in mechanical fashion as well, letting him know the remaining life span of the clock. 428. The 8 had already turned back nearly halfway and looked like a zero with horns. 427 days from now, he would have to destroy this clock and build a new one. Coefficient of elasticity, friction, heat radiation. Words like these slipped quickly and instinctively through Jeong-chae’s mind.\nHe could not sleep anymore, but neither did he get up. He couldn’t yet. Jeong-chae lay still and traced the patterns on the surface of the wood with his eyes. The boundaries of the patterns were infinitely unclear. It looked as if someone had stirred up light and darkness together with a finger. He thought that he had seen a similar sight, similar patterns, in the dream that he’d been dreaming as he slept just a short while ago. He grasped stubbornly at these brief yet infinitely vague memories. If he had to put the flavor of the dream into words, he would say that it was one of longing—longing for a past that he had never once had a chance to experience. Old tales and ancient lives of which he had only heard stories. Of course, made-up stories always contained exaggerations and omissions—that was how they differed from reality—and dreams are a more powerful fiction than any story. Yet even bearing all of that in mind, he thought that the past must have been better than the present. Both common sense and all of his knowledge dictated that those long-ago days could not have been worse than now. If you traced back the history of any given knowledge, you could surmise what life must have been like when it was discovered. In that sense, it was certain that people of old must have experienced far more ease in their lives than now.\nEase?\nAs soon as the unfamiliar word occurred to him, it felt as if he had bitten down on a pebble in his rice. No one used this word anymore. If there were such a thing as a modern dictionary, the definition of “a calm or relaxed state of mind or attitude” would no doubt be found under “surplus,” and its antonym would be “waste.”\nAs Jeong-chae lay there lost in thought, he heard the brief but resonant sound of a bell from not too far away. It was the sound that told him it was 7:30 in the morning, and thus time to rise.\nEven if he woke up before then, it was important that he leave his bed at the appointed time. Human body temperature dropped during sleep. When people woke up and became active, they generated heat as a result of exercise, returning their body temperature to normal. It was a small amount of heat, but the influence that its influx and outflux had on the world could not be ignored. Therefore, in order to prevent his body from radiating heat in vain, Jeong-chae had waited, thermally insulated blanket pulled up to his neck, for the bell to ring. If waste accumulated, ultimately the “sentinels” that protected their home from the distant annihilation would be put under excessive strain; the greater the strain was, the more rapidly doom would approach.\nOnly by following the rules could they extend life.\nWith the smallest of movements, Jeong-chae folded the blanket that had covered him and put it to one side. Then he looked at the column of mercury in the thermometer. The interior temperature was 17 degrees Celsius, which precisely matched his weekly budget. At this rate, it did not seem there would be any need to adjust his heat ration. Jeong-chae turned his gaze to the marble slab that he had leaned up against the wall in one corner of the room. The day’s schedule was written on it, using the black charcoal left after burning his firewood.\nInspect horizon/train trainee: 250 J\nObtain lumber (24 x 40 x 200): 400 J\nParticipate in vote: 80 J\nThe first item on the list was related to Jeong-chae’s primary occupation. He was a sentinel technician who daily inspected the horizon, which was where the sentinels stood. All things considered, in terms of keeping this world intact, it was probably the single most important job there was. It was also a job that not just anyone could do. The number of people who properly understood thermodynamics and the operating principles of the sentinels, including Jeong-chae, numbered only 48. Should they lose even one technician, that space would need to be immediately filled by a replacement. For that reason, five reserve personnel were being trained. Today, Jeong-chae was scheduled to teach one of those people.\nThe second item on the list was related to Jeong-chae’s secondary job as a carpenter. There was no one in this world who didn’t understand what a serious and complicated matter it was to fell a single tree, so it was infrequent that he had to make new furniture or chairs. However, as in any home, regardless of how carefully you looked after something, it would eventually grow old and wear out, and furniture that had been used for so long that a leg broke could not be refurbished through simple repairs alone. Thus, while the demand for lumber was never great, it also never completely ceased.\nThere had been one time when he had felled an enormous number of trees all at once. The task had been too much to handle alone, so he had needed to get help from other workers. One couple had failed to manage their hearth properly, and their entire house had burned down. At that time, Jeong-chae and many others had needed to set aside their original tasks and move quickly. A rapid transfer of thermal energy had occurred due to the fire, oxides in the air had greatly increased, and the world’s atmosphere had roiled violently. Not only that, but they had to draw an unscheduled amount of water to spray onto the fire so that it would not spread. Naturally, the world’s yearly energy management plans were completely spoiled, and Jeong-chae had needed to adjust each and every one of the sentinels for which he was responsible. They’d also needed to build a new house and furnishings, at the very least, which meant they’d had to greatly revise the forestry management plan as well.\nBut the lumber needed this time was different. 24 x 40 x 200 was the size of a coffin. As far as Jeong-chae could remember, wood had not been used for this purpose in the last thousand years. Coffins were objects needed by dead people, and no one had died. Since the sentinels had begun to protect and maintain the world, there was only one reason for the population to decrease: those who had been excluded from the total aggregate of the world’s population had walked on their own two feet past the sentinels and beyond the horizon of the world. Needless to say, these people never came back again: the horizon was the end of the world, after all. Thus, they had not needed coffins, since, in point of fact, they hadn’t died. But this time the situation was quite out of the ordinary. It was clear that the individual in question would most likely be using a coffin. There was not a single person living in the world who doubted this. So it was that, over the past several days, people had met in the world’s only lounge, shared their opinions, and come to a conclusion. On the last day, Jeong-chae had stopped by the lounge long after the meeting had started. Sun-gyu, a doctor and a stonemason, not to mention a friend, had summarized for him the decision they had reached. After hearing him out from start to finish, Jeong-chae had calmly agreed.\nSun-gyu had said, “So, make us the coffin. You know the amount of wood you’ll need, so let me know the results of your calculations. And you’ll adjust the sentinels, too, right?”\nJeong-chae had replied that he would. Their conversation had taken longer than expected, and the world council was soon over. When Jeong-chae had risen, Sun-gyu had put a hand on his shoulder and whispered to him, “Make sure the party in question doesn’t know.”\nJeong-chae had replied once again that he understood—though he’d thought it a rather pointless request to make—and left the lounge.\nNow, today, he took out the two axes he would need to fell the trees for the coffin and placed them in his leather bag. Inspecting the sentinels and the horizon was his first priority, but since he did not have time to return home afterward, he had to take care of both jobs in a single trip. Jeong-chae recited to himself the total amount of energy he had available to use today, so that he wouldn’t forget it: 730 joules. If the felling of the trees turned out to be harder than expected, he would have to stop working before exceeding 730 joules and return the next day to finish the job. Otherwise, the stability of the world would no doubt be threatened.\nJeong-chae checked once again to make sure that all the fires in his house were out, and then he left for work.\nYeon-gyeong was waiting at the end of the world. She was one of the five trainees learning how to manage the sentinels. As Jeong-chae approached, she caught his eyes and nodded her head slightly in greeting. Jeong-chae returned the greeting and then immediately led the way to the nearest sentinel. This was the first time he had ever actually met Yeon-gyeong, but they had a lot of work to do that day, so there was no time to waste on pleasantries.\n“How much energy have you been allotted for training?” he asked Yeon-gyeong as she followed along behind him.\nYeon-gyeong, who had just turned twenty and thus was about ten years his junior, answered, “100 joules.”\nIt wasn’t all that much. Seeing as it was her first day, Jeong-chae decided that he would just explain the situation to her in simple terms. While he was calculating the distribution of energy, the two of them arrived at their destination.\nAnd so it was that Jeong-chae and Yeon-gyeong came to stand at the end of the world.\nThe boundary that divided the world from annihilation was not visible to the eye. No one knew exactly whether that boundary was a thin line or broad like a river. They did have some indicators, though: the sentinels. The sentinels stood in a line at a distance of four kilometers from each other, dividing their world from the abyss. There were no signs to warn people against going beyond them. The very act of making such signs would have been a waste of energy. Nonetheless, every single person in the world, even children who had just learned to speak, knew how wicked and deadly the act of recklessly crossing that boundary was. And as long as the sentinels operated normally, such a thing was impossible.\nJeong-chae came here every day to adjust the sentinels, and he often experienced for himself the chill and the emptiness that lay beyond the end of the world. When he touched his fingers to a sentinel control panel, the weight of annihilation, which stretched out from three paces before him to cover all of space except this world, was made evident to him. The sea of vacuum that grew endlessly colder and colder, beyond any scope that Jeong-chae could imagine, pressed down upon him, cruel and heavy. The lights that had filled the universe in days long gone had now lost their strength and remained only as cinders, unable to reach this “world” intact. Thus, only their afterglow dimly knocked against the walls of this world before inevitably crumbling into a slowly sloshing red fog, singing a dirge to mourn the end of all things.\nJeong-chae approached the first sentinel, wiped away some of the pale dust on it with one hand, and read the figure there.\n-8.432\nTaking into account the margin of error, this did not deviate from the expected figure. Jeong-chae turned his back on the sentinel and spoke to Yeon-gyeong.\n“For energy’s sake, today I will just explain things on a common-sense level.”\nYeon-gyeong agreed, as if this were only natural.\nJeong-chae continued. “This little machine you see here, this is all that we can touch of the sentinel. Strictly speaking, this is not the sentinel, but only a control panel. One of the sentinel’s bodies is located near the sun, while the other is located near a black hole three lightyears from here. Our ancient ancestors drew energy from an adjacent universe. The composition of the particles that make up that universe is different from the ones that make up ours, so the energy had to be transformed in order to be used. But, as I’m sure you know, that universe and our universe were far older than our ancestors expected.”\nJeong-chae lowered his gaze. “We realized too late that we didn’t have that much time left. If we were to have a future, we would have to move to a different universe before our universe expanded to the point when all energy dissipated. However, in order to do that, we would need to research, develop, and produce over a long period of time. That would require an enormous amount of energy as well. After calculating, our ancestors concluded that there was insufficient energy to achieve that end. At first, there were many who refused to accept this conclusion, but ultimately everyone agreed. The only path left to us was to conserve as much as we could of what we had left and continue living, even if only for one more day.”\nYeon-gyeong raised her hand slightly and spoke. “I’m told that, long ago, when we only lived here on Earth, people who did not understand ecology and thermodynamic circulation wasted far too much energy. As a result, the earth was struck by warming and climate anomalies. Simply put, the whole universe is in that situation now, right?”\n“You’re not wrong to think of it that way. Except for the fact that, back then, we still could have overcome the crisis, but now it is impossible.”\nYeon-gyeong pressed her thin lips tightly together and gave a slight shake of her head. Jeong-chae stepped away from the sentinel and looked out over her head, toward the world. Between the center of the world and the horizon outlined by the sentinels lay the relatively thin Forest of Oblivion. This was where Jeong-chae felled trees. Every time he cut down and chopped up a tree, he felt as if he were cutting another little bit away from the blindfold that protected the people of the world from the horror. The only people who ventured out beyond the forest were the sentinel technicians. After all, everyone simply wished to live as far as possible from annihilation, no matter how short that distance might be. The Forest of Oblivion absorbed sound, as it had always done, and with only the two of them around it was as quiet as could be. Jeong-chae lowered his voice a little more, thinking that it would be a waste of energy to speak loudly.\n“The current population of the Earth is 2,458. Our world is a circle with a radius of 187 kilometers. In order to maintain this world, the sentinels are drawing on the last dregs of energy remaining in the universe. But—and I imagine you will know this considering your occupation—energy cannot just be drawn. If it does not circulate, then it cannot be generated, either. The sentinels can regulate that circulation between annihilation and this world; it is that process that you must maintain in the future. If the balance tips too far in one direction, we will be unable to control the sentinels. Then there will no longer be any distinction between this world and annihilation. Thus we must always adjust the input and output.”\nJeong-chae thought that he was focusing too much on theory, so he returned quickly to practicalities: “Every day, when the day’s work is finished, physicists, biologists, and food engineers calculate the amount of energy to be used and the amount of heat that will be produced the next day before giving those figures to us. It is on that basis that the 48 sentinel technicians, like myself, regulate the sentinels’ figures. Here, look.”\nJeong-chae took a leather scroll from his bag and carefully unfurled it. The surface was crammed with numbers written in soot mixed with oil. Yeon-gyeong took the scroll and peered closely at it for some time.\n“Those are the results of the calculations I received yesterday. At the very bottom are the expected figures for the sentinels managed by each of the 48 technicians. We come out here and look for ourselves, and if the figures don’t match them, we make adjustments using those dials you see there. Actually, the really important part is how to manipulate those sixteen dials in order to get the figures we need . . . but I’ll explain that tomorrow. Doing it today would be too much for the amount of energy you’ve been budgeted.”\nYeon-gyeong was still staring at the scroll. As Jeong-chae watched her, he remembered something else.\n“In general, you can set the sentinels to the figures given to you by the scholars, but there are times when you can’t. Therefore, it’s good for technicians to know how to do the calculations. Even if the whole universe is cooling down, there can still be tiny fluctuations. When that happens, if you know how to do the calculations you can react quickly in a crisis situation.”\nYeon-gyeong carefully rolled up the scroll and handed it back to Jeong-chae, asking, “This sentinel is currently at -8.432, right?”\n“That’s right.”\n“And you have to adjust it to -7.757?”\n“Correct.”\nYeon-gyeong stood next to Jeong-chae and looked at the forest. “Unless my calculations are mistaken, the world is consuming too much energy right now. Beyond the limit of what can be allowed through regulation of the sentinels.”\nJeong-chae paused a moment before he replied. “That’s right.”\n“Precisely the amount of energy needed by one person.”\nJeong-chae did not reply this time. Yeon-gyeong did not repeat herself. Jeong-chae picked up his bag and slung it over his shoulder. Judging by the speed of her mental arithmetic, Yeon-gyeong had the necessary qualities to be a sentinel technician, and this was sufficient instruction for one day.\n“That’s enough for today. We’ve consumed exactly the correct amount of energy. Your next lesson is three days from now, right? I will teach you then how to actually adjust the sentinels—”\nBut Yeon-gyeong had absently turned her gaze, spotted something over Jeong-chae’s shoulder, and raised her voice in spite of herself. “What . . . what is that?”\nJeong-chae ignored her widening eyes and finished his sentence. “—so please be here at the same time.”\n“Look at that! That shouldn’t be able to exist outside the world!”\nJeong-chae still did not turn to look. He knew that some technicians saw things “that should not be able to exist” out in the annihilation; indeed, he himself was one of them. But technicians did not speak openly about such things. If Yeon-gyeong became a technician, she, too, would come to understand this. But Jeong-chae did not want to speak these words with his own lips.\nYeon-gyeong was not only quick at mental arithmetic, she was also quick on the uptake.\n“So . . . I’m not the only one who can see that. I’m right, aren’t I?” After asking once again, she spoke with a determined look on her face. “I’m not leaving until you tell me what it is.”\nThreatening someone with a waste of energy was the rudest thing one could do. Jeong-chae sighed and turned to face the annihilation. Red light with a long wavelength was surging slowly, just as before, and spread far and wide like a cloud of mist. But there was a slightly more complex shape visible within it. Two short horizontal lines were shoulders, the longer lines bent at the same angle were two arms, and the wavy lines were hair. Two holes, soft but filled with fierce determination, were its eyes, and the object that opened and closed at regular intervals was a small mouth. It was something Jeong-chae had seen every three or four days for the past four years, but seeing it again caused an ache somewhere deep in his chest, as if he were being shaved with a carpenter’s plane. It felt just as it had the very first time he’d seen it.\nThe red-tinged Su-hyeon was saying something, there in the annihilation beyond the end of the world. Jeong-chae struggled to watch Su-hyeon as he answered Yeon-gyeong’s question.\n“The face of the boundary between the world and annihilation is maintained solely by the power of the sentinels. But the difference between the two sides is not merely one of energy levels. As the universe gets older, its particles disintegrate. Our world prevents that artificially. In other words, matter outside our world is structured differently. Although it has never been definitively established, some of this matter is influenced by the brainwaves of those who draw near. So—”\nRealization dawned on Yeon-gyeong’s face, and she interrupted him: “You don’t have to say any more.”\nBut Jeong-chae continued speaking. She was going to find out anyway, so it might not be bad idea to instruct her in advance, to ensure she did not get flustered while on the job.\n“Sometimes, if a technician is thinking deeply about something, such a form can appear. That person there . . . that shape there is my wife. She was disabled, so four years ago she walked out into the annihilation. She consumed far more energy than a normal person, and yet she did less work, and thus it was said that she was accelerating the destruction of the world. So . . . ”\nJeong-chae tried to erase it from his mind, but the figure of his wife Su-hyeon kept appearing. No, he had the cause and effect backward: because he could not drive her from his mind, Su-hyeon kept appearing in the annihilation, trying to say something. Every time he saw her apparition, Jeong-chae begged her forgiveness.\nI wanted to walk out there in your place, Su-hyeon. But they said that even if the energy I would have consumed remained, it still would not have been enough to offset the amount you consumed. And that if I went, there would be one less person who could work. But that was nothing more than a justification. I know. I should have gone out there with you. But I couldn’t. I shouldn’t have sent you out into the annihilation alone. It must be so cold and lonely out there.\nI’m sorry. I’m so sorry.\nAgain, Jeong-chae had begged for her forgiveness. Yet the image of Su-hyeon grew no fainter. She remained in his mind just as she had the day before. And he knew that she would be there tomorrow, and the day after that as well.\n“You need to know this, Yeon-gyeong. If you continue in this line of work, you might see something—or someone—out there in the annihilation. But as long as you remain in this world, you cannot refuse this job just because you don’t like that idea. You were chosen because you have the right qualities, and only by doing this job can we all keep surviving together. It is the job of the technicians to prevent the end of the world, even as they keep seeing Su-hyeon—as they keep seeing those people. You’d best prepare yourself for that in advance.”\nYeon-gyeong stared at the legless image of Su-hyeon as if she were engraving something in the depths of her heart, and at long last she turned her gaze toward the forest. Jeong-chae said that she could go. Yeon-gyeong quietly complied. She did glance backward a few times before they reached a narrow path through the Forest of Oblivion. When she did this, Jeong-chae gave her the kind of look a parent might give a child during a scolding, and it wasn’t until she disappeared completely into the forest that he began walking toward the next sentinel.\nChopping down the trees needed for the coffin was difficult. Some trees had already been designated for the purpose, so he didn’t have to spend all that much time choosing them. However, the trees contained more moisture than he had expected, and the blade of his ax did not sink in as deeply as he wanted. This suggested that the world’s water was not being regulated in accordance with the calculations. Jeong-chae made a mental note to report this to the environmental scholars as he moved the trees he had felled and split to the edge of the forest. According to his original plan, he was supposed to have brought them closer to his workshop, but doing so surely would have exceeded his energy allowance for the day. Jeong-chae ate a little bit of the salt he’d brought with him to replenish the sodium that had been excreted from his body, buttoned up his clothes to prevent the radiation of any more body heat, and then headed toward the lounge.\nThere were far more people gathered there than usual. With the exception of infants, children, and six adults, the entirety of the world’s population—2,458 people—was packed into the lounge. Jeong-chae wiped the sweat from his brow with a cotton cloth as he looked for a place to stand at the very back of the room. A man who had been standing by the door and counting the people as they came in gave a signal directing everyone’s attention toward the front.\nThe person who went up onto the platform to oversee the proceedings was familiar to Jeong-chae: it was Sun-gyu. Since there was no machine or anything like that to amplify his voice, Sun-gyu spoke as loudly as he could. As for the crowd of some two thousand people, thanks to their habit of not wasting energy, they helped matters by not making even the least bit of noise, so that they could hear him clearly. Thus, Jeong-chae could follow exactly what he was saying:\n“My name is Kang Sun-gyu, and I was chosen by the drawing of straws. I will be handling the proceedings today. I am sure you all know that you have gathered here today for a vote. Before we take that vote, however, I will briefly explain the situation in which we find ourselves.\n“There are a few crucial principles that we live by: that no one without authorization should touch a sentinel; that we should not approach the annihilation; that we should not exceed the energy allowed to us; that each person should calculate and adhere to their own energy allowance; that we must eliminate factors that upset the balance of heat. These principles come before any other values—because if we violate these principles, the world will immediately be faced with a crisis, and if that state persists for too long a period of time, the sentinels will be overloaded and our world will be destroyed.\n“There are, following from these principles, some corollary rules as well. Everyone, with the exception of children, must have at least two occupations. It is said that this was not necessary a century ago, but the world has been greatly reduced in size since then, so according to our calculations this conclusion was unavoidable. No one gathered here today is an exception to this rule. Also, if at all possible, we should avoid discussion of the distant future. The most important thing right now is performing our labor day by day; worrying in advance about a tomorrow that is less bright will only have a negative effect on us. Of course, it would also be a waste of energy to worry.”\nWhat Sun-gyu had said was so natural, yet it also simply summarized the operation of the world. Thus, almost everyone nodded in agreement.\n“Though it is happening slowly, unfortunately the diminution of the world continues. In accordance with our rules, I will not talk about what might happen in the distant future. Yet no matter how many times we perform the calculations, and no matter how everyone here might restructure their lives, we have reached a point where a decision must be made. For those of you who have just turned twenty and thus only just earned the right to vote, I will speak simply and plainly. In a word, without fail there comes a time when we must reduce our population in order to maintain the world.\n“This is the way of the world—that is, the law of nature. There is surely nobody here who wants to reduce our population. However, if we take into consideration the efficiency of the sentinels and the limitations of the world, this conclusion is unavoidable. Fortunately or not, we have clear standards for a situation like this. They are not arbitrary, but have been arrived at naturally, as the result of careful calculations. Some time ago, there was one who insisted that we must eliminate the person whose ratio of productive activity to energy consumption was the lowest, and, although there were some twists and turns along the way, in the end everyone agreed that this was sensible. Since then, this standard has held firm, and as a result we have come to the point where everyone here has gathered to vote.”\nJeong-chae noticed that Sun-gyu had deliberately not mentioned the name of the person who had suggested the principle. Most of the other people gathered there appeared to notice this as well. However, someone quickly and quietly raised a hand. Jeong-chae pushed himself up slightly from the wooden wall against which he had been leaning and peered over to see who it was. It was Yeon-gyeong, whom he had trained just that morning. Jeong-chae only then remembered that she was twenty.\nWithout any hint of hurry, Sun-gyu very calmly yielded the floor to her, saying, “The woman with her hand raised.”\nYeon-gyeong spoke out in a clear voice. “Are we really all gathered here now? There is someone that I myself know who is not in attendance.”\nSun-gyu replied without hesitation, as if he had foreseen such a question: “You are correct. I was just about to get to that. To eliminate the possibility of error, we gathered nine people, each experts in a different field, and had them calculate and then check their calculations three times. As a result, three people were chosen as the subjects of our vote today. These three individuals are elsewhere right now, and three others are staying with them, one with each, detaining them with a reasonable excuse. We plan to receive the ballots from these six people once everyone here has finished voting.”\nYeon-gyeong’s face hardened. Jeong-chae could see it even from where he was standing. Nonetheless, she replied, “Is this not unjust? As far as I know, in a vote—no, even in a trial—suspects are granted the opportunity to speak in their own defense. If we continue like this, then even a trial would be less . . . ”\nYeon-gyeong stammered, unable to find the right word, but Sun-gyu supplied it for her.\n“You may be right,” he said. “It may be that what is taking place here today is not a vote but an act even more cruel than a guilty verdict. I don’t know what to call it, either. Still, we must not be mistaken. We are not—to use an old term—jurors gathered here to convict a suspect. We are gathered here to decide who should be chosen among three individuals for whom the results of our calculations are barely different. There is a margin of error, after all. We need to consider how much they participate in the productive activities needed for food, shelter, and clothing, how much energy they consume in proportion to that—”\n“But . . . ” Yeon-gyeong interrupted Sun-gyu once again.\nJeong-chae surmised that one of the subjects of the vote must be someone Yeon-gyeong knew personally. Jeong-chae had been in the same position four years earlier. If there was one difference, it was that there hadn’t even been a vote then. The person chosen in accordance with the traditional process for selecting a representative kept mentioning the greater good, saying that “we must sacrifice the few for the sake of the many,” and had proposed a candidate. Su-hyeon’s name had come up. Jeong-chae had stepped forward and declared that he would walk out into the annihilation in her stead. But his suggestion had not been accepted. Su-hyeon had been unable to move freely under her own power, and someone else would have had to give up that much of their productive activity to take care of her. The problem could not have been solved by Jeong-chae disappearing in her place.\n“But a person’s value cannot be determined by calculations alone,” said Yeon-gyeong.\nJeong-chae thought there was something odd about that statement. Now, in this world, a person’s value was indeed determined by calculations. People with low energy efficiency were dangerous beings. Furthermore, the figures of the three candidates chosen as a result of the calculations were said to be more or less the same. Yet Yeon-gyeong was acting as if her acquaintance had already been chosen. Jeong-chae wondered if perhaps . . . and he quietly moved so that he could get a better look at her face. He hadn’t noticed that morning, but when he looked at her now there was something familiar about her. There was a resemblance to a face that Jeong-chae would never forget as long as he lived.\nSun-gyu spoke once again: “I do understand what you mean by that. It might even have been a valid principle long ago. But the world is different now. We have no choice but to deal only with values that can be reduced to numerical figures. We cannot look down from above and judge others, either. That’s not the kind of situation that we’re in. We’re merely numbers that consume yet another number known as energy. We cannot measure values that cannot be seen or touched, so we have no choice but to leave them out of the discussion. In fact, it is for this reason—because we have no need of any emotional appeals or defenses—that we did not bring the individuals in question here today, so we could avoid a commotion and reduce the amount of energy wasted on such things.”\nYeon-gyeong must have been rendered speechless, as she said nothing more. Jeong-chae wondered whether she might flee the lounge, but she stayed right where she was.\n“If there are no further questions or objections,” Sun-gyu said, “then let’s continue with the proceedings. It is, after all, nearing the time when we must go to sleep.”\nSun-gyu removed a cloth that had been covering a marble slab at the back of the platform. On it were inscribed the names of the three candidates and their numerical figures. One was an old man over the age of eighty; another had lost an arm and a leg to a falling rock. The last person was not very old at all, and his limbs and brain appeared to be in perfect condition.\nJeong-chae immediately knew which one was Yeon-gyeong’s acquaintance. He also knew why he had seen something familiar in her face. And, finally, he knew why Yeon-gyeong had brought up those ancient arguments once more.\nSun-gyu began to explain the proceedings to the crowd. “The first candidate, Yi Hwan-yong, has difficulty moving normally now, due to old age and infirmity. The second candidate, Choe Ji-ung, is incapable of properly productive activity due to an unfortunate accident. The third candidate, Kim Gyeong-hwan, is unlike the previous two candidates in that he has no physical problems, but, unlike everyone else, he does not have two occupations, and he has refused to work two jobs in the future. Therefore, as the result of these calculations for these three individuals are nearly identical—”\nYeon-gyeong shot up from her seat. “Father is working at a farm in the north even now. It’s not true that he is not engaging in productive activity! And, on top of that, how is it that directing and supervising over two thousand people as their representative isn’t another occupation?”\nSun-gyu had no intention of preventing Yeon-gyeong from speaking, so he simply let her be. Everyone made as much of an effort as possible to prevent uncomfortable situations like that from arising during the vote, but the process served another function beyond the mere selection of an individual: it was also a ritual during which the friends and family of the one selected to walk out into the annihilation came to accept that this outcome was unavoidable. Now, in such a short time, Yeon-gyeong was traveling through that narrow and painful passage.\nShe seemed to feel something surge up within her and, suddenly unable to continue speaking, she began merely mumbling to herself. Sun-gyu, surely inwardly cursing his ill luck at having drawn the short straw, replied in a gentle voice:\n“We have spoken with the three candidates, in accordance with the established procedures. The first two candidates have no means of improving their condition. Kim Gyeong-hwan is different, though. If he had willingly chosen two occupations, today’s vote would not have turned out this way. What was Kim Gyeong-hwan’s original occupation? He was a politician. In other words, Kim Gyeong-hwan is someone who is incapable of holding even a single specialized job in this world. Thus he must supplement his work with simple labor, and significantly heavy labor at that. If he were to accept the results of our calculations and actively participate in labor, then he would be able to contribute 1.4 times the productivity of his energy consumption. Had that been the case, we would have been forced to choose between the remaining two candidates.\n“But Kim Gyeong-hwan has rejected this. He has contributed a great deal to the world as a leader, he argues, so shouldn’t that offset his consumption? He also claims that while he can farm as a pastime, he cannot do dirty work like sewage treatment. Such work, he claims, is for ordinary people. Therefore, we have come together today to vote.”\nJeong-chae could not forget that name, Kim Gyeong-hwan. In the measure he had put forward, there had been the so-called “greater good.” Yet Jeong-chae could not shake the thought that what had thrown his wife Su-hyeon out into the annihilation was the decision made by their leader, Kim Gyeong-hwan. It was Kim who had insisted that, in order for the normal people to live, they must first send away the disabled, who consumed even more energy than normal. His conclusion was not so different from what Sun-gyu had just said: send away those who are harmful to the maintenance of the world. Jeong-chae, and those who found themselves in similar circumstances, had offered a counter-argument: Where’s the harm? I’ve said that I will go instead, so why are you stopping me?\nJeong-chae knew, though, that he had failed to drive straight to the heart of the matter: Why is it all of you who get to decide? Are you not using fear to try to eliminate whomever you wish? That’s what he should have said. But he had been unable to do it at the time, and so he remained here in this world while Su-hyeon remained only in his memory and his guilt, swaying like a legless ghost in the dark red light of the annihilation. In this way, the world’s people sympathized with each other’s circumstances or pretended not to see them, living on as a community . . . but politicians were different. Even though the world had shrunk as much as it had, they tried to make themselves exceptions. At least, Kim Gyeong-hwan had been revealed to be such a person. He believed that he was worth more than others, even though he didn’t do any work at all, just because of his title as a representative.\n“Anyone who is interested in the detailed calculations may freely come forward before the vote and check the figures written here. If you have any questions about them, please ask the scholars who are waiting at the rear. They will explain things to you as simply as possible. Oh, and please allow me to explain one more thing, just in case. The nine members of the team who carried out these calculations came to the conclusion that, with Kim Gyeong-hwan being the last of our policy-makers, we would not need any more such people in the future. The calculations have been carried out in accordance with the laws of nature. That is to say, that how much of what kind of work an individual can do, and what benefits they can enjoy, are decided by thermodynamics and the environment of our world. Unless we discover some fundamentally different truth and escape our current situation, this fact is unlikely to change.”\nJeong-chae half-recalled a dream of which he had forgotten all the details. Clearly the past had been better than now.\nSun-gyu moistened his lips before continuing. “Alright, then we should begin the vote, starting with those in the front. There are writing utensils in the voting booths, so all you have to do is write a number on the piece of wood you have been given. Anyone who does not participate will be considered to have abstained.”\nA tumult broke out in the lounge as people began to talk loudly and get up from their seats. As he’d been standing in a corner, a short distance from the crowd, Jeong-chae was not swept up in the tide of bodies. He caught a glimpse of Yeon-gyeong moving in the opposite direction from everyone else, hurrying out of the room.\nA second training session was scheduled for three days after the vote. As he stood beside a sentinel at the edge of the world, Jeong-chae supposed that Yeon-gyeong would not come. He checked the figures on the sentinel: -2.760. The heat transfer between the world and the annihilation had nearly reached equilibrium. Such a change was possible only because the world population had been reduced by one. Jeong-chae carefully adjusted the sixteen dials and accelerated ever so slightly the destruction of the neutrinos that existed within the annihilation. It was clear that, if he manipulated 32 more sentinels in this way, the world would become slightly more stable.\nAt least, for the time being.\nJust as he was about to continue on to the next sentinel, Jeong-chae was startled by a movement in the corner of his eye, and he spun around. It was Yeon-gyeong standing there. She was even more haggard than the last time he’d seen her, and the shadows under her eyes were that much deeper, but Jeong-chae mentioned none of this. Wasting energy on pointless sympathy helped no one.\nAs Jeong-chae slipped his leather scroll into his bag, Yeon-gyeong said in a hoarse voice, “I guess you’ve finished fixing the first sentinel.”\nJeong-chae replied, “That’s right. We’ll have to go to the next sentinel if I’m to show you how to operate them.”\nWith that, he began to walk slowly. When one’s heart ached too much, jumping straight into one’s work was one way to soothe it. To be precise, one had to do this, if only to keep the world going. Their world had become so small now that there was no room for delays due to emotions. That’s how much the annihilation pressed in on them all.\nYeon-gyeong asked, “How much energy do you have to spare?”\nJeong-chae quickly performed the mental arithmetic. “About 20 joules.”\nYeon-gyeong nodded. “Can we sit for a moment before we go on?”\nWithout replying, Jeong-chae sat down. He placed his tool bag in his lap to prevent it from rolling down into the annihilation.\nYeon-gyeong sat down next to him. She lowered her head and then raised it again slowly, staring out at the edge of the hell that embraced the world in an orange glow. “While the vote was taking place, I ran to my father. I thought that if he changed his mind before the end, that it might change the situation as well. I told him that the world is a different place now. And that it would only become more different in the future. I even told him that this was not like him. Was there anything that he couldn’t do to keep on living? Just like everyone else? But he was the same as ever. He said that he was convinced he wasn’t wrong, that he’d lived his life according to his conviction, and that it would be better to die than to give that up. I asked him what this conviction was. He said it was that leaders are different from everyone else. That they are by no means equal. That those people who had chosen him but then later had abandoned him were cowardly traitors.”\nJeong-chae merely listened without any reaction, as unshakable as a slab of marble.\n“So I tried another tack to persuade him. I asked him if he was fine with never seeing me again. With leaving me alone in this world. He hesitated for a brief moment. But then he became even more stubborn than before. He said that there were values even greater than affection. It was then that I realized: it didn’t matter how long we talked, we were never going to understand each other.”\nYeon-gyeong leaned toward Jeong-chae and rested her head on his shoulder. He felt her body trembling. She was holding back tears.\n“I shouldn’t cry if I want to reduce heat radiation . . . In the end, he turned his back on even me . . . People came last night. They said they would bring him to the end of the world. They asked him if it wouldn’t be better for him to walk out on his own. But Father . . . Father said that he would never go. He asked who had given them the right to do it. They tried to persuade him, but it was no use . . . They brought me outside. For some time there was a commotion, and then everything went silent. Then they . . . they came out with a heavy coffin.”\nYeon-gyeong wept a little more, but then the violent emotion must have passed, as she sat up straight. Jeong-chae said nothing to comfort her, nor did he even place a hand on her shoulder. There was nothing that he could say.\n“They must have known Father better than I did. That’s why they prepared the coffin in advance, and they must have also calculated the amount of resources that would be consumed by felling that many trees.”\nIt had, indeed, been Jeong-chae who had felled the trees, planed the boards, and driven in the nails to make the coffin. But he did not tell her this fact.\nEven back in the days when energy had been abundant, leaders or representatives might not have really been necessary. If everyone had properly understood how the world turned, what was beneficial for only a few, and what would be harmful to the whole, then they might not have needed to choose representatives. It was not that difficult to live without them. However, people had chosen this lazy approach for the sake of a petty peace and to make their lives easier, and as a result they had left the decision-making to others. It was only now—now that the universe was dying—that they belatedly realized the truth: that leaders and representatives were poisonous mushrooms that grew thick in the cracks and crevices widened by indolence, and they were a waste of energy. Kim Gyeon-hwan ought to have been sent out of this world long ago. Had he been, then someone else could have lived longer.\nJeong-chae pondered all of this, but he said nothing to Yeon-gyeong.\nYeon-gyeong wiped her eyes with the sleeve of her undyed shirt and stood up. Then she looked out, not so surprised this time, and gazed at the form that maintained a minimum of order within the erratically shimmering annihilation. “Your wife . . . I heard what happened. It was my father who led the way in that decision, four years ago.”\nJeong-chae neither confirmed nor denied what she said, but simply lifted his eyes to look out at the translucent apparition of Su-hyeon. Even if one more person disappeared into the annihilation inside a coffin, even if the world had once more found a brief state of stability, even if no more leaders ever existed in the remaining history of humanity, Su-hyeon would remain there—within memory, within the red abyss, and within that cluster of particles. And she would eternally be opening and closing her mouth, as if she were speaking.\nThe two of them watched Su-hyeon for a while before leaving that place. They walked toward the next sentinel—to adjust it so that tomorrow, when they would have to rise once again at the appointed hour, could exist.\nThroughout that day, Su-hyeon followed the two of them. But the apparition of Kim Gyeong-hwan never appeared. There was, after all, no one who missed him.\nOriginally published in Korean in Dokjaeja. (Seoul: Bbul, 2010.)\nPublished with the support of Literature Translation Institute of Korea (LTI Korea).\nChang-Gyu Kim is a Korean science fiction writer. In 2005, he won Science-Technology Literature Award for \"Byulsang\" and has since won three other SF awards for \"Update\" (2014), \"Our Banished World\" (2016), and \"All the Amusement Park in the Universe\" (2017). \"Our Banished World\" was translated into English and published in Readymade Bodhisattva in 2019. His short fiction has been collected in two collections, Our Banished World and Samsara. Kim currently teaches Storytelling at a college.", "source": "https://clarkesworldmagazine.com/chang-gyu_11_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sentinel by Chang-Gyu Kim, translated by Charles La Shure"}