{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Xcu++B1+/+GZgjluiisidLA44gE=", "id": null, "license": null, "comments": "", "raw_text": "Interview  A Wider Range of Freedom: A Conversation with Alyssa Winans  Alyssa Winans grew up near Chicago. She studied in Japan for a year in high school, and her education had a strong emphasis on math and science. Regardless, she moved to Rhode Island for college, planning to study graphic design. “Luckily, everyone I met looked at my work and quickly directed me towards illustration.” Winans earned a BFA in illustration from the Rhode Island School of Design. In 2013 she moved to the San Francisco Bay Area, where her spouse is originally from, to be close to family.  “When I was in high school, I made applying to T-shirt contests my ‘summer job.’ It’s a weird thing to do, and I’m not sure I’d recommend it, but I learned a lot.” Winans worked in games for a few years, beginning as a weapons designer for a fantasy MMORPG. She interned at a local company and continued working part-time throughout her senior year, designing over three hundred weapons before the company went under shortly before she graduated. She also worked at Harmonix on Fantasia: Music Evolved.  Winans works for Google as part of the Google Doodle team, and since 2011 has been racking up accolades and awards, including being a Hugo Award finalist in the Professional Artist category for two consecutive years. In her free time, she likes to make desserts (especially ice cream—especially unusual flavors), garden, and read.   What artists have most influenced and inspired you?  I think the artists that have influenced me the most are actually people I’ve met and directly worked with: folks I went to school with and various coworkers and mentors I’ve had over the years. I’ve admired specific artists and styles at different times in my career, but the most inspiration came from actually watching everyone around me grow. Sharing in their different approaches and experiences has had a lasting impact in not only the way I think about art, but most other areas of my life as well.  Were you creating art from an early age? How did you transition from hobby and doing it for yourself to doing it professionally?  I guess the answer here is “sort of!” I met my childhood best friend when we were ten. She’s this spectacularly creative person, so whenever we spent time together, we would always be making up stories. We would sketch out our characters, so I was drawing a lot during that time. Sailor Moon fan art also figured prominently in our friendship! We ultimately went to different high schools, and the time I spent drawing actually dropped off after that.  My family doesn’t have a creative background, and my high school also had an emphasis on math and science, so a future in art was pretty far from my mind. In November of my senior year, I was doing some last-minute research and one of the schools I was looking into advertised that it had an art school right next to it, and they were launching a five-year dual degree program. I’d never really considered studying art, but I was intrigued. So many of my best memories were from those times when I was just drawing at my friend’s house. My school had one art teacher (who taught ceramics and dark room photography), so I went to him, and he explained what a portfolio was and what might go into it. I was fortunate that so many people helped me put together a portfolio that winter. One of my teachers let me draw him while he graded papers, and friends lent me objects to draw and provided feedback. My mother even found a local art teacher who explained how to approach the required large-scale graphite drawings I needed in addition to my portfolio.  I ended up getting wait-listed at the original school. But somehow, I got into the art school, and they offered me a scholarship. I was honestly bewildered. Many people said I’d regret it if I didn’t at least try, so, I tried, and I’ve been on that path since then.  Do you draw from life or from photo reference or both? Do you start with sketches on paper, do you work digitally—what does your workflow look like from concept to realization?  Both, though sometimes neither! I usually only draw from life when I’m out and about and just drawing for fun. Flowers, landscapes, etc. As for reference material, it depends on how stylized whatever I’m drawing is. When my sketchbook drawings are fairly stylized, I may go without robust reference. My more realistic pieces will require more concrete reference material, though I usually will start without at the sketch stage so I’m not limited by the reference I can find or take myself. Once I have the idea locked in, then I’ll figure out the best reference to draw what I’ve planned.  Process-wise, if I’m working off a manuscript, I’ll read it once, and then go back through a second time and start pulling out key phrases or themes for me to incorporate into sketches. I’ll also do a round of research before I start drawing, if the project calls for it. I personally do my thumbnails on paper, since I find it easier to see the whole thing at once compared to my computer screen. They’re usually a bunch of scribbles, really just reminders that I’ve explored a specific idea when I come back to it. Once I’ve explored a range of ideas, I’ll take some photos of my favorites and pop them onto the computer. From there I’ll start refining the sketches. I’ll usually kill off a few more ideas at this stage, until I get down to three or four.  If it’s for client work, then I’ll do a set of clear sketches so they can see what’s actually going on. I’ll also usually do a round of revisions at the sketch stage to address client feedback before moving onto color. If it’s for personal work, I’ll refine the complex parts of my sketches, but then hop directly into color. I block in solids first, at which point I’ll build out the palette I want as I go. Depending on the project and timeline, I’ll also send a color test to my client to get more feedback before moving onto the final. From then it’s just slowly adding different levels of detail until the piece is complete.   How does your process change if you’re working on a book cover, as opposed to something else?  I’ve mainly worked on games, T-shirts, books, and Doodles, and I think the main things that affect my process are the scale and way the art will be seen. For example, game assets and Doodles might only be seen at a specific size on a desktop or a mobile screen, so I have to be cognizant about what will read clearly at size. A lot of details won’t be seen and will just cause visual confusion. User interface elements might need to be larger than expected for easy tapping on a phone. With T-shirts, I need to think about where designs will warp and sit on people with different body shapes. Book covers might be seen both in a bookstore and online, and will be paired with text. In that case, I’m trying to think of something that might be eye-catching and read well in a variety of settings: from across the room, on a black and white reading device, or on a web page. But I also have to think about spoilers, or how a reader’s perception of a cover might change after they’ve read the book.  If ISFDB is correct, you’ve been doing SFF covers since 2016. How did you get into doing genre book covers? Where does science fiction and fantasy fit into your creativity or your artistic body of work?  The answer here is that I was lucky, and people are kind. I was fortunate enough to have a portfolio review with Irene Gallo at Spectrum in 2015. She must have remembered my work, because she reached out with my first fantasy commission for Tor.com (Aliette de Bodard’s “Lullaby for a Lost World”) about a year later.  I grew up in a house full of SFF books, courtesy of both my parents and older sisters, so reading through those was a big part of my childhood. I have a lot of memories of coming home from the library with a big stack of books, and my sisters and I would just make our way through the pile. I actually stopped reading for a long time as an adult, partly because I was busy, but partly because I didn’t realize my tastes had shifted as I grew up. Once I started finding new stories that resonated with who I was as an adult, SFF became a big part of my life again. When left to my own devices, that’s still the work I enjoy making the most. I personally find it gives me a wider range of freedom to explore and express personal thoughts and concepts than I might otherwise.  You are a Hugo Award finalist for the second year in a row. Have you attended genre conventions or had much interaction with the SFF community?  I’ve been to a handful of art-specific conventions (Spectrum Fantastic Art Live, LightBox Expo, etc.), but last year’s virtual Worldcon was my first that was geared toward the writing/publishing community. The Hugo email last year really shocked me, because I didn’t think anyone knew I existed. I think overall I’m not very involved with the community (even from the art side), partly because so much interaction happens in online spaces. I think everyone is very welcoming, but I always feel like a bother when I reach out to people I don’t actually know in real life on social media. I’m working on that.   On your site, there are a lot of reds, golds, and soft yellows, a bit of green and blue. What is it about these combinations of colors that speak to you?  I love bright colors, and it’s a big part of what I enjoy about art. I usually pick my palettes based on the tone of a piece. I’ll pick a core color that I think best conveys the tone, and fit all the accompanying colors around that first color. So that’s probably where some common combinations come from. I’ve been trying to be a little less heavy-handed about it, but if you look at the red pieces on my website, they’re almost all implying danger and/or determination. Blue and greens are usually quieter, more introspective pieces, though I sometimes use green to be unsettling.   On your main page, with those pieces specifically, there seems to be a deliberate use of darkness, or heavier tones, which creates powerful contrasts and emotionality. Can you talk a bit about this?  A lot of the narratives I’ve worked with have a bit of a darker edge to them, which I want to showcase in the color and value schemes I choose for the accompanying art. That being said, it’s likely something I gravitate to in my personal work, as well. Somewhat to my own chagrin, my ideas for personal pieces usually come out of something I’ve been dwelling on but can’t quite articulate. I think an idea born of a feeling that might be difficult to describe ends up pushing me to play up the drama of lighting and color.  What are some of your favorite pieces or projects you’ve done, whether or not in genre, or perhaps pieces or projects that you’re most proud of?  I still have a soft spot for “Lullaby for a Lost World,” because while I mentioned it was my first fantasy commission, it was also one of the first illustration jobs I’d gotten. At that time, I was scraping by on sporadic freelance game work, and a large part of me was starting to give up on the idea of getting more illustration work, fantasy-related or otherwise. So although it’s quite a dark piece, it has many good feelings associated with it.   I also have two personal series from 2014 that stand out for me, because that’s when I started working in a way that’s close to what I do now. That year was a dry year in terms of paying work, but I made a lot of pieces that felt like personal breakthroughs. I don’t keep most of them on my website, but I actually still use them as a baseline or reference as I work.  Are there themes or motifs that you enjoy, that appear in your work often, and what do you like most about them?  One theme that comes up a lot sounds extremely goofy written down: giant women. For me, increasing the scale puts the figures into a mythical, godlike space and gives them an inherently powerful standing even if they’re doing something completely mundane. I think that’s just something I like to see, that makes me feel a bit more determined myself. Also, I’m a very short person, so I’m sure there’s some slight wish fulfillment at work there!  Many illustrators start off just doing art for themselves, for the joy of it. Do you still paint or draw for yourself, just because you want to?  I do, although somewhat sporadically. I’m lucky to have a creative day job, but it does consume a lot of my creative energy. There’ll be times I don’t draw anything outside of work or freelance projects because I’m just tired. When I do have energy, I’ll mostly draw something different than I do for either type of work, so I do these silly ink drawings that I keep on my Instagram. It’s easy to get into the mindset that each piece has to be a portfolio-level breakthrough piece, and I think that mentality can really push people, but I find it makes me prone to paralysis. So doing low-pressure things helps refresh me and keeps art from feeling too much like a job (although, inevitably, there are those times too).  Where do you hope to take your art next? What do you hope to do with your art?  Ahh, a tough question. In terms of technical changes, I’ve always been enamored of patterns and have been looking for a way to incorporate them more into my larger pieces. In a broader sense, I’ve been thinking about how I can apply my skills to something more educational. At work, we do a lot of thinking about how to simplify and convey information in the clearest way possible. Especially in the last year, it feels like there’s been so much information flying at people at all times, it’s so hard to parse and digest anything. There’s a chance it’s incompatible with my current skill set (I’m not anyone’s first choice for an infographic), but I’m thinking about it.   Do you have any advice for aspiring or up-and-coming illustrators?  It’s challenging to give one-size-fits-all advice, since everyone has different needs and goals, but I’d suggest cultivating good techniques for thinking about your own work and growth. Try not to get caught in the general whirlwind of negativity, “my art is no good or not where it needs to be.” (Hard, I know!)  Use that criticality instead to think hard and specifically on your weaknesses and make a game plan on how to approach them. It doesn’t have to be anything fancy or grueling, just some dedicated time to shoring up issues in your skill set. This can apply to content and ideas, as well. It can be hard to just tackle the big question, “what do I want to say with my art?” Consider why you really connect with a piece, beyond the technical skill. Try giving yourself little brainstorming assignments or exercises until natural patterns start to emerge.  In a totally different vein, please try to pick up some good wrist and back exercises! Our work can be quite physical; your future self will thank you for it. And, of course, good luck! Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nA Wider Range of Freedom: A Conversation with Alyssa Winans\nAlyssa Winans grew up near Chicago. She studied in Japan for a year in high school, and her education had a strong emphasis on math and science. Regardless, she moved to Rhode Island for college, planning to study graphic design. “Luckily, everyone I met looked at my work and quickly directed me towards illustration.” Winans earned a BFA in illustration from the Rhode Island School of Design. In 2013 she moved to the San Francisco Bay Area, where her spouse is originally from, to be close to family.\n“When I was in high school, I made applying to T-shirt contests my ‘summer job.’ It’s a weird thing to do, and I’m not sure I’d recommend it, but I learned a lot.” Winans worked in games for a few years, beginning as a weapons designer for a fantasy MMORPG. She interned at a local company and continued working part-time throughout her senior year, designing over three hundred weapons before the company went under shortly before she graduated. She also worked at Harmonix on Fantasia: Music Evolved.\nWinans works for Google as part of the Google Doodle team, and since 2011 has been racking up accolades and awards, including being a Hugo Award finalist in the Professional Artist category for two consecutive years. In her free time, she likes to make desserts (especially ice cream—especially unusual flavors), garden, and read.\nWhat artists have most influenced and inspired you?\nI think the artists that have influenced me the most are actually people I’ve met and directly worked with: folks I went to school with and various coworkers and mentors I’ve had over the years. I’ve admired specific artists and styles at different times in my career, but the most inspiration came from actually watching everyone around me grow. Sharing in their different approaches and experiences has had a lasting impact in not only the way I think about art, but most other areas of my life as well.\nWere you creating art from an early age? How did you transition from hobby and doing it for yourself to doing it professionally?\nI guess the answer here is “sort of!” I met my childhood best friend when we were ten. She’s this spectacularly creative person, so whenever we spent time together, we would always be making up stories. We would sketch out our characters, so I was drawing a lot during that time. Sailor Moon fan art also figured prominently in our friendship! We ultimately went to different high schools, and the time I spent drawing actually dropped off after that.\nMy family doesn’t have a creative background, and my high school also had an emphasis on math and science, so a future in art was pretty far from my mind. In November of my senior year, I was doing some last-minute research and one of the schools I was looking into advertised that it had an art school right next to it, and they were launching a five-year dual degree program. I’d never really considered studying art, but I was intrigued. So many of my best memories were from those times when I was just drawing at my friend’s house. My school had one art teacher (who taught ceramics and dark room photography), so I went to him, and he explained what a portfolio was and what might go into it. I was fortunate that so many people helped me put together a portfolio that winter. One of my teachers let me draw him while he graded papers, and friends lent me objects to draw and provided feedback. My mother even found a local art teacher who explained how to approach the required large-scale graphite drawings I needed in addition to my portfolio.\nI ended up getting wait-listed at the original school. But somehow, I got into the art school, and they offered me a scholarship. I was honestly bewildered. Many people said I’d regret it if I didn’t at least try, so, I tried, and I’ve been on that path since then.\nDo you draw from life or from photo reference or both? Do you start with sketches on paper, do you work digitally—what does your workflow look like from concept to realization?\nBoth, though sometimes neither! I usually only draw from life when I’m out and about and just drawing for fun. Flowers, landscapes, etc. As for reference material, it depends on how stylized whatever I’m drawing is. When my sketchbook drawings are fairly stylized, I may go without robust reference. My more realistic pieces will require more concrete reference material, though I usually will start without at the sketch stage so I’m not limited by the reference I can find or take myself. Once I have the idea locked in, then I’ll figure out the best reference to draw what I’ve planned.\nProcess-wise, if I’m working off a manuscript, I’ll read it once, and then go back through a second time and start pulling out key phrases or themes for me to incorporate into sketches. I’ll also do a round of research before I start drawing, if the project calls for it. I personally do my thumbnails on paper, since I find it easier to see the whole thing at once compared to my computer screen. They’re usually a bunch of scribbles, really just reminders that I’ve explored a specific idea when I come back to it. Once I’ve explored a range of ideas, I’ll take some photos of my favorites and pop them onto the computer. From there I’ll start refining the sketches. I’ll usually kill off a few more ideas at this stage, until I get down to three or four.\nIf it’s for client work, then I’ll do a set of clear sketches so they can see what’s actually going on. I’ll also usually do a round of revisions at the sketch stage to address client feedback before moving onto color. If it’s for personal work, I’ll refine the complex parts of my sketches, but then hop directly into color. I block in solids first, at which point I’ll build out the palette I want as I go. Depending on the project and timeline, I’ll also send a color test to my client to get more feedback before moving onto the final. From then it’s just slowly adding different levels of detail until the piece is complete.\nHow does your process change if you’re working on a book cover, as opposed to something else?\nI’ve mainly worked on games, T-shirts, books, and Doodles, and I think the main things that affect my process are the scale and way the art will be seen. For example, game assets and Doodles might only be seen at a specific size on a desktop or a mobile screen, so I have to be cognizant about what will read clearly at size. A lot of details won’t be seen and will just cause visual confusion. User interface elements might need to be larger than expected for easy tapping on a phone. With T-shirts, I need to think about where designs will warp and sit on people with different body shapes. Book covers might be seen both in a bookstore and online, and will be paired with text. In that case, I’m trying to think of something that might be eye-catching and read well in a variety of settings: from across the room, on a black and white reading device, or on a web page. But I also have to think about spoilers, or how a reader’s perception of a cover might change after they’ve read the book.\nIf ISFDB is correct, you’ve been doing SFF covers since 2016. How did you get into doing genre book covers? Where does science fiction and fantasy fit into your creativity or your artistic body of work?\nThe answer here is that I was lucky, and people are kind. I was fortunate enough to have a portfolio review with Irene Gallo at Spectrum in 2015. She must have remembered my work, because she reached out with my first fantasy commission for Tor.com (Aliette de Bodard’s “Lullaby for a Lost World”) about a year later.\nI grew up in a house full of SFF books, courtesy of both my parents and older sisters, so reading through those was a big part of my childhood. I have a lot of memories of coming home from the library with a big stack of books, and my sisters and I would just make our way through the pile. I actually stopped reading for a long time as an adult, partly because I was busy, but partly because I didn’t realize my tastes had shifted as I grew up. Once I started finding new stories that resonated with who I was as an adult, SFF became a big part of my life again. When left to my own devices, that’s still the work I enjoy making the most. I personally find it gives me a wider range of freedom to explore and express personal thoughts and concepts than I might otherwise.\nYou are a Hugo Award finalist for the second year in a row. Have you attended genre conventions or had much interaction with the SFF community?\nI’ve been to a handful of art-specific conventions (Spectrum Fantastic Art Live, LightBox Expo, etc.), but last year’s virtual Worldcon was my first that was geared toward the writing/publishing community. The Hugo email last year really shocked me, because I didn’t think anyone knew I existed. I think overall I’m not very involved with the community (even from the art side), partly because so much interaction happens in online spaces. I think everyone is very welcoming, but I always feel like a bother when I reach out to people I don’t actually know in real life on social media. I’m working on that.\nOn your site, there are a lot of reds, golds, and soft yellows, a bit of green and blue. What is it about these combinations of colors that speak to you?\nI love bright colors, and it’s a big part of what I enjoy about art. I usually pick my palettes based on the tone of a piece. I’ll pick a core color that I think best conveys the tone, and fit all the accompanying colors around that first color. So that’s probably where some common combinations come from. I’ve been trying to be a little less heavy-handed about it, but if you look at the red pieces on my website, they’re almost all implying danger and/or determination. Blue and greens are usually quieter, more introspective pieces, though I sometimes use green to be unsettling.\nOn your main page, with those pieces specifically, there seems to be a deliberate use of darkness, or heavier tones, which creates powerful contrasts and emotionality. Can you talk a bit about this?\nA lot of the narratives I’ve worked with have a bit of a darker edge to them, which I want to showcase in the color and value schemes I choose for the accompanying art. That being said, it’s likely something I gravitate to in my personal work, as well. Somewhat to my own chagrin, my ideas for personal pieces usually come out of something I’ve been dwelling on but can’t quite articulate. I think an idea born of a feeling that might be difficult to describe ends up pushing me to play up the drama of lighting and color.\nWhat are some of your favorite pieces or projects you’ve done, whether or not in genre, or perhaps pieces or projects that you’re most proud of?\nI still have a soft spot for “Lullaby for a Lost World,” because while I mentioned it was my first fantasy commission, it was also one of the first illustration jobs I’d gotten. At that time, I was scraping by on sporadic freelance game work, and a large part of me was starting to give up on the idea of getting more illustration work, fantasy-related or otherwise. So although it’s quite a dark piece, it has many good feelings associated with it.\nI also have two personal series from 2014 that stand out for me, because that’s when I started working in a way that’s close to what I do now. That year was a dry year in terms of paying work, but I made a lot of pieces that felt like personal breakthroughs. I don’t keep most of them on my website, but I actually still use them as a baseline or reference as I work.\nAre there themes or motifs that you enjoy, that appear in your work often, and what do you like most about them?\nOne theme that comes up a lot sounds extremely goofy written down: giant women. For me, increasing the scale puts the figures into a mythical, godlike space and gives them an inherently powerful standing even if they’re doing something completely mundane. I think that’s just something I like to see, that makes me feel a bit more determined myself. Also, I’m a very short person, so I’m sure there’s some slight wish fulfillment at work there!\nMany illustrators start off just doing art for themselves, for the joy of it. Do you still paint or draw for yourself, just because you want to?\nI do, although somewhat sporadically. I’m lucky to have a creative day job, but it does consume a lot of my creative energy. There’ll be times I don’t draw anything outside of work or freelance projects because I’m just tired. When I do have energy, I’ll mostly draw something different than I do for either type of work, so I do these silly ink drawings that I keep on my Instagram. It’s easy to get into the mindset that each piece has to be a portfolio-level breakthrough piece, and I think that mentality can really push people, but I find it makes me prone to paralysis. So doing low-pressure things helps refresh me and keeps art from feeling too much like a job (although, inevitably, there are those times too).\nWhere do you hope to take your art next? What do you hope to do with your art?\nAhh, a tough question. In terms of technical changes, I’ve always been enamored of patterns and have been looking for a way to incorporate them more into my larger pieces. In a broader sense, I’ve been thinking about how I can apply my skills to something more educational. At work, we do a lot of thinking about how to simplify and convey information in the clearest way possible. Especially in the last year, it feels like there’s been so much information flying at people at all times, it’s so hard to parse and digest anything. There’s a chance it’s incompatible with my current skill set (I’m not anyone’s first choice for an infographic), but I’m thinking about it.\nDo you have any advice for aspiring or up-and-coming illustrators?\nIt’s challenging to give one-size-fits-all advice, since everyone has different needs and goals, but I’d suggest cultivating good techniques for thinking about your own work and growth. Try not to get caught in the general whirlwind of negativity, “my art is no good or not where it needs to be.” (Hard, I know!)\nUse that criticality instead to think hard and specifically on your weaknesses and make a game plan on how to approach them. It doesn’t have to be anything fancy or grueling, just some dedicated time to shoring up issues in your skill set. This can apply to content and ideas, as well. It can be hard to just tackle the big question, “what do I want to say with my art?” Consider why you really connect with a piece, beyond the technical skill. Try giving yourself little brainstorming assignments or exercises until natural patterns start to emerge.\nIn a totally different vein, please try to pick up some good wrist and back exercises! Our work can be quite physical; your future self will thank you for it. And, of course, good luck!\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/winans_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Wider Range of Freedom: A Conversation with Alyssa Winans by Arley Sorg"}