{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Stabback", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MBsZ7fUod7fOpr8mNX+mZx6QCfk=", "id": null, "license": null, "comments": "", "raw_text": "2710 words, short story  In Which Faster-Than-Light Travel Solves All of Our Problems  I live in my cockpit. I piss in a bottle and I cross the vastest vastness in my shining tin can. I’ve seen more of nothing than just about anyone, but if I’m telling you about it then you aren’t really here, because it’s just me out here. Every month or so I jerk off to pictures of shapes so airbrushed they aren’t human, and I drop my tissues on the floor and leave them there. Every seven months or so I leave my ship for repairs and spend a few nights getting drunk and listening to old travelers who have either forgotten how to be human or are pretending they aren’t so they can fit in, and then if I’m flush spend the night with someone who is pretending they aren’t because I’ve paid them.  But mostly, I just live in my cockpit. I freight anything. Whatever, wherever, if you can pay. I had to make a pickup on an asteroid. I set my ship down on the thing, a sad grey chunk of rock. I put on my helmet and went out on the surface to collect what had been hidden there for me. It was a place that nobody would go, where everything was quiet and dark. There was a man there.  He was tall, and his grey dusty vacuum suit did not look nearly protective enough to deal with what small bits of grit might hit it at high speed. Its helmet let me see most of his head, which was grey and balding.  “Who are you?” I said.  “I’m George.”  “What the fuck are you doing here?”  “I was hoping you could give me a lift.”  “I don’t do passengers.”  “I’m going to run out of oxygen soon.”  “That’s your problem.”  I made him stand in the cockpit behind me, and I told him to be quiet. He had taken off his helmet once we were in, and I was waiting for him to say something about the smell. Not saying anything was almost worse. He remained impassive. He was a lot taller than me, and older, and I wasn’t sure if his face was beaten or just dour.  I resolved to ignore him. I set course for the rendezvous with Jennet. There’s a trick I have that is so old it isn’t a trick anymore, where I can turn my mind off while I sit here watching the scanners. Hours can pass without a thought, but I couldn’t do it with George behind me. The minutes and the hours dragged by and my mind kept slipping into places I did not want it to go. People. I did not want to think about people. I will not tell you what the memories were. After six hours and forty-three minutes of this, George spoke:  “I realized that I was an alien when I was very young.”  I didn’t turn around or respond. If you acknowledge people, it gives them power. This was my space. I wondered what being an alien could even mean these days.  “I thought the other children could tell,” he continued. “My parents told me I have always been odd, right since the start.”  We were less than three hours from the rendezvous, and I was suddenly worried that George was here to observe and capture me. Probably he wasn’t: My ship scans automatically for tracking and recording devices whenever someone boards, and he had neither. But what had he been doing on that rock?  It didn’t matter. To show interest would be to become complicit, and besides that a distraction. On a job like this, you have to keep your eye on the scanners all the time. Some things are hard to see, and the auto alerts won’t necessarily get tripped. Some things are designed especially not to trip them, altering their shape to match every firmware update. Slippery intentions moving shark-like through space, black against black. I slapped myself, concentrated.  I could hear George behind me, breathing. His breathing didn’t sound entirely steady. Occasionally, he would snort or even cough, and I would try not to flinch. Eventually he spoke again:  “When I was five we went to the mechanical circus. The ringmaster’s eyes glowed and he cracked his whip, the horses trotted around, and there was one girl, she was so pretty up on top of that horse, so . . . lithe. And bright. There was some sort of magic there, under the lights. Maybe she wasn’t an automaton. She wrapped herself up in pieces of silk and fell into perfect shapes above us, and I thought maybe she’s an alien like me. Maybe the ringmaster keeps her against her will. Maybe she needs my help. And I started crying because I couldn’t help her.” He sniffed and snorted, a casual rearrangement of mucous at the back of his throat.  “Looking back,” he said, “she probably was an automaton, and she probably never needed my help. But I never found out. She sure was pretty, though.”  I couldn’t figure out which was worse. The silence—so oppressive and different from the silence of being alone—or his odd little confessions. I kept my eyes on the scanners. I said nothing. We were coming up on the planet, a lonely sphere of yellow and grey dust orbiting a nearly burnt out star.  “I hid when I was a teenager. I didn’t want anyone to know, so I didn’t expose myself. I didn’t love. I thought someone was cute sometimes, but I was an alien. It couldn’t work.”  “Shut up,” I said. I could talk, I decided. I just would not look at him.  Jennet and I had met on ZK93 before. It was charted, but I knew of no other humans who had bothered to travel there. I wasn’t worried about George finding out where we were: my displays and HUD were all in a script only I could read. There was a city on the planet, long abandoned. By who or what, I did not know. The architecture had sediment lines, as if it had all been carved whole out of the rock that had been there.  You don’t leave someone with your ship if you don’t know them. I made George follow behind me, him in his flimsy vac-suit, me in my armor, trudging beneath the unfinished sandstone spires and broken bridges of the forgotten city.  “When I was twenty,” said George over the comm, “I had to get a job in a tall building.”  The towers around us remained obscure.  “The elevator ride was twenty minutes,” he said, “and you couldn’t see the ground out the window, just other towers and elevated roads and bridges and lights blinking in the mist. Inside was clean and sterile, and people had lines around them so that nobody could see their inside from the outside. It was easy to be an alien, there. I could talk to people, because people didn’t talk about themselves.”  We were approaching the cracked dome in the center of the city, where Jennet and I had arranged to meet. But she wasn’t coming out. Something was wrong. I took out my pistol. I searched the tops of the towers. There were window holes everywhere. If someone was watching us, we’d never see them.  “I even accidentally met a girl,” said George. “She’d lived all her life in that building, inside never meeting out. I brought her fancy tea from the outside, and she gave me muffins. I never really felt like I could relate to her, I guess, because she was human, but I did care about her. We got married. We got married and she moved out with me. We got a place above the sea. She’d never been outside the building before. She was excited. I was thirty by this point.” He took a breath.  “If you start telling me about your rugrats,” I said, “I will shoot both of us.” I took off the safety on my pistol to show him I was serious. I didn’t turn around. I still felt that if I turned around I would be surrendering some sort of power. He stopped talking then. I had finally got my point across.  We reached the crack in the dome, and still nothing. The dome was maybe four hundred meters across, a perfect hemisphere. The crack dwarfed me, and reached almost to the top of the structure. I switched on my helmet light and walked into the dome, which I knew was almost completely empty except for dirt and something resembling moss that grew in furthest edges, away from the sun.  I didn’t need my helmet light. I could see her, almost at the center of the dome, lit by the orange rays of the dying sun, her helmet still on and her guts strewn across the floor.  “We need to leave,” I said.  “Aren’t you going to see if she’s alive?” asked George.  “She’s dead. Get out of the dome. Let’s go.” I could sell the cargo, I was thinking, if I lived.  We spilled out onto the street and froze. In the center of the street there was a creature, with dark red skin, taller than a man, many thin limbs protruding spider-like from its body. It had a neck like a human, but where a face would be there was something that looked almost like a hand; a blank palm in the middle with extremities around it. It froze at the same time we did. After a second one of its limbs moved as if to sidestep and I shot it in the palm of its face, and it fell down gushing bright blood, twitching and flicking its limbs like an insect that does not know it is dead yet. I walked over to it and stamped down hard on its face with my metal boot, and it stopped moving. I tried not to notice as I did this that its limbs were not clawed and that it had no weapons. It had probably not been what killed Jennet. It was probably harmless, and may have been intelligent. It could have been what built this city.  George was crouching on the ground. I could not tell if he was fascinated or if he was going to be sick.  “It’s hard to raise kids when you are an alien,” he said, his eyes fixed on the sticky mess that my boot had left behind. “They grow into a world you don’t understand. I guess they turned out okay, but it wasn’t anything to do with me.”  Back in the ship with my helmet off, I could smell the goo that had congealed on the boot of my armor. It was rank. Behind me as we took off, I could hear George take a breath. Don’t talk about marriage, I thought, don’t talk about marriage.  “We stayed there, on that island floating above the sea, even after the children left. We sent drones out to buy food, and she talked to her old tower friends online, but she was lonely. I spent more and more time looking up into the sky. She was so tolerant.”  Christ. I would definitely not be turning around.  I saw a figure on the scanner I might normally ignore, the sort of reading that could be anything, usually, but in the context of where we were . . . I opened up more visual channels and searched the sky as we rose towards the stratosphere.  There: slippery intentions, black against orange sky. Two tracking drones, above, shaped like finless, faceless sharks, flicking through the atmosphere towards us. Blades along their sides. They were what happened to Jennet.  My ship wasn’t armed exactly. It would raise too many questions if I was stopped. But I had modified the rubbish ejector and loaded it with incendiaries. I only had one shot, and I had to wait for both of the shark-things to get close enough.  Closer.  “I should have explained,” said George. “It might have helped.”  Closer. They circled around my flank.  “I got angry sometimes,” said George, “because it seemed unreasonable for her to want something I couldn’t give. We would fight.”  Now. I ejected the load, and as I had hoped they both sped towards it to investigate before it exploded. One of them disappeared, the other emerged from the explosion as a ball of flames and thunked off the side of the ship.  I checked the damage indicator. We were okay.  “We talked about separating for a while,” said George. We broke atmo. I stayed facing forward.  Once we were in the silence of space I set course for a port I knew that might buy Jennet’s stuff. I could get rid of my passenger there. Time passed. My hands were sweaty inside my suitgloves, from the action. Memories started butting up against their walls again. I could feel his eyes on me. I listened to see if I could hear his breathing.  “Well?” I said.  “I’m sorry?”  “You didn’t finish. Or is this the part where I’m meant to break down and tell you why I’m out here, huh? How badly I screwed up that I prefer this metal fucking coffin to anywhere else?”  There was not a sound from him.  “Well, nobody gets to hear that story,” I said. “Nobody.”  He still didn’t move. I gripped the side of my chair so I would not turn around. It was minutes before he spoke:  “My wife used to play a Callistan harp. Everyone who heard her music said it was so beautiful it would break your heart. I told her I loved to hear it. I never felt anything, though. Why would I? I was an alien.  “We had to stay together, even if I couldn’t make her happy, even if we didn’t understand each other. We had each forgotten how to live without the other. I don’t even know what happened in all the years after that. Nothing happened.”  Nothing happened. Oh, for a life where nothing had happened. The damage console beeped. Something had gone undetected for a while. I pulled up the display.  “I think the life support has stopped working,” I said.  “That’s not right,” he said.  I did some quick calculations and changed course for Joetown. “We have a bit under eight hours to our destination,” I said. “And about sixteen . . . no, eight hours oxygen including reserves. Don’t talk. Lie down on the floor so you aren’t doing anything and you won’t use as much.”  I turned off the cabin lights and we did not talk. I closed my eyes and tried to slow my breathing.  Eight hours in the chair while the air grew thick and clammy. I closed my eyes and I tried to sleep. Maybe I did sleep.  The console beeped and I opened my eyes. Our destination was in view. Joetown space port was a tangle of straight lines in neon colors, each of them kilometers long.  I don’t remember making a sound, but somehow at that moment I had given him permission to speak. I remember wondering if he had heard the sound of my eyelid popping free of its crust and slipping across my cornea.  He gave a cough. “It was when I was old and sick that I figured it out,” he said. “They took me to an orbital hospital, and I was lying there, riddled with cancer, and for the first time I was off the planet I had lived on for my entire life. My home. I could see the planet below me, and both of my children were there, and my wife was there. This woman who had given up so much for me, for love. As I lay dying, it occurred to me for the first time that I wasn’t an alien at all. That I never had been. That was my last thought, that realization. And then I was dead.”  I turned around to face him. But of course, he wasn’t there. Perhaps we were a jumble in his waking mind, waiting to be dreamt again. The flashing lines of Joetown spaceport illuminated the dark inside of my ship in misleading ways, and I waited for docking clearance.", "text": "2710 words, short story\nIn Which Faster-Than-Light Travel Solves All of Our Problems\nI live in my cockpit. I piss in a bottle and I cross the vastest vastness in my shining tin can. I’ve seen more of nothing than just about anyone, but if I’m telling you about it then you aren’t really here, because it’s just me out here. Every month or so I jerk off to pictures of shapes so airbrushed they aren’t human, and I drop my tissues on the floor and leave them there. Every seven months or so I leave my ship for repairs and spend a few nights getting drunk and listening to old travelers who have either forgotten how to be human or are pretending they aren’t so they can fit in, and then if I’m flush spend the night with someone who is pretending they aren’t because I’ve paid them.\nBut mostly, I just live in my cockpit. I freight anything. Whatever, wherever, if you can pay. I had to make a pickup on an asteroid. I set my ship down on the thing, a sad grey chunk of rock. I put on my helmet and went out on the surface to collect what had been hidden there for me. It was a place that nobody would go, where everything was quiet and dark. There was a man there.\nHe was tall, and his grey dusty vacuum suit did not look nearly protective enough to deal with what small bits of grit might hit it at high speed. Its helmet let me see most of his head, which was grey and balding.\n“Who are you?” I said.\n“I’m George.”\n“What the fuck are you doing here?”\n“I was hoping you could give me a lift.”\n“I don’t do passengers.”\n“I’m going to run out of oxygen soon.”\n“That’s your problem.”\nI made him stand in the cockpit behind me, and I told him to be quiet. He had taken off his helmet once we were in, and I was waiting for him to say something about the smell. Not saying anything was almost worse. He remained impassive. He was a lot taller than me, and older, and I wasn’t sure if his face was beaten or just dour.\nI resolved to ignore him. I set course for the rendezvous with Jennet. There’s a trick I have that is so old it isn’t a trick anymore, where I can turn my mind off while I sit here watching the scanners. Hours can pass without a thought, but I couldn’t do it with George behind me. The minutes and the hours dragged by and my mind kept slipping into places I did not want it to go. People. I did not want to think about people. I will not tell you what the memories were. After six hours and forty-three minutes of this, George spoke:\n“I realized that I was an alien when I was very young.”\nI didn’t turn around or respond. If you acknowledge people, it gives them power. This was my space. I wondered what being an alien could even mean these days.\n“I thought the other children could tell,” he continued. “My parents told me I have always been odd, right since the start.”\nWe were less than three hours from the rendezvous, and I was suddenly worried that George was here to observe and capture me. Probably he wasn’t: My ship scans automatically for tracking and recording devices whenever someone boards, and he had neither. But what had he been doing on that rock?\nIt didn’t matter. To show interest would be to become complicit, and besides that a distraction. On a job like this, you have to keep your eye on the scanners all the time. Some things are hard to see, and the auto alerts won’t necessarily get tripped. Some things are designed especially not to trip them, altering their shape to match every firmware update. Slippery intentions moving shark-like through space, black against black. I slapped myself, concentrated.\nI could hear George behind me, breathing. His breathing didn’t sound entirely steady. Occasionally, he would snort or even cough, and I would try not to flinch. Eventually he spoke again:\n“When I was five we went to the mechanical circus. The ringmaster’s eyes glowed and he cracked his whip, the horses trotted around, and there was one girl, she was so pretty up on top of that horse, so . . . lithe. And bright. There was some sort of magic there, under the lights. Maybe she wasn’t an automaton. She wrapped herself up in pieces of silk and fell into perfect shapes above us, and I thought maybe she’s an alien like me. Maybe the ringmaster keeps her against her will. Maybe she needs my help. And I started crying because I couldn’t help her.” He sniffed and snorted, a casual rearrangement of mucous at the back of his throat.\n“Looking back,” he said, “she probably was an automaton, and she probably never needed my help. But I never found out. She sure was pretty, though.”\nI couldn’t figure out which was worse. The silence—so oppressive and different from the silence of being alone—or his odd little confessions. I kept my eyes on the scanners. I said nothing. We were coming up on the planet, a lonely sphere of yellow and grey dust orbiting a nearly burnt out star.\n“I hid when I was a teenager. I didn’t want anyone to know, so I didn’t expose myself. I didn’t love. I thought someone was cute sometimes, but I was an alien. It couldn’t work.”\n“Shut up,” I said. I could talk, I decided. I just would not look at him.\nJennet and I had met on ZK93 before. It was charted, but I knew of no other humans who had bothered to travel there. I wasn’t worried about George finding out where we were: my displays and HUD were all in a script only I could read. There was a city on the planet, long abandoned. By who or what, I did not know. The architecture had sediment lines, as if it had all been carved whole out of the rock that had been there.\nYou don’t leave someone with your ship if you don’t know them. I made George follow behind me, him in his flimsy vac-suit, me in my armor, trudging beneath the unfinished sandstone spires and broken bridges of the forgotten city.\n“When I was twenty,” said George over the comm, “I had to get a job in a tall building.”\nThe towers around us remained obscure.\n“The elevator ride was twenty minutes,” he said, “and you couldn’t see the ground out the window, just other towers and elevated roads and bridges and lights blinking in the mist. Inside was clean and sterile, and people had lines around them so that nobody could see their inside from the outside. It was easy to be an alien, there. I could talk to people, because people didn’t talk about themselves.”\nWe were approaching the cracked dome in the center of the city, where Jennet and I had arranged to meet. But she wasn’t coming out. Something was wrong. I took out my pistol. I searched the tops of the towers. There were window holes everywhere. If someone was watching us, we’d never see them.\n“I even accidentally met a girl,” said George. “She’d lived all her life in that building, inside never meeting out. I brought her fancy tea from the outside, and she gave me muffins. I never really felt like I could relate to her, I guess, because she was human, but I did care about her. We got married. We got married and she moved out with me. We got a place above the sea. She’d never been outside the building before. She was excited. I was thirty by this point.” He took a breath.\n“If you start telling me about your rugrats,” I said, “I will shoot both of us.” I took off the safety on my pistol to show him I was serious. I didn’t turn around. I still felt that if I turned around I would be surrendering some sort of power. He stopped talking then. I had finally got my point across.\nWe reached the crack in the dome, and still nothing. The dome was maybe four hundred meters across, a perfect hemisphere. The crack dwarfed me, and reached almost to the top of the structure. I switched on my helmet light and walked into the dome, which I knew was almost completely empty except for dirt and something resembling moss that grew in furthest edges, away from the sun.\nI didn’t need my helmet light. I could see her, almost at the center of the dome, lit by the orange rays of the dying sun, her helmet still on and her guts strewn across the floor.\n“We need to leave,” I said.\n“Aren’t you going to see if she’s alive?” asked George.\n“She’s dead. Get out of the dome. Let’s go.” I could sell the cargo, I was thinking, if I lived.\nWe spilled out onto the street and froze. In the center of the street there was a creature, with dark red skin, taller than a man, many thin limbs protruding spider-like from its body. It had a neck like a human, but where a face would be there was something that looked almost like a hand; a blank palm in the middle with extremities around it. It froze at the same time we did. After a second one of its limbs moved as if to sidestep and I shot it in the palm of its face, and it fell down gushing bright blood, twitching and flicking its limbs like an insect that does not know it is dead yet. I walked over to it and stamped down hard on its face with my metal boot, and it stopped moving. I tried not to notice as I did this that its limbs were not clawed and that it had no weapons. It had probably not been what killed Jennet. It was probably harmless, and may have been intelligent. It could have been what built this city.\nGeorge was crouching on the ground. I could not tell if he was fascinated or if he was going to be sick.\n“It’s hard to raise kids when you are an alien,” he said, his eyes fixed on the sticky mess that my boot had left behind. “They grow into a world you don’t understand. I guess they turned out okay, but it wasn’t anything to do with me.”\nBack in the ship with my helmet off, I could smell the goo that had congealed on the boot of my armor. It was rank. Behind me as we took off, I could hear George take a breath. Don’t talk about marriage, I thought, don’t talk about marriage.\n“We stayed there, on that island floating above the sea, even after the children left. We sent drones out to buy food, and she talked to her old tower friends online, but she was lonely. I spent more and more time looking up into the sky. She was so tolerant.”\nChrist. I would definitely not be turning around.\nI saw a figure on the scanner I might normally ignore, the sort of reading that could be anything, usually, but in the context of where we were . . . I opened up more visual channels and searched the sky as we rose towards the stratosphere.\nThere: slippery intentions, black against orange sky. Two tracking drones, above, shaped like finless, faceless sharks, flicking through the atmosphere towards us. Blades along their sides. They were what happened to Jennet.\nMy ship wasn’t armed exactly. It would raise too many questions if I was stopped. But I had modified the rubbish ejector and loaded it with incendiaries. I only had one shot, and I had to wait for both of the shark-things to get close enough.\nCloser.\n“I should have explained,” said George. “It might have helped.”\nCloser. They circled around my flank.\n“I got angry sometimes,” said George, “because it seemed unreasonable for her to want something I couldn’t give. We would fight.”\nNow. I ejected the load, and as I had hoped they both sped towards it to investigate before it exploded. One of them disappeared, the other emerged from the explosion as a ball of flames and thunked off the side of the ship.\nI checked the damage indicator. We were okay.\n“We talked about separating for a while,” said George. We broke atmo. I stayed facing forward.\nOnce we were in the silence of space I set course for a port I knew that might buy Jennet’s stuff. I could get rid of my passenger there. Time passed. My hands were sweaty inside my suitgloves, from the action. Memories started butting up against their walls again. I could feel his eyes on me. I listened to see if I could hear his breathing.\n“Well?” I said.\n“I’m sorry?”\n“You didn’t finish. Or is this the part where I’m meant to break down and tell you why I’m out here, huh? How badly I screwed up that I prefer this metal fucking coffin to anywhere else?”\nThere was not a sound from him.\n“Well, nobody gets to hear that story,” I said. “Nobody.”\nHe still didn’t move. I gripped the side of my chair so I would not turn around. It was minutes before he spoke:\n“My wife used to play a Callistan harp. Everyone who heard her music said it was so beautiful it would break your heart. I told her I loved to hear it. I never felt anything, though. Why would I? I was an alien.\n“We had to stay together, even if I couldn’t make her happy, even if we didn’t understand each other. We had each forgotten how to live without the other. I don’t even know what happened in all the years after that. Nothing happened.”\nNothing happened. Oh, for a life where nothing had happened. The damage console beeped. Something had gone undetected for a while. I pulled up the display.\n“I think the life support has stopped working,” I said.\n“That’s not right,” he said.\nI did some quick calculations and changed course for Joetown. “We have a bit under eight hours to our destination,” I said. “And about sixteen . . . no, eight hours oxygen including reserves. Don’t talk. Lie down on the floor so you aren’t doing anything and you won’t use as much.”\nI turned off the cabin lights and we did not talk. I closed my eyes and tried to slow my breathing.\nEight hours in the chair while the air grew thick and clammy. I closed my eyes and I tried to sleep. Maybe I did sleep.\nThe console beeped and I opened my eyes. Our destination was in view. Joetown space port was a tangle of straight lines in neon colors, each of them kilometers long.\nI don’t remember making a sound, but somehow at that moment I had given him permission to speak. I remember wondering if he had heard the sound of my eyelid popping free of its crust and slipping across my cornea.\nHe gave a cough. “It was when I was old and sick that I figured it out,” he said. “They took me to an orbital hospital, and I was lying there, riddled with cancer, and for the first time I was off the planet I had lived on for my entire life. My home. I could see the planet below me, and both of my children were there, and my wife was there. This woman who had given up so much for me, for love. As I lay dying, it occurred to me for the first time that I wasn’t an alien at all. That I never had been. That was my last thought, that realization. And then I was dead.”\nI turned around to face him. But of course, he wasn’t there. Perhaps we were a jumble in his waking mind, waiting to be dreamt again. The flashing lines of Joetown spaceport illuminated the dark inside of my ship in misleading ways, and I waited for docking clearance.", "source": "https://clarkesworldmagazine.com/stabback_12_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In Which Faster-Than-Light Travel Solves All of Our Problems by Chris Stabback"}