{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Julie Nováková", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VeKcVPSbz63vw4+njzdCY0Gf1bo=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Realms of Dark, Deep and Cold  These places never see sunlight, are buried deep under thick ice crusts and warmed mostly by radioactive decay and tidal forces: subsurface oceans of celestial objects far from their stars—if they have any. Decades ago, they were the domain of science fiction, until such places were hypothesized in our solar system thanks in part to Voyager flybys of Europa in 1979. Shortly after, the idea was popularized when it appeared in Arthur C. Clarke’s Space Odyssey saga. Since then, we learned much more about characteristics of possible subsurface oceans, discovered that they probably exist on more worlds than we dared to expect just a few years ago, and that they’re more fascinating than even SF authors hoped.  1979 changed our view of Europa forever. Images sent by the Voyagers sparked great interest in the moon. The surface was peculiar: quite smooth, with high albedo, few impact craters and a lot of strange ridges and cracks. This led to speculations about the existence of an ocean of liquid water under the outer ice shell. This would enable geological activity strong enough to erase older features like impact craters and provide extensional stress on the crust, resulting in formation of linear troughs we see on the surface.  Later, observations were able to tell us that these notions are most likely true. An ocean is the simplest explanation for the diverse geology of Europa’s surface. Some of the present chemical compounds, couple with the interaction of the moon with Jupiter’s magnetosphere indicates presence of liquid water underneath the ice layer. In the giant’s magnetic field, Europa produces an induced magnetic field that would not be possible without a layer capable of conducting electrical current. The strength and direction of the induced field suggests an ocean of liquid water with a high concentration of dissolved salts and acids, at least a couple of dozen or more than 150 km deep.  These findings kindled a lot of enthusiasm about Europa, and lander missions were proposed. So why aren’t we there already?  Besides worries about contamination, there is a serious technical problem. Jupiter’s strong magnetic field interacts with particles around the planet (mainly released from Io’s numerous volcanoes) and creates strong radiation belts full of accelerated ionized atoms and molecules. They caused Pioneer 11 to lose the majority of images it had captured of Io. Even the probe Galileo, constructed to withstand the harsh environment close to Jupiter, experienced glitches due to the radiation.  Unfortunately for our plans of space exploration, Europa is right inside the belts. Any spacecraft to land there would have to endure extreme levels of ionizing radiation that would kill a human, even equipped with a space suit, in less than an hour. Sorry, Arthur C. Clarke, but astronauts walking on the surface of Europa shall remain science fiction.  Another problem for any missions to explore Europa’s oceans directly is that we don’t know the thickness and structure of the outer ice crust. Should we expect it to be just a few or several dozen kilometers thick, formed by hard brittle ice only or with additional warm convecting layer underneath? And if a device tried to melt through the shell, wouldn’t it quickly become encrusted in salts and trapped?  So far, ESA’s JUICE mission is planned to be launched in 2022 and to explore Ganymede, Callisto and Europa. All lander missions are still just concepts and will likely remain so for a long time, until we know more about the ice shell and the ocean.  Until the new spacecraft is able to tell us more, we can only speculate about the characteristics of Europa’s ocean. Let’s take a closer look on whether it could potentially support life as we know it.  Life needs a few basic things to exist: water as a solvent, an energy source, building blocks, chemical and energetic disequilibria. All of that can be found on Europa—but whether they are in sufficient quantities, we don’t yet know.  Liquid water is not a constraint—even in the case of a very thick ice shell, there’s most likely at least two times more than in the Earth’s oceans. But water alone is not enough—any life would need chemical cycles to emerge. Without them, some substances could quickly become depleted or too abundant. The ocean also needs to be in contact with the rocky mantle for geochemical cycles to exist. According to most models, it is; but some predict a layer of high-pressure ice beneath the liquid, which would restrain access of water to the rock underneath. If material leaches from the bedrock into the water, the essential building blocks for life should be evident. Their concentration would likely be low, however, but many Earth extremophile microbes can cope with that.  The salinity and composition of the ocean remains another unresolved question. Based on the induced magnetic field and chemical compounds on the icy surface, it can be slightly less salty than Earth’s ocean water or in contrast, almost twice as salty as the Dead Sea. In the latter case, only the most extreme halophile bacteria could survive such conditions.  Saltiness might not be the biggest problem. Imagine an ocean full of hydrolyzed sulfuric acid, with a pH less than 1. That’s one extreme—but it can be highly alkaline as well. It can also be relatively reduced or oxidized, depending mostly on Europa’s early history. Jupiter used to be warmer in the early days of the solar system and Europa could have had an ocean on the surface and an atmosphere of mostly water vapor. In such a case, the ocean would likely become oxidized.  As for temperature, it can be somewhere between a few °C above zero and -40 °C—still liquid thanks to high salinity and the anti-freeze effect of ammonia. Near hydrothermal vents, should there be any, the temperature could rise to a couple of hundred °C.  Organisms on Europa would also need to be able to withstand high pressure. On Earth, microorganisms capable of reproducing under extremes of all the above conditions together exist, many of them in the genus Halomonas. And with enough oxygen—which could be produced by breakdown of water by radiation occurring in the ice shell and absorbed into the ocean—even more microorganisms might possibly survive there.  How would possible Europan life gain energy? Methanogenesis, which can occur under a wide range of conditions feasible in the ocean, seems the most likely candidate so far. Depending on the real parameters, a Europan ocean might be capable of supporting several trophic levels and therefore a sustainable, albeit probably poor, ecosystem.  Europa is the most famous object with a probable inner ocean—but only one of many. Other two Galilean moons, Ganymede and Callisto, are also believed to host a subsurface body of liquid water. However, most models suggest that their oceans are “sandwiched” between the outer shell and a layer of high-pressure ice beneath. Without a direct connection with a rocky mantle, they would lack conditions for life that Europa might potentially harbor.    Image 1: The four Galilean moons. Europa, Ganymede and Callisto are all thought to have subsurface oceans. However, in Ganymede’s case a thick layer of high-pressure ice beneath it is predicted. In Callisto’s case, this layer is believed to be much thinner, but note that the moon’s interior is not differentiated, unlike the other Galilean moons. As far as we can tell from gravitational pull data, it’s a relatively uniform mixture of rock and ice. Unlike bedrock of a differentiated mantle, it wouldn’t provide many opportunities of geochemical cycles and any hydrothermal activity is highly unlikely. Courtesy of NASA/JPL-Caltech.  If we move from Jupiter to Saturn, we’ll encounter one of the most intriguing bodies of the solar system: Titan. Under the orange-brownish haze of its dense atmosphere, there are alkane seas and rivers, tholin dunes and methane snows. About two hundred km underneath this fantastic landscape, an ocean of water and ammonia might be hidden. But according to most models, it’s trapped between two layers of ice as well.  Another fascinating object orbiting Saturn is the tiny moon Enceladus. Ever since the Cassini spacecraft observed geysers on its south pole, its cryovolcanic activity remains a mystery. Current tidal heating of the moon is negligible, and so should be the amount of radioactive decay due to its small size. Models of radioactive heating failed to explain the ocean—yet the moon is very active. Its surface appears young and long linear “tiger stripes” near the south pole indicate extensional stress: an indirect sign of subsurface liquid. More intense past tidal forces and present shear heating have been proposed but it’s still not certain whether they’d be sufficient for keeping the little moon spawning ice particles into Saturn’s previously mysterious E-ring. Most models suggest a large pocket of water underneath the south pole but a global ocean is not ruled out. What’s more, it’s likely in contact with bedrock and many authors agree that the geochemical conditions for life might be met.    Image 2: A false-color mosaic of pictures of Enceladus taken by the Cassini spacecraft. The famous “tiger stripes” can be seen near the south pole where geysers were also observed. Courtesy of NASA/JPL/Space Science Institute.  Existence of a subsurface ocean is also feasible on several other Saturn’s moons: Dione, where water vapor was recently detected, and Rhea; less likely Tethys and Iapetus.  Similar claims were made about Titania and Oberon, the largest moons of the ice giant Uranus. But for an example of a truly cryovolcanically active body, we need to move even further: to Neptune and its only large satellite, Triton. Triton is thought to be a captured Kuiper belt object due to its retrograde orbit, high tilt and the conspicuous absence of other large moons. It’s theorized that Triton might have “kicked them out” in the wild early days of being caught by Neptune’s gravity.  Plumes of water have been detected on Triton and its surface tells a similar story to that of Europa or Enceladus. During the early epoch of the solar system, tidal heating of the captured moon would be significant, enough to melt a part of its icy interior. These oceans, covered by a shell that doesn’t conduct heat particularly well, might have a long duration. Combined with radioactive decay and enough anti-freeze compounds like ammonia, plentiful in these regions of the solar system, we can see that it’s likely not easy to freeze an ocean once it’s there.  But we need not to be constrained to moons of the giants. If we look closer, in the space between orbits of Mars and Jupiter, we find a wide asteroid belt. Could bodies of liquid water be there too?  Just recently, water vapor was detected on Ceres—the largest object of the belt, containing about one third of the mass of the whole belt. The spacecraft Dawn is scheduled to arrive to the dwarf planet in February 2015.  However, the asteroid belt between Mars and Jupiter is just a playground compared to the Kuiper belt. Beyond the orbit of Neptune lies an area where our Sun appears as a mere very bright star, and countless worlds of ice take their long journeys around it. The best known Kuiper belt object is the dwarf planet Pluto, with its faithful companion Charon. When the probe New Horizons was launched, Pluto was still considered a planet, but was reclassified shortly thereafter. This changed nothing about the fact that Pluto is an interesting and mysterious object. No close observations have been made yet—but that’s about to change in 2015 when New Horizons should reach Pluto, its large moon Charon and four smaller moons.  During the flyby, it might tell us more fascinating facts about Pluto than expected. In 2006, shortly after the probe was launched, a study by Hussmann et al. explored the topic of radiogenic heating of mid-sized icy objects. They found that most models permitted the existence of a subsurface liquid body of water not just in Pluto and Charon, but also a number of other Kuiper belt objects. If an ocean truly is inside Pluto, no fossil bulge from an early period of faster rotation should exist—the influence of the ocean would erase it. Observation of cryovolcanism—indicated on Charon by the spectroscopic detection of crystalline water ice—would be an even better proof. Next year, we shall see.  Eris, a dwarf planet discovered in 2005, might be an even better candidate for an ocean under ice than Pluto due to its larger size and therefore more radioactive elements. The list of Kuiper belt objects likely to host subsurface liquid water might also continue to grow including bodies like Quaoar and Orcus.  The furthest object of the solar system, for which a subsurface ocean has been proposed, is the dwarf planet Sedna. In its perihelion, the point of the least distance to the Sun, it’s 76 AU away from our star—still more than twice and half further than Pluto in its own perihelion. However, due to the extremely high eccentricity of its orbit, Sedna travels as far as about 940 AU far from the Sun in the aphelion—much more than seven times the distance Voyager 1, the furthest human-made object, has made until now. Like Triton, it can tell us a wild fascinating story about the origins of our solar system—if we listen.  It’s hard to imagine that oceans of liquid water would exist so very far from the Sun but models of radioactive decay suggest it’s possible. And with enough ammonia and a well-isolating shell, even an ocean with temperature around -100 °C might exist.  Sedna is just one of the solar system objects that proved that our own system is more fantastic and its history more compelling than we could imagine. But our gaze inevitably travels to other stars as we ask ourselves a question whether conditions suitable for life exist out there.  Existences of subsurface oceans have been proposed for several known exoplanets, namely three planets in the Gliese 667 C system (f, e and d) and Gliese 581d. Will we ever find out whether these predictions are true?  Detection of subsurface oceans on extrasolar planets would be complicated—but nevertheless feasible. We can use the same indicators of cryovolcanism as for the objects orbiting our Sun: crystalline water ice and ammonia hydrate. They can be detected spectroscopically, hopefully by the next generation of telescopes like proposed FINESSE, ESM, EchO and last but not least the JWST, planned to be launched in 2018.  But should we constrain ourselves just to looking to other stars?  We’ve already discovered a couple of starless, rogue planets. Some may have been ejected from their birth systems, and some may have formed on their own in case of brown dwarfs. Some may host subsurface oceans under thick crusts of ice; some may have exomoons with such conditions.  There are at least one hundred billion stars in our galaxy. Many of these systems could be homes for objects with subsurface oceans; we need not look just into narrow “habitable zones” for such places. And according to the more optimistic estimates, there can be twice as many free-floating planets than there are stars in the Milky Way.  Though most subsurface oceans would probably have trouble supporting even extremophile life forms as we know them, they still may be one of the most abundant environments potentially suitable for life. Looking at our own solar system and beyond, we can see countless worlds full of the most intriguing possibilities.  “ ‘Oceans under ice’ could be a common feature . . . , largely spread around low-mass stars in the Galaxy.”—Ehrenreich & Cassan, 2006  Special thanks to Tomas Petrasek, Czech author of astrobiology popular science books “Vzdalene svety I, II” (“Distant Worlds I and II”), for beta-reading the article.  Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "text": "Non-Fiction\nRealms of Dark, Deep and Cold\nThese places never see sunlight, are buried deep under thick ice crusts and warmed mostly by radioactive decay and tidal forces: subsurface oceans of celestial objects far from their stars—if they have any. Decades ago, they were the domain of science fiction, until such places were hypothesized in our solar system thanks in part to Voyager flybys of Europa in 1979. Shortly after, the idea was popularized when it appeared in Arthur C. Clarke’s Space Odyssey saga. Since then, we learned much more about characteristics of possible subsurface oceans, discovered that they probably exist on more worlds than we dared to expect just a few years ago, and that they’re more fascinating than even SF authors hoped.\n1979 changed our view of Europa forever. Images sent by the Voyagers sparked great interest in the moon. The surface was peculiar: quite smooth, with high albedo, few impact craters and a lot of strange ridges and cracks. This led to speculations about the existence of an ocean of liquid water under the outer ice shell. This would enable geological activity strong enough to erase older features like impact craters and provide extensional stress on the crust, resulting in formation of linear troughs we see on the surface.\nLater, observations were able to tell us that these notions are most likely true. An ocean is the simplest explanation for the diverse geology of Europa’s surface. Some of the present chemical compounds, couple with the interaction of the moon with Jupiter’s magnetosphere indicates presence of liquid water underneath the ice layer. In the giant’s magnetic field, Europa produces an induced magnetic field that would not be possible without a layer capable of conducting electrical current. The strength and direction of the induced field suggests an ocean of liquid water with a high concentration of dissolved salts and acids, at least a couple of dozen or more than 150 km deep.\nThese findings kindled a lot of enthusiasm about Europa, and lander missions were proposed. So why aren’t we there already?\nBesides worries about contamination, there is a serious technical problem. Jupiter’s strong magnetic field interacts with particles around the planet (mainly released from Io’s numerous volcanoes) and creates strong radiation belts full of accelerated ionized atoms and molecules. They caused Pioneer 11 to lose the majority of images it had captured of Io. Even the probe Galileo, constructed to withstand the harsh environment close to Jupiter, experienced glitches due to the radiation.\nUnfortunately for our plans of space exploration, Europa is right inside the belts. Any spacecraft to land there would have to endure extreme levels of ionizing radiation that would kill a human, even equipped with a space suit, in less than an hour. Sorry, Arthur C. Clarke, but astronauts walking on the surface of Europa shall remain science fiction.\nAnother problem for any missions to explore Europa’s oceans directly is that we don’t know the thickness and structure of the outer ice crust. Should we expect it to be just a few or several dozen kilometers thick, formed by hard brittle ice only or with additional warm convecting layer underneath? And if a device tried to melt through the shell, wouldn’t it quickly become encrusted in salts and trapped?\nSo far, ESA’s JUICE mission is planned to be launched in 2022 and to explore Ganymede, Callisto and Europa. All lander missions are still just concepts and will likely remain so for a long time, until we know more about the ice shell and the ocean.\nUntil the new spacecraft is able to tell us more, we can only speculate about the characteristics of Europa’s ocean. Let’s take a closer look on whether it could potentially support life as we know it.\nLife needs a few basic things to exist: water as a solvent, an energy source, building blocks, chemical and energetic disequilibria. All of that can be found on Europa—but whether they are in sufficient quantities, we don’t yet know.\nLiquid water is not a constraint—even in the case of a very thick ice shell, there’s most likely at least two times more than in the Earth’s oceans. But water alone is not enough—any life would need chemical cycles to emerge. Without them, some substances could quickly become depleted or too abundant. The ocean also needs to be in contact with the rocky mantle for geochemical cycles to exist. According to most models, it is; but some predict a layer of high-pressure ice beneath the liquid, which would restrain access of water to the rock underneath. If material leaches from the bedrock into the water, the essential building blocks for life should be evident. Their concentration would likely be low, however, but many Earth extremophile microbes can cope with that.\nThe salinity and composition of the ocean remains another unresolved question. Based on the induced magnetic field and chemical compounds on the icy surface, it can be slightly less salty than Earth’s ocean water or in contrast, almost twice as salty as the Dead Sea. In the latter case, only the most extreme halophile bacteria could survive such conditions.\nSaltiness might not be the biggest problem. Imagine an ocean full of hydrolyzed sulfuric acid, with a pH less than 1. That’s one extreme—but it can be highly alkaline as well. It can also be relatively reduced or oxidized, depending mostly on Europa’s early history. Jupiter used to be warmer in the early days of the solar system and Europa could have had an ocean on the surface and an atmosphere of mostly water vapor. In such a case, the ocean would likely become oxidized.\nAs for temperature, it can be somewhere between a few °C above zero and -40 °C—still liquid thanks to high salinity and the anti-freeze effect of ammonia. Near hydrothermal vents, should there be any, the temperature could rise to a couple of hundred °C.\nOrganisms on Europa would also need to be able to withstand high pressure. On Earth, microorganisms capable of reproducing under extremes of all the above conditions together exist, many of them in the genus Halomonas. And with enough oxygen—which could be produced by breakdown of water by radiation occurring in the ice shell and absorbed into the ocean—even more microorganisms might possibly survive there.\nHow would possible Europan life gain energy? Methanogenesis, which can occur under a wide range of conditions feasible in the ocean, seems the most likely candidate so far. Depending on the real parameters, a Europan ocean might be capable of supporting several trophic levels and therefore a sustainable, albeit probably poor, ecosystem.\nEuropa is the most famous object with a probable inner ocean—but only one of many. Other two Galilean moons, Ganymede and Callisto, are also believed to host a subsurface body of liquid water. However, most models suggest that their oceans are “sandwiched” between the outer shell and a layer of high-pressure ice beneath. Without a direct connection with a rocky mantle, they would lack conditions for life that Europa might potentially harbor.\nImage 1: The four Galilean moons. Europa, Ganymede and Callisto are all thought to have subsurface oceans. However, in Ganymede’s case a thick layer of high-pressure ice beneath it is predicted. In Callisto’s case, this layer is believed to be much thinner, but note that the moon’s interior is not differentiated, unlike the other Galilean moons. As far as we can tell from gravitational pull data, it’s a relatively uniform mixture of rock and ice. Unlike bedrock of a differentiated mantle, it wouldn’t provide many opportunities of geochemical cycles and any hydrothermal activity is highly unlikely. Courtesy of NASA/JPL-Caltech.\nIf we move from Jupiter to Saturn, we’ll encounter one of the most intriguing bodies of the solar system: Titan. Under the orange-brownish haze of its dense atmosphere, there are alkane seas and rivers, tholin dunes and methane snows. About two hundred km underneath this fantastic landscape, an ocean of water and ammonia might be hidden. But according to most models, it’s trapped between two layers of ice as well.\nAnother fascinating object orbiting Saturn is the tiny moon Enceladus. Ever since the Cassini spacecraft observed geysers on its south pole, its cryovolcanic activity remains a mystery. Current tidal heating of the moon is negligible, and so should be the amount of radioactive decay due to its small size. Models of radioactive heating failed to explain the ocean—yet the moon is very active. Its surface appears young and long linear “tiger stripes” near the south pole indicate extensional stress: an indirect sign of subsurface liquid. More intense past tidal forces and present shear heating have been proposed but it’s still not certain whether they’d be sufficient for keeping the little moon spawning ice particles into Saturn’s previously mysterious E-ring. Most models suggest a large pocket of water underneath the south pole but a global ocean is not ruled out. What’s more, it’s likely in contact with bedrock and many authors agree that the geochemical conditions for life might be met.\nImage 2: A false-color mosaic of pictures of Enceladus taken by the Cassini spacecraft. The famous “tiger stripes” can be seen near the south pole where geysers were also observed. Courtesy of NASA/JPL/Space Science Institute.\nExistence of a subsurface ocean is also feasible on several other Saturn’s moons: Dione, where water vapor was recently detected, and Rhea; less likely Tethys and Iapetus.\nSimilar claims were made about Titania and Oberon, the largest moons of the ice giant Uranus. But for an example of a truly cryovolcanically active body, we need to move even further: to Neptune and its only large satellite, Triton. Triton is thought to be a captured Kuiper belt object due to its retrograde orbit, high tilt and the conspicuous absence of other large moons. It’s theorized that Triton might have “kicked them out” in the wild early days of being caught by Neptune’s gravity.\nPlumes of water have been detected on Triton and its surface tells a similar story to that of Europa or Enceladus. During the early epoch of the solar system, tidal heating of the captured moon would be significant, enough to melt a part of its icy interior. These oceans, covered by a shell that doesn’t conduct heat particularly well, might have a long duration. Combined with radioactive decay and enough anti-freeze compounds like ammonia, plentiful in these regions of the solar system, we can see that it’s likely not easy to freeze an ocean once it’s there.\nBut we need not to be constrained to moons of the giants. If we look closer, in the space between orbits of Mars and Jupiter, we find a wide asteroid belt. Could bodies of liquid water be there too?\nJust recently, water vapor was detected on Ceres—the largest object of the belt, containing about one third of the mass of the whole belt. The spacecraft Dawn is scheduled to arrive to the dwarf planet in February 2015.\nHowever, the asteroid belt between Mars and Jupiter is just a playground compared to the Kuiper belt. Beyond the orbit of Neptune lies an area where our Sun appears as a mere very bright star, and countless worlds of ice take their long journeys around it. The best known Kuiper belt object is the dwarf planet Pluto, with its faithful companion Charon. When the probe New Horizons was launched, Pluto was still considered a planet, but was reclassified shortly thereafter. This changed nothing about the fact that Pluto is an interesting and mysterious object. No close observations have been made yet—but that’s about to change in 2015 when New Horizons should reach Pluto, its large moon Charon and four smaller moons.\nDuring the flyby, it might tell us more fascinating facts about Pluto than expected. In 2006, shortly after the probe was launched, a study by Hussmann et al. explored the topic of radiogenic heating of mid-sized icy objects. They found that most models permitted the existence of a subsurface liquid body of water not just in Pluto and Charon, but also a number of other Kuiper belt objects. If an ocean truly is inside Pluto, no fossil bulge from an early period of faster rotation should exist—the influence of the ocean would erase it. Observation of cryovolcanism—indicated on Charon by the spectroscopic detection of crystalline water ice—would be an even better proof. Next year, we shall see.\nEris, a dwarf planet discovered in 2005, might be an even better candidate for an ocean under ice than Pluto due to its larger size and therefore more radioactive elements. The list of Kuiper belt objects likely to host subsurface liquid water might also continue to grow including bodies like Quaoar and Orcus.\nThe furthest object of the solar system, for which a subsurface ocean has been proposed, is the dwarf planet Sedna. In its perihelion, the point of the least distance to the Sun, it’s 76 AU away from our star—still more than twice and half further than Pluto in its own perihelion. However, due to the extremely high eccentricity of its orbit, Sedna travels as far as about 940 AU far from the Sun in the aphelion—much more than seven times the distance Voyager 1, the furthest human-made object, has made until now. Like Triton, it can tell us a wild fascinating story about the origins of our solar system—if we listen.\nIt’s hard to imagine that oceans of liquid water would exist so very far from the Sun but models of radioactive decay suggest it’s possible. And with enough ammonia and a well-isolating shell, even an ocean with temperature around -100 °C might exist.\nSedna is just one of the solar system objects that proved that our own system is more fantastic and its history more compelling than we could imagine. But our gaze inevitably travels to other stars as we ask ourselves a question whether conditions suitable for life exist out there.\nExistences of subsurface oceans have been proposed for several known exoplanets, namely three planets in the Gliese 667 C system (f, e and d) and Gliese 581d. Will we ever find out whether these predictions are true?\nDetection of subsurface oceans on extrasolar planets would be complicated—but nevertheless feasible. We can use the same indicators of cryovolcanism as for the objects orbiting our Sun: crystalline water ice and ammonia hydrate. They can be detected spectroscopically, hopefully by the next generation of telescopes like proposed FINESSE, ESM, EchO and last but not least the JWST, planned to be launched in 2018.\nBut should we constrain ourselves just to looking to other stars?\nWe’ve already discovered a couple of starless, rogue planets. Some may have been ejected from their birth systems, and some may have formed on their own in case of brown dwarfs. Some may host subsurface oceans under thick crusts of ice; some may have exomoons with such conditions.\nThere are at least one hundred billion stars in our galaxy. Many of these systems could be homes for objects with subsurface oceans; we need not look just into narrow “habitable zones” for such places. And according to the more optimistic estimates, there can be twice as many free-floating planets than there are stars in the Milky Way.\nThough most subsurface oceans would probably have trouble supporting even extremophile life forms as we know them, they still may be one of the most abundant environments potentially suitable for life. Looking at our own solar system and beyond, we can see countless worlds full of the most intriguing possibilities.\n“ ‘Oceans under ice’ could be a common feature . . . , largely spread around low-mass stars in the Galaxy.”—Ehrenreich & Cassan, 2006\nSpecial thanks to Tomas Petrasek, Czech author of astrobiology popular science books “Vzdalene svety I, II” (“Distant Worlds I and II”), for beta-reading the article.\nJulie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "source": "https://clarkesworldmagazine.com/novakova_04_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Realms of Dark, Deep and Cold by Julie Nováková"}