{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Isabel J Kim", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "b3XLqExQtmdu/r9tB9Lrt4kgWss=", "id": null, "license": null, "comments": "", "raw_text": "5960 words, short story  Termination Stories for the Cyberpunk Dystopia Protagonist  Cool and Sexy Asian Girl stands outside the convenience store under the striped awning and waits for the rain to stop. The rain is never going to stop. Cool and Sexy Asian Girl would need to go to a different city for the rain to stop, a city not built on phosphorescent fluorescence and slick glass, a city that doesn’t breathe through its elevated train lines and subways. Cool and Sexy Asian Girl doesn’t remember when they built the train lines. She dreams of cities where it is not always night. Not that it’s always night here. But it is. In the heart, it is.  “You look cold,” White Boy says as he steps out of the convenience store. White Boy has a lot of other names. The Detective. The Hacker. The Renegade. The Man Out for Revenge. Privately, Cool and Sexy Asian Girl thinks of him as the Tourist.  “I’m used to it,” she says and takes a long drag of her vape, exhaling plumes of menthol vapor. It softens the light glinting off her silver bracelet. A long time ago, she smoked cigarettes. Tar and smoke. Whiskey in bars. But times have changed. She offers the little plastic stick to the Tourist. He takes it from her and takes his own deep breath.  The Tourist is a sharp silhouette against the dark street beyond him. His eyes gleam electric. The city looms behind in smears of color and shade as if the Tourist is the only thing in focus. He doesn’t belong here. Except for the way that the city is a backdrop to his presence.  She’s been spending a lot of time with him. Cool and Sexy Asian Girl’s friends joke that his name should be White Boyfriend. Cool and Sexy Asian Girl laughs the jokes off. White Boyfriend would be a different man entirely.  There’s no place in the Tourist’s heart for her. The Tourist could fuck her, but he couldn’t love her, just as he can’t love this city. If she left with him, if they took the elevated train line to the station and the bullet out of the city, maybe he could be White Boyfriend, but she would have to be a different woman. Asian Girlfriend. Asian Baby Girl. Mail Order Bride, in the worst of worlds.  So no. No White Boyfriend.  “Was Sandra here?”  “Not sure,” the Tourist says. “Cashier says that he’s the wrong person to talk to. That there was another guy at the register that night. Part timer. That I should be looking for . . . a guy named Li?”  “There’s a million Lis,” Cool and Sexy Asian Girl says. Just like there are million cool and sexy Asian girls.  “He said that I’d know this one when I saw him. Said I’d have to go downtown, that he works nights downtown. That he’d probably be at a nightclub named Crimson.”  “Ah. That Li.”  “You know him?”  Cool and Sexy Asian Girl shrugs all implication. “Let’s go.”  She steps onto the rain-slicked streets. The Tourist follows her to where he’s parked his motorbike.  “I feel like you know everyone.”  He kicks the kickstand, swings his leg over. She seats herself behind him, pulling up close and pressing her head against the back of his neck, which is wet with rainwater and cold. It feels good against her cheek. There are things that the Tourist is good for. This is one of them. Before the Tourist, she never sat on motorbikes, snug against a boy’s back.  “I know the city,” Cool and Sexy Asian Girl says. “I was born here.”  In the city before the city, the woman who is Cool and Sexy Asian Girl was born two miles away in a hospital that no longer exists. But Cool and Sexy Asian Girl was born in a bar, sheathed in a tight black dress and high heels, leather jacket, neon eyeliner, and sharp haircut. Cool and Sexy Asian Girl was born the minute her eyes made contact with the Tourist, when he asked, “Are you—”  And she said “Yes,” because now she had become. She had been waiting all her life for this dance, for the Tourist, even if he hadn’t known it. They talked about her job, which was a corporate thing at a biotech company that the Tourist had begun investigating, in the middle of being acquired by an entity called Zether. She had been two minutes from losing her job in the merger, which was why she was at a bar, alone. He had been chasing any lead to Zether he could find. This had been why she was relevant, at first.  That first night, Cool and Sexy Asian Girl took the Tourist home from the bar to her small apartment with the unlocked stairwell that led to the roof that had a prime view of the LED advertisements cascading across the glass buildings. She took him into her bed, and she let him believe that this was his idea because she thought he might like that, because she thought it was how this story might go.  The Tourist’s story was teased out postcoital. Cool and Sexy Asian Girl learned of the dead wife, the long way from home, the data breach, the mysterious corporation, the questions without answers, and she learned his names: Detective, Hacker, Renegade. Widower.  “I’ve been here before,” he said. “But it seems different now.”  The city was the city was the perception of the city. It was always changing. Cool and Sexy Asian Girl sat up and cocked her head. She studied the angles of the Tourist’s face splashed with blue neon. His pupils dilated by the contrast of light and dark. She could tell him to leave. Cool and Sexy Asian Girl didn’t have to stay Cool and Sexy Asian Girl. There were a million cool and sexy Asian girls in the city.  “Listen. I can help you. I want to help you.”  “Why?” he asked.  Cool and Sexy Asian Girl pressed a kiss to his cheek and got up and put on a long coat. He watched her in bemusement. It was two in the morning. It was always two in the morning in the city when you needed it to be.  “I’m going for a smoke,” Cool and Sexy Asian Girl said, because this was the time when she still smoked cigarettes. “And a walk. Feel free to sleep here. It’s cheaper than a hotel.”  And then she swept out. Swept! Cool and Sexy Asian Girl was a delightful person to be. Cool and Sexy Asian Girl didn’t need to explain anything. Cool and Sexy Asian Girl was inscrutable. Cool and Sexy Asian Girl took the stairs up two at a time to the rooftop and stared at the sky and remembered when there had been stars.  But that was a long time ago, in a different story. Not a better one. That had been a story with crying children and uprooted families and soldiers, and that had been a story with opium dens and cigarettes and women who hid their faces behind fans. That had been a poor story, and this was an expensive one. Even though it had the old story in its bones. Men like the Tourist had been in that story, too.  She’s thinking about the old story, the city before the city, while they ride through the night. The streetlamps are smears of light. The cars around them are smears of chrome. Cool and Sexy Asian Girl guides them through the flow of traffic, crossing the backbone of the city and winding them down the south side, where the bars and izakayas are, where the couples and laughing university students played.  “A left, here,” she murmurs against the Tourist’s ear. “And stop.”  He cuts the engine outside the narrow door. There’s a glowing red lantern hung outside.  Cool and Sexy Asian Girl swings her leg off the bike and walks to the door without wobbling. She doesn’t wait for the Tourist to follow her. She knows he will. Cool and Sexy Asian Girl knows all the things that the Tourist doesn’t know. She clears the path so that the Tourist can get to business. If she refused, she’d stop being Cool and Sexy Asian Girl.  It’s a tautology. Cool and Sexy Asian Girl has to do the things she needs to do to keep being Cool and Sexy Asian Girl, or else she stops being Cool and Sexy Asian Girl. She stops knowing about nightclubs only identifiable by a red lantern. She stops being able to saunter in heels. It’s like how the city stops being the city and becomes a different city if the flickering flames of the neon billboards all go out. Cool and Sexy Asian Girl has a role in this story the same way the Tourist does.  The Tourist follows her in. The squelching beat of good club music paints the air around them. Strangers’ glances linger on their forms and the foreign cast to the Tourist’s face. It’s too crowded to see what’s across the room. They can’t talk in here without putting mouths close to ear, so that’s what the Tourist does. His breath is warm against her skin.  “Where to now?”  Cool and Sexy Asian Girl takes the Tourist’s hand and dances them across the room. She’s part of the scene in a way that the Tourist can’t be, in a way that he doesn’t understand. With her guidance, they melt through the crowd and reach the bar without any incident. Cool and Sexy Asian Girl sits on a barstool. The Tourist leans against the counter, signaling the bartender for a drink. The bartender pours clear liquid in two glasses, adds a drop of something blue that blooms like a drop of dark ink in water.  Cool and Sexy Asian Girl takes her glass with a smile and says, “Is Li around?”  “Why, who’s asking?”  “He’s got some information that we want. I’m a friend.”  And now they have become. Now they have been. Now Cool and Sexy Asian Girl has known Li for a very long time—now they met in an underground poker tournament, now she’s a card sharp with her expressionless face, and now she’s always known that Li’s a grinning sort of bastard who always seems like he’s cheating. The present is a tool to create the past, and the past follows the Tourist’s needs. Water follows the most obvious path, and Cool and Sexy Asian Girl has learned to be a conduit.  She takes a sip to cover the flicker in her face as she processes the new history. The drink tastes mostly like mint and the acetone aftertaste of alcohol.  The bartender nods. “I’ll ask. Don’t get your hopes up.”  “Thanks,” the Tourist says. The bartender slips between a gap in the liquor shelves. Cool and Sexy Asian Girl and the Tourist are alone except for all the people in the room with them. The Tourist takes a long sip.  “Do you ever feel,” the Tourist says and then pauses. He looks down at his drink, the blooming blue dissipating into the clear liquid, and then glances back at the crowd behind them. He looks lost, for a moment. He doesn’t normally look lost. He glances back at her.  “Like we’ve done this before?”  “I don’t know what you mean,” Cool and Sexy Asian Girl lies.  The bartender comes back and gestures for them to follow. They slip into the back corridor, behind a bar and down a set of concrete stairs and then a second narrow, colder corridor leading to a room in which an assortment of strangers plays poker under a fluorescent light. Strangers and Li, who has now always been a friend.  Li looks up from his hand and smiles his crooked smile. The cybernetic implant in his left eye socket glints in the light.  “Well hey,” he says.  “Hey yourself,” she says.  “Are you playing?”  Cool and Sexy Asian Girl smiles, just the slightest tilt of her lip. She knows what Li is actually asking, since they’ve been friends for years. That’s how they talk. Doubled meaning and canned expressions and hands of cards lying flat on the felt.  (This is the first time they’ve spoken.)  “Word on the street is that you know where to find out about what went down with Zether. Sandra Claire. Name ring any bells?”  Li’s grin grows broad, a white slash in the shadows as he leans back. The filled cybernetic socket looks like a dark hole in his face.  “Take your winnings and piss off, gentlemen,” Li says.  The men sitting in the semicircle exchange flat glances but leave.  They’re alone now. Just her and the Tourist and Li.  “Sandra Claire. Name sounds familiar. I might have a memory with her name on it. Might have talked with her. This all depends on who’s asking,” Li says. “Are you playing? Nothing’s free. You don’t have to. Your boy can play against me.”  Cool and Sexy Asian Girl is being offered an out. The Tourist can sit down and play against Li, and Li could take over. He could be the city that is the backdrop, he could be the Roguish Sidekick, he could be the Card Shark, the Underworld Gambler, the Fast-Talking Sacrifice, the Man Whose Head is a Machine, and then Cool and Sexy Asian Girl could exit stage left. They could fill the same role, if she wanted to go. It’s a kind offer. Most people don’t choose to be in the narrative.  Cool and Sexy Asian Girl sits at the small table. “Deal me in.”  “And me,” the Tourist says, sitting next to her. He puts down a stack of bills. Li whistles.  “How good are you?” he says.  “I’m alright.”  “You’ve got to be more than alright,” Li says, and that’s the last conversation for a while. Cards flip. Hands raise and fall. Eyes flicker.  The Tourist was lying. He’s not just good. He’s very good. Barely better than Cool and Sexy Asian Girl, depending on how you’d weigh luck’s influence. Cards on the felt. Li smirks. Cool and Sexy Asian Girl is impassive. The Tourist’s loss is an impermanent setback.  “So you’re a cashier, and you run an underground gambling ring,” the Tourist says. “How’s that working out for you?”  “Alright,” Li says and winks with his good eye. “No guns, no drama. Just information. People know me.”  “Did you talk with Sandra? At the convenience store?”  “That would be telling,” Li says. “That’s money. Another round?”  The Tourist reaches into his jacket and grimaces at the lack of what he finds. Cool and Sexy Asian Girl unclips her bracelet and puts it in the pot.  The Tourist glances at her. “No, hey, you don’t have to.”  “Only matters if we don’t win,” Cool and Sexy Asian Girl says.  “I’ll buy you a new one when you lose,” Li says. He presses the center of his missing eye and a data chip ejects. He places it on the table. The space where his left eye should be turns into a rectangular black gape.  “Most of it’s still in here,” he says, tapping his head, tilting it so that the Tourist can see the other three cybernetic implants that stud his cranium. “But I like visual metaphors.”  The Tourist nods. Li deals a new round of cards. They play ferociously this time. Cool and Sexy Asian Girl savors the experience. In a world without the Tourist, she would never have ended up in a small room underneath a nightclub, playing for secrets. Her bracelet glints on top of the pile of poker chips.  Everyone reveals their last hands. The Tourist won, like Cool and Sexy Asian Girl expected. It doesn’t matter that Cool and Sexy Asian Girl has built herself a history where she’s more experienced than the Tourist is. It doesn’t matter that Li was dealing or that he has an advanced processing engine where most of his brain is supposed to be.  This is a game about luck. About favor. And the city tilts toward the Tourist.  “Oh man,” Li says. “Guess I fucked it all up.”  He pushes the pile of cash and chips and Cool and Sexy Asian Girl’s bracelet toward the Tourist. He picks the data chip up and slots it back where his eye is supposed to go.  “Go talk to the bartender,” Li says. “He’ll exchange the chips for you. Then come back down and we can talk, chief.”  The Tourist nods. He hands the bracelet back to Cool and Sexy Asian Girl and then exits into the corridor. Cool and Sexy Asian Girl fastens the bracelet around her wrist. Li exhales, takes a cigarette out of his pocket.  “Do you mind?”  “No.”  Li lights the cigarette. Cool and Sexy Asian Girl remembers sitting on a balcony and smoking with him in the years before he had his eye out. She’s glad that she built him in as a friend. The city doesn’t have to be her enemy. Forward momentum, clandestine relationships, none of it needed to be deadly, so long as a smear of danger painted the scene. The scene only needed to feel like movement. Working the city was like dancing through the crowded nightclub. As long as it felt organic, the momentum would continue.  “I have a request, if you don’t mind.”  “Oh, I could never refuse you. What do you need?”  “Could you please lie to my companion when he returns? Tell him something . . . untrue about meeting Sandra. Nothing dramatic. Just enough to nudge us down a detour.”  As long as it felt organic, the momentum would continue.  Li frowns. Taps ash onto a ceramic ashtray. “Why? Aren’t you helping him?”  Help is a complicated word. Cool and Sexy Asian Girl is leading the Tourist through the neon night.  Li shakes his head.  “He won, fair and square. Can’t have my reputation being fucked for him. You’d be putting me in a hard position.”  “I’m sorry I involved you,” Cool and Sexy Asian Girl says. She means that. She wouldn’t have meant it three hours ago, but now she’s woven a history with Li and is beginning to regret bringing the Tourist here at all. She hadn’t expected to tie her backstory and Li’s so closely together. But they’re friends. Good friends. So Cool and Sexy Asian Girl tells the truth.  “I just don’t want him to leave yet. I don’t want to stop—” Cool and Sexy Asian Girl gestures at herself. The slick black leather jacket, the heels too high to be practical.  “This is fun. I don’t want it to end.”  Being Cool and Sexy Asian Girl is the best experience she’s had. It’s the closest she gets to mattering. Before Cool and Sexy Asian Girl, she had a normal job at a biotech firm, and she didn’t understand the streets of the city like the veins on the back of her own hand. She got up and went to work and slept and never stayed up until two in the morning. It was never two in the morning for her, then. She hadn’t understood the nature of the city, and every change in it had been a destabilization. The poor story, the expensive one, the way that the roads changed with the years. But the Tourist changed all of that. She’s become a person who could live in this iteration of the city for a very long time.  Li stubs his cigarette out. He looks pale and mechanized. His flesh eye blinks wetly.  “You put the chip in my head.”  The new-old memory falls into place. Cool and Sexy Asian Girl pales. She was there when Li got the cybernetic implant, the insertion of the four sockets ringing his skull. He had gotten half his skull crushed in the aftermath of a poker tournament, after everything broke bad in the police raid. Cool and Sexy Asian Girl got out unscathed. She always gets out unscathed. Cool and Sexy Asian Girl was a thing that dealt violence, not one that had violence done to her.  This is why they hadn’t talked for long, she remember-realized. This was how their story made sense. She had driven Li to the hospital. And then she left him at the hospital and never spoke to him again. It was shame. That was the explanation the city gave her for their friendship and subsequent absence.  Cool and Sexy Asian Girl wonders who Li was before she warped his history. She doesn’t usually think about the effect that she has on the people around her that aren’t the Tourist. It’s hard to remember the city and the people in it as anything more than game pieces to be steered around and discarded for the needs of the plot. But Li is sitting in front of her, his one good eye steady, the smoke curling wraithlike around him. She wonders who he was in the old story.  A good person would leave and hope that the reality would soften back into its previous shape. Cool and Sexy Asian Girl is not a good person. She would like to stay herself.  “I don’t get to control how the story goes. I only get to guide it a little. And I’m asking you if you’ll help me with that, please. And then you never have to see me again.”  She winces, then. As soon as she said it, Cool and Sexy Asian Girl immediately knew that it was the wrong thing to say. Now that the Tourist has left the room, Cool and Sexy Asian girl is beginning to lose her cool. Her current actions aren’t in service of his goals.  Li stubs his cigarette. He picks up a spare poker chip and rolls it across his knuckles deftly.  “Have you heard of infinite game theory?”  “No.”  “It’s one of those woo-woo pseudo-philosophical theories. It refers to situations where the point of the game is to keep playing. Games where the win condition is essentially the ability to continue existing within the system. Like being alive. Or having money in the stock market. Sometimes poker, if you don’t want to cash out. Keep all the plates spinning. Winning just means you keep on going on.”  “I get the metaphor,” Cool and Sexy Asian Girl says. Li stops rolling the poker chip and lets it fall on the felt.  “Yeah, yeah, you’re too cool for this, I get your shtick. How long have you been playing?”  Cool and Sexy Asian Girl picks up the poker chip. She thinks back to the first meeting she had with the Tourist. Two in the morning. A bar. The way that the light hit his face. How lost the Tourist looked. How he looked at the world around him like it wasn’t real, like it had been created for him to be contrasted against. How she had hated him, for a brief hot second before they locked eyes, and then Cool and Sexy Asian Girl looked enigmatically away.  “I didn’t mean to let it get this far,” she admits. “It should have ended a long time ago, I think. But it was so easy to misdirect him.”  The first lie was an accident. She said right instead of left, and the Tourist and her took a long detour through the west side of the city. They were supposed to meet an office worker with information about the location of his wife’s death, who would be at the station for half an hour before the man caught the bullet out.  They missed intersecting with the office worker. The bullet train slid from the station just as they arrived. Cool and Sexy Asian Girl had felt terrible about it at first. She apologized, because even if Cool and Sexy Asian Girl wouldn’t apologize, she would soon no longer be Cool and Sexy Asian Girl. The Tourist had accepted the apology with a half slice of sad smile. She had felt a little sad. A little bit about the Tourist. But mostly about herself.  And then Cool and Sexy Asian Girl’s phone rang. She answered.  “I heard you were looking for Sandra Claire,” a low voice said.  “Who’s asking?” Cool and Sexy Asian Girl said. “You knew Sandra.”  It was an accident, the first time. A flattening of her voice. Because Cool and Sexy Asian Girl had a low voice and a flat affect, Cool and Sexy Asian Girl was mysterious and pointed, and Cool and Sexy Asian Girl didn’t ask but to demand.  With her statement, the knowledge of the caller bloomed in her head like a lotus sitting cool and perfect on the still water of her mind. This was the office worker’s dealer, whose debts the office worker was trying to escape, and he would know more about Sandra than the office worker did because the office worker had met Sandra through the man. Another route to the answers.  Cool and Sexy Asian Girl navigated the rest of the conversation rotely. In her head she shredded the petals of knowledge and then ripped the roots, thought after metatextual thought chewed and dissected. Throat followed tongue followed teeth, extrapolating the logical conclusions from her actions.  Her speech had its own momentum, spiraling back and forward in time. The city bent around the Tourist’s goals in the same way that her own history had. The Tourist did this without thinking. But she could think and speak and mold the world into existence. The city was a stage for a specific sort of play with specific rules. Every missed opportunity could be handed back in a different form. She looked at the clock hanging on the wall of the train station. It was still two in the morning.  Cool and Sexy Asian Girl could turn the city into a lotus eater machine for the Tourist. She could stay Cool and Sexy Asian Girl for as long as she wanted.  The lies spiraled from there. Misdirection after misdirection. Flushed data chips. Wrong addresses. Doctored websites. Carefully worded requests to new-old friends who watch her now, with one biological eye and one data chip jammed into a socket.  Cool and Sexy Asian Girl puts the poker chip down.  “I don’t know how long I’ve been lying to him,” Cool and Sexy Asian Girl says. “It’s . . . been a night. Not even a night.”  It was always two in the morning when you needed it to be. It can be two in the morning for a very long time.  “How could you not know?” the Tourist says.  Cool and Sexy Asian Girl doesn’t fall out of her chair, because she’s too cool and sexy to startle from a sudden noise. Cool and Sexy Asian Girl turns smoothly to see the Tourist silhouetted against the fluorescent hallway. He’s carrying a wad of cash in his hand. He must have finished with the bartender. She doesn’t know how long he’s been standing there. Li didn’t say anything.  The Tourist walks in, turning from flat shade to three-dimensional object. He grips her almost painfully by the side of the jaw, forcing her to stand. Cool and Sexy Asian Girl struggles against his grasp. But she can’t move. The city moves to help the Tourist. In a contest of strength, it takes his side.  “You lied to me. You’re trapping me here?”  “Let me go.”  He doesn’t let go. He looks at her with an expression of perfect heartbreak.  “Why?” he says. “How long have you been keeping me here? Why would you do this? What were you trying to do?”  “Let me go,” she says, pushing him away, wrestling with his hold.  “Why?” he repeats again, and isn’t that just who he is. Demands masked as questions, supplicant masked as god. Cool and Sexy Asian Girl hates him violently. He has everything she scrapes for. His arrogance! As if the city is an oyster to be prized open, as if his heartbreak has any more worth than anyone else who lives here, as if his answers are a pearl and the rest of it is discarded flesh. As if she owes him anything. Cool and Sexy Asian Girl is not a good person. Cool and Sexy Asian Girl has been helping him. Cool and Sexy Asian Girl is a construct of his own imagination.  She should defuse the situation. She could speak the world into submission and run the world in a loop and find an excuse that would become truth.  “Sam,” she snarls. “Do you even know my name?”  “I—” the Tourist says, and then stops. His grasp loosens, gaze vacating as he thinks, because no, he doesn’t know her name. He never asked.  “Sam,” Cool and Sexy Asian Girl says. “You trust me.”  His hand twitches. “No. Yes. Wait. I—”  The Tourist looks frightened, now, and it’s the first time she’s seen that expression cross Sam’s face.  “I don’t,” he starts to say, and then stops, and then lets go. Cool and Sexy Asian Girl falls back down into her chair. Before she can stand, he’s already heading out the door and down the hallway. Cool and Sexy Asian Girl runs after him, heels clicking on the floor. The Tourist has longer legs than she does, already taking the steps two at a time back up to the bar, and Cool and Sexy Asian Girl sprints after him in her high heels and by the time she reaches the top of the stairs the Tourist’s gone.  “Shit,” Cool and Sexy Asian Girl says.  “Is everything so dramatic around you guys?” Li says from behind her. She hadn’t noticed him following.  “Only around him,” Cool and Sexy Asian Girl says. She tries to turn and nearly twists her ankle when the spiked heel of her shoe snaps.  Li catches her arm. She tries not to sag against him and fails. She’s already losing whatever makes Cool and Sexy Asian Girl cool.  “I never understood how you could walk in those things.”  Cool and Sexy Asian Girl pulls off the broken heel, and then the other. Without them, she’s six inches shorter, and the world feels wrong from this perspective. She drops the shoes in the trash can behind the bar and sighs. Li tilts his head.  “What now?”  “Why do you care?”  Li shrugs. “I’m invested. You’re my friend.”  “Am I?” Cool and Sexy Asian Girl asks.  Li rolls his good eye and leans against the bar. Pours himself a glass of whiskey.  “I get to decide that, don’t I? You can say whatever you want about our history, but in the here-and-now, it’s my choice.”  “Oh,” Cool and Sexy Asian Girl says. Li shrugs again and drains his glass and pulls the data chip out of his eye again. He holds it out to her.  “Your boy’s probably going to come looking for it. If you want him to come looking for you.”  Cool and Sexy Asian Girl reaches out instinctively. This would lead the Tourist right back to her. It would be the easiest flow of water. She could make the Tourist forgive her. She could answer all his questions with perfect answers. The city was curving toward the Tourist again. She stops before she picks it up.  “Am I a bad person, Li?”  “I run an unregistered, illegal gambling ring in the basement of a nightclub,” Li says flatly.  “But you do that because that’s what I implie—”  “So nothing’s my fault and nothing I do matters. Which means that good and bad are meaningless constructs,” Li says. “You’re giving yourself too much credit. And too little. Take the chip or don’t. I decide, you decide, nobody gets to fucking decide. Live in the city whatever way you want. I want to give this to you, if you want it.”  She picks up the chip. It’s warm from Li’s body heat.  “You didn’t tell me that Sam was standing behind me,” Cool and Sexy Asian Girl says.  “I don’t like seeing my friends act like assholes. He was making you worse. Or you were making him worse.” Li gestures between them. “This goes both ways.”  “But you’re giving me the chip to find him,” Cool and Sexy Asian Girl says.  “Well, do you want it?”  Cool and Sexy Asian Girl thought she did. But it felt too easy. It felt like a test, coming from Li who knew what she had done to him, who knew what she had been doing. She felt exposed, in the sense that her motivations had been revealed and found wanting. She wanted to squirm away from Li’s flat gaze. She wondered if this is how the Tourist had felt, when he had learned that she had been lying to him. The surprise that the people around you existed outside of your narrative. Abruptly, Cool and Sexy Asian Girl felt very stupid and a little cruel. She was treating Li the same way the Tourist treated her. And maybe the same way she had treated the Tourist. Like a tool.  The city was a story, but Sam was a man who needed to know what happened to his wife. A man who had cried in her bed. And the city wasn’t a story about that man. The city was a story about the Tourist and his finding of answers, and it had been running in circles, loops, for a very long time, and the Tourist had learned nothing. But the city wasn’t meant to be static. Being the Tourist was making Sam worse. And being Cool and Sexy Asian Girl was making her cruel. She hadn’t been cruel, before. She remembers that now.  “I think I want to get Sam out of here,” Cool and Sexy Asian Girl says. “Can I borrow a pair of shoes?”  Li gestures at the door to the left.  “Employee closet. Suyoung has feet that look your size.”  Cool and Sexy Asian Girl nods her thanks and opens the door. She rummages through the clothing that belongs to the nightclub’s employees. There’s a pair of blue sneakers that look her size. She shoves her feet in them. She closes the closet door. Li’s gone, when she looks back. The bartender has taken his place.  She nods at him. He nods at her.  “Want me to close you out?”  “Please,” she says, and then pays for the drinks. It feels like it’s been an eternity since her and the Tourist were standing here.  Cool and Sexy Asian Girl slides her way across the bar through the crowd. She’s still part of the city. That has nothing to do with the Tourist. And then she’s walking into the cold clear night, and the rain has stopped, leaving puddles of slick black reflective water, arcs of neon beamed into infinity. The motorbike is gone. The street is empty.  The city is holding its breath. But the neon is still on. She can hear the roar of the elevated train. The city is still the city, and the next bullet train won’t leave for another hour. It’s still two in the morning. She doesn’t think the Tourist can leave yet, anyway. He hasn’t found what he’s looking for. She’ll get him out, though.  And then she’ll be someone else. In the city after the city. She’ll remember the neon and slick water. She’ll remember the nightclubs. Maybe in the next city, there will be sunrises.  She walks into the night, for however long it can last. For however long she can stay. Her sneakers are soaked with every footstep. She keeps walking anyway. Isabel J. Kim is a Korean-American science fiction and fantasy writer based in New York City. When she’s not writing, she’s practicing law, and when she’s not doing that, she’s co-hosting Wow If True, a podcast about internet culture. Her work has been published in Clarkesworld, Lightspeed, and Beneath Ceaseless Skies.", "text": "5960 words, short story\nTermination Stories for the Cyberpunk Dystopia Protagonist\nCool and Sexy Asian Girl stands outside the convenience store under the striped awning and waits for the rain to stop. The rain is never going to stop. Cool and Sexy Asian Girl would need to go to a different city for the rain to stop, a city not built on phosphorescent fluorescence and slick glass, a city that doesn’t breathe through its elevated train lines and subways. Cool and Sexy Asian Girl doesn’t remember when they built the train lines. She dreams of cities where it is not always night. Not that it’s always night here. But it is. In the heart, it is.\n“You look cold,” White Boy says as he steps out of the convenience store. White Boy has a lot of other names. The Detective. The Hacker. The Renegade. The Man Out for Revenge. Privately, Cool and Sexy Asian Girl thinks of him as the Tourist.\n“I’m used to it,” she says and takes a long drag of her vape, exhaling plumes of menthol vapor. It softens the light glinting off her silver bracelet. A long time ago, she smoked cigarettes. Tar and smoke. Whiskey in bars. But times have changed. She offers the little plastic stick to the Tourist. He takes it from her and takes his own deep breath.\nThe Tourist is a sharp silhouette against the dark street beyond him. His eyes gleam electric. The city looms behind in smears of color and shade as if the Tourist is the only thing in focus. He doesn’t belong here. Except for the way that the city is a backdrop to his presence.\nShe’s been spending a lot of time with him. Cool and Sexy Asian Girl’s friends joke that his name should be White Boyfriend. Cool and Sexy Asian Girl laughs the jokes off. White Boyfriend would be a different man entirely.\nThere’s no place in the Tourist’s heart for her. The Tourist could fuck her, but he couldn’t love her, just as he can’t love this city. If she left with him, if they took the elevated train line to the station and the bullet out of the city, maybe he could be White Boyfriend, but she would have to be a different woman. Asian Girlfriend. Asian Baby Girl. Mail Order Bride, in the worst of worlds.\nSo no. No White Boyfriend.\n“Was Sandra here?”\n“Not sure,” the Tourist says. “Cashier says that he’s the wrong person to talk to. That there was another guy at the register that night. Part timer. That I should be looking for . . . a guy named Li?”\n“There’s a million Lis,” Cool and Sexy Asian Girl says. Just like there are million cool and sexy Asian girls.\n“He said that I’d know this one when I saw him. Said I’d have to go downtown, that he works nights downtown. That he’d probably be at a nightclub named Crimson.”\n“Ah. That Li.”\n“You know him?”\nCool and Sexy Asian Girl shrugs all implication. “Let’s go.”\nShe steps onto the rain-slicked streets. The Tourist follows her to where he’s parked his motorbike.\n“I feel like you know everyone.”\nHe kicks the kickstand, swings his leg over. She seats herself behind him, pulling up close and pressing her head against the back of his neck, which is wet with rainwater and cold. It feels good against her cheek. There are things that the Tourist is good for. This is one of them. Before the Tourist, she never sat on motorbikes, snug against a boy’s back.\n“I know the city,” Cool and Sexy Asian Girl says. “I was born here.”\nIn the city before the city, the woman who is Cool and Sexy Asian Girl was born two miles away in a hospital that no longer exists. But Cool and Sexy Asian Girl was born in a bar, sheathed in a tight black dress and high heels, leather jacket, neon eyeliner, and sharp haircut. Cool and Sexy Asian Girl was born the minute her eyes made contact with the Tourist, when he asked, “Are you—”\nAnd she said “Yes,” because now she had become. She had been waiting all her life for this dance, for the Tourist, even if he hadn’t known it. They talked about her job, which was a corporate thing at a biotech company that the Tourist had begun investigating, in the middle of being acquired by an entity called Zether. She had been two minutes from losing her job in the merger, which was why she was at a bar, alone. He had been chasing any lead to Zether he could find. This had been why she was relevant, at first.\nThat first night, Cool and Sexy Asian Girl took the Tourist home from the bar to her small apartment with the unlocked stairwell that led to the roof that had a prime view of the LED advertisements cascading across the glass buildings. She took him into her bed, and she let him believe that this was his idea because she thought he might like that, because she thought it was how this story might go.\nThe Tourist’s story was teased out postcoital. Cool and Sexy Asian Girl learned of the dead wife, the long way from home, the data breach, the mysterious corporation, the questions without answers, and she learned his names: Detective, Hacker, Renegade. Widower.\n“I’ve been here before,” he said. “But it seems different now.”\nThe city was the city was the perception of the city. It was always changing. Cool and Sexy Asian Girl sat up and cocked her head. She studied the angles of the Tourist’s face splashed with blue neon. His pupils dilated by the contrast of light and dark. She could tell him to leave. Cool and Sexy Asian Girl didn’t have to stay Cool and Sexy Asian Girl. There were a million cool and sexy Asian girls in the city.\n“Listen. I can help you. I want to help you.”\n“Why?” he asked.\nCool and Sexy Asian Girl pressed a kiss to his cheek and got up and put on a long coat. He watched her in bemusement. It was two in the morning. It was always two in the morning in the city when you needed it to be.\n“I’m going for a smoke,” Cool and Sexy Asian Girl said, because this was the time when she still smoked cigarettes. “And a walk. Feel free to sleep here. It’s cheaper than a hotel.”\nAnd then she swept out. Swept! Cool and Sexy Asian Girl was a delightful person to be. Cool and Sexy Asian Girl didn’t need to explain anything. Cool and Sexy Asian Girl was inscrutable. Cool and Sexy Asian Girl took the stairs up two at a time to the rooftop and stared at the sky and remembered when there had been stars.\nBut that was a long time ago, in a different story. Not a better one. That had been a story with crying children and uprooted families and soldiers, and that had been a story with opium dens and cigarettes and women who hid their faces behind fans. That had been a poor story, and this was an expensive one. Even though it had the old story in its bones. Men like the Tourist had been in that story, too.\nShe’s thinking about the old story, the city before the city, while they ride through the night. The streetlamps are smears of light. The cars around them are smears of chrome. Cool and Sexy Asian Girl guides them through the flow of traffic, crossing the backbone of the city and winding them down the south side, where the bars and izakayas are, where the couples and laughing university students played.\n“A left, here,” she murmurs against the Tourist’s ear. “And stop.”\nHe cuts the engine outside the narrow door. There’s a glowing red lantern hung outside.\nCool and Sexy Asian Girl swings her leg off the bike and walks to the door without wobbling. She doesn’t wait for the Tourist to follow her. She knows he will. Cool and Sexy Asian Girl knows all the things that the Tourist doesn’t know. She clears the path so that the Tourist can get to business. If she refused, she’d stop being Cool and Sexy Asian Girl.\nIt’s a tautology. Cool and Sexy Asian Girl has to do the things she needs to do to keep being Cool and Sexy Asian Girl, or else she stops being Cool and Sexy Asian Girl. She stops knowing about nightclubs only identifiable by a red lantern. She stops being able to saunter in heels. It’s like how the city stops being the city and becomes a different city if the flickering flames of the neon billboards all go out. Cool and Sexy Asian Girl has a role in this story the same way the Tourist does.\nThe Tourist follows her in. The squelching beat of good club music paints the air around them. Strangers’ glances linger on their forms and the foreign cast to the Tourist’s face. It’s too crowded to see what’s across the room. They can’t talk in here without putting mouths close to ear, so that’s what the Tourist does. His breath is warm against her skin.\n“Where to now?”\nCool and Sexy Asian Girl takes the Tourist’s hand and dances them across the room. She’s part of the scene in a way that the Tourist can’t be, in a way that he doesn’t understand. With her guidance, they melt through the crowd and reach the bar without any incident. Cool and Sexy Asian Girl sits on a barstool. The Tourist leans against the counter, signaling the bartender for a drink. The bartender pours clear liquid in two glasses, adds a drop of something blue that blooms like a drop of dark ink in water.\nCool and Sexy Asian Girl takes her glass with a smile and says, “Is Li around?”\n“Why, who’s asking?”\n“He’s got some information that we want. I’m a friend.”\nAnd now they have become. Now they have been. Now Cool and Sexy Asian Girl has known Li for a very long time—now they met in an underground poker tournament, now she’s a card sharp with her expressionless face, and now she’s always known that Li’s a grinning sort of bastard who always seems like he’s cheating. The present is a tool to create the past, and the past follows the Tourist’s needs. Water follows the most obvious path, and Cool and Sexy Asian Girl has learned to be a conduit.\nShe takes a sip to cover the flicker in her face as she processes the new history. The drink tastes mostly like mint and the acetone aftertaste of alcohol.\nThe bartender nods. “I’ll ask. Don’t get your hopes up.”\n“Thanks,” the Tourist says. The bartender slips between a gap in the liquor shelves. Cool and Sexy Asian Girl and the Tourist are alone except for all the people in the room with them. The Tourist takes a long sip.\n“Do you ever feel,” the Tourist says and then pauses. He looks down at his drink, the blooming blue dissipating into the clear liquid, and then glances back at the crowd behind them. He looks lost, for a moment. He doesn’t normally look lost. He glances back at her.\n“Like we’ve done this before?”\n“I don’t know what you mean,” Cool and Sexy Asian Girl lies.\nThe bartender comes back and gestures for them to follow. They slip into the back corridor, behind a bar and down a set of concrete stairs and then a second narrow, colder corridor leading to a room in which an assortment of strangers plays poker under a fluorescent light. Strangers and Li, who has now always been a friend.\nLi looks up from his hand and smiles his crooked smile. The cybernetic implant in his left eye socket glints in the light.\n“Well hey,” he says.\n“Hey yourself,” she says.\n“Are you playing?”\nCool and Sexy Asian Girl smiles, just the slightest tilt of her lip. She knows what Li is actually asking, since they’ve been friends for years. That’s how they talk. Doubled meaning and canned expressions and hands of cards lying flat on the felt.\n(This is the first time they’ve spoken.)\n“Word on the street is that you know where to find out about what went down with Zether. Sandra Claire. Name ring any bells?”\nLi’s grin grows broad, a white slash in the shadows as he leans back. The filled cybernetic socket looks like a dark hole in his face.\n“Take your winnings and piss off, gentlemen,” Li says.\nThe men sitting in the semicircle exchange flat glances but leave.\nThey’re alone now. Just her and the Tourist and Li.\n“Sandra Claire. Name sounds familiar. I might have a memory with her name on it. Might have talked with her. This all depends on who’s asking,” Li says. “Are you playing? Nothing’s free. You don’t have to. Your boy can play against me.”\nCool and Sexy Asian Girl is being offered an out. The Tourist can sit down and play against Li, and Li could take over. He could be the city that is the backdrop, he could be the Roguish Sidekick, he could be the Card Shark, the Underworld Gambler, the Fast-Talking Sacrifice, the Man Whose Head is a Machine, and then Cool and Sexy Asian Girl could exit stage left. They could fill the same role, if she wanted to go. It’s a kind offer. Most people don’t choose to be in the narrative.\nCool and Sexy Asian Girl sits at the small table. “Deal me in.”\n“And me,” the Tourist says, sitting next to her. He puts down a stack of bills. Li whistles.\n“How good are you?” he says.\n“I’m alright.”\n“You’ve got to be more than alright,” Li says, and that’s the last conversation for a while. Cards flip. Hands raise and fall. Eyes flicker.\nThe Tourist was lying. He’s not just good. He’s very good. Barely better than Cool and Sexy Asian Girl, depending on how you’d weigh luck’s influence. Cards on the felt. Li smirks. Cool and Sexy Asian Girl is impassive. The Tourist’s loss is an impermanent setback.\n“So you’re a cashier, and you run an underground gambling ring,” the Tourist says. “How’s that working out for you?”\n“Alright,” Li says and winks with his good eye. “No guns, no drama. Just information. People know me.”\n“Did you talk with Sandra? At the convenience store?”\n“That would be telling,” Li says. “That’s money. Another round?”\nThe Tourist reaches into his jacket and grimaces at the lack of what he finds. Cool and Sexy Asian Girl unclips her bracelet and puts it in the pot.\nThe Tourist glances at her. “No, hey, you don’t have to.”\n“Only matters if we don’t win,” Cool and Sexy Asian Girl says.\n“I’ll buy you a new one when you lose,” Li says. He presses the center of his missing eye and a data chip ejects. He places it on the table. The space where his left eye should be turns into a rectangular black gape.\n“Most of it’s still in here,” he says, tapping his head, tilting it so that the Tourist can see the other three cybernetic implants that stud his cranium. “But I like visual metaphors.”\nThe Tourist nods. Li deals a new round of cards. They play ferociously this time. Cool and Sexy Asian Girl savors the experience. In a world without the Tourist, she would never have ended up in a small room underneath a nightclub, playing for secrets. Her bracelet glints on top of the pile of poker chips.\nEveryone reveals their last hands. The Tourist won, like Cool and Sexy Asian Girl expected. It doesn’t matter that Cool and Sexy Asian Girl has built herself a history where she’s more experienced than the Tourist is. It doesn’t matter that Li was dealing or that he has an advanced processing engine where most of his brain is supposed to be.\nThis is a game about luck. About favor. And the city tilts toward the Tourist.\n“Oh man,” Li says. “Guess I fucked it all up.”\nHe pushes the pile of cash and chips and Cool and Sexy Asian Girl’s bracelet toward the Tourist. He picks the data chip up and slots it back where his eye is supposed to go.\n“Go talk to the bartender,” Li says. “He’ll exchange the chips for you. Then come back down and we can talk, chief.”\nThe Tourist nods. He hands the bracelet back to Cool and Sexy Asian Girl and then exits into the corridor. Cool and Sexy Asian Girl fastens the bracelet around her wrist. Li exhales, takes a cigarette out of his pocket.\n“Do you mind?”\n“No.”\nLi lights the cigarette. Cool and Sexy Asian Girl remembers sitting on a balcony and smoking with him in the years before he had his eye out. She’s glad that she built him in as a friend. The city doesn’t have to be her enemy. Forward momentum, clandestine relationships, none of it needed to be deadly, so long as a smear of danger painted the scene. The scene only needed to feel like movement. Working the city was like dancing through the crowded nightclub. As long as it felt organic, the momentum would continue.\n“I have a request, if you don’t mind.”\n“Oh, I could never refuse you. What do you need?”\n“Could you please lie to my companion when he returns? Tell him something . . . untrue about meeting Sandra. Nothing dramatic. Just enough to nudge us down a detour.”\nAs long as it felt organic, the momentum would continue.\nLi frowns. Taps ash onto a ceramic ashtray. “Why? Aren’t you helping him?”\nHelp is a complicated word. Cool and Sexy Asian Girl is leading the Tourist through the neon night.\nLi shakes his head.\n“He won, fair and square. Can’t have my reputation being fucked for him. You’d be putting me in a hard position.”\n“I’m sorry I involved you,” Cool and Sexy Asian Girl says. She means that. She wouldn’t have meant it three hours ago, but now she’s woven a history with Li and is beginning to regret bringing the Tourist here at all. She hadn’t expected to tie her backstory and Li’s so closely together. But they’re friends. Good friends. So Cool and Sexy Asian Girl tells the truth.\n“I just don’t want him to leave yet. I don’t want to stop—” Cool and Sexy Asian Girl gestures at herself. The slick black leather jacket, the heels too high to be practical.\n“This is fun. I don’t want it to end.”\nBeing Cool and Sexy Asian Girl is the best experience she’s had. It’s the closest she gets to mattering. Before Cool and Sexy Asian Girl, she had a normal job at a biotech firm, and she didn’t understand the streets of the city like the veins on the back of her own hand. She got up and went to work and slept and never stayed up until two in the morning. It was never two in the morning for her, then. She hadn’t understood the nature of the city, and every change in it had been a destabilization. The poor story, the expensive one, the way that the roads changed with the years. But the Tourist changed all of that. She’s become a person who could live in this iteration of the city for a very long time.\nLi stubs his cigarette out. He looks pale and mechanized. His flesh eye blinks wetly.\n“You put the chip in my head.”\nThe new-old memory falls into place. Cool and Sexy Asian Girl pales. She was there when Li got the cybernetic implant, the insertion of the four sockets ringing his skull. He had gotten half his skull crushed in the aftermath of a poker tournament, after everything broke bad in the police raid. Cool and Sexy Asian Girl got out unscathed. She always gets out unscathed. Cool and Sexy Asian Girl was a thing that dealt violence, not one that had violence done to her.\nThis is why they hadn’t talked for long, she remember-realized. This was how their story made sense. She had driven Li to the hospital. And then she left him at the hospital and never spoke to him again. It was shame. That was the explanation the city gave her for their friendship and subsequent absence.\nCool and Sexy Asian Girl wonders who Li was before she warped his history. She doesn’t usually think about the effect that she has on the people around her that aren’t the Tourist. It’s hard to remember the city and the people in it as anything more than game pieces to be steered around and discarded for the needs of the plot. But Li is sitting in front of her, his one good eye steady, the smoke curling wraithlike around him. She wonders who he was in the old story.\nA good person would leave and hope that the reality would soften back into its previous shape. Cool and Sexy Asian Girl is not a good person. She would like to stay herself.\n“I don’t get to control how the story goes. I only get to guide it a little. And I’m asking you if you’ll help me with that, please. And then you never have to see me again.”\nShe winces, then. As soon as she said it, Cool and Sexy Asian Girl immediately knew that it was the wrong thing to say. Now that the Tourist has left the room, Cool and Sexy Asian girl is beginning to lose her cool. Her current actions aren’t in service of his goals.\nLi stubs his cigarette. He picks up a spare poker chip and rolls it across his knuckles deftly.\n“Have you heard of infinite game theory?”\n“No.”\n“It’s one of those woo-woo pseudo-philosophical theories. It refers to situations where the point of the game is to keep playing. Games where the win condition is essentially the ability to continue existing within the system. Like being alive. Or having money in the stock market. Sometimes poker, if you don’t want to cash out. Keep all the plates spinning. Winning just means you keep on going on.”\n“I get the metaphor,” Cool and Sexy Asian Girl says. Li stops rolling the poker chip and lets it fall on the felt.\n“Yeah, yeah, you’re too cool for this, I get your shtick. How long have you been playing?”\nCool and Sexy Asian Girl picks up the poker chip. She thinks back to the first meeting she had with the Tourist. Two in the morning. A bar. The way that the light hit his face. How lost the Tourist looked. How he looked at the world around him like it wasn’t real, like it had been created for him to be contrasted against. How she had hated him, for a brief hot second before they locked eyes, and then Cool and Sexy Asian Girl looked enigmatically away.\n“I didn’t mean to let it get this far,” she admits. “It should have ended a long time ago, I think. But it was so easy to misdirect him.”\nThe first lie was an accident. She said right instead of left, and the Tourist and her took a long detour through the west side of the city. They were supposed to meet an office worker with information about the location of his wife’s death, who would be at the station for half an hour before the man caught the bullet out.\nThey missed intersecting with the office worker. The bullet train slid from the station just as they arrived. Cool and Sexy Asian Girl had felt terrible about it at first. She apologized, because even if Cool and Sexy Asian Girl wouldn’t apologize, she would soon no longer be Cool and Sexy Asian Girl. The Tourist had accepted the apology with a half slice of sad smile. She had felt a little sad. A little bit about the Tourist. But mostly about herself.\nAnd then Cool and Sexy Asian Girl’s phone rang. She answered.\n“I heard you were looking for Sandra Claire,” a low voice said.\n“Who’s asking?” Cool and Sexy Asian Girl said. “You knew Sandra.”\nIt was an accident, the first time. A flattening of her voice. Because Cool and Sexy Asian Girl had a low voice and a flat affect, Cool and Sexy Asian Girl was mysterious and pointed, and Cool and Sexy Asian Girl didn’t ask but to demand.\nWith her statement, the knowledge of the caller bloomed in her head like a lotus sitting cool and perfect on the still water of her mind. This was the office worker’s dealer, whose debts the office worker was trying to escape, and he would know more about Sandra than the office worker did because the office worker had met Sandra through the man. Another route to the answers.\nCool and Sexy Asian Girl navigated the rest of the conversation rotely. In her head she shredded the petals of knowledge and then ripped the roots, thought after metatextual thought chewed and dissected. Throat followed tongue followed teeth, extrapolating the logical conclusions from her actions.\nHer speech had its own momentum, spiraling back and forward in time. The city bent around the Tourist’s goals in the same way that her own history had. The Tourist did this without thinking. But she could think and speak and mold the world into existence. The city was a stage for a specific sort of play with specific rules. Every missed opportunity could be handed back in a different form. She looked at the clock hanging on the wall of the train station. It was still two in the morning.\nCool and Sexy Asian Girl could turn the city into a lotus eater machine for the Tourist. She could stay Cool and Sexy Asian Girl for as long as she wanted.\nThe lies spiraled from there. Misdirection after misdirection. Flushed data chips. Wrong addresses. Doctored websites. Carefully worded requests to new-old friends who watch her now, with one biological eye and one data chip jammed into a socket.\nCool and Sexy Asian Girl puts the poker chip down.\n“I don’t know how long I’ve been lying to him,” Cool and Sexy Asian Girl says. “It’s . . . been a night. Not even a night.”\nIt was always two in the morning when you needed it to be. It can be two in the morning for a very long time.\n“How could you not know?” the Tourist says.\nCool and Sexy Asian Girl doesn’t fall out of her chair, because she’s too cool and sexy to startle from a sudden noise. Cool and Sexy Asian Girl turns smoothly to see the Tourist silhouetted against the fluorescent hallway. He’s carrying a wad of cash in his hand. He must have finished with the bartender. She doesn’t know how long he’s been standing there. Li didn’t say anything.\nThe Tourist walks in, turning from flat shade to three-dimensional object. He grips her almost painfully by the side of the jaw, forcing her to stand. Cool and Sexy Asian Girl struggles against his grasp. But she can’t move. The city moves to help the Tourist. In a contest of strength, it takes his side.\n“You lied to me. You’re trapping me here?”\n“Let me go.”\nHe doesn’t let go. He looks at her with an expression of perfect heartbreak.\n“Why?” he says. “How long have you been keeping me here? Why would you do this? What were you trying to do?”\n“Let me go,” she says, pushing him away, wrestling with his hold.\n“Why?” he repeats again, and isn’t that just who he is. Demands masked as questions, supplicant masked as god. Cool and Sexy Asian Girl hates him violently. He has everything she scrapes for. His arrogance! As if the city is an oyster to be prized open, as if his heartbreak has any more worth than anyone else who lives here, as if his answers are a pearl and the rest of it is discarded flesh. As if she owes him anything. Cool and Sexy Asian Girl is not a good person. Cool and Sexy Asian Girl has been helping him. Cool and Sexy Asian Girl is a construct of his own imagination.\nShe should defuse the situation. She could speak the world into submission and run the world in a loop and find an excuse that would become truth.\n“Sam,” she snarls. “Do you even know my name?”\n“I—” the Tourist says, and then stops. His grasp loosens, gaze vacating as he thinks, because no, he doesn’t know her name. He never asked.\n“Sam,” Cool and Sexy Asian Girl says. “You trust me.”\nHis hand twitches. “No. Yes. Wait. I—”\nThe Tourist looks frightened, now, and it’s the first time she’s seen that expression cross Sam’s face.\n“I don’t,” he starts to say, and then stops, and then lets go. Cool and Sexy Asian Girl falls back down into her chair. Before she can stand, he’s already heading out the door and down the hallway. Cool and Sexy Asian Girl runs after him, heels clicking on the floor. The Tourist has longer legs than she does, already taking the steps two at a time back up to the bar, and Cool and Sexy Asian Girl sprints after him in her high heels and by the time she reaches the top of the stairs the Tourist’s gone.\n“Shit,” Cool and Sexy Asian Girl says.\n“Is everything so dramatic around you guys?” Li says from behind her. She hadn’t noticed him following.\n“Only around him,” Cool and Sexy Asian Girl says. She tries to turn and nearly twists her ankle when the spiked heel of her shoe snaps.\nLi catches her arm. She tries not to sag against him and fails. She’s already losing whatever makes Cool and Sexy Asian Girl cool.\n“I never understood how you could walk in those things.”\nCool and Sexy Asian Girl pulls off the broken heel, and then the other. Without them, she’s six inches shorter, and the world feels wrong from this perspective. She drops the shoes in the trash can behind the bar and sighs. Li tilts his head.\n“What now?”\n“Why do you care?”\nLi shrugs. “I’m invested. You’re my friend.”\n“Am I?” Cool and Sexy Asian Girl asks.\nLi rolls his good eye and leans against the bar. Pours himself a glass of whiskey.\n“I get to decide that, don’t I? You can say whatever you want about our history, but in the here-and-now, it’s my choice.”\n“Oh,” Cool and Sexy Asian Girl says. Li shrugs again and drains his glass and pulls the data chip out of his eye again. He holds it out to her.\n“Your boy’s probably going to come looking for it. If you want him to come looking for you.”\nCool and Sexy Asian Girl reaches out instinctively. This would lead the Tourist right back to her. It would be the easiest flow of water. She could make the Tourist forgive her. She could answer all his questions with perfect answers. The city was curving toward the Tourist again. She stops before she picks it up.\n“Am I a bad person, Li?”\n“I run an unregistered, illegal gambling ring in the basement of a nightclub,” Li says flatly.\n“But you do that because that’s what I implie—”\n“So nothing’s my fault and nothing I do matters. Which means that good and bad are meaningless constructs,” Li says. “You’re giving yourself too much credit. And too little. Take the chip or don’t. I decide, you decide, nobody gets to fucking decide. Live in the city whatever way you want. I want to give this to you, if you want it.”\nShe picks up the chip. It’s warm from Li’s body heat.\n“You didn’t tell me that Sam was standing behind me,” Cool and Sexy Asian Girl says.\n“I don’t like seeing my friends act like assholes. He was making you worse. Or you were making him worse.” Li gestures between them. “This goes both ways.”\n“But you’re giving me the chip to find him,” Cool and Sexy Asian Girl says.\n“Well, do you want it?”\nCool and Sexy Asian Girl thought she did. But it felt too easy. It felt like a test, coming from Li who knew what she had done to him, who knew what she had been doing. She felt exposed, in the sense that her motivations had been revealed and found wanting. She wanted to squirm away from Li’s flat gaze. She wondered if this is how the Tourist had felt, when he had learned that she had been lying to him. The surprise that the people around you existed outside of your narrative. Abruptly, Cool and Sexy Asian Girl felt very stupid and a little cruel. She was treating Li the same way the Tourist treated her. And maybe the same way she had treated the Tourist. Like a tool.\nThe city was a story, but Sam was a man who needed to know what happened to his wife. A man who had cried in her bed. And the city wasn’t a story about that man. The city was a story about the Tourist and his finding of answers, and it had been running in circles, loops, for a very long time, and the Tourist had learned nothing. But the city wasn’t meant to be static. Being the Tourist was making Sam worse. And being Cool and Sexy Asian Girl was making her cruel. She hadn’t been cruel, before. She remembers that now.\n“I think I want to get Sam out of here,” Cool and Sexy Asian Girl says. “Can I borrow a pair of shoes?”\nLi gestures at the door to the left.\n“Employee closet. Suyoung has feet that look your size.”\nCool and Sexy Asian Girl nods her thanks and opens the door. She rummages through the clothing that belongs to the nightclub’s employees. There’s a pair of blue sneakers that look her size. She shoves her feet in them. She closes the closet door. Li’s gone, when she looks back. The bartender has taken his place.\nShe nods at him. He nods at her.\n“Want me to close you out?”\n“Please,” she says, and then pays for the drinks. It feels like it’s been an eternity since her and the Tourist were standing here.\nCool and Sexy Asian Girl slides her way across the bar through the crowd. She’s still part of the city. That has nothing to do with the Tourist. And then she’s walking into the cold clear night, and the rain has stopped, leaving puddles of slick black reflective water, arcs of neon beamed into infinity. The motorbike is gone. The street is empty.\nThe city is holding its breath. But the neon is still on. She can hear the roar of the elevated train. The city is still the city, and the next bullet train won’t leave for another hour. It’s still two in the morning. She doesn’t think the Tourist can leave yet, anyway. He hasn’t found what he’s looking for. She’ll get him out, though.\nAnd then she’ll be someone else. In the city after the city. She’ll remember the neon and slick water. She’ll remember the nightclubs. Maybe in the next city, there will be sunrises.\nShe walks into the night, for however long it can last. For however long she can stay. Her sneakers are soaked with every footstep. She keeps walking anyway.\nIsabel J. Kim is a Korean-American science fiction and fantasy writer based in New York City. When she’s not writing, she’s practicing law, and when she’s not doing that, she’s co-hosting Wow If True, a podcast about internet culture. Her work has been published in Clarkesworld, Lightspeed, and Beneath Ceaseless Skies.", "source": "https://clarkesworldmagazine.com/kim_07_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Termination Stories for the Cyberpunk Dystopia Protagonist by Isabel J. Kim"}