{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Genevieve Valentine", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "g4Ap7ATi+Yz7C0K/PZhRt3xO+4A=", "id": null, "license": null, "comments": "", "raw_text": "3570 words, short story  Semiramis  The worst thing about being a sleeper embedded somewhere long-term was that inevitably, eventually, you started to care.  The worst thing about being embedded long-term as an administrator at the Svalbard Seed Vault was that when you inevitably started to care, you started to care about things like proper political geo-temperate arrangement of seeds, and there was just no one else in their right mind who was going to care about that with you.  That was half the reason I recruited Lise.  Ever since Svalbard had been put under review, it had been hell and a half trying to figure out how to recruit a domestic cover who could carry seeds off the island. And for something this long-term in a place as small as Longyearbyen, you needed domestic cover, or people started to suspect you for keeping apart.  The locals were out of the question, and once we were under review it was more than my life was worth to try to smuggle someone over if they didn’t already have some international clearance.  (“Under review”: the Global Coalition was interested enough in Svalbard to station spies at the ports.)  Lise had been a loose affiliate of my organization, years back. She’d dropped off the map, but it only took two tries to contact her, and one meeting to convince her.  “Good choice,” said the guy who’d met her, when he called weeks later to seal the deal. “She’s got contacts at the mine at Sveagruva. She’s already on a plane to Oslo; she’ll catch a boat out to you next week.”  The rest of the timeline was already set, for the short-term: quick public courtship, cohabitation. When our orders came in, she’d make the initial runs off the island, and then once there was a routine in place she could quietly vanish whenever things soured.  Until then she would live with me on Svalbard and keep an eye on Coalition business in town and whatever the mining company turned up.  I would keep making visits to the Seed Vault, taking inventory, ticking off names on my list, waiting for the day when I’d get the order to move out two or three seeds at a time and pass them off to whoever the highest bidders sent to collect.  (The day I was really waiting for was the day I could tell someone, “This one’s drying up. We’ll be looking for some decent soil, to grow it for re-harvest,” and have their eyes light up, too.)  “Coalition Peacekeepers just showed up—they blocked the port,” Lise says, knocking mud off her boots. “They’ve already dispatched a zoo team to look for polar bears.”  I whistle. “How many of them?”  “Enough to make sure you don’t get one fucking seed out of here,” she says. “Good luck.”  (She was a decent recruit—she’d done admin at the Millennium Seed Bank before it got militarized, had some clearance, had some brains—but she wasn’t a believer, and it showed.)  I frown at the printout in front of me—scientific names and common names and country of origin marching in four-point font for two hundred pages.  “We’ll find a way around it,” I say. “This could just be like the review. It could be years before we have to worry.”  We plan in years.  She shoulders her rifle. “I’m going out.”  Rifles are standard issue in Longyearbyen, one of the few places you can still get one. It’s required outside the city, for protection against polar bears.  (She mostly goes out to the bird cliffs and takes shots at poachers.)  “Don’t kill anyone,” I say. We need to keep cover.  A gust of cold wind, and she’s gone.  Absently, I check off Acer palmatum on the list, but my concentration is already gone, and I end up staring out the window at the shadows that gather inside shadows all over this place at night.  I don’t notice the Peacekeeper boats have moved into place until someone inside one turns on a light.  We measure time two ways.  One is the paper calendar I get at Christmas from the woman who poses, twice a year, as my sister.  Longyearbyen went nearly paperless after the Global Coalition’s Environmental Imperative was released. (We had to preserve any trees that would grow, it said; now that the waters were rising, arable land was sacrosanct.)  Tax on physical mail was obscene, but the calendar was how I received most of my instructions, so I paid.  One random day a year was “Semiramis (observed)”—the day I sent my ID over a landline, by voice.  I chose the name; she was the queen for whom they’d built the hanging gardens in Babylon.  By then I had started to care.  “Happy Semiramis,” Lise always said when she checked off that calendar day, in a tone that made me feel like I was giving away too much.  It was the only paper in the house, save the printout of the Seed Vault inventory. That had been granted exemption—pulp for the good of the nation.  Lise was the one who started ticking off days on the calendar, the very first year she arrived.  I hadn’t asked why. We didn’t like each other enough back then to get into a round of questions, and by the time we’d reached a truce it wasn’t worth asking. In this line of work, you learn just to live with people.  The other way we keep time is by tracking how much coal is worth.  Most of the coal mined on Svalbard went directly into the air conditioners at the Seed Vault, to keep the temperature at a constant zero Fahrenheit. The price of coal went up the warmer it got outside, and the more of it we needed, the less of it there was.  This was the calendar we kept for the rest of the world, to measure how bad things were getting.  Two years back, Lise had come home and said, “We passed gold on the index. Things must be rough down South.”  “Did the Coalition do anything?”  “We got an embargo—no export under threat of treason,” she said, shrugged. The coal was meant for the Vault, not for sale, and Svalbard was already under review; it wasn’t as though anything got off the island anyway, unless the Norwegian government found some country down South with the money to buy.  (Down South: anywhere beneath the Arctic line, where water levels were rising and cities were being swallowed up. Shanghai and New York had gone early, London and Copenhagen a few years later. The Maldives had vanished right off the map. Their government operated out of Mumbai until that went under, too.  The whole South was just governments sprinting for high ground, these days.)  After the Peacekeepers come, I don’t see her for two days.  The Sveagruva mine is battening down in the wake of the Peacekeepers, and she works long hours up there. Sometimes it’s easier just to sleep over.  I go out to the Seed Vault every day, in the bright green parka that makes me look like a tourist. I leave the Snow Cat and walk the last mile (less threatening), and try not to stare at the ships.  It’s surprising how high the water has risen. My first year, passing ships had been so low I could look down onto their decks; now they’re nearly eye level.  The Peacekeepers are already stationed outside, asking my business.  That’s a mistake. If you ask someone about their business, they might tell you.  (Years back, when I was still so new that I worried how I’d ever overcome my apathy about seed packets in a fucking basement, some botanists came to drop off seeds. One of them talked at me for twenty minutes about the runaway metabolism of Castanea sativa.  “Can you imagine a future without chestnuts?” she said, and handed me the envelope, and sighed. “It’s so precarious, now, with so few species allowed to grow at all. This is the last surviving breed—the very last.”  I looked at the woman in mild terror. I already knew that I was doomed to be interested one day; that didn’t mean it wasn’t an awful thing to anticipate.  Norway sealed Svalbard to donations a year after that. By the time I’d developed interest, I was alone.)  I give the Peacekeepers a more detailed description of my business than anyone has ever wanted.  “It’s the recalcitrant seeds that we really have to watch out for,” I explain about five minutes in, and then I start on runaway metabolism and desiccation effects and where we’ll be when we can’t grow chestnuts any more, and the Peacekeepers look at me pretty much the way I’d expected them to.  Still, they move aside.  I ask them, “Where’s home for you?”  “Scotland.”  “How are things there?”  They don’t answer.  (No answer: Under occupation, or under water.)  Inside, I’m relieved beyond reason the Tuberaria guttata seeds are doing well.  It had been drowned out of the Mediterranean and Wales and the States years back. This sample had been harvested from Scotland, and it doesn’t sound like there are going to be many more chances at it.  When I come home, Lise is sitting in front of the little coal stove, still in her yellow coat.  It’s a comfort. We’ve lived together for nearly eight years, and after a while you just get used to seeing someone.  (The first time I was embedded somewhere I fell in love with my domestic-cover operative. It went badly. I’ve learned not to overthink these things.)  I hang my coat. “How has it gone? Peacekeepers giving you trouble yet?”  “Their ships are upsetting the fish,” she says. “The birds are just circling. Bad enough that the cliffs are disappearing underwater. Now they’ll starve, too.”  The bird-cliffs are covered this time of year, auks and terns and kittiwakes. I went out there once, with Lise, to check out escape routes. It was a chaos of feathers and noise and the green and yellow lights of the Aurora, and I left as soon as I realized it would be impossible to scale the cliffs.  Lise goes back all the time.  (One year, early on, she brought back a tern that had been on the bad end of a fight, and she fed and warmed it all night until it died. Then she took the body outside. What she did with it she never said, and I didn’t ask. You learn to just live with people.)  I make coffee on the stove, keep one eye on her face as her expression gets darker.  By the time I sit next to her, I’ve made up my mind.  “I brought this,” I say, and pull an envelope out of my pocket.  It’s an archival envelope, unlabeled; inside is a single seed.  “Tuberaria guttata. Spotted rock rose. The flowers last less than a day. This one’s from Scotland, but it sounds like they’ve drowned by now. These are going to be worth a lot of money.”  She hasn’t taken the seed out. She’s just looking at it still tucked inside the envelope. I didn’t think her expression could get darker, but I was wrong.  “Have the orders come in?” she asks.  I should have expected concern. She thinks she’s been cut out of the loop.  “No, no,” I say. “Still waiting to hear. I just—I wanted to bring this one out. Call it a dry run.”  “Are you going to sell it?”  Suspicion I hadn’t expected.  “No,” I snap. “I just wanted you to see it.”  She looks up at that. I freeze and wait; if she calls it a present, I’ll deny it to the death.  But she only says, “Isn’t it enough you’ll be taking out the others?”  She’s not a believer, and it shows.  I pluck the envelope out of her hand.  “Two million seeds,” I say. “Will they really miss one?”  “There used to be two million birds,” she says. Her voice is strained, like she’s trying not to care.  We sit in silence until the fire goes down and the cabin’s warm enough to sleep in.  (We sleep in the same bed. This is too long-term an arrangement to be a gentleman and sleep on the couch. You plan in years.)  It takes six weeks before Peacekeepers and Svalbard locals have finished jostling for territory.  It means the worst, of course—no one’s under illusions. It means that “under review” has turned into “Coalition Protectorate” in some back room in some inland country, and the highest-bidding corporation will be moving in to take over the coal mines, and soon the Svalbard Seed Vault will be powered by Mainland Oil or MediaVox.  It means my orders are going to come through any day, so we can have a little of our own back before the MediaVox Seed Vault opens for business.  I go every day, now, just to keep the Peacekeepers used to my face.  Lise comes home from the mine, shoulders her rifle, goes out again. I don’t know where. The Peacekeepers are crowding us out wherever they can.  By now I’m staying up nights, too, researching what nations have gone under one way or another.  It’s really something how hard the Coalition works to keep its member nations separated. Once they get their import taxes and their offshore data charges and their streaming-feed embargoes on you, there’s no communicating with anyone—you might as well be submerged in the sea.  You have to strike early, before the locals have submitted to all the red tape.  You have to act before they know to stop you.  Semiramis comes.  I make the call from the loudest pub in town.  “It’s soon,” my fake sister says. “Be ready to move out past the Peacekeepers.”  I snap, “Then Lise will have to swim, because these boats aren’t budging. We need time.”  “We need at least one good run,” she says, “to make this worth it. It has to be soon.”  We argue about Peacekeepers for a minute or two in low voices, and then I talk nonsense about the weather for another five minutes, just in case.  (It’s not all nonsense—I tell her about the sea level, and she says, “We moved,” and I imagine the overpacked cities picking themselves up, buildings and all, and climbing the mountain as the water rises.)  When I come home, Lise doesn’t tell me, “Happy Semiramis.”  I can hardly be offended, but this is the first time I notice that she stopped marking days a long time ago. That worries me.  I don’t mention yet that our time to act is coming. I have a feeling I’d better have a plan before I try to get her in on it.  I’m beginning to understand the frustration of not knowing everything. My fake sister hasn’t told me what they think the Coalition will do to me, when they find out what’s happened.  It’s a when, not an if. Lise has been positioned to survive, as a condition of her participation. There’s no such provision for me. Never has been. Sometimes when you take a job, it’s your last one.  Still, I make a few more dry runs, just to keep in practice for when my orders come.  I pick some seeds that will grow in any soil (as dumb as it is, I still want to plant something, once, and watch it grow). I pick some seeds because they’re rare enough to make a decent bribe if things go south.  I pick a bird of paradise, a seed with a sharp red tuft, for no reason except that it’s been ten years since I’ve seen anything red; the Aurora is yellow and green, and the rest of the world is the tight dark of seeds, and envelopes paler than skin.  I should have planned a little more, for when this started to creep over me, but there’s no knowing how it will creep up on you until you look at a tufted seed and blink at how bright it is.  I didn’t even look up what happened to the Hanging Gardens until after I had picked the name. Turns out the ground swallowed them, but what can you do?  Every time I bring something home I hand her the envelope, so she can’t say I held out on her.  She should know what she’s doing when the time comes, and she should know the worth of what she’s carrying. I don’t plead anybody’s case—I’m not like that botanist with the chestnuts. This is business.  Usually she only glances inside. I tell her what they are and what long-gone country they came from, and she gets that drawn, sad look I’m starting to see in the mirror.  Once, she opens the envelope and says instantly, “Bird of paradise.”  I’m so surprised I smile.  She hands it back “That’s a slow grow. Good luck getting it to the blooming stage.”  “You never know,” I say.  (We plan in years.)  As part of the negotiations to keep everyone in Svalbard from turning on them, the Coalition ships finally move back out of fishing range.  They open a big enough gap on the north side of the water for seals and bears to pass; in return, the rifle-bearing locals promise to stop mistaking Peacekeepers for polar bears at night.  Thousands of birds have died from starvation in the meantime, Lise tells me that night.  “The shore under the cliff is a graveyard,” she says.  “At least the seals will be fed,” I say.  Her eyes are red. She doesn’t answer.  I imagine her skidding through the slush all the way to the cliff, seeing what she saw, and the Peacekeeper boats just out of rifle range.  I make us coffee.  A week later, Sveagruva lets its employees go.  “It’s just an interim measure,” Lise parrots, “to preserve the facility until new management can be chosen.”  I nod. “Very reassuring. Doesn’t sound at all like a MediaVox move-in.”  “Yeah,” she says. “This coal brought to you by.”  She already looks antsy about being cut off from information.  “Lise,” I say, serious. “We’ll figure a way off Svalbard for you. I’m not going to strand you here. That wasn’t the deal.”  She slings her rifle over her shoulder, disappears.  Our orders come in.  There are a hundred seeds on the list—one good run. They could be carried in someone’s coat pocket, in the fingertips of a pair of gloves, if people were still allowed in or out.  The new coal boats have clearance, but Lise isn’t employed there any more. Coalition companies start with clean slates.  “Somehow we have to get you on a ship,” I say.  She says, like we were having a totally different conversation all along, “Are they going to sell the Vault, do you think?”  I have no answer. I don’t like where this is going.  She sits back against the couch, stares at the tiny fire in our tiny stove.  “At first I thought they’d sell it off all in one piece, to one of the inland countries that can still grow something. That would be better than nothing. Any growth is better than letting things die—expensive wheat is better than no wheat. That, I would have been all right with. I would have let that happen.”  She means, I would have turned you in.  She’s using past tense, so I’m probably fine, but still I look around to make sure she’s not within reach of her gun.  She sighs. “But seeing how they’ve managed things,” and when she pauses I know she thinks of the birds, “I wonder if they’re worse than we are, and we’re better off just because we can call a theft a theft.”  “Speak for yourself,” I say, though it’s true.  She pulls something from the inside of her jacket—a seed envelope.  The little rock rose seed tumbles into her open palm, and for a second I hold my breath like it will sprout.  (I need a drink.)  Lise doesn’t look at me. “What color does it bloom?”  “Yellow.”  She nods and curls her fingers around it. I think about telling her to give me my bribe back, but I don’t. It was probably a gift. Happy Semiramis.  “I’ll join up with the people from the Gene Ark, when they show,” she says. “They never wait long to barge in and take tissue samples from native species, and they’ll need the help. I can get out that way, and come back as soon as I can.”  She says it like she’ll actually make it back here, like we haven’t done all this work for a shot at one hundred seeds before the other, smarter thieves close in.  Still, a hundred plants isn’t bad. A hundred and one—she’ll take hers with her.  “All right,” I say.  After a while she says, “You know, I’ve never been inside the Vault.”  I sit down beside her. Our shoulders are touching.  “It’s a long hallway,” I say, “and then some seeds.”  We sit awake long after the fire goes out, watching shadows gathering inside shadows, waiting for morning.  (Inevitably, eventually, you start to care.) Genevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times.", "text": "3570 words, short story\nSemiramis\nThe worst thing about being a sleeper embedded somewhere long-term was that inevitably, eventually, you started to care.\nThe worst thing about being embedded long-term as an administrator at the Svalbard Seed Vault was that when you inevitably started to care, you started to care about things like proper political geo-temperate arrangement of seeds, and there was just no one else in their right mind who was going to care about that with you.\nThat was half the reason I recruited Lise.\nEver since Svalbard had been put under review, it had been hell and a half trying to figure out how to recruit a domestic cover who could carry seeds off the island. And for something this long-term in a place as small as Longyearbyen, you needed domestic cover, or people started to suspect you for keeping apart.\nThe locals were out of the question, and once we were under review it was more than my life was worth to try to smuggle someone over if they didn’t already have some international clearance.\n(“Under review”: the Global Coalition was interested enough in Svalbard to station spies at the ports.)\nLise had been a loose affiliate of my organization, years back. She’d dropped off the map, but it only took two tries to contact her, and one meeting to convince her.\n“Good choice,” said the guy who’d met her, when he called weeks later to seal the deal. “She’s got contacts at the mine at Sveagruva. She’s already on a plane to Oslo; she’ll catch a boat out to you next week.”\nThe rest of the timeline was already set, for the short-term: quick public courtship, cohabitation. When our orders came in, she’d make the initial runs off the island, and then once there was a routine in place she could quietly vanish whenever things soured.\nUntil then she would live with me on Svalbard and keep an eye on Coalition business in town and whatever the mining company turned up.\nI would keep making visits to the Seed Vault, taking inventory, ticking off names on my list, waiting for the day when I’d get the order to move out two or three seeds at a time and pass them off to whoever the highest bidders sent to collect.\n(The day I was really waiting for was the day I could tell someone, “This one’s drying up. We’ll be looking for some decent soil, to grow it for re-harvest,” and have their eyes light up, too.)\n“Coalition Peacekeepers just showed up—they blocked the port,” Lise says, knocking mud off her boots. “They’ve already dispatched a zoo team to look for polar bears.”\nI whistle. “How many of them?”\n“Enough to make sure you don’t get one fucking seed out of here,” she says. “Good luck.”\n(She was a decent recruit—she’d done admin at the Millennium Seed Bank before it got militarized, had some clearance, had some brains—but she wasn’t a believer, and it showed.)\nI frown at the printout in front of me—scientific names and common names and country of origin marching in four-point font for two hundred pages.\n“We’ll find a way around it,” I say. “This could just be like the review. It could be years before we have to worry.”\nWe plan in years.\nShe shoulders her rifle. “I’m going out.”\nRifles are standard issue in Longyearbyen, one of the few places you can still get one. It’s required outside the city, for protection against polar bears.\n(She mostly goes out to the bird cliffs and takes shots at poachers.)\n“Don’t kill anyone,” I say. We need to keep cover.\nA gust of cold wind, and she’s gone.\nAbsently, I check off Acer palmatum on the list, but my concentration is already gone, and I end up staring out the window at the shadows that gather inside shadows all over this place at night.\nI don’t notice the Peacekeeper boats have moved into place until someone inside one turns on a light.\nWe measure time two ways.\nOne is the paper calendar I get at Christmas from the woman who poses, twice a year, as my sister.\nLongyearbyen went nearly paperless after the Global Coalition’s Environmental Imperative was released. (We had to preserve any trees that would grow, it said; now that the waters were rising, arable land was sacrosanct.)\nTax on physical mail was obscene, but the calendar was how I received most of my instructions, so I paid.\nOne random day a year was “Semiramis (observed)”—the day I sent my ID over a landline, by voice.\nI chose the name; she was the queen for whom they’d built the hanging gardens in Babylon.\nBy then I had started to care.\n“Happy Semiramis,” Lise always said when she checked off that calendar day, in a tone that made me feel like I was giving away too much.\nIt was the only paper in the house, save the printout of the Seed Vault inventory. That had been granted exemption—pulp for the good of the nation.\nLise was the one who started ticking off days on the calendar, the very first year she arrived.\nI hadn’t asked why. We didn’t like each other enough back then to get into a round of questions, and by the time we’d reached a truce it wasn’t worth asking. In this line of work, you learn just to live with people.\nThe other way we keep time is by tracking how much coal is worth.\nMost of the coal mined on Svalbard went directly into the air conditioners at the Seed Vault, to keep the temperature at a constant zero Fahrenheit. The price of coal went up the warmer it got outside, and the more of it we needed, the less of it there was.\nThis was the calendar we kept for the rest of the world, to measure how bad things were getting.\nTwo years back, Lise had come home and said, “We passed gold on the index. Things must be rough down South.”\n“Did the Coalition do anything?”\n“We got an embargo—no export under threat of treason,” she said, shrugged. The coal was meant for the Vault, not for sale, and Svalbard was already under review; it wasn’t as though anything got off the island anyway, unless the Norwegian government found some country down South with the money to buy.\n(Down South: anywhere beneath the Arctic line, where water levels were rising and cities were being swallowed up. Shanghai and New York had gone early, London and Copenhagen a few years later. The Maldives had vanished right off the map. Their government operated out of Mumbai until that went under, too.\nThe whole South was just governments sprinting for high ground, these days.)\nAfter the Peacekeepers come, I don’t see her for two days.\nThe Sveagruva mine is battening down in the wake of the Peacekeepers, and she works long hours up there. Sometimes it’s easier just to sleep over.\nI go out to the Seed Vault every day, in the bright green parka that makes me look like a tourist. I leave the Snow Cat and walk the last mile (less threatening), and try not to stare at the ships.\nIt’s surprising how high the water has risen. My first year, passing ships had been so low I could look down onto their decks; now they’re nearly eye level.\nThe Peacekeepers are already stationed outside, asking my business.\nThat’s a mistake. If you ask someone about their business, they might tell you.\n(Years back, when I was still so new that I worried how I’d ever overcome my apathy about seed packets in a fucking basement, some botanists came to drop off seeds. One of them talked at me for twenty minutes about the runaway metabolism of Castanea sativa.\n“Can you imagine a future without chestnuts?” she said, and handed me the envelope, and sighed. “It’s so precarious, now, with so few species allowed to grow at all. This is the last surviving breed—the very last.”\nI looked at the woman in mild terror. I already knew that I was doomed to be interested one day; that didn’t mean it wasn’t an awful thing to anticipate.\nNorway sealed Svalbard to donations a year after that. By the time I’d developed interest, I was alone.)\nI give the Peacekeepers a more detailed description of my business than anyone has ever wanted.\n“It’s the recalcitrant seeds that we really have to watch out for,” I explain about five minutes in, and then I start on runaway metabolism and desiccation effects and where we’ll be when we can’t grow chestnuts any more, and the Peacekeepers look at me pretty much the way I’d expected them to.\nStill, they move aside.\nI ask them, “Where’s home for you?”\n“Scotland.”\n“How are things there?”\nThey don’t answer.\n(No answer: Under occupation, or under water.)\nInside, I’m relieved beyond reason the Tuberaria guttata seeds are doing well.\nIt had been drowned out of the Mediterranean and Wales and the States years back. This sample had been harvested from Scotland, and it doesn’t sound like there are going to be many more chances at it.\nWhen I come home, Lise is sitting in front of the little coal stove, still in her yellow coat.\nIt’s a comfort. We’ve lived together for nearly eight years, and after a while you just get used to seeing someone.\n(The first time I was embedded somewhere I fell in love with my domestic-cover operative. It went badly. I’ve learned not to overthink these things.)\nI hang my coat. “How has it gone? Peacekeepers giving you trouble yet?”\n“Their ships are upsetting the fish,” she says. “The birds are just circling. Bad enough that the cliffs are disappearing underwater. Now they’ll starve, too.”\nThe bird-cliffs are covered this time of year, auks and terns and kittiwakes. I went out there once, with Lise, to check out escape routes. It was a chaos of feathers and noise and the green and yellow lights of the Aurora, and I left as soon as I realized it would be impossible to scale the cliffs.\nLise goes back all the time.\n(One year, early on, she brought back a tern that had been on the bad end of a fight, and she fed and warmed it all night until it died. Then she took the body outside. What she did with it she never said, and I didn’t ask. You learn to just live with people.)\nI make coffee on the stove, keep one eye on her face as her expression gets darker.\nBy the time I sit next to her, I’ve made up my mind.\n“I brought this,” I say, and pull an envelope out of my pocket.\nIt’s an archival envelope, unlabeled; inside is a single seed.\n“Tuberaria guttata. Spotted rock rose. The flowers last less than a day. This one’s from Scotland, but it sounds like they’ve drowned by now. These are going to be worth a lot of money.”\nShe hasn’t taken the seed out. She’s just looking at it still tucked inside the envelope. I didn’t think her expression could get darker, but I was wrong.\n“Have the orders come in?” she asks.\nI should have expected concern. She thinks she’s been cut out of the loop.\n“No, no,” I say. “Still waiting to hear. I just—I wanted to bring this one out. Call it a dry run.”\n“Are you going to sell it?”\nSuspicion I hadn’t expected.\n“No,” I snap. “I just wanted you to see it.”\nShe looks up at that. I freeze and wait; if she calls it a present, I’ll deny it to the death.\nBut she only says, “Isn’t it enough you’ll be taking out the others?”\nShe’s not a believer, and it shows.\nI pluck the envelope out of her hand.\n“Two million seeds,” I say. “Will they really miss one?”\n“There used to be two million birds,” she says. Her voice is strained, like she’s trying not to care.\nWe sit in silence until the fire goes down and the cabin’s warm enough to sleep in.\n(We sleep in the same bed. This is too long-term an arrangement to be a gentleman and sleep on the couch. You plan in years.)\nIt takes six weeks before Peacekeepers and Svalbard locals have finished jostling for territory.\nIt means the worst, of course—no one’s under illusions. It means that “under review” has turned into “Coalition Protectorate” in some back room in some inland country, and the highest-bidding corporation will be moving in to take over the coal mines, and soon the Svalbard Seed Vault will be powered by Mainland Oil or MediaVox.\nIt means my orders are going to come through any day, so we can have a little of our own back before the MediaVox Seed Vault opens for business.\nI go every day, now, just to keep the Peacekeepers used to my face.\nLise comes home from the mine, shoulders her rifle, goes out again. I don’t know where. The Peacekeepers are crowding us out wherever they can.\nBy now I’m staying up nights, too, researching what nations have gone under one way or another.\nIt’s really something how hard the Coalition works to keep its member nations separated. Once they get their import taxes and their offshore data charges and their streaming-feed embargoes on you, there’s no communicating with anyone—you might as well be submerged in the sea.\nYou have to strike early, before the locals have submitted to all the red tape.\nYou have to act before they know to stop you.\nSemiramis comes.\nI make the call from the loudest pub in town.\n“It’s soon,” my fake sister says. “Be ready to move out past the Peacekeepers.”\nI snap, “Then Lise will have to swim, because these boats aren’t budging. We need time.”\n“We need at least one good run,” she says, “to make this worth it. It has to be soon.”\nWe argue about Peacekeepers for a minute or two in low voices, and then I talk nonsense about the weather for another five minutes, just in case.\n(It’s not all nonsense—I tell her about the sea level, and she says, “We moved,” and I imagine the overpacked cities picking themselves up, buildings and all, and climbing the mountain as the water rises.)\nWhen I come home, Lise doesn’t tell me, “Happy Semiramis.”\nI can hardly be offended, but this is the first time I notice that she stopped marking days a long time ago. That worries me.\nI don’t mention yet that our time to act is coming. I have a feeling I’d better have a plan before I try to get her in on it.\nI’m beginning to understand the frustration of not knowing everything. My fake sister hasn’t told me what they think the Coalition will do to me, when they find out what’s happened.\nIt’s a when, not an if. Lise has been positioned to survive, as a condition of her participation. There’s no such provision for me. Never has been. Sometimes when you take a job, it’s your last one.\nStill, I make a few more dry runs, just to keep in practice for when my orders come.\nI pick some seeds that will grow in any soil (as dumb as it is, I still want to plant something, once, and watch it grow). I pick some seeds because they’re rare enough to make a decent bribe if things go south.\nI pick a bird of paradise, a seed with a sharp red tuft, for no reason except that it’s been ten years since I’ve seen anything red; the Aurora is yellow and green, and the rest of the world is the tight dark of seeds, and envelopes paler than skin.\nI should have planned a little more, for when this started to creep over me, but there’s no knowing how it will creep up on you until you look at a tufted seed and blink at how bright it is.\nI didn’t even look up what happened to the Hanging Gardens until after I had picked the name. Turns out the ground swallowed them, but what can you do?\nEvery time I bring something home I hand her the envelope, so she can’t say I held out on her.\nShe should know what she’s doing when the time comes, and she should know the worth of what she’s carrying. I don’t plead anybody’s case—I’m not like that botanist with the chestnuts. This is business.\nUsually she only glances inside. I tell her what they are and what long-gone country they came from, and she gets that drawn, sad look I’m starting to see in the mirror.\nOnce, she opens the envelope and says instantly, “Bird of paradise.”\nI’m so surprised I smile.\nShe hands it back “That’s a slow grow. Good luck getting it to the blooming stage.”\n“You never know,” I say.\n(We plan in years.)\nAs part of the negotiations to keep everyone in Svalbard from turning on them, the Coalition ships finally move back out of fishing range.\nThey open a big enough gap on the north side of the water for seals and bears to pass; in return, the rifle-bearing locals promise to stop mistaking Peacekeepers for polar bears at night.\nThousands of birds have died from starvation in the meantime, Lise tells me that night.\n“The shore under the cliff is a graveyard,” she says.\n“At least the seals will be fed,” I say.\nHer eyes are red. She doesn’t answer.\nI imagine her skidding through the slush all the way to the cliff, seeing what she saw, and the Peacekeeper boats just out of rifle range.\nI make us coffee.\nA week later, Sveagruva lets its employees go.\n“It’s just an interim measure,” Lise parrots, “to preserve the facility until new management can be chosen.”\nI nod. “Very reassuring. Doesn’t sound at all like a MediaVox move-in.”\n“Yeah,” she says. “This coal brought to you by.”\nShe already looks antsy about being cut off from information.\n“Lise,” I say, serious. “We’ll figure a way off Svalbard for you. I’m not going to strand you here. That wasn’t the deal.”\nShe slings her rifle over her shoulder, disappears.\nOur orders come in.\nThere are a hundred seeds on the list—one good run. They could be carried in someone’s coat pocket, in the fingertips of a pair of gloves, if people were still allowed in or out.\nThe new coal boats have clearance, but Lise isn’t employed there any more. Coalition companies start with clean slates.\n“Somehow we have to get you on a ship,” I say.\nShe says, like we were having a totally different conversation all along, “Are they going to sell the Vault, do you think?”\nI have no answer. I don’t like where this is going.\nShe sits back against the couch, stares at the tiny fire in our tiny stove.\n“At first I thought they’d sell it off all in one piece, to one of the inland countries that can still grow something. That would be better than nothing. Any growth is better than letting things die—expensive wheat is better than no wheat. That, I would have been all right with. I would have let that happen.”\nShe means, I would have turned you in.\nShe’s using past tense, so I’m probably fine, but still I look around to make sure she’s not within reach of her gun.\nShe sighs. “But seeing how they’ve managed things,” and when she pauses I know she thinks of the birds, “I wonder if they’re worse than we are, and we’re better off just because we can call a theft a theft.”\n“Speak for yourself,” I say, though it’s true.\nShe pulls something from the inside of her jacket—a seed envelope.\nThe little rock rose seed tumbles into her open palm, and for a second I hold my breath like it will sprout.\n(I need a drink.)\nLise doesn’t look at me. “What color does it bloom?”\n“Yellow.”\nShe nods and curls her fingers around it. I think about telling her to give me my bribe back, but I don’t. It was probably a gift. Happy Semiramis.\n“I’ll join up with the people from the Gene Ark, when they show,” she says. “They never wait long to barge in and take tissue samples from native species, and they’ll need the help. I can get out that way, and come back as soon as I can.”\nShe says it like she’ll actually make it back here, like we haven’t done all this work for a shot at one hundred seeds before the other, smarter thieves close in.\nStill, a hundred plants isn’t bad. A hundred and one—she’ll take hers with her.\n“All right,” I say.\nAfter a while she says, “You know, I’ve never been inside the Vault.”\nI sit down beside her. Our shoulders are touching.\n“It’s a long hallway,” I say, “and then some seeds.”\nWe sit awake long after the fire goes out, watching shadows gathering inside shadows, waiting for morning.\n(Inevitably, eventually, you start to care.)\nGenevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times.", "source": "https://clarkesworldmagazine.com/valentine_06_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Semiramis by Genevieve Valentine"}