{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Qi Yue; Elizabeth Hanlon", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6yRRTHwPc+jpiHYyBZA9oAo/TAE=", "id": null, "license": null, "comments": "", "raw_text": "11260 words, novelette  To Fly Like a Fallen Angel  1  When Li Yaya was roused from sleep, it was seven o’clock in the morning on a Saturday. This was aggravating because the day before Saturday was Friday, and on Friday nights, Yaya never retired too early.  The first thing she saw when she woke up was the empty space beside her in bed. The quilt and pillow still bore an imprint where someone had slept. Sighing, she felt for a glass of water on the nightstand and drained it.  Yaya kept her wireless network switched off while she slept, and ordinary signals should not have come through. She traced the signal out of habit—the source of the ringing was the red slip of an express company.  She was slightly taken aback. Were couriers on the clock this early? She hadn’t ordered anything, so what could this delivery be? Without further thought, she answered the alarm and called, “Hold on!”  Even if it were only a courier, she couldn’t be seen looking so disheveled. Yaya leapt out of bed and rushed into the bathroom to wash her face and comb her hair. The network portal launched automatically as soon as she got up. The news blared in her ears, and a translucent video in her field of vision partially obscured her reflection in the mirror. Yaya was still bleary-eyed, which gave everything a hazy appearance.  The top news story was still following a report from a few days ago: a group of half-witted citizens had tried to leave the city and go to the Earth’s surface. When word reached the police, they mounted an all-out rescue operation, and today, after making every effort, they had finally managed to retrieve two people. However, the two men had been overexposed to radiation, and lay dying in sickbeds. The government had issued a warning to the public about the dangers of listening to malicious lies. Levels of radiation on the surface were far from normal, and humans still could not survive aboveground.  The news story irked Yaya. First thing in the morning, the sight of her face in the mirror covered with images of the patients’ festering, blackened bodies was a real buzzkill. Stifling her annoyance, she fixed her hair, and then reached behind her back to smooth out her wings, which had become rumpled in her sleep. She arrived at the door just as the news ended.  As soon as Yaya opened the door, she was greeted by a forceful shout from the delivery boy: “HAPPY BIRTHDAY!” It was a wish brimming with Machine Age mass-produced enthusiasm, and it was delivered very loudly, which startled her. She snatched the parcel from the boy and, without a word, closed the door heavily behind her.  Yes, she always received presents on her birthdays. That was normal. But anyone who sent her a present had to know when her birthday was.  Naturally, her friends knew her birthday. Her boyfriends, too many to count on both hands. Her old drinking buddies. The coworkers with whom she had a nodding acquaintance. Only, the date they knew wasn’t today.  She hadn’t told anyone her real birthday in years, but there was no mistake. Today, Yaya was twenty-four years old. The question was, who knew her secret and would still think to send her a present?  Feeling the twenty-centimeter square parcel through the sealed plastic packaging, she went into the living room to look for scissors. At that moment, the room began to shake suddenly and violently, sending the whole of its contents dancing and skittering across the floor as a deep rumble reverberated through the space.  2  The city was located ten kilometers beneath the East China Plain, on the circum-Pacific seismic belt. Though earthquakes weren’t daily occurrences, they still happened from time to time. Since this was common knowledge, earthquake insurance was mandatory and universal. And of course, if you were especially concerned for your personal safety, it was completely acceptable to carry a helmet around with you.  Life in an underground city demanded an awareness of these conditions; since Yaya was born here, she had accepted this way of life as a matter of course. All of the furniture in Yaya’s apartment was reinforced against earthquakes, but the same could not be said for everything on top of the furniture. The quake lasted for five seconds, leaving the apartment in total disarray. Finding a pair of scissors among the clutter, she unsealed the parcel.  The sender was one Wang Fulin, a name she’d never heard before. When she opened the heavily wrapped parcel, she was bowled over. Inside was a single sheet of paper, on which was handwritten:  9:00, EAST END, CLUB POISON FIND ME She set the letter aside and collapsed onto the sofa. It was some time before she glanced at the clock, which read just past eight. The sky outside had already brightened. The underground city was naturally dark all year ’round, but the lighting, for no real reason, was still regulated according to the Earth’s rotation. Dawn, morning, noon, afternoon, dusk, night. With perfect regularity, the light gradually transitioned from one stage to the next. Supposedly the natural light on the surface behaved the same way. This was hearsay only—Yaya had never seen it. Not even the schoolteacher who’d taught her this had seen it.  Yaya was a fifth-generation resident of the underground city, and her teacher belonged to the fourth generation. It had been more than a century since humanity last saw the sun, and those who had actually observed it had died long ago. There was a great deal of talk about the Earth’s surface. For example, it was said that water poured from the skies, which were filled with cottony masses of condensed water vapor called clouds. It was said there were plains that stretched farther than the eye could see, and mountains that rose thousands of meters. Hearsay only, for no one had ever seen them.  Yaya’s world was a box, thirty-four kilometers long, seventeen kilometers wide, and two kilometers deep. The box was not especially sturdy, and sometimes it would jump and jolt. Supposedly this was caused by the movement of the plate on which the box was located, and would not have much of an impact on the box’s stability. But of course, this, too, was hearsay—no one had ever seen it.  But all of this was unimportant compared to the piece of paper in Yaya’s hand. Was this a paper letter? Wasn’t wasting resources like this a serious crime?  She glanced down and reread the letter.  9:00, EAST END, CLUB POISON FIND ME Taking a deep breath, she finally stood, opened the window, and stepped out onto the flight pad outside. It was early yet, and the city’s sky was still quiet. Almost no one was out and about. She stood there for a moment, dazed, until she heard a rush of wind beside her. On the neighboring flight pad, the auntie who lived next door, bag in hand and out of breath, dropped out of the sky. She folded her wings and smiled at Yaya. “Going out so early, lass?”  Yaya put on a smile and nodded to her. Neither woman knew the other’s name, but they always exchanged these unavoidable pleasantries.  Then Yaya leapt upward, unfurled her wings, and, with the help of the current circulating through the city’s airways, took flight.  No matter how the human body was optimized—hollower bones, a lower body fat ratio—flight would always present a challenge. Human pectoral muscles were too underdeveloped, and the forces generated by flapping wings were insufficient. To keep aloft, artificial air currents were required.  Borne by the current, Yaya flew toward the East End.  Eight o’clock was too early on a Saturday. Everyone was still at home, and the city’s airspace was deserted except for a group of elderly men and women flying against the air currents for exercise. The city’s architecture was dominated by towers that stretched two thousand meters from the ground to the ceiling, like countless bamboo poles braced against the sky. Though today’s earthquake had left a number of towers in need of repair, the cold slate-colored ceiling seemed especially sturdy. It had to be—no one wanted to see it come down.  The door to Club Poison was made of solid steel, stylish brushed metal with a black oxidized finish. The door was set into the equally featureless wall of a tower, about forty meters above the ground. This was Club Poison’s only entrance or exit, and there was no flight pad outside. Since the tower which housed the club did not abut any updrafts, the object of this construction was simple: if you wanted in, the only option was to beat your wings as hard as possible, to keep level and stop yourself from falling. When you did so, you had no energy left to make trouble, saving the bouncer a great deal of hassle.  Ordinarily, the club did not open its doors until the evening, but today Yaya received a swift answer to her knock.  “I’m looking for Xiao Jianying.”  Spitting out the name was tough, but she managed.  “Never heard of him,” said the burly bouncer inside as he moved to close the door again. With a sigh Yaya stepped forward and clasped the bouncer’s wrist. Before the bouncer could realize what was happening, he felt the nerves detach from his limbs, as though his whole body had been disconnected. Yaya hauled the man outside and heaved him toward the ground. Using the same momentum, she propelled herself through the door, hooking it closed with her right foot.  The paralytic effect would only last for about a half-second. When the man came to in midair, it would take all his strength to spread his wings and steady himself.  Club Poison was still empty, but when Yaya glanced at the clock, it was already three minutes to nine. Her heart was churning at the prospect of seeing this man, and she was uncertain what expression she should wear when the time came to face him.  She took a seat on a stool by the bar, keeping her head down. After a few minutes of apprehensive waiting, a cold bottle of beer slid toward her. She caught it reflexively with one hand, then looked up to see a man standing behind the bar, holding a beer and smiling at her.  At once Yaya was freed from her inner turmoil. As an instinctive reflex superseded all thought, she lifted her beer bottle and brought it crashing down on the top of the man’s head. With a tinkle of glass, beer frothed down the man’s face, and then he toppled headlong to the ground.  “You have a lot of nerve coming to see me,” she said.  3  Xiao Jianying had at one time been Li Yaya’s boyfriend. Things had ended between them three years ago. Back then, Yaya had been a punk, just like Jianying. Punks were always up to a bit of harmless wrongdoing: hacking into a network here and there, swiping a few account numbers, siphoning off a fraction of a percent from the bank’s turnover. When it came to tech, Yaya was among the very best. Now, in retrospect, it was clear to her that Jianying had pursued her not because she was pretty, but because she was a crack hand with all things technological. Unlike her peers, Yaya never used any of the offensive weapons already in wide circulation. Instead, she had assiduously applied herself to studying the human nervous system, and knew the nerve-to-network interface protocols like the back of her hand. As one of a handful of people who could seamlessly translate network signals into neural signals and vice versa, she could use her own brain to open direct pathways to computer networks at will, as well as influence others’ brains with wireless network signals.  Just as she had paralyzed the bouncer, with the correct signal she could access anyone’s neural interface and interfere with their brain functions. This little trick made Yaya and Jianying very famous within their circle, and for a time the pair became the police’s most wanted fugitives. Those days were aimless but happy, and their relationship lasted for three years. Yaya gave him eighteen to twenty-one, the three most beautiful years of a woman’s life. Then, on her twenty-first birthday, Jianying told her this lifestyle was meaningless, and that their love was false and would come to nothing. He wanted a more ambitious, more authentic life. Had she heard of the Dark Liberators? He wanted to join their ranks, to fight for the slaves living in the darkness. Since they had no future together, they should break up.  All Yaya remembered was listening dumbly to those words, managing only to nod and say, “Hm,” “Okay,” and “Oh.” Then Jianying turned and left without looking back.  The box city was small, and visibility was good. Two days later, Yaya spied Jianying soaring through the sky in the distance, locked in an embrace with another pretty girl. They had their arms around each other’s waists, each flapping a single wing while keeping the other wing folded. Such an extraordinarily difficult maneuver was impossible to perform without established rapport between partners, and the pair flew beautifully. From a distance, they looked like a single person.  Yaya cried for a week, then cut off all contact with her old friends, found a job, and went to work. She stopped hacking into networks and made a clean break with her past. But Yaya wasn’t certain she had ever let it go. Before that day, she couldn’t ever recall hearing about the Dark Liberators. Afterward, she seemed to hear news of the outlaw group everywhere.  According to the Liberators, the box city was kept running by a group of slaves who had been imprisoned and forced into labor. Some of these slaves were criminals from the city, and some had been born in the labor camps. They worked around the clock, with only a little bit of nutrient solution for sustenance. It was thanks to these slaves that the city’s residents could live well in this narrow, underground world.  Of course, no one had ever seen these slaves, nor could anyone locate where they lived and worked. But the rumor never went away. The Liberators were determined to liberate them, though they could not prove their existence. Yaya never believed that Jianying would leave her for such an absurd goal. There was another, far less improbable explanation: a fresh, pretty face had joined the Liberators’ ranks.  Yaya sat back down. Jianying lay collapsed on the floor, his head buried in suds. After a moment he hauled himself up by the bar. Only then did Yaya notice that his arms were covered in wounds and scars of all sizes.  “You overdid it,” said Jianying.  “Really?” said Yaya. “Sorry, I was worried a brick would weigh me down.”  “It’s been three years, but you’re still angry at me.”  “No,” she replied. “I’m not angry at you. That was purely a physiological response to disgust, like vomiting after smelling something revolting.”  Jianying sighed. “Sor—”  Yaya immediately cut him off.  “Don’t. You’re in no position to say you’re sorry to me. Stow it.” She stood up and added, “Goodbye.”  Jianying watched, momentarily stunned, as she got up.  “You . . . you’re leaving? I haven’t said anything yet.”  “Who told you I came here to listen to what you have to say? I came here for one reason—to deck you, and make myself feel a little better. Whatever you want from me, I’m not interested. You can find someone else.”  As she spoke, she strode toward the door. Immediately Jianying leapt up and grabbed her arm.  “How do you know I want your help?”  “What else could you want? Nobody looks up an ex-girlfriend three years post-break up to say ‘sorry, I was wrong,’” she snapped. “I’m not meeting you for the first time today. No, the only possibility is that you’ve come to ask for a favor. And if you’ve been forced to seek out a woman who loathes you, there can only be one reason. It’s something you can’t do, but I can. So you need a powerful hacker, and you can’t find a better person for the job. It can only be me. Sorry, I haven’t been in business for three years.”  For a moment Jianying was lost for words, but he didn’t let go.  “If you don’t help me, I’ll have nowhere else to turn,” he said.  Yaya snickered. “What, if I don’t help you, you’ll be caught, tortured, and killed by the police? All because you know they’re secretly enslaving innocent civilians?”  Her sarcastic words did not draw a laugh from Jianying; instead, his face grew even graver. “You don’t believe it? I’ve seen the slaves in the darkness. There’s no light where they live, just pitch-blackness. Most of them go their whole lives without seeing anything at all.”  “Those girls must be good lays. Show her a flame, she puts out. Bring her to the city and show her this big, bustling world, wow—”  “How can I make you believe me?”  “There’s no need to play at what-ifs.”  “If I died in front of you, would you forgive me? Would you help me?”  Yaya laughed. “No.”  Jianying pulled out a chain and handed it to her. When she didn’t take it, it fell to the ground. Jianying gave her a long hard look, then sighed deeply. He walked toward the club’s entrance, stretched out his hand, and pulled open the door.  At almost the same instant, a shot rang out. A bullet exploded through Jianying’s forehead, reducing everything above his neck to pulp. Yaya watched blankly as his body hit the floor, then looked down at herself in disbelief.  Red and white ran together.  4  Outside, an airship roared, and police poured through the open door of Club Poison, shouting and barking orders. Yaya acted on instinct, snatching the chain off the floor before taking cover in the back.  Every club had a back door. Yaya slipped behind the bar and felt around for a moment until she found it, then ducked inside and hid. She was covered in blood and brain matter from head to toe, and her white wings were stained red. There was no way she could fly back in such a state without attracting attention. She readied a neural assault pulse for the police; if she were discovered, the explosive shock to their networks would temporarily paralyze them while she escaped.  Fortunately, however, the police’s sole target was Jianying, and after a cursory search, the officers departed. It was not until they had gone and Yaya emerged from her hiding place that she recovered from her shock.  The police truly had been pursuing him. Not just pursuing—they’d shown flagrant disregard for proper arrest procedure. Their minds were made up against making an arrest long before they gunned him down.  Jianying was dead.  The fact staggered her.  And under such fishy circumstances! Why would the police shoot him dead? Had he been telling the truth? Did he get himself killed just so Yaya would help him? What the hell did he want her help with?  Countless questions, and yet none shook Yaya harder than the fact of Jianying’s death itself. This once cheeky, joyful man, whom she had loved and hated, had met his death because of her cruel remarks.  Finding a bathroom in the club, she gave herself a quick wash, dried her clothes and wings, and made a hasty exit. The police would soon return to handle the aftermath, and she absolutely could not afford to stay longer.  Yaya leapt from the doorway, wings tucked close to her body, and plunged headfirst toward the ground. She unfurled her wings at the last second, skimming perilously close to the pavement. Then, some tens of meters away, she caught an updraft that carried her skyward once more.  Only then did she dare reconnect to wireless. Yaya scoured the web for information on Jianying and the Liberators, but it was all old news. Time and again they alleged that the government was exploiting slaves at a secret base, and time and again the government came out to refute the rumor. Beyond that, there was little out of the ordinary. She could find no information whatsoever about Jianying.  Rumors about the surface, however, littered the web. Posts on more than a few discussion boards claimed that the radiation on the Earth’s surface had returned to normal, and that humans could survive there. These posts went as quickly as they came. It was not unusual to click on a post title only to find a broken or dead link.  It took Yaya a good ten minutes to fly back to her apartment. When she landed, she felt as though all the strength had been drained from her body. Her legs gave out beneath her, and she tumbled onto the sofa. After a minute or so, she pulled the chain Jianying had given her in his final moments from her pocket.  She turned it over in her hands, her heart filled with mixed emotions. Even in death, Jianying would not leave her be. He was dead set on dragging her down with him. She used to curse him every day, wishing he would die, and now he’d finally gone and done it. And without giving her a choice, he’d saddled her with this thing.  The thought stopped Yaya in her tracks. No, who said he hadn’t given her a choice? Couldn’t she have left it on the floor of the club? Even after she had picked it up, couldn’t she have chosen to face the police instead of hiding? Played the innocent and turned the chain in? Why had she picked it up? She must have known that, in doing so, she was choosing to help him, was playing willingly into his hands.  Yaya sighed.  It didn’t take her long to figure out the trick to unlocking the chain. Twisting apart a link with a black soldering seam, the entire chain went transparent. Light spilled from its interior, projecting an image of Jianying into the air.  “I must be dead, then,” said the translucent projection.  Yaya nodded. The simple AI system supported interaction, so the projection understood her gesture.  “I knew you wouldn’t believe me, so I had only one choice. Don’t blame me, okay?” The projection smiled. “I guess it doesn’t matter anymore. Now, I’ll let you in on a secret. Of course, it’s one you’ve certainly heard before, except it has never been proven.  “The government has secretly imprisoned and enslaved a group of people. Yes, that secret. It’s true. I saw it with my own eyes. You need to make this secret public. Let everyone know. A question has long escaped our consideration: if the Earth’s surface was destroyed by nuclear war, and we live underground, then where do our material resources come from? Nuclear reactors supply our power, and autotrophic microorganisms supply us with food, but where do we get everything else? Surely genetic engineering isn’t advanced enough that microorganisms can provide everything.  “Our other resources come from the surface. Make no mistake, the surface is nothing but radioactive dust. It’s a place of death, shrouded in so much fallout that you can’t see the sun. Ordinary people can’t live there. But the government forces the slaves to work aboveground. Our lives are built upon slave labor performed in pitch darkness.  “Do you know where these slaves live? They live right on top of us. That’s right, on top of us. The steel roof above our heads isn’t the end of the city. It’s only a partition between the district where we live and the slaves’ living quarters. If you can get through that, you can get to their world.  “Above us is the control plane of the entire underground city. The slaves live there, and the administrative program that controls the city is there, too. The chain contains a virus, which cost the lives of countless Liberators to obtain. It can open the partition that separates our world from the slaves’. Only then can the slaves see our world, and only then can we see theirs. I’ve seen these slaves with my own eyes. They don’t even believe a world like ours exists. They call it heaven, and say it can be reached only in death. What should we call the slave world above our heads then? Hell? No light, just darkness. A world with almost no food, and even less water. People need to see it before they’ll believe it exists.  “Save them,” said the projection. “Go, see them for yourself. Make your way to the administrative program’s console and insert the virus.”  Yaya listened until he finished speaking, and then the chain relayed her the coordinates of a secret tunnel that would bypass the ceiling. Not once did the projection say please. He simply told her. Xiao Jianying knew Li Yaya too well. He’d laid a trap and lured her into it. Once she chose to open the chain, there was already no turning back.  Sure enough, at that moment Yaya sensed the police drawing near. After all, she hadn’t bothered to cover her tracks on her way to Club Poison, and though they had missed her the first time around, there was no way she could escape detection after a thorough sweep by reinforcements. Cognizant of this fact, she had planted a spyware program in the wireless database. When positioning coordinates indicated that the police were closing in around her home, the sensor sounded an alarm signal.  Slowly and calmly, she gathered together some money, tied back her hair, and changed into clothes that were easier to move in. Then she opened the front door of the apartment and walked right out into the corridor. Thanks to the information provided by the spyware, she missed the police who were charging up the stairs by inches. After climbing three flights of stairs, Yaya pushed open a hidden door in the glass curtain wall. She had installed the door three years ago, as a contingency plan in case her involvement in a cyberheist came to light. Who knew it would come in handy now.  5  Escaping was not as simple as Yaya had imagined it would be. She knew she was a wanted criminal, but she had no inkling of just how important she was. It was not until the sensor showed the police centered like a star chart around her home that she believed Jianying had probably been telling the truth. But wily hares had three burrows, and Yaya was well prepared.  In modern society, there were two ways to track someone. The first, of course, was the tried-and-true method of locating someone by sight alone; the second relied on wireless neural network signals. All citizens depended upon implanted wireless access devices to freely access the web, and transmitting signals from the network to the implant required the receiver’s precise location. As a result, tracking any given person posed little challenge. Catching Li Yaya, however, would not be so easy.  Cybernauts were intimately familiar with this stratagem, and thus they employed a host of precautionary tactics. Yaya’s defense was simple and crude, but incredibly effective from a technical perspective—in her house was an access terminal that transmitted a copy of her own signal, while she herself had cloned the identification signal of the auntie next door. According to the police locating system, Yaya was sitting quietly in her own apartment, while her neighbor was just on her way out.  If only she’d had time to make herself up as an auntie.  Yaya glanced at the target coordinates. The building Jianying had indicated was a tower in the West End that was flagged as “under construction”. It was approximately seven kilometers away by foot, and there was also a direct air route, but she didn’t dare go straight there.  Cautiously, she took a one-kilometer detour south, then caught an updraft going northwest. Fearing large movements might attract too much attention, she kept her composure, and flew at a measured, unhurried pace. The last crime she had committed, after all, had been three years ago, and she was a little rusty in the getaway department.  When she was still three or four kilometers west of her destination, Yaya saw a police checkpoint descend. It fit like a sleeve around the current, sectioning off a large tunnel perhaps a dozen meters in diameter and twenty meters long. Everyone riding the current would need to pass through it. Once inside, an X-ray inspection system would conduct a rigorous identity check, screening everything from your bones to the tattoos on your skin to your dental records. Even if you changed your appearance, hoping to slip through unrecognized, you were certain to fail.  Of course, the sky was large, and there were plenty of other routes available. But at this point, leaving the airway was as good as announcing to the police through a megaphone, “I’m the one you’re after! Come quick and arrest me!”  They have jet bikes, thought Yaya, while you have only your own two wings. Without the current, can you make it?  Yaya didn’t panic. Scanning ahead, she saw three officers at the checkpoint entrance, and another two at the exit. The officer by the monitoring console made six in total. There was no way the police bureau knew where she was headed, so it had to be a random inspection. It was possible that these six officers weren’t fully informed of the situation, nor were they necessarily competent.  Nevertheless, these were gun-toting officers in full combat gear. Six against one, plus backup that might arrive at any minute. She couldn’t take them on alone.  Time to make new friends.  Yaya rapidly scanned the strangers around her. From among the dozen or so people nearby, she picked out four young women. With a probing signal of her own, she intercepted their signals and began to analyze the sequence of digits associated with their neural interfaces. In under two minutes, she’d acquired codes for all four women. With these, just like a telephone number, she could transmit network signals directly to their brains.  She sent them something considerably stronger than the daily news. Instantly, the four young women felt the world fall away from them, as though they had been drugged. It was like their consciousness had tumbled into a deep well. Their sensory perception grew sluggish and distant, and they lost all control of their bodies. One woman began to beat her wings vigorously. She abruptly pulled out of the current and tucked her wings into a dive. As expected, two of the officers by the entrance responded immediately, leaping onto their jet bikes and giving chase.  The officers had not gone more than a few meters before the second woman shot forward. She landed lightly on the roof of the checkpoint and sprinted across it. As the two officers in the rear of the tunnel stirred to action, she leapt from the roof without slowing down, spread her wings, and soared off in another direction. With two women dispatched in opposite directions, six officers had been whittled down one.  While the officer at the monitoring console wavered between assisting in the pursuit and sticking to his post, the third woman was already landing behind him, using the force of her descent to aim a kick at the console controls. The officer was quick enough to intercept her, but took a punishing blow to the chest.  The last woman darted to the side of the console and hit the power disconnect. The enormous tunnel began to lose its shape and crumple, dropping from the air like a kite. The people undergoing inspection screamed as they fled from both ends of the tunnel in panic. In their frantic haste to get away, they flapped their wings with everything they had. Yaya kept close behind them, hiding herself in their midst. After several minutes, the four women under her control stopped struggling against the police and returned to normal. By then, Yaya and the panicked crowd had flown more than a kilometer, swept past a fork in the airway, and scattered in all directions.  But news of the incident at the checkpoint had already spread, and soon, more police began to flood the vicinity. Fortunately, they were unsure which route Yaya had taken, and she had given herself a buffer of time. Without knowing her destination, the police were forced to split up.  She could see her target now. All that stood between Yaya and the tower was a single checkpoint.  The same trick would not work twice, however; she would have to go straight through.  Yaya climbed upward to an air current moving west at a higher altitude, giving herself more vertical space in which to accelerate. The signal generator on her wrist began to charge. Everything was ready.  She took a deep breath, then exhaled fully, contracting her lungs until her body could grow no smaller. The slightest reduction in wind resistance could shave milliseconds off her dive time—potentially, the difference between life and death.  Ten meters to the checkpoint. Five meters.  She tucked her wings and dived.  More than twenty officers guarded the entrance and exit to the tunnel. But after the stunt Yaya had pulled at the first checkpoint, they were reluctant to send too many officers in pursuit of her.  Five officers flew after her. Only five to take care of.  At her current speed, it would take just over a minute to cover the last kilometer to her destination. But no human could match the speed of a jet bike, and within seconds the five officers had her tightly boxed in, barring the way ahead, above, below, left, and right.  The wind howled in Yaya’s ears. She had no intention of slowing down. Keeping her eyes locked on the tower, she crushed the signal generator in her palm. The signal pulse stored inside it exploded forth and flooded every frequency channel, its intensity flattening all other transmissions like a tsunami. Light brighter than the sun seared through the officers’ neural networks as several hundred decibels of sound inundated their sensory perception systems. Like sampans buffeted by a hurricane, the five officers spun out of control, and Yaya, a petrel in the storm, slipped through the opening in their ranks.  She seized an officer and threw him from his jet bike. The high-speed assault overturned the bike, and it rolled several times in midair before Yaya could stabilize it and restart the engine.  When the explosive pulse went out, the officers still stationed at the checkpoint gathered that something had gone wrong. Another five-man team peeled away from the checkpoint, and the dozen or so who stayed behind opened fire on her.  Yaya hadn’t anticipated this. She had planned this route in advance, with the knowledge that a crowded airway behind her flight path would complicate the officers’ line of fire. Any stray bullets would hit innocent civilians on the thoroughfare ahead of her. It was this consideration that had emboldened her to rush the checkpoint.  But the police did not let up in the slightest. It was clear they had received an order to kill her, no matter the cost.  Yaya watched helplessly as several civilians were shot down in front of her, plummeting toward the ground. Panic swept the airway, and people scattered in all directions, like a lit firecracker. Reeling with shock, Yaya pulled her bike out of the dive. Her intent was to avoid more casualties, but the stream of civilians had fanned out, and several more people were hit as they fled upward.  The moment of deceleration allowed the officers behind her to catch up. They shot toward Yaya, sparing no thought for their fallen comrades, letting them cake the ground below.  There was no time to hesitate. Yaya pressed the jet bike as fast as it would go and plowed straight through the crowd. Evasive maneuvers would only lead to the deaths of more innocents, and it was too late for sympathy.  The unfinished tower was before her now. She did not slow down or look for an entrance. She would smash her way in.  Meters before impact, Yaya slipped from the jet bike. It punched a large hole in the resin wall of the tower, and she dove through. Steel cables stretched endlessly out of sight above and below her—a massive elevator shaft. There was no time to search for the cab. Gripping a steel cable with her left hand, she used her right hand to split open the transmission cable. A half second later, the steel cable began to reel upward. By the time the police stormed into the shaft, the ceiling had closed once more.  6  Darkness, endless darkness.Yaya was sure that in time her eyes would adjust, so she could see where she was, but she was wrong. After the steel wall closed behind her, it shut out the last light from the city. There was no light here, only absolute darkness.  This was the true nature of the city: this box, hidden deep underground beneath thick layers of rock, was sunless, silent, and utterly dark. Yaya had no way of knowing whether her eyes were open or shut, as though the link between her optic nerve and her brain was broken.  What was this place? Had Jianying been telling the truth? Was this a dark cage for rearing slaves?  Unable to see, she could not tell how large the space was. She took two tentative steps forward, then stopped. Remembering the chain, she pulled it from her pocket. With a tug, it lit up.  It was not especially luminous, but in a place like this, even a glimmer of candlelight would do. Yaya held it aloft and looked about her.  She was stunned.  She had expected to see a low, oppressive space, with winding corridors and filthy walls. But in front of her lay another scene entirely.  First there were steel girders, then more steel girders, and then more steel girders after that. The beams, half a meter thick, seemed to be the only things that existed here. They crossed and crisscrossed, extending outward like a spiderweb, stretching into the endless gloom. Each beam appeared to be thousands of meters long. Their full lengths exceeded the reach of the faint light, gradually swallowed up by the darkness.  In this vast, deserted expanse populated only by icy steel girders, Yaya stood motionless, a lonely firefly, dazed and helpless.  There were people here? What did they eat? Where did they live? How did they survive?  The spot where Yaya stood was not the floor. Rather, it was a small platform that led to the elevator shaft. The complex matrix of steel girders continued above and below it; nowhere was there enough flat space for people to live.  At first, she tried to fly, but she discovered almost immediately that there was not enough room between the intersecting beams to spread her wings.  She would have to rely on her own two feet. Without any sort of pathway, her only options were to carefully inch forward along the beams, or to climb. The beams were wide enough to walk on, but beneath her yawned a void in which she could not fly, making each step treacherous. Fortunately, her wings acted as a balancing pole, keeping her steady on her feet.  The chain pointed the way to her destination—the city’s main control room. But the farther Yaya walked, the more she felt something was amiss.  What was the point of such a large space above an underground city? The city below was already crowded to capacity. Why not develop an unused, abandoned space of this size? If the city had to be compact and sturdy to ensure its structural stability, then why build such a large skeleton around it? No matter how strong, the steel structure would only grow soft when extended indefinitely like this.  Suddenly she felt a weak tremor in the girder beneath her feet.  Dng, dng, dng.  In the silent darkness, Yaya was extra sensitive to noise and vibration.  As the tremors grew closer, a sound joined them. Her first instinct was to hide, but there was no way to dim the chain in her hand. She watched an apelike figure slowly approach until it was close enough that she could make out its appearance.  It was a man!  No, more precisely, it was an ape-man hybrid. He was hunched over and squinting, and he wasn’t wearing any clothing. His body closely resembled a human’s, but it lacked the characteristic wings.  A naked ape, then.  Yaya was at a loss what to do. Perhaps she was capable of taking on the administrative program, of liberating the slaves imprisoned here, but she did not know how to deal with animals. In the entire underground city, the only living organisms besides humans were genetically engineered microorganisms. She had never seen an animal outside of a textbook.  Would he attack her? What should she do? As she stood there, paralyzed with indecision, the naked man raised his arms to shield his eyes and opened his mouth.  “Too bright. Are you from below? You headed to slumber street?”  After a moment of hesitation, Yaya realized he was speaking Chinese.  “You can talk!”  “Nonsense, of course I can talk!” He shaded his eyes. “Get that light away from me.”  Yaya hid the chain behind her back.  “You . . . you’re . . . ”  “You’re from below. I live up top. I’ve seen your kind before. Always with the light. Hurts my eyes.”  “Are you human?” She paused. “Are you a slave here? What’s your name?”  He didn’t say anything, but suddenly straightened and jumped up. His movements were extremely nimble. Catching hold of the girder above him, he swung himself up and over.  “Name? What’s that? What’s a slave?”  Before Yaya had time to explain, a loud boom split the air. Abruptly the entire steel crossbeam began to shudder violently, as though an enormous moth had flown into the web of beams, fluttering wildly.  Yaya, who’d been standing, was nearly thrown from the beam. She clutched the nearest upright to steady herself, and in an urgent voice asked, “What’s happening?”  The man’s face darkened, giving him a very human expression. “The Hammer is coming.”  Just as Yaya opened her mouth to ask what he meant, she heard him exclaim, “Don’t move. Be quiet!”  As the tremors grew more powerful, the sound grew louder. Yaya hid the chain in her shirt, but light still showed faintly through the cloth.  A huge machine, crawling along the beams like a lizard, was bounding toward them. It looked like a diamond with claws, three to five meters long, and it moved with the agility of a monkey in the jungle. Though Yaya didn’t know what it was, its dreadful, heavy leaps and the shocks it generated upon landing warned her not to move a muscle.  Close behind her, the nameless man whispered, “Don’t breathe. It will hear you.”  Immediately Yaya held her breath, but it was already too late. The machine swiveled in their direction and landed in front of her with a tremendous crash. Its square frame was spattered with black congealed bloodstains—cold, and odorless.  Its flat front face slowly elongated and unfolded. Yaya suddenly understood where the Hammer got its name. She was face-to-face with multiple sets of claws, needles, blades, and, most conspicuously, a pair of mauls, each a half-meter in diameter.  Yaya’s heart sank. She could feel the man behind her shaking like a leaf.  The Hammer stepped forward with a shuddering boom. The mauls were inches from her face. Abruptly the man let out a shriek and shoved Yaya forward. With a powerful leap, he sprang to another girder and ran.  Yaya feared she was done for. But at that moment she heard a click from the Hammer, and then it sailed through the air, clearing five meters in a single bound. The man had not gone two steps before the Hammer was upon him. There was a sickening crunch, and he collapsed in a bloody heap.  With that, the Hammer stopped. Its body spun several full circles, then fell motionless. Yaya was too scared to move.  Then the Hammer rotated on its chassis and dropped from the beam. It leapt back and forth a few times and then disappeared completely. The silence and darkness resettled, a puddle of blood the only evidence that the man or the Hammer had ever been there. Yaya began to tremble uncontrollably.  In this dark hell, there was no freedom, no light, no clean food or water, and humans didn’t even have wings. There was only slavery and death.  Yaya raised her head and gazed upward. The city’s main control room was at the very top, a four-hour climb away.  7  Yaya was not gifted with especially good physical stamina. Climbing upward required far more exertion than walking on a flat surface. In the lattice of steel girders, her wings became a hindrance. Most of the time she had to keep them tucked close to her sides.  Along the way she glimpsed people here and there, but none of them dared approach her. She watched the wingless humans lick condensation off the cold steel girders to slake their thirst, and observed the curiosity and alarm elicited by the light in her hand. Compared to the man who had fallen victim to the Hammer, these people were simpleminded beasts.  She could not say how far she climbed before she was panting and out of breath. She began to encounter people more often. They were not as curious as those below, nor as fearful. They were slow and lethargic, and did not react to the light in her hand, like blocks of wood.  After some time, Yaya spied a sizeable platform overhead.  In a world where girders barely passed for roads, discovering a platform of more than a thousand square meters was like stumbling upon an oasis in the desert. Filled with excitement, Yaya swiftly scaled three girders to reach the platform.  That was when she saw the people, hundreds upon thousands of people, lying on the floor.  Bodies lay jumbled together on every square meter of the steel platform. Like the others Yaya had seen, they were sallow and emaciated, and naked regardless of sex. Curled atop the platform, they gave off the only warm, humid smell in a cold, dark, yet dry world.  At first, Yaya thought they were dead. But after a moment, she noticed the slow rise and fall of their chests. Their chests, like the rest of their bodies, had withered away to just skin and bone. As she looked at the women’s protruding ribs, with their atrophied breasts, Yaya found she could not tear her eyes away.  The platform was so crowded that there was no place to step, and Yaya saw some people lying stacked on top of each other. The entire huddle was fast asleep, silent and unmoving.  Is this the rumored lot where slaves were bred and raised?  Ten thousand people sleeping quietly together, breathing deeply in and out, produced a sound like the rhythmic beating of a drum. Ten thousand corpses could not have conjured the same feeling. The sleepers were alive, but they looked dead, the very image of a portal to hell.  Sleep-inducing fumes pervaded the atmosphere. The air that hung over the platform, continually recycled through the sleepers’ lungs, was heavy with carbon dioxide and water vapor, as potent as sleeping gas. Here in the darkness, it would be all too easy to fall asleep. Some of the sleepers had only drifted off, while others seemed to have closed their eyes in eternal slumber. The scene had the same effect as a hypnotic pendulum. Yaya listened to the soft, slow sound of breathing on the platform. Each breath was like a wave, rippling outward from its source, replicated by the next sleeper, a sigh passing from one mouth to another. The steady sound seemed to resonate, echoing across the thousand-meter space. Together, the sound and the air formed a dense soporific, a signal that congested her senses, beckoning her to sleep.  According to the chain’s instructions, Yaya had to cross this square. She composed herself, then walked forward.  There was barely any room to move. Yaya tried her best to step between the sleepers, but they were so tightly packed on the floor that she could scarcely put her feet down. She kept treading on naked bodies. Yet even when stepped on, they merely squirmed out of the way, and did not wake or react in any other way. They did not even groan, making no sound at all except that of deep breathing.  Several sleepers rolled over, their heads sticking out of the pile of bodies. By the chain’s faint light, Yaya could make out their eyes. They were closed, but beneath their lids, their eyeballs rolled rapidly. She then directed her attention to their mouths. Between their lips they held tubes that sprouted from the floor.  Yaya carefully extracted one of these tubes, letting a few drops of liquid dribble out. She dabbed a little on her finger and sniffed it. Its cloying saccharine scent marked it as nutrient solution with a high sugar content. They lived on this?  Yaya flipped other sleepers over to find that each one was the same, nursing a tube, eyeballs whirling in their sockets.  Were they dreaming? Eyes only moved like that during deep sleep, when the dreaming brain was operating at high speed. Ordinary people only entered REM sleep for one or two hours every night. But could it be that these sleepers were always dreaming?  Yaya spent too long bent double over the bodies. Breathing the same air over and over again, the sleepers had produced a large quantity of carbon dioxide that had built up along the floor, and soon she felt her head begin to swim.  She could not linger here. Her thoughts were beginning to grow sluggish. She hastily stood up straight. She felt dizzy. The rhythmic breathing seemed to swell, like the pendulum of a clock beating in her heart. Yaya could only hold on to a single thought—get out.  She no longer cared who she stepped on. She staggered forward, bonelessly, stumbling over bodies as she went. In her dim memory of the event, she would recall seeing people with wings lying at the far edge of the platform.  Save them, thought Yaya. In her anesthetized state, she felt no more fear as she raced along the narrow girders.  8  A house?  Yaya stood there for a moment, perplexed.  Truthfully, she didn’t know what she had expected to see at her destination. But . . . a house? In this place?  The house was lit from within, and faint light shone beneath the closed door. Before she could overthink it, she stepped forward and pushed the door open.  It was too bright. Having spent so long exploring the darkness, it was difficult to adjust her eyes. After a while, her eyes gradually adapted to the light. The room, which was lined with velvet drapes and plush gray carpet, measured perhaps two hundred square meters, and contained none of the computer equipment Yaya had expected. The only real feature of note was a huge leather sofa in the corner, on which a man in a long hooded robe was seated. The sofa was so overstuffed that he was nearly buried inside it.  The man did not react until long after Yaya entered, as though he’d just woken from sleep. He straightened and raised his head, but his face remained hidden in the shadow of his hood.  “Hello, and welcome.”  Warily, Yaya replied, “Hello.”  “I know why you have come,” the man said plainly. “You have come to put an end to me.”  Yaya was stunned.  The man shook his head, tossing his hood back. Beneath it was a hairless, skinless skull. Yaya’s initial surprise gave way quickly to understanding.  “You’re the program that controls the city!”  Without muscles, the skeleton was incapable of facial expressions, but it could nod.  “To be exact, I am an anthropomorphic shell controlled by the city’s administrative program.”  Only a shell, but no matter—she could connect to the program’s underlying core through its shell. Yaya stealthily pinched the chain in her hand, unlocking the virus. Now to find an opportunity to inject it.  She carefully observed the shell. On its exposed cervical vertebra, she noticed a cable.  Without hesitation, Yaya lunged forward, seized the skull with her right hand, and deftly yanked it forward. With her left hand, she jabbed the chain at its neck, embedding it in the cable.  The body did not resist or struggle; it even seemed to bow its head obediently to let Yaya carry out her attack with ease. Yaya held the skull in a steely grip, waiting dispassionately for the virus to finish importing before letting go.  The skeleton raised its head. “Right, are you finished? Now will you listen to me?”  Yaya waited for the virus to take effect. Several minutes passed, and still nothing happened.  “Still not convinced? I can continue to let you wait, or I can tell you the end result. There will be no result. It isn’t a virus.”  A doubtful expression crossed Yaya’s face.  “Let me explain. That is a monitoring program. It has recorded your every move since you obtained it. And judging from its log, you’ve performed admirably.”  “You . . . what does that mean?”  “It’s a long story.” The skeleton’s lower jaw clattered as it laughed. “And it is time to tell it to you. We don’t want to waste any more time. Come, tell me, where are we?”  Yaya replied guardedly, “We’re . . . above the underground city.”  “And where is this underground city?”  “Ten kilometers underground, somewhere beneath the East China Plain on the continent of Asia.”  The skeleton laughed again. “Right, well, take a look above us.”  As he spoke, the ceiling opened up, the steel plate overhead giving way to a transparent glass panel. But what lay beyond it was not the darkness Yaya expected.  She found herself looking at a thick brown soup, semi-opaque and suffused with a faint glow. Moving tendrils of light snaked across the window’s exterior, streaks of brilliance against the glass that left long light trails behind them, like spirits flitting through the night sky.  Yaya had never seen anything like it. She was hypnotized by the sight.  “We aren’t underground!” she cried. “Where are we?”  “Currently, this city is more than seven hundred million kilometers from Earth, on a vast planet much farther from the Sun. We are now in the atmosphere of Jupiter.”  A radiant arc of light flashed across the window, staining the room with red. Outside, Yaya could discern a tiny, dim disk of light—the Sun. According to her school textbooks, nuclear winter had caused a sharp drop in Earth’s surface temperature, forcing humanity to hide underground. But the Sun before her now, even with nothing blocking its rays, would never provide enough light or heat.  “We’re on Jupiter?”  “Yes,” said the skeleton. “More precisely, we are sailing through Jupiter’s atmosphere. Jupiter has no solid surface, so the city travels through a transition layer of semiliquid helium and nitrogen.”  “What . . . what about Earth?”  The wall beside Yaya lit up and became a screen. It showed a dark expanse of outer space. A large cloud of rock and debris hovered in the darkness. At either end of the cloud was a core, one bluish, the other dark red.  “This is all that is left of Earth and Mars. They are now in close proximity, but they remain in Earth’s original orbit. I never could decide what to call it. Tell me, how does ‘Marth’ strike you?”  “What happened?”  “That I do not know. But more than a century ago, human civilization expended an astronomical amount of resources to build a secret city here, many hundreds of millions of kilometers from Earth. Similar bases were established on Mars, the Moon, and Saturn. The aim was to leave backup populations in the event that human civilization on Earth was destroyed. This proves that, at the time, they were aware they faced some sort of threat, but its exact nature is still unclear to me. I suspect, of course, that the bases on the Moon and Mars are no more. I know nothing of the situation on Saturn. We are forbidden to communicate with other bases, lest we be discovered and eliminated in one fell swoop.”  “What sort of threat could be so terrifying?”  “I don’t know, nor do I wish to know. Judging by the current state of Mars and Earth, the fewer questions we ask, the better.”  “So we’re not on Earth, but in Jupiter’s atmosphere. There’s no soil anywhere around us, because we’re floating in midair?”  “Correct,” replied the skeleton. “You’ve accepted this quickly. That will earn you extra points on your examination.”  “And we might be the last survivors of the human race?”  “If luck is not on our side.”  “Then why trick us all this time? Why feed us a lie about living beneath Earth’s surface?”  The skeleton’s face remained impassive as he answered. “I suppose it’s because after the city’s first inhabitants learned Earth had been destroyed, more than half of them killed themselves.”  9  “So what you do is—”  “What I do is deceive. I let those of you in the main city believe you live within the Earth—that when nuclear winter passes, you will be able to return to the surface. Naturally, if you were familiar with the true environmental conditions on Earth, you would not be so easily mislead. Gravity is greater on Earth than it is here. Winged humans, no matter how strong, would never be able to fly on Earth.”  “And you imprison some people in this dark superstructure, enslave them—”  “No, not at all.” The skeleton shook his head. “That was not my doing. It was already so when I came into being. It was a decision made while engineers on Earth were still designing the city. Enslave them? Just what do you think those humans are?  “Well . . . slaves.”  “Slaves?” The skeleton attempted to grin. “You are more subjugated, more susceptible to manipulation than they are. You may eat better, dress better, but the value of your existence is as a blueprint, an active record of human society in its normal form. This way, when the time comes to rebuild civilization, I will have something to reference. But they . . . do you know what they are?”  Yaya kept silent.  “They, they are far more important than any of you. They are my core. Those humans dreaming on the deep sleep platform are me.”  Yaya gave a blank look.  “You’re a hacker. Do you know about cloud computing? Multiple computing resources, sharing a computational workload, combine to form a super-processor. The sleepers are my computing units. Their computational output is the program’s consciousness—that is, me. When Earth engineers designed a program powerful enough to control the city, they realized that it would exceed the capabilities of their most advanced computers. Therefore, they chose a biological material available to them: the human brain. You thought you had come to save them? Their bondage is self-imposed. The very people you wish to save control this world. Ironic, isn’t it?”  “But they’ll die . . . ”  “And others will take their place. Some are offspring produced by sexual reproduction, yes, but most are clones selected from a gene bank.”  “So you choose who is fit to live below and who is fit to live above.”  “And who may leave this place.”  “Leave?”  “Of course. What is the purpose of this city? To preserve the spark of human civilization, to rebuild. No one knows what happened to Earth, but the warning I received said, ‘Do not return to Earth, and do not attract Earth’s attention.’ If we are to rebuild, we must travel farther afield, to a distant galaxy, to a distant planet. I build ships, select crews, and launch them from the solar system, voyaging forth to reestablish human civilization.”  “So you’re responsible for assigning roles—those above, those below, and those who leave.”  “Correct. What of it?”  “Who gave you that right?”  The skeleton was stunned for a second.  “No, no, do not try that line with me. Do not trot out humanism or egalitarianism, and do not speak to me of universal values. I’ve heard it too many times. Who gave me the right? Let me tell you: humanity gave me the right. That is the answer.”  “Freedom, equality, democracy. These are good words,” the skeleton continued, “when resources are abundant and the future is bright. But when a species faces extinction, they become jokes. Did you know that when antelope leap over a crevasse, they use the old and weak members of the herd as springboards? They have no choice. They must do so or perish. Who gives antelope the right to choose who becomes a springboard and who then treads upon them? The objective of survival gives antelope this right. To that end, all veils of sentimentality are laughable. Freedom? Equality? Yes, if I did not have the right to decide a person’s life, whether it be humble or lofty, would that not give those who oppose me the right to decide the fate of humanity as a species? May I ask you a question?”  Yaya said nothing.  “Suppose there are two identical modern civilizations. They know that in fifty years’ time there will be a terrible calamity. One civilization sacrifices the vast majority of its people, enslaves them, and entrusts all of its resources to the top scientists, technicians, and leaders that comprise less than one-ten thousandth of the population. They give up everything for a chance at survival. The other civilization holds fast to its shared morality, to personal liberty and equality. Its scientists and technicians are not given control of any additional resources. Which civilization, do you think, can save its own species?”  In a low voice Yaya answered, “The first one.”  The skeleton nodded. “Human civilization on Earth made the same choice. Before the arrival of the threat, humanity had just reached Mars. But after the threat was detected, within fifty years they had channeled Earth’s entire capacity into creating this base. It is a spark of humanity, perhaps the only spark. No matter the cost in lives or material, I must do everything I can to keep this spark alive. This is the mission given to me by humanity. I have no morals, I do not respect life, and I don’t consider the feelings of the individuals whose lives I control. I consider only whether an action will improve humanity’s chance of survival or reduce it.”  Yaya simply gazed at the sky overhead.  “There is no one else besides us?”  “I don’t know,” replied the skeleton. “I don’t know whether the Saturn base is still there, or whether there are other bases that I’m unaware of. We can never contact each other. We are alone, and we must think of ourselves as the only extant humans in the entire universe. Even the threat is unknown to me. All I know is that we are unsafe in this dark universe. There is something here, lying in wait to devour us.”  Yaya’s face was despondent. One day ago, she’d been an ordinary office worker living in an underground city. One hour ago, she’d been a freedom fighter bent on liberating slaves from darkness. But now, she stood alongside the overseer of the last city humans might ever build, tasting loneliness and fear in the face of the cosmos.  “Then why am I here?”  “Simple. This is a test. As I said before, the group of people in the main city serves as a model human society, and the group above the city comprises my consciousness. I control all of that. But there is also the third group. I am constantly manufacturing and launching interstellar voyagers. Since I cannot possibly control what happens on those voyages, I need individuals with sufficient judgment and strong executive function skills to serve as captains. That is the reason you are here.”  “So everything that happened was part of a test? Jianying, the officers who died, the innocent bystanders who were shot—they were the price that had to be paid to conduct this test.”  “Yes.” The skeleton nodded. “The purpose of destroying those innocents was to conduct a single test, in the hope of identifying a candidate for the captaincy.”  Yaya pictured them. Some had been familiar to her, some she had only glimpsed their faces, and some she hadn’t even known their gender. They had died for a cause wholly unconnected to them, one they would never truly comprehend.  “I’m surprised by your frankness,” said Yaya. “You hope I will serve as a captain, but you couldn’t predict that would make me angry and uncooperative?”  “I knew it would,” replied the skeleton, “but I must be transparent with you. I am searching for a suitable person to serve as captain. Whether that person is you, I don’t know. That person must be able to acknowledge all of this, must recognize that certain goals demand certain sacrifices. Only then do these interstellar voyages stand a chance of success.  “To date, I have launched twenty-six voyagers. Do you know the earthquakes that hit the city? How can there be earthquakes if the city is flying? They are simply the shock waves created when the ships are tested, launched, or docked. When a voyager departs the city, it becomes a solitary entity. We don’t know what the threat is, or where it is, so external communication is prohibited. It cannot make contact with me or the other ships. Even now, I don’t know where the voyagers are, or if they still live.  “Every voyage is a maiden voyage. The crew can have no experience, and there are no previous expeditions to reference. If a black hole waits in Pluto’s orbit, swallowing each ship as it passes, then they will perish together like fools. No one will warn them what dangers lie ahead. No one can tell them, ‘Stay away! Find a different route.’ There can be no data, no information, no transmissions. The voyagers are not numbered, because each one is the only one. Every captain must stand firm, must be harsh and uncompromising. Is it cruel of me to kill those who escape the deep sleep platform? Yes. But the captain must be crueler still. If killing half the crew for food will extend the voyage another month, then she must give the order without hesitation.”  The skeleton gazed at Li Yaya. “That is all I have to say, child. The decision is yours. If you choose to serve as my captain, there may be a place for you on a voyager. If you are unwilling, there is a place for you on the platform. This is the reality of our lives, the reality of humanity’s last city. Now choose.”    Originally published in Chinese in Science Fiction World, 2009.    Translated and published in partnership with Storycom.  Qi Yue is a highly popular science fiction and fantasy writer from Sichuan, China. He graduated from Nanjing University with a degree in biology and currently works in the gaming industry. Representative works include the fantasy novels Fumingshi and The Mechanic's Log. He has also written a series of novels set within the Heroes of Might and Magic and World of Warcraft universes, as well as a wide variety of science fiction novels.  Elizabeth Hanlon is a Boston-based translator of Chinese fiction. She is a graduate of Tulane University and studied Chinese at the Inter-University Program for Chinese Language Studies at Tsinghua University. Her published translations include Of Ants and Dinosaurs, a novella by Hugo-Award-winning sci-fi author Cixin Liu; Beijing Graffiti, a non-fiction work on Beijing’s graffiti culture, and several short stories.", "text": "11260 words, novelette\nTo Fly Like a Fallen Angel\n1\nWhen Li Yaya was roused from sleep, it was seven o’clock in the morning on a Saturday. This was aggravating because the day before Saturday was Friday, and on Friday nights, Yaya never retired too early.\nThe first thing she saw when she woke up was the empty space beside her in bed. The quilt and pillow still bore an imprint where someone had slept. Sighing, she felt for a glass of water on the nightstand and drained it.\nYaya kept her wireless network switched off while she slept, and ordinary signals should not have come through. She traced the signal out of habit—the source of the ringing was the red slip of an express company.\nShe was slightly taken aback. Were couriers on the clock this early? She hadn’t ordered anything, so what could this delivery be? Without further thought, she answered the alarm and called, “Hold on!”\nEven if it were only a courier, she couldn’t be seen looking so disheveled. Yaya leapt out of bed and rushed into the bathroom to wash her face and comb her hair. The network portal launched automatically as soon as she got up. The news blared in her ears, and a translucent video in her field of vision partially obscured her reflection in the mirror. Yaya was still bleary-eyed, which gave everything a hazy appearance.\nThe top news story was still following a report from a few days ago: a group of half-witted citizens had tried to leave the city and go to the Earth’s surface. When word reached the police, they mounted an all-out rescue operation, and today, after making every effort, they had finally managed to retrieve two people. However, the two men had been overexposed to radiation, and lay dying in sickbeds. The government had issued a warning to the public about the dangers of listening to malicious lies. Levels of radiation on the surface were far from normal, and humans still could not survive aboveground.\nThe news story irked Yaya. First thing in the morning, the sight of her face in the mirror covered with images of the patients’ festering, blackened bodies was a real buzzkill. Stifling her annoyance, she fixed her hair, and then reached behind her back to smooth out her wings, which had become rumpled in her sleep. She arrived at the door just as the news ended.\nAs soon as Yaya opened the door, she was greeted by a forceful shout from the delivery boy: “HAPPY BIRTHDAY!” It was a wish brimming with Machine Age mass-produced enthusiasm, and it was delivered very loudly, which startled her. She snatched the parcel from the boy and, without a word, closed the door heavily behind her.\nYes, she always received presents on her birthdays. That was normal. But anyone who sent her a present had to know when her birthday was.\nNaturally, her friends knew her birthday. Her boyfriends, too many to count on both hands. Her old drinking buddies. The coworkers with whom she had a nodding acquaintance. Only, the date they knew wasn’t today.\nShe hadn’t told anyone her real birthday in years, but there was no mistake. Today, Yaya was twenty-four years old. The question was, who knew her secret and would still think to send her a present?\nFeeling the twenty-centimeter square parcel through the sealed plastic packaging, she went into the living room to look for scissors. At that moment, the room began to shake suddenly and violently, sending the whole of its contents dancing and skittering across the floor as a deep rumble reverberated through the space.\n2\nThe city was located ten kilometers beneath the East China Plain, on the circum-Pacific seismic belt. Though earthquakes weren’t daily occurrences, they still happened from time to time. Since this was common knowledge, earthquake insurance was mandatory and universal. And of course, if you were especially concerned for your personal safety, it was completely acceptable to carry a helmet around with you.\nLife in an underground city demanded an awareness of these conditions; since Yaya was born here, she had accepted this way of life as a matter of course. All of the furniture in Yaya’s apartment was reinforced against earthquakes, but the same could not be said for everything on top of the furniture. The quake lasted for five seconds, leaving the apartment in total disarray. Finding a pair of scissors among the clutter, she unsealed the parcel.\nThe sender was one Wang Fulin, a name she’d never heard before. When she opened the heavily wrapped parcel, she was bowled over. Inside was a single sheet of paper, on which was handwritten:\n9:00, EAST END, CLUB POISON\nFIND ME\nShe set the letter aside and collapsed onto the sofa. It was some time before she glanced at the clock, which read just past eight. The sky outside had already brightened. The underground city was naturally dark all year ’round, but the lighting, for no real reason, was still regulated according to the Earth’s rotation. Dawn, morning, noon, afternoon, dusk, night. With perfect regularity, the light gradually transitioned from one stage to the next. Supposedly the natural light on the surface behaved the same way. This was hearsay only—Yaya had never seen it. Not even the schoolteacher who’d taught her this had seen it.\nYaya was a fifth-generation resident of the underground city, and her teacher belonged to the fourth generation. It had been more than a century since humanity last saw the sun, and those who had actually observed it had died long ago. There was a great deal of talk about the Earth’s surface. For example, it was said that water poured from the skies, which were filled with cottony masses of condensed water vapor called clouds. It was said there were plains that stretched farther than the eye could see, and mountains that rose thousands of meters. Hearsay only, for no one had ever seen them.\nYaya’s world was a box, thirty-four kilometers long, seventeen kilometers wide, and two kilometers deep. The box was not especially sturdy, and sometimes it would jump and jolt. Supposedly this was caused by the movement of the plate on which the box was located, and would not have much of an impact on the box’s stability. But of course, this, too, was hearsay—no one had ever seen it.\nBut all of this was unimportant compared to the piece of paper in Yaya’s hand. Was this a paper letter? Wasn’t wasting resources like this a serious crime?\nShe glanced down and reread the letter.\n9:00, EAST END, CLUB POISON\nFIND ME\nTaking a deep breath, she finally stood, opened the window, and stepped out onto the flight pad outside. It was early yet, and the city’s sky was still quiet. Almost no one was out and about. She stood there for a moment, dazed, until she heard a rush of wind beside her. On the neighboring flight pad, the auntie who lived next door, bag in hand and out of breath, dropped out of the sky. She folded her wings and smiled at Yaya. “Going out so early, lass?”\nYaya put on a smile and nodded to her. Neither woman knew the other’s name, but they always exchanged these unavoidable pleasantries.\nThen Yaya leapt upward, unfurled her wings, and, with the help of the current circulating through the city’s airways, took flight.\nNo matter how the human body was optimized—hollower bones, a lower body fat ratio—flight would always present a challenge. Human pectoral muscles were too underdeveloped, and the forces generated by flapping wings were insufficient. To keep aloft, artificial air currents were required.\nBorne by the current, Yaya flew toward the East End.\nEight o’clock was too early on a Saturday. Everyone was still at home, and the city’s airspace was deserted except for a group of elderly men and women flying against the air currents for exercise. The city’s architecture was dominated by towers that stretched two thousand meters from the ground to the ceiling, like countless bamboo poles braced against the sky. Though today’s earthquake had left a number of towers in need of repair, the cold slate-colored ceiling seemed especially sturdy. It had to be—no one wanted to see it come down.\nThe door to Club Poison was made of solid steel, stylish brushed metal with a black oxidized finish. The door was set into the equally featureless wall of a tower, about forty meters above the ground. This was Club Poison’s only entrance or exit, and there was no flight pad outside. Since the tower which housed the club did not abut any updrafts, the object of this construction was simple: if you wanted in, the only option was to beat your wings as hard as possible, to keep level and stop yourself from falling. When you did so, you had no energy left to make trouble, saving the bouncer a great deal of hassle.\nOrdinarily, the club did not open its doors until the evening, but today Yaya received a swift answer to her knock.\n“I’m looking for Xiao Jianying.”\nSpitting out the name was tough, but she managed.\n“Never heard of him,” said the burly bouncer inside as he moved to close the door again. With a sigh Yaya stepped forward and clasped the bouncer’s wrist. Before the bouncer could realize what was happening, he felt the nerves detach from his limbs, as though his whole body had been disconnected. Yaya hauled the man outside and heaved him toward the ground. Using the same momentum, she propelled herself through the door, hooking it closed with her right foot.\nThe paralytic effect would only last for about a half-second. When the man came to in midair, it would take all his strength to spread his wings and steady himself.\nClub Poison was still empty, but when Yaya glanced at the clock, it was already three minutes to nine. Her heart was churning at the prospect of seeing this man, and she was uncertain what expression she should wear when the time came to face him.\nShe took a seat on a stool by the bar, keeping her head down. After a few minutes of apprehensive waiting, a cold bottle of beer slid toward her. She caught it reflexively with one hand, then looked up to see a man standing behind the bar, holding a beer and smiling at her.\nAt once Yaya was freed from her inner turmoil. As an instinctive reflex superseded all thought, she lifted her beer bottle and brought it crashing down on the top of the man’s head. With a tinkle of glass, beer frothed down the man’s face, and then he toppled headlong to the ground.\n“You have a lot of nerve coming to see me,” she said.\n3\nXiao Jianying had at one time been Li Yaya’s boyfriend. Things had ended between them three years ago. Back then, Yaya had been a punk, just like Jianying. Punks were always up to a bit of harmless wrongdoing: hacking into a network here and there, swiping a few account numbers, siphoning off a fraction of a percent from the bank’s turnover. When it came to tech, Yaya was among the very best. Now, in retrospect, it was clear to her that Jianying had pursued her not because she was pretty, but because she was a crack hand with all things technological. Unlike her peers, Yaya never used any of the offensive weapons already in wide circulation. Instead, she had assiduously applied herself to studying the human nervous system, and knew the nerve-to-network interface protocols like the back of her hand. As one of a handful of people who could seamlessly translate network signals into neural signals and vice versa, she could use her own brain to open direct pathways to computer networks at will, as well as influence others’ brains with wireless network signals.\nJust as she had paralyzed the bouncer, with the correct signal she could access anyone’s neural interface and interfere with their brain functions. This little trick made Yaya and Jianying very famous within their circle, and for a time the pair became the police’s most wanted fugitives. Those days were aimless but happy, and their relationship lasted for three years. Yaya gave him eighteen to twenty-one, the three most beautiful years of a woman’s life. Then, on her twenty-first birthday, Jianying told her this lifestyle was meaningless, and that their love was false and would come to nothing. He wanted a more ambitious, more authentic life. Had she heard of the Dark Liberators? He wanted to join their ranks, to fight for the slaves living in the darkness. Since they had no future together, they should break up.\nAll Yaya remembered was listening dumbly to those words, managing only to nod and say, “Hm,” “Okay,” and “Oh.” Then Jianying turned and left without looking back.\nThe box city was small, and visibility was good. Two days later, Yaya spied Jianying soaring through the sky in the distance, locked in an embrace with another pretty girl. They had their arms around each other’s waists, each flapping a single wing while keeping the other wing folded. Such an extraordinarily difficult maneuver was impossible to perform without established rapport between partners, and the pair flew beautifully. From a distance, they looked like a single person.\nYaya cried for a week, then cut off all contact with her old friends, found a job, and went to work. She stopped hacking into networks and made a clean break with her past. But Yaya wasn’t certain she had ever let it go. Before that day, she couldn’t ever recall hearing about the Dark Liberators. Afterward, she seemed to hear news of the outlaw group everywhere.\nAccording to the Liberators, the box city was kept running by a group of slaves who had been imprisoned and forced into labor. Some of these slaves were criminals from the city, and some had been born in the labor camps. They worked around the clock, with only a little bit of nutrient solution for sustenance. It was thanks to these slaves that the city’s residents could live well in this narrow, underground world.\nOf course, no one had ever seen these slaves, nor could anyone locate where they lived and worked. But the rumor never went away. The Liberators were determined to liberate them, though they could not prove their existence. Yaya never believed that Jianying would leave her for such an absurd goal. There was another, far less improbable explanation: a fresh, pretty face had joined the Liberators’ ranks.\nYaya sat back down. Jianying lay collapsed on the floor, his head buried in suds. After a moment he hauled himself up by the bar. Only then did Yaya notice that his arms were covered in wounds and scars of all sizes.\n“You overdid it,” said Jianying.\n“Really?” said Yaya. “Sorry, I was worried a brick would weigh me down.”\n“It’s been three years, but you’re still angry at me.”\n“No,” she replied. “I’m not angry at you. That was purely a physiological response to disgust, like vomiting after smelling something revolting.”\nJianying sighed. “Sor—”\nYaya immediately cut him off.\n“Don’t. You’re in no position to say you’re sorry to me. Stow it.” She stood up and added, “Goodbye.”\nJianying watched, momentarily stunned, as she got up.\n“You . . . you’re leaving? I haven’t said anything yet.”\n“Who told you I came here to listen to what you have to say? I came here for one reason—to deck you, and make myself feel a little better. Whatever you want from me, I’m not interested. You can find someone else.”\nAs she spoke, she strode toward the door. Immediately Jianying leapt up and grabbed her arm.\n“How do you know I want your help?”\n“What else could you want? Nobody looks up an ex-girlfriend three years post-break up to say ‘sorry, I was wrong,’” she snapped. “I’m not meeting you for the first time today. No, the only possibility is that you’ve come to ask for a favor. And if you’ve been forced to seek out a woman who loathes you, there can only be one reason. It’s something you can’t do, but I can. So you need a powerful hacker, and you can’t find a better person for the job. It can only be me. Sorry, I haven’t been in business for three years.”\nFor a moment Jianying was lost for words, but he didn’t let go.\n“If you don’t help me, I’ll have nowhere else to turn,” he said.\nYaya snickered. “What, if I don’t help you, you’ll be caught, tortured, and killed by the police? All because you know they’re secretly enslaving innocent civilians?”\nHer sarcastic words did not draw a laugh from Jianying; instead, his face grew even graver. “You don’t believe it? I’ve seen the slaves in the darkness. There’s no light where they live, just pitch-blackness. Most of them go their whole lives without seeing anything at all.”\n“Those girls must be good lays. Show her a flame, she puts out. Bring her to the city and show her this big, bustling world, wow—”\n“How can I make you believe me?”\n“There’s no need to play at what-ifs.”\n“If I died in front of you, would you forgive me? Would you help me?”\nYaya laughed. “No.”\nJianying pulled out a chain and handed it to her. When she didn’t take it, it fell to the ground. Jianying gave her a long hard look, then sighed deeply. He walked toward the club’s entrance, stretched out his hand, and pulled open the door.\nAt almost the same instant, a shot rang out. A bullet exploded through Jianying’s forehead, reducing everything above his neck to pulp. Yaya watched blankly as his body hit the floor, then looked down at herself in disbelief.\nRed and white ran together.\n4\nOutside, an airship roared, and police poured through the open door of Club Poison, shouting and barking orders. Yaya acted on instinct, snatching the chain off the floor before taking cover in the back.\nEvery club had a back door. Yaya slipped behind the bar and felt around for a moment until she found it, then ducked inside and hid. She was covered in blood and brain matter from head to toe, and her white wings were stained red. There was no way she could fly back in such a state without attracting attention. She readied a neural assault pulse for the police; if she were discovered, the explosive shock to their networks would temporarily paralyze them while she escaped.\nFortunately, however, the police’s sole target was Jianying, and after a cursory search, the officers departed. It was not until they had gone and Yaya emerged from her hiding place that she recovered from her shock.\nThe police truly had been pursuing him. Not just pursuing—they’d shown flagrant disregard for proper arrest procedure. Their minds were made up against making an arrest long before they gunned him down.\nJianying was dead.\nThe fact staggered her.\nAnd under such fishy circumstances! Why would the police shoot him dead? Had he been telling the truth? Did he get himself killed just so Yaya would help him? What the hell did he want her help with?\nCountless questions, and yet none shook Yaya harder than the fact of Jianying’s death itself. This once cheeky, joyful man, whom she had loved and hated, had met his death because of her cruel remarks.\nFinding a bathroom in the club, she gave herself a quick wash, dried her clothes and wings, and made a hasty exit. The police would soon return to handle the aftermath, and she absolutely could not afford to stay longer.\nYaya leapt from the doorway, wings tucked close to her body, and plunged headfirst toward the ground. She unfurled her wings at the last second, skimming perilously close to the pavement. Then, some tens of meters away, she caught an updraft that carried her skyward once more.\nOnly then did she dare reconnect to wireless. Yaya scoured the web for information on Jianying and the Liberators, but it was all old news. Time and again they alleged that the government was exploiting slaves at a secret base, and time and again the government came out to refute the rumor. Beyond that, there was little out of the ordinary. She could find no information whatsoever about Jianying.\nRumors about the surface, however, littered the web. Posts on more than a few discussion boards claimed that the radiation on the Earth’s surface had returned to normal, and that humans could survive there. These posts went as quickly as they came. It was not unusual to click on a post title only to find a broken or dead link.\nIt took Yaya a good ten minutes to fly back to her apartment. When she landed, she felt as though all the strength had been drained from her body. Her legs gave out beneath her, and she tumbled onto the sofa. After a minute or so, she pulled the chain Jianying had given her in his final moments from her pocket.\nShe turned it over in her hands, her heart filled with mixed emotions. Even in death, Jianying would not leave her be. He was dead set on dragging her down with him. She used to curse him every day, wishing he would die, and now he’d finally gone and done it. And without giving her a choice, he’d saddled her with this thing.\nThe thought stopped Yaya in her tracks. No, who said he hadn’t given her a choice? Couldn’t she have left it on the floor of the club? Even after she had picked it up, couldn’t she have chosen to face the police instead of hiding? Played the innocent and turned the chain in? Why had she picked it up? She must have known that, in doing so, she was choosing to help him, was playing willingly into his hands.\nYaya sighed.\nIt didn’t take her long to figure out the trick to unlocking the chain. Twisting apart a link with a black soldering seam, the entire chain went transparent. Light spilled from its interior, projecting an image of Jianying into the air.\n“I must be dead, then,” said the translucent projection.\nYaya nodded. The simple AI system supported interaction, so the projection understood her gesture.\n“I knew you wouldn’t believe me, so I had only one choice. Don’t blame me, okay?” The projection smiled. “I guess it doesn’t matter anymore. Now, I’ll let you in on a secret. Of course, it’s one you’ve certainly heard before, except it has never been proven.\n“The government has secretly imprisoned and enslaved a group of people. Yes, that secret. It’s true. I saw it with my own eyes. You need to make this secret public. Let everyone know. A question has long escaped our consideration: if the Earth’s surface was destroyed by nuclear war, and we live underground, then where do our material resources come from? Nuclear reactors supply our power, and autotrophic microorganisms supply us with food, but where do we get everything else? Surely genetic engineering isn’t advanced enough that microorganisms can provide everything.\n“Our other resources come from the surface. Make no mistake, the surface is nothing but radioactive dust. It’s a place of death, shrouded in so much fallout that you can’t see the sun. Ordinary people can’t live there. But the government forces the slaves to work aboveground. Our lives are built upon slave labor performed in pitch darkness.\n“Do you know where these slaves live? They live right on top of us. That’s right, on top of us. The steel roof above our heads isn’t the end of the city. It’s only a partition between the district where we live and the slaves’ living quarters. If you can get through that, you can get to their world.\n“Above us is the control plane of the entire underground city. The slaves live there, and the administrative program that controls the city is there, too. The chain contains a virus, which cost the lives of countless Liberators to obtain. It can open the partition that separates our world from the slaves’. Only then can the slaves see our world, and only then can we see theirs. I’ve seen these slaves with my own eyes. They don’t even believe a world like ours exists. They call it heaven, and say it can be reached only in death. What should we call the slave world above our heads then? Hell? No light, just darkness. A world with almost no food, and even less water. People need to see it before they’ll believe it exists.\n“Save them,” said the projection. “Go, see them for yourself. Make your way to the administrative program’s console and insert the virus.”\nYaya listened until he finished speaking, and then the chain relayed her the coordinates of a secret tunnel that would bypass the ceiling. Not once did the projection say please. He simply told her. Xiao Jianying knew Li Yaya too well. He’d laid a trap and lured her into it. Once she chose to open the chain, there was already no turning back.\nSure enough, at that moment Yaya sensed the police drawing near. After all, she hadn’t bothered to cover her tracks on her way to Club Poison, and though they had missed her the first time around, there was no way she could escape detection after a thorough sweep by reinforcements. Cognizant of this fact, she had planted a spyware program in the wireless database. When positioning coordinates indicated that the police were closing in around her home, the sensor sounded an alarm signal.\nSlowly and calmly, she gathered together some money, tied back her hair, and changed into clothes that were easier to move in. Then she opened the front door of the apartment and walked right out into the corridor. Thanks to the information provided by the spyware, she missed the police who were charging up the stairs by inches. After climbing three flights of stairs, Yaya pushed open a hidden door in the glass curtain wall. She had installed the door three years ago, as a contingency plan in case her involvement in a cyberheist came to light. Who knew it would come in handy now.\n5\nEscaping was not as simple as Yaya had imagined it would be. She knew she was a wanted criminal, but she had no inkling of just how important she was. It was not until the sensor showed the police centered like a star chart around her home that she believed Jianying had probably been telling the truth. But wily hares had three burrows, and Yaya was well prepared.\nIn modern society, there were two ways to track someone. The first, of course, was the tried-and-true method of locating someone by sight alone; the second relied on wireless neural network signals. All citizens depended upon implanted wireless access devices to freely access the web, and transmitting signals from the network to the implant required the receiver’s precise location. As a result, tracking any given person posed little challenge. Catching Li Yaya, however, would not be so easy.\nCybernauts were intimately familiar with this stratagem, and thus they employed a host of precautionary tactics. Yaya’s defense was simple and crude, but incredibly effective from a technical perspective—in her house was an access terminal that transmitted a copy of her own signal, while she herself had cloned the identification signal of the auntie next door. According to the police locating system, Yaya was sitting quietly in her own apartment, while her neighbor was just on her way out.\nIf only she’d had time to make herself up as an auntie.\nYaya glanced at the target coordinates. The building Jianying had indicated was a tower in the West End that was flagged as “under construction”. It was approximately seven kilometers away by foot, and there was also a direct air route, but she didn’t dare go straight there.\nCautiously, she took a one-kilometer detour south, then caught an updraft going northwest. Fearing large movements might attract too much attention, she kept her composure, and flew at a measured, unhurried pace. The last crime she had committed, after all, had been three years ago, and she was a little rusty in the getaway department.\nWhen she was still three or four kilometers west of her destination, Yaya saw a police checkpoint descend. It fit like a sleeve around the current, sectioning off a large tunnel perhaps a dozen meters in diameter and twenty meters long. Everyone riding the current would need to pass through it. Once inside, an X-ray inspection system would conduct a rigorous identity check, screening everything from your bones to the tattoos on your skin to your dental records. Even if you changed your appearance, hoping to slip through unrecognized, you were certain to fail.\nOf course, the sky was large, and there were plenty of other routes available. But at this point, leaving the airway was as good as announcing to the police through a megaphone, “I’m the one you’re after! Come quick and arrest me!”\nThey have jet bikes, thought Yaya, while you have only your own two wings. Without the current, can you make it?\nYaya didn’t panic. Scanning ahead, she saw three officers at the checkpoint entrance, and another two at the exit. The officer by the monitoring console made six in total. There was no way the police bureau knew where she was headed, so it had to be a random inspection. It was possible that these six officers weren’t fully informed of the situation, nor were they necessarily competent.\nNevertheless, these were gun-toting officers in full combat gear. Six against one, plus backup that might arrive at any minute. She couldn’t take them on alone.\nTime to make new friends.\nYaya rapidly scanned the strangers around her. From among the dozen or so people nearby, she picked out four young women. With a probing signal of her own, she intercepted their signals and began to analyze the sequence of digits associated with their neural interfaces. In under two minutes, she’d acquired codes for all four women. With these, just like a telephone number, she could transmit network signals directly to their brains.\nShe sent them something considerably stronger than the daily news. Instantly, the four young women felt the world fall away from them, as though they had been drugged. It was like their consciousness had tumbled into a deep well. Their sensory perception grew sluggish and distant, and they lost all control of their bodies. One woman began to beat her wings vigorously. She abruptly pulled out of the current and tucked her wings into a dive. As expected, two of the officers by the entrance responded immediately, leaping onto their jet bikes and giving chase.\nThe officers had not gone more than a few meters before the second woman shot forward. She landed lightly on the roof of the checkpoint and sprinted across it. As the two officers in the rear of the tunnel stirred to action, she leapt from the roof without slowing down, spread her wings, and soared off in another direction. With two women dispatched in opposite directions, six officers had been whittled down one.\nWhile the officer at the monitoring console wavered between assisting in the pursuit and sticking to his post, the third woman was already landing behind him, using the force of her descent to aim a kick at the console controls. The officer was quick enough to intercept her, but took a punishing blow to the chest.\nThe last woman darted to the side of the console and hit the power disconnect. The enormous tunnel began to lose its shape and crumple, dropping from the air like a kite. The people undergoing inspection screamed as they fled from both ends of the tunnel in panic. In their frantic haste to get away, they flapped their wings with everything they had. Yaya kept close behind them, hiding herself in their midst. After several minutes, the four women under her control stopped struggling against the police and returned to normal. By then, Yaya and the panicked crowd had flown more than a kilometer, swept past a fork in the airway, and scattered in all directions.\nBut news of the incident at the checkpoint had already spread, and soon, more police began to flood the vicinity. Fortunately, they were unsure which route Yaya had taken, and she had given herself a buffer of time. Without knowing her destination, the police were forced to split up.\nShe could see her target now. All that stood between Yaya and the tower was a single checkpoint.\nThe same trick would not work twice, however; she would have to go straight through.\nYaya climbed upward to an air current moving west at a higher altitude, giving herself more vertical space in which to accelerate. The signal generator on her wrist began to charge. Everything was ready.\nShe took a deep breath, then exhaled fully, contracting her lungs until her body could grow no smaller. The slightest reduction in wind resistance could shave milliseconds off her dive time—potentially, the difference between life and death.\nTen meters to the checkpoint. Five meters.\nShe tucked her wings and dived.\nMore than twenty officers guarded the entrance and exit to the tunnel. But after the stunt Yaya had pulled at the first checkpoint, they were reluctant to send too many officers in pursuit of her.\nFive officers flew after her. Only five to take care of.\nAt her current speed, it would take just over a minute to cover the last kilometer to her destination. But no human could match the speed of a jet bike, and within seconds the five officers had her tightly boxed in, barring the way ahead, above, below, left, and right.\nThe wind howled in Yaya’s ears. She had no intention of slowing down. Keeping her eyes locked on the tower, she crushed the signal generator in her palm. The signal pulse stored inside it exploded forth and flooded every frequency channel, its intensity flattening all other transmissions like a tsunami. Light brighter than the sun seared through the officers’ neural networks as several hundred decibels of sound inundated their sensory perception systems. Like sampans buffeted by a hurricane, the five officers spun out of control, and Yaya, a petrel in the storm, slipped through the opening in their ranks.\nShe seized an officer and threw him from his jet bike. The high-speed assault overturned the bike, and it rolled several times in midair before Yaya could stabilize it and restart the engine.\nWhen the explosive pulse went out, the officers still stationed at the checkpoint gathered that something had gone wrong. Another five-man team peeled away from the checkpoint, and the dozen or so who stayed behind opened fire on her.\nYaya hadn’t anticipated this. She had planned this route in advance, with the knowledge that a crowded airway behind her flight path would complicate the officers’ line of fire. Any stray bullets would hit innocent civilians on the thoroughfare ahead of her. It was this consideration that had emboldened her to rush the checkpoint.\nBut the police did not let up in the slightest. It was clear they had received an order to kill her, no matter the cost.\nYaya watched helplessly as several civilians were shot down in front of her, plummeting toward the ground. Panic swept the airway, and people scattered in all directions, like a lit firecracker. Reeling with shock, Yaya pulled her bike out of the dive. Her intent was to avoid more casualties, but the stream of civilians had fanned out, and several more people were hit as they fled upward.\nThe moment of deceleration allowed the officers behind her to catch up. They shot toward Yaya, sparing no thought for their fallen comrades, letting them cake the ground below.\nThere was no time to hesitate. Yaya pressed the jet bike as fast as it would go and plowed straight through the crowd. Evasive maneuvers would only lead to the deaths of more innocents, and it was too late for sympathy.\nThe unfinished tower was before her now. She did not slow down or look for an entrance. She would smash her way in.\nMeters before impact, Yaya slipped from the jet bike. It punched a large hole in the resin wall of the tower, and she dove through. Steel cables stretched endlessly out of sight above and below her—a massive elevator shaft. There was no time to search for the cab. Gripping a steel cable with her left hand, she used her right hand to split open the transmission cable. A half second later, the steel cable began to reel upward. By the time the police stormed into the shaft, the ceiling had closed once more.\n6\nDarkness, endless darkness.Yaya was sure that in time her eyes would adjust, so she could see where she was, but she was wrong. After the steel wall closed behind her, it shut out the last light from the city. There was no light here, only absolute darkness.\nThis was the true nature of the city: this box, hidden deep underground beneath thick layers of rock, was sunless, silent, and utterly dark. Yaya had no way of knowing whether her eyes were open or shut, as though the link between her optic nerve and her brain was broken.\nWhat was this place? Had Jianying been telling the truth? Was this a dark cage for rearing slaves?\nUnable to see, she could not tell how large the space was. She took two tentative steps forward, then stopped. Remembering the chain, she pulled it from her pocket. With a tug, it lit up.\nIt was not especially luminous, but in a place like this, even a glimmer of candlelight would do. Yaya held it aloft and looked about her.\nShe was stunned.\nShe had expected to see a low, oppressive space, with winding corridors and filthy walls. But in front of her lay another scene entirely.\nFirst there were steel girders, then more steel girders, and then more steel girders after that. The beams, half a meter thick, seemed to be the only things that existed here. They crossed and crisscrossed, extending outward like a spiderweb, stretching into the endless gloom. Each beam appeared to be thousands of meters long. Their full lengths exceeded the reach of the faint light, gradually swallowed up by the darkness.\nIn this vast, deserted expanse populated only by icy steel girders, Yaya stood motionless, a lonely firefly, dazed and helpless.\nThere were people here? What did they eat? Where did they live? How did they survive?\nThe spot where Yaya stood was not the floor. Rather, it was a small platform that led to the elevator shaft. The complex matrix of steel girders continued above and below it; nowhere was there enough flat space for people to live.\nAt first, she tried to fly, but she discovered almost immediately that there was not enough room between the intersecting beams to spread her wings.\nShe would have to rely on her own two feet. Without any sort of pathway, her only options were to carefully inch forward along the beams, or to climb. The beams were wide enough to walk on, but beneath her yawned a void in which she could not fly, making each step treacherous. Fortunately, her wings acted as a balancing pole, keeping her steady on her feet.\nThe chain pointed the way to her destination—the city’s main control room. But the farther Yaya walked, the more she felt something was amiss.\nWhat was the point of such a large space above an underground city? The city below was already crowded to capacity. Why not develop an unused, abandoned space of this size? If the city had to be compact and sturdy to ensure its structural stability, then why build such a large skeleton around it? No matter how strong, the steel structure would only grow soft when extended indefinitely like this.\nSuddenly she felt a weak tremor in the girder beneath her feet.\nDng, dng, dng.\nIn the silent darkness, Yaya was extra sensitive to noise and vibration.\nAs the tremors grew closer, a sound joined them. Her first instinct was to hide, but there was no way to dim the chain in her hand. She watched an apelike figure slowly approach until it was close enough that she could make out its appearance.\nIt was a man!\nNo, more precisely, it was an ape-man hybrid. He was hunched over and squinting, and he wasn’t wearing any clothing. His body closely resembled a human’s, but it lacked the characteristic wings.\nA naked ape, then.\nYaya was at a loss what to do. Perhaps she was capable of taking on the administrative program, of liberating the slaves imprisoned here, but she did not know how to deal with animals. In the entire underground city, the only living organisms besides humans were genetically engineered microorganisms. She had never seen an animal outside of a textbook.\nWould he attack her? What should she do? As she stood there, paralyzed with indecision, the naked man raised his arms to shield his eyes and opened his mouth.\n“Too bright. Are you from below? You headed to slumber street?”\nAfter a moment of hesitation, Yaya realized he was speaking Chinese.\n“You can talk!”\n“Nonsense, of course I can talk!” He shaded his eyes. “Get that light away from me.”\nYaya hid the chain behind her back.\n“You . . . you’re . . . ”\n“You’re from below. I live up top. I’ve seen your kind before. Always with the light. Hurts my eyes.”\n“Are you human?” She paused. “Are you a slave here? What’s your name?”\nHe didn’t say anything, but suddenly straightened and jumped up. His movements were extremely nimble. Catching hold of the girder above him, he swung himself up and over.\n“Name? What’s that? What’s a slave?”\nBefore Yaya had time to explain, a loud boom split the air. Abruptly the entire steel crossbeam began to shudder violently, as though an enormous moth had flown into the web of beams, fluttering wildly.\nYaya, who’d been standing, was nearly thrown from the beam. She clutched the nearest upright to steady herself, and in an urgent voice asked, “What’s happening?”\nThe man’s face darkened, giving him a very human expression. “The Hammer is coming.”\nJust as Yaya opened her mouth to ask what he meant, she heard him exclaim, “Don’t move. Be quiet!”\nAs the tremors grew more powerful, the sound grew louder. Yaya hid the chain in her shirt, but light still showed faintly through the cloth.\nA huge machine, crawling along the beams like a lizard, was bounding toward them. It looked like a diamond with claws, three to five meters long, and it moved with the agility of a monkey in the jungle. Though Yaya didn’t know what it was, its dreadful, heavy leaps and the shocks it generated upon landing warned her not to move a muscle.\nClose behind her, the nameless man whispered, “Don’t breathe. It will hear you.”\nImmediately Yaya held her breath, but it was already too late. The machine swiveled in their direction and landed in front of her with a tremendous crash. Its square frame was spattered with black congealed bloodstains—cold, and odorless.\nIts flat front face slowly elongated and unfolded. Yaya suddenly understood where the Hammer got its name. She was face-to-face with multiple sets of claws, needles, blades, and, most conspicuously, a pair of mauls, each a half-meter in diameter.\nYaya’s heart sank. She could feel the man behind her shaking like a leaf.\nThe Hammer stepped forward with a shuddering boom. The mauls were inches from her face. Abruptly the man let out a shriek and shoved Yaya forward. With a powerful leap, he sprang to another girder and ran.\nYaya feared she was done for. But at that moment she heard a click from the Hammer, and then it sailed through the air, clearing five meters in a single bound. The man had not gone two steps before the Hammer was upon him. There was a sickening crunch, and he collapsed in a bloody heap.\nWith that, the Hammer stopped. Its body spun several full circles, then fell motionless. Yaya was too scared to move.\nThen the Hammer rotated on its chassis and dropped from the beam. It leapt back and forth a few times and then disappeared completely. The silence and darkness resettled, a puddle of blood the only evidence that the man or the Hammer had ever been there. Yaya began to tremble uncontrollably.\nIn this dark hell, there was no freedom, no light, no clean food or water, and humans didn’t even have wings. There was only slavery and death.\nYaya raised her head and gazed upward. The city’s main control room was at the very top, a four-hour climb away.\n7\nYaya was not gifted with especially good physical stamina. Climbing upward required far more exertion than walking on a flat surface. In the lattice of steel girders, her wings became a hindrance. Most of the time she had to keep them tucked close to her sides.\nAlong the way she glimpsed people here and there, but none of them dared approach her. She watched the wingless humans lick condensation off the cold steel girders to slake their thirst, and observed the curiosity and alarm elicited by the light in her hand. Compared to the man who had fallen victim to the Hammer, these people were simpleminded beasts.\nShe could not say how far she climbed before she was panting and out of breath. She began to encounter people more often. They were not as curious as those below, nor as fearful. They were slow and lethargic, and did not react to the light in her hand, like blocks of wood.\nAfter some time, Yaya spied a sizeable platform overhead.\nIn a world where girders barely passed for roads, discovering a platform of more than a thousand square meters was like stumbling upon an oasis in the desert. Filled with excitement, Yaya swiftly scaled three girders to reach the platform.\nThat was when she saw the people, hundreds upon thousands of people, lying on the floor.\nBodies lay jumbled together on every square meter of the steel platform. Like the others Yaya had seen, they were sallow and emaciated, and naked regardless of sex. Curled atop the platform, they gave off the only warm, humid smell in a cold, dark, yet dry world.\nAt first, Yaya thought they were dead. But after a moment, she noticed the slow rise and fall of their chests. Their chests, like the rest of their bodies, had withered away to just skin and bone. As she looked at the women’s protruding ribs, with their atrophied breasts, Yaya found she could not tear her eyes away.\nThe platform was so crowded that there was no place to step, and Yaya saw some people lying stacked on top of each other. The entire huddle was fast asleep, silent and unmoving.\nIs this the rumored lot where slaves were bred and raised?\nTen thousand people sleeping quietly together, breathing deeply in and out, produced a sound like the rhythmic beating of a drum. Ten thousand corpses could not have conjured the same feeling. The sleepers were alive, but they looked dead, the very image of a portal to hell.\nSleep-inducing fumes pervaded the atmosphere. The air that hung over the platform, continually recycled through the sleepers’ lungs, was heavy with carbon dioxide and water vapor, as potent as sleeping gas. Here in the darkness, it would be all too easy to fall asleep. Some of the sleepers had only drifted off, while others seemed to have closed their eyes in eternal slumber. The scene had the same effect as a hypnotic pendulum. Yaya listened to the soft, slow sound of breathing on the platform. Each breath was like a wave, rippling outward from its source, replicated by the next sleeper, a sigh passing from one mouth to another. The steady sound seemed to resonate, echoing across the thousand-meter space. Together, the sound and the air formed a dense soporific, a signal that congested her senses, beckoning her to sleep.\nAccording to the chain’s instructions, Yaya had to cross this square. She composed herself, then walked forward.\nThere was barely any room to move. Yaya tried her best to step between the sleepers, but they were so tightly packed on the floor that she could scarcely put her feet down. She kept treading on naked bodies. Yet even when stepped on, they merely squirmed out of the way, and did not wake or react in any other way. They did not even groan, making no sound at all except that of deep breathing.\nSeveral sleepers rolled over, their heads sticking out of the pile of bodies. By the chain’s faint light, Yaya could make out their eyes. They were closed, but beneath their lids, their eyeballs rolled rapidly. She then directed her attention to their mouths. Between their lips they held tubes that sprouted from the floor.\nYaya carefully extracted one of these tubes, letting a few drops of liquid dribble out. She dabbed a little on her finger and sniffed it. Its cloying saccharine scent marked it as nutrient solution with a high sugar content. They lived on this?\nYaya flipped other sleepers over to find that each one was the same, nursing a tube, eyeballs whirling in their sockets.\nWere they dreaming? Eyes only moved like that during deep sleep, when the dreaming brain was operating at high speed. Ordinary people only entered REM sleep for one or two hours every night. But could it be that these sleepers were always dreaming?\nYaya spent too long bent double over the bodies. Breathing the same air over and over again, the sleepers had produced a large quantity of carbon dioxide that had built up along the floor, and soon she felt her head begin to swim.\nShe could not linger here. Her thoughts were beginning to grow sluggish. She hastily stood up straight. She felt dizzy. The rhythmic breathing seemed to swell, like the pendulum of a clock beating in her heart. Yaya could only hold on to a single thought—get out.\nShe no longer cared who she stepped on. She staggered forward, bonelessly, stumbling over bodies as she went. In her dim memory of the event, she would recall seeing people with wings lying at the far edge of the platform.\nSave them, thought Yaya. In her anesthetized state, she felt no more fear as she raced along the narrow girders.\n8\nA house?\nYaya stood there for a moment, perplexed.\nTruthfully, she didn’t know what she had expected to see at her destination. But . . . a house? In this place?\nThe house was lit from within, and faint light shone beneath the closed door. Before she could overthink it, she stepped forward and pushed the door open.\nIt was too bright. Having spent so long exploring the darkness, it was difficult to adjust her eyes. After a while, her eyes gradually adapted to the light. The room, which was lined with velvet drapes and plush gray carpet, measured perhaps two hundred square meters, and contained none of the computer equipment Yaya had expected. The only real feature of note was a huge leather sofa in the corner, on which a man in a long hooded robe was seated. The sofa was so overstuffed that he was nearly buried inside it.\nThe man did not react until long after Yaya entered, as though he’d just woken from sleep. He straightened and raised his head, but his face remained hidden in the shadow of his hood.\n“Hello, and welcome.”\nWarily, Yaya replied, “Hello.”\n“I know why you have come,” the man said plainly. “You have come to put an end to me.”\nYaya was stunned.\nThe man shook his head, tossing his hood back. Beneath it was a hairless, skinless skull. Yaya’s initial surprise gave way quickly to understanding.\n“You’re the program that controls the city!”\nWithout muscles, the skeleton was incapable of facial expressions, but it could nod.\n“To be exact, I am an anthropomorphic shell controlled by the city’s administrative program.”\nOnly a shell, but no matter—she could connect to the program’s underlying core through its shell. Yaya stealthily pinched the chain in her hand, unlocking the virus. Now to find an opportunity to inject it.\nShe carefully observed the shell. On its exposed cervical vertebra, she noticed a cable.\nWithout hesitation, Yaya lunged forward, seized the skull with her right hand, and deftly yanked it forward. With her left hand, she jabbed the chain at its neck, embedding it in the cable.\nThe body did not resist or struggle; it even seemed to bow its head obediently to let Yaya carry out her attack with ease. Yaya held the skull in a steely grip, waiting dispassionately for the virus to finish importing before letting go.\nThe skeleton raised its head. “Right, are you finished? Now will you listen to me?”\nYaya waited for the virus to take effect. Several minutes passed, and still nothing happened.\n“Still not convinced? I can continue to let you wait, or I can tell you the end result. There will be no result. It isn’t a virus.”\nA doubtful expression crossed Yaya’s face.\n“Let me explain. That is a monitoring program. It has recorded your every move since you obtained it. And judging from its log, you’ve performed admirably.”\n“You . . . what does that mean?”\n“It’s a long story.” The skeleton’s lower jaw clattered as it laughed. “And it is time to tell it to you. We don’t want to waste any more time. Come, tell me, where are we?”\nYaya replied guardedly, “We’re . . . above the underground city.”\n“And where is this underground city?”\n“Ten kilometers underground, somewhere beneath the East China Plain on the continent of Asia.”\nThe skeleton laughed again. “Right, well, take a look above us.”\nAs he spoke, the ceiling opened up, the steel plate overhead giving way to a transparent glass panel. But what lay beyond it was not the darkness Yaya expected.\nShe found herself looking at a thick brown soup, semi-opaque and suffused with a faint glow. Moving tendrils of light snaked across the window’s exterior, streaks of brilliance against the glass that left long light trails behind them, like spirits flitting through the night sky.\nYaya had never seen anything like it. She was hypnotized by the sight.\n“We aren’t underground!” she cried. “Where are we?”\n“Currently, this city is more than seven hundred million kilometers from Earth, on a vast planet much farther from the Sun. We are now in the atmosphere of Jupiter.”\nA radiant arc of light flashed across the window, staining the room with red. Outside, Yaya could discern a tiny, dim disk of light—the Sun. According to her school textbooks, nuclear winter had caused a sharp drop in Earth’s surface temperature, forcing humanity to hide underground. But the Sun before her now, even with nothing blocking its rays, would never provide enough light or heat.\n“We’re on Jupiter?”\n“Yes,” said the skeleton. “More precisely, we are sailing through Jupiter’s atmosphere. Jupiter has no solid surface, so the city travels through a transition layer of semiliquid helium and nitrogen.”\n“What . . . what about Earth?”\nThe wall beside Yaya lit up and became a screen. It showed a dark expanse of outer space. A large cloud of rock and debris hovered in the darkness. At either end of the cloud was a core, one bluish, the other dark red.\n“This is all that is left of Earth and Mars. They are now in close proximity, but they remain in Earth’s original orbit. I never could decide what to call it. Tell me, how does ‘Marth’ strike you?”\n“What happened?”\n“That I do not know. But more than a century ago, human civilization expended an astronomical amount of resources to build a secret city here, many hundreds of millions of kilometers from Earth. Similar bases were established on Mars, the Moon, and Saturn. The aim was to leave backup populations in the event that human civilization on Earth was destroyed. This proves that, at the time, they were aware they faced some sort of threat, but its exact nature is still unclear to me. I suspect, of course, that the bases on the Moon and Mars are no more. I know nothing of the situation on Saturn. We are forbidden to communicate with other bases, lest we be discovered and eliminated in one fell swoop.”\n“What sort of threat could be so terrifying?”\n“I don’t know, nor do I wish to know. Judging by the current state of Mars and Earth, the fewer questions we ask, the better.”\n“So we’re not on Earth, but in Jupiter’s atmosphere. There’s no soil anywhere around us, because we’re floating in midair?”\n“Correct,” replied the skeleton. “You’ve accepted this quickly. That will earn you extra points on your examination.”\n“And we might be the last survivors of the human race?”\n“If luck is not on our side.”\n“Then why trick us all this time? Why feed us a lie about living beneath Earth’s surface?”\nThe skeleton’s face remained impassive as he answered. “I suppose it’s because after the city’s first inhabitants learned Earth had been destroyed, more than half of them killed themselves.”\n9\n“So what you do is—”\n“What I do is deceive. I let those of you in the main city believe you live within the Earth—that when nuclear winter passes, you will be able to return to the surface. Naturally, if you were familiar with the true environmental conditions on Earth, you would not be so easily mislead. Gravity is greater on Earth than it is here. Winged humans, no matter how strong, would never be able to fly on Earth.”\n“And you imprison some people in this dark superstructure, enslave them—”\n“No, not at all.” The skeleton shook his head. “That was not my doing. It was already so when I came into being. It was a decision made while engineers on Earth were still designing the city. Enslave them? Just what do you think those humans are?\n“Well . . . slaves.”\n“Slaves?” The skeleton attempted to grin. “You are more subjugated, more susceptible to manipulation than they are. You may eat better, dress better, but the value of your existence is as a blueprint, an active record of human society in its normal form. This way, when the time comes to rebuild civilization, I will have something to reference. But they . . . do you know what they are?”\nYaya kept silent.\n“They, they are far more important than any of you. They are my core. Those humans dreaming on the deep sleep platform are me.”\nYaya gave a blank look.\n“You’re a hacker. Do you know about cloud computing? Multiple computing resources, sharing a computational workload, combine to form a super-processor. The sleepers are my computing units. Their computational output is the program’s consciousness—that is, me. When Earth engineers designed a program powerful enough to control the city, they realized that it would exceed the capabilities of their most advanced computers. Therefore, they chose a biological material available to them: the human brain. You thought you had come to save them? Their bondage is self-imposed. The very people you wish to save control this world. Ironic, isn’t it?”\n“But they’ll die . . . ”\n“And others will take their place. Some are offspring produced by sexual reproduction, yes, but most are clones selected from a gene bank.”\n“So you choose who is fit to live below and who is fit to live above.”\n“And who may leave this place.”\n“Leave?”\n“Of course. What is the purpose of this city? To preserve the spark of human civilization, to rebuild. No one knows what happened to Earth, but the warning I received said, ‘Do not return to Earth, and do not attract Earth’s attention.’ If we are to rebuild, we must travel farther afield, to a distant galaxy, to a distant planet. I build ships, select crews, and launch them from the solar system, voyaging forth to reestablish human civilization.”\n“So you’re responsible for assigning roles—those above, those below, and those who leave.”\n“Correct. What of it?”\n“Who gave you that right?”\nThe skeleton was stunned for a second.\n“No, no, do not try that line with me. Do not trot out humanism or egalitarianism, and do not speak to me of universal values. I’ve heard it too many times. Who gave me the right? Let me tell you: humanity gave me the right. That is the answer.”\n“Freedom, equality, democracy. These are good words,” the skeleton continued, “when resources are abundant and the future is bright. But when a species faces extinction, they become jokes. Did you know that when antelope leap over a crevasse, they use the old and weak members of the herd as springboards? They have no choice. They must do so or perish. Who gives antelope the right to choose who becomes a springboard and who then treads upon them? The objective of survival gives antelope this right. To that end, all veils of sentimentality are laughable. Freedom? Equality? Yes, if I did not have the right to decide a person’s life, whether it be humble or lofty, would that not give those who oppose me the right to decide the fate of humanity as a species? May I ask you a question?”\nYaya said nothing.\n“Suppose there are two identical modern civilizations. They know that in fifty years’ time there will be a terrible calamity. One civilization sacrifices the vast majority of its people, enslaves them, and entrusts all of its resources to the top scientists, technicians, and leaders that comprise less than one-ten thousandth of the population. They give up everything for a chance at survival. The other civilization holds fast to its shared morality, to personal liberty and equality. Its scientists and technicians are not given control of any additional resources. Which civilization, do you think, can save its own species?”\nIn a low voice Yaya answered, “The first one.”\nThe skeleton nodded. “Human civilization on Earth made the same choice. Before the arrival of the threat, humanity had just reached Mars. But after the threat was detected, within fifty years they had channeled Earth’s entire capacity into creating this base. It is a spark of humanity, perhaps the only spark. No matter the cost in lives or material, I must do everything I can to keep this spark alive. This is the mission given to me by humanity. I have no morals, I do not respect life, and I don’t consider the feelings of the individuals whose lives I control. I consider only whether an action will improve humanity’s chance of survival or reduce it.”\nYaya simply gazed at the sky overhead.\n“There is no one else besides us?”\n“I don’t know,” replied the skeleton. “I don’t know whether the Saturn base is still there, or whether there are other bases that I’m unaware of. We can never contact each other. We are alone, and we must think of ourselves as the only extant humans in the entire universe. Even the threat is unknown to me. All I know is that we are unsafe in this dark universe. There is something here, lying in wait to devour us.”\nYaya’s face was despondent. One day ago, she’d been an ordinary office worker living in an underground city. One hour ago, she’d been a freedom fighter bent on liberating slaves from darkness. But now, she stood alongside the overseer of the last city humans might ever build, tasting loneliness and fear in the face of the cosmos.\n“Then why am I here?”\n“Simple. This is a test. As I said before, the group of people in the main city serves as a model human society, and the group above the city comprises my consciousness. I control all of that. But there is also the third group. I am constantly manufacturing and launching interstellar voyagers. Since I cannot possibly control what happens on those voyages, I need individuals with sufficient judgment and strong executive function skills to serve as captains. That is the reason you are here.”\n“So everything that happened was part of a test? Jianying, the officers who died, the innocent bystanders who were shot—they were the price that had to be paid to conduct this test.”\n“Yes.” The skeleton nodded. “The purpose of destroying those innocents was to conduct a single test, in the hope of identifying a candidate for the captaincy.”\nYaya pictured them. Some had been familiar to her, some she had only glimpsed their faces, and some she hadn’t even known their gender. They had died for a cause wholly unconnected to them, one they would never truly comprehend.\n“I’m surprised by your frankness,” said Yaya. “You hope I will serve as a captain, but you couldn’t predict that would make me angry and uncooperative?”\n“I knew it would,” replied the skeleton, “but I must be transparent with you. I am searching for a suitable person to serve as captain. Whether that person is you, I don’t know. That person must be able to acknowledge all of this, must recognize that certain goals demand certain sacrifices. Only then do these interstellar voyages stand a chance of success.\n“To date, I have launched twenty-six voyagers. Do you know the earthquakes that hit the city? How can there be earthquakes if the city is flying? They are simply the shock waves created when the ships are tested, launched, or docked. When a voyager departs the city, it becomes a solitary entity. We don’t know what the threat is, or where it is, so external communication is prohibited. It cannot make contact with me or the other ships. Even now, I don’t know where the voyagers are, or if they still live.\n“Every voyage is a maiden voyage. The crew can have no experience, and there are no previous expeditions to reference. If a black hole waits in Pluto’s orbit, swallowing each ship as it passes, then they will perish together like fools. No one will warn them what dangers lie ahead. No one can tell them, ‘Stay away! Find a different route.’ There can be no data, no information, no transmissions. The voyagers are not numbered, because each one is the only one. Every captain must stand firm, must be harsh and uncompromising. Is it cruel of me to kill those who escape the deep sleep platform? Yes. But the captain must be crueler still. If killing half the crew for food will extend the voyage another month, then she must give the order without hesitation.”\nThe skeleton gazed at Li Yaya. “That is all I have to say, child. The decision is yours. If you choose to serve as my captain, there may be a place for you on a voyager. If you are unwilling, there is a place for you on the platform. This is the reality of our lives, the reality of humanity’s last city. Now choose.”\nOriginally published in Chinese in Science Fiction World, 2009.\nTranslated and published in partnership with Storycom.\nQi Yue is a highly popular science fiction and fantasy writer from Sichuan, China. He graduated from Nanjing University with a degree in biology and currently works in the gaming industry. Representative works include the fantasy novels Fumingshi and The Mechanic's Log. He has also written a series of novels set within the Heroes of Might and Magic and World of Warcraft universes, as well as a wide variety of science fiction novels.\nElizabeth Hanlon is a Boston-based translator of Chinese fiction. She is a graduate of Tulane University and studied Chinese at the Inter-University Program for Chinese Language Studies at Tsinghua University. Her published translations include Of Ants and Dinosaurs, a novella by Hugo-Award-winning sci-fi author Cixin Liu; Beijing Graffiti, a non-fiction work on Beijing’s graffiti culture, and several short stories.", "source": "https://clarkesworldmagazine.com/qi_07_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Fly Like a Fallen Angel by Qi Yue, translated by Elizabeth Hanlon"}