{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert Reed", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5z8ZDrDDWC4UxU75jbZfVcu7zFQ=", "id": null, "license": null, "comments": "", "raw_text": "5330 words, short story  The Significance of Significance  Sarah wasn’t quite two when the world learned what was what.  Which is rather like saying that Sarah still didn’t exist.  The very young don’t get to keep their memories. That’s normal human development in action, or it’s a nagging bug inside an otherwise lovely system. Either way, she didn’t waste time regretting this supposed loss. Sure, a booger-clogged head was wearing her name, stumbling across a misunderstood landscape. But that head wasn’t her head, and this Sarah inhabits a beautiful, artificial universe. This world only pretends to be made from protons and people, and being one of the first to grow up knowing that, she has no trouble seeing the blessing for what it is, and that’s why she appreciates each day as wonderful, and it’s sad to see so many others who don’t understand the Significance.  Sarah’s parents. They’ll never accept the truth, which is why spending time with them is so frustrating. She tries to be patient. She really does. But Mom and Dad have pinned themselves to the worst kind of template. What they believed back on Day Zero is what they believe today, and while it’s tempting to feel sorry for those who don’t understand, sorrow is a negative emotion. Negative emotions will always turn into a godawful waste of time, and time feels precious. This lovely existence could evaporate tomorrow, but for as long as Sarah remains real, she intends to harvest as much joy as possible.  At least one old man appreciates the world. Mom’s father, Grandpa Lemon, is a different animal. Almost eighty, a fantasy definitely close to its natural end, yet the man still smiles and laughs way more than most people. Maybe he doesn’t have the strongest grasp on the science, but he also doesn’t get angry about what young people know for certain.  “The significance of Significance,” he says.  Sarah laughs at that phrase.  Grandpa waves a hand as if shooing away flies. “Want to hear some wild stories explaining why we’re here?”  She says, “Sure.”  “For most of my life, the universe was one enormous, beautiful explosion of Nothingness. And before that? The Earth and its little people were carved from clay by some tall white dude straddling the clouds. But today, for this minute or two, we’re calling ourselves a slick dream living inside an invisible machine.”  Except the machine is visible. That’s a point worth making, and Sarah always makes her points.  “I understand all that,” he claims. “Hey, I actually watched the first press conference. All those people who got to share the Nobel, crazy happy with the attention. And I’ll boast about something else. I’ve read everything that I can find. Unlike a lot of people, including your dear mother. So yeah, I can appreciate what you believe. The universe is a very big box filled with important mathematics. Not that I understand the details, or that you do either. But the evidence is compelling. Reality is full of cheats and simplifications, and quantum mechanics is a game, and the spaces between electrons and between the picoseconds are full of game tricks. And best of all, astronomers looked at the sky and saw the cosmic scaffolding. Which feels like a joke, if you think about it. Do you get my joke, honey?”  Sarah doesn’t like being called “honey.” But names are just clumps of silly sound, and why sweat one word? In Grandpa Lemon’s mind, the famous news conference occurred in 2025, and today happens to be May 8, 2043. But Sarah’s generation doesn’t keep the same calendar. This is 6404. That’s the number of days since the Significance was revealed. Units of time are arbitrary and inadequate, but people who live inside the long years tend to forget too much. Which is a waste. Existence is already arbitrary and frail. You need to notice everything, and counting every day helps. You never know when the complicated math is going to collapse. Whoever built this universe has that kind of power. It’s just like the two-year-old’s brain: The world can cease and thoughts can vanish and nobody would know. Which is one very good reason to smile politely when her grandfather tells cosmic jokes.  “God is a comedian,” Sarah says. “An old guy like you standing on the scaffolding, laughing down at us.”  “Laughing hard,” he adds.  Both of them are doing just that. Sarah inherited Grandpa Lemon’s deep chuckle. That’s what Mom claims, and that isn’t a bad thing to hear. How many times have Sarah and her grandfather been together like this, the two of them sharing this kind of pleasure? It’s easy enough to ask. Sarah wears cameras and microphones, and like many in her generation, she feeds every moment into an encrypted cloud locker.  But she doesn’t ask. Grandpa suddenly falls quiet, and after a long, sorry sigh, he says, “About your mother.”  All right. Here it is.  “I’m not telling you that your folks are worried. You know as much. Or that my daughter doesn’t like your choices, since that’s the most obvious thing in the world right now. No, I just want to hear the story from you. Your reasons for doing this. At your age, when you should be making ready for the rest of your life—”  That’s when she interrupts him. A sound that isn’t laughter bursts free, and they’re both surprised by the harshness of it, the rude and dismissive noise before the single word, “Shit.”  Grandpa stops talking.  Sarah regrets nothing. Regret weighs you down, shortening the good in your brief existence. That’s what she believes and expects from herself. Except no, now she finds herself feeling bad about what she just did, and she can’t shake the stupid emotion.  Grandpa Lemon repeats just one word.  “Reasons,” he says.  The question doesn’t have to be made any clearer. Sarah’s right hand touches her belly and the bulge. The baby will kick if she waits, because this is a busy eager happy sack of potential that won’t hold memories for another eight hundred days.  “Because,” she says. “I want a baby before we vanish.”  “We aren’t going to vanish, honey,” he says.  Again, that unwelcome word.  “But we can go away,” she insists, wanting to sound reasonable but all kinds of pain revealing themselves. Then after a pause and several useless breaths, she adds, “I want a child who loves life as much as I do. And I want to enjoy him before this show is finished.”  “But if it goes away . . . then it’s as if it never was . . . ”  How can anyone say that, or even think it?  One last time, he says, “Honey.”  Anger takes her, making her feel vulnerable. “Every game ends,” she tells him. “But somebody is playing us, Grandpa. Somebody who sees us and knows us. Who knows me, and who’s going to know my son, and as long as we stay happy and interesting, we’ll be worth watching. So you see? That’s the significance of the Significance.”  A baby is coming. Reality has one shape or an entirely different shape, but Sarah is definitely pregnant and her parents don’t even know the father. Some people would accept this situation. After all, their daughter is a bright, well-educated, voting-age adult. Except Sarah is also impulsive and stubborn. If she wants a baby, that’s what will happen. Telling her that she cannot or should not are the worst possible strategies. No, it’s much easier to attack the entire universe. Taking positions of deep ignorance, the two of them throw doubting words at a child who graduated from school only because she was smart enough to achieve that goal without hard work. The girl who chases loud parties and odd boys in her endless quest for fun. Her parents have learned not to openly doubt Sarah’s good sense, but they can sure complain about the science. Reality is not a piece of software, and existence isn’t some godly creature’s elaborate, fickle hobby. That’s the only way that these two shy people can stand tall and sound stubborn, relying on other people to tell Sarah what she needs to hear.  But the Lemon gambit has been soundly defeated.  “Don’t ever put my grandfather up to shit like that,” Sarah warns them. “I like the old boy. And I didn’t want to have to yell at him.”  Sarah did yell. A full report from the battlefield arrived half an hour before their daughter.  “We were trying to help,” one of them says.  It doesn’t matter which one of them speaks. Married as long as they have been, the voice is shared, just like the uncomfortable air inside their old home.  “These are such difficult times,” says the other one.  “And a baby . . . ”  “Is a lot.”  “Too much.”  “When the world is so frantic.”  “So crazy.”  “Everything unsettled.”  “Changing.”  “Nothing but change,” the shared voice says, and then pauses.  Sarah is not one of those pretty pregnant girls. She doesn’t sleep enough or eat right, and maybe she’s doing worse things to herself and the child. Who knows? Well, she knows. This self-indulgent life needs to be recorded, and that’s why she wears multiple cameras, every mechanical eye staring at these two people who are being awful, and on a day when she so much wanted to have fun.  “Nobody believes what you believe,” says Sarah. “That’s why the churches are standing empty.”  Which is an odd observation, for multiple reasons.  “I know what bothers you,” the girl declares. “God isn’t magic floating in the clouds. Science built the universe, and you hate it because we know everything that we need to know already.”  One of them asks, “Why talk about God?”  “We’ve never been religious sorts,” says the other.  But the first has to point out, “And a lot of people still go to church. People who happen to be your age, in fact.”  Sarah laughs at some part of this. She doesn’t sound like her grandfather today. This is a stranger’s laugh, half growl and full of bile.  Then one parent tells her, “You need to listen to somebody, honey . . . ”  Which is when Sarah begins to scream. At no time in her brief busy life has their daughter unleashed such anger or used this abusive language. “Do you fucking know how much I fucking hate being called ‘honey?’”  They will never use that endearment again. But in the spirit of the moment, with emotions heating up air and blood, this is the perfect opportunity to be honest, honest, honest.  “You’ve always done what you want,” they tell her.  “You do it fiercely and without doubts, right up until you decide that you don’t want to do it anymore.  “This isn’t about the nature of the universe,” they tell her.  “It doesn’t matter if this world is a game or Eden or just one rock among trillions.  “What matters is you.  “You’re a certain kind of person and always will be.  “That’s why we’re afraid.  “Both of us are.  “You’re going to get tired of this game, which you always do.  “And then you’ll leave that poor child with us.”  There it is. A terrible truth to admit, particularly to yourself. But they say what needs to be said, and they even manage to stand their ground afterwards, enduring more vicious language and so much fury. But what they don’t expect is the sudden epiphany: In the midst of that onslaught, the suffering parents find themselves wishing that Sarah is right. The universe is indeed someone’s chess board. Because they want the pieces picked and put away, and then all of this terrible pain can dissolve into the vacuum . . . forgotten . . .  Being the center of attention should be the best feeling in the world. But Tomjack keeps learning that he can’t trust every pleasure. Happiness finds too many ways to get him into trouble.  Like with Sarah.  Three leaps into bed, and each time, nothing felt so good. The sex was part of the fun, sure. But mostly it was the way the girl looked at him, particularly before and then after. Tomjack was the only other person in the world. That’s what her smile was saying. Way too big for one soul, her joy was running hot through him too. If he hadn’t been there to eat her emotions, Sarah would have exploded. That’s what he was thinking at the time. Which was an odd idea, and the odd thoughts didn’t stop coming afterwards.  Every little action felt special when they were together. Usually squeamish about cameras, Tomjack didn’t balk about her cameras or throwing everything up to the Cloud. The last time together was that long wonderful afternoon in bed, and that’s when Sarah did the unthinkable. She told her lover that the world could end right now. “Because I’ll never be happier than I am right now,” she said. Sounding hushed and amazed, as if making a confession.  Normal people didn’t use those words. Normal thought didn’t expect the universe to dissolve in the next breath. But Sarah didn’t just accept the Significance, she believed everything that it told her. For her, life wore a capital L, and when something happened that wasn’t as perfect or fun or as surprising as Sarah deserved, then the day could turn very, very ugly.  But not that day. His lover was crying for every good reason, talking about her happiness and hopes. It was so nice. So perfect. The best hours of Tomjack’s life, and that’s why he risked breaking the biggest Sarah-rule. Watching her getting dressed, getting ready to leave, he asked when they’d see each other again. Sarah didn’t believe in “Forcing the future.” That’s what she called normal human planning. But the boy felt brave enough to try the question, and his lover was too giddy to risk chastising him or the temporary universe. She winked, sort of. Then she said, “Next week.”  “What day?” he pressed.  She hesitated, but not for long. “Thursday,” she told him. Then she mentioned a time when she might or might not arrive at his front door.  Of course Tomjack shaped his entire week around that interlude. And when Sarah didn’t show, he has some ready-built explanations that he could live with. The girl lost track of time, or a party left her too sick, or maybe her grandfather died. Except none of those excuses happened to be true. Sarah didn’t show or answer his texts, and she had never offered him a home address. That’s when tragedy became appealing. There must have been an accident. He imagined her tumbling down a flight of stairs. By Friday, those stairs became numerous and sharp, and by next week, after repeated attempts to contact the girl, Tomjack was convinced that she was dead and he was glad that he missed her funeral. Which was a selfish, stupid way to think. But the boy was barely eighteen, which happened to be the perfect age to let a willful, self-indulgent beauty take hold of your soul.  A full month passed before Sarah showed up again. By then, Tomjack felt older and a little wiser. The girl made apologetic sounds that didn’t excuse anything but the silly, temporary universe. She told him to forgive her, and maybe he did. Two minutes later, he wasn’t sure what he had said. By then, Sarah was boasting about new boyfriends. Three of them, usually two at a time, and Tomjack wasn’t that kind of beast. He wasn’t at all like her. Standing in the open door, she practically ordered him to have a good life, and that’s when the jilted lover found the maturity to say a few honest words.  “You’re a scary bitch,” he said.  “You’re just figuring that out?” she asked, laughing at silly him.  And for six years, they didn’t talk.  Yes. “Years.”  A lot of people are busy counting the days. But not Tomjack. Adults are free to believe what they want about the universe, regardless of their age. And for Tomjack, the Significance is just a miserable distraction. The picture of everything being unreal . . . well, that will never have stopped making him sick inside. It’s not that he isn’t smart enough to understand the crazy science. The Significance makes as much sense as gravity or electrons, which are pretty magical in their own right. But six more years of life have taught him that his opinions don’t matter all that much. Not to other people or to anything else, including the universe. For the last three years, Tomjack has been married, and his life is happy. But he knows not to feel too happy, since joy is temporary and everything is guaranteed to change, and change likes nothing better than to arrive without warning.  A theory proved when Sarah arrives unannounced at his front door.  On a Thursday afternoon, as it happens. So maybe she wasn’t lying. Maybe this is what she meant with that long ago promise.  A boy stands behind her, tugging against her hand, and he might well be five years old.  Tomjack says, “Shit.”  “Watch your language,” Sarah reprimands. Except then she gives this big scary laugh. The woman looks brittle and about to break, and Tomjack feels cold for the both of them. For the three of them.  “Is this him?” the boy asks.  Sarah keeps up the weird giggling. Cameras are riding her face and hands and knees, and a flock of gnat-sized eyes float in the air, sucking in existence. Her endless pleasure is being enforced. Chemicals can do this, and electrodes implanted deep inside the giddy brain. Methods don’t matter as much as results, and he sees this more and more every year. Good sane people want to relish their lives, and they’ll do anything to feel as if they are the center of the cosmic happiness.  The thing is, Sarah is neither good or sane.  “Is this him?” Tomjack’s son wants to know.  She answers by not answering. Teeth showing, she stares at her ex-lover, and something needs a hard moan that steals away her breath. Then she tells him, “This is fair. More than fair.”  “What are you saying?”  “I’ve had 2000 days with him. That’s enough.”  Is she really talking about their son?  “You get him now,” she says.  “It is him,” the boy decides.  Tomjack looks at a face that he helped build.  “My name is Honey,” the kid says,  Tomjack looks at Sarah. “Seriously?”  “It’s just a sound,” she explains.  Again, he looks at the boy, nothing to guide him but a quarter century of life, coupled with empathy as well as a lot of deep, sucking fear.  “You’ll take him,” she says.  Tomjack doesn’t answer.  “Because my folks won’t,” she continues.  Which is a great joke. The crazy woman has to bend over, laughing until she’s out of breath.  “Useless old people,” Sarah says.  With both hands, Tomjack yanks the boy free of his mother.  “Anyway,” she says. “You’ll need to go through the legal shit. I won’t fight you. And for help, I can give you . . . ”  He listens to her deep, frantic breathing.  “Recordings of everything,” she promises. “When we made him and everything that’s happened since. Including his first two years, which were pretty damned interesting.”  Inside his head, Tomjack is explaining this mess to his away-from-home wife.  Out loud, all he can say, “Okay then.”  “Well, good,” says the madwoman.  Honey, the boy, seems like the kind of kid who’s always fearful. He’s probably sad and cries himself to sleep. Which really, at the end of this, is the very best evidence that they might make this work. That’s what Tomjack is thinking just now. Start with despair and desperation, and after that, everything an incompetent father does will seem like a godsend.  The scientist on the squidskin belonged to the original project. That salient fact needs to be mentioned, along with naming team members instrumental in work done decades ago. But those people aren’t here today. This is a different project, and after thanking the dead and the retired, she begins the official news conference.  “The universe is a fabrication of mathematics and high-end simulation,” she says. And with that, the Nobel laureate pauses, one finger dragging text across the podium.  Deja vu hits Harold Lemon.  The woman sighs, looking at the camera. Staring directly at him. “For two generations, this has been our working theory. And every good theory deserves to have its ideas and their consequences tested. Inside the lab, through field observations. As problems of the mind. And through every step of the journey, the evidence remains solid. But that leaves a question. If the universe is a fiction, then what is this story telling us? That’s what I hope we’re here to explain today.”  Harold loves moments like this, being taken by surprise, becoming one among billions privileged to watch history play out in unexpected ways. Excitement mixes with oxygen, giving every person a dose of energy. That’s true even inside a warehouse populated with old people. The common rooms are filled with residents watching the news. People stand, people lean forward in their favorite chairs. Expressions range from intrigued and grave concern to the simplicity of being pissed to find their ordinary day ruined. And then there’s the staff standing in back, nobody doing their jobs. Across the world, humanity is enjoying a contemplative break.  In his middle nineties, Harold Lemon has the one daughter, a very crazy granddaughter, and that teenage great-grandson who he doesn’t see nearly enough. Except of course for the millions of images of the boy pulled from various cloud accounts. Harold’s daughter hung squidskin on his apartment walls, instructing the AIs to harvest smiles, forced as well as honest. A lot of fake intimacy, and that’s why the squidskin plays only when the daughter visits or when Harold leaves his apartment. Which is what he does most every day, as it happens. Since he has never been a lonely old boy.  “Frankly, I was never quite satisfied with our initial discovery,” the physicist confesses. “It’s not the nature of the universe that bothers me. Every system has its rules. The Big Bang could be as artificial as mahjong, and who are we to complain? No, I learned to live with the new paradigm. What kept me from sleeping is the gnawing problem about why we so easily see the evidence? Once we knew how to look, the clues were dangling in the sky as well as the smallest corners of the universe. These are clues that humans can’t avoid, much less deny, and that seems unlikely. Almost silly. Really, why go to so much trouble to invent a world and a full, rich cosmos, and then leave your boards and bolts hanging in the sky?”  Harold drinks in that woman’s face. Her joy feeds his pleasure, and that would be true even if he couldn’t hear her words. But he hears everything. Friends and other residents have pushed in close enough to touch one another, but nobody talks. Only the young workers on the outskirts are foolish enough to offer opinions about things they know nothing about.  “But what if this scaffolding was left behind as markers, or as a message?” She asks the question, and once again, she pauses.  Harold leans a little closer, enjoying the thundering of his heart.  “To answer this question, my team and I devised new ways of analyzing data. Everything learned by spaceborne telescopes and the lunar cyclotron has been used. Everything known about this universe has been massaged. And what are we now certain about? That the universe is quite a bit smaller than we first assumed. There are no billions of lightyears or hundreds of billions of days. The real walls of our universe? Spherical and set just about one lightyear from where I’m standing now. And humanity herself is quite a bit younger than we would ever guess. Biblical stories use thousands of years to measure history. But that’s much too much. This world and all its inhabitants were conjured into existence a little more than three hundred years ago.”  This is too much to absorb, even for sharp, happy Harold.  Having delivered that thunder, the first scientist surrenders the podium to her colleagues. In smaller bits, each repeats what has already been said, but with narrower focuses and a fair amount of nomenclature. Reporters are invited to offer up obvious, ignorant questions. The best-guess explanation is that the Earth and its people are a simulation rendered by a more advanced Earth. Which itself could be a synthetic wonder. And is there any window or trapdoor reaching to any greater realm? Not that they can see. Which is sad, or perfect, or nothing. Who can say?  Harold listens until these bizarre new ideas reach a critical point. No, he isn’t ready to understand, much less accept what he’s being told. But at least he has a clear sense about how thoroughly his beliefs need to change.  Eventually the project leader returns to the front of the stage. But this is a different woman, it seems. Nervous, uneasy. She glances at her colleagues, and they respond with affirmative nods and frowns and little gestures from hands that aren’t quite sure what to say. Then the researcher makes a decision, gripping the podium, holding tight for a bit. But no, that isn’t enough. Better to step forwards until she’s perched at the edge of the stage. “One more item,” she says. “This may change, of course. The data are new, our assessments raw. But while doing this work, it occurred to us that any sufficiently large universe could hold little universes. Spaces full of information and highly compressed time. Those are the hallmarks of a genuine Creation. And that’s why we began to analyze our surroundings. Honestly? I didn’t expect anything interesting. Yet we managed find a little universe. And another one, and more after that. Each object is built on the same principles as this giant tiny wondrous box of a universe that we live inside. And each of us is carrying and caring for the marvel. Which is this.”  And that is the moment she places a hand on her small, infinite forehead.  Two universes share a small park bench, and several dozen universes are enjoying the playground and one another. There’s a lot of motion and noise in the scene, and sometimes one of those grown universes will shout, “Honey.”  As a warning, as an endearment. Either way, Honey ignores his name.  His mother sits beside him, quiet and very still, hands resting on her lap, her face engaged but not smiling. Not joyful. Which is still strange to see. The mother that Honey remembers was perpetually smiling, loud and very energetic, like a force of Nature during those little dashes of time when his father allowed them to meet. Usually with Dad hanging close, just in case . . . well, it was never clear what the fear was. That Mom would poison his thinking or dose him with some joy-inducing drug? Or maybe she would kidnap her boy, reclaiming what she regretted giving away for free.  Honey never asks about regrets. The past lives only inside the little universes, and each has its own version of what happened and why. One universe can passionately defend her actions, and maybe the other modifies his memories accordingly. But maybe not, and maybe there would be a fight, and it’s best to remember that on the best day, the universe has a tough time saying much at all.  And this is not the best day.  All at once, his mother says, “I don’t want you to go.”  Honey shrugs.  “Or leave, if you have no choice. Go on and abandon us. But don’t take my grandchildren from me.”  There. They’ve gotten to the heart of this matter.  “Off the Earth and halfway across the universe,” she complains.  “Ceres isn’t that far,” he says.  “It is to me.” And with that, the woman smiles. It’s the first grin since they sat down ten minutes ago. Mom has done a marvelous job of destroying her pleasure centers with chemicals and electricity, and now, due to some odd rerouting of neurons, smiles come only when she is suffering terrible pain. “I barely know your little ones,” she complains. “And now you’re going to live on that dead rock.”  “We’ll come back to visit,” he says.  Not for the first time.  She says, “They won’t. They’ll grow up in that gravity, and they won’t want to suffer down here.”  “Or you visit us,” he offers.  Prohibitively expensive. And besides, the universe inside that head would never accept being carted to the moon, much less out to the asteroid belt. Both of them understand that, and that’s why Mom needs a fresh weapon. Attacking the entire reason for leaving is the more viable plan.  “Your project is evil,” she says.  “It’s not my project,” he says, “and it’s a very reasonable experiment.”  “You can’t help them do this.”  “I can and will.”  “This dangerous, horrific experiment.” Once again, Mom smiles, straightening her back from what might be genuine agony. “Punching a hole in our universe, trying to reach whatever’s next door.”  “That’s why we’re trying this on Ceres,” he reminds her. “Not the moon or the ocean floor. But hundreds of millions of kilometers away.”  “With my grandchildren.”  “Mom,” he says. Then after an exasperated pause, he reminds her, “My wife and I are helping to build the facility. Which will take years. The punching and the consequences won’t come until after the kids are grown.”  “Dangerous, foolish work,” she says.  Honey doesn’t recognize the universe beside him. This woman and everything inside her has shifted in some enormous way, and he comes close to making that point, if only to push her deeper into a smiling rage.  But she seems to guess his thoughts. Quietly, she says, “Now I understand my parents.”  Honey thinks of his grandmother.  “What they went through with me,” says Mom. “What they were thinking, and what they wanted.”  Grandma died two years ago. Which was the last time when Honey and his family spent time with this difficult, much-broken universe.  “Suddenly those crazy people seem reasonable to me,” she claims.  Honey stares at the playground, at the running children and vigilant parents and the parents who want to be anywhere else. It’s amazing and embarrassing how long it takes him to find the three distinct faces that he knows better than any other face, including his own.  Mom folds her arms across her chest. “When you were little,” she says. “Did you visit your great-grandfather?”  “We didn’t live nearby,” he says. “So no, only on special occasions.”  “Grandpa Lemon had pictures of you. Videos of you. I gave him access to my cloud lockers, and your grandmother did the same.”  “I know. I remember that.”  “Squidskins on the walls of his apartment. Which he didn’t like, by the way. He found them intrusive and peculiar.”  “Is that so?”  “He let them play only when his family visited, or when he was out of the room entirely.”  A funny way to wound, but that’s what the words do.  “Do you know what Grandpa Lemon told me?” she asks. “Just before he died. Not long after humanity decided that each of us was its own universe.”  “You’ve never told me, no.”  “‘There’s a lesson in all of this,’ he said.”  “Okay.”  “‘Universes are tiny. Always tiny.’”  Honey can think of nothing to say.  Then his mother touches him. For what will be the last time, she holds his hand with both of hers, smiling in agony as she explains, “You’re going to succeed. I really believe that. You’re going to cut a hole and climb through, and what you’ll discover is another room that someone has left empty, and ten billion faces playing on the walls.” Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "text": "5330 words, short story\nThe Significance of Significance\nSarah wasn’t quite two when the world learned what was what.\nWhich is rather like saying that Sarah still didn’t exist.\nThe very young don’t get to keep their memories. That’s normal human development in action, or it’s a nagging bug inside an otherwise lovely system. Either way, she didn’t waste time regretting this supposed loss. Sure, a booger-clogged head was wearing her name, stumbling across a misunderstood landscape. But that head wasn’t her head, and this Sarah inhabits a beautiful, artificial universe. This world only pretends to be made from protons and people, and being one of the first to grow up knowing that, she has no trouble seeing the blessing for what it is, and that’s why she appreciates each day as wonderful, and it’s sad to see so many others who don’t understand the Significance.\nSarah’s parents. They’ll never accept the truth, which is why spending time with them is so frustrating. She tries to be patient. She really does. But Mom and Dad have pinned themselves to the worst kind of template. What they believed back on Day Zero is what they believe today, and while it’s tempting to feel sorry for those who don’t understand, sorrow is a negative emotion. Negative emotions will always turn into a godawful waste of time, and time feels precious. This lovely existence could evaporate tomorrow, but for as long as Sarah remains real, she intends to harvest as much joy as possible.\nAt least one old man appreciates the world. Mom’s father, Grandpa Lemon, is a different animal. Almost eighty, a fantasy definitely close to its natural end, yet the man still smiles and laughs way more than most people. Maybe he doesn’t have the strongest grasp on the science, but he also doesn’t get angry about what young people know for certain.\n“The significance of Significance,” he says.\nSarah laughs at that phrase.\nGrandpa waves a hand as if shooing away flies. “Want to hear some wild stories explaining why we’re here?”\nShe says, “Sure.”\n“For most of my life, the universe was one enormous, beautiful explosion of Nothingness. And before that? The Earth and its little people were carved from clay by some tall white dude straddling the clouds. But today, for this minute or two, we’re calling ourselves a slick dream living inside an invisible machine.”\nExcept the machine is visible. That’s a point worth making, and Sarah always makes her points.\n“I understand all that,” he claims. “Hey, I actually watched the first press conference. All those people who got to share the Nobel, crazy happy with the attention. And I’ll boast about something else. I’ve read everything that I can find. Unlike a lot of people, including your dear mother. So yeah, I can appreciate what you believe. The universe is a very big box filled with important mathematics. Not that I understand the details, or that you do either. But the evidence is compelling. Reality is full of cheats and simplifications, and quantum mechanics is a game, and the spaces between electrons and between the picoseconds are full of game tricks. And best of all, astronomers looked at the sky and saw the cosmic scaffolding. Which feels like a joke, if you think about it. Do you get my joke, honey?”\nSarah doesn’t like being called “honey.” But names are just clumps of silly sound, and why sweat one word? In Grandpa Lemon’s mind, the famous news conference occurred in 2025, and today happens to be May 8, 2043. But Sarah’s generation doesn’t keep the same calendar. This is 6404. That’s the number of days since the Significance was revealed. Units of time are arbitrary and inadequate, but people who live inside the long years tend to forget too much. Which is a waste. Existence is already arbitrary and frail. You need to notice everything, and counting every day helps. You never know when the complicated math is going to collapse. Whoever built this universe has that kind of power. It’s just like the two-year-old’s brain: The world can cease and thoughts can vanish and nobody would know. Which is one very good reason to smile politely when her grandfather tells cosmic jokes.\n“God is a comedian,” Sarah says. “An old guy like you standing on the scaffolding, laughing down at us.”\n“Laughing hard,” he adds.\nBoth of them are doing just that. Sarah inherited Grandpa Lemon’s deep chuckle. That’s what Mom claims, and that isn’t a bad thing to hear. How many times have Sarah and her grandfather been together like this, the two of them sharing this kind of pleasure? It’s easy enough to ask. Sarah wears cameras and microphones, and like many in her generation, she feeds every moment into an encrypted cloud locker.\nBut she doesn’t ask. Grandpa suddenly falls quiet, and after a long, sorry sigh, he says, “About your mother.”\nAll right. Here it is.\n“I’m not telling you that your folks are worried. You know as much. Or that my daughter doesn’t like your choices, since that’s the most obvious thing in the world right now. No, I just want to hear the story from you. Your reasons for doing this. At your age, when you should be making ready for the rest of your life—”\nThat’s when she interrupts him. A sound that isn’t laughter bursts free, and they’re both surprised by the harshness of it, the rude and dismissive noise before the single word, “Shit.”\nGrandpa stops talking.\nSarah regrets nothing. Regret weighs you down, shortening the good in your brief existence. That’s what she believes and expects from herself. Except no, now she finds herself feeling bad about what she just did, and she can’t shake the stupid emotion.\nGrandpa Lemon repeats just one word.\n“Reasons,” he says.\nThe question doesn’t have to be made any clearer. Sarah’s right hand touches her belly and the bulge. The baby will kick if she waits, because this is a busy eager happy sack of potential that won’t hold memories for another eight hundred days.\n“Because,” she says. “I want a baby before we vanish.”\n“We aren’t going to vanish, honey,” he says.\nAgain, that unwelcome word.\n“But we can go away,” she insists, wanting to sound reasonable but all kinds of pain revealing themselves. Then after a pause and several useless breaths, she adds, “I want a child who loves life as much as I do. And I want to enjoy him before this show is finished.”\n“But if it goes away . . . then it’s as if it never was . . . ”\nHow can anyone say that, or even think it?\nOne last time, he says, “Honey.”\nAnger takes her, making her feel vulnerable. “Every game ends,” she tells him. “But somebody is playing us, Grandpa. Somebody who sees us and knows us. Who knows me, and who’s going to know my son, and as long as we stay happy and interesting, we’ll be worth watching. So you see? That’s the significance of the Significance.”\nA baby is coming. Reality has one shape or an entirely different shape, but Sarah is definitely pregnant and her parents don’t even know the father. Some people would accept this situation. After all, their daughter is a bright, well-educated, voting-age adult. Except Sarah is also impulsive and stubborn. If she wants a baby, that’s what will happen. Telling her that she cannot or should not are the worst possible strategies. No, it’s much easier to attack the entire universe. Taking positions of deep ignorance, the two of them throw doubting words at a child who graduated from school only because she was smart enough to achieve that goal without hard work. The girl who chases loud parties and odd boys in her endless quest for fun. Her parents have learned not to openly doubt Sarah’s good sense, but they can sure complain about the science. Reality is not a piece of software, and existence isn’t some godly creature’s elaborate, fickle hobby. That’s the only way that these two shy people can stand tall and sound stubborn, relying on other people to tell Sarah what she needs to hear.\nBut the Lemon gambit has been soundly defeated.\n“Don’t ever put my grandfather up to shit like that,” Sarah warns them. “I like the old boy. And I didn’t want to have to yell at him.”\nSarah did yell. A full report from the battlefield arrived half an hour before their daughter.\n“We were trying to help,” one of them says.\nIt doesn’t matter which one of them speaks. Married as long as they have been, the voice is shared, just like the uncomfortable air inside their old home.\n“These are such difficult times,” says the other one.\n“And a baby . . . ”\n“Is a lot.”\n“Too much.”\n“When the world is so frantic.”\n“So crazy.”\n“Everything unsettled.”\n“Changing.”\n“Nothing but change,” the shared voice says, and then pauses.\nSarah is not one of those pretty pregnant girls. She doesn’t sleep enough or eat right, and maybe she’s doing worse things to herself and the child. Who knows? Well, she knows. This self-indulgent life needs to be recorded, and that’s why she wears multiple cameras, every mechanical eye staring at these two people who are being awful, and on a day when she so much wanted to have fun.\n“Nobody believes what you believe,” says Sarah. “That’s why the churches are standing empty.”\nWhich is an odd observation, for multiple reasons.\n“I know what bothers you,” the girl declares. “God isn’t magic floating in the clouds. Science built the universe, and you hate it because we know everything that we need to know already.”\nOne of them asks, “Why talk about God?”\n“We’ve never been religious sorts,” says the other.\nBut the first has to point out, “And a lot of people still go to church. People who happen to be your age, in fact.”\nSarah laughs at some part of this. She doesn’t sound like her grandfather today. This is a stranger’s laugh, half growl and full of bile.\nThen one parent tells her, “You need to listen to somebody, honey . . . ”\nWhich is when Sarah begins to scream. At no time in her brief busy life has their daughter unleashed such anger or used this abusive language. “Do you fucking know how much I fucking hate being called ‘honey?’”\nThey will never use that endearment again. But in the spirit of the moment, with emotions heating up air and blood, this is the perfect opportunity to be honest, honest, honest.\n“You’ve always done what you want,” they tell her.\n“You do it fiercely and without doubts, right up until you decide that you don’t want to do it anymore.\n“This isn’t about the nature of the universe,” they tell her.\n“It doesn’t matter if this world is a game or Eden or just one rock among trillions.\n“What matters is you.\n“You’re a certain kind of person and always will be.\n“That’s why we’re afraid.\n“Both of us are.\n“You’re going to get tired of this game, which you always do.\n“And then you’ll leave that poor child with us.”\nThere it is. A terrible truth to admit, particularly to yourself. But they say what needs to be said, and they even manage to stand their ground afterwards, enduring more vicious language and so much fury. But what they don’t expect is the sudden epiphany: In the midst of that onslaught, the suffering parents find themselves wishing that Sarah is right. The universe is indeed someone’s chess board. Because they want the pieces picked and put away, and then all of this terrible pain can dissolve into the vacuum . . . forgotten . . .\nBeing the center of attention should be the best feeling in the world. But Tomjack keeps learning that he can’t trust every pleasure. Happiness finds too many ways to get him into trouble.\nLike with Sarah.\nThree leaps into bed, and each time, nothing felt so good. The sex was part of the fun, sure. But mostly it was the way the girl looked at him, particularly before and then after. Tomjack was the only other person in the world. That’s what her smile was saying. Way too big for one soul, her joy was running hot through him too. If he hadn’t been there to eat her emotions, Sarah would have exploded. That’s what he was thinking at the time. Which was an odd idea, and the odd thoughts didn’t stop coming afterwards.\nEvery little action felt special when they were together. Usually squeamish about cameras, Tomjack didn’t balk about her cameras or throwing everything up to the Cloud. The last time together was that long wonderful afternoon in bed, and that’s when Sarah did the unthinkable. She told her lover that the world could end right now. “Because I’ll never be happier than I am right now,” she said. Sounding hushed and amazed, as if making a confession.\nNormal people didn’t use those words. Normal thought didn’t expect the universe to dissolve in the next breath. But Sarah didn’t just accept the Significance, she believed everything that it told her. For her, life wore a capital L, and when something happened that wasn’t as perfect or fun or as surprising as Sarah deserved, then the day could turn very, very ugly.\nBut not that day. His lover was crying for every good reason, talking about her happiness and hopes. It was so nice. So perfect. The best hours of Tomjack’s life, and that’s why he risked breaking the biggest Sarah-rule. Watching her getting dressed, getting ready to leave, he asked when they’d see each other again. Sarah didn’t believe in “Forcing the future.” That’s what she called normal human planning. But the boy felt brave enough to try the question, and his lover was too giddy to risk chastising him or the temporary universe. She winked, sort of. Then she said, “Next week.”\n“What day?” he pressed.\nShe hesitated, but not for long. “Thursday,” she told him. Then she mentioned a time when she might or might not arrive at his front door.\nOf course Tomjack shaped his entire week around that interlude. And when Sarah didn’t show, he has some ready-built explanations that he could live with. The girl lost track of time, or a party left her too sick, or maybe her grandfather died. Except none of those excuses happened to be true. Sarah didn’t show or answer his texts, and she had never offered him a home address. That’s when tragedy became appealing. There must have been an accident. He imagined her tumbling down a flight of stairs. By Friday, those stairs became numerous and sharp, and by next week, after repeated attempts to contact the girl, Tomjack was convinced that she was dead and he was glad that he missed her funeral. Which was a selfish, stupid way to think. But the boy was barely eighteen, which happened to be the perfect age to let a willful, self-indulgent beauty take hold of your soul.\nA full month passed before Sarah showed up again. By then, Tomjack felt older and a little wiser. The girl made apologetic sounds that didn’t excuse anything but the silly, temporary universe. She told him to forgive her, and maybe he did. Two minutes later, he wasn’t sure what he had said. By then, Sarah was boasting about new boyfriends. Three of them, usually two at a time, and Tomjack wasn’t that kind of beast. He wasn’t at all like her. Standing in the open door, she practically ordered him to have a good life, and that’s when the jilted lover found the maturity to say a few honest words.\n“You’re a scary bitch,” he said.\n“You’re just figuring that out?” she asked, laughing at silly him.\nAnd for six years, they didn’t talk.\nYes. “Years.”\nA lot of people are busy counting the days. But not Tomjack. Adults are free to believe what they want about the universe, regardless of their age. And for Tomjack, the Significance is just a miserable distraction. The picture of everything being unreal . . . well, that will never have stopped making him sick inside. It’s not that he isn’t smart enough to understand the crazy science. The Significance makes as much sense as gravity or electrons, which are pretty magical in their own right. But six more years of life have taught him that his opinions don’t matter all that much. Not to other people or to anything else, including the universe. For the last three years, Tomjack has been married, and his life is happy. But he knows not to feel too happy, since joy is temporary and everything is guaranteed to change, and change likes nothing better than to arrive without warning.\nA theory proved when Sarah arrives unannounced at his front door.\nOn a Thursday afternoon, as it happens. So maybe she wasn’t lying. Maybe this is what she meant with that long ago promise.\nA boy stands behind her, tugging against her hand, and he might well be five years old.\nTomjack says, “Shit.”\n“Watch your language,” Sarah reprimands. Except then she gives this big scary laugh. The woman looks brittle and about to break, and Tomjack feels cold for the both of them. For the three of them.\n“Is this him?” the boy asks.\nSarah keeps up the weird giggling. Cameras are riding her face and hands and knees, and a flock of gnat-sized eyes float in the air, sucking in existence. Her endless pleasure is being enforced. Chemicals can do this, and electrodes implanted deep inside the giddy brain. Methods don’t matter as much as results, and he sees this more and more every year. Good sane people want to relish their lives, and they’ll do anything to feel as if they are the center of the cosmic happiness.\nThe thing is, Sarah is neither good or sane.\n“Is this him?” Tomjack’s son wants to know.\nShe answers by not answering. Teeth showing, she stares at her ex-lover, and something needs a hard moan that steals away her breath. Then she tells him, “This is fair. More than fair.”\n“What are you saying?”\n“I’ve had 2000 days with him. That’s enough.”\nIs she really talking about their son?\n“You get him now,” she says.\n“It is him,” the boy decides.\nTomjack looks at a face that he helped build.\n“My name is Honey,” the kid says,\nTomjack looks at Sarah. “Seriously?”\n“It’s just a sound,” she explains.\nAgain, he looks at the boy, nothing to guide him but a quarter century of life, coupled with empathy as well as a lot of deep, sucking fear.\n“You’ll take him,” she says.\nTomjack doesn’t answer.\n“Because my folks won’t,” she continues.\nWhich is a great joke. The crazy woman has to bend over, laughing until she’s out of breath.\n“Useless old people,” Sarah says.\nWith both hands, Tomjack yanks the boy free of his mother.\n“Anyway,” she says. “You’ll need to go through the legal shit. I won’t fight you. And for help, I can give you . . . ”\nHe listens to her deep, frantic breathing.\n“Recordings of everything,” she promises. “When we made him and everything that’s happened since. Including his first two years, which were pretty damned interesting.”\nInside his head, Tomjack is explaining this mess to his away-from-home wife.\nOut loud, all he can say, “Okay then.”\n“Well, good,” says the madwoman.\nHoney, the boy, seems like the kind of kid who’s always fearful. He’s probably sad and cries himself to sleep. Which really, at the end of this, is the very best evidence that they might make this work. That’s what Tomjack is thinking just now. Start with despair and desperation, and after that, everything an incompetent father does will seem like a godsend.\nThe scientist on the squidskin belonged to the original project. That salient fact needs to be mentioned, along with naming team members instrumental in work done decades ago. But those people aren’t here today. This is a different project, and after thanking the dead and the retired, she begins the official news conference.\n“The universe is a fabrication of mathematics and high-end simulation,” she says. And with that, the Nobel laureate pauses, one finger dragging text across the podium.\nDeja vu hits Harold Lemon.\nThe woman sighs, looking at the camera. Staring directly at him. “For two generations, this has been our working theory. And every good theory deserves to have its ideas and their consequences tested. Inside the lab, through field observations. As problems of the mind. And through every step of the journey, the evidence remains solid. But that leaves a question. If the universe is a fiction, then what is this story telling us? That’s what I hope we’re here to explain today.”\nHarold loves moments like this, being taken by surprise, becoming one among billions privileged to watch history play out in unexpected ways. Excitement mixes with oxygen, giving every person a dose of energy. That’s true even inside a warehouse populated with old people. The common rooms are filled with residents watching the news. People stand, people lean forward in their favorite chairs. Expressions range from intrigued and grave concern to the simplicity of being pissed to find their ordinary day ruined. And then there’s the staff standing in back, nobody doing their jobs. Across the world, humanity is enjoying a contemplative break.\nIn his middle nineties, Harold Lemon has the one daughter, a very crazy granddaughter, and that teenage great-grandson who he doesn’t see nearly enough. Except of course for the millions of images of the boy pulled from various cloud accounts. Harold’s daughter hung squidskin on his apartment walls, instructing the AIs to harvest smiles, forced as well as honest. A lot of fake intimacy, and that’s why the squidskin plays only when the daughter visits or when Harold leaves his apartment. Which is what he does most every day, as it happens. Since he has never been a lonely old boy.\n“Frankly, I was never quite satisfied with our initial discovery,” the physicist confesses. “It’s not the nature of the universe that bothers me. Every system has its rules. The Big Bang could be as artificial as mahjong, and who are we to complain? No, I learned to live with the new paradigm. What kept me from sleeping is the gnawing problem about why we so easily see the evidence? Once we knew how to look, the clues were dangling in the sky as well as the smallest corners of the universe. These are clues that humans can’t avoid, much less deny, and that seems unlikely. Almost silly. Really, why go to so much trouble to invent a world and a full, rich cosmos, and then leave your boards and bolts hanging in the sky?”\nHarold drinks in that woman’s face. Her joy feeds his pleasure, and that would be true even if he couldn’t hear her words. But he hears everything. Friends and other residents have pushed in close enough to touch one another, but nobody talks. Only the young workers on the outskirts are foolish enough to offer opinions about things they know nothing about.\n“But what if this scaffolding was left behind as markers, or as a message?” She asks the question, and once again, she pauses.\nHarold leans a little closer, enjoying the thundering of his heart.\n“To answer this question, my team and I devised new ways of analyzing data. Everything learned by spaceborne telescopes and the lunar cyclotron has been used. Everything known about this universe has been massaged. And what are we now certain about? That the universe is quite a bit smaller than we first assumed. There are no billions of lightyears or hundreds of billions of days. The real walls of our universe? Spherical and set just about one lightyear from where I’m standing now. And humanity herself is quite a bit younger than we would ever guess. Biblical stories use thousands of years to measure history. But that’s much too much. This world and all its inhabitants were conjured into existence a little more than three hundred years ago.”\nThis is too much to absorb, even for sharp, happy Harold.\nHaving delivered that thunder, the first scientist surrenders the podium to her colleagues. In smaller bits, each repeats what has already been said, but with narrower focuses and a fair amount of nomenclature. Reporters are invited to offer up obvious, ignorant questions. The best-guess explanation is that the Earth and its people are a simulation rendered by a more advanced Earth. Which itself could be a synthetic wonder. And is there any window or trapdoor reaching to any greater realm? Not that they can see. Which is sad, or perfect, or nothing. Who can say?\nHarold listens until these bizarre new ideas reach a critical point. No, he isn’t ready to understand, much less accept what he’s being told. But at least he has a clear sense about how thoroughly his beliefs need to change.\nEventually the project leader returns to the front of the stage. But this is a different woman, it seems. Nervous, uneasy. She glances at her colleagues, and they respond with affirmative nods and frowns and little gestures from hands that aren’t quite sure what to say. Then the researcher makes a decision, gripping the podium, holding tight for a bit. But no, that isn’t enough. Better to step forwards until she’s perched at the edge of the stage. “One more item,” she says. “This may change, of course. The data are new, our assessments raw. But while doing this work, it occurred to us that any sufficiently large universe could hold little universes. Spaces full of information and highly compressed time. Those are the hallmarks of a genuine Creation. And that’s why we began to analyze our surroundings. Honestly? I didn’t expect anything interesting. Yet we managed find a little universe. And another one, and more after that. Each object is built on the same principles as this giant tiny wondrous box of a universe that we live inside. And each of us is carrying and caring for the marvel. Which is this.”\nAnd that is the moment she places a hand on her small, infinite forehead.\nTwo universes share a small park bench, and several dozen universes are enjoying the playground and one another. There’s a lot of motion and noise in the scene, and sometimes one of those grown universes will shout, “Honey.”\nAs a warning, as an endearment. Either way, Honey ignores his name.\nHis mother sits beside him, quiet and very still, hands resting on her lap, her face engaged but not smiling. Not joyful. Which is still strange to see. The mother that Honey remembers was perpetually smiling, loud and very energetic, like a force of Nature during those little dashes of time when his father allowed them to meet. Usually with Dad hanging close, just in case . . . well, it was never clear what the fear was. That Mom would poison his thinking or dose him with some joy-inducing drug? Or maybe she would kidnap her boy, reclaiming what she regretted giving away for free.\nHoney never asks about regrets. The past lives only inside the little universes, and each has its own version of what happened and why. One universe can passionately defend her actions, and maybe the other modifies his memories accordingly. But maybe not, and maybe there would be a fight, and it’s best to remember that on the best day, the universe has a tough time saying much at all.\nAnd this is not the best day.\nAll at once, his mother says, “I don’t want you to go.”\nHoney shrugs.\n“Or leave, if you have no choice. Go on and abandon us. But don’t take my grandchildren from me.”\nThere. They’ve gotten to the heart of this matter.\n“Off the Earth and halfway across the universe,” she complains.\n“Ceres isn’t that far,” he says.\n“It is to me.” And with that, the woman smiles. It’s the first grin since they sat down ten minutes ago. Mom has done a marvelous job of destroying her pleasure centers with chemicals and electricity, and now, due to some odd rerouting of neurons, smiles come only when she is suffering terrible pain. “I barely know your little ones,” she complains. “And now you’re going to live on that dead rock.”\n“We’ll come back to visit,” he says.\nNot for the first time.\nShe says, “They won’t. They’ll grow up in that gravity, and they won’t want to suffer down here.”\n“Or you visit us,” he offers.\nProhibitively expensive. And besides, the universe inside that head would never accept being carted to the moon, much less out to the asteroid belt. Both of them understand that, and that’s why Mom needs a fresh weapon. Attacking the entire reason for leaving is the more viable plan.\n“Your project is evil,” she says.\n“It’s not my project,” he says, “and it’s a very reasonable experiment.”\n“You can’t help them do this.”\n“I can and will.”\n“This dangerous, horrific experiment.” Once again, Mom smiles, straightening her back from what might be genuine agony. “Punching a hole in our universe, trying to reach whatever’s next door.”\n“That’s why we’re trying this on Ceres,” he reminds her. “Not the moon or the ocean floor. But hundreds of millions of kilometers away.”\n“With my grandchildren.”\n“Mom,” he says. Then after an exasperated pause, he reminds her, “My wife and I are helping to build the facility. Which will take years. The punching and the consequences won’t come until after the kids are grown.”\n“Dangerous, foolish work,” she says.\nHoney doesn’t recognize the universe beside him. This woman and everything inside her has shifted in some enormous way, and he comes close to making that point, if only to push her deeper into a smiling rage.\nBut she seems to guess his thoughts. Quietly, she says, “Now I understand my parents.”\nHoney thinks of his grandmother.\n“What they went through with me,” says Mom. “What they were thinking, and what they wanted.”\nGrandma died two years ago. Which was the last time when Honey and his family spent time with this difficult, much-broken universe.\n“Suddenly those crazy people seem reasonable to me,” she claims.\nHoney stares at the playground, at the running children and vigilant parents and the parents who want to be anywhere else. It’s amazing and embarrassing how long it takes him to find the three distinct faces that he knows better than any other face, including his own.\nMom folds her arms across her chest. “When you were little,” she says. “Did you visit your great-grandfather?”\n“We didn’t live nearby,” he says. “So no, only on special occasions.”\n“Grandpa Lemon had pictures of you. Videos of you. I gave him access to my cloud lockers, and your grandmother did the same.”\n“I know. I remember that.”\n“Squidskins on the walls of his apartment. Which he didn’t like, by the way. He found them intrusive and peculiar.”\n“Is that so?”\n“He let them play only when his family visited, or when he was out of the room entirely.”\nA funny way to wound, but that’s what the words do.\n“Do you know what Grandpa Lemon told me?” she asks. “Just before he died. Not long after humanity decided that each of us was its own universe.”\n“You’ve never told me, no.”\n“‘There’s a lesson in all of this,’ he said.”\n“Okay.”\n“‘Universes are tiny. Always tiny.’”\nHoney can think of nothing to say.\nThen his mother touches him. For what will be the last time, she holds his hand with both of hers, smiling in agony as she explains, “You’re going to succeed. I really believe that. You’re going to cut a hole and climb through, and what you’ll discover is another room that someone has left empty, and ten billion faces playing on the walls.”\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "source": "https://clarkesworldmagazine.com/reed_07_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Significance of Significance by Robert Reed"}