{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ian Watson; Roberto Quaglia", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "cM9+YEqXd82xBtwJWWNvI8BU0/0=", "id": null, "license": null, "comments": "", "raw_text": "3720 words, short story  The Moby Clitoris of His Beloved  Yukio was only a salaryman, not a company boss, but for years he’d yearned to taste whale clitoris sashimi. Regular whalemeat sashimi was quite expensive, but Yukio would need to work for a hundred years to afford whale clitoris sashimi, the most expensive status symbol in Japan.  Much of Yukio’s knowledge of the world came from manga comic books or from anime movies which he watched on his phone while commuting for three hours every day. He treasured the image of a beautiful young ama diving woman standing on the bow of a whaling boat clad in a semi-transparent white costume and holding sparklingly aloft the special clitoridectomy knife. An icon far more wonderful than that of Kate Winslet at the front of the Titanic! Americans might have their Moby Dick, but Yukio’s countrymen (or at least the richest of them) had their Moby Clitoris Sashimi.  The beautiful young ama woman would take a deep breath, dive, swim underneath a woman-whale, grasp her 8-centimeter clitoris, then with one razor-sharp slash cut off the clitoris and swim away very fast. On the deck of the whaler the crew would wait for the ama to climb back aboard, her costume now see-through due to wetness.  And then the whalers would harpoon and kill the whale, because it would be too cruel to leave a female whale alive after amputation of her clitoris. In this respect the Japanese differed very much from certain Islamic and African countries which cut off the clitorises of human girls, so that men should not feel inadequate about their own capacity for orgasms.  Whenever the Japanese were criticised for hunting whales, it was the harvesting of clitorises which empowered them to continue. And of course Japan observed a strict clitoris quota, so that enough female whales would continue to copulate pleasurably and repopulate. Thus, while it was true that whale clitoridectomy directly pleasured only the richest individuals, every Japanese citizen who enjoyed eating whales also benefitted.  This Yukio knew. Yet he still yearned to taste whale clitoris sashimi for himself! Most men have licked a woman’s clitoris, although probably they haven’t eaten one; but the organ of ecstasy of a female whale sliced thinly was said to possess a taste beyond words.  When Yukio’s vacation came—the usual very hot and humid fortnight in August—he didn’t surrender his holiday back to the Nippon Real-Doll Corporation, as he had done in previous years, in the hope of more rapid promotion through the copyright department. Instead, he took a train from Tokyo (and then a bus) the hundred kilometers to Shirahama City where ama diving women lived. He would seduce an ama to love him. They would marry. She would get a job on a whaling boat. For him she would smuggle clitoris sashimi . . .  To his consternation Yukio soon discovered that the ama women of Shirahama, who dive for red seaweed, sea snails and abalone, looked nothing like the icon in his mind. For one thing, they weren’t slim but were muscular from exercise—and chubby, to cope with cold water. For another, their faces were darkly tanned, not a lovely creamy-white. For a third, their voices were loud and raucous, perhaps due to damage from water pressure; and their speech was quite vulgar. For a fourth, they didn’t wear semi-transparent white garments, but orange sweatshirts, thermal tights, and neoprene diving hoods. And for a fifth, their average age seemed to be over sixty. Even if one of those fat vulgar grannies wanted a lover and husband, how could Yukio excite himself enough to woo her?  Disconsolate, he went to get drunk. Presently he found himself outside The Authentic Ama-Geisha Inn. The name seemed promising.  Inside, he was amazed to find waiting several beautiful slim young hostesses dressed in the correct long white semi-transparent costumes, and also wearing white high heels. Perched jauntily on their foreheads were diving masks. One hostess wore her very long hair in an oily black rope which would excite a bondage fetishist or a flagellant considerably.  Soon this hostess, whose name was Keiko, was leading Yukio into a private room—which contained a low table, plastic cushions, and a small blue-tiled pool set in the floor of tatami matting, which was plastic too; plastic would dry more quickly than straw matting.  He knelt. Keiko knelt and poured some Johnnie Walker Black Label.  She giggled and said sweetly, “You may splash me whenever you wish!”  Thus revealing more of her breast or thigh or belly . . .  “But you’re the ama of my visions!” Yukio exclaimed. “Why aren’t you diving in the sea? You would look so beautiful.”  Already he was a bit in love with Keiko, even though the plan had been for an ama to fall in love with him.  “I’m an ama-geisha,” Keiko explained. “Only you can wet me, not the sea.”  “I’ve seen amas just like you with the whaling fleet! Only,” and he recollected his apparently foolish plan, “not with such wonderful hair as yours. They dive for whale clitorises,” he added.  Keiko giggled again. “A real ama does that.”  “A fat old granny?”  Keiko’s job was to please him, and Yukio seemed to prefer intellectual stimulation rather than getting drunk and splashing her, so the astonishing truth emerged—a truth known to most inhabitants of Shirahama, but which the media patriotically chose not to publicise.  Each whaling ship carried a real ama and also a false ama (or rather an authentic iconic ama). The real ama, old and fat, foul-mouthed and lurid, would harvest the clitoris while the false ama—who looked more real—would wait in the water beside the ship. The false authentic ama would then take the clitoris from the real inauthentic ama and would climb a steep gangplank back on board deck, her garment delightfully see-through. Meanwhile the old fat ama would sneak on to the ship from the rear, using the ramp up which dead whales were winched.  This substitution made whale-hunting seem graceful and elegant and sexually exciting in the eyes of the world—slightly akin to marine bull-fighting—and justified the high price to gourmets of clitoris sashimi.  Yukio stared at Keiko. “Wouldn’t you rather be on a whaling ship, than here? With your wonderful rope of hair you’d set a new style for cartoon books and films. I can license your image for you.” Yukio’s work did indeed consist in copyright matters concerning Real Dolls modelled upon porn stars. “I’m a specialist. You’d earn a big fee.” And Yukio would be the lovely Keiko’s agent and manager, and because of this, he would become her Beloved! And at last he would eat whale clitoris sashimi.  Keiko was wide-eyed.  “Agreed?”  Before Keiko could change her mind, Yukio picked up his glass of Johnny Walker Black Label and threw the contents over her, wetting and revealing a delightful breast.  “Kampai!” he exclaimed, to toast her—but in his mind he was shouting ‘Banzai!’ for victory.  The whaling industry normally recruited deep-sea ama from communities such as Shirahama, but Yukio needed Keiko with him in Tokyo to register her image. Keiko could stay in his little apartment in a highrise in the suburbs.  So Keiko exchanged her authentic ama costume and high heels for jeans and a blouse, and piled her rope of hair upon her head, hiding it with a scarf, because nobody must steal her image on a phone en route! Already Yukio felt paranoid and jealous.  On the train Yukio looked at the news on his own phone, and a headline caught his eye: THROW THE WHALE AWAY!  A meeting in South Korea of the International Whaling Commission had ended in confusion. As usual the dispute was about whether to save whales or eat them. The Japanese delegate had suddenly declared that whale clitoris sashimi was a cultural treasure unique to Japan. If foreigners forced the Japanese to stop eating whalemeat, the Japanese would continue to harvest whale clitorises—but to please world public opinion they would throw the rest of the whale away. They would accomplish this grand gesture by compassionately exploding all clitoridectomised whales using torpedos packed with plastic explosive, since nuclear torpedos were unacceptable.  “That will make clitorises even more valuable and prestigious,” Yukio said to Keiko.  “I have a clitoris too,” she replied.  “But not a whale clitoris.” Or at least not yet, he thought.  Maybe the Japanese delegate’s statement was intended to bewilder the World Wildlife Fund, which had been picketing the meeting. Under the United Nations’ Declaration of Cultural Rights, it was forbidden to attack or slander any country’s unique cultural icons, such as the Golden Arches of MacDonald’s or the Eiffel Tower. Now that Japan had registered whale clitoris sashimi as a cultural treasure, that gourmet experience was protected from criticism—and if there were no clitorises to be sliced, obviously the experience would become extinct. To preserve the cultural experience, the Japanese must continue to hunt whales.  Yukio’s apartment was a four-mat one, which was better than living and sleeping in a room only the size of three tatami mats; but still it was rather crowded by two people, unless those two people were intimate. So Yukio found himself examining Keiko’s clitoris, causing her to sigh with pleasure. Then he went to sleep and dreamed that every century a magical woman-whale would appear offshore, to provide sashimi from her clitoris for the Empress of the time. On the brow of this whale: a white mark exactly like a chrysanthemum flower. During the subsequent hundred years, the whale’s clitoris would regenerate.  Yukio awoke in the morning, thinking immediately about the possibilities of cloning clitoris. Keiko had already risen and was now kneeling, dressed in her authentic iconic ama costume which real ama no longer wore. Truly she had the graces of a geisha.  Obviously a woman’s clitoris couldn’t possibly taste as wonderful as a whale’s, yet what if cloned human clitoris could be marketed profitably enough so that the genius who thought of this became rich enough to afford to eat whale clitoris?  Since Yukio had no idea how to clone anything, an alternative occurred to him. These days, because pigs and people are very alike, pigs provided transplant organs for human beings. Maybe a million people had inside them pig hearts or lungs or livers or kidneys. When the pigs were sacrificed to provide transplants, the rest of the pig, including the clitoris in the case of female pigs, would probably go into pet food.  What if Yukio were to buy the sex organs of pigs, to provide a source of clitorises? These could be packaged in tiny jars as human clitorises, and sold over the internet! Upon the label, a photo of a genuine human clitoris, with a certificate of authenticity which would be correct since the picture at least was genuine. Delicious clitorises, cloned from this very clitoris you see! Realistically, Keiko might not obtain a job on a whaling ship—yet she could still help Yukio to achieve his goal.  Truly, his trip to the seaside had inspired him, probably because the clean air contained more oxygen in it than in the city.  Yukio took his phone, and soon he was photographing Keiko’s clitoris while she assisted him. He wasn’t quite sure if her clitoris was the usual size but it was certainly very noticeable. Using Photoshop, he could get rid of the surrounding flaps of flesh familiar to users of porn magazines, leaving only the clitoris itself in the picture. His computer could print many labels. In a truly iconic sense he would indeed be cloning Keiko’s clitoris, or at least its image. In his excitement he almost forgot to go to work.  On the commuter train, he used his phone to search for Pig Organ Farms and for Food Bottlers. Genius is to perceive connections where none were seen before.  When he returned home that night, Keiko was already lying asleep on the futon, still dressed as an ama and wearing her diving mask for even greater authenticity. Her long rope of hair seemed like an oxygen tube. The TV set was showing young men eating as many worms as they could as quickly as possible. It was the popular weekly show Brown Spaghetti Race, sponsored by the Dai-Nippon Cheese Company. The more Parmesan the contestants poured on the wiggling worms, the less difficult it was to pick them up using smoothly lacquered chopsticks.  Would consumers be more excited by “genuine canned cloned human clitoris sashimi” or “genuine ama clitoris sashimi (cloned)”? Maybe the label should show Keiko smiling as she held her photoshopped clitoris to her own lips with chopsticks? Would the suggestion of auto-cannibalism excite buyers? Was his ideal market gourmets who couldn’t afford whale clitoris, or sexual fetishists? Or both?  Yukio sat on the edge of the futon beside Keiko and regarded her tenderly. He lifted her rope of hair, closed his lips upon the end of it, and blew into the hair as though to supply her with more oxygen, such as she had been accustomed to at the seaside. Maybe, subconsciously at least, that was the reason why she had put on the diving mask.  “Keiko-san,” he told her politely, although she was asleep, “there is a change of plan.”  It took Yukio some hard work and organisation and most of his savings to set up the Genuine Cloned Ama Clitoris Sashimi Company, or GCACSC for short. The sexual organs of organ-donor pigs must be rushed by courier, refrigerated and ultra-fresh, to the Greater Tokyo Bottling Company, where a dedicated employee dissected out the clitorises for bottling. Irrelevant vaginas and labia and also penises and balls were cooked and minced and canned to become Luxury Pig-Protein sent as food aid to starving Communist North Korea, with the full co-operation of the government’s Japan-Aid programme, which subsidised the project and praised Yukio’s initiative and sense of social responsibility, while respecting his wish to remain anonymous. The donor farm believed that the complete sexual organs were being processed, which in the case of male pigs was true; and Yukio had no wish to enlighten them.  He enlightened the gourmet public about the availability of cloned ama clitoris sashimi by means of a clever spam program, which he bought in the Akihabara electronics district. A spam program was appropriate since the word spam originally meant `spiced American meat.’  Every night after Yukio came home from the Nippon Real-Doll Corporation, he printed labels for the jars and boxes and address labels and dealt with an increasing number of internet orders and payments. He had rented a garage for delivery of the little unlabelled jars of clitorises, which were received there during the day by Keiko, dressed ordinarily. She would then change into her ama costume, stick the labels on to the jars, skillfully fold the beautiful little cardboard boxes which Yukio produced on his printer, fit a jar into each, and stick on an address label.  Keiko was very busy; and so was Yukio. What with Yukio’s regular work at the Real-Doll Corporation and his after-hours work at home, he became a bit like a Zen monk who had trained himself in No-Sleep, or not much—now he slept standing up in the commuter train instead of looking at manga and anime on his phone; consequently he never watched the News in either manga or anime format. All he knew was that orders were pouring into his home PC. The spam had done its job sufficiently well that consumers were spontaneously spreading the word of the new and affordable (although not cheap) gourmet delight. Keiko told him that by now magazines were writing stories about, and TV channels were talking—she had done some phone interviews. Apparently Yukio was being hailed as the new Mr Mikimoto, but Yukio had no spare time to pay much attention.  Mikimoto-san was the man who invented cultured pearls by putting irritating grains of sand inside oysters, at Pearl Island. To suggest that his cultured pearls were as good as naturally occuring pearls, he had employed amas to dive into the sea around Pearl Island for tourists to admire, and in fact, according to Keiko, Mikimoto-san had invented or revised the see-through costumes of the amas. The ama water-ballet actresses would bring up real oysters, which might or might not contain real pearls, for the tourists to eat authentically in the Pearl Island Restaurant.  One evening an astonishing thing happened. Yukio had woken up automatically as usual in time to get off the commuter train, and was walking away from the station homeward when he saw Keiko coming towards along the street dressed in schoolgirl uniform!  “Why have you become a schoolgirl?” he cried out, but Keiko walked past, ignoring him.  Then along the street came another schoolgirl Keiko, then another, then a couple together.  They were real schoolgirls wearing false faces—latex masks of the real Keiko!  “Excuse me,” Yukio said to a false Keiko, “but where did you get that mask?”  The schoolgirl paused, but remained silent.  Of course, she couldn’t speak while wearing that mask because Yukio wasn’t speaking to her but to the mask. Should he reach out and peel the mask from her true face? That might constitute assault, or even a new perversion, of unmasking schoolgirls.  “Please tell me,” he begged.  She bowed slightly, then beckoned—gestured him back towards the station.  Like a tourist guide for the deaf she led him inside the station to a vending machine. It was one of those that sold the used panties of virgins, which old men would buy and sniff. But now it also sold something else in little bags: those masks of Keiko.  Quickly Yukio bought one. The packaging showed the upper body and face of Keiko, just as on the labels of the jars of clitorises. Keiko held to her lips with chopsticks a clitoris, although now she was using her left hand rather than her right—evidently she had been photoshopped. A speech bubble above her head read: Eat my virgin clitoris.  That was the cheeky message conveyed by the mask. Identities concealed, schoolgirls could tease men naughtily without a blush, without even saying a word or making a gesture. What innocent, or wicked, erotic power they would feel! Clitoris power. Maybe the packaging of other masks had different speech in the bubbles. Or maybe not. Or maybe yes.  Quickly Yukio googled non-manga non-anime News on his phone.  He saw a picture, taken through a window, of a classroom in which all the girls were wearing identical Keiko masks to the consternation of the teacher. He saw a picture of a playground where a dozen Keikos of different heights were strolling. A craze had hit the whole of Japan, probably spreading among schoolgirls everywhere by txt!  Because of trousers, he noticed some boys too, who were also wearing Keiko masks. Ah, the boys were doing that so as to save face!  He asked the Keiko who still lingered by the machine, “Keiko, did you do this without consulting me? To prove that you’re clever too?” What a perfect ecological loop, that the same machines which sold the used virgin underwear of schoolgirls should provide the same schoolgirls with these masks . . .  But of course she wasn’t the real Keiko, and besides she had no intention of speaking.  How could Keiko have organised the rapid manufacture of all the masks and their supply to vending machines? Yukio ripped open the packaging and unfolded the latex mask. On the back of the chin, to his horror he saw: â„¢ Nippon Real-Doll Corp.  Had he fallen asleep at work without realizing and talked in his sleep? Had he been too clever for himself? Had part of him exploited himself schizophrenically out of company loyalty? Or had the company security-psychologist decided that Yukio was behaving oddly, and investigated his computer?  Oh foolish Yukio, to have copyrighted the label with Keiko’s image in his own name at work, borrowing the company’s copyright software—that was how they had found out!  But then the company perceived a unique business opportunity: the Real-Doll Corporation could turn real schoolgirls everywhere into clitoris-power dolls of his Keiko! A million texting schoolgirls could spread a craze within a few days, or maybe a few hours. And Yukio couldn’t complain or sue, nor could Keiko. For one thing, Yukio had committed industrial theft. But, even more worryingly, the Real-Doll Corporation’s psychologist-detective may have also found out the true source of Genuine Cloned Ama Clitoris Sashimi.  Yukio bowed to the false Keiko, then hurried home.  “Who are you?” he said to Keiko in the four-mat room. Quickly he explained what he had discovered—Keiko had been too busy labeling in the rented garage that day to watch any news. And he added: “You must wear a mask from now on, or else I won’t know you!”  “Do you mean wear my diving mask?”  “More like a mask of Kate Winslet, I think . . . No, wait!”  The big oval of latex cut from the Keiko mask fitted the diving mask perfectly. Superglue secured it. Her false eyes, false nose, and false mouth squeezed flatly against the inside of the glass, as if she had dived to a depth of such pressure that her features had become two-dimensional. Her photoshopped clitoris forever would touch her flat lips.  Since the false genuine face which she wore a few centimeters in front of her real face was in fact her true face, this negated that falsity and bestowed a mysterious and mystical authenticity upon her actual face, even though that was now invisible, as mystical things often are.  A Zen-like state came over Yukio. He knelt before Keiko, like Pinocchio praying to the Blue Fairy to make him real. By not-seeing what he was seeing, Yukio began to worship her countenance.  Unseeing too, a blind goddess, Keiko heard his mantra of worship.  “My Beloved, My Beloved, My Beloved . . . ”  Whale clitoris sashimi was only an illusion, from which Yukio was now freed by enlightenment. Probably its sublime taste was also an illusion caused by exorbitant price. He would eat Keiko’s clitoris instead. Ian Watson started writing science fiction in Japan in the late 1960s, where he was supposed to be a lecturer but his university was on strike for 2 1/2 years. Many novels and story collections later, his most recent are respectively Mockymen (Golden Gryphon, 2003, and Immanion Press, 2004) and The Butterflies of Memory (PS Publishing, 2006), which isn't a sequel to The Flies of Memory (Gollancz, 1990). His previous collection, The Great Escape (from Golden Gryphon) was a Washington Post \"Book of the Year.\" Throughout 1990 he worked eyeball to eyeball with Stanley Kubrick on A.I. Artificial Intelligence, subsequently directed by Steven Spielberg, for which Ian has screen credit for Screen Story. His first collection of poetry, The Lexicographer’s Love Song, appeared in 2001 from DNA Publications, and he has won a Rhysling Award for his SF poetry. He and Roberto Quaglia began collaborating 3 years ago, resulting in a now complete book of linked stories, The Beloved of My Beloved, of which the \"Moby Clitoris\" is one, currently seeking an English language publisher, it already found a Japanese one. Ian lives in a tiny English village midway between Oxford and Stratford with his black cat Poppy, and his web site with fun photos, run by Roberto, is at www.ianwatson.info. He and his Spanish translator and Hungarian publisher maintain a web-site (www.ajeno.intelmedia.co.uk) to spread greater awareness of the unknown Colombian poet Miguel Ajeno.  Roberto Quaglia hails from Genoa in Italy, where he ran a bar for years, won prizes for photography, and became one of the few Surrealist city councillors in the world. Currently he lives much of the year in Bucharest because he learned to speak Romanian, though he may also live in Moldova where people also speak Romanian. Robert Sheckley enthusiastically prefaced Roberto's surreal satirical SF double-novel Bread, Butter and Paradoxine (published in English by Delos international). He continues to take thousands of photographs. Genoa is the city of Christopher Columbus, who perhaps discovered America, and now America discovers Roberto Quaglia, which they can also do in \"The Penis of My Beloved\" in Claude Lalumier & Elise Moser's anthology Lust for Life. Roberto cruises the motorways of Europe in a white Mercedes with no wing mirrors so that he will always see into the future. His recent collection of essays, also from Delos, Pensiero stocastico (Probabilistic Thought), considers such matters as \"The Advantages of Human Clonation,\" \"The Miracle of the Multiplication of Loaves and Fishes and Porn Photos on the Internet,\" and \"The Myth of Diana, the Death of the Sad Princess.\" He has also written the remarkable Jonathan Livingshit Pigeon, much better than a seagull.", "text": "3720 words, short story\nThe Moby Clitoris of His Beloved\nYukio was only a salaryman, not a company boss, but for years he’d yearned to taste whale clitoris sashimi. Regular whalemeat sashimi was quite expensive, but Yukio would need to work for a hundred years to afford whale clitoris sashimi, the most expensive status symbol in Japan.\nMuch of Yukio’s knowledge of the world came from manga comic books or from anime movies which he watched on his phone while commuting for three hours every day. He treasured the image of a beautiful young ama diving woman standing on the bow of a whaling boat clad in a semi-transparent white costume and holding sparklingly aloft the special clitoridectomy knife. An icon far more wonderful than that of Kate Winslet at the front of the Titanic! Americans might have their Moby Dick, but Yukio’s countrymen (or at least the richest of them) had their Moby Clitoris Sashimi.\nThe beautiful young ama woman would take a deep breath, dive, swim underneath a woman-whale, grasp her 8-centimeter clitoris, then with one razor-sharp slash cut off the clitoris and swim away very fast. On the deck of the whaler the crew would wait for the ama to climb back aboard, her costume now see-through due to wetness.\nAnd then the whalers would harpoon and kill the whale, because it would be too cruel to leave a female whale alive after amputation of her clitoris. In this respect the Japanese differed very much from certain Islamic and African countries which cut off the clitorises of human girls, so that men should not feel inadequate about their own capacity for orgasms.\nWhenever the Japanese were criticised for hunting whales, it was the harvesting of clitorises which empowered them to continue. And of course Japan observed a strict clitoris quota, so that enough female whales would continue to copulate pleasurably and repopulate. Thus, while it was true that whale clitoridectomy directly pleasured only the richest individuals, every Japanese citizen who enjoyed eating whales also benefitted.\nThis Yukio knew. Yet he still yearned to taste whale clitoris sashimi for himself! Most men have licked a woman’s clitoris, although probably they haven’t eaten one; but the organ of ecstasy of a female whale sliced thinly was said to possess a taste beyond words.\nWhen Yukio’s vacation came—the usual very hot and humid fortnight in August—he didn’t surrender his holiday back to the Nippon Real-Doll Corporation, as he had done in previous years, in the hope of more rapid promotion through the copyright department. Instead, he took a train from Tokyo (and then a bus) the hundred kilometers to Shirahama City where ama diving women lived. He would seduce an ama to love him. They would marry. She would get a job on a whaling boat. For him she would smuggle clitoris sashimi . . .\nTo his consternation Yukio soon discovered that the ama women of Shirahama, who dive for red seaweed, sea snails and abalone, looked nothing like the icon in his mind. For one thing, they weren’t slim but were muscular from exercise—and chubby, to cope with cold water. For another, their faces were darkly tanned, not a lovely creamy-white. For a third, their voices were loud and raucous, perhaps due to damage from water pressure; and their speech was quite vulgar. For a fourth, they didn’t wear semi-transparent white garments, but orange sweatshirts, thermal tights, and neoprene diving hoods. And for a fifth, their average age seemed to be over sixty. Even if one of those fat vulgar grannies wanted a lover and husband, how could Yukio excite himself enough to woo her?\nDisconsolate, he went to get drunk. Presently he found himself outside The Authentic Ama-Geisha Inn. The name seemed promising.\nInside, he was amazed to find waiting several beautiful slim young hostesses dressed in the correct long white semi-transparent costumes, and also wearing white high heels. Perched jauntily on their foreheads were diving masks. One hostess wore her very long hair in an oily black rope which would excite a bondage fetishist or a flagellant considerably.\nSoon this hostess, whose name was Keiko, was leading Yukio into a private room—which contained a low table, plastic cushions, and a small blue-tiled pool set in the floor of tatami matting, which was plastic too; plastic would dry more quickly than straw matting.\nHe knelt. Keiko knelt and poured some Johnnie Walker Black Label.\nShe giggled and said sweetly, “You may splash me whenever you wish!”\nThus revealing more of her breast or thigh or belly . . .\n“But you’re the ama of my visions!” Yukio exclaimed. “Why aren’t you diving in the sea? You would look so beautiful.”\nAlready he was a bit in love with Keiko, even though the plan had been for an ama to fall in love with him.\n“I’m an ama-geisha,” Keiko explained. “Only you can wet me, not the sea.”\n“I’ve seen amas just like you with the whaling fleet! Only,” and he recollected his apparently foolish plan, “not with such wonderful hair as yours. They dive for whale clitorises,” he added.\nKeiko giggled again. “A real ama does that.”\n“A fat old granny?”\nKeiko’s job was to please him, and Yukio seemed to prefer intellectual stimulation rather than getting drunk and splashing her, so the astonishing truth emerged—a truth known to most inhabitants of Shirahama, but which the media patriotically chose not to publicise.\nEach whaling ship carried a real ama and also a false ama (or rather an authentic iconic ama). The real ama, old and fat, foul-mouthed and lurid, would harvest the clitoris while the false ama—who looked more real—would wait in the water beside the ship. The false authentic ama would then take the clitoris from the real inauthentic ama and would climb a steep gangplank back on board deck, her garment delightfully see-through. Meanwhile the old fat ama would sneak on to the ship from the rear, using the ramp up which dead whales were winched.\nThis substitution made whale-hunting seem graceful and elegant and sexually exciting in the eyes of the world—slightly akin to marine bull-fighting—and justified the high price to gourmets of clitoris sashimi.\nYukio stared at Keiko. “Wouldn’t you rather be on a whaling ship, than here? With your wonderful rope of hair you’d set a new style for cartoon books and films. I can license your image for you.” Yukio’s work did indeed consist in copyright matters concerning Real Dolls modelled upon porn stars. “I’m a specialist. You’d earn a big fee.” And Yukio would be the lovely Keiko’s agent and manager, and because of this, he would become her Beloved! And at last he would eat whale clitoris sashimi.\nKeiko was wide-eyed.\n“Agreed?”\nBefore Keiko could change her mind, Yukio picked up his glass of Johnny Walker Black Label and threw the contents over her, wetting and revealing a delightful breast.\n“Kampai!” he exclaimed, to toast her—but in his mind he was shouting ‘Banzai!’ for victory.\nThe whaling industry normally recruited deep-sea ama from communities such as Shirahama, but Yukio needed Keiko with him in Tokyo to register her image. Keiko could stay in his little apartment in a highrise in the suburbs.\nSo Keiko exchanged her authentic ama costume and high heels for jeans and a blouse, and piled her rope of hair upon her head, hiding it with a scarf, because nobody must steal her image on a phone en route! Already Yukio felt paranoid and jealous.\nOn the train Yukio looked at the news on his own phone, and a headline caught his eye: THROW THE WHALE AWAY!\nA meeting in South Korea of the International Whaling Commission had ended in confusion. As usual the dispute was about whether to save whales or eat them. The Japanese delegate had suddenly declared that whale clitoris sashimi was a cultural treasure unique to Japan. If foreigners forced the Japanese to stop eating whalemeat, the Japanese would continue to harvest whale clitorises—but to please world public opinion they would throw the rest of the whale away. They would accomplish this grand gesture by compassionately exploding all clitoridectomised whales using torpedos packed with plastic explosive, since nuclear torpedos were unacceptable.\n“That will make clitorises even more valuable and prestigious,” Yukio said to Keiko.\n“I have a clitoris too,” she replied.\n“But not a whale clitoris.” Or at least not yet, he thought.\nMaybe the Japanese delegate’s statement was intended to bewilder the World Wildlife Fund, which had been picketing the meeting. Under the United Nations’ Declaration of Cultural Rights, it was forbidden to attack or slander any country’s unique cultural icons, such as the Golden Arches of MacDonald’s or the Eiffel Tower. Now that Japan had registered whale clitoris sashimi as a cultural treasure, that gourmet experience was protected from criticism—and if there were no clitorises to be sliced, obviously the experience would become extinct. To preserve the cultural experience, the Japanese must continue to hunt whales.\nYukio’s apartment was a four-mat one, which was better than living and sleeping in a room only the size of three tatami mats; but still it was rather crowded by two people, unless those two people were intimate. So Yukio found himself examining Keiko’s clitoris, causing her to sigh with pleasure. Then he went to sleep and dreamed that every century a magical woman-whale would appear offshore, to provide sashimi from her clitoris for the Empress of the time. On the brow of this whale: a white mark exactly like a chrysanthemum flower. During the subsequent hundred years, the whale’s clitoris would regenerate.\nYukio awoke in the morning, thinking immediately about the possibilities of cloning clitoris. Keiko had already risen and was now kneeling, dressed in her authentic iconic ama costume which real ama no longer wore. Truly she had the graces of a geisha.\nObviously a woman’s clitoris couldn’t possibly taste as wonderful as a whale’s, yet what if cloned human clitoris could be marketed profitably enough so that the genius who thought of this became rich enough to afford to eat whale clitoris?\nSince Yukio had no idea how to clone anything, an alternative occurred to him. These days, because pigs and people are very alike, pigs provided transplant organs for human beings. Maybe a million people had inside them pig hearts or lungs or livers or kidneys. When the pigs were sacrificed to provide transplants, the rest of the pig, including the clitoris in the case of female pigs, would probably go into pet food.\nWhat if Yukio were to buy the sex organs of pigs, to provide a source of clitorises? These could be packaged in tiny jars as human clitorises, and sold over the internet! Upon the label, a photo of a genuine human clitoris, with a certificate of authenticity which would be correct since the picture at least was genuine. Delicious clitorises, cloned from this very clitoris you see! Realistically, Keiko might not obtain a job on a whaling ship—yet she could still help Yukio to achieve his goal.\nTruly, his trip to the seaside had inspired him, probably because the clean air contained more oxygen in it than in the city.\nYukio took his phone, and soon he was photographing Keiko’s clitoris while she assisted him. He wasn’t quite sure if her clitoris was the usual size but it was certainly very noticeable. Using Photoshop, he could get rid of the surrounding flaps of flesh familiar to users of porn magazines, leaving only the clitoris itself in the picture. His computer could print many labels. In a truly iconic sense he would indeed be cloning Keiko’s clitoris, or at least its image. In his excitement he almost forgot to go to work.\nOn the commuter train, he used his phone to search for Pig Organ Farms and for Food Bottlers. Genius is to perceive connections where none were seen before.\nWhen he returned home that night, Keiko was already lying asleep on the futon, still dressed as an ama and wearing her diving mask for even greater authenticity. Her long rope of hair seemed like an oxygen tube. The TV set was showing young men eating as many worms as they could as quickly as possible. It was the popular weekly show Brown Spaghetti Race, sponsored by the Dai-Nippon Cheese Company. The more Parmesan the contestants poured on the wiggling worms, the less difficult it was to pick them up using smoothly lacquered chopsticks.\nWould consumers be more excited by “genuine canned cloned human clitoris sashimi” or “genuine ama clitoris sashimi (cloned)”? Maybe the label should show Keiko smiling as she held her photoshopped clitoris to her own lips with chopsticks? Would the suggestion of auto-cannibalism excite buyers? Was his ideal market gourmets who couldn’t afford whale clitoris, or sexual fetishists? Or both?\nYukio sat on the edge of the futon beside Keiko and regarded her tenderly. He lifted her rope of hair, closed his lips upon the end of it, and blew into the hair as though to supply her with more oxygen, such as she had been accustomed to at the seaside. Maybe, subconsciously at least, that was the reason why she had put on the diving mask.\n“Keiko-san,” he told her politely, although she was asleep, “there is a change of plan.”\nIt took Yukio some hard work and organisation and most of his savings to set up the Genuine Cloned Ama Clitoris Sashimi Company, or GCACSC for short. The sexual organs of organ-donor pigs must be rushed by courier, refrigerated and ultra-fresh, to the Greater Tokyo Bottling Company, where a dedicated employee dissected out the clitorises for bottling. Irrelevant vaginas and labia and also penises and balls were cooked and minced and canned to become Luxury Pig-Protein sent as food aid to starving Communist North Korea, with the full co-operation of the government’s Japan-Aid programme, which subsidised the project and praised Yukio’s initiative and sense of social responsibility, while respecting his wish to remain anonymous. The donor farm believed that the complete sexual organs were being processed, which in the case of male pigs was true; and Yukio had no wish to enlighten them.\nHe enlightened the gourmet public about the availability of cloned ama clitoris sashimi by means of a clever spam program, which he bought in the Akihabara electronics district. A spam program was appropriate since the word spam originally meant `spiced American meat.’\nEvery night after Yukio came home from the Nippon Real-Doll Corporation, he printed labels for the jars and boxes and address labels and dealt with an increasing number of internet orders and payments. He had rented a garage for delivery of the little unlabelled jars of clitorises, which were received there during the day by Keiko, dressed ordinarily. She would then change into her ama costume, stick the labels on to the jars, skillfully fold the beautiful little cardboard boxes which Yukio produced on his printer, fit a jar into each, and stick on an address label.\nKeiko was very busy; and so was Yukio. What with Yukio’s regular work at the Real-Doll Corporation and his after-hours work at home, he became a bit like a Zen monk who had trained himself in No-Sleep, or not much—now he slept standing up in the commuter train instead of looking at manga and anime on his phone; consequently he never watched the News in either manga or anime format. All he knew was that orders were pouring into his home PC. The spam had done its job sufficiently well that consumers were spontaneously spreading the word of the new and affordable (although not cheap) gourmet delight. Keiko told him that by now magazines were writing stories about, and TV channels were talking—she had done some phone interviews. Apparently Yukio was being hailed as the new Mr Mikimoto, but Yukio had no spare time to pay much attention.\nMikimoto-san was the man who invented cultured pearls by putting irritating grains of sand inside oysters, at Pearl Island. To suggest that his cultured pearls were as good as naturally occuring pearls, he had employed amas to dive into the sea around Pearl Island for tourists to admire, and in fact, according to Keiko, Mikimoto-san had invented or revised the see-through costumes of the amas. The ama water-ballet actresses would bring up real oysters, which might or might not contain real pearls, for the tourists to eat authentically in the Pearl Island Restaurant.\nOne evening an astonishing thing happened. Yukio had woken up automatically as usual in time to get off the commuter train, and was walking away from the station homeward when he saw Keiko coming towards along the street dressed in schoolgirl uniform!\n“Why have you become a schoolgirl?” he cried out, but Keiko walked past, ignoring him.\nThen along the street came another schoolgirl Keiko, then another, then a couple together.\nThey were real schoolgirls wearing false faces—latex masks of the real Keiko!\n“Excuse me,” Yukio said to a false Keiko, “but where did you get that mask?”\nThe schoolgirl paused, but remained silent.\nOf course, she couldn’t speak while wearing that mask because Yukio wasn’t speaking to her but to the mask. Should he reach out and peel the mask from her true face? That might constitute assault, or even a new perversion, of unmasking schoolgirls.\n“Please tell me,” he begged.\nShe bowed slightly, then beckoned—gestured him back towards the station.\nLike a tourist guide for the deaf she led him inside the station to a vending machine. It was one of those that sold the used panties of virgins, which old men would buy and sniff. But now it also sold something else in little bags: those masks of Keiko.\nQuickly Yukio bought one. The packaging showed the upper body and face of Keiko, just as on the labels of the jars of clitorises. Keiko held to her lips with chopsticks a clitoris, although now she was using her left hand rather than her right—evidently she had been photoshopped. A speech bubble above her head read: Eat my virgin clitoris.\nThat was the cheeky message conveyed by the mask. Identities concealed, schoolgirls could tease men naughtily without a blush, without even saying a word or making a gesture. What innocent, or wicked, erotic power they would feel! Clitoris power. Maybe the packaging of other masks had different speech in the bubbles. Or maybe not. Or maybe yes.\nQuickly Yukio googled non-manga non-anime News on his phone.\nHe saw a picture, taken through a window, of a classroom in which all the girls were wearing identical Keiko masks to the consternation of the teacher. He saw a picture of a playground where a dozen Keikos of different heights were strolling. A craze had hit the whole of Japan, probably spreading among schoolgirls everywhere by txt!\nBecause of trousers, he noticed some boys too, who were also wearing Keiko masks. Ah, the boys were doing that so as to save face!\nHe asked the Keiko who still lingered by the machine, “Keiko, did you do this without consulting me? To prove that you’re clever too?” What a perfect ecological loop, that the same machines which sold the used virgin underwear of schoolgirls should provide the same schoolgirls with these masks . . .\nBut of course she wasn’t the real Keiko, and besides she had no intention of speaking.\nHow could Keiko have organised the rapid manufacture of all the masks and their supply to vending machines? Yukio ripped open the packaging and unfolded the latex mask. On the back of the chin, to his horror he saw: â„¢ Nippon Real-Doll Corp.\nHad he fallen asleep at work without realizing and talked in his sleep? Had he been too clever for himself? Had part of him exploited himself schizophrenically out of company loyalty? Or had the company security-psychologist decided that Yukio was behaving oddly, and investigated his computer?\nOh foolish Yukio, to have copyrighted the label with Keiko’s image in his own name at work, borrowing the company’s copyright software—that was how they had found out!\nBut then the company perceived a unique business opportunity: the Real-Doll Corporation could turn real schoolgirls everywhere into clitoris-power dolls of his Keiko! A million texting schoolgirls could spread a craze within a few days, or maybe a few hours. And Yukio couldn’t complain or sue, nor could Keiko. For one thing, Yukio had committed industrial theft. But, even more worryingly, the Real-Doll Corporation’s psychologist-detective may have also found out the true source of Genuine Cloned Ama Clitoris Sashimi.\nYukio bowed to the false Keiko, then hurried home.\n“Who are you?” he said to Keiko in the four-mat room. Quickly he explained what he had discovered—Keiko had been too busy labeling in the rented garage that day to watch any news. And he added: “You must wear a mask from now on, or else I won’t know you!”\n“Do you mean wear my diving mask?”\n“More like a mask of Kate Winslet, I think . . . No, wait!”\nThe big oval of latex cut from the Keiko mask fitted the diving mask perfectly. Superglue secured it. Her false eyes, false nose, and false mouth squeezed flatly against the inside of the glass, as if she had dived to a depth of such pressure that her features had become two-dimensional. Her photoshopped clitoris forever would touch her flat lips.\nSince the false genuine face which she wore a few centimeters in front of her real face was in fact her true face, this negated that falsity and bestowed a mysterious and mystical authenticity upon her actual face, even though that was now invisible, as mystical things often are.\nA Zen-like state came over Yukio. He knelt before Keiko, like Pinocchio praying to the Blue Fairy to make him real. By not-seeing what he was seeing, Yukio began to worship her countenance.\nUnseeing too, a blind goddess, Keiko heard his mantra of worship.\n“My Beloved, My Beloved, My Beloved . . . ”\nWhale clitoris sashimi was only an illusion, from which Yukio was now freed by enlightenment. Probably its sublime taste was also an illusion caused by exorbitant price. He would eat Keiko’s clitoris instead.\nIan Watson started writing science fiction in Japan in the late 1960s, where he was supposed to be a lecturer but his university was on strike for 2 1/2 years. Many novels and story collections later, his most recent are respectively Mockymen (Golden Gryphon, 2003, and Immanion Press, 2004) and The Butterflies of Memory (PS Publishing, 2006), which isn't a sequel to The Flies of Memory (Gollancz, 1990). His previous collection, The Great Escape (from Golden Gryphon) was a Washington Post \"Book of the Year.\" Throughout 1990 he worked eyeball to eyeball with Stanley Kubrick on A.I. Artificial Intelligence, subsequently directed by Steven Spielberg, for which Ian has screen credit for Screen Story. His first collection of poetry, The Lexicographer’s Love Song, appeared in 2001 from DNA Publications, and he has won a Rhysling Award for his SF poetry. He and Roberto Quaglia began collaborating 3 years ago, resulting in a now complete book of linked stories, The Beloved of My Beloved, of which the \"Moby Clitoris\" is one, currently seeking an English language publisher, it already found a Japanese one. Ian lives in a tiny English village midway between Oxford and Stratford with his black cat Poppy, and his web site with fun photos, run by Roberto, is at www.ianwatson.info. He and his Spanish translator and Hungarian publisher maintain a web-site (www.ajeno.intelmedia.co.uk) to spread greater awareness of the unknown Colombian poet Miguel Ajeno.\nRoberto Quaglia hails from Genoa in Italy, where he ran a bar for years, won prizes for photography, and became one of the few Surrealist city councillors in the world. Currently he lives much of the year in Bucharest because he learned to speak Romanian, though he may also live in Moldova where people also speak Romanian. Robert Sheckley enthusiastically prefaced Roberto's surreal satirical SF double-novel Bread, Butter and Paradoxine (published in English by Delos international). He continues to take thousands of photographs. Genoa is the city of Christopher Columbus, who perhaps discovered America, and now America discovers Roberto Quaglia, which they can also do in \"The Penis of My Beloved\" in Claude Lalumier & Elise Moser's anthology Lust for Life. Roberto cruises the motorways of Europe in a white Mercedes with no wing mirrors so that he will always see into the future. His recent collection of essays, also from Delos, Pensiero stocastico (Probabilistic Thought), considers such matters as \"The Advantages of Human Clonation,\" \"The Miracle of the Multiplication of Loaves and Fishes and Porn Photos on the Internet,\" and \"The Myth of Diana, the Death of the Sad Princess.\" He has also written the remarkable Jonathan Livingshit Pigeon, much better than a seagull.", "source": "https://clarkesworldmagazine.com/watson_11_06/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Moby Clitoris of His Beloved by Ian Watson and Roberto Quaglia"}