{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Endria Isa Richardson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "FIoT46+m7dwp5dxXq9drmFO/Uf8=", "id": null, "license": null, "comments": "", "raw_text": "6360 words, short story  The Field Tiger  They held Memorial fifty-six at midday in August, while the sun beat like a hammer in the hard, pale sky. The mourners stood. They had removed the broad-brimmed hats, which might have offered relief, out of respect. Sweat dripped from the uncovered foreheads, into the stoic, animal eyes. The dust-covered bandanas, wrapped around the face to protect the lungs from irritation in the long, dry fields, darkened, grew oppressive with sweat. To a committee member, the dark rags would suggest hands, clamped over the nose and mouth.  But the masks allowed messages to travel between mourners. Beneath the merciless palm of the sun, Raz’s uncovered head pounded. Beneath the floral cloth, his lips parted. He paused, throat parched; coughed a short, dry, bark. The flat plain stretched to every side of him, tilted as though to tip him into the porcelain sky. He pressed his knuckles to his eyes; the vertigo faded.  “We have endured—” he searched for a word to fit the shape the feeling took in his mind, “opulent cruelty. Devastating enough in a single instance to burn the humanity from a worker’s soul. Against us, meted out again and again and again!”  “Melodrama,” replied Mer. Her lips pushed against the silty bandana, she licked them, continued. “That is the real opium of the masses, Raz. Be sensible.”  “A memorial is no place for sense. It is a place for passion and clarity.” The small mic that hooked over his left ear measured the minute vibrations of facial muscle and bone precisely enough to capture and transmit the disgust with which Raz thought. It was possible because of Terra, the messaging technology they all used. Mer remained silent, weary of their disagreement. Raz clenched his jaw, static sizzled through his earpiece. The sun beat, beat anew, beat continuously. The man standing in front of the trench said words, more words. Raz tried to think other words. Many came to him; he didn’t want any of them. And then, abruptly, none. A feeling and an image: the image was of a metal ladle dipping into a basin of water; the feeling was clarity. Then only did the right words come. “They force us to stand, mourn, burn in this desperate heat. It is beyond reason,” he said. He shut his eyes briefly to the sun. “Madness,” he confirmed, “and it must be overthrown by madness.”  Surveillance drones spun overhead, recorded silent, passive mourners.  Committee on the Oversight of Memorialization had not considered the intensity of the sun at high noon at all.  “What time should we schedule—” Davidson scrolled through a line of numbers “—Memorial fifty-six?” Davidson looked up at the circle of faces around him. For a moment, they hovered, blurrily bodiless. He blinked twice and they re-pixelated.  “I’d like it to end early. Well before evening traffic,” a woman with pressed hair said. The heads in the room chuckled at her eye roll. “Shopping and dining decreased seven percent the evening of Memorial twenty-seven.”  “One of the neighborhoods from last week—” Davidson blinked to another tab on his screen, “sent in a formal request that mourners be directed to a different course home.”  “They didn’t go through the upper?” Robertson asked, his voice transmitted from the office down the hall from Davidson’s, as well as over the holo-mic.  “They did,” Davidson affirmed. The heads in the room chuckled again. In the brief pause that followed, Davidson watched a seagull floating past the corner of his eye. The south-facing window in Davidson’s corner office overlooked the river, a gray-green mottle beneath a layer of full, fat clouds. Maybe it will rain, Davidson thought. He heard somewhere—inside of his head, deeper, more central to him than his earpiece—the precise articulation of raindrops on a tin roof; the roof sat, slanted; his mother’s face appeared, halfway framed by jumbled branches, blurry; he blinked to clear her image and—he snapped his attention back to the meeting, embarrassed.  “Well?” the pressed woman asked, peering at Davidson. It seemed that she had asked a question, to everyone or to Davidson, and he had missed it. He waited for her to repeat herself. After a moment she said, “you will agree that enforcement is necessary this time?”  “Let’s make it noon,” said Willis, before Davidson could answer. “Won’t disturb the important morning hours for reflection, over well before evening relaxation. No need for enforcement if we move the whole thing to the outers. There’s more space there. Let’s see them complain about that.”  “Oh they’ll complain,” Davidson retorted. He felt bitter, was embarrassed by it. Still, the response lingered somatically—a hand pressed against a door that’s swung closed—was it sadness? A sense of injustice? A desire for the time and care he spent organizing these memorials to be recognized by those bandana-wearing, dust-covered, dirty—he stopped himself. No use thinking that. Some people weren’t considerate, weren’t built that way.  A knock came at Davidson’s door and a face peered into his office. Davidson waved the secretary in. She carried bags of the takeout he’d ordered for lunch: juicy, butter-basted “steak,” sweet roasted potatoes, a small salad of tender new greens.  Davidson adjourned the meeting, switched off his holo-mic, logged out of Terra. He gazed upon the spread before him and was content.  *Minor updates to DAVIDS.MEM1 *Add img *Fix link *Remove cruft *Remove cruft   -  <img src=\"mem.tinroof/childhood/rain.png\" pxls=640>   +  <img src=\"mem.tinroof/childhood/rain/mother.png\" pxls=800> **MEM1 is a project from the [MOMAPS] that reconstitutes images synthesized by human1 brains and adds them to a master HUMAN image directory. Raz dropped a beetle larva into the treated linen pouch tied around his waist. He was a third of the way through the row; there were eight rows in this field. Seven fields to cover before break. Rising into view at the end of his row, like a rough brown bear, was the northernmost patrol tower. Its wooden legs five feet high—not high enough—supported a narrow platform. A tin roof, which shielded the sun but also reflected the heat on whoever was standing beneath it, propped over the patroller. Raz raised a hand toward the patrol, saw a hand raise in return. Beyond the tower, the outer swamp stretched flat, stale, hard. It should have been mud.  “Morning,” said Mer. He shrugged, and she pulled the bandana down from her mouth. “Good morning,” she said again. “New guest today.”  He hooked his earpiece over his ear, mouthed the password. The cohosts of The Uprising, overlapping, mid-debate:  “—ology is available. Look at the gardens in the uppers, I’m talking seven, ten, and thirteen especially, to see—”  “—mostly pet projects. Their roses, their carrots, their what-have-you, turning them to compost once they’ve rotted. I heard this woman say, ‘you don’t actually eat the stuff that comes from the ground do you?’ These jackholes, sorry, don’t even realize what most of us eat is not grown in a lab—”  They both laughed. A pause, and a third voice, soft, assured—a mid voice, office voice, Raz thought—began.  “The tech is here,” it said. Crumbs of laughter from the hosts, clean silence as they muted their mics. The voice continued. “Government could replace all workers with robotic units in two years.”  One of the cohosts cut in with the old challenges—even if the tech existed it wasn’t scalable; bots would crush the pests where human workers were trained to humanely relocate them; ag was the biggest employer in Mid Region, there would be an unemployment crisis. He was flat-voiced, that attempt at casual superiority lowers got.  “No,” cocky midder inflection, “scaling and training units is a one-time cost, manageable. And West Region has tested a guaranteed wage model for five years. While there were some drops in productivity measures the first two years, they’ve risen substantially since then. The numbers just aren’t made available. Especially these numbers. Across all fields and outers, there is a thirty percent loss in labor every ninety days. Though it is estimated that the robots would have a significantly lower fail-rate, fifteen to seventeen percent, the replacement cost would still be prohibitive. The current replacement cost is, in terms of dollars, free.”  There was a click, a hum, the sound of the hosts’ mics switched on but capturing nothing. A well of static that Raz, anyone listening, could topple into. He had been stooping, inspecting, picking, moving, while he listened. Now, he paused the podcast, stopped. Straightened his back. Knowledge known was less dizzying than knowledge stated.  So, there was reason. But reason assembled from instructions utterly alien, utterly strange. A brain that could apprehend those instructions would need to itself be alien and strange, so distorted by its own weird and internal organization (he wondered whether such brains looked, or were materially different, from his; different grooves, different folds) that it could take in the garbled demands of those instructions and churn them, sausage-like, into some legible product. And not itself be broken in the process. Not a brain he would recognize as human. But then, he was not the arbiter. He felt a strange loneliness, an aloneness. He saw that other workers, in other rows, had stopped working. They were each alone, in confrontation with madness.  A drone buzzed over his head, dipped low, sent a neat needle of pain through his crown. Other drones across the field swooped to other workers. His drone emitted its disciplinary bleat, switched frequency midway, and began to emit the blaring, continuous alarm sound. The sound sang over the field, raising the heads that had still been bent. He felt the word first, the muscles behind his ears tightening—not mechanical, a somatic response—until it coalesced in his mind and became, “ATTACK.” The horizon convulsed. Raz squinted. The tower, shuddering, then falling. Several thickly muscled and clawed bodies coalesced from the convulsion. Raz noticed, in the eternal moment before his mind kicked back into gear, the melt of sun onto the nearest tiger’s brindled side, its fur rippling across its ribs, the bright candy splash of the patroller’s blood on dirt. And then the pounding of feet fleeing shook his attention free, and Raz ran in a jagged pattern across the field, covering the back of his head without thinking. The drills made flight nearly automatic, almost robotic.  Raz sat groggy from pain meds in the hospital bed, starched sheets and felt blanket bunched at his waist. His fingers? They moved when he thought about them. He hovered them above clean gauze. Three carved lines segmented the meat of his forearm beneath. River, shallow tributaries. He had tumbled, ground-sky-ground, Mer’s face and her hair, her hand, blast from a gun, and he was, at last, dragged from the fields not by unfriendly teeth, claws, but fingers, palms. He blinked past headlines. Past “Fields claim new victims.” Past “Exotic tigers or domestic terrorists?” Past “Public mourning or public nuisance?” Blinked twice to open “Paleo brownie balls: with sunflower butter.”  *Updates to RASHAD.MEM3 *Find terms   -  search/''-Rashad.x@v3      with:           Rashad.index: 'Trauma'           Rashad.index: 'Tiger'           Rashad.index: 'Fear'           Rashad.index: 'Choices'   -  name: Install dependencies \r\n      run: |        sudo apt update **!MEM3 (beta) is a project from the [MOMAPS Team] that asks: Can we use human1 generated search indices to accelerate brain-mapping in order to predict human3 behavior? It had not rained in three months. But the committee was not meeting about the rain.  “Why do they insist on calling them ‘tigers’?” The woman was mid-lament when Davidson clicked on to the meeting. He was a few minutes late, as he hadn’t been feeling well that morning. “It foments unnecessary panic. It’s not accurate. Accuracy is important. They are not, biologically or anatomically, tigers. They are more like large cats.” The woman, Hendricks, finished without acknowledging the abrupt presence of Davidson’s head.  “Well, they are large,” offered Willis. Davidson pressed his fingers to his forehead. “Something wrong, Davidson? You’re late.”  “I’m—” Davidson began, but was cut off.  “Now,” said the other woman, whose name was Rivera, and who had been appointed to replace Davidson as chair last week. Robertson had been taken off the committee entirely.  Rivera continued, “Hendricks is right, though her reasoning is too simple. We all know that the so-called ‘field tigers’ are not any such thing. They are of the canid family; their closest relative is the fox. Whereas an adult male tiger can weigh up to six hundred pounds, the average adult female ‘field tiger’ weighs no more than two hundred pounds. An overfed Saint Bernard.  “The laborers’ use of the term ‘field tiger’ is propaganda. Their insistence of the existence of the ‘field tiger’ is propaganda. The narrative that they are subject to consistent, deadly, wild animal attacks and will no longer risk their lives on the field is propaganda. The reality is that no one has seen these attacks take place. The ‘tigers’ are conveniently impossible to photograph with overhead drones—the dust cover in the fields is too thick and conveniently difficult to track. A specimen has not been captured alive in over forty years. As to their contemporary existence? We have only the hopelessly self-serving accounts of the field-workers.”  “The workers are in the fields. Where the tigers also are. Would be,” Davidson interjected.  “And yet the propagandistic narrative gains traction, playing the hell out of guilty upper heartstrings,” Rivera spoke over him. “But let me state for the record: I do not believe that this risk exists anywhere outside of the slosh-holes that pass for brains in these entitled sacks of stringy meat. The barbarians are probably murdering each other.”  “But I have seen—” Davidson cut in, immediately unsure of whether he had placed the correct emphasis on the correct word. “I have seen,” he tried again.  “Surely, that support is contained to the lowers—” interrupted Willis at the same time.  And, “slosh-holes! Meat-bags!” said Hendricks.  “Middle neighborhoods seven and eight also trend toward support. And here is Hendricks’ point,” Rivera continued, ignoring Davidson entirely. “Accuracy. In the hours after last week’s long-form article, ‘Havoc in Crops Threatens Starvation for Tens of Thousands,’ support for the workers dipped substantially. These are the numbers we must get in front of the media. Furthermore, our official term for these animals will henceforward be ‘house cats.’”  There was appreciative laughter, and Rivera smiled. Davidson heard the clink of cutlery picked up by the holo-mic as she paused to take a bite of what looked like salmon.  A blob of aioli squirted from Davidson’s avocado, tomato, and sprouts sandwich and landed on his desk. He flicked it up with a finger, which he licked clean with satisfaction and without self-consciousness. He still could not tolerate wasting food. Suddenly, the full tenor of the protestors’ incompetence struck him. The wheat—bland and nowhere near as nutritious as synth crops—fed thousands. What wasn’t exported was distributed at subsidized prices to the outer and lower food markets; the remainder rationed into food allotments. It had been the staple of his own childhood.  Without rapid and immense government intervention, the lowers would starve, plain and simple. It was clear that they had no real appreciation for the coordination and organization it took to feed an entire region; they were counting on the higher-ups to wave a magic wand and take care of them. Well, Rivera was right about the laziness.  But might there be desperation, too? Perhaps they were being driven by the whip of fear, panic? Fear, once recognized, could be managed. Davidson’s bones barely jostled at the memory of teeth, claws; the tough desperate leanness of the tiger’s body thrashing bitterly against his own (was it his own anymore? That body surely belonged in every sense to a different time, different place, different consciousness). He remembered now only vaguely one hand stretched out against an impossible vision, a sort of dull ache, then nothing.  “Fifty-six were killed in one day last quarter in a house cat attack,” Davidson upped the volume on his holo-mic so that he would be heard. “What we might be observing is the demographic’s inability to emotionally absorb the risk levels. I suggest that we coordinate a series of somatic trainings—”  “No,” said Rivera flatly. “Let me assure you. The protestors’ party line, ‘people over profit,’is effective. It is effective because it is a one-dimensional arrow. Do not let it pierce you. These people do not know us, the real people behind the straw men they erect. They do not want to know you, Davidson, your journey from field-worker to the youngest official elected in Mid Region in a century. They do not care about the complexities or realities of our lives or our jobs. These are not humans we are dealing with, capable of rational negotiation. If there is a beast in the fields,” the last crumb from Rivera’s meal dangled from her bottom lip, “it is the worker.”  Davidson brushed at his own lip. “The transcript you shared with us, from,” he scrolled to the top of the document, “uh, The Uprising, shows that they know the total mortality rate is well above one thousand for the year—”  “How do you think they get those numbers,” Rivera spoke curtly. Davidson flinched.  Willis jumped into the pause. “As to the numbers,” they said, “obviously there is a leak.”  “A leak?” Davidson asked, incredulous.  “Willis is right, Davidson,” said Rivera. “And we have reason to believe that the leak is you.”  The Terra message blinked its pale green alert in Sara’s display. “One sec,” she tapped as Davidson emerged from his office. “Hi. Did you need anything?” she asked. Her voice was soft, but confident.  “No,” he said. Davidson looked odd. His pupils were two drifting orbs, black and glassy. They dulled when he turned his face toward her and out from under the fluorescent rods. And stilled when he met her eyes. “Yes. Coffee,” he said. “From the fancier place? The one with the good milk? Not the other one, the one you usually go to.”  “Regular?” she asked, standing, holding out a hand. “I’ll need your chip, mine’s glitchy.”  “Decaf? And some green juice from the little stand. The kind without any fruit,” he said, pausing to face her. His eyes were drifting again.  “OK.”  “Last time there was pineapple. Too much sugar.” He tapped his wrist sensor and continued out of the single glass door, down the narrow white hall.  On her side of the glass door, down the hallway to her right, Sara could hear Robertson shouting. He’d been intolerable since being axed from OM. She rolled her eyes.  “Meet at The Oak Tree in ten,” she messaged.  Update HOUSE TIGERS file 114 TIGERS @@ -1,2 +1,7 @@   +  # This is the list of 'HOUSE TIGERS'   +  #   +  Add 'Sara Jorgenson' NOTE This does not necessarily list everyone who has    +  been in contact with the 'TIGERS' organization, as in some cases, they may not    +  have communicated over TERRA. This list may also include individuals who are    +  not TIGERS See revision history in source control.  Sara stood inside the café with her arms crossed, legs crossed, tapped the rubber outside of one sneaker against the other quietly, irregularly. She watched Raz through the clean window without attempting to appear as though she wasn’t. His broad hat sedimented with dark-brown sweat; his skin streaked with light-brown dust. Outside, Raz coughed into his crooked elbow, apologized as Sara approached. She placed the coffee cup and juice bottle on a small iron table. He leaned toward her—she leaned back without knowing she was leaning back. He pressed a small plastic packet into her right hand, which was curled loosely at her side. Her arm jerked again, away from the hard, prodding fingers. She nearly fumbled the packet; didn’t; shoved it into her jeans.  “That goes in the coffee,” he said.  “Here,” she spoke, filling the space of her embarrassment with brusqueness. “Davidson’s bank chip. He is going to miss it. His wife already gives him so much shit about not just having it implanted.”  “You’re sure we can use this?” Raz asked. His gaze was direct, honest, Sara thought. Something beneath his right eye twitched.  “No, I can’t guarantee it. But there is a chance. A good chance, especially if you try quickly.”  Raz studied the small metal chip, rubbed his thumb against its edge. He turned abruptly and walked, head down, in the direction from which he had come. The street was shady and pleasant, like most upper streets. It was rich in colors from flowers and fabric squares decorated with foreign characters that flew from the wide front stoops of the large houses, that waved as though in greeting. But the gates were closed to Raz, to Sara even, and to everyone, even closed to the people who had their keys, for the greeting promised by the prayer flags was an idea of welcome only. The reality in these houses was of cold indifference, of closed eyes and ears, shuttered to anything that happened outside, on the streets, between people who, being outside, mattered not at all.  Davidson didn’t rise from the desk when Sara returned. He nodded to the cabinet. “You can leave them there.” An oval of sweat darkened his shirt.  “You OK, Kie?” she asked. “You honestly don’t look great.”  “Fine. Tired,” Davidson replied. He turned away slightly and refocused his eyes on his screen. She closed the door and returned to her desk. Her top drawer was ajar, the cup she’d placed on her papers inches from where she had left it.  Davidson dropped into his chair and sipped from one of the cups Sara had brought him. The coffee was hot, sweet, left a bitter film at the back of his throat. The almond harvests were shot. He’d lose money in that stock. That was the price of investing based on values. The river below him streaked through the city like a fish, reflecting the harsh, white light of the late September sun on its scales.  He was angry at himself for having let Rivera get to him. Of course he had not found anything in Sara’s desk. The sky was a white, hot bowl above him. What was that godforsaken beeping? Could Sara shut it off? The river was streaking by him like a silver train, and he counted the cars as they passed. One, four, seventeen. He would get off in Petaluma. He would bring her a bouquet of greens; he could stop by the synth lab on the way. When was the last time he had been home? She would be so pleased. No, Petaluma was in West Region, he couldn’t be there already. That was hours and hours away. And his mother was dead. Hot liquid was seeping from his desk onto his shirt. There were fast popping noises that sounded like rain on a tin roof. Perhaps it was raining after all. He opened his mouth and waited to catch the drops on his tongue.  @@-13,9 +13,8 @@ MNG:   -  name: Install dependencies      run: |           sudo apt update           sudo apt-get update           sudo apt-get -y install build-essential philosoph2-dev           sudo apt-get -y install build-essential litera3-dev           sudo apt-get -y install build-essential religion2-dev   -  name: Test with DAVIDS.MNG      run: DAVIDS.MNG **MNG is a research project launched in collaboration with the HUMAN project to build a master directory of HUMAN events using significant events experienced by humans1 in order to define what it “means” to be HUMAN “What’s the update on Kie Davidson?”  “His wrist sensor alerted the medics. He could still pull through.”  “And we know for sure it was the—” three faint blinking dots “—field tigers?”  “Right. The secretary. She’s what they call a ‘house tiger.’ Disrupts from the inside.”  “Poisoned her own boss. Those animals.”  “They certainly are. She got the poison from a worker named Raz. What kind of bubblegum name is that?”  “Likely short for Rashad. Common lower name. Means righteous.”  “These melodramatic brutes. There’s one more thing.”  “What?”  “There is a small but nonzero chance that Davidson was a willing collaborator. Passing info along elsewhere. Charts show he was under a great deal of stress even before the poisoning.”  “Really. You think that’s possible?”  “It’s possible, even plausible. He was a diversity hire.”  “I see. So. Pull the plug?”  “Affirmative.”  “The rest is still on track?”  “Yep. We will get great coverage from this.”  “This is exactly the kind of communication we need.”  Rivera and Hendricks logged off their private message channel simultaneously. After logging off, they deleted the apps from their hardware.  *Minor updates to DAVIDS *Minor updates to .MNG *Minor updates to .MEM1 *Remove cruft *Remove cruft   -  <'DAVIDS.x' from .MNG>   -  <'DAVIDS.x' from .MEM1>   -  <'human1' from ' DAVIDS.x'>   +  <'human3' to ' DAVIDS.x'> “Kie is dead.” Raz watched the three blinking dots appear and disappear in the upper left field of his vision, waited for Sara’s reply.  “How.”  “ . . . ” Raz typed the ellipsis, deleted it, typed it again, and sent the message. A long wait. Then, a notification that the user was not available when he closed and reopened the chat to make sure it was not glitching. When the pale blue notification popped up in his vision, nearly an hour had passed.  “He wasn’t supposed to.”  “He wasn’t.” In Raz’s mind, there was a short space between subject and predicate, into which he might have put something—truth, gesture, sound. He tapped out “Sorry,” thought to send it, then tensed his ocular muscles, deleted the word letter by letter. He did not know what he felt. It wasn’t sorrow. Dull bolts—fear, surprise, nausea—thudded against some impenetrable wall inside of him, lay where they fell, inert. A governance system that treats any life as disposable must be taught that all lives are thus disposable. Madness met with madness. The words were stark, black against the clean white wash of his inner vision. This was the message to OM: logical, legible, rational. But still something, elsewhere, inner, trembled. Raz sent an outstretched hand inward, tried to reach at the something just behind the wall, failed, let the hand fall weakly.  “You told me he would not die. You said he would get sick.”  “I did.” Raz wiped a hand over his forehead, squeezed his left eye, shutting off the messaging app. He unhooked the mic from his left ear and let it fall next to him. Abruptly unfolded his body from where he had tucked himself, back against brick, knees to chin. A jolt through his body, once straight, surprised him. He looked down, jolted again his left leg into the ground, found himself twisting his left boot against the asphalt as though to unscrew a cap embedded in the concrete. His T-shirt bunched beneath his armpits. He pulled at the hem with sweaty fingers. Shadows played in the crushed metallic powder of the earpiece. He walked into the late afternoon sun. The high alley walls around him pulled the sunlight into a narrow stream that washed his head now that he had risen; washed the curled black hairs gray, washed the dulled skin white.  *Updates to RASHAD.MEM3 *Find terms   -  search/''-Rashad.x@v3      with:           Rashad.index: 'Trauma'           Rashad.index: 'Murder'           Rashad.index: 'Fear'           Rashad.index: 'Choices'   -  name: Install dependencies      run: |        sudo apt update ERROR Mer handled the tiny metal chip, totally smooth on each side. She ran her thumb along a pattern of grooves on one centimeter edge. She closed her eyes and wanted to sink into somewhere dark, and deeply piled, and velvet, but Raz’s voice jerked her out. Always Raz jerking her out of her peace. This time, the jerk of his actions too violent, too spasmodic to simply—ignore.  “Bank chip.”  Mer’s eyebrows came together, she brought the chip right up to her eyes, squinted. “Whose.”  Raz looked away, that was too frightening, looked again at her. His fingertips brushed his upper thighs. A word moved against his teeth; he swallowed it. He opened his mouth again, wanted to dispel the word. Instead, he wrapped one hand around the upper flesh of his arm and squeezed. Wanted to squeeze his fingers around his entire body, squeeze all of the air and blood to stillness.  “Raz—” Mer was insistent. As though she was naming him, Raz, the owner of the chip. Naming him, Raz, the name of the dead man. Could he be? His name slid, scrabbled for purchase, slid again, could have tumbled into deadness along with the other name.  “Davidson,” he managed to say it.  Raised eyebrows, widened eyes from Mer. “Dead. You?”  “Unh,” the strangled word, it rose halfway out on a tide of bile. He turned sideways and spit. She hadn’t known. He had, in a way, killed him again, by replacing the live Davidson—who had, until recently, still lived in her mind; whose live habitat was, as the minutes passed, shrinking intolerably—with the dead Davidson who, as the minutes passed, was claiming an infinitely large territory.  “They’ll hang you.”  There was a part of Raz’s mind—the forward part—that knew there were clear and calm responses to what was happening. Yes, they could hang him. Yes, he had thought of that. Yes, he had options—could flee, could hide, could and likely would take the known route to West Region. Others had done it. He knew others who had done it. A part of his mind ticked calmly along this channel. He swallowed again, fought himself, lost. He vomited.  Mer watched his heaving back. This Raz, this angry one whose anger had been a tight fist at his core, holding him together, had pulled too quickly at one finger, then two, then three, and was now loosely heaving before her. Behind her tiredness, there was pain, grief; she already missed him. But it was behind the tiredness, and the tiredness was, mercifully, soft.  “The data is interesting Hendricks.”  “Matches on predicted behavior and actual behavior continue to hover between point zero five and point twenty-seven percent. No way of knowing if this is high, or low, or what.”  “An interesting example with Meredith. Terra matched her communication against the indices MOMAPS generated as being most relevant to the situation she is in. Based on the matches it found, and run against the rational predictors of human3 behavior, it predicted that she would either be disgusted or sympathetic.”  “She was neither.”  “No. She has apparently found a third option.”  “The top research institutes created these algorithms. They are objective, neutral, science-based. There must be something wrong with the subjects.”  “Agreed.”  Rivera and Hendricks logged off.  “Thanks for meeting.”  “I was surprised you asked.”  Steph Robertson looked at the coffee in his cup turning from glistening black to gold as he moved it beneath the hot fluorescent rods that streaked above their small table. He hoped this wouldn’t take long. “It’s about Kie.”  “I assumed.” Sara spun her cup on the table. It was white porcelain, chipped on the rim near the handle. It was cheap, like everything in this neighborhood. She had asked to meet in her neighborhood, middle seven. Better than the lowers, better by far than the outers, but she missed the nicely patterned ceramic mugs in the café by the office. “He wasn’t bad, as bosses go. But I went through his bank statements. He was getting paid every month by a corporation called ‘Mother Maps.’ A substantial amount. We couldn’t find anything about this company online. But I remembered the name from somewhere. You’d emailed him about Mother Maps right before you were kicked off the committee.”  “You know this how?”  “I hacked into Kie’s emails.”  “Obviously.”  “There’s no such thing as data security. Don’t tell me you didn’t know that.”  “I know that better than anyone. Besides Kie and Rivera. Maybe Hendricks now. I’m not sure.”  “So what’s Mother Maps? And why did you want to meet with me?”  Steph sighed. “A conscience, maybe. Look, I know you’re with the, uh, ‘house cats.’ Just tell me one thing. What do you think you’re working toward?”  “A decent living wage for everybody. No more laborers dying of tiger attacks. Health care without having to risk your life for it.” Sara stopped as Steph began to laugh. She frowned. “What?” she said. “Oh, I see. You’re a spoiled upper brat who never glances at the restaurant bill, who snaps his fingers and—”  “Look,” said Steph. “Spare me. You’re right. I’ve never been poor. But this is not the issue.”  “Spoken like a classic piece of upper shit.”  “It’s not the issue,” Steph said, speaking over her, “because Mid Region could get bots in the fields tomorrow, if they wanted to.”  Sara stopped. “What are you talking about, Robertson?”  “A living wage for everybody, with health insurance by next quarter. And they will do just that. As soon as they get what they want out of this strike.”  “No,” Sara shook her head. “That’s absurd. It would cost too much. We know all of this. The replacement bots—look, I’ve reported on this.” She stopped herself. “Why don’t you just go ahead and explain what I’m sure you’re going to explain regardless of what I say.”  Robertson squinted at her like he couldn’t decide whether she was putting him on. “OK,” he said. Palms lifted from the table, pressed down again. “Assuming you really don’t know. I was asked to leave the committee—you know that much—because Kie and I had been trying to find out more about Mother Maps. I found out. I wanted to go public with the information. They—Mother Maps—paid me. I decided that I didn’t want to go public anymore. I didn’t tell Kie what I found out. He stayed on the committee.”  “This sounds like a bad movie. So then what happened?”  “What if I told you that the actual issue that OM wants to distract people from is not food scarcity, and not human rights? It’s Terra. All those invoices from Mother Maps? Terra’s parent company. It’s part of a global mind-mapping initiative. But not just predicting human behavior. Mother Maps wants to come up with a definitive answer about what it means to be human.”  “What does that have to do with the workers? The strike?”  “It’s beta testing. How accurately can their algorithms predict how workers will respond to certain—stressful—conditions? OM won’t give the strikers what they want until Mother Maps gets what it wants.” Robertson looked at Sara with something like pity. “You really thought this was about OM not wanting their bots in the field? A few million dollars in budget? This is about reaching a new frontier in our understanding of existence.” Steph’s eyes widened, and he smiled for the first time that day. “Think about it. We’re finally going to know what makes us human.”  Hendricks and Rivera met the following week, in person, eyes blinking as they adjusted to the flat, stiff sunlight that whited the quiet upper neighborhood where they walked. Whited the flags at the entryways, whited the doors, whited the welcome mats, whited the whimsical trims that made the neighborhood beautiful. In the late evening sun—all white, all the same.  “Robertson passed the information to Sara, then?”  “He did.”  “And she behaved as expected? ‘Emotional outburst’?”  “She was ‘somewhat’ but not ‘very’ surprised. She thanked Robertson.”  “And then?”  “She tracked down Raz.”  “‘Flight,’ ‘avoidance of reality,’ or ‘violent confrontation’ was predicted.”  “She tried to understand him. Asked him questions. Not just ‘how’ but ‘why.’”  “Did we code his responses?”  “No. They didn’t match any of the terms in any of our indices. They were irrelevant.”  “I see. And then?”  “She removed her earpiece after that.”  “So we don’t know where she is?”  “There are possibilities. The algorithm said that there was a point twenty-seven percent likelihood that Raz could kill Sara; a point seventeen percent likelihood that Sara could kill Raz; a point seventy-nine percent likelihood they would touch physically (type of touch unspecified); a point eighty-nine percent likelihood that they would each act in a manner not predicted by the algorithm.’”  “But it’s possible that he killed her.”  “It is possible.”  “As long as it’s possible, the algorithm is not incorrect.”  “And . . . the others?”  “As far as we know? Killed them. Dragged them to the outers. Ate their flesh. Buried their bones. The algorithm said there was a nonzero probability of that happening.”  “Ah. Because, otherwise—”  Rivera and Hendricks had walked the length of the upper, and stood at the edge of the neighborhood, looking out onto the hard, empty expanse of the fields that stretched beyond them. The sky was thickening from flat white to a deeper blue. There were no striking workers. There were no tigers. There was nothing.  “Otherwise where the fuck is everyone.”       .cache/      build/   +  Rashad/data.addMNG   +  Meredith/data.addMNG   +  SJorgenson/data.addMNG ERROR [**MNG Maker**](/MNG/models/mng_maker): MNG Maker is a system for compiling discrete data into a comprehensive meaning generator using an LSTM combined with a BDEN, an architecture called an EFF-BDEN. To add files to MNG Maker use ext .addMNG. Data must be HUMAN data-type compatible (i.e. human1) Rashad/data.MEM3—> DECEASED_1765/data.MEM3 File renamed without changes Meredith/data.MEM3—> DECEASED_1766/data.MEM3 File renamed without changes SJorgenson/data.MEM2—> DECEASED_1767/data.MEM2 File renamed without changes *** A committee member would see nothing.  But the twilight had allowed messages to pass between the people. The masks were the messages: roses were “run, now.” Yellow daffodils were “east.” Wisteria was “stop, turn counterclockwise, continue.” The sun had spread then sank into the horizon. Dark now. A thick, covering black. Beneath the sheltering palm of darkness, Raz’s head brushed the lacy hems of leaves, spiderwebs, nests. Branches snapped against his face, against other faces. They were making their way west. Raz heard the crack of a rifle to his left, again to his right, again. A shout. He froze, turned. Around him, the others turned. Their movements were smooth, stalking, powerful. They waited. Until almost as one, toward the deadly animals, their lean bodies rippled, sprang. Endria Richardson is a queer Black and Malay person taking her time and writing stories about ghosts, race, rocks, and the prison industrial system. She holds a JD from Stanford, but is doing her best to retire from lawyering. You can find her wonder-ing among the redwoods on Ohlone land in Oakland, California, and you can find more of her work at FIYAH, Anathema, and forthcoming in Fireside Magazine.", "text": "6360 words, short story\nThe Field Tiger\nThey held Memorial fifty-six at midday in August, while the sun beat like a hammer in the hard, pale sky. The mourners stood. They had removed the broad-brimmed hats, which might have offered relief, out of respect. Sweat dripped from the uncovered foreheads, into the stoic, animal eyes. The dust-covered bandanas, wrapped around the face to protect the lungs from irritation in the long, dry fields, darkened, grew oppressive with sweat. To a committee member, the dark rags would suggest hands, clamped over the nose and mouth.\nBut the masks allowed messages to travel between mourners. Beneath the merciless palm of the sun, Raz’s uncovered head pounded. Beneath the floral cloth, his lips parted. He paused, throat parched; coughed a short, dry, bark. The flat plain stretched to every side of him, tilted as though to tip him into the porcelain sky. He pressed his knuckles to his eyes; the vertigo faded.\n“We have endured—” he searched for a word to fit the shape the feeling took in his mind, “opulent cruelty. Devastating enough in a single instance to burn the humanity from a worker’s soul. Against us, meted out again and again and again!”\n“Melodrama,” replied Mer. Her lips pushed against the silty bandana, she licked them, continued. “That is the real opium of the masses, Raz. Be sensible.”\n“A memorial is no place for sense. It is a place for passion and clarity.” The small mic that hooked over his left ear measured the minute vibrations of facial muscle and bone precisely enough to capture and transmit the disgust with which Raz thought. It was possible because of Terra, the messaging technology they all used. Mer remained silent, weary of their disagreement. Raz clenched his jaw, static sizzled through his earpiece. The sun beat, beat anew, beat continuously. The man standing in front of the trench said words, more words. Raz tried to think other words. Many came to him; he didn’t want any of them. And then, abruptly, none. A feeling and an image: the image was of a metal ladle dipping into a basin of water; the feeling was clarity. Then only did the right words come. “They force us to stand, mourn, burn in this desperate heat. It is beyond reason,” he said. He shut his eyes briefly to the sun. “Madness,” he confirmed, “and it must be overthrown by madness.”\nSurveillance drones spun overhead, recorded silent, passive mourners.\nCommittee on the Oversight of Memorialization had not considered the intensity of the sun at high noon at all.\n“What time should we schedule—” Davidson scrolled through a line of numbers “—Memorial fifty-six?” Davidson looked up at the circle of faces around him. For a moment, they hovered, blurrily bodiless. He blinked twice and they re-pixelated.\n“I’d like it to end early. Well before evening traffic,” a woman with pressed hair said. The heads in the room chuckled at her eye roll. “Shopping and dining decreased seven percent the evening of Memorial twenty-seven.”\n“One of the neighborhoods from last week—” Davidson blinked to another tab on his screen, “sent in a formal request that mourners be directed to a different course home.”\n“They didn’t go through the upper?” Robertson asked, his voice transmitted from the office down the hall from Davidson’s, as well as over the holo-mic.\n“They did,” Davidson affirmed. The heads in the room chuckled again. In the brief pause that followed, Davidson watched a seagull floating past the corner of his eye. The south-facing window in Davidson’s corner office overlooked the river, a gray-green mottle beneath a layer of full, fat clouds. Maybe it will rain, Davidson thought. He heard somewhere—inside of his head, deeper, more central to him than his earpiece—the precise articulation of raindrops on a tin roof; the roof sat, slanted; his mother’s face appeared, halfway framed by jumbled branches, blurry; he blinked to clear her image and—he snapped his attention back to the meeting, embarrassed.\n“Well?” the pressed woman asked, peering at Davidson. It seemed that she had asked a question, to everyone or to Davidson, and he had missed it. He waited for her to repeat herself. After a moment she said, “you will agree that enforcement is necessary this time?”\n“Let’s make it noon,” said Willis, before Davidson could answer. “Won’t disturb the important morning hours for reflection, over well before evening relaxation. No need for enforcement if we move the whole thing to the outers. There’s more space there. Let’s see them complain about that.”\n“Oh they’ll complain,” Davidson retorted. He felt bitter, was embarrassed by it. Still, the response lingered somatically—a hand pressed against a door that’s swung closed—was it sadness? A sense of injustice? A desire for the time and care he spent organizing these memorials to be recognized by those bandana-wearing, dust-covered, dirty—he stopped himself. No use thinking that. Some people weren’t considerate, weren’t built that way.\nA knock came at Davidson’s door and a face peered into his office. Davidson waved the secretary in. She carried bags of the takeout he’d ordered for lunch: juicy, butter-basted “steak,” sweet roasted potatoes, a small salad of tender new greens.\nDavidson adjourned the meeting, switched off his holo-mic, logged out of Terra. He gazed upon the spread before him and was content.\n*Minor updates to DAVIDS.MEM1\n*Add img\n*Fix link\n*Remove cruft\n*Remove cruft\n- <img src=\"mem.tinroof/childhood/rain.png\" pxls=640>\n+ <img src=\"mem.tinroof/childhood/rain/mother.png\" pxls=800>\n**MEM1 is a project from the [MOMAPS] that reconstitutes images synthesized by human1 brains and adds them to a master HUMAN image directory.\nRaz dropped a beetle larva into the treated linen pouch tied around his waist. He was a third of the way through the row; there were eight rows in this field. Seven fields to cover before break. Rising into view at the end of his row, like a rough brown bear, was the northernmost patrol tower. Its wooden legs five feet high—not high enough—supported a narrow platform. A tin roof, which shielded the sun but also reflected the heat on whoever was standing beneath it, propped over the patroller. Raz raised a hand toward the patrol, saw a hand raise in return. Beyond the tower, the outer swamp stretched flat, stale, hard. It should have been mud.\n“Morning,” said Mer. He shrugged, and she pulled the bandana down from her mouth. “Good morning,” she said again. “New guest today.”\nHe hooked his earpiece over his ear, mouthed the password. The cohosts of The Uprising, overlapping, mid-debate:\n“—ology is available. Look at the gardens in the uppers, I’m talking seven, ten, and thirteen especially, to see—”\n“—mostly pet projects. Their roses, their carrots, their what-have-you, turning them to compost once they’ve rotted. I heard this woman say, ‘you don’t actually eat the stuff that comes from the ground do you?’ These jackholes, sorry, don’t even realize what most of us eat is not grown in a lab—”\nThey both laughed. A pause, and a third voice, soft, assured—a mid voice, office voice, Raz thought—began.\n“The tech is here,” it said. Crumbs of laughter from the hosts, clean silence as they muted their mics. The voice continued. “Government could replace all workers with robotic units in two years.”\nOne of the cohosts cut in with the old challenges—even if the tech existed it wasn’t scalable; bots would crush the pests where human workers were trained to humanely relocate them; ag was the biggest employer in Mid Region, there would be an unemployment crisis. He was flat-voiced, that attempt at casual superiority lowers got.\n“No,” cocky midder inflection, “scaling and training units is a one-time cost, manageable. And West Region has tested a guaranteed wage model for five years. While there were some drops in productivity measures the first two years, they’ve risen substantially since then. The numbers just aren’t made available. Especially these numbers. Across all fields and outers, there is a thirty percent loss in labor every ninety days. Though it is estimated that the robots would have a significantly lower fail-rate, fifteen to seventeen percent, the replacement cost would still be prohibitive. The current replacement cost is, in terms of dollars, free.”\nThere was a click, a hum, the sound of the hosts’ mics switched on but capturing nothing. A well of static that Raz, anyone listening, could topple into. He had been stooping, inspecting, picking, moving, while he listened. Now, he paused the podcast, stopped. Straightened his back. Knowledge known was less dizzying than knowledge stated.\nSo, there was reason. But reason assembled from instructions utterly alien, utterly strange. A brain that could apprehend those instructions would need to itself be alien and strange, so distorted by its own weird and internal organization (he wondered whether such brains looked, or were materially different, from his; different grooves, different folds) that it could take in the garbled demands of those instructions and churn them, sausage-like, into some legible product. And not itself be broken in the process. Not a brain he would recognize as human. But then, he was not the arbiter. He felt a strange loneliness, an aloneness. He saw that other workers, in other rows, had stopped working. They were each alone, in confrontation with madness.\nA drone buzzed over his head, dipped low, sent a neat needle of pain through his crown. Other drones across the field swooped to other workers. His drone emitted its disciplinary bleat, switched frequency midway, and began to emit the blaring, continuous alarm sound. The sound sang over the field, raising the heads that had still been bent. He felt the word first, the muscles behind his ears tightening—not mechanical, a somatic response—until it coalesced in his mind and became, “ATTACK.” The horizon convulsed. Raz squinted. The tower, shuddering, then falling. Several thickly muscled and clawed bodies coalesced from the convulsion. Raz noticed, in the eternal moment before his mind kicked back into gear, the melt of sun onto the nearest tiger’s brindled side, its fur rippling across its ribs, the bright candy splash of the patroller’s blood on dirt. And then the pounding of feet fleeing shook his attention free, and Raz ran in a jagged pattern across the field, covering the back of his head without thinking. The drills made flight nearly automatic, almost robotic.\nRaz sat groggy from pain meds in the hospital bed, starched sheets and felt blanket bunched at his waist. His fingers? They moved when he thought about them. He hovered them above clean gauze. Three carved lines segmented the meat of his forearm beneath. River, shallow tributaries. He had tumbled, ground-sky-ground, Mer’s face and her hair, her hand, blast from a gun, and he was, at last, dragged from the fields not by unfriendly teeth, claws, but fingers, palms. He blinked past headlines. Past “Fields claim new victims.” Past “Exotic tigers or domestic terrorists?” Past “Public mourning or public nuisance?” Blinked twice to open “Paleo brownie balls: with sunflower butter.”\n*Updates to RASHAD.MEM3\n*Find terms\n- search/''-Rashad.x@v3\nwith:\nRashad.index: 'Trauma'\nRashad.index: 'Tiger'\nRashad.index: 'Fear'\nRashad.index: 'Choices'\n- name: Install dependencies\nrun: |\nsudo apt update\n**!MEM3 (beta) is a project from the [MOMAPS Team] that asks: Can we use human1 generated search indices to accelerate brain-mapping in order to predict human3 behavior?\nIt had not rained in three months. But the committee was not meeting about the rain.\n“Why do they insist on calling them ‘tigers’?” The woman was mid-lament when Davidson clicked on to the meeting. He was a few minutes late, as he hadn’t been feeling well that morning. “It foments unnecessary panic. It’s not accurate. Accuracy is important. They are not, biologically or anatomically, tigers. They are more like large cats.” The woman, Hendricks, finished without acknowledging the abrupt presence of Davidson’s head.\n“Well, they are large,” offered Willis. Davidson pressed his fingers to his forehead. “Something wrong, Davidson? You’re late.”\n“I’m—” Davidson began, but was cut off.\n“Now,” said the other woman, whose name was Rivera, and who had been appointed to replace Davidson as chair last week. Robertson had been taken off the committee entirely.\nRivera continued, “Hendricks is right, though her reasoning is too simple. We all know that the so-called ‘field tigers’ are not any such thing. They are of the canid family; their closest relative is the fox. Whereas an adult male tiger can weigh up to six hundred pounds, the average adult female ‘field tiger’ weighs no more than two hundred pounds. An overfed Saint Bernard.\n“The laborers’ use of the term ‘field tiger’ is propaganda. Their insistence of the existence of the ‘field tiger’ is propaganda. The narrative that they are subject to consistent, deadly, wild animal attacks and will no longer risk their lives on the field is propaganda. The reality is that no one has seen these attacks take place. The ‘tigers’ are conveniently impossible to photograph with overhead drones—the dust cover in the fields is too thick and conveniently difficult to track. A specimen has not been captured alive in over forty years. As to their contemporary existence? We have only the hopelessly self-serving accounts of the field-workers.”\n“The workers are in the fields. Where the tigers also are. Would be,” Davidson interjected.\n“And yet the propagandistic narrative gains traction, playing the hell out of guilty upper heartstrings,” Rivera spoke over him. “But let me state for the record: I do not believe that this risk exists anywhere outside of the slosh-holes that pass for brains in these entitled sacks of stringy meat. The barbarians are probably murdering each other.”\n“But I have seen—” Davidson cut in, immediately unsure of whether he had placed the correct emphasis on the correct word. “I have seen,” he tried again.\n“Surely, that support is contained to the lowers—” interrupted Willis at the same time.\nAnd, “slosh-holes! Meat-bags!” said Hendricks.\n“Middle neighborhoods seven and eight also trend toward support. And here is Hendricks’ point,” Rivera continued, ignoring Davidson entirely. “Accuracy. In the hours after last week’s long-form article, ‘Havoc in Crops Threatens Starvation for Tens of Thousands,’ support for the workers dipped substantially. These are the numbers we must get in front of the media. Furthermore, our official term for these animals will henceforward be ‘house cats.’”\nThere was appreciative laughter, and Rivera smiled. Davidson heard the clink of cutlery picked up by the holo-mic as she paused to take a bite of what looked like salmon.\nA blob of aioli squirted from Davidson’s avocado, tomato, and sprouts sandwich and landed on his desk. He flicked it up with a finger, which he licked clean with satisfaction and without self-consciousness. He still could not tolerate wasting food. Suddenly, the full tenor of the protestors’ incompetence struck him. The wheat—bland and nowhere near as nutritious as synth crops—fed thousands. What wasn’t exported was distributed at subsidized prices to the outer and lower food markets; the remainder rationed into food allotments. It had been the staple of his own childhood.\nWithout rapid and immense government intervention, the lowers would starve, plain and simple. It was clear that they had no real appreciation for the coordination and organization it took to feed an entire region; they were counting on the higher-ups to wave a magic wand and take care of them. Well, Rivera was right about the laziness.\nBut might there be desperation, too? Perhaps they were being driven by the whip of fear, panic? Fear, once recognized, could be managed. Davidson’s bones barely jostled at the memory of teeth, claws; the tough desperate leanness of the tiger’s body thrashing bitterly against his own (was it his own anymore? That body surely belonged in every sense to a different time, different place, different consciousness). He remembered now only vaguely one hand stretched out against an impossible vision, a sort of dull ache, then nothing.\n“Fifty-six were killed in one day last quarter in a house cat attack,” Davidson upped the volume on his holo-mic so that he would be heard. “What we might be observing is the demographic’s inability to emotionally absorb the risk levels. I suggest that we coordinate a series of somatic trainings—”\n“No,” said Rivera flatly. “Let me assure you. The protestors’ party line, ‘people over profit,’is effective. It is effective because it is a one-dimensional arrow. Do not let it pierce you. These people do not know us, the real people behind the straw men they erect. They do not want to know you, Davidson, your journey from field-worker to the youngest official elected in Mid Region in a century. They do not care about the complexities or realities of our lives or our jobs. These are not humans we are dealing with, capable of rational negotiation. If there is a beast in the fields,” the last crumb from Rivera’s meal dangled from her bottom lip, “it is the worker.”\nDavidson brushed at his own lip. “The transcript you shared with us, from,” he scrolled to the top of the document, “uh, The Uprising, shows that they know the total mortality rate is well above one thousand for the year—”\n“How do you think they get those numbers,” Rivera spoke curtly. Davidson flinched.\nWillis jumped into the pause. “As to the numbers,” they said, “obviously there is a leak.”\n“A leak?” Davidson asked, incredulous.\n“Willis is right, Davidson,” said Rivera. “And we have reason to believe that the leak is you.”\nThe Terra message blinked its pale green alert in Sara’s display. “One sec,” she tapped as Davidson emerged from his office. “Hi. Did you need anything?” she asked. Her voice was soft, but confident.\n“No,” he said. Davidson looked odd. His pupils were two drifting orbs, black and glassy. They dulled when he turned his face toward her and out from under the fluorescent rods. And stilled when he met her eyes. “Yes. Coffee,” he said. “From the fancier place? The one with the good milk? Not the other one, the one you usually go to.”\n“Regular?” she asked, standing, holding out a hand. “I’ll need your chip, mine’s glitchy.”\n“Decaf? And some green juice from the little stand. The kind without any fruit,” he said, pausing to face her. His eyes were drifting again.\n“OK.”\n“Last time there was pineapple. Too much sugar.” He tapped his wrist sensor and continued out of the single glass door, down the narrow white hall.\nOn her side of the glass door, down the hallway to her right, Sara could hear Robertson shouting. He’d been intolerable since being axed from OM. She rolled her eyes.\n“Meet at The Oak Tree in ten,” she messaged.\nUpdate HOUSE TIGERS file\n114 TIGERS\n@@ -1,2 +1,7 @@\n+ # This is the list of 'HOUSE TIGERS'\n+ #\n+ Add 'Sara Jorgenson' NOTE This does not necessarily list everyone who has\n+ been in contact with the 'TIGERS' organization, as in some cases, they may not\n+ have communicated over TERRA. This list may also include individuals who are\n+ not TIGERS See revision history in source control.\nSara stood inside the café with her arms crossed, legs crossed, tapped the rubber outside of one sneaker against the other quietly, irregularly. She watched Raz through the clean window without attempting to appear as though she wasn’t. His broad hat sedimented with dark-brown sweat; his skin streaked with light-brown dust. Outside, Raz coughed into his crooked elbow, apologized as Sara approached. She placed the coffee cup and juice bottle on a small iron table. He leaned toward her—she leaned back without knowing she was leaning back. He pressed a small plastic packet into her right hand, which was curled loosely at her side. Her arm jerked again, away from the hard, prodding fingers. She nearly fumbled the packet; didn’t; shoved it into her jeans.\n“That goes in the coffee,” he said.\n“Here,” she spoke, filling the space of her embarrassment with brusqueness. “Davidson’s bank chip. He is going to miss it. His wife already gives him so much shit about not just having it implanted.”\n“You’re sure we can use this?” Raz asked. His gaze was direct, honest, Sara thought. Something beneath his right eye twitched.\n“No, I can’t guarantee it. But there is a chance. A good chance, especially if you try quickly.”\nRaz studied the small metal chip, rubbed his thumb against its edge. He turned abruptly and walked, head down, in the direction from which he had come. The street was shady and pleasant, like most upper streets. It was rich in colors from flowers and fabric squares decorated with foreign characters that flew from the wide front stoops of the large houses, that waved as though in greeting. But the gates were closed to Raz, to Sara even, and to everyone, even closed to the people who had their keys, for the greeting promised by the prayer flags was an idea of welcome only. The reality in these houses was of cold indifference, of closed eyes and ears, shuttered to anything that happened outside, on the streets, between people who, being outside, mattered not at all.\nDavidson didn’t rise from the desk when Sara returned. He nodded to the cabinet. “You can leave them there.” An oval of sweat darkened his shirt.\n“You OK, Kie?” she asked. “You honestly don’t look great.”\n“Fine. Tired,” Davidson replied. He turned away slightly and refocused his eyes on his screen. She closed the door and returned to her desk. Her top drawer was ajar, the cup she’d placed on her papers inches from where she had left it.\nDavidson dropped into his chair and sipped from one of the cups Sara had brought him. The coffee was hot, sweet, left a bitter film at the back of his throat. The almond harvests were shot. He’d lose money in that stock. That was the price of investing based on values. The river below him streaked through the city like a fish, reflecting the harsh, white light of the late September sun on its scales.\nHe was angry at himself for having let Rivera get to him. Of course he had not found anything in Sara’s desk. The sky was a white, hot bowl above him. What was that godforsaken beeping? Could Sara shut it off? The river was streaking by him like a silver train, and he counted the cars as they passed. One, four, seventeen. He would get off in Petaluma. He would bring her a bouquet of greens; he could stop by the synth lab on the way. When was the last time he had been home? She would be so pleased. No, Petaluma was in West Region, he couldn’t be there already. That was hours and hours away. And his mother was dead. Hot liquid was seeping from his desk onto his shirt. There were fast popping noises that sounded like rain on a tin roof. Perhaps it was raining after all. He opened his mouth and waited to catch the drops on his tongue.\n@@-13,9 +13,8 @@ MNG:\n- name: Install dependencies\nrun: |\nsudo apt update\nsudo apt-get update\nsudo apt-get -y install build-essential philosoph2-dev\nsudo apt-get -y install build-essential litera3-dev\nsudo apt-get -y install build-essential religion2-dev\n- name: Test with DAVIDS.MNG\nrun: DAVIDS.MNG\n**MNG is a research project launched in collaboration with the HUMAN project to build a master directory of HUMAN events using significant events experienced by humans1 in order to define what it “means” to be HUMAN\n“What’s the update on Kie Davidson?”\n“His wrist sensor alerted the medics. He could still pull through.”\n“And we know for sure it was the—” three faint blinking dots “—field tigers?”\n“Right. The secretary. She’s what they call a ‘house tiger.’ Disrupts from the inside.”\n“Poisoned her own boss. Those animals.”\n“They certainly are. She got the poison from a worker named Raz. What kind of bubblegum name is that?”\n“Likely short for Rashad. Common lower name. Means righteous.”\n“These melodramatic brutes. There’s one more thing.”\n“What?”\n“There is a small but nonzero chance that Davidson was a willing collaborator. Passing info along elsewhere. Charts show he was under a great deal of stress even before the poisoning.”\n“Really. You think that’s possible?”\n“It’s possible, even plausible. He was a diversity hire.”\n“I see. So. Pull the plug?”\n“Affirmative.”\n“The rest is still on track?”\n“Yep. We will get great coverage from this.”\n“This is exactly the kind of communication we need.”\nRivera and Hendricks logged off their private message channel simultaneously. After logging off, they deleted the apps from their hardware.\n*Minor updates to DAVIDS\n*Minor updates to .MNG\n*Minor updates to .MEM1\n*Remove cruft\n*Remove cruft\n- <'DAVIDS.x' from .MNG>\n- <'DAVIDS.x' from .MEM1>\n- <'human1' from '\nDAVIDS.x'>\n+ <'human3' to '\nDAVIDS.x'>\n“Kie is dead.” Raz watched the three blinking dots appear and disappear in the upper left field of his vision, waited for Sara’s reply.\n“How.”\n“ . . . ” Raz typed the ellipsis, deleted it, typed it again, and sent the message. A long wait. Then, a notification that the user was not available when he closed and reopened the chat to make sure it was not glitching. When the pale blue notification popped up in his vision, nearly an hour had passed.\n“He wasn’t supposed to.”\n“He wasn’t.” In Raz’s mind, there was a short space between subject and predicate, into which he might have put something—truth, gesture, sound. He tapped out “Sorry,” thought to send it, then tensed his ocular muscles, deleted the word letter by letter. He did not know what he felt. It wasn’t sorrow. Dull bolts—fear, surprise, nausea—thudded against some impenetrable wall inside of him, lay where they fell, inert. A governance system that treats any life as disposable must be taught that all lives are thus disposable. Madness met with madness. The words were stark, black against the clean white wash of his inner vision. This was the message to OM: logical, legible, rational. But still something, elsewhere, inner, trembled. Raz sent an outstretched hand inward, tried to reach at the something just behind the wall, failed, let the hand fall weakly.\n“You told me he would not die. You said he would get sick.”\n“I did.” Raz wiped a hand over his forehead, squeezed his left eye, shutting off the messaging app. He unhooked the mic from his left ear and let it fall next to him. Abruptly unfolded his body from where he had tucked himself, back against brick, knees to chin. A jolt through his body, once straight, surprised him. He looked down, jolted again his left leg into the ground, found himself twisting his left boot against the asphalt as though to unscrew a cap embedded in the concrete. His T-shirt bunched beneath his armpits. He pulled at the hem with sweaty fingers. Shadows played in the crushed metallic powder of the earpiece. He walked into the late afternoon sun. The high alley walls around him pulled the sunlight into a narrow stream that washed his head now that he had risen; washed the curled black hairs gray, washed the dulled skin white.\n*Updates to RASHAD.MEM3\n*Find terms\n- search/''-Rashad.x@v3\nwith:\nRashad.index: 'Trauma'\nRashad.index: 'Murder'\nRashad.index: 'Fear'\nRashad.index: 'Choices'\n- name: Install dependencies\nrun: |\nsudo apt update\nERROR\nMer handled the tiny metal chip, totally smooth on each side. She ran her thumb along a pattern of grooves on one centimeter edge. She closed her eyes and wanted to sink into somewhere dark, and deeply piled, and velvet, but Raz’s voice jerked her out. Always Raz jerking her out of her peace. This time, the jerk of his actions too violent, too spasmodic to simply—ignore.\n“Bank chip.”\nMer’s eyebrows came together, she brought the chip right up to her eyes, squinted. “Whose.”\nRaz looked away, that was too frightening, looked again at her. His fingertips brushed his upper thighs. A word moved against his teeth; he swallowed it. He opened his mouth again, wanted to dispel the word. Instead, he wrapped one hand around the upper flesh of his arm and squeezed. Wanted to squeeze his fingers around his entire body, squeeze all of the air and blood to stillness.\n“Raz—” Mer was insistent. As though she was naming him, Raz, the owner of the chip. Naming him, Raz, the name of the dead man. Could he be? His name slid, scrabbled for purchase, slid again, could have tumbled into deadness along with the other name.\n“Davidson,” he managed to say it.\nRaised eyebrows, widened eyes from Mer. “Dead. You?”\n“Unh,” the strangled word, it rose halfway out on a tide of bile. He turned sideways and spit. She hadn’t known. He had, in a way, killed him again, by replacing the live Davidson—who had, until recently, still lived in her mind; whose live habitat was, as the minutes passed, shrinking intolerably—with the dead Davidson who, as the minutes passed, was claiming an infinitely large territory.\n“They’ll hang you.”\nThere was a part of Raz’s mind—the forward part—that knew there were clear and calm responses to what was happening. Yes, they could hang him. Yes, he had thought of that. Yes, he had options—could flee, could hide, could and likely would take the known route to West Region. Others had done it. He knew others who had done it. A part of his mind ticked calmly along this channel. He swallowed again, fought himself, lost. He vomited.\nMer watched his heaving back. This Raz, this angry one whose anger had been a tight fist at his core, holding him together, had pulled too quickly at one finger, then two, then three, and was now loosely heaving before her. Behind her tiredness, there was pain, grief; she already missed him. But it was behind the tiredness, and the tiredness was, mercifully, soft.\n“The data is interesting Hendricks.”\n“Matches on predicted behavior and actual behavior continue to hover between point zero five and point twenty-seven percent. No way of knowing if this is high, or low, or what.”\n“An interesting example with Meredith. Terra matched her communication against the indices MOMAPS generated as being most relevant to the situation she is in. Based on the matches it found, and run against the rational predictors of human3 behavior, it predicted that she would either be disgusted or sympathetic.”\n“She was neither.”\n“No. She has apparently found a third option.”\n“The top research institutes created these algorithms. They are objective, neutral, science-based. There must be something wrong with the subjects.”\n“Agreed.”\nRivera and Hendricks logged off.\n“Thanks for meeting.”\n“I was surprised you asked.”\nSteph Robertson looked at the coffee in his cup turning from glistening black to gold as he moved it beneath the hot fluorescent rods that streaked above their small table. He hoped this wouldn’t take long. “It’s about Kie.”\n“I assumed.” Sara spun her cup on the table. It was white porcelain, chipped on the rim near the handle. It was cheap, like everything in this neighborhood. She had asked to meet in her neighborhood, middle seven. Better than the lowers, better by far than the outers, but she missed the nicely patterned ceramic mugs in the café by the office. “He wasn’t bad, as bosses go. But I went through his bank statements. He was getting paid every month by a corporation called ‘Mother Maps.’ A substantial amount. We couldn’t find anything about this company online. But I remembered the name from somewhere. You’d emailed him about Mother Maps right before you were kicked off the committee.”\n“You know this how?”\n“I hacked into Kie’s emails.”\n“Obviously.”\n“There’s no such thing as data security. Don’t tell me you didn’t know that.”\n“I know that better than anyone. Besides Kie and Rivera. Maybe Hendricks now. I’m not sure.”\n“So what’s Mother Maps? And why did you want to meet with me?”\nSteph sighed. “A conscience, maybe. Look, I know you’re with the, uh, ‘house cats.’ Just tell me one thing. What do you think you’re working toward?”\n“A decent living wage for everybody. No more laborers dying of tiger attacks. Health care without having to risk your life for it.” Sara stopped as Steph began to laugh. She frowned. “What?” she said. “Oh, I see. You’re a spoiled upper brat who never glances at the restaurant bill, who snaps his fingers and—”\n“Look,” said Steph. “Spare me. You’re right. I’ve never been poor. But this is not the issue.”\n“Spoken like a classic piece of upper shit.”\n“It’s not the issue,” Steph said, speaking over her, “because Mid Region could get bots in the fields tomorrow, if they wanted to.”\nSara stopped. “What are you talking about, Robertson?”\n“A living wage for everybody, with health insurance by next quarter. And they will do just that. As soon as they get what they want out of this strike.”\n“No,” Sara shook her head. “That’s absurd. It would cost too much. We know all of this. The replacement bots—look, I’ve reported on this.” She stopped herself. “Why don’t you just go ahead and explain what I’m sure you’re going to explain regardless of what I say.”\nRobertson squinted at her like he couldn’t decide whether she was putting him on. “OK,” he said. Palms lifted from the table, pressed down again. “Assuming you really don’t know. I was asked to leave the committee—you know that much—because Kie and I had been trying to find out more about Mother Maps. I found out. I wanted to go public with the information. They—Mother Maps—paid me. I decided that I didn’t want to go public anymore. I didn’t tell Kie what I found out. He stayed on the committee.”\n“This sounds like a bad movie. So then what happened?”\n“What if I told you that the actual issue that OM wants to distract people from is not food scarcity, and not human rights? It’s Terra. All those invoices from Mother Maps? Terra’s parent company. It’s part of a global mind-mapping initiative. But not just predicting human behavior. Mother Maps wants to come up with a definitive answer about what it means to be human.”\n“What does that have to do with the workers? The strike?”\n“It’s beta testing. How accurately can their algorithms predict how workers will respond to certain—stressful—conditions? OM won’t give the strikers what they want until Mother Maps gets what it wants.” Robertson looked at Sara with something like pity. “You really thought this was about OM not wanting their bots in the field? A few million dollars in budget? This is about reaching a new frontier in our understanding of existence.” Steph’s eyes widened, and he smiled for the first time that day. “Think about it. We’re finally going to know what makes us human.”\nHendricks and Rivera met the following week, in person, eyes blinking as they adjusted to the flat, stiff sunlight that whited the quiet upper neighborhood where they walked. Whited the flags at the entryways, whited the doors, whited the welcome mats, whited the whimsical trims that made the neighborhood beautiful. In the late evening sun—all white, all the same.\n“Robertson passed the information to Sara, then?”\n“He did.”\n“And she behaved as expected? ‘Emotional outburst’?”\n“She was ‘somewhat’ but not ‘very’ surprised. She thanked Robertson.”\n“And then?”\n“She tracked down Raz.”\n“‘Flight,’ ‘avoidance of reality,’ or ‘violent confrontation’ was predicted.”\n“She tried to understand him. Asked him questions. Not just ‘how’ but ‘why.’”\n“Did we code his responses?”\n“No. They didn’t match any of the terms in any of our indices. They were irrelevant.”\n“I see. And then?”\n“She removed her earpiece after that.”\n“So we don’t know where she is?”\n“There are possibilities. The algorithm said that there was a point twenty-seven percent likelihood that Raz could kill Sara; a point seventeen percent likelihood that Sara could kill Raz; a point seventy-nine percent likelihood they would touch physically (type of touch unspecified); a point eighty-nine percent likelihood that they would each act in a manner not predicted by the algorithm.’”\n“But it’s possible that he killed her.”\n“It is possible.”\n“As long as it’s possible, the algorithm is not incorrect.”\n“And . . . the others?”\n“As far as we know? Killed them. Dragged them to the outers. Ate their flesh. Buried their bones. The algorithm said there was a nonzero probability of that happening.”\n“Ah. Because, otherwise—”\nRivera and Hendricks had walked the length of the upper, and stood at the edge of the neighborhood, looking out onto the hard, empty expanse of the fields that stretched beyond them. The sky was thickening from flat white to a deeper blue. There were no striking workers. There were no tigers. There was nothing.\n“Otherwise where the fuck is everyone.”\n.cache/\nbuild/\n+ Rashad/data.addMNG\n+ Meredith/data.addMNG\n+ SJorgenson/data.addMNG\nERROR\n[**MNG Maker**](/MNG/models/mng_maker): MNG Maker is a system for compiling discrete data into a comprehensive meaning generator using an LSTM combined with a BDEN, an architecture called an EFF-BDEN. To add files to MNG Maker use ext .addMNG. Data must be HUMAN data-type compatible (i.e. human1)\nRashad/data.MEM3—> DECEASED_1765/data.MEM3\nFile renamed without changes\nMeredith/data.MEM3—> DECEASED_1766/data.MEM3\nFile renamed without changes\nSJorgenson/data.MEM2—> DECEASED_1767/data.MEM2\nFile renamed without changes\n***\nA committee member would see nothing.\nBut the twilight had allowed messages to pass between the people. The masks were the messages: roses were “run, now.” Yellow daffodils were “east.” Wisteria was “stop, turn counterclockwise, continue.” The sun had spread then sank into the horizon. Dark now. A thick, covering black. Beneath the sheltering palm of darkness, Raz’s head brushed the lacy hems of leaves, spiderwebs, nests. Branches snapped against his face, against other faces. They were making their way west. Raz heard the crack of a rifle to his left, again to his right, again. A shout. He froze, turned. Around him, the others turned. Their movements were smooth, stalking, powerful. They waited. Until almost as one, toward the deadly animals, their lean bodies rippled, sprang.\nEndria Richardson is a queer Black and Malay person taking her time and writing stories about ghosts, race, rocks, and the prison industrial system. She holds a JD from Stanford, but is doing her best to retire from lawyering. You can find her wonder-ing among the redwoods on Ohlone land in Oakland, California, and you can find more of her work at FIYAH, Anathema, and forthcoming in Fireside Magazine.", "source": "https://clarkesworldmagazine.com/richardson_04_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Field Tiger by Endria Isa Richardson"}