{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2018-02-06", "categories": "", "tags": "", "fingerprint": "I1UaMtxE9av4w0JA8VVPDV7BZiU=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Clever Plants, Generations, and Translations: A Conversation with Sue Burke  It’s inevitable that we’ll take to the stars to spread humanity beyond the confines of our blue and green orb. With new discoveries every month, planets not unlike our own are becoming more common. Unable to look closer, we can only speculate as to what we’ll encounter when we finally send a ship deep into the outer reaches of our galaxy to explore our new homes. Science fiction authors have long taken a crack at imagining what we might find. Antlered creatures with advanced sonic technology. Desolate desert planets. Aliens who only want a bit of candy. The ideas are as unique as the authors themselves.  Sue Burke’s novel Semiosis follows the generational development of a society on a faraway planet from their initial landing and far into their future. A group of people journey to a planet called Pax to try and make themselves a new home without repeating humanity’s mistakes. After arriving on Pax, they realize that they may not be the highest intelligence on the planet. The biology around them shifts, moves, and reacts more quickly with more complexity than they could ever have imagined. In order to survive, they have to find their niche in an ecosystem or else perish at the vines of highly intelligent plant-life. Over generations of settlers, we get to experience the alternate evolution of a planet’s ecology and also of a human society. It’s a book about the complexities of biology, ecology, communication, and how people find their way on a new planet.  The author of numerous stories and translations, Sue Burke has also worked as a journalist, editor, and poet. She’s won the 2016 Alicia Gordon Award for Word Artistry in Translation. Her novel Semiosis will be released by Tor Books February 6, 2018.   What was it about your houseplants that first inspired you to write Semiosis?  Years ago in my own living room, I discovered that plants are murderous. A pothos wrapped around a little podocarpus, starved it for light, and killed it. At first, I blamed myself for not noticing earlier and intervening. Soon after that, a monstera deliciosa philodendron tried to sink roots into a nephthytis, so I did some research and learned that plants are vicious. Especially philodendrons. Watch out for them.  The research became an essay I eventually published in a science fiction magazine, which you can read here.  Then in 1996, I attended the Clarion Workshop, and one of the instructors, Gregory Frost, gave us an exercise about a specific kind of wall. I thought: what if there were two camps of vicious plants, and suddenly (by plant standards) a human colony appeared and became the wall between them? And what if these plants could think, at least a little?  Was Ursula K. Le Guin an influence on Semiosis? If so, how?  She wasn’t a direct influence, but you might hear her in the tone of the novel. The characters think deeply and take what they do seriously. I admire that in her work, and that admiration no doubt seeped through into mine.  The state of the Earth in your novel has it in such disrepair that a group of people sought refuge among the stars. Do you think the Earth is beyond repair with everything happening concerning climate change?  I expect some sort of life will continue until the Sun goes nova, at least bacteria. As for humans, we’re resourceful and adaptable—but history tells us we avoid change until we have no choice. I’m sure our species will survive, but I’m not sure how many of us.  Feeding ourselves might become a big problem. I grew up in Wisconsin, and its best farmland was in Waukesha County. Centuries of natural processes are needed to create rich topsoil. That soil now sprouts subdivisions, strip malls, and highways. It’s lost to agriculture for good. When we destroy agricultural land, we’re destroying our own habitat.  The ecology also depends on a wide variety of plants and animals. We’re destroying a lot of them, too, a process exacerbated by climate change. We face rough times ahead, but in the long-term, nature will find a new balance. The drawback is that “long-term” might be very long, we might not find the new balance easy for us.  The steps the refugees take on the new planet Pax are thorough and logical. They figure out how to survive in what is essentially an unknown wilderness. Did you research living off-the-grid or bushcraft while writing this novel?  I’m a city kid who takes occasional trips into the countryside, but I try to pay attention when I do. The research included A Sand County Almanac by Aldo Leopold, and I hiked around Wisconsin seeing the land with his deep love of nature. I also researched how to forage and to practice subsistence agriculture, which is what the Pax colonists aspired to do. I learned that farming requires not just hard work but deep knowledge. On this planet, even with the help and advice of the First Nations, European colonists in the Americas often failed, starved, and died. The colonists on Pax in chapter two are on the brink of failure. For all their planning, they will need outside help to survive.  The biology of Pax is fascinating. Do any of the plants or animals have analogues or inspirations here on earth?  Poop plants are real. A couple of species of Euphorbia, especially decaryi, look like little piles of old dried-up dung during their resting periods. They grow in deserts, where it can be helpful to look unappetizing. Decades ago, I saw that plant in the Mitchell Park Horticultural Conservatory in Milwaukee, mistook it for a pile of poop until I read the label, and vowed to use it somehow in my writing.  Was there a process when you developed the biology of the Glassmakers?  In many ways, they’re ants, especially their scent communication, and like Earth ants, Glassmakers can be kind of stinky. Unlike Earth ants, they don’t chirp. Yes, some ants chirp (stridulate) by rubbing certain parts of their abdomen. I couldn’t work that into the story, alas. Even still, the Glassmakers are noisy.  What was one piece of scientific information you came across while researching this novel that surprised you?  Plants are not merely active, they’re aggressive and impatient. Just watch how fast things sprout and bloom in spring. This aggression and impatience formed the backbone of the story. Plants are slow by our reckoning, but ours is not the only measure in nature.  Do you think climate change will eventually force humans into space?  I’m in favor of going to space and I’m sure we will expand beyond Earth, but I think it will still be necessary to deal with the effects of climate change on Earth. We can’t move even just a billion or so of us off-world. As a species, we’ve never faced a crisis that big, and true to human nature, we won’t act a moment too soon. That moment—“too soon”—has already passed. I’m 62, and at times I think I’m lucky because I won’t live long enough to see exactly how difficult and contentious it’s going to be. Agriculture—to return to that—will have to deal with new rainfall patterns, more extreme weather, aquifer exhaustion, soil exhaustion, monoculture failures, and a growing number of mouths to feed, all at once. We have cursed our future with interesting times.  Do you think the flaws of humans present themselves more readily as a society grows?  History tells us that we can be both intelligent and stupid, but I believe that both intelligence and stupidity can compound themselves. When I was born, fewer than 3 billion people lived on the Earth. Now the population is about 7.6 billion and still climbing. We can be stupid on a much larger scale.  Toward the end of Semiosis, someone says this about the history of Pax: “I could start with what I knew and what I could learn so our story could survive, so we could discover our true selves. Our future would be another discovery—or, if we understood how we had arrived at where we were, it could be a choice.” I think that’s true for Earth, too. We know a lot about ourselves, and we have a choice. Will we choose wisely?  In the book, the settlers have the Constitution of Pax. Is this constitution inspired by any historical government documents here on Earth?  For some of the technical parts of the Constitution, such as quorums, committee operations, and meeting notices, I copied and simplified the constitution of a religious denomination that was kind enough to post it online. For Article II, where the colonists declare their purposes and principles, I let them speak. The original colonists, the Parents, had a dream and a vision that sustained them through adversity—although they could not make it come true. Their descendants and their descendants’ friends and allies made Pax into the community that the Parents had aspired to.  Years and generations go by between the sections in your novel. What made you decide to do this?  Plants are slow. A tree can live for centuries. I needed to give the plants time to react, and after pondering how, I decided to create a roman-fleuve, a kind of novel that flows across several generations (of humans). Then I had to make each generation’s chapter exciting and at the same time progress toward the motivating question of the novel: what can thinking plants do in a crisis?  What are the challenges of writing from the perspective of an intelligent plant?  I only had to think: What do plants want? What does this particular plant want? But, like writing any “other,” you have to understand that other’s life. I did all the research I could, and I’m still learning. The Hidden Life of Trees by Peter Wohlleben tells us about all the hard decisions trees here on Earth have to make—yes, they make life-or-death decisions, and like us, they must make them with incomplete knowledge. Also like us, any given intelligent plant would have its own combination of triumphs and failures, confidence and fear, and abundance and hunger.  Why is Mundos en la Eternidad one of the best space operas you’ve ever read?  Besides an exciting, intricate plot and a well thought-out setting, that novel from Spain features “juggernauts,” which are an enormous interstellar life-form. Investigating them leads to one surprise after another. The novel was written by Juan Miguel Aguilera and Javier Redal, and Redal was trained in biology and medicine. I think his understanding of life sciences made those surprises both perfectly logical and astounding. Incidentally, the juggernauts strongly resemble the interstellar object 1I/2017 U1, also called ’Oumuamua, which is swinging through our solar system right now. Coincidence?  The novel won major awards in Spain and resulted in several spin-offs. It also inspired other writers to create additional works in that universe, which Aguilera and Redal have generously encouraged. Years after I fell in love with Mundos en la Eternidad, I got to translate one of those works, an outstanding novella called “The Texture of Words” by Felicidad Martínez, for the anthology Terra Nova. It explores what the stay-at-home females of one of its spacefaring peoples were doing to survive.  That’s what a great novel can do: inspire both readers and writers.  Having translated numerous books, do you have a favorite Spanish colloquialism?  I lived in Spain for seventeen years, and there they sometimes say, “No tienes abuela.” It means: “You don’t have a grandmother.” It really means: “You blow your own horn.” She’s supposed to do that for you.  What is one piece of advice you’d like to share with aspiring writers?  If you see something remarkable like a poop plant, remember it. Memorable details make for memorable writing.  What other projects do you have in the works?  I’ve written the sequel to Semiosis, and I’m writing the third book now. After that, I plan to move on to another series of novels. I’m also working—as always—on translations and on shorter works. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nClever Plants, Generations, and Translations: A Conversation with Sue Burke\nIt’s inevitable that we’ll take to the stars to spread humanity beyond the confines of our blue and green orb. With new discoveries every month, planets not unlike our own are becoming more common. Unable to look closer, we can only speculate as to what we’ll encounter when we finally send a ship deep into the outer reaches of our galaxy to explore our new homes. Science fiction authors have long taken a crack at imagining what we might find. Antlered creatures with advanced sonic technology. Desolate desert planets. Aliens who only want a bit of candy. The ideas are as unique as the authors themselves.\nSue Burke’s novel Semiosis follows the generational development of a society on a faraway planet from their initial landing and far into their future. A group of people journey to a planet called Pax to try and make themselves a new home without repeating humanity’s mistakes. After arriving on Pax, they realize that they may not be the highest intelligence on the planet. The biology around them shifts, moves, and reacts more quickly with more complexity than they could ever have imagined. In order to survive, they have to find their niche in an ecosystem or else perish at the vines of highly intelligent plant-life. Over generations of settlers, we get to experience the alternate evolution of a planet’s ecology and also of a human society. It’s a book about the complexities of biology, ecology, communication, and how people find their way on a new planet.\nThe author of numerous stories and translations, Sue Burke has also worked as a journalist, editor, and poet. She’s won the 2016 Alicia Gordon Award for Word Artistry in Translation. Her novel Semiosis will be released by Tor Books February 6, 2018.\nWhat was it about your houseplants that first inspired you to write Semiosis?\nYears ago in my own living room, I discovered that plants are murderous. A pothos wrapped around a little podocarpus, starved it for light, and killed it. At first, I blamed myself for not noticing earlier and intervening. Soon after that, a monstera deliciosa philodendron tried to sink roots into a nephthytis, so I did some research and learned that plants are vicious. Especially philodendrons. Watch out for them.\nThe research became an essay I eventually published in a science fiction magazine, which you can read here.\nThen in 1996, I attended the Clarion Workshop, and one of the instructors, Gregory Frost, gave us an exercise about a specific kind of wall. I thought: what if there were two camps of vicious plants, and suddenly (by plant standards) a human colony appeared and became the wall between them? And what if these plants could think, at least a little?\nWas Ursula K. Le Guin an influence on Semiosis? If so, how?\nShe wasn’t a direct influence, but you might hear her in the tone of the novel. The characters think deeply and take what they do seriously. I admire that in her work, and that admiration no doubt seeped through into mine.\nThe state of the Earth in your novel has it in such disrepair that a group of people sought refuge among the stars. Do you think the Earth is beyond repair with everything happening concerning climate change?\nI expect some sort of life will continue until the Sun goes nova, at least bacteria. As for humans, we’re resourceful and adaptable—but history tells us we avoid change until we have no choice. I’m sure our species will survive, but I’m not sure how many of us.\nFeeding ourselves might become a big problem. I grew up in Wisconsin, and its best farmland was in Waukesha County. Centuries of natural processes are needed to create rich topsoil. That soil now sprouts subdivisions, strip malls, and highways. It’s lost to agriculture for good. When we destroy agricultural land, we’re destroying our own habitat.\nThe ecology also depends on a wide variety of plants and animals. We’re destroying a lot of them, too, a process exacerbated by climate change. We face rough times ahead, but in the long-term, nature will find a new balance. The drawback is that “long-term” might be very long, we might not find the new balance easy for us.\nThe steps the refugees take on the new planet Pax are thorough and logical. They figure out how to survive in what is essentially an unknown wilderness. Did you research living off-the-grid or bushcraft while writing this novel?\nI’m a city kid who takes occasional trips into the countryside, but I try to pay attention when I do. The research included A Sand County Almanac by Aldo Leopold, and I hiked around Wisconsin seeing the land with his deep love of nature. I also researched how to forage and to practice subsistence agriculture, which is what the Pax colonists aspired to do. I learned that farming requires not just hard work but deep knowledge. On this planet, even with the help and advice of the First Nations, European colonists in the Americas often failed, starved, and died. The colonists on Pax in chapter two are on the brink of failure. For all their planning, they will need outside help to survive.\nThe biology of Pax is fascinating. Do any of the plants or animals have analogues or inspirations here on earth?\nPoop plants are real. A couple of species of Euphorbia, especially decaryi, look like little piles of old dried-up dung during their resting periods. They grow in deserts, where it can be helpful to look unappetizing. Decades ago, I saw that plant in the Mitchell Park Horticultural Conservatory in Milwaukee, mistook it for a pile of poop until I read the label, and vowed to use it somehow in my writing.\nWas there a process when you developed the biology of the Glassmakers?\nIn many ways, they’re ants, especially their scent communication, and like Earth ants, Glassmakers can be kind of stinky. Unlike Earth ants, they don’t chirp. Yes, some ants chirp (stridulate) by rubbing certain parts of their abdomen. I couldn’t work that into the story, alas. Even still, the Glassmakers are noisy.\nWhat was one piece of scientific information you came across while researching this novel that surprised you?\nPlants are not merely active, they’re aggressive and impatient. Just watch how fast things sprout and bloom in spring. This aggression and impatience formed the backbone of the story. Plants are slow by our reckoning, but ours is not the only measure in nature.\nDo you think climate change will eventually force humans into space?\nI’m in favor of going to space and I’m sure we will expand beyond Earth, but I think it will still be necessary to deal with the effects of climate change on Earth. We can’t move even just a billion or so of us off-world. As a species, we’ve never faced a crisis that big, and true to human nature, we won’t act a moment too soon. That moment—“too soon”—has already passed. I’m 62, and at times I think I’m lucky because I won’t live long enough to see exactly how difficult and contentious it’s going to be. Agriculture—to return to that—will have to deal with new rainfall patterns, more extreme weather, aquifer exhaustion, soil exhaustion, monoculture failures, and a growing number of mouths to feed, all at once. We have cursed our future with interesting times.\nDo you think the flaws of humans present themselves more readily as a society grows?\nHistory tells us that we can be both intelligent and stupid, but I believe that both intelligence and stupidity can compound themselves. When I was born, fewer than 3 billion people lived on the Earth. Now the population is about 7.6 billion and still climbing. We can be stupid on a much larger scale.\nToward the end of Semiosis, someone says this about the history of Pax: “I could start with what I knew and what I could learn so our story could survive, so we could discover our true selves. Our future would be another discovery—or, if we understood how we had arrived at where we were, it could be a choice.” I think that’s true for Earth, too. We know a lot about ourselves, and we have a choice. Will we choose wisely?\nIn the book, the settlers have the Constitution of Pax. Is this constitution inspired by any historical government documents here on Earth?\nFor some of the technical parts of the Constitution, such as quorums, committee operations, and meeting notices, I copied and simplified the constitution of a religious denomination that was kind enough to post it online. For Article II, where the colonists declare their purposes and principles, I let them speak. The original colonists, the Parents, had a dream and a vision that sustained them through adversity—although they could not make it come true. Their descendants and their descendants’ friends and allies made Pax into the community that the Parents had aspired to.\nYears and generations go by between the sections in your novel. What made you decide to do this?\nPlants are slow. A tree can live for centuries. I needed to give the plants time to react, and after pondering how, I decided to create a roman-fleuve, a kind of novel that flows across several generations (of humans). Then I had to make each generation’s chapter exciting and at the same time progress toward the motivating question of the novel: what can thinking plants do in a crisis?\nWhat are the challenges of writing from the perspective of an intelligent plant?\nI only had to think: What do plants want? What does this particular plant want? But, like writing any “other,” you have to understand that other’s life. I did all the research I could, and I’m still learning. The Hidden Life of Trees by Peter Wohlleben tells us about all the hard decisions trees here on Earth have to make—yes, they make life-or-death decisions, and like us, they must make them with incomplete knowledge. Also like us, any given intelligent plant would have its own combination of triumphs and failures, confidence and fear, and abundance and hunger.\nWhy is Mundos en la Eternidad one of the best space operas you’ve ever read?\nBesides an exciting, intricate plot and a well thought-out setting, that novel from Spain features “juggernauts,” which are an enormous interstellar life-form. Investigating them leads to one surprise after another. The novel was written by Juan Miguel Aguilera and Javier Redal, and Redal was trained in biology and medicine. I think his understanding of life sciences made those surprises both perfectly logical and astounding. Incidentally, the juggernauts strongly resemble the interstellar object 1I/2017 U1, also called ’Oumuamua, which is swinging through our solar system right now. Coincidence?\nThe novel won major awards in Spain and resulted in several spin-offs. It also inspired other writers to create additional works in that universe, which Aguilera and Redal have generously encouraged. Years after I fell in love with Mundos en la Eternidad, I got to translate one of those works, an outstanding novella called “The Texture of Words” by Felicidad Martínez, for the anthology Terra Nova. It explores what the stay-at-home females of one of its spacefaring peoples were doing to survive.\nThat’s what a great novel can do: inspire both readers and writers.\nHaving translated numerous books, do you have a favorite Spanish colloquialism?\nI lived in Spain for seventeen years, and there they sometimes say, “No tienes abuela.” It means: “You don’t have a grandmother.” It really means: “You blow your own horn.” She’s supposed to do that for you.\nWhat is one piece of advice you’d like to share with aspiring writers?\nIf you see something remarkable like a poop plant, remember it. Memorable details make for memorable writing.\nWhat other projects do you have in the works?\nI’ve written the sequel to Semiosis, and I’m writing the third book now. After that, I plan to move on to another series of novels. I’m also working—as always—on translations and on shorter works.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/burke_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Clever Plants, Generations, and Translations: A Conversation with Sue Burke by Chris Urie"}