{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chen Qiufan; Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "afqmP4zyDs0LFIWhjqjUv3q9Pfs=", "id": null, "license": null, "comments": "", "raw_text": "10930 words, novelette  Balin  I judge of your sight by my sight, of your ear by my ear, of your reason by my reason, of your resentment by my resentment, of your love by my love. I neither have, nor can have, any other way of judging about them.  —Adam Smith, The Theory of Moral Sentiments  Balin’s dark skin, an adaptation for the tropics, appears as aphotic as the abyss of deep space, all reflected light absorbed by the thick layer of gel smeared over his body and the nanometer-thin translucent membrane wrap. Suspended between bubbles in the gel, microsensors twinkle with a pale blue glow like dying stars, like the miniature images of me in his eyes.  “Don’t be afraid,” I whisper. “Relax. Soon it’ll be better.”  As though he understands me, his face softens and wrinkles pile up at the corners of his eyes. Even the scar over his brow is no longer so apparent.  He’s old. Though I’ve never figured out how to tell the age in his kind.  My assistant helps Balin onto the omnidirectional treadmill, securing a harness around his waist. No matter in which direction he runs and how fast, the treadmill will adjust to keep him centered and stable.  The assistant hands the helmet to me, and I put it over Balin’s head myself. His eyes, bulging with astonishment like two light bulbs, disappear into the darkness.  “Everything will be fine,” I say, my voice so low that no one can hear me, as though I’m comforting myself.  The red light on the helmet flashes, faster and faster. A few seconds later, it turns green.  As though struck by a spell, Balin’s body stiffens. He reminds me of a lamb who has heard the grinding of the butcher’s knife against the whetstone.  A summer night the year I turned thirteen: The air was hot and sticky; the scent of rust and mold, prelude to a typhoon, filled my nostrils.  I lay on the floor of the main hall of my ancestral compound. I flattened my body against the cool, green mosaic stone tiles like a gecko until the floor under my body had been warmed by my skin; then I rolled to the side, seeking a fresh set of tiles to keep me cool.  From behind came the familiar sound of scuffling leather soles: crisp, quick-paced, echoing loudly in the empty hall. I knew who it was, but I didn’t bother to move, greeting the owner of those footsteps with the sight of my raised ass.  “Why aren’t you in the new house? There’s air conditioning.”  My father’s tone was uncharacteristically gentle. The new house he referred to was a three-story addition just erected at the back of the ancestral compound, filled with imported furniture and appliances and decorated in the latest fashion. He had even added a spacious study just for me.  “I hate the new house.”  “Foolish child!” He raised his voice, but then quickly lowered it to a barely audible mutter.  I knew he was apologizing to our ancestors. I gazed up at the shrine behind the joss sticks and the black-and-white portraits on the wall to see if any of them would react to my father’s entreaties.  They did not.  My father heaved a long sigh. “Ah Peng, I haven’t forgotten your birthday. I had an accident on the way back from up north with the cargo, which is why I’m two days late.”  I shifted, and wriggled like a pond loach until I found another cool spot on the tiled floor.  The cigarette stench on my father’s breath permeated the air as he whispered at my ear, “I’ve had your present ready for a long while. You’ll like it; it’s not something you can buy in a shop.”  He clapped twice, and I heard a different set of footsteps approach, the sound of flesh flapping against stone, close together, moist, like some amphibious creature that had just crawled out of the sea.  I sat up and gazed in the direction of the sound. Behind my father, a lively black silhouette, limned by the creamy yellow light of the hallway light, stood over the algae-green mosaic tiles. A disproportionately large bulbous head swayed over a thin and slight figure, like the sheep’s head atop the slender stick that served as a sign outside the butcher’s shop in town.  The shadow took two steps forward, and I realized that the backlighting wasn’t the only reason the figure was so dark. The person—if one could call the creature a person—seemed to be covered from head to toe in a layer of black paint that absorbed all light. It was as though a seam had been torn in the world, and the person-shaped crack devoured all light—except for two tiny glows: his slightly protruding eyes.  It was indeed a boy, a naked boy who wore a loincloth woven from bark and palm fronds. His head wasn’t quite as large as it had seemed in shadow; rather, the illusion had been caused by his hair, worn in two strange buns that resembled the horns of a ram. Agitated, he concentrated on the gaps between the tiles at his feet, his toes wiggling and squirming, sounding like insect feet scrabbling along the floor.  “He’s a paoxiao,” my father said, giving me the name of a creature from ancient myths who was said to possess the body of a goat, the head of a man—though with eyes located below the cheeks, the teeth of a tiger, and the nails of a human, and who cried like a baby and devoured humans without mercy. “We captured him on one of the small islands in the South China Sea. I imagine that he’s never set foot on a civilized floor in his life.”  I stared at him, stupefied. The boy was about my age, but everything about him made me uneasy—especially the fact that my father gave him to me as a present.  “I don’t like him,” I said. “I’d rather have a puppy.”  A violent fit of coughing seized my father. It took him a few moments to recover.  “Don’t be stupid. He’s worth a lot more than a dog. If I hadn’t seen him with my own eyes, I would never have believed he’s real.” His voice grew ethereal as he went on.  A susurrating noise grew louder. I shuddered; the typhoon was here.  The wind blew the boy’s scent to me, a strong, briny stench that reminded me of a fish, a common, slender, iron-black, cheap fish trawled from the ocean.  That’s a good name for him, isn’t it? I thought.  My father had long planned out everything about my life up through age forty-five.  At eighteen I would attend a college right here in Guangdong Province and study business—the school couldn’t be more than three hours from home by train.  In college, I would not be allowed to date. This was because my father had already picked out a girl for me: the daughter of his business partner Lao Luo. Indeed, he had taken the trouble to go to a fortuneteller to ensure that the eight characters of our birth times were compatible.  After graduation, Lao Luo’s daughter and I would get married. By my twenty-fifth year, my father would have his first grandchild. By twenty-eight I would give him another. And depending on the sexes of the first two, he might want a third as well.  Simultaneous with the birth of my first child, I would also join the family business. He would take me around to pay my respects to all his partners and suppliers (he had gotten to know most of them in the army).  Since I was expected to work very long hours, who would take care of my child? His mother, of course—see, my father already decided it would be a boy. My wife would stay home; there would be two sets of grandparents; and we could hire nannies.  By age thirty I would take over the Lin Family Tea Company. In the five years prior to this point, I would have to master all aspects of the tea trade, from identification of tea leaves to manufacture and transport, as well as the strengths and weaknesses of all my father’s partners and competitors.  For the next fifteen years, with my retired father as my advisor, I would lead the family business to new heights: branching out into other provinces and spreading Lin tea leafs all over China; and if I’m lucky, perhaps even breaking into the overseas trade, a lifelong goal that my father had always wanted—but also hesitated—to pursue.  By the time I was forty-five, my oldest child would be close to graduating from college. At that point, I would follow in my father’s footsteps and find a good wife for him.  Everything in my father’s universe functioned as an essential component in an intricate piece of well-maintained clockwork: gear meshed with gear, wheel turned upon wheel, motion without end.  Whenever I argued with him over his grand plan for me, he always brought up my grandfather, his grandfather, and then my grandfather’s grandfather—he would point at the wall of ancestors’ portraits and denounce me for forgetting my roots.  This is the way the Lin family has survived, he would say. Are you telling me you are no longer a Lin?  Sometimes I wondered if I was really living in the twenty-first century.  I called him Balin. In our topolect, balin meant a fish with scales.  In reality, he looked more like a goat, especially when he lifted his eyes to gaze at the horizon, his two hair buns poking up like horns. My father told me that the paoxiao have an incredibly strong sense of direction. Even if they were blindfolded, hogtied, tossed into the dark hold of a ship, hauled across the ocean in a journey lasting weeks, and sold and resold through numerous buyers, they’d still be able to find their way home. Of course, given the geopolitical disputes in the South China Sea, exactly what country was their home was indeterminate.  “Then do we need to leash him like a dog?” I asked my father.  He chuckled unnaturally. “The paoxiao are even more accepting of fate than we. They believe everything that happens to them is by the will of the gods and spirits; that’s why they’ll never run away.”  Gradually, Balin grew used to his new environment. My father repurposed our old chicken coop as his home. It took him a long time to figure out that the bedding was meant for him to sleep on, but even after that, he preferred to sleep on the rough, sandy floor. He ate just about everything, even crunching the chicken bones leftover after our meals. I and the other children of the village enjoyed crouching outside his hutch to watch him eat. This was also the only time when I could see his teeth clearly: densely packed, sharp triangles like the teeth of a shark; they easily ripped apart whatever he stuffed into his mouth.  As I watched, I couldn’t help imagining the feeling of those sharp teeth tearing into me; I would then shudder with a complicated sensation, a mixture of pain and addictive pleasure.  One day, after Balin had eaten enough, he leisurely crawled out of his enclosure. His thin figure sporting a bulging, round tummy resembled a twig with a swelling gall. A couple of other kids and I were playing “monster in the water.” Balin, waddling from side to side, stopped not far from us and watched our game with curiosity.  “Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!” Shouting and screaming, we pretended to be fishermen standing on shore (a short brick wall) gingerly sticking our feet into the (nonexistent) river. Dip. Dip. Pull back.  The boy who was the water monster ran back and forth, trying to grab the bare feet of the fishermen as they dipped into the river. Only by pulling a fisherman into the river would the water monster be redeemed to humanity, and his unlucky victim would turn into the new water monster.  No one remembered when Balin joined our game. But then Nana, a neighbor, abruptly stopped and pointed. I looked and saw Balin imitating the movements of the water monster: leaping over here, bounding over there. Except that he wasn’t grabbing or snatching at the feet of fishermen, but empty air.  Children often liked to imitate the speech or body language of others, but what Balin was doing was unlike anything I had ever seen. Balin’s movements were almost in perfect synchrony with Ah Hui, the boy who was the water monster.  I say “almost” because it was impossible to detect with the naked eye whether there was a delay between Balin’s movements and Ah Hui’s. Balin was like a shadow that Ah Hui had cast five meters away. Each time Ah Hui turned, each time he extended his hand, even each time he paused dispiritedly because he had missed a fisherman—every gesture was mirrored by Balin perfectly.  I couldn’t understand how Balin was accomplishing this feat, as though he was moving without thinking.  Finally, Ah Hui stopped because everyone was staring.  Ah Hui took a few steps toward Balin; Balin took a few steps toward Ah Hui. Even the way they dragged their heels was exactly the same.  “Why are you copying me?” demanded Ah Hui.  Balin’s lips moved in synchrony, though the syllables that emerged from his mouth were mere noise, like the screeching of a broken radio.  Ah Hui pushed Balin, but he stumbled back because Balin also pushed him at the same moment.  The crowd of children grew excited at the farcical scene, far more interesting than the water monster game.  “Fight! Fight!”  Ah Hui jumped at Balin, and the two grappled with each other. This was a fascinating fight because their motions mirrored each other exactly. Soon, neither could move as they were locked in a stalemate, staring into each other’s eyes.  “That’s enough! Go home, all of you!” Massive hands picked both of them off the ground and forcibly separated them as though parting a pair of conjoined twins. It was Father.  Ah Hui angrily spat on the ground. The children scattered.  Balin did not imitate Ah Hui this time. It was as though some switch had been shut off in him.  Smiling, Father glanced at me, as though to say, Now do you understand why this present is so great?  “We can view the human brain as a machine with just three functions: sensing, thinking, and motor control. If we use a computer as an analogy, sensing is the input, thinking is the computation carried out by the switches, and motor control is the output—the brain’s only means of interacting with the external world. Do you see why?”  Before knowing Mr. Lu, I would never have believed that a gym teacher would give this sort of speech.  Mr. Lu was a local legend. He was not that tall, only about five-foot-eight, his hair cropped short. Through the thin shirts he wore in summers we could see his bulging muscles. It was said that he had studied abroad.  Everyone in our class was puzzled by why somebody who had left China and seen the world would want to return to our tiny, poor town to be a middle-school teacher. Later, we heard that Mr. Lu was an only child. His father was bedridden with a chronic illness, and his mother had died early. Since there were no other relatives who could care for his father and the old man refused to leave town, saying that he preferred to die where he was born, Mr. Lu had no choice but to move home and find a teaching job. Since his degree was in the neurology of motor control, the principal naturally thought he would be qualified to teach phys ed.  Unlike our other teachers, Mr. Lu never put on any airs around us. He joked about with us as though we were all friends.  Once, I asked him, “Why did you come back to this town?”  “There’s an old Confucian saying that as long as your parents are alive, you should not travel too far. I’d been far away from home for more than a decade, and my father won’t be with me for much longer. I have to think about him.”  I asked him another question: “Will you leave after both your parents are gone then?”  Mr. Lu frowned, as though he didn’t want to think about the question. Then he said, “In my field there was a pioneering researcher named Donald Broadbent. He once said that it was far harder to control human behavior than to control the stimuli influencing them. That was why in the study of motor control it was difficult to devise simple scientific laws of the form ‘A leads to B.’”  “So?” I asked, knowing that he had no intention of answering my question.  “So no one knows what will happen in the future.” He nodded and took a long drag of his cigarette.  “Bullshit,” I said, accepting the cigarette from him and taking a puff.  No one thought he would stick around our town for long.  In the end he was my gym teacher from eighth grade through twelfth grade, married a local woman, and had kids.  Just the way he predicted.  At first we used a pushpin, and then we switched to the electric igniter for a cigarette lighter. Snap! There it was: a pale blue electric arc.  Father thought this was more civilized.  The people who had sold Balin to him had also taught him a trick. If he wanted Balin to imitate someone, he should have Balin face the target and lock gazes. Then he should “stimulate” Balin in some way. Once Balin’s eyes glazed over then the “connection” was established. They explained to my father that this was a unique custom of Balin’s kind.  Balin brought us endless entertainment.  As long as I could remember, I’d always enjoyed street puppetry, whether shadow puppets, glove puppets, or marionettes. Curious, I would sneak behind the stage and watch the performers give life to the inanimate and enact moving scenes of love and revenge. In my childhood, such transformations had seemed magical, and now with Balin, I finally had the chance to practice my own brand of magic.  I danced, and so did he. I boxed, and so did he. I had been shy about putting on a performance in front of my relatives, but now, through Balin’s body, I became the family entertainer.  I had Balin imitate Father when he was drunk. I had him imitate anyone who was different in town: the madman, the cripple, the idiot, the beggar who had broken legs and arms and who had to crawl along the ground like a worm, the epileptic . . . my friends and I would laugh so hard that we would roll on the ground—until the relatives of our victims came after us, wielding bamboo laundry rods.  Balin was also good at imitating animals: he was best at cats, dogs, oxen, goats, pigs; not so good with ducks and chickens; and completely useless when it came to fish.  Sometimes, I found him crouched outside the door to the main house in the ancestral compound spying on our TV. He was especially fascinated by animal documentaries. When he saw prey being hunted down and killed by predators, Balin’s body twitched and spasmed uncontrollably, as though he was the one whose belly was being ripped open, his entrails spilling forth.  There were times when Balin grew tired. While imitating a target, his movements would slow and diverge from the target’s, like a wind-up figurine running down or a toy car with almost-exhausted batteries. After a while, he would fall to the ground and stop moving, and no matter how hard we kicked him, he refused to budge. The only solution was to make him eat, stuff him to the gills.  Other than exhaustion, he never resisted or showed any signs of unhappiness. In my childish eyes, Balin was no different from the puppets constructed from hide, cellophane, fabric, or wood. He was nothing more than an object faithfully carrying out the controller’s will, but he himself was devoid of emotion. His imitation was nothing more than an unthinking reflex.  Eventually, we tired of controlling Balin one-on-one, and we invented more complex and also crueler multiplayer games.  First, we decided the order through rock-paper-scissors. The winner got to control Balin to fight against the loser. The winner of the contest then got to fight against the next kid in line. I was the first.  The experience was cool beyond measure. Like a general sitting safe far from the frontlines, I commanded my soldier on the battlefield to press, punch, dodge, kick, roundhouse . . . because I was at a distance from the fight, I could discern my opponent’s intentions and movements with more clarity, and devise better attacks and responses. Moreover, since Balin was the one who endured all the pain, I had no fear and could attack ruthlessly.  I thought my victory was certain.  But for some reason, all my carefully planned moves, as they were carried out by Balin, seemed to lack strength. Even punches and kicks that landed squarely against my opponent did little to shock the opponent, much less to injure him. Soon, Balin was on the ground, enduring a hailstorm of punches.  “Bite him! Bite!” I snapped my jaw in the air, knowing the power of Balin’s sharp teeth.  But Balin was like a marionette whose strings had been cut. My opponent’s fists did not relent, and soon Balin’s cheeks were swollen.  “Dammit!” I spat on the ground, conceding the fight.  Now it was my turn to face Balin, controlled by the victor of the last round. I stared at him as ferociously as I could manage. His face was bloody, the skin around his eyes bruised and puffy, but his irises still held their habitual tranquility. I was enraged.  Glancing out the corner of my eye, I observed the movements of Ah Hui, Balin’s controller. I was familiar with how Ah Hui fought. He always stepped forward with his left foot and punched with his right fist. I was going to surprise him with a low spinning sweep kick to knock him off his feet. Once he was on the ground, the fight would basically be over.  Ah Hui stepped forward with his left foot. Here it comes. I was about to crouch down and begin my sweep, but Balin’s foot moved and kicked up the dirt at his feet, blinding me in an instant. Next, his leg swept low along the ground, and I was the one knocked off my feet. My eyes squeezed shut, I wrapped my arms about my head, preparing to endure a fusillade of punches.  However, the fight did not proceed the way I imagined. The punches did land against my body, but there was no force behind them at all. At first, I thought Balin was probably tired, but soon realized that was not the case. Ah Hui’s own punches against the air were forceful and precise, but Balin apparently was holding back on purpose so that his punches landed on my body like caresses.  Without warning, the punching stopped. Something warm and smelly pressed itself against my face.  Laughter erupted around me. When I finally understood what had happened, a wave of heat suffused my face.  Balin had sat on me with his nude and dirty bottom.  Ah Hui knew that Balin’s punches were useless, which was why he had come up with such a dirty trick.  I pushed Balin away and leapt up off the ground. In one quick motion, I pressed Balin to the ground and held him down. Tears poured out of my eyes, stung by the kicked-up sand as well as humiliation and rage. Balin looked up at me, his swollen eyes also filled with tears, as though he knew exactly how I felt at that moment.  Then it hit me. He’s just imitating. I raised my fist.  “Why didn’t you punch with real force, like I wanted you to?”  My fist pounded against Balin’s thin body, thumping as though I was punching a hollow shell made of fragile plywood.  “Why don’t you hit me back?”  My fingers felt the teeth beneath his lips rattling.  “Tell me why!”  A crisp snap of bone. A wound opened over Balin’s right brow, the torn skin extended to the tip of his eye. Pink and white fascia and fat spilled out from under the dark skin, and bright red blood flowed freely, soon pooling on the sandy earth under him.  A heavy, fish-like scent wafted from his body.  Terrified, I got off him and stepped back. The other children were stunned as well.  The dust settled, and Balin lay still, curled up like a slaughtered lamb. He glanced at me with his left eye, the one not covered in blood. The tranquil orb still betrayed no emotion. In that moment, for the first time, I felt that he was like me: he was made of flesh and blood; he was a person with a soul.  The moment lasted only seconds. Almost instinctively, I realized that if I had not been treating Balin as a human being until this moment, then it was impossible for me to do so in the future either.  I brushed off the dirt on my pants and shoved my way through the crowd of children, never looking back.  I enter “Ghost” mode, experiencing everything experienced by Balin, trapped in his VR suit.  I—Balin—we are standing on some beautiful tropical island. Based on my suggestion, the environment artist has combined the sights and vegetation from multiple South China Sea islands to create this reality. Even the angle and temperature of light are calculated to be accurate for the latitude.  My intent is to give Balin the sensation of being back home—his real home. But the environment doesn’t seem to have reduced his terror.  The view whirls violently: sky, sand, the ocean nearby, scattered vines, and from time to time, even rough gray polygonal structures whose textures have yet to be applied.  I feel dizzy. This is the result of visual signals and bodily motion being out of sync. The eyes tell my brain that I’m moving, but the vestibular system tells my brain that I’m not. The conflict between the two sets of signals gives rise to a feeling of sickness.  For Balin, we have deployed the most advanced techniques to shrink the signal delay to within five milliseconds. In addition, we are using motion capture technology to synchronize the movements between his virtual body and his physical body. He could move freely on the omnidirectional treadmill, but his position wouldn’t shift one inch.  We’re treating him like a guest in first class, anticipating all his needs.  Balin stands rooted to his spot. He can’t understand how the world in his eyes is related to the bright, sterile lab he was in just a few minutes ago.  “This is useless,” I bark at the technicians through my microphone. “We’ve got to get him to move!”  Balin’s head whips around. The surround sound system in his helmet warns him of movements behind his body. A quaking wave ripples through the dense jungle, and a flock of birds erupts into the air. Something gigantic is shoving its way through the vegetation, making its way toward Balin. Motionless, Balin stares at the bush.  A massive herd of prehistoric creatures bursts from the jungle. Even I, no expert on evolutionary biology, can tell that they don’t belong to the same geologic epoch. The technicians have used whatever models they can find in the database to try to get Balin to move.  Still, he stands there like a tree stump, enduring waves of Tyrannosaurus rexes, saber-toothed tigers, monstrous dragonflies, crocodilian-shaped ancestors of dinosaurs, and strange arthropods as they rush at him and then, howling and screaming, sweep through him like wisps of mist. This is a bug in the physics engine, but if we were to fix the bug and fully simulate the physical experience, the VR user would not be able to endure the impact.  It isn’t over yet.  The ground under Balin begins to quake and split. Trees lean over and topple. Volcanoes erupt and crimson molten lava spills out of the earth, coalescing into bloody rivers. Massive waves more than ten meters tall charge at our position from the sea.  “I think you might be overdoing this a bit,” I say into the mike. I hear faint giggles.  Imagine how a primitive human tossed into the middle of such an apocalyptic scene would feel. Would he consider himself a savior who is suffering for the sins of the entire human race? Or would he be on the cusp of madness, his senses on the verge of collapse?  Or would he behave like Balin: no reaction at all?  Suddenly, I understand the truth.  I back out of Ghost mode, and remove Balin’s helmet. Sensors are studded like pearls all over his skull. His eyes are squeezed tightly shut, the wrinkles around them so deep that they resemble insect antennae.  “Let’s stop here today.” I sigh helplessly, recalling that afternoon long ago when I had punched him until he bled.  As the time approached for all the high school students to declare our intended subjects of study before the college entrance examination, the war between my father and me heated up.  According to his grand plan, I was supposed to major in political science or history in college, but I had zero interest in those subjects, which I viewed as painted whores at the whim of those in power. I wanted to major in a hard science like physics, or at the minimum biology—something that according to Mr. Lu involved “fundamental questions.”  My father was contemptuous of my reasons. He pointed to the houses in our ancestral compound, and the tea leaves drying over the racks in the yard, glistening like gold dust in the bright sunlight.  “Do you think there are any questions more fundamental than making a living and feeding your family?”  It was like discussing music theory with a cud-chewing cow.  I gave up trying to convince Father. I had my own plan. With Mr. Lu’s help, I obtained permission from the teachers to cram for common subjects like math, Chinese, and English with students who intended to declare for the humanities, but then I would sneak away to study physics, chemistry, and biology with the science students. If class schedules conflicted, I would make my own choices and then make up the missed work later.  My teachers were willing to let me get away with it because they had their own selfish hopes. Rather than forcing someone who had no interest to study politics and history, they thought they might as well let me follow my heart. If they got lucky, it was possible that I would do extraordinarily well on the college entrance examination as a science student and bring honor to them all.  I thought my plan would fool my busy father, who was away from home more often than not. I was going to surprise him at the last minute, when I had to fill out the desired majors and top choice schools right before the examination. Even if he blew up at me then, it would be too late.  I was so naïve.  On the day we were supposed to fill out the forms, all my friends received a copy of the blank form except me. I thought the head teacher had made a mistake.  “Uh . . . your father already filled it out for you.” The teacher dared not meet my eyes.  I don’t remember how I made it home that day. Like a lost, homeless dog, I wandered the streets and alleyways of the town aimlessly until I found myself in front of the ancestral compound.  Father was entertaining himself by playing with Balin. He had dug up an old set of army uniforms and put them on Balin. The loose folds and wide pant legs hung on Balin like a tent, making him resemble a monkey who had stolen some human clothing. Father had Balin follow orders he had learned during the time he was in the army: stand at attention, stand at ease, right dress, left dress, march in place, and so on. When I was in elementary school, Father had enjoyed ordering me around like a drill sergeant at the parade ground, and I had hated those “games” more than anything else.  It had been years since he had tried anything like that with me, but now he had found a new recruit.  A soldier who would obey every one of his commands without question.  “One-two-one! One-two-one! Forwaaaaard-march!” As he barked out the commands and demonstrated the moves, Balin goose-stepped around the yard, his pant legs muddy as they dragged on the ground.  I stepped between them and faced my father. “You have no intention of letting me go to college, is that it?”  “Riiiiight-dress!” My father whipped his head to the right and shuffled his feet. I heard the sound of feet scrabbling against the ground in synchrony behind me.  “You knew about my plan a long time ago, didn’t you?” I demanded. “But you said nothing before you played your trick so I wouldn’t have a chance to stop you.”  “Maaaaarch in place!”  Enraged, I turned around and held Balin still, not allowing him to proceed any longer like a mindless drone. But he seemed unable to stop. The pant legs slapped against the ground, whipping up wisps of dust.  I grabbed his head and forced him to lock gazes with me. I pulled out the electric lighter from my pocket and flicked it; a pale blue arc burst into life next to his temple. Balin screamed like a baby.  I looked into his eyes; now he belonged to me.  “You have no right to control me! All you care about is your business. Have you ever thought about what I want for my future?”  As I screamed at my father, Balin marched around us, his finger also pointing at Father, his mouth also screaming. The circle he made around the two of us tightened on each loop.  “I’m going to college whether you want me to go or not. And I’m going to study whatever I want!” I clenched my jaw. Balin’s finger was almost touching my father. “Let me tell you something, Father: I never want to become like you.”  The militaristic arrogance melted from my father. He stood there, his face fallen and back hunched, like crops that had been bitten by frost. I expected him to hit back, hard, as was his wont, but he did not.  “I knew. I’ve always known that you don’t want to walk the path others have paved for you,” my father’s voice faded until it was barely a whisper. “You remind me so much of myself when I was your age. But I have no choice—”  “So you want me to repeat your life?”  My father’s knees buckled. I thought he was going to fall, but he knelt on the ground and embraced Balin.  “You can’t leave!” he shouted. “I know what’s going to happen if you go away to college. No one who leaves this town ever returns.”  I struggled against the empty air so that Balin, moving in sync with me, could free himself from my father’s grasp. As long as I could remember, my father had never hugged me.  “Don’t be so childish! Open your eyes! See the world for what it is.”  Balin was like a wind-up toy that had malfunctioned. His limbs whipped about in a frenzy; the military uniform he wore was torn in multiple places, revealing the dark, unreflective skin.  “The way you spoke just now is just like your mother.” Another pale blue spark came to life over Balin’s temple. Abruptly, he ceased struggling, and held my father tightly like a long-lost lover. “Are you going to abandon me just like she did?”  I was stunned.  I had never thought about this matter from my father’s perspective. I had always thought that he wanted to keep me close at hand because he was selfish, narrow-minded, but I had never seen it as a reaction to the fear of being abandoned. My mother had left us when I was too young to view it as trauma, but it cast a shadow over the rest of his life.  Wordless, I approached my father, who held on to Balin tightly. I bent down and caressed his spine, no longer as straight as in my memory. Maybe this was as close as the two of us would ever be.  I saw the tears spilling from the corners of Balin’s eyes. For a moment, I doubted myself.  Maybe it isn’t just about control and power, but also love.  There are many things I wish I had known before I turned seventeen.  For example, the fact that most of the structures in the human brain have something to do with motor functions, including the cerebellum, the basal ganglia, the brainstem, the motor region of the cerebral cortex and the direct projection of the somatosensory cortex to the primary motor cortex, and so on.  For example, the cerebellum contains more neurons than any other part of the brain. As humans evolved, the cerebellar cortex grew in step with the rapidly increasing volume of the frontal lobe.  For example, any interaction with the outside world, whether informational or physical, including moving limbs, manipulating tools, gesticulating, speaking, glancing, making faces—each ultimately requires activating a series of muscles to realize.  For example, an arm contains twenty-six separate muscles, and each muscle on average contains a hundred motor units, each made up by a motor neuron and its associated skeletal muscle fibers. Thus, the motion of a single arm is governed by a possibility space at least 2^2600 in size, a number far greater than the total number of atoms in the universe.  Human motion is so complex and subtle, and each casual movement represents the result of so much computation, analysis, and planning that even the most advanced robots are incapable of moving as well as a three-year-old.  And we haven’t even discussed all the information, emotion, and culture embodied in human motion.  On the way to the high-speed rail station, my father maintained his silence, only clutching my suitcase tightly. The northbound train finally appeared before us, shiny, new, smooth in outline, like something that was going to slide into the unknowable future the moment the brakes were released.  In the end, my father and I failed to reach a compromise. If I was going to college in Beijing, he would not pay for any of my expenses.  “Unless you promise to return,” he said.  I gazed through him, as though I was already seeing the future, a future that belonged to me. For that, I was willing to be the black sheep from a white flock, the sheep in perpetual exile.  “Dad, take care of yourself.”  I grabbed my suitcase to board the train, but my father refused to let go of the handle, and the suitcase awkwardly hung between us. A moment later, both of us let go, and the suitcase fell to the ground.  I was about to erupt when my father slapped his heels together to stand at attention, giving me a crisp military salute. Without a word, he turned and left. He had once told me that it was bad luck to say goodbye before going to war. Better to leave each other with other memories.  I watched his diminishing figure, raised my hand, and returned his salute gently.  I did not truly understand the meaning in my gesture.  “I never thought we’d fail because of a wild man,” says my thesis advisor Ouyang, who is also the project leader. He claps me on the shoulder, his smile disguising the sharp edges of his words. “It’s no big deal. Let’s keep on working at this. We still have time.”  But I know him too well. What he really means is We are running out of time.  Or, to put it another way, This is your idea, your project. Whether you can get your degree in time will depend on what you do next.  Of course he will never mention how much of our time he has taken up in the past to handle the random projects he promised business investors.  Frustrated, I massage my scalp. My eyes fall on Balin, now shut in his pink-hued pet enclosure. Eyes glazed, he stares at the floor, as though still not recovered from his ordeal in the VR environment. The contrast between the pink pet enclosure and his appearance is comical, but I can’t make myself laugh.  What would Mr. Lu do?  Everything began with that idle conversation with him years ago concerning “A leads to B.”  Traditional theorists believe that motor control is the result of stored programs. When a person wants to move a certain way, the motor cortex picks out a certain program from its stored repertoire and carries it out much the same way a player piano follows the roll of perforated paper. The program’s instructions determine the activation patterns in the motor regions of the cortex and the spinal cord, which then, in turn, activate the muscles to complete the motion.  This naturally raises the question: the same motion can be carried out in infinite ways. How does the brain store an infinite number of motor programs?  Remember that arm whose potential possible number of movements exceeds the number of atoms in the universe?  In 2002, the mathematician Emanuel Todorov came up with a theory in an attempt to answer this question. Basically, he argued that motor control is really an optimization problem for the brain. Optimality is defined by high-level performance criteria such as maximizing precision, minimizing energy consumption, minimizing control effort, and so on.  In the optimization process, the brain relies on the processing powers of the cerebellum. Before the commands for movement have reached muscles, the cerebellum predicts the results of anticipated motion, and then, combined with real-time sensory feedback, helps the brain evaluate and coordinate the motor commands.  A simple example: when ascending or descending a set of stairs, we will often stumble due to miscounting the number of steps. If feedback-based adjustments are made in time, we can recover and not fall. Feedback, of course, is often noisy and involves a delay.  Todorov’s mathematical model is compatible with all known evidence concerning the neural mechanisms of motor control and can be used to explain all kinds of behavior phenomena. Given some physical parameters, it’s even possible to predict the resulting motion using his model: for instance, how an eight-legged creature would jump in Pluto’s gravity.  Physics engines based on his models are used by Hollywood to produce naturalistic movements for avatars in virtual environments.  By the time I was in college, the Todorov model was already treated as textbook authority. Experiment after experiment provided more evidence that it was correct.  And then one day, Mr. Lu and I discussed Balin.  After I left home for college, he and I had kept in touch via email. He was like an oracular AI from whom I could get answers for everything: academics, awkward social situations, even relationship advice. We wrote long emails back and forth discussing questions that must have seemed ridiculous to anyone else, such as “would an out-of-body experience engineered by technology violate religion’s claim on spirituality?”  By an unspoken agreement, both of us avoided talking about my father.  Mr. Lu told me that Balin had been sold to another family in town, a nouveau riche household which was often mocked for conspicuous acts of consumption that appeared ridiculous in the townspeople’s eyes.  I had known that Father’s business had run into a rough patch, but I hadn’t imagined that he would be so short on cash as to consider selling Balin.  I shifted the topic to the Todorov mathematical model, and a new thought struck me. Balin was capable of imitating movements with perfect precision. Suppose we had him perform two sets of identical movements: one through subconscious imitation and the other by his own will; do these two sets of movements go through the same process of motor control?  Mathematically, there was only a single optimal solution, but was there a difference in the way the optimal solution was arrived at?  It took Mr. Lu three days to get back to me. Unlike his usual free-flowing, loquacious style, this time he wrote only a few lines:  I think you’re asking a very important question, one whose importance perhaps you don’t even realize. If we can’t distinguish between mechanical imitation and conscious, willed movement at the level of neural activity, then the question is: Does free will truly exist?  I couldn’t sleep that night. I spent two weeks designing the prototype experiment, and spent even more time studying the feasibility of my proposed study, soliciting feedback from my mentors and other professors. Then I submitted my project for approval.  It wasn’t until everything was ready that I realized that this experiment, one seeking to address a “fundamental question,” lacked a fundamental, required component.  I had no choice but to break my promise to myself and go home.  I’m going just to get Balin, I reminded myself again and again. Just for Balin.  Just like how A leads to B. Simple, right?  I once read a science fiction novel called The Orphans, which was about aliens who had come to Earth. They could imitate the appearance of specific humans and pass as human in society, but they couldn’t perfectly capture the characteristic ways their targets moved or the subtleties of their facial expressions. Many aliens, exposed as frauds, were hunted down by humans.  In order to survive, the aliens had to study how humans communicated via body language. They pretended to be abandoned orphans, and, once taken in by kind-hearted families, proceeded to use the opportunity of living together to imitate the mannerisms and expressions of their adoptive parents.  To the parents’ surprise, their children became more and more like them. And once the alien orphans decided that they had learned enough, they killed their father or mother, took on their appearance, and took their place. The scene where an alien killed his father and took his mother as his wife was unforgettable.  Though it became harder to tell aliens apart from humans, people finally discovered the fundamental difference between the extraterrestrials and humans.  Although the aliens were able to imitate human movements with perfect fidelity, they lacked the mirror neurons unique to human brains, and thus were unable to intuit the emotional shifts occurring behind human faces or to experience similar neural activation patterns in their own minds. In other words, they lacked the capacity for empathy.  And so humans devised an effective means to detect aliens: bring harm to those closest to the disguised aliens and observe the aliens for signs of pain, fear, or rage. The test was called “the stabbing needle test.”  The story’s lesson seems to be: humanity isn’t the only species in the universe that has difficulty relating to their parents.  Mr. Lu knew everything about Balin. He thought of the paoxiao as an example of overdevelopment in the mirror neuron system. He was fascinated by Balin, but he disapproved of the way we treated him.  “But he’s never resisted or even wanted to run away,” I used to counter.  “Overactive mirror neurons lead to a pathological excess of empathy,” he said. “Maybe he just couldn’t tolerate the look of abandonment in his tormentors’—your—eyes.”  “I guess that could be true,” I said. “I must be an example of underdevelopment of mirror neurons.”  “Cold-blooded, one might say.”  But when Mr. Lu took me to find Balin on my return, I realized that I wasn’t the most cold-blooded, not by far.  Balin was naked, his body full of bruises and lacerations. Thick, rusty chains were locked about his neck and shackled his arms and legs. He was shut inside a tiny brick-and-mud enclosure, about five feet on each side. The interior was dim, and the stale air saturated with the gag-inducing stench of excrement and rotting food. He was thinner than I remembered. Flies buzzed about his wounds, and the outlines of his skeleton poked from under his skin. He was like an animal about to be sent to the butcher’s.  He looked at me, and there was no reaction in his eyes at all. It was just like the first time we had met, that summer night when I was thirteen.  “They had him mirror the movements of animals . . . mating—” Mr. Lu was unable to continue.  Memories of the past flood into my mind in a flash.  I have no recollection of what happened next. It was as though I had been possessed by some spirit, and I moved without remembering wanting to move.  According to Mr. Lu, I rushed into the house of Balin’s new owners, and grabbed the Pomeranian beloved by the family patriarch’s daughter-in-law. I opened my jaw and held the neck of the whimpering creature between my teeth.  “You said, ‘If you don’t let Balin go, I’m going to bite all the way through,’” Mr. Lu said.  I spat on the ground. Though I didn’t remember any of it, this did sound like something I would do.  Mr. Lu and I rushed Balin to the hospital. As we were preparing to leave, Mr. Lu stopped me. “Do you want to see your father?”  That was how I found out that my father had been hospitalized. Once in college, I had had almost no contact with him, and gradually, I had stopped even thinking about him.  He looked about ten years older. Tubing was stuck into his nostrils and arms. His hair was sparse, and his gaze unsteady. A few years ago, when Pu’er tea was all the rage, he had gambled with all his chips and ended up as the last fool to buy in at the height of the mania. He was stuck with warehouses full of tea leaves as the price collapsed, and ended up losing just about everything.  As he looked at me, I noted that his expression reminded me of Balin’s, as though he was saying, I knew you’d be back.  “I . . . I’m here for Balin,” I said.  My father saw through my facade and cracked a smile, revealing a mouthful of teeth stained yellow by years of smoking.  “That little gremlin? He’s much smarter than you think. We all thought we were controlling him, but sometimes I wonder if he was controlling all of us.”  I didn’t know what to say.  “It’s the same way with you. I always thought I was the one in charge. But after you left, I realized that you had always held a thread whose other end is looped around my heart. No matter how far away you are, as soon as you twitch your fingers, I suffer pangs of heartache.” My father closed his eyes and put his hand over his chest.  Something was stuck in my throat.  I walked up to his bed and wanted to lean down to embrace him. But halfway through the motion, my body refused to obey. Awkwardly, I clapped him on the shoulder, straightened up, and walked away.  “I’m glad you’re back,” my father said from behind me, his voice hoarse. I didn’t turn around.  Mr. Lu was waiting for me at the door. I pretended to scratch my eyes to disguise the emotional turmoil.  “Do you think fate likes to play jokes on us?” he asked.  “What do you mean?”  “You wanted to escape the route your father had paved for you, but in the end, you ended up in the same place as me.”  “I think I’m coming around to your way of thinking.”  “What’s that?” he asked.  “No one knows what will happen in the future.”  We’ve failed again.  The original premise is very simple: Balin’s hypertrophic mirror neuron system makes him the ideal experimental subject because his imitation is a kind of instinct. Thus, his movements during imitation ought to be free from much of the noise and interference found in human motor control due to conscious cognition.  We use non-invasive electrodes to capture the neural activity in Balin’s motor cortex as he’s imitating a sequence of movements. Then we have him repeat the sequence under his own will and use motion capture to ensure that we get a perfect match between the two sets of movements. Mathematically, that means that the two sequences are indistinguishable; they are the same motion.  Then, by comparing the two sets of neural patterns captured during the process, we can find out if the same neural signals were activating the same regions of the motor cortex in the same sequence and with the same strength.  If there are differences, then the Todorov model, accepted as gospel, will have been revealed to be seriously lacking.  But if there are no differences, the consequences will be even more severe. Maybe human beings are doing nothing but imitating the behaviors of other individuals, and are only operating under the illusion of free will.  No matter what, the result of the experiment ought to be earth-shattering.  Yet, the experiment was a failure from the very beginning. Balin has refused to look into anyone’s eyes, and has refused to imitate anyone’s movements, including me.  I can guess the reason, but I have no solution. My team has vowed to solve the secret of human cognition, yet we can’t even heal the psychic trauma inflicted on a mere “primitive.”  I thought of the idea of using virtual reality. Situating Balin in an environment completely disconnected from the reality around him may help him recover his normal habits.  And so we went through a series of virtual environments: islands, glaciers, deserts, even space; we manufactured incredible catastrophes; we even devoted enormous effort to construct avatars of paoxiao, hoping that the sight of others of his kind would awaken his dormant mirror neurons.  Without exception, all these tricks have failed.  Now, at midnight, only I and the zombie-like Balin remain in the lab. Everyone else has left. I know what they’re thinking: this experiment is a joke, and I’m the man who has finished telling the joke and looks around confused, unsure why everyone else is laughing.  Balin is curled up into a ball in the pet house made from pink foam boards. I remember Mr. Lu’s words. He was right. I’ve never treated Balin as a person, not even now.  A colleague once implanted a wireless receiver into a rat’s brain. By electrically stimulating the rat’s somatosensory cortex and the medial forebrain bundle, my colleague was able to induce sensations of pleasure and pain in the rat, thereby controlling where the rat moved.  There’s no qualitative difference between that and what I’m doing to Balin.  I am indeed a bastard whose mirror neurons are atrophied.  Unbidden, the memory of a children’s game resurfaces, the game in which Balin first showed us his fantastic ability.  “Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!”  I chant in a low voice, embarrassed. I pretend to be a fisherman, dipping my foot into the imaginary river from the shore and quickly pulling back.  Balin glances at me.  “Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!” My chant grows louder.  Balin stares at my clumsy movements. Gently, slowly, he crawls out of the pet house, stopping a few steps away from me.  “Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!” My legs are jerking wildly like some caricature of a pole dancer in a club.  Abruptly, Balin jumps at me with incredible speed, moving the exact way Ah Hui used to.  He remembers; he remembers everything.  Balin leaps and bounds, grabbing at my dipping leg. A baby-like gurgle emerges from his throat. He’s laughing. This is the first time I’ve ever heard him laugh in the all the years I’ve known him.  He is now re-enacting the movements of everyone in town who had been a bit different. All their movements seem to have been engraved in Balin’s brain, so vivid and precise that I can recognize who he’s replaying at a glance. In turn, he becomes the madman, the cripple, the idiot, the beggar who had broken legs and arms, and the epileptic; he is a cat, a dog, an ox, a goat, a pig, and a crude chicken; he is my drunk father and me, dancing about in joy.  In a moment, I’ve traveled through thousands of kilometers and returned to the hometown of my childhood.  Without warning, Balin begins to play two roles simultaneously, re-enacting the day of the rupture between me and my father.  Watching the argument between me and my father as an observer is eerie: the movements before me are so familiar, yet my memories have grown indistinct, unreal. I was so angry then, so stubborn, like a wild horse that refused to take the reins. My father, on the other hand, was so pitiful and meek. Again and again, he backed off; he suffered. It is nothing like how I remember the scene.  Balin quickly switches between roles, gesturing and posturing like a skilled mime.  Though I know what happens next, when it does happen I’m not prepared.  Balin wraps his arms about me, just the way my father back then wrapped his arms about him. He hugs me tightly, his head buried in the crook of my neck. I smell that familiar fish-like scent, like the sea, and a warm liquid flows down my collar like a river that has absorbed the heat of the sun.  I stay still, thinking about how to react.  Then I give up thinking, allowing my body to react and open up, hugging him back the way I would hug an old friend, the way I would hug my father.  I know that I have owed this hug for far too long, to him and to my father.  I think I finally understand how to solve the problem.  At the end of The Orphans, the team that had come up with the stabbing needle test found, to their horror, that even when they harmed the aliens passing as human, their dear ones, the real humans, also failed to react. Their mirror neuron systems would not activate.  Humanity is a species that was never designed to truly empathize with another species.  Just like those aliens.  Good thing that’s just a bad piece of science fiction, isn’t it?  “We need to think about this from his perspective,” I say to Ouyang.  “His?” It takes a full three seconds for my advisor to figure out what I mean. “Who? The primitive?”  “His name is Balin. We should make him the focus, and construct an environment that will put him at ease, rather than cheap tourist scenes we imagine he’ll enjoy.”  “What are you talking about? You should be concerned about how you’re going to finish your project and get your degree, instead of worrying about the feelings of some primitive. Don’t waste my time.”  Mr. Lu once said that the progress of a civilization should be measured by its degree of empathy—whether members of the civilization are capable of thinking from the values and perspectives of others—and not some other objectified scale.  Silently, I stare at Ouyang’s face, trying to discern some trace of civilization.  The face, so carefully maintained to be wrinkle-free, is a wasteland.  I decide to work on the problem myself. Several younger students join me on their own initiative, restoring some of my faith in humanity. To be sure, most of them are motivated by their hatred of Ouyang, and it’s not a bad way to earn a few credits.  There’s a virtual reality program called iDealism, which claims to be capable of generating an environment based on brainwave patterns. In reality, all it does is select pre-existing models from a database whose brainwave signatures match the user’s—at most it adds some high-resolution transitions. We hacked it for our own use, and since our lab’s sensors are several orders of magnitude more sensitive than consumer-grade sensors, we add a lot of new measurement axes to the software and connect it to the largest open-source database, which contains demo data from virtual reality labs from around the world.  And now, Balin is going to be the Prime Mover of this virtual universe.  He will have plenty of time to explore the linkage between this world and every thought in his mind. I will record every move and gesture Balin makes. Then, when he returns to the real world, I will reconnect with him. I will imitate to the best of my ability each of his gestures. The two of us will be as two parallel mirrors, reflecting each other endlessly.  I put the helmet on Balin’s head. His gaze is as placid as water.  The red light flashes, speeds up, turns green.  I enter Ghost mode, and bring up a third-person POV window in the upper-right hand corner. In it, I see a tiny avatar of Balin trembling in place.  Balin’s world is primordial chaos. There is no earth, no heaven, no east, west, north, or south. I struggle against the vertigo.  Finally, he stops shaking. A flash of lightning slowly divides the chaos, determining the location of the sky.  The lightning extends, limning a massive eye in the cloud cover. A web of fine lightning feelers spreads from the eye in every direction.  The light fades. Balin lifts his head and raises his hands. Rain falls.  He begins to dance.  Drops of rain fall with laughter, giving substance to the outline of wind. The wind lifts Balin until he is floating in the air, twirling about.  It is impossible to describe his dance with words. It is as if he has become a part of all Creation, and the heavens and the earth both respond to his movements and change.  My heart speeds up; my throat is dry; my hands and feet are icy cold. I’m witnessing an unsought miracle.  He lifts his hand and flowers bloom. He lifts his foot and birds flutter forth.  Balin dances between unnamed peaks, above unmapped lakes. Everywhere he sets foot, joyful mandalas bloom and spread, and he falls into their swirling, colorful centers.  One moment he is smaller than an atom, the next he encompasses the universe. All scales have lost meaning in his dance.  Every nameless life sings to him. He opens his mouth, and all the gods of the paoxiao emerge from his lips.  The spirits meld into his black skin like dark waves that rage and erupt, sweeping him up, up into the air. Behind him, the waves coalesce into an endless web on which all the fruits of creation may be found, each playing its own rhythm. A hundred million billion species are in search of their common origin.  I understand now.  In Balin’s eyes, the soul is immanent in all Creation, and there is no difference between a dragonfly and a man. His nervous system is constructed in such a way as to allow him to empathize with the universe. It is impossible to imagine how much effort he must put into calming the tsunamis that rage constantly in his heart.  Even someone as unenlightened as me cannot be unmoved when faced with this grand spectacle produced by all Life. My eyes swim in hot tears, and threads of ecstasy inside my heart are woven with the dizzying sights in my vision. I stand atop a peak, but a step away from transcendence.  As for the answer I was seeking? I don’t think it’s so important anymore.  Balin absorbs everything into his body. His avatar expands rapidly and then deflates.  He falls.  The world dims, grows indistinct, lifeless.  Balin is like a thin film stretched against the tumbling, twirling space-time. The physics engine’s algorithms undulate the edge of his body as though blown by a wind, and fragments rise into the air like a flock of birds.  His shape is disintegrating, dissolving.  I disconnect Balin from the VR system and take off his helmet.  He lies facedown on the soft, dark gray floor, his limbs spread out, unmoving.  “Balin?” I don’t dare move him.  “Balin?” Everyone in the lab is waiting. Will this joke of an experiment turn into a tragedy?  Slowly, he shifts in place. Then he wriggles to the side like a pond loach until he is once again flattened against the floor, adopting the posture of a gecko.  I laugh. Like my father years ago, I clap my hands twice.  Balin turns, sits up, stares at me.  It is just like that hot and sticky summer night the year I turned thirteen, when we first met.  Originally published in Chinese in People’s Literature, July 2015.    Translated and published in partnership with Storycom.  Chen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "10930 words, novelette\nBalin\nI judge of your sight by my sight, of your ear by my ear, of your reason by my reason, of your resentment by my resentment, of your love by my love. I neither have, nor can have, any other way of judging about them.\n—Adam Smith, The Theory of Moral Sentiments\nBalin’s dark skin, an adaptation for the tropics, appears as aphotic as the abyss of deep space, all reflected light absorbed by the thick layer of gel smeared over his body and the nanometer-thin translucent membrane wrap. Suspended between bubbles in the gel, microsensors twinkle with a pale blue glow like dying stars, like the miniature images of me in his eyes.\n“Don’t be afraid,” I whisper. “Relax. Soon it’ll be better.”\nAs though he understands me, his face softens and wrinkles pile up at the corners of his eyes. Even the scar over his brow is no longer so apparent.\nHe’s old. Though I’ve never figured out how to tell the age in his kind.\nMy assistant helps Balin onto the omnidirectional treadmill, securing a harness around his waist. No matter in which direction he runs and how fast, the treadmill will adjust to keep him centered and stable.\nThe assistant hands the helmet to me, and I put it over Balin’s head myself. His eyes, bulging with astonishment like two light bulbs, disappear into the darkness.\n“Everything will be fine,” I say, my voice so low that no one can hear me, as though I’m comforting myself.\nThe red light on the helmet flashes, faster and faster. A few seconds later, it turns green.\nAs though struck by a spell, Balin’s body stiffens. He reminds me of a lamb who has heard the grinding of the butcher’s knife against the whetstone.\nA summer night the year I turned thirteen: The air was hot and sticky; the scent of rust and mold, prelude to a typhoon, filled my nostrils.\nI lay on the floor of the main hall of my ancestral compound. I flattened my body against the cool, green mosaic stone tiles like a gecko until the floor under my body had been warmed by my skin; then I rolled to the side, seeking a fresh set of tiles to keep me cool.\nFrom behind came the familiar sound of scuffling leather soles: crisp, quick-paced, echoing loudly in the empty hall. I knew who it was, but I didn’t bother to move, greeting the owner of those footsteps with the sight of my raised ass.\n“Why aren’t you in the new house? There’s air conditioning.”\nMy father’s tone was uncharacteristically gentle. The new house he referred to was a three-story addition just erected at the back of the ancestral compound, filled with imported furniture and appliances and decorated in the latest fashion. He had even added a spacious study just for me.\n“I hate the new house.”\n“Foolish child!” He raised his voice, but then quickly lowered it to a barely audible mutter.\nI knew he was apologizing to our ancestors. I gazed up at the shrine behind the joss sticks and the black-and-white portraits on the wall to see if any of them would react to my father’s entreaties.\nThey did not.\nMy father heaved a long sigh. “Ah Peng, I haven’t forgotten your birthday. I had an accident on the way back from up north with the cargo, which is why I’m two days late.”\nI shifted, and wriggled like a pond loach until I found another cool spot on the tiled floor.\nThe cigarette stench on my father’s breath permeated the air as he whispered at my ear, “I’ve had your present ready for a long while. You’ll like it; it’s not something you can buy in a shop.”\nHe clapped twice, and I heard a different set of footsteps approach, the sound of flesh flapping against stone, close together, moist, like some amphibious creature that had just crawled out of the sea.\nI sat up and gazed in the direction of the sound. Behind my father, a lively black silhouette, limned by the creamy yellow light of the hallway light, stood over the algae-green mosaic tiles. A disproportionately large bulbous head swayed over a thin and slight figure, like the sheep’s head atop the slender stick that served as a sign outside the butcher’s shop in town.\nThe shadow took two steps forward, and I realized that the backlighting wasn’t the only reason the figure was so dark. The person—if one could call the creature a person—seemed to be covered from head to toe in a layer of black paint that absorbed all light. It was as though a seam had been torn in the world, and the person-shaped crack devoured all light—except for two tiny glows: his slightly protruding eyes.\nIt was indeed a boy, a naked boy who wore a loincloth woven from bark and palm fronds. His head wasn’t quite as large as it had seemed in shadow; rather, the illusion had been caused by his hair, worn in two strange buns that resembled the horns of a ram. Agitated, he concentrated on the gaps between the tiles at his feet, his toes wiggling and squirming, sounding like insect feet scrabbling along the floor.\n“He’s a paoxiao,” my father said, giving me the name of a creature from ancient myths who was said to possess the body of a goat, the head of a man—though with eyes located below the cheeks, the teeth of a tiger, and the nails of a human, and who cried like a baby and devoured humans without mercy. “We captured him on one of the small islands in the South China Sea. I imagine that he’s never set foot on a civilized floor in his life.”\nI stared at him, stupefied. The boy was about my age, but everything about him made me uneasy—especially the fact that my father gave him to me as a present.\n“I don’t like him,” I said. “I’d rather have a puppy.”\nA violent fit of coughing seized my father. It took him a few moments to recover.\n“Don’t be stupid. He’s worth a lot more than a dog. If I hadn’t seen him with my own eyes, I would never have believed he’s real.” His voice grew ethereal as he went on.\nA susurrating noise grew louder. I shuddered; the typhoon was here.\nThe wind blew the boy’s scent to me, a strong, briny stench that reminded me of a fish, a common, slender, iron-black, cheap fish trawled from the ocean.\nThat’s a good name for him, isn’t it? I thought.\nMy father had long planned out everything about my life up through age forty-five.\nAt eighteen I would attend a college right here in Guangdong Province and study business—the school couldn’t be more than three hours from home by train.\nIn college, I would not be allowed to date. This was because my father had already picked out a girl for me: the daughter of his business partner Lao Luo. Indeed, he had taken the trouble to go to a fortuneteller to ensure that the eight characters of our birth times were compatible.\nAfter graduation, Lao Luo’s daughter and I would get married. By my twenty-fifth year, my father would have his first grandchild. By twenty-eight I would give him another. And depending on the sexes of the first two, he might want a third as well.\nSimultaneous with the birth of my first child, I would also join the family business. He would take me around to pay my respects to all his partners and suppliers (he had gotten to know most of them in the army).\nSince I was expected to work very long hours, who would take care of my child? His mother, of course—see, my father already decided it would be a boy. My wife would stay home; there would be two sets of grandparents; and we could hire nannies.\nBy age thirty I would take over the Lin Family Tea Company. In the five years prior to this point, I would have to master all aspects of the tea trade, from identification of tea leaves to manufacture and transport, as well as the strengths and weaknesses of all my father’s partners and competitors.\nFor the next fifteen years, with my retired father as my advisor, I would lead the family business to new heights: branching out into other provinces and spreading Lin tea leafs all over China; and if I’m lucky, perhaps even breaking into the overseas trade, a lifelong goal that my father had always wanted—but also hesitated—to pursue.\nBy the time I was forty-five, my oldest child would be close to graduating from college. At that point, I would follow in my father’s footsteps and find a good wife for him.\nEverything in my father’s universe functioned as an essential component in an intricate piece of well-maintained clockwork: gear meshed with gear, wheel turned upon wheel, motion without end.\nWhenever I argued with him over his grand plan for me, he always brought up my grandfather, his grandfather, and then my grandfather’s grandfather—he would point at the wall of ancestors’ portraits and denounce me for forgetting my roots.\nThis is the way the Lin family has survived, he would say. Are you telling me you are no longer a Lin?\nSometimes I wondered if I was really living in the twenty-first century.\nI called him Balin. In our topolect, balin meant a fish with scales.\nIn reality, he looked more like a goat, especially when he lifted his eyes to gaze at the horizon, his two hair buns poking up like horns. My father told me that the paoxiao have an incredibly strong sense of direction. Even if they were blindfolded, hogtied, tossed into the dark hold of a ship, hauled across the ocean in a journey lasting weeks, and sold and resold through numerous buyers, they’d still be able to find their way home. Of course, given the geopolitical disputes in the South China Sea, exactly what country was their home was indeterminate.\n“Then do we need to leash him like a dog?” I asked my father.\nHe chuckled unnaturally. “The paoxiao are even more accepting of fate than we. They believe everything that happens to them is by the will of the gods and spirits; that’s why they’ll never run away.”\nGradually, Balin grew used to his new environment. My father repurposed our old chicken coop as his home. It took him a long time to figure out that the bedding was meant for him to sleep on, but even after that, he preferred to sleep on the rough, sandy floor. He ate just about everything, even crunching the chicken bones leftover after our meals. I and the other children of the village enjoyed crouching outside his hutch to watch him eat. This was also the only time when I could see his teeth clearly: densely packed, sharp triangles like the teeth of a shark; they easily ripped apart whatever he stuffed into his mouth.\nAs I watched, I couldn’t help imagining the feeling of those sharp teeth tearing into me; I would then shudder with a complicated sensation, a mixture of pain and addictive pleasure.\nOne day, after Balin had eaten enough, he leisurely crawled out of his enclosure. His thin figure sporting a bulging, round tummy resembled a twig with a swelling gall. A couple of other kids and I were playing “monster in the water.” Balin, waddling from side to side, stopped not far from us and watched our game with curiosity.\n“Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!” Shouting and screaming, we pretended to be fishermen standing on shore (a short brick wall) gingerly sticking our feet into the (nonexistent) river. Dip. Dip. Pull back.\nThe boy who was the water monster ran back and forth, trying to grab the bare feet of the fishermen as they dipped into the river. Only by pulling a fisherman into the river would the water monster be redeemed to humanity, and his unlucky victim would turn into the new water monster.\nNo one remembered when Balin joined our game. But then Nana, a neighbor, abruptly stopped and pointed. I looked and saw Balin imitating the movements of the water monster: leaping over here, bounding over there. Except that he wasn’t grabbing or snatching at the feet of fishermen, but empty air.\nChildren often liked to imitate the speech or body language of others, but what Balin was doing was unlike anything I had ever seen. Balin’s movements were almost in perfect synchrony with Ah Hui, the boy who was the water monster.\nI say “almost” because it was impossible to detect with the naked eye whether there was a delay between Balin’s movements and Ah Hui’s. Balin was like a shadow that Ah Hui had cast five meters away. Each time Ah Hui turned, each time he extended his hand, even each time he paused dispiritedly because he had missed a fisherman—every gesture was mirrored by Balin perfectly.\nI couldn’t understand how Balin was accomplishing this feat, as though he was moving without thinking.\nFinally, Ah Hui stopped because everyone was staring.\nAh Hui took a few steps toward Balin; Balin took a few steps toward Ah Hui. Even the way they dragged their heels was exactly the same.\n“Why are you copying me?” demanded Ah Hui.\nBalin’s lips moved in synchrony, though the syllables that emerged from his mouth were mere noise, like the screeching of a broken radio.\nAh Hui pushed Balin, but he stumbled back because Balin also pushed him at the same moment.\nThe crowd of children grew excited at the farcical scene, far more interesting than the water monster game.\n“Fight! Fight!”\nAh Hui jumped at Balin, and the two grappled with each other. This was a fascinating fight because their motions mirrored each other exactly. Soon, neither could move as they were locked in a stalemate, staring into each other’s eyes.\n“That’s enough! Go home, all of you!” Massive hands picked both of them off the ground and forcibly separated them as though parting a pair of conjoined twins. It was Father.\nAh Hui angrily spat on the ground. The children scattered.\nBalin did not imitate Ah Hui this time. It was as though some switch had been shut off in him.\nSmiling, Father glanced at me, as though to say, Now do you understand why this present is so great?\n“We can view the human brain as a machine with just three functions: sensing, thinking, and motor control. If we use a computer as an analogy, sensing is the input, thinking is the computation carried out by the switches, and motor control is the output—the brain’s only means of interacting with the external world. Do you see why?”\nBefore knowing Mr. Lu, I would never have believed that a gym teacher would give this sort of speech.\nMr. Lu was a local legend. He was not that tall, only about five-foot-eight, his hair cropped short. Through the thin shirts he wore in summers we could see his bulging muscles. It was said that he had studied abroad.\nEveryone in our class was puzzled by why somebody who had left China and seen the world would want to return to our tiny, poor town to be a middle-school teacher. Later, we heard that Mr. Lu was an only child. His father was bedridden with a chronic illness, and his mother had died early. Since there were no other relatives who could care for his father and the old man refused to leave town, saying that he preferred to die where he was born, Mr. Lu had no choice but to move home and find a teaching job. Since his degree was in the neurology of motor control, the principal naturally thought he would be qualified to teach phys ed.\nUnlike our other teachers, Mr. Lu never put on any airs around us. He joked about with us as though we were all friends.\nOnce, I asked him, “Why did you come back to this town?”\n“There’s an old Confucian saying that as long as your parents are alive, you should not travel too far. I’d been far away from home for more than a decade, and my father won’t be with me for much longer. I have to think about him.”\nI asked him another question: “Will you leave after both your parents are gone then?”\nMr. Lu frowned, as though he didn’t want to think about the question. Then he said, “In my field there was a pioneering researcher named Donald Broadbent. He once said that it was far harder to control human behavior than to control the stimuli influencing them. That was why in the study of motor control it was difficult to devise simple scientific laws of the form ‘A leads to B.’”\n“So?” I asked, knowing that he had no intention of answering my question.\n“So no one knows what will happen in the future.” He nodded and took a long drag of his cigarette.\n“Bullshit,” I said, accepting the cigarette from him and taking a puff.\nNo one thought he would stick around our town for long.\nIn the end he was my gym teacher from eighth grade through twelfth grade, married a local woman, and had kids.\nJust the way he predicted.\nAt first we used a pushpin, and then we switched to the electric igniter for a cigarette lighter. Snap! There it was: a pale blue electric arc.\nFather thought this was more civilized.\nThe people who had sold Balin to him had also taught him a trick. If he wanted Balin to imitate someone, he should have Balin face the target and lock gazes. Then he should “stimulate” Balin in some way. Once Balin’s eyes glazed over then the “connection” was established. They explained to my father that this was a unique custom of Balin’s kind.\nBalin brought us endless entertainment.\nAs long as I could remember, I’d always enjoyed street puppetry, whether shadow puppets, glove puppets, or marionettes. Curious, I would sneak behind the stage and watch the performers give life to the inanimate and enact moving scenes of love and revenge. In my childhood, such transformations had seemed magical, and now with Balin, I finally had the chance to practice my own brand of magic.\nI danced, and so did he. I boxed, and so did he. I had been shy about putting on a performance in front of my relatives, but now, through Balin’s body, I became the family entertainer.\nI had Balin imitate Father when he was drunk. I had him imitate anyone who was different in town: the madman, the cripple, the idiot, the beggar who had broken legs and arms and who had to crawl along the ground like a worm, the epileptic . . . my friends and I would laugh so hard that we would roll on the ground—until the relatives of our victims came after us, wielding bamboo laundry rods.\nBalin was also good at imitating animals: he was best at cats, dogs, oxen, goats, pigs; not so good with ducks and chickens; and completely useless when it came to fish.\nSometimes, I found him crouched outside the door to the main house in the ancestral compound spying on our TV. He was especially fascinated by animal documentaries. When he saw prey being hunted down and killed by predators, Balin’s body twitched and spasmed uncontrollably, as though he was the one whose belly was being ripped open, his entrails spilling forth.\nThere were times when Balin grew tired. While imitating a target, his movements would slow and diverge from the target’s, like a wind-up figurine running down or a toy car with almost-exhausted batteries. After a while, he would fall to the ground and stop moving, and no matter how hard we kicked him, he refused to budge. The only solution was to make him eat, stuff him to the gills.\nOther than exhaustion, he never resisted or showed any signs of unhappiness. In my childish eyes, Balin was no different from the puppets constructed from hide, cellophane, fabric, or wood. He was nothing more than an object faithfully carrying out the controller’s will, but he himself was devoid of emotion. His imitation was nothing more than an unthinking reflex.\nEventually, we tired of controlling Balin one-on-one, and we invented more complex and also crueler multiplayer games.\nFirst, we decided the order through rock-paper-scissors. The winner got to control Balin to fight against the loser. The winner of the contest then got to fight against the next kid in line. I was the first.\nThe experience was cool beyond measure. Like a general sitting safe far from the frontlines, I commanded my soldier on the battlefield to press, punch, dodge, kick, roundhouse . . . because I was at a distance from the fight, I could discern my opponent’s intentions and movements with more clarity, and devise better attacks and responses. Moreover, since Balin was the one who endured all the pain, I had no fear and could attack ruthlessly.\nI thought my victory was certain.\nBut for some reason, all my carefully planned moves, as they were carried out by Balin, seemed to lack strength. Even punches and kicks that landed squarely against my opponent did little to shock the opponent, much less to injure him. Soon, Balin was on the ground, enduring a hailstorm of punches.\n“Bite him! Bite!” I snapped my jaw in the air, knowing the power of Balin’s sharp teeth.\nBut Balin was like a marionette whose strings had been cut. My opponent’s fists did not relent, and soon Balin’s cheeks were swollen.\n“Dammit!” I spat on the ground, conceding the fight.\nNow it was my turn to face Balin, controlled by the victor of the last round. I stared at him as ferociously as I could manage. His face was bloody, the skin around his eyes bruised and puffy, but his irises still held their habitual tranquility. I was enraged.\nGlancing out the corner of my eye, I observed the movements of Ah Hui, Balin’s controller. I was familiar with how Ah Hui fought. He always stepped forward with his left foot and punched with his right fist. I was going to surprise him with a low spinning sweep kick to knock him off his feet. Once he was on the ground, the fight would basically be over.\nAh Hui stepped forward with his left foot. Here it comes. I was about to crouch down and begin my sweep, but Balin’s foot moved and kicked up the dirt at his feet, blinding me in an instant. Next, his leg swept low along the ground, and I was the one knocked off my feet. My eyes squeezed shut, I wrapped my arms about my head, preparing to endure a fusillade of punches.\nHowever, the fight did not proceed the way I imagined. The punches did land against my body, but there was no force behind them at all. At first, I thought Balin was probably tired, but soon realized that was not the case. Ah Hui’s own punches against the air were forceful and precise, but Balin apparently was holding back on purpose so that his punches landed on my body like caresses.\nWithout warning, the punching stopped. Something warm and smelly pressed itself against my face.\nLaughter erupted around me. When I finally understood what had happened, a wave of heat suffused my face.\nBalin had sat on me with his nude and dirty bottom.\nAh Hui knew that Balin’s punches were useless, which was why he had come up with such a dirty trick.\nI pushed Balin away and leapt up off the ground. In one quick motion, I pressed Balin to the ground and held him down. Tears poured out of my eyes, stung by the kicked-up sand as well as humiliation and rage. Balin looked up at me, his swollen eyes also filled with tears, as though he knew exactly how I felt at that moment.\nThen it hit me. He’s just imitating. I raised my fist.\n“Why didn’t you punch with real force, like I wanted you to?”\nMy fist pounded against Balin’s thin body, thumping as though I was punching a hollow shell made of fragile plywood.\n“Why don’t you hit me back?”\nMy fingers felt the teeth beneath his lips rattling.\n“Tell me why!”\nA crisp snap of bone. A wound opened over Balin’s right brow, the torn skin extended to the tip of his eye. Pink and white fascia and fat spilled out from under the dark skin, and bright red blood flowed freely, soon pooling on the sandy earth under him.\nA heavy, fish-like scent wafted from his body.\nTerrified, I got off him and stepped back. The other children were stunned as well.\nThe dust settled, and Balin lay still, curled up like a slaughtered lamb. He glanced at me with his left eye, the one not covered in blood. The tranquil orb still betrayed no emotion. In that moment, for the first time, I felt that he was like me: he was made of flesh and blood; he was a person with a soul.\nThe moment lasted only seconds. Almost instinctively, I realized that if I had not been treating Balin as a human being until this moment, then it was impossible for me to do so in the future either.\nI brushed off the dirt on my pants and shoved my way through the crowd of children, never looking back.\nI enter “Ghost” mode, experiencing everything experienced by Balin, trapped in his VR suit.\nI—Balin—we are standing on some beautiful tropical island. Based on my suggestion, the environment artist has combined the sights and vegetation from multiple South China Sea islands to create this reality. Even the angle and temperature of light are calculated to be accurate for the latitude.\nMy intent is to give Balin the sensation of being back home—his real home. But the environment doesn’t seem to have reduced his terror.\nThe view whirls violently: sky, sand, the ocean nearby, scattered vines, and from time to time, even rough gray polygonal structures whose textures have yet to be applied.\nI feel dizzy. This is the result of visual signals and bodily motion being out of sync. The eyes tell my brain that I’m moving, but the vestibular system tells my brain that I’m not. The conflict between the two sets of signals gives rise to a feeling of sickness.\nFor Balin, we have deployed the most advanced techniques to shrink the signal delay to within five milliseconds. In addition, we are using motion capture technology to synchronize the movements between his virtual body and his physical body. He could move freely on the omnidirectional treadmill, but his position wouldn’t shift one inch.\nWe’re treating him like a guest in first class, anticipating all his needs.\nBalin stands rooted to his spot. He can’t understand how the world in his eyes is related to the bright, sterile lab he was in just a few minutes ago.\n“This is useless,” I bark at the technicians through my microphone. “We’ve got to get him to move!”\nBalin’s head whips around. The surround sound system in his helmet warns him of movements behind his body. A quaking wave ripples through the dense jungle, and a flock of birds erupts into the air. Something gigantic is shoving its way through the vegetation, making its way toward Balin. Motionless, Balin stares at the bush.\nA massive herd of prehistoric creatures bursts from the jungle. Even I, no expert on evolutionary biology, can tell that they don’t belong to the same geologic epoch. The technicians have used whatever models they can find in the database to try to get Balin to move.\nStill, he stands there like a tree stump, enduring waves of Tyrannosaurus rexes, saber-toothed tigers, monstrous dragonflies, crocodilian-shaped ancestors of dinosaurs, and strange arthropods as they rush at him and then, howling and screaming, sweep through him like wisps of mist. This is a bug in the physics engine, but if we were to fix the bug and fully simulate the physical experience, the VR user would not be able to endure the impact.\nIt isn’t over yet.\nThe ground under Balin begins to quake and split. Trees lean over and topple. Volcanoes erupt and crimson molten lava spills out of the earth, coalescing into bloody rivers. Massive waves more than ten meters tall charge at our position from the sea.\n“I think you might be overdoing this a bit,” I say into the mike. I hear faint giggles.\nImagine how a primitive human tossed into the middle of such an apocalyptic scene would feel. Would he consider himself a savior who is suffering for the sins of the entire human race? Or would he be on the cusp of madness, his senses on the verge of collapse?\nOr would he behave like Balin: no reaction at all?\nSuddenly, I understand the truth.\nI back out of Ghost mode, and remove Balin’s helmet. Sensors are studded like pearls all over his skull. His eyes are squeezed tightly shut, the wrinkles around them so deep that they resemble insect antennae.\n“Let’s stop here today.” I sigh helplessly, recalling that afternoon long ago when I had punched him until he bled.\nAs the time approached for all the high school students to declare our intended subjects of study before the college entrance examination, the war between my father and me heated up.\nAccording to his grand plan, I was supposed to major in political science or history in college, but I had zero interest in those subjects, which I viewed as painted whores at the whim of those in power. I wanted to major in a hard science like physics, or at the minimum biology—something that according to Mr. Lu involved “fundamental questions.”\nMy father was contemptuous of my reasons. He pointed to the houses in our ancestral compound, and the tea leaves drying over the racks in the yard, glistening like gold dust in the bright sunlight.\n“Do you think there are any questions more fundamental than making a living and feeding your family?”\nIt was like discussing music theory with a cud-chewing cow.\nI gave up trying to convince Father. I had my own plan. With Mr. Lu’s help, I obtained permission from the teachers to cram for common subjects like math, Chinese, and English with students who intended to declare for the humanities, but then I would sneak away to study physics, chemistry, and biology with the science students. If class schedules conflicted, I would make my own choices and then make up the missed work later.\nMy teachers were willing to let me get away with it because they had their own selfish hopes. Rather than forcing someone who had no interest to study politics and history, they thought they might as well let me follow my heart. If they got lucky, it was possible that I would do extraordinarily well on the college entrance examination as a science student and bring honor to them all.\nI thought my plan would fool my busy father, who was away from home more often than not. I was going to surprise him at the last minute, when I had to fill out the desired majors and top choice schools right before the examination. Even if he blew up at me then, it would be too late.\nI was so naïve.\nOn the day we were supposed to fill out the forms, all my friends received a copy of the blank form except me. I thought the head teacher had made a mistake.\n“Uh . . . your father already filled it out for you.” The teacher dared not meet my eyes.\nI don’t remember how I made it home that day. Like a lost, homeless dog, I wandered the streets and alleyways of the town aimlessly until I found myself in front of the ancestral compound.\nFather was entertaining himself by playing with Balin. He had dug up an old set of army uniforms and put them on Balin. The loose folds and wide pant legs hung on Balin like a tent, making him resemble a monkey who had stolen some human clothing. Father had Balin follow orders he had learned during the time he was in the army: stand at attention, stand at ease, right dress, left dress, march in place, and so on. When I was in elementary school, Father had enjoyed ordering me around like a drill sergeant at the parade ground, and I had hated those “games” more than anything else.\nIt had been years since he had tried anything like that with me, but now he had found a new recruit.\nA soldier who would obey every one of his commands without question.\n“One-two-one! One-two-one! Forwaaaaard-march!” As he barked out the commands and demonstrated the moves, Balin goose-stepped around the yard, his pant legs muddy as they dragged on the ground.\nI stepped between them and faced my father. “You have no intention of letting me go to college, is that it?”\n“Riiiiight-dress!” My father whipped his head to the right and shuffled his feet. I heard the sound of feet scrabbling against the ground in synchrony behind me.\n“You knew about my plan a long time ago, didn’t you?” I demanded. “But you said nothing before you played your trick so I wouldn’t have a chance to stop you.”\n“Maaaaarch in place!”\nEnraged, I turned around and held Balin still, not allowing him to proceed any longer like a mindless drone. But he seemed unable to stop. The pant legs slapped against the ground, whipping up wisps of dust.\nI grabbed his head and forced him to lock gazes with me. I pulled out the electric lighter from my pocket and flicked it; a pale blue arc burst into life next to his temple. Balin screamed like a baby.\nI looked into his eyes; now he belonged to me.\n“You have no right to control me! All you care about is your business. Have you ever thought about what I want for my future?”\nAs I screamed at my father, Balin marched around us, his finger also pointing at Father, his mouth also screaming. The circle he made around the two of us tightened on each loop.\n“I’m going to college whether you want me to go or not. And I’m going to study whatever I want!” I clenched my jaw. Balin’s finger was almost touching my father. “Let me tell you something, Father: I never want to become like you.”\nThe militaristic arrogance melted from my father. He stood there, his face fallen and back hunched, like crops that had been bitten by frost. I expected him to hit back, hard, as was his wont, but he did not.\n“I knew. I’ve always known that you don’t want to walk the path others have paved for you,” my father’s voice faded until it was barely a whisper. “You remind me so much of myself when I was your age. But I have no choice—”\n“So you want me to repeat your life?”\nMy father’s knees buckled. I thought he was going to fall, but he knelt on the ground and embraced Balin.\n“You can’t leave!” he shouted. “I know what’s going to happen if you go away to college. No one who leaves this town ever returns.”\nI struggled against the empty air so that Balin, moving in sync with me, could free himself from my father’s grasp. As long as I could remember, my father had never hugged me.\n“Don’t be so childish! Open your eyes! See the world for what it is.”\nBalin was like a wind-up toy that had malfunctioned. His limbs whipped about in a frenzy; the military uniform he wore was torn in multiple places, revealing the dark, unreflective skin.\n“The way you spoke just now is just like your mother.” Another pale blue spark came to life over Balin’s temple. Abruptly, he ceased struggling, and held my father tightly like a long-lost lover. “Are you going to abandon me just like she did?”\nI was stunned.\nI had never thought about this matter from my father’s perspective. I had always thought that he wanted to keep me close at hand because he was selfish, narrow-minded, but I had never seen it as a reaction to the fear of being abandoned. My mother had left us when I was too young to view it as trauma, but it cast a shadow over the rest of his life.\nWordless, I approached my father, who held on to Balin tightly. I bent down and caressed his spine, no longer as straight as in my memory. Maybe this was as close as the two of us would ever be.\nI saw the tears spilling from the corners of Balin’s eyes. For a moment, I doubted myself.\nMaybe it isn’t just about control and power, but also love.\nThere are many things I wish I had known before I turned seventeen.\nFor example, the fact that most of the structures in the human brain have something to do with motor functions, including the cerebellum, the basal ganglia, the brainstem, the motor region of the cerebral cortex and the direct projection of the somatosensory cortex to the primary motor cortex, and so on.\nFor example, the cerebellum contains more neurons than any other part of the brain. As humans evolved, the cerebellar cortex grew in step with the rapidly increasing volume of the frontal lobe.\nFor example, any interaction with the outside world, whether informational or physical, including moving limbs, manipulating tools, gesticulating, speaking, glancing, making faces—each ultimately requires activating a series of muscles to realize.\nFor example, an arm contains twenty-six separate muscles, and each muscle on average contains a hundred motor units, each made up by a motor neuron and its associated skeletal muscle fibers. Thus, the motion of a single arm is governed by a possibility space at least 2^2600 in size, a number far greater than the total number of atoms in the universe.\nHuman motion is so complex and subtle, and each casual movement represents the result of so much computation, analysis, and planning that even the most advanced robots are incapable of moving as well as a three-year-old.\nAnd we haven’t even discussed all the information, emotion, and culture embodied in human motion.\nOn the way to the high-speed rail station, my father maintained his silence, only clutching my suitcase tightly. The northbound train finally appeared before us, shiny, new, smooth in outline, like something that was going to slide into the unknowable future the moment the brakes were released.\nIn the end, my father and I failed to reach a compromise. If I was going to college in Beijing, he would not pay for any of my expenses.\n“Unless you promise to return,” he said.\nI gazed through him, as though I was already seeing the future, a future that belonged to me. For that, I was willing to be the black sheep from a white flock, the sheep in perpetual exile.\n“Dad, take care of yourself.”\nI grabbed my suitcase to board the train, but my father refused to let go of the handle, and the suitcase awkwardly hung between us. A moment later, both of us let go, and the suitcase fell to the ground.\nI was about to erupt when my father slapped his heels together to stand at attention, giving me a crisp military salute. Without a word, he turned and left. He had once told me that it was bad luck to say goodbye before going to war. Better to leave each other with other memories.\nI watched his diminishing figure, raised my hand, and returned his salute gently.\nI did not truly understand the meaning in my gesture.\n“I never thought we’d fail because of a wild man,” says my thesis advisor Ouyang, who is also the project leader. He claps me on the shoulder, his smile disguising the sharp edges of his words. “It’s no big deal. Let’s keep on working at this. We still have time.”\nBut I know him too well. What he really means is We are running out of time.\nOr, to put it another way, This is your idea, your project. Whether you can get your degree in time will depend on what you do next.\nOf course he will never mention how much of our time he has taken up in the past to handle the random projects he promised business investors.\nFrustrated, I massage my scalp. My eyes fall on Balin, now shut in his pink-hued pet enclosure. Eyes glazed, he stares at the floor, as though still not recovered from his ordeal in the VR environment. The contrast between the pink pet enclosure and his appearance is comical, but I can’t make myself laugh.\nWhat would Mr. Lu do?\nEverything began with that idle conversation with him years ago concerning “A leads to B.”\nTraditional theorists believe that motor control is the result of stored programs. When a person wants to move a certain way, the motor cortex picks out a certain program from its stored repertoire and carries it out much the same way a player piano follows the roll of perforated paper. The program’s instructions determine the activation patterns in the motor regions of the cortex and the spinal cord, which then, in turn, activate the muscles to complete the motion.\nThis naturally raises the question: the same motion can be carried out in infinite ways. How does the brain store an infinite number of motor programs?\nRemember that arm whose potential possible number of movements exceeds the number of atoms in the universe?\nIn 2002, the mathematician Emanuel Todorov came up with a theory in an attempt to answer this question. Basically, he argued that motor control is really an optimization problem for the brain. Optimality is defined by high-level performance criteria such as maximizing precision, minimizing energy consumption, minimizing control effort, and so on.\nIn the optimization process, the brain relies on the processing powers of the cerebellum. Before the commands for movement have reached muscles, the cerebellum predicts the results of anticipated motion, and then, combined with real-time sensory feedback, helps the brain evaluate and coordinate the motor commands.\nA simple example: when ascending or descending a set of stairs, we will often stumble due to miscounting the number of steps. If feedback-based adjustments are made in time, we can recover and not fall. Feedback, of course, is often noisy and involves a delay.\nTodorov’s mathematical model is compatible with all known evidence concerning the neural mechanisms of motor control and can be used to explain all kinds of behavior phenomena. Given some physical parameters, it’s even possible to predict the resulting motion using his model: for instance, how an eight-legged creature would jump in Pluto’s gravity.\nPhysics engines based on his models are used by Hollywood to produce naturalistic movements for avatars in virtual environments.\nBy the time I was in college, the Todorov model was already treated as textbook authority. Experiment after experiment provided more evidence that it was correct.\nAnd then one day, Mr. Lu and I discussed Balin.\nAfter I left home for college, he and I had kept in touch via email. He was like an oracular AI from whom I could get answers for everything: academics, awkward social situations, even relationship advice. We wrote long emails back and forth discussing questions that must have seemed ridiculous to anyone else, such as “would an out-of-body experience engineered by technology violate religion’s claim on spirituality?”\nBy an unspoken agreement, both of us avoided talking about my father.\nMr. Lu told me that Balin had been sold to another family in town, a nouveau riche household which was often mocked for conspicuous acts of consumption that appeared ridiculous in the townspeople’s eyes.\nI had known that Father’s business had run into a rough patch, but I hadn’t imagined that he would be so short on cash as to consider selling Balin.\nI shifted the topic to the Todorov mathematical model, and a new thought struck me. Balin was capable of imitating movements with perfect precision. Suppose we had him perform two sets of identical movements: one through subconscious imitation and the other by his own will; do these two sets of movements go through the same process of motor control?\nMathematically, there was only a single optimal solution, but was there a difference in the way the optimal solution was arrived at?\nIt took Mr. Lu three days to get back to me. Unlike his usual free-flowing, loquacious style, this time he wrote only a few lines:\nI think you’re asking a very important question, one whose importance perhaps you don’t even realize. If we can’t distinguish between mechanical imitation and conscious, willed movement at the level of neural activity, then the question is: Does free will truly exist?\nI couldn’t sleep that night. I spent two weeks designing the prototype experiment, and spent even more time studying the feasibility of my proposed study, soliciting feedback from my mentors and other professors. Then I submitted my project for approval.\nIt wasn’t until everything was ready that I realized that this experiment, one seeking to address a “fundamental question,” lacked a fundamental, required component.\nI had no choice but to break my promise to myself and go home.\nI’m going just to get Balin, I reminded myself again and again. Just for Balin.\nJust like how A leads to B. Simple, right?\nI once read a science fiction novel called The Orphans, which was about aliens who had come to Earth. They could imitate the appearance of specific humans and pass as human in society, but they couldn’t perfectly capture the characteristic ways their targets moved or the subtleties of their facial expressions. Many aliens, exposed as frauds, were hunted down by humans.\nIn order to survive, the aliens had to study how humans communicated via body language. They pretended to be abandoned orphans, and, once taken in by kind-hearted families, proceeded to use the opportunity of living together to imitate the mannerisms and expressions of their adoptive parents.\nTo the parents’ surprise, their children became more and more like them. And once the alien orphans decided that they had learned enough, they killed their father or mother, took on their appearance, and took their place. The scene where an alien killed his father and took his mother as his wife was unforgettable.\nThough it became harder to tell aliens apart from humans, people finally discovered the fundamental difference between the extraterrestrials and humans.\nAlthough the aliens were able to imitate human movements with perfect fidelity, they lacked the mirror neurons unique to human brains, and thus were unable to intuit the emotional shifts occurring behind human faces or to experience similar neural activation patterns in their own minds. In other words, they lacked the capacity for empathy.\nAnd so humans devised an effective means to detect aliens: bring harm to those closest to the disguised aliens and observe the aliens for signs of pain, fear, or rage. The test was called “the stabbing needle test.”\nThe story’s lesson seems to be: humanity isn’t the only species in the universe that has difficulty relating to their parents.\nMr. Lu knew everything about Balin. He thought of the paoxiao as an example of overdevelopment in the mirror neuron system. He was fascinated by Balin, but he disapproved of the way we treated him.\n“But he’s never resisted or even wanted to run away,” I used to counter.\n“Overactive mirror neurons lead to a pathological excess of empathy,” he said. “Maybe he just couldn’t tolerate the look of abandonment in his tormentors’—your—eyes.”\n“I guess that could be true,” I said. “I must be an example of underdevelopment of mirror neurons.”\n“Cold-blooded, one might say.”\nBut when Mr. Lu took me to find Balin on my return, I realized that I wasn’t the most cold-blooded, not by far.\nBalin was naked, his body full of bruises and lacerations. Thick, rusty chains were locked about his neck and shackled his arms and legs. He was shut inside a tiny brick-and-mud enclosure, about five feet on each side. The interior was dim, and the stale air saturated with the gag-inducing stench of excrement and rotting food. He was thinner than I remembered. Flies buzzed about his wounds, and the outlines of his skeleton poked from under his skin. He was like an animal about to be sent to the butcher’s.\nHe looked at me, and there was no reaction in his eyes at all. It was just like the first time we had met, that summer night when I was thirteen.\n“They had him mirror the movements of animals . . . mating—” Mr. Lu was unable to continue.\nMemories of the past flood into my mind in a flash.\nI have no recollection of what happened next. It was as though I had been possessed by some spirit, and I moved without remembering wanting to move.\nAccording to Mr. Lu, I rushed into the house of Balin’s new owners, and grabbed the Pomeranian beloved by the family patriarch’s daughter-in-law. I opened my jaw and held the neck of the whimpering creature between my teeth.\n“You said, ‘If you don’t let Balin go, I’m going to bite all the way through,’” Mr. Lu said.\nI spat on the ground. Though I didn’t remember any of it, this did sound like something I would do.\nMr. Lu and I rushed Balin to the hospital. As we were preparing to leave, Mr. Lu stopped me. “Do you want to see your father?”\nThat was how I found out that my father had been hospitalized. Once in college, I had had almost no contact with him, and gradually, I had stopped even thinking about him.\nHe looked about ten years older. Tubing was stuck into his nostrils and arms. His hair was sparse, and his gaze unsteady. A few years ago, when Pu’er tea was all the rage, he had gambled with all his chips and ended up as the last fool to buy in at the height of the mania. He was stuck with warehouses full of tea leaves as the price collapsed, and ended up losing just about everything.\nAs he looked at me, I noted that his expression reminded me of Balin’s, as though he was saying, I knew you’d be back.\n“I . . . I’m here for Balin,” I said.\nMy father saw through my facade and cracked a smile, revealing a mouthful of teeth stained yellow by years of smoking.\n“That little gremlin? He’s much smarter than you think. We all thought we were controlling him, but sometimes I wonder if he was controlling all of us.”\nI didn’t know what to say.\n“It’s the same way with you. I always thought I was the one in charge. But after you left, I realized that you had always held a thread whose other end is looped around my heart. No matter how far away you are, as soon as you twitch your fingers, I suffer pangs of heartache.” My father closed his eyes and put his hand over his chest.\nSomething was stuck in my throat.\nI walked up to his bed and wanted to lean down to embrace him. But halfway through the motion, my body refused to obey. Awkwardly, I clapped him on the shoulder, straightened up, and walked away.\n“I’m glad you’re back,” my father said from behind me, his voice hoarse. I didn’t turn around.\nMr. Lu was waiting for me at the door. I pretended to scratch my eyes to disguise the emotional turmoil.\n“Do you think fate likes to play jokes on us?” he asked.\n“What do you mean?”\n“You wanted to escape the route your father had paved for you, but in the end, you ended up in the same place as me.”\n“I think I’m coming around to your way of thinking.”\n“What’s that?” he asked.\n“No one knows what will happen in the future.”\nWe’ve failed again.\nThe original premise is very simple: Balin’s hypertrophic mirror neuron system makes him the ideal experimental subject because his imitation is a kind of instinct. Thus, his movements during imitation ought to be free from much of the noise and interference found in human motor control due to conscious cognition.\nWe use non-invasive electrodes to capture the neural activity in Balin’s motor cortex as he’s imitating a sequence of movements. Then we have him repeat the sequence under his own will and use motion capture to ensure that we get a perfect match between the two sets of movements. Mathematically, that means that the two sequences are indistinguishable; they are the same motion.\nThen, by comparing the two sets of neural patterns captured during the process, we can find out if the same neural signals were activating the same regions of the motor cortex in the same sequence and with the same strength.\nIf there are differences, then the Todorov model, accepted as gospel, will have been revealed to be seriously lacking.\nBut if there are no differences, the consequences will be even more severe. Maybe human beings are doing nothing but imitating the behaviors of other individuals, and are only operating under the illusion of free will.\nNo matter what, the result of the experiment ought to be earth-shattering.\nYet, the experiment was a failure from the very beginning. Balin has refused to look into anyone’s eyes, and has refused to imitate anyone’s movements, including me.\nI can guess the reason, but I have no solution. My team has vowed to solve the secret of human cognition, yet we can’t even heal the psychic trauma inflicted on a mere “primitive.”\nI thought of the idea of using virtual reality. Situating Balin in an environment completely disconnected from the reality around him may help him recover his normal habits.\nAnd so we went through a series of virtual environments: islands, glaciers, deserts, even space; we manufactured incredible catastrophes; we even devoted enormous effort to construct avatars of paoxiao, hoping that the sight of others of his kind would awaken his dormant mirror neurons.\nWithout exception, all these tricks have failed.\nNow, at midnight, only I and the zombie-like Balin remain in the lab. Everyone else has left. I know what they’re thinking: this experiment is a joke, and I’m the man who has finished telling the joke and looks around confused, unsure why everyone else is laughing.\nBalin is curled up into a ball in the pet house made from pink foam boards. I remember Mr. Lu’s words. He was right. I’ve never treated Balin as a person, not even now.\nA colleague once implanted a wireless receiver into a rat’s brain. By electrically stimulating the rat’s somatosensory cortex and the medial forebrain bundle, my colleague was able to induce sensations of pleasure and pain in the rat, thereby controlling where the rat moved.\nThere’s no qualitative difference between that and what I’m doing to Balin.\nI am indeed a bastard whose mirror neurons are atrophied.\nUnbidden, the memory of a children’s game resurfaces, the game in which Balin first showed us his fantastic ability.\n“Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!”\nI chant in a low voice, embarrassed. I pretend to be a fisherman, dipping my foot into the imaginary river from the shore and quickly pulling back.\nBalin glances at me.\n“Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!” My chant grows louder.\nBalin stares at my clumsy movements. Gently, slowly, he crawls out of the pet house, stopping a few steps away from me.\n“Shrimp! Shrimp! Watch out if you don’t want one to bite off your toes!” My legs are jerking wildly like some caricature of a pole dancer in a club.\nAbruptly, Balin jumps at me with incredible speed, moving the exact way Ah Hui used to.\nHe remembers; he remembers everything.\nBalin leaps and bounds, grabbing at my dipping leg. A baby-like gurgle emerges from his throat. He’s laughing. This is the first time I’ve ever heard him laugh in the all the years I’ve known him.\nHe is now re-enacting the movements of everyone in town who had been a bit different. All their movements seem to have been engraved in Balin’s brain, so vivid and precise that I can recognize who he’s replaying at a glance. In turn, he becomes the madman, the cripple, the idiot, the beggar who had broken legs and arms, and the epileptic; he is a cat, a dog, an ox, a goat, a pig, and a crude chicken; he is my drunk father and me, dancing about in joy.\nIn a moment, I’ve traveled through thousands of kilometers and returned to the hometown of my childhood.\nWithout warning, Balin begins to play two roles simultaneously, re-enacting the day of the rupture between me and my father.\nWatching the argument between me and my father as an observer is eerie: the movements before me are so familiar, yet my memories have grown indistinct, unreal. I was so angry then, so stubborn, like a wild horse that refused to take the reins. My father, on the other hand, was so pitiful and meek. Again and again, he backed off; he suffered. It is nothing like how I remember the scene.\nBalin quickly switches between roles, gesturing and posturing like a skilled mime.\nThough I know what happens next, when it does happen I’m not prepared.\nBalin wraps his arms about me, just the way my father back then wrapped his arms about him. He hugs me tightly, his head buried in the crook of my neck. I smell that familiar fish-like scent, like the sea, and a warm liquid flows down my collar like a river that has absorbed the heat of the sun.\nI stay still, thinking about how to react.\nThen I give up thinking, allowing my body to react and open up, hugging him back the way I would hug an old friend, the way I would hug my father.\nI know that I have owed this hug for far too long, to him and to my father.\nI think I finally understand how to solve the problem.\nAt the end of The Orphans, the team that had come up with the stabbing needle test found, to their horror, that even when they harmed the aliens passing as human, their dear ones, the real humans, also failed to react. Their mirror neuron systems would not activate.\nHumanity is a species that was never designed to truly empathize with another species.\nJust like those aliens.\nGood thing that’s just a bad piece of science fiction, isn’t it?\n“We need to think about this from his perspective,” I say to Ouyang.\n“His?” It takes a full three seconds for my advisor to figure out what I mean. “Who? The primitive?”\n“His name is Balin. We should make him the focus, and construct an environment that will put him at ease, rather than cheap tourist scenes we imagine he’ll enjoy.”\n“What are you talking about? You should be concerned about how you’re going to finish your project and get your degree, instead of worrying about the feelings of some primitive. Don’t waste my time.”\nMr. Lu once said that the progress of a civilization should be measured by its degree of empathy—whether members of the civilization are capable of thinking from the values and perspectives of others—and not some other objectified scale.\nSilently, I stare at Ouyang’s face, trying to discern some trace of civilization.\nThe face, so carefully maintained to be wrinkle-free, is a wasteland.\nI decide to work on the problem myself. Several younger students join me on their own initiative, restoring some of my faith in humanity. To be sure, most of them are motivated by their hatred of Ouyang, and it’s not a bad way to earn a few credits.\nThere’s a virtual reality program called iDealism, which claims to be capable of generating an environment based on brainwave patterns. In reality, all it does is select pre-existing models from a database whose brainwave signatures match the user’s—at most it adds some high-resolution transitions. We hacked it for our own use, and since our lab’s sensors are several orders of magnitude more sensitive than consumer-grade sensors, we add a lot of new measurement axes to the software and connect it to the largest open-source database, which contains demo data from virtual reality labs from around the world.\nAnd now, Balin is going to be the Prime Mover of this virtual universe.\nHe will have plenty of time to explore the linkage between this world and every thought in his mind. I will record every move and gesture Balin makes. Then, when he returns to the real world, I will reconnect with him. I will imitate to the best of my ability each of his gestures. The two of us will be as two parallel mirrors, reflecting each other endlessly.\nI put the helmet on Balin’s head. His gaze is as placid as water.\nThe red light flashes, speeds up, turns green.\nI enter Ghost mode, and bring up a third-person POV window in the upper-right hand corner. In it, I see a tiny avatar of Balin trembling in place.\nBalin’s world is primordial chaos. There is no earth, no heaven, no east, west, north, or south. I struggle against the vertigo.\nFinally, he stops shaking. A flash of lightning slowly divides the chaos, determining the location of the sky.\nThe lightning extends, limning a massive eye in the cloud cover. A web of fine lightning feelers spreads from the eye in every direction.\nThe light fades. Balin lifts his head and raises his hands. Rain falls.\nHe begins to dance.\nDrops of rain fall with laughter, giving substance to the outline of wind. The wind lifts Balin until he is floating in the air, twirling about.\nIt is impossible to describe his dance with words. It is as if he has become a part of all Creation, and the heavens and the earth both respond to his movements and change.\nMy heart speeds up; my throat is dry; my hands and feet are icy cold. I’m witnessing an unsought miracle.\nHe lifts his hand and flowers bloom. He lifts his foot and birds flutter forth.\nBalin dances between unnamed peaks, above unmapped lakes. Everywhere he sets foot, joyful mandalas bloom and spread, and he falls into their swirling, colorful centers.\nOne moment he is smaller than an atom, the next he encompasses the universe. All scales have lost meaning in his dance.\nEvery nameless life sings to him. He opens his mouth, and all the gods of the paoxiao emerge from his lips.\nThe spirits meld into his black skin like dark waves that rage and erupt, sweeping him up, up into the air. Behind him, the waves coalesce into an endless web on which all the fruits of creation may be found, each playing its own rhythm. A hundred million billion species are in search of their common origin.\nI understand now.\nIn Balin’s eyes, the soul is immanent in all Creation, and there is no difference between a dragonfly and a man. His nervous system is constructed in such a way as to allow him to empathize with the universe. It is impossible to imagine how much effort he must put into calming the tsunamis that rage constantly in his heart.\nEven someone as unenlightened as me cannot be unmoved when faced with this grand spectacle produced by all Life. My eyes swim in hot tears, and threads of ecstasy inside my heart are woven with the dizzying sights in my vision. I stand atop a peak, but a step away from transcendence.\nAs for the answer I was seeking? I don’t think it’s so important anymore.\nBalin absorbs everything into his body. His avatar expands rapidly and then deflates.\nHe falls.\nThe world dims, grows indistinct, lifeless.\nBalin is like a thin film stretched against the tumbling, twirling space-time. The physics engine’s algorithms undulate the edge of his body as though blown by a wind, and fragments rise into the air like a flock of birds.\nHis shape is disintegrating, dissolving.\nI disconnect Balin from the VR system and take off his helmet.\nHe lies facedown on the soft, dark gray floor, his limbs spread out, unmoving.\n“Balin?” I don’t dare move him.\n“Balin?” Everyone in the lab is waiting. Will this joke of an experiment turn into a tragedy?\nSlowly, he shifts in place. Then he wriggles to the side like a pond loach until he is once again flattened against the floor, adopting the posture of a gecko.\nI laugh. Like my father years ago, I clap my hands twice.\nBalin turns, sits up, stares at me.\nIt is just like that hot and sticky summer night the year I turned thirteen, when we first met.\nOriginally published in Chinese in People’s Literature, July 2015.\nTranslated and published in partnership with Storycom.\nChen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/chen_04_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Balin by Chen Qiufan, translated by Ken Liu"}