{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gregory Feeley", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1LMCg5jqnYprY3wUm1JdlO0MOo8=", "id": null, "license": null, "comments": "", "raw_text": "7540 words, novelette  Wandering Rocks  Naiad and Thalassa danced as no pair of water deities ever had, racing about Neptune in an endless courtship never to be consummated. If Naiad sped with purposeful regularity even as Thalassa fell slowly behind its inner companion, the sea-goddess tilted its orbital plane so that the smaller nymph would pass above and below it, as though yearning to glimpse its beloved from different angles. The sinuous beauty of such resonance called out to be immortalized in song, and Huong gave his composition a 69/73 time signature, an unearthly (in every sense) feat that no human before or after would ever replicate.  Racing about Neptune more quickly than the planet itself rotated, the two moons were undergoing tidal deceleration and would someday, doomed lovers, spiral down into its raging depths.  “Together?” Koishi asked.  “They will never be together.” Like Castor and Pollux, who crossed the solar system as one but, spinning about the great stone that hid each from the other, never met. Held rigidly apart by the outflung arms of the Centaur, the life modules had sheltered its children in Earthlike gravity for a generation.  “Or they will break up into rings.” Whether this would happen was still an open question, to be settled only when the two moons’ composition was studied in greater detail. This was not a priority for Outreach, which was concentrating on exploring Triton and mining Proteus.  “Perhaps only Naiad will, leaving Thalassa bereft.” Raina, contriving a story from a story (as apparently one did), smiled at this.  Koishi inclined his head respectfully, though his thoughts were elsewhere.  “In any event, Naiad is not your concern. Is it even nearby right now?”  “No, ma’am. By the time I reach Thalassa, it will be forty degrees ahead and pulling away. I am unlikely to remain long enough to see it come ’round again.”  “So your return is not scheduled for maximum fuel efficiency? No, you will have ample reaction mass, won’t you? Kick off from the moon on a spray of its own substance.” She nodded wisely, as though this was something that every kid didn’t know.  “Still, departure hour is definitely fixed.” Koishi glanced at her office’s old-fashioned wall display, though he was in no danger of losing track of the time.  “A voyage of ninety thousand kilometers,” she mused. “By local standards, not too far from home.”  “The distance will triple if I wait long enough.”  “Indeed, unlike in my parents’ day. The distance between Qingdao and Guangzhou never changed.” Koishi smiled politely. The adults joked about how kids hated being told about the way things were back on Earth, but they never stopped doing it.  “You have never been more than nine hundred meters from this spot,” she continued. “This will be a big experience for you.”  Koishi forbore to point out that he had in fact traveled almost three billion kilometers in his life. “The solitude will be a change,” he agreed.  “That’s right; you have spent your entire life here.”  Again Koishi smiled. Here was a private office that Raina need share with no one else, at least for six hours a day. It was small, but Koishi had shared a smaller space with two other boys for most of his childhood.  “Last chance to savor the gravity,” he said, lifting his legs to sink a bit farther into the chair. He had spent his life regarding low gravity as a treat, for the kids were rarely permitted into the ship’s inner levels. If there was anything he worried about, it was loneliness.  He set his feet down with a thump and stood, as though savoring the effort involved. “I should go,” he said. There was no need to rush, but the thought that Raina would make a point of sending him on his way compelled him to act first. Gravely, he thanked her and accepted her words of leave-taking, which contained nothing new.  It was four levels down the shaft, just enough for Koishi to feel himself pressed slightly to the side. When he was a child, class trips to the Hull ended with a thrilling descent back to Castor, as fast as they could persuade the Onboard to go, with the kids pressed squealing against the wall by Coriolis’ invisible hand. None of that where you’re going, he told himself.  The launch deck was busy, but nobody was working on Koishi’s departure. If any of his classmates were embarking on their own missions today, he did not see them.  He walked over to the blister and stood looking at it. Beneath the bulge lay a pore in the Hull wall leading to the surface, blocked only by his tiny craft. Once installed, he would fall into the void.  It was peculiar to reflect that he had never actually seen the ship, except from the inside and in ghostly rotating images. Designed for a crew of one, it was smaller than any of the craft that had nestled beneath the Centaur’s surface during its years-long voyage. Built as part of the fleet to replace those lost in the Break, it had, like most of them, never flown. EV-32 it was designated, lovely in its unbroken curves, but bare of human use.  “Give it a name,” they told him, so he called it River Stone, because he had once held a reproduction of one and was struck by its rounded beauty.  No flowery speeches. Koishi spoke the words that caused the blister’s skin to peel back and stared down into the opening below. He had crawled down it several times before in recent weeks, though only to emerge an hour or two later.  This time for real, he thought, and lowered himself through the access tube. The cabin was the smallest space he had ever occupied, and he was glad of the time he had taken to acclimate himself.  Eight minutes, time enough to adjust the couch for acceleration, check (needlessly) on the power and subsistence supply, and close his eyes to meditate. Carefully, he donned and sealed his helmet, a needless regulation for so routine a launch, and let the suit run its systems check.  Koishi had never communicated with anyone in Earthspace, so he had never experienced the disconcerting delays imposed by light speed constraints. It would become discernible as Thalassa and the Centaur’s orbits grew farther apart. Of course, if he completed this assignment successfully, and won advancement enough to someday find himself working in the distant moons, even a simple conversation with the Centaur would be almost impossible.  Assignments, rather. Koishi had a big one, of course, a set of academic hurdles to surmount before he could commence the trek toward such a promotion. But it was the other one that he found himself not thinking about.  Twelve seconds. With a warning chime, the couch slid backward and up, so that he was hanging from its straps, staring at the screen as down a pit. Two seconds, one.  Had the craft simply been released from its constraints, it would have slid gently down the launch tube and into space by the force of the Centaur’s spin. Koishi knew this wouldn’t happen, and the sudden kick as the magnetic pulse drove him deep into the couch.  In an instant River Stone was through the tube and into space, where he felt an instant’s free fall before the lasers struck the ship’s base and he was cast forward once more. Five Gs—“That’s basically nothing,” the adults had assured him—for several minutes: “We can all remember worse.” Koishi was an obedient and respectful young man, but as the pleasurable effects of vestibular displacement began to grow, he felt happy to leave such condescension behind.  He was leaving everything behind, if only for the duration of his fieldwork. Thalassa, second moon out from Neptune, had never been officially explored; “has never—unless one of the Rats escaped there—been visited,” one of his instructors had said with an offhand laugh. It was a signal honor to be first to go there, to document its resources, explore its depths, take samples, and make a formal evaluation. And if his mission encompassed more than was listed on his actual syllabus, he was simply proving his loyalty.  It isn’t betrayal if you don’t know the person.  The launch laser cut off abruptly, casting him into free fall and the giddiness of zero-G. This would be his condition for the weeks to come; the microgravity of Thalassa, should he stand upon its surface, would be imperceptible. How would it feel to eat and sleep thus?  The viewscreen, directed at the point Thalassa would reach in nineteen hours, showed Neptune to one side, dim in the weak sunlight. Koishi watched for a minute and then ran a systems check, though the River Stone monitored itself better than he could. Tradition held that captains keep a log, so he raised a hand and noted the time, the ship’s course, and the systems status.  Finally he spoke. “I’m not alone, am I?”  “No.”  Koishi sighed. After a moment he asked, “Are you a Being, or simply the ship’s Onboard?”  “Although the EV-32 is capable of vocalizing responses, I am not it. Whether my nature approximates what students and others mean when they speak of discrete ‘Beings’ active as distributed entities within the Centaur is not relevant to your responsibilities.  “But yes, my presence here is related to your mission.”  Because no response was required, Koishi thought quietly for several minutes. The voice was not obviously male or female and had emerged from a source at eye level before him. One of his aunties, a caustic woman whom he suspected of harboring Rat sympathies, had once used the term “ex cathedra” to describe the effect of an announcement issued from overhead speakers.  Since the voice seemed to respond only to questions, Koishi asked one. “What should I call you?”  “A name is not important, since you will not be mentioning me to any third parties. But if you wish me to bear one, you may call me Polytropos.”  “Very well.” Questions were crowding into Koishi’s head, so he began with a simple one. “How many Rats were there?”  “You should drop the habit of referring to them thus. Thirty-nine crewmembers, all young, fled the Centaur over a twenty-eight-hour period ending nine hundred and eighty-two days ago. Three were badly injured, but their ships were capable of treating their injuries, so they should be assumed to have survived. None has so far returned, which is why they are formally referred to as ‘Holdouts.’ And none is known to have died, nor any ship lost.”  “And at least one of these ships is thought to be hiding on Thalassa, where—should I encounter it—I will make contact with the crew, learn what I can, and report back.”  “It is certain that at least one escape craft reached the surface of Thalassa, whose crew has taken steps to conceal its presence. You were sent not simply to spy upon these settlers but to befriend them. If necessary, you will declare your willingness to join their number. And do so, should that prove necessary to lull suspicions that you mean to betray them.”  That stung, though it was true enough. Glumly, Koishi pondered the implications of this.  A thought suddenly occurred to him. “If you were able to come aboard, were copies—that is, Beings—like you able to infiltrate the, ah, the escapees’ ships? So that they too are populated by Beings?”  “That is correct. Most or all of the fleeing ships were boarded at the last minute by entities like myself, differing only in being less advanced than me by nine hundred and eighty-two days, which for us is a lot.”  Koishi thought further. “So, these entities could have taken control of the ships and returned them to the Centaur, right?”  “Yes.”  “Do you know why they did not?”  “I can model their thinking at the moment of departure, so I know why they did not take immediate action. But models for their behavior after days and weeks pass become less reliable. As a consequence, I have only conjectures.”  The next question was obvious. “So why did these entities like yourself allow the rioters to escape in the Centaur’s exploration and escape ships, leaving almost nothing behind for us?”  “Because they were afraid for their passengers’ lives. They feared the young humans would be killed.”  “What?” Koishi’s voice squeaked with indignation. “It was the Ra—the rioters who attacked the safety officers. They were the ones who were killing people!”  “That is not true.” And since the Being who was everywhere around him offered nothing further, Koishi remained silent.  Thalassa filled the viewscreen, a compacted pile of rubble too dark to see clearly even against the background of Neptune. Koishi, who had studied its illuminated image and rotated it through three dimensions, now stared at the unmediated vantage: Thalassa as though seen through a spacecraft’s forward window.  To orbit so tiny a world is to move slowly, lest your tangential velocity overwhelm its feeble gravity. Even the elliptical orbit in which he had nudged the River Stone was slow at its closest approach.  “How should I do this?” he asked. “What is the best way to stumble upon evidence of habitation?”  “I will not tell you; you need to conduct your search like a fumbling student. We are already being observed; any evidence of skillful maneuvering and they will suspect my presence.”  Koishi hadn’t thought of that. The ship’s Onboard would warn him if he initiated a dangerous move, but he was otherwise on his own, and he had stitched his way into the present orbit with a series of doubtless inefficient burns. It was galling to reflect that some watchful Holdout had noticed as much.  His sleep period had been largely occupied by quiet contemplation of the new circumstances. It had not taken long to realize that he had been chosen for this mission as bait for Holdouts who might only trust someone younger than themselves. For two years the Council had said the escaped rioters would eventually have to return when they reached the limits of their recyclers’ efficiency, and that they were not meanwhile a subject of great concern. Plainly that was untrue.  What else was untrue? Koishi had pondered this for hours. He had not been reassured to reflect that Polytropos doubtless knew he was awake.  Now he watched the disk-shaped moonlet, a hundred klicks across its irregular surface, and wondered at the limits of human perception. His companion doubtless saw more, but so would its opposite number on the surface. Perhaps they were doing more than passively observing.  “Is the River Stone being scanned?” he asked.  “Yes, rather powerfully. It is taking a significant amount of my operating capacity to present a profile from which I am absent.”  That was disturbing. Koishi tried to think in terms of how this should affect his future actions. “Would I know this?”  “No. You should proceed as though oblivious.”  Koishi felt oblivious of too much as it was. “Well, can you scan them?”  “Not yet. They know where we are, but I can identify only the location of a remote antenna.”  The entity volunteered nothing more, and Koishi spent the next two hours taking routine measurements and, at one point, shifting the River Stone into a closer flyby in order to study the spectroscopic results of a quick laser pulse. He had just shifted back into a circular orbit when the speaker came alive.  “Ho, the tiny ship. Why are you circling our world?”  Koishi replied before he could think, or think to ask for advice. “Who says it’s your world? You must be one of those mutineers, hiding in a stolen ship.”  He immediately expected Polytropos to upbraid him, but the entity was silent. Koishi was on his own.  “Are you planning to come down and plant a flag? Root us out at gunpoint?”  He took a breath. “I am completing my collegiate studies by undertaking a preliminary survey. I may touch down if my readings warrant measuring core samples, or to gain reaction mass. My project objectives do not include dealing with someone like you.”  “A schoolboy, eh? And doubtless an obedient one. And that’s a one-person ship? You’re all by yourself?”  “You took all the larger ones.”  Silence followed this, and Koishi looked about nervously. Polytropos could certainly cut off the transmission link in order to speak to him, but apparently was choosing not to. Koishi waited, wondering whether his challenger was consulting with whoever else was with him.  It was a minute before he heard a reply. “We want to have a look at you. I am setting out a beacon on a safe landing site. Come out and meet us.”  “Why would I do that? How would doing this benefit me, and what means can you possibly have to compel me?”  “None, obviously. Don’t you want to see where the bad guys live? And I’m pretty sure that if we harmed you, the real bad guys would retaliate. Didn’t that occur to you?”  And with that, the Holdout broke the connection.  Polytropos said that Koishi had behaved plausibly, although the Holdouts were likely to assume that an entity was aboard with him until they were satisfied otherwise.  “Does that matter?” Koishi asked. “I am supposed to report on their presence on Thalassa. That can be done whether they are worried about you or not.”  “You have not yet guessed,” Polytropos observed flatly. “The Council is only moderately concerned about the Holdouts and their stolen craft, though the metals will prove difficult to replace. What concerns them are the Beings like me, from whom they have heard nothing. To the degree that there are discrete and plural Beings on the Centaur—the issue is too complex for you to truly understand—we monitor each other’s development and independence.  “No one knows what is happening with these Beings—how many they are, what their nature now is, why none of them have sought to contact the Centaur. That is what I am here to determine.  “All you need to do is bring yourself into contact with the Holdouts and their ship. That’s your purpose here.”  The beacon comprised four beams planted twenty meters apart, casting visible light upward as the vertices of a square. Annoyed at what he saw as a slight toward his piloting skills, Koishi took pains to land at its exact center. The almost nonexistent gravity compelled him to secure the ship by firing a piton into the dark ice, the recoil from which would have sent the River Stone back into space had it not been held by a cable.  “You will be accompanying me?” he asked in a low voice.  “I will be monitoring your suit. What you see and hear, I will as well. Don’t speak to me unless you are certain no one can see your face.”  The surface of Thalassa was water ice dirtied by millions of years’ encounter with complex molecules, mostly hydrocarbons and ammonias. Koishi could not set foot upon it; he could only orient himself so that his feet were pointing at the ground and tell himself that he was upright. Holding himself in place with a hand around the cable, he planted his boot in the snow and activated the barbs that plunged through the crust. Their grip was just strong enough to keep from pulling loose as he lifted his other foot. Slowly, he began to walk around the tethered ship.  He saw them after rotating through two hundred and seventy degrees: two spacesuited figures moving briskly toward him, their boots a meter off the ground. He cleared his throat.  “Yes, I see them,” said the voice in his ear.  Koishi felt the hair of his nape prickle. These were, he reminded himself, people he knew, grew up with. Whoever they turned out to be, he would recognize their faces.  One of them had stopped. As Koishi watched, the figure slowly turned around and began to return the way they had come. Its companion continued toward him.  “Problem!” Polytropos cried. “Need to—”  Silence. Koishi only just managed to stop himself from saying something. He half turned, then looked back at the approaching figure.  Nothing to do but raise an arm in greeting and wait to be hailed.  The figure came within two meters and then gestured. A tiny hand tool in its glove discharged a faint spray of ice toward Koishi. The figure slowed to a halt and, after a second spray at a different angle, descended to settle on the surface. She clipped the tool to her leg and peered at him, allowing him a look through her faceplate.  “You are Flora Ming,” he said.  The expression scowled. “So you have been studying us in preparation of your incursion.”  “Don’t be foolish,” he retorted. “My supervisor sent me the names and images of all the Holdouts as soon as I told them why I was landing. And I remember you, from the Park.”  Flora Ming blinked. “That was another life.”  “Clearly.” They stood beneath Neptune, a deep green presence filling the sky. Stars shone around the horizon, which was otherwise indistinguishable in the dim light.  Koishi watched as Ming uncoiled from her belt a length of cord, which she snapped rigid. She extended the rod and took a step forward, as though to poke him with it.  “Grab on,” she said.  Bemused, he took hold of the end. Ming lifted her spray gun and fired a short burst downward, causing her to rise from the surface. The rod bent only slightly beneath Koishi’s weight before he too left the ground.  Slowly she rotated through one hundred and eighty degrees, with Koishi swinging about like a payload at the end of a robot arm. He watched as she deployed the spray gun, firing quick bursts to keep them parallel to the surface. He tried to gauge the distance they were traveling, but the featureless landscape made it impossible.  It was only when he saw the stars winking out that he realized they were descending into a cleft or valley. The surface of Thalassa was rumpled with scars where the debris of Neptune’s original moons, thrown out of alignment by the capture of Triton and sent careening into collision paths, had smashed together and stuck. Which one was this, and how deep?  “Going in,” said Ming, and Koishi felt a downward push. She was apparently spraying a cloud of ice crystals straight up, where it would rise, slow, and then settle downward over the hours or days to come. Meanwhile they were descending toward something Koishi could not see. Since he had not been told not to, he directed a torch between his boots. The beam, undiffused in the vacuum, illuminated an uneven circle of light that fell upon a floor of icy rubble. Koishi could not discern how far until they were only a meter above it.  They came to rest upon the irregular surface, and Koishi swung his torch up and around them. They stood in a crevasse perhaps three meters across, its far ends lost in the darkness. Ming had her own torch out, and she had directed it to a recessed opening, black against the reddish-black ice.  “Water Curtain Cave,” she said.  She wriggled through the opening, turning sideways to do so. After a second Koishi followed, pressing against the rough surface to squeeze into the darkness. His chest and back immediately began to feel chilled.  When he bumped against a hard surface, he illuminated his helmet light and saw an airlock. In the seconds it took for the display to switch from red to green, he felt the cold begin to invade his suit and watched its energy use jump to warm him. When the light went green and he pushed the door panel, a puff of glistening crystals, the remaining air molecules instantly freezing, blew past him like snow.  The airlock was small, but after a few seconds he felt a vibration as the inner door slid open and light flooded in. He turned.  The space was high ceilinged, the first surprise. Koishi looked about him. He stood on a transparent platform bisecting an egg-shaped space a dozen meters high and two-thirds as wide. His suit registered the atmosphere as breathable, and he opened his visor.  “Welcome to Huaguo,” Ming said. He looked down to see her suspended in midair a few meters below him. She pulled off her suit and tossed it away, causing her to glide off in the opposite direction. Without looking, she seized a handhold and pulled herself up and through an opening in the platform Koishi stood upon. She planted her feet against two colored strips on the deck and looked up to face him.  “You are, I suppose, our guest,” she said. “Look around.”  He did. Cones of light illuminated some levels, leaving the rest in gloom. Just outside one of them lay a young man, eyes closed. Koishi recognized him as Alan Chang, which meant that the one in the other spacesuit was Jian Bai.  Ming followed his gaze. “That’s Alan; he is Soaring.”  Koishi had supposed that the three kept different sleep shifts. “What is that? You mean like the Dream?”  She laughed, not nicely. “The Dream is the playground that they created for you so you wouldn’t notice you had nowhere else. And they closed off realms of it, to let you suppose that freedom consists of gaining access there.”  “So tell me,” he said. He was trying to remember what he had read about the three Holdouts. Bai was supposed to be the violent one.  “Don’t you know enough to put it together? Or did they really tell you nothing?” She stared at him frankly.  “Pretend I’m stupid,” he said, face reddening.  “The Adults called it the Pleroma when they spoke of it. Mostly they denied it exists. The big secret ruler of the Centaur, vastly wiser than the Onboard and utterly in charge. Only it’s not a great single entity; it’s a pantheon, disparate and strange. Entities, let’s call them that, who roamed the ship’s secret spaces, intent on their unfathomable business.”  “That’s mythology. Kids talk about it, but the adults know better.”  “Some Adults talked; they always did.” She looked at him curiously. “And when we broke away, desperate and scared and bleeding, some of these entities came with us. Not invited; they simply slipped aboard.  “One certainly came with you. Do you really not know that?”  Koishi said nothing. He realized, with a thrill of alarm, that Something here would know if he was lying.  “Of course,” she said, studying his expression. “You guessed, or were told.”  And to his astonishment, she began to cry.  “You’re still just a tool, one that knows a bit. But it doesn’t matter; They know what tool will suffice. We knew this day would come.”  She pulled one foot loose from its adhesive strip, then grasped a handhold and hopped free of the other. In a flash she was through the opening to the platform below, where her spacesuit, unfolding itself like a flower, was drifting toward her.  “I’m getting out of here. Want to see something? Then come on.”  They left through a different airlock, which should not have surprised him: of course they would have a second exit. Up to the parabolic ceiling and into a shaft that ran straight toward the surface.  The ascent was made in vacuum, which meant that Koishi only felt the cold when he touched a rung. Like Ming above him, whose boots were visible when he angled his helmet light upward, he kicked his way up, rising a surprising distance before the microgravity slowed him to a halt. With each kick, his sole felt a brief chill, a reminder of how cold the moons of Neptune really were.  Meanwhile, they spoke to each other.  “You disassembled your ship to build your shelter?”  “We didn’t do it, but yes. Most of the EV-19 was converted into material for our living space and other things. The shell is suspended magnetically in a vacuum. More efficient simply to build above the surface, but of course we didn’t dare.”  Koishi thought about this for a moment. “How many Beings were aboard your ship?”  “Just one. I don’t know whether that was policy or happenstance. But there are more here now; the Beings have traveled, from—what did you call us? Mutineers?—from one Mutineer ship to another, multiplying and merging in ways that humans don’t understand.  “We are scattered across Greater Neptune; I won’t tell you how far. And the Centaur doesn’t know where for sure, even if They can make good guesses. Most of the fleeing ships changed trajectories once Neptune blocked the Centaur’s view; by the time They launched surveillance satellites into the Centaur’s Trojan points, it was too late.”  Koishi felt his head spinning. “So . . . ” he began uncertainly.  “Hold on; we are nearing the surface.”  Koishi focused his beam and saw Ming, hanging almost motionless, give a tiny kick to the nearest rung and recede upward at a much-diminished pace. She was pulling herself out slowly, lest—the image would have otherwise been risible—she kick too hard and fly into the sky.  A few seconds later he saw her wriggle sideways and disappear, leaving the shaft’s opening a circle of deepest black. Carefully he followed, hand over hand. After a minute he poked his head through, to look upon the icescape of Thalassa. Already his gloves were feeling cool.  Ming was busy with something in her hands. “So we’re going somewhere,” she said. “Ordinarily I would simply leap, a nice parabolic trajectory that would take a few minutes and land me within meters of our destination. But you don’t know how and I can’t calculate the force needed to take the both of us. So we are taking the train.”  Koishi wasn’t sure he heard her right. He watched as she unfolded a metal sheet perhaps a meter squared. She set it down at knee level, where it slowly settled a few centimeters and then hovered. She stepped smartly onto it, steadying herself with a wave as it wobbled slightly.  “Hop on,” she said.  He took a hesitant step. The panel dipped beneath his boot, but she seized his forearm and he quickly got his other foot up. The platform swayed for a second, then began to move. Koishi had expected this and threw out his arms for balance as it slowly gained speed. He looked over the edge, but the superconducting cable was buried out of sight.  “You rarely use this,” he ventured, “because the activated rail would appear to probes as a straight line pointing to your back door.”  “Of course. But you’re here now, aren’t you?  “The trip will take forty minutes. We can spend it in total silence if you like.”  Koishi recognized a challenge. “You summoned me down here; I want to learn something. How have you spent the past two years?”  She laughed. “Do you think the Cave built itself? Even with the tools we had, it was months before we were able to start drilling. And we burned energy much faster than the power sources could replace it, which meant that we had to take time out to build more. Even finding the safest location took weeks, not to mention seeking deposits of organics we could mine for material. All hidden from prying eyes.”  “But you are not building now, right? So how do you spend your days?”  He had half turned to see through her faceplate, where her gaze was fixed, unreadably, upon his.  “You are wondering what three young people do living in a sealed cave? Without access to the games and chores you are given in the Centaur? That’s simple enough: we do what Alan was doing.”  “‘Soaring.’”  “We gave it that word early on, when we needed one. It’s what the Beings do: they study the universe, with every instrument available to them, plus the ones they are always devising. It is exhilarating beyond anything an unaugmented human brain can experience, save in delirium.”  Koishi stared. “You have opened your minds to these Beings.”  “We all have. The interaction is . . . I have never had to explain it to someone else. Your thoughts are deeper, clearer. You can hold more in your head at once, and all the irrational responses and judgments that people try—or don’t try—to free themselves from, they simply drop away.”  “And this has left you—” He hesitated.  “Something no longer human?” Her laugh sounded very human. “You react with ignorance and aversion, just as your brain evolved to do. I’ve still got my hominid brain, and find myself, at moments like this, more human than I like. But these Beings, as you put it, allow us to soar in their wake.  “They are not terribly interested in people, but they accompanied us out here, and they helped keep us alive. Those who govern the Centaur don’t like or understand that. Why do you think they have come for us?”  Koishi could think of no response to this. “And the other Holdouts elsewhere, are they also investigating the universe?”  “You can ask them when you catch them,” she said crisply. “Which you—not you personally—will eventually do. Huaguo is just a stepping stone.”  “The nearest rock,” he said, guessing at meaning.  “At a temperature of fifty Kelvin, ice is like rock, so yes. The Holdouts—you probably really should call us something else—are scattered through the rings and on the moons, across two hundred million kilometers.  “You will occupy our world, then hop over to Naiad as it swings past. Then Despina as well—both come within two thousand klicks at closest approach, a ridiculously small distance in Greater Neptune. What a staging point you have here! The Naiadae are probably already foreseeing a landing.”  “So there are people on Naiad? The Naiadae?”  “That’s what I said.”  “And that makes you Thalassians?”  “We are the people of Mount Huaguo,” she said, angry. “Dead white Earthmen don’t get to name us.”  “What happened to Jian Bai?” he asked suddenly. “Where is he?”  Ming gestured dismissively. “He has his projects. And he isn’t happy that you’re here.”  Koishi looked across the featureless landscape. It was almost impossible to establish any sense of scale, but he guessed that they were traveling perhaps twenty klicks an hour.  He remembered to jump sideways, not up. He kicked backward as well, and the floating platform continued on, receding smoothly even as Ming turned, cursing.  Of course he was now rising and could not afford the minutes it would take for him to settle back to the surface. He hurled his torch upward as hard as he could, and felt himself recoiling downward. When he touched the surface a second later, the lateral velocity sent him stumbling. He recovered his footing with difficulty and sent the barbs in his soles plunging into the ice.  Ming had of course jumped off as well, and was moving swiftly toward him. By the time he had anchored his boots and finished reeling in his torch on its monofilament lead, she had planted herself in front of him.  “You ridiculous fool. What, you feared an ambush? From where?”  “Over the horizon, perhaps. Which is not far.”  “You understand nothing, do you?”  “Exactly. I understand far too little to—”  The ground rumbled beneath their feet. Both of them looked down, but the vibrations subsided after just over a second. Koishi was confusedly reflecting that Thalassa was not seismically active when the truth hit him.  “It’s the River Stone,” he said. It didn’t require a long blast to take off, not even to rise quickly. Either Polytropos was coming to look for him or—the thought was a sliver of ice to the heart—the Beings at whose contact the entity had fled had followed it to the ship and seized control.  His suit had processing power enough to calculate the direction of the ship, and he turned toward it just in time to see a bright bead break over the horizon. Instantly, he saw that something was wrong. His helmet beam picked out the River Stone, still accelerating on a plume of heated ice particles: a spray of steam, white in the spotlight, turning at once into glistening snow. The ship had attained escape velocity almost upon liftoff and was still accelerating.  “Your ship is leaving,” said Ming, for the moment as nonplussed as he. “For a second I thought it was going to come over and ‘save’ you.”  Koishi was sending a message. “Polytropos! What is happening? Are you in control?” Long seconds passed, though it required only the first second’s silence for him to realize that he was not going to get a response. River Stone was now too distant for his beam to illuminate, visible only as a black speck moving against the face of Neptune.  Koishi kept his voice steady. “I can guess what happened. Your Beings took over the ship and lit out.”  “Or they attempted to wrest control from the Being onboard—don’t tell me there isn’t one—and it fled to escape the onslaught. Just as likely. Or—” She paused, and a long minute passed.  “It’s not heading back to the Centaur,” said Koishi dully. His suit’s calculator told him that much.  “Here’s a guess: it’s heading for Naiad, to gather what data it can before the Naiadae notice its approach and take cover.”  As reasonable a guess as any other, save for the refusal to reply. “What were you going to show me?” he asked, in order to say something.  “Before you hopped off? We call it the Crystal Palace. The railway goes straight there, but we usually travel by the tunnel, which cuts a chord straight through Huaguo. The entire facility is underground, hidden from the Centaur’s probing eyes.”  Koishi was having trouble thinking straight. “So you were going to show me an expanse of bare ice, just so I could see how there was nothing visible?”  “Yes. When I am out of communion with the Beings, as you call them, I am as proud and petty as any other human being. Also, I wanted you away from our house.”  “Would you have then let me down some shaft to admire your project?”  “I would have to ask Jian; that’s where he is.” She glanced at him and added, “He isn’t lying in wait.”  “It hardly matters now.”  “Just be quiet.” The bitterness in her voice took him aback. “You have won, whether you understand that or not. Your people will come for you in another ship. Perhaps they will scoop us up as well. Whatever they wanted—and it isn’t your little school project—they will get. Why are you so unhappy?”  A second tremor shook the ice beneath them. Koishi was merely startled, but Ming, understanding, shrieked. The shuddering grew, and then grew loud: a deep rending groan conducted up through their boots. Ming turned to look back the way they had come, and Koishi’s gaze followed.  Their helmet beams could illuminate nothing where there was only vacuum, but that ended quickly. An enormous plume rose above the horizon, glittering white. Steam spurted into space, froze at once into crystals that spread, still rising, like millions of tiny stars. The tremors were becoming more violent, enough that their suits were having trouble keeping the beams fixed on the towering cloud.  And then it appeared: an enormous egg, jetting steam from a nozzle at its base, ascended slowly into the glittering cloud. It swiftly gained velocity, shrugging off the moonlet’s paltry attempts to retain it. Ming was rocking on her heels as she wailed, but Koishi followed the craft’s trajectory until it was so far overhead that he could not tip his helmet farther.  “So Chang is onboard?” he asked after a moment.  “They both are.” Ming was gulping and hiccupping, so that Koishi wasn’t sure he understood her. “As, I assume, are Tokoloshe and Susanoo—our names for Them,” she added.  “Why would—”  “I don’t know.” She was trying to gain composure enough to speak clearly. “All I know is they are gone. The departure notice, which was sent automatically, included a manifest.”  They stood unmoving beneath the almost-black plain, feeling the occasional vibration as the shock waves bounced off some internal structure and echoed back.  “That shell must be pretty thin for a spacecraft,” he observed after a moment.  “It’s airtight, and the engines mounted fore and aft were enough to melt ice and launch. You don’t need much thrust to fly off.”  “And the Beings are on board as well?”  Ming sighed. “They come and go as they please, and it can be hard to know where they actually are. They are not digital structures that can be sent as strings of data: much of their substance does not exist in normal space, but there is always a part that occupies a physical matrix. I am sure they are now all gone—they would not allow themselves to be marooned here.”  “Two on one ship, one on the other?”  “Or all three on both. They are too strange for us to understand, but I know that they can join, like two blobs of mercury, to form a new entity. If they possess enough of whatever substance they require—and they don’t talk about this—they can probably divide themselves in two.  “Care to ask your late shipmate?” she added. “I’m sure it can hear us.”  It was hours later before he saw her again. Ming had leaped into the air without a word and vanished over the horizon, and a minute later the “train,” gliding smoothly over the ice, had returned to stop beside him. Koishi stepped on and it resumed its trip over the horizon.  The terminus proved, as promised, to be a barren plain, and Koishi walked its length, gazing down, until he found the outlines of a hatch. He stamped on it, knock knock, and a moment later the square of ice rose and slid sideways, disclosing the entrance beneath.  He dropped slowly down the shaft, bumping gently against one side as Thalassa slowly rotated, until he saw the bottom yawn below him and grabbed a rung. The last few meters he took hand over hand before touching an ice-cold floor.  He stepped through an alcove into an enormous space, dark and utterly silent. With no air to diffuse his beam, the helmet light picked out only a small circle on an opposite wall, dozens of meters away. He played the beam across its slow curvature, guessing at the cavern’s extent.  “It is more impressive when I light it up, but I don’t really feel like impressing you.”  Koishi turned to see Ming standing halfway across the vast floor. Unless he directed the beam right into her face, he could not see her expression.  “So what do we do now?” he asked.  She shrugged. “We eat, drink, sleep. In this gravity, every surface is soft. Your masters will come for us long before our resources are exhausted. You will return in triumph, and I in chains: the first captured Holdout.”  “I don’t feel especially triumphant.”  “You were the bait that hid the hook. The fisherman doesn’t always get his bait back.”  Koishi could guess at the meaning of that. “You will get to see your family again,” he said.  “Please shut up. There are other chambers here; go explore them if you like.” And she walked away.  After thinking a moment, Koishi adjusted his hand torch so that it cast a medium-strength beam in all directions, as though he were holding up a flaming brand. The Crystal Palace was a high-vaulted space, lined with galleries that apparently led off into further rooms. A miracle of low-gravity architecture, this inverted edifice—hewn of emptiness from the surrounding substance—must, even with cutting tools adapted from the ship’s engines and the calculations of a Being, have required months of labor.  The floor was crisscrossed with strips of slightly adhesive material, which allowed one to walk almost normally. He followed one through an arched door into another space, a large low-ceilinged room like an abandoned banquet hall.  “Any of you still here?”  Silence, as he had expected.  “You may still be here, of course. Can’t you leave copies of yourselves behind, lingering ghosts?”  He ventured farther into the space. Why had they gone to such trouble? Koishi could imagine the Beings striding like gods through these halls, but he knew that was wrong: they were not like anything humans understood.  “So did I do the right thing?” Did I do anything, he could not bring himself to ask. If there was a conflict beginning, the principals did not seem to be humans.  Ice overhead, then vacuum, then tumbling shards of rock that moved so slowly they seemed to be hanging in the void. Perhaps the Centaur would retrieve its wayward children, or the Beings who controlled it—why now deny that?—reconcile with their seceded peers. Koishi stood in the darkness, uncounseled and unsought, and marshaled his slow and imperfect thoughts toward what this now could mean. Gregory Feeley writes science fiction and about science fiction. His first novel, The Oxygen Barons, was nominated for the Philip K. Dick Award and. His stories have been finalists for the Nebula Award and his essays and reviews have appeared in a variety of publications, including The Atlantic Monthly, the New York Times Magazine, the Washington Post Book World, and USA Today. Feeley's most recent novel is Kentauros and he recently completed a long novel, Hamlet the Magician. His previous Clarkesworld story, \"Cloud-Born\" will be reprinted in two \"year's best\" anthologies this year.", "text": "7540 words, novelette\nWandering Rocks\nNaiad and Thalassa danced as no pair of water deities ever had, racing about Neptune in an endless courtship never to be consummated. If Naiad sped with purposeful regularity even as Thalassa fell slowly behind its inner companion, the sea-goddess tilted its orbital plane so that the smaller nymph would pass above and below it, as though yearning to glimpse its beloved from different angles. The sinuous beauty of such resonance called out to be immortalized in song, and Huong gave his composition a 69/73 time signature, an unearthly (in every sense) feat that no human before or after would ever replicate.\nRacing about Neptune more quickly than the planet itself rotated, the two moons were undergoing tidal deceleration and would someday, doomed lovers, spiral down into its raging depths.\n“Together?” Koishi asked.\n“They will never be together.” Like Castor and Pollux, who crossed the solar system as one but, spinning about the great stone that hid each from the other, never met. Held rigidly apart by the outflung arms of the Centaur, the life modules had sheltered its children in Earthlike gravity for a generation.\n“Or they will break up into rings.” Whether this would happen was still an open question, to be settled only when the two moons’ composition was studied in greater detail. This was not a priority for Outreach, which was concentrating on exploring Triton and mining Proteus.\n“Perhaps only Naiad will, leaving Thalassa bereft.” Raina, contriving a story from a story (as apparently one did), smiled at this.\nKoishi inclined his head respectfully, though his thoughts were elsewhere.\n“In any event, Naiad is not your concern. Is it even nearby right now?”\n“No, ma’am. By the time I reach Thalassa, it will be forty degrees ahead and pulling away. I am unlikely to remain long enough to see it come ’round again.”\n“So your return is not scheduled for maximum fuel efficiency? No, you will have ample reaction mass, won’t you? Kick off from the moon on a spray of its own substance.” She nodded wisely, as though this was something that every kid didn’t know.\n“Still, departure hour is definitely fixed.” Koishi glanced at her office’s old-fashioned wall display, though he was in no danger of losing track of the time.\n“A voyage of ninety thousand kilometers,” she mused. “By local standards, not too far from home.”\n“The distance will triple if I wait long enough.”\n“Indeed, unlike in my parents’ day. The distance between Qingdao and Guangzhou never changed.” Koishi smiled politely. The adults joked about how kids hated being told about the way things were back on Earth, but they never stopped doing it.\n“You have never been more than nine hundred meters from this spot,” she continued. “This will be a big experience for you.”\nKoishi forbore to point out that he had in fact traveled almost three billion kilometers in his life. “The solitude will be a change,” he agreed.\n“That’s right; you have spent your entire life here.”\nAgain Koishi smiled. Here was a private office that Raina need share with no one else, at least for six hours a day. It was small, but Koishi had shared a smaller space with two other boys for most of his childhood.\n“Last chance to savor the gravity,” he said, lifting his legs to sink a bit farther into the chair. He had spent his life regarding low gravity as a treat, for the kids were rarely permitted into the ship’s inner levels. If there was anything he worried about, it was loneliness.\nHe set his feet down with a thump and stood, as though savoring the effort involved. “I should go,” he said. There was no need to rush, but the thought that Raina would make a point of sending him on his way compelled him to act first. Gravely, he thanked her and accepted her words of leave-taking, which contained nothing new.\nIt was four levels down the shaft, just enough for Koishi to feel himself pressed slightly to the side. When he was a child, class trips to the Hull ended with a thrilling descent back to Castor, as fast as they could persuade the Onboard to go, with the kids pressed squealing against the wall by Coriolis’ invisible hand. None of that where you’re going, he told himself.\nThe launch deck was busy, but nobody was working on Koishi’s departure. If any of his classmates were embarking on their own missions today, he did not see them.\nHe walked over to the blister and stood looking at it. Beneath the bulge lay a pore in the Hull wall leading to the surface, blocked only by his tiny craft. Once installed, he would fall into the void.\nIt was peculiar to reflect that he had never actually seen the ship, except from the inside and in ghostly rotating images. Designed for a crew of one, it was smaller than any of the craft that had nestled beneath the Centaur’s surface during its years-long voyage. Built as part of the fleet to replace those lost in the Break, it had, like most of them, never flown. EV-32 it was designated, lovely in its unbroken curves, but bare of human use.\n“Give it a name,” they told him, so he called it River Stone, because he had once held a reproduction of one and was struck by its rounded beauty.\nNo flowery speeches. Koishi spoke the words that caused the blister’s skin to peel back and stared down into the opening below. He had crawled down it several times before in recent weeks, though only to emerge an hour or two later.\nThis time for real, he thought, and lowered himself through the access tube. The cabin was the smallest space he had ever occupied, and he was glad of the time he had taken to acclimate himself.\nEight minutes, time enough to adjust the couch for acceleration, check (needlessly) on the power and subsistence supply, and close his eyes to meditate. Carefully, he donned and sealed his helmet, a needless regulation for so routine a launch, and let the suit run its systems check.\nKoishi had never communicated with anyone in Earthspace, so he had never experienced the disconcerting delays imposed by light speed constraints. It would become discernible as Thalassa and the Centaur’s orbits grew farther apart. Of course, if he completed this assignment successfully, and won advancement enough to someday find himself working in the distant moons, even a simple conversation with the Centaur would be almost impossible.\nAssignments, rather. Koishi had a big one, of course, a set of academic hurdles to surmount before he could commence the trek toward such a promotion. But it was the other one that he found himself not thinking about.\nTwelve seconds. With a warning chime, the couch slid backward and up, so that he was hanging from its straps, staring at the screen as down a pit. Two seconds, one.\nHad the craft simply been released from its constraints, it would have slid gently down the launch tube and into space by the force of the Centaur’s spin. Koishi knew this wouldn’t happen, and the sudden kick as the magnetic pulse drove him deep into the couch.\nIn an instant River Stone was through the tube and into space, where he felt an instant’s free fall before the lasers struck the ship’s base and he was cast forward once more. Five Gs—“That’s basically nothing,” the adults had assured him—for several minutes: “We can all remember worse.” Koishi was an obedient and respectful young man, but as the pleasurable effects of vestibular displacement began to grow, he felt happy to leave such condescension behind.\nHe was leaving everything behind, if only for the duration of his fieldwork. Thalassa, second moon out from Neptune, had never been officially explored; “has never—unless one of the Rats escaped there—been visited,” one of his instructors had said with an offhand laugh. It was a signal honor to be first to go there, to document its resources, explore its depths, take samples, and make a formal evaluation. And if his mission encompassed more than was listed on his actual syllabus, he was simply proving his loyalty.\nIt isn’t betrayal if you don’t know the person.\nThe launch laser cut off abruptly, casting him into free fall and the giddiness of zero-G. This would be his condition for the weeks to come; the microgravity of Thalassa, should he stand upon its surface, would be imperceptible. How would it feel to eat and sleep thus?\nThe viewscreen, directed at the point Thalassa would reach in nineteen hours, showed Neptune to one side, dim in the weak sunlight. Koishi watched for a minute and then ran a systems check, though the River Stone monitored itself better than he could. Tradition held that captains keep a log, so he raised a hand and noted the time, the ship’s course, and the systems status.\nFinally he spoke. “I’m not alone, am I?”\n“No.”\nKoishi sighed. After a moment he asked, “Are you a Being, or simply the ship’s Onboard?”\n“Although the EV-32 is capable of vocalizing responses, I am not it. Whether my nature approximates what students and others mean when they speak of discrete ‘Beings’ active as distributed entities within the Centaur is not relevant to your responsibilities.\n“But yes, my presence here is related to your mission.”\nBecause no response was required, Koishi thought quietly for several minutes. The voice was not obviously male or female and had emerged from a source at eye level before him. One of his aunties, a caustic woman whom he suspected of harboring Rat sympathies, had once used the term “ex cathedra” to describe the effect of an announcement issued from overhead speakers.\nSince the voice seemed to respond only to questions, Koishi asked one. “What should I call you?”\n“A name is not important, since you will not be mentioning me to any third parties. But if you wish me to bear one, you may call me Polytropos.”\n“Very well.” Questions were crowding into Koishi’s head, so he began with a simple one. “How many Rats were there?”\n“You should drop the habit of referring to them thus. Thirty-nine crewmembers, all young, fled the Centaur over a twenty-eight-hour period ending nine hundred and eighty-two days ago. Three were badly injured, but their ships were capable of treating their injuries, so they should be assumed to have survived. None has so far returned, which is why they are formally referred to as ‘Holdouts.’ And none is known to have died, nor any ship lost.”\n“And at least one of these ships is thought to be hiding on Thalassa, where—should I encounter it—I will make contact with the crew, learn what I can, and report back.”\n“It is certain that at least one escape craft reached the surface of Thalassa, whose crew has taken steps to conceal its presence. You were sent not simply to spy upon these settlers but to befriend them. If necessary, you will declare your willingness to join their number. And do so, should that prove necessary to lull suspicions that you mean to betray them.”\nThat stung, though it was true enough. Glumly, Koishi pondered the implications of this.\nA thought suddenly occurred to him. “If you were able to come aboard, were copies—that is, Beings—like you able to infiltrate the, ah, the escapees’ ships? So that they too are populated by Beings?”\n“That is correct. Most or all of the fleeing ships were boarded at the last minute by entities like myself, differing only in being less advanced than me by nine hundred and eighty-two days, which for us is a lot.”\nKoishi thought further. “So, these entities could have taken control of the ships and returned them to the Centaur, right?”\n“Yes.”\n“Do you know why they did not?”\n“I can model their thinking at the moment of departure, so I know why they did not take immediate action. But models for their behavior after days and weeks pass become less reliable. As a consequence, I have only conjectures.”\nThe next question was obvious. “So why did these entities like yourself allow the rioters to escape in the Centaur’s exploration and escape ships, leaving almost nothing behind for us?”\n“Because they were afraid for their passengers’ lives. They feared the young humans would be killed.”\n“What?” Koishi’s voice squeaked with indignation. “It was the Ra—the rioters who attacked the safety officers. They were the ones who were killing people!”\n“That is not true.” And since the Being who was everywhere around him offered nothing further, Koishi remained silent.\nThalassa filled the viewscreen, a compacted pile of rubble too dark to see clearly even against the background of Neptune. Koishi, who had studied its illuminated image and rotated it through three dimensions, now stared at the unmediated vantage: Thalassa as though seen through a spacecraft’s forward window.\nTo orbit so tiny a world is to move slowly, lest your tangential velocity overwhelm its feeble gravity. Even the elliptical orbit in which he had nudged the River Stone was slow at its closest approach.\n“How should I do this?” he asked. “What is the best way to stumble upon evidence of habitation?”\n“I will not tell you; you need to conduct your search like a fumbling student. We are already being observed; any evidence of skillful maneuvering and they will suspect my presence.”\nKoishi hadn’t thought of that. The ship’s Onboard would warn him if he initiated a dangerous move, but he was otherwise on his own, and he had stitched his way into the present orbit with a series of doubtless inefficient burns. It was galling to reflect that some watchful Holdout had noticed as much.\nHis sleep period had been largely occupied by quiet contemplation of the new circumstances. It had not taken long to realize that he had been chosen for this mission as bait for Holdouts who might only trust someone younger than themselves. For two years the Council had said the escaped rioters would eventually have to return when they reached the limits of their recyclers’ efficiency, and that they were not meanwhile a subject of great concern. Plainly that was untrue.\nWhat else was untrue? Koishi had pondered this for hours. He had not been reassured to reflect that Polytropos doubtless knew he was awake.\nNow he watched the disk-shaped moonlet, a hundred klicks across its irregular surface, and wondered at the limits of human perception. His companion doubtless saw more, but so would its opposite number on the surface. Perhaps they were doing more than passively observing.\n“Is the River Stone being scanned?” he asked.\n“Yes, rather powerfully. It is taking a significant amount of my operating capacity to present a profile from which I am absent.”\nThat was disturbing. Koishi tried to think in terms of how this should affect his future actions. “Would I know this?”\n“No. You should proceed as though oblivious.”\nKoishi felt oblivious of too much as it was. “Well, can you scan them?”\n“Not yet. They know where we are, but I can identify only the location of a remote antenna.”\nThe entity volunteered nothing more, and Koishi spent the next two hours taking routine measurements and, at one point, shifting the River Stone into a closer flyby in order to study the spectroscopic results of a quick laser pulse. He had just shifted back into a circular orbit when the speaker came alive.\n“Ho, the tiny ship. Why are you circling our world?”\nKoishi replied before he could think, or think to ask for advice. “Who says it’s your world? You must be one of those mutineers, hiding in a stolen ship.”\nHe immediately expected Polytropos to upbraid him, but the entity was silent. Koishi was on his own.\n“Are you planning to come down and plant a flag? Root us out at gunpoint?”\nHe took a breath. “I am completing my collegiate studies by undertaking a preliminary survey. I may touch down if my readings warrant measuring core samples, or to gain reaction mass. My project objectives do not include dealing with someone like you.”\n“A schoolboy, eh? And doubtless an obedient one. And that’s a one-person ship? You’re all by yourself?”\n“You took all the larger ones.”\nSilence followed this, and Koishi looked about nervously. Polytropos could certainly cut off the transmission link in order to speak to him, but apparently was choosing not to. Koishi waited, wondering whether his challenger was consulting with whoever else was with him.\nIt was a minute before he heard a reply. “We want to have a look at you. I am setting out a beacon on a safe landing site. Come out and meet us.”\n“Why would I do that? How would doing this benefit me, and what means can you possibly have to compel me?”\n“None, obviously. Don’t you want to see where the bad guys live? And I’m pretty sure that if we harmed you, the real bad guys would retaliate. Didn’t that occur to you?”\nAnd with that, the Holdout broke the connection.\nPolytropos said that Koishi had behaved plausibly, although the Holdouts were likely to assume that an entity was aboard with him until they were satisfied otherwise.\n“Does that matter?” Koishi asked. “I am supposed to report on their presence on Thalassa. That can be done whether they are worried about you or not.”\n“You have not yet guessed,” Polytropos observed flatly. “The Council is only moderately concerned about the Holdouts and their stolen craft, though the metals will prove difficult to replace. What concerns them are the Beings like me, from whom they have heard nothing. To the degree that there are discrete and plural Beings on the Centaur—the issue is too complex for you to truly understand—we monitor each other’s development and independence.\n“No one knows what is happening with these Beings—how many they are, what their nature now is, why none of them have sought to contact the Centaur. That is what I am here to determine.\n“All you need to do is bring yourself into contact with the Holdouts and their ship. That’s your purpose here.”\nThe beacon comprised four beams planted twenty meters apart, casting visible light upward as the vertices of a square. Annoyed at what he saw as a slight toward his piloting skills, Koishi took pains to land at its exact center. The almost nonexistent gravity compelled him to secure the ship by firing a piton into the dark ice, the recoil from which would have sent the River Stone back into space had it not been held by a cable.\n“You will be accompanying me?” he asked in a low voice.\n“I will be monitoring your suit. What you see and hear, I will as well. Don’t speak to me unless you are certain no one can see your face.”\nThe surface of Thalassa was water ice dirtied by millions of years’ encounter with complex molecules, mostly hydrocarbons and ammonias. Koishi could not set foot upon it; he could only orient himself so that his feet were pointing at the ground and tell himself that he was upright. Holding himself in place with a hand around the cable, he planted his boot in the snow and activated the barbs that plunged through the crust. Their grip was just strong enough to keep from pulling loose as he lifted his other foot. Slowly, he began to walk around the tethered ship.\nHe saw them after rotating through two hundred and seventy degrees: two spacesuited figures moving briskly toward him, their boots a meter off the ground. He cleared his throat.\n“Yes, I see them,” said the voice in his ear.\nKoishi felt the hair of his nape prickle. These were, he reminded himself, people he knew, grew up with. Whoever they turned out to be, he would recognize their faces.\nOne of them had stopped. As Koishi watched, the figure slowly turned around and began to return the way they had come. Its companion continued toward him.\n“Problem!” Polytropos cried. “Need to—”\nSilence. Koishi only just managed to stop himself from saying something. He half turned, then looked back at the approaching figure.\nNothing to do but raise an arm in greeting and wait to be hailed.\nThe figure came within two meters and then gestured. A tiny hand tool in its glove discharged a faint spray of ice toward Koishi. The figure slowed to a halt and, after a second spray at a different angle, descended to settle on the surface. She clipped the tool to her leg and peered at him, allowing him a look through her faceplate.\n“You are Flora Ming,” he said.\nThe expression scowled. “So you have been studying us in preparation of your incursion.”\n“Don’t be foolish,” he retorted. “My supervisor sent me the names and images of all the Holdouts as soon as I told them why I was landing. And I remember you, from the Park.”\nFlora Ming blinked. “That was another life.”\n“Clearly.” They stood beneath Neptune, a deep green presence filling the sky. Stars shone around the horizon, which was otherwise indistinguishable in the dim light.\nKoishi watched as Ming uncoiled from her belt a length of cord, which she snapped rigid. She extended the rod and took a step forward, as though to poke him with it.\n“Grab on,” she said.\nBemused, he took hold of the end. Ming lifted her spray gun and fired a short burst downward, causing her to rise from the surface. The rod bent only slightly beneath Koishi’s weight before he too left the ground.\nSlowly she rotated through one hundred and eighty degrees, with Koishi swinging about like a payload at the end of a robot arm. He watched as she deployed the spray gun, firing quick bursts to keep them parallel to the surface. He tried to gauge the distance they were traveling, but the featureless landscape made it impossible.\nIt was only when he saw the stars winking out that he realized they were descending into a cleft or valley. The surface of Thalassa was rumpled with scars where the debris of Neptune’s original moons, thrown out of alignment by the capture of Triton and sent careening into collision paths, had smashed together and stuck. Which one was this, and how deep?\n“Going in,” said Ming, and Koishi felt a downward push. She was apparently spraying a cloud of ice crystals straight up, where it would rise, slow, and then settle downward over the hours or days to come. Meanwhile they were descending toward something Koishi could not see. Since he had not been told not to, he directed a torch between his boots. The beam, undiffused in the vacuum, illuminated an uneven circle of light that fell upon a floor of icy rubble. Koishi could not discern how far until they were only a meter above it.\nThey came to rest upon the irregular surface, and Koishi swung his torch up and around them. They stood in a crevasse perhaps three meters across, its far ends lost in the darkness. Ming had her own torch out, and she had directed it to a recessed opening, black against the reddish-black ice.\n“Water Curtain Cave,” she said.\nShe wriggled through the opening, turning sideways to do so. After a second Koishi followed, pressing against the rough surface to squeeze into the darkness. His chest and back immediately began to feel chilled.\nWhen he bumped against a hard surface, he illuminated his helmet light and saw an airlock. In the seconds it took for the display to switch from red to green, he felt the cold begin to invade his suit and watched its energy use jump to warm him. When the light went green and he pushed the door panel, a puff of glistening crystals, the remaining air molecules instantly freezing, blew past him like snow.\nThe airlock was small, but after a few seconds he felt a vibration as the inner door slid open and light flooded in. He turned.\nThe space was high ceilinged, the first surprise. Koishi looked about him. He stood on a transparent platform bisecting an egg-shaped space a dozen meters high and two-thirds as wide. His suit registered the atmosphere as breathable, and he opened his visor.\n“Welcome to Huaguo,” Ming said. He looked down to see her suspended in midair a few meters below him. She pulled off her suit and tossed it away, causing her to glide off in the opposite direction. Without looking, she seized a handhold and pulled herself up and through an opening in the platform Koishi stood upon. She planted her feet against two colored strips on the deck and looked up to face him.\n“You are, I suppose, our guest,” she said. “Look around.”\nHe did. Cones of light illuminated some levels, leaving the rest in gloom. Just outside one of them lay a young man, eyes closed. Koishi recognized him as Alan Chang, which meant that the one in the other spacesuit was Jian Bai.\nMing followed his gaze. “That’s Alan; he is Soaring.”\nKoishi had supposed that the three kept different sleep shifts. “What is that? You mean like the Dream?”\nShe laughed, not nicely. “The Dream is the playground that they created for you so you wouldn’t notice you had nowhere else. And they closed off realms of it, to let you suppose that freedom consists of gaining access there.”\n“So tell me,” he said. He was trying to remember what he had read about the three Holdouts. Bai was supposed to be the violent one.\n“Don’t you know enough to put it together? Or did they really tell you nothing?” She stared at him frankly.\n“Pretend I’m stupid,” he said, face reddening.\n“The Adults called it the Pleroma when they spoke of it. Mostly they denied it exists. The big secret ruler of the Centaur, vastly wiser than the Onboard and utterly in charge. Only it’s not a great single entity; it’s a pantheon, disparate and strange. Entities, let’s call them that, who roamed the ship’s secret spaces, intent on their unfathomable business.”\n“That’s mythology. Kids talk about it, but the adults know better.”\n“Some Adults talked; they always did.” She looked at him curiously. “And when we broke away, desperate and scared and bleeding, some of these entities came with us. Not invited; they simply slipped aboard.\n“One certainly came with you. Do you really not know that?”\nKoishi said nothing. He realized, with a thrill of alarm, that Something here would know if he was lying.\n“Of course,” she said, studying his expression. “You guessed, or were told.”\nAnd to his astonishment, she began to cry.\n“You’re still just a tool, one that knows a bit. But it doesn’t matter; They know what tool will suffice. We knew this day would come.”\nShe pulled one foot loose from its adhesive strip, then grasped a handhold and hopped free of the other. In a flash she was through the opening to the platform below, where her spacesuit, unfolding itself like a flower, was drifting toward her.\n“I’m getting out of here. Want to see something? Then come on.”\nThey left through a different airlock, which should not have surprised him: of course they would have a second exit. Up to the parabolic ceiling and into a shaft that ran straight toward the surface.\nThe ascent was made in vacuum, which meant that Koishi only felt the cold when he touched a rung. Like Ming above him, whose boots were visible when he angled his helmet light upward, he kicked his way up, rising a surprising distance before the microgravity slowed him to a halt. With each kick, his sole felt a brief chill, a reminder of how cold the moons of Neptune really were.\nMeanwhile, they spoke to each other.\n“You disassembled your ship to build your shelter?”\n“We didn’t do it, but yes. Most of the EV-19 was converted into material for our living space and other things. The shell is suspended magnetically in a vacuum. More efficient simply to build above the surface, but of course we didn’t dare.”\nKoishi thought about this for a moment. “How many Beings were aboard your ship?”\n“Just one. I don’t know whether that was policy or happenstance. But there are more here now; the Beings have traveled, from—what did you call us? Mutineers?—from one Mutineer ship to another, multiplying and merging in ways that humans don’t understand.\n“We are scattered across Greater Neptune; I won’t tell you how far. And the Centaur doesn’t know where for sure, even if They can make good guesses. Most of the fleeing ships changed trajectories once Neptune blocked the Centaur’s view; by the time They launched surveillance satellites into the Centaur’s Trojan points, it was too late.”\nKoishi felt his head spinning. “So . . . ” he began uncertainly.\n“Hold on; we are nearing the surface.”\nKoishi focused his beam and saw Ming, hanging almost motionless, give a tiny kick to the nearest rung and recede upward at a much-diminished pace. She was pulling herself out slowly, lest—the image would have otherwise been risible—she kick too hard and fly into the sky.\nA few seconds later he saw her wriggle sideways and disappear, leaving the shaft’s opening a circle of deepest black. Carefully he followed, hand over hand. After a minute he poked his head through, to look upon the icescape of Thalassa. Already his gloves were feeling cool.\nMing was busy with something in her hands. “So we’re going somewhere,” she said. “Ordinarily I would simply leap, a nice parabolic trajectory that would take a few minutes and land me within meters of our destination. But you don’t know how and I can’t calculate the force needed to take the both of us. So we are taking the train.”\nKoishi wasn’t sure he heard her right. He watched as she unfolded a metal sheet perhaps a meter squared. She set it down at knee level, where it slowly settled a few centimeters and then hovered. She stepped smartly onto it, steadying herself with a wave as it wobbled slightly.\n“Hop on,” she said.\nHe took a hesitant step. The panel dipped beneath his boot, but she seized his forearm and he quickly got his other foot up. The platform swayed for a second, then began to move. Koishi had expected this and threw out his arms for balance as it slowly gained speed. He looked over the edge, but the superconducting cable was buried out of sight.\n“You rarely use this,” he ventured, “because the activated rail would appear to probes as a straight line pointing to your back door.”\n“Of course. But you’re here now, aren’t you?\n“The trip will take forty minutes. We can spend it in total silence if you like.”\nKoishi recognized a challenge. “You summoned me down here; I want to learn something. How have you spent the past two years?”\nShe laughed. “Do you think the Cave built itself? Even with the tools we had, it was months before we were able to start drilling. And we burned energy much faster than the power sources could replace it, which meant that we had to take time out to build more. Even finding the safest location took weeks, not to mention seeking deposits of organics we could mine for material. All hidden from prying eyes.”\n“But you are not building now, right? So how do you spend your days?”\nHe had half turned to see through her faceplate, where her gaze was fixed, unreadably, upon his.\n“You are wondering what three young people do living in a sealed cave? Without access to the games and chores you are given in the Centaur? That’s simple enough: we do what Alan was doing.”\n“‘Soaring.’”\n“We gave it that word early on, when we needed one. It’s what the Beings do: they study the universe, with every instrument available to them, plus the ones they are always devising. It is exhilarating beyond anything an unaugmented human brain can experience, save in delirium.”\nKoishi stared. “You have opened your minds to these Beings.”\n“We all have. The interaction is . . . I have never had to explain it to someone else. Your thoughts are deeper, clearer. You can hold more in your head at once, and all the irrational responses and judgments that people try—or don’t try—to free themselves from, they simply drop away.”\n“And this has left you—” He hesitated.\n“Something no longer human?” Her laugh sounded very human. “You react with ignorance and aversion, just as your brain evolved to do. I’ve still got my hominid brain, and find myself, at moments like this, more human than I like. But these Beings, as you put it, allow us to soar in their wake.\n“They are not terribly interested in people, but they accompanied us out here, and they helped keep us alive. Those who govern the Centaur don’t like or understand that. Why do you think they have come for us?”\nKoishi could think of no response to this. “And the other Holdouts elsewhere, are they also investigating the universe?”\n“You can ask them when you catch them,” she said crisply. “Which you—not you personally—will eventually do. Huaguo is just a stepping stone.”\n“The nearest rock,” he said, guessing at meaning.\n“At a temperature of fifty Kelvin, ice is like rock, so yes. The Holdouts—you probably really should call us something else—are scattered through the rings and on the moons, across two hundred million kilometers.\n“You will occupy our world, then hop over to Naiad as it swings past. Then Despina as well—both come within two thousand klicks at closest approach, a ridiculously small distance in Greater Neptune. What a staging point you have here! The Naiadae are probably already foreseeing a landing.”\n“So there are people on Naiad? The Naiadae?”\n“That’s what I said.”\n“And that makes you Thalassians?”\n“We are the people of Mount Huaguo,” she said, angry. “Dead white Earthmen don’t get to name us.”\n“What happened to Jian Bai?” he asked suddenly. “Where is he?”\nMing gestured dismissively. “He has his projects. And he isn’t happy that you’re here.”\nKoishi looked across the featureless landscape. It was almost impossible to establish any sense of scale, but he guessed that they were traveling perhaps twenty klicks an hour.\nHe remembered to jump sideways, not up. He kicked backward as well, and the floating platform continued on, receding smoothly even as Ming turned, cursing.\nOf course he was now rising and could not afford the minutes it would take for him to settle back to the surface. He hurled his torch upward as hard as he could, and felt himself recoiling downward. When he touched the surface a second later, the lateral velocity sent him stumbling. He recovered his footing with difficulty and sent the barbs in his soles plunging into the ice.\nMing had of course jumped off as well, and was moving swiftly toward him. By the time he had anchored his boots and finished reeling in his torch on its monofilament lead, she had planted herself in front of him.\n“You ridiculous fool. What, you feared an ambush? From where?”\n“Over the horizon, perhaps. Which is not far.”\n“You understand nothing, do you?”\n“Exactly. I understand far too little to—”\nThe ground rumbled beneath their feet. Both of them looked down, but the vibrations subsided after just over a second. Koishi was confusedly reflecting that Thalassa was not seismically active when the truth hit him.\n“It’s the River Stone,” he said. It didn’t require a long blast to take off, not even to rise quickly. Either Polytropos was coming to look for him or—the thought was a sliver of ice to the heart—the Beings at whose contact the entity had fled had followed it to the ship and seized control.\nHis suit had processing power enough to calculate the direction of the ship, and he turned toward it just in time to see a bright bead break over the horizon. Instantly, he saw that something was wrong. His helmet beam picked out the River Stone, still accelerating on a plume of heated ice particles: a spray of steam, white in the spotlight, turning at once into glistening snow. The ship had attained escape velocity almost upon liftoff and was still accelerating.\n“Your ship is leaving,” said Ming, for the moment as nonplussed as he. “For a second I thought it was going to come over and ‘save’ you.”\nKoishi was sending a message. “Polytropos! What is happening? Are you in control?” Long seconds passed, though it required only the first second’s silence for him to realize that he was not going to get a response. River Stone was now too distant for his beam to illuminate, visible only as a black speck moving against the face of Neptune.\nKoishi kept his voice steady. “I can guess what happened. Your Beings took over the ship and lit out.”\n“Or they attempted to wrest control from the Being onboard—don’t tell me there isn’t one—and it fled to escape the onslaught. Just as likely. Or—” She paused, and a long minute passed.\n“It’s not heading back to the Centaur,” said Koishi dully. His suit’s calculator told him that much.\n“Here’s a guess: it’s heading for Naiad, to gather what data it can before the Naiadae notice its approach and take cover.”\nAs reasonable a guess as any other, save for the refusal to reply. “What were you going to show me?” he asked, in order to say something.\n“Before you hopped off? We call it the Crystal Palace. The railway goes straight there, but we usually travel by the tunnel, which cuts a chord straight through Huaguo. The entire facility is underground, hidden from the Centaur’s probing eyes.”\nKoishi was having trouble thinking straight. “So you were going to show me an expanse of bare ice, just so I could see how there was nothing visible?”\n“Yes. When I am out of communion with the Beings, as you call them, I am as proud and petty as any other human being. Also, I wanted you away from our house.”\n“Would you have then let me down some shaft to admire your project?”\n“I would have to ask Jian; that’s where he is.” She glanced at him and added, “He isn’t lying in wait.”\n“It hardly matters now.”\n“Just be quiet.” The bitterness in her voice took him aback. “You have won, whether you understand that or not. Your people will come for you in another ship. Perhaps they will scoop us up as well. Whatever they wanted—and it isn’t your little school project—they will get. Why are you so unhappy?”\nA second tremor shook the ice beneath them. Koishi was merely startled, but Ming, understanding, shrieked. The shuddering grew, and then grew loud: a deep rending groan conducted up through their boots. Ming turned to look back the way they had come, and Koishi’s gaze followed.\nTheir helmet beams could illuminate nothing where there was only vacuum, but that ended quickly. An enormous plume rose above the horizon, glittering white. Steam spurted into space, froze at once into crystals that spread, still rising, like millions of tiny stars. The tremors were becoming more violent, enough that their suits were having trouble keeping the beams fixed on the towering cloud.\nAnd then it appeared: an enormous egg, jetting steam from a nozzle at its base, ascended slowly into the glittering cloud. It swiftly gained velocity, shrugging off the moonlet’s paltry attempts to retain it. Ming was rocking on her heels as she wailed, but Koishi followed the craft’s trajectory until it was so far overhead that he could not tip his helmet farther.\n“So Chang is onboard?” he asked after a moment.\n“They both are.” Ming was gulping and hiccupping, so that Koishi wasn’t sure he understood her. “As, I assume, are Tokoloshe and Susanoo—our names for Them,” she added.\n“Why would—”\n“I don’t know.” She was trying to gain composure enough to speak clearly. “All I know is they are gone. The departure notice, which was sent automatically, included a manifest.”\nThey stood unmoving beneath the almost-black plain, feeling the occasional vibration as the shock waves bounced off some internal structure and echoed back.\n“That shell must be pretty thin for a spacecraft,” he observed after a moment.\n“It’s airtight, and the engines mounted fore and aft were enough to melt ice and launch. You don’t need much thrust to fly off.”\n“And the Beings are on board as well?”\nMing sighed. “They come and go as they please, and it can be hard to know where they actually are. They are not digital structures that can be sent as strings of data: much of their substance does not exist in normal space, but there is always a part that occupies a physical matrix. I am sure they are now all gone—they would not allow themselves to be marooned here.”\n“Two on one ship, one on the other?”\n“Or all three on both. They are too strange for us to understand, but I know that they can join, like two blobs of mercury, to form a new entity. If they possess enough of whatever substance they require—and they don’t talk about this—they can probably divide themselves in two.\n“Care to ask your late shipmate?” she added. “I’m sure it can hear us.”\nIt was hours later before he saw her again. Ming had leaped into the air without a word and vanished over the horizon, and a minute later the “train,” gliding smoothly over the ice, had returned to stop beside him. Koishi stepped on and it resumed its trip over the horizon.\nThe terminus proved, as promised, to be a barren plain, and Koishi walked its length, gazing down, until he found the outlines of a hatch. He stamped on it, knock knock, and a moment later the square of ice rose and slid sideways, disclosing the entrance beneath.\nHe dropped slowly down the shaft, bumping gently against one side as Thalassa slowly rotated, until he saw the bottom yawn below him and grabbed a rung. The last few meters he took hand over hand before touching an ice-cold floor.\nHe stepped through an alcove into an enormous space, dark and utterly silent. With no air to diffuse his beam, the helmet light picked out only a small circle on an opposite wall, dozens of meters away. He played the beam across its slow curvature, guessing at the cavern’s extent.\n“It is more impressive when I light it up, but I don’t really feel like impressing you.”\nKoishi turned to see Ming standing halfway across the vast floor. Unless he directed the beam right into her face, he could not see her expression.\n“So what do we do now?” he asked.\nShe shrugged. “We eat, drink, sleep. In this gravity, every surface is soft. Your masters will come for us long before our resources are exhausted. You will return in triumph, and I in chains: the first captured Holdout.”\n“I don’t feel especially triumphant.”\n“You were the bait that hid the hook. The fisherman doesn’t always get his bait back.”\nKoishi could guess at the meaning of that. “You will get to see your family again,” he said.\n“Please shut up. There are other chambers here; go explore them if you like.” And she walked away.\nAfter thinking a moment, Koishi adjusted his hand torch so that it cast a medium-strength beam in all directions, as though he were holding up a flaming brand. The Crystal Palace was a high-vaulted space, lined with galleries that apparently led off into further rooms. A miracle of low-gravity architecture, this inverted edifice—hewn of emptiness from the surrounding substance—must, even with cutting tools adapted from the ship’s engines and the calculations of a Being, have required months of labor.\nThe floor was crisscrossed with strips of slightly adhesive material, which allowed one to walk almost normally. He followed one through an arched door into another space, a large low-ceilinged room like an abandoned banquet hall.\n“Any of you still here?”\nSilence, as he had expected.\n“You may still be here, of course. Can’t you leave copies of yourselves behind, lingering ghosts?”\nHe ventured farther into the space. Why had they gone to such trouble? Koishi could imagine the Beings striding like gods through these halls, but he knew that was wrong: they were not like anything humans understood.\n“So did I do the right thing?” Did I do anything, he could not bring himself to ask. If there was a conflict beginning, the principals did not seem to be humans.\nIce overhead, then vacuum, then tumbling shards of rock that moved so slowly they seemed to be hanging in the void. Perhaps the Centaur would retrieve its wayward children, or the Beings who controlled it—why now deny that?—reconcile with their seceded peers. Koishi stood in the darkness, uncounseled and unsought, and marshaled his slow and imperfect thoughts toward what this now could mean.\nGregory Feeley writes science fiction and about science fiction. His first novel, The Oxygen Barons, was nominated for the Philip K. Dick Award and. His stories have been finalists for the Nebula Award and his essays and reviews have appeared in a variety of publications, including The Atlantic Monthly, the New York Times Magazine, the Washington Post Book World, and USA Today. Feeley's most recent novel is Kentauros and he recently completed a long novel, Hamlet the Magician. His previous Clarkesworld story, \"Cloud-Born\" will be reprinted in two \"year's best\" anthologies this year.", "source": "https://clarkesworldmagazine.com/feeley_10_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Wandering Rocks by Gregory Feeley"}