{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6ZTn6gyfrP3RK2Sjx93Rl5Y0S+c=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Change Can Be Good  July once again whisks me off to Readercon for an extended weekend with friends. I’m told that this is the last year the convention will be held in the Burlington Marriot and that makes me a little sad. I’ve been going there for over ten years and yes, I’ll still attend in the new location, but it won’t be quite the same. The location has become as much a part of the event for me, largely due to a couple of significant anniversaries.  The first is the birth of Clarkesworld. Our ninth anniversary will occur in October, but the magazine was born at Readercon. At the Friday night Meet the Pros(e) party, Sean Wallace and I got into a long discussion about online magazines spurred on by SciFiction’s recent closure. [SciFiction was the Sci Fi channel’s online magazine and its demise was a huge blow to the perceived credibility of the medium.] That night, we spent hours trying to figure out why so many online magazines had failed and what it would take to make one succeed. Sleep-deprived and a bit too overconfident, we came up with a business model we thought would work. By the end of the weekend, it was a done deal: I was launching a magazine. Nine years later, that wild little experiment is turning into what I hope will become my career. Not bad for something I stumbled into with no prior experience.  The second anniversary is one that you’d think I’d want to forget. Three years ago, as I was setting up my table in the Readercon Dealer’s room, I started feeling ill. Convinced I had food poisoning, I made my way back to the hotel room where I spent a few hours before accepting that it wasn’t what I thought. My wife called for an ambulance and when the EMTs arrived, they took one look at me and declared that I was having a heart attack. Fortunately, Lahey Clinic, one of the best hospitals in the area, is only a couple of blocks from the hotel. I spent the next week dealing with the fallout of having a “widow-maker” heart attack that I was lucky to have survived. Significant damage to my heart later led to the installation of my defibrillator and my new life as a cyborg.  After that, returning the next year was intimidating. As a distraction, I deliberately scheduled a Kickstarter campaign to end that weekend. That campaign funded Upgraded, my cyborg anthology, which in itself was an attempt to make some good of it all . . . but even now, three years later, I can’t say that what happened was a bad thing. I was very lucky to have survived and that’s not lost on me. Every day since is like bonus time. I’m still around to see my kids grow up, have my twentieth anniversary, see my sister get married and have her first child, win a Hugo and a World Fantasy Award, and find a better path. Sure, that it happened, the ongoing physical issues, and the slow pace at which I change careers can be frustrating, but I’m still here.  So, I’m returning to Burlington for one last time and I’m going to enjoy the time we have left. Change can be good and if anything, those two anniversaries should remind me of that.  I’ll end this month’s ramblings with one more change. In June, we reached another one of our Patreon goals and increased our fiction budget. Our philosophy has always been start small and grow. Nine years ago, our table of contents included two short stories (less than four thousand words each) and a cover. Over the years, we’ve added non-fiction, more stories, and increased the maximum story length to eight thousand words. Thanks to our subscribers and Patreon supporters, we can now increase the maximum story length to sixteen thousand words and publish more novelettes. There won’t be more than one in a single issue or even one in every issue, but this gives me the flexibility to go there when the story needs it. Many of my favorite stories over the years have been novelettes and I’m very pleased to be able to have this option open to us.  Next on the to-do list is pay raises for the staff. This one is long overdue and I hope to be celebrating that one soon. If you’d like to help, a long list of options can be found on our “support us” page.  Thanks and have a great July! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Change Can Be Good\nJuly once again whisks me off to Readercon for an extended weekend with friends. I’m told that this is the last year the convention will be held in the Burlington Marriot and that makes me a little sad. I’ve been going there for over ten years and yes, I’ll still attend in the new location, but it won’t be quite the same. The location has become as much a part of the event for me, largely due to a couple of significant anniversaries.\nThe first is the birth of Clarkesworld. Our ninth anniversary will occur in October, but the magazine was born at Readercon. At the Friday night Meet the Pros(e) party, Sean Wallace and I got into a long discussion about online magazines spurred on by SciFiction’s recent closure. [SciFiction was the Sci Fi channel’s online magazine and its demise was a huge blow to the perceived credibility of the medium.] That night, we spent hours trying to figure out why so many online magazines had failed and what it would take to make one succeed. Sleep-deprived and a bit too overconfident, we came up with a business model we thought would work. By the end of the weekend, it was a done deal: I was launching a magazine. Nine years later, that wild little experiment is turning into what I hope will become my career. Not bad for something I stumbled into with no prior experience.\nThe second anniversary is one that you’d think I’d want to forget. Three years ago, as I was setting up my table in the Readercon Dealer’s room, I started feeling ill. Convinced I had food poisoning, I made my way back to the hotel room where I spent a few hours before accepting that it wasn’t what I thought. My wife called for an ambulance and when the EMTs arrived, they took one look at me and declared that I was having a heart attack. Fortunately, Lahey Clinic, one of the best hospitals in the area, is only a couple of blocks from the hotel. I spent the next week dealing with the fallout of having a “widow-maker” heart attack that I was lucky to have survived. Significant damage to my heart later led to the installation of my defibrillator and my new life as a cyborg.\nAfter that, returning the next year was intimidating. As a distraction, I deliberately scheduled a Kickstarter campaign to end that weekend. That campaign funded Upgraded, my cyborg anthology, which in itself was an attempt to make some good of it all . . . but even now, three years later, I can’t say that what happened was a bad thing. I was very lucky to have survived and that’s not lost on me. Every day since is like bonus time. I’m still around to see my kids grow up, have my twentieth anniversary, see my sister get married and have her first child, win a Hugo and a World Fantasy Award, and find a better path. Sure, that it happened, the ongoing physical issues, and the slow pace at which I change careers can be frustrating, but I’m still here.\nSo, I’m returning to Burlington for one last time and I’m going to enjoy the time we have left. Change can be good and if anything, those two anniversaries should remind me of that.\nI’ll end this month’s ramblings with one more change. In June, we reached another one of our Patreon goals and increased our fiction budget. Our philosophy has always been start small and grow. Nine years ago, our table of contents included two short stories (less than four thousand words each) and a cover. Over the years, we’ve added non-fiction, more stories, and increased the maximum story length to eight thousand words. Thanks to our subscribers and Patreon supporters, we can now increase the maximum story length to sixteen thousand words and publish more novelettes. There won’t be more than one in a single issue or even one in every issue, but this gives me the flexibility to go there when the story needs it. Many of my favorite stories over the years have been novelettes and I’m very pleased to be able to have this option open to us.\nNext on the to-do list is pay raises for the staff. This one is long overdue and I hope to be celebrating that one soon. If you’d like to help, a long list of options can be found on our “support us” page.\nThanks and have a great July!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_07_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Change Can Be Good by Neil Clarke"}