{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6YQ5UqEt+NqyA91hRacnoHpwUqo=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Faith in Vision: A Conversation with Ken Liu  With “100+ short stories, novelettes, and novellas,” the collection The Paper Menagerie and Other Stories, a debut novel The Grace of Kings and second book in the Dandelion Dynasty Series The Wall of Storms, a Star Wars novel Journey to Star Wars: The Last Jedi The Legends of Luke Skywalker, and many translations (including Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, as well as Chen Qiufan’s The Waste Tide), you have probably heard of Ken Liu. He has been nominated for and won multiple awards, including the Hugo, Locus, Nebula, and World Fantasy, as well as international awards such as the Premio Ignotus, the Seiun, and the Grand prix de l’Imaginaire. “The Plantimal” won the 2015 Asimov’s Readers’ Poll and “The Clockwork Soldier” won Best 2014 Clarkesworld Story.  Liu’s official bio will tell you that prior to becoming a full-time writer, he worked as a software engineer, corporate lawyer, and litigation consultant; that he “frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, the mathematics of origami, and other subjects of his expertise.” Perhaps more importantly, his fiction has a reputation for breaking hearts. Thought provoking and thoughtful, many of his stories are known for both pushing boundaries and an emotional gut-punch.   Your first short fiction sale was published in 2002: “Carthaginian Rose.” But looking at your publication history, it seems like your fiction really gained traction in 2011. What was the journey to your first publication like? Did you sell that story and the subsequent ones right away or did you struggle through rejections? And what happened or changed in 2011—was it your style, your skill level, the market, or something else that essentially shifted your writing career?  I almost failed out before my career even got started.  Before I got my first pro-rate publication, I wrote a ton of stories to learn the craft and collected hundreds of rejection letters. That part was fine; everyone goes through them. Because I was so focused on getting published, however, I never thought through how I ought to change my approach to writing (or not) after I got that sale.  The first couple of pro sales made me think I had it all figured out—probably the most foolish thing I could have thought. I finished one particular story that I was very proud of, but unfortunately it was rejected by every market that I submitted to. Rather than just moving on to write another story (as I would have done in the days before I had any sales), I became obsessed with it and kept on tweaking it and sending it out again. The story became a referendum on my worth as a writer. I felt that I had to get it published to prove that the previous sales weren’t flukes. I went through all the pro markets, the semipros, the token markets . . . and when I ran out of places to submit, I concluded that I was just not meant for the writing life and stopped.  Years later, when Sumana Harihareswara and Leonard Richardson put out the call for submissions for Thoughtcrime Experiments, an anthology that specifically looked for stories that had been rejected multiple times by pro markets, it felt like a message aimed at me from the universe. I submitted my story, and it was accepted. That one acceptance ended up changing my life, as I began writing and submitting again.  The lesson I learned, if there was one, wasn’t so much that I should never give up on a story; rather, it was that I had been, as explained by Tobias Buckell, confusing goals and milestones. I had no control over whether an individual story would be accepted by pro markets (or whether it would win an award, be read by lots of people, lead to a novel deal . . . ), and I shouldn’t have put all my sense of worth in external validation. When that story kept on getting rejected, I should have simply moved on to things I could control: write another story, start a novel, finish a novel, experiment with a new genre. I should have focused more on my own sense of satisfaction with the art I was creating.  After that, I turned inward and sought self-validation, rather than external validation. I wrote many more stories and experimented with different techniques, genres, plots, story structures, and so on. I no longer cared about whether stories were accepted; I only wanted to see if the next story I wrote would be more interesting to me than the last one.  Paradoxically, I started selling a lot more stories from that point on. Apparently not caring about whether my work would receive the kind of recognition I used to crave was the best thing I could have done for my career.  One of the things I really like on your website is that you list personal favorites: “Stories that I personally like a lot that didn’t get much attention.” Do you feel like those favorites have certain things in common or do you feel like there are specific reasons why these stories didn’t receive the attention other works did?  As I mentioned earlier, I tend to experiment a lot and focus on my own sense of satisfaction. I feel whether a particular story would receive critical and reader attention is entirely out of my control, and I have to ignore that as much as possible.  So I don’t ask myself questions about why something didn’t get much recognition. There are so many random factors influencing the reception of a story that I find the exercise to be counterproductive to maintaining a creative mindset. As long as I think there’s something in a story that strikes me as particularly interesting, and the final result fulfills my aesthetic vision, then I’m happy. If not, then I want to do better in the next attempt.  Whether anyone else likes the story or talks about it is less than an afterthought—it’s a no-thought.  I don’t think there’s much that unifies the stories that I like the most—my interest in various subjects has waxed and waned over time—but they do tend to embody my aesthetic vision most clearly.  How do you make a story emotionally effective?  Ultimately the only reader I want to please is me, so I try to tell stories that I don’t see anyone else telling and tell them in ways that only I can. It’s difficult for any author to write a story that is affecting for the author because there are no secrets, no tricks, no sleight of hand, no way to fool yourself. The only way to tell a story that moves the heart doing the telling is to dig deep and stick to the Truth and only the Truth.  That stories that stir me deeply sometimes also move others feels rather miraculous—and gives me hope that communication and intersubjectivity are in fact possible and not mere wishful thinking. The belief that the human can also be Human, the individual defined by the community, the self a part of Us . . . these are recurring themes in my fiction, and it’s no wonder that they ultimately determine my metafictional approach.  Are there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?  The biggest challenge has always been to maintain faith in my own vision and to stick to my aesthetic vision. When you’re an artist working in a market economy, there are always a thousand-thousand voices telling you that what you’re doing is wrong, unpopular, deviating from the “rules” and “standards”; many are happy to tell you, often without you soliciting advice, that you’d be better off doing it this way or that way; plenty of people who know much less than you about topics important to you would profess to be experts and give you “guidance” (I’ve grown less tolerant of this last vice over time, and now I simply cut off such people mercilessly—I encourage all of you to do the same; you’ll be much happier).  It’s very hard to learn to ignore these voices, and though I’ve gotten better over time, I still can’t claim to have completely transcended the craving for external validation or the skill to bat aside all voices of doubt. I can only strive to do better with each new work and to disregard even more completely the unhelpful opinions of others.  Your first collection, The Paper Menagerie and Other Stories, came out in 2016 with Saga Press. The title story, “The Paper Menagerie,” is a heart-wrenching tale, one that feels very personal, and focuses on issues around the immigrant experience and generational relationships. Your second collection, The Hidden Girl and Other Stories, is due out February 2020. Are there important similarities and differences between the two collections, in terms of themes, moods, styles, or other aspects?  I think the biggest difference between the two collections is just the degree to which I’ve grown as a writer. When the first collection came out, most of the stories were still to various degrees trying to follow conventional “rules.” By the time my second collection came out, I felt that I was focusing more on my own internal compass: Do I feel this story does something unique to me and does it well? The second collection is more difficult to classify, and I like that it resists being pinned down.  But ultimately my stories are still my stories, and I think both collections reflect the same thematic and aesthetic concerns: skepticism about easy answers; the importance of empathy; technology as essentially an amplifier of human nature, both noble and base; refusal to accept generalizations and categorizations; rejection of labels; faith that reason is useless without the guidance of heartfelt emotion; and so on.  When you think on the new collection, what are the one or two standout stories for you, the ones you hope everyone reads, even if they don’t read the others; and why?  The author may write the text, but stories only come alive in the interplay between the text and the reader. Before a text is decoded, it is first translated and filtered and transformed by the experiences and expectations of the reader. Because every reader is different, every story is also different when interpreted through each individual consciousness. The story I write is not the story that a reader reads—not unless the reader is me.  All of which is to say: I don’t think it matters much which stories stand out to me (they all do, because I wouldn’t have put them in the collection unless they did something special to me).  Readers will make their own judgments, and the more divergent readers’ opinions are, the happier I am—for it shows how incredibly different each of us is from everyone else.  How boring the world would be if we all felt the same way.  You also have the conclusion to The Dandelion Dynasty series coming out, expected in 2020. Book 1, The Grace of Kings, came out in 2015. What has the overall journey of writing this series been like? Were there importantly different challenges to writing the conclusion? Has the experience changed your writing in any specific ways?  I started writing this series almost a full decade ago, and before I wrote the first word of the first book, I already had in mind the final scene of the entire series. This meant that I had the overall shape of the journey, the grand landmarks, but not the precise path. It took me ten years to discover the route from start to end, but I did get to the end.  It’s bittersweet. On the one hand, I’m about to say goodbye to a world I’ve lived in and dreamed in for a very large part of my life; on the other hand, I’m about to realize a vision that has lived only in my head for the past ten years.  Writing the conclusion to the series has been the most fun I’ve had as a writer. The silkpunk epic fantasy series is heavy on technology (though that word is never used in the books), so I’ve had to do a lot of prototyping. My favorite part involved building models of electrostatic machines (such as Ben Franklin’s motor) and wiring together circuits to be sure that my fictional designs would work (at least close enough for fantasy engineering purposes). (Pro tip: Wimshurst generators are great for charging up Leyden jars.) I also used 3D-printing to make some models to make blocking and describing battle scenes easier. And writing software simulations of the “instructible” engines in the novels was challenging but very enjoyable.  Since I’m wrapping up the series, there was no need to “save” anything for future books. I just put all the ideas I cared about into this installment. It was really hard to keep everything straight and to make sure all the loose ends were tied up. My little wiki for the world of Dara has now grown into a beast, filled with all sorts of material that would never make it into the books, but which make Dara more substantial.  I feel so blessed to have been able to work on this series. Not many people can say that they’ve devoted a decade of their life to the creation of a single world, living in it, and telling its story. And now the narrative is finished; I just need to put in a few finishing touches before sharing it with the world.  What has been the hardest or most challenging aspect of writing the conclusion?  Witnessing characters make decisions that are true to themselves but heart-wrenching to me, as their author.  I knew that I succeeded in accomplishing what I set out to do because even knowing all the literary techniques and narrative devices I deployed to evoke the world and the characters, even with every move and countermove on open display, I still felt myself taken up by the magic. I was moved by the deeds of my characters.  What is important or special to you about the series overall, and what is specifically important or special to you about the conclusion?  The Dandelion Dynasty isn’t about any specific culture or history; it is about all the things I care for as a human being living in this moment on this planet. It’s about politics, technology, faith in ideals; it’s also about being a link in the endless chain of generations, the resilience of evolving traditions, the expression of individuality through relationships, the importance of doubt in self-definition, the need to cling to hope in the face of overwhelming oppression and violence; it’s a love song to the diverse classical traditions of our species, an ode to our potential for empathy and grandness of spirit, as well as a philippic against the less noble aspects of our inconstant nature.  It is, in some ways, the purest expression—up to this point—of my aesthetic vision. I believe it’s the best thing I’ve ever written, and that makes me so happy.  Where does the story go next that is important for readers to know?  The concluding installment for the series is long and grand—in some sense, everything that has happened before is merely a prelude to the heart of the story.  Looking back on the industry overall, from when you started selling stories in 2002 to now, do you feel like the industry has changed in any significant or important ways?  The longer I’ve been in this business, the less I understand it. I now view any sort of generalization about publishing with skepticism because there are so many ways to “succeed” and no advice seems universally applicable to everyone. If I could give the younger me any sort of advice, it would be to pay less attention to what others say, to focus on the inner voice, the yearning to tell stories that no one else is telling, and to ignore the doubters as much as possible. Please the only reader that matters: yourself.  Do you feel like you are where you have always wanted to be in your writing career? Do you have career goals, hopes, and dreams? In other words, what is the next level for you?  I said earlier that The Dandelion Dynasty feels like the purest expression of my aesthetic vision to date, which means that I still want to go on and get even purer. I believe my next book and next story will be even closer to the ideal, and I will be able to care about external validation even less.  But as much as I want to be able to focus solely on execution, I’ve found it so encouraging and helpful to hear from readers all around the world who felt their souls stirred by my visions. My fiction has taken me around the world, and I’ve heard from readers in person as well as through the ether, across languages, cultures, borders, divisions visible and invisible. I cherish these messages so much. As I mentioned earlier, every time I experience one of these moments when the author’s and the reader’s souls vibrate in sympathy, when consciousnesses touch and share a moment of intersubjectivity mediated by the text, it feels like a miracle. I feel so blessed to have experienced many such moments. Of all my measurable accomplishments, these messages from the reader, when they saw what I saw, heard what I heard, felt what I felt . . . these are the moments when I am most joyous as an author because they affirm for me the beauty of our species and our potential for infinite empathy. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nFaith in Vision: A Conversation with Ken Liu\nWith “100+ short stories, novelettes, and novellas,” the collection The Paper Menagerie and Other Stories, a debut novel The Grace of Kings and second book in the Dandelion Dynasty Series The Wall of Storms, a Star Wars novel Journey to Star Wars: The Last Jedi The Legends of Luke Skywalker, and many translations (including Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, as well as Chen Qiufan’s The Waste Tide), you have probably heard of Ken Liu. He has been nominated for and won multiple awards, including the Hugo, Locus, Nebula, and World Fantasy, as well as international awards such as the Premio Ignotus, the Seiun, and the Grand prix de l’Imaginaire. “The Plantimal” won the 2015 Asimov’s Readers’ Poll and “The Clockwork Soldier” won Best 2014 Clarkesworld Story.\nLiu’s official bio will tell you that prior to becoming a full-time writer, he worked as a software engineer, corporate lawyer, and litigation consultant; that he “frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, the mathematics of origami, and other subjects of his expertise.” Perhaps more importantly, his fiction has a reputation for breaking hearts. Thought provoking and thoughtful, many of his stories are known for both pushing boundaries and an emotional gut-punch.\nYour first short fiction sale was published in 2002: “Carthaginian Rose.” But looking at your publication history, it seems like your fiction really gained traction in 2011. What was the journey to your first publication like? Did you sell that story and the subsequent ones right away or did you struggle through rejections? And what happened or changed in 2011—was it your style, your skill level, the market, or something else that essentially shifted your writing career?\nI almost failed out before my career even got started.\nBefore I got my first pro-rate publication, I wrote a ton of stories to learn the craft and collected hundreds of rejection letters. That part was fine; everyone goes through them. Because I was so focused on getting published, however, I never thought through how I ought to change my approach to writing (or not) after I got that sale.\nThe first couple of pro sales made me think I had it all figured out—probably the most foolish thing I could have thought. I finished one particular story that I was very proud of, but unfortunately it was rejected by every market that I submitted to. Rather than just moving on to write another story (as I would have done in the days before I had any sales), I became obsessed with it and kept on tweaking it and sending it out again. The story became a referendum on my worth as a writer. I felt that I had to get it published to prove that the previous sales weren’t flukes. I went through all the pro markets, the semipros, the token markets . . . and when I ran out of places to submit, I concluded that I was just not meant for the writing life and stopped.\nYears later, when Sumana Harihareswara and Leonard Richardson put out the call for submissions for Thoughtcrime Experiments, an anthology that specifically looked for stories that had been rejected multiple times by pro markets, it felt like a message aimed at me from the universe. I submitted my story, and it was accepted. That one acceptance ended up changing my life, as I began writing and submitting again.\nThe lesson I learned, if there was one, wasn’t so much that I should never give up on a story; rather, it was that I had been, as explained by Tobias Buckell, confusing goals and milestones. I had no control over whether an individual story would be accepted by pro markets (or whether it would win an award, be read by lots of people, lead to a novel deal . . . ), and I shouldn’t have put all my sense of worth in external validation. When that story kept on getting rejected, I should have simply moved on to things I could control: write another story, start a novel, finish a novel, experiment with a new genre. I should have focused more on my own sense of satisfaction with the art I was creating.\nAfter that, I turned inward and sought self-validation, rather than external validation. I wrote many more stories and experimented with different techniques, genres, plots, story structures, and so on. I no longer cared about whether stories were accepted; I only wanted to see if the next story I wrote would be more interesting to me than the last one.\nParadoxically, I started selling a lot more stories from that point on. Apparently not caring about whether my work would receive the kind of recognition I used to crave was the best thing I could have done for my career.\nOne of the things I really like on your website is that you list personal favorites: “Stories that I personally like a lot that didn’t get much attention.” Do you feel like those favorites have certain things in common or do you feel like there are specific reasons why these stories didn’t receive the attention other works did?\nAs I mentioned earlier, I tend to experiment a lot and focus on my own sense of satisfaction. I feel whether a particular story would receive critical and reader attention is entirely out of my control, and I have to ignore that as much as possible.\nSo I don’t ask myself questions about why something didn’t get much recognition. There are so many random factors influencing the reception of a story that I find the exercise to be counterproductive to maintaining a creative mindset. As long as I think there’s something in a story that strikes me as particularly interesting, and the final result fulfills my aesthetic vision, then I’m happy. If not, then I want to do better in the next attempt.\nWhether anyone else likes the story or talks about it is less than an afterthought—it’s a no-thought.\nI don’t think there’s much that unifies the stories that I like the most—my interest in various subjects has waxed and waned over time—but they do tend to embody my aesthetic vision most clearly.\nHow do you make a story emotionally effective?\nUltimately the only reader I want to please is me, so I try to tell stories that I don’t see anyone else telling and tell them in ways that only I can. It’s difficult for any author to write a story that is affecting for the author because there are no secrets, no tricks, no sleight of hand, no way to fool yourself. The only way to tell a story that moves the heart doing the telling is to dig deep and stick to the Truth and only the Truth.\nThat stories that stir me deeply sometimes also move others feels rather miraculous—and gives me hope that communication and intersubjectivity are in fact possible and not mere wishful thinking. The belief that the human can also be Human, the individual defined by the community, the self a part of Us . . . these are recurring themes in my fiction, and it’s no wonder that they ultimately determine my metafictional approach.\nAre there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?\nThe biggest challenge has always been to maintain faith in my own vision and to stick to my aesthetic vision. When you’re an artist working in a market economy, there are always a thousand-thousand voices telling you that what you’re doing is wrong, unpopular, deviating from the “rules” and “standards”; many are happy to tell you, often without you soliciting advice, that you’d be better off doing it this way or that way; plenty of people who know much less than you about topics important to you would profess to be experts and give you “guidance” (I’ve grown less tolerant of this last vice over time, and now I simply cut off such people mercilessly—I encourage all of you to do the same; you’ll be much happier).\nIt’s very hard to learn to ignore these voices, and though I’ve gotten better over time, I still can’t claim to have completely transcended the craving for external validation or the skill to bat aside all voices of doubt. I can only strive to do better with each new work and to disregard even more completely the unhelpful opinions of others.\nYour first collection, The Paper Menagerie and Other Stories, came out in 2016 with Saga Press. The title story, “The Paper Menagerie,” is a heart-wrenching tale, one that feels very personal, and focuses on issues around the immigrant experience and generational relationships. Your second collection, The Hidden Girl and Other Stories, is due out February 2020. Are there important similarities and differences between the two collections, in terms of themes, moods, styles, or other aspects?\nI think the biggest difference between the two collections is just the degree to which I’ve grown as a writer. When the first collection came out, most of the stories were still to various degrees trying to follow conventional “rules.” By the time my second collection came out, I felt that I was focusing more on my own internal compass: Do I feel this story does something unique to me and does it well? The second collection is more difficult to classify, and I like that it resists being pinned down.\nBut ultimately my stories are still my stories, and I think both collections reflect the same thematic and aesthetic concerns: skepticism about easy answers; the importance of empathy; technology as essentially an amplifier of human nature, both noble and base; refusal to accept generalizations and categorizations; rejection of labels; faith that reason is useless without the guidance of heartfelt emotion; and so on.\nWhen you think on the new collection, what are the one or two standout stories for you, the ones you hope everyone reads, even if they don’t read the others; and why?\nThe author may write the text, but stories only come alive in the interplay between the text and the reader. Before a text is decoded, it is first translated and filtered and transformed by the experiences and expectations of the reader. Because every reader is different, every story is also different when interpreted through each individual consciousness. The story I write is not the story that a reader reads—not unless the reader is me.\nAll of which is to say: I don’t think it matters much which stories stand out to me (they all do, because I wouldn’t have put them in the collection unless they did something special to me).\nReaders will make their own judgments, and the more divergent readers’ opinions are, the happier I am—for it shows how incredibly different each of us is from everyone else.\nHow boring the world would be if we all felt the same way.\nYou also have the conclusion to The Dandelion Dynasty series coming out, expected in 2020. Book 1, The Grace of Kings, came out in 2015. What has the overall journey of writing this series been like? Were there importantly different challenges to writing the conclusion? Has the experience changed your writing in any specific ways?\nI started writing this series almost a full decade ago, and before I wrote the first word of the first book, I already had in mind the final scene of the entire series. This meant that I had the overall shape of the journey, the grand landmarks, but not the precise path. It took me ten years to discover the route from start to end, but I did get to the end.\nIt’s bittersweet. On the one hand, I’m about to say goodbye to a world I’ve lived in and dreamed in for a very large part of my life; on the other hand, I’m about to realize a vision that has lived only in my head for the past ten years.\nWriting the conclusion to the series has been the most fun I’ve had as a writer. The silkpunk epic fantasy series is heavy on technology (though that word is never used in the books), so I’ve had to do a lot of prototyping. My favorite part involved building models of electrostatic machines (such as Ben Franklin’s motor) and wiring together circuits to be sure that my fictional designs would work (at least close enough for fantasy engineering purposes). (Pro tip: Wimshurst generators are great for charging up Leyden jars.) I also used 3D-printing to make some models to make blocking and describing battle scenes easier. And writing software simulations of the “instructible” engines in the novels was challenging but very enjoyable.\nSince I’m wrapping up the series, there was no need to “save” anything for future books. I just put all the ideas I cared about into this installment. It was really hard to keep everything straight and to make sure all the loose ends were tied up. My little wiki for the world of Dara has now grown into a beast, filled with all sorts of material that would never make it into the books, but which make Dara more substantial.\nI feel so blessed to have been able to work on this series. Not many people can say that they’ve devoted a decade of their life to the creation of a single world, living in it, and telling its story. And now the narrative is finished; I just need to put in a few finishing touches before sharing it with the world.\nWhat has been the hardest or most challenging aspect of writing the conclusion?\nWitnessing characters make decisions that are true to themselves but heart-wrenching to me, as their author.\nI knew that I succeeded in accomplishing what I set out to do because even knowing all the literary techniques and narrative devices I deployed to evoke the world and the characters, even with every move and countermove on open display, I still felt myself taken up by the magic. I was moved by the deeds of my characters.\nWhat is important or special to you about the series overall, and what is specifically important or special to you about the conclusion?\nThe Dandelion Dynasty isn’t about any specific culture or history; it is about all the things I care for as a human being living in this moment on this planet. It’s about politics, technology, faith in ideals; it’s also about being a link in the endless chain of generations, the resilience of evolving traditions, the expression of individuality through relationships, the importance of doubt in self-definition, the need to cling to hope in the face of overwhelming oppression and violence; it’s a love song to the diverse classical traditions of our species, an ode to our potential for empathy and grandness of spirit, as well as a philippic against the less noble aspects of our inconstant nature.\nIt is, in some ways, the purest expression—up to this point—of my aesthetic vision. I believe it’s the best thing I’ve ever written, and that makes me so happy.\nWhere does the story go next that is important for readers to know?\nThe concluding installment for the series is long and grand—in some sense, everything that has happened before is merely a prelude to the heart of the story.\nLooking back on the industry overall, from when you started selling stories in 2002 to now, do you feel like the industry has changed in any significant or important ways?\nThe longer I’ve been in this business, the less I understand it. I now view any sort of generalization about publishing with skepticism because there are so many ways to “succeed” and no advice seems universally applicable to everyone. If I could give the younger me any sort of advice, it would be to pay less attention to what others say, to focus on the inner voice, the yearning to tell stories that no one else is telling, and to ignore the doubters as much as possible. Please the only reader that matters: yourself.\nDo you feel like you are where you have always wanted to be in your writing career? Do you have career goals, hopes, and dreams? In other words, what is the next level for you?\nI said earlier that The Dandelion Dynasty feels like the purest expression of my aesthetic vision to date, which means that I still want to go on and get even purer. I believe my next book and next story will be even closer to the ideal, and I will be able to care about external validation even less.\nBut as much as I want to be able to focus solely on execution, I’ve found it so encouraging and helpful to hear from readers all around the world who felt their souls stirred by my visions. My fiction has taken me around the world, and I’ve heard from readers in person as well as through the ether, across languages, cultures, borders, divisions visible and invisible. I cherish these messages so much. As I mentioned earlier, every time I experience one of these moments when the author’s and the reader’s souls vibrate in sympathy, when consciousnesses touch and share a moment of intersubjectivity mediated by the text, it feels like a miracle. I feel so blessed to have experienced many such moments. Of all my measurable accomplishments, these messages from the reader, when they saw what I saw, heard what I heard, felt what I felt . . . these are the moments when I am most joyous as an author because they affirm for me the beauty of our species and our potential for infinite empathy.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/liu_interview_2020/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Faith in Vision: A Conversation with Ken Liu by Arley Sorg"}