{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tomas Petrasek", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "OxH5k60ODLooj2kjuJ7hRb9sTPQ=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Carbon Planets  Imagine standing on a beach of diamonds. You can see the crystals glittering against the backdrop of a black, sticky goo. The waves washing ashore are oily, pitch-black, coming across a sea of tar, without a single drop of water. A scorching desert of sootlike dust stretches inland, toward the horizon where it meets the unfriendly sky that is filled with poisonous smog. No chance of seeing such a scenery in our own solar system—but such worlds, known as carbon planets, may actually be common around other stars.  In the beginning, there was hydrogen and helium. All the other elements came to being in the nuclear furnaces of stars, and were later disseminated through the universe by stars shedding their envelopes or exploding as supernovae. Only then could rocky planets, and eventually also living beings, be formed. But although the elements themselves are the same everywhere we look, we have to bear in mind that every star-forming nebula has inherited from the earlier stellar generations a slightly different mix. The planetary systems may therefore be quite diverse in their composition.  Eighteen years ago, American geologist Eric Gaidos came to the conclusion that many stellar systems might have formed from carbon-rich material. It is no wonder, as carbon is actually the fourth most abundant element in the universe. Of course, carbon is all well and good, as we are carbon-based lifeforms ourselves, but sometimes you can just have too much of a good thing. Carbon-rich systems can spawn solid planets, but ones completely unlike our Earth, and most likely incompatible with life as we know it.  The character of a planet is decided in a fierce duel of two elements: carbon and oxygen. Only one can survive, and make it into the rocks. Carbon binds oxygen to form carbon monoxide, which is a gas, and does not participate in formation of rocky planets. Only if there is excess of either carbon or oxygen, it may react with other elements and form solid particles that eventually give rise to planets. In our solar system carbon was outnumbered almost two to one, and didn’t stand a chance. Remaining oxygen reacted with hydrogen to form water, and with silicon and various metals to form rock. The Earth is actually an “oxygen planet,” as oxygen makes almost a third of its mass.  But this is not the case everywhere. If carbon was the dominant atom, little water would have formed—so no icy moons, and perhaps no icy cores to provide the seeds for the formation of gas giants. Planet formation would perhaps be shifted toward the warmer regions of the primordial nebula. Also, no silicates would form—ordinary rock would be actually pretty rare! Instead, carbon would form metal carbides (e.g. SiC or TiC), various organic molecules, ranging from methane to tar, and perhaps even pure graphite. Even if the protoplanetary disc was only slightly richer in carbon than the proto-solar nebula, carbon planets could be formed in the inner regions, with more familiar-looking planets in the colder quarters.  Recent surveys suggest that carbon-rich systems are actually a minority, so Earth with its preponderance of oxygen is not an exception. But carbon planets most probably do exist. They might have been born in the early universe, when other elements were still rare, from the ashes of Type II supernovae. They may also abound in exotic systems surrounding brown dwarfs or stellar remnants, such as pulsars or white dwarfs, or from the debris of a destroyed white dwarf. Also, different parts of the galaxy differ in elemental abundance, with the center being especially rich in carbon. Even in sunlike protoplanetary discs, a localized enrichment in carbon may arise. Carbonaceous chondrites are bodies that formed in the early solar system alongside the Earth, but contain up to 6% of carbon. In some cases, entire carbon planets might form that way.  Carbon planets must be exotic not only in their chemistry, but also in their geology, evolution, and overall appearance. Above a core of carbon-rich iron, there would be a mantle of carbides surrounded by a diamond layer, while the outer crust would be predominantly graphite. Carbon compounds are physically strong and difficult to melt. You would need a lot of energy to get any decent geology, such as plate tectonics or volcanism, out of them. To make things even worse, diamond is a good conductor of heat, making such a planet lose its inner heat more quickly. Geology on a carbon planet would be therefore be rather short-lived. This is not exactly encouraging from an astrobiological point of view, as the existence of Earth’s biosphere is intimately linked with plate tectonics and volcanism.  The surface of such a planet would be a gloomy place, dominated by graphite, tar-like organics, with diamond and carbide outcrops. As astrophysicist Nikku Madhusudhan put it, on such rocky planets sand could be rare and diamonds would be plentiful. Atmosphere, if present, would be most probably rich in carbon, too, with carbon monoxide or methane, perhaps also nitrogen, and veiled by layers of organic smog, of the kind we can see on Saturn’s moon, Titan. Carbon dioxide would be absent, as it is too oxidized to be stable in the carbon-rich environment. Free oxygen would be absolutely unthinkable in such an environment, of course. There could be a plethora of solid, viscous, or liquid hydrocarbons and other organic molecules, perhaps with tar-like lakes and oceans. A gloomy world of dark and reddish hues, with a sky full of poisons—at least from the point of view of a human. But what if, in the rich organic goo, some native lifeform emerged?  Life is not just organics, though. It also needs a suitable solvent, such as water. But where to get water? It would be rare in a carbon system, restricted to the distant periphery, and hardly any would be transported to the inner planets. And even in that case, water would most probably react with the ubiquitous carbon to form carbon monoxide and methane. So, any eventual life would have to be formed in a nonaqueous solvent.  Liquid hydrocarbons are one option. We know them from Titan, where seas of liquid methane and ethane were found by the Cassini probe. On warmer planets, those would turn to gases, but heavier hydrocarbons could take their place. Hydrocarbons, unlike water, are nonpolar solvents. Earthly biomolecules wouldn’t work, and most of them wouldn’t even dissolve, in such a liquid. It would take an exotic biochemistry, perhaps with nitriles replacing lipids and polyethers substituting for nucleic acids, to enable life in such an environment. Many other possible solvents have been proposed as a basis of alien life, most of them, however, incompatible with oxygen- or water -rich environments. But that’s no problem on a carbon planet.  Consider formamide. It is a perfect solvent even for some Earth biomolecules, enabling and facilitating prebiotic synthesis, and it is stable across a wider temperature range than water. Methanol would be another option. Both are polar molecules, behaving more like water, therefore perhaps better suited for alien biochemistry. So far, such life-as-we-don’t-know-it employing a nonaqueous solvent is just a theoretical concept, and no one knows whether it would work in practice. Proving or disproving the possibility of exotic life seems next to impossible in the foreseeable future, but scientists are already doing their best to come up with some plausible ideas as to how it could form and function.  Have we already found some carbon planets? Probably yes, but until we can measure their composition, it is hard to be sure. Some of the prime suspects are 55 Cancri e and WASP-12b. Both are very hot, hellish worlds larger than Earth. Maybe it is not a coincidence, as carbon planets should form preferentially on warmer orbits, and due to the heat-resistant nature of carbides and diamonds, may survive even in places that would evaporate a rocky world. A white dwarf known as WD 0421+162, a remnant of a dead star, was seen to be polluted by infalling debris of a destroyed planetary system and this debris seems to be rich in carbon, providing evidence that at least one carbon planet had once orbited this star.  Carbon planets are doubtlessly among the most exotic places of the universe. We don’t know how common they are, but their existence seems almost certain. They would be inimical to Earth life, but would provide ideal abodes for aliens of the more exotic kind, if we are inclined to believe in them.", "text": "Non-Fiction\nCarbon Planets\nImagine standing on a beach of diamonds. You can see the crystals glittering against the backdrop of a black, sticky goo. The waves washing ashore are oily, pitch-black, coming across a sea of tar, without a single drop of water. A scorching desert of sootlike dust stretches inland, toward the horizon where it meets the unfriendly sky that is filled with poisonous smog. No chance of seeing such a scenery in our own solar system—but such worlds, known as carbon planets, may actually be common around other stars.\nIn the beginning, there was hydrogen and helium. All the other elements came to being in the nuclear furnaces of stars, and were later disseminated through the universe by stars shedding their envelopes or exploding as supernovae. Only then could rocky planets, and eventually also living beings, be formed. But although the elements themselves are the same everywhere we look, we have to bear in mind that every star-forming nebula has inherited from the earlier stellar generations a slightly different mix. The planetary systems may therefore be quite diverse in their composition.\nEighteen years ago, American geologist Eric Gaidos came to the conclusion that many stellar systems might have formed from carbon-rich material. It is no wonder, as carbon is actually the fourth most abundant element in the universe. Of course, carbon is all well and good, as we are carbon-based lifeforms ourselves, but sometimes you can just have too much of a good thing. Carbon-rich systems can spawn solid planets, but ones completely unlike our Earth, and most likely incompatible with life as we know it.\nThe character of a planet is decided in a fierce duel of two elements: carbon and oxygen. Only one can survive, and make it into the rocks. Carbon binds oxygen to form carbon monoxide, which is a gas, and does not participate in formation of rocky planets. Only if there is excess of either carbon or oxygen, it may react with other elements and form solid particles that eventually give rise to planets. In our solar system carbon was outnumbered almost two to one, and didn’t stand a chance. Remaining oxygen reacted with hydrogen to form water, and with silicon and various metals to form rock. The Earth is actually an “oxygen planet,” as oxygen makes almost a third of its mass.\nBut this is not the case everywhere. If carbon was the dominant atom, little water would have formed—so no icy moons, and perhaps no icy cores to provide the seeds for the formation of gas giants. Planet formation would perhaps be shifted toward the warmer regions of the primordial nebula. Also, no silicates would form—ordinary rock would be actually pretty rare! Instead, carbon would form metal carbides (e.g. SiC or TiC), various organic molecules, ranging from methane to tar, and perhaps even pure graphite. Even if the protoplanetary disc was only slightly richer in carbon than the proto-solar nebula, carbon planets could be formed in the inner regions, with more familiar-looking planets in the colder quarters.\nRecent surveys suggest that carbon-rich systems are actually a minority, so Earth with its preponderance of oxygen is not an exception. But carbon planets most probably do exist. They might have been born in the early universe, when other elements were still rare, from the ashes of Type II supernovae. They may also abound in exotic systems surrounding brown dwarfs or stellar remnants, such as pulsars or white dwarfs, or from the debris of a destroyed white dwarf. Also, different parts of the galaxy differ in elemental abundance, with the center being especially rich in carbon. Even in sunlike protoplanetary discs, a localized enrichment in carbon may arise. Carbonaceous chondrites are bodies that formed in the early solar system alongside the Earth, but contain up to 6% of carbon. In some cases, entire carbon planets might form that way.\nCarbon planets must be exotic not only in their chemistry, but also in their geology, evolution, and overall appearance. Above a core of carbon-rich iron, there would be a mantle of carbides surrounded by a diamond layer, while the outer crust would be predominantly graphite. Carbon compounds are physically strong and difficult to melt. You would need a lot of energy to get any decent geology, such as plate tectonics or volcanism, out of them. To make things even worse, diamond is a good conductor of heat, making such a planet lose its inner heat more quickly. Geology on a carbon planet would be therefore be rather short-lived. This is not exactly encouraging from an astrobiological point of view, as the existence of Earth’s biosphere is intimately linked with plate tectonics and volcanism.\nThe surface of such a planet would be a gloomy place, dominated by graphite, tar-like organics, with diamond and carbide outcrops. As astrophysicist Nikku Madhusudhan put it, on such rocky planets sand could be rare and diamonds would be plentiful. Atmosphere, if present, would be most probably rich in carbon, too, with carbon monoxide or methane, perhaps also nitrogen, and veiled by layers of organic smog, of the kind we can see on Saturn’s moon, Titan. Carbon dioxide would be absent, as it is too oxidized to be stable in the carbon-rich environment. Free oxygen would be absolutely unthinkable in such an environment, of course. There could be a plethora of solid, viscous, or liquid hydrocarbons and other organic molecules, perhaps with tar-like lakes and oceans. A gloomy world of dark and reddish hues, with a sky full of poisons—at least from the point of view of a human. But what if, in the rich organic goo, some native lifeform emerged?\nLife is not just organics, though. It also needs a suitable solvent, such as water. But where to get water? It would be rare in a carbon system, restricted to the distant periphery, and hardly any would be transported to the inner planets. And even in that case, water would most probably react with the ubiquitous carbon to form carbon monoxide and methane. So, any eventual life would have to be formed in a nonaqueous solvent.\nLiquid hydrocarbons are one option. We know them from Titan, where seas of liquid methane and ethane were found by the Cassini probe. On warmer planets, those would turn to gases, but heavier hydrocarbons could take their place. Hydrocarbons, unlike water, are nonpolar solvents. Earthly biomolecules wouldn’t work, and most of them wouldn’t even dissolve, in such a liquid. It would take an exotic biochemistry, perhaps with nitriles replacing lipids and polyethers substituting for nucleic acids, to enable life in such an environment. Many other possible solvents have been proposed as a basis of alien life, most of them, however, incompatible with oxygen- or water -rich environments. But that’s no problem on a carbon planet.\nConsider formamide. It is a perfect solvent even for some Earth biomolecules, enabling and facilitating prebiotic synthesis, and it is stable across a wider temperature range than water. Methanol would be another option. Both are polar molecules, behaving more like water, therefore perhaps better suited for alien biochemistry. So far, such life-as-we-don’t-know-it employing a nonaqueous solvent is just a theoretical concept, and no one knows whether it would work in practice. Proving or disproving the possibility of exotic life seems next to impossible in the foreseeable future, but scientists are already doing their best to come up with some plausible ideas as to how it could form and function.\nHave we already found some carbon planets? Probably yes, but until we can measure their composition, it is hard to be sure. Some of the prime suspects are 55 Cancri e and WASP-12b. Both are very hot, hellish worlds larger than Earth. Maybe it is not a coincidence, as carbon planets should form preferentially on warmer orbits, and due to the heat-resistant nature of carbides and diamonds, may survive even in places that would evaporate a rocky world. A white dwarf known as WD 0421+162, a remnant of a dead star, was seen to be polluted by infalling debris of a destroyed planetary system and this debris seems to be rich in carbon, providing evidence that at least one carbon planet had once orbited this star.\nCarbon planets are doubtlessly among the most exotic places of the universe. We don’t know how common they are, but their existence seems almost certain. They would be inimical to Earth life, but would provide ideal abodes for aliens of the more exotic kind, if we are inclined to believe in them.", "source": "https://clarkesworldmagazine.com/petrasek_08_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Carbon Planets by Tomas Petrasek"}