{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "M L Clark", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "K8y1nzsaYQQglYRLZPOYnprz1SM=", "id": null, "license": null, "comments": "", "raw_text": "12930 words, novelette  Love Unflinching, at Low- to Zero-G  1  Doc tried to keep a straight face until the other human had left the examination room to complete annual license renewals. Zeddi Bobeddi, her wagging tail threatening to helicopter her off the low-G table from familiarity with these routine checkups—the treat! the impending treat!—was not making this easy.  “Okay,” said Doc, once the coast was clear, and while presenting the succulent spoonful that would distract Zeddi from her booster. “What’s mama done to you this time?”  The mods along Zeddi’s ears and snout were not permanent, but they could do permanent damage if the wrong person saw them. Long arcs of digital metallic-green wrapped Zeddi’s head in the semblance of another species entirely—and not just any species, but the Hurv: a dour administrative people, from what humanity had seen of them, who were heavily engaged in negotiations with Earth diplomats elsewhere on Aleph Station. But why this look, and why now? A party trick carried over from New Year’s? Or something more intentional?  “Oh, your mama really loves to poke the bear, doesn’t she?”  Doc patted and scratched Zeddi all over while the fine-haired basenji licked at the prize between her paws. Doc moved so swiftly that the good girl hardly noticed when her scruff was held tight, and the bone-density shot slipped in between rubs. Done and done.  As for the alien costuming . . .  Doc looked Zeddi square in those large, trusting, liquid-brown eyes.  “All right, girl. This is going to look like it hurts, but I promise, it won’t.”  When Ms. Tina Wilson of Dock Maintenance returned, Doc made it a point to be busy storing the rest of the shots, to let her notice on her own. Ms. Wilson’s panic was genuine.  “Zeddi-bear! What’s happened to your ears? Doc! Is she infected?”  Doc feigned surprise while turning back to inspect the angry red rashes that had arisen around the interfaces projecting Hurvian features from the unwitting canine head.  “I was afraid of that.” Doc whistled gravely. “You know, you can’t be too careful with this tech. Manufacturers think that, because the implants are for nonhuman use, they can get around all the usual safety checks. And what’s worse is that they’re usually right. Don’t get me wrong, some of the projections are adorable, but at what cost?”  Ms. Wilson’s eyes welled up. As she shook her head, a few droplets added to the work of the zoomers: tiny bots styled after diving beetles, who helped with station filtration by clearing away detritus, like the sort cast off by Doc’s four-legged, no-legged, two-clawed, and tentacled patients, prone to drifting about in low-G. The aim was always to catch as many of those stray hairs, husks, gobs of impressively smelly saliva, scabs, stitches, urine sprays, bits of fecal matter and upchuck, feathers, scales, skins, arboretum burrs, and dirt-clods before they slipped into station-wall crevices and circuitry where they had no right to be.  “Can you take them off? Can you fix her? Oh, my poor baby . . . ”  “Of course,” said Doc, heavily, before making a show of trying to remember where the detachment tool had been stowed in the examination room—as if its charge hadn’t been checked mere seconds before Ms. Wilson’s return.  Jude in reception had The Look when he was asked to add a zero-cost placebo to Ms. Wilson’s account, not long after Doc had finished the procedure to remove Zeddi’s implants and restore her natural, nondiplomatic-nightmare of a brown-and-white complexion. Both knew the “rash” would clear up on its own—its binding agent a nontoxic adhesive that Jude used onstage after business hours—but a week-long prescription for “mama” to administer twice-daily would hopefully make the lesson stick.  “I know, I know,” Doc winked, while scratching behind the pricked ear of the clinic’s gray-haired guardian, Skeeter. “I should’ve offered Ms. Wilson a spoonful, too.”  2  It wasn’t that Jude disapproved, exactly, but the young man was still in a place of exasperated affront that trickery was necessary; that human beings continued to be so . . . so . . .  “Human?” Doc prompted, over dinner in staff commons around the Core.  “Exactly.” Jude jabbed with his fork for emphasis. “It’s like, first contact happens—yeah? And there’s this great big hush over all the lands—for like, a split-second, right? But then comes the media spin cycle. The hot take. The alien overlord meme. The latest fashion trends. It never ends. It’s all just more fodder, more material, more excuses.”  “You were expecting, what, that we’d all ascend into a higher realm, hovering in perpetually unified grace over the cosmic miracle of first contact with other advanced species?”  Jude’s long purple bangs swung from side to side. “Uh, yeah? Kind of.”  Doc watched him fall to eating as if he had gone many days without a proper meal. Jude would have been about six when the Aleph Station project launched, a beacon of hope amid a hundred military uncertainties about all the new forms of life on the edges of human discovery. The perfect age for a kid to be thrilled by the promises of a coming utopia: a deep-space diplomatic paradise where alien species could meet and work together for the betterment of all. A haven and a respite, at bare minimum, from a range of tediously abiding injustices back on Earth, many of which Jude had worked hard to escape by training for deep-space life.  Instead, at first, Aleph had brought the Hurv out of hiding—or at least, their itinerate higher-tech bureaucrats: a group only interested in the younger species when safety regulations established eons ago were at risk of contravention by some careless newcomer who had failed to read “the signs” posted in particle-probability patterns all throughout the vacuum of local space. Even worse, the Hurv’s extensive regulations, once reviewed by human experts, proved disappointingly sensible: best-practices for energy production, waste disposal, trade-route plotting, information-sharing, materials maintenance, and disease-transfer risk-reduction that stood to benefit any species who complied as they ventured further out. There wasn’t so much as a line in the whole bloody ordinance that Earthers could sincerely claim as oppressive or an undue burden, at least not in the long or even medium run among the stars.  And yet, it was the way the Hurv had chosen to administer all their perfect little rules, after the first ship broke one in error: with all the irritation, that is, of one adult repulsed to learn that another doesn’t already know how to wash their hands—and then not only teaching them this basic skill by making a grand, severe, and highly public spectacle of the lesson, but also going over every other “basic” skill they could think of in the same degrading manner, under the pretense that they could no longer trust the other adult to know these ones, either.  Might as well have whacked humanity on the nose, Doc had thought at the time. At least it would have been over quicker.  Instead, it had taken another ten years to get Aleph Station up to Hurvian code, before those ancient administrators would withdraw the interstellar equivalent of a “New Driver” sticker from Earth and its colonies, so that diplomatic relations could begin anew between humanity and the rest of the sector’s citizen-species. Was it any wonder, then, that some humans saw no problem getting their kicks in against the Hurv when they could?  “Well . . . ” Doc offered, when Jude had paused long enough between bites to take a proper breath. “At least there’s still The Congress of Familiars to look forward to, right?”  Jude snorted, but also couldn’t help but be somewhat amused and placated by Doc’s reference to a children’s classic that had become wildly popular after first contact, in which aliens arrived and immediately started quarreling with humanity, until animal companions on all sides got fed up with their respective “higher” species and wandered off to form their own, far more harmonious republic in the stars.  Doc would never say as much aloud, but Jude was also the right age to have been someone who went into related fields—veterinary studies, animal husbandry, animal rights activism, xenobiology, nonhuman animal ethnology—because of the wonderful adventures of that movie’s protagonist. The interspecies theater troupe that Jude ran in his spare time only completed the circle of art informing life informing art in the young man’s journey.  A wounded idealism, thought Doc. But definitely not gone.  Jude set a reader by Doc’s tray after they’d both finished their meals—or rather, after Jude had finished Doc’s untouched second half, while Doc prolonged the last of a tea packet. Doc’s waning appetite had long become accepted fact between them, as was Jude’s insatiable need for fuel to match his youthful burning of the day’s candle at both ends.  “What’s this?”  “Next intake manifest.”  Doc raised a brow. “Look on your face says that something coming in will be trouble.”  “Not quite.” Jude tapped the reader, wiped his mouth, and velcroed a tab on his napkin to the tray before pushing off. “It’s what’s not coming in that bothers me. Night, Doc.”  Doc nodded back, then skimmed through the manifest, pausing only to thank the server who drifted by for their trays. It took a while to catch on to Jude’s concern: the answer wasn’t in the medical resource list, or among nutritional supplements and seasonal accessories.  “Sonuva—”  Doc looked up when it clicked, but Jude had long since left for rehearsal, and in low-G Doc couldn’t even let the reader drop with a spectacular clatter to the deck. A good long sigh and a ping to the station’s captain, to see if she had time to meet, would have to be enough.  3  Cap paced in mag-boots while reviewing the manifest. Doc had caught her in the middle of resistance training (never one to trust the booster shots to do their work alone), and a zoomer was air-skipping furiously after, to catch any perspiration wicking from bare skin as she moved. Cap preferred clean quarters and a cleaner office, so the closest she had to an animal or plant companion was a chunk of Martian rock on the corner of her desk (which she called “Spot” to drive the point home), and the zoomers she kept close by as often as possible, under the principle that an untidy mind begins with an untidy atmospheric perimeter. Doc and Cap were good friends despite both obvious moral defects on the latter’s part.  “I don’t get it,” she said at last. “I thought you’d be pleased that we have fewer Murrs coming through. If I recall, you tried to deny every last adoption request two years back.”  “I did, and you overruled me on the lot. Despite how much of a burden they are on filtration systems, I might add.”  Cap hummed agreement, but with a grimace. “You pick your battles out here, Doc. A few new alien pets being adopted by humans wasn’t it. In fact, all the eagerness among Earthers to keep Murrs of their own even helped in talks with the Usmics of the southern continent. They convinced their western and northern allies of the economic value of building more trade infrastructure on the back of that trend, instead of escalating their military presence along our species’ borders. That’s also how we got the Beam, even if they do still keep plenty of its secrets under lock and key.”  Doc let slide Cap’s use of the word “pets,” for now: outmoded lingo, but not as easy to eliminate as contaminants from the station air.  “And anyway, even if the trade deal hadn’t worked out,” Cap added, “if there are no new requests for Murr transfers, what’s the problem? It’s a trend that sorted itself out, right? I would think you’d be pleased, not looking at me like there’s a vivisectionist on the loose.”  Doc kissed teeth and glanced at the long, transparent observation wall in Cap’s office, which overlooked a command deck filled with immaculately uniformed officers going about station-ops business. Their whole realm was an affectation of order and efficiency that humanity never tired of performing, even when it fell far short of the mark behind the scenes.  “I ever you tell you about my cousin Mel?”  “Mel? Yeah, I think so. Gym rat who shipped through here last year, on his way to some extreme endurance run on Severin Six?”  “Qualifier race. Didn’t make it. Busted a knee in the high-G.”  Cap winced. “Lucky it wasn’t more.”  “Agreed. But he was still holed up awhile on the orbital transfer station, in recovery, and someone got the bright idea that he needed company to survive the slump, after going all that way out and ending up with nothing to show for it.”  “That is a bright idea, I’d say.”  “Well, okay, I guess it could’ve been. But this ‘someone’ decided to gift him a kitten, because it was small, and because they figured cats didn’t need much to do well. Not like a dog that needs to be walked everywhere, right?”  “I see where this is going. Kitten was a nightmare, huh?”  “Kitten was a kitten. It’s just that, when the novelty wears off, plenty realize they aren’t up for the commitment. Major regret syndrome. Tons of gifted cats, dogs, rabbits, birds, and reptiles are still returned to shelters back on Earth. Or worse, abandoned to the streets.”  “But Mel wasn’t back on Earth.”  “Nope. And just as he was getting fed up with the kitten, he also decided to rent a stasis-pod and wait out the rest of his recovery in transit.”  Cap tensed. “Hold up, Doc. Am I gonna like where this story ends?”  “Not one bit. So, we’ll just leave it there.”  Cap glanced again at the manifest, brows creasing as she pieced together the relevant diplomatic facts. “But . . . Murrs come from the Usmics, and the Usmics . . . Oh. Oh.”  Doc nodded. “When Earth-Usm negotiations dominated in the stream, Murrs were as high-prestige as they are high-maintenance. Once the prestige goes away . . . ”  “But so quickly? Just like that?”  “Maybe something spurred it. Maybe not. Trend cycles are mysterious.”  “Eh, sometimes. But we’re talking a high-profile interspecies alliance and a fairly recent and lucrative trade deal. Surely any humans with Murrs on board have to know how the Usmics feel about what other people do with species from their world?”  “Humans ‘surely’ know a lot of things.” Doc shrugged. “But we’re even better at using all that supposed wisdom to rationalize our preexisting preferences.”  Cap pursed her lips, considering. “How many Murrs do we have on board? And how many do you think are at risk of abandonment or . . . ?”  Doc raised a hand against the unspoken. “Forty-six, across thirty-one residential units. But that’s the trick, isn’t it? If I start a public campaign against abandonment, or worse, I might be putting ideas into the heads of people who hadn’t fully realized this was an option. Plus, what if an Usmic sees the campaign and assumes the worse is already happening to their sacred ones? Then we’re running even faster into a public-relations nightmare. No, we’ve got to be careful. There’s still time. Just not much, if new demand’s dropped to zero overnight.”  Cap shook her head. “This all strikes me as odd, Doc. Humans are fickle, sure, but we usually drop something shiny when something shinier comes along. So, what’s come along?”  Doc nodded. “Wondering the same. Wondering, too, if knowing what changed will maybe offer us a solution. I’m going to look into it, and keep you posted.”  “Ditto—on the diplomat side, mainly, but I’ll let you know if maintenance crews come across anything, too. You really think this could go nuclear?”  “Anyone’s guess. We’ll just have to hope for the best. Or at least a good exit strategy.”  “Ha.” Aleph’s captain stopped up short in her pacing, causing the zoomer on her tail to zip frantically aside. “Now there’s that trademark optimism I was missing from you.”  “Very funny.” Doc moved to shake hands. “Just don’t tell my assistant. He already thinks I’ve grown soft as it is.”  “Oh yeah.” Cap answered with a matching, solid grip: an echo in it, for them both, of a tougher time in station service. “That’ll be the day.”  Outside Cap’s office, before heading back to med-sector, Doc paused to survey the long arc of Ring that this part of the command deck overlooked: an ever-changing half-klick of commercial zoning, leisure spaces, and visitor services, all rolling gently around the station’s midsection to sustain a hefty point seven-G. “Up,” to anyone inside it, was a transparent ceiling peering straight into the Core: a squat, gray, low- to zero-G research, service, and utilities space where interspecies scientists, diplomats, and military collaborated in publicly funded facilities. Decades out from the physics classes necessary for space-vet accreditation, it still staggered Doc to imagine how, when walking along that rotating Ring, anyone would reasonably think they were being “pulled” to the deck by a “Down” force that did not exist.  And yet, this business with the Murrs was another sort of centrifugal illusion: of that, Doc had no doubt. The “pull” of the problem felt real enough—for Jude, for Doc, and now for Cap, too—but all the humans paying attention were still in the wrong frame of reference to make out any of the real powers behind it.  For now, at least. For now.  Doc’s wrist-wear pinged an emergency in the docks: another “pull,” but this time more urgent, and clear. Tapping an icon for “on-my-way,” Doc pushed off for the docks. Some days, one simply had to hope that constant forward momentum would be enough to counter the whole mess of forces—real, and imaginary—ever thrown a given body’s way.  4  Frightened whinnying could be heard all down the corridor between Holding Green to Loading 3, and Doc—go bag slung over a shoulder, moving hand over hand along service-route guide rails, picking up more speed than was generally advisable—hastened to arrive before the disaster deepened. Klaxons had been switched off to reduce panic, but emergency lights still pulsed in the dark, and when Doc emerged into the sweeping round of the station’s largest loading zone, first impressions were almost incomprehensible: lightning-livid red flashes tracing the sinuous twist of powerful musculature pumping uselessly in zero-G; similar warning glows flickering wildly in the wide, glossy-black eyes of four horses floating helplessly in a realm of neither “Up” nor “Down.” Nor were they alone in that tumultuous bow-side nether-space: intact crates, scattered riding gear, and stall-partition materials tumbled at varying speeds all around them, knocking into the walls as much as into each other, before spinning out along freshly erratic trajectories. The team’s handler, who had been knocked unconscious in the initial power-surge that had deactivated the pallet lock and sent everyone flying, also drifted in and out of range of those sixteen frantically kicking hooves.  “Hey! Doc!” Loading 3’s foreman called from the other service entrance. “We’re ready to crank it to point three-G if you want! Get ’em landed, calm ’em down—sound good?”  Doc needed a beat to recognize the man across the dim and red-washed lighting: Luis Rodriguez, one of the station’s “gentle giants,” and the proud owner of a tarantula he called Fea, “Ugly,” with the greatest of affection. Good: not the sort to panic. But Doc’s own heart rate quickened while surveying what “Down” conditions would look like in Loading 3: a narrow, rounded laneway with little room for four horses to work out their understandably ongoing agitation after touch down. There was a good chance that they would run into one another while adjusting to the strange fractional gravity, or trip into bulkheads and fallen crates and luggage, then either break their legs or trample their handler in the process—or both.  “Negative. We have to sedate and take our chances. But not with all this junk. Do you have anything you can use to clear some of the boxes—Oh! And of course . . . the handler?”  A thumbs-up in answer: “Mag-hook’s on the way! My people are getting supplies.”  Sure enough, two of Rodriguez’s workers soon emerged from the far passageway: one with a makeshift snare pole from the emergency panel between Loadings 2 and 3; the other holding a drone equipped with a large magnetic claw. While the pair enacted catch-and-secure protocols with everything around the horses, the foreman doubled back for a spine board, and Doc mag-locked on the opposite landing to load the dart gun. The clinic’s standard ketamine-xylazine cocktail usually had a longer induction time in zero-G, due to decreased cardiac output and a general propensity for blood to linger in the limbs, but with any luck, all that frantic galloping in one spot would offset this delay and bring the four to rest before they could do further damage to themselves and each other.  Emphasis on “further,” thought Doc, while studying the team’s movements after three clean hits to the shoulders and one suboptimal dart to a flank. Colic was highly probable for all of them after such a nauseating trauma, the likes of which none of their species could be expected to understand in full, but the most severe variant, colic from shifted bowels, was an especially key consideration as they bucked and twisted about in zero-G. As for the handler . . .  Well, on the plus side, long before all four horses had conked out, Rodriguez’s team had the handler cleared from the danger zone, her surface wounds treated, and head and torso carefully secured for immediate transport to citizen-care. Doc couldn’t remember her name, but also couldn’t forget the kindness and expertise with which she had tended to the male colt and three mares after docking, when Doc had come by to oversee their initial revival. Doc had more than mixed feelings about the industry this woman served—shipping show-ponies and racehorses to affluent settlers on far-flung colonies, or for direct trade with alien species that also loved to gamble with other animals’ lives—but it was hard to see any better justice in the death of someone who had at least tried to keep these creatures as healthy and happy as possible on route to their terrifying new forever-homes.  Besides, as the long lashes of the first two horses at last started to flutter shut in the emergency lighting, and as their legs pumped less furiously from side to side of Loading 3, Doc felt a twinge of new fear growing for the whole team. If the handler didn’t wake up, or if the horses’ impending bouts of colic didn’t respond easily to treatment, would their owners even pay to send another handler to finish the journey? And for all the upkeep in the interim?  Doc didn’t mind taking a hit on clinic expenses—there were always ways to finesse station donors for cases like these—but the possibility of the legal owners sending along other instructions entirely gave Doc a pretty colicky feeling, too.  On the strength of that weakening gut, Doc pinged Jude to clear the rest of the day’s schedule, just in case everything would depend on the first few hours going well.  “Sure thing,” said Jude, after a minute. “There’s only one meeting I can’t cancel.”  And when he flashed Doc a file bearing an Usmic name, Doc agreed.  “Right, of course. I guess I’ll take care of it between surgeries, if it comes to that.”  “Surgeries plural? That bad?”  Doc hesitated. The last of the horses was falling slack now, and with the handler off to citizen-care, Rodriguez and his crew stood at the ready to prep this lot for transfer, too. Doc couldn’t tell which had been more unnerving—to see the four pumping and whinnying at full intensity, or this spectacle of slumped silhouettes, drifting together in the flickering dark.  “We’ll see,” said Doc, eventually. Even on Earth, their species often proved as delicate as it was powerful—but one could doubtless say the same about them all.  5  As soon as the horses were secured in-lab and prepped for diagnostic tests that Jude could run on his own, Doc left for the arboretum, tossing Jude a salute at the door that the young man did not seem to notice, bent to his heavy workload so he could still get out in time. Doc tried not to let the lack of response dampen an already fraught mood, but it wasn’t easy. The day had been long and stressful, citizen-care still had no word on the handler’s condition, and this was a poor time of day to be meeting with anyone in the station’s nature preserve on the Ring, because most residents took their companions for walks at this hour among the foliage—and not all of those companions played well with each other when they met.  Some might even say that the Usmic was tempting fate, or itching for a fight, by bringing their Murr to the arboretum at this hour every day, but Doc was inclined to chalk up the choice more to guileless overconfidence on the part of this single, immense nerve cell that towered—or rather, wobbled—more than half a meter over the humans on board, and had such a substantial deep-space fleet to back its every movement through the sector.  “If we truly have the respect of your peoples,” Esmin of Usm had told Doc once, “then there will be no trouble for our sacred ones among your own, yes?”  Usmics communicated through fluctuations along their outer, mustard-yellow sponginess. Those who had spent even a little time on Aleph Station proved particularly capable at replicating humanity’s text-based languages, so that Chinese, Hindi, Russian, Arabic, Braille, and Roman lettering rose and receded like a palimpsest of ticker tape across whatever section was facing their conversational partner at the time. The one downside to this feat was that Doc—and Cap, and even diplomats expressly trained for Earth-Usm relations—often had a devil of a time getting a lock on any given Usmic’s intended tone.  Still, context suggested that Esmin had been quite serious that day with Doc, because in follow-up questions it became clear that the Usmic could not fathom why any of humanity’s own “sacred ones,” however well- or poorly trained they had been as pups, might sometimes be out of alignment with the wishes and “intentional energies” of their caregivers. So long as the human guardians were righteous in their thoughts, surely none of their furry friends would dare to urinate on a Murr, or mistake it for something to be collected in a game of fetch?  Murr, after all, were commonly described back on Earth as “sentient hemp,” with their Usmic name coming from the sound that their fast-growing branches made during the part of their life cycle that humans most enjoyed. A Murr in its earliest phases was endlessly malleable and eager to please and could be coaxed into growing into the most striking patterns that would then be set for life. For southern-continent Usmics, the act of cultivating a Murr into its healthiest possible formation was a great honor and responsibility—and the stigma for failure, too great to be discussed. For humans, though . . . Suffice it to say, the novelty of such a species had spurred innovation in different, often difficult directions, not least of which included the concocting of wild excuses, if ever an Usmic chanced upon an older Murr in human care and asked why it looked so unlike those raised according to southern-Usm traditions.  Fortunately, so far the Usmics had accepted every half-assed explanation given.  But how could a prematurely dead or abandoned “sacred one” be explained away, if an Usmic diplomat asked for a report on how its kindred species was doing in human hands?  “Thank you for your time, Esmin. And, ah—?”  Esmin’s spongy mass displayed a southern-continent Usmic icon, two overlapping circles with a dot over and below the intersection, for the name of the young Murr that stirred contentedly on the grass beside them. This “sacred one” had a rustling crown of bright-leafed branches set around a sturdy, soil-brown trunk, and a hefty seat of prehensile roots that it used to move, to feed, and at this moment to flick insects trying to climb its bark. Esmin flashed the English version next: “Barin,” a popular Usmic word for near-but-not-quite dualities, with spiritual allusions that many human vendors translated poorly on Earthside alien merchandise.  “Barin,” said Doc, crouching to nuzzle a root in greeting. “Barin’s looking healthy.”  Esmin’s yellowness deepened with pride. “Fresh foliage this cycle. Gleaming well.”  “Apparently. That’s what I was hoping to discuss with you, actually. Thank you so much for taking the time between trade meetings. I just feel like I don’t have enough information on file to tend to these fellows correctly if they sicken here, now that so many humans have taken an interest in their care.”  “S I C K E N ?”  The word stretched across Esmin’s surface with a wide kerning between letters that the xeno-linguists claimed suggested an Usmic’s incredulity.  “Well,” said Doc, hastily. “I mean—if there are some cycles with fresh foliage, then there must be some cycles with, you know, un-fresh foliage, am I right?”  Esmin considered.  “Sacred ones sicken with the unrighteous. Are the humans now . . . unrighteous?”  Oh boy.  With a baleful look at the now happily “murring” Murr, half its roots thumping gently on the grass, and then back at Esmin, a quivering immensity it was easy to imagine rolling right over a human in a fit of ire, Doc tried to remember that this Usmic was no different than any other overprotective fur-, fin-, feather-, or scale-parent who sometimes answered even basic questions about their “babies” aggro-defensively from the other side of the examination table.  This was just a “branch”-parent whose appeasement came with a lot more on the line.  Doc smiled broadly in reply—and wondered, in the process, how well most Usmics could read tone from human speech. “Apologies, Esmin. I misspoke. What I meant is, how do you do it? What’s your secret? Barin’s foliage is quite spectacular, possibly the best I’ve seen on the station, so I knew I had to come to you. Is it diet, exercise, a special grooming regimen?”  Esmin’s yellowness positively glowed. That radiance didn’t make it easy to read the rapid-fire text then pulsing along the Usmic’s surface in answer to this flattery, but Doc knew better than to complain. A win was a win was a win—even if Doc would have to spend a whole lot more time reverse-engineering what could go wrong for the Murrs, from Esmin’s elaborate descriptions of how to make sure that everything, instead, went absolutely right.  But after Esmin and Barin had rolled and rustled on to find their evening sustenance, Doc felt no great compulsion to leap immediately into that work, or even to return to the lab right away, and so the exhausted vet lingered on a nearby bench in the artificial glint of late-afternoon Sol-toned light. “People watching,” ostensibly—and also, to keep a finger on the pulse of things, waiting to see if even a single other Murr would show up in the human throng.  The only other citizen-species in attendance was Hurvian: a pair of the tall reptiles conversing in hushed tones, their iridescent-green hoods peeking out from behind a line of fruit trees. The rest of the visitors were Terran by origin or ancestry: human couples, solos, families with children. Rare was the human without at least one nonhuman companion; rarer still was the one among them whom Doc didn’t know to have something in a terrarium or aquarium back home, or a cat simply disinclined to partake in the public fray. There, to the left, were the nine-year-old twins with Iggy, their contentedly leashed iguana; in the distance, Mort the crow kept the chief composter company (not that he needed it, with his whole menagerie of rescues from the station’s variously departed); and dead-center in the path, Ms. Wilson and Zeddi were interacting with two dozen other humans attending to dogs all their own.  It was hard to imagine, surveying this adoring crowd, that anyone would abandon a dear companion, or else neglect it to the point where death would become an act of mercy. But for all the species’ grand declarations about other animals’ “love unflinching,” as a dusty, old Earth poet had once put it, Doc had seen too much of humanity’s fickle share of the same. Cousin Mel still thought himself a good person, after all—a person who had simply made the only reasonable choice he could in the depths of outer space—and for that matter, the clinic had sent its fair share of edge cases into that “better rest” as well.  Doc waited until the arboretum dimmed to resemble twilight, and most of the evening circus had moved on. The latecomer appeared just as Doc was making to stand, but he entered with a full-grown Murr in tow, toddling on ever-sensing roots across the pungent grasses.  Doc froze as it came closer, under lamplights winking on one by one in the dark.  Oh, thought Doc. Oh, no.  6  Jude shot Doc a puzzled frown upon the latter’s eventual, all-too-quiet return. Even wizened old Skeeter, half-drowsing on the reception desk, looked up with concern when Doc forgot to issue the standard, salutary scratch on his rump while coming past.  “Hey, Doc, your face is as long as our patients’. What’s up? Binky’s memorial service isn’t until tomorrow, you know.”  “Hm? Oh. Right, no—no, this isn’t about that. Although, the security report, did it . . . ?”  The young man shook his head. “Mx. Meru’s been cleared of negligence charges, at least by legal reckoning of these things. Records shows that Binky blocked the air vent himself, by accident with his blanket, and well, it’s not like you can explain to a dog that the CO2 will just pool around it while it sleeps, you know? Even in the clear, though, Mx. Meru’s still beside themself that they let the new boyfriend kick Binky out of the bedroom in the first place. They’d been planning to move out of zero-G months ago, but the price point, you know?”  Doc knew, and sighed. Accidents happened, and there was no point throwing more recrimination into the mix. Mx. Meru would probably never forgive themself, on some level, for their eight-year-old companion’s death—and hopefully, to the benefit of heightened vigilance with whatever critter they adopted next. All the vet’s office could do was provide Binky with a loving send-off . . . and reissue advisory warnings, station-wide, about keeping the air well-circulated in any enclosed zero-G space where living beings slept.  “And the horses?”  “Good news there, Doc. Only one’s all twisted up. Prepping him for surgery now. I gave the other three the nano-cocktail—which should also report back to us soon how severely their biomes have been disrupted. Or not at all, ideally. But I figured I’d hold off on the fourth until post-op, so we don’t mess up its baselines during surgical intervention.”  “The right call. I’ll scrub up, then, and—thanks, Jude.”  Jude squinted through his bangs. “You sure you’re all right?”  Doc considered lying, and then considered that Jude was too smart to fall for it. An actor knew acting when they saw it, didn’t they?  “Not really, no. Saw something troubling at the arboretum, but it’ll have to wait. Oh, and can you schedule Esmin and Barin for a checkup next week? And call the Cap: see if she has time for a debrief tomorrow morning?”  “Will do. Hey—and boss? No worries, eh? We’ve got this.”  Doc nodded, and clapped Jude on the shoulder, but even while scrubbing in to help the colt lying in wait, the image of that second Murr in the arboretum was hard to shake—and with it, the fear that the station’s veterinary clinic really didn’t have a handle on this at all.  It had been years since Doc last performed surgery on a patient of this size, but the exploratory part had already been dealt with through 3D-imaging, which had identified the problem as part of the intestine folding inward, and not any of the more vicious bowel torsions with higher mortality rates. Plus, there was a holo-guide to illustrate optimal maneuvers while manipulating the colt’s insides—or rather, a standardized surgical manual with high-level AI processing, into which Jude had fed specific information about this one horse’s anatomy and biochemistry, so that the system could note any critical variabilities in, say, its vascular systems or connective tissues, and offer work-arounds on the go. All of this made the operation fairly simple, all things considered—and especially compared to the horror stories that Doc’s teachers had once waxed on about, from the early days of deep-space medical care. The blood-pooling in zero-G alone back then . . . But no: now, the only real danger was irritation from the fact of surgery itself, which could lead to a sticky and inflamed outer-intestinal surface susceptible to post-op infection. There, too, though, the subsequent nano-cocktail would hopefully identify any dangerous bacterial formations in time for successful intervention.  If anything, then, Doc’s own innards became the stuff of greater contemplation, while the seasoned station vet gently freed the colt’s tract from itself. Both Jude and Doc’s doctor had noticed Doc’s deteriorating appetite in recent months, and everyone knew that digestive uptake and gastric motility were already negatively impacted in low- to zero-G—but so what? Some days the fight to keep anything alive in these vast and distant tin-can universes verged on absurdity. A case of the “hollows,” some called it—and one of the few ailments that other Terran species didn’t seem to share with humans in deep space. Lucky sods. But if the body was tired, Doc reasoned, let it be tired. Let it diffuse itself until it was as empty as the vacuum between star-stuff. Let Jude’s generation, and the next, try to keep meaning intact for them all.  With a monitoring system on the lookout for trapped fluids, surgery was made even easier by the low-G environment, which gave Doc plenty of leisure to part and manipulate key components before tucking everything back inside and closing up. In a few years, there would probably be a nano-fix for this sort of colic, too—or maybe gene therapy that could build a better upper-body wall and sturdier intestinal structures in the first place. The latter depended, though, on whether any of this would serve the owners; if these horses had a better chance of avoiding intestinal and colonic impaction, but only at cost to their agility in sport . . .  The image of the second Murr in the arboretum came to mind again: an image that Doc was still trying to process before putting it into words for the rest. For now, at least, its sheer existence seemed proof-positive that, with humans, it was always a matter of when, not if, they intervened; and almost always for self-interest. Even when selecting which other species they wanted to protect from human harm, the choice to care about one animal-outcome over countless others was itself a form of violence—however inevitable such violence might be, whenever dealing with individual consciousnesses struggling to do the best that they could.  “Doc? Doc? You okay in there?”  Doc heard Jude vaguely through the comms and blinked to attention in time to watch the auto-suture tool finish its work upon the operating table, and another station arm clean around the wound, and four station zoomers skip about to clear the air. Doc came up alongside the colt and swept its mane aside to study the long line of its neck. Blood pumped steadily, if slowly, through prominent veins under the skin of the massive three year old.  They were all so bloody young, though, weren’t they? Even the Hurv, with its initial temper tantrum over humanity’s failure to follow ancient rules, had revealed in that instant the frailty of individual life spans even when fortified by immense stores of collective wisdom. Not one among them was old enough to be immune to making basic interspecies mistakes.  “Fine, Jude. We’re good here—you can call it a night.”  Not that the young man would, of course, with dress rehearsal coming soon. But far be it from Doc to keep the animal in any of them from running its most instinctive course.  7  “What am I looking at?” said Cap, when Doc had her and Jude together for a debrief the next morning. Jude looked a touch haggard from theater work but kept his attention as much on the projection between them as possible. “A cartoon? Ad mascot?”  “Not exactly,” said Doc. “That’s a Murr.”  Cap shot the station vet an even more bewildered look. “Murrs don’t have faces.”  “Not traditionally, no.” Doc drifted into an open seat. “But then, dogs didn’t start out with all the features we find adorable, either. We bred them in certain ways, and it was in their interest to hang around long enough to be bred—at least, originally, before some breeding caused enough maladaptive traits that they needed our ongoing help to survive. Murrs aren’t much different, minus all the weaknesses bred in for looks and purity; they were also originally cultivated for the features that Usmics find most appealing in small animal companions. All those tendrils of root and branch give the impression of the Usmic spores, a life-stage they’re inclined to want to nurture to ensure maximum resilience when it’s eventually scattered.”  “Except that Usmics never actually ‘scatter’ their Murrs,” said Cap.  “No more than we expect cats and dogs to grow up and leave us to build homes of their own,” said Jude, clearing the grogginess out of his throat. “It’s just, like, an offshoot of reproductive behaviors that’ve served us—and the Usmics—pretty well, you know?”  “But not the Hurv?”  “The Hurv spend less time with their young,” said Doc. “That probably has something to do with their lack of animal companions. They don’t have the nurturers’ instinct.”  Cap snorted. “Tell us something we don’t know.”  Jude nodded along, then added: “Well, except for their pack animals, which I hear they’ve got plenty of back on their home world. But even then, like, it doesn’t help with hard labor if your pack animal has all the features of a juvenile. And since they never needed to keep herds for protein and clothing, there wasn’t any reason to domesticate an ally for the flocks, right? Even a cat’s not much use if you’re planning on eating all the house-pests yourself.”  Cap processed this with a long slurp of coffee, and a hard look at the projection. “Meanwhile, an Usmic keeps its spore cluster close for years, if it wants to. Just like us with our kids. But then what happened here? Why would someone raise a Murr to look like that?”  Jude frowned, squinting at the projection. “Nah, they couldn’t have. I’ve seen different branch formations, but . . . look, the eyes, the tongue. That can’t be natural—can it?”  “It’s not,” said Doc. “They weren’t raised this way. Someone on the station has been gene-splicing, to make them more like Terran companions. And that’s why there are no new requests coming in. Like you said, Cap—something shinier came along. So, now there’s a local underground for this subspecies. Humans prefer the familiar, after all: something they can bond with. And to hell with the consequences for the rest of us, when they do.”  Cap inhaled sharply. “Do the Usmics know about this yet?”  “Not as far as I can tell, and I get the feeling we’d all be hearing from them if they did.”  “True.” Cap leaned back, considering. “So, what do we do? Deny them licensing?”  “That won’t fix the issue with the existing ones,” said Jude. “They’re here now either way, and it might even drive up black market demand if we tried to ban them. You know how some people want things even more when they’re not allowed them.”  “Though for all we know,” the captain countered, “the Usmics might consider these mutations an abomination worthy of destruction, even for all their talk of ‘sacred ones.’ And then, well . . . that’s a solution, right? Just give them all back and let the Usmics sort it out?”  Doc and Jude’s gazes met while glancing automatically at Cap’s desk rock, “Spot.” People without companions sometimes said careless things about them without realizing it—but also, if the matter ever did come to that, would Aleph Station even have the authority to give sanctuary to any sentient life-forms that the Usmics wanted killed? Would Earth authorities and local diplomats ever allow the clinic to shelter such a strange form of political stray?  Jude coughed and turned to Doc to change the subject.  “You said ‘someone’ is doing this—but you know who, right?”  “I do. Mateas Brimli, Core Bioengineer with a passion for histories of human-hybrid experimentation: the good, the bad, and especially the grotesque. But the name matters less than what we’re going to do now, doesn’t it? Because if it wasn’t going to be him, it would’ve been someone else, eventually, now that we’ve got all these research partnerships with other citizen-species, including at least a dozen with less cultural sensitivity about the ethics of genetic modification. We apparently already have six of these new Murrs in Aleph Station, with more deliveries in progress, but, oh, Jude—you should have seen the look on this guy’s face, when I asked about it. He’d been given strict instructions not to bring the Murr out until they’d finished monitoring for serious defects, but, as you said . . . we know how people are.”  Jude squeezed the bridge of his nose, as if to tamp down the exhaustion.  “Would that we didn’t.”  Doc nodded. “And so, he thought he’d been so clever, coming as late as he did to the park, long after the usual hour when Esmin famously drops by with a Murr of its own. It was supposed to be a subtle boast to those in the know; a way of establishing himself as an early adopter of a next-gen status symbol, so that he could later bask in the prestige of it all.”  “Just the prestige, of course.” Jude rolled his eyes. “And never the responsibility.”  “But of course.”  Cap shook her head. “I’m surprised he told you anything, Doc.”  “That’s just it—he and all the rest in the test-group are bursting with pride about their modded Murrs. Their overconfidence is staggering. They truly think that if they just roll out their new companions slowly enough no one will have any reason to be upset. The new Murrs will be so fully normalized before the Usmics catch on, that any attempt at raising hell will seem outdated before it even gets off the ground. ‘Better to ask forgiveness’ at its finest.”  “And no one thinks that these modded creatures are . . . kind of ugly?” Cap squinted at the projected, puppyish face grafted into the top half of the Murr. “I kinda prefer the original, myself. They’re like overactive bonsai, you know?”  Doc shrugged. “No accounting for taste—although, I expect that there will also be a few grandstanding human purists who enjoy their Murrs as-is, too, and who might make things worse for the diplomats by raising the alarm early, trying to rouse the Usmics into an even greater fury when it all comes out. And less for the benefit of the Murrs, of course, so much as to ingratiate themselves into a superior moral position—as if that moral position would mean a damned thing the moment Usm declared war on Earth and all its outposts.”  “Oh, yeah, that sounds about human.” Cap started kneading her temples. “Well, I’ll talk to the diplomats, try to prepare them for any impending fallout, and we’ll see what we can get out of Mateas, too, but . . . I’m guessing it’s too much to ask for an upside? Anything the negotiations team could spin as a positive, if it came to that? When it comes to that?”  Jude and Doc considered. Jude, in the end, took initiative:  “Maybe they’ve been modded to . . . shed a lot less?”  A slow, wavering nod from Cap and then Doc said that this would just have to do.  8  The handler was waiting in reception when Doc and Jude returned. Only a concussion-monitoring patch on one temple hinted at her brush with serious injury. Skeeter, from his tethered perch on the counter, was yowling at her in his usual, cantankerous way—and not really in pain, or need, but choosing to share a litany of feline grievances with the “lucky” clinic visitor all the same. Possibly this was the closest he could come to saying, “Sorry, all our staff are currently indisposed, but if you’d like to wait, I’ll let them know you’ve arrived”; and if that was the case, then Doc would definitely have to see about giving the old grouch a raise.  For now, though, Doc smiled and shook hands with the arrival—Yara Dagny, from the tag on her bag—before waving her through.  “How are you feeling, Ms. Dagny? I’m so glad you’re up and about again. The horses missed you, of that I’m absolutely certain.”  “Yara—please. And thank you. Internal bleeding in zero-G’s no joke, but you’ve got some excellent doctors here, and even better diagnostic equipment. They caught irregularities elsewhere in my system, too. Pretty sure I’m leaving in even better health than when I arrived.”  “Well, that’s good to hear. And—‘leaving’? So, the flight’s been rescheduled, everything’s more or less ready to go?”  “That depends on my girls and their boy.” Yara hesitated. “And thank you, Doc, for taking such good care of them. I’ve known transfer points that would never have leaped to preventative surgery without express authorization, even with something as serious as this.”  Doc cut a hand through the air between them. “Nonsense. We vets have a code, too.”  But Yara’s answering smile—more of a tight-lipped grimace—as good as said agree to disagree. And, considering her industry’s horror stories, probably for good reason.  “Anyway—” said Doc, “Yes, the mares are doing fine, their readings are all good, with minimal biomic disruption after all; and the colt should be ready to join them tomorrow.”  “Good,” said Yara. “You have no idea how pleased their new owner will be. He’s getting on in years—one of the first to live on an extra-solar colony, half of which he owns, and after a lifetime’s work getting the whole thing up and running, he’s grown a bit senile: lost in nostalgia, always talking about the ranch from his childhood. Reconnecting him with the descendants of that childhood herd was the least his grandchildren could do, so they’ve been keen to have the team arrive in time for his ninetieth Sol.”  Now, though, it was Doc’s turn to plaster on a less-than-full-story smile. The grandkids could always have created a VR ranch—excellent verisimilitude these days—instead of shipping out four living, breathing Terran animals to a completely new environment, at great and confusing cost to their health along the way, just to appease one rich human’s longing for yesteryear. But Doc knew better than to say as much. What good would it do them now?  “I’m just glad that everyone got through the incident in one piece—or, as you say, maybe even turned out all the better.”  The right answer, considering the circumstances: Yara’s smile warmed, and the pair turned their attention to discharge forms, follow-up prescriptions, and the matter of payment. Once the clinic’s account confirmed receipt of the indemnity funds, Doc also felt a whole lot wobblier about where Yara’s complicity ended and the clinic’s own began. But what else could have been done? Where in the galaxy were noncitizen-species safe from human whims?  “Time for that Congress of Familiars?” Jude offered, once Yara had left to make final flight arrangements, and after catching the look on Doc’s face while reviewing the transfer.  “Can’t come fast enough,” Doc agreed.  Binky’s send-off was a generous and well-attended affair in the arboretum. While the chief composter oversaw the internment of Binky’s flash-frozen and pulverized remains into a soil mixture that would make it suitable for new plant-life in a month, humans who had been close to the sleek, sharp-eared, black-and-tan xolo-whippet mix took turns sharing a few endearing stories at the podium. The sudden, tragic loss of a “good boy” on Aleph Station was enough of a to-do that many of the other fur-parents had shown up expressly to turn it into a celebration of life, with games and treats and video shoots involving the rest of the nonhumans, and a screening of the derivative but thematically “safe” The Congress of Familiars IX: Marlee’s Bestest Interstellar Walk for the children.  Mx. Meru’s boyfriend was not in attendance—possibly not even in the picture anymore—but the grieving guardian still always had someone at their side, even if this meant spending most of the service patiently listening to and declining offers of fosters in need. With one persistently tedious petitioner, Mx. Meru seemed grateful when Doc intervened to inquire about the other guest’s upcoming clinic appointments—because, as Doc suggested when the browbeater then hit a hasty, flummoxed retreat, there really was nothing like a little reverse-pressure to thin a flock of scavengers, was there? Mx. Meru cracked a faint smile at this last, while Doc tried not to feel bad for having spoken ill of a whole class of essential animal. Buzzards in particular were creatures who had learned not just how to stomach but also to thrive on the hardest facts of existence, turning those facts into something that others could build beauty from again. How could Doc not admire any living beings capable of such a feat?  Jude, meanwhile, had slipped at some point from distributing care tips and wellness kits for all sorts of noncitizen-species onboard, to promoting his upcoming show in the Core. This “slip” wasn’t entirely his fault, though, gauche as that opportunism would have been. Plenty of attendees were simply as curious about production details surrounding Hello World Goodbye as they were about the best way to deck out a travel carrier for optimal comfort in zero-G, and the relative value of the latest newfangled latrine-mods when potty-training their cats. Every time Doc came past, then, the young man was fielding questions like how it felt to move through zero-G like a dolphin or gorilla, or explaining for the umpteenth time that the troupe wasn’t offering discounts for nonhuman Terrans because the whole point of the show was to fundraise for the rehabilitation center whose patients—the first nonhuman intelligences sent to interact with equivalent nondominant alien species—had inspired the script in the first place. It was a wonder that Jude had the energy for it all. Doc felt exhausted, just listening in.  Doc also considered saving Jude, too, from one particularly vexing attendee, the type blissfully unaware that he was trying to explain (badly) basic concepts about deep-space animal outcomes to a fully trained assistant vet; but then, Doc noticed a more pressing arrival at the edge of all these proceedings: the very subject of the morning’s briefing with Cap and Jude. Mateas Brimli himself. It wasn’t surprising that he would be here, really; the station’s long-term complement was by no means infinite, and anyone with a vested interest in nonhuman animal companions tended to pay attention to related events. But Doc still found the gears turning: Confront him? Chat him up? Try to reason with him? But if so, to what end?  No, there seemed little point to lecturing the barn-keeper once the horses had fled—and quite a bit to risk, Doc reasoned, if Mateas were the sort to take even the mere existence of dissent as a reason to deepen his original convictions. And yet, even as Doc came to this conclusion, Mateas had decided the matter for them: setting eyes on the vet and advancing.  Never a dull moment, thought Doc. With no small reluctance, the station vet handed off the fluffy, golden pup who had been enjoying a snooze and lazy head massage in the crook of an arm held well above the rest of the inquisitive pack—and braced for bristlier contact with one of humanity’s far wilder own.  9  “Nature fetishism strikes again, am I right?” said Mateas, the moment he and Doc had removed themselves from the rest of the boisterous throng, to walk in the dappled shade of the arboretum’s fruit trees. “All these freaks thinking there’s something so high and mighty about letting it all take its gradual course, and all of them right there with a boot to your head the moment you start to dream big without doing anyone any harm. Any harm at all!”  There, in this word salad of internal thought given messy outward form, was that “pull” again, that trick of a false force it was so easy to believe was guiding anything. But Doc knew better than to fall for any of these loaded and obscure references, all these baited lures embedded with intricate and ultimately meaningless red herrings in one isolated, agitated mind.  “I take it you’ve heard from Captain Rui,” said Doc slowly instead.  “Yes, yes, Captain Rui, that prick Mika on the trade forum, my supervisor—all of them! And for what? Captain Rui says your office flagged something on shipment manifests. Next thing I know everyone’s telling me I’m going to bring down civilization? Ha! I wish.”  Doc suppressed a flicker of annoyance that the clinic had been named directly in this. It wasn’t ideal, but it also made sense that the command staff and diplomatic team would have tried to benefit from throwing around a bit of medical authority when asking Mateas . . . what, exactly? Or had they simply gone to him to vent over what his actions could cost them all?  “I can’t speak to your conversation with the others,” said Doc. “But I do know that it would help tremendously with damage control if we had some sense of how your test subjects are doing, so we can anticipate how the Usmics might respond once they find out that we’ve been, well, as they put it, ‘unrighteous’ guardians of their ‘sacred ones.’”  Mateas laughed bitterly. “‘Unrighteous!’ Us? Unbelievable. So high and mighty.”  Doc halted in the shade of a citrus tree. “Mr. Brimli, we’re not on opposite sides.”  “No? Sure as hell could’ve fooled me.”  For a split-second then, Doc imagined a different career path, a critical moment back at the academy when someone had asked: Why study nonhuman animals? Why not other humans, when there are so many on the stations and deep-space colonies who need our care?  It wasn’t that humanity’s companions didn’t experience anxiety, depression, or a whole host of neurodegenerative diseases, too. But there was something in the way that a species with humanity’s level of mytho-linguistic tradition meant that they could and did try to rationalizeits hurt, its selfishness, its anger, and its prejudice . . . It was how someone like Tina Wilson, generally a decent human being who contributed plenty to her communities, would have become defensive, even hostile, taking the whole matter far too personally, if Doc had simply tried to tell her that Zeddi’s alien costuming was inappropriate and potentially destructive to ongoing diplomatic efforts; or how Cousin Mel would have told Doc to “fuck right off” if Doc had so much as pointed out that the kitten could have been placed in the stasis pod with him, then re-homed on return to Earth instead. Doc had a case of the “hollows,” that was true, but this existential nuisance of a condition was just one of a whole, dizzying mess of behavioral complexes that the human-oriented physician had to grapple with, when simply trying to address a body of very real health concerns, and, well . . .  Other animalities were often much easier, where all that chaos was concerned.  “I hear you,” said Doc, after Mateas had taken a moment to exhale. “How are all the new Murrs doing, anyway? It’s a really ambitious experiment, from what they tell me. You must be exhausted from all the work it would take to pull off something that incredible.”  “You have no idea,” said Mateas, heavily. He ran a hand through his hair while eyeing the station vet, as if waiting for the inevitable sign or sound of judgmental disagreement—but when it didn’t come, when all Doc did was wait patiently for him to continue, the bioengineer at last relented, at least a touch. “Well, okay, maybe a bit. But I swear, Doc, I did all my initial testing on micro-samples. I screened for all the major potential splicing issues long before I started in on full-scale test subjects. And even those ones, I put on ice the moment in their developmental cycle that something seemed to be going wrong. No suffering, right? And no death, no slaughtering of anyone’s ‘sacred ones.’ They’re all still there, waiting to be treated once the process is refined. I’m not a fool, okay? I know what I’m doing.”  Doc nodded. Believing Mateas was not important here; calming the agitated animal in him was—at least, long enough to gather the necessary intel. “Understood. The only trouble is, we didn’t know that, and how could we? We only just realized what was going on when the general population’s habits started changing. And you know how thoughtless a crowd can be.”  Mateas grunted at this last and relaxed further. Shifting the blame to “the masses” and their foolish beliefs was an easy bit of flattery to pull off. Who didn’t want to think themselves above the madding crowd? Jude, Doc—even Cap, for all her elaborate maintenance of her person and her living spaces: none of them quite escaped the allure of thinking themselves the “highest” intellects of all; and in this way, made themselves even more prone to fits of dangerous overconfidence in whatever belief or whim at any given moment struck their fancy.  “One way or another,” said Doc, as casually as possible, “we all knew this kind of work was bound to happen eventually. I mean, the way all our research was going with the outer species, am I right? And so, now we just need to figure out how to help with what you were already trying to do—to roll out these new Murrs in the least harmful way possible. To anyone. To their human companions. To you. To the new Murrs themselves.”  “Nurrs,” said Mateas, after a pause.  “Hm?”  “We’re calling them ‘Nurrs.’ Part of the plan is to argue that they’re not really Murrs anymore, so that it doesn’t matter if they don’t look like they’re supposed to. Usmics love their categories, right? So, we figure this has a decent shot of fixing everything without any fuss.”  Doc kept a straight face. That myth about the Usmics, often reinforced in mainstream media by caricatures of the southern-Usmics’ elevated language of dualities, was pervasive even on Aleph Station. It wasn’t surprising that this bioengineer would have thought it true, too: that the whole of the Usmic species, with its wide-ranging continental heritages and languages, could be reduced to a singular people fixated on surface-labels. But there was something heartening, at least, in the fact that Mateas had tried to weed out disasters and find fixes for the issue at all. This meant that, on some level, he did see a potential problem here, same as them.  Now came the tricky part: trying to get the bioengineer’s full participation and data set, so that together they could work out a better response to the coming storm.  Give me an egg-bound cockatiel or shattered ant farm over this nonsense any day, thought Doc—but for now, there was only this far messier and more delicate recovery work.  As Binky’s celebration of life was winding down, Jude caught up with Doc at Red Shaft, where a lift carried people to and from the Ring into the Core: gravity receding as they rose inward, even if other kinds of heaviness ever-lingered in the heart. Doc knew that Aleph Station looked different to Jude, on account of their respective eras on it. Where Doc still saw echoes of past military infrastructure, from the early, skittish days of even Earth’s most optimistic pursuit of trade relations with far-flung worlds, Jude would only have known station features by their more recent functions: supply depots for free medicines, collaborative makerspaces, storage facilities, and stasis pods.  Would Usmic response to the modified Murrs bring about those skittish days again? Could one spacefaring species really go to war over something as seemingly innocuous as the care and maintenance of their animal companions in alien hands?  Well, but also . . . hadn’t plenty of Earth’s local wars been fought over far less?  Jude whistled appreciatively in transit, as Doc relayed everything that Mateas had disclosed in their conversation—the extent of preliminary trials, the state and location of all frozen missteps, the real number and locations of existing “Nurrs” in station quarters, how many others were on their way, how follow-up tests were proceeding, and how many people had access to the protocols that the engineer had perfected to this point at all.  “Damn, boss, when you’re good, you’re good.”  Doc notched a brow in amusement. “And when I’m not good?”  Jude shrugged. “Well, duh, Doc. Then we’re screwed.”  “Hm. I’ll keep that in mind.”  “But, so, what now? Like, Captain Rui and the diplomats went right for him after our meeting, yeah? And then he went looking for you right away and spilled everything, and still, the problem remains the same, right? This is going to bust open wide no matter what.”  “Maybe,” Doc agreed. And yet, hearing Jude summarize the afternoon gave Doc a thought: Perhaps Cap hadn’t name-dropped the clinic just to add a kernel of authority to her own. Perhaps she’d scattered the bread crumb trail on purpose. After all, just as many humans sought out elusive or trending species for prestige, so too did many with highly active minds long to be acknowledged, eager to capture the acclaim, admiration, and envy of their peers. Had Cap and the diplomats possibly been banking on this bioengineer itching to explain his genius to whomever had the best credentials for understanding and celebrating his work?  Doc couldn’t help but smile slowly at the diversionary tactic. Usmic dualities were certainly infectious, weren’t they? But binary thinking rarely got any of them anywhere.  “Jude,” said Doc, once the lift had settled at med-sector—Doc’s stop, but not the actor’s, not on dress rehearsal day—“Save me a seat. I’ve got one more errand to run.”  “Just one?”  From anyone else, this would have seemed sarcastic, but Jude knew the vet life well.  “Just one,” Doc agreed. “At least—for now.”  10  Around the veterinary clinic were a host of other medical services, the majority for citizen-species but a few dedicated to mixed-use equipment and research labs. Human doctors, scientists, and technicians were joined here by professionals from a host of other species, including ones where medical care was less a profession and more a sacred calling. And so long as there were Hurv in talks on Aleph Station . . . there was aid for them here, too.  Doc hesitated by the front entrance to their rather stark facility, which was divided into minimalist hot, cold, and wet sectors behind a straightforward reception booth where a single Hurv reposed, large eyes drooping beneath its iridescent green hood. The thought of a Hurvian version of Jude amused just long enough for Doc to strike up the courage to knock and then enter. Fear of starting a diplomatic incident? Perhaps. But perhaps also simple discomfort in the presence of something that had made humanity feel so small for so long.  “Ah, hello. Is—the doctor in?”  The Hurv eyed Doc slowly.  “You require assistance? Information on the species you service?”  Doc was both relieved to be recognized as another professional, and inclined to laugh at the Hurv’s assumption. But then, why else would a human come a-calling to such an old, indifferent species, if they weren’t seeking some sort of wisdom from it?  “Thank you, no—not exactly. I wish to ask the plausibility of a favor.”  The Hurv’s left eye rolled to the side for a moment, as if in thought, and then the Hurv leaned in and activated an intercom.  “There’s a noncitizen specialist to see you, Healer,” said the receptionist in emphatic English. “Human.” Then, in a Hurvian tongue, it added a few syllables that Doc could not so much as interpret as belonging to a single word or a full phrase. But Doc had some guesses: “Trouble,” maybe. Or “If you want, I can eat it or send it away.” The Hurv did have strikingly long, lipless mouths with sharp teeth, and it was hard to look elsewhere, in their presence.  In the ensuing pause, Doc had plenty of time to doubt the original plan entirely. Why hadn’t the vet simply gone straight to Cap, or the diplomats, with all that Mateas had revealed, and that Doc suspected might actually help them now? Hubris, obviously. Hubris, and that pesky case of the “hollows,” that yawning absence of meaning, aching to be filled.  The Healer did not answer on the intercom, but rather emerged glistening from the wet zone, and blinking rapidly to adjust its sight as the fog cleared. It towered over humans, too.  “Yes? Human? Yes?”  The Healer fixed an impatient eye on Doc: the hallmark of a bureaucratic species that intentionally faced others with its least welcoming side showing. Maybe back on the Hurvian home world things were different. Possibly there were enclaves or whole cultures of dissidents who for millennia had resisted the tedious practicality of their peoples’ ancient ways, and advocated for free love and sang peacenik tunes in the shallows of their ancestral shores. But all the younger deep-space-faring species never got to see that side, if it existed. Never got to visit the Hurv’s home world. All of them knew the Hurv, instead, solely as The Ones Who Will Take Away All Your Toys If You’re Not Careful With How You Use Them.  And yes, maybe that hadn’t stopped individual humans from testing the extent of Hurvian patience, baiting the ancient species in passive-aggressive and self-righteous ways despite the decade-long, species-wide cost the last time someone had transgressed—and even then, only in error! But . . . on the other hand . . . why would any ever expect a cautionary tale to work with perfect consistency? When had humanity ever claimed itself to be as universally righteous as, say, the Usmics of Usm’s southern continent?  Moment of truth, thought Doc, before stepping into the moral muck with all the rest.  Mere hours on, Cap mag-locked beside Doc in the gallery overlooking the temporary theater-site, a zero-G expanse awash in faux underwater lighting, where Jude and the other “dolphins” were moving interpretively through their final test run: first, as a pod on Earth, in play and then mid-hunt; then, interacting with humans in a more confined setting, where they excelled at humanity’s strange new tactile games; next, as a pod divided, contained, sedated, and above all else confused; from there, turning into the components of a spaceship, dreaming whole-pod dreams of hurtling together toward the distant stars; and lastly, with a single dolphin—Jude—lost, alone in the vastness of night, calling uselessly about before moving symbolically, sacrificially, toward the light of an alien sun, and . . . weakening, then winking out.  “Got your report on Mateas,” said Cap, when the troupe broke for intermission. “Lots of good, actionable intel. We should be able to monitor everything with these new Murrs carefully from here on out. And the diplomats are figuring out how to break the news as gently and soon as possible, so the Usmics can’t accuse us of trying to hide anything from them.”  “Good, glad to help,” said Doc—not a little distantly, still studying the aquatic light patterns rippling silently across the stage.  “Also, I got a call from the Hurvian ambassador . . . ”  “Oh?”  “But you wouldn’t know anything about that.”  Doc side-eyed the station’s captain. “Sure you shouldn’t have your zoomers with you, Cap, before you get your hands dirty asking a question like that?”  “Oh, but there isn’t a zoomer big or strong enough to clean some of the shit we get into, is there, Doc?”  “Now who’s finally offering up their trademark optimism?”  Cap winked. “It was a good call, in any case. Very productive. The ambassador wanted me to know that, for the sake of station security and the prevention of further breakdowns in sector order, they’ll widely disseminate an offer to take these new Murrs into their own protective custody, if the Usmics have a negative reaction upon hearing about their existence.”  “Well, now. Isn’t that awfully generous of them.”  “Isn’t it, though.” Cap eyed Doc suspiciously. “And I suspect they’re only offering this because they know that they won’t actually have to deal with the new Murrs if it comes to that. The moment the southern-continent Usmics realize they have a choice between letting the humans keep them, or handing them over to a severe species that always gets its way, well . . . ”  “Why, Cap,” said Doc, pleasantly. “Why the long face? And here I thought you’d be pleased to see a problem take care of itself.”  “Uh huh. And—has it? Why would the Hurv help out? Are we really sure this’ll work?”  Doc kissed teeth while watching the stage crew prepare for the dress rehearsal’s second half. “I ever tell you about my Aunt Luli?”  Cap shot Doc a withering look. “Are all your relatives anecdotes now?”  “Aren’t everyone’s? Anyway, Aunt Luli—she never wanted an animal companion, or even much in the way of other people around. Bristly exterior, all cactus needle without the flower. Or so we thought, until one time, when I was a kid—a little kid, mind you, a real brat not minding my own business—I pointed at her chest in front of everyone and shouted, ‘it’s moving!’ Well, and so it was, because she’d apparently rescued a baby squirrel, and that little rotter ended up going with her wherever she went. Except, as it later turned out, it wasn’t exactly a clean rescue. Turned out, a neighbor had found the poor thing, but Aunt Luli hadn’t liked the way the neighbor was managing things, so, she took it upon herself to do better. And even though she could go on for days about how much of a burden the critter was . . . ”  “Mm hm. She loved it just the same, right? But—the Hurv?”  Doc cut the air lazily with a hand. A sound sequence signaled that the second half would be starting soon. “They didn’t have to leave instructions for us in the fabric of space, and they didn’t have to come running the moment we didn’t read them. But they did, because that’s the way their species shows care for its young: by leaving carefully curated guideposts and monitoring from afar. By stepping in only when necessary—but being at the ready, always, to help whenever needed. So, maybe they don’t have companions like we do—but still . . . ”  “You’re saying we’re their pets?”  Doc made a mental note to correct Cap’s term-use later. For now, the tired station vet simply hummed assent as the lights dimmed and Jude and the rest of the actors drifted into position. Tomorrow, before opening night, there would be a new hamster’s lodgings to review, a litter of puppies to fix, an elder cat to assess for gene therapy, a full schedule of “Nurr” checkups to arrange, and a ship to watch launch, if time allowed, with its team of horses headed frivolously for the distant stars. Were they missing anything? Always, in this line of work. Would Jude grind his teeth to dust over the coming trend cycles: all the petty, day-to-day provocations and predictable human grandstanding that stood to do great harm to citizen- and noncitizen-species alike? Probably.  But so and ever-spun the wheel that also kept them grounded, with all its superficial force-effects driven by a problem much older and more central to them all.  New ones would just have to wait for their own curtain call. Canadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "text": "12930 words, novelette\nLove Unflinching, at Low- to Zero-G\n1\nDoc tried to keep a straight face until the other human had left the examination room to complete annual license renewals. Zeddi Bobeddi, her wagging tail threatening to helicopter her off the low-G table from familiarity with these routine checkups—the treat! the impending treat!—was not making this easy.\n“Okay,” said Doc, once the coast was clear, and while presenting the succulent spoonful that would distract Zeddi from her booster. “What’s mama done to you this time?”\nThe mods along Zeddi’s ears and snout were not permanent, but they could do permanent damage if the wrong person saw them. Long arcs of digital metallic-green wrapped Zeddi’s head in the semblance of another species entirely—and not just any species, but the Hurv: a dour administrative people, from what humanity had seen of them, who were heavily engaged in negotiations with Earth diplomats elsewhere on Aleph Station. But why this look, and why now? A party trick carried over from New Year’s? Or something more intentional?\n“Oh, your mama really loves to poke the bear, doesn’t she?”\nDoc patted and scratched Zeddi all over while the fine-haired basenji licked at the prize between her paws. Doc moved so swiftly that the good girl hardly noticed when her scruff was held tight, and the bone-density shot slipped in between rubs. Done and done.\nAs for the alien costuming . . .\nDoc looked Zeddi square in those large, trusting, liquid-brown eyes.\n“All right, girl. This is going to look like it hurts, but I promise, it won’t.”\nWhen Ms. Tina Wilson of Dock Maintenance returned, Doc made it a point to be busy storing the rest of the shots, to let her notice on her own. Ms. Wilson’s panic was genuine.\n“Zeddi-bear! What’s happened to your ears? Doc! Is she infected?”\nDoc feigned surprise while turning back to inspect the angry red rashes that had arisen around the interfaces projecting Hurvian features from the unwitting canine head.\n“I was afraid of that.” Doc whistled gravely. “You know, you can’t be too careful with this tech. Manufacturers think that, because the implants are for nonhuman use, they can get around all the usual safety checks. And what’s worse is that they’re usually right. Don’t get me wrong, some of the projections are adorable, but at what cost?”\nMs. Wilson’s eyes welled up. As she shook her head, a few droplets added to the work of the zoomers: tiny bots styled after diving beetles, who helped with station filtration by clearing away detritus, like the sort cast off by Doc’s four-legged, no-legged, two-clawed, and tentacled patients, prone to drifting about in low-G. The aim was always to catch as many of those stray hairs, husks, gobs of impressively smelly saliva, scabs, stitches, urine sprays, bits of fecal matter and upchuck, feathers, scales, skins, arboretum burrs, and dirt-clods before they slipped into station-wall crevices and circuitry where they had no right to be.\n“Can you take them off? Can you fix her? Oh, my poor baby . . . ”\n“Of course,” said Doc, heavily, before making a show of trying to remember where the detachment tool had been stowed in the examination room—as if its charge hadn’t been checked mere seconds before Ms. Wilson’s return.\nJude in reception had The Look when he was asked to add a zero-cost placebo to Ms. Wilson’s account, not long after Doc had finished the procedure to remove Zeddi’s implants and restore her natural, nondiplomatic-nightmare of a brown-and-white complexion. Both knew the “rash” would clear up on its own—its binding agent a nontoxic adhesive that Jude used onstage after business hours—but a week-long prescription for “mama” to administer twice-daily would hopefully make the lesson stick.\n“I know, I know,” Doc winked, while scratching behind the pricked ear of the clinic’s gray-haired guardian, Skeeter. “I should’ve offered Ms. Wilson a spoonful, too.”\n2\nIt wasn’t that Jude disapproved, exactly, but the young man was still in a place of exasperated affront that trickery was necessary; that human beings continued to be so . . . so . . .\n“Human?” Doc prompted, over dinner in staff commons around the Core.\n“Exactly.” Jude jabbed with his fork for emphasis. “It’s like, first contact happens—yeah? And there’s this great big hush over all the lands—for like, a split-second, right? But then comes the media spin cycle. The hot take. The alien overlord meme. The latest fashion trends. It never ends. It’s all just more fodder, more material, more excuses.”\n“You were expecting, what, that we’d all ascend into a higher realm, hovering in perpetually unified grace over the cosmic miracle of first contact with other advanced species?”\nJude’s long purple bangs swung from side to side. “Uh, yeah? Kind of.”\nDoc watched him fall to eating as if he had gone many days without a proper meal. Jude would have been about six when the Aleph Station project launched, a beacon of hope amid a hundred military uncertainties about all the new forms of life on the edges of human discovery. The perfect age for a kid to be thrilled by the promises of a coming utopia: a deep-space diplomatic paradise where alien species could meet and work together for the betterment of all. A haven and a respite, at bare minimum, from a range of tediously abiding injustices back on Earth, many of which Jude had worked hard to escape by training for deep-space life.\nInstead, at first, Aleph had brought the Hurv out of hiding—or at least, their itinerate higher-tech bureaucrats: a group only interested in the younger species when safety regulations established eons ago were at risk of contravention by some careless newcomer who had failed to read “the signs” posted in particle-probability patterns all throughout the vacuum of local space. Even worse, the Hurv’s extensive regulations, once reviewed by human experts, proved disappointingly sensible: best-practices for energy production, waste disposal, trade-route plotting, information-sharing, materials maintenance, and disease-transfer risk-reduction that stood to benefit any species who complied as they ventured further out. There wasn’t so much as a line in the whole bloody ordinance that Earthers could sincerely claim as oppressive or an undue burden, at least not in the long or even medium run among the stars.\nAnd yet, it was the way the Hurv had chosen to administer all their perfect little rules, after the first ship broke one in error: with all the irritation, that is, of one adult repulsed to learn that another doesn’t already know how to wash their hands—and then not only teaching them this basic skill by making a grand, severe, and highly public spectacle of the lesson, but also going over every other “basic” skill they could think of in the same degrading manner, under the pretense that they could no longer trust the other adult to know these ones, either.\nMight as well have whacked humanity on the nose, Doc had thought at the time. At least it would have been over quicker.\nInstead, it had taken another ten years to get Aleph Station up to Hurvian code, before those ancient administrators would withdraw the interstellar equivalent of a “New Driver” sticker from Earth and its colonies, so that diplomatic relations could begin anew between humanity and the rest of the sector’s citizen-species. Was it any wonder, then, that some humans saw no problem getting their kicks in against the Hurv when they could?\n“Well . . . ” Doc offered, when Jude had paused long enough between bites to take a proper breath. “At least there’s still The Congress of Familiars to look forward to, right?”\nJude snorted, but also couldn’t help but be somewhat amused and placated by Doc’s reference to a children’s classic that had become wildly popular after first contact, in which aliens arrived and immediately started quarreling with humanity, until animal companions on all sides got fed up with their respective “higher” species and wandered off to form their own, far more harmonious republic in the stars.\nDoc would never say as much aloud, but Jude was also the right age to have been someone who went into related fields—veterinary studies, animal husbandry, animal rights activism, xenobiology, nonhuman animal ethnology—because of the wonderful adventures of that movie’s protagonist. The interspecies theater troupe that Jude ran in his spare time only completed the circle of art informing life informing art in the young man’s journey.\nA wounded idealism, thought Doc. But definitely not gone.\nJude set a reader by Doc’s tray after they’d both finished their meals—or rather, after Jude had finished Doc’s untouched second half, while Doc prolonged the last of a tea packet. Doc’s waning appetite had long become accepted fact between them, as was Jude’s insatiable need for fuel to match his youthful burning of the day’s candle at both ends.\n“What’s this?”\n“Next intake manifest.”\nDoc raised a brow. “Look on your face says that something coming in will be trouble.”\n“Not quite.” Jude tapped the reader, wiped his mouth, and velcroed a tab on his napkin to the tray before pushing off. “It’s what’s not coming in that bothers me. Night, Doc.”\nDoc nodded back, then skimmed through the manifest, pausing only to thank the server who drifted by for their trays. It took a while to catch on to Jude’s concern: the answer wasn’t in the medical resource list, or among nutritional supplements and seasonal accessories.\n“Sonuva—”\nDoc looked up when it clicked, but Jude had long since left for rehearsal, and in low-G Doc couldn’t even let the reader drop with a spectacular clatter to the deck. A good long sigh and a ping to the station’s captain, to see if she had time to meet, would have to be enough.\n3\nCap paced in mag-boots while reviewing the manifest. Doc had caught her in the middle of resistance training (never one to trust the booster shots to do their work alone), and a zoomer was air-skipping furiously after, to catch any perspiration wicking from bare skin as she moved. Cap preferred clean quarters and a cleaner office, so the closest she had to an animal or plant companion was a chunk of Martian rock on the corner of her desk (which she called “Spot” to drive the point home), and the zoomers she kept close by as often as possible, under the principle that an untidy mind begins with an untidy atmospheric perimeter. Doc and Cap were good friends despite both obvious moral defects on the latter’s part.\n“I don’t get it,” she said at last. “I thought you’d be pleased that we have fewer Murrs coming through. If I recall, you tried to deny every last adoption request two years back.”\n“I did, and you overruled me on the lot. Despite how much of a burden they are on filtration systems, I might add.”\nCap hummed agreement, but with a grimace. “You pick your battles out here, Doc. A few new alien pets being adopted by humans wasn’t it. In fact, all the eagerness among Earthers to keep Murrs of their own even helped in talks with the Usmics of the southern continent. They convinced their western and northern allies of the economic value of building more trade infrastructure on the back of that trend, instead of escalating their military presence along our species’ borders. That’s also how we got the Beam, even if they do still keep plenty of its secrets under lock and key.”\nDoc let slide Cap’s use of the word “pets,” for now: outmoded lingo, but not as easy to eliminate as contaminants from the station air.\n“And anyway, even if the trade deal hadn’t worked out,” Cap added, “if there are no new requests for Murr transfers, what’s the problem? It’s a trend that sorted itself out, right? I would think you’d be pleased, not looking at me like there’s a vivisectionist on the loose.”\nDoc kissed teeth and glanced at the long, transparent observation wall in Cap’s office, which overlooked a command deck filled with immaculately uniformed officers going about station-ops business. Their whole realm was an affectation of order and efficiency that humanity never tired of performing, even when it fell far short of the mark behind the scenes.\n“I ever you tell you about my cousin Mel?”\n“Mel? Yeah, I think so. Gym rat who shipped through here last year, on his way to some extreme endurance run on Severin Six?”\n“Qualifier race. Didn’t make it. Busted a knee in the high-G.”\nCap winced. “Lucky it wasn’t more.”\n“Agreed. But he was still holed up awhile on the orbital transfer station, in recovery, and someone got the bright idea that he needed company to survive the slump, after going all that way out and ending up with nothing to show for it.”\n“That is a bright idea, I’d say.”\n“Well, okay, I guess it could’ve been. But this ‘someone’ decided to gift him a kitten, because it was small, and because they figured cats didn’t need much to do well. Not like a dog that needs to be walked everywhere, right?”\n“I see where this is going. Kitten was a nightmare, huh?”\n“Kitten was a kitten. It’s just that, when the novelty wears off, plenty realize they aren’t up for the commitment. Major regret syndrome. Tons of gifted cats, dogs, rabbits, birds, and reptiles are still returned to shelters back on Earth. Or worse, abandoned to the streets.”\n“But Mel wasn’t back on Earth.”\n“Nope. And just as he was getting fed up with the kitten, he also decided to rent a stasis-pod and wait out the rest of his recovery in transit.”\nCap tensed. “Hold up, Doc. Am I gonna like where this story ends?”\n“Not one bit. So, we’ll just leave it there.”\nCap glanced again at the manifest, brows creasing as she pieced together the relevant diplomatic facts. “But . . . Murrs come from the Usmics, and the Usmics . . . Oh. Oh.”\nDoc nodded. “When Earth-Usm negotiations dominated in the stream, Murrs were as high-prestige as they are high-maintenance. Once the prestige goes away . . . ”\n“But so quickly? Just like that?”\n“Maybe something spurred it. Maybe not. Trend cycles are mysterious.”\n“Eh, sometimes. But we’re talking a high-profile interspecies alliance and a fairly recent and lucrative trade deal. Surely any humans with Murrs on board have to know how the Usmics feel about what other people do with species from their world?”\n“Humans ‘surely’ know a lot of things.” Doc shrugged. “But we’re even better at using all that supposed wisdom to rationalize our preexisting preferences.”\nCap pursed her lips, considering. “How many Murrs do we have on board? And how many do you think are at risk of abandonment or . . . ?”\nDoc raised a hand against the unspoken. “Forty-six, across thirty-one residential units. But that’s the trick, isn’t it? If I start a public campaign against abandonment, or worse, I might be putting ideas into the heads of people who hadn’t fully realized this was an option. Plus, what if an Usmic sees the campaign and assumes the worse is already happening to their sacred ones? Then we’re running even faster into a public-relations nightmare. No, we’ve got to be careful. There’s still time. Just not much, if new demand’s dropped to zero overnight.”\nCap shook her head. “This all strikes me as odd, Doc. Humans are fickle, sure, but we usually drop something shiny when something shinier comes along. So, what’s come along?”\nDoc nodded. “Wondering the same. Wondering, too, if knowing what changed will maybe offer us a solution. I’m going to look into it, and keep you posted.”\n“Ditto—on the diplomat side, mainly, but I’ll let you know if maintenance crews come across anything, too. You really think this could go nuclear?”\n“Anyone’s guess. We’ll just have to hope for the best. Or at least a good exit strategy.”\n“Ha.” Aleph’s captain stopped up short in her pacing, causing the zoomer on her tail to zip frantically aside. “Now there’s that trademark optimism I was missing from you.”\n“Very funny.” Doc moved to shake hands. “Just don’t tell my assistant. He already thinks I’ve grown soft as it is.”\n“Oh yeah.” Cap answered with a matching, solid grip: an echo in it, for them both, of a tougher time in station service. “That’ll be the day.”\nOutside Cap’s office, before heading back to med-sector, Doc paused to survey the long arc of Ring that this part of the command deck overlooked: an ever-changing half-klick of commercial zoning, leisure spaces, and visitor services, all rolling gently around the station’s midsection to sustain a hefty point seven-G. “Up,” to anyone inside it, was a transparent ceiling peering straight into the Core: a squat, gray, low- to zero-G research, service, and utilities space where interspecies scientists, diplomats, and military collaborated in publicly funded facilities. Decades out from the physics classes necessary for space-vet accreditation, it still staggered Doc to imagine how, when walking along that rotating Ring, anyone would reasonably think they were being “pulled” to the deck by a “Down” force that did not exist.\nAnd yet, this business with the Murrs was another sort of centrifugal illusion: of that, Doc had no doubt. The “pull” of the problem felt real enough—for Jude, for Doc, and now for Cap, too—but all the humans paying attention were still in the wrong frame of reference to make out any of the real powers behind it.\nFor now, at least. For now.\nDoc’s wrist-wear pinged an emergency in the docks: another “pull,” but this time more urgent, and clear. Tapping an icon for “on-my-way,” Doc pushed off for the docks. Some days, one simply had to hope that constant forward momentum would be enough to counter the whole mess of forces—real, and imaginary—ever thrown a given body’s way.\n4\nFrightened whinnying could be heard all down the corridor between Holding Green to Loading 3, and Doc—go bag slung over a shoulder, moving hand over hand along service-route guide rails, picking up more speed than was generally advisable—hastened to arrive before the disaster deepened. Klaxons had been switched off to reduce panic, but emergency lights still pulsed in the dark, and when Doc emerged into the sweeping round of the station’s largest loading zone, first impressions were almost incomprehensible: lightning-livid red flashes tracing the sinuous twist of powerful musculature pumping uselessly in zero-G; similar warning glows flickering wildly in the wide, glossy-black eyes of four horses floating helplessly in a realm of neither “Up” nor “Down.” Nor were they alone in that tumultuous bow-side nether-space: intact crates, scattered riding gear, and stall-partition materials tumbled at varying speeds all around them, knocking into the walls as much as into each other, before spinning out along freshly erratic trajectories. The team’s handler, who had been knocked unconscious in the initial power-surge that had deactivated the pallet lock and sent everyone flying, also drifted in and out of range of those sixteen frantically kicking hooves.\n“Hey! Doc!” Loading 3’s foreman called from the other service entrance. “We’re ready to crank it to point three-G if you want! Get ’em landed, calm ’em down—sound good?”\nDoc needed a beat to recognize the man across the dim and red-washed lighting: Luis Rodriguez, one of the station’s “gentle giants,” and the proud owner of a tarantula he called Fea, “Ugly,” with the greatest of affection. Good: not the sort to panic. But Doc’s own heart rate quickened while surveying what “Down” conditions would look like in Loading 3: a narrow, rounded laneway with little room for four horses to work out their understandably ongoing agitation after touch down. There was a good chance that they would run into one another while adjusting to the strange fractional gravity, or trip into bulkheads and fallen crates and luggage, then either break their legs or trample their handler in the process—or both.\n“Negative. We have to sedate and take our chances. But not with all this junk. Do you have anything you can use to clear some of the boxes—Oh! And of course . . . the handler?”\nA thumbs-up in answer: “Mag-hook’s on the way! My people are getting supplies.”\nSure enough, two of Rodriguez’s workers soon emerged from the far passageway: one with a makeshift snare pole from the emergency panel between Loadings 2 and 3; the other holding a drone equipped with a large magnetic claw. While the pair enacted catch-and-secure protocols with everything around the horses, the foreman doubled back for a spine board, and Doc mag-locked on the opposite landing to load the dart gun. The clinic’s standard ketamine-xylazine cocktail usually had a longer induction time in zero-G, due to decreased cardiac output and a general propensity for blood to linger in the limbs, but with any luck, all that frantic galloping in one spot would offset this delay and bring the four to rest before they could do further damage to themselves and each other.\nEmphasis on “further,” thought Doc, while studying the team’s movements after three clean hits to the shoulders and one suboptimal dart to a flank. Colic was highly probable for all of them after such a nauseating trauma, the likes of which none of their species could be expected to understand in full, but the most severe variant, colic from shifted bowels, was an especially key consideration as they bucked and twisted about in zero-G. As for the handler . . .\nWell, on the plus side, long before all four horses had conked out, Rodriguez’s team had the handler cleared from the danger zone, her surface wounds treated, and head and torso carefully secured for immediate transport to citizen-care. Doc couldn’t remember her name, but also couldn’t forget the kindness and expertise with which she had tended to the male colt and three mares after docking, when Doc had come by to oversee their initial revival. Doc had more than mixed feelings about the industry this woman served—shipping show-ponies and racehorses to affluent settlers on far-flung colonies, or for direct trade with alien species that also loved to gamble with other animals’ lives—but it was hard to see any better justice in the death of someone who had at least tried to keep these creatures as healthy and happy as possible on route to their terrifying new forever-homes.\nBesides, as the long lashes of the first two horses at last started to flutter shut in the emergency lighting, and as their legs pumped less furiously from side to side of Loading 3, Doc felt a twinge of new fear growing for the whole team. If the handler didn’t wake up, or if the horses’ impending bouts of colic didn’t respond easily to treatment, would their owners even pay to send another handler to finish the journey? And for all the upkeep in the interim?\nDoc didn’t mind taking a hit on clinic expenses—there were always ways to finesse station donors for cases like these—but the possibility of the legal owners sending along other instructions entirely gave Doc a pretty colicky feeling, too.\nOn the strength of that weakening gut, Doc pinged Jude to clear the rest of the day’s schedule, just in case everything would depend on the first few hours going well.\n“Sure thing,” said Jude, after a minute. “There’s only one meeting I can’t cancel.”\nAnd when he flashed Doc a file bearing an Usmic name, Doc agreed.\n“Right, of course. I guess I’ll take care of it between surgeries, if it comes to that.”\n“Surgeries plural? That bad?”\nDoc hesitated. The last of the horses was falling slack now, and with the handler off to citizen-care, Rodriguez and his crew stood at the ready to prep this lot for transfer, too. Doc couldn’t tell which had been more unnerving—to see the four pumping and whinnying at full intensity, or this spectacle of slumped silhouettes, drifting together in the flickering dark.\n“We’ll see,” said Doc, eventually. Even on Earth, their species often proved as delicate as it was powerful—but one could doubtless say the same about them all.\n5\nAs soon as the horses were secured in-lab and prepped for diagnostic tests that Jude could run on his own, Doc left for the arboretum, tossing Jude a salute at the door that the young man did not seem to notice, bent to his heavy workload so he could still get out in time. Doc tried not to let the lack of response dampen an already fraught mood, but it wasn’t easy. The day had been long and stressful, citizen-care still had no word on the handler’s condition, and this was a poor time of day to be meeting with anyone in the station’s nature preserve on the Ring, because most residents took their companions for walks at this hour among the foliage—and not all of those companions played well with each other when they met.\nSome might even say that the Usmic was tempting fate, or itching for a fight, by bringing their Murr to the arboretum at this hour every day, but Doc was inclined to chalk up the choice more to guileless overconfidence on the part of this single, immense nerve cell that towered—or rather, wobbled—more than half a meter over the humans on board, and had such a substantial deep-space fleet to back its every movement through the sector.\n“If we truly have the respect of your peoples,” Esmin of Usm had told Doc once, “then there will be no trouble for our sacred ones among your own, yes?”\nUsmics communicated through fluctuations along their outer, mustard-yellow sponginess. Those who had spent even a little time on Aleph Station proved particularly capable at replicating humanity’s text-based languages, so that Chinese, Hindi, Russian, Arabic, Braille, and Roman lettering rose and receded like a palimpsest of ticker tape across whatever section was facing their conversational partner at the time. The one downside to this feat was that Doc—and Cap, and even diplomats expressly trained for Earth-Usm relations—often had a devil of a time getting a lock on any given Usmic’s intended tone.\nStill, context suggested that Esmin had been quite serious that day with Doc, because in follow-up questions it became clear that the Usmic could not fathom why any of humanity’s own “sacred ones,” however well- or poorly trained they had been as pups, might sometimes be out of alignment with the wishes and “intentional energies” of their caregivers. So long as the human guardians were righteous in their thoughts, surely none of their furry friends would dare to urinate on a Murr, or mistake it for something to be collected in a game of fetch?\nMurr, after all, were commonly described back on Earth as “sentient hemp,” with their Usmic name coming from the sound that their fast-growing branches made during the part of their life cycle that humans most enjoyed. A Murr in its earliest phases was endlessly malleable and eager to please and could be coaxed into growing into the most striking patterns that would then be set for life. For southern-continent Usmics, the act of cultivating a Murr into its healthiest possible formation was a great honor and responsibility—and the stigma for failure, too great to be discussed. For humans, though . . . Suffice it to say, the novelty of such a species had spurred innovation in different, often difficult directions, not least of which included the concocting of wild excuses, if ever an Usmic chanced upon an older Murr in human care and asked why it looked so unlike those raised according to southern-Usm traditions.\nFortunately, so far the Usmics had accepted every half-assed explanation given.\nBut how could a prematurely dead or abandoned “sacred one” be explained away, if an Usmic diplomat asked for a report on how its kindred species was doing in human hands?\n“Thank you for your time, Esmin. And, ah—?”\nEsmin’s spongy mass displayed a southern-continent Usmic icon, two overlapping circles with a dot over and below the intersection, for the name of the young Murr that stirred contentedly on the grass beside them. This “sacred one” had a rustling crown of bright-leafed branches set around a sturdy, soil-brown trunk, and a hefty seat of prehensile roots that it used to move, to feed, and at this moment to flick insects trying to climb its bark. Esmin flashed the English version next: “Barin,” a popular Usmic word for near-but-not-quite dualities, with spiritual allusions that many human vendors translated poorly on Earthside alien merchandise.\n“Barin,” said Doc, crouching to nuzzle a root in greeting. “Barin’s looking healthy.”\nEsmin’s yellowness deepened with pride. “Fresh foliage this cycle. Gleaming well.”\n“Apparently. That’s what I was hoping to discuss with you, actually. Thank you so much for taking the time between trade meetings. I just feel like I don’t have enough information on file to tend to these fellows correctly if they sicken here, now that so many humans have taken an interest in their care.”\n“S I C K E N ?”\nThe word stretched across Esmin’s surface with a wide kerning between letters that the xeno-linguists claimed suggested an Usmic’s incredulity.\n“Well,” said Doc, hastily. “I mean—if there are some cycles with fresh foliage, then there must be some cycles with, you know, un-fresh foliage, am I right?”\nEsmin considered.\n“Sacred ones sicken with the unrighteous. Are the humans now . . . unrighteous?”\nOh boy.\nWith a baleful look at the now happily “murring” Murr, half its roots thumping gently on the grass, and then back at Esmin, a quivering immensity it was easy to imagine rolling right over a human in a fit of ire, Doc tried to remember that this Usmic was no different than any other overprotective fur-, fin-, feather-, or scale-parent who sometimes answered even basic questions about their “babies” aggro-defensively from the other side of the examination table.\nThis was just a “branch”-parent whose appeasement came with a lot more on the line.\nDoc smiled broadly in reply—and wondered, in the process, how well most Usmics could read tone from human speech. “Apologies, Esmin. I misspoke. What I meant is, how do you do it? What’s your secret? Barin’s foliage is quite spectacular, possibly the best I’ve seen on the station, so I knew I had to come to you. Is it diet, exercise, a special grooming regimen?”\nEsmin’s yellowness positively glowed. That radiance didn’t make it easy to read the rapid-fire text then pulsing along the Usmic’s surface in answer to this flattery, but Doc knew better than to complain. A win was a win was a win—even if Doc would have to spend a whole lot more time reverse-engineering what could go wrong for the Murrs, from Esmin’s elaborate descriptions of how to make sure that everything, instead, went absolutely right.\nBut after Esmin and Barin had rolled and rustled on to find their evening sustenance, Doc felt no great compulsion to leap immediately into that work, or even to return to the lab right away, and so the exhausted vet lingered on a nearby bench in the artificial glint of late-afternoon Sol-toned light. “People watching,” ostensibly—and also, to keep a finger on the pulse of things, waiting to see if even a single other Murr would show up in the human throng.\nThe only other citizen-species in attendance was Hurvian: a pair of the tall reptiles conversing in hushed tones, their iridescent-green hoods peeking out from behind a line of fruit trees. The rest of the visitors were Terran by origin or ancestry: human couples, solos, families with children. Rare was the human without at least one nonhuman companion; rarer still was the one among them whom Doc didn’t know to have something in a terrarium or aquarium back home, or a cat simply disinclined to partake in the public fray. There, to the left, were the nine-year-old twins with Iggy, their contentedly leashed iguana; in the distance, Mort the crow kept the chief composter company (not that he needed it, with his whole menagerie of rescues from the station’s variously departed); and dead-center in the path, Ms. Wilson and Zeddi were interacting with two dozen other humans attending to dogs all their own.\nIt was hard to imagine, surveying this adoring crowd, that anyone would abandon a dear companion, or else neglect it to the point where death would become an act of mercy. But for all the species’ grand declarations about other animals’ “love unflinching,” as a dusty, old Earth poet had once put it, Doc had seen too much of humanity’s fickle share of the same. Cousin Mel still thought himself a good person, after all—a person who had simply made the only reasonable choice he could in the depths of outer space—and for that matter, the clinic had sent its fair share of edge cases into that “better rest” as well.\nDoc waited until the arboretum dimmed to resemble twilight, and most of the evening circus had moved on. The latecomer appeared just as Doc was making to stand, but he entered with a full-grown Murr in tow, toddling on ever-sensing roots across the pungent grasses.\nDoc froze as it came closer, under lamplights winking on one by one in the dark.\nOh, thought Doc. Oh, no.\n6\nJude shot Doc a puzzled frown upon the latter’s eventual, all-too-quiet return. Even wizened old Skeeter, half-drowsing on the reception desk, looked up with concern when Doc forgot to issue the standard, salutary scratch on his rump while coming past.\n“Hey, Doc, your face is as long as our patients’. What’s up? Binky’s memorial service isn’t until tomorrow, you know.”\n“Hm? Oh. Right, no—no, this isn’t about that. Although, the security report, did it . . . ?”\nThe young man shook his head. “Mx. Meru’s been cleared of negligence charges, at least by legal reckoning of these things. Records shows that Binky blocked the air vent himself, by accident with his blanket, and well, it’s not like you can explain to a dog that the CO2 will just pool around it while it sleeps, you know? Even in the clear, though, Mx. Meru’s still beside themself that they let the new boyfriend kick Binky out of the bedroom in the first place. They’d been planning to move out of zero-G months ago, but the price point, you know?”\nDoc knew, and sighed. Accidents happened, and there was no point throwing more recrimination into the mix. Mx. Meru would probably never forgive themself, on some level, for their eight-year-old companion’s death—and hopefully, to the benefit of heightened vigilance with whatever critter they adopted next. All the vet’s office could do was provide Binky with a loving send-off . . . and reissue advisory warnings, station-wide, about keeping the air well-circulated in any enclosed zero-G space where living beings slept.\n“And the horses?”\n“Good news there, Doc. Only one’s all twisted up. Prepping him for surgery now. I gave the other three the nano-cocktail—which should also report back to us soon how severely their biomes have been disrupted. Or not at all, ideally. But I figured I’d hold off on the fourth until post-op, so we don’t mess up its baselines during surgical intervention.”\n“The right call. I’ll scrub up, then, and—thanks, Jude.”\nJude squinted through his bangs. “You sure you’re all right?”\nDoc considered lying, and then considered that Jude was too smart to fall for it. An actor knew acting when they saw it, didn’t they?\n“Not really, no. Saw something troubling at the arboretum, but it’ll have to wait. Oh, and can you schedule Esmin and Barin for a checkup next week? And call the Cap: see if she has time for a debrief tomorrow morning?”\n“Will do. Hey—and boss? No worries, eh? We’ve got this.”\nDoc nodded, and clapped Jude on the shoulder, but even while scrubbing in to help the colt lying in wait, the image of that second Murr in the arboretum was hard to shake—and with it, the fear that the station’s veterinary clinic really didn’t have a handle on this at all.\nIt had been years since Doc last performed surgery on a patient of this size, but the exploratory part had already been dealt with through 3D-imaging, which had identified the problem as part of the intestine folding inward, and not any of the more vicious bowel torsions with higher mortality rates. Plus, there was a holo-guide to illustrate optimal maneuvers while manipulating the colt’s insides—or rather, a standardized surgical manual with high-level AI processing, into which Jude had fed specific information about this one horse’s anatomy and biochemistry, so that the system could note any critical variabilities in, say, its vascular systems or connective tissues, and offer work-arounds on the go. All of this made the operation fairly simple, all things considered—and especially compared to the horror stories that Doc’s teachers had once waxed on about, from the early days of deep-space medical care. The blood-pooling in zero-G alone back then . . . But no: now, the only real danger was irritation from the fact of surgery itself, which could lead to a sticky and inflamed outer-intestinal surface susceptible to post-op infection. There, too, though, the subsequent nano-cocktail would hopefully identify any dangerous bacterial formations in time for successful intervention.\nIf anything, then, Doc’s own innards became the stuff of greater contemplation, while the seasoned station vet gently freed the colt’s tract from itself. Both Jude and Doc’s doctor had noticed Doc’s deteriorating appetite in recent months, and everyone knew that digestive uptake and gastric motility were already negatively impacted in low- to zero-G—but so what? Some days the fight to keep anything alive in these vast and distant tin-can universes verged on absurdity. A case of the “hollows,” some called it—and one of the few ailments that other Terran species didn’t seem to share with humans in deep space. Lucky sods. But if the body was tired, Doc reasoned, let it be tired. Let it diffuse itself until it was as empty as the vacuum between star-stuff. Let Jude’s generation, and the next, try to keep meaning intact for them all.\nWith a monitoring system on the lookout for trapped fluids, surgery was made even easier by the low-G environment, which gave Doc plenty of leisure to part and manipulate key components before tucking everything back inside and closing up. In a few years, there would probably be a nano-fix for this sort of colic, too—or maybe gene therapy that could build a better upper-body wall and sturdier intestinal structures in the first place. The latter depended, though, on whether any of this would serve the owners; if these horses had a better chance of avoiding intestinal and colonic impaction, but only at cost to their agility in sport . . .\nThe image of the second Murr in the arboretum came to mind again: an image that Doc was still trying to process before putting it into words for the rest. For now, at least, its sheer existence seemed proof-positive that, with humans, it was always a matter of when, not if, they intervened; and almost always for self-interest. Even when selecting which other species they wanted to protect from human harm, the choice to care about one animal-outcome over countless others was itself a form of violence—however inevitable such violence might be, whenever dealing with individual consciousnesses struggling to do the best that they could.\n“Doc? Doc? You okay in there?”\nDoc heard Jude vaguely through the comms and blinked to attention in time to watch the auto-suture tool finish its work upon the operating table, and another station arm clean around the wound, and four station zoomers skip about to clear the air. Doc came up alongside the colt and swept its mane aside to study the long line of its neck. Blood pumped steadily, if slowly, through prominent veins under the skin of the massive three year old.\nThey were all so bloody young, though, weren’t they? Even the Hurv, with its initial temper tantrum over humanity’s failure to follow ancient rules, had revealed in that instant the frailty of individual life spans even when fortified by immense stores of collective wisdom. Not one among them was old enough to be immune to making basic interspecies mistakes.\n“Fine, Jude. We’re good here—you can call it a night.”\nNot that the young man would, of course, with dress rehearsal coming soon. But far be it from Doc to keep the animal in any of them from running its most instinctive course.\n7\n“What am I looking at?” said Cap, when Doc had her and Jude together for a debrief the next morning. Jude looked a touch haggard from theater work but kept his attention as much on the projection between them as possible. “A cartoon? Ad mascot?”\n“Not exactly,” said Doc. “That’s a Murr.”\nCap shot the station vet an even more bewildered look. “Murrs don’t have faces.”\n“Not traditionally, no.” Doc drifted into an open seat. “But then, dogs didn’t start out with all the features we find adorable, either. We bred them in certain ways, and it was in their interest to hang around long enough to be bred—at least, originally, before some breeding caused enough maladaptive traits that they needed our ongoing help to survive. Murrs aren’t much different, minus all the weaknesses bred in for looks and purity; they were also originally cultivated for the features that Usmics find most appealing in small animal companions. All those tendrils of root and branch give the impression of the Usmic spores, a life-stage they’re inclined to want to nurture to ensure maximum resilience when it’s eventually scattered.”\n“Except that Usmics never actually ‘scatter’ their Murrs,” said Cap.\n“No more than we expect cats and dogs to grow up and leave us to build homes of their own,” said Jude, clearing the grogginess out of his throat. “It’s just, like, an offshoot of reproductive behaviors that’ve served us—and the Usmics—pretty well, you know?”\n“But not the Hurv?”\n“The Hurv spend less time with their young,” said Doc. “That probably has something to do with their lack of animal companions. They don’t have the nurturers’ instinct.”\nCap snorted. “Tell us something we don’t know.”\nJude nodded along, then added: “Well, except for their pack animals, which I hear they’ve got plenty of back on their home world. But even then, like, it doesn’t help with hard labor if your pack animal has all the features of a juvenile. And since they never needed to keep herds for protein and clothing, there wasn’t any reason to domesticate an ally for the flocks, right? Even a cat’s not much use if you’re planning on eating all the house-pests yourself.”\nCap processed this with a long slurp of coffee, and a hard look at the projection. “Meanwhile, an Usmic keeps its spore cluster close for years, if it wants to. Just like us with our kids. But then what happened here? Why would someone raise a Murr to look like that?”\nJude frowned, squinting at the projection. “Nah, they couldn’t have. I’ve seen different branch formations, but . . . look, the eyes, the tongue. That can’t be natural—can it?”\n“It’s not,” said Doc. “They weren’t raised this way. Someone on the station has been gene-splicing, to make them more like Terran companions. And that’s why there are no new requests coming in. Like you said, Cap—something shinier came along. So, now there’s a local underground for this subspecies. Humans prefer the familiar, after all: something they can bond with. And to hell with the consequences for the rest of us, when they do.”\nCap inhaled sharply. “Do the Usmics know about this yet?”\n“Not as far as I can tell, and I get the feeling we’d all be hearing from them if they did.”\n“True.” Cap leaned back, considering. “So, what do we do? Deny them licensing?”\n“That won’t fix the issue with the existing ones,” said Jude. “They’re here now either way, and it might even drive up black market demand if we tried to ban them. You know how some people want things even more when they’re not allowed them.”\n“Though for all we know,” the captain countered, “the Usmics might consider these mutations an abomination worthy of destruction, even for all their talk of ‘sacred ones.’ And then, well . . . that’s a solution, right? Just give them all back and let the Usmics sort it out?”\nDoc and Jude’s gazes met while glancing automatically at Cap’s desk rock, “Spot.” People without companions sometimes said careless things about them without realizing it—but also, if the matter ever did come to that, would Aleph Station even have the authority to give sanctuary to any sentient life-forms that the Usmics wanted killed? Would Earth authorities and local diplomats ever allow the clinic to shelter such a strange form of political stray?\nJude coughed and turned to Doc to change the subject.\n“You said ‘someone’ is doing this—but you know who, right?”\n“I do. Mateas Brimli, Core Bioengineer with a passion for histories of human-hybrid experimentation: the good, the bad, and especially the grotesque. But the name matters less than what we’re going to do now, doesn’t it? Because if it wasn’t going to be him, it would’ve been someone else, eventually, now that we’ve got all these research partnerships with other citizen-species, including at least a dozen with less cultural sensitivity about the ethics of genetic modification. We apparently already have six of these new Murrs in Aleph Station, with more deliveries in progress, but, oh, Jude—you should have seen the look on this guy’s face, when I asked about it. He’d been given strict instructions not to bring the Murr out until they’d finished monitoring for serious defects, but, as you said . . . we know how people are.”\nJude squeezed the bridge of his nose, as if to tamp down the exhaustion.\n“Would that we didn’t.”\nDoc nodded. “And so, he thought he’d been so clever, coming as late as he did to the park, long after the usual hour when Esmin famously drops by with a Murr of its own. It was supposed to be a subtle boast to those in the know; a way of establishing himself as an early adopter of a next-gen status symbol, so that he could later bask in the prestige of it all.”\n“Just the prestige, of course.” Jude rolled his eyes. “And never the responsibility.”\n“But of course.”\nCap shook her head. “I’m surprised he told you anything, Doc.”\n“That’s just it—he and all the rest in the test-group are bursting with pride about their modded Murrs. Their overconfidence is staggering. They truly think that if they just roll out their new companions slowly enough no one will have any reason to be upset. The new Murrs will be so fully normalized before the Usmics catch on, that any attempt at raising hell will seem outdated before it even gets off the ground. ‘Better to ask forgiveness’ at its finest.”\n“And no one thinks that these modded creatures are . . . kind of ugly?” Cap squinted at the projected, puppyish face grafted into the top half of the Murr. “I kinda prefer the original, myself. They’re like overactive bonsai, you know?”\nDoc shrugged. “No accounting for taste—although, I expect that there will also be a few grandstanding human purists who enjoy their Murrs as-is, too, and who might make things worse for the diplomats by raising the alarm early, trying to rouse the Usmics into an even greater fury when it all comes out. And less for the benefit of the Murrs, of course, so much as to ingratiate themselves into a superior moral position—as if that moral position would mean a damned thing the moment Usm declared war on Earth and all its outposts.”\n“Oh, yeah, that sounds about human.” Cap started kneading her temples. “Well, I’ll talk to the diplomats, try to prepare them for any impending fallout, and we’ll see what we can get out of Mateas, too, but . . . I’m guessing it’s too much to ask for an upside? Anything the negotiations team could spin as a positive, if it came to that? When it comes to that?”\nJude and Doc considered. Jude, in the end, took initiative:\n“Maybe they’ve been modded to . . . shed a lot less?”\nA slow, wavering nod from Cap and then Doc said that this would just have to do.\n8\nThe handler was waiting in reception when Doc and Jude returned. Only a concussion-monitoring patch on one temple hinted at her brush with serious injury. Skeeter, from his tethered perch on the counter, was yowling at her in his usual, cantankerous way—and not really in pain, or need, but choosing to share a litany of feline grievances with the “lucky” clinic visitor all the same. Possibly this was the closest he could come to saying, “Sorry, all our staff are currently indisposed, but if you’d like to wait, I’ll let them know you’ve arrived”; and if that was the case, then Doc would definitely have to see about giving the old grouch a raise.\nFor now, though, Doc smiled and shook hands with the arrival—Yara Dagny, from the tag on her bag—before waving her through.\n“How are you feeling, Ms. Dagny? I’m so glad you’re up and about again. The horses missed you, of that I’m absolutely certain.”\n“Yara—please. And thank you. Internal bleeding in zero-G’s no joke, but you’ve got some excellent doctors here, and even better diagnostic equipment. They caught irregularities elsewhere in my system, too. Pretty sure I’m leaving in even better health than when I arrived.”\n“Well, that’s good to hear. And—‘leaving’? So, the flight’s been rescheduled, everything’s more or less ready to go?”\n“That depends on my girls and their boy.” Yara hesitated. “And thank you, Doc, for taking such good care of them. I’ve known transfer points that would never have leaped to preventative surgery without express authorization, even with something as serious as this.”\nDoc cut a hand through the air between them. “Nonsense. We vets have a code, too.”\nBut Yara’s answering smile—more of a tight-lipped grimace—as good as said agree to disagree. And, considering her industry’s horror stories, probably for good reason.\n“Anyway—” said Doc, “Yes, the mares are doing fine, their readings are all good, with minimal biomic disruption after all; and the colt should be ready to join them tomorrow.”\n“Good,” said Yara. “You have no idea how pleased their new owner will be. He’s getting on in years—one of the first to live on an extra-solar colony, half of which he owns, and after a lifetime’s work getting the whole thing up and running, he’s grown a bit senile: lost in nostalgia, always talking about the ranch from his childhood. Reconnecting him with the descendants of that childhood herd was the least his grandchildren could do, so they’ve been keen to have the team arrive in time for his ninetieth Sol.”\nNow, though, it was Doc’s turn to plaster on a less-than-full-story smile. The grandkids could always have created a VR ranch—excellent verisimilitude these days—instead of shipping out four living, breathing Terran animals to a completely new environment, at great and confusing cost to their health along the way, just to appease one rich human’s longing for yesteryear. But Doc knew better than to say as much. What good would it do them now?\n“I’m just glad that everyone got through the incident in one piece—or, as you say, maybe even turned out all the better.”\nThe right answer, considering the circumstances: Yara’s smile warmed, and the pair turned their attention to discharge forms, follow-up prescriptions, and the matter of payment. Once the clinic’s account confirmed receipt of the indemnity funds, Doc also felt a whole lot wobblier about where Yara’s complicity ended and the clinic’s own began. But what else could have been done? Where in the galaxy were noncitizen-species safe from human whims?\n“Time for that Congress of Familiars?” Jude offered, once Yara had left to make final flight arrangements, and after catching the look on Doc’s face while reviewing the transfer.\n“Can’t come fast enough,” Doc agreed.\nBinky’s send-off was a generous and well-attended affair in the arboretum. While the chief composter oversaw the internment of Binky’s flash-frozen and pulverized remains into a soil mixture that would make it suitable for new plant-life in a month, humans who had been close to the sleek, sharp-eared, black-and-tan xolo-whippet mix took turns sharing a few endearing stories at the podium. The sudden, tragic loss of a “good boy” on Aleph Station was enough of a to-do that many of the other fur-parents had shown up expressly to turn it into a celebration of life, with games and treats and video shoots involving the rest of the nonhumans, and a screening of the derivative but thematically “safe” The Congress of Familiars IX: Marlee’s Bestest Interstellar Walk for the children.\nMx. Meru’s boyfriend was not in attendance—possibly not even in the picture anymore—but the grieving guardian still always had someone at their side, even if this meant spending most of the service patiently listening to and declining offers of fosters in need. With one persistently tedious petitioner, Mx. Meru seemed grateful when Doc intervened to inquire about the other guest’s upcoming clinic appointments—because, as Doc suggested when the browbeater then hit a hasty, flummoxed retreat, there really was nothing like a little reverse-pressure to thin a flock of scavengers, was there? Mx. Meru cracked a faint smile at this last, while Doc tried not to feel bad for having spoken ill of a whole class of essential animal. Buzzards in particular were creatures who had learned not just how to stomach but also to thrive on the hardest facts of existence, turning those facts into something that others could build beauty from again. How could Doc not admire any living beings capable of such a feat?\nJude, meanwhile, had slipped at some point from distributing care tips and wellness kits for all sorts of noncitizen-species onboard, to promoting his upcoming show in the Core. This “slip” wasn’t entirely his fault, though, gauche as that opportunism would have been. Plenty of attendees were simply as curious about production details surrounding Hello World Goodbye as they were about the best way to deck out a travel carrier for optimal comfort in zero-G, and the relative value of the latest newfangled latrine-mods when potty-training their cats. Every time Doc came past, then, the young man was fielding questions like how it felt to move through zero-G like a dolphin or gorilla, or explaining for the umpteenth time that the troupe wasn’t offering discounts for nonhuman Terrans because the whole point of the show was to fundraise for the rehabilitation center whose patients—the first nonhuman intelligences sent to interact with equivalent nondominant alien species—had inspired the script in the first place. It was a wonder that Jude had the energy for it all. Doc felt exhausted, just listening in.\nDoc also considered saving Jude, too, from one particularly vexing attendee, the type blissfully unaware that he was trying to explain (badly) basic concepts about deep-space animal outcomes to a fully trained assistant vet; but then, Doc noticed a more pressing arrival at the edge of all these proceedings: the very subject of the morning’s briefing with Cap and Jude. Mateas Brimli himself. It wasn’t surprising that he would be here, really; the station’s long-term complement was by no means infinite, and anyone with a vested interest in nonhuman animal companions tended to pay attention to related events. But Doc still found the gears turning: Confront him? Chat him up? Try to reason with him? But if so, to what end?\nNo, there seemed little point to lecturing the barn-keeper once the horses had fled—and quite a bit to risk, Doc reasoned, if Mateas were the sort to take even the mere existence of dissent as a reason to deepen his original convictions. And yet, even as Doc came to this conclusion, Mateas had decided the matter for them: setting eyes on the vet and advancing.\nNever a dull moment, thought Doc. With no small reluctance, the station vet handed off the fluffy, golden pup who had been enjoying a snooze and lazy head massage in the crook of an arm held well above the rest of the inquisitive pack—and braced for bristlier contact with one of humanity’s far wilder own.\n9\n“Nature fetishism strikes again, am I right?” said Mateas, the moment he and Doc had removed themselves from the rest of the boisterous throng, to walk in the dappled shade of the arboretum’s fruit trees. “All these freaks thinking there’s something so high and mighty about letting it all take its gradual course, and all of them right there with a boot to your head the moment you start to dream big without doing anyone any harm. Any harm at all!”\nThere, in this word salad of internal thought given messy outward form, was that “pull” again, that trick of a false force it was so easy to believe was guiding anything. But Doc knew better than to fall for any of these loaded and obscure references, all these baited lures embedded with intricate and ultimately meaningless red herrings in one isolated, agitated mind.\n“I take it you’ve heard from Captain Rui,” said Doc slowly instead.\n“Yes, yes, Captain Rui, that prick Mika on the trade forum, my supervisor—all of them! And for what? Captain Rui says your office flagged something on shipment manifests. Next thing I know everyone’s telling me I’m going to bring down civilization? Ha! I wish.”\nDoc suppressed a flicker of annoyance that the clinic had been named directly in this. It wasn’t ideal, but it also made sense that the command staff and diplomatic team would have tried to benefit from throwing around a bit of medical authority when asking Mateas . . . what, exactly? Or had they simply gone to him to vent over what his actions could cost them all?\n“I can’t speak to your conversation with the others,” said Doc. “But I do know that it would help tremendously with damage control if we had some sense of how your test subjects are doing, so we can anticipate how the Usmics might respond once they find out that we’ve been, well, as they put it, ‘unrighteous’ guardians of their ‘sacred ones.’”\nMateas laughed bitterly. “‘Unrighteous!’ Us? Unbelievable. So high and mighty.”\nDoc halted in the shade of a citrus tree. “Mr. Brimli, we’re not on opposite sides.”\n“No? Sure as hell could’ve fooled me.”\nFor a split-second then, Doc imagined a different career path, a critical moment back at the academy when someone had asked: Why study nonhuman animals? Why not other humans, when there are so many on the stations and deep-space colonies who need our care?\nIt wasn’t that humanity’s companions didn’t experience anxiety, depression, or a whole host of neurodegenerative diseases, too. But there was something in the way that a species with humanity’s level of mytho-linguistic tradition meant that they could and did try to rationalizeits hurt, its selfishness, its anger, and its prejudice . . . It was how someone like Tina Wilson, generally a decent human being who contributed plenty to her communities, would have become defensive, even hostile, taking the whole matter far too personally, if Doc had simply tried to tell her that Zeddi’s alien costuming was inappropriate and potentially destructive to ongoing diplomatic efforts; or how Cousin Mel would have told Doc to “fuck right off” if Doc had so much as pointed out that the kitten could have been placed in the stasis pod with him, then re-homed on return to Earth instead. Doc had a case of the “hollows,” that was true, but this existential nuisance of a condition was just one of a whole, dizzying mess of behavioral complexes that the human-oriented physician had to grapple with, when simply trying to address a body of very real health concerns, and, well . . .\nOther animalities were often much easier, where all that chaos was concerned.\n“I hear you,” said Doc, after Mateas had taken a moment to exhale. “How are all the new Murrs doing, anyway? It’s a really ambitious experiment, from what they tell me. You must be exhausted from all the work it would take to pull off something that incredible.”\n“You have no idea,” said Mateas, heavily. He ran a hand through his hair while eyeing the station vet, as if waiting for the inevitable sign or sound of judgmental disagreement—but when it didn’t come, when all Doc did was wait patiently for him to continue, the bioengineer at last relented, at least a touch. “Well, okay, maybe a bit. But I swear, Doc, I did all my initial testing on micro-samples. I screened for all the major potential splicing issues long before I started in on full-scale test subjects. And even those ones, I put on ice the moment in their developmental cycle that something seemed to be going wrong. No suffering, right? And no death, no slaughtering of anyone’s ‘sacred ones.’ They’re all still there, waiting to be treated once the process is refined. I’m not a fool, okay? I know what I’m doing.”\nDoc nodded. Believing Mateas was not important here; calming the agitated animal in him was—at least, long enough to gather the necessary intel. “Understood. The only trouble is, we didn’t know that, and how could we? We only just realized what was going on when the general population’s habits started changing. And you know how thoughtless a crowd can be.”\nMateas grunted at this last and relaxed further. Shifting the blame to “the masses” and their foolish beliefs was an easy bit of flattery to pull off. Who didn’t want to think themselves above the madding crowd? Jude, Doc—even Cap, for all her elaborate maintenance of her person and her living spaces: none of them quite escaped the allure of thinking themselves the “highest” intellects of all; and in this way, made themselves even more prone to fits of dangerous overconfidence in whatever belief or whim at any given moment struck their fancy.\n“One way or another,” said Doc, as casually as possible, “we all knew this kind of work was bound to happen eventually. I mean, the way all our research was going with the outer species, am I right? And so, now we just need to figure out how to help with what you were already trying to do—to roll out these new Murrs in the least harmful way possible. To anyone. To their human companions. To you. To the new Murrs themselves.”\n“Nurrs,” said Mateas, after a pause.\n“Hm?”\n“We’re calling them ‘Nurrs.’ Part of the plan is to argue that they’re not really Murrs anymore, so that it doesn’t matter if they don’t look like they’re supposed to. Usmics love their categories, right? So, we figure this has a decent shot of fixing everything without any fuss.”\nDoc kept a straight face. That myth about the Usmics, often reinforced in mainstream media by caricatures of the southern-Usmics’ elevated language of dualities, was pervasive even on Aleph Station. It wasn’t surprising that this bioengineer would have thought it true, too: that the whole of the Usmic species, with its wide-ranging continental heritages and languages, could be reduced to a singular people fixated on surface-labels. But there was something heartening, at least, in the fact that Mateas had tried to weed out disasters and find fixes for the issue at all. This meant that, on some level, he did see a potential problem here, same as them.\nNow came the tricky part: trying to get the bioengineer’s full participation and data set, so that together they could work out a better response to the coming storm.\nGive me an egg-bound cockatiel or shattered ant farm over this nonsense any day, thought Doc—but for now, there was only this far messier and more delicate recovery work.\nAs Binky’s celebration of life was winding down, Jude caught up with Doc at Red Shaft, where a lift carried people to and from the Ring into the Core: gravity receding as they rose inward, even if other kinds of heaviness ever-lingered in the heart. Doc knew that Aleph Station looked different to Jude, on account of their respective eras on it. Where Doc still saw echoes of past military infrastructure, from the early, skittish days of even Earth’s most optimistic pursuit of trade relations with far-flung worlds, Jude would only have known station features by their more recent functions: supply depots for free medicines, collaborative makerspaces, storage facilities, and stasis pods.\nWould Usmic response to the modified Murrs bring about those skittish days again? Could one spacefaring species really go to war over something as seemingly innocuous as the care and maintenance of their animal companions in alien hands?\nWell, but also . . . hadn’t plenty of Earth’s local wars been fought over far less?\nJude whistled appreciatively in transit, as Doc relayed everything that Mateas had disclosed in their conversation—the extent of preliminary trials, the state and location of all frozen missteps, the real number and locations of existing “Nurrs” in station quarters, how many others were on their way, how follow-up tests were proceeding, and how many people had access to the protocols that the engineer had perfected to this point at all.\n“Damn, boss, when you’re good, you’re good.”\nDoc notched a brow in amusement. “And when I’m not good?”\nJude shrugged. “Well, duh, Doc. Then we’re screwed.”\n“Hm. I’ll keep that in mind.”\n“But, so, what now? Like, Captain Rui and the diplomats went right for him after our meeting, yeah? And then he went looking for you right away and spilled everything, and still, the problem remains the same, right? This is going to bust open wide no matter what.”\n“Maybe,” Doc agreed. And yet, hearing Jude summarize the afternoon gave Doc a thought: Perhaps Cap hadn’t name-dropped the clinic just to add a kernel of authority to her own. Perhaps she’d scattered the bread crumb trail on purpose. After all, just as many humans sought out elusive or trending species for prestige, so too did many with highly active minds long to be acknowledged, eager to capture the acclaim, admiration, and envy of their peers. Had Cap and the diplomats possibly been banking on this bioengineer itching to explain his genius to whomever had the best credentials for understanding and celebrating his work?\nDoc couldn’t help but smile slowly at the diversionary tactic. Usmic dualities were certainly infectious, weren’t they? But binary thinking rarely got any of them anywhere.\n“Jude,” said Doc, once the lift had settled at med-sector—Doc’s stop, but not the actor’s, not on dress rehearsal day—“Save me a seat. I’ve got one more errand to run.”\n“Just one?”\nFrom anyone else, this would have seemed sarcastic, but Jude knew the vet life well.\n“Just one,” Doc agreed. “At least—for now.”\n10\nAround the veterinary clinic were a host of other medical services, the majority for citizen-species but a few dedicated to mixed-use equipment and research labs. Human doctors, scientists, and technicians were joined here by professionals from a host of other species, including ones where medical care was less a profession and more a sacred calling. And so long as there were Hurv in talks on Aleph Station . . . there was aid for them here, too.\nDoc hesitated by the front entrance to their rather stark facility, which was divided into minimalist hot, cold, and wet sectors behind a straightforward reception booth where a single Hurv reposed, large eyes drooping beneath its iridescent green hood. The thought of a Hurvian version of Jude amused just long enough for Doc to strike up the courage to knock and then enter. Fear of starting a diplomatic incident? Perhaps. But perhaps also simple discomfort in the presence of something that had made humanity feel so small for so long.\n“Ah, hello. Is—the doctor in?”\nThe Hurv eyed Doc slowly.\n“You require assistance? Information on the species you service?”\nDoc was both relieved to be recognized as another professional, and inclined to laugh at the Hurv’s assumption. But then, why else would a human come a-calling to such an old, indifferent species, if they weren’t seeking some sort of wisdom from it?\n“Thank you, no—not exactly. I wish to ask the plausibility of a favor.”\nThe Hurv’s left eye rolled to the side for a moment, as if in thought, and then the Hurv leaned in and activated an intercom.\n“There’s a noncitizen specialist to see you, Healer,” said the receptionist in emphatic English. “Human.” Then, in a Hurvian tongue, it added a few syllables that Doc could not so much as interpret as belonging to a single word or a full phrase. But Doc had some guesses: “Trouble,” maybe. Or “If you want, I can eat it or send it away.” The Hurv did have strikingly long, lipless mouths with sharp teeth, and it was hard to look elsewhere, in their presence.\nIn the ensuing pause, Doc had plenty of time to doubt the original plan entirely. Why hadn’t the vet simply gone straight to Cap, or the diplomats, with all that Mateas had revealed, and that Doc suspected might actually help them now? Hubris, obviously. Hubris, and that pesky case of the “hollows,” that yawning absence of meaning, aching to be filled.\nThe Healer did not answer on the intercom, but rather emerged glistening from the wet zone, and blinking rapidly to adjust its sight as the fog cleared. It towered over humans, too.\n“Yes? Human? Yes?”\nThe Healer fixed an impatient eye on Doc: the hallmark of a bureaucratic species that intentionally faced others with its least welcoming side showing. Maybe back on the Hurvian home world things were different. Possibly there were enclaves or whole cultures of dissidents who for millennia had resisted the tedious practicality of their peoples’ ancient ways, and advocated for free love and sang peacenik tunes in the shallows of their ancestral shores. But all the younger deep-space-faring species never got to see that side, if it existed. Never got to visit the Hurv’s home world. All of them knew the Hurv, instead, solely as The Ones Who Will Take Away All Your Toys If You’re Not Careful With How You Use Them.\nAnd yes, maybe that hadn’t stopped individual humans from testing the extent of Hurvian patience, baiting the ancient species in passive-aggressive and self-righteous ways despite the decade-long, species-wide cost the last time someone had transgressed—and even then, only in error! But . . . on the other hand . . . why would any ever expect a cautionary tale to work with perfect consistency? When had humanity ever claimed itself to be as universally righteous as, say, the Usmics of Usm’s southern continent?\nMoment of truth, thought Doc, before stepping into the moral muck with all the rest.\nMere hours on, Cap mag-locked beside Doc in the gallery overlooking the temporary theater-site, a zero-G expanse awash in faux underwater lighting, where Jude and the other “dolphins” were moving interpretively through their final test run: first, as a pod on Earth, in play and then mid-hunt; then, interacting with humans in a more confined setting, where they excelled at humanity’s strange new tactile games; next, as a pod divided, contained, sedated, and above all else confused; from there, turning into the components of a spaceship, dreaming whole-pod dreams of hurtling together toward the distant stars; and lastly, with a single dolphin—Jude—lost, alone in the vastness of night, calling uselessly about before moving symbolically, sacrificially, toward the light of an alien sun, and . . . weakening, then winking out.\n“Got your report on Mateas,” said Cap, when the troupe broke for intermission. “Lots of good, actionable intel. We should be able to monitor everything with these new Murrs carefully from here on out. And the diplomats are figuring out how to break the news as gently and soon as possible, so the Usmics can’t accuse us of trying to hide anything from them.”\n“Good, glad to help,” said Doc—not a little distantly, still studying the aquatic light patterns rippling silently across the stage.\n“Also, I got a call from the Hurvian ambassador . . . ”\n“Oh?”\n“But you wouldn’t know anything about that.”\nDoc side-eyed the station’s captain. “Sure you shouldn’t have your zoomers with you, Cap, before you get your hands dirty asking a question like that?”\n“Oh, but there isn’t a zoomer big or strong enough to clean some of the shit we get into, is there, Doc?”\n“Now who’s finally offering up their trademark optimism?”\nCap winked. “It was a good call, in any case. Very productive. The ambassador wanted me to know that, for the sake of station security and the prevention of further breakdowns in sector order, they’ll widely disseminate an offer to take these new Murrs into their own protective custody, if the Usmics have a negative reaction upon hearing about their existence.”\n“Well, now. Isn’t that awfully generous of them.”\n“Isn’t it, though.” Cap eyed Doc suspiciously. “And I suspect they’re only offering this because they know that they won’t actually have to deal with the new Murrs if it comes to that. The moment the southern-continent Usmics realize they have a choice between letting the humans keep them, or handing them over to a severe species that always gets its way, well . . . ”\n“Why, Cap,” said Doc, pleasantly. “Why the long face? And here I thought you’d be pleased to see a problem take care of itself.”\n“Uh huh. And—has it? Why would the Hurv help out? Are we really sure this’ll work?”\nDoc kissed teeth while watching the stage crew prepare for the dress rehearsal’s second half. “I ever tell you about my Aunt Luli?”\nCap shot Doc a withering look. “Are all your relatives anecdotes now?”\n“Aren’t everyone’s? Anyway, Aunt Luli—she never wanted an animal companion, or even much in the way of other people around. Bristly exterior, all cactus needle without the flower. Or so we thought, until one time, when I was a kid—a little kid, mind you, a real brat not minding my own business—I pointed at her chest in front of everyone and shouted, ‘it’s moving!’ Well, and so it was, because she’d apparently rescued a baby squirrel, and that little rotter ended up going with her wherever she went. Except, as it later turned out, it wasn’t exactly a clean rescue. Turned out, a neighbor had found the poor thing, but Aunt Luli hadn’t liked the way the neighbor was managing things, so, she took it upon herself to do better. And even though she could go on for days about how much of a burden the critter was . . . ”\n“Mm hm. She loved it just the same, right? But—the Hurv?”\nDoc cut the air lazily with a hand. A sound sequence signaled that the second half would be starting soon. “They didn’t have to leave instructions for us in the fabric of space, and they didn’t have to come running the moment we didn’t read them. But they did, because that’s the way their species shows care for its young: by leaving carefully curated guideposts and monitoring from afar. By stepping in only when necessary—but being at the ready, always, to help whenever needed. So, maybe they don’t have companions like we do—but still . . . ”\n“You’re saying we’re their pets?”\nDoc made a mental note to correct Cap’s term-use later. For now, the tired station vet simply hummed assent as the lights dimmed and Jude and the rest of the actors drifted into position. Tomorrow, before opening night, there would be a new hamster’s lodgings to review, a litter of puppies to fix, an elder cat to assess for gene therapy, a full schedule of “Nurr” checkups to arrange, and a ship to watch launch, if time allowed, with its team of horses headed frivolously for the distant stars. Were they missing anything? Always, in this line of work. Would Jude grind his teeth to dust over the coming trend cycles: all the petty, day-to-day provocations and predictable human grandstanding that stood to do great harm to citizen- and noncitizen-species alike? Probably.\nBut so and ever-spun the wheel that also kept them grounded, with all its superficial force-effects driven by a problem much older and more central to them all.\nNew ones would just have to wait for their own curtain call.\nCanadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "source": "https://clarkesworldmagazine.com/clark_10_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Love Unflinching, at Low- to Zero-G by M. L. Clark"}