{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "kPsrXfEF2MZ5SJ/acW9H0tOPfkE=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Staying Sensitive in the Crowd: A Conversation with Chen Qiufan  The first time I saw Chen Qiufan (a.k.a. Stanley Chan)1 was at Chicon 7 in 2012: in the middle of a hotel lobby filled with people dashing about, he stood still, a sturdy reef in a frenetic sea, observing the surrounding tumult calmly as though seeing patterns that no one else could see.  Standing out from the crowd is a recurring theme in Stan’s career and life. Though practically every Chinese writer lights up after a meal, he does not smoke. Though he graduated with a degree in Chinese literature and film studies from Peking University, he chose a career in the technology sector, first working for Google and then Baidu. Though he grew up in Shantou, a small city on the southern coast of China, he made his home thousands of miles away in the metropolis of Beijing, where his third language—Mandarin, after Teochew and Cantonese—is the language of daily life.  Being different has perhaps endowed Stan with an extra sensitivity to the hidden patterns of the world around him, allowing him to participate in the competitive grind of the high-tech world without being overwhelmed by it. Whether he’s in the company of fellow writers, fans, tech executives, or powerful producers, he charms everyone effortlessly. Elegant, urbane, and erudite, he enlivens the flow of conversation at gatherings with his acerbic wit and dark, playful banter, as unique as his fiction.  Widely acknowledged as the leading figure of China’s generation of SF writers born after 1980, Stan has won every genre literary award in China—often multiple times. Many of his stories tend to feature a cyberpunk aesthetic imbued with the anxieties of a globalized world seen through a Chinese perspective. He is also among the first of China’s SF writers to be translated abroad, having appeared in publications such as F&SF, Clarkesworld, Interzone, and Lightspeed, in many instances as the first Chinese writer to do so.   “Record of the Cave of Ningchuan” describes a hole in the ground that reveals the geometry of the universe. This is a SF story written in Classical Chinese, a feat that I analogize to a contemporary Anglophone writer composing a SF story in the language of Chaucer. Published when you were barely out of college, the story won Taiwan’s Dragon Fantasy Award. What gave you the idea to do such a thing? What were some particular challenges you faced and how did you overcome them?  From a young age, I’ve enjoyed classical Chinese literature of the supernatural, e.g., Liaozhai Zhiyi [“Strange Stories from a Chinese Studio”, 17th century], Soushenji [“In Search of the Supernatural”, 4th century], and Youyang Zazu [“Miscellaneous Morsels from Youyang”]. I immersed myself in an ancient world of magical realism where spirits and ghosts often took on human form and entered the lives of ordinary men and women, leading to fantastic stories.  As these tales were written in Classical Chinese, the compact, evocative phrases left many blanks for the reader’s limitless imagination to fill. Wouldn’t it be cool, I thought, to write a speculative tale in Classical Chinese in the age of the Internet?  Simultaneously, I also wanted to pay homage to Ted Chiang’s “Tower of Babylon” by describing within the story a world of endless recursion.  The biggest challenge was linguistic. If I limited myself strictly to proper Classical Chinese, the demands on the average reader would be too great, and many would not be able to read it. I ended up choosing a hybrid that mixed Classical Chinese with some elements from modern Chinese, which preserved the classical favor while remaining readable by most readers with standard high school Classical Chinese training.  Another challenge involved using a different POV in each section: one section was written as a witness’s testimony, another as an excerpt from official records of the county, and yet another as a transcript of a wandering storyteller’s performance. Advancing the narrative in each section with the appropriate POV was an interesting experiment. I really enjoyed the process.  You’re fluent in your native Shantou topolect (Teochew) as well as Cantonese, Mandarin, and English. The majority of your stories, however, have been written in Modern Standard Chinese (which is based on the Mandarin family of topolects). Have you thought about writing more stories in other languages such as Cantonese or Teochew? Why or why not?  Let me tell you an interesting anecdote. In 2012, Chutzpah! magazine invited me to contribute a story written in Teochew for their special topolect-focused issue, and I agreed. I came up with a story concept quickly, but once I started writing it, I discovered a big problem. If I wrote the whole story in proper Teochew, many words would have to be rendered using Chinese characters chosen solely for their phonetic rather than semantic values, or I would have to resort to using a phonetic alphabet. Teochew was so different from Mandarin that only readers fluent in Teochew would be able to understand it. I had no choice but to stick with the frame of Modern Standard Chinese and substitute in some Teochew words and slang phrases.  During the process of composition, I felt as if two voices were fighting within my head, each struggling to overcome the other. In the end, I had to give up. The frustrated Chutzpah! editor told me that multiple other invited authors had also given up.  I think the effort to spread the use of Modern Standard Mandarin in education is a double-edged sword. It certainly has benefits, but a growing number of young people now are losing the ability to converse effectively in their native topolect, which means that they’ve given up another way of seeing and thinking about the world. I feel really sorry for them.  A lot of your stories feature cutting-edge research in computer science, genetics, virtual reality, bioengineering, and other areas of rapid change. How do you keep up with developments in so many areas?  I subscribe to a lot of WeChat public accounts (think of them as RSS feeds) on science & technology such as the MIT Technology Review. Every day, they bombard me with news. If I find anything interesting, I will dig deeper with additional research and talk to some experts in specific areas. Also, I’ve worked in Internet companies like Google and Baidu for years, where employees get a lot of the latest technology and product information from daily work. The experience has been really helpful and inspiring.  How does your day job as a product marketing manager at Baidu impact your creative work? Inspiration? Impediment? Some of both?  Product marketing managers are like evangelists who bridge the gap between users and technologies. We have to find innovative ways to communicate with the masses. The very essence of marketing is to tell stories that resonate with people, to create new scenarios for how people could benefit from technology. I guess that’s quite similar with writing a SF/fantasy story.  But of course, there is always conflict, since I have only twenty-four hours in a day, and I need to work for eight hours and sleep for eight hours. How much energy is left for writing?  You’ve traveled and lived outside of China extensively. Tell us about how your global experience has influenced you creatively.  I love traveling! Seeing different views, eating exotic food, meeting interesting people. There is a theory of cognition that says that you have to stimulate your brain in some way to create new neural connections. There are always new inspirations and ideas popping out during a trip—even on the flight—and I will write them down in a little notebook and try to develop these ideas into stories.  Many of your stories, such as “The Fish of Lijiang” (Clarkesworld, August 2011), “The Year of the Rat” (F&SF, July/August 2013), and “The Mao Ghost” (Lightspeed, March 2014) tend to be read in the West as political metaphors about contemporary China. Can you comment on the extent, if any, your work “reflects” the realities in China today?  I’ve never tried to intentionally emphasize political metaphors in my work. I write about aspects of life in China I observe, feel, and experience—some of which are good and some of which are not so good. I’m often surprised by how critics can read deeper meaning into my stories that I didn’t think of. Readers, on the other hand, often give me feedback based on their feelings. For example, after “The Year of the Rat” was published, many college students posted on the Web saying that they considered this my best work to date because it resonated with them by expressing the helplessness and confusion concerning the future they felt.  I think one of the most important qualities in a writer is sensitivity: the ability to capture the strangeness in everyday life. This is especially important in contemporary China, where it’s easy to become lost in the kaleidoscope-like, constantly shifting bustle of life and lose this sensitivity.  Would you describe your work as “science fiction realism”? Are you hopeful or cynical about the future?  I would never try to put a specific label or category on my work. “Science fiction realism” is, in fact, a cagey, tactically useful phrase. It helps the media to interpret the message we’re trying to express. Compared to traditional “realism,” which seems ill-adapted or numb to a technology-infused life, “science fiction realism” is more critical of reality and more capable of revealing the complex relationship between technology and contemporary life as well as the transformation of individual and human nature and the consequences of such transformation.  This has been a constant theme I hope to reflect in my work. For example, in “Smog,” which I wrote in 2006, I extrapolated the possibility of Beijing suffering from even more extreme air pollution and the effects on people’s lives and psychology. However, I don’t want to be called a “science fiction realist writer.” All I want is to write good stories that move readers, regardless of whether they are “science fiction” or “realist.”  My attitude about the future has shifted in the last few years from a gloomy pessimism to a more active optimism. I believe that as technology advances, many problems will be solved even though more problems will appear and some problems may never have solutions. But I believe the overall trend is for humanity to become happier, wiser, and more tolerant. I hope I’m right.  You’re also a columnist for some of China’s top media outlets. Can you tell us about this work?  As science fiction receives more attention, media outlets need someone who knows science fiction well and is willing to share their thoughts. My articles are mostly related to big cultural events such as the release of Interstellar, the publication of the English edition of The Three Body Problem, and Chinese SF cons (the Yinhe and Xingyun Awards, for example).  Interestingly, I have to tailor my perspectives to fit with different papers—the New York Times (Chinese edition), for example, is considered “pro-West” in China while the Global Times is considered the opposite.  You are also doing some screenwriting now. Can you tell us more?  I’m working on a script adapted from my short story, “The Endless Farewell.” But it now feels like a completely different story. There is a huge gap between written fiction and film, and you need to change the way you think—like from text to image. Screenplays are also more structural, especially in genre films, for which there are principles and rules you have to obey.  The process is interesting at the very beginning, but after multiple revisions, you become numb and just want to be rid of the thing so that you can go back to writing your novel any damned way you want. But for a film, you have to listen to, debate, and sometimes fight against the producer, the director and anyone else relevant.  Your debut novel, The Waste Tide, has received critical plaudits and market success in China. Can you tell us about the novel and what’s happening with it?  The novel imagines a near future in the third decade of this century. On Silicon Isle, an island in southern China built on the foundation of e-waste recycling; pollution has made the place almost uninhabitable. A fierce struggle follows in which powerful native clans, migrant workers from other parts of China, and the elites representing international capitalism vie for dominance. Mimi, a young migrant worker and “waste girl,” turns into a posthuman after much suffering, and leads the oppressed migrant workers in rebellion.  A British film company has already reached out to purchase film rights, and the process is going smoothly. An English translation is also close to being complete. Hopefully it can be rolled out in US/UK markets soon.  What’s next for you? Any new projects you want to share with our readers?  The sequel of The Waste Tide is in the pipeline, and I’m still doing some research. The story will take place in a near-future Chinese city with more complex scenarios.  But before that, I’m working on a novella telling an alternative, psychedelic history in China, probably to be published in summer of 2015.  And I have a lot of short stories waiting to be finished on the list. How I wish I could have fourty-eight hours a day! But after all, telling a good story is what excites me the most in this world. Thanks!  Interviewer’s Note:  1 Chen Qiufan (pronounced close to “Chiufan”) is the author’s Chinese name rendered following the Chinese convention of giving surname first. The English name Stanley Chan is the author’s preferred name when introducing himself socially in the West, and the spelling of Chan reflects Cantonese phonetics. This interview was conducted in a mixture of Chinese and English.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "Interview\nStaying Sensitive in the Crowd: A Conversation with Chen Qiufan\nThe first time I saw Chen Qiufan (a.k.a. Stanley Chan)1 was at Chicon 7 in 2012: in the middle of a hotel lobby filled with people dashing about, he stood still, a sturdy reef in a frenetic sea, observing the surrounding tumult calmly as though seeing patterns that no one else could see.\nStanding out from the crowd is a recurring theme in Stan’s career and life. Though practically every Chinese writer lights up after a meal, he does not smoke. Though he graduated with a degree in Chinese literature and film studies from Peking University, he chose a career in the technology sector, first working for Google and then Baidu. Though he grew up in Shantou, a small city on the southern coast of China, he made his home thousands of miles away in the metropolis of Beijing, where his third language—Mandarin, after Teochew and Cantonese—is the language of daily life.\nBeing different has perhaps endowed Stan with an extra sensitivity to the hidden patterns of the world around him, allowing him to participate in the competitive grind of the high-tech world without being overwhelmed by it. Whether he’s in the company of fellow writers, fans, tech executives, or powerful producers, he charms everyone effortlessly. Elegant, urbane, and erudite, he enlivens the flow of conversation at gatherings with his acerbic wit and dark, playful banter, as unique as his fiction.\nWidely acknowledged as the leading figure of China’s generation of SF writers born after 1980, Stan has won every genre literary award in China—often multiple times. Many of his stories tend to feature a cyberpunk aesthetic imbued with the anxieties of a globalized world seen through a Chinese perspective. He is also among the first of China’s SF writers to be translated abroad, having appeared in publications such as F&SF, Clarkesworld, Interzone, and Lightspeed, in many instances as the first Chinese writer to do so.\n“Record of the Cave of Ningchuan” describes a hole in the ground that reveals the geometry of the universe. This is a SF story written in Classical Chinese, a feat that I analogize to a contemporary Anglophone writer composing a SF story in the language of Chaucer. Published when you were barely out of college, the story won Taiwan’s Dragon Fantasy Award. What gave you the idea to do such a thing? What were some particular challenges you faced and how did you overcome them?\nFrom a young age, I’ve enjoyed classical Chinese literature of the supernatural, e.g., Liaozhai Zhiyi [“Strange Stories from a Chinese Studio”, 17th century], Soushenji [“In Search of the Supernatural”, 4th century], and Youyang Zazu [“Miscellaneous Morsels from Youyang”]. I immersed myself in an ancient world of magical realism where spirits and ghosts often took on human form and entered the lives of ordinary men and women, leading to fantastic stories.\nAs these tales were written in Classical Chinese, the compact, evocative phrases left many blanks for the reader’s limitless imagination to fill. Wouldn’t it be cool, I thought, to write a speculative tale in Classical Chinese in the age of the Internet?\nSimultaneously, I also wanted to pay homage to Ted Chiang’s “Tower of Babylon” by describing within the story a world of endless recursion.\nThe biggest challenge was linguistic. If I limited myself strictly to proper Classical Chinese, the demands on the average reader would be too great, and many would not be able to read it. I ended up choosing a hybrid that mixed Classical Chinese with some elements from modern Chinese, which preserved the classical favor while remaining readable by most readers with standard high school Classical Chinese training.\nAnother challenge involved using a different POV in each section: one section was written as a witness’s testimony, another as an excerpt from official records of the county, and yet another as a transcript of a wandering storyteller’s performance. Advancing the narrative in each section with the appropriate POV was an interesting experiment. I really enjoyed the process.\nYou’re fluent in your native Shantou topolect (Teochew) as well as Cantonese, Mandarin, and English. The majority of your stories, however, have been written in Modern Standard Chinese (which is based on the Mandarin family of topolects). Have you thought about writing more stories in other languages such as Cantonese or Teochew? Why or why not?\nLet me tell you an interesting anecdote. In 2012, Chutzpah! magazine invited me to contribute a story written in Teochew for their special topolect-focused issue, and I agreed. I came up with a story concept quickly, but once I started writing it, I discovered a big problem. If I wrote the whole story in proper Teochew, many words would have to be rendered using Chinese characters chosen solely for their phonetic rather than semantic values, or I would have to resort to using a phonetic alphabet. Teochew was so different from Mandarin that only readers fluent in Teochew would be able to understand it. I had no choice but to stick with the frame of Modern Standard Chinese and substitute in some Teochew words and slang phrases.\nDuring the process of composition, I felt as if two voices were fighting within my head, each struggling to overcome the other. In the end, I had to give up. The frustrated Chutzpah! editor told me that multiple other invited authors had also given up.\nI think the effort to spread the use of Modern Standard Mandarin in education is a double-edged sword. It certainly has benefits, but a growing number of young people now are losing the ability to converse effectively in their native topolect, which means that they’ve given up another way of seeing and thinking about the world. I feel really sorry for them.\nA lot of your stories feature cutting-edge research in computer science, genetics, virtual reality, bioengineering, and other areas of rapid change. How do you keep up with developments in so many areas?\nI subscribe to a lot of WeChat public accounts (think of them as RSS feeds) on science & technology such as the MIT Technology Review. Every day, they bombard me with news. If I find anything interesting, I will dig deeper with additional research and talk to some experts in specific areas. Also, I’ve worked in Internet companies like Google and Baidu for years, where employees get a lot of the latest technology and product information from daily work. The experience has been really helpful and inspiring.\nHow does your day job as a product marketing manager at Baidu impact your creative work? Inspiration? Impediment? Some of both?\nProduct marketing managers are like evangelists who bridge the gap between users and technologies. We have to find innovative ways to communicate with the masses. The very essence of marketing is to tell stories that resonate with people, to create new scenarios for how people could benefit from technology. I guess that’s quite similar with writing a SF/fantasy story.\nBut of course, there is always conflict, since I have only twenty-four hours in a day, and I need to work for eight hours and sleep for eight hours. How much energy is left for writing?\nYou’ve traveled and lived outside of China extensively. Tell us about how your global experience has influenced you creatively.\nI love traveling! Seeing different views, eating exotic food, meeting interesting people. There is a theory of cognition that says that you have to stimulate your brain in some way to create new neural connections. There are always new inspirations and ideas popping out during a trip—even on the flight—and I will write them down in a little notebook and try to develop these ideas into stories.\nMany of your stories, such as “The Fish of Lijiang” (Clarkesworld, August 2011), “The Year of the Rat” (F&SF, July/August 2013), and “The Mao Ghost” (Lightspeed, March 2014) tend to be read in the West as political metaphors about contemporary China. Can you comment on the extent, if any, your work “reflects” the realities in China today?\nI’ve never tried to intentionally emphasize political metaphors in my work. I write about aspects of life in China I observe, feel, and experience—some of which are good and some of which are not so good. I’m often surprised by how critics can read deeper meaning into my stories that I didn’t think of. Readers, on the other hand, often give me feedback based on their feelings. For example, after “The Year of the Rat” was published, many college students posted on the Web saying that they considered this my best work to date because it resonated with them by expressing the helplessness and confusion concerning the future they felt.\nI think one of the most important qualities in a writer is sensitivity: the ability to capture the strangeness in everyday life. This is especially important in contemporary China, where it’s easy to become lost in the kaleidoscope-like, constantly shifting bustle of life and lose this sensitivity.\nWould you describe your work as “science fiction realism”? Are you hopeful or cynical about the future?\nI would never try to put a specific label or category on my work. “Science fiction realism” is, in fact, a cagey, tactically useful phrase. It helps the media to interpret the message we’re trying to express. Compared to traditional “realism,” which seems ill-adapted or numb to a technology-infused life, “science fiction realism” is more critical of reality and more capable of revealing the complex relationship between technology and contemporary life as well as the transformation of individual and human nature and the consequences of such transformation.\nThis has been a constant theme I hope to reflect in my work. For example, in “Smog,” which I wrote in 2006, I extrapolated the possibility of Beijing suffering from even more extreme air pollution and the effects on people’s lives and psychology. However, I don’t want to be called a “science fiction realist writer.” All I want is to write good stories that move readers, regardless of whether they are “science fiction” or “realist.”\nMy attitude about the future has shifted in the last few years from a gloomy pessimism to a more active optimism. I believe that as technology advances, many problems will be solved even though more problems will appear and some problems may never have solutions. But I believe the overall trend is for humanity to become happier, wiser, and more tolerant. I hope I’m right.\nYou’re also a columnist for some of China’s top media outlets. Can you tell us about this work?\nAs science fiction receives more attention, media outlets need someone who knows science fiction well and is willing to share their thoughts. My articles are mostly related to big cultural events such as the release of Interstellar, the publication of the English edition of The Three Body Problem, and Chinese SF cons (the Yinhe and Xingyun Awards, for example).\nInterestingly, I have to tailor my perspectives to fit with different papers—the New York Times (Chinese edition), for example, is considered “pro-West” in China while the Global Times is considered the opposite.\nYou are also doing some screenwriting now. Can you tell us more?\nI’m working on a script adapted from my short story, “The Endless Farewell.” But it now feels like a completely different story. There is a huge gap between written fiction and film, and you need to change the way you think—like from text to image. Screenplays are also more structural, especially in genre films, for which there are principles and rules you have to obey.\nThe process is interesting at the very beginning, but after multiple revisions, you become numb and just want to be rid of the thing so that you can go back to writing your novel any damned way you want. But for a film, you have to listen to, debate, and sometimes fight against the producer, the director and anyone else relevant.\nYour debut novel, The Waste Tide, has received critical plaudits and market success in China. Can you tell us about the novel and what’s happening with it?\nThe novel imagines a near future in the third decade of this century. On Silicon Isle, an island in southern China built on the foundation of e-waste recycling; pollution has made the place almost uninhabitable. A fierce struggle follows in which powerful native clans, migrant workers from other parts of China, and the elites representing international capitalism vie for dominance. Mimi, a young migrant worker and “waste girl,” turns into a posthuman after much suffering, and leads the oppressed migrant workers in rebellion.\nA British film company has already reached out to purchase film rights, and the process is going smoothly. An English translation is also close to being complete. Hopefully it can be rolled out in US/UK markets soon.\nWhat’s next for you? Any new projects you want to share with our readers?\nThe sequel of The Waste Tide is in the pipeline, and I’m still doing some research. The story will take place in a near-future Chinese city with more complex scenarios.\nBut before that, I’m working on a novella telling an alternative, psychedelic history in China, probably to be published in summer of 2015.\nAnd I have a lot of short stories waiting to be finished on the list. How I wish I could have fourty-eight hours a day! But after all, telling a good story is what excites me the most in this world. Thanks!\nInterviewer’s Note:\n1 Chen Qiufan (pronounced close to “Chiufan”) is the author’s Chinese name rendered following the Chinese convention of giving surname first. The English name Stanley Chan is the author’s preferred name when introducing himself socially in the West, and the spelling of Chan reflects Cantonese phonetics. This interview was conducted in a mixture of Chinese and English.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/chen_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Staying Sensitive in the Crowd: A Conversation with Chen Qiufan by Ken Liu"}