{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arula Ratnakar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/C6eGTiNUYmZRy4pWL51ORtofPc=", "id": null, "license": null, "comments": "", "raw_text": "20800 words, novella  Submergence  2022 Finalist: Utopia Award for Best Utopian Novella  As the people began to die, desperation drove us to the depths of the sea for cures. We mined mineral-rich vents until the tube worms went extinct, stripped polymetallic nodule fields bare, squeezed sludge out of sea sponges to treat the new diseases, these monstrous incurable plagues, born from our new climate, that spread through our air. But the people still died. So we dug even deeper . . .  I look at the corpse lying in the clear preservation chamber next to me. Woman, late thirties, died about four weeks ago. Normally they would have examined her body, signed her death certificate, gotten everything back to her remaining family members (her aunt and her twelve-year-old daughter), and that would have been it. But she had those things in her brain. And she died a strange and sudden death. So here we are, tied up in this investigation. Not that I’m complaining though. No, I live for this shit.  “We’ve all had the procedure done, we’ve all been taking the pills for about a week now. Anything go wrong for either of you? Any side effects?” Marie continues reluctantly. “Nothing wrong on my end.”  Anthony, sitting to my left, looks absolutely elated. “I’ve vomited three times a day since Wednesday! Looks like I can’t do it.”  They both turn to me. Marie bites the side of her thumb. “Nithya?”  Hah. Marie is terrified right now. Is she really afraid that I’ll turn this down? That she’ll be the one to have lights pulsing through her brain every night for the next four months? This is the most interesting thing that has happened in my entire goddamn twenty-seven years of existence. Can’t believe they aren’t fighting me tooth and nail for the chance to do this. Ah well, can’t seem too enthusiastic about it. What if they change their minds?  I try to look downcast. “I’ll do it. I didn’t get any negative side effects. Truthfully I’m feeling better than ever.”  Marie is visibly relieved. “You’re sure about this Nithya?”  Hell fucking yes I’m sure! I nod.  Anthony chuckles nervously. “Well, then get ready to live a dead woman’s life.”  I stare at the reflection of my waist-length dark-brown hair in the bathroom mirror, razor in hand, trying to imagine myself with a shaved head. I think I’d look badass. They’re going to drill little circular tunnels into my skull, intended to be plugged into a set of tubes that will branch out microscopically throughout my brain and shine light pulses into key areas at the cellular level. They don’t want hair getting in the way of the procedure, and I certainly do not want that either.  As the chunks of hair fall to the floor, I think about the last time someone tried out this technology, in a very different context. I remember seeing it on the local news. It’s just optogenetics. An elderly woman got her neurons modified to contain activity-dependent genes for additional kinds of channel proteins, light-gated ion channels. Colorful light pulses could regulate membrane depolarization through these new light-gated ion channels and force the same neurons to fire that were firing during her experiences. She could “record” all her experiences and live them again later, as the wavelengths of light activating the channels would evolve and develop with time, along with the types of light-gated channel proteins being expressed or taken out of the cell membranes. Additional proteins expressed through the inserted gene sequence allowed the tubes to locate and target neurons in the correct firing sequence.  But the old woman’s goal wasn’t to relive the experiences herself. After the woman died, her daughter received a gift. A request to modify her own neurons to include the channel proteins, and permission to access a set of pills and light pulses that would, to the most accurate possible degree, play the elderly woman’s experiences into her daughter’s brain. The final years of that woman’s life, available for someone else to live themself! Eat, sleep, shit, laugh, cry as them . . . become them for a while. It’s the most intense form of memorial I’ve ever heard of.  Why didn’t the woman whose death we’re investigating—Noor—ever play back her experiences herself? Why just have the channel proteins? What was the point of modifying her neurons, if she was just going to live like she’d never gotten the procedure done anyway?  I look at my bald head in the mirror, satisfied with my work.  “Is it conscious?” The disembodied brain in front of me is incredibly disquieting, several infinitesimal, branching tubes running through it, keeping it clean and preventing the natural postmortem process from taking place.  Since Noor didn’t play her experiences back every night for the time she had the new channel proteins, they have to play them back into her brain now, so they can get what they need to play the light pulses into me.  Dr. Irene Young shakes her head. “Certainly not right now. And when fed the light, all Noor’s brain can do at this point is reexperience her last two years over and over again, in a loop, without knowing they’re being relived. The inevitable still happens no matter what, this brain isn’t coming up with anything new anytime soon. And the brain only ‘comes alive’ again, to put it crudely, when fed the light pulses.”  The whole thing still unsettles me. “Isn’t it cruel though, keeping the brain looping like that?”  She’s quiet for some time before speaking. “Think about it like this. Right now, you’re in this room, experiencing this present moment. Earlier this morning, you were experiencing something completely different, and so it goes for every moment of your past. In each of these slices of time, you are completely unable to predict exactly what you will experience next, right? Okay, say you die tomorrow and someone plays your life experiences back into your head. In whatever the equivalent of this particular moment is within the synaptic reconstructions, you will have absolutely no clue what that death will be like. It’ll just be this moment, and you’d be sitting in front of me, staring at that brain. You’re either alive, or you’re in one of those loops, and there’s no real way to distinguish between which of the two you’re in. Even if you can’t stop the death, you don’t even know that it’s going to happen. It would feel essentially the same as living your life as it would play out and then dying, with no way to know whether or not you’ve gotten yourself some amount of extra time. Maybe we should be raging against the impossibility of perfect foresight, or against the fragility of human existence and the ephemerality of a human life. But personally, I don’t think feeding the brain the light pulses is cruel.”  “Hmm,” I’m still not fully convinced, but she seems to have quite a strong opinion on the matter, so I try to redirect the conversation. “Pretty amazing, that I’ll be able to live out a whole two years, every night, for just slightly under four months.”  “Yeah, that’s what happens when you condense the experiences down to high quality immersive experiential versions of whatever she would have remembered naturally, which filters out quite a bit! I mean, there’s no way of knowing whether or not that will cut out something essential, but this will cover the most memorable moments, whatever those are.”  A nurse enters to tell us the operating room is ready. I head out after him and look back to see Dr. Young still gazing at the brain. As soon as she meets my eye, she hurries after me.  It’s time to take my bandages off, a week and a half after the operation. The cannula guides for the tubes that will fire the light into my head have been drilled into my skull and it’s all healed. Dr. Young looks nervous today. Why?  As she unwraps the bandages, she tells me what to expect. “There’s going to be a sensory deprivation chamber set up in your home, with the tubes attached. I know you’ve been taking the pills for some time now, but it is crucial that you continue to remember to take the pills every morning and night, and I’m obligated to give you a refresher on what to expect.”  Dr. Young holds out one box of a set of four. Each box has four rows, each row containing seven orange pills and seven green ones. “The morning pills—orange ones—cause a daily ripple of brain activity, during which you will experience a brief but strong hallucination. Since we’re replacing your REM sleep with Noor’s experiences, and REM is incredibly important for strengthening newly formed synaptic connections, we have to make up for the lost benefits with this ripple. Since you haven’t played anything back into your head yet, there haven’t been any hallucinations. However, as soon as you start, so will the daily hallucination.”  She gives me a quick half smile, but it’s not very convincing. “Don’t worry too much, it will be very brief. This carefully orchestrated daily brain activity will make it easy for us to identify different experiences you have as well. The night pills are what paralyze you and block external sensory signals from reaching you while you’re being fed the light pulses. They’ll also adjust your melatonin cycle to make sure you fall asleep with enough time to play the experiences. Your slow-wave sleep won’t be noticeably affected by any of this.”  Her voice is steady, professional. But the pills are rattling in the box from her shaking hands. She shoves the box into my hands. I have to ask.  I whisper, “Do you know the person who put the light-gated ion channels in Noor’s brain? Was it you? Did you know this woman?”  Dr. Young glances up at the ceiling. A security camera? She clears her throat and begins writing a prescription. She’s ignoring my question. Or maybe she didn’t hear me.  “Here’s a prescription for the pills, in case something happens to the ones I just gave you. Feel free to call me if you have any questions. And good luck with everything.”  Someone knocks on the door. “Irene? Could you come out here for a moment?”  Dr. Young presses the slip of synthesized paper into my palm and looks straight into my eyes. She has these incredibly intense eyes, and her proximity to me makes me nervous. I try to act normal.  She speaks to me in a low voice. “For the record, if it was someone I love who died, and they loved me, I would keep them looping endlessly. Then at least I would know they’ll feel loved forever, and I would be loved by them forever too.”  As I exit the building, I unfold the prescription she gave me. A smaller slip of synthesized paper falls out. It reads in her scrawling handwriting: MEET ME. AFTER YOUR 1ST SESSION. FOR NOOR.  “Rimjhim Gire Sawan,” sung by Lata Mangeshkar and Kishore Kumar, plays at a low volume in a beautiful living room. The room is bathed in a pale blue light from massive, glowing screens covering each wall, showing various pictures of deep-sea creatures, ocean views, and Noor with her ten-year-old daughter Sana (currently at a sleepover). Noor and Irene stand together by the door.  “I can’t get them. Nobody can know I’ve gotten this procedure done, and if I show up bald with the cannula guides drilled in, it would be pretty obvious. Please my love, trust me.” Noor gently brushes some hair out of Irene’s face, runs a finger along the slight wrinkles at the corner of her eye. Irene pulls her into a tight embrace.  “Fuck! Can’t you tell me anything? Why are you so afraid of them knowing? I don’t even know where you work, what you’re working on. But why did you get the procedure done if you won’t—are you in danger? If anyone tries to hurt you I swear to fucking hell I will—”  “Shh. I promise I’m not in danger right now. This is just a precaution. In case my research is somehow compromised. I shouldn’t have even told you that I got the procedure done today. But you were bound to see the orange pills eventually, and you literally work in this field, so you’d know what they do.”  “But if you’re not playing anything back, why do you need to take the pills? You won’t be getting the daily hallucination!”  Noor breaks away from the embrace and looks through her handbag for a few seconds before taking out a box of white pills. “REM suppressors. Won’t be getting any dreams for some time now, so the morning pill will definitely give me the hallucination and mark out my different experiences. I’ll be taking these white ones instead of the night pills. Please Irene, just trust that I need to do this. I can’t tell you why yet. In a couple of years, I won’t have to keep this a secret anymore, and I’ll tell you all about my work. And once this isn’t a secret anymore, I’ll tell the world about us. But right now I need to keep a low profile. I cannot let anyone know I’ve . . . met someone here, and I cannot let anyone know about the procedure. Couple of years. That’s all. Hey . . . ”  She takes Irene to the living room couch. Above them is a skylight, showing a dark, almost starless night sky. Noor sits with Irene’s head in her lap, stroking her hair. It feels like they’ve known each other for their whole lives, even if they’ve only been together for four months.  “What do you think we’ll be like in a couple of years? Together, I hope,” Noor laughs and smiles down at Irene.  Irene smiles back, and the wrinkles around her eyes deepen. “Married.”  “Wow, really? You think so?”  “Mhm. Right now, I’m certain of it.” She pulls Noor down for a deep kiss. “Noor, I do trust you. I worry about you, but I trust you.”  “I love you. Thank you.”  “I love you too.”  A massive fruiting body, covered in bulbous sacs, stretches out through the skull of what used to be Dr. Meyers, threatening to burst at any moment and release countless more spores into the air. On a table in the center of the room is a water tank containing a piece of the sea sponge Noor is studying, the one they discovered recently at the bottom of the ocean, that cures the new plagues. Next to the sea sponge are various insect carcasses, arranged neatly in a grid, and all with fruiting bodies from various insect-pathogenizing Ophiocordyceps fungi sticking out of their skulls and bodies. On the floor, an overturned container is surrounded by a swarm of the insects it used to hold. They should have been dead from Ophiocordyceps long ago, but they were cured.  Noor unfolds her touchscreen and checks the security camera footage that she’d saved again. It shows Dr. Meyers, looking like he’d just gotten out of bed, barefoot, disheveled, in a T-shirt and boxers, stumbling around in the middle of the night. Zigzagging through a hallway, he bumps into walls and columns and doors as though he’s possessed, until he reaches the door to the room. He presses his hand against a scanner and falls into the room as soon as the door opens. Dragging himself across the floor in an eerily contorted crawl, he makes his way to the table, lowers his hand into the water tank, and presses his palm against the sea sponge.  The footage then speeds up to show the fruiting body breaking through Dr. Meyers’ skull, developing spore sacs and continuing to grow longer, covered in brain matter, blood, and cerebrospinal fluid. The similarity of this fruiting body to the ones from Ophiocordyceps is impossible to ignore.  Had the sponge somehow caused an insect-pathogenizing fungus to mutate and attack a human being? The whole reason the sponge, of an entirely new genus, Panaceius, is so important is the incredible, unprecedented ability of its unspecialized archaeocyte cells to transform perfectly into a far larger variety of specialized cells than those of other sponges . . .  Someone’s walking down the hallway. Noor quickly shuts down her touchscreen and hurries away. After she exits the building, she opens her touchscreen again, and reconfigures the security camera in the hallway she was just in to stop looping earlier footage of the area when it was empty.  Her job is to study the flask cells of the sponge’s larvae in a different building altogether. She wasn’t supposed to be here, and she’s not supposed to have access to that security footage of Dr. Meyers either. But Noor has this overwhelming feeling that there’s something seriously strange about Panaceius meyeri, and she’s determined to keep digging at it.  Noor walks to the Learning Lab school to pick Sana up. On her way, she passes a group of children leaving the school with completely expressionless faces wearing T-shirts that say “You Won’t Hear Our Voices Until We Hear Yours” and “We Won’t Laugh Until You Save Our Future.” She smiles at them as they pass, and they nod at her.  Noor remembers when Sana first joined this youth movement, almost seven months ago. They had just moved here, into a house given to her by the company she had joined, and were unpacking boxes in the living room. They were taking out the incubating chamber where Sana had grown from a preserved early twenty-first century embryo ten years earlier. Sana wrote her thoughts down for Noor on her touchscreen.  We’re not speaking or showing our emotions on our faces until the adults meet our demands. If they don’t meet these demands, so many of us will die from the pollution and the water flooding and more and more diseases that will show up. And we don’t want to die. “Won’t it be difficult though? Not showing anything at all?”  It is, at first. But we learn. And I will write it out if I am happy or upset about something. You just won’t see it on my face anymore or hear my voice anymore. Noor kneeled next to her daughter. “Can I give you a hug?”  Sana nodded and Noor embraced her. “Sana, you’re the bravest person I know. I hope all the demands are met. I want you to have the happiest future imaginable.” She let go of Sana after a while.  After unpacking in silence for some time, Noor spoke again. “By the way, about those diseases. Don’t tell anybody this, but that sea sponge Mommy came here to study might help with them.”  I read about the sea sponge. Why does it leak stuff that pollutes the ocean as badly as microplastics when someone gets pieces of it to study? Noor sighed. “Well, we don’t know right now. But hopefully the more we study it, the more we’ll be able to benefit from the parts of it that cure diseases and stop the parts that harm the rest of the ocean.”  I hope you do that soon. “Yeah, so do I.”  Their movement did seem to be working. Or at least, a major demand on their list is being met, whether it’s because of the movement or because of something else. No more cars, and the roads of the state are being replaced with zero-emission magnetic levitation tracks.  P. meyeri, though. Killing deep-sea corals, leaking all sorts of pollutants that integrate themselves into other creatures’ respiratory and digestive tracks . . . only after humans started harvesting it. And Dr. Meyers. Was it simply a coincidence that the person who discovered this sponge died in this way? The specialization used in the way the sponge killed him was astounding.  Where the fungus spore would have contained the enzyme chitinase to break down the chitin in an insect’s exoskeleton, the spores that attacked Dr. Meyers contained keratinase, to get through the human epidermis. Then they manipulated the actin cytoskeletons of the endothelial cells lining his blood vessels, causing the endothelial cells to engulf the spores, creating structures from which they entered the bloodstream. Traveling up until they reached his brain, the spores used the same process to cross the blood-brain barrier. They immediately seized control of his neural activity, activating various types of memories and cues. Dr. Meyers was forced to travel to the room holding the sponge and touch it, in a way analogous to, yet very different from how the nerve toxins in an infected ant tell it to climb to the forest floor and bite down on a leaf. The fruiting body broke through his skull soon afterward.  The specialization in the design of these spores was so intricate . . . how did the sponge know to do all of this? It wasn’t even a spore that was a mutated form of Ophiocordyceps. No, this spore was created from scratch, inspired by the fungus.  If her hunch is right, P. meyeri is demonstrating markers of a lot more than consciousness.  Sana tugs at her sleeve, and the two start walking back home. When there are no other people around, Sana takes out her flute. Six months earlier, Sana told Noor that she’d created a cipher, combining music with the Fibonacci sequence, to communicate with her friends without adults knowing. While it was against the rules her friends had agreed on, she wanted to show her mother what she’d made, under a sworn oath of secrecy that Noor would be the only adult to ever know about it.  With enough practice, one could look at what appears to be really awful-sounding sheet music and translate it into a message. With even more practice, one could hear the music and translate it mentally, which is how Sana communicates to her friends and to Noor these days, using her flute.  At school today we learned about the Indian roofed turtle. I think it is my new favorite extinct animal. I think it is very cute.  “That’s awesome! Is that turtle what you want to write your science class report on?”  I think so. Yes. Sana plays. I want to write mainly about how much I like it and how it went extinct. It is really sad Mommy. Its habitat was mainly in small streams or shallow coastal waters and it fed on aquatic plants. But with ocean acidity levels going up and streams drying out it could not find food or shelter. And too many people started keeping it as a pet, so the wild ones went extinct while the captive ones lived much shorter lives.  Noor shakes her head sadly. “Sometimes humans can just do so much damage, maybe even without realizing it. And so often in this world, those realizations come far too late.”  Sana just nods, and then looks at her mother blankly. Noor feels a brief, sudden pang of anger, sadness, and longing for just a hint of emotion on her daughter’s face. Is supporting this the right thing to do? What if this is causing her harm? She’s trying her best to encourage Sana to do whatever she feels is the right thing to do, and to pursue her interests. And yet, she can’t help but occasionally feel afraid that maybe she’s doing something wrong, maybe this is “harmful and detrimental to child development” as some other parents are saying. But they’re only brief moments of doubt, and most of the time she feels immense pride toward the strength and resilience of her daughter.  It’s a powerful thing, the physical expressions of one’s emotions. And a powerful thing to withhold as well, which is why it’s working so well. Parents would do anything to see or hear or feel their kids speak again, smile again, laugh again, even cry again. Noor herself has spent many nights, after Sana has fallen asleep, watching old videos and weeping at the sound of her daughter’s voice. She feels guilty, selfish for missing those moments so much even with Sana still communicating her feelings clearly through her flute or through typing on her touchscreen. But maybe that’s the whole point. After all, she’s taken far more personal actions to combat the climate catastrophes since her daughter joined the movement . . .  What are you thinking about?  “I was thinking about how humans sometimes do harmful things without realizing it, and how sometimes it’s hard to tell whether something is the right thing to do or the wrong thing to do.”  I think about that sometimes too. In my opinion, as long as something will help people eventually . . . it is the right thing to do.  Noor thinks for a long time. “What if it might never help people at all? What if a decision involves taking away something that is helping lots of people? Do you think it can still be doing the right thing?”  Is it helping anything or anybody at all?  “Yes. It would help something very much, save it from being very badly hurt and mistreated. Something just as important as people, maybe.”  Sana is very quiet until they reach their home. Noor places her finger inside a small, clean, airtight cavity next to her front door’s lock. A sterilized needle quickly pricks her finger and collects a drop of her blood to scan. After a moment, the scanner beeps and flashes green, and the door opens.  The flute plays its strange melody as Sana’s expressionless gaze meets her mother’s eyes. Mommy. If it saves something else from being hurt, I think it is still the right thing to do.  I wake up, disconnect the tubes from my head as fast as I can, and sprint to the bathroom, where I retch into the toilet, though no bile enters my mouth. What the hell? I’m getting the nausea side effect now? I’ve never gotten it before! Fuck.  “You should keep an eye on Dr. Young. Meet her, see if you can find anything out about her. It’s a weird coincidence that she’s the one who modified our neurons, and she had such an intimate relationship with Noor without mentioning anything to us.” Marie shoves a handful of spiced, fried crickets into her mouth before passing the bowl over to Anthony, who takes a handful and passes the bowl to me. Switching to insects as a source of protein is becoming increasingly popular these days.  “Yeah. I’m meeting her soon.” I politely take a few from the bowl. They taste okay but need more cayenne powder and salt.  “Are you okay Nithya? You look kind of flushed.” Anthony looks concerned.  My stomach feels so weird. I feel pretty nauseated and stuff is really churning around in there. My period literally just ended . . . and it doesn’t really feel like cramps either, or gas pain. So what the hell?  “I think it’s just indigestion. I’ll be okay.”  Anthony hands me an antacid, and I take it. Pretty soon I’m feeling a bit better. It was probably just an upset stomach.  “Maybe go easy on the spicy snack.” Marie takes the bowl away from me.  “Are you kidding me? That spice is weak as fuck. If anything, my stomach would protest at the lack of cayenne in that bowl.”  They laugh, and then we sit in silence for some time, researching Noor’s place of work. Eventually Anthony closes his touchscreen and looks at me.  “Okay, I have to know. What was it like? You’ve been acting kind of strange today.”  What was it like?  She was alive. I wasn’t myself, I was her, entirely. The world felt so different. It’s so different, in her head. And I can remember everything about her life, in such great detail. It was all so vivid! She was actually alive again. And they were all alive too. Irene, Sana, everyone she interacted with. They were as alive as Marie and Anthony are to me right now. What is the difference really, after all? The neural activity in my brain when I interact with someone is what creates everything I understand about the person I’m interacting with. That’s all the evidence I can ever get from them to prove they’re alive (unless I’m playing light into my head to become them, of course). Recreating those patterns . . . it’s the same as recreating those people, at least what those people were to Noor. The interactions are just as real. They were as alive to me as anybody I walked past today.  Now I’m back in the reality I inhabit. Me, Nithya, not her. But now scents and sights and sounds around me are bringing up old memories that are not mine, of a carpet in a house I’d never been to, of a beach in a country I’ve never visited. Ghostly fragments of thought are invading my reality constantly, of laughter and voices and experiences with strangers and friends and family I have never known. I never realized how many memories I remembered in a single day until I was forced to start separating recollections of my autobiographical timeline from recollections of hers. They’re constant. Every single thing in my surroundings, from Anthony and Marie to the snack bowl to my touchscreen, now has two different emotional states associated with it. Different fragments of memory that are dug up to navigate the experience associated with interacting with any object or person. And I can feel the differences.  I’m here now, everything around me is real. I know it. And it’s especially comforting to inhabit my own reality again because, well, for a while . . . I blinked out of existence. When Noor was alive again, living in my head as my brain activity, I wasn’t there at all anymore. My brain was only a vessel for her to live her life out, with no self-awareness of my role as a vessel, even. I was nothingness for the period of time where she came back to life, and now that I’m awake, she’s nothingness again.  I clear my throat and turn my attention back to Anthony and Marie. “It’s so . . . intimate, this whole thing. Is this right? I mean . . . I remember her life. I have her memories. Is this okay? I feel strange about it.”  “It must feel really weird.” Marie looks at me sympathetically. “But you know the contracts you have to sign when you get the procedure done. You can relive your experiences, or gift them to someone else you choose. And in the case of a sudden and unexpected death, you give your consent to let an investigator live your experiences. Noor knew all these conditions when she got the procedure done. And well, she’s not alive anymore, Nithya. And her family wanted us to do this as well. They want to know what happened to her as well.”  “Yeah, but she didn’t know what it would be like. Nobody knew. She’s alive again, Marie! It’s her, in the past, sure, but she’s as alive as we are right now. She couldn’t have known what I would be experiencing.”  Anthony speaks up. “Hey, this is all for Noor’s sake. We’re going to find out what happened. This will give us the best chance we have at figuring out the whole situation. It’s our job, Nithya. For her family, for her memory. We owe it to them to investigate her death and give them some closure.”  At the end of the day, on my walk home, I pass a father and his three-year-old daughter. I smile, remembering Sana when she was three. She was always running off somewhere, climbing a tree or investigating some bug she found. For a moment, I can almost hear her flute, picture her blank stare . . . I catch myself and quickly work to separate Noor’s memories from mine before continuing home.  I am not prepared for the swell of emotions and deep sense of shared history I experience when I see Irene Young sitting in a booth of a café downtown, sipping her coffee. It’s almost painful, the physical ache in my chest and my gut, of love and lust and nostalgia and camaraderie. It takes a whole lot more effort to separate all of Noor’s emotions toward Irene from mine right now, compared to separating the two emotional states when interacting with something like an apple. And it’s really hard to think properly when I sit down across from this woman Noor loved.  Irene clears her throat. “Do you want anything to eat or drink? The coffee here is from one of the new orbiting gardens. Pretty amazing that what I’m drinking was grown in sealed chambers up in space. Quite the solution to the dwindling arable land problem, isn’t it? And it’s pretty good coffee too.”  As soon as she speaks, the context of the situation hits me.“Can we just cut the bullshit and start talking? Why didn’t we know about you? Why did you take the job of modifying our neurons? What the hell do you know, and why the hell haven’t you told us already? And what was with that note? Why couldn’t you say anything before I started this?”  She sighs. “Look, it’s really complicated. But I want to keep my relationship with her a secret, alright? The place she worked for is not something I want to get too involved with. They know about me already, but they don’t really know about my relationship with her. And I didn’t even learn about her work until . . . ”  “Until what?”  Irene looks down at her coffee. “Well, let me just say that they know I had met Noor. I found out about where she worked a week or so before she died. And I inquired about her afterward. They were really sad about her death . . . but they also told me that they were worried she was planning something really dangerous. They said she was going to do something that would risk a lot of people’s lives. And that maybe she wasn’t in the best state of mind, maybe she was delusional.”  I almost laugh. Delusional? “Trust me, that’s not true. I think I would know, I’m living her life every night.”  She smiles sadly. “And maybe that’s exactly why you wouldn’t see it. Because you’re in her head, you don’t see that her delusions aren’t true. To the person afflicted by them, they actually are real. If you’re living Noor’s reality, experiencing the world around you from her perspective, of course you’re inclined to believe her thoughts.” She gulps down the rest of her coffee. “I never thought she might be experiencing delusions when she was alive either. Everything she said or did always seemed to make perfect sense.” Irene sighs. “But maybe I was wrong.”  I feel a sudden longing to hold her, make her laugh and smile and forget all her troubles. I try to separate Noor’s emotions from mine but . . . this time some of it is coming from me too, at least I think it is. The whole time, she’s been digging the corner of her short-clipped thumbnail into the wooden table, hard, creating an arc indent in the table. I briefly experience the desire to hold her hand but decide against it.  “I’m sorry, Irene. I’m sorry she’s gone.”  “Mhm.” She takes a deep breath and looks up at me, perfectly composed again.  When she speaks again, she chuckles a bit. “You know, I’m pretty jealous of you Nithya. You get to live it. You get to know her in the most intimate possible way.”  “I don’t know. It’s such a new thing, I have no idea whether or not it’s the moral thing to do. I mean, I’m a stranger. It feels a bit . . . wrong. And you, Sana . . . it’s a lot, Irene. It’s intruding on all of your privacy too.”  She looks me in the eyes. “But you’re not going to stop, are you?”  “No, I mean, I owe it to her family and—”  Irene laughs at this. “Oh come on. You and I both know it’s not that. I have never seen someone so enthusiastic about getting that procedure done before I met you. So what is it, really?”  She orders another coffee, and I order one too before speaking. “Okay. Fine. I want to know what it’s like inside someone else’s head. I’ve always wanted to. I want to know how things taste to them, how they think of other people, how their entirely different set of memories influences what the world around them looks like. And now I can. That’s the truth.”  “Fair enough.” She chugs more coffee.  “How do you feel, though? About me . . . knowing so much about your relationship?”  After an almost unbearably long pause, Irene smiles. “It should have been me. Not you. If it had to be anybody, it should have been me. But she never had the time to think about who would get her experiences after her death. And she never requested for anyone to live them out. Nobody even knew about me. She died suddenly, so it’s all being investigated, and so you got them. You don’t appreciate what you’ve been given the way I would have. But I’ve come to terms with it. The light pulses have been encoded to fit your specific synaptic structure, and quantum encrypted to prevent any further access to her memories. So it can’t be me. But it should have been. Am I fine with you knowing so much about my relationship with her? I could be, if you just do something for me.”  “What do you want me to do?”  She grabs my hand. “Tell me about it. Tell me about her thoughts, what it is like in her mind. Tell me everything, all of it, until every last light pulse has run through your head. It’s why I wanted to meet you. You don’t have to tell me anything related to the investigation. I just want to know what it’s like. Starting now. Tell me, please.”  I do.  As I get up to leave, after hours have gone by, with plans to see her again the following week, Irene asks me, “How have you been feeling so far? With the pills and the hallucinations and everything.”  “The hallucinations aren’t that bad, but I’ve actually been feeling a bit nauseated since I started.”  She looks concerned. “You should see someone about that. That’s not normal, especially since you never had the side effect before.”  “I think I’ll be okay, it’s dying down and—”  “Seriously, just to be safe. It wouldn’t hurt to check.”  “Alright, I’ll make an appointment with someone.”  The nurse and doctor at the hospital hand me all the information I need to know, along with the charts and statements laying it all out for me, neatly clipped together on synthesized paper and an electronic copy on my touchscreen.  “Have you started the coughing fits yet?” the doctor asks.  “No, I’m still just getting the nausea.” I look down at my hands.  “Good. So you aren’t contagious yet—too many people wait until they start coughing, without coming in during the noncontagious nausea phase like they’re supposed to . . . that’s the only thing that’s keeping this spreading, these days, honestly. At least it’s very rare to get infected now.”  They hand me packets of liquid. “Here, drink these twice every day to prevent fluid buildup and the bile-inducing coughing fits. They’ll coat your esophagus with a protective layer that will stop you from ever becoming contagious and prevent the mutation-induced signals from leaving the lysogenic squamous cells.” The doctor clears their throat. “Please know, this contagion-prevention mechanism cannot be used prophylactically, and would actually be really harmful to an uninfected person, so please don’t try giving it to anyone else. It only works on an infected person with their viral-DNA-containing squamous cell genome. And please remember that this alone will not cure you—it will be eventually fatal without the cure—so you really need to start ingesting the archaeocytes too. But we’re well out of the horror from a couple years ago, this illness is easily treatable now. The archaeocytes work wonders and have been made highly accessible! So remember to start that sponge treatment soon in addition to drinking this liquid, and you’ll be cured!”  I have it. I’m sick.  “Rajnigandha Phool Tumhare,” sung by Lata Mangeshkar, plays through Noor’s mind. As the sub quickly sinks into the sea, the colors around Noor start to fade away. She watches her red shirt turn to blue-gray as she remembers Irene’s words over and over again.  “I’m sick, Noor. I have it. I was able to get a spot in one of those trials, and they’ve been able to cure every single person in the trials so far. But I wanted to tell you . . . in case something ever goes wrong.”  When only blue light is able to reach the depths, Noor climbs up, out of the spherical observation portion of the sub, and sits across from Matias, her fellow crew member on their two-person sampling mission, at a small folding table.  They’re headed to a newly discovered P. meyeri colony at the bottom of the Mariana Trench. Deep-sea remotely operated vehicles have already mapped out the massive, linked caverns inhabited by the colony. According to images from the ROVs, the walls, ceilings, and floors of the spaces are all covered with countless sponges, arranged in an astoundingly intricate fashion. Specialized sponges occupy different chambers, each one shaped to make optimal use of the water currents, avoid danger, protect reproducing sponges, and capture the most food. It’s one of the most complex systems Noor has ever encountered.  This is wrong—she begins to think, but shakes the thought away quickly, remembering Irene’s face as her optimistic facade eventually disappeared to reveal her terror.  “I don’t want to die like that.” Irene spoke through sobs. It was painful to watch, and all Noor could do was hold her close.  “Is this your kid?” Matias points to the screensaver on her touchscreen, flashing family pictures of Noor and Sana.  “Yeah, that’s her. Her name’s Sana, she’s just turned eleven.”  “She’s about my Syd’s age. Such a handful these days, these kids. At least, Syd is. Syd gets into trouble at school every day now, for not responding to questions mainly. But it’s not their fault. It’s those other kids who got them to join that ridiculous movement. I get wanting to prevent and stop the climate catastrophes, but this is just extreme and unhealthy. My kid hasn’t changed the damn expression on their face in over a month, it’s driving me and my husband up the walls!”  Noor is taken aback. “Actually—”  “I hope your kid never gets into that stuff. It’s dangerous, really. And all those experimental public schools cropping up these days, encouraging that crap, aren’t helping at all. Glad I didn’t send Syd to one of those. Where does your Sana go?”  “Sana goes to an experimental public school, Learning Lab, past the wind turbines. And I think the youth movement is incredibly brave.”  “Ah.” Matias sits quietly for some time, his face adopting an expression of deep concern. “Look, it’s for your kid’s sake that I’m telling you this. The movement—”  Noor narrows her eyes. “Look, I’m going through my own shit coming to terms with my daughter’s choices, but I feel guilty enough that I’m going through shit about it at all. I should just respect what she’s doing and admire her strength and bravery. And I certainly don’t need you to butt into any of my personal business. I think, to maximize the productivity of this mission, we should just focus on our research. Why don’t you tell me about that instead?”  This time Matias looks taken aback. “Fine.” He opens his touchscreen and shows Noor a folder full of images of a P. meyeri sponge’s spicules. “These are images taken by the ROVs, showing the portions of the sponges facing the interior of the chamber cavities, toward all the other sponges. The spicules on this side are incredibly complex and specifically designed to bring light deep into the sponge. Their refractive index far surpasses that of our corneas. And there’s a lens too! My question is, why does it need to collect light with such specificity and efficiency? I think there must be some sort of symbiosis with bioluminescent and light-sensing organisms we haven’t found in previous samples, that requires light to reach the interior of the sponge. And if we can control the signaling system they have, if they have one of course, we can possibly increase their productivity.”  Fascinated, Noor studies a document listing potential chemical impurities that could have formed in the spicules to improve their refractive index.  A sharp, high-pitched tone plays in the sub. It’s time to put on their nitrogen regulators and suits. Noor and Matias place needles attached to a system of quarter-inch diameter tubes onto various marked areas on their bodies. Noor winces slightly at this, even though the process is painless. As soon as the needles have been taped in place, they each attach the tubes to thin, flexible, cloth-covered plates that they strap to their backs, and finally press the glowing blue button on each of their plates. Once the buttons are pressed, a microscopically thin system of smaller tubes begins to stretch out from the needles and into their internal tissues, throughout their bodily systems, causing a brief shiver to run through them. One of the most pressing concerns when working in the midnight zone is avoiding any sort of depth-pressure related injury, such as future decompression sickness from pressurized surface-level gases depressurizing upon resurfacing. The nitrogen regulators manage the distribution of surface gases, mainly nitrogen, within the bodies of Noor and Matias, to make sure nothing like that happens.  After putting on the nitrogen regulators, the two of them step into heavy, bulky suits and helmets, and turn on communications with each other. Their suits can collect oxygen from the surrounding water, allowing them to walk around under water for a virtually unlimited amount of time.  “You’re studying the flask cells, right?” Matias struggles to pull gloves over his hands.  “Yeah. Sponge larvae have some form of a rudimentary sensory processing system using their flask cells that allows them to move to a place where they can become sessile, P. meyeri included. But P. meyeri flask cells are different. When the larva becomes sessile, the flask cells continue to develop.”  “How so?”  “That’s the thing. I can track their development up to a certain extent, but for some reason all the larvae I have die before reaching adulthood, even when deep-sea conditions are simulated perfectly. I don’t understand it. In the adults, there is a thin extra layer, lined with mesohyl, that covers almost all of the sponge’s interior surfaces. I think that’s where the fully developed flask cells are. When we collect the specialized sponge archaeocyte cells to make the medication, we have to access them using certain entryways into the sponge body that aren’t covered by this extra layer. If you cut into that layer, the sponge kills itself instantly, producing a dark oily liquid that somehow dissolves any remnants of this extra layer, along with much of the rest of the sponge.”  Matias frowns. “That’s why the sponge colonies used to die out when we got ROVs to remove samples to bring up. Even if the ROVs didn’t cut into the extra layer of the sponge it was harvesting, they had to cut into the surrounding sponges to remove it, and the liquid spread, killing the rest of the colony and hurting other organisms.”  Noor nods. “Yeah. Now we harvest the P. meyeri using those few entryways. You know what’s even weirder though? The sponges kill themselves if you even try to scan them to see into that layer. How are they even able to detect the scan? I don’t understand it.”  Matias frowns. “So how are you going to observe it?”  “My idea relies on the hope that the sponges will protect their next generation at all costs. If the larvae are in the process of escaping the sponge they developed in, maybe the sponge will override the trigger to self-destruct, and maybe I can scan, observe, and take snapshots of the fully developed flask cells inside the adult, if there are any, during that brief window. The sponges aren’t reproducing in the labs, so I’ll try it in the colony itself. Hopefully if I do this, we can find a way to stop the sponges from leaking that corrosive liquid and harming themselves and their surroundings, in the future.”  They finish adjusting their suits in silence. Matias taps Noor on the shoulder and points to a switch that would mute communications with the surface crew. Noor nods, and Matias speaks after muting the communications.  “P. meyeri is pretty special, isn’t it?”  Noor raises an eyebrow. “It is . . . ”  Matias sighs. “You know, if the times were different, I wouldn’t have been doing this. We’re rushing into churning out the treatments since it was such a widespread emergency just a few years ago. But these sponges . . . we’ve barely scratched the surface of understanding them, and they’re unlike any ever known before. Yeah, sponges can’t think. But somehow this one reacts to its surroundings in an incredibly nuanced way. Why, you know? If the times were any different, I would have done things so differently. I would have taken things slowly, and carefully, and with less . . . I don’t know, exploitation.”  Noor gives him a half smile. “I know what you mean. You know, I was almost going to—”  The expression on Matias’ face darkens as he interrupts her. “But times aren’t different. And I want to do this. You know, a few years ago, Syd got sick. It got so bad, their intestines weren’t absorbing anything . . . We had all resigned ourselves to making them as comfortable as possible in their final few months. But then they got into one of the trials, and now we’re able to fret about what they’re doing with their life, not whether they’ll live. After Syd got sick, I knew I had to get myself into this line of research. Frankly, if exploiting P. meyeri means other Syds can live, I’d uproot every last sponge in existence.”  Noor nods. “I understand, Matias. Someone I love, someone I want . . . a future with . . . is getting treated right now. And I want to do everything in my power to protect her, even if it means fighting every instinct I have.”  “Good. I’m glad we understand each other.” He turns communications with the surface crew back on.  When they have reached the colony, Matias and Noor move through an airlock into the exit chamber. Once sealed into the exit chamber, the door in front of them, divided into slats, starts rotating each slat individually as the chamber fills with water. Once horizontal rather than vertical, the slats slide into the walls, leaving an opening through which Matias and Noor leave the sub.  The ROVs had assembled a thin metal grate pathway going through the chambers, just above the sponges on the floors, so that people could walk through without destroying or touching anything along the way. They turn on the bioluminescence sensors on their helmets, which have scanners and filters built in so they can focus on collecting samples and not have to use handheld tools to view or scan the sponges. The helmets track their eye movements and some of their neural activity. They also superimpose faint 3D models of the sponges around them onto the darkness, so that along with any bioluminescence, they’d be able to see the general shapes of their surroundings to know where to go without shining any bright lights.  “Look at this!” Matias calls to Noor. He pumps a bioluminescent dye, packed with glowing plankton, around the base of a massive sponge near the entrance of the chamber. After being absorbed into the pores of the sponge, one would expect the plankton in the water to be consumed, and the remaining plankton-free, non-glowing water pumped back out. Instead, the dye begins to trace a pathway going from one sponge to another, throughout the chambers. “They’re directing the water to one another and sharing the food!”  Noor calls back to him. “Hey, I think it’s time to split up. I’m going to the center chamber, it’s almost time for the larvae to leave the sponges. But keep me updated.” She sets her helmet to show a small viewport in the bottom right corner in which she can see what Matias sees.  Each P. meyeri colony is structured similarly. The sponges near the entrance of the chamber system are the largest, informally named the “sentry” sponges. Almost all the water that flows into these chambers goes through them. The deeper into the chambers one travels, the smaller the sponges get. Only the smallest sponges, in the centermost chamber of the colony, produce larvae. Using the intricate system of directing water, P. meyeri is able to send sperm from all the various shapes and sizes of sponges that are needed in the different chambers to the centermost chamber, ensuring that more of those shapes and sizes will exist in the next generation.  But how do they know which larvae developed from which sperm? And how do the colonies keep growing if there are a limited number of chambers? There are so many questions!  Matias’ voice sounds through Noor’s helmet. “Hey, I want to put on some music, real quietly. Do you want to listen too?”  “That depends on what you’re going to play. If it’s the stuff my daughter listens to, that’s going to be a no from me.”  “Space Oddity,” by David Bowie begins to play in Noor’s helmet.  Noor laughs. “Wow, a song about dying alone, floating away in the abyss of space. Depressing choice.”  “Our current situation just sort of brought that song to my mind.”  “I’m amazed at your optimism. Also, this song is ancient!”  Matias chuckles. “Says the person playing Bollywood songs from god knows what decade for the entire first half of our descent.”  “Hey, Lata Mangeshkar is a legend.”  “Um, so is David Bowie.”  “True. It’s a good song, too.”  They walk down their separate paths for a while, humming or singing along to the song. A dragonfish, swimming in an erratic, jolting manner, convulsing and pulsing blue bioluminescent stripes over its body, moves past Matias. Noor watches it through the small viewport at the bottom of her helmet. Matias decides to follow it before speaking again.  “You know, the nice thing about listening to music is that it kind of puts a filter over reality. Suddenly you can notice your surroundings and what’s moving to the beat of the song. You yourself move differently, blink differently, notice and ignore things differently. For a moment it’s not reality that you’re living in, but a world directed by something else, like you’re starring in a film or something. For the duration of the song it almost feels like nothing bad can happen to you. Everything, whether good or bad, feels like it’s going to either match the music or wait until the song is over to happen. It makes everything seem more predictable and safe. Now, I don’t want to die an agonizing death floating in any abyss, but if I had to, I’d rather have it be while I’m listening to a David Bowie song that’s sort of about what I’m experiencing.”  Noor smiles. “Yeah.” she says quietly.  A cloud of something drifts past Noor. The helmet enhances it, applies a color filter over it to show what color it is, and zooms in to scan. It’s made of larvae. It’s started. She closes the viewport showing Matias’ view so she can get a better look.  Noor watches as the cloud divides itself up and flows through the ostia of the sponges around her. What the hell? They’ll be digested! But then the larvae pass through, out the osculums of the sponges, unharmed. They move from sponge to sponge, until they find their way to separate chambers, where the larvae just swim around in the center. They aren’t old enough to become sessile yet. Noor directs her helmet to scan the interior of a sponge as the larvae pass through it, taking care not to scan through the layer of the sponge that she suspects contains the flask cells.  Tiny, flashing lights shine toward the larvae as they pass through . . . upon closer inspection, it appears as though microscopic bioluminescent shrimp, fused to the inner walls of the sponge, are flashing light from their photophores. This wasn’t in any of the samples . . .  Noor opens the viewport with Matias’ view again. “Matias, you have to see this! Inside the sponges—”  “Noor! I was just about to tell you! Are you seeing what I’m seeing? I found a new chamber! The opening is too small for any ROV to get through, or even notice, really! But I can just barely look through into it.”  Noor expands the viewport. Through a small opening between sponges, she sees a massive chamber, lined with P. meyeri and filled with a large variety of marine life. Snailfish swim laps around the place. Dragonfish swarm the bottom, flashing and . . . mating? This isn’t where or how they normally mate. Transparent squid, packed tightly together, have somehow turned on one another for sustenance, fighting and eating each other, dropping particles of food into the waiting ostia of the sponges. How did these creatures get inside the chamber? They couldn’t have fit through the opening unless they got here when they’d just hatched, or when they were inside eggs.  “I . . . I don’t know what to make of it!” A timer starts flashing on her helmet. It’s time to hurry to the center chamber, the larvae release has almost ended.  What are we doing here? We shouldn’t be here . . . She moves as quickly as she can to the center chamber, full of indecision. There are too many things we don’t know, fuck, we don’t know what we’re doing, we should just leave this place alone, we’ve destroyed so many others . . . she can feel herself panicking and stands still for a moment, closing her eyes and breathing deeply.  As soon as her mind stops racing, Irene shows up in her thoughts again. Irene, the love of her life. Irene, the one she hopes to marry someday. The one who has always worried for her safety . . . the one whose safety Noor worries for now. I need to do this. For her. For our future together. She needs to get well, I cannot risk losing her, ever.  Clenching her teeth, she heads into the centermost chamber. The floor is lined with what look like aggregated gemmules, the result of asexually reproducing sponges. Why are they outside the sponges? And how come P. meyeri gemmules don’t end up developing into sponges themselves, ever? There hasn’t been a single pair of P. meyeri sponges whose DNA matches exactly found so far. Noor carefully takes a sample of the gemmules. And then she looks up.  An intricate, coordinated display of flashing light is taking place throughout the chamber, in a beautiful recursive pattern revolving around one of the sponges, far more complex than any temple carving, any rose window, any generative design she’s seen. The sponge releases its larvae, and then a different beautiful light display centering on another sponge begins as that sponge starts to release its larvae. Using the scanner, Noor finds more of those microscopic shrimp fused to the exteriors of the sponges, somehow being controlled. She steels her churning stomach and holds back her revulsion regarding what she’s about to do.  As the sponge in the center of the swirling, dancing lights releases its larvae, Noor directs her helmet to scan inside the extra layer under its surface. At first, she does not know what she’s looking at. But soon, she begins to understand. The insulating sheaths. The delicate branches. The electrical signals.  Neurons.  The reason it was briefly so difficult to make out what she was looking at was the sheer number of synapses in the thing. Noor asks the helmet to calculate how many synapses would be in the entire sponge if the concentration average held up throughout its body.  One quadrillion. Over ten times more synaptic connections than the ones in a human brain.  Noor backs away, quickly. “Oh, fuck.”  Matias’ voice suddenly rings out, panicked. “Some of the larvae that just arrived at this chamber . . . they’re swimming to me. They—FUCK! NO—”  “Matias, head back to the sub if you can hear me! Please!”  Noor is about to turn around when she sees the lights in the chamber shift, ripple, change their pattern. They aren’t centered around the sponge she was just scanning anymore. They are centered around her.  The larvae that had just been released from the sponge she scanned begin to swim around her, closing in rapidly until they latch on to her suit. As soon as they’re stuck on, their bodies begin to rupture and burst into a dark, oily liquid that quickly spreads. No no no no FUCK!  She moves as fast as she can, back to the entrance of the chamber, back toward the sub, as the liquid begins to cover her helmet and block out her vision. She sees Matias staggering over too. They fall into the chamber, shut the door, crawl through the airlock, and collapse onto the floor of the sub after Matias pushes the button to ascend.  Noor almost thinks “We made it!” when she feels blood dripping out of her nose, her mouth, her ears, and her eyes. Looking over at Matias, she sees he’s going through the same thing. A splitting headache suddenly becomes agonizing, and Noor feels close to passing out. The nitrogen regulators aren’t working. We’re getting decompression sickness. She manages to shed her suit to see the quarter-inch diameter tubes clogged with the dark liquid, creeping closer and closer to the needles that lead into her body. She quickly rips out the tubes, looks over to Matias again, and sees him doing the same, and then Noor falls unconscious, her last thoughts before doing so containing a singular wish of hope that they’d survive.  Noor blinks awake in a hospital bed to see Sana holding her hand, looking at her blankly. In the bed opposite her, she watches Matias begin to stir as well. At his bedside are a weeping man, and a child of about Sana’s age. The weeping man says to the child, “Look Syd, he’s waking up! Don’t you want to greet him with a smile?”  The child types on their touchscreen  No. I have a message typed up for when he wakes up. I worked hard on it. He can read that, and he will know I am happy. “But it would make him feel happier if he wakes up to—”  Matias reaches over and squeezes the man’s arm, looks up at him with a smile, and shakes his head before turning to Syd.  “Hey, you’re so brave. Thank you for waiting here. I’m just happy to see you, no matter what expression you have on your face. I love you Syd.”  Syd nods at their father and types on their touchscreen  Thank you Dad. I love you too. I’m happy that you are awake. Noor squeezes Sana’s hand tight and closes her eyes again.  Irene and I sit together on the floor of my apartment, leaning against the sensory deprivation chamber, sharing a bottle of wine. It’s almost empty now, and we’ve been talking for the whole evening. I haven’t told her that I have the illness yet.  I look at her. “What was it like to know her? I’m always telling you what it’s like to be her, but I’ll never know what it was like to know her.”  Irene smiles and closes her eyes. “Knowing her was the most wonderful thing to ever happen in my life. Our relationship was definitely a bit interesting, since we were keeping it a secret from everyone. We only met up a couple times a week, only spent nights together every Friday night when Sana was at a sleepover. But the separation only deepened our love for one another, only made us ache for the other’s company even more. And it made the times we did spend together that much sweeter. Every time I woke up next to her, every time I covered my head with a pillow to block out the sound of her snores, every time I made her smile, or became frustrated with how stubborn she could be, or listened to her give an impassioned speech, or heard her awful singing, or just about a thousand other things, it was all connected by this incredible foundation of just . . . love, you know? The deepest possible amount you can care about someone. I don’t think I’d ever truly loved anyone until I met Noor. The day I knew, I was poring over scans of patients’ brains, and a thought of her just popped into my own brain. I said aloud to the stack of scans: ‘I really care about her.’ And a week later I figured out it was love. I’m sorry, did that make any sense? I think I feel the wine.” She laughs.  “That made perfect sense . . . that was beautiful. I don’t know if I’ve personally ever felt that way about anyone before. But with Noor’s memories . . . I know what you mean, Irene.”  Irene turns to me and looks as though she’s about to speak several times, the expression on her face drifting from an almost-frown to an almost-smile and back again. The intensity of her gaze makes me a bit nervous, and I laugh to shake away the slight discomfort.  “What is it?” I ask.  Irene takes a sip of wine. “Nithya, because of Noor’s memories, of course . . . I really have to wonder, do you feel something for me? I mean, you tell me how much she loved me, and you describe to me what she felt. But it’s you living all of that. And you still remember all of it . . . I have to wonder.”  I sigh. “Honestly? Yeah, Irene. I do. Most of the time I have to work incredibly hard to separate her feelings for you from mine. And it’s almost unbearably tempting to just feel everything, the full extent of her love for you . . . especially because . . . ”  “Because what?”  I take a sip of wine. “Because I feel something for you too. And I don’t completely understand if it’s coming from me, or if it’s some memory leakage coming from Noor’s experiences. But I do know that from the moment I met you, there was definitely something. I mean, how could there not be, you know? You’re brilliant, and powerful, and . . . intense and so beautiful. How could I not feel something?”  Our faces seem to be drawing closer and closer together, but maybe it’s the wine. She half smiles. “What would it even be like, us, together? You, with the lover of the person whose experiences you’re living to investigate her death, your feelings influenced by who-knows-what. And me, with the person who gets to live the life of the woman I loved, a person who has probably been influenced by her in the past few weeks. I’m definitely not sober enough to untangle all the moral and ethical implications of that right now.”  I look at her for a while before speaking. “I don’t really know either. It would be pretty uncharted territory, wouldn’t it?”  Irene smiles at me, and I have no idea what compels me to say what I say next, but I smile back at her a little bitterly, and whisper, “But in its own slightly fucked-up way, isn’t it kind of a perfect match?”  And with that, our lips meet, and there is no turning back.  We laugh and we kiss, scattering clothes around the place as we make our way to the bedroom.  “Is it okay if I don’t play the light pulses tonight?”  “Yeah you can postpone them for one night.”  At the entrance to the bedroom, I pause for a moment and pull away from her, look into her eyes. “Hey, Irene. I completely understand if it wouldn’t be okay but . . . can I feel what Noor felt for you, just for tonight? Please?”  Irene nods. “I don’t know if it’s the right thing to do, but I want that too, Nithya. I need that too.”  I kiss her deeply, run my hands through her hair, and let Noor’s feelings flood into my own, creating a beautiful mix of deep, comfortable, strong love, and new, exciting, passionate lust. I stop separating my memories from hers, and the two worlds blend together. It’s overwhelming, but in a good way, and as it hits me that I’ve loved this woman countless times before, the care and intimacy and ache I suddenly experience for her is the most powerful thing I have ever felt. As we make love, I realize I’m not Nithya anymore in the moment, and I’m not Noor either. I’ve become someone entirely different, memories and emotions from the two lives blending together, but everything focusing and revolving around . . . Irene. I know it’s probably a mistake. But I tell myself just for this one night, I let myself become this new entity, and it feels beautiful, and right, and . . . true.  Afterward, as we lie together, the sweat drying off our bodies under a fresh, cool sheet, I look over at her and decide to tell her.  “I have the illness. And the trials are so accessible now that I got a place in one easily. I’m taking the esophagus-coating liquid twice a day to ensure that I’m not contagious, I won’t get any bile-inducing coughing fits. But . . . I’m not going to do the treatment that would cure me. I can’t tell you why right now, but I cannot bring myself to do it. I think I’ll have around a year. I’m sorry.”  She looks at me for a long time, and I can’t read the expression on her face. But then she turns off the lamplight next to us, and pulls me close to her, wrapping her arms around me. I fall asleep there in her arms, feeling absolutely, comfortably, wonderfully safe.  I wake up to a crashing sound in the bathroom, and someone saying “FUCK!” loudly. I pull on a T-shirt and rush to the bathroom, where I see Irene sobbing. A toothbrush holder had been knocked over into the first of the pillboxes for Noor’s experiences. The box has opened in the process, and pills are scattered everywhere, in the toilet and the sink and on the floor.  I hold Irene close to me, and she starts to say, “I’m sorry Nithya! I’m so sorry I’m so sorry I’m so fucking sorry,” as she buries her head in my shoulder, snot and tears soaking through my shirt.  “It’s okay! Seriously, this is no big deal! I have a prescription, I can get more pills. Don’t worry, seriously!”  But she doesn’t seem to hear me. She just keeps saying it over and over again. “I’m so sorry.”  Noor sits on an uncomfortably textured couch in a small waiting room, her mind going blank as she observes the beige and blue diamond pattern on the carpet at her feet. Someone finally opens a door and calls her inside. “They’re ready to see you now!”  She enters a room full of people way above her pay grade. She’d tried to remember everyone’s names but couldn’t retain any of them.  “Sit down, make yourself comfortable! Do you want any water, coffee, anything?”  Noor shakes her head and sits.  A woman at the head of the table they’re all arranged around leans forward, smiling. “Great stuff you found during your last sampling mission, isn’t it?”  Noor frowns. “We can’t continue doing this. P. meyeri is intelligent! A single sponge contains more synapses than we can even fully comprehend! We have to tell everyone.”  They look at one another, before turning to her. One man sighs.  “Look—Noor—right? We . . . we already know about this. Someone discovered this before you. Actually . . . we’ve known about this almost since we discovered the sponge. In fact, it is a crucial part of how we treat the diseases.”  “What?”  The woman at the head of the table widens her smile. “We have this under control! There is nothing for you to worry about. We’ve known about this for some time, and we’ve taken our research on P. meyeri in some very interesting directions! Some of the techniques used to treat certain mental illnesses these days in humans, physically changing motivation especially, can be mapped to the nervous system of P. meyeri! And the best news is that it does not feel pain, or grief, or any sort of common human emotion at all, really. Quite frankly, it still more or less fits the guidelines listed for which animals are ethically allowed to be experimented on! And with how crucial it is for treating diseases, we have applied for and received an approval to continue working with it too.”  Noor opens her mouth to protest, when another older woman, a kind expression on her face, speaks up. “You cannot deny how important these sponges are to treat those new diseases. You, or someone you know personally, must have been affected in recent years. And I guarantee that P. meyeri can or did save their life. It is an unsettling prospect, sure, to use a possibly intelligent creature in this way. But ultimately, do you not think we should prioritize our own species? Our loved ones? Our family, our friends? Without this treatment, people would die, Noor. Millions of people. Do you really want to see that happen, knowing there is a way to prevent it all?”  Noor feels sick. She doesn’t know how to respond. “Why did you call me here, if you already know what I found? And why don’t other people know?”  The man who spoke earlier replies. “Great questions! Two reasons. We think it’ll be best for you to switch departments and work directly with using the sponges to treat diseases instead of studying its larvae and reproduction. Maybe it’ll make you . . . understand a bit better, why we need to do this. And, we need you to sign some contracts. See, it might lower the morale of some of the people who work here, if what you discovered gets out. Have you told anyone yet? Your crew member on the sampling mission, perhaps?”  Noor shakes her head. “I closed the viewport connection I had with Matias right before I scanned. It was only audio communication with him, and I didn’t say anything out loud about the neurons. You can check the helmets’ histories if you want.”  “Good! Sign these straight away!”  “What happens if I breach the contract? If I do tell someone else?”  The man smiles. “Well, you would agree to get your memory optogenetically wiped clean of these events, if that happens. And we would probably have the person you told sign the contract as well.”  Noor almost laughs. “Sorry, I don’t think I can do that.” She gets up to leave.  The woman at the head of the table calls to her. “Of course, take your time to decide. But I strongly advise you to sign.”  On her way out, the old woman speaks. “Dear, these sponges can be very dangerous things. It’s probably for the best that we control them! Do sign the contracts.”  The man speaks again too. “You know, you remind me of Dr. Meyers. Did you ever get a chance to meet him, before that terrible, unfortunate event? He was such a kind man. It’s a shame, what happened to him, eventually killed by his own discovery. I think it’s best that you sign these.” He holds the contracts out toward her.  And Noor, her heart pounding and her stomach churning, takes them from him before leaving the room.  When Noor gets home that day, she uses Sana’s touchscreen to call Matias.  “Hey, we need to meet up, as quickly as possible. See you soon.”  “I promise, Noor. I’ll take a look at the gemmules. And if anything happens to you . . . I’ll make sure the research is published. I’d want to do that for you.”  “You take digits zero to nine and assign each one to a music note, starting from middle C and going up into the first few notes of the next octave. Then, you rewrite the first twenty-six terms of the Fibonacci sequence using the music notes, zero as middle C, thirteen as DF, one hundred and forty-four as DGG, like that. For the repeated one, sharped D is used. Is that right?” Irene looks at Sana, and Sana nods at her.  Irene and Sana sit together on the bottom stair of Noor’s home. Sana is wearing a small synthesized paper party hat with “12” written on it. It’s Sana’s birthday party, and Noor has decided to invite Irene over, just for this one day. She wants her daughter to meet the woman she hopes to marry someday, even if Sana doesn’t know who Irene really is quite yet. She will . . . if all goes well with what Noor’s planning.  Irene continues, “And within a measure, one-digit Fibonacci terms would be quarter notes, two-digit terms eighth notes, three-digit terms triplets, and so on, ensuring that each ‘letter’ would take up one ‘beat’ in each measure of the cipher, with each measure holding a word. Looking at the time signature of each measure, whatever number is above four is the number of letters in the word the measure holds! I love it, Sana! That’s an awesome cipher you’ve created.”  Thanks, Sana plays.  “Could you play that one more time, but a lot slower? I want to figure it out.”  Sana nods and plays it again much slower.  “That’s a T . . . then H . . . A . . . that’s N . . . Oh! You’re playing ‘Thanks!’ You’re very welcome.”  Noor chooses to walk over at this moment. “Sana, you showed Irene your cipher?”  I like her, Mommy. She told me that she volunteered and helped assemble the zero-emission machines used to keep the conditions around the last coral reef from deteriorating for another decade. It’s going to keep a lot of critically endangered species alive for a little more time.  Noor smiles at Irene. “You never told me that you helped save the last coral reef!”  Irene shrugs.  Sana types on her touchscreen and shows it to Irene. It says  I like you  on it. Irene grins from ear to ear, and it makes Noor’s heart sing. It’s these moments that make her really question what she’s doing. She thinks to herself. If the research doesn’t work out . . . would Irene understand? Would I be able to go through with it? Noor wishes for the millionth time that she could trade places with Irene. And she wishes for the millionth time that she had the strength to tell Irene what she’s doing.  One of Sana’s friends motions something to Sana, and the child leaves Noor and Irene to go into another room. Noor sits down on the bottom stair.  “How’s the treatment going?”  “My small intestine is around one-fifth sea sponge now! Can you believe it? Well, not really a sea sponge, but made of these almost stem cell-like things inside a sea sponge, that replace everything they need to replace all by themselves! Apparently, they learn to replicate my body’s HLA variants in the process, release antagonists for pattern recognition receptors, NK-cell activating receptors, and T-cell receptors, and have a high surface concentration of sialic acid, so there is no immune response! It’s an amazing treatment. Still a long way to go, but I’m feeling good about it.”  Noor looks away. “That’s nice, Irene. I’m glad it’s going well.”  Irene laughs. “You know, I’ve been thinking about it. You obviously don’t have to tell me if I’m right or wrong, but I’m fairly sure this is what your top secret line of work is. I mean, you get weird every time I or anyone else mentions P. meyeri. Besides, I like to think you’re working on the stuff that’s saving my life. Noor, my beautiful knight in shining armor.”  Noor feels herself begin to tear up. She pulls Irene into a tight embrace.  “I love you so much, Irene. You know I’d want you to live forever, if that was possible, right?”  Irene gently returns the embrace, and caresses Noor’s back lightly. “Of course, my love. Of course I know. I promise you, I’ll be okay. I’ll get better, and I’ll live.”  “Hum Aap Ki Ankhon Mein,” by Geeta Dutt and Mohammad Rafi plays softly in my kitchen as I pour the fragrant filter coffee, made from rice milk and Irene’s favorite blend from the orbiting gardens, which I spiced with cardamom and cloves, into a cup. Irene is looking out a window. She seems lost in thought, but she’s smiling, which makes me smile a bit too. She shakes off whatever she was thinking about and takes the coffee from me.  “Do you want a sip?”  I shake my head. There’s no way I can drink coffee anymore, it would leave me doubled over in pain for hours. Over the past two months, twenty pounds have just dropped off my body, regardless of the amounts I eat, and I feel cold a lot these days. My reflection in the mirror sometimes doesn’t register to me as what I look like these days, lips devoid of color, sunken eyes, the whites sometimes taking on a yellowish tinge, and massive dark semicircles beneath them. Truthfully, my appearance was always a bit of a point of pride for me, and the bold lipsticks I used to wear not looking quite the same on my face anymore stings more than I’d like to admit. I forget all of that when I’m with Irene, though. She makes me feel absolutely beautiful, always.  Irene takes a sip of the coffee. “It’s delicious! I didn’t know you could . . . is making coffee still in the realm of ‘cooking’?”  I sit down across from her. “Honestly, I have Noor to thank for this one too. You know, she and I have a similar cultural background. When I was younger, I was a lot more religious. Still don’t know quite why it happened that way, my mother was pretty religious, but my father was an atheist, and there was never any pressure to believe in anything. But I think I was looking for a way for the world to make sense. Not in an ‘everything is going to be okay’ way, but more of a ‘there is a reason for everything, and a meaning to everything’ way . . . I don’t know. Anyway, I stopped believing in any sort of higher power eventually, and when I did . . . a part of me felt like I wasn’t really, truly, allowed to take part in celebrating various aspects of my culture anymore. I know, it was kind of silly, but I cut myself off after that, from the clothes and the cuisines and the songs and the events and . . . the community, I guess. Noor wasn’t religious either, but she very much participated in celebrating her culture anyway, and I think seeing that made me feel like it was okay. So . . . enjoy my family’s recipe for filter coffee, it’s pretty good, isn’t it?”  Irene holds my hand. “I see you’ve been influenced by her love of old Bollywood songs too.”  “I think that’s definitely new for me, but I really like them. I have no idea why she enjoyed listening to such old songs though, she never thought much about it herself.”  Irene puts the coffee down. “I think, for her, it was all about the idea of connecting to past generations. Think about all of the people, who haven’t been alive for a century or more now, watching those movies, or listening to those songs. It makes them seem more human, doesn’t it? You’re kind of hit with that realization that these people lived and died, they were just like us. And it’s an interesting thing to feel. Once, she and I went to a redwood forest, saw a fourteen hundred-year-old redwood tree. She just stood there, for almost half an hour! She was thinking about how many people had stood where she was standing, how many people over the centuries saw that tree. I think it’s the same reason she listened to those songs.” Irene sighs.  “I remember that day! It was so nice, walking around with you, in the fog-covered forest. We had such a wonderful time, didn’t we?” I catch myself too late. “I mean, you both had such a wonderful time, didn’t you?”  Irene looks at me and frowns. She doesn’t say anything for a long time.  “What is it?” I ask her.  “What kind of a person am I, for doing this?”  “What do you mean?”  She takes a while to respond. “I don’t know exactly why I’m with you, Nithya. I don’t know if it’s because of you, or because the more time I spend with you, and the longer you live Noor’s experiences, the more you remind me of her, and the more I can almost pretend she still exists. It’s unfair to you, you’re an entirely different person.”  “Well, if we’re going there, what kind of a person am I for being with you? Instead of letting you grieve, I kept meeting you, even if I knew Noor was influencing me, even if I didn’t know entirely whether it was me that was falling for you or her, even if when I’m with you sometimes I forget to keep track of where I end, and she begins.”  “Maybe we’re both being selfish.”  I sigh. “Do you want to stop seeing me? Because even if it’s selfish, or wrong, or unethical, I don’t think I want to stop seeing you. Maybe that makes me a bad person, or a weak person . . . but the truth is that I’m in love with you. And frankly, I don’t care where it’s coming from. It’s the same set of neurotransmitters and it’s the same physical process, and like it or not, this is still my lived experience, even if it now includes someone else’s too. And my lived experience is telling me I love you.”  Irene starts to tear up. “I don’t want to stop seeing you! And I love you too! But you shouldn’t love me. And I know for a fact that you’re not going to love me for much longer, too.”  “What, because I’m sick? I can’t believe you just said that to me!”  She shakes her head, speaking through tears. “No, it’s not that at all, it’s something else. Lots of other things, actually. You’ll find out soon, and then you’re going to hate me! And you’ll agree that I am a terrible person for seeing you, for letting you fall for me . . . I just liked you too much! And you reminded me of her . . . and in a way you brought her back to life for me. But I did something terrible, Nithya! And soon you’re not going to love me anymore, I know it.”  I try to touch her shoulder, but she shrugs me away. “What could you possibly have done?”  She takes a deep breath and wipes her tears away. “If it wasn’t for something I did, something terrible, Noor would have been alive right now. I think I killed her, I think it was all my fault. I didn’t know what would happen! And now she’s gone, forever, and all I can do is grasp at the occasional, flickering ghost of her that I see in you.”  Irene turns away from me and leaves my apartment. I let her.  Who are you? Are you me, in my current, lived experience? Are you my disembodied brain, lying miles away from my corpse, looping through my memories to prepare a set of light pulses? Or are you someone else entirely, a stranger, maybe, living out some of my most memorable moments? I’ve been searching for something to show me which one it is, a sign, a glitch, a flash in my surroundings? But it’s an impossible quest. I can only wonder who you are.  This is the one Irene has. The phage has two capsid heads, each containing a packet of viral DNA, and two protein sheaths, each ending in spider-leg-like fibers. Instead of attacking bacteria, this phage goes after cells in a person’s small intestine and esophagus.  Spread through the air, as soon as phages enter a person’s mouth, they will make their way down the esophagus, either binding to squamous cells on the esophagus and injecting the cells with one vDNA packet or continuing down the esophagus until they reach the small intestine, where they then are able to bind to enterocytes and inject them with the other vDNA packet. After being infected, the cell enters a lysogenic phase. The vDNA packets are tied to a protein mimicking a nuclear localization signal. They trick importin receptors into bringing the vDNA into the nucleus of their host cell. Here, the vDNA is incorporated into its genomic DNA, and as soon as this occurs, the infected cell’s function is altered for the rest of its life.  In the small intestine, lysogenic enterocytes become immensely oversized to make room for as much eventual phage production as possible, in the process, disrupting nutrient absorption. Severe internal growths, agonizing stomach pains, diarrhea, vomiting, and eventually fatal malabsorption result from this. Eventually, close to natural cell death, the vDNA tells it to enter the lytic stage, and it creates as much phage as it can carry before bursting and releasing it. The phages that were just released either infect other enterocytes or travel with bile, as the lysogens around the recently burst cell send signals to the lysogens in the esophagus. When a lysogenic enterocyte in the small intestine bursts, the lysogenic squamous cells in the esophagus receive signals to trigger gastroesophageal reflux, and it induces a coughing fit, bringing the virus-carrying bile up into the person’s mouth and then spreading into the air to infect other people.  For a while, there was no way to stop the lysogenic enterocytes from eventually proving fatal without stripping the entire lining of the small intestine and replacing it using stem cells, an expensive and invasive procedure that runs the risk of reinfection, since the proteins on the surface of the enterocytes wouldn’t change. Then came the discovery of P. meyeri.  With P. meyeri, all an infected person has to do is take a pill every day over a period of time that contains pre-specialized archaeocyte cells from the sponge. The highly specific cells target lysogenic enterocytes and simultaneously work to destroy them and perform normal enterocyte functions themselves. P. meyeri archaeocytes end up entirely replacing the lysogenic enterocytes, and the infected person is cured. Since most of the proteins on the new cell surface are very different, there is no risk of reinfection as well.  The woman from Noor’s earlier meeting leads Noor to a window looking into a room with a single P. meyeri sponge in the center and turns off the light in the hallway around them. “I’m glad you signed the contracts, Noor.”  There’s some sort of a light system set up inside, with tiny blue LEDs everywhere. The main lights in the room go off as well, and the LEDs turn on. A dancing blue light display begins, in a similar yet also quite different recursive pattern to the ones Noor saw in the cavern during the larvae release.  The woman turns to her. “What we’re doing is tricking the sponge into believing the lysogenic enterocyte cells we fused to the inner linings of the channels that run through it actually belong to it, and that the infection will eventually kill it. The way P. meyeri responds is amazing. It synthesizes its own, new, modified enterocyte-esque cells, using the many archaeocyte cells it has, and has them slowly but surely destroy and replace the lysogenic enterocytes, ending up fused to the inner linings of its channels instead of the infected cells.”  They move to a window looking into another room full of sponges. The woman continues “This is where we take the sponges next.” After Noor realizes what’s happening, she feels nauseated. They’re stripping the inner linings of the sponges’ channels. Autonomous machines take cylindrical tubes with sharp edges, and, entering the few pathways without cutting into the nervous system, essentially shave off the new layers of the sponge.  After the archaeocytes have been stripped away, a small trickle of what looks like the dark corrosive liquid drips out of the sponge. Noor turns to the woman next to her. “Is that . . . ”  The woman nods. “It’s a diluted form, so it doesn’t do as much damage to the sponge, but yes, for some reason it secretes that same substance after we strip it of the newly specialized archaeocyte cells . . . Is something wrong?”  Noor frowns. “There must be a way we can use what we already know to come up with a different treatment, without harming or harvesting any more P. meyeri spon—”  The woman smiles and puts her hand on Noor’s shoulder in what looks like an amiable gesture, but she grips the shoulder slightly too tight. “We’ve been doing some research in that realm, but we’re not going to stop using P. meyeri. What happened to Dr. Meyers was sad and terrible, of course, but think about the big picture here, Noor. Once we fine-tune our control of this thing, we can use it for a lot more than just treating a disease.”  On her way out, Noor stops by the building where Matias works and checks in with him. “How is it going, with the you-know-whats?”  “I’m sorry Noor. I don’t know if it’s going to work out. Are you still going to go through with your paper?”  Noor sighs, but eventually nods. “I don’t feel like I have a choice. This is just what I have to do . . . it’s the ethical thing to do. Are you still going to support me, even if your part doesn’t work out?”  Matias looks down. “My promise was that if you were right about what you think happened to Dr. Meyers, and if something terrible happens to you too before you publish it, I’ll make sure it’s published, because that’s what I think the ethical thing to do would be. But . . . if my part of this doesn’t work out . . . if there’s no alternative . . . I don’t think I can support you besides that one situation. I’m sorry.”  Noor wakes up to Irene shaking her, forcefully, with tears streaming down her face. “How could you?!” Irene speaks through sobs. She’s holding a stack of synthesized—Oh. No . . . the paper . . .  Noor sits up. Irene speaks again. “Answer me! Tell me there’s been a mistake. Tell me you haven’t written up something that will, if approved, get me killed.”  Noor gets out of the bed and whispers. “I’m sorry.”  “Is there any other cure?”  Noor shakes her head. “No . . . but there’s always hope, maybe—”  Irene starts laughing, bitterly. “This whole time, I thought you were working on the thing that’s been saving my life. But actually, it’s quite the opposite, isn’t it!”  “It’s an intelligent creature, Irene! It cannot be okay to exploit it like this!”  “In any other situation, I would agree with you. But this was an emergency! An actual, serious threat to our existence. And if this treatment goes away, what’s going to happen to everyone currently infected?”  “You haven’t seen P. meyeri like I have, Irene! If you could just try to understand where I’m coming from, maybe you’d see that—”  Irene scoffs. “I do understand where you’re coming from. I read every page of this thing. But have you, ever, once, truly considered what this is like from my perspective? I mean . . . and . . . why did it have to be you, Noor? Why you?”  Noor doesn’t know what to say. How did it escalate so quickly? Why is this happening so fast?  Irene begins putting on her jacket and collecting her belongings.  “What are you doing?”  “I’m leaving. I can’t do this.”  “What are you doing with my paper?”  Irene stops, grimaces, turns to Noor. “I can’t let you do this.”  No, no no no. Noor follows Irene as she walks to the door.“Irene, think about it, please. Sit down, we can talk about this. You . . . don’t know what the place I work for is like. Something really bad might happen. Please, just think about this! Plea—”  Irene opens the door, turns around, and says, “I don’t want to die,” before leaving and slamming the door shut behind her.  I wake up to one of the foulest scents I have ever encountered. Looking down, I see that I’m lying in a pool of green liquid. I shit myself. “Ew, ew ew,” I repeat to myself over and over again as I unplug the tubes in the sensory deprivation chamber and rush to the bathroom to clean myself up. After thoroughly cleaning and disinfecting the sensory deprivation chamber, I take my morning pill to trigger the hallucination, like I do every day, and sit on the floor to wait.  Something’s different this time. Until now, every hallucination has been about my own life, nothing from Noor’s ever entering them. But suddenly I’m sitting at a beach I’ve never been to before, and that is entirely different from what my own imagination normally invents. I try to move, but I can’t move at all. I look out to see . . . Sana is in the distance . . . half buried in the sand? The tide begins to come in, but she doesn’t react. Water rises and rises until it’s covering everything, and I try to move to her, to my daughter, but I can’t move, and now she’s under water, and now I’m under water, and I can’t scream because it’ll fill my lungs, but soon it’s unbearable and I gasp, inhaling saltwater, and then my vision goes black.  The darkness soon dissipates, and I find myself shaking, with tears running down my face, curled into a fetal position on the floor.  There are three people named “Matias Rodriguez” living in the nearby area. I try calling the first two from my touchscreen, but I don’t recognize their voices. I recognize the third voice instantly.  “Hello?” he says.  “Hi, I’m investigating Noor’s death, and I wanted to ask you a few questions.”  “I’m sorry, I don’t know if I can help you. I don’t know anybody named Noor.”  “Excuse me? You went on a sampling mission with her . . . do you remember that?”  “Ah, I see. I was scheduled to take part in a sampling mission some time ago, but I got a pretty bad head injury and was unfortunately unable to do the mission. My memories are very poor quality or nonexistent for a while after that, but I’m back to normal now.”  Oh, fuck.  His memories . . . I think I know what happened. Fuck. I sigh, but then I remember something and my heart sinks even more.  “How’s Syd doing?”  Matias groans. “They’ve stopped communicating with me entirely now! Not even through their touchscreen . . . it was bad enough when they wouldn’t change their damn expression, but now . . . Wait. How do you know about Syd? Who are you? Have we met?”  Damn it, poor Syd. “I’m sorry to tell you this, sir, but I’m afraid you might have had some of your memories wiped.”  Matias’ tone changes abruptly. “Did Syd put you up to this? Did my husband? Endless paranoia in my family these days, I swear. I’m going to end this call now. Good day.”  I meet Irene at the same café we met at months ago, spot her sitting in the same booth, drinking the same coffee. I feel like if we meet here, not only will our conversation go unheard in the hum of all the other conversations taking place around us . . . we will be more inclined to be civil. I will be more inclined to be civil. It’s not just my anger driving me right now, it’s Noor’s too.  I sit down across from her. She smiles at me, weakly.  “Irene . . . what did you do? And . . . why did you keep this from me?” I feel tired, all of a sudden.  “I’m sorry, I couldn’t risk telling you earlier. I didn’t want you to hate me. I wanted to have just a little bit of time with you, even if I knew it would end up like this eventually.”  I shake my head. “I can’t believe I didn’t see it earlier. This whole time, I was just . . . blinded by my feelings for you. Damn it, for months! What did you do with her paper? And what else have you been keeping from me?”  Irene looks down.  “ . . . Is there something else you’re keeping from me?”  She flinches.  I sigh. “Look, at this point, I would appreciate you just coming clean with me, okay? Just tell me what you know, please, for her.”  Something seems to click into place for Irene. She looks very determined, all of a sudden. After a long stretch of silence, she nods, and says “Fine. Okay, fine. You’re right. I should do this, for her . . . she deserves justice. Those assholes need to be taken down. Screw it, I’ll tell you everything.”  “Thank you. Fill me in, from what you did with the paper to whatever else you haven’t told me. Tell me everything. Starting now.”  She does.  She tells me that she took the paper and asked around the place where she was getting treated until she found the contact information of Noor’s workplace. She met with three of their representatives, a young woman, an older woman, and a middle-aged man. They thanked her for the information, told her they would “take care of it,” and that they would be in touch with her soon.  Irene looks back up at me, shaking her head sadly. “I didn’t know what they meant by ‘taking care of it,’ Nithya! Just slightly over a week later, she died!”  “Why did you keep this from me? Self-preservation, again?”  Irene winces. “Maybe a little bit, yeah . . . but I like to think I would have reported all of this to you, immediately, if they hadn’t made me . . . ”  “Made you do what?!”  “Please try to understand! They threatened me, they threatened to hurt Sana! I had to, Nithya!”  “ . . . What?”  “ . . . I made you sick. It was in the first box of the set of pills I gave you. I put the phage in, too.”  You did what?! I stand up to leave.  “Nithya, wait! You don’t understand! I’ve been protecting you, this whole time! I’ve been telling them you’re doing the treatment! They thought if you had it, you wouldn’t side with Noor. They think you’re on their side!”  “You’ve been spying on me too? What the actual fuck? All of that stuff, about wanting to know what it’s like in her head, was a lie?”  “No, that came out all wrong! I haven’t told them much, I promise! Your investigation is safe! I swear, I’ve been protecting you! I’m on your side Nithya! And it wasn’t a lie. I wanted to know what her thoughts were like, desperately. That wasn’t a lie at all!”  I can’t look at her anymore. I walk out the door. She was threatened, though. Hear her out. A little voice pops into my thoughts as I leave the café, and I can’t tell if it’s coming from myself or from the Noor part of me. I can barely distinguish the two anymore now, and I’m tired of trying to.  Sana, my daughter, I am so sorry I left you. I love you, so much. Maybe someday, I will see you again. Would you recognize me? Would it still be okay? I miss you Sana. I love you. I’m so sorry.  Mommy I want to tell you about something. Sana plays her flute to Noor, standing in the doorway to the living room.  Noor sits at the coffee table, typing into her touchscreen. She stops, closes her touchscreen, and smiles at Sana. “What is it?”  Sana begins an uncanny melody. I have been thinking. I started communicating like this to incite action to stop the climate catastrophes. And I still care about that so much. But I think along the way I figured out that I prefer communicating like this to communicating any other way. I like the control I have over my flute and I like how it sounds and I like that it is a language I invented. I think even if the demands were all met I would still type in my touchscreen and play my flute to communicate. Is that okay?  Noor nods. “You know, I have to admit that I struggled sometimes to accept your method of communication. I tried to hide that from you, and I’m really sorry if any of that came through. But over the past couple years, Sana, I’ve realized that communicating like this makes you happy. And I’d never want to get in the way of that. I’m happy for you, and I love you so much. Of course it’s okay. Is it okay if I give you a hug?”  Yes. I want to hug you too. Sana moves to her mother and embraces her. Noor holds her daughter close for a while.  Noor recognizes the knock, and she opens the door to see Irene.  “I’m so sorry Noor! I told them. I told the people you work for. I just don’t want to die. I really don’t want to die.”  “Hey . . . come in, it’s okay. I knew you did this, it wasn’t hard to guess. Come inside, we left things on a weird note last time.”  “Is Sana here?”  “No, she’s at school.”  “You’re not at work? I mean, I should have thought that through before showing up, but I’m realizing it now.”  “ . . . No.”  They move to the living room couch and sit next to one another. Diffuse light comes down through the skylight above them. Noor turns to Irene, and half smiles.  “You don’t have to be sorry Irene. You were acting out of fear for your own life . . . and in a way, I did betray you. But I wish you could have seen what I’ve seen before making that decision. Especially because the research company I work for . . . I think they’re capable of some pretty awful things. But I prepared for this, just in case. It’s why I got the light-gated-ion channels two years ago.”  Irene frowns. “What do you mean? Is . . . is something going to happen to you?”  Noor sighs. “I was trying to tell you this earlier. But . . . don’t worry about it right now, okay? I forgive you for what you did, can you forgive me? I just . . . for a little bit . . . want it to go back to how it was. I love you, Irene. And that hasn’t changed. Can we go back to how things were? Please? I really need that right now.”  Irene thinks for a long time, but then pulls Noor close to her. They hold each other for a while, and then Noor kisses Irene. Irene kisses her back. “I love you too. I want it to go back to how it was before, too.”  I wander aimlessly around the town, trying to collect my thoughts. With every session of Noor’s experiences, I lose my sense of self more and more. I don’t quite know who I am anymore, and I keep asking myself, would Nithya do this? Would Noor? Is this Nithya? Is this Noor? But it’s exhausting now, trying to keep track of my memories and my thoughts, and trying to remember which are hers and which are mine. Mine. But who am I?  With those two years of Noor’s experiences came a lifetime of memory as well, something I was not anticipating at all. But I should have known. After all, what are our thoughts, our experiences, our reality, without our memories? Of course I remember things now that weren’t necessarily events taking place in Noor’s experiences. Her every recollection of some other past event was encoded in her brain activity too, her memories within a memory. And subconsciously as well, memories were coloring her every thought, and those not-so-obvious rememberings were transferred to me too, running underneath my thoughts now too. It’s impossible to live a snapshot of someone’s experience without inheriting everything that came before that snapshot too, whether it’s immediately obvious or somewhere under the surface. Frankly, it’s futile to try and separate myself from her at this point. I can’t even remember how I used to think before I lived that piece of her life.  Maybe I should stop separating them. All those times, making love to Irene, when I released my hold on these two identities, and allowed them to blend into each other, it felt so right! Irene. Noor forgave her. Would Nithya? Would I, whoever I am now?  Maybe I’m exhausting myself, thinking that I’m separating the two identities, when I’m really deluding myself trying to categorize my thoughts into what I believe Noor would think and what I believe Nithya would think, when in reality there is no way to know where those thoughts are truly coming from.  I should let them blend.  I put on Noor’s favorite song, “Pyar Kiya To Darna Kya,” sung by Lata Mangeshkar, and decide to stop trying to control my own mind. I let the music wash over me, I let the two identities come together, mixing into one another, memories and thoughts and experiences and reality.  I’m not quite either of them, any longer.  I smile. I think I know what to do next.  I call Irene from my touchscreen. As soon as she picks up, I say, “Listen, if you’re really on my side, you’ll help me finish what Noor’s started. And you can begin by working with my partners Marie and Anthony, to restore the memories of a man named Matias Rodriguez.”  After a long pause, she responds. “ . . . I will. I promise I will.”  I arrive at Noor’s aunt’s house, where Sana lives now, and I take a deep breath before knocking on the door. Noor didn’t know her aunt super well, but she seemed nice, and didn’t live too far away.  I’ve just started to consider knocking on the door again when it opens, and she’s standing right in front of me, flute in hand. Sana. It takes all my strength to prevent tears from filling my eyes. I’m immediately flooded with joy. My daughter. It’s been so long . . . But she’s not my daughter . . .  The girl takes out her touchscreen and types  Who are you  on it. I clear my throat. “I’m Nithya . . . we met once, several months ago. I’m investigating your mother’s death. Can I come in?”  Sana stares at me for a moment before nodding and letting me into the house. She types on her touchscreen  I did not recognize you at first. You look different now. “Yes, I’ve become sick. Hey, can I talk to your great-aunt? I need to ask her a few questions.”  Sana leads me to the living room of the house, where an old woman sits on a doughy blue armchair, facing out the window. Next to her is a beautiful upright piano, with several pages of sheet music on display above the keys. Sana, in the adjacent room, has begun to play something on her flute.  I turn to the old woman. “Hi Ms. Bakshi. My name is Nithya, and I’m investigating your niece’s death. Noor was working on something, a paper, before she passed away. Do you know if any copies of her work still remain? On her touchscreen, or any physical copies, or anything related at all? It’s crucial for our investigation.”  Ms. Bakshi sighs. “I’m afraid you’re months too late. I had brought everything Noor had worked on to this house, but it’s all gone now. There was another group of people who asked me the same question several months ago, very soon after Noor’s death, with a warrant to search the house. They took all of Noor’s research, all the physical copies, and all the electronic ones too. I’m sorry.”  My heart sinks. It’s all gone. I don’t think I can pull the entirety of Noor’s paper out of her memories. There’s no hope now, unless Matias knows something, maybe? Maybe he has a copy!  “Thank you, Ms. Bakshi. Don’t worry about it. I should probably get going now.”  “I’m sorry I couldn’t be of more help. I wish—Hey, Sana? Could you keep it down, just a little bit? The grown-ups are talking here!” She turns back to me. “I don’t know what it is with that girl and that strange song. She plays it all day, every day, several times in a row. I can’t say I like it too much, but if it makes her happy, I don’t have the heart to ask her to stop. Do you want something before you leave? Chai, coffee? I have some freshly made rice-milk peda in the kitchen! You must try some.”  I shake my head. “I’m sorry, there’s not much I can consume properly anymore. But thank you for the offer.”  As I take my leave, I pass by the piano, and something catches my eye as my gaze drifts over the sheet music. Wait a minute . . .  And then, I actually start to hear what Sana has been playing on her flute this whole time.  . . . The choanocytes lining the innermost channels of a Panaceius meyeri sponge differ from choanocytes in many . . .  It’s the paper! My eyes fill up with tears. I go to Sana. “What you’re playing right now . . . it’s your mother’s research, isn’t it?”  Sana stops playing her flute, looks up at me, and nods. After some time, she plays You understand my language?  I smile. “Yeah, I do.”  You really have lived a part of my Mommy’s life.  I kneel next to her and tears start flowing down my face. “Yes, Sana. I have. And because I have, I know she loved you so much. I’m . . . I’m so sorry you’ve lost her. I’m so, so sorry.”  Nithya. I would like a hug. Could I give you a hug?  I nod. Sana hugs me, and I can’t stop myself from crying into her shoulder.  When she lets go, she takes the stack of sheet music from the piano and hands it to me. I sit and look through it, remembering Noor painstakingly documenting all of it . . . But there’s a new section now, at the end, with an annotated name in the margins, still written in the Fibonacci-sheet music language. Matias Rodriguez? I look at the title of the new section, and I can’t believe my eyes.  It’s titled, “The Cure.”  It turns out that there is a way to grow sponges out of the P. meyeri gemmules, and sponges that grow from them are not conscious in any way, they do not have the extra layer, or the corrosive liquid! What Matias did was take certain genes from the pre-specialized archaeocytes from a conscious P. meyeri sponge and introduce them to the gemmules. The sponge that grew from the gemmule ended up having inner channels lined with the specialized archaeocytes. And this sponge had no qualms about reproducing in the simulated settings within a research lab. When the sponge from the gemmule reproduced, it did not create larvae, but only gemmules of its own. And when the next generation of gemmules became sponges, they also contained the specialized archaeocytes. Matias had found a way to create a population of sponges that were as ethically alright to experiment on as other sponges discovered before P. meyeri, that contained the cells necessary for the treatment and could reproduce! I’m fucking stunned. This could save my life.  I thank Sana and her great-aunt for their time over and over again, filled with happiness. As I’m about to leave the house, Sana tugs on my sleeve and then plays something on her flute again, looking right at me.  Nithya. About what you said earlier. I do not know if I believe Mommy is entirely lost. Will you visit again? I want to have more conversations with you. And I want to meet you again.  I grin at her, and nod. “Sana, I can come here as many times as you want me to, for the rest of my life. Thank you for making your cipher. I think it’s a lovely way to communicate, and it truly saved the day. I’ll see you again soon, I promise.”  After I leave the house, I begin to walk away, when a small synthesized-paper envelope falls out of the pages of sheet music. There’s a single word written on it, still in the Fibonacci language. A single measure, time signature five-four. Eighth notes E, D. Sixteenth notes D, A, high E, high C. Quarter note F. Triplet notes E, F, F. And finally, quarter note F, again.  I can’t help but smile. I recognize the name immediately.  Noor sits at a desk, writing out sheet music on synthesized paper. An envelope sits next to what she’s writing, with “Irene” written on it in the Fibonacci-music language.  Dear Irene,  My love. I do not know if you understand exactly what you did. But you might soon. If that happens, I would want you to know I forgive you. And that I still love you. And . . . I understand what you did. But I also want you to know what it is like from my perspective. I want you to see P. meyeri for yourself. Feel what I felt for yourself. That is why if this is ever found . . . I would want you to be the one to live out my experiences. I do not know if it is going to happen like that. But I would want you to.  There’s good news too. Matias found a cure! I have just finished adding it to the paper. You will live my love. No matter what. And hopefully we can get this released soon and nothing will happen to me and we can both live together for decades more . . . happy and in love. I would like that very much. I love you Irene . . . this probably will never reach you, but I wanted to write it anyway.  Love,  Noor  Irene and I sit together, drinking coffee next to the sensory deprivation chamber in my living room. Oh man, I missed the taste of coffee so much. It’s been a month on the new treatment plan, and I’m already feeling so much better.  Matias’ memories have been restored. What happened was that he thought he would try to convince the research company to stop exploiting P. meyeri, since there was an alternative. But it didn’t work, and they hinted to him of the other, non-medication-related purposes that they could use P. meyeri for. They threatened him and made him sign the contracts, but he went to Noor with his research anyway, not knowing that Irene had told the research company about her work already. After Noor died, representatives from the company found Noor’s completed paper, after searching her aunt’s house, and discovered that Matias had breached the contract. He had his memory forcibly wiped.  With Irene’s help, Matias got his memories back, and working with me, we translated Noor’s paper back. As promised, he made sure it was published, and especially with the world knowing about the cure he discovered. The corrupt leadership of the research company was quickly removed and faced serious consequences. Numerous protections were put into place regarding disruption of the P. meyeri colonies and work is being done now to try and figure out a way to communicate with the sponges. For now, only unintrusive ROVs are allowed down there.  I look at Irene, drinking her coffee next to me. I wonder, if there hadn’t been a different cure, if I was still sick . . . would I have forgiven her? I shake the thought away. What’s the point of speculating, distressing myself with “what if”s? She had more than proven she supported me . . . and she was making sure the research company didn’t suspect anything about me the whole time. And, the truth is, ultimately, despite everything, I do still love her. Every part of me tells me I still love her. And she still loves me. So, if we love each other, and we make each other happy in spite of everything, why shouldn’t we just . . . be together?  I move closer to her, and she puts her arm around me. I rest my head on her shoulder. “You know, Irene, I don’t know if I’ll ever be Noor.”  She smiles, and she kisses me. “I don’t care. I love you.”  “And I don’t know if I’m entirely Nithya anymore, either. I think I’ve become someone else, entirely, the result of Noor’s memories and Nithya’s memories blending together, which gave rise to someone new.”  She kisses me again. “I still love you.”  This makes me smile. But then I remember something, and I sigh. “There’s just one set of light pulses left, Irene. It’s her death. I don’t know if I can do it. I’ve been putting it off. Especially because, while I know she doesn’t understand that she’s in a loop, I know she is, and I don’t want her to experience that again. I just don’t know if I can do it.”  Irene holds me closer. “Then just don’t do it. You don’t have to force yourself to do that, both for your sake and for her’s. The people responsible have been punished, chemical analyses months ago figured out what literally caused her death . . . there’s no need for you to play the light pulses.”  “You really think it’ll be okay if I don’t?”  “Of course, Nithya! You are under no obligation to play that awful experience into your head. I promise you.”  “Alright, I don’t think I will, in that case.” I settle my head back onto her shoulder. After a while, I continue. “You know, I’ve been thinking. Noor wanted you to be the one to live out her experiences, right?”  “Yes, but look. I’ve been thinking about this too. I’m actually really happy it was you. If you hadn’t done this . . . I would never have met you. I would have had her with me, always, but I wouldn’t have had you. I’m actually really glad it happened this way, Nithya. Besides . . . we’ve talked about this before, her patterns of neural activity are tailored to fit yours, and there’s no way to get those light pulses again.”  I look at her. “No, I’ve been looking into this, and I think there is a way, Irene. I think there is a way you can live some of her most memorable moments, too.”  So, who are you? Are you my current, lived experience, as I wait for the sedatives to put me into a temporary unconscious state? Are you my brain in the next few hours, almost done looping through my memories of the past several months, to put together a set of light pulses? Or is it you, Irene, my love?  Is it you, living my memories of the past months, which would certainly include some of Noor’s memories too? I wonder which of Nithya’s memories will make it through, and which of Noor’s will. I hope you’ll tell me all about it soon. And who knows how long the entire set of experiences will be? If they could condense two years of Noor’s life that much, how long will it take for you to live this tiny fraction of mine? Hours? Days? You’re in a waiting room outside right now, and we’re going to have a lovely day together after this procedure is over. I hope we will have a lovely life, together, too.  But no matter what, right now, I love you deeply, and Noor loved you deeply. And if you wanted to, my love, in your mind, you could keep us looping endlessly. Arula Ratnakar is a scientist, artist, science fiction writer and aspiring astronaut. She graduated from Carnegie Mellon University in May 2021, where she studied biology, neuroscience and architecture. She now works in a neuroscience lab, where she is interested in studying neurophotonics, the intersection of declarative and procedural memory, and brain simulation science. All four of her published stories can be found in Clarkesworld Magazine and her artwork can be found in the first issue of Dark Matter Magazine. She is autistic and bisexual.  Themes of identity and reality have always interested Arula, particularly as someone who is the daughter of two immigrants from India and has grown up in the U.S with many different cultural influences. Arula plans to continue writing science fiction stories, and hopes to work on science fiction movies someday.", "text": "20800 words, novella\nSubmergence\n2022 Finalist: Utopia Award for Best Utopian Novella\nAs the people began to die, desperation drove us to the depths of the sea for cures. We mined mineral-rich vents until the tube worms went extinct, stripped polymetallic nodule fields bare, squeezed sludge out of sea sponges to treat the new diseases, these monstrous incurable plagues, born from our new climate, that spread through our air. But the people still died. So we dug even deeper . . .\nI look at the corpse lying in the clear preservation chamber next to me. Woman, late thirties, died about four weeks ago. Normally they would have examined her body, signed her death certificate, gotten everything back to her remaining family members (her aunt and her twelve-year-old daughter), and that would have been it. But she had those things in her brain. And she died a strange and sudden death. So here we are, tied up in this investigation. Not that I’m complaining though. No, I live for this shit.\n“We’ve all had the procedure done, we’ve all been taking the pills for about a week now. Anything go wrong for either of you? Any side effects?” Marie continues reluctantly. “Nothing wrong on my end.”\nAnthony, sitting to my left, looks absolutely elated. “I’ve vomited three times a day since Wednesday! Looks like I can’t do it.”\nThey both turn to me. Marie bites the side of her thumb. “Nithya?”\nHah. Marie is terrified right now. Is she really afraid that I’ll turn this down? That she’ll be the one to have lights pulsing through her brain every night for the next four months? This is the most interesting thing that has happened in my entire goddamn twenty-seven years of existence. Can’t believe they aren’t fighting me tooth and nail for the chance to do this. Ah well, can’t seem too enthusiastic about it. What if they change their minds?\nI try to look downcast. “I’ll do it. I didn’t get any negative side effects. Truthfully I’m feeling better than ever.”\nMarie is visibly relieved. “You’re sure about this Nithya?”\nHell fucking yes I’m sure! I nod.\nAnthony chuckles nervously. “Well, then get ready to live a dead woman’s life.”\nI stare at the reflection of my waist-length dark-brown hair in the bathroom mirror, razor in hand, trying to imagine myself with a shaved head. I think I’d look badass. They’re going to drill little circular tunnels into my skull, intended to be plugged into a set of tubes that will branch out microscopically throughout my brain and shine light pulses into key areas at the cellular level. They don’t want hair getting in the way of the procedure, and I certainly do not want that either.\nAs the chunks of hair fall to the floor, I think about the last time someone tried out this technology, in a very different context. I remember seeing it on the local news. It’s just optogenetics. An elderly woman got her neurons modified to contain activity-dependent genes for additional kinds of channel proteins, light-gated ion channels. Colorful light pulses could regulate membrane depolarization through these new light-gated ion channels and force the same neurons to fire that were firing during her experiences. She could “record” all her experiences and live them again later, as the wavelengths of light activating the channels would evolve and develop with time, along with the types of light-gated channel proteins being expressed or taken out of the cell membranes. Additional proteins expressed through the inserted gene sequence allowed the tubes to locate and target neurons in the correct firing sequence.\nBut the old woman’s goal wasn’t to relive the experiences herself. After the woman died, her daughter received a gift. A request to modify her own neurons to include the channel proteins, and permission to access a set of pills and light pulses that would, to the most accurate possible degree, play the elderly woman’s experiences into her daughter’s brain. The final years of that woman’s life, available for someone else to live themself! Eat, sleep, shit, laugh, cry as them . . . become them for a while. It’s the most intense form of memorial I’ve ever heard of.\nWhy didn’t the woman whose death we’re investigating—Noor—ever play back her experiences herself? Why just have the channel proteins? What was the point of modifying her neurons, if she was just going to live like she’d never gotten the procedure done anyway?\nI look at my bald head in the mirror, satisfied with my work.\n“Is it conscious?” The disembodied brain in front of me is incredibly disquieting, several infinitesimal, branching tubes running through it, keeping it clean and preventing the natural postmortem process from taking place.\nSince Noor didn’t play her experiences back every night for the time she had the new channel proteins, they have to play them back into her brain now, so they can get what they need to play the light pulses into me.\nDr. Irene Young shakes her head. “Certainly not right now. And when fed the light, all Noor’s brain can do at this point is reexperience her last two years over and over again, in a loop, without knowing they’re being relived. The inevitable still happens no matter what, this brain isn’t coming up with anything new anytime soon. And the brain only ‘comes alive’ again, to put it crudely, when fed the light pulses.”\nThe whole thing still unsettles me. “Isn’t it cruel though, keeping the brain looping like that?”\nShe’s quiet for some time before speaking. “Think about it like this. Right now, you’re in this room, experiencing this present moment. Earlier this morning, you were experiencing something completely different, and so it goes for every moment of your past. In each of these slices of time, you are completely unable to predict exactly what you will experience next, right? Okay, say you die tomorrow and someone plays your life experiences back into your head. In whatever the equivalent of this particular moment is within the synaptic reconstructions, you will have absolutely no clue what that death will be like. It’ll just be this moment, and you’d be sitting in front of me, staring at that brain. You’re either alive, or you’re in one of those loops, and there’s no real way to distinguish between which of the two you’re in. Even if you can’t stop the death, you don’t even know that it’s going to happen. It would feel essentially the same as living your life as it would play out and then dying, with no way to know whether or not you’ve gotten yourself some amount of extra time. Maybe we should be raging against the impossibility of perfect foresight, or against the fragility of human existence and the ephemerality of a human life. But personally, I don’t think feeding the brain the light pulses is cruel.”\n“Hmm,” I’m still not fully convinced, but she seems to have quite a strong opinion on the matter, so I try to redirect the conversation. “Pretty amazing, that I’ll be able to live out a whole two years, every night, for just slightly under four months.”\n“Yeah, that’s what happens when you condense the experiences down to high quality immersive experiential versions of whatever she would have remembered naturally, which filters out quite a bit! I mean, there’s no way of knowing whether or not that will cut out something essential, but this will cover the most memorable moments, whatever those are.”\nA nurse enters to tell us the operating room is ready. I head out after him and look back to see Dr. Young still gazing at the brain. As soon as she meets my eye, she hurries after me.\nIt’s time to take my bandages off, a week and a half after the operation. The cannula guides for the tubes that will fire the light into my head have been drilled into my skull and it’s all healed. Dr. Young looks nervous today. Why?\nAs she unwraps the bandages, she tells me what to expect. “There’s going to be a sensory deprivation chamber set up in your home, with the tubes attached. I know you’ve been taking the pills for some time now, but it is crucial that you continue to remember to take the pills every morning and night, and I’m obligated to give you a refresher on what to expect.”\nDr. Young holds out one box of a set of four. Each box has four rows, each row containing seven orange pills and seven green ones. “The morning pills—orange ones—cause a daily ripple of brain activity, during which you will experience a brief but strong hallucination. Since we’re replacing your REM sleep with Noor’s experiences, and REM is incredibly important for strengthening newly formed synaptic connections, we have to make up for the lost benefits with this ripple. Since you haven’t played anything back into your head yet, there haven’t been any hallucinations. However, as soon as you start, so will the daily hallucination.”\nShe gives me a quick half smile, but it’s not very convincing. “Don’t worry too much, it will be very brief. This carefully orchestrated daily brain activity will make it easy for us to identify different experiences you have as well. The night pills are what paralyze you and block external sensory signals from reaching you while you’re being fed the light pulses. They’ll also adjust your melatonin cycle to make sure you fall asleep with enough time to play the experiences. Your slow-wave sleep won’t be noticeably affected by any of this.”\nHer voice is steady, professional. But the pills are rattling in the box from her shaking hands. She shoves the box into my hands. I have to ask.\nI whisper, “Do you know the person who put the light-gated ion channels in Noor’s brain? Was it you? Did you know this woman?”\nDr. Young glances up at the ceiling. A security camera? She clears her throat and begins writing a prescription. She’s ignoring my question. Or maybe she didn’t hear me.\n“Here’s a prescription for the pills, in case something happens to the ones I just gave you. Feel free to call me if you have any questions. And good luck with everything.”\nSomeone knocks on the door. “Irene? Could you come out here for a moment?”\nDr. Young presses the slip of synthesized paper into my palm and looks straight into my eyes. She has these incredibly intense eyes, and her proximity to me makes me nervous. I try to act normal.\nShe speaks to me in a low voice. “For the record, if it was someone I love who died, and they loved me, I would keep them looping endlessly. Then at least I would know they’ll feel loved forever, and I would be loved by them forever too.”\nAs I exit the building, I unfold the prescription she gave me. A smaller slip of synthesized paper falls out. It reads in her scrawling handwriting: MEET ME. AFTER YOUR 1ST SESSION. FOR NOOR.\n“Rimjhim Gire Sawan,” sung by Lata Mangeshkar and Kishore Kumar, plays at a low volume in a beautiful living room. The room is bathed in a pale blue light from massive, glowing screens covering each wall, showing various pictures of deep-sea creatures, ocean views, and Noor with her ten-year-old daughter Sana (currently at a sleepover). Noor and Irene stand together by the door.\n“I can’t get them. Nobody can know I’ve gotten this procedure done, and if I show up bald with the cannula guides drilled in, it would be pretty obvious. Please my love, trust me.” Noor gently brushes some hair out of Irene’s face, runs a finger along the slight wrinkles at the corner of her eye. Irene pulls her into a tight embrace.\n“Fuck! Can’t you tell me anything? Why are you so afraid of them knowing? I don’t even know where you work, what you’re working on. But why did you get the procedure done if you won’t—are you in danger? If anyone tries to hurt you I swear to fucking hell I will—”\n“Shh. I promise I’m not in danger right now. This is just a precaution. In case my research is somehow compromised. I shouldn’t have even told you that I got the procedure done today. But you were bound to see the orange pills eventually, and you literally work in this field, so you’d know what they do.”\n“But if you’re not playing anything back, why do you need to take the pills? You won’t be getting the daily hallucination!”\nNoor breaks away from the embrace and looks through her handbag for a few seconds before taking out a box of white pills. “REM suppressors. Won’t be getting any dreams for some time now, so the morning pill will definitely give me the hallucination and mark out my different experiences. I’ll be taking these white ones instead of the night pills. Please Irene, just trust that I need to do this. I can’t tell you why yet. In a couple of years, I won’t have to keep this a secret anymore, and I’ll tell you all about my work. And once this isn’t a secret anymore, I’ll tell the world about us. But right now I need to keep a low profile. I cannot let anyone know I’ve . . . met someone here, and I cannot let anyone know about the procedure. Couple of years. That’s all. Hey . . . ”\nShe takes Irene to the living room couch. Above them is a skylight, showing a dark, almost starless night sky. Noor sits with Irene’s head in her lap, stroking her hair. It feels like they’ve known each other for their whole lives, even if they’ve only been together for four months.\n“What do you think we’ll be like in a couple of years? Together, I hope,” Noor laughs and smiles down at Irene.\nIrene smiles back, and the wrinkles around her eyes deepen. “Married.”\n“Wow, really? You think so?”\n“Mhm. Right now, I’m certain of it.” She pulls Noor down for a deep kiss. “Noor, I do trust you. I worry about you, but I trust you.”\n“I love you. Thank you.”\n“I love you too.”\nA massive fruiting body, covered in bulbous sacs, stretches out through the skull of what used to be Dr. Meyers, threatening to burst at any moment and release countless more spores into the air. On a table in the center of the room is a water tank containing a piece of the sea sponge Noor is studying, the one they discovered recently at the bottom of the ocean, that cures the new plagues. Next to the sea sponge are various insect carcasses, arranged neatly in a grid, and all with fruiting bodies from various insect-pathogenizing Ophiocordyceps fungi sticking out of their skulls and bodies. On the floor, an overturned container is surrounded by a swarm of the insects it used to hold. They should have been dead from Ophiocordyceps long ago, but they were cured.\nNoor unfolds her touchscreen and checks the security camera footage that she’d saved again. It shows Dr. Meyers, looking like he’d just gotten out of bed, barefoot, disheveled, in a T-shirt and boxers, stumbling around in the middle of the night. Zigzagging through a hallway, he bumps into walls and columns and doors as though he’s possessed, until he reaches the door to the room. He presses his hand against a scanner and falls into the room as soon as the door opens. Dragging himself across the floor in an eerily contorted crawl, he makes his way to the table, lowers his hand into the water tank, and presses his palm against the sea sponge.\nThe footage then speeds up to show the fruiting body breaking through Dr. Meyers’ skull, developing spore sacs and continuing to grow longer, covered in brain matter, blood, and cerebrospinal fluid. The similarity of this fruiting body to the ones from Ophiocordyceps is impossible to ignore.\nHad the sponge somehow caused an insect-pathogenizing fungus to mutate and attack a human being? The whole reason the sponge, of an entirely new genus, Panaceius, is so important is the incredible, unprecedented ability of its unspecialized archaeocyte cells to transform perfectly into a far larger variety of specialized cells than those of other sponges . . .\nSomeone’s walking down the hallway. Noor quickly shuts down her touchscreen and hurries away. After she exits the building, she opens her touchscreen again, and reconfigures the security camera in the hallway she was just in to stop looping earlier footage of the area when it was empty.\nHer job is to study the flask cells of the sponge’s larvae in a different building altogether. She wasn’t supposed to be here, and she’s not supposed to have access to that security footage of Dr. Meyers either. But Noor has this overwhelming feeling that there’s something seriously strange about Panaceius meyeri, and she’s determined to keep digging at it.\nNoor walks to the Learning Lab school to pick Sana up. On her way, she passes a group of children leaving the school with completely expressionless faces wearing T-shirts that say “You Won’t Hear Our Voices Until We Hear Yours” and “We Won’t Laugh Until You Save Our Future.” She smiles at them as they pass, and they nod at her.\nNoor remembers when Sana first joined this youth movement, almost seven months ago. They had just moved here, into a house given to her by the company she had joined, and were unpacking boxes in the living room. They were taking out the incubating chamber where Sana had grown from a preserved early twenty-first century embryo ten years earlier. Sana wrote her thoughts down for Noor on her touchscreen.\nWe’re not speaking or showing our emotions on our faces until the adults meet our demands. If they don’t meet these demands, so many of us will die from the pollution and the water flooding and more and more diseases that will show up. And we don’t want to die.\n“Won’t it be difficult though? Not showing anything at all?”\nIt is, at first. But we learn. And I will write it out if I am happy or upset about something. You just won’t see it on my face anymore or hear my voice anymore.\nNoor kneeled next to her daughter. “Can I give you a hug?”\nSana nodded and Noor embraced her. “Sana, you’re the bravest person I know. I hope all the demands are met. I want you to have the happiest future imaginable.” She let go of Sana after a while.\nAfter unpacking in silence for some time, Noor spoke again. “By the way, about those diseases. Don’t tell anybody this, but that sea sponge Mommy came here to study might help with them.”\nI read about the sea sponge. Why does it leak stuff that pollutes the ocean as badly as microplastics when someone gets pieces of it to study?\nNoor sighed. “Well, we don’t know right now. But hopefully the more we study it, the more we’ll be able to benefit from the parts of it that cure diseases and stop the parts that harm the rest of the ocean.”\nI hope you do that soon.\n“Yeah, so do I.”\nTheir movement did seem to be working. Or at least, a major demand on their list is being met, whether it’s because of the movement or because of something else. No more cars, and the roads of the state are being replaced with zero-emission magnetic levitation tracks.\nP. meyeri, though. Killing deep-sea corals, leaking all sorts of pollutants that integrate themselves into other creatures’ respiratory and digestive tracks . . . only after humans started harvesting it. And Dr. Meyers. Was it simply a coincidence that the person who discovered this sponge died in this way? The specialization used in the way the sponge killed him was astounding.\nWhere the fungus spore would have contained the enzyme chitinase to break down the chitin in an insect’s exoskeleton, the spores that attacked Dr. Meyers contained keratinase, to get through the human epidermis. Then they manipulated the actin cytoskeletons of the endothelial cells lining his blood vessels, causing the endothelial cells to engulf the spores, creating structures from which they entered the bloodstream. Traveling up until they reached his brain, the spores used the same process to cross the blood-brain barrier. They immediately seized control of his neural activity, activating various types of memories and cues. Dr. Meyers was forced to travel to the room holding the sponge and touch it, in a way analogous to, yet very different from how the nerve toxins in an infected ant tell it to climb to the forest floor and bite down on a leaf. The fruiting body broke through his skull soon afterward.\nThe specialization in the design of these spores was so intricate . . . how did the sponge know to do all of this? It wasn’t even a spore that was a mutated form of Ophiocordyceps. No, this spore was created from scratch, inspired by the fungus.\nIf her hunch is right, P. meyeri is demonstrating markers of a lot more than consciousness.\nSana tugs at her sleeve, and the two start walking back home. When there are no other people around, Sana takes out her flute. Six months earlier, Sana told Noor that she’d created a cipher, combining music with the Fibonacci sequence, to communicate with her friends without adults knowing. While it was against the rules her friends had agreed on, she wanted to show her mother what she’d made, under a sworn oath of secrecy that Noor would be the only adult to ever know about it.\nWith enough practice, one could look at what appears to be really awful-sounding sheet music and translate it into a message. With even more practice, one could hear the music and translate it mentally, which is how Sana communicates to her friends and to Noor these days, using her flute.\nAt school today we learned about the Indian roofed turtle. I think it is my new favorite extinct animal. I think it is very cute.\n“That’s awesome! Is that turtle what you want to write your science class report on?”\nI think so. Yes. Sana plays. I want to write mainly about how much I like it and how it went extinct. It is really sad Mommy. Its habitat was mainly in small streams or shallow coastal waters and it fed on aquatic plants. But with ocean acidity levels going up and streams drying out it could not find food or shelter. And too many people started keeping it as a pet, so the wild ones went extinct while the captive ones lived much shorter lives.\nNoor shakes her head sadly. “Sometimes humans can just do so much damage, maybe even without realizing it. And so often in this world, those realizations come far too late.”\nSana just nods, and then looks at her mother blankly. Noor feels a brief, sudden pang of anger, sadness, and longing for just a hint of emotion on her daughter’s face. Is supporting this the right thing to do? What if this is causing her harm? She’s trying her best to encourage Sana to do whatever she feels is the right thing to do, and to pursue her interests. And yet, she can’t help but occasionally feel afraid that maybe she’s doing something wrong, maybe this is “harmful and detrimental to child development” as some other parents are saying. But they’re only brief moments of doubt, and most of the time she feels immense pride toward the strength and resilience of her daughter.\nIt’s a powerful thing, the physical expressions of one’s emotions. And a powerful thing to withhold as well, which is why it’s working so well. Parents would do anything to see or hear or feel their kids speak again, smile again, laugh again, even cry again. Noor herself has spent many nights, after Sana has fallen asleep, watching old videos and weeping at the sound of her daughter’s voice. She feels guilty, selfish for missing those moments so much even with Sana still communicating her feelings clearly through her flute or through typing on her touchscreen. But maybe that’s the whole point. After all, she’s taken far more personal actions to combat the climate catastrophes since her daughter joined the movement . . .\nWhat are you thinking about?\n“I was thinking about how humans sometimes do harmful things without realizing it, and how sometimes it’s hard to tell whether something is the right thing to do or the wrong thing to do.”\nI think about that sometimes too. In my opinion, as long as something will help people eventually . . . it is the right thing to do.\nNoor thinks for a long time. “What if it might never help people at all? What if a decision involves taking away something that is helping lots of people? Do you think it can still be doing the right thing?”\nIs it helping anything or anybody at all?\n“Yes. It would help something very much, save it from being very badly hurt and mistreated. Something just as important as people, maybe.”\nSana is very quiet until they reach their home. Noor places her finger inside a small, clean, airtight cavity next to her front door’s lock. A sterilized needle quickly pricks her finger and collects a drop of her blood to scan. After a moment, the scanner beeps and flashes green, and the door opens.\nThe flute plays its strange melody as Sana’s expressionless gaze meets her mother’s eyes. Mommy. If it saves something else from being hurt, I think it is still the right thing to do.\nI wake up, disconnect the tubes from my head as fast as I can, and sprint to the bathroom, where I retch into the toilet, though no bile enters my mouth. What the hell? I’m getting the nausea side effect now? I’ve never gotten it before! Fuck.\n“You should keep an eye on Dr. Young. Meet her, see if you can find anything out about her. It’s a weird coincidence that she’s the one who modified our neurons, and she had such an intimate relationship with Noor without mentioning anything to us.” Marie shoves a handful of spiced, fried crickets into her mouth before passing the bowl over to Anthony, who takes a handful and passes the bowl to me. Switching to insects as a source of protein is becoming increasingly popular these days.\n“Yeah. I’m meeting her soon.” I politely take a few from the bowl. They taste okay but need more cayenne powder and salt.\n“Are you okay Nithya? You look kind of flushed.” Anthony looks concerned.\nMy stomach feels so weird. I feel pretty nauseated and stuff is really churning around in there. My period literally just ended . . . and it doesn’t really feel like cramps either, or gas pain. So what the hell?\n“I think it’s just indigestion. I’ll be okay.”\nAnthony hands me an antacid, and I take it. Pretty soon I’m feeling a bit better. It was probably just an upset stomach.\n“Maybe go easy on the spicy snack.” Marie takes the bowl away from me.\n“Are you kidding me? That spice is weak as fuck. If anything, my stomach would protest at the lack of cayenne in that bowl.”\nThey laugh, and then we sit in silence for some time, researching Noor’s place of work. Eventually Anthony closes his touchscreen and looks at me.\n“Okay, I have to know. What was it like? You’ve been acting kind of strange today.”\nWhat was it like?\nShe was alive. I wasn’t myself, I was her, entirely. The world felt so different. It’s so different, in her head. And I can remember everything about her life, in such great detail. It was all so vivid! She was actually alive again. And they were all alive too. Irene, Sana, everyone she interacted with. They were as alive as Marie and Anthony are to me right now. What is the difference really, after all? The neural activity in my brain when I interact with someone is what creates everything I understand about the person I’m interacting with. That’s all the evidence I can ever get from them to prove they’re alive (unless I’m playing light into my head to become them, of course). Recreating those patterns . . . it’s the same as recreating those people, at least what those people were to Noor. The interactions are just as real. They were as alive to me as anybody I walked past today.\nNow I’m back in the reality I inhabit. Me, Nithya, not her. But now scents and sights and sounds around me are bringing up old memories that are not mine, of a carpet in a house I’d never been to, of a beach in a country I’ve never visited. Ghostly fragments of thought are invading my reality constantly, of laughter and voices and experiences with strangers and friends and family I have never known. I never realized how many memories I remembered in a single day until I was forced to start separating recollections of my autobiographical timeline from recollections of hers. They’re constant. Every single thing in my surroundings, from Anthony and Marie to the snack bowl to my touchscreen, now has two different emotional states associated with it. Different fragments of memory that are dug up to navigate the experience associated with interacting with any object or person. And I can feel the differences.\nI’m here now, everything around me is real. I know it. And it’s especially comforting to inhabit my own reality again because, well, for a while . . . I blinked out of existence. When Noor was alive again, living in my head as my brain activity, I wasn’t there at all anymore. My brain was only a vessel for her to live her life out, with no self-awareness of my role as a vessel, even. I was nothingness for the period of time where she came back to life, and now that I’m awake, she’s nothingness again.\nI clear my throat and turn my attention back to Anthony and Marie. “It’s so . . . intimate, this whole thing. Is this right? I mean . . . I remember her life. I have her memories. Is this okay? I feel strange about it.”\n“It must feel really weird.” Marie looks at me sympathetically. “But you know the contracts you have to sign when you get the procedure done. You can relive your experiences, or gift them to someone else you choose. And in the case of a sudden and unexpected death, you give your consent to let an investigator live your experiences. Noor knew all these conditions when she got the procedure done. And well, she’s not alive anymore, Nithya. And her family wanted us to do this as well. They want to know what happened to her as well.”\n“Yeah, but she didn’t know what it would be like. Nobody knew. She’s alive again, Marie! It’s her, in the past, sure, but she’s as alive as we are right now. She couldn’t have known what I would be experiencing.”\nAnthony speaks up. “Hey, this is all for Noor’s sake. We’re going to find out what happened. This will give us the best chance we have at figuring out the whole situation. It’s our job, Nithya. For her family, for her memory. We owe it to them to investigate her death and give them some closure.”\nAt the end of the day, on my walk home, I pass a father and his three-year-old daughter. I smile, remembering Sana when she was three. She was always running off somewhere, climbing a tree or investigating some bug she found. For a moment, I can almost hear her flute, picture her blank stare . . . I catch myself and quickly work to separate Noor’s memories from mine before continuing home.\nI am not prepared for the swell of emotions and deep sense of shared history I experience when I see Irene Young sitting in a booth of a café downtown, sipping her coffee. It’s almost painful, the physical ache in my chest and my gut, of love and lust and nostalgia and camaraderie. It takes a whole lot more effort to separate all of Noor’s emotions toward Irene from mine right now, compared to separating the two emotional states when interacting with something like an apple. And it’s really hard to think properly when I sit down across from this woman Noor loved.\nIrene clears her throat. “Do you want anything to eat or drink? The coffee here is from one of the new orbiting gardens. Pretty amazing that what I’m drinking was grown in sealed chambers up in space. Quite the solution to the dwindling arable land problem, isn’t it? And it’s pretty good coffee too.”\nAs soon as she speaks, the context of the situation hits me.“Can we just cut the bullshit and start talking? Why didn’t we know about you? Why did you take the job of modifying our neurons? What the hell do you know, and why the hell haven’t you told us already? And what was with that note? Why couldn’t you say anything before I started this?”\nShe sighs. “Look, it’s really complicated. But I want to keep my relationship with her a secret, alright? The place she worked for is not something I want to get too involved with. They know about me already, but they don’t really know about my relationship with her. And I didn’t even learn about her work until . . . ”\n“Until what?”\nIrene looks down at her coffee. “Well, let me just say that they know I had met Noor. I found out about where she worked a week or so before she died. And I inquired about her afterward. They were really sad about her death . . . but they also told me that they were worried she was planning something really dangerous. They said she was going to do something that would risk a lot of people’s lives. And that maybe she wasn’t in the best state of mind, maybe she was delusional.”\nI almost laugh. Delusional? “Trust me, that’s not true. I think I would know, I’m living her life every night.”\nShe smiles sadly. “And maybe that’s exactly why you wouldn’t see it. Because you’re in her head, you don’t see that her delusions aren’t true. To the person afflicted by them, they actually are real. If you’re living Noor’s reality, experiencing the world around you from her perspective, of course you’re inclined to believe her thoughts.” She gulps down the rest of her coffee. “I never thought she might be experiencing delusions when she was alive either. Everything she said or did always seemed to make perfect sense.” Irene sighs. “But maybe I was wrong.”\nI feel a sudden longing to hold her, make her laugh and smile and forget all her troubles. I try to separate Noor’s emotions from mine but . . . this time some of it is coming from me too, at least I think it is. The whole time, she’s been digging the corner of her short-clipped thumbnail into the wooden table, hard, creating an arc indent in the table. I briefly experience the desire to hold her hand but decide against it.\n“I’m sorry, Irene. I’m sorry she’s gone.”\n“Mhm.” She takes a deep breath and looks up at me, perfectly composed again.\nWhen she speaks again, she chuckles a bit. “You know, I’m pretty jealous of you Nithya. You get to live it. You get to know her in the most intimate possible way.”\n“I don’t know. It’s such a new thing, I have no idea whether or not it’s the moral thing to do. I mean, I’m a stranger. It feels a bit . . . wrong. And you, Sana . . . it’s a lot, Irene. It’s intruding on all of your privacy too.”\nShe looks me in the eyes. “But you’re not going to stop, are you?”\n“No, I mean, I owe it to her family and—”\nIrene laughs at this. “Oh come on. You and I both know it’s not that. I have never seen someone so enthusiastic about getting that procedure done before I met you. So what is it, really?”\nShe orders another coffee, and I order one too before speaking. “Okay. Fine. I want to know what it’s like inside someone else’s head. I’ve always wanted to. I want to know how things taste to them, how they think of other people, how their entirely different set of memories influences what the world around them looks like. And now I can. That’s the truth.”\n“Fair enough.” She chugs more coffee.\n“How do you feel, though? About me . . . knowing so much about your relationship?”\nAfter an almost unbearably long pause, Irene smiles. “It should have been me. Not you. If it had to be anybody, it should have been me. But she never had the time to think about who would get her experiences after her death. And she never requested for anyone to live them out. Nobody even knew about me. She died suddenly, so it’s all being investigated, and so you got them. You don’t appreciate what you’ve been given the way I would have. But I’ve come to terms with it. The light pulses have been encoded to fit your specific synaptic structure, and quantum encrypted to prevent any further access to her memories. So it can’t be me. But it should have been. Am I fine with you knowing so much about my relationship with her? I could be, if you just do something for me.”\n“What do you want me to do?”\nShe grabs my hand. “Tell me about it. Tell me about her thoughts, what it is like in her mind. Tell me everything, all of it, until every last light pulse has run through your head. It’s why I wanted to meet you. You don’t have to tell me anything related to the investigation. I just want to know what it’s like. Starting now. Tell me, please.”\nI do.\nAs I get up to leave, after hours have gone by, with plans to see her again the following week, Irene asks me, “How have you been feeling so far? With the pills and the hallucinations and everything.”\n“The hallucinations aren’t that bad, but I’ve actually been feeling a bit nauseated since I started.”\nShe looks concerned. “You should see someone about that. That’s not normal, especially since you never had the side effect before.”\n“I think I’ll be okay, it’s dying down and—”\n“Seriously, just to be safe. It wouldn’t hurt to check.”\n“Alright, I’ll make an appointment with someone.”\nThe nurse and doctor at the hospital hand me all the information I need to know, along with the charts and statements laying it all out for me, neatly clipped together on synthesized paper and an electronic copy on my touchscreen.\n“Have you started the coughing fits yet?” the doctor asks.\n“No, I’m still just getting the nausea.” I look down at my hands.\n“Good. So you aren’t contagious yet—too many people wait until they start coughing, without coming in during the noncontagious nausea phase like they’re supposed to . . . that’s the only thing that’s keeping this spreading, these days, honestly. At least it’s very rare to get infected now.”\nThey hand me packets of liquid. “Here, drink these twice every day to prevent fluid buildup and the bile-inducing coughing fits. They’ll coat your esophagus with a protective layer that will stop you from ever becoming contagious and prevent the mutation-induced signals from leaving the lysogenic squamous cells.” The doctor clears their throat. “Please know, this contagion-prevention mechanism cannot be used prophylactically, and would actually be really harmful to an uninfected person, so please don’t try giving it to anyone else. It only works on an infected person with their viral-DNA-containing squamous cell genome. And please remember that this alone will not cure you—it will be eventually fatal without the cure—so you really need to start ingesting the archaeocytes too. But we’re well out of the horror from a couple years ago, this illness is easily treatable now. The archaeocytes work wonders and have been made highly accessible! So remember to start that sponge treatment soon in addition to drinking this liquid, and you’ll be cured!”\nI have it. I’m sick.\n“Rajnigandha Phool Tumhare,” sung by Lata Mangeshkar, plays through Noor’s mind. As the sub quickly sinks into the sea, the colors around Noor start to fade away. She watches her red shirt turn to blue-gray as she remembers Irene’s words over and over again.\n“I’m sick, Noor. I have it. I was able to get a spot in one of those trials, and they’ve been able to cure every single person in the trials so far. But I wanted to tell you . . . in case something ever goes wrong.”\nWhen only blue light is able to reach the depths, Noor climbs up, out of the spherical observation portion of the sub, and sits across from Matias, her fellow crew member on their two-person sampling mission, at a small folding table.\nThey’re headed to a newly discovered P. meyeri colony at the bottom of the Mariana Trench. Deep-sea remotely operated vehicles have already mapped out the massive, linked caverns inhabited by the colony. According to images from the ROVs, the walls, ceilings, and floors of the spaces are all covered with countless sponges, arranged in an astoundingly intricate fashion. Specialized sponges occupy different chambers, each one shaped to make optimal use of the water currents, avoid danger, protect reproducing sponges, and capture the most food. It’s one of the most complex systems Noor has ever encountered.\nThis is wrong—she begins to think, but shakes the thought away quickly, remembering Irene’s face as her optimistic facade eventually disappeared to reveal her terror.\n“I don’t want to die like that.” Irene spoke through sobs. It was painful to watch, and all Noor could do was hold her close.\n“Is this your kid?” Matias points to the screensaver on her touchscreen, flashing family pictures of Noor and Sana.\n“Yeah, that’s her. Her name’s Sana, she’s just turned eleven.”\n“She’s about my Syd’s age. Such a handful these days, these kids. At least, Syd is. Syd gets into trouble at school every day now, for not responding to questions mainly. But it’s not their fault. It’s those other kids who got them to join that ridiculous movement. I get wanting to prevent and stop the climate catastrophes, but this is just extreme and unhealthy. My kid hasn’t changed the damn expression on their face in over a month, it’s driving me and my husband up the walls!”\nNoor is taken aback. “Actually—”\n“I hope your kid never gets into that stuff. It’s dangerous, really. And all those experimental public schools cropping up these days, encouraging that crap, aren’t helping at all. Glad I didn’t send Syd to one of those. Where does your Sana go?”\n“Sana goes to an experimental public school, Learning Lab, past the wind turbines. And I think the youth movement is incredibly brave.”\n“Ah.” Matias sits quietly for some time, his face adopting an expression of deep concern. “Look, it’s for your kid’s sake that I’m telling you this. The movement—”\nNoor narrows her eyes. “Look, I’m going through my own shit coming to terms with my daughter’s choices, but I feel guilty enough that I’m going through shit about it at all. I should just respect what she’s doing and admire her strength and bravery. And I certainly don’t need you to butt into any of my personal business. I think, to maximize the productivity of this mission, we should just focus on our research. Why don’t you tell me about that instead?”\nThis time Matias looks taken aback. “Fine.” He opens his touchscreen and shows Noor a folder full of images of a P. meyeri sponge’s spicules. “These are images taken by the ROVs, showing the portions of the sponges facing the interior of the chamber cavities, toward all the other sponges. The spicules on this side are incredibly complex and specifically designed to bring light deep into the sponge. Their refractive index far surpasses that of our corneas. And there’s a lens too! My question is, why does it need to collect light with such specificity and efficiency? I think there must be some sort of symbiosis with bioluminescent and light-sensing organisms we haven’t found in previous samples, that requires light to reach the interior of the sponge. And if we can control the signaling system they have, if they have one of course, we can possibly increase their productivity.”\nFascinated, Noor studies a document listing potential chemical impurities that could have formed in the spicules to improve their refractive index.\nA sharp, high-pitched tone plays in the sub. It’s time to put on their nitrogen regulators and suits. Noor and Matias place needles attached to a system of quarter-inch diameter tubes onto various marked areas on their bodies. Noor winces slightly at this, even though the process is painless. As soon as the needles have been taped in place, they each attach the tubes to thin, flexible, cloth-covered plates that they strap to their backs, and finally press the glowing blue button on each of their plates. Once the buttons are pressed, a microscopically thin system of smaller tubes begins to stretch out from the needles and into their internal tissues, throughout their bodily systems, causing a brief shiver to run through them. One of the most pressing concerns when working in the midnight zone is avoiding any sort of depth-pressure related injury, such as future decompression sickness from pressurized surface-level gases depressurizing upon resurfacing. The nitrogen regulators manage the distribution of surface gases, mainly nitrogen, within the bodies of Noor and Matias, to make sure nothing like that happens.\nAfter putting on the nitrogen regulators, the two of them step into heavy, bulky suits and helmets, and turn on communications with each other. Their suits can collect oxygen from the surrounding water, allowing them to walk around under water for a virtually unlimited amount of time.\n“You’re studying the flask cells, right?” Matias struggles to pull gloves over his hands.\n“Yeah. Sponge larvae have some form of a rudimentary sensory processing system using their flask cells that allows them to move to a place where they can become sessile, P. meyeri included. But P. meyeri flask cells are different. When the larva becomes sessile, the flask cells continue to develop.”\n“How so?”\n“That’s the thing. I can track their development up to a certain extent, but for some reason all the larvae I have die before reaching adulthood, even when deep-sea conditions are simulated perfectly. I don’t understand it. In the adults, there is a thin extra layer, lined with mesohyl, that covers almost all of the sponge’s interior surfaces. I think that’s where the fully developed flask cells are. When we collect the specialized sponge archaeocyte cells to make the medication, we have to access them using certain entryways into the sponge body that aren’t covered by this extra layer. If you cut into that layer, the sponge kills itself instantly, producing a dark oily liquid that somehow dissolves any remnants of this extra layer, along with much of the rest of the sponge.”\nMatias frowns. “That’s why the sponge colonies used to die out when we got ROVs to remove samples to bring up. Even if the ROVs didn’t cut into the extra layer of the sponge it was harvesting, they had to cut into the surrounding sponges to remove it, and the liquid spread, killing the rest of the colony and hurting other organisms.”\nNoor nods. “Yeah. Now we harvest the P. meyeri using those few entryways. You know what’s even weirder though? The sponges kill themselves if you even try to scan them to see into that layer. How are they even able to detect the scan? I don’t understand it.”\nMatias frowns. “So how are you going to observe it?”\n“My idea relies on the hope that the sponges will protect their next generation at all costs. If the larvae are in the process of escaping the sponge they developed in, maybe the sponge will override the trigger to self-destruct, and maybe I can scan, observe, and take snapshots of the fully developed flask cells inside the adult, if there are any, during that brief window. The sponges aren’t reproducing in the labs, so I’ll try it in the colony itself. Hopefully if I do this, we can find a way to stop the sponges from leaking that corrosive liquid and harming themselves and their surroundings, in the future.”\nThey finish adjusting their suits in silence. Matias taps Noor on the shoulder and points to a switch that would mute communications with the surface crew. Noor nods, and Matias speaks after muting the communications.\n“P. meyeri is pretty special, isn’t it?”\nNoor raises an eyebrow. “It is . . . ”\nMatias sighs. “You know, if the times were different, I wouldn’t have been doing this. We’re rushing into churning out the treatments since it was such a widespread emergency just a few years ago. But these sponges . . . we’ve barely scratched the surface of understanding them, and they’re unlike any ever known before. Yeah, sponges can’t think. But somehow this one reacts to its surroundings in an incredibly nuanced way. Why, you know? If the times were any different, I would have done things so differently. I would have taken things slowly, and carefully, and with less . . . I don’t know, exploitation.”\nNoor gives him a half smile. “I know what you mean. You know, I was almost going to—”\nThe expression on Matias’ face darkens as he interrupts her. “But times aren’t different. And I want to do this. You know, a few years ago, Syd got sick. It got so bad, their intestines weren’t absorbing anything . . . We had all resigned ourselves to making them as comfortable as possible in their final few months. But then they got into one of the trials, and now we’re able to fret about what they’re doing with their life, not whether they’ll live. After Syd got sick, I knew I had to get myself into this line of research. Frankly, if exploiting P. meyeri means other Syds can live, I’d uproot every last sponge in existence.”\nNoor nods. “I understand, Matias. Someone I love, someone I want . . . a future with . . . is getting treated right now. And I want to do everything in my power to protect her, even if it means fighting every instinct I have.”\n“Good. I’m glad we understand each other.” He turns communications with the surface crew back on.\nWhen they have reached the colony, Matias and Noor move through an airlock into the exit chamber. Once sealed into the exit chamber, the door in front of them, divided into slats, starts rotating each slat individually as the chamber fills with water. Once horizontal rather than vertical, the slats slide into the walls, leaving an opening through which Matias and Noor leave the sub.\nThe ROVs had assembled a thin metal grate pathway going through the chambers, just above the sponges on the floors, so that people could walk through without destroying or touching anything along the way. They turn on the bioluminescence sensors on their helmets, which have scanners and filters built in so they can focus on collecting samples and not have to use handheld tools to view or scan the sponges. The helmets track their eye movements and some of their neural activity. They also superimpose faint 3D models of the sponges around them onto the darkness, so that along with any bioluminescence, they’d be able to see the general shapes of their surroundings to know where to go without shining any bright lights.\n“Look at this!” Matias calls to Noor. He pumps a bioluminescent dye, packed with glowing plankton, around the base of a massive sponge near the entrance of the chamber. After being absorbed into the pores of the sponge, one would expect the plankton in the water to be consumed, and the remaining plankton-free, non-glowing water pumped back out. Instead, the dye begins to trace a pathway going from one sponge to another, throughout the chambers. “They’re directing the water to one another and sharing the food!”\nNoor calls back to him. “Hey, I think it’s time to split up. I’m going to the center chamber, it’s almost time for the larvae to leave the sponges. But keep me updated.” She sets her helmet to show a small viewport in the bottom right corner in which she can see what Matias sees.\nEach P. meyeri colony is structured similarly. The sponges near the entrance of the chamber system are the largest, informally named the “sentry” sponges. Almost all the water that flows into these chambers goes through them. The deeper into the chambers one travels, the smaller the sponges get. Only the smallest sponges, in the centermost chamber of the colony, produce larvae. Using the intricate system of directing water, P. meyeri is able to send sperm from all the various shapes and sizes of sponges that are needed in the different chambers to the centermost chamber, ensuring that more of those shapes and sizes will exist in the next generation.\nBut how do they know which larvae developed from which sperm? And how do the colonies keep growing if there are a limited number of chambers? There are so many questions!\nMatias’ voice sounds through Noor’s helmet. “Hey, I want to put on some music, real quietly. Do you want to listen too?”\n“That depends on what you’re going to play. If it’s the stuff my daughter listens to, that’s going to be a no from me.”\n“Space Oddity,” by David Bowie begins to play in Noor’s helmet.\nNoor laughs. “Wow, a song about dying alone, floating away in the abyss of space. Depressing choice.”\n“Our current situation just sort of brought that song to my mind.”\n“I’m amazed at your optimism. Also, this song is ancient!”\nMatias chuckles. “Says the person playing Bollywood songs from god knows what decade for the entire first half of our descent.”\n“Hey, Lata Mangeshkar is a legend.”\n“Um, so is David Bowie.”\n“True. It’s a good song, too.”\nThey walk down their separate paths for a while, humming or singing along to the song. A dragonfish, swimming in an erratic, jolting manner, convulsing and pulsing blue bioluminescent stripes over its body, moves past Matias. Noor watches it through the small viewport at the bottom of her helmet. Matias decides to follow it before speaking again.\n“You know, the nice thing about listening to music is that it kind of puts a filter over reality. Suddenly you can notice your surroundings and what’s moving to the beat of the song. You yourself move differently, blink differently, notice and ignore things differently. For a moment it’s not reality that you’re living in, but a world directed by something else, like you’re starring in a film or something. For the duration of the song it almost feels like nothing bad can happen to you. Everything, whether good or bad, feels like it’s going to either match the music or wait until the song is over to happen. It makes everything seem more predictable and safe. Now, I don’t want to die an agonizing death floating in any abyss, but if I had to, I’d rather have it be while I’m listening to a David Bowie song that’s sort of about what I’m experiencing.”\nNoor smiles. “Yeah.” she says quietly.\nA cloud of something drifts past Noor. The helmet enhances it, applies a color filter over it to show what color it is, and zooms in to scan. It’s made of larvae. It’s started. She closes the viewport showing Matias’ view so she can get a better look.\nNoor watches as the cloud divides itself up and flows through the ostia of the sponges around her. What the hell? They’ll be digested! But then the larvae pass through, out the osculums of the sponges, unharmed. They move from sponge to sponge, until they find their way to separate chambers, where the larvae just swim around in the center. They aren’t old enough to become sessile yet. Noor directs her helmet to scan the interior of a sponge as the larvae pass through it, taking care not to scan through the layer of the sponge that she suspects contains the flask cells.\nTiny, flashing lights shine toward the larvae as they pass through . . . upon closer inspection, it appears as though microscopic bioluminescent shrimp, fused to the inner walls of the sponge, are flashing light from their photophores. This wasn’t in any of the samples . . .\nNoor opens the viewport with Matias’ view again. “Matias, you have to see this! Inside the sponges—”\n“Noor! I was just about to tell you! Are you seeing what I’m seeing? I found a new chamber! The opening is too small for any ROV to get through, or even notice, really! But I can just barely look through into it.”\nNoor expands the viewport. Through a small opening between sponges, she sees a massive chamber, lined with P. meyeri and filled with a large variety of marine life. Snailfish swim laps around the place. Dragonfish swarm the bottom, flashing and . . . mating? This isn’t where or how they normally mate. Transparent squid, packed tightly together, have somehow turned on one another for sustenance, fighting and eating each other, dropping particles of food into the waiting ostia of the sponges. How did these creatures get inside the chamber? They couldn’t have fit through the opening unless they got here when they’d just hatched, or when they were inside eggs.\n“I . . . I don’t know what to make of it!” A timer starts flashing on her helmet. It’s time to hurry to the center chamber, the larvae release has almost ended.\nWhat are we doing here? We shouldn’t be here . . . She moves as quickly as she can to the center chamber, full of indecision. There are too many things we don’t know, fuck, we don’t know what we’re doing, we should just leave this place alone, we’ve destroyed so many others . . . she can feel herself panicking and stands still for a moment, closing her eyes and breathing deeply.\nAs soon as her mind stops racing, Irene shows up in her thoughts again. Irene, the love of her life. Irene, the one she hopes to marry someday. The one who has always worried for her safety . . . the one whose safety Noor worries for now. I need to do this. For her. For our future together. She needs to get well, I cannot risk losing her, ever.\nClenching her teeth, she heads into the centermost chamber. The floor is lined with what look like aggregated gemmules, the result of asexually reproducing sponges. Why are they outside the sponges? And how come P. meyeri gemmules don’t end up developing into sponges themselves, ever? There hasn’t been a single pair of P. meyeri sponges whose DNA matches exactly found so far. Noor carefully takes a sample of the gemmules. And then she looks up.\nAn intricate, coordinated display of flashing light is taking place throughout the chamber, in a beautiful recursive pattern revolving around one of the sponges, far more complex than any temple carving, any rose window, any generative design she’s seen. The sponge releases its larvae, and then a different beautiful light display centering on another sponge begins as that sponge starts to release its larvae. Using the scanner, Noor finds more of those microscopic shrimp fused to the exteriors of the sponges, somehow being controlled. She steels her churning stomach and holds back her revulsion regarding what she’s about to do.\nAs the sponge in the center of the swirling, dancing lights releases its larvae, Noor directs her helmet to scan inside the extra layer under its surface. At first, she does not know what she’s looking at. But soon, she begins to understand. The insulating sheaths. The delicate branches. The electrical signals.\nNeurons.\nThe reason it was briefly so difficult to make out what she was looking at was the sheer number of synapses in the thing. Noor asks the helmet to calculate how many synapses would be in the entire sponge if the concentration average held up throughout its body.\nOne quadrillion. Over ten times more synaptic connections than the ones in a human brain.\nNoor backs away, quickly. “Oh, fuck.”\nMatias’ voice suddenly rings out, panicked. “Some of the larvae that just arrived at this chamber . . . they’re swimming to me. They—FUCK! NO—”\n“Matias, head back to the sub if you can hear me! Please!”\nNoor is about to turn around when she sees the lights in the chamber shift, ripple, change their pattern. They aren’t centered around the sponge she was just scanning anymore. They are centered around her.\nThe larvae that had just been released from the sponge she scanned begin to swim around her, closing in rapidly until they latch on to her suit. As soon as they’re stuck on, their bodies begin to rupture and burst into a dark, oily liquid that quickly spreads. No no no no FUCK!\nShe moves as fast as she can, back to the entrance of the chamber, back toward the sub, as the liquid begins to cover her helmet and block out her vision. She sees Matias staggering over too. They fall into the chamber, shut the door, crawl through the airlock, and collapse onto the floor of the sub after Matias pushes the button to ascend.\nNoor almost thinks “We made it!” when she feels blood dripping out of her nose, her mouth, her ears, and her eyes. Looking over at Matias, she sees he’s going through the same thing. A splitting headache suddenly becomes agonizing, and Noor feels close to passing out. The nitrogen regulators aren’t working. We’re getting decompression sickness. She manages to shed her suit to see the quarter-inch diameter tubes clogged with the dark liquid, creeping closer and closer to the needles that lead into her body. She quickly rips out the tubes, looks over to Matias again, and sees him doing the same, and then Noor falls unconscious, her last thoughts before doing so containing a singular wish of hope that they’d survive.\nNoor blinks awake in a hospital bed to see Sana holding her hand, looking at her blankly. In the bed opposite her, she watches Matias begin to stir as well. At his bedside are a weeping man, and a child of about Sana’s age. The weeping man says to the child, “Look Syd, he’s waking up! Don’t you want to greet him with a smile?”\nThe child types on their touchscreen\nNo. I have a message typed up for when he wakes up. I worked hard on it. He can read that, and he will know I am happy.\n“But it would make him feel happier if he wakes up to—”\nMatias reaches over and squeezes the man’s arm, looks up at him with a smile, and shakes his head before turning to Syd.\n“Hey, you’re so brave. Thank you for waiting here. I’m just happy to see you, no matter what expression you have on your face. I love you Syd.”\nSyd nods at their father and types on their touchscreen\nThank you Dad. I love you too. I’m happy that you are awake.\nNoor squeezes Sana’s hand tight and closes her eyes again.\nIrene and I sit together on the floor of my apartment, leaning against the sensory deprivation chamber, sharing a bottle of wine. It’s almost empty now, and we’ve been talking for the whole evening. I haven’t told her that I have the illness yet.\nI look at her. “What was it like to know her? I’m always telling you what it’s like to be her, but I’ll never know what it was like to know her.”\nIrene smiles and closes her eyes. “Knowing her was the most wonderful thing to ever happen in my life. Our relationship was definitely a bit interesting, since we were keeping it a secret from everyone. We only met up a couple times a week, only spent nights together every Friday night when Sana was at a sleepover. But the separation only deepened our love for one another, only made us ache for the other’s company even more. And it made the times we did spend together that much sweeter. Every time I woke up next to her, every time I covered my head with a pillow to block out the sound of her snores, every time I made her smile, or became frustrated with how stubborn she could be, or listened to her give an impassioned speech, or heard her awful singing, or just about a thousand other things, it was all connected by this incredible foundation of just . . . love, you know? The deepest possible amount you can care about someone. I don’t think I’d ever truly loved anyone until I met Noor. The day I knew, I was poring over scans of patients’ brains, and a thought of her just popped into my own brain. I said aloud to the stack of scans: ‘I really care about her.’ And a week later I figured out it was love. I’m sorry, did that make any sense? I think I feel the wine.” She laughs.\n“That made perfect sense . . . that was beautiful. I don’t know if I’ve personally ever felt that way about anyone before. But with Noor’s memories . . . I know what you mean, Irene.”\nIrene turns to me and looks as though she’s about to speak several times, the expression on her face drifting from an almost-frown to an almost-smile and back again. The intensity of her gaze makes me a bit nervous, and I laugh to shake away the slight discomfort.\n“What is it?” I ask.\nIrene takes a sip of wine. “Nithya, because of Noor’s memories, of course . . . I really have to wonder, do you feel something for me? I mean, you tell me how much she loved me, and you describe to me what she felt. But it’s you living all of that. And you still remember all of it . . . I have to wonder.”\nI sigh. “Honestly? Yeah, Irene. I do. Most of the time I have to work incredibly hard to separate her feelings for you from mine. And it’s almost unbearably tempting to just feel everything, the full extent of her love for you . . . especially because . . . ”\n“Because what?”\nI take a sip of wine. “Because I feel something for you too. And I don’t completely understand if it’s coming from me, or if it’s some memory leakage coming from Noor’s experiences. But I do know that from the moment I met you, there was definitely something. I mean, how could there not be, you know? You’re brilliant, and powerful, and . . . intense and so beautiful. How could I not feel something?”\nOur faces seem to be drawing closer and closer together, but maybe it’s the wine. She half smiles. “What would it even be like, us, together? You, with the lover of the person whose experiences you’re living to investigate her death, your feelings influenced by who-knows-what. And me, with the person who gets to live the life of the woman I loved, a person who has probably been influenced by her in the past few weeks. I’m definitely not sober enough to untangle all the moral and ethical implications of that right now.”\nI look at her for a while before speaking. “I don’t really know either. It would be pretty uncharted territory, wouldn’t it?”\nIrene smiles at me, and I have no idea what compels me to say what I say next, but I smile back at her a little bitterly, and whisper, “But in its own slightly fucked-up way, isn’t it kind of a perfect match?”\nAnd with that, our lips meet, and there is no turning back.\nWe laugh and we kiss, scattering clothes around the place as we make our way to the bedroom.\n“Is it okay if I don’t play the light pulses tonight?”\n“Yeah you can postpone them for one night.”\nAt the entrance to the bedroom, I pause for a moment and pull away from her, look into her eyes. “Hey, Irene. I completely understand if it wouldn’t be okay but . . . can I feel what Noor felt for you, just for tonight? Please?”\nIrene nods. “I don’t know if it’s the right thing to do, but I want that too, Nithya. I need that too.”\nI kiss her deeply, run my hands through her hair, and let Noor’s feelings flood into my own, creating a beautiful mix of deep, comfortable, strong love, and new, exciting, passionate lust. I stop separating my memories from hers, and the two worlds blend together. It’s overwhelming, but in a good way, and as it hits me that I’ve loved this woman countless times before, the care and intimacy and ache I suddenly experience for her is the most powerful thing I have ever felt. As we make love, I realize I’m not Nithya anymore in the moment, and I’m not Noor either. I’ve become someone entirely different, memories and emotions from the two lives blending together, but everything focusing and revolving around . . . Irene. I know it’s probably a mistake. But I tell myself just for this one night, I let myself become this new entity, and it feels beautiful, and right, and . . . true.\nAfterward, as we lie together, the sweat drying off our bodies under a fresh, cool sheet, I look over at her and decide to tell her.\n“I have the illness. And the trials are so accessible now that I got a place in one easily. I’m taking the esophagus-coating liquid twice a day to ensure that I’m not contagious, I won’t get any bile-inducing coughing fits. But . . . I’m not going to do the treatment that would cure me. I can’t tell you why right now, but I cannot bring myself to do it. I think I’ll have around a year. I’m sorry.”\nShe looks at me for a long time, and I can’t read the expression on her face. But then she turns off the lamplight next to us, and pulls me close to her, wrapping her arms around me. I fall asleep there in her arms, feeling absolutely, comfortably, wonderfully safe.\nI wake up to a crashing sound in the bathroom, and someone saying “FUCK!” loudly. I pull on a T-shirt and rush to the bathroom, where I see Irene sobbing. A toothbrush holder had been knocked over into the first of the pillboxes for Noor’s experiences. The box has opened in the process, and pills are scattered everywhere, in the toilet and the sink and on the floor.\nI hold Irene close to me, and she starts to say, “I’m sorry Nithya! I’m so sorry I’m so sorry I’m so fucking sorry,” as she buries her head in my shoulder, snot and tears soaking through my shirt.\n“It’s okay! Seriously, this is no big deal! I have a prescription, I can get more pills. Don’t worry, seriously!”\nBut she doesn’t seem to hear me. She just keeps saying it over and over again. “I’m so sorry.”\nNoor sits on an uncomfortably textured couch in a small waiting room, her mind going blank as she observes the beige and blue diamond pattern on the carpet at her feet. Someone finally opens a door and calls her inside. “They’re ready to see you now!”\nShe enters a room full of people way above her pay grade. She’d tried to remember everyone’s names but couldn’t retain any of them.\n“Sit down, make yourself comfortable! Do you want any water, coffee, anything?”\nNoor shakes her head and sits.\nA woman at the head of the table they’re all arranged around leans forward, smiling. “Great stuff you found during your last sampling mission, isn’t it?”\nNoor frowns. “We can’t continue doing this. P. meyeri is intelligent! A single sponge contains more synapses than we can even fully comprehend! We have to tell everyone.”\nThey look at one another, before turning to her. One man sighs.\n“Look—Noor—right? We . . . we already know about this. Someone discovered this before you. Actually . . . we’ve known about this almost since we discovered the sponge. In fact, it is a crucial part of how we treat the diseases.”\n“What?”\nThe woman at the head of the table widens her smile. “We have this under control! There is nothing for you to worry about. We’ve known about this for some time, and we’ve taken our research on P. meyeri in some very interesting directions! Some of the techniques used to treat certain mental illnesses these days in humans, physically changing motivation especially, can be mapped to the nervous system of P. meyeri! And the best news is that it does not feel pain, or grief, or any sort of common human emotion at all, really. Quite frankly, it still more or less fits the guidelines listed for which animals are ethically allowed to be experimented on! And with how crucial it is for treating diseases, we have applied for and received an approval to continue working with it too.”\nNoor opens her mouth to protest, when another older woman, a kind expression on her face, speaks up. “You cannot deny how important these sponges are to treat those new diseases. You, or someone you know personally, must have been affected in recent years. And I guarantee that P. meyeri can or did save their life. It is an unsettling prospect, sure, to use a possibly intelligent creature in this way. But ultimately, do you not think we should prioritize our own species? Our loved ones? Our family, our friends? Without this treatment, people would die, Noor. Millions of people. Do you really want to see that happen, knowing there is a way to prevent it all?”\nNoor feels sick. She doesn’t know how to respond. “Why did you call me here, if you already know what I found? And why don’t other people know?”\nThe man who spoke earlier replies. “Great questions! Two reasons. We think it’ll be best for you to switch departments and work directly with using the sponges to treat diseases instead of studying its larvae and reproduction. Maybe it’ll make you . . . understand a bit better, why we need to do this. And, we need you to sign some contracts. See, it might lower the morale of some of the people who work here, if what you discovered gets out. Have you told anyone yet? Your crew member on the sampling mission, perhaps?”\nNoor shakes her head. “I closed the viewport connection I had with Matias right before I scanned. It was only audio communication with him, and I didn’t say anything out loud about the neurons. You can check the helmets’ histories if you want.”\n“Good! Sign these straight away!”\n“What happens if I breach the contract? If I do tell someone else?”\nThe man smiles. “Well, you would agree to get your memory optogenetically wiped clean of these events, if that happens. And we would probably have the person you told sign the contract as well.”\nNoor almost laughs. “Sorry, I don’t think I can do that.” She gets up to leave.\nThe woman at the head of the table calls to her. “Of course, take your time to decide. But I strongly advise you to sign.”\nOn her way out, the old woman speaks. “Dear, these sponges can be very dangerous things. It’s probably for the best that we control them! Do sign the contracts.”\nThe man speaks again too. “You know, you remind me of Dr. Meyers. Did you ever get a chance to meet him, before that terrible, unfortunate event? He was such a kind man. It’s a shame, what happened to him, eventually killed by his own discovery. I think it’s best that you sign these.” He holds the contracts out toward her.\nAnd Noor, her heart pounding and her stomach churning, takes them from him before leaving the room.\nWhen Noor gets home that day, she uses Sana’s touchscreen to call Matias.\n“Hey, we need to meet up, as quickly as possible. See you soon.”\n“I promise, Noor. I’ll take a look at the gemmules. And if anything happens to you . . . I’ll make sure the research is published. I’d want to do that for you.”\n“You take digits zero to nine and assign each one to a music note, starting from middle C and going up into the first few notes of the next octave. Then, you rewrite the first twenty-six terms of the Fibonacci sequence using the music notes, zero as middle C, thirteen as DF, one hundred and forty-four as DGG, like that. For the repeated one, sharped D is used. Is that right?” Irene looks at Sana, and Sana nods at her.\nIrene and Sana sit together on the bottom stair of Noor’s home. Sana is wearing a small synthesized paper party hat with “12” written on it. It’s Sana’s birthday party, and Noor has decided to invite Irene over, just for this one day. She wants her daughter to meet the woman she hopes to marry someday, even if Sana doesn’t know who Irene really is quite yet. She will . . . if all goes well with what Noor’s planning.\nIrene continues, “And within a measure, one-digit Fibonacci terms would be quarter notes, two-digit terms eighth notes, three-digit terms triplets, and so on, ensuring that each ‘letter’ would take up one ‘beat’ in each measure of the cipher, with each measure holding a word. Looking at the time signature of each measure, whatever number is above four is the number of letters in the word the measure holds! I love it, Sana! That’s an awesome cipher you’ve created.”\nThanks, Sana plays.\n“Could you play that one more time, but a lot slower? I want to figure it out.”\nSana nods and plays it again much slower.\n“That’s a T . . . then H . . . A . . . that’s N . . . Oh! You’re playing ‘Thanks!’ You’re very welcome.”\nNoor chooses to walk over at this moment. “Sana, you showed Irene your cipher?”\nI like her, Mommy. She told me that she volunteered and helped assemble the zero-emission machines used to keep the conditions around the last coral reef from deteriorating for another decade. It’s going to keep a lot of critically endangered species alive for a little more time.\nNoor smiles at Irene. “You never told me that you helped save the last coral reef!”\nIrene shrugs.\nSana types on her touchscreen and shows it to Irene. It says\nI like you on it.\nIrene grins from ear to ear, and it makes Noor’s heart sing. It’s these moments that make her really question what she’s doing. She thinks to herself. If the research doesn’t work out . . . would Irene understand? Would I be able to go through with it? Noor wishes for the millionth time that she could trade places with Irene. And she wishes for the millionth time that she had the strength to tell Irene what she’s doing.\nOne of Sana’s friends motions something to Sana, and the child leaves Noor and Irene to go into another room. Noor sits down on the bottom stair.\n“How’s the treatment going?”\n“My small intestine is around one-fifth sea sponge now! Can you believe it? Well, not really a sea sponge, but made of these almost stem cell-like things inside a sea sponge, that replace everything they need to replace all by themselves! Apparently, they learn to replicate my body’s HLA variants in the process, release antagonists for pattern recognition receptors, NK-cell activating receptors, and T-cell receptors, and have a high surface concentration of sialic acid, so there is no immune response! It’s an amazing treatment. Still a long way to go, but I’m feeling good about it.”\nNoor looks away. “That’s nice, Irene. I’m glad it’s going well.”\nIrene laughs. “You know, I’ve been thinking about it. You obviously don’t have to tell me if I’m right or wrong, but I’m fairly sure this is what your top secret line of work is. I mean, you get weird every time I or anyone else mentions P. meyeri. Besides, I like to think you’re working on the stuff that’s saving my life. Noor, my beautiful knight in shining armor.”\nNoor feels herself begin to tear up. She pulls Irene into a tight embrace.\n“I love you so much, Irene. You know I’d want you to live forever, if that was possible, right?”\nIrene gently returns the embrace, and caresses Noor’s back lightly. “Of course, my love. Of course I know. I promise you, I’ll be okay. I’ll get better, and I’ll live.”\n“Hum Aap Ki Ankhon Mein,” by Geeta Dutt and Mohammad Rafi plays softly in my kitchen as I pour the fragrant filter coffee, made from rice milk and Irene’s favorite blend from the orbiting gardens, which I spiced with cardamom and cloves, into a cup. Irene is looking out a window. She seems lost in thought, but she’s smiling, which makes me smile a bit too. She shakes off whatever she was thinking about and takes the coffee from me.\n“Do you want a sip?”\nI shake my head. There’s no way I can drink coffee anymore, it would leave me doubled over in pain for hours. Over the past two months, twenty pounds have just dropped off my body, regardless of the amounts I eat, and I feel cold a lot these days. My reflection in the mirror sometimes doesn’t register to me as what I look like these days, lips devoid of color, sunken eyes, the whites sometimes taking on a yellowish tinge, and massive dark semicircles beneath them. Truthfully, my appearance was always a bit of a point of pride for me, and the bold lipsticks I used to wear not looking quite the same on my face anymore stings more than I’d like to admit. I forget all of that when I’m with Irene, though. She makes me feel absolutely beautiful, always.\nIrene takes a sip of the coffee. “It’s delicious! I didn’t know you could . . . is making coffee still in the realm of ‘cooking’?”\nI sit down across from her. “Honestly, I have Noor to thank for this one too. You know, she and I have a similar cultural background. When I was younger, I was a lot more religious. Still don’t know quite why it happened that way, my mother was pretty religious, but my father was an atheist, and there was never any pressure to believe in anything. But I think I was looking for a way for the world to make sense. Not in an ‘everything is going to be okay’ way, but more of a ‘there is a reason for everything, and a meaning to everything’ way . . . I don’t know. Anyway, I stopped believing in any sort of higher power eventually, and when I did . . . a part of me felt like I wasn’t really, truly, allowed to take part in celebrating various aspects of my culture anymore. I know, it was kind of silly, but I cut myself off after that, from the clothes and the cuisines and the songs and the events and . . . the community, I guess. Noor wasn’t religious either, but she very much participated in celebrating her culture anyway, and I think seeing that made me feel like it was okay. So . . . enjoy my family’s recipe for filter coffee, it’s pretty good, isn’t it?”\nIrene holds my hand. “I see you’ve been influenced by her love of old Bollywood songs too.”\n“I think that’s definitely new for me, but I really like them. I have no idea why she enjoyed listening to such old songs though, she never thought much about it herself.”\nIrene puts the coffee down. “I think, for her, it was all about the idea of connecting to past generations. Think about all of the people, who haven’t been alive for a century or more now, watching those movies, or listening to those songs. It makes them seem more human, doesn’t it? You’re kind of hit with that realization that these people lived and died, they were just like us. And it’s an interesting thing to feel. Once, she and I went to a redwood forest, saw a fourteen hundred-year-old redwood tree. She just stood there, for almost half an hour! She was thinking about how many people had stood where she was standing, how many people over the centuries saw that tree. I think it’s the same reason she listened to those songs.” Irene sighs.\n“I remember that day! It was so nice, walking around with you, in the fog-covered forest. We had such a wonderful time, didn’t we?” I catch myself too late. “I mean, you both had such a wonderful time, didn’t you?”\nIrene looks at me and frowns. She doesn’t say anything for a long time.\n“What is it?” I ask her.\n“What kind of a person am I, for doing this?”\n“What do you mean?”\nShe takes a while to respond. “I don’t know exactly why I’m with you, Nithya. I don’t know if it’s because of you, or because the more time I spend with you, and the longer you live Noor’s experiences, the more you remind me of her, and the more I can almost pretend she still exists. It’s unfair to you, you’re an entirely different person.”\n“Well, if we’re going there, what kind of a person am I for being with you? Instead of letting you grieve, I kept meeting you, even if I knew Noor was influencing me, even if I didn’t know entirely whether it was me that was falling for you or her, even if when I’m with you sometimes I forget to keep track of where I end, and she begins.”\n“Maybe we’re both being selfish.”\nI sigh. “Do you want to stop seeing me? Because even if it’s selfish, or wrong, or unethical, I don’t think I want to stop seeing you. Maybe that makes me a bad person, or a weak person . . . but the truth is that I’m in love with you. And frankly, I don’t care where it’s coming from. It’s the same set of neurotransmitters and it’s the same physical process, and like it or not, this is still my lived experience, even if it now includes someone else’s too. And my lived experience is telling me I love you.”\nIrene starts to tear up. “I don’t want to stop seeing you! And I love you too! But you shouldn’t love me. And I know for a fact that you’re not going to love me for much longer, too.”\n“What, because I’m sick? I can’t believe you just said that to me!”\nShe shakes her head, speaking through tears. “No, it’s not that at all, it’s something else. Lots of other things, actually. You’ll find out soon, and then you’re going to hate me! And you’ll agree that I am a terrible person for seeing you, for letting you fall for me . . . I just liked you too much! And you reminded me of her . . . and in a way you brought her back to life for me. But I did something terrible, Nithya! And soon you’re not going to love me anymore, I know it.”\nI try to touch her shoulder, but she shrugs me away. “What could you possibly have done?”\nShe takes a deep breath and wipes her tears away. “If it wasn’t for something I did, something terrible, Noor would have been alive right now. I think I killed her, I think it was all my fault. I didn’t know what would happen! And now she’s gone, forever, and all I can do is grasp at the occasional, flickering ghost of her that I see in you.”\nIrene turns away from me and leaves my apartment. I let her.\nWho are you? Are you me, in my current, lived experience? Are you my disembodied brain, lying miles away from my corpse, looping through my memories to prepare a set of light pulses? Or are you someone else entirely, a stranger, maybe, living out some of my most memorable moments? I’ve been searching for something to show me which one it is, a sign, a glitch, a flash in my surroundings? But it’s an impossible quest. I can only wonder who you are.\nThis is the one Irene has. The phage has two capsid heads, each containing a packet of viral DNA, and two protein sheaths, each ending in spider-leg-like fibers. Instead of attacking bacteria, this phage goes after cells in a person’s small intestine and esophagus.\nSpread through the air, as soon as phages enter a person’s mouth, they will make their way down the esophagus, either binding to squamous cells on the esophagus and injecting the cells with one vDNA packet or continuing down the esophagus until they reach the small intestine, where they then are able to bind to enterocytes and inject them with the other vDNA packet. After being infected, the cell enters a lysogenic phase. The vDNA packets are tied to a protein mimicking a nuclear localization signal. They trick importin receptors into bringing the vDNA into the nucleus of their host cell. Here, the vDNA is incorporated into its genomic DNA, and as soon as this occurs, the infected cell’s function is altered for the rest of its life.\nIn the small intestine, lysogenic enterocytes become immensely oversized to make room for as much eventual phage production as possible, in the process, disrupting nutrient absorption. Severe internal growths, agonizing stomach pains, diarrhea, vomiting, and eventually fatal malabsorption result from this. Eventually, close to natural cell death, the vDNA tells it to enter the lytic stage, and it creates as much phage as it can carry before bursting and releasing it. The phages that were just released either infect other enterocytes or travel with bile, as the lysogens around the recently burst cell send signals to the lysogens in the esophagus. When a lysogenic enterocyte in the small intestine bursts, the lysogenic squamous cells in the esophagus receive signals to trigger gastroesophageal reflux, and it induces a coughing fit, bringing the virus-carrying bile up into the person’s mouth and then spreading into the air to infect other people.\nFor a while, there was no way to stop the lysogenic enterocytes from eventually proving fatal without stripping the entire lining of the small intestine and replacing it using stem cells, an expensive and invasive procedure that runs the risk of reinfection, since the proteins on the surface of the enterocytes wouldn’t change. Then came the discovery of P. meyeri.\nWith P. meyeri, all an infected person has to do is take a pill every day over a period of time that contains pre-specialized archaeocyte cells from the sponge. The highly specific cells target lysogenic enterocytes and simultaneously work to destroy them and perform normal enterocyte functions themselves. P. meyeri archaeocytes end up entirely replacing the lysogenic enterocytes, and the infected person is cured. Since most of the proteins on the new cell surface are very different, there is no risk of reinfection as well.\nThe woman from Noor’s earlier meeting leads Noor to a window looking into a room with a single P. meyeri sponge in the center and turns off the light in the hallway around them. “I’m glad you signed the contracts, Noor.”\nThere’s some sort of a light system set up inside, with tiny blue LEDs everywhere. The main lights in the room go off as well, and the LEDs turn on. A dancing blue light display begins, in a similar yet also quite different recursive pattern to the ones Noor saw in the cavern during the larvae release.\nThe woman turns to her. “What we’re doing is tricking the sponge into believing the lysogenic enterocyte cells we fused to the inner linings of the channels that run through it actually belong to it, and that the infection will eventually kill it. The way P. meyeri responds is amazing. It synthesizes its own, new, modified enterocyte-esque cells, using the many archaeocyte cells it has, and has them slowly but surely destroy and replace the lysogenic enterocytes, ending up fused to the inner linings of its channels instead of the infected cells.”\nThey move to a window looking into another room full of sponges. The woman continues “This is where we take the sponges next.” After Noor realizes what’s happening, she feels nauseated. They’re stripping the inner linings of the sponges’ channels. Autonomous machines take cylindrical tubes with sharp edges, and, entering the few pathways without cutting into the nervous system, essentially shave off the new layers of the sponge.\nAfter the archaeocytes have been stripped away, a small trickle of what looks like the dark corrosive liquid drips out of the sponge. Noor turns to the woman next to her. “Is that . . . ”\nThe woman nods. “It’s a diluted form, so it doesn’t do as much damage to the sponge, but yes, for some reason it secretes that same substance after we strip it of the newly specialized archaeocyte cells . . . Is something wrong?”\nNoor frowns. “There must be a way we can use what we already know to come up with a different treatment, without harming or harvesting any more P. meyeri spon—”\nThe woman smiles and puts her hand on Noor’s shoulder in what looks like an amiable gesture, but she grips the shoulder slightly too tight. “We’ve been doing some research in that realm, but we’re not going to stop using P. meyeri. What happened to Dr. Meyers was sad and terrible, of course, but think about the big picture here, Noor. Once we fine-tune our control of this thing, we can use it for a lot more than just treating a disease.”\nOn her way out, Noor stops by the building where Matias works and checks in with him. “How is it going, with the you-know-whats?”\n“I’m sorry Noor. I don’t know if it’s going to work out. Are you still going to go through with your paper?”\nNoor sighs, but eventually nods. “I don’t feel like I have a choice. This is just what I have to do . . . it’s the ethical thing to do. Are you still going to support me, even if your part doesn’t work out?”\nMatias looks down. “My promise was that if you were right about what you think happened to Dr. Meyers, and if something terrible happens to you too before you publish it, I’ll make sure it’s published, because that’s what I think the ethical thing to do would be. But . . . if my part of this doesn’t work out . . . if there’s no alternative . . . I don’t think I can support you besides that one situation. I’m sorry.”\nNoor wakes up to Irene shaking her, forcefully, with tears streaming down her face. “How could you?!” Irene speaks through sobs. She’s holding a stack of synthesized—Oh. No . . . the paper . . .\nNoor sits up. Irene speaks again. “Answer me! Tell me there’s been a mistake. Tell me you haven’t written up something that will, if approved, get me killed.”\nNoor gets out of the bed and whispers. “I’m sorry.”\n“Is there any other cure?”\nNoor shakes her head. “No . . . but there’s always hope, maybe—”\nIrene starts laughing, bitterly. “This whole time, I thought you were working on the thing that’s been saving my life. But actually, it’s quite the opposite, isn’t it!”\n“It’s an intelligent creature, Irene! It cannot be okay to exploit it like this!”\n“In any other situation, I would agree with you. But this was an emergency! An actual, serious threat to our existence. And if this treatment goes away, what’s going to happen to everyone currently infected?”\n“You haven’t seen P. meyeri like I have, Irene! If you could just try to understand where I’m coming from, maybe you’d see that—”\nIrene scoffs. “I do understand where you’re coming from. I read every page of this thing. But have you, ever, once, truly considered what this is like from my perspective? I mean . . . and . . . why did it have to be you, Noor? Why you?”\nNoor doesn’t know what to say. How did it escalate so quickly? Why is this happening so fast?\nIrene begins putting on her jacket and collecting her belongings.\n“What are you doing?”\n“I’m leaving. I can’t do this.”\n“What are you doing with my paper?”\nIrene stops, grimaces, turns to Noor. “I can’t let you do this.”\nNo, no no no. Noor follows Irene as she walks to the door.“Irene, think about it, please. Sit down, we can talk about this. You . . . don’t know what the place I work for is like. Something really bad might happen. Please, just think about this! Plea—”\nIrene opens the door, turns around, and says, “I don’t want to die,” before leaving and slamming the door shut behind her.\nI wake up to one of the foulest scents I have ever encountered. Looking down, I see that I’m lying in a pool of green liquid. I shit myself. “Ew, ew ew,” I repeat to myself over and over again as I unplug the tubes in the sensory deprivation chamber and rush to the bathroom to clean myself up. After thoroughly cleaning and disinfecting the sensory deprivation chamber, I take my morning pill to trigger the hallucination, like I do every day, and sit on the floor to wait.\nSomething’s different this time. Until now, every hallucination has been about my own life, nothing from Noor’s ever entering them. But suddenly I’m sitting at a beach I’ve never been to before, and that is entirely different from what my own imagination normally invents. I try to move, but I can’t move at all. I look out to see . . . Sana is in the distance . . . half buried in the sand? The tide begins to come in, but she doesn’t react. Water rises and rises until it’s covering everything, and I try to move to her, to my daughter, but I can’t move, and now she’s under water, and now I’m under water, and I can’t scream because it’ll fill my lungs, but soon it’s unbearable and I gasp, inhaling saltwater, and then my vision goes black.\nThe darkness soon dissipates, and I find myself shaking, with tears running down my face, curled into a fetal position on the floor.\nThere are three people named “Matias Rodriguez” living in the nearby area. I try calling the first two from my touchscreen, but I don’t recognize their voices. I recognize the third voice instantly.\n“Hello?” he says.\n“Hi, I’m investigating Noor’s death, and I wanted to ask you a few questions.”\n“I’m sorry, I don’t know if I can help you. I don’t know anybody named Noor.”\n“Excuse me? You went on a sampling mission with her . . . do you remember that?”\n“Ah, I see. I was scheduled to take part in a sampling mission some time ago, but I got a pretty bad head injury and was unfortunately unable to do the mission. My memories are very poor quality or nonexistent for a while after that, but I’m back to normal now.”\nOh, fuck.\nHis memories . . . I think I know what happened. Fuck. I sigh, but then I remember something and my heart sinks even more.\n“How’s Syd doing?”\nMatias groans. “They’ve stopped communicating with me entirely now! Not even through their touchscreen . . . it was bad enough when they wouldn’t change their damn expression, but now . . . Wait. How do you know about Syd? Who are you? Have we met?”\nDamn it, poor Syd. “I’m sorry to tell you this, sir, but I’m afraid you might have had some of your memories wiped.”\nMatias’ tone changes abruptly. “Did Syd put you up to this? Did my husband? Endless paranoia in my family these days, I swear. I’m going to end this call now. Good day.”\nI meet Irene at the same café we met at months ago, spot her sitting in the same booth, drinking the same coffee. I feel like if we meet here, not only will our conversation go unheard in the hum of all the other conversations taking place around us . . . we will be more inclined to be civil. I will be more inclined to be civil. It’s not just my anger driving me right now, it’s Noor’s too.\nI sit down across from her. She smiles at me, weakly.\n“Irene . . . what did you do? And . . . why did you keep this from me?” I feel tired, all of a sudden.\n“I’m sorry, I couldn’t risk telling you earlier. I didn’t want you to hate me. I wanted to have just a little bit of time with you, even if I knew it would end up like this eventually.”\nI shake my head. “I can’t believe I didn’t see it earlier. This whole time, I was just . . . blinded by my feelings for you. Damn it, for months! What did you do with her paper? And what else have you been keeping from me?”\nIrene looks down.\n“ . . . Is there something else you’re keeping from me?”\nShe flinches.\nI sigh. “Look, at this point, I would appreciate you just coming clean with me, okay? Just tell me what you know, please, for her.”\nSomething seems to click into place for Irene. She looks very determined, all of a sudden. After a long stretch of silence, she nods, and says “Fine. Okay, fine. You’re right. I should do this, for her . . . she deserves justice. Those assholes need to be taken down. Screw it, I’ll tell you everything.”\n“Thank you. Fill me in, from what you did with the paper to whatever else you haven’t told me. Tell me everything. Starting now.”\nShe does.\nShe tells me that she took the paper and asked around the place where she was getting treated until she found the contact information of Noor’s workplace. She met with three of their representatives, a young woman, an older woman, and a middle-aged man. They thanked her for the information, told her they would “take care of it,” and that they would be in touch with her soon.\nIrene looks back up at me, shaking her head sadly. “I didn’t know what they meant by ‘taking care of it,’ Nithya! Just slightly over a week later, she died!”\n“Why did you keep this from me? Self-preservation, again?”\nIrene winces. “Maybe a little bit, yeah . . . but I like to think I would have reported all of this to you, immediately, if they hadn’t made me . . . ”\n“Made you do what?!”\n“Please try to understand! They threatened me, they threatened to hurt Sana! I had to, Nithya!”\n“ . . . What?”\n“ . . . I made you sick. It was in the first box of the set of pills I gave you. I put the phage in, too.”\nYou did what?! I stand up to leave.\n“Nithya, wait! You don’t understand! I’ve been protecting you, this whole time! I’ve been telling them you’re doing the treatment! They thought if you had it, you wouldn’t side with Noor. They think you’re on their side!”\n“You’ve been spying on me too? What the actual fuck? All of that stuff, about wanting to know what it’s like in her head, was a lie?”\n“No, that came out all wrong! I haven’t told them much, I promise! Your investigation is safe! I swear, I’ve been protecting you! I’m on your side Nithya! And it wasn’t a lie. I wanted to know what her thoughts were like, desperately. That wasn’t a lie at all!”\nI can’t look at her anymore. I walk out the door. She was threatened, though. Hear her out. A little voice pops into my thoughts as I leave the café, and I can’t tell if it’s coming from myself or from the Noor part of me. I can barely distinguish the two anymore now, and I’m tired of trying to.\nSana, my daughter, I am so sorry I left you. I love you, so much. Maybe someday, I will see you again. Would you recognize me? Would it still be okay? I miss you Sana. I love you. I’m so sorry.\nMommy I want to tell you about something. Sana plays her flute to Noor, standing in the doorway to the living room.\nNoor sits at the coffee table, typing into her touchscreen. She stops, closes her touchscreen, and smiles at Sana. “What is it?”\nSana begins an uncanny melody. I have been thinking. I started communicating like this to incite action to stop the climate catastrophes. And I still care about that so much. But I think along the way I figured out that I prefer communicating like this to communicating any other way. I like the control I have over my flute and I like how it sounds and I like that it is a language I invented. I think even if the demands were all met I would still type in my touchscreen and play my flute to communicate. Is that okay?\nNoor nods. “You know, I have to admit that I struggled sometimes to accept your method of communication. I tried to hide that from you, and I’m really sorry if any of that came through. But over the past couple years, Sana, I’ve realized that communicating like this makes you happy. And I’d never want to get in the way of that. I’m happy for you, and I love you so much. Of course it’s okay. Is it okay if I give you a hug?”\nYes. I want to hug you too. Sana moves to her mother and embraces her. Noor holds her daughter close for a while.\nNoor recognizes the knock, and she opens the door to see Irene.\n“I’m so sorry Noor! I told them. I told the people you work for. I just don’t want to die. I really don’t want to die.”\n“Hey . . . come in, it’s okay. I knew you did this, it wasn’t hard to guess. Come inside, we left things on a weird note last time.”\n“Is Sana here?”\n“No, she’s at school.”\n“You’re not at work? I mean, I should have thought that through before showing up, but I’m realizing it now.”\n“ . . . No.”\nThey move to the living room couch and sit next to one another. Diffuse light comes down through the skylight above them. Noor turns to Irene, and half smiles.\n“You don’t have to be sorry Irene. You were acting out of fear for your own life . . . and in a way, I did betray you. But I wish you could have seen what I’ve seen before making that decision. Especially because the research company I work for . . . I think they’re capable of some pretty awful things. But I prepared for this, just in case. It’s why I got the light-gated-ion channels two years ago.”\nIrene frowns. “What do you mean? Is . . . is something going to happen to you?”\nNoor sighs. “I was trying to tell you this earlier. But . . . don’t worry about it right now, okay? I forgive you for what you did, can you forgive me? I just . . . for a little bit . . . want it to go back to how it was. I love you, Irene. And that hasn’t changed. Can we go back to how things were? Please? I really need that right now.”\nIrene thinks for a long time, but then pulls Noor close to her. They hold each other for a while, and then Noor kisses Irene. Irene kisses her back. “I love you too. I want it to go back to how it was before, too.”\nI wander aimlessly around the town, trying to collect my thoughts. With every session of Noor’s experiences, I lose my sense of self more and more. I don’t quite know who I am anymore, and I keep asking myself, would Nithya do this? Would Noor? Is this Nithya? Is this Noor? But it’s exhausting now, trying to keep track of my memories and my thoughts, and trying to remember which are hers and which are mine. Mine. But who am I?\nWith those two years of Noor’s experiences came a lifetime of memory as well, something I was not anticipating at all. But I should have known. After all, what are our thoughts, our experiences, our reality, without our memories? Of course I remember things now that weren’t necessarily events taking place in Noor’s experiences. Her every recollection of some other past event was encoded in her brain activity too, her memories within a memory. And subconsciously as well, memories were coloring her every thought, and those not-so-obvious rememberings were transferred to me too, running underneath my thoughts now too. It’s impossible to live a snapshot of someone’s experience without inheriting everything that came before that snapshot too, whether it’s immediately obvious or somewhere under the surface. Frankly, it’s futile to try and separate myself from her at this point. I can’t even remember how I used to think before I lived that piece of her life.\nMaybe I should stop separating them. All those times, making love to Irene, when I released my hold on these two identities, and allowed them to blend into each other, it felt so right! Irene. Noor forgave her. Would Nithya? Would I, whoever I am now?\nMaybe I’m exhausting myself, thinking that I’m separating the two identities, when I’m really deluding myself trying to categorize my thoughts into what I believe Noor would think and what I believe Nithya would think, when in reality there is no way to know where those thoughts are truly coming from.\nI should let them blend.\nI put on Noor’s favorite song, “Pyar Kiya To Darna Kya,” sung by Lata Mangeshkar, and decide to stop trying to control my own mind. I let the music wash over me, I let the two identities come together, mixing into one another, memories and thoughts and experiences and reality.\nI’m not quite either of them, any longer.\nI smile. I think I know what to do next.\nI call Irene from my touchscreen. As soon as she picks up, I say, “Listen, if you’re really on my side, you’ll help me finish what Noor’s started. And you can begin by working with my partners Marie and Anthony, to restore the memories of a man named Matias Rodriguez.”\nAfter a long pause, she responds. “ . . . I will. I promise I will.”\nI arrive at Noor’s aunt’s house, where Sana lives now, and I take a deep breath before knocking on the door. Noor didn’t know her aunt super well, but she seemed nice, and didn’t live too far away.\nI’ve just started to consider knocking on the door again when it opens, and she’s standing right in front of me, flute in hand. Sana. It takes all my strength to prevent tears from filling my eyes. I’m immediately flooded with joy. My daughter. It’s been so long . . . But she’s not my daughter . . .\nThe girl takes out her touchscreen and types\nWho are you on it.\nI clear my throat. “I’m Nithya . . . we met once, several months ago. I’m investigating your mother’s death. Can I come in?”\nSana stares at me for a moment before nodding and letting me into the house. She types on her touchscreen\nI did not recognize you at first. You look different now.\n“Yes, I’ve become sick. Hey, can I talk to your great-aunt? I need to ask her a few questions.”\nSana leads me to the living room of the house, where an old woman sits on a doughy blue armchair, facing out the window. Next to her is a beautiful upright piano, with several pages of sheet music on display above the keys. Sana, in the adjacent room, has begun to play something on her flute.\nI turn to the old woman. “Hi Ms. Bakshi. My name is Nithya, and I’m investigating your niece’s death. Noor was working on something, a paper, before she passed away. Do you know if any copies of her work still remain? On her touchscreen, or any physical copies, or anything related at all? It’s crucial for our investigation.”\nMs. Bakshi sighs. “I’m afraid you’re months too late. I had brought everything Noor had worked on to this house, but it’s all gone now. There was another group of people who asked me the same question several months ago, very soon after Noor’s death, with a warrant to search the house. They took all of Noor’s research, all the physical copies, and all the electronic ones too. I’m sorry.”\nMy heart sinks. It’s all gone. I don’t think I can pull the entirety of Noor’s paper out of her memories. There’s no hope now, unless Matias knows something, maybe? Maybe he has a copy!\n“Thank you, Ms. Bakshi. Don’t worry about it. I should probably get going now.”\n“I’m sorry I couldn’t be of more help. I wish—Hey, Sana? Could you keep it down, just a little bit? The grown-ups are talking here!” She turns back to me. “I don’t know what it is with that girl and that strange song. She plays it all day, every day, several times in a row. I can’t say I like it too much, but if it makes her happy, I don’t have the heart to ask her to stop. Do you want something before you leave? Chai, coffee? I have some freshly made rice-milk peda in the kitchen! You must try some.”\nI shake my head. “I’m sorry, there’s not much I can consume properly anymore. But thank you for the offer.”\nAs I take my leave, I pass by the piano, and something catches my eye as my gaze drifts over the sheet music. Wait a minute . . .\nAnd then, I actually start to hear what Sana has been playing on her flute this whole time.\n. . . The choanocytes lining the innermost channels of a Panaceius meyeri sponge differ from choanocytes in many . . .\nIt’s the paper! My eyes fill up with tears. I go to Sana. “What you’re playing right now . . . it’s your mother’s research, isn’t it?”\nSana stops playing her flute, looks up at me, and nods. After some time, she plays You understand my language?\nI smile. “Yeah, I do.”\nYou really have lived a part of my Mommy’s life.\nI kneel next to her and tears start flowing down my face. “Yes, Sana. I have. And because I have, I know she loved you so much. I’m . . . I’m so sorry you’ve lost her. I’m so, so sorry.”\nNithya. I would like a hug. Could I give you a hug?\nI nod. Sana hugs me, and I can’t stop myself from crying into her shoulder.\nWhen she lets go, she takes the stack of sheet music from the piano and hands it to me. I sit and look through it, remembering Noor painstakingly documenting all of it . . . But there’s a new section now, at the end, with an annotated name in the margins, still written in the Fibonacci-sheet music language. Matias Rodriguez? I look at the title of the new section, and I can’t believe my eyes.\nIt’s titled, “The Cure.”\nIt turns out that there is a way to grow sponges out of the P. meyeri gemmules, and sponges that grow from them are not conscious in any way, they do not have the extra layer, or the corrosive liquid! What Matias did was take certain genes from the pre-specialized archaeocytes from a conscious P. meyeri sponge and introduce them to the gemmules. The sponge that grew from the gemmule ended up having inner channels lined with the specialized archaeocytes. And this sponge had no qualms about reproducing in the simulated settings within a research lab. When the sponge from the gemmule reproduced, it did not create larvae, but only gemmules of its own. And when the next generation of gemmules became sponges, they also contained the specialized archaeocytes. Matias had found a way to create a population of sponges that were as ethically alright to experiment on as other sponges discovered before P. meyeri, that contained the cells necessary for the treatment and could reproduce! I’m fucking stunned. This could save my life.\nI thank Sana and her great-aunt for their time over and over again, filled with happiness. As I’m about to leave the house, Sana tugs on my sleeve and then plays something on her flute again, looking right at me.\nNithya. About what you said earlier. I do not know if I believe Mommy is entirely lost. Will you visit again? I want to have more conversations with you. And I want to meet you again.\nI grin at her, and nod. “Sana, I can come here as many times as you want me to, for the rest of my life. Thank you for making your cipher. I think it’s a lovely way to communicate, and it truly saved the day. I’ll see you again soon, I promise.”\nAfter I leave the house, I begin to walk away, when a small synthesized-paper envelope falls out of the pages of sheet music. There’s a single word written on it, still in the Fibonacci language. A single measure, time signature five-four. Eighth notes E, D. Sixteenth notes D, A, high E, high C. Quarter note F. Triplet notes E, F, F. And finally, quarter note F, again.\nI can’t help but smile. I recognize the name immediately.\nNoor sits at a desk, writing out sheet music on synthesized paper. An envelope sits next to what she’s writing, with “Irene” written on it in the Fibonacci-music language.\nDear Irene,\nMy love. I do not know if you understand exactly what you did. But you might soon. If that happens, I would want you to know I forgive you. And that I still love you. And . . . I understand what you did. But I also want you to know what it is like from my perspective. I want you to see P. meyeri for yourself. Feel what I felt for yourself. That is why if this is ever found . . . I would want you to be the one to live out my experiences. I do not know if it is going to happen like that. But I would want you to.\nThere’s good news too. Matias found a cure! I have just finished adding it to the paper. You will live my love. No matter what. And hopefully we can get this released soon and nothing will happen to me and we can both live together for decades more . . . happy and in love. I would like that very much. I love you Irene . . . this probably will never reach you, but I wanted to write it anyway.\nLove,\nNoor\nIrene and I sit together, drinking coffee next to the sensory deprivation chamber in my living room. Oh man, I missed the taste of coffee so much. It’s been a month on the new treatment plan, and I’m already feeling so much better.\nMatias’ memories have been restored. What happened was that he thought he would try to convince the research company to stop exploiting P. meyeri, since there was an alternative. But it didn’t work, and they hinted to him of the other, non-medication-related purposes that they could use P. meyeri for. They threatened him and made him sign the contracts, but he went to Noor with his research anyway, not knowing that Irene had told the research company about her work already. After Noor died, representatives from the company found Noor’s completed paper, after searching her aunt’s house, and discovered that Matias had breached the contract. He had his memory forcibly wiped.\nWith Irene’s help, Matias got his memories back, and working with me, we translated Noor’s paper back. As promised, he made sure it was published, and especially with the world knowing about the cure he discovered. The corrupt leadership of the research company was quickly removed and faced serious consequences. Numerous protections were put into place regarding disruption of the P. meyeri colonies and work is being done now to try and figure out a way to communicate with the sponges. For now, only unintrusive ROVs are allowed down there.\nI look at Irene, drinking her coffee next to me. I wonder, if there hadn’t been a different cure, if I was still sick . . . would I have forgiven her? I shake the thought away. What’s the point of speculating, distressing myself with “what if”s? She had more than proven she supported me . . . and she was making sure the research company didn’t suspect anything about me the whole time. And, the truth is, ultimately, despite everything, I do still love her. Every part of me tells me I still love her. And she still loves me. So, if we love each other, and we make each other happy in spite of everything, why shouldn’t we just . . . be together?\nI move closer to her, and she puts her arm around me. I rest my head on her shoulder. “You know, Irene, I don’t know if I’ll ever be Noor.”\nShe smiles, and she kisses me. “I don’t care. I love you.”\n“And I don’t know if I’m entirely Nithya anymore, either. I think I’ve become someone else, entirely, the result of Noor’s memories and Nithya’s memories blending together, which gave rise to someone new.”\nShe kisses me again. “I still love you.”\nThis makes me smile. But then I remember something, and I sigh. “There’s just one set of light pulses left, Irene. It’s her death. I don’t know if I can do it. I’ve been putting it off. Especially because, while I know she doesn’t understand that she’s in a loop, I know she is, and I don’t want her to experience that again. I just don’t know if I can do it.”\nIrene holds me closer. “Then just don’t do it. You don’t have to force yourself to do that, both for your sake and for her’s. The people responsible have been punished, chemical analyses months ago figured out what literally caused her death . . . there’s no need for you to play the light pulses.”\n“You really think it’ll be okay if I don’t?”\n“Of course, Nithya! You are under no obligation to play that awful experience into your head. I promise you.”\n“Alright, I don’t think I will, in that case.” I settle my head back onto her shoulder. After a while, I continue. “You know, I’ve been thinking. Noor wanted you to be the one to live out her experiences, right?”\n“Yes, but look. I’ve been thinking about this too. I’m actually really happy it was you. If you hadn’t done this . . . I would never have met you. I would have had her with me, always, but I wouldn’t have had you. I’m actually really glad it happened this way, Nithya. Besides . . . we’ve talked about this before, her patterns of neural activity are tailored to fit yours, and there’s no way to get those light pulses again.”\nI look at her. “No, I’ve been looking into this, and I think there is a way, Irene. I think there is a way you can live some of her most memorable moments, too.”\nSo, who are you? Are you my current, lived experience, as I wait for the sedatives to put me into a temporary unconscious state? Are you my brain in the next few hours, almost done looping through my memories of the past several months, to put together a set of light pulses? Or is it you, Irene, my love?\nIs it you, living my memories of the past months, which would certainly include some of Noor’s memories too? I wonder which of Nithya’s memories will make it through, and which of Noor’s will. I hope you’ll tell me all about it soon. And who knows how long the entire set of experiences will be? If they could condense two years of Noor’s life that much, how long will it take for you to live this tiny fraction of mine? Hours? Days? You’re in a waiting room outside right now, and we’re going to have a lovely day together after this procedure is over. I hope we will have a lovely life, together, too.\nBut no matter what, right now, I love you deeply, and Noor loved you deeply. And if you wanted to, my love, in your mind, you could keep us looping endlessly.\nArula Ratnakar is a scientist, artist, science fiction writer and aspiring astronaut. She graduated from Carnegie Mellon University in May 2021, where she studied biology, neuroscience and architecture. She now works in a neuroscience lab, where she is interested in studying neurophotonics, the intersection of declarative and procedural memory, and brain simulation science. All four of her published stories can be found in Clarkesworld Magazine and her artwork can be found in the first issue of Dark Matter Magazine. She is autistic and bisexual.\nThemes of identity and reality have always interested Arula, particularly as someone who is the daughter of two immigrants from India and has grown up in the U.S with many different cultural influences. Arula plans to continue writing science fiction stories, and hopes to work on science fiction movies someday.", "source": "https://clarkesworldmagazine.com/ratnakar_03_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Submergence by Arula Ratnakar"}