{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "D A Xiaolin Spires", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "zO/huFU3xqG88TXVhHjzy/hMLgU=", "id": null, "license": null, "comments": "", "raw_text": "11800 words, novelette  Last Wishes  The urn looked like it weighed a million pounds, but when I picked it up from the bottom, it was as light as a feather. These artisans were full of trickery and skill like that. I’m guessing that’s why my mom chose it.  “Be careful, Jinying,” Dr. Lee-way, the head artisan, said. The hologram designer next to him nodded at the handles, a silent request that I pick it up from there.  “I will,” I said. I moved my hands to the handle and raised it higher. On the bottom were their signatures and the encryption code that certified the authenticity of the piece that surrounded the tiny hole for tuning.  Dr. Lee-way pushed a paper toward me. “Sign here,” he said. “That will confirm the credit transfer.”  I scribbled with a flourish in multiple languages as the form required: mother language of your name and phonetic translation. 津瑩. Jinying.  Dr. Lee-way glanced at my signature and up at me and said, “Seems fitting. Jin. Ying.” He stretched out the syllables, thinking. “My Chinese isn’t great, but isn’t that . . . ferrying . . . conveying . . . and the luster of gems.” He reached out, stroked the urn, and laughed. “You’ll be quite the carrier, no, quite the chauffeur, for this treasure.”  “That’s an interesting interpretation,” I said. “My name’s more about migration, for the jin and the ying reflects my mom’s love for appearance and cosmetics: luster.” I touched my face, thinking about her flawless skin.  He nodded at me, then touched the urn, urging me to pick it up.  I shook the urn, seeing the puzzle-like cracks in the cloisonné design-ware. I felt across the surface. There it was, a few of the flame tree flower pieces made from dray-copper wire I pinched and handed to the artisans years before my mother passed. Across the urn were flowers of all kinds, and also images of that little blue marble in space of our homeland and the Driftnet colonies we’ve transplanted to as our new home in generations after. I had sketched this out according to my mom’s wishes and sent it to the experts. My mom was adamant that I have a hand in her design. She said she wanted the fruits of my labor always near her, so it would feel like she would be cared for.  Of course I would care for her. Even more than doing some sketches and adding a few pinches of dray-copper wire on an elaborate never-yet-seen custom-made puzzle vase.  I pressed my nail into a signature crimson mark in one of the designs of the flame tree flowers, near the inlay draymetal that I had bent. A holo projected from that side of the urn. Dr. Lee-way moved aside and I stepped back to see a brilliant rotating flame tree, its plumage of red-hot lanterns reaching outward like arms trying to pull in the heavens. I thought it might project with her voice, but this one was accompanied by the erhu, the radiant tree dazzling against the mellow sound of drawn-out notes. It was well rendered, without even a hint of voxelation, the contours of the erhu as crisp as the notes. In a few moments, the tree fizzled away and the music faded.  The holo designer raised his brow and said, “So?”  “Looks like top-of-the-line work,” I said. He looked pleased, his eyes crinkling.  “I imagine I’d be able to crack the puzzle in a few weeks,” I said.  Dr. Lee-way laughed. “Ah, the puzzle. That’s not my line of work, so I can’t speak to that. I know Mr. Xin collaborated with your mom for a long while on this. If I know Mr. Xin—I mean look at how his trademark attention to detail is all over this—you’ll be spending years trying to crack it. Maybe your whole life.”  I raised my brows. “I can’t spend my whole life. The clock’s ticking. Custom says I have seven days for my offerings—adjusted to seventy for space travel. That’s the length of time for a funeral; then comes the mourning.”  I shot him a glance.  He turned around, took a look at my bothered expression, and looked flustered. “Hopefully you’ll get it solved soon,” he said. “For custom’s sake.”  It’s not just custom. Customs shift through years and generations, so they’re not static and definitive. I wouldn’t mind that much breaking custom. It’s more that these are the last wishes of my mom and if I didn’t fulfill them, I wouldn’t be fulfilling the requirements of filial piety. I’d have failed. But, I didn’t bother telling Lee-way all that.  I pressed down on another mark and a rocking chair illuminated from the urn. It rocked back and forth by itself, and Teresa Teng’s clear voice broke through, singing about lost love. The image shimmered and in a few moments also dissolved into the air, like it never was.  “I’ll take care of it.”  “Yongli would have liked that.” I nodded, as my heart wrenched at the mention of my mom’s name. Lee-way lacked tact, but he meant well.  He handed me a tuning screw. “Be sure to keep the holos aligned with the sound. Just a few turns a day. These old techniques need a lot of upkeep, not so popular anymore, but the visuals are stunning.”  I placed the urn in its fresh-keep case and sealed it. These top-of-the-line artisan-crafted, technologist-tinkered custom urns cost a pretty penny, not to mention all the accoutrements that go with it. They’re not like the run-of-the-mill popular ones. This one was experimental, incorporating prototype tech—even more pricey. The tuning screw, the fresh-keep packaging for transport, the checkup consultation holos and enhancement wipes. I felt like I was now in charge of a small, high-maintenance, extravagant pet. It cost me more than half my savings.  But, it was quite a work of art. That was for sure.  And, according to my mom’s wishes, her ashes weren’t in there. There was something else going on with the urn. She told me before she passed, that she would leave her legacy to me in the form of an enigma. A grand puzzle I’d have to crack open.  Maybe it was a kind of megalomaniacal flex of power to keep me running in circles. But, I really just think that she wanted to play. Even after her death, she wanted to stay in touch with me, to play, to be involved in my life and share a game with me. Like when we were kids.  She was always like that. Intrigued by challenges and social in her own way, doling out intimacy in the form of brainteasers.  My mom loved riddles and puzzles. When I was a little girl, she sent me on scavenger hunts. She said that she felt bad I was so disconnected with my heritage and dropped pieces of culture for me to pick up. I said culture wasn’t embedded in things, but in people and language. She shook her head and laughed.  “Oh, honey, of course culture is embedded in things. It’s a lasting mainstay of our civilization. People disappear, but things stay. Look at archeological digs. Back on Earth, the home of your ancestors. Pompeii’s ruins. The Terracotta Warriors. The Temple of Hatshepsut.”  Her eyes shone, and she paused. I guessed she was probably thinking of the magnificent reign of Egypt’s first female pharaoh, stories she told me when I was a kid. She used to embellish on the tales, speak gloriously of the great monument the Queen-as-King Hatshepsut built for herself for her afterlife.  “Things give us memory,” she said, gesturing to the house, as if that was a grand story in and of itself, to rival any temple.  “Memory is held in the minds of men,” I said.  “Women, too.”  “You know what I mean,” I muttered.  “But, even if it’s held in the minds, you need that spark to revive it. And things provide that spark.”  She looked wistful for a moment. I scoured the yard, looking for this thing. Always something that she wanted me to find. Her clues were enigmatic, as if only someone who was her could know.  “Made from fire and reaches for the sky,” I said again, crunching on a fortune cookie with the tang of citrus, pushing the sliver of paper in my pocket. Mom was leaning against a rocking chair, also snacking on fortune cookies. Hers were empty, without the iconic fortune paper slips. She had hand pressed them earlier that day, slipping in clues only for me. Shell-shaped and with a dash of her signature pomelo extract, they were tasty.  “Made from fire and reaches for the sky,” I said, tapping fingers on my palm. I traced the yard with my feet. My sandals left impressions in the wet dirt. We had no chimneys in our neighborhood, so it couldn’t be that. What is made from fire? Ash?  Finally, as I neared the trunk of the ol’ tree at the corner of the yard, I saw a flash of a smile appear on my mom’s face. Ah, I said, shimmying up the trunk and grabbing a handful of the bright yellow flowers. “The flame tree. Made from fire.”  “Yes, Koelreuteria bipinnata. Native to Southern China.”  “Yeah? Is it really native to China? Traveled quite far.”  “Yes, like us. The Chinese flame tree. Also called the ‘complex feather leaf tree’ in Chinese. Doesn’t quite capture the poeticism of the flames though.”  “Not really flaming now, is it?”  “No. Too bad. Have to wait for later in the colony year,” she said. Its bright red lantern-shaped seed capsules only flourished in the autumn. These yellow flowers were more like embers in comparison.  I unleashed the crinkled flowers from my hand, letting them rain down onto the yard. I could hear mom crunching on her cookies. “It’s pretty in the autumn. But, the flowers are useful, too. Remember, in Chinese medicine, the flowers clean the liver, detoxify, and promote clear eyes.”  “So you sent me to the flame tree to collect flowers? To, what, detoxify my liver?”  “No, it’s to remind you that culture is in things. Medicinal practices in plants. But, also, you have another clue.” She pointed.  I poked around and resting in the fork of the branches found the next clue, as she promised, another fortune cookie. This time when I cracked it open, all it said was “Aha! You’ve found me.”  “Anticlimactic,” I said. I threw the cookie in my mouth. Within was a sudden burst of flavor, red bean and pomelo. She must have lined the cookie shell with extracts.  Well, that was unexpected.  “Sometimes you just got to enjoy the cookie,” my mom said. “Another message from the sages.” She laughed.  She came over, patted me over the head, and shoved a bunch of empty cookies into my hands. “Eat.”  I snacked on the rest of the fortune cookies in my pocket. My mom handmade enough of them to last me for years, but I could only take a small bag of them for my trip to complete my filial duty.  I was using the porto-vac, sucking up the crumbs from my new comfort suit, while on line for the security check. Once we got to the port, us passengers would be divvied up into autoships.  There were huge cruise shuttles heading back to Earth in the other direction, but mine would be one of the smaller ships, holding only a small crew and a spattering of passengers to go out farther into the Driftnet colonies.  The ticket was terribly pricey, and thank goodness for the research being funded last minute through the Zhongqing Marketing Corp. They’re trying to push through new lines of landscape gardening for sale. They rejected my request to do cultural acquisition on language and religious rites, but held on to my application. Instead, they wrote a comment that they wanted me to collect interviews on gardening practices and ecological data and would fund me for that, since I was one of the few who had a good grasp of far-colony dialects. Beholden to my funders, how can I refuse? I mean, it’s all for my mom, in the end. They granted me a research ticket that allowed me to bring one personal item greater than 10”x10”. That allowance was a luxury.  The security guard grabbed the urn case and pulled it open. I stepped up to say something, but as I opened my mouth I glanced at her partner guard with piercing black eyes like gulfs. He glowered at me. I backed down, but when she took the urn out of the suction mold, holding it tight, she nearly scratched the luminescent enamel embossments with her comm watch.  Blood rose up my back. “Be careful. Can you please pick it up by the handles?” I sounded like Dr. Lee-way.  She shot me a direct look into the pupils and nodded at her partner who held out his hand. “Okay, hand over your other bags.”  Security. At least they’re not asking for a pat down. I showed them my badge.  The bearded partner read aloud, “Jinying Chang. Anthropologist, Research Systems, Funded by Zhongqing Marketing Corps.” He scanned it.  “Ah, Jinying. Yeah, you’re on our list,” he said. The security guard holding my priceless beauty suddenly became a lot less rough with my mom’s urn. She swabbed a sensifabric over, which illuminated it in a bright blue haze. She rotated it, holding it by one of the handles this time, going over the surface of the cloisonné design work with the sensor light.  “What is this?” she asked. “I’m getting some strange readings.”  “It’s a special vase for rituals,” I said, in rehearsed nonchalance.  “Looks like an urn,” said the bearded one.  “Urn? You can’t bring human remains on board.”  “No, no human remains, of course. It’s not an urn. It’s a special vessel used in ancient spell rituals.” I clenched my teeth and flashed my badge again. Hello, anthropologist, don’t you see the words? I wanted to shake them.  But, they were right, of course. It was an urn.  “We’re going to have to run it through the Insta-tell. We’ll have it out soon.”  I felt like I got punched in the gut. I couldn’t let them just take it. What if they throw it in the incineration and reclamation pile for prohibited goods? Even if it wasn’t prohibited because technically the ashes were on me, not in the urn.  I could feel my mom’s last wishes recede from fulfillment. I couldn’t let that happen.  “I’d rather have it in my sight. It’s a one-of-a-kind rare artifact.”  She looked at my badge again and up at my face, as if that would somehow help convince her.  “Fine, but that means we’re doing a pat check, too.”  Inside I groaned, but I nodded and followed them without a word.  I hated pat checks—violating crevices, poking in with their lighted wands. They couldn’t just use the sensifabric like any other humane service agent, no, they had to take out the wand and jab and prod, abusing their authority. I usually would submit a few direct complaints that would get the pat check override, but I had too much at stake to risk the delay waiting for Zhongqing’s administration to get the clearance through.  I also couldn’t let the guards find the ashes flattened out and stored under fauxskin over my thighs.  I sneezed a few times as they took me to the sensor room.  I squirmed as they started the prodding. I told them to be careful with my knees, that I had surgery in the past. I tried quelling the shaking that would give me away. They couldn’t see me nervous.  As she got to the secret compartment, a bead of sweat ran down my neck.  I sneezed loudly, complaining of allergies. It made the prodder she held jump just a few inches away from my legs.  I kept waiting for the loud beep that would do me in. At one point she stopped near my hip. “The prodder might be low on charge. I might have to get a new one and do it all over.”  I wasn’t sure if she was serious or messing with me just because I gave her lip in the beginning.  She banged it a few times and then started at my ankles again. I sneezed a few more times for good measure.  The prodder tickled the insides of my thighs and I could feel it even against the fauxskin. I had smeared on a sensor-cloaking cream over the flattened sacks of hidden ashes. Bought on black market and not completely unsure if it was effective or a dud. The person who sold it to me had a prodder, which she showed beeped for a sample of remains but then didn’t for the bags of my mom’s remains on top of which she lathered her product. It worked for the seller, but could’ve been a ploy. It was also pricey. Had I been conned?  I was skeptical, but had few choices.  This is for my mom, I thought. Hidden away into the secret compartments in me as she would’ve liked, like I was a walking puzzle box progeny. A puzzle box in which she could so comfortably nestle into after death. I sneezed a few times and the guard actually apologized, going faster.  No beeps.  When she got to my waist, I breathed a sigh of relief, still sneezing a few times for good measure.  She let me out, giving me the “spell ritual vessel” and its case, not even bothering to put it back in its specialized packaging.  “You’re free to go,” she said, whisking me away.  Did I mention I hated security? I continued an occasional sneeze as I packed the urn away with a gentleness that they really should’ve shown. I grabbed my other bags, which were cleared. Under my patch of fauxskin, my real skin itched. Over that layer of my real skin, my mom’s ashes—culture embedded in lifeless things—lay flat, waiting for their arrival to the eventual burial site.  I repacked my other bags. They made a mess of them, with some useless knickknacks gone, down into pockets to be exchanged by port hands.  Security.  I shook my head again. In the end, I tricked them and got away with it, so I really can’t complain. I should celebrate how ineffective they were.  On the trip, I would slip away from my bunkmates and find a quiet space in the standing “lab cubicle”—just a tiny space with a ledge, or as they designated it, “lab table,” to be alone. I wondered what fool would try to set up an experiment here, given the unsteadiness of the ship’s movement and the complete lack of space, equipment, safety wear, and setup protocol. Maybe a thought experiment, I considered, laughing to myself. A thought experiment on how to conduct an experiment here in this tiny tease of a room, where even I barely fit.  I tapped on the table.  Nobody was here to share the joke. I thought that my mom, her ashes still hidden in my thigh, might’ve gotten the joke.  It itched down there on my thigh. I had to move her elsewhere, but I couldn’t figure out where. The urn was completely out. She and her list of demands. It was so Yongli, but well, I couldn’t just say she was dead and not care. I couldn’t put her remains in until I got to the designated spot. It just wasn’t right to defy last wishes. Besides, I was curious what this was all about.  I tuned the urn to the directions of Dr. Lee-way, as I’ve done every day since I received it.  After tuning, I set the vessel on the table and pressed the pads of my fingers along the delicate cloisonné designs, watching holo after holo come alive. This had my mom written all over it. Things upon things coming to life, as if things had a spirit of their own moving them.  The wok she so cherished banged in delight by itself against the stove, sending a musical of notes. I was glad for the soundproofing of the lab cubicle as I hummed along with the rhythmic beats it made against a holographic kitchen countertop.  Experimental fuzzy fabric socks that wiggled its toe-area on its own. I had gotten them for her. They were supposed to be super toasty and cozy, but she said it was like lighting a fire on her foot. Too warm.  The hovercar she called Shandian for its lightning speed. The door would jam and I was delighted the holoartists captured that detail for her in their projections.  Jars and jars of cream spilling out. She was dermatologist and owner of her own cosmetics brand, always saying that she would crack the puzzle of wrinkles and old age. In the end, they got to her, after decades of staying wrinkle-free, a poster child for her creams and the best-selling point that could be, the last months of unchecked stress and poor health left her face as wrinkled as maps of hovercar routes.  I stuck my hand through one of the holographic jars, remembering the cream. I felt almost nothing, only the slightest of tingles at my index finger. The other jars were hitting the wall, lighting up and warping, impeded by the contained small space of the “lab space.”  Liquids were too heavy or else I would’ve brought a jar of the cream with me. I felt my own face, with creases starting to form.  The holo fizzled away and the sound of the jingles for her brand receded. I wiped off a tear, patted my eyes so they wouldn’t look so puffy, and tapped on my cheeks to fluff them up a bit. There.  I set the urn back against the cushioned case, pulled the top closed, and stepped out. There was a man with a goatee who held the door open for me. He had in his hand what looked like an old-school microscope case and a sack of what sounded like jangling transborosilicate.  Really? Petri dishes here? Good luck with that.  I couldn’t help but smile. My mom would’ve joined in on the joke.  For all her interest in skin care, my mom had really little interest in people. Sure, she laughed at their personalities and listened to gossip, but when it came down to it, it was really what was on the surface. Her attention was scientific and focused on the epidermis, almost like a thing in and of itself, disconnected to the person. She said, it was more about lifting up humanity as a culture, bringing us to our most aesthetically pleasing state, like we were monuments. But, of what?  Of ourselves. Of course.  It didn’t make much sense to me, but it fit her worldview. It was like lawn care or trimming a hedge. Topiary-like.  Like grooming the flame tree. I remember her holding laser saws, cutting off wayward branches, the seedpods falling like little blazing shooting stars, as she tried to achieve something akin to symmetry. She was smiling then, wide, like there was nothing more exhilarating than shaping them.  “It’s about making a figure to eclipse the enigma within. You get this general shape, but think about all the nooks and crannies of the branches that get hidden away. In scavenger hunts, you exploit these hidden spots that others don’t see.” Her eyes twinkled.  After arriving at the site of my fieldwork, Lancon, I asked all the right questions. The urn was now in its case nestled tightly in a local artisan traveling sack, slung across my shoulders. Light as a feather, as always. But, I was weighed down by the memories and the need to collect data. By then, I had moved my mom’s remains into hidden compartments in my knee-high liquid-proof field boots.  I shoved aside thoughts of my mom as I gathered narratives about all kinds of plants, little tendrils that curled up to the skies, petals that glowed and changed colors, roots that crawled horizontally across towns.  But like the roots, the memories would crawl back to me. I met an old woman and her three grandchildren as they mashed up roots. I drew sketches with my zex-quill, taking holoflash data to be converted by artists. With micro-tweezers, I collected samples and slipped them into specialized silvery sachets.  I tripped over a few words, but was surprised how much of the dialect came back to me once at the site. As I conversed, I made the local girls laugh with imitations of the gloopy noises the roots were making. Sticking my fingers into the lifa root to prod out the clumpy parts, I couldn’t help but think of my mom’s force-feeding of ginseng paste that was supposed to help the skin. “It’s good for you,” her voice wormed into my ears as I spoke, the giggle of teenage girls surrounding me receded. “An antioxidant, antiaging, and promotes elasticity.” I remembered the bitter aftertaste that goopy ginseng concoction left in my mouth.  I remember all the times I rebelled. Like some of the other teens I met at the swirl gardens who refused to participate in the trimming and instead hopscotched along the rocks lining the dirt. Their parents yelled at them to not run with scissors and they threw them across the stones in defiance. I took holoflashes of those instances, jotting down their slang, marking them as “youth at play; youth at defiance.”  I took notes to myself on the language of religion—all the utterances and inscriptions. I wasn’t sanctioned by the funders to do that, but you can’t help a curious mind. Plus, after doing fieldwork for years, you realize that all these parts of culture are entangled and it doesn’t hurt to take notes. I saw how they honored the dead with words.  There were new practices mixed in with the old. Besides burning holo incense and chanting, villagers dressed in drapes tied holographic fabric slips with words as a new custom alongside the age-old tradition of erecting funerary poles.  They asked me to tie a fabric slip to the pole of a village chief I met years ago, who I was sad to learn had passed. I affixed the fabric to the pole. The silky fibers seared into the pole, as if grasping it. A spark activated and sent the words scrawled on the fabric shooting out in a bright crimson hologram, illuminating the skies. Projected in a curvy script with many slashes and dots as phonetic markers, I read the words in my slow comprehension:  “In memory, you live in us.”  The holo began to fizzle and flicker, accompanied by the sound of a prolonged sizzling “sssssss.”  As the holo finally ran out of power, and the skies returned to an onyx adorned with stars, the slip of fabric detached and unfurled. It flew in the wind, tackling my arm for a moment and tickling my skin. It smelled like the heady aroma of holo incense. It settled onto the garden floor, where it would decay into nutrients for the plants.  A shiver ran up my spine and goose bumps ran up my arm.  There was a rhyming feature that I couldn’t capture in my translations, no matter how hard I tried. I found it poetic. I also thought my description in my notes of the fabric was lacking. Silky didn’t cut it. It was a satiny smooth that glided, like words slipping into and out of my ears. Just touching that slip of fabric was a full-body experience, sending tingles throughout my limbs.  But, there was something else. A memory.  The whole process reminded me of the many fortune cookie slivers of my mom, still awaiting my return home, sending me messages even after her death. Like prearranged clues into the puzzle of her afterlife.  In grief, you start wondering the strangest of things. Did she even care about me at all? Was it always about things? My appearance, my skin? Was it about her? The cracking of her puzzles? The skin as the layer that matters most, the outer beauty that counts?  A few days later in the village, a cute, lanky, ruffled-hair twelve year old ran into my sack with a firecracker. It was an ol’ analog kind, not holo, which surprised me. They looked like flame tree seedpods threaded together. They must have gotten these made locally since you can’t get them onto the Corps-approved trading ships. Probably got here through one of the “underground” skygliders. (My anthropologist brain liked to see how holdover words like “underground” to mean “subversive” or “illicit” still has meaning even when commodities are sent through the skies, high above ground.)  I waved at him while he was holding the firecracker. Holding it was no problem. The problem was when it went off. He didn’t throw it across the gardens like he was supposed to.  In catastrophic blasts, it exploded in sonic booms. Bang bang bang. Boom boom boom.  I jumped back three feet, tripped over rocks, and fell, twisting. Something in me rattled. Maybe it was all my organs and more. The shock traveled through my arm to the ground. My eardrum pounded. My nose was in dirt, shivering. I smelled the earthy scent of this transplanted garden ground, my head swimming.  I wiggled my fingers. My arms felt numb, broken even.  The firecracker banged a few more times. It let out a long hiss and crackled.  It was still hissing when I stood up, checked my arms (not broken), and let the wooziness subside.  When I felt steady enough to walk, I went to check on the boy. He was knocked over, too. A ringing in my ear grew louder and louder. I checked his breathing and picked him up. He was half-conscious, mumbling something I couldn’t quite hear past the ringing as I carried him over my shoulders in a fireman carry. He was skinny and deceptively light for his lankiness. Not so heavy at all, I thought.  I was still feeling the rattle within me, making what seemed like the longest walk I’ve taken to the infirmary, my legs trudging with a heavy step.  The first thing the medic did was put the boy into a calm-inducing sleep, with a few spritzes of the composite serenity spray.  They left me awake, with the ringing that transformed into a rippling sound in my ear. The medic gave me some bitter herbs to chew on, followed by a star-shaped cracker. I began to feel better, with the sound of the rippling receding. They put me against what I translated as a hug-all, a giant stuffed-animal-like pair of nurturing limbs made of synthetic fibers mixed with an organic cellulose-based fluff.  The cracker left me with the aftertaste of citrus. Nestled in this cocoon, I felt soothed like being in my mom’s arms when I myself was twelve.  It was only later, when I was tuning the urn, that I found the hairline crack in the cloisonné.  I drew in my breath and held it. No.  The urn was otherwise intact, but the petal of one flower was marred by this crack. I breathed out, thinking that the rattle within me all the while was also a rattle of the urn. The thought of its damage disoriented me. In carelessness, I had destroyed the beauty of it.  No, it wasn’t destruction. Not even damage. Just a scratch. Get a hold of yourself. I breathed in and out.  I just wanted everything to be perfect for my mom.  I felt along the urn for a while, pressing and checking to see if the holos were affected.  Most of the ones I had found projected their holos as they have in the past, with the same shimmery cinematic presentation.  But, when I pressed on the trigger that I knew to unleash the rocking chair holo, I heard the tiniest sound of a creak and a panel of light shot out and receded as fast as it came. I tried pressing it a few more times, like a desperate child tackling the buttons of a slow hover-elevator.  The rocking chair holo never projected in all its glory. At one point, there was a slight suggestion of the curved “skis” under rocking chair legs, but then nothing else materialized.  I felt a numbness creep into me.  I breathed out and stopped clicking on that rocking chair button. I moved on.  After stroking and prodding the surface for some time, I came to the conclusion that I didn’t think it messed up the integrity of any of the other holos. Overall, I didn’t think it affected the mechanism for me to crack open the puzzle. I couldn’t say exactly how I knew that the integrity of the puzzle was intact, but after I calmed down, humming to myself an old Teresa Teng song my mom used to sing to me as a lullaby, I just had this feeling that it would be okay. Everything would work out, even if my rational mind told me that things went awry, people died, and there was no assurance in the world.  I shut that rational mind out and focused on the present, humming louder.  I remembered Dr. Lee-way’s advice and dug out the ubertape from my luggage. I moved my mom’s remains into my suitcase, no longer sure if my hidden boot compartments were a safe holding spot for her ashes. They was too exposed there to all my activities. Better safe in this room.  I checked the seal on my locking device, affixed the verbal shutdown of the room. I hobbled over to the port (my legs still weak) and picked out some comparable slathers to the ones Dr. Lee-way suggested from the supply store. I wasn’t sure if it would work, but when I got back, I bandaged the patient, i.e. the to-be vessel for my mom, as directed, as gentle as lathering face cream on a kitten, my mom used to say, which made no sense to me then.  It seemed to make more sense to me now, as I did this quiet work.  I wished I could tell her that.  I brushed on the slather remover and tugged at the cloth. It resisted the peel. It felt like the reveal after cosmetic surgery—someone with a new face. Would I recognize her?  When the cloth gave way, my eyes bore into the urn, right at that spot. Yes, it was there. Faint, but still there. The tiniest of fissures visible to the naked eye.  Apropos, I thought. Like wrinkles blooming on my mom’s face as she neared the end of her term here in this universe.  I wanted to maintain that supple beauty that my mom effortlessly strove to achieve. Okay, it wasn’t effortless. It was the constant application of creams and concoctions that she put together and sold, brushes slid against faces, incessantly making holo calls and presentations for her business, for investors and sales. She had a team under her, but she liked to be on the front lines, showing off how she cracked the puzzle of agelessness.  In the end, agelessness wasn’t solved. It fell on her, too, taking her away from me.  I pressed on the trigger for the rocking chair projection. The form came up in holographic light, but it was fainter than before. It faded away quick.  I felt a pang of failure. Mom left me one last puzzle to figure out, one last enigma to share between us, and I botched it up. And above that, this vessel was her new skin, her carrying case that she would dwell in for the rest of eternity, and already it was marred.  I heard a footstep. It was the twelve year old. He was walking along, no limp, no issues. Children heal fast.  He came up, looked sheepish, and whispered a thanks. With deft fingers, he held up a thin strand of gold. It was thread, so thin, thinner than a strand of hair, it almost didn’t exist. Put it against the ambient light and squint and it almost looks like a translucent wisp of vapor floating in the sky. It was made of the same material as the fabric slips for the funerary poles, but spun into a nearly impossibly delicate width.  He had tied some knots into it. It was an exceptional skill of manipulation for someone I had charged to be so clumsy.  When I felt along it, his brown-speckled eyes became wide, his pupils dilated as if beseeching.  I recognized the pattern from my research. It was one used in condolences, a freeing of the soul and a wishing of eternal comfort. I gave him a pat on the back and cried.  He looked nervous and uncomfortable, watching a grown woman cry. He passed along a local organic glue, said some perfunctory words, and made an exit, rushing along in such agility, it was as if he had never even gotten hurt.  Later, with careful fingers, I affixed the thread to the crack, covering the hairline fissure. It was beautiful, reminding me of kintsugi, the time mom taught me how to splice back broken mortar and pestles and ceramic cream jars with melted gold. This golden thread now contained a message, however, a reminder of our journey together—me and this vessel and my mom’s remains—through villages and people who knew me as a researcher and cared.  As I was pressing down the thread onto the fissure, the seal made a strange gurgling noise, and it triggered the holo. I watched as the holo lit up in a color so bright, it bounced in a sheen off the front of my nose.  It was the same rocking chair, but even more resplendent. Was it me, or was Teresa Teng’s ballad sung in an even clearer voice, one that sounded strangely like my mom’s? And was it me, or did I see the faintest silhouette of two figures sitting on the chair, one mama-shaped and one child-shaped on her lap? I shook my head. I must be imagining it.  I rubbed my temples. Maybe it’s the roots for the headache they gave me.  But, I stared harder until it fizzled away. I tried touching the holo. Nothing but a slight tingle.  I pressed the enamel trigger again. And again. Yes, they were there. Faint mama silhouette and child. I put my finger again to it, feeling the tickle again. That’s her. That’s me.  They were there.  At first, I thought if I collected a bunch of these threads and glued them on, maybe it would work. All these holograms would pop to life with more vividness, more life.  I did bartering, trading my expertise in linguistic and cultural translation at Lancon for supplies. I spent time there fulfilling these trades, scrawling down texts and handwriting scrolls and posters. I helped administer deals and correct misunderstandings. I arbitrated negotiations. I usually avoid all this kind of interaction, anything more than collecting data and minor participation in rituals—it felt too much like meddling.  It was something my mom was good at, ingratiating herself with others to get her product sold. She said that customers were just enigmas to crack. Once you figure them out, you know what they want. And she would say, I always have a solution for them—in the form of cosmetics.  I managed to collect in the form of payment, a few of these cherished gold threads, doled out infrequently, only one at a time and in exceptional times like births, unions, and deaths. It was lucky I even got three of them.  I used the same glue and tried a few ways of manipulating the thread. I tied one in the same way as the boy, incorporating the condolence message. It didn’t work. My hands weren’t as nimble as his, but I checked a few times and the knots were in the right place, looped in the same ways. I tried undoing them, having to procure some removal paste, which also cost a lot in interaction and trade.  After finagling with it for some time, I gave up. No other holo became more brilliant or had features I didn’t see before. Even when I added another layer of the gold strand, the rocking chair one stayed exactly the same, with only a mere suggestion of silhouetted figures.  I left Lancon in worse spirits than coming in. Sure, I gained a clue, but I was far from figuring anything out. It was a tease, tantalizing me, but I wasted so much effort here. I kept the three strands, ubertaped them to the pack holding my mom’s remains.  There was more to figure out.  I traveled in a local skyglider to the burial site, in Conme. Sixty-nine days had passed and tomorrow would be the last of the funerary period. My deadline for cracking this puzzle fast approached.  Usually, I avoided the skygliders, going for the more official routes, but the parties I helped at the village were so happy with my time doing translation and negotiation work, they banded together to get me a flight out. I packed my things and said my goodbyes.  The twelve year old handed me a bag of dried flowers for an infusion. They were macolan, desiccated but still flashy, and reminded me of the bright yellow flame tree flowers.  I thanked him. I shook the flowers and took a whiff. A floral potpourri scent that reminded me of jasmine filled my nostrils.  I touched elbows with him and bid him goodbye.  It felt lonely without the villagers.  With my fieldwork done, I was able to make this side trip to Thres in Conme, outside my funding parameters. I wondered why my mom had chosen this as a burial site. She said it had to do with feng shui and some rather complicated calculation involving angles and starlight to Earth, conveyance, and as the natural burial site of our ancestors after leaving Earth. I didn’t understand the feng shui talk no matter how much she propounded it. She said it was about angles, movement, and vibrancy, like the shape of your face and appearance of the buoyancy of your cheeks relative to your eyes.  I didn’t know what she was talking about then. But there was one thing I knew now. I felt dejected. I’d end up burying her and the urn because I reached the deadline, never cracking the case. Never fulfilling her wishes.  Dr. Lee-way was right. I had played with the urn until my hands felt sore, my knuckles aching from poking and prodding. I saw the holos over and over, I’m sure I could have drawn them out with my zex-quill one by one in succession with my eyes closed. I could sing in detail the music that flowed along with them. But, only the faintest outline of what might be, the latency of what laid within, had appeared, and I stared at the mysterious silhouettes until I could bore holes through the holo itself.  As the skyglider approached Thres, the pilot must’ve felt my anxiety and stayed quiet the whole time. But, at one point, he started coughing. It was this uncontrollable cough that whipped through the air. I knew the ship was safe since even the skygliders were equipped with autopilots, but I started to worry about his health.  I gave him a desiccated macolan. He saw the flower and smiled.  I poured a hot liquid from a decanter, careful not to upset the sediment. Then I took the macolan flower from him and dropped it in the liquid, watching it bloom in slow motion, brilliant tendrils reaching out into the amber liquid.  The pilot, who had stopped coughing, introduced himself and began to talk.  His name was Kaspa. He said he heard I lost my mom. I just nodded, not feeling like chatting, even if I did miss the company of the villagers. He said he lost his wife a few years back. He talked about her with such open affection: the way she used to dance the lamdaca, her incredible skills in material science, her way with certain chemicals. He showed me a handful of golden strands. “She made these.”  That made me open up.  “She made the funerary strands?” I asked, completely awed. He had a clump of them—maybe twenty. It was so haphazardly in his palm, like the clumped filling of hug-all’s. I’ve seen slips and cloths made of this fabric, but I’ve never seen so many gossamer strands at once. The fibers were so delicate that I was told many snap before reaching that thinness.  It was a small fortune in his hands.  He tucked them into a pocket and laughed. “Yeah, my wife was a genius, amazing.” His eyes looked wet, and he stared at me for a moment.  I looked away.  “I got one recently. From a twelve-year-old boy.”  “A twelve-year-old boy. It couldn’t be Rondi, could it?”  I thought for a moment. “Yeah. Rondi. I think. Yeah.”  “Tall boy, yeh high?”  “Yes, tall and lanky. Disheveled hair. He brought it to me and it was so expertly knotted.”  “That’s my little boy!” cried the pilot.  My heart did a flip. I cocked my head and looked at the pilot. I didn’t see the resemblance. Had he mistaken?  “No, Rondi’s dad is Kayel. Kayel came with us to the doctor’s when he hurt himself.”  “He hurt himself?” Kaspa looked seriously upset.  “He’s fine. Just got a bit rattled up. He’s fine. He got startled from firecrackers and passed out. We got him to the medic. I saw him myself running about after, completely carefree.”  Kaspa gave a sigh of relief. Tension in his shoulders released.  “No, Kayel is not his dad. I am. Kayel is Rondi’s godfather and current caretaker.”  “You’re his dad?”  “Yes, I’m his dad. Rondi’s my son. I took care of him until Lakla, my wife, died two years ago. I started driving these ships and had little time. It was hard, but I handed him to his godfather for care. I visit him from time to time, but I know it’s not often enough.”  His eyes darted down and he stared at his drink for about a minute.  I looked through my notes. I had a few kinship charts, but I didn’t focus on Rondi’s family, but on other villagers. “So, Kaspa, you’re really Rondi’s dad?  I just couldn’t believe it. They seemed so different and I was convinced Kayel was his father. They even had the same expressions, this worried crease between the eyes. I felt sorry for Rondi, his dad always on the move, in the air, far away.  “I hate to admit it. But, when Lakla died, I lost it. She was everything to me. I would’ve done anything for her. And the one thing she would’ve wanted me to do, I couldn’t. I couldn’t take care of him alone. He looks just like her. Just like her. A spitting image. Just looking at him, it opened up an ache so wide and engulfing, I would’ve fallen in and never climbed out. I couldn’t see him and see my dead wife. I couldn’t.”  Now, the decoction in his hand was shaking. I could see through the transparent mug, the macolan dancing in there like a strange organism, its petal tendrils gliding in the water and trembling.  “Rondi gave me that,” I said, pointing at the flower.  His eyes flashed and crinkled. He took a sip, sighed, and put down the mug. “I know. He loves those flowers. So did Lakla. They used to pick and dry them together. She’s a material scientist. Did I mention that?”  “Yes, you did.” I tried to cover my grin about how proud he was about this fact.  “There’s some compound in those flowers ingrained in the threads. I don’t know it all exactly. Only a few know and I’m not even sure if they know it all. Lakla was a genius, like I said.”  I pulled out a couple of mine. “I have some, too. From your son.”  He picked one up, felt it and stared at it with a faraway look, as if staring through it. “Ah, these, these aren’t the same.”  I gasped, almost letting one slip through my fingers. “They’re frauds?” I picked it up from the skyglider floor, watching it noodle into a ball in my palm.  “No, no, they’re not fraudulent. There are different versions. This is version two. It doesn’t have all the new compounds. My wife was working on these new strands, version three, before she passed. She said she didn’t perfect it, but the version three ones were cutting edge. They even use them now in manufacturing some appliances and other top-of-the-line goods. She was always tinkering, never satisfied.”  I thought for a moment, weighing what I would do next. It could imperil my trip there. Maybe he would turn around right there and then.  I did it anyway. I took out my mom’s urn. Pulled it gently out of its case.  “Is that what I think it is?” His voice was small.  “It’s an urn.”  I showed it to him. The buttons. I watched the holos, crying.  He watched me cry, his eyes traveling to the holos and then to me.  “If you have an urn, then you must have the remains.”  I sniffed, dabbing my eyes with my knuckles. Should I lie?  I thought about his wife, Rondi, and his sincerity about leaving his son. I couldn’t. Not after this.  “Yes,” I said.  “You know I’m not supposed to have this kind of stuff on my ship.”  “I know.”  “They’re remains.”  “I know. I’m sorry.”  He breathed a large sigh.  We were silent for a while.  “I’m not going to turn around. But, you’ll . . . you’ll make it up to me. You have to come by more. Come visit my son. He likes you. He gave you a few of these strands and flowers. He doesn’t do that for everyone. He was very close to his mom. They were things of his mom and he doesn’t just give them away.”  I nodded.  He focused out into the skies, the brilliance of stars twinkling in his pupils. “Tell me about your mom,” he said. He gestured at the urn.  I told him. I told him not only the good, but the vanity. Her drive, her ambition. Her cosmetics line with her as the icon. Yongli, even her name, forever beautiful. I wrote it for him: 永麗. Her love for puzzles. This absolute drive to create the best puzzle so I can never unlock it.  “Sounds like my wife. She wanted to pass on her knowledge of material sciences to my son. He liked the flowers and the strands, but he was more of an artist. He’s good with languages and crafts. He’s invented a few of his own languages. He likes creating in his own way.”  He looked wistful. “She was a bit too driven.”  “How did she pass away?” I asked. I went and made myself a concoction as well, tipping the hot water into my own mug and dropping in a macolan flower.  “Stress and lack of sleep. She was overworking herself. I told her to stop, that she didn’t need to, that I could help her with payments. Back then, I was running a small business, but it wasn’t working out. It wasn’t about money, though. She just was too involved. She started missing out on life, on Rondi himself. Didn’t see him for who he was. The irony is that I did, at least I think I did, but I left him.” He clamped up and starting playing with his hands. He looked down, pulled out a sensifabric cloth from the drawer below his seat, and wiped down the viewing window, the glow reflecting off the viewing cauldglass. He checked his readings and continued wiping. “How about your mom? Did she see you?”  I wasn’t sure how to answer him. I started to say something, then switched. I rattled on about her attributes. Her foibles. Her love for puzzles.  He listened.  “Do you like languages?” he asked, suddenly, swirling the now-soaked macolan with his fingers.  “I love languages,” I said. “I think what your son does is amazing. I’m really fond of all things related to communication and expression. Actually, I’m primarily a linguistic anthropologist. But, I also do other cultural work.” I trailed off.  I thought of something, something was piecing together.  The urn. Did she know me? The question stung like a bee. Did she know me?  “Do you have a sharp knife?” I gestured, poking my finger against the urn.  “One that sharp? Hm. Hold on tight.” He pushed a few triggers on his window in front of him and then stepped away. He came back with a laser.  “This is something my wife codesigned to conduct research on her material work. It’s a prototype but works well. It’s a knife that senses organics and will not cut through life but only through materials that you designate.” He showed me. He turned it on and passed the scarlet ray through his finger. I winced. It didn’t cut. He adjusted the tip, directed the light at the mug.  “She used to get a lot of cuts on her fingers. Not deep, but enough to annoy her and slow down her work. She was always striving to achieve efficiency.” He slid his finger down a wheel on the side of the laser knife. “You can set the depth, too. You can also adjust the set depth by manipulation of the knife in your hands. Just push down on it like you would any other knife.”  He demonstrated. The laser created a small fissure.  “It’s great for repairs on the ship,” he said, shrugging. “Like, I said. My wife. A genius.”  I thanked him and wielded it. It was light and the surface made warm through Kaspa’s grasp.  I was going to do this. I was going to mar the urn. I tried a few swipes on the mug, marking it with etches, and felt the ease of this tool. I was ready.  I felt something possess me that wasn’t my own. No, it must’ve been me, many iterations of me, cultivated through years by my mom. Her asking me to talk to customers, making me interact with people in other languages I couldn’t understand. Introducing me to new cultures, telling me that to penetrate new markets, I had to understand cultural specificity. She made me study people’s faces, the lines next to their mouths, asked me what they ate and drank. She gave me brochures to read, competitors of different product lines, from different colonies, with strange drawings and symbols I had spent time sitting and figuring out. They were puzzles, all of them, and she knew I loved them.  I etched words I remembered from these brochures. Ones that would match her—and match me. Who we were. I set the laser on just barely touching the surface, creating the shallowest of scratches at the edges of the cloisonné enamel designs, aligned with the holographic trigger points. I wrote in different languages. I was not a master of one specifically, but was versed in enough to be understandable, conversational, and analytical. I thought of those words now:  “Ageless skin that will guide you into the future” in the rough consonants of Kzaskz.  “Look visibly younger and healthier” in the loops of Checchneaneaot.  “Creamy astral vibes for a new tomorrow” in the pictographic Letsnvam.  “Erase the puffiness in your eyes” in the hypnotic swirls of Vloovloo.  “Bring in shine and tone . . . and develop elasticity” in the gentle wavy tails of Nyeann . . .  I wrote so many of these commercial platitudes on the urn with the laser that I lost track of time, space, everything. I forgot where I was, who I was, delving into these pockets of memory, conjuring them up as if they existed right there on my fingertips the whole time.  Did she see me? Did she see me? The refrain swung and circulated in my head like the pendulating back and forth of a rocking chair.  I finished the etched remarks with a slogan in Chinese: “Brighten your appearance. Give off a radiant glow. Feel forever young.”  The urn was slipping in my hands, covered in streams of my tears and thin, tiny flecks of enamel.  I pulled the laser back.  I didn’t dare touch any of it. I didn’t dare press any triggers or release any holos. I’m not sure I know why. My hands shook and a part of me knew I just ruined it all. It was a rush of hypnotism or something. Maybe watching that macolan unfurl unleashed something in me that made me unfurl. I was too scared to do anything more to the urn.  I took out the porto-vac to suck in the flecks of enamel stuck onto the urn with my tears. Kaspa shook his head and handed me his sensifabric cloth to wipe it. “Vacuums in space are bad luck,” he said.  I looked at my porto-vac, no longer crying, but smiling. “How about toilets?”  “That’s different,” he said.  He laughed. I joined in.  I managed to wipe the urn without crying.  Kaspa took one of his version three strands, invaluable I’m sure, and tied it on the top of the urn. “A gift.”  He made a series of knots with his clumsy hands. It wasn’t as elegant as his son’s but it amounted to a rudimentary message rather than the eloquence of a consolation note.  “What’s that say?” I couldn’t recognize the words.  “Take care,” Kaspa said. He took a moment to feel the words again with his fingers.  “This is my son’s own invention. Words represented by a brand new knot-tying method. I only learned a few of these words. It was too difficult. He had so many languages in his head. I could only pick up a few phrases in each.”  “Take care,” I said aloud, feeling the itty-bitty grooves of the knot. That was it. Brief.  I promised him that we would keep in touch and I would visit his son. I would. I would visit my mom here anyhow and his son was along the way. Maybe I could take his ship, always coming here, his presence like a passage to my mom’s material self. Or her material remains, I should say. I didn’t know what the self was like after death. Does it even exist as self?  I packed the urn. It had all the new engravings.  As I walked to the designated spot, already worked out and paid in advance, all the funerary procedures handled by my mom who always believed in agelessness and yet somehow had planned out her own termination, I thought about the word engraving. It’s funny how in some languages the word engraving has grave in it. Engraving. Inscribing, as in digging deep. Making a lasting name. To permanently affix into memory. A small trench, a cave of wonders. Etymology was curious like that.  It was the last moment, the end of the seventy days of the funerary rites.  I sat down in front of the hole in the dirt. The cave of wonders. The engravement of the earth of this projection of the ancestral home. Not quite Earth, but somehow related in her configurations. It seemed fitting, for a people who have migrated and been displaced, to rest also in a space that was a projection of home, but not the home space of home exactly.  I stared at the urn. My hands shook. I looked at the engravings I carved. I’m sure these words I inscribed did something to solve the puzzle. My senses sharpened at the thought. I could feel the tingling in my spine go up my fingers. A rustling in my ear I thought was a whisper that said, yes, it’s solved. It’s this Thres atmosphere, so full of crackle and electric discharge. There was something else there. A strange, unsettling prescience. The phrases I etched did something, I knew it.  I clicked on the many holo triggers in succession so fast it was almost at once. The holos projected. The figures became clearer, luminous.  Yes, I cracked it, I thought. Joy filled my chest. I held my breath.  It was me.  Me in the rocking chair; me pressing fortune cookies; me swinging from the flame tree; me holding onto the wok, flipping stir-fry.  Were these her memories of me? The outburst of joy subsided. I let go of my breath. I felt odd, strange, dislocated. Was I burying her or myself? I played it again and again, over and over, watching this reel of film unfurl, watching these moments string together like some lifelong play about me.  When I exhausted all my energy in focusing and watching, I sighed, took out the sachet that I had hidden in my boots once again. I felt it, so light, for such a strong, driven woman. This was all that was left of her. Just ashes.  In a strange way, it reminded me of Rondi. So much will, but so light when I picked him up. Lanky, tall, and light. Maybe this was the irony of materials. The most intriguing puzzle of all. How can so much of us be contained in such little material? Such small mass for so much life?  I pressed all the triggers again, letting the holos run. “I’m fulfilling your last wish,” I said. I used several tongues to say that. Then I switched to Chinese. I was never as fluent as her in it, even after years of practice, drills, and everyday usage.  “I don’t know if this is breaking your puzzle. I’m not even sure if I cracked even a millionth of it. You’re not easy to crack. There’s too much of you. I don’t even know what it means to solve the ultimate puzzle of man . . .  “Woman,” I corrected myself. “Aren’t we just layers and layers and layers? Aren’t we too much to figure out? There are secrets within secrets within secrets. More of you than I can ever discover, ever unveil.”  I cried, twisting the urn lid, its once obstinate contours readily giving way. It creaked as it opened up. I set the urn lid aside. I reached within, giving it a sweep with my fingers.  Nothing. It must have been the holos after all, that was the real prize. I couldn’t get their nostalgic glow out of my head.  My hands moved mechanically, the contents of her spilling into the urn. The Teresa Teng song mixed with other songs and became a melancholic drone. A buzz filled my ear, reminding me of the fireworks. Bang bang bang. Boom. Was that a sonic boom? Or just in my ear?  Between streaming tears, I stared in wonder. The urn shifted, surface plates moving. It creaked as new images lit up. It was like tectonic plates, piecing together something entirely new.  She appeared there beside me. In every holo, she was there trying to speak in tongues that I knew. She had practiced them before she passed away, gathering the pieces she picked up throughout her life. It was her voice, sometimes singing in other languages. Sometimes repeating these platitudes of her agelessness and the beauty of skin. She had learned them or tried to. Some were not so smooth, tripping over words, sounding a bit silly. She never liked languages, at least I never thought she did, and I always thought her interest in people was only her way of selling things and propagating this surface beauty. The aesthetics over the substance of man . . . of woman.  But, as I saw her singing, skipping over syllables—rocking in the chair with me, pressing down fortune cookies with me, mixing up creams with me, rolling up fuzzy socks with me, riding Shandian with me at lightning speeds, fixing up ceramics with me with kintsugi, bending draymetal with me into small loops for the enamel filling—her voice in my ear, confusing phonics of languages she tried to achieve for me, I knew it. The thing I cracked. It was her love for me. She tried to see more of people because she saw all of me.  After the holo display, the bottom of the urn lid slid loose with a forceful scratching ceramic sound. It reminded me of the grinding groan of a sarcophagus in an ancient tomb being pulled open by archeologists, stone against stone, with the anticipatory hush that accompanied the near revelation of the invaluable contents within. I held my breath. Underneath the urn lid was a panel.  Ah, so there it is, the puzzle coming together, the mystery unfurling. I had thought the holos was it, but no, my mom was full of layers, just like this urn.  I was still reeling from the projected affection, all those images of me and my mom surging back to life. I was in such a daze, sad and giddy at once, I nearly dropped the urn lid. My hand was quicker than my mind. I caught the lid in my fingers. It was so light, like an illusion of matter.  I breathed out a sigh of relief.  I reached into the compartment in the lid and felt . . . a crinkly package of eco-cell wrap. Its scratchy texture surprised me. When I popped the wrapping, a fortune cookie fell into my palm. I cracked that open, letting the crumbs scatter over my hands and sleeves. I put the cracked cookie in my pocket.  Inside was a slip of paper. I had it in my fingers for a while, feeling along its ridges, tears clouding my eyes, until I received a shock of searing pain and in my blurred vision saw a drop of red. I must’ve gotten a paper cut from it. I sucked on my acrid blood.  There was no further higher tech, no holographs or flashes, generated by my touch. I took a sleeve to my eyes, wiped my vision clear, and read. The writing was tiny and in a meticulous script. It was mom’s own calligraphic handwriting. It was a conglomeration of various languages I knew that I never knew she had even tried learning. The mishmash of different tongues made the writing even more poetic, just looking at it appealed to me in a jarring way. It was an eclectic but strangely entrancing work of visual art.  I tried to piece the significance together the best I could and came up with this interpretation:  “You are my best fortune. The one written inside of me and coming into this life with a crack of delight. But, now you are in the world, paving your way—with your own slips of paper.  “In particular branches, back in the day, you will find your thoughts come alight. There you will find an instrument, a stylus, for which you can compose your future—under the brilliant light of a thousand red lanterns.”  I thought this was the end of the scavenger hunt. That my adventure was over. But, of course, this was mom and she would bring me back to where we started. To the flame tree.  I already anticipated what I would find there. Some of her most prized possessions. Styluses, she called them. Scrawling in beauty.  Her makeup brushes, to take over the small cosmetics empire she built for herself.  But, as I reviewed the holos in my head and all the ways she cared for me, I thought, no, it could not be. It couldn’t be the cosmetic brushes.  It had to be a simple maobi.  It had to be the ink brush she used to write this fortune of language patchwork. I recalled that she had seen me use my zex-quill and complained on multiple occasions about its complexity, its removal of touch to its canvas. Caress in application is important, she said. Like spreading foundation on cheeks.  Maybe she really did want me to forge my own path, write my own future. Even at this grave moment, I marveled at how my mom still wanted to engage with me, leaving me puzzled, in wonder.  I grazed my hand over the inlay draymetal that I had bent, where I had manipulated the shape with my fingers. I was convinced that she knew me, and it would be a maobi, not a dictation of her path for me, but as she said, a means of composition. Words that I would write, a fortune I would create. I was so assured about this, I could see the brush there in my head, lodged between the bark. Maybe it would even be the one she alleged existed, made of my very own baby hair, from my first haircut. 胎毛笔. Taimaobi. The softest of brushes, she had once teased, ruffling my bangs. I never saw it. I always thought it was a joke.  I felt it in my bones. It had to be a writing tool for undefined creation. Only a trip back would confirm or deny my conviction.  I bit into the broken fortune cookie. It was as delightful as ever. Crisp and with a lively pomelo taste that danced on my tongue.  I crunched, taking small bites, until the cookie was gone. I brushed off my hands, grains of the confection sprinkling onto the urn lid. I replaced the lid and lifted the urn up in its entirety. It dazzled in the ambient lunar light of three crescent moons.  I tuned it one final time and ubertaped a dried macolan flower over the tuning hole, next to the signatures of the craft’s artisans. Her name was there, too. I had engraved it there, in many versions, translating Yongli, “Forever Beautiful” into multiple languages. I lowered her urn into the ground, her voice still buzzing in my ears.  The holos faded, but they lay entrenched, engraved, in my memories—just as she lay to rest in her grave.  From there, I had my own puzzle to solve, what my future lay for me—what words I should write in my own script on my own slivers of prognosis. I would take the maobi she left for me, the one I was so sure of, and stain my own path with pressed ink.  I brushed myself off, took a look at her grave site, and set out toward the moonlight. Humming a Teresa Teng ballad I remixed and improvised, I hailed a ship. This time, I would take my time.  In loving memory of my mom. D.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation.", "text": "11800 words, novelette\nLast Wishes\nThe urn looked like it weighed a million pounds, but when I picked it up from the bottom, it was as light as a feather. These artisans were full of trickery and skill like that. I’m guessing that’s why my mom chose it.\n“Be careful, Jinying,” Dr. Lee-way, the head artisan, said. The hologram designer next to him nodded at the handles, a silent request that I pick it up from there.\n“I will,” I said. I moved my hands to the handle and raised it higher. On the bottom were their signatures and the encryption code that certified the authenticity of the piece that surrounded the tiny hole for tuning.\nDr. Lee-way pushed a paper toward me. “Sign here,” he said. “That will confirm the credit transfer.”\nI scribbled with a flourish in multiple languages as the form required: mother language of your name and phonetic translation. 津瑩. Jinying.\nDr. Lee-way glanced at my signature and up at me and said, “Seems fitting. Jin. Ying.” He stretched out the syllables, thinking. “My Chinese isn’t great, but isn’t that . . . ferrying . . . conveying . . . and the luster of gems.” He reached out, stroked the urn, and laughed. “You’ll be quite the carrier, no, quite the chauffeur, for this treasure.”\n“That’s an interesting interpretation,” I said. “My name’s more about migration, for the jin and the ying reflects my mom’s love for appearance and cosmetics: luster.” I touched my face, thinking about her flawless skin.\nHe nodded at me, then touched the urn, urging me to pick it up.\nI shook the urn, seeing the puzzle-like cracks in the cloisonné design-ware. I felt across the surface. There it was, a few of the flame tree flower pieces made from dray-copper wire I pinched and handed to the artisans years before my mother passed. Across the urn were flowers of all kinds, and also images of that little blue marble in space of our homeland and the Driftnet colonies we’ve transplanted to as our new home in generations after. I had sketched this out according to my mom’s wishes and sent it to the experts. My mom was adamant that I have a hand in her design. She said she wanted the fruits of my labor always near her, so it would feel like she would be cared for.\nOf course I would care for her. Even more than doing some sketches and adding a few pinches of dray-copper wire on an elaborate never-yet-seen custom-made puzzle vase.\nI pressed my nail into a signature crimson mark in one of the designs of the flame tree flowers, near the inlay draymetal that I had bent. A holo projected from that side of the urn. Dr. Lee-way moved aside and I stepped back to see a brilliant rotating flame tree, its plumage of red-hot lanterns reaching outward like arms trying to pull in the heavens. I thought it might project with her voice, but this one was accompanied by the erhu, the radiant tree dazzling against the mellow sound of drawn-out notes. It was well rendered, without even a hint of voxelation, the contours of the erhu as crisp as the notes. In a few moments, the tree fizzled away and the music faded.\nThe holo designer raised his brow and said, “So?”\n“Looks like top-of-the-line work,” I said. He looked pleased, his eyes crinkling.\n“I imagine I’d be able to crack the puzzle in a few weeks,” I said.\nDr. Lee-way laughed. “Ah, the puzzle. That’s not my line of work, so I can’t speak to that. I know Mr. Xin collaborated with your mom for a long while on this. If I know Mr. Xin—I mean look at how his trademark attention to detail is all over this—you’ll be spending years trying to crack it. Maybe your whole life.”\nI raised my brows. “I can’t spend my whole life. The clock’s ticking. Custom says I have seven days for my offerings—adjusted to seventy for space travel. That’s the length of time for a funeral; then comes the mourning.”\nI shot him a glance.\nHe turned around, took a look at my bothered expression, and looked flustered. “Hopefully you’ll get it solved soon,” he said. “For custom’s sake.”\nIt’s not just custom. Customs shift through years and generations, so they’re not static and definitive. I wouldn’t mind that much breaking custom. It’s more that these are the last wishes of my mom and if I didn’t fulfill them, I wouldn’t be fulfilling the requirements of filial piety. I’d have failed. But, I didn’t bother telling Lee-way all that.\nI pressed down on another mark and a rocking chair illuminated from the urn. It rocked back and forth by itself, and Teresa Teng’s clear voice broke through, singing about lost love. The image shimmered and in a few moments also dissolved into the air, like it never was.\n“I’ll take care of it.”\n“Yongli would have liked that.” I nodded, as my heart wrenched at the mention of my mom’s name. Lee-way lacked tact, but he meant well.\nHe handed me a tuning screw. “Be sure to keep the holos aligned with the sound. Just a few turns a day. These old techniques need a lot of upkeep, not so popular anymore, but the visuals are stunning.”\nI placed the urn in its fresh-keep case and sealed it. These top-of-the-line artisan-crafted, technologist-tinkered custom urns cost a pretty penny, not to mention all the accoutrements that go with it. They’re not like the run-of-the-mill popular ones. This one was experimental, incorporating prototype tech—even more pricey. The tuning screw, the fresh-keep packaging for transport, the checkup consultation holos and enhancement wipes. I felt like I was now in charge of a small, high-maintenance, extravagant pet. It cost me more than half my savings.\nBut, it was quite a work of art. That was for sure.\nAnd, according to my mom’s wishes, her ashes weren’t in there. There was something else going on with the urn. She told me before she passed, that she would leave her legacy to me in the form of an enigma. A grand puzzle I’d have to crack open.\nMaybe it was a kind of megalomaniacal flex of power to keep me running in circles. But, I really just think that she wanted to play. Even after her death, she wanted to stay in touch with me, to play, to be involved in my life and share a game with me. Like when we were kids.\nShe was always like that. Intrigued by challenges and social in her own way, doling out intimacy in the form of brainteasers.\nMy mom loved riddles and puzzles. When I was a little girl, she sent me on scavenger hunts. She said that she felt bad I was so disconnected with my heritage and dropped pieces of culture for me to pick up. I said culture wasn’t embedded in things, but in people and language. She shook her head and laughed.\n“Oh, honey, of course culture is embedded in things. It’s a lasting mainstay of our civilization. People disappear, but things stay. Look at archeological digs. Back on Earth, the home of your ancestors. Pompeii’s ruins. The Terracotta Warriors. The Temple of Hatshepsut.”\nHer eyes shone, and she paused. I guessed she was probably thinking of the magnificent reign of Egypt’s first female pharaoh, stories she told me when I was a kid. She used to embellish on the tales, speak gloriously of the great monument the Queen-as-King Hatshepsut built for herself for her afterlife.\n“Things give us memory,” she said, gesturing to the house, as if that was a grand story in and of itself, to rival any temple.\n“Memory is held in the minds of men,” I said.\n“Women, too.”\n“You know what I mean,” I muttered.\n“But, even if it’s held in the minds, you need that spark to revive it. And things provide that spark.”\nShe looked wistful for a moment. I scoured the yard, looking for this thing. Always something that she wanted me to find. Her clues were enigmatic, as if only someone who was her could know.\n“Made from fire and reaches for the sky,” I said again, crunching on a fortune cookie with the tang of citrus, pushing the sliver of paper in my pocket. Mom was leaning against a rocking chair, also snacking on fortune cookies. Hers were empty, without the iconic fortune paper slips. She had hand pressed them earlier that day, slipping in clues only for me. Shell-shaped and with a dash of her signature pomelo extract, they were tasty.\n“Made from fire and reaches for the sky,” I said, tapping fingers on my palm. I traced the yard with my feet. My sandals left impressions in the wet dirt. We had no chimneys in our neighborhood, so it couldn’t be that. What is made from fire? Ash?\nFinally, as I neared the trunk of the ol’ tree at the corner of the yard, I saw a flash of a smile appear on my mom’s face. Ah, I said, shimmying up the trunk and grabbing a handful of the bright yellow flowers. “The flame tree. Made from fire.”\n“Yes, Koelreuteria bipinnata. Native to Southern China.”\n“Yeah? Is it really native to China? Traveled quite far.”\n“Yes, like us. The Chinese flame tree. Also called the ‘complex feather leaf tree’ in Chinese. Doesn’t quite capture the poeticism of the flames though.”\n“Not really flaming now, is it?”\n“No. Too bad. Have to wait for later in the colony year,” she said. Its bright red lantern-shaped seed capsules only flourished in the autumn. These yellow flowers were more like embers in comparison.\nI unleashed the crinkled flowers from my hand, letting them rain down onto the yard. I could hear mom crunching on her cookies. “It’s pretty in the autumn. But, the flowers are useful, too. Remember, in Chinese medicine, the flowers clean the liver, detoxify, and promote clear eyes.”\n“So you sent me to the flame tree to collect flowers? To, what, detoxify my liver?”\n“No, it’s to remind you that culture is in things. Medicinal practices in plants. But, also, you have another clue.” She pointed.\nI poked around and resting in the fork of the branches found the next clue, as she promised, another fortune cookie. This time when I cracked it open, all it said was “Aha! You’ve found me.”\n“Anticlimactic,” I said. I threw the cookie in my mouth. Within was a sudden burst of flavor, red bean and pomelo. She must have lined the cookie shell with extracts.\nWell, that was unexpected.\n“Sometimes you just got to enjoy the cookie,” my mom said. “Another message from the sages.” She laughed.\nShe came over, patted me over the head, and shoved a bunch of empty cookies into my hands. “Eat.”\nI snacked on the rest of the fortune cookies in my pocket. My mom handmade enough of them to last me for years, but I could only take a small bag of them for my trip to complete my filial duty.\nI was using the porto-vac, sucking up the crumbs from my new comfort suit, while on line for the security check. Once we got to the port, us passengers would be divvied up into autoships.\nThere were huge cruise shuttles heading back to Earth in the other direction, but mine would be one of the smaller ships, holding only a small crew and a spattering of passengers to go out farther into the Driftnet colonies.\nThe ticket was terribly pricey, and thank goodness for the research being funded last minute through the Zhongqing Marketing Corp. They’re trying to push through new lines of landscape gardening for sale. They rejected my request to do cultural acquisition on language and religious rites, but held on to my application. Instead, they wrote a comment that they wanted me to collect interviews on gardening practices and ecological data and would fund me for that, since I was one of the few who had a good grasp of far-colony dialects. Beholden to my funders, how can I refuse? I mean, it’s all for my mom, in the end. They granted me a research ticket that allowed me to bring one personal item greater than 10”x10”. That allowance was a luxury.\nThe security guard grabbed the urn case and pulled it open. I stepped up to say something, but as I opened my mouth I glanced at her partner guard with piercing black eyes like gulfs. He glowered at me. I backed down, but when she took the urn out of the suction mold, holding it tight, she nearly scratched the luminescent enamel embossments with her comm watch.\nBlood rose up my back. “Be careful. Can you please pick it up by the handles?” I sounded like Dr. Lee-way.\nShe shot me a direct look into the pupils and nodded at her partner who held out his hand. “Okay, hand over your other bags.”\nSecurity. At least they’re not asking for a pat down. I showed them my badge.\nThe bearded partner read aloud, “Jinying Chang. Anthropologist, Research Systems, Funded by Zhongqing Marketing Corps.” He scanned it.\n“Ah, Jinying. Yeah, you’re on our list,” he said. The security guard holding my priceless beauty suddenly became a lot less rough with my mom’s urn. She swabbed a sensifabric over, which illuminated it in a bright blue haze. She rotated it, holding it by one of the handles this time, going over the surface of the cloisonné design work with the sensor light.\n“What is this?” she asked. “I’m getting some strange readings.”\n“It’s a special vase for rituals,” I said, in rehearsed nonchalance.\n“Looks like an urn,” said the bearded one.\n“Urn? You can’t bring human remains on board.”\n“No, no human remains, of course. It’s not an urn. It’s a special vessel used in ancient spell rituals.” I clenched my teeth and flashed my badge again. Hello, anthropologist, don’t you see the words? I wanted to shake them.\nBut, they were right, of course. It was an urn.\n“We’re going to have to run it through the Insta-tell. We’ll have it out soon.”\nI felt like I got punched in the gut. I couldn’t let them just take it. What if they throw it in the incineration and reclamation pile for prohibited goods? Even if it wasn’t prohibited because technically the ashes were on me, not in the urn.\nI could feel my mom’s last wishes recede from fulfillment. I couldn’t let that happen.\n“I’d rather have it in my sight. It’s a one-of-a-kind rare artifact.”\nShe looked at my badge again and up at my face, as if that would somehow help convince her.\n“Fine, but that means we’re doing a pat check, too.”\nInside I groaned, but I nodded and followed them without a word.\nI hated pat checks—violating crevices, poking in with their lighted wands. They couldn’t just use the sensifabric like any other humane service agent, no, they had to take out the wand and jab and prod, abusing their authority. I usually would submit a few direct complaints that would get the pat check override, but I had too much at stake to risk the delay waiting for Zhongqing’s administration to get the clearance through.\nI also couldn’t let the guards find the ashes flattened out and stored under fauxskin over my thighs.\nI sneezed a few times as they took me to the sensor room.\nI squirmed as they started the prodding. I told them to be careful with my knees, that I had surgery in the past. I tried quelling the shaking that would give me away. They couldn’t see me nervous.\nAs she got to the secret compartment, a bead of sweat ran down my neck.\nI sneezed loudly, complaining of allergies. It made the prodder she held jump just a few inches away from my legs.\nI kept waiting for the loud beep that would do me in. At one point she stopped near my hip. “The prodder might be low on charge. I might have to get a new one and do it all over.”\nI wasn’t sure if she was serious or messing with me just because I gave her lip in the beginning.\nShe banged it a few times and then started at my ankles again. I sneezed a few more times for good measure.\nThe prodder tickled the insides of my thighs and I could feel it even against the fauxskin. I had smeared on a sensor-cloaking cream over the flattened sacks of hidden ashes. Bought on black market and not completely unsure if it was effective or a dud. The person who sold it to me had a prodder, which she showed beeped for a sample of remains but then didn’t for the bags of my mom’s remains on top of which she lathered her product. It worked for the seller, but could’ve been a ploy. It was also pricey. Had I been conned?\nI was skeptical, but had few choices.\nThis is for my mom, I thought. Hidden away into the secret compartments in me as she would’ve liked, like I was a walking puzzle box progeny. A puzzle box in which she could so comfortably nestle into after death. I sneezed a few times and the guard actually apologized, going faster.\nNo beeps.\nWhen she got to my waist, I breathed a sigh of relief, still sneezing a few times for good measure.\nShe let me out, giving me the “spell ritual vessel” and its case, not even bothering to put it back in its specialized packaging.\n“You’re free to go,” she said, whisking me away.\nDid I mention I hated security? I continued an occasional sneeze as I packed the urn away with a gentleness that they really should’ve shown. I grabbed my other bags, which were cleared. Under my patch of fauxskin, my real skin itched. Over that layer of my real skin, my mom’s ashes—culture embedded in lifeless things—lay flat, waiting for their arrival to the eventual burial site.\nI repacked my other bags. They made a mess of them, with some useless knickknacks gone, down into pockets to be exchanged by port hands.\nSecurity.\nI shook my head again. In the end, I tricked them and got away with it, so I really can’t complain. I should celebrate how ineffective they were.\nOn the trip, I would slip away from my bunkmates and find a quiet space in the standing “lab cubicle”—just a tiny space with a ledge, or as they designated it, “lab table,” to be alone. I wondered what fool would try to set up an experiment here, given the unsteadiness of the ship’s movement and the complete lack of space, equipment, safety wear, and setup protocol. Maybe a thought experiment, I considered, laughing to myself. A thought experiment on how to conduct an experiment here in this tiny tease of a room, where even I barely fit.\nI tapped on the table.\nNobody was here to share the joke. I thought that my mom, her ashes still hidden in my thigh, might’ve gotten the joke.\nIt itched down there on my thigh. I had to move her elsewhere, but I couldn’t figure out where. The urn was completely out. She and her list of demands. It was so Yongli, but well, I couldn’t just say she was dead and not care. I couldn’t put her remains in until I got to the designated spot. It just wasn’t right to defy last wishes. Besides, I was curious what this was all about.\nI tuned the urn to the directions of Dr. Lee-way, as I’ve done every day since I received it.\nAfter tuning, I set the vessel on the table and pressed the pads of my fingers along the delicate cloisonné designs, watching holo after holo come alive. This had my mom written all over it. Things upon things coming to life, as if things had a spirit of their own moving them.\nThe wok she so cherished banged in delight by itself against the stove, sending a musical of notes. I was glad for the soundproofing of the lab cubicle as I hummed along with the rhythmic beats it made against a holographic kitchen countertop.\nExperimental fuzzy fabric socks that wiggled its toe-area on its own. I had gotten them for her. They were supposed to be super toasty and cozy, but she said it was like lighting a fire on her foot. Too warm.\nThe hovercar she called Shandian for its lightning speed. The door would jam and I was delighted the holoartists captured that detail for her in their projections.\nJars and jars of cream spilling out. She was dermatologist and owner of her own cosmetics brand, always saying that she would crack the puzzle of wrinkles and old age. In the end, they got to her, after decades of staying wrinkle-free, a poster child for her creams and the best-selling point that could be, the last months of unchecked stress and poor health left her face as wrinkled as maps of hovercar routes.\nI stuck my hand through one of the holographic jars, remembering the cream. I felt almost nothing, only the slightest of tingles at my index finger. The other jars were hitting the wall, lighting up and warping, impeded by the contained small space of the “lab space.”\nLiquids were too heavy or else I would’ve brought a jar of the cream with me. I felt my own face, with creases starting to form.\nThe holo fizzled away and the sound of the jingles for her brand receded. I wiped off a tear, patted my eyes so they wouldn’t look so puffy, and tapped on my cheeks to fluff them up a bit. There.\nI set the urn back against the cushioned case, pulled the top closed, and stepped out. There was a man with a goatee who held the door open for me. He had in his hand what looked like an old-school microscope case and a sack of what sounded like jangling transborosilicate.\nReally? Petri dishes here? Good luck with that.\nI couldn’t help but smile. My mom would’ve joined in on the joke.\nFor all her interest in skin care, my mom had really little interest in people. Sure, she laughed at their personalities and listened to gossip, but when it came down to it, it was really what was on the surface. Her attention was scientific and focused on the epidermis, almost like a thing in and of itself, disconnected to the person. She said, it was more about lifting up humanity as a culture, bringing us to our most aesthetically pleasing state, like we were monuments. But, of what?\nOf ourselves. Of course.\nIt didn’t make much sense to me, but it fit her worldview. It was like lawn care or trimming a hedge. Topiary-like.\nLike grooming the flame tree. I remember her holding laser saws, cutting off wayward branches, the seedpods falling like little blazing shooting stars, as she tried to achieve something akin to symmetry. She was smiling then, wide, like there was nothing more exhilarating than shaping them.\n“It’s about making a figure to eclipse the enigma within. You get this general shape, but think about all the nooks and crannies of the branches that get hidden away. In scavenger hunts, you exploit these hidden spots that others don’t see.” Her eyes twinkled.\nAfter arriving at the site of my fieldwork, Lancon, I asked all the right questions. The urn was now in its case nestled tightly in a local artisan traveling sack, slung across my shoulders. Light as a feather, as always. But, I was weighed down by the memories and the need to collect data. By then, I had moved my mom’s remains into hidden compartments in my knee-high liquid-proof field boots.\nI shoved aside thoughts of my mom as I gathered narratives about all kinds of plants, little tendrils that curled up to the skies, petals that glowed and changed colors, roots that crawled horizontally across towns.\nBut like the roots, the memories would crawl back to me. I met an old woman and her three grandchildren as they mashed up roots. I drew sketches with my zex-quill, taking holoflash data to be converted by artists. With micro-tweezers, I collected samples and slipped them into specialized silvery sachets.\nI tripped over a few words, but was surprised how much of the dialect came back to me once at the site. As I conversed, I made the local girls laugh with imitations of the gloopy noises the roots were making. Sticking my fingers into the lifa root to prod out the clumpy parts, I couldn’t help but think of my mom’s force-feeding of ginseng paste that was supposed to help the skin. “It’s good for you,” her voice wormed into my ears as I spoke, the giggle of teenage girls surrounding me receded. “An antioxidant, antiaging, and promotes elasticity.” I remembered the bitter aftertaste that goopy ginseng concoction left in my mouth.\nI remember all the times I rebelled. Like some of the other teens I met at the swirl gardens who refused to participate in the trimming and instead hopscotched along the rocks lining the dirt. Their parents yelled at them to not run with scissors and they threw them across the stones in defiance. I took holoflashes of those instances, jotting down their slang, marking them as “youth at play; youth at defiance.”\nI took notes to myself on the language of religion—all the utterances and inscriptions. I wasn’t sanctioned by the funders to do that, but you can’t help a curious mind. Plus, after doing fieldwork for years, you realize that all these parts of culture are entangled and it doesn’t hurt to take notes. I saw how they honored the dead with words.\nThere were new practices mixed in with the old. Besides burning holo incense and chanting, villagers dressed in drapes tied holographic fabric slips with words as a new custom alongside the age-old tradition of erecting funerary poles.\nThey asked me to tie a fabric slip to the pole of a village chief I met years ago, who I was sad to learn had passed. I affixed the fabric to the pole. The silky fibers seared into the pole, as if grasping it. A spark activated and sent the words scrawled on the fabric shooting out in a bright crimson hologram, illuminating the skies. Projected in a curvy script with many slashes and dots as phonetic markers, I read the words in my slow comprehension:\n“In memory, you live in us.”\nThe holo began to fizzle and flicker, accompanied by the sound of a prolonged sizzling “sssssss.”\nAs the holo finally ran out of power, and the skies returned to an onyx adorned with stars, the slip of fabric detached and unfurled. It flew in the wind, tackling my arm for a moment and tickling my skin. It smelled like the heady aroma of holo incense. It settled onto the garden floor, where it would decay into nutrients for the plants.\nA shiver ran up my spine and goose bumps ran up my arm.\nThere was a rhyming feature that I couldn’t capture in my translations, no matter how hard I tried. I found it poetic. I also thought my description in my notes of the fabric was lacking. Silky didn’t cut it. It was a satiny smooth that glided, like words slipping into and out of my ears. Just touching that slip of fabric was a full-body experience, sending tingles throughout my limbs.\nBut, there was something else. A memory.\nThe whole process reminded me of the many fortune cookie slivers of my mom, still awaiting my return home, sending me messages even after her death. Like prearranged clues into the puzzle of her afterlife.\nIn grief, you start wondering the strangest of things. Did she even care about me at all? Was it always about things? My appearance, my skin? Was it about her? The cracking of her puzzles? The skin as the layer that matters most, the outer beauty that counts?\nA few days later in the village, a cute, lanky, ruffled-hair twelve year old ran into my sack with a firecracker. It was an ol’ analog kind, not holo, which surprised me. They looked like flame tree seedpods threaded together. They must have gotten these made locally since you can’t get them onto the Corps-approved trading ships. Probably got here through one of the “underground” skygliders. (My anthropologist brain liked to see how holdover words like “underground” to mean “subversive” or “illicit” still has meaning even when commodities are sent through the skies, high above ground.)\nI waved at him while he was holding the firecracker. Holding it was no problem. The problem was when it went off. He didn’t throw it across the gardens like he was supposed to.\nIn catastrophic blasts, it exploded in sonic booms. Bang bang bang. Boom boom boom.\nI jumped back three feet, tripped over rocks, and fell, twisting. Something in me rattled. Maybe it was all my organs and more. The shock traveled through my arm to the ground. My eardrum pounded. My nose was in dirt, shivering. I smelled the earthy scent of this transplanted garden ground, my head swimming.\nI wiggled my fingers. My arms felt numb, broken even.\nThe firecracker banged a few more times. It let out a long hiss and crackled.\nIt was still hissing when I stood up, checked my arms (not broken), and let the wooziness subside.\nWhen I felt steady enough to walk, I went to check on the boy. He was knocked over, too. A ringing in my ear grew louder and louder. I checked his breathing and picked him up. He was half-conscious, mumbling something I couldn’t quite hear past the ringing as I carried him over my shoulders in a fireman carry. He was skinny and deceptively light for his lankiness. Not so heavy at all, I thought.\nI was still feeling the rattle within me, making what seemed like the longest walk I’ve taken to the infirmary, my legs trudging with a heavy step.\nThe first thing the medic did was put the boy into a calm-inducing sleep, with a few spritzes of the composite serenity spray.\nThey left me awake, with the ringing that transformed into a rippling sound in my ear. The medic gave me some bitter herbs to chew on, followed by a star-shaped cracker. I began to feel better, with the sound of the rippling receding. They put me against what I translated as a hug-all, a giant stuffed-animal-like pair of nurturing limbs made of synthetic fibers mixed with an organic cellulose-based fluff.\nThe cracker left me with the aftertaste of citrus. Nestled in this cocoon, I felt soothed like being in my mom’s arms when I myself was twelve.\nIt was only later, when I was tuning the urn, that I found the hairline crack in the cloisonné.\nI drew in my breath and held it. No.\nThe urn was otherwise intact, but the petal of one flower was marred by this crack. I breathed out, thinking that the rattle within me all the while was also a rattle of the urn. The thought of its damage disoriented me. In carelessness, I had destroyed the beauty of it.\nNo, it wasn’t destruction. Not even damage. Just a scratch. Get a hold of yourself. I breathed in and out.\nI just wanted everything to be perfect for my mom.\nI felt along the urn for a while, pressing and checking to see if the holos were affected.\nMost of the ones I had found projected their holos as they have in the past, with the same shimmery cinematic presentation.\nBut, when I pressed on the trigger that I knew to unleash the rocking chair holo, I heard the tiniest sound of a creak and a panel of light shot out and receded as fast as it came. I tried pressing it a few more times, like a desperate child tackling the buttons of a slow hover-elevator.\nThe rocking chair holo never projected in all its glory. At one point, there was a slight suggestion of the curved “skis” under rocking chair legs, but then nothing else materialized.\nI felt a numbness creep into me.\nI breathed out and stopped clicking on that rocking chair button. I moved on.\nAfter stroking and prodding the surface for some time, I came to the conclusion that I didn’t think it messed up the integrity of any of the other holos. Overall, I didn’t think it affected the mechanism for me to crack open the puzzle. I couldn’t say exactly how I knew that the integrity of the puzzle was intact, but after I calmed down, humming to myself an old Teresa Teng song my mom used to sing to me as a lullaby, I just had this feeling that it would be okay. Everything would work out, even if my rational mind told me that things went awry, people died, and there was no assurance in the world.\nI shut that rational mind out and focused on the present, humming louder.\nI remembered Dr. Lee-way’s advice and dug out the ubertape from my luggage. I moved my mom’s remains into my suitcase, no longer sure if my hidden boot compartments were a safe holding spot for her ashes. They was too exposed there to all my activities. Better safe in this room.\nI checked the seal on my locking device, affixed the verbal shutdown of the room. I hobbled over to the port (my legs still weak) and picked out some comparable slathers to the ones Dr. Lee-way suggested from the supply store. I wasn’t sure if it would work, but when I got back, I bandaged the patient, i.e. the to-be vessel for my mom, as directed, as gentle as lathering face cream on a kitten, my mom used to say, which made no sense to me then.\nIt seemed to make more sense to me now, as I did this quiet work.\nI wished I could tell her that.\nI brushed on the slather remover and tugged at the cloth. It resisted the peel. It felt like the reveal after cosmetic surgery—someone with a new face. Would I recognize her?\nWhen the cloth gave way, my eyes bore into the urn, right at that spot. Yes, it was there. Faint, but still there. The tiniest of fissures visible to the naked eye.\nApropos, I thought. Like wrinkles blooming on my mom’s face as she neared the end of her term here in this universe.\nI wanted to maintain that supple beauty that my mom effortlessly strove to achieve. Okay, it wasn’t effortless. It was the constant application of creams and concoctions that she put together and sold, brushes slid against faces, incessantly making holo calls and presentations for her business, for investors and sales. She had a team under her, but she liked to be on the front lines, showing off how she cracked the puzzle of agelessness.\nIn the end, agelessness wasn’t solved. It fell on her, too, taking her away from me.\nI pressed on the trigger for the rocking chair projection. The form came up in holographic light, but it was fainter than before. It faded away quick.\nI felt a pang of failure. Mom left me one last puzzle to figure out, one last enigma to share between us, and I botched it up. And above that, this vessel was her new skin, her carrying case that she would dwell in for the rest of eternity, and already it was marred.\nI heard a footstep. It was the twelve year old. He was walking along, no limp, no issues. Children heal fast.\nHe came up, looked sheepish, and whispered a thanks. With deft fingers, he held up a thin strand of gold. It was thread, so thin, thinner than a strand of hair, it almost didn’t exist. Put it against the ambient light and squint and it almost looks like a translucent wisp of vapor floating in the sky. It was made of the same material as the fabric slips for the funerary poles, but spun into a nearly impossibly delicate width.\nHe had tied some knots into it. It was an exceptional skill of manipulation for someone I had charged to be so clumsy.\nWhen I felt along it, his brown-speckled eyes became wide, his pupils dilated as if beseeching.\nI recognized the pattern from my research. It was one used in condolences, a freeing of the soul and a wishing of eternal comfort. I gave him a pat on the back and cried.\nHe looked nervous and uncomfortable, watching a grown woman cry. He passed along a local organic glue, said some perfunctory words, and made an exit, rushing along in such agility, it was as if he had never even gotten hurt.\nLater, with careful fingers, I affixed the thread to the crack, covering the hairline fissure. It was beautiful, reminding me of kintsugi, the time mom taught me how to splice back broken mortar and pestles and ceramic cream jars with melted gold. This golden thread now contained a message, however, a reminder of our journey together—me and this vessel and my mom’s remains—through villages and people who knew me as a researcher and cared.\nAs I was pressing down the thread onto the fissure, the seal made a strange gurgling noise, and it triggered the holo. I watched as the holo lit up in a color so bright, it bounced in a sheen off the front of my nose.\nIt was the same rocking chair, but even more resplendent. Was it me, or was Teresa Teng’s ballad sung in an even clearer voice, one that sounded strangely like my mom’s? And was it me, or did I see the faintest silhouette of two figures sitting on the chair, one mama-shaped and one child-shaped on her lap? I shook my head. I must be imagining it.\nI rubbed my temples. Maybe it’s the roots for the headache they gave me.\nBut, I stared harder until it fizzled away. I tried touching the holo. Nothing but a slight tingle.\nI pressed the enamel trigger again. And again. Yes, they were there. Faint mama silhouette and child. I put my finger again to it, feeling the tickle again. That’s her. That’s me.\nThey were there.\nAt first, I thought if I collected a bunch of these threads and glued them on, maybe it would work. All these holograms would pop to life with more vividness, more life.\nI did bartering, trading my expertise in linguistic and cultural translation at Lancon for supplies. I spent time there fulfilling these trades, scrawling down texts and handwriting scrolls and posters. I helped administer deals and correct misunderstandings. I arbitrated negotiations. I usually avoid all this kind of interaction, anything more than collecting data and minor participation in rituals—it felt too much like meddling.\nIt was something my mom was good at, ingratiating herself with others to get her product sold. She said that customers were just enigmas to crack. Once you figure them out, you know what they want. And she would say, I always have a solution for them—in the form of cosmetics.\nI managed to collect in the form of payment, a few of these cherished gold threads, doled out infrequently, only one at a time and in exceptional times like births, unions, and deaths. It was lucky I even got three of them.\nI used the same glue and tried a few ways of manipulating the thread. I tied one in the same way as the boy, incorporating the condolence message. It didn’t work. My hands weren’t as nimble as his, but I checked a few times and the knots were in the right place, looped in the same ways. I tried undoing them, having to procure some removal paste, which also cost a lot in interaction and trade.\nAfter finagling with it for some time, I gave up. No other holo became more brilliant or had features I didn’t see before. Even when I added another layer of the gold strand, the rocking chair one stayed exactly the same, with only a mere suggestion of silhouetted figures.\nI left Lancon in worse spirits than coming in. Sure, I gained a clue, but I was far from figuring anything out. It was a tease, tantalizing me, but I wasted so much effort here. I kept the three strands, ubertaped them to the pack holding my mom’s remains.\nThere was more to figure out.\nI traveled in a local skyglider to the burial site, in Conme. Sixty-nine days had passed and tomorrow would be the last of the funerary period. My deadline for cracking this puzzle fast approached.\nUsually, I avoided the skygliders, going for the more official routes, but the parties I helped at the village were so happy with my time doing translation and negotiation work, they banded together to get me a flight out. I packed my things and said my goodbyes.\nThe twelve year old handed me a bag of dried flowers for an infusion. They were macolan, desiccated but still flashy, and reminded me of the bright yellow flame tree flowers.\nI thanked him. I shook the flowers and took a whiff. A floral potpourri scent that reminded me of jasmine filled my nostrils.\nI touched elbows with him and bid him goodbye.\nIt felt lonely without the villagers.\nWith my fieldwork done, I was able to make this side trip to Thres in Conme, outside my funding parameters. I wondered why my mom had chosen this as a burial site. She said it had to do with feng shui and some rather complicated calculation involving angles and starlight to Earth, conveyance, and as the natural burial site of our ancestors after leaving Earth. I didn’t understand the feng shui talk no matter how much she propounded it. She said it was about angles, movement, and vibrancy, like the shape of your face and appearance of the buoyancy of your cheeks relative to your eyes.\nI didn’t know what she was talking about then. But there was one thing I knew now. I felt dejected. I’d end up burying her and the urn because I reached the deadline, never cracking the case. Never fulfilling her wishes.\nDr. Lee-way was right. I had played with the urn until my hands felt sore, my knuckles aching from poking and prodding. I saw the holos over and over, I’m sure I could have drawn them out with my zex-quill one by one in succession with my eyes closed. I could sing in detail the music that flowed along with them. But, only the faintest outline of what might be, the latency of what laid within, had appeared, and I stared at the mysterious silhouettes until I could bore holes through the holo itself.\nAs the skyglider approached Thres, the pilot must’ve felt my anxiety and stayed quiet the whole time. But, at one point, he started coughing. It was this uncontrollable cough that whipped through the air. I knew the ship was safe since even the skygliders were equipped with autopilots, but I started to worry about his health.\nI gave him a desiccated macolan. He saw the flower and smiled.\nI poured a hot liquid from a decanter, careful not to upset the sediment. Then I took the macolan flower from him and dropped it in the liquid, watching it bloom in slow motion, brilliant tendrils reaching out into the amber liquid.\nThe pilot, who had stopped coughing, introduced himself and began to talk.\nHis name was Kaspa. He said he heard I lost my mom. I just nodded, not feeling like chatting, even if I did miss the company of the villagers. He said he lost his wife a few years back. He talked about her with such open affection: the way she used to dance the lamdaca, her incredible skills in material science, her way with certain chemicals. He showed me a handful of golden strands. “She made these.”\nThat made me open up.\n“She made the funerary strands?” I asked, completely awed. He had a clump of them—maybe twenty. It was so haphazardly in his palm, like the clumped filling of hug-all’s. I’ve seen slips and cloths made of this fabric, but I’ve never seen so many gossamer strands at once. The fibers were so delicate that I was told many snap before reaching that thinness.\nIt was a small fortune in his hands.\nHe tucked them into a pocket and laughed. “Yeah, my wife was a genius, amazing.” His eyes looked wet, and he stared at me for a moment.\nI looked away.\n“I got one recently. From a twelve-year-old boy.”\n“A twelve-year-old boy. It couldn’t be Rondi, could it?”\nI thought for a moment. “Yeah. Rondi. I think. Yeah.”\n“Tall boy, yeh high?”\n“Yes, tall and lanky. Disheveled hair. He brought it to me and it was so expertly knotted.”\n“That’s my little boy!” cried the pilot.\nMy heart did a flip. I cocked my head and looked at the pilot. I didn’t see the resemblance. Had he mistaken?\n“No, Rondi’s dad is Kayel. Kayel came with us to the doctor’s when he hurt himself.”\n“He hurt himself?” Kaspa looked seriously upset.\n“He’s fine. Just got a bit rattled up. He’s fine. He got startled from firecrackers and passed out. We got him to the medic. I saw him myself running about after, completely carefree.”\nKaspa gave a sigh of relief. Tension in his shoulders released.\n“No, Kayel is not his dad. I am. Kayel is Rondi’s godfather and current caretaker.”\n“You’re his dad?”\n“Yes, I’m his dad. Rondi’s my son. I took care of him until Lakla, my wife, died two years ago. I started driving these ships and had little time. It was hard, but I handed him to his godfather for care. I visit him from time to time, but I know it’s not often enough.”\nHis eyes darted down and he stared at his drink for about a minute.\nI looked through my notes. I had a few kinship charts, but I didn’t focus on Rondi’s family, but on other villagers. “So, Kaspa, you’re really Rondi’s dad?\nI just couldn’t believe it. They seemed so different and I was convinced Kayel was his father. They even had the same expressions, this worried crease between the eyes. I felt sorry for Rondi, his dad always on the move, in the air, far away.\n“I hate to admit it. But, when Lakla died, I lost it. She was everything to me. I would’ve done anything for her. And the one thing she would’ve wanted me to do, I couldn’t. I couldn’t take care of him alone. He looks just like her. Just like her. A spitting image. Just looking at him, it opened up an ache so wide and engulfing, I would’ve fallen in and never climbed out. I couldn’t see him and see my dead wife. I couldn’t.”\nNow, the decoction in his hand was shaking. I could see through the transparent mug, the macolan dancing in there like a strange organism, its petal tendrils gliding in the water and trembling.\n“Rondi gave me that,” I said, pointing at the flower.\nHis eyes flashed and crinkled. He took a sip, sighed, and put down the mug. “I know. He loves those flowers. So did Lakla. They used to pick and dry them together. She’s a material scientist. Did I mention that?”\n“Yes, you did.” I tried to cover my grin about how proud he was about this fact.\n“There’s some compound in those flowers ingrained in the threads. I don’t know it all exactly. Only a few know and I’m not even sure if they know it all. Lakla was a genius, like I said.”\nI pulled out a couple of mine. “I have some, too. From your son.”\nHe picked one up, felt it and stared at it with a faraway look, as if staring through it. “Ah, these, these aren’t the same.”\nI gasped, almost letting one slip through my fingers. “They’re frauds?” I picked it up from the skyglider floor, watching it noodle into a ball in my palm.\n“No, no, they’re not fraudulent. There are different versions. This is version two. It doesn’t have all the new compounds. My wife was working on these new strands, version three, before she passed. She said she didn’t perfect it, but the version three ones were cutting edge. They even use them now in manufacturing some appliances and other top-of-the-line goods. She was always tinkering, never satisfied.”\nI thought for a moment, weighing what I would do next. It could imperil my trip there. Maybe he would turn around right there and then.\nI did it anyway. I took out my mom’s urn. Pulled it gently out of its case.\n“Is that what I think it is?” His voice was small.\n“It’s an urn.”\nI showed it to him. The buttons. I watched the holos, crying.\nHe watched me cry, his eyes traveling to the holos and then to me.\n“If you have an urn, then you must have the remains.”\nI sniffed, dabbing my eyes with my knuckles. Should I lie?\nI thought about his wife, Rondi, and his sincerity about leaving his son. I couldn’t. Not after this.\n“Yes,” I said.\n“You know I’m not supposed to have this kind of stuff on my ship.”\n“I know.”\n“They’re remains.”\n“I know. I’m sorry.”\nHe breathed a large sigh.\nWe were silent for a while.\n“I’m not going to turn around. But, you’ll . . . you’ll make it up to me. You have to come by more. Come visit my son. He likes you. He gave you a few of these strands and flowers. He doesn’t do that for everyone. He was very close to his mom. They were things of his mom and he doesn’t just give them away.”\nI nodded.\nHe focused out into the skies, the brilliance of stars twinkling in his pupils. “Tell me about your mom,” he said. He gestured at the urn.\nI told him. I told him not only the good, but the vanity. Her drive, her ambition. Her cosmetics line with her as the icon. Yongli, even her name, forever beautiful. I wrote it for him: 永麗. Her love for puzzles. This absolute drive to create the best puzzle so I can never unlock it.\n“Sounds like my wife. She wanted to pass on her knowledge of material sciences to my son. He liked the flowers and the strands, but he was more of an artist. He’s good with languages and crafts. He’s invented a few of his own languages. He likes creating in his own way.”\nHe looked wistful. “She was a bit too driven.”\n“How did she pass away?” I asked. I went and made myself a concoction as well, tipping the hot water into my own mug and dropping in a macolan flower.\n“Stress and lack of sleep. She was overworking herself. I told her to stop, that she didn’t need to, that I could help her with payments. Back then, I was running a small business, but it wasn’t working out. It wasn’t about money, though. She just was too involved. She started missing out on life, on Rondi himself. Didn’t see him for who he was. The irony is that I did, at least I think I did, but I left him.” He clamped up and starting playing with his hands. He looked down, pulled out a sensifabric cloth from the drawer below his seat, and wiped down the viewing window, the glow reflecting off the viewing cauldglass. He checked his readings and continued wiping. “How about your mom? Did she see you?”\nI wasn’t sure how to answer him. I started to say something, then switched. I rattled on about her attributes. Her foibles. Her love for puzzles.\nHe listened.\n“Do you like languages?” he asked, suddenly, swirling the now-soaked macolan with his fingers.\n“I love languages,” I said. “I think what your son does is amazing. I’m really fond of all things related to communication and expression. Actually, I’m primarily a linguistic anthropologist. But, I also do other cultural work.” I trailed off.\nI thought of something, something was piecing together.\nThe urn. Did she know me? The question stung like a bee. Did she know me?\n“Do you have a sharp knife?” I gestured, poking my finger against the urn.\n“One that sharp? Hm. Hold on tight.” He pushed a few triggers on his window in front of him and then stepped away. He came back with a laser.\n“This is something my wife codesigned to conduct research on her material work. It’s a prototype but works well. It’s a knife that senses organics and will not cut through life but only through materials that you designate.” He showed me. He turned it on and passed the scarlet ray through his finger. I winced. It didn’t cut. He adjusted the tip, directed the light at the mug.\n“She used to get a lot of cuts on her fingers. Not deep, but enough to annoy her and slow down her work. She was always striving to achieve efficiency.” He slid his finger down a wheel on the side of the laser knife. “You can set the depth, too. You can also adjust the set depth by manipulation of the knife in your hands. Just push down on it like you would any other knife.”\nHe demonstrated. The laser created a small fissure.\n“It’s great for repairs on the ship,” he said, shrugging. “Like, I said. My wife. A genius.”\nI thanked him and wielded it. It was light and the surface made warm through Kaspa’s grasp.\nI was going to do this. I was going to mar the urn. I tried a few swipes on the mug, marking it with etches, and felt the ease of this tool. I was ready.\nI felt something possess me that wasn’t my own. No, it must’ve been me, many iterations of me, cultivated through years by my mom. Her asking me to talk to customers, making me interact with people in other languages I couldn’t understand. Introducing me to new cultures, telling me that to penetrate new markets, I had to understand cultural specificity. She made me study people’s faces, the lines next to their mouths, asked me what they ate and drank. She gave me brochures to read, competitors of different product lines, from different colonies, with strange drawings and symbols I had spent time sitting and figuring out. They were puzzles, all of them, and she knew I loved them.\nI etched words I remembered from these brochures. Ones that would match her—and match me. Who we were. I set the laser on just barely touching the surface, creating the shallowest of scratches at the edges of the cloisonné enamel designs, aligned with the holographic trigger points. I wrote in different languages. I was not a master of one specifically, but was versed in enough to be understandable, conversational, and analytical. I thought of those words now:\n“Ageless skin that will guide you into the future” in the rough consonants of Kzaskz.\n“Look visibly younger and healthier” in the loops of Checchneaneaot.\n“Creamy astral vibes for a new tomorrow” in the pictographic Letsnvam.\n“Erase the puffiness in your eyes” in the hypnotic swirls of Vloovloo.\n“Bring in shine and tone . . . and develop elasticity” in the gentle wavy tails of Nyeann . . .\nI wrote so many of these commercial platitudes on the urn with the laser that I lost track of time, space, everything. I forgot where I was, who I was, delving into these pockets of memory, conjuring them up as if they existed right there on my fingertips the whole time.\nDid she see me? Did she see me? The refrain swung and circulated in my head like the pendulating back and forth of a rocking chair.\nI finished the etched remarks with a slogan in Chinese: “Brighten your appearance. Give off a radiant glow. Feel forever young.”\nThe urn was slipping in my hands, covered in streams of my tears and thin, tiny flecks of enamel.\nI pulled the laser back.\nI didn’t dare touch any of it. I didn’t dare press any triggers or release any holos. I’m not sure I know why. My hands shook and a part of me knew I just ruined it all. It was a rush of hypnotism or something. Maybe watching that macolan unfurl unleashed something in me that made me unfurl. I was too scared to do anything more to the urn.\nI took out the porto-vac to suck in the flecks of enamel stuck onto the urn with my tears. Kaspa shook his head and handed me his sensifabric cloth to wipe it. “Vacuums in space are bad luck,” he said.\nI looked at my porto-vac, no longer crying, but smiling. “How about toilets?”\n“That’s different,” he said.\nHe laughed. I joined in.\nI managed to wipe the urn without crying.\nKaspa took one of his version three strands, invaluable I’m sure, and tied it on the top of the urn. “A gift.”\nHe made a series of knots with his clumsy hands. It wasn’t as elegant as his son’s but it amounted to a rudimentary message rather than the eloquence of a consolation note.\n“What’s that say?” I couldn’t recognize the words.\n“Take care,” Kaspa said. He took a moment to feel the words again with his fingers.\n“This is my son’s own invention. Words represented by a brand new knot-tying method. I only learned a few of these words. It was too difficult. He had so many languages in his head. I could only pick up a few phrases in each.”\n“Take care,” I said aloud, feeling the itty-bitty grooves of the knot. That was it. Brief.\nI promised him that we would keep in touch and I would visit his son. I would. I would visit my mom here anyhow and his son was along the way. Maybe I could take his ship, always coming here, his presence like a passage to my mom’s material self. Or her material remains, I should say. I didn’t know what the self was like after death. Does it even exist as self?\nI packed the urn. It had all the new engravings.\nAs I walked to the designated spot, already worked out and paid in advance, all the funerary procedures handled by my mom who always believed in agelessness and yet somehow had planned out her own termination, I thought about the word engraving. It’s funny how in some languages the word engraving has grave in it. Engraving. Inscribing, as in digging deep. Making a lasting name. To permanently affix into memory. A small trench, a cave of wonders. Etymology was curious like that.\nIt was the last moment, the end of the seventy days of the funerary rites.\nI sat down in front of the hole in the dirt. The cave of wonders. The engravement of the earth of this projection of the ancestral home. Not quite Earth, but somehow related in her configurations. It seemed fitting, for a people who have migrated and been displaced, to rest also in a space that was a projection of home, but not the home space of home exactly.\nI stared at the urn. My hands shook. I looked at the engravings I carved. I’m sure these words I inscribed did something to solve the puzzle. My senses sharpened at the thought. I could feel the tingling in my spine go up my fingers. A rustling in my ear I thought was a whisper that said, yes, it’s solved. It’s this Thres atmosphere, so full of crackle and electric discharge. There was something else there. A strange, unsettling prescience. The phrases I etched did something, I knew it.\nI clicked on the many holo triggers in succession so fast it was almost at once. The holos projected. The figures became clearer, luminous.\nYes, I cracked it, I thought. Joy filled my chest. I held my breath.\nIt was me.\nMe in the rocking chair; me pressing fortune cookies; me swinging from the flame tree; me holding onto the wok, flipping stir-fry.\nWere these her memories of me? The outburst of joy subsided. I let go of my breath. I felt odd, strange, dislocated. Was I burying her or myself? I played it again and again, over and over, watching this reel of film unfurl, watching these moments string together like some lifelong play about me.\nWhen I exhausted all my energy in focusing and watching, I sighed, took out the sachet that I had hidden in my boots once again. I felt it, so light, for such a strong, driven woman. This was all that was left of her. Just ashes.\nIn a strange way, it reminded me of Rondi. So much will, but so light when I picked him up. Lanky, tall, and light. Maybe this was the irony of materials. The most intriguing puzzle of all. How can so much of us be contained in such little material? Such small mass for so much life?\nI pressed all the triggers again, letting the holos run. “I’m fulfilling your last wish,” I said. I used several tongues to say that. Then I switched to Chinese. I was never as fluent as her in it, even after years of practice, drills, and everyday usage.\n“I don’t know if this is breaking your puzzle. I’m not even sure if I cracked even a millionth of it. You’re not easy to crack. There’s too much of you. I don’t even know what it means to solve the ultimate puzzle of man . . .\n“Woman,” I corrected myself. “Aren’t we just layers and layers and layers? Aren’t we too much to figure out? There are secrets within secrets within secrets. More of you than I can ever discover, ever unveil.”\nI cried, twisting the urn lid, its once obstinate contours readily giving way. It creaked as it opened up. I set the urn lid aside. I reached within, giving it a sweep with my fingers.\nNothing. It must have been the holos after all, that was the real prize. I couldn’t get their nostalgic glow out of my head.\nMy hands moved mechanically, the contents of her spilling into the urn. The Teresa Teng song mixed with other songs and became a melancholic drone. A buzz filled my ear, reminding me of the fireworks. Bang bang bang. Boom. Was that a sonic boom? Or just in my ear?\nBetween streaming tears, I stared in wonder. The urn shifted, surface plates moving. It creaked as new images lit up. It was like tectonic plates, piecing together something entirely new.\nShe appeared there beside me. In every holo, she was there trying to speak in tongues that I knew. She had practiced them before she passed away, gathering the pieces she picked up throughout her life. It was her voice, sometimes singing in other languages. Sometimes repeating these platitudes of her agelessness and the beauty of skin. She had learned them or tried to. Some were not so smooth, tripping over words, sounding a bit silly. She never liked languages, at least I never thought she did, and I always thought her interest in people was only her way of selling things and propagating this surface beauty. The aesthetics over the substance of man . . . of woman.\nBut, as I saw her singing, skipping over syllables—rocking in the chair with me, pressing down fortune cookies with me, mixing up creams with me, rolling up fuzzy socks with me, riding Shandian with me at lightning speeds, fixing up ceramics with me with kintsugi, bending draymetal with me into small loops for the enamel filling—her voice in my ear, confusing phonics of languages she tried to achieve for me, I knew it. The thing I cracked. It was her love for me. She tried to see more of people because she saw all of me.\nAfter the holo display, the bottom of the urn lid slid loose with a forceful scratching ceramic sound. It reminded me of the grinding groan of a sarcophagus in an ancient tomb being pulled open by archeologists, stone against stone, with the anticipatory hush that accompanied the near revelation of the invaluable contents within. I held my breath. Underneath the urn lid was a panel.\nAh, so there it is, the puzzle coming together, the mystery unfurling. I had thought the holos was it, but no, my mom was full of layers, just like this urn.\nI was still reeling from the projected affection, all those images of me and my mom surging back to life. I was in such a daze, sad and giddy at once, I nearly dropped the urn lid. My hand was quicker than my mind. I caught the lid in my fingers. It was so light, like an illusion of matter.\nI breathed out a sigh of relief.\nI reached into the compartment in the lid and felt . . . a crinkly package of eco-cell wrap. Its scratchy texture surprised me. When I popped the wrapping, a fortune cookie fell into my palm. I cracked that open, letting the crumbs scatter over my hands and sleeves. I put the cracked cookie in my pocket.\nInside was a slip of paper. I had it in my fingers for a while, feeling along its ridges, tears clouding my eyes, until I received a shock of searing pain and in my blurred vision saw a drop of red. I must’ve gotten a paper cut from it. I sucked on my acrid blood.\nThere was no further higher tech, no holographs or flashes, generated by my touch. I took a sleeve to my eyes, wiped my vision clear, and read. The writing was tiny and in a meticulous script. It was mom’s own calligraphic handwriting. It was a conglomeration of various languages I knew that I never knew she had even tried learning. The mishmash of different tongues made the writing even more poetic, just looking at it appealed to me in a jarring way. It was an eclectic but strangely entrancing work of visual art.\nI tried to piece the significance together the best I could and came up with this interpretation:\n“You are my best fortune. The one written inside of me and coming into this life with a crack of delight. But, now you are in the world, paving your way—with your own slips of paper.\n“In particular branches, back in the day, you will find your thoughts come alight. There you will find an instrument, a stylus, for which you can compose your future—under the brilliant light of a thousand red lanterns.”\nI thought this was the end of the scavenger hunt. That my adventure was over. But, of course, this was mom and she would bring me back to where we started. To the flame tree.\nI already anticipated what I would find there. Some of her most prized possessions. Styluses, she called them. Scrawling in beauty.\nHer makeup brushes, to take over the small cosmetics empire she built for herself.\nBut, as I reviewed the holos in my head and all the ways she cared for me, I thought, no, it could not be. It couldn’t be the cosmetic brushes.\nIt had to be a simple maobi.\nIt had to be the ink brush she used to write this fortune of language patchwork. I recalled that she had seen me use my zex-quill and complained on multiple occasions about its complexity, its removal of touch to its canvas. Caress in application is important, she said. Like spreading foundation on cheeks.\nMaybe she really did want me to forge my own path, write my own future. Even at this grave moment, I marveled at how my mom still wanted to engage with me, leaving me puzzled, in wonder.\nI grazed my hand over the inlay draymetal that I had bent, where I had manipulated the shape with my fingers. I was convinced that she knew me, and it would be a maobi, not a dictation of her path for me, but as she said, a means of composition. Words that I would write, a fortune I would create. I was so assured about this, I could see the brush there in my head, lodged between the bark. Maybe it would even be the one she alleged existed, made of my very own baby hair, from my first haircut. 胎毛笔. Taimaobi. The softest of brushes, she had once teased, ruffling my bangs. I never saw it. I always thought it was a joke.\nI felt it in my bones. It had to be a writing tool for undefined creation. Only a trip back would confirm or deny my conviction.\nI bit into the broken fortune cookie. It was as delightful as ever. Crisp and with a lively pomelo taste that danced on my tongue.\nI crunched, taking small bites, until the cookie was gone. I brushed off my hands, grains of the confection sprinkling onto the urn lid. I replaced the lid and lifted the urn up in its entirety. It dazzled in the ambient lunar light of three crescent moons.\nI tuned it one final time and ubertaped a dried macolan flower over the tuning hole, next to the signatures of the craft’s artisans. Her name was there, too. I had engraved it there, in many versions, translating Yongli, “Forever Beautiful” into multiple languages. I lowered her urn into the ground, her voice still buzzing in my ears.\nThe holos faded, but they lay entrenched, engraved, in my memories—just as she lay to rest in her grave.\nFrom there, I had my own puzzle to solve, what my future lay for me—what words I should write in my own script on my own slivers of prognosis. I would take the maobi she left for me, the one I was so sure of, and stain my own path with pressed ink.\nI brushed myself off, took a look at her grave site, and set out toward the moonlight. Humming a Teresa Teng ballad I remixed and improvised, I hailed a ship. This time, I would take my time.\nIn loving memory of my mom.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation.", "source": "https://clarkesworldmagazine.com/spires_10_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Last Wishes by D.A. Xiaolin Spires"}