{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Daniel Abraham", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5DklcIPXodkSVb8x4EcoIMG2iQs=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: What Are You Doing Here?  One of my favorite movies of all time is 2007’s The Lookout. It’s a gorgeous, twisty little noir that manages to co-opt all the expectations of the genre and do something just a little different with all of them. In particular, there’s a scene where Jeff Daniels’ blind protector-figure Lewis sits down with love interest Luvlee played by Isla Fisher. He tells her the story of how he lost his sight, and ties his experience back into hers with a simple, telling question: What are you doing here?  When I was starting out as a professional writer, with a few stories here and there and working on a novel that might be publishable, I spent a lot of time talking to people who were further along in the business than I was. I asked one question of accomplished writers—“What is your ambition?” It was my own way of phrasing the idea “what are you doing here?” The answers I got never quite satisfied me.  Some folks wanted to win awards, some wanted to be taught a part of the modern literary canon, some wanted to be New York Times bestsellers. They told me about some things that people thought would be cool, things that would be genuinely gratifying to the ego. Maybe that was what they heard when I asked the question. Looking back, I don’t think that was what I meant, but it’s possible the question I was trying to ask doesn’t fit so well into casual conversation.  Anyone who dedicates a large chunk of their life to the pursuit of a massive and at least partly self-defined project—writing novels, dog agility, martial arts, building robots in the garage, programming, whatever—has something very interesting happening to them.  Often, when we don’t make money from them, we call these hobbies, but I have to say I really dislike that word. It has too many nuances of frivolity and fecklessness. I prefer fetishist. It’s also inaccurate, but it captures the idea of excitement and obsession and transgression in a way that seems more nearly true.  In a culture that is most comfortable defining us—you and me and all the rest—in terms of workers and consumers, the idea of someone throwing a deep passion into something that doesn’t make them money, passively entertain them, or get them laid is a little dangerous. It questions things that we don’t always feel comfortable questioning. Like, what’s the point of being alive? How am I different from the people around me, and do I have the courage to celebrate that, knowing that, to some degree of another, I will be punished for it?  Writers—even dedicated unpublished writers—can spend thousands of hours of their lives working with a craft that pays poorly and inconsistently for the chance to have their efforts casually dismissed by anyone with a Goodreads account. Most writers don’t make a living at it. Most books fail in the marketplace. By any rational standard, what we do is a terrible, terrible idea. Or consider cosplayers who can spend weeks and a fair amount of money on costumes for which they will not receive any professional or monetary credit. Or civil war reenactors who will actually go out in period-style wool uniforms in the heat of summer and man the walls of old forts and sleep in the encampments of the 1800s.  All of us are doing something that exists outside the realm of getting a good job and consuming things that entertain us or raise our social status. And the word “love” comes up a lot when we talk about these little enthusiasms. So you see why I reach for “fetish” over “hobby.” When I asked what people’s ambitions were, I was reaching for that question. What are we getting out of this? What desires to these things feed?  That’s why my first formulation—“What is your Ambition?”—was a bad one. I actually meant: “What are you doing here?” They heard: “What do you want?” That’s also a fair question, but it isn’t what I was looking for. The confusion’s pretty easy to track. They thought I was asking about goals, and “goal” sounds a lot like “end point.”  One of the interesting things I’ve found about writing stories is that a lot of times I won’t really understand what the story is about until I get to the end. My instinct is that these projects of ours are similar. Only with stories, there’s another step. I can edit stories. Fix them. Change their shapes to match the meaning that I found only at the end.  I don’t get to do that with my life. You don’t either. First drafts are what we are. And so, I hoped people would tell me what the end was they imagined their project was working toward. The fact that someone who wins a Hugo or the Booker or the Nobel doesn’t then stop working means that wasn’t the goal. They had some other ambition, because the drive didn’t stop. Likewise a cosplayer who has fashioned the perfect Duela Dent outfit doesn’t, I think, feel a sense of relief at never having to make another costume again. The best we could do, I thought, was define what would actually complete our work.  It was a failure of imagination on my part to think that all projects are moving toward completion.  And still, there were things I learned by asking the wrong questions, because the things we think—mistakenly—will satisfy us and tell us something about what our projects are, who we care about, and which fetish precisely we’re cultivating. And, more to the point, which ones we aren’t.  When I was in high school, I was very active in the theater program. I acted, I worked tech, and I volunteered at the local community theater. The important lesson—the one I still carry with me—came very early in that process. I must have been a freshman. I don’t remember the name of the woman who was running the program then, but the play we were working on was called “Her Infinite Variety”. It was basically a Shakespeare clips show with scenes from a bunch of different plays, all focusing on women. I’d gotten the role of Enobarbus from Antony and Cleopatra and all the interstitial bits bridging one scene from another. The only other male in the cast was Chad Thomas playing Petruchio against a Kate by a Stephanie . . . whose last name I can never recall, but she was Nellie’s friend and I liked her. It was not, you could say, the zenith of all high school theater productions. We were very young and greener than grass and uncomfortable in our skins and in ourselves. I have exactly two memories from the play.  One of them is being on stage trying not to cough while Chad and Stephanie were the center of attention. The other was one of the most important insights I had in that period of my life.  We were at rehearsal in the auditorium. The stage was wood and painted black. There was no one there but us, mumbling our Shakespeare and trying to make our gestures small and unobtrusive. If self-consciousness had mass, we’d have been a singularity. The director despaired. At the end of the hour, she called us all up the edge of the stage and said, “You’re up here to be seen. You’re up here to be heard.” And I understood. To this day, I have no fear of speaking in public. When I’m in front of a class or a room full of people, I know what I’m doing. I’m there to be seen and heard.  In college, I realized—with some help from a plain-spoken advisor—that theater wasn’t actually the project to which I wanted to dedicate my time and energy.  It was writing.  And for a long time, I went looking for something similar. That I didn’t quite know is probably why I spent so much time asking other people. Here I was, spending hours on the work and money on the postage. I knew I was there for something, but I couldn’t articulate what it was.  I don’t have a penny-drop moment for this. There wasn’t a bolt from the blue that made it all clear. Instead, it’s been a long, slow accretion of opinions, a process of trial and error. But here’s what I’ve come to—This is my ambition: I want to write stories that are hard to put down, that linger in memory, and that can be enjoyed by people who aren’t just like me.  That sounds simple. It isn’t. In all the professional writers I asked in all the years I posed the question, no one—not one—said that. They all answered with awards or sales figures or whatever happened to be the tower on their horizon at the time.  Goals, it seems to me, are like signposts. Ambitions are more like directions. The difference between them is like answering the question Where are you going? with New York or else East, east, farther and farther and always east. Goals, once reached, lose their power. I know that. I’ve reached a lot of mine, and they lose their shine as soon as you have them. They’re good for setting a direction for a while, but once you’re there, they aren’t useful anymore. Ambition never wears out.  So, artists and makers and cosplayers and dog agility enthusiasts and composers, I was wondering. What are you doing here?  Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "text": "Non-Fiction\nAnother Word: What Are You Doing Here?\nOne of my favorite movies of all time is 2007’s The Lookout. It’s a gorgeous, twisty little noir that manages to co-opt all the expectations of the genre and do something just a little different with all of them. In particular, there’s a scene where Jeff Daniels’ blind protector-figure Lewis sits down with love interest Luvlee played by Isla Fisher. He tells her the story of how he lost his sight, and ties his experience back into hers with a simple, telling question: What are you doing here?\nWhen I was starting out as a professional writer, with a few stories here and there and working on a novel that might be publishable, I spent a lot of time talking to people who were further along in the business than I was. I asked one question of accomplished writers—“What is your ambition?” It was my own way of phrasing the idea “what are you doing here?” The answers I got never quite satisfied me.\nSome folks wanted to win awards, some wanted to be taught a part of the modern literary canon, some wanted to be New York Times bestsellers. They told me about some things that people thought would be cool, things that would be genuinely gratifying to the ego. Maybe that was what they heard when I asked the question. Looking back, I don’t think that was what I meant, but it’s possible the question I was trying to ask doesn’t fit so well into casual conversation.\nAnyone who dedicates a large chunk of their life to the pursuit of a massive and at least partly self-defined project—writing novels, dog agility, martial arts, building robots in the garage, programming, whatever—has something very interesting happening to them.\nOften, when we don’t make money from them, we call these hobbies, but I have to say I really dislike that word. It has too many nuances of frivolity and fecklessness. I prefer fetishist. It’s also inaccurate, but it captures the idea of excitement and obsession and transgression in a way that seems more nearly true.\nIn a culture that is most comfortable defining us—you and me and all the rest—in terms of workers and consumers, the idea of someone throwing a deep passion into something that doesn’t make them money, passively entertain them, or get them laid is a little dangerous. It questions things that we don’t always feel comfortable questioning. Like, what’s the point of being alive? How am I different from the people around me, and do I have the courage to celebrate that, knowing that, to some degree of another, I will be punished for it?\nWriters—even dedicated unpublished writers—can spend thousands of hours of their lives working with a craft that pays poorly and inconsistently for the chance to have their efforts casually dismissed by anyone with a Goodreads account. Most writers don’t make a living at it. Most books fail in the marketplace. By any rational standard, what we do is a terrible, terrible idea. Or consider cosplayers who can spend weeks and a fair amount of money on costumes for which they will not receive any professional or monetary credit. Or civil war reenactors who will actually go out in period-style wool uniforms in the heat of summer and man the walls of old forts and sleep in the encampments of the 1800s.\nAll of us are doing something that exists outside the realm of getting a good job and consuming things that entertain us or raise our social status. And the word “love” comes up a lot when we talk about these little enthusiasms. So you see why I reach for “fetish” over “hobby.” When I asked what people’s ambitions were, I was reaching for that question. What are we getting out of this? What desires to these things feed?\nThat’s why my first formulation—“What is your Ambition?”—was a bad one. I actually meant: “What are you doing here?” They heard: “What do you want?” That’s also a fair question, but it isn’t what I was looking for. The confusion’s pretty easy to track. They thought I was asking about goals, and “goal” sounds a lot like “end point.”\nOne of the interesting things I’ve found about writing stories is that a lot of times I won’t really understand what the story is about until I get to the end. My instinct is that these projects of ours are similar. Only with stories, there’s another step. I can edit stories. Fix them. Change their shapes to match the meaning that I found only at the end.\nI don’t get to do that with my life. You don’t either. First drafts are what we are. And so, I hoped people would tell me what the end was they imagined their project was working toward. The fact that someone who wins a Hugo or the Booker or the Nobel doesn’t then stop working means that wasn’t the goal. They had some other ambition, because the drive didn’t stop. Likewise a cosplayer who has fashioned the perfect Duela Dent outfit doesn’t, I think, feel a sense of relief at never having to make another costume again. The best we could do, I thought, was define what would actually complete our work.\nIt was a failure of imagination on my part to think that all projects are moving toward completion.\nAnd still, there were things I learned by asking the wrong questions, because the things we think—mistakenly—will satisfy us and tell us something about what our projects are, who we care about, and which fetish precisely we’re cultivating. And, more to the point, which ones we aren’t.\nWhen I was in high school, I was very active in the theater program. I acted, I worked tech, and I volunteered at the local community theater. The important lesson—the one I still carry with me—came very early in that process. I must have been a freshman. I don’t remember the name of the woman who was running the program then, but the play we were working on was called “Her Infinite Variety”. It was basically a Shakespeare clips show with scenes from a bunch of different plays, all focusing on women. I’d gotten the role of Enobarbus from Antony and Cleopatra and all the interstitial bits bridging one scene from another. The only other male in the cast was Chad Thomas playing Petruchio against a Kate by a Stephanie . . . whose last name I can never recall, but she was Nellie’s friend and I liked her. It was not, you could say, the zenith of all high school theater productions. We were very young and greener than grass and uncomfortable in our skins and in ourselves. I have exactly two memories from the play.\nOne of them is being on stage trying not to cough while Chad and Stephanie were the center of attention. The other was one of the most important insights I had in that period of my life.\nWe were at rehearsal in the auditorium. The stage was wood and painted black. There was no one there but us, mumbling our Shakespeare and trying to make our gestures small and unobtrusive. If self-consciousness had mass, we’d have been a singularity. The director despaired. At the end of the hour, she called us all up the edge of the stage and said, “You’re up here to be seen. You’re up here to be heard.” And I understood. To this day, I have no fear of speaking in public. When I’m in front of a class or a room full of people, I know what I’m doing. I’m there to be seen and heard.\nIn college, I realized—with some help from a plain-spoken advisor—that theater wasn’t actually the project to which I wanted to dedicate my time and energy.\nIt was writing.\nAnd for a long time, I went looking for something similar. That I didn’t quite know is probably why I spent so much time asking other people. Here I was, spending hours on the work and money on the postage. I knew I was there for something, but I couldn’t articulate what it was.\nI don’t have a penny-drop moment for this. There wasn’t a bolt from the blue that made it all clear. Instead, it’s been a long, slow accretion of opinions, a process of trial and error. But here’s what I’ve come to—This is my ambition: I want to write stories that are hard to put down, that linger in memory, and that can be enjoyed by people who aren’t just like me.\nThat sounds simple. It isn’t. In all the professional writers I asked in all the years I posed the question, no one—not one—said that. They all answered with awards or sales figures or whatever happened to be the tower on their horizon at the time.\nGoals, it seems to me, are like signposts. Ambitions are more like directions. The difference between them is like answering the question Where are you going? with New York or else East, east, farther and farther and always east. Goals, once reached, lose their power. I know that. I’ve reached a lot of mine, and they lose their shine as soon as you have them. They’re good for setting a direction for a while, but once you’re there, they aren’t useful anymore. Ambition never wears out.\nSo, artists and makers and cosplayers and dog agility enthusiasts and composers, I was wondering. What are you doing here?\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "source": "https://clarkesworldmagazine.com/another_word_10_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: What Are You Doing Here? by Daniel Abraham"}