{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nathaniel Tapley", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "RNE43Q8XHACCwgYfbrnP4ufbieg=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Tea, Robot?  Since the Martians first landed in Guildford, fellows with small mustaches and large empires have been defending the Earth. Nathaniel Tapley explores the enduring appeal of the honest, English chap in science fiction and fantasy.  He comes as Death From The Sky. He lays waste to civilizations and he has brought down empires. He treats all of time and space as his plaything, and tyrants tremble at the arrival of his royal blue box. He also likes Jammie Dodgers and a nice cup of tea, whether Earl Grey or Arcturan.  The Doctor (from the BBC’s Doctor Who) is just one of the more recent examples of an enduring archetype in fantastic fiction: the buttoned-up, thoroughly respectable, resourceful, middle-class English—or occasionally Scottish; never Welsh—chap. In a world where our thrills have got bigger and brasher, where many of the values of Victorian and Edwardian society have melted away, we still see the appeal of that ordinary man, usually a teacher or a doctor, thrust into incredible circumstances; just as we have for 140 years.  A Lieutenant Colonel in the Bengal Engineers in 1871, George Tomkyns Chesney feared that Britons were getting soft. He had watched as the Franco-Prussian War demonstrated the speed and efficiency of the Prussian military, and it had made him uneasy. He felt that Britain was in danger of losing its pre-eminent position in the world and was determined to write a novel to wake his country up to the danger it faced. That book was The Battle of Dorking (1871), which told the story of a Prussian invasion. Looking back from 50 years in the future, we readers see the complete and total defeat of the British Empire. The British lost because they were complacent and unprepared.  The book is usually seen as one of the first examples of ’invasion literature’, in which the author’s home country is conquered by a much better prepared enemy. It was a precursor of science fiction, and alternative histories and it introduced one very important concept: that the battles of the future of Britain would be fought in and by the Home Counties of England1.  Early science fiction had lots of middle-class protagonists, in part, because that’s what nineteenth-century scientists were. The world had moved on from the aristocratic, Gothic mad scientists like Victor von Frankenstein. As the nineteenth century drew on, science became a profession rather than a intellectual game for the wealthy and leisured. This, unsurprisingly, was reflected in the science fiction that was being written, which often featured respectable professional men beset by extraordinary difficulties.  Dr Jeckyll was one of these. As a practicing doctor struggling to maintain a respectable life, he forms one of the early examples of the archetype, and one that almost destroys it at birth. Stevenson uses his protagonist to explore exactly what it means to be reserved, to be accepted by society, to be normal. In Jeckyll, Stevenson blows the type up, examining it from the inside and the underside, personifying its cant and its limitations with Mr Hyde. Notably, Stevenson’s Scottish hero is fighting an internal enemy. For the true, decent English chap, with whom we will all become so familiar over the next century and a bit, the enemy is always external.  It is tempting to use the word ’gentleman’ to describe the sorts of characters we are talking about, but, technically, they aren’t ’gentlemen’, at least not in the nineteenth century sense of the word. As Clive Bloom says in his Introduction to the Raffles stories: “To be wealthy without visible means of support, this is to be a true gentleman”. The type that has become so influential since Dr Kemp outwitted The Invisible Man in 1896 has not come from the moneyed classes. This is, perhaps, largely down to H.G. Wells.  As one of the most important early writers of science fiction in English, Wells had a huge impact on the nascent genre, and he left his mark on it for many years to come. Wells, however, did not have many advantages in life. His father ran a small shop and his mother worked in service. At the age of 14 he became a draper’s apprentice, working 13-hour days.2 Eventually he was able to return to school and become a teacher, but his heroes remained resolutely middle-class.  In The Invisible Man (1895) we are presented with Dr Kemp, an aspiring scientist, yet to earn his entry to the Royal Society. His University College compatriot, Griffin, has murdered his father, stolen his money, turned himself invisible and gone insane. The Island Of Dr Moreau (1896) pits Edward Prendick (a solid English name) against Dr Moreau (stuffed with effeminate, Frenchified vowels) who, again, is free from financial worries. In Wells’ stories, the independently wealthy are those with time to indulge a hobby until it leads to madness.  Wells places his heroes firmly in the aspirant middle-class, the world of junior doctors, school teachers, newspapermen, and, in Tono-Bungay (1909), small business men. Wells makes it clear that his protagonists are not gentlemen, they are not gentry, never more clearly than in Tono-Bungay: “Nothing can make an aristocrat but pride, training, and the sword.”  Wells, then, provides the model for much of what was to follow. Englishmen: middle-class, probably based in Surrey or somewhere in suburban London, decent, modest, hard-working, initially unremarkable, but capable of saving the planet.  Junior newspaperman Edward Malone was the next great example of the species. In Arthur Conan Doyle’s Challenger stories he provided a note of the ordinary amongst the huge characters of Challenger and Summerlee. In story after story, from The Lost World (1912) through The Land Of Mist (1926), Malone’s desire to live a quiet life with his sweetheart is thwarted as he has to fight, variously, dinosaurs, poison space gases, and the spirits of the recently deceased.  One morning, when he goes exploring on a dinosaur-filled plateau on his own just for the sake of it, Malone explains: “I am too imaginative to be a really courageous man, but that I have an overpowering fear of seeming afraid. This was the power which now carried me onwards.” This nicely summarizes the motivations of the English chap: his bravery is born of necessity, circumstance, and the desire to avenge himself against pterodactyls. Oh, and embarrassment. Like someone who has been misheard when introducing themselves at a party and who then has to answer to the wrong name for the remainder of the night out of politeness, the great emotions for the middle-class Englishman are fear of seeming rude, fear of seeming cowardly, and fear of accidentally turning into a Bolshevik.  The sort of Englishman we’re talking about does have an important counterpart, however; one who is leisured, wealthy, showy, and has all sorts of unfortunate Continental habits. The dandy, cad, or bounder is also a Victorian or Edwardian gentleman (usually in the aristocratic sense of the word), who doesn’t have the diffidence of our chap. This archetype is perhaps best exemplified by Raffles, the gentleman thief in E.W. Hornung’s stories, a riposte to his brother-in-law’s Sherlock Holmes tales. Raffles states his moral position thus: “Why should I work when I can steal?”  Neither Holmes nor Raffles is modest. In some Holmes stories Watson does imply that they don’t have enough money, and that their affairs are in disorder, but Holmes has too many etiolated habits, too many affectations, and far too sensitive an ear for music to ever really be an English Englishman. He and Raffles spend their time mingling with high society. They might be heroes, but their virtues are a mystery to their companions, who much better fit the archetype we’re examining. Watson and Bunny, a junior doctor and an aspiring journalist respectively, are the solid, English conscience to the amoral Holmes and Raffles.  Moving further into the 20th century, our Englishman remains a hero, but he becomes one who is not necessarily capable of saving the world. Like Evelyn Waugh’s protagonists, the heroes of 1984 (1949) and Brave New World (1932) are certainly buffeted by the universe, but find themselves less able to conquer it armed with nothing more than a tweed jacket, a bristly mustache and a keen sense of fair play. The universe, and the progress of humanity, weigh heavily on these men. Although they often represent the last, best hope of mankind, they cannot overcome the mass of the future, pressing down on their shoulders.  Huxley’s Bernard Marx, and Orwell’s Winston Smith are men who would like to calmly get on with their lives, but feel that there is something desperately wrong with the world. Their struggles with totalitarian systems break them in the end. As the World Controller tells Bernard: “You’ve got to choose happiness or high art.” For those whose consciences or clarity of vision will not allow them to choose happiness, the science fiction of the 1930s and 40s is not a happy place.  Theo Faron, from both the novel (1992) and the film (2006) of Children of Men, is a more recent example of the Englishman adrift in a dystopia. Despite their differences—in the book Faron is an Oxford don, in the film a bureaucrat—both characters fit the archetype we have been discussing. It shines through in two very different stories. The distinction that can be made here is that in neither adaptation does the state win. The world feels like that of the totalitarian, dystopian SF of the middle of the twentieth century, but in this case, the Englishman wins, he overcomes all of the tendrils of the state (and, in the book, actually takes control of it).  During the 1950s and 1960s John Wyndham wrote a series of novels in which the English hero is beset by world-changing events. He usually struggles against these with the best of a stiff upper lip, muttering things like, “Wifely confidence is a very nice trait, darling, but—No, damn it, no buts—I am going to bring you back,” even when the world is being consumed by carnivorous, mobile plants. In The Day of The Triffids (1951), The Kraken Wakes (1953), and The Trouble With Lichen (1960) the forces that beset the world are all too vast to be overcome. Even in The Midwich Cuckoos (1957) Zellaby has to sacrifice himself to finally kill the aliens, as bombs, tanks, guns, radiation and all manner of modern technology have failed to dislodge them from the community of Midwich.  If anything, Wyndham’s stories show the importance of remaining English in times of great crisis. They almost all show the complete breakdown of society, and how the best, and sometimes only, way to deal with it is to remain stoic, keep a stiff upper lip and just get on with the job of defeating those blasted aliens, or living with them. No point in moaning about the planet’s having been overrun by submarine creatures who melted the icecaps and drowned most of the world. Even in the post-apocalyptic world of The Chrysalids (1955), the most admirable characters are those who act like decent, middle-class English people from the middle of the twentieth century.  The 1960s, of course, provided the televisual high point for the English chap in the shape of John Steed from The Avengers and the Doctor from Doctor Who. Although both of these characters had their eccentricities, they were cut from the same stuff as the heroes of Wells and Wyndham.  Adam Adamant, from Adam Adamant Lives, however, is another example of the dandy. Dropped from Edwardian London into the Swinging 60s, he did battle with evil doers armed with his sword stick. He was much more in the vein of Holmes and Raffles. And, indeed, much of today’s steampunk vision of the late Victorian era seems to celebrate this more dandyish, foppish, gentleman-of-leisure style rather than the stolid English heroes of much of early SF.  Perhaps the best example of the character in modern times has been Arthur Dent. In Douglas Adams’ The Hitchiker’s Guide To The Galaxy we see the archetype stretched almost to breaking point. He is suburban, diffident, enthusiastic about tea, polite, and he travels the universe. Wearing nothing more than pajamas and a dressing gown, he has more adventures than any of the rest of the human race, and maintains a low level of polite outrage throughout.  The comic possibilities of putting this kind of character in a fantastic context were often explored in the 1970s and 80s. Our chaps were in Jabberwocky (1977), Time Bandits (John Cleese’s Robin Hood character, although just a cameo) (1981), Brazil (1985), in the Discworld novels of Terry Pratchett (with both Rincewind and Captain Vimes offering very different takes on the character type), and in the work of Neil Gaiman. The reluctant English hero was at the center of a whole swathe of fantasy at the time.  At the end of the 1980s, a new version of the archetype arrived, and took control of perhaps the most famous ship in SF. Captain Jean-Luc Picard from Star Trek: The Next Generation. In stark contrast to the original series’ Captain Kirk, Picard was almost adamantly opposed to conflict. He was cerebral, considered, clever, and inherently peaceful. Patrick Stewart has said that when developing the character he often thought of Horatio Hornblower, hero of a series of historical novels by C.S. Forester, and a perfectly English hero.  Today we see the character’s influence in films like Shaun Of The Dead (2004), and in games like the Professor Layton series. The current incarnation of the Doctor is perhaps the most tweedy for some time, and the most reminiscent of the archetype since Peter Davison explained that tea was “a noxious infusion of oriental leaves containing a high percentage of toxic acid . . . Personally, I rather like it.”  Although the universe may be full of giant, marauding transforming robots, or costumed heroes with ever-more spectacular superpowers, we can take comfort in the fact that there will always be an England, even if it is floating through space on the back of a harpooned space whale. As long as there is, there will be reluctant, suburban heroes, forced to abandon their quiet lives to save the lot of us.  After all, somewhere in the universe, it’s always time for tea.  Footnotes:  1 - The Home Counties are generally defined as the counties bordering London: Berkshire, Buckinghamshire, Essex, Hampshire, Hertfordshire, Kent, Surrey, and the two Sussexes. Bedfordshire, Dorset, Oxfordshire and Cambridgeshire are sometimes also included.  Nathaniel Tapley is a comedy writer-performer, for programs like The News Quiz (BBC Radio 4), Tonightly (Channel 4), Gigglebiz (CBeebies) and Dick & Dom's Funny Business (BBC2). He wrote and directed the In The Gloaming podcasts, which were performed live at the World Horror Convention in 2010 and won a Parsec Award for Best New Podcaster. He has had stories published in Black Static and The Zombie Feed Volume 1, from Apex Publications.", "text": "Non-Fiction\nTea, Robot?\nSince the Martians first landed in Guildford, fellows with small mustaches and large empires have been defending the Earth. Nathaniel Tapley explores the enduring appeal of the honest, English chap in science fiction and fantasy.\nHe comes as Death From The Sky. He lays waste to civilizations and he has brought down empires. He treats all of time and space as his plaything, and tyrants tremble at the arrival of his royal blue box. He also likes Jammie Dodgers and a nice cup of tea, whether Earl Grey or Arcturan.\nThe Doctor (from the BBC’s Doctor Who) is just one of the more recent examples of an enduring archetype in fantastic fiction: the buttoned-up, thoroughly respectable, resourceful, middle-class English—or occasionally Scottish; never Welsh—chap. In a world where our thrills have got bigger and brasher, where many of the values of Victorian and Edwardian society have melted away, we still see the appeal of that ordinary man, usually a teacher or a doctor, thrust into incredible circumstances; just as we have for 140 years.\nA Lieutenant Colonel in the Bengal Engineers in 1871, George Tomkyns Chesney feared that Britons were getting soft. He had watched as the Franco-Prussian War demonstrated the speed and efficiency of the Prussian military, and it had made him uneasy. He felt that Britain was in danger of losing its pre-eminent position in the world and was determined to write a novel to wake his country up to the danger it faced. That book was The Battle of Dorking (1871), which told the story of a Prussian invasion. Looking back from 50 years in the future, we readers see the complete and total defeat of the British Empire. The British lost because they were complacent and unprepared.\nThe book is usually seen as one of the first examples of ’invasion literature’, in which the author’s home country is conquered by a much better prepared enemy. It was a precursor of science fiction, and alternative histories and it introduced one very important concept: that the battles of the future of Britain would be fought in and by the Home Counties of England1.\nEarly science fiction had lots of middle-class protagonists, in part, because that’s what nineteenth-century scientists were. The world had moved on from the aristocratic, Gothic mad scientists like Victor von Frankenstein. As the nineteenth century drew on, science became a profession rather than a intellectual game for the wealthy and leisured. This, unsurprisingly, was reflected in the science fiction that was being written, which often featured respectable professional men beset by extraordinary difficulties.\nDr Jeckyll was one of these. As a practicing doctor struggling to maintain a respectable life, he forms one of the early examples of the archetype, and one that almost destroys it at birth. Stevenson uses his protagonist to explore exactly what it means to be reserved, to be accepted by society, to be normal. In Jeckyll, Stevenson blows the type up, examining it from the inside and the underside, personifying its cant and its limitations with Mr Hyde. Notably, Stevenson’s Scottish hero is fighting an internal enemy. For the true, decent English chap, with whom we will all become so familiar over the next century and a bit, the enemy is always external.\nIt is tempting to use the word ’gentleman’ to describe the sorts of characters we are talking about, but, technically, they aren’t ’gentlemen’, at least not in the nineteenth century sense of the word. As Clive Bloom says in his Introduction to the Raffles stories: “To be wealthy without visible means of support, this is to be a true gentleman”. The type that has become so influential since Dr Kemp outwitted The Invisible Man in 1896 has not come from the moneyed classes. This is, perhaps, largely down to H.G. Wells.\nAs one of the most important early writers of science fiction in English, Wells had a huge impact on the nascent genre, and he left his mark on it for many years to come. Wells, however, did not have many advantages in life. His father ran a small shop and his mother worked in service. At the age of 14 he became a draper’s apprentice, working 13-hour days.2 Eventually he was able to return to school and become a teacher, but his heroes remained resolutely middle-class.\nIn The Invisible Man (1895) we are presented with Dr Kemp, an aspiring scientist, yet to earn his entry to the Royal Society. His University College compatriot, Griffin, has murdered his father, stolen his money, turned himself invisible and gone insane. The Island Of Dr Moreau (1896) pits Edward Prendick (a solid English name) against Dr Moreau (stuffed with effeminate, Frenchified vowels) who, again, is free from financial worries. In Wells’ stories, the independently wealthy are those with time to indulge a hobby until it leads to madness.\nWells places his heroes firmly in the aspirant middle-class, the world of junior doctors, school teachers, newspapermen, and, in Tono-Bungay (1909), small business men. Wells makes it clear that his protagonists are not gentlemen, they are not gentry, never more clearly than in Tono-Bungay: “Nothing can make an aristocrat but pride, training, and the sword.”\nWells, then, provides the model for much of what was to follow. Englishmen: middle-class, probably based in Surrey or somewhere in suburban London, decent, modest, hard-working, initially unremarkable, but capable of saving the planet.\nJunior newspaperman Edward Malone was the next great example of the species. In Arthur Conan Doyle’s Challenger stories he provided a note of the ordinary amongst the huge characters of Challenger and Summerlee. In story after story, from The Lost World (1912) through The Land Of Mist (1926), Malone’s desire to live a quiet life with his sweetheart is thwarted as he has to fight, variously, dinosaurs, poison space gases, and the spirits of the recently deceased.\nOne morning, when he goes exploring on a dinosaur-filled plateau on his own just for the sake of it, Malone explains: “I am too imaginative to be a really courageous man, but that I have an overpowering fear of seeming afraid. This was the power which now carried me onwards.” This nicely summarizes the motivations of the English chap: his bravery is born of necessity, circumstance, and the desire to avenge himself against pterodactyls. Oh, and embarrassment. Like someone who has been misheard when introducing themselves at a party and who then has to answer to the wrong name for the remainder of the night out of politeness, the great emotions for the middle-class Englishman are fear of seeming rude, fear of seeming cowardly, and fear of accidentally turning into a Bolshevik.\nThe sort of Englishman we’re talking about does have an important counterpart, however; one who is leisured, wealthy, showy, and has all sorts of unfortunate Continental habits. The dandy, cad, or bounder is also a Victorian or Edwardian gentleman (usually in the aristocratic sense of the word), who doesn’t have the diffidence of our chap. This archetype is perhaps best exemplified by Raffles, the gentleman thief in E.W. Hornung’s stories, a riposte to his brother-in-law’s Sherlock Holmes tales. Raffles states his moral position thus: “Why should I work when I can steal?”\nNeither Holmes nor Raffles is modest. In some Holmes stories Watson does imply that they don’t have enough money, and that their affairs are in disorder, but Holmes has too many etiolated habits, too many affectations, and far too sensitive an ear for music to ever really be an English Englishman. He and Raffles spend their time mingling with high society. They might be heroes, but their virtues are a mystery to their companions, who much better fit the archetype we’re examining. Watson and Bunny, a junior doctor and an aspiring journalist respectively, are the solid, English conscience to the amoral Holmes and Raffles.\nMoving further into the 20th century, our Englishman remains a hero, but he becomes one who is not necessarily capable of saving the world. Like Evelyn Waugh’s protagonists, the heroes of 1984 (1949) and Brave New World (1932) are certainly buffeted by the universe, but find themselves less able to conquer it armed with nothing more than a tweed jacket, a bristly mustache and a keen sense of fair play. The universe, and the progress of humanity, weigh heavily on these men. Although they often represent the last, best hope of mankind, they cannot overcome the mass of the future, pressing down on their shoulders.\nHuxley’s Bernard Marx, and Orwell’s Winston Smith are men who would like to calmly get on with their lives, but feel that there is something desperately wrong with the world. Their struggles with totalitarian systems break them in the end. As the World Controller tells Bernard: “You’ve got to choose happiness or high art.” For those whose consciences or clarity of vision will not allow them to choose happiness, the science fiction of the 1930s and 40s is not a happy place.\nTheo Faron, from both the novel (1992) and the film (2006) of Children of Men, is a more recent example of the Englishman adrift in a dystopia. Despite their differences—in the book Faron is an Oxford don, in the film a bureaucrat—both characters fit the archetype we have been discussing. It shines through in two very different stories. The distinction that can be made here is that in neither adaptation does the state win. The world feels like that of the totalitarian, dystopian SF of the middle of the twentieth century, but in this case, the Englishman wins, he overcomes all of the tendrils of the state (and, in the book, actually takes control of it).\nDuring the 1950s and 1960s John Wyndham wrote a series of novels in which the English hero is beset by world-changing events. He usually struggles against these with the best of a stiff upper lip, muttering things like, “Wifely confidence is a very nice trait, darling, but—No, damn it, no buts—I am going to bring you back,” even when the world is being consumed by carnivorous, mobile plants. In The Day of The Triffids (1951), The Kraken Wakes (1953), and The Trouble With Lichen (1960) the forces that beset the world are all too vast to be overcome. Even in The Midwich Cuckoos (1957) Zellaby has to sacrifice himself to finally kill the aliens, as bombs, tanks, guns, radiation and all manner of modern technology have failed to dislodge them from the community of Midwich.\nIf anything, Wyndham’s stories show the importance of remaining English in times of great crisis. They almost all show the complete breakdown of society, and how the best, and sometimes only, way to deal with it is to remain stoic, keep a stiff upper lip and just get on with the job of defeating those blasted aliens, or living with them. No point in moaning about the planet’s having been overrun by submarine creatures who melted the icecaps and drowned most of the world. Even in the post-apocalyptic world of The Chrysalids (1955), the most admirable characters are those who act like decent, middle-class English people from the middle of the twentieth century.\nThe 1960s, of course, provided the televisual high point for the English chap in the shape of John Steed from The Avengers and the Doctor from Doctor Who. Although both of these characters had their eccentricities, they were cut from the same stuff as the heroes of Wells and Wyndham.\nAdam Adamant, from Adam Adamant Lives, however, is another example of the dandy. Dropped from Edwardian London into the Swinging 60s, he did battle with evil doers armed with his sword stick. He was much more in the vein of Holmes and Raffles. And, indeed, much of today’s steampunk vision of the late Victorian era seems to celebrate this more dandyish, foppish, gentleman-of-leisure style rather than the stolid English heroes of much of early SF.\nPerhaps the best example of the character in modern times has been Arthur Dent. In Douglas Adams’ The Hitchiker’s Guide To The Galaxy we see the archetype stretched almost to breaking point. He is suburban, diffident, enthusiastic about tea, polite, and he travels the universe. Wearing nothing more than pajamas and a dressing gown, he has more adventures than any of the rest of the human race, and maintains a low level of polite outrage throughout.\nThe comic possibilities of putting this kind of character in a fantastic context were often explored in the 1970s and 80s. Our chaps were in Jabberwocky (1977), Time Bandits (John Cleese’s Robin Hood character, although just a cameo) (1981), Brazil (1985), in the Discworld novels of Terry Pratchett (with both Rincewind and Captain Vimes offering very different takes on the character type), and in the work of Neil Gaiman. The reluctant English hero was at the center of a whole swathe of fantasy at the time.\nAt the end of the 1980s, a new version of the archetype arrived, and took control of perhaps the most famous ship in SF. Captain Jean-Luc Picard from Star Trek: The Next Generation. In stark contrast to the original series’ Captain Kirk, Picard was almost adamantly opposed to conflict. He was cerebral, considered, clever, and inherently peaceful. Patrick Stewart has said that when developing the character he often thought of Horatio Hornblower, hero of a series of historical novels by C.S. Forester, and a perfectly English hero.\nToday we see the character’s influence in films like Shaun Of The Dead (2004), and in games like the Professor Layton series. The current incarnation of the Doctor is perhaps the most tweedy for some time, and the most reminiscent of the archetype since Peter Davison explained that tea was “a noxious infusion of oriental leaves containing a high percentage of toxic acid . . . Personally, I rather like it.”\nAlthough the universe may be full of giant, marauding transforming robots, or costumed heroes with ever-more spectacular superpowers, we can take comfort in the fact that there will always be an England, even if it is floating through space on the back of a harpooned space whale. As long as there is, there will be reluctant, suburban heroes, forced to abandon their quiet lives to save the lot of us.\nAfter all, somewhere in the universe, it’s always time for tea.\nFootnotes:\n1 - The Home Counties are generally defined as the counties bordering London: Berkshire, Buckinghamshire, Essex, Hampshire, Hertfordshire, Kent, Surrey, and the two Sussexes. Bedfordshire, Dorset, Oxfordshire and Cambridgeshire are sometimes also included.\nNathaniel Tapley is a comedy writer-performer, for programs like The News Quiz (BBC Radio 4), Tonightly (Channel 4), Gigglebiz (CBeebies) and Dick & Dom's Funny Business (BBC2). He wrote and directed the In The Gloaming podcasts, which were performed live at the World Horror Convention in 2010 and won a Parsec Award for Best New Podcaster. He has had stories published in Black Static and The Zombie Feed Volume 1, from Apex Publications.", "source": "https://clarkesworldmagazine.com/tapley_11_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tea, Robot? by Nathaniel Tapley"}