{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lev AC Rosen", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "NjWF8unjq0HlA8SWC1PLrgO+Xgk=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: It Gets Better with SFF (but SFF has to Get Better, too)  When I was a kid, I read anything with a wizard on the cover. I was one of those nerdy children who took books to recess and preferred novels for adults when I was eleven.  I’m guessing you know the type. Or are the type. My parents encouraged this and bought me whatever books I wanted. It was pretty awesome. It also shouldn’t be particularly surprising that the first place I was really made aware of queer people was in fiction.  I knew what gay people were, of course. I’d heard other kids in the lunchroom making homophobic comments, so I understood the basic concept, as it were. But the truth is, I was still pretty far away from anything involving sex. Just didn’t think much about it. In the books I read, I understood what was going on when the wizard and the lady got naked. It just wasn’t that interesting. I wanted to see magic of a more literal nature.  That is, until I read the Mercedes Lackey’s The Last Herald-Mage. Like many fantasy series, it’s populated with wizards and bards. Only the main character is a gay man.  I wish I could remember more of my reaction upon first reading it The Last Herald-Mage. I have only a fleeting memory: that it wasn’t a very big deal. I’m sure that’s because of Lackey’s treatment of the matter. I don’t want to say the series is about being gay; it’s more than that. It’s a fantasy epic, but Lackey approached her hero Vanyel Ashkevrons’s sexuality as though she were writing for readers who didn’t actually know any gay people. She showed us Vanyel’s sexuality and explained that it was natural and nothing to be ashamed of, even if Vanyel felt ashamed.  The Last Herald-Mage turned me from someone who had never thought about sexuality to someone who had no problem with the gay aspect of it. After all, if gay people could be wizards, they were just as awesome as everyone else, right?  My own coming out was pretty low-key. I grew up in New York City; I have liberal, loving parents; I went to a school that prided itself on ethical PC-ness; and I wasn’t the only queer kid in class. I didn’t struggle much. But I think back on Mercedes Lackey a lot—how I came across that book, and how it prepared me, during my tween years, to be okay with who I was once I started getting crushes on other guys.  I don’t remember how I found Lackey’s books. Were they given to me? Did I find them in the bookstore, saw that they had both bards and wizards, and simply wanted them on those merits? I wish I could remember. All I know is that I was damned lucky I found them. And I also know that if I hadn’t been brought up in a supportive environment, one series of books wouldn’t have been nearly enough.  But what about kids today? As the battle for queer rights has become more and more visible, these rights have also, in many respects, become more controversial. With the fight for gay marriage, the conservative fight against it, and the rash of tragic, queer teen suicides, it would seem as though queer characters would be popping up all over in SFF. After all, those geeky kids who get teased at school—whether they’re actually queer or just being called it—are the sorts of kids we were in high school. Or at least a lot of us. Marginalized, branded as outsiders, teased for being weird or different—and killing themselves because they’re queer. And to be queer, they’re told, is to be different.  Of all the people out there who didn’t grow up queer, you’d think straight geeks would be the most sympathetic—and the most understanding. Shouldn’t the SFF community be looking out for these kids?  Some within the community are. Malinda Lo has penned some amazing queer YA fantasy. Brit Mandelo writes an entire column on Tor.com called “Queering SFF” and has edited a new anthology called Beyond Binary: Genderqueer and Sexually Fluid Speculative Fiction. Cherie Priest featured a transgendered character in one of her Clockwork Century novels. There are queer SFF groups, like Geeks Out and Outer Alliance.  These examples stand out to me, though, because they’re few and far between and don’t get much notice. Even most romantic comedies today feature a stereotypical gay friend. It’s not the best representation, but at least we’re there. In SFF, we’re strangely invisible.  Failing to see queer characters in fiction doesn’t just damage queer kids. Parents read SFF, too. If queer kids have a parent who has never known a queer person in their life, they’ll be much more equipped for raising a queer child if they’ve read queer characters written as actual human beings—and not flat stereotypes or, worse, somehow wrong or immoral.  On the whole, the SFF community seems to me to be divided into three camps. First, the openly homophobic types, who for personal an/or religious reasons—or because they think it’s “evolutionarily backwards” (just like the other 200-plus species who practice homosexuality, right?)—feel queer people don’t deserve to be treated like actual human beings.  In the second camp we have the pro-queer types who love queer characters in their fiction and often are queer themselves.  The third camp, though, makes up the majority of the SFF community: folks who just don’t think about it. These are usually straight dudes who grew up pretty geeky, and who often are still mostly—and hopefully comfortably—geeky. But they just don’t give much thought to queer folks. If they did, they’d probably be cool with them; many probably consider themselves pro-gay rights.  But when it comes to their SFF, this third group finds it odd when there’s a gay character. Some say things like “I just can’t relate to a queer character, cause I’m straight,” but most seem surprised by the inclusion of queer characters. Some say they find the emphasis on sexuality to be heavy-handed—even when the emphasis on the queer character’s sexuality is equal to or less than the emphasis placed on the straight character’s sexuality. When a straight guy kisses a girl, it’s the norm; when a gay guy kisses a guy, it’s emphasizing their sexuality.  I don’t think people who hold this view are homophobes. They’re just used to their SFF being queer-free, and they feel startled by the inclusion of queer character. These are the folks I think are ready to open their minds. I don’t want them to be startled. Ideally, I don’t want them to think it’s any different than straight characters being included. For a start, though, I’d love to see them be happy to encounter queer characters. And I think they can be. They just need a little more prodding. And by prodding I mean more queer characters.  So the next time you read a book where there’s a heterosexual romantic pairing, don’t just accept it. Let that fact surprise you the way a queer romance might. Imagine how it makes that high-school kid feel, the one who still hasn’t found queer SFF. Think of how they look at every straight character in the books they read and are expected to relate to a straight character—but you, on the other hand, get surprised and kinda weirded out by one queer one. If they can relate, can’t you?  I’m not saying every story needs a queer character. Or that it’s a writer’s responsibility to do more than tell a great story. But I do think it’s time for all of us—straight folks included—to think more about where queer characters fit into SFF. And where we stand in that audience. A straight romantic lead is all well and good, but a queer romantic lead could make some teenager feel better about him or herself.  But we’re not going to get more queer characters without demanding them. Straight readers, we need your help—you should be asking for queer characters, too. You should be hoping for them. You should be happy about them, not surprised by them. Remember that we queer folks exist, and we exist in the world of SFF, too. That’s how you show us support; that’s how you take queer characters in SFF from invisible to natural.  We appreciate your support in politics. We love when you say you’re for gay marriage. But you can do more. After all, if you’re going to support us in the real world, you can support us in every world.  Lev AC Rosen is the author of the critically acclaimed All Men of Genius, which was an Amazon best of the month, on over a dozen best of the year lists, and has been nominated for multiple awards. He received his BA from Oberlin College and his MFA in Creative Writing from Sarah Lawrence College. Lev is originally from lower Manhattan and now lives in even lower Manhattan, right at the edge. He teaches creative writing. All Men of Genius will be available in paperback in November 2012.", "text": "Non-Fiction\nAnother Word: It Gets Better with SFF (but SFF has to Get Better, too)\nWhen I was a kid, I read anything with a wizard on the cover. I was one of those nerdy children who took books to recess and preferred novels for adults when I was eleven.\nI’m guessing you know the type. Or are the type. My parents encouraged this and bought me whatever books I wanted. It was pretty awesome. It also shouldn’t be particularly surprising that the first place I was really made aware of queer people was in fiction.\nI knew what gay people were, of course. I’d heard other kids in the lunchroom making homophobic comments, so I understood the basic concept, as it were. But the truth is, I was still pretty far away from anything involving sex. Just didn’t think much about it. In the books I read, I understood what was going on when the wizard and the lady got naked. It just wasn’t that interesting. I wanted to see magic of a more literal nature.\nThat is, until I read the Mercedes Lackey’s The Last Herald-Mage. Like many fantasy series, it’s populated with wizards and bards. Only the main character is a gay man.\nI wish I could remember more of my reaction upon first reading it The Last Herald-Mage. I have only a fleeting memory: that it wasn’t a very big deal. I’m sure that’s because of Lackey’s treatment of the matter. I don’t want to say the series is about being gay; it’s more than that. It’s a fantasy epic, but Lackey approached her hero Vanyel Ashkevrons’s sexuality as though she were writing for readers who didn’t actually know any gay people. She showed us Vanyel’s sexuality and explained that it was natural and nothing to be ashamed of, even if Vanyel felt ashamed.\nThe Last Herald-Mage turned me from someone who had never thought about sexuality to someone who had no problem with the gay aspect of it. After all, if gay people could be wizards, they were just as awesome as everyone else, right?\nMy own coming out was pretty low-key. I grew up in New York City; I have liberal, loving parents; I went to a school that prided itself on ethical PC-ness; and I wasn’t the only queer kid in class. I didn’t struggle much. But I think back on Mercedes Lackey a lot—how I came across that book, and how it prepared me, during my tween years, to be okay with who I was once I started getting crushes on other guys.\nI don’t remember how I found Lackey’s books. Were they given to me? Did I find them in the bookstore, saw that they had both bards and wizards, and simply wanted them on those merits? I wish I could remember. All I know is that I was damned lucky I found them. And I also know that if I hadn’t been brought up in a supportive environment, one series of books wouldn’t have been nearly enough.\nBut what about kids today? As the battle for queer rights has become more and more visible, these rights have also, in many respects, become more controversial. With the fight for gay marriage, the conservative fight against it, and the rash of tragic, queer teen suicides, it would seem as though queer characters would be popping up all over in SFF. After all, those geeky kids who get teased at school—whether they’re actually queer or just being called it—are the sorts of kids we were in high school. Or at least a lot of us. Marginalized, branded as outsiders, teased for being weird or different—and killing themselves because they’re queer. And to be queer, they’re told, is to be different.\nOf all the people out there who didn’t grow up queer, you’d think straight geeks would be the most sympathetic—and the most understanding. Shouldn’t the SFF community be looking out for these kids?\nSome within the community are. Malinda Lo has penned some amazing queer YA fantasy. Brit Mandelo writes an entire column on Tor.com called “Queering SFF” and has edited a new anthology called Beyond Binary: Genderqueer and Sexually Fluid Speculative Fiction. Cherie Priest featured a transgendered character in one of her Clockwork Century novels. There are queer SFF groups, like Geeks Out and Outer Alliance.\nThese examples stand out to me, though, because they’re few and far between and don’t get much notice. Even most romantic comedies today feature a stereotypical gay friend. It’s not the best representation, but at least we’re there. In SFF, we’re strangely invisible.\nFailing to see queer characters in fiction doesn’t just damage queer kids. Parents read SFF, too. If queer kids have a parent who has never known a queer person in their life, they’ll be much more equipped for raising a queer child if they’ve read queer characters written as actual human beings—and not flat stereotypes or, worse, somehow wrong or immoral.\nOn the whole, the SFF community seems to me to be divided into three camps. First, the openly homophobic types, who for personal an/or religious reasons—or because they think it’s “evolutionarily backwards” (just like the other 200-plus species who practice homosexuality, right?)—feel queer people don’t deserve to be treated like actual human beings.\nIn the second camp we have the pro-queer types who love queer characters in their fiction and often are queer themselves.\nThe third camp, though, makes up the majority of the SFF community: folks who just don’t think about it. These are usually straight dudes who grew up pretty geeky, and who often are still mostly—and hopefully comfortably—geeky. But they just don’t give much thought to queer folks. If they did, they’d probably be cool with them; many probably consider themselves pro-gay rights.\nBut when it comes to their SFF, this third group finds it odd when there’s a gay character. Some say things like “I just can’t relate to a queer character, cause I’m straight,” but most seem surprised by the inclusion of queer characters. Some say they find the emphasis on sexuality to be heavy-handed—even when the emphasis on the queer character’s sexuality is equal to or less than the emphasis placed on the straight character’s sexuality. When a straight guy kisses a girl, it’s the norm; when a gay guy kisses a guy, it’s emphasizing their sexuality.\nI don’t think people who hold this view are homophobes. They’re just used to their SFF being queer-free, and they feel startled by the inclusion of queer character. These are the folks I think are ready to open their minds. I don’t want them to be startled. Ideally, I don’t want them to think it’s any different than straight characters being included. For a start, though, I’d love to see them be happy to encounter queer characters. And I think they can be. They just need a little more prodding. And by prodding I mean more queer characters.\nSo the next time you read a book where there’s a heterosexual romantic pairing, don’t just accept it. Let that fact surprise you the way a queer romance might. Imagine how it makes that high-school kid feel, the one who still hasn’t found queer SFF. Think of how they look at every straight character in the books they read and are expected to relate to a straight character—but you, on the other hand, get surprised and kinda weirded out by one queer one. If they can relate, can’t you?\nI’m not saying every story needs a queer character. Or that it’s a writer’s responsibility to do more than tell a great story. But I do think it’s time for all of us—straight folks included—to think more about where queer characters fit into SFF. And where we stand in that audience. A straight romantic lead is all well and good, but a queer romantic lead could make some teenager feel better about him or herself.\nBut we’re not going to get more queer characters without demanding them. Straight readers, we need your help—you should be asking for queer characters, too. You should be hoping for them. You should be happy about them, not surprised by them. Remember that we queer folks exist, and we exist in the world of SFF, too. That’s how you show us support; that’s how you take queer characters in SFF from invisible to natural.\nWe appreciate your support in politics. We love when you say you’re for gay marriage. But you can do more. After all, if you’re going to support us in the real world, you can support us in every world.\nLev AC Rosen is the author of the critically acclaimed All Men of Genius, which was an Amazon best of the month, on over a dozen best of the year lists, and has been nominated for multiple awards. He received his BA from Oberlin College and his MFA in Creative Writing from Sarah Lawrence College. Lev is originally from lower Manhattan and now lives in even lower Manhattan, right at the edge. He teaches creative writing. All Men of Genius will be available in paperback in November 2012.", "source": "https://clarkesworldmagazine.com/another_word_11_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: It Gets Better with SFF (but SFF has to Get Better, too) by Lev AC Rosen"}