{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5VESYKcPn77ll0dqm0I7djGDt7A=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Cable Cars, Explosions, and Life-Sized Griffins: A Conversation with Suzanne Palmer  When looking up at the stars, we’re often consumed with thoughts of the technology and science that launch us beyond the confines of our terrestrial world. Space also makes us think of adventure, excitement, exploration, fun, and the endless possibilities of an ever-expanding universe.  Suzanne Palmer’s Finder captures all the best aspects of a science fiction adventure. Fergus Ferguson is an interstellar thief and con artist whose latest job finds him embroiled in a civil war complete with battling factions, a mysterious alien species, and mercenaries.  Suzanne Palmer is the author of numerous short stories. She has won the Hugo, Asimov’s Readers’, Analog AnLab Readers’ awards. Her fiction has appeared in Clarkesworld Magazine, Asimov’s, Interzone, Black Static, Beneath Ceaseless Skies, and more. Her new novel Finder is available from DAW on April 2nd.   When did you start writing professionally?  That’s a tough question to answer! I started writing in 2001 (if you discount a lot of dabbling with stories as a kid and teen, none of which will ever see the light of day) without any real intention to make it a regular thing. I was a student at Viable Paradise in 2005, and I think before that experience I was still teetering on the fence about whether I was going to try to make a serious go of it. I’ve questioned the wisdom of pursuing writing many times since then, but I think it was not long after the workshop that I wandered over the border into committed territory.  What drew you to science fiction?  I’ve always been an avid reader of both science fiction and fantasy, and my best friend dragged me to my first Boskone when I was 15 and it was like being home for the first time. So, the SFF world—its literature, media, and its communities—has been sort of my natural habitat for most of my life.  What inspired you to write Finder?  I had this visual idea of the cable cars in space and thought “hey, why not?” So, I threw a couple of random people in the car and let them interact for a few pages, and off the story went. When I first started, I could not have said whether Fergus or Mother Vahn was going to end up the main character, and I do still feel like someday I have to give Mother Vahn a story of her own too. I often start stories by throwing a pebble-sized idea or two down a mountain and letting them avalanche until I have a decent-enough sized boulder to work with. Of course, by that analogy the actual writing is very much pushing the damned boulder back up the hill again.  The action in Finder is exciting! What do you think goes into creating a great action scene?  Well, I think there has to be some element of surprise for the reader. They can look at a book and know objectively that there’s half a book left and so clearly the main character isn’t going to die in a particular scene, but if the story is carrying them along fast enough they’re not thinking about that and instead wondering how the main character is going to get out of something, or resolve or overcome whatever is in front of them, and it should be clever and not an obvious solution.  How was writing your first novel different from creating a short story?  If you don’t count a couple of intentionally-stupid-fun NaNoWriMo projects, Finder was really the second novel I’ve written. The first one wasn’t terrible, but was problematic enough in hindsight that it wasn’t ever going anywhere. Someday I’ll cannibalize it for its best parts and make a new story out of it, because it had some seriously good bones, but at the time it was hard to put that much work into something and fail with it, you know? I turned to shorts as a way of honing my skills with less individual investment, and to my surprise discovered that I really enjoyed writing short stories. I did that for a long time until I felt brave enough to try a novel again. It’s a huge relief to know I can write both.  The technology in Finder feels very real and plausible. What kind of research did you do when writing the book?  A lot of it is just thinking about existing technologies and how they’d evolve over time, or be put to use in an environment with wildly different physical challenges. I don’t know that I did a huge amount of research on any one topic, although I did a lot of different stuff, making sure I could make my ideas plausible. I had to do a lot more research for the sequel, though, because it’s mostly set in a real place.  Did Finder start off as a short story or did you conceive of it as a novel from the beginning?  Going back to my pebble analogy, when I was at the very start of writing Finder, I couldn’t have said how long it would be, but you can sorta peer over the edge of the writer-mountaintop and see the accumulating boulder part way down the slope and be like, “yep, that one’s gonna crush a village.” Some of it is in how much other ideas and plot stuff starts sticking to the draft early, and some of it is also in how you subconsciously start pacing the actual language—I think my brain has a better idea of where it’s going with something than it necessarily wants to share. Now I can usually guess within about 5k where a story is going to land, not very far in, if I didn’t start off at the outset aiming for a particular length.  What or who inspired the characters in Finder?  Ooooh, that’s a tough one. I don’t know that any of them were inspired by particular people, but more an amalgam of interesting, clever, and sometimes difficult people I’ve known in real life.  The dialogue in Finder adds a whole new dimension to your characters. What makes for great dialogue? Do you ever read it aloud to yourself to see how it sounds?  I always read all my stories out loud, which makes the dog stare at me like I’ve completely lost my mind. It helps me a lot not just with dialogue, but also the rhythm of the story in general. Sometimes I worry everyone is too snarky, but deep in my heart I love snarky people, so there ya go.  You’ve covered a wide array of themes and topics with your short fiction. Are there any topics you’d love to write a story about but haven’t tackled yet?  I have a dragon story that’s been in my head for years but it still isn’t ready to be written. That happens a lot, where I have a bit of an idea or I read some really fascinating bit of science (I am a total science junkie) and I just have to wait until it tells me where I want to go with it. I’m pretty whim-driven, overall.  What is the one piece of writing advice you’ve been given that has stuck with you?  Not to compare your process, or output, to other writers in a judgmental way. Ultimately the one thing successful writers have in common is that they do the work—the details vary wildly by person, and sometimes by story, and being adaptable and having trust in yourself is critical to not getting discouraged along the way.  How has your Fine Arts degree and experience crafting 3-D objects influenced your writing?  I think writing and art (and my day job as a Linux sysadmin) all come out of much of the same place for me. I love puzzles, and the challenge of figuring things out. All three pursuits can be frustrating, but never, ever boring.  Do you still own a number of gigantic animal sculptures? If so, how many?  I still have a life-size(?) griffin in my garage, a little the worse for wear. I had an 8-foot creature of my own invention that had been in my Fine Arts thesis show but it got a bit too damaged over several years living in my parents’ garage (I think my father used it to stop the car whenever he was parking inside) and finally had to go. My eldest child cut its head off with a saw and that’s still lurking somewhere in the basement being creepy as hell. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nCable Cars, Explosions, and Life-Sized Griffins: A Conversation with Suzanne Palmer\nWhen looking up at the stars, we’re often consumed with thoughts of the technology and science that launch us beyond the confines of our terrestrial world. Space also makes us think of adventure, excitement, exploration, fun, and the endless possibilities of an ever-expanding universe.\nSuzanne Palmer’s Finder captures all the best aspects of a science fiction adventure. Fergus Ferguson is an interstellar thief and con artist whose latest job finds him embroiled in a civil war complete with battling factions, a mysterious alien species, and mercenaries.\nSuzanne Palmer is the author of numerous short stories. She has won the Hugo, Asimov’s Readers’, Analog AnLab Readers’ awards. Her fiction has appeared in Clarkesworld Magazine, Asimov’s, Interzone, Black Static, Beneath Ceaseless Skies, and more. Her new novel Finder is available from DAW on April 2nd.\nWhen did you start writing professionally?\nThat’s a tough question to answer! I started writing in 2001 (if you discount a lot of dabbling with stories as a kid and teen, none of which will ever see the light of day) without any real intention to make it a regular thing. I was a student at Viable Paradise in 2005, and I think before that experience I was still teetering on the fence about whether I was going to try to make a serious go of it. I’ve questioned the wisdom of pursuing writing many times since then, but I think it was not long after the workshop that I wandered over the border into committed territory.\nWhat drew you to science fiction?\nI’ve always been an avid reader of both science fiction and fantasy, and my best friend dragged me to my first Boskone when I was 15 and it was like being home for the first time. So, the SFF world—its literature, media, and its communities—has been sort of my natural habitat for most of my life.\nWhat inspired you to write Finder?\nI had this visual idea of the cable cars in space and thought “hey, why not?” So, I threw a couple of random people in the car and let them interact for a few pages, and off the story went. When I first started, I could not have said whether Fergus or Mother Vahn was going to end up the main character, and I do still feel like someday I have to give Mother Vahn a story of her own too. I often start stories by throwing a pebble-sized idea or two down a mountain and letting them avalanche until I have a decent-enough sized boulder to work with. Of course, by that analogy the actual writing is very much pushing the damned boulder back up the hill again.\nThe action in Finder is exciting! What do you think goes into creating a great action scene?\nWell, I think there has to be some element of surprise for the reader. They can look at a book and know objectively that there’s half a book left and so clearly the main character isn’t going to die in a particular scene, but if the story is carrying them along fast enough they’re not thinking about that and instead wondering how the main character is going to get out of something, or resolve or overcome whatever is in front of them, and it should be clever and not an obvious solution.\nHow was writing your first novel different from creating a short story?\nIf you don’t count a couple of intentionally-stupid-fun NaNoWriMo projects, Finder was really the second novel I’ve written. The first one wasn’t terrible, but was problematic enough in hindsight that it wasn’t ever going anywhere. Someday I’ll cannibalize it for its best parts and make a new story out of it, because it had some seriously good bones, but at the time it was hard to put that much work into something and fail with it, you know? I turned to shorts as a way of honing my skills with less individual investment, and to my surprise discovered that I really enjoyed writing short stories. I did that for a long time until I felt brave enough to try a novel again. It’s a huge relief to know I can write both.\nThe technology in Finder feels very real and plausible. What kind of research did you do when writing the book?\nA lot of it is just thinking about existing technologies and how they’d evolve over time, or be put to use in an environment with wildly different physical challenges. I don’t know that I did a huge amount of research on any one topic, although I did a lot of different stuff, making sure I could make my ideas plausible. I had to do a lot more research for the sequel, though, because it’s mostly set in a real place.\nDid Finder start off as a short story or did you conceive of it as a novel from the beginning?\nGoing back to my pebble analogy, when I was at the very start of writing Finder, I couldn’t have said how long it would be, but you can sorta peer over the edge of the writer-mountaintop and see the accumulating boulder part way down the slope and be like, “yep, that one’s gonna crush a village.” Some of it is in how much other ideas and plot stuff starts sticking to the draft early, and some of it is also in how you subconsciously start pacing the actual language—I think my brain has a better idea of where it’s going with something than it necessarily wants to share. Now I can usually guess within about 5k where a story is going to land, not very far in, if I didn’t start off at the outset aiming for a particular length.\nWhat or who inspired the characters in Finder?\nOoooh, that’s a tough one. I don’t know that any of them were inspired by particular people, but more an amalgam of interesting, clever, and sometimes difficult people I’ve known in real life.\nThe dialogue in Finder adds a whole new dimension to your characters. What makes for great dialogue? Do you ever read it aloud to yourself to see how it sounds?\nI always read all my stories out loud, which makes the dog stare at me like I’ve completely lost my mind. It helps me a lot not just with dialogue, but also the rhythm of the story in general. Sometimes I worry everyone is too snarky, but deep in my heart I love snarky people, so there ya go.\nYou’ve covered a wide array of themes and topics with your short fiction. Are there any topics you’d love to write a story about but haven’t tackled yet?\nI have a dragon story that’s been in my head for years but it still isn’t ready to be written. That happens a lot, where I have a bit of an idea or I read some really fascinating bit of science (I am a total science junkie) and I just have to wait until it tells me where I want to go with it. I’m pretty whim-driven, overall.\nWhat is the one piece of writing advice you’ve been given that has stuck with you?\nNot to compare your process, or output, to other writers in a judgmental way. Ultimately the one thing successful writers have in common is that they do the work—the details vary wildly by person, and sometimes by story, and being adaptable and having trust in yourself is critical to not getting discouraged along the way.\nHow has your Fine Arts degree and experience crafting 3-D objects influenced your writing?\nI think writing and art (and my day job as a Linux sysadmin) all come out of much of the same place for me. I love puzzles, and the challenge of figuring things out. All three pursuits can be frustrating, but never, ever boring.\nDo you still own a number of gigantic animal sculptures? If so, how many?\nI still have a life-size(?) griffin in my garage, a little the worse for wear. I had an 8-foot creature of my own invention that had been in my Fine Arts thesis show but it got a bit too damaged over several years living in my parents’ garage (I think my father used it to stop the car whenever he was parking inside) and finally had to go. My eldest child cut its head off with a saw and that’s still lurking somewhere in the basement being creepy as hell.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/palmer_interview_2019/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cable Cars, Explosions, and Life-Sized Griffins: A Conversation with Suzanne Palmer by Chris Urie"}