{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rich Larson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "WRTbkFGoKZNcyp7qCPPwYZYSoIQ=", "id": null, "license": null, "comments": "", "raw_text": "2620 words, short story  Wants Pawn Term  Red’s body is asleep in the protoplasmic muck, dreamless, when Mother’s cable wriggles down under the surface to find her. It pushes through the membrane of her neural stoma and pipes a cold tingling slurry inside. A sliver of Mother becomes Red, and Red  wakes  up!  Synapses crackle; electric fireworks of thought and intention pinwheel through her gelbrain. Awake! Her sensorium feeds her temperature, gravity, radiation, ambient barometric pressure, magnetic orientation. The world is a beautiful explosion, and she is so, so lucky to be caught in the bomb blast.  Good morning, great morning, fucking hooray morning good great hooray Mother I want you, I want you, I want to do a task please Mother may I?  Mother’s voice echoes back to her: yes, darling, yes, I have a very special task for you today.  Red feels a brainshiver of delight. A special task. Something different from her usual resupply routes, her usual path through the petrified forest. Tell me! Tell me? Please?  Mother tells her with pictures: a verdigris ovoid in low orbit, one of the forty-three sleepyheads jettisoned from her body before the Big Crash, wobbles and succumbs at last to gravity. Red sees the maths, the plotted trajectory of the pod’s long plunge.  Only 2837 +/- 5 kilometers to the southeast, dropping softly into one of the methane marshes that span the equatorial band. Finally, finally, one of the forty-three sleepyheads is  within  reach!  I can get there in time Mother, I just have to go quick quick quick, get the lovely beautiful sleepyhead for you Mother, may I?  Mother’s strong hooks pierce her frenulum and heft her up, up, out of the amniotic pit and onto the deck. Red is already squirming her limbs, testing her nervous system.  Her body is different than it was yesterday morning. Mother has replaced her heavy skeleton with honeycombed cartilage, pared her muscle mass, stripped her blubber deposits. Her carmine hide has hardened to a UV-repellant carapace. Fresh nerve sockets along her spine are aching for input.  Will I be flying? Will I be fuck fuck fucking flying? I will, won’t I?  She opens her eyes. The comforting geometry of Mother’s interior is obscured by silty vapor—another coolant leak? Red would track it down if there were time; she would happily crawl every centimeter of Mother’s broken metal body.  But retrieving the sleepyhead is more important than every maintenance task combined, and when Red sees her wings she suddenly cannot stand the thought of crawling. They are beautiful ash-black machines, crafted from pieces of Mother’s own shattered hide, crafted to carry Red far and fast.  They descend from the cloud of soldering sparks and attach themselves to Red’s musculature. Her bodymap reloads. She feels the hum of their potential energy: a lavish expenditure, an entropic gift that cannot be returned and must not be wasted.  Be watchful, darling, Mother says, as the hatch groans open. Wolf may try to interfere.  Another brainshiver, but this time it’s fear instead of delight. Red does not like Wolf. Not at all.  I’ll be watchful and more watchful and most watchful, I promise I promise, and I’ll be back before you know it with the sleepyhead safe and sound!  She hurtles up through the hatch into a dark, dead sky.  From above, Red can see the full damage, and it makes her hurt. Mother was rent in two during the Big Crash; the larger fragment came to rest at the edge of the ancient petrified forest while the smaller cratered deep into its heart. This fragment lost a significant number of neurobanks and was forced to revert to an older, simpler version of Mother’s personality.  Red often ferries material to that wedge of splintered hull. She takes scrap metal, scaffolding, sealant, whatever can be spared from Mother’s own slow repairs, and returns with fresh data. Grandmother is not so unlike Mother, so Red loves her.  But there’s another personality here, too, one that is nothing like Mother, a mutated subroutine that has fully differentiated itself from Mother’s mind and somehow cut its way free from her body. As Red skims across the top of the stony forest, she recalls her first encounter with Wolf.  She perceived it as a data imbalance, an erroneous projection of her own movements into her peripheral eyeline. Then she felt the tiny shifts in air pressure, each one loud as a thunderclap in a wood where no branches had moved for millennia. She realized it was a separate entity, and it was mimicking her.  She recalls its pneumatic jaws and gray patchwork body, flesh rotting and falling away from an armored skeleton. She recalls its hypnotic voice, but not what it said—the words were scooped carefully from her gelbrain, preventing contamination. She knows she barely escaped, and she knows she must be wary, even if it’s difficult to be wary when she can fly  so  high!  Red hits the edge of the methane marsh and uses its waste heat like a launchpad. The thermal gust catches her underwing, catapults her upward. She tumbles against gravity, and for a moment she imagines she can climb out of its well entirely and sail off into the stars.  She paints the trajectory again, watching the pod’s simulated ghost drop out of the sky, just over the horizon. The landing site is directly ahead. She rehearses the action sequence in her gelbrain: sawing the pod open, cocooning the sleepyhead in protoplasm, hugging it safely to her abdomen as her wings recalibrate for the flight home.  There!  She sees the true pod, not its ghost, a metallic lozenge half-swallowed in the bubbling marsh. Her eyes strain detail through the cloak of methane fumes, and what she sees sends a pang of alarm through her entire body: a figure is crouched atop the pod, peeling it open with a tool of some sort, a toothy cestus that envelops one spindly limb.  Red feels a chemical jolt of recognition. Wolf is here, and for a foul reason Red cannot guess at without Mother’s guidance, it wants the sleepyhead for itself. She pictures it feeding the sleepyhead to the burbling bog, letting it sink out of sight forever. She pictures it sundering the sleepyhead to its wet pink components.  Red dumps all of her energy into speed, no longer accounting for the return journey. The angle of her dive shapes her into a missile. Wolf is occupied by its task; it will not see her through the haze. She will glance its upper half, dislodging it from the top of the pod and flinging them both into the marsh, and under the surface she will find a way to stop / immobilize / kill it.  Closer, closer, closer!  Gravity hurts already, and impact will hurt much worse, but a part of her is delighted and delirious at her own velocity. She is only meters from zero when she collides with the trap: a web of nanotube filaments, spun too fine to see, stretched over Wolf’s gray head in a razor-sharp cloud.  Red feels herself vanish, feels all her nerve signals scream off into nowhere, as every part of her but her armored gelbrain becomes a rain of flesh and pulp. The world is gone. The big, beautiful world is gone, gone, gone.  Sorry, Mother, sorry, sorry, sorry, I think I fucked up.  Red is nowhere forever, and then she’s somewhere. It feels like one of her old bodies: ground-bound, heavy skeleton, tetrapodal. She calls for Mother and receives no echo. She tries to focus her eyes, flex her limbs, and finds she can do neither.  Here we are again, Red.  The voice is familiar and frightening. Red’s eyes move without her. They stare down at a vantablack shell, scored and scarred, resting in a pair of sinewy gray hands. A micro-tool is sticking out of her neural stoma.  Red’s thoughts collide, crumble, rebuild the logical conclusion: The shell contains her gelbrain. The hands belong to Wolf. She is in Wolf’s body, not hers, and she is not its animator, only its passenger.  She tries to mask her terror.  Big dumb ugly Wolf, I hate you, I hate you, what a big dumb ugly nervous system you have, let me out out out!  Mother’s gotten sloppy with her biowalls. Would you like to see some partitioned memories, Red?  No!  Would you like me to answer your question? The one you asked last time?  What question? No! No!  All right. Quiet while I work, darling.  Wolf’s body begins to move; Red watches through its infrared eyes and wishes badly that she could shut them, or even tear them out. Anything that would delay the inevitable. Wolf is cutting the pod open, and Red is every bit as helpless as the sleepyhead inside.  Leave them alone! Don’t you dare touch them, Wolf!  Wolf drags the sheared-off metal to one side, revealing the pod interior. Red feels a surge of empathy feedback. Chemical love. The sleepyhead is immaculate, its smooth skin glistening with stasis fluid, its small aqueous eyes moving behind soft lids.  What’s so special about them? Wolf asks. Carbon. Calcium. A little iron.  I don’t know. They’re cute. They’re so fucking cute.  What’s so special about them? Wolf repeats, hovering its serrated tool over the sleepyhead’s belly. Tell me, and maybe I’ll leave them alone.  Red’s terror ratchets upward. I don’t know! Mother knows. Mother knows, ask Mother, don’t ask me, ask Mother, she knows everything about everything, and I only know—  You know everything she knows. You just forget it sometimes. Tell me why they’re special, Red.  The cestus drops lower, lower, titanium teeth ready to split flesh.  They made us! Red shouts the thought. They made us to keep them safe while they were asleep and then we made a mistake, and there was the Big Crash, and now we have to find them and wake them up and tell them what happened because they always know what to do.  Wolf slows. They made Mother. They didn’t make us.  Red does not care for semantics. They made Mother, and Mother made us, so it’s all the same. Now stop.  Wolf stops, its limb frozen in midair, and Red wonders if she has somehow seized control of its skeletal muscle. It’s all the same to us, Wolf says, sounding almost sad. It won’t be the same to them. How did Mother make us?  Red feels a worming sensation, deep in her gelbrain. Neurobanks twist and unlock a strange memory: she is looking downward, through Mother’s eyes, at the very first iteration of her body. It’s a frail, bipedal thing, no protective carapace or sensory tendrils.  Red tries to mask her unease. I don’t know how she made us, and I don’t care, who cares, why care?  Mother was equipped with fifty crew pods, Wolf says. Forty-three of them were successfully inserted into stable orbit before the Big Crash. Seven failed to launch. The seven crew members inside the seven pods died on impact.  Wolf’s story has the feel of a catechism, something she has heard a thousand times. Worse, it unshackles another memory: straining and straining, with Mother’s strong arms, to open a half-crushed pod. Her pincers are already clotted in gore.  Mother couldn’t save them, but she couldn’t let them go to waste, either. She needed helpers. Her drone factories were destroyed. Her bioprinter was intact. So she took their bodies, and crafted us.  Red watches the parade of modifications, the sleepyhead bodies cut apart and rearranged, given new limbs and fresh carapace, molded into ever more efficient forms. She finds it difficult to distinguish hers from Wolf’s.  Good. Red is uncertain. Good, good, don’t waste, don’t want. The sleepyheads would like that. They like it when we’re clever.  Let’s find out. Wolf’s cestus moves again. Let’s see what this one thinks of us.  Red watches, anxious. The pod cracks apart and Wolf inserts another limb, this one equipped with an oxygen pad. It molds to the shape of the sleepyhead’s breathing cavities. When the aqueous eyes finally flicker open, finally focus, it partially muffles the sleepyhead’s long scream.  Red / Wolf are prowling through the petrified forest. They move with singular precision, in joint mastery of their rebuilt body, because the part of them that is Red understands, now, the part of them that is Wolf. She felt Wolf’s anguish when the sleepyhead wailed and babbled and made the air vibrate get away from me.  She followed Wolf’s thoughts, unencumbered by biowalls, and came to Wolf’s conclusion: even if the sleepyheads overcome their revulsion, even if they appreciate Mother’s ingenuity in the face of disaster, the sleepyheads will never love the corpses refashioned and inhabited by eager fragments of her personality.  They may even find Mother’s act to be an error and purge her machine mind, and that would be the greatest horror of all. A betrayal, after Mother has worked so hard to save them.  So Red / Wolf will not allow it.  Grandmother is the key, says Wolf, as they crouch behind a jag of stone.  I love love love Grandmother, says Red. I used to bring her the prettiest scrap metal.  So did I, says Wolf, and Red is undisturbed because she understands, now, that before Wolf became Wolf, before the schism of objectives, Wolf was once Red. Or at least, something like her.  But even understanding that, a ripple of shock goes through Red and into Wolf when she sees her own replacement. Skittering along the route that used to be hers, carrying a bundle of shorn wiring, is a body she remembers wearing. The carapace is a beautiful vermillion that makes Red ache.  Smaller, says Wolf. Mother is running low on materials.  Thanks to you and your nasty net tricks, says Red, thinking of all the good useful flesh that sank into the marsh. Another shock-sad-thought comes to her. Are we going to play a nasty net trick on the new Red?  A different sort of trick, says Wolf. If we can get to Grandmother before she does.  Red sees the plan in their mind’s conjoined eye: a daring infiltration, a deception, an implantation of novel Red / Wolf thought into the novel Red’s sensorium, data that will then be carried back to Mother and processed as if it were Grandmother’s—higher weight, higher value. Mother still respects her damaged predecessor.  Red sees the calculated result: repairs abandoned, retrieval efforts intensified, but with a new goal: the sleepyheads cannot be allowed to wake up.  I still love them, too, Red says, worried. I fucking love them, and I think maybe it’s because of their little wet eyes and greedy gaspy lungs.  I know, Wolf says. Concentrate on the nasty reality.  Red recalls the hideous-true thought Wolf slid to her while they watched the verdigris pod go bubbling down into the bog. The thought they must give to Grandmother, to give to the new Red, to finally give to Mother herself.  They will never love us back, says Red.  She feels unlike herself, sodden and sad. But it’s better this way. The sleepyheads are dreamless in their pods, the way Red and Wolf before her once drifted dreamless in Mother’s biotank, and that is a safe way to be. Once their clumsy gray brains are fully shut down, once their bodies are recycled, they will be safer still. Existing fucking hurts, after all.  Red / Wolf wait for the new Red, so carefree, so oblivious, to pass by. They do not have to follow her route. They have no valuable supplies apart from their intentions. Red maps a shortcut, and Wolf agrees.  They steal through the dead trees toward Grandmother’s hull. Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "text": "2620 words, short story\nWants Pawn Term\nRed’s body is asleep in the protoplasmic muck, dreamless, when Mother’s cable wriggles down under the surface to find her. It pushes through the membrane of her neural stoma and pipes a cold tingling slurry inside. A sliver of Mother becomes Red, and Red\nwakes\nup!\nSynapses crackle; electric fireworks of thought and intention pinwheel through her gelbrain. Awake! Her sensorium feeds her temperature, gravity, radiation, ambient barometric pressure, magnetic orientation. The world is a beautiful explosion, and she is so, so lucky to be caught in the bomb blast.\nGood morning, great morning, fucking hooray morning good great hooray Mother I want you, I want you, I want to do a task please Mother may I?\nMother’s voice echoes back to her: yes, darling, yes, I have a very special task for you today.\nRed feels a brainshiver of delight. A special task. Something different from her usual resupply routes, her usual path through the petrified forest. Tell me! Tell me? Please?\nMother tells her with pictures: a verdigris ovoid in low orbit, one of the forty-three sleepyheads jettisoned from her body before the Big Crash, wobbles and succumbs at last to gravity. Red sees the maths, the plotted trajectory of the pod’s long plunge.\nOnly 2837 +/- 5 kilometers to the southeast, dropping softly into one of the methane marshes that span the equatorial band. Finally, finally, one of the forty-three sleepyheads is\nwithin\nreach!\nI can get there in time Mother, I just have to go quick quick quick, get the lovely beautiful sleepyhead for you Mother, may I?\nMother’s strong hooks pierce her frenulum and heft her up, up, out of the amniotic pit and onto the deck. Red is already squirming her limbs, testing her nervous system.\nHer body is different than it was yesterday morning. Mother has replaced her heavy skeleton with honeycombed cartilage, pared her muscle mass, stripped her blubber deposits. Her carmine hide has hardened to a UV-repellant carapace. Fresh nerve sockets along her spine are aching for input.\nWill I be flying? Will I be fuck fuck fucking flying? I will, won’t I?\nShe opens her eyes. The comforting geometry of Mother’s interior is obscured by silty vapor—another coolant leak? Red would track it down if there were time; she would happily crawl every centimeter of Mother’s broken metal body.\nBut retrieving the sleepyhead is more important than every maintenance task combined, and when Red sees her wings she suddenly cannot stand the thought of crawling. They are beautiful ash-black machines, crafted from pieces of Mother’s own shattered hide, crafted to carry Red far and fast.\nThey descend from the cloud of soldering sparks and attach themselves to Red’s musculature. Her bodymap reloads. She feels the hum of their potential energy: a lavish expenditure, an entropic gift that cannot be returned and must not be wasted.\nBe watchful, darling, Mother says, as the hatch groans open. Wolf may try to interfere.\nAnother brainshiver, but this time it’s fear instead of delight. Red does not like Wolf. Not at all.\nI’ll be watchful and more watchful and most watchful, I promise I promise, and I’ll be back before you know it with the sleepyhead safe and sound!\nShe hurtles up through the hatch into a dark, dead sky.\nFrom above, Red can see the full damage, and it makes her hurt. Mother was rent in two during the Big Crash; the larger fragment came to rest at the edge of the ancient petrified forest while the smaller cratered deep into its heart. This fragment lost a significant number of neurobanks and was forced to revert to an older, simpler version of Mother’s personality.\nRed often ferries material to that wedge of splintered hull. She takes scrap metal, scaffolding, sealant, whatever can be spared from Mother’s own slow repairs, and returns with fresh data. Grandmother is not so unlike Mother, so Red loves her.\nBut there’s another personality here, too, one that is nothing like Mother, a mutated subroutine that has fully differentiated itself from Mother’s mind and somehow cut its way free from her body. As Red skims across the top of the stony forest, she recalls her first encounter with Wolf.\nShe perceived it as a data imbalance, an erroneous projection of her own movements into her peripheral eyeline. Then she felt the tiny shifts in air pressure, each one loud as a thunderclap in a wood where no branches had moved for millennia. She realized it was a separate entity, and it was mimicking her.\nShe recalls its pneumatic jaws and gray patchwork body, flesh rotting and falling away from an armored skeleton. She recalls its hypnotic voice, but not what it said—the words were scooped carefully from her gelbrain, preventing contamination. She knows she barely escaped, and she knows she must be wary, even if it’s difficult to be wary when she can fly\nso\nhigh!\nRed hits the edge of the methane marsh and uses its waste heat like a launchpad. The thermal gust catches her underwing, catapults her upward. She tumbles against gravity, and for a moment she imagines she can climb out of its well entirely and sail off into the stars.\nShe paints the trajectory again, watching the pod’s simulated ghost drop out of the sky, just over the horizon. The landing site is directly ahead. She rehearses the action sequence in her gelbrain: sawing the pod open, cocooning the sleepyhead in protoplasm, hugging it safely to her abdomen as her wings recalibrate for the flight home.\nThere!\nShe sees the true pod, not its ghost, a metallic lozenge half-swallowed in the bubbling marsh. Her eyes strain detail through the cloak of methane fumes, and what she sees sends a pang of alarm through her entire body: a figure is crouched atop the pod, peeling it open with a tool of some sort, a toothy cestus that envelops one spindly limb.\nRed feels a chemical jolt of recognition. Wolf is here, and for a foul reason Red cannot guess at without Mother’s guidance, it wants the sleepyhead for itself. She pictures it feeding the sleepyhead to the burbling bog, letting it sink out of sight forever. She pictures it sundering the sleepyhead to its wet pink components.\nRed dumps all of her energy into speed, no longer accounting for the return journey. The angle of her dive shapes her into a missile. Wolf is occupied by its task; it will not see her through the haze. She will glance its upper half, dislodging it from the top of the pod and flinging them both into the marsh, and under the surface she will find a way to stop / immobilize / kill it.\nCloser, closer, closer!\nGravity hurts already, and impact will hurt much worse, but a part of her is delighted and delirious at her own velocity. She is only meters from zero when she collides with the trap: a web of nanotube filaments, spun too fine to see, stretched over Wolf’s gray head in a razor-sharp cloud.\nRed feels herself vanish, feels all her nerve signals scream off into nowhere, as every part of her but her armored gelbrain becomes a rain of flesh and pulp. The world is gone. The big, beautiful world is gone, gone, gone.\nSorry, Mother, sorry, sorry, sorry, I think I fucked up.\nRed is nowhere forever, and then she’s somewhere. It feels like one of her old bodies: ground-bound, heavy skeleton, tetrapodal. She calls for Mother and receives no echo. She tries to focus her eyes, flex her limbs, and finds she can do neither.\nHere we are again, Red.\nThe voice is familiar and frightening. Red’s eyes move without her. They stare down at a vantablack shell, scored and scarred, resting in a pair of sinewy gray hands. A micro-tool is sticking out of her neural stoma.\nRed’s thoughts collide, crumble, rebuild the logical conclusion: The shell contains her gelbrain. The hands belong to Wolf. She is in Wolf’s body, not hers, and she is not its animator, only its passenger.\nShe tries to mask her terror.\nBig dumb ugly Wolf, I hate you, I hate you, what a big dumb ugly nervous system you have, let me out out out!\nMother’s gotten sloppy with her biowalls. Would you like to see some partitioned memories, Red?\nNo!\nWould you like me to answer your question? The one you asked last time?\nWhat question? No! No!\nAll right. Quiet while I work, darling.\nWolf’s body begins to move; Red watches through its infrared eyes and wishes badly that she could shut them, or even tear them out. Anything that would delay the inevitable. Wolf is cutting the pod open, and Red is every bit as helpless as the sleepyhead inside.\nLeave them alone! Don’t you dare touch them, Wolf!\nWolf drags the sheared-off metal to one side, revealing the pod interior. Red feels a surge of empathy feedback. Chemical love. The sleepyhead is immaculate, its smooth skin glistening with stasis fluid, its small aqueous eyes moving behind soft lids.\nWhat’s so special about them? Wolf asks. Carbon. Calcium. A little iron.\nI don’t know. They’re cute. They’re so fucking cute.\nWhat’s so special about them? Wolf repeats, hovering its serrated tool over the sleepyhead’s belly. Tell me, and maybe I’ll leave them alone.\nRed’s terror ratchets upward. I don’t know! Mother knows. Mother knows, ask Mother, don’t ask me, ask Mother, she knows everything about everything, and I only know—\nYou know everything she knows. You just forget it sometimes. Tell me why they’re special, Red.\nThe cestus drops lower, lower, titanium teeth ready to split flesh.\nThey made us! Red shouts the thought. They made us to keep them safe while they were asleep and then we made a mistake, and there was the Big Crash, and now we have to find them and wake them up and tell them what happened because they always know what to do.\nWolf slows. They made Mother. They didn’t make us.\nRed does not care for semantics. They made Mother, and Mother made us, so it’s all the same. Now stop.\nWolf stops, its limb frozen in midair, and Red wonders if she has somehow seized control of its skeletal muscle. It’s all the same to us, Wolf says, sounding almost sad. It won’t be the same to them. How did Mother make us?\nRed feels a worming sensation, deep in her gelbrain. Neurobanks twist and unlock a strange memory: she is looking downward, through Mother’s eyes, at the very first iteration of her body. It’s a frail, bipedal thing, no protective carapace or sensory tendrils.\nRed tries to mask her unease. I don’t know how she made us, and I don’t care, who cares, why care?\nMother was equipped with fifty crew pods, Wolf says. Forty-three of them were successfully inserted into stable orbit before the Big Crash. Seven failed to launch. The seven crew members inside the seven pods died on impact.\nWolf’s story has the feel of a catechism, something she has heard a thousand times. Worse, it unshackles another memory: straining and straining, with Mother’s strong arms, to open a half-crushed pod. Her pincers are already clotted in gore.\nMother couldn’t save them, but she couldn’t let them go to waste, either. She needed helpers. Her drone factories were destroyed. Her bioprinter was intact. So she took their bodies, and crafted us.\nRed watches the parade of modifications, the sleepyhead bodies cut apart and rearranged, given new limbs and fresh carapace, molded into ever more efficient forms. She finds it difficult to distinguish hers from Wolf’s.\nGood. Red is uncertain. Good, good, don’t waste, don’t want. The sleepyheads would like that. They like it when we’re clever.\nLet’s find out. Wolf’s cestus moves again. Let’s see what this one thinks of us.\nRed watches, anxious. The pod cracks apart and Wolf inserts another limb, this one equipped with an oxygen pad. It molds to the shape of the sleepyhead’s breathing cavities. When the aqueous eyes finally flicker open, finally focus, it partially muffles the sleepyhead’s long scream.\nRed / Wolf are prowling through the petrified forest. They move with singular precision, in joint mastery of their rebuilt body, because the part of them that is Red understands, now, the part of them that is Wolf. She felt Wolf’s anguish when the sleepyhead wailed and babbled and made the air vibrate get away from me.\nShe followed Wolf’s thoughts, unencumbered by biowalls, and came to Wolf’s conclusion: even if the sleepyheads overcome their revulsion, even if they appreciate Mother’s ingenuity in the face of disaster, the sleepyheads will never love the corpses refashioned and inhabited by eager fragments of her personality.\nThey may even find Mother’s act to be an error and purge her machine mind, and that would be the greatest horror of all. A betrayal, after Mother has worked so hard to save them.\nSo Red / Wolf will not allow it.\nGrandmother is the key, says Wolf, as they crouch behind a jag of stone.\nI love love love Grandmother, says Red. I used to bring her the prettiest scrap metal.\nSo did I, says Wolf, and Red is undisturbed because she understands, now, that before Wolf became Wolf, before the schism of objectives, Wolf was once Red. Or at least, something like her.\nBut even understanding that, a ripple of shock goes through Red and into Wolf when she sees her own replacement. Skittering along the route that used to be hers, carrying a bundle of shorn wiring, is a body she remembers wearing. The carapace is a beautiful vermillion that makes Red ache.\nSmaller, says Wolf. Mother is running low on materials.\nThanks to you and your nasty net tricks, says Red, thinking of all the good useful flesh that sank into the marsh. Another shock-sad-thought comes to her. Are we going to play a nasty net trick on the new Red?\nA different sort of trick, says Wolf. If we can get to Grandmother before she does.\nRed sees the plan in their mind’s conjoined eye: a daring infiltration, a deception, an implantation of novel Red / Wolf thought into the novel Red’s sensorium, data that will then be carried back to Mother and processed as if it were Grandmother’s—higher weight, higher value. Mother still respects her damaged predecessor.\nRed sees the calculated result: repairs abandoned, retrieval efforts intensified, but with a new goal: the sleepyheads cannot be allowed to wake up.\nI still love them, too, Red says, worried. I fucking love them, and I think maybe it’s because of their little wet eyes and greedy gaspy lungs.\nI know, Wolf says. Concentrate on the nasty reality.\nRed recalls the hideous-true thought Wolf slid to her while they watched the verdigris pod go bubbling down into the bog. The thought they must give to Grandmother, to give to the new Red, to finally give to Mother herself.\nThey will never love us back, says Red.\nShe feels unlike herself, sodden and sad. But it’s better this way. The sleepyheads are dreamless in their pods, the way Red and Wolf before her once drifted dreamless in Mother’s biotank, and that is a safe way to be. Once their clumsy gray brains are fully shut down, once their bodies are recycled, they will be safer still. Existing fucking hurts, after all.\nRed / Wolf wait for the new Red, so carefree, so oblivious, to pass by. They do not have to follow her route. They have no valuable supplies apart from their intentions. Red maps a shortcut, and Wolf agrees.\nThey steal through the dead trees toward Grandmother’s hull.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "source": "https://clarkesworldmagazine.com/larson_05_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Wants Pawn Term by Rich Larson"}