{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeff VanderMeer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "LcBHcfwhQBsrRnBRYztHesv4IVM=", "id": null, "license": null, "comments": "", "raw_text": "Interview  John Grant and Paul Barnett Agree: Science Has Been Corrupted  “John Grant” is the pen name Paul Barnett uses for his non-editorial work, including the book Corrupted Science, a compendium through the ages of situations in which facts have been trumped by ideology, pride, selfishness, and avarice.  Corrupted Science made a USA Today best-of list last year and has recently been prominently displayed on the gift book table of a major brick-and-mortar chain. Although not fictional, Corrupted Science often reads like fiction. This reader, at least, could not believe the sheer extent of stupidity and pigheadedness on display. It makes for exciting reading, even as you wince at some of the worst examples. Others, however, are laugh-out-loud funny. The genius of Grant-Barnett’s achievement is both in its encyclopedic completeness and the way in which the author still manages to breathe life into each anecdote. The compact and stylish design of the book doesn’t hurt—you’ll want to keep this one on your shelf of favorites for both its content and its look.  Barnett, as Grant, has written sixty-odd books, about twenty-five are fiction. They include The Far-Enough Window, The Hundredfold Problem, Albion, The World, Qinmeartha and the Girl-Child LoChi (published as half of a “double” with Colin Wilson’s The Tomb of the Old Ones), two collaborative parodies with David Langford (Earthdoom and Guts) and the twelve novels of the Legends of Lone Wolf series. His serial novel The Dragons of Manhattan was published online during the latter part of 2003 by the global journalism website Blue Ear; it has just been published in a print edition by the UK publisher Screaming Dreams Press.  His best known works of nonfiction are The Encyclopedia of Walt Disney’s Animated Characters (three editions), The Encyclopedia of Fantasy (done with John Clute) and most recently The Chesley Awards for Science Fiction and Fantasy Art: A Retrospective (done with Elizabeth Humphrey and Pamela D. Scoville). As John Grant he has received two Hugo Awards, the World Fantasy Award, the Mythopoeic Society Scholarship Award, the J. Lloyd Eaton Scholarship Award and a rare British Science Fiction Association Special Award. I recently interviewed Barnett via email because I think Corrupted Science is an important book that deserves as wide an audience as possible.    How did you come to write Corrupted Science?  The book grew naturally out of a previous nonfiction book of mine, Discarded Science (2006). The earlier book was concerned with notions and hypotheses which over the centuries science had, as it were, deposited by the wayside—from the flat earth to the music of the spheres to Creationism, the luminiferous aether, and beyond. While I was writing it, it became apparent to me that there was a qualitative difference between those notions that were wrong simply because of people’s lack of information—their position along scientific history’s timeline, in effect—and those that were wrong because people were deliberately making them wrong. To take a single example, when Ptolemy maintained that the Earth was the center of the universe, this was because he didn’t know any better: it was a reasonably logical guess considering the state of knowledge in his day. Centuries later, however, when Copernicus and Kepler and Galileo had shown there was a much better explanation for the behavior of the heavens and the Roman Catholic Church was trying to suppress that better explanation, the Vatican was guilty of deliberately corrupting science. The motivation in this instance was a doctrinal one—much like the motivation for most Creationists/IDers today, now I come to think of it. Of course, there have been lots of other motives that have led people—both scientists and non-scientists—to corrupt human knowledge. Personal gain is an obvious one, as is self-deception, but the various ideological motives clearly are likely to have far wider-scale effects. Just think for a moment of the bad anthropology that was used to justify the Nazis’ attempted genocide of “lesser races.”  So the subject of the corruption of science seemed to me to be an important one. Luckily my publisher, Cameron Brown at AAPPL/FF&F, agreed with me—and not only because Discarded Science proved to be a really quite successful book.  The book contains a plethora of amazing stories about science and scientists. What is your own background in science? My own science background is pretty undistinguished, I’m afraid. I’ve always been interested in both sciences and arts, and unfortunately I was channeled in the later years of my school education into an exclusively science track . . . which meant that when I got to university I found myself reading Maths, Physics and Astronomy (at King’s & University Colleges, London) when really I’d have been happier in the Scottish university system where it’d have been open to me to read a mixture of sciences and arts. Whatever, I didn’t have the math ability for this degree course, and lasted just a year. At the end of that time, I was enthralled by the Astronomy part of it all but bored by and lousy at the rest—and it was only some of the Astronomy that I was good at!  So off I hopped to seek a university place reading English Literature. By the time I’d found one, though, I’d managed to start a career in book publishing (as an editor). A major dither: should I ditch my fledgling career to take up the university place I’d sought so long, or should I keep doing what I was very much enjoying and what I seemed to be modestly good at? I decided on the latter, and so the path of the rest of my life was settled.  At that time, though—and perhaps even today—there was, at least in UK book publishing (I’ve no idea what the situation was on this side of the pond), a distinct shortage of editors who were scientifically literate. Although I might not have gained a huge amount of what I should have been gaining during my year at university, I was certainly scientifically literate—and I also retained a passionate interest in cosmology, particle physics, and one or two others of the “sexy” sciences. (Geology and Earth History followed in due course.) So, naturally enough, the publishers I worked for were keen enough to tap what they regarded as this strength of mine and have me editing—and in due course commissioning—books in the field of popular science.So there I was, mixing it with quite a few people who were actually very good scientists, being fired up by them even as I was trying to fire them up to write books for me. And then, wow, I was reading their manuscripts months and months before the public could see them in printed form, and . . . Oh, I was the science fanboy, all right! The result was that, even though my math remains lousy, I began to learn far more science, and about how science works, than I might have had I managed to stick it out at university. I’d still be useless as a working scientist, but I’d become a modestly competent science journalist.  Somewhere along the road I became especially interested in History of Science—another subject to add to my roster of scientific interests! From there came, eventually, the book Discarded Science and, after it, Corrupted Science.  How much research was involved?  Oh, heck, a lot! There were a few extremely useful books I could read on specific aspects of the subject, and they were very helpful. For the most part, though, I had to cast my net pretty wide and hope to catch a fish here and there. It was very helpful that I’d written Discarded Science, because at least I was pretty well aware of the directions in which I should be casting my net. I have no idea how many books I consulted in search of goodies—certainly far more than are listed in the Bibliography. Also, of course, I made extensive use of the internet: my subscription to New Scientist meant I had access to their fairly enormous archive, but even more useful, I think, were the online archives of the major newspapers, which allowed me to nail down details that might otherwise have been elusive while at the same time allowing me to gain at least some understanding of how events looked to people at the time.  There was another way in which the newspaper archives were useful. It had been evident to me from early on that, in the part of the book which discusses the corruption of science by political regimes, the activities of the current US Administration had to be an important element: it is not a topic that anyone interested in the integrity of science can actually fail to notice. It is, however, a topic about which our mainstream political punditry and journalism seem to be, for the most part, in complete denial. (Some, like the New York Times, are less guilty than most.) However, even though the newspapers and especially the broadcast media have shown themselves overall completely incompetent in this respect, that doesn’t mean their journalists—mostly but not always their science correspondents—haven’t been keeping a tag on events as they’ve unfolded. So, for example, while I could find occasional accounts of the muzzling of James Hansen elsewhere (often in partisan sources, which raised problems in itself), to find out what had really happened—or at least the best approximation to it—I had to read contemporary newspaper accounts.  Incidentally, because of my discussion of the Bush Administration’s corruption of science—alongside that perpetrated by other regimes, let it be noted—I’ve been occasionally lambasted by rightist critics as having an anti-conservative political bias. I very much resent this accusation. If the Bush Administration had not so extensively corrupted US science then it wouldn’t and indeed couldn’t feature in the book; that’s basic logic. The rest of the Administration’s activities, whether they’re to the right or left, are irrelevant to the subject of Corrupted Science. I think the rightist critics are, with the accusation, merely trying to deflect attention away from the facts I present. I kind of wish they’d grow up. I also wish they’d stop regarding other readers as being so stupid as to fall for this kind of nonsense.  Did you have any help with the research?  My wife Pam helped me with some of it, but she’s no scientist so essentially it was up to me. I was also e-chatted incessantly with friends, and many useful bits of information came out of that.  How did you decide to structure the book the way you did?  To be honest, it wasn’t so much me who structured the book as the book itself that did so! As I was working on it, things just seemed naturally to fall into place. The other day I came across my original synopsis for the book—the proposal I’d put forward to AAPPL—and I laughed aloud. It was completely different in structure to how the final book turned out.  What’s your favorite part of the book?  That’s a difficult one to answer, because of course they’re all favorite parts! But, if I were to be stranded on a desert island with only a single section of the book to keep me company . . . Well, I thought I did pretty well with the longish chapters on the ideological and political corruptions of science, and the chapter on scientific idiocies by the military makes me grin, but probably my favorite chapter is the one on scientists who’ve corrupted their own science not through any mendacity or ideological blinders but through straightforward self-deception. Every time I think of some of the cases in that chapter it makes me re-examine myself and my own preconceptions a little more rigorously!  I was reading recently about the idea of the belief engine, and how it’s hardwired into us to believe things. (I touch upon this from time to time in Corrupted Science, although with a rather different emphasis.) The believing part is important; the truth or falsehood of the things believed in is very much secondary, so far as our psychological hardwiring is concerned. This makes all of us very vulnerable to delusional beliefs, of course (who was it who first said that the trouble with having an open mind is that people come along and dump their trash in it?), but scientists have perhaps an extra vulnerability, since they tend to be better than most of us at constructing hypotheses—it’s their job, after all! Look at the way Ptolemy (again!) had to add more and more complications, epicycle after epicycle, to his Earth-centered theory of the universe. He was very good at making those adaptations, too—in fact, one of the reasons people were slow to accept the Copernican, sun-centered hypothesis was that the Ptolemaic one, ludicrously complicated though it was, gave more accurate results. (Not until Kepler realized the planets move in ellipses, not circles, did the Copernican model become a reliable tool.) If Ptolemy had been less good at constructing these additional sub-hypotheses, as it were, then it might have dawned on him that some of his contemporaries, who thought the Earth and planets went around the sun, could well be right . . .  Was there anything you had to leave out?  Quite a lot—a difficulty with all my nonfiction books, I’m afraid! When I first started out in publishing, if an author delivered a book 50% longer than anticipated, that was just dandy, because it meant you could put a higher cover price on it. Nowadays, of course, with everything budgeted in advance and various editions likely sold to book clubs or foreign publishers, you’ve got to try a bit harder to keep texts to the pre-ordained length. I had to cut my penultimate draft by about a quarter, and did so largely by removing a long chapter on false cryptozoology, the fakery of fossil animals and anthropoids, etc.  But it shall not be wasted, oh no. At least of some of all this will be going into my forthcoming book, Bogus Science.  What would you really like readers to take away from the book?  That the corruption of science, being more truly phrased as the corruption of human knowledge, is IMPORTANT.  We all suffer whenever someone indulges in the wholesale falsification or suppression of knowledge. The most serious suppression of knowledge at the moment is in connection with global warming, where media and corrupt or just plain dimwitted politicians have conspired in the idiotic pretense that there’s still debate within the scientific community about the reality. There ain’t. There’s debate about some of the details, but the only dissent within the climatological community about the reality of global warming is from a handful of mavericks. All power to those mavericks, but their rather noisy existence doesn’t imply that the climatological community is riven with doubt.  Because of the media/political pretense, the most important player in the quest to ameliorate the complete hell that’s facing our children and grandchildren, the USA, has done almost completely nothing for what may very well have been the crux years—those years in which something could have been done to stave off the worst.  I thought at least the current crop of US presidential hopefuls had cottoned on to the urgency of the need to take action. Now I discover that two of them—McCain and Clinton—are proposing a “holiday” from gas taxes this summer, to encourage consumers to drive more miles than they might otherwise do—i.e., to add more greenhouse gases to the atmosphere. It’s hard to imagine quite how imbecilic one must be to imagine this could be a good thing.  But it’s not just at the political level that seeking to corrupt others’ knowledge is a dangerous and indeed criminal act. As I say, it affects all of us. Look at a whole list of cases where drug companies have suppressed knowledge of harmful side-effects some of their products can display. I could go on almost indefinitely!  What are you working on now?  As mentioned, my main focus right at this moment is the nonfiction book Bogus Science, while I’m also girding my loins for a biggish book on film noir, which is a passion of mine. I’ve just finished writing a cute children’s book called The Velociraptor that Came for Christmas, which my friend Bob Eggleton plans to illustrate; we’ve not yet started hawking it around to publishers. I also have to look vaguely alert for the publication this year of two novels—The Dragons of Manhattan (Screaming Dreams Press, any day now) and Leaving Fortusa (Norilana Books, Fall)—and a novella (The City in These Pages, PS Publishing, Fall). And there are various short stories demanding to be written. Life’s a bit hectic right now! Jeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.  Jeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "text": "Interview\nJohn Grant and Paul Barnett Agree: Science Has Been Corrupted\n“John Grant” is the pen name Paul Barnett uses for his non-editorial work, including the book Corrupted Science, a compendium through the ages of situations in which facts have been trumped by ideology, pride, selfishness, and avarice.\nCorrupted Science made a USA Today best-of list last year and has recently been prominently displayed on the gift book table of a major brick-and-mortar chain. Although not fictional, Corrupted Science often reads like fiction. This reader, at least, could not believe the sheer extent of stupidity and pigheadedness on display. It makes for exciting reading, even as you wince at some of the worst examples. Others, however, are laugh-out-loud funny. The genius of Grant-Barnett’s achievement is both in its encyclopedic completeness and the way in which the author still manages to breathe life into each anecdote. The compact and stylish design of the book doesn’t hurt—you’ll want to keep this one on your shelf of favorites for both its content and its look.\nBarnett, as Grant, has written sixty-odd books, about twenty-five are fiction. They include The Far-Enough Window, The Hundredfold Problem, Albion, The World, Qinmeartha and the Girl-Child LoChi (published as half of a “double” with Colin Wilson’s The Tomb of the Old Ones), two collaborative parodies with David Langford (Earthdoom and Guts) and the twelve novels of the Legends of Lone Wolf series. His serial novel The Dragons of Manhattan was published online during the latter part of 2003 by the global journalism website Blue Ear; it has just been published in a print edition by the UK publisher Screaming Dreams Press.\nHis best known works of nonfiction are The Encyclopedia of Walt Disney’s Animated Characters (three editions), The Encyclopedia of Fantasy (done with John Clute) and most recently The Chesley Awards for Science Fiction and Fantasy Art: A Retrospective (done with Elizabeth Humphrey and Pamela D. Scoville). As John Grant he has received two Hugo Awards, the World Fantasy Award, the Mythopoeic Society Scholarship Award, the J. Lloyd Eaton Scholarship Award and a rare British Science Fiction Association Special Award.\nI recently interviewed Barnett via email because I think Corrupted Science is an important book that deserves as wide an audience as possible.\nHow did you come to write Corrupted Science?\nThe book grew naturally out of a previous nonfiction book of mine, Discarded Science (2006). The earlier book was concerned with notions and hypotheses which over the centuries science had, as it were, deposited by the wayside—from the flat earth to the music of the spheres to Creationism, the luminiferous aether, and beyond. While I was writing it, it became apparent to me that there was a qualitative difference between those notions that were wrong simply because of people’s lack of information—their position along scientific history’s timeline, in effect—and those that were wrong because people were deliberately making them wrong.\nTo take a single example, when Ptolemy maintained that the Earth was the center of the universe, this was because he didn’t know any better: it was a reasonably logical guess considering the state of knowledge in his day. Centuries later, however, when Copernicus and Kepler and Galileo had shown there was a much better explanation for the behavior of the heavens and the Roman Catholic Church was trying to suppress that better explanation, the Vatican was guilty of deliberately corrupting science. The motivation in this instance was a doctrinal one—much like the motivation for most Creationists/IDers today, now I come to think of it. Of course, there have been lots of other motives that have led people—both scientists and non-scientists—to corrupt human knowledge. Personal gain is an obvious one, as is self-deception, but the various ideological motives clearly are likely to have far wider-scale effects. Just think for a moment of the bad anthropology that was used to justify the Nazis’ attempted genocide of “lesser races.”\nSo the subject of the corruption of science seemed to me to be an important one. Luckily my publisher, Cameron Brown at AAPPL/FF&F, agreed with me—and not only because Discarded Science proved to be a really quite successful book.\nThe book contains a plethora of amazing stories about science and scientists. What is your own background in science?\nMy own science background is pretty undistinguished, I’m afraid. I’ve always been interested in both sciences and arts, and unfortunately I was channeled in the later years of my school education into an exclusively science track . . . which meant that when I got to university I found myself reading Maths, Physics and Astronomy (at King’s & University Colleges, London) when really I’d have been happier in the Scottish university system where it’d have been open to me to read a mixture of sciences and arts. Whatever, I didn’t have the math ability for this degree course, and lasted just a year. At the end of that time, I was enthralled by the Astronomy part of it all but bored by and lousy at the rest—and it was only some of the Astronomy that I was good at!\nSo off I hopped to seek a university place reading English Literature. By the time I’d found one, though, I’d managed to start a career in book publishing (as an editor). A major dither: should I ditch my fledgling career to take up the university place I’d sought so long, or should I keep doing what I was very much enjoying and what I seemed to be modestly good at? I decided on the latter, and so the path of the rest of my life was settled.\nAt that time, though—and perhaps even today—there was, at least in UK book publishing (I’ve no idea what the situation was on this side of the pond), a distinct shortage of editors who were scientifically literate. Although I might not have gained a huge amount of what I should have been gaining during my year at university, I was certainly scientifically literate—and I also retained a passionate interest in cosmology, particle physics, and one or two others of the “sexy” sciences. (Geology and Earth History followed in due course.) So, naturally enough, the publishers I worked for were keen enough to tap what they regarded as this strength of mine and have me editing—and in due course commissioning—books in the field of popular science.So there I was, mixing it with quite a few people who were actually very good scientists, being fired up by them even as I was trying to fire them up to write books for me. And then, wow, I was reading their manuscripts months and months before the public could see them in printed form, and . . . Oh, I was the science fanboy, all right! The result was that, even though my math remains lousy, I began to learn far more science, and about how science works, than I might have had I managed to stick it out at university. I’d still be useless as a working scientist, but I’d become a modestly competent science journalist.\nSomewhere along the road I became especially interested in History of Science—another subject to add to my roster of scientific interests! From there came, eventually, the book Discarded Science and, after it, Corrupted Science.\nHow much research was involved?\nOh, heck, a lot! There were a few extremely useful books I could read on specific aspects of the subject, and they were very helpful. For the most part, though, I had to cast my net pretty wide and hope to catch a fish here and there. It was very helpful that I’d written Discarded Science, because at least I was pretty well aware of the directions in which I should be casting my net. I have no idea how many books I consulted in search of goodies—certainly far more than are listed in the Bibliography. Also, of course, I made extensive use of the internet: my subscription to New Scientist meant I had access to their fairly enormous archive, but even more useful, I think, were the online archives of the major newspapers, which allowed me to nail down details that might otherwise have been elusive while at the same time allowing me to gain at least some understanding of how events looked to people at the time.\nThere was another way in which the newspaper archives were useful. It had been evident to me from early on that, in the part of the book which discusses the corruption of science by political regimes, the activities of the current US Administration had to be an important element: it is not a topic that anyone interested in the integrity of science can actually fail to notice. It is, however, a topic about which our mainstream political punditry and journalism seem to be, for the most part, in complete denial. (Some, like the New York Times, are less guilty than most.) However, even though the newspapers and especially the broadcast media have shown themselves overall completely incompetent in this respect, that doesn’t mean their journalists—mostly but not always their science correspondents—haven’t been keeping a tag on events as they’ve unfolded. So, for example, while I could find occasional accounts of the muzzling of James Hansen elsewhere (often in partisan sources, which raised problems in itself), to find out what had really happened—or at least the best approximation to it—I had to read contemporary newspaper accounts.\nIncidentally, because of my discussion of the Bush Administration’s corruption of science—alongside that perpetrated by other regimes, let it be noted—I’ve been occasionally lambasted by rightist critics as having an anti-conservative political bias. I very much resent this accusation. If the Bush Administration had not so extensively corrupted US science then it wouldn’t and indeed couldn’t feature in the book; that’s basic logic. The rest of the Administration’s activities, whether they’re to the right or left, are irrelevant to the subject of Corrupted Science. I think the rightist critics are, with the accusation, merely trying to deflect attention away from the facts I present. I kind of wish they’d grow up. I also wish they’d stop regarding other readers as being so stupid as to fall for this kind of nonsense.\nDid you have any help with the research?\nMy wife Pam helped me with some of it, but she’s no scientist so essentially it was up to me. I was also e-chatted incessantly with friends, and many useful bits of information came out of that.\nHow did you decide to structure the book the way you did?\nTo be honest, it wasn’t so much me who structured the book as the book itself that did so! As I was working on it, things just seemed naturally to fall into place. The other day I came across my original synopsis for the book—the proposal I’d put forward to AAPPL—and I laughed aloud. It was completely different in structure to how the final book turned out.\nWhat’s your favorite part of the book?\nThat’s a difficult one to answer, because of course they’re all favorite parts! But, if I were to be stranded on a desert island with only a single section of the book to keep me company . . . Well, I thought I did pretty well with the longish chapters on the ideological and political corruptions of science, and the chapter on scientific idiocies by the military makes me grin, but probably my favorite chapter is the one on scientists who’ve corrupted their own science not through any mendacity or ideological blinders but through straightforward self-deception. Every time I think of some of the cases in that chapter it makes me re-examine myself and my own preconceptions a little more rigorously!\nI was reading recently about the idea of the belief engine, and how it’s hardwired into us to believe things. (I touch upon this from time to time in Corrupted Science, although with a rather different emphasis.) The believing part is important; the truth or falsehood of the things believed in is very much secondary, so far as our psychological hardwiring is concerned. This makes all of us very vulnerable to delusional beliefs, of course (who was it who first said that the trouble with having an open mind is that people come along and dump their trash in it?), but scientists have perhaps an extra vulnerability, since they tend to be better than most of us at constructing hypotheses—it’s their job, after all! Look at the way Ptolemy (again!) had to add more and more complications, epicycle after epicycle, to his Earth-centered theory of the universe. He was very good at making those adaptations, too—in fact, one of the reasons people were slow to accept the Copernican, sun-centered hypothesis was that the Ptolemaic one, ludicrously complicated though it was, gave more accurate results. (Not until Kepler realized the planets move in ellipses, not circles, did the Copernican model become a reliable tool.) If Ptolemy had been less good at constructing these additional sub-hypotheses, as it were, then it might have dawned on him that some of his contemporaries, who thought the Earth and planets went around the sun, could well be right . . .\nWas there anything you had to leave out?\nQuite a lot—a difficulty with all my nonfiction books, I’m afraid! When I first started out in publishing, if an author delivered a book 50% longer than anticipated, that was just dandy, because it meant you could put a higher cover price on it. Nowadays, of course, with everything budgeted in advance and various editions likely sold to book clubs or foreign publishers, you’ve got to try a bit harder to keep texts to the pre-ordained length. I had to cut my penultimate draft by about a quarter, and did so largely by removing a long chapter on false cryptozoology, the fakery of fossil animals and anthropoids, etc.\nBut it shall not be wasted, oh no. At least of some of all this will be going into my forthcoming book, Bogus Science.\nWhat would you really like readers to take away from the book?\nThat the corruption of science, being more truly phrased as the corruption of human knowledge, is IMPORTANT.\nWe all suffer whenever someone indulges in the wholesale falsification or suppression of knowledge. The most serious suppression of knowledge at the moment is in connection with global warming, where media and corrupt or just plain dimwitted politicians have conspired in the idiotic pretense that there’s still debate within the scientific community about the reality. There ain’t. There’s debate about some of the details, but the only dissent within the climatological community about the reality of global warming is from a handful of mavericks. All power to those mavericks, but their rather noisy existence doesn’t imply that the climatological community is riven with doubt.\nBecause of the media/political pretense, the most important player in the quest to ameliorate the complete hell that’s facing our children and grandchildren, the USA, has done almost completely nothing for what may very well have been the crux years—those years in which something could have been done to stave off the worst.\nI thought at least the current crop of US presidential hopefuls had cottoned on to the urgency of the need to take action. Now I discover that two of them—McCain and Clinton—are proposing a “holiday” from gas taxes this summer, to encourage consumers to drive more miles than they might otherwise do—i.e., to add more greenhouse gases to the atmosphere. It’s hard to imagine quite how imbecilic one must be to imagine this could be a good thing.\nBut it’s not just at the political level that seeking to corrupt others’ knowledge is a dangerous and indeed criminal act. As I say, it affects all of us. Look at a whole list of cases where drug companies have suppressed knowledge of harmful side-effects some of their products can display. I could go on almost indefinitely!\nWhat are you working on now?\nAs mentioned, my main focus right at this moment is the nonfiction book Bogus Science, while I’m also girding my loins for a biggish book on film noir, which is a passion of mine. I’ve just finished writing a cute children’s book called The Velociraptor that Came for Christmas, which my friend Bob Eggleton plans to illustrate; we’ve not yet started hawking it around to publishers. I also have to look vaguely alert for the publication this year of two novels—The Dragons of Manhattan (Screaming Dreams Press, any day now) and Leaving Fortusa (Norilana Books, Fall)—and a novella (The City in These Pages, PS Publishing, Fall). And there are various short stories demanding to be written. Life’s a bit hectic right now!\nJeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\nJeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "source": "https://clarkesworldmagazine.com/grant_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: John Grant and Paul Barnett Agree: Science Has Been Corrupted by Jeff VanderMeer"}