{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Samantha Murray", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "99J8IvNmp7gpjViw47wo06D1RME=", "id": null, "license": null, "comments": "", "raw_text": "9700 words, novelette  Preserved in Amber  2021 Winner: Aurealis Award for Best Science Fiction Novella  You can leave a place for a long, long time. You can leave a place for a long time and never really leave. And yet never know it, until you come back to find that a part of you is waiting there, has been waiting there, all along.  Niu Yi  The taxi from Guiyang Airport passed through long tunnels with curved white crescents every fifty or so meters along. It was simply some reflective material, but the bright curves leading her off into the distance through the darkness of the tunnel made her think of an Einstein-Rosen bridge, a tunnel through space-time. Is this what it will be like? Niu Yi thought, slightly nauseated from the jet lag and the speed with which the driver was taking the bends, and from the acrid sweetness of his cigarette smoke that still invaded the car’s cabin even though he has hand rested nonchalantly out of the window. Probably not. It probably wouldn’t be anything like this at all. And yet, this endless car ride, this long, long tunnel under the mountain, she could feel herself leaving one world for another. And maybe it would be a little like that, after all.  After nearly two hours of quiet smoking and occasional spitting out the window, Niu Yi’s driver abruptly started talking.  “I took my sister out on a long drive like this with a passenger once,” he said, making eye contact with Niu Yi in the rearview mirror. “It made her throw up, the trip was so long. That wasn’t even as far as this one, but I’m a driver, I’ve been driving more than twenty years now. I know distance. Still, this is far. This is a long way.”  A long way.  He’d been arranged to come out from Guizhou province to pick her up, as drivers from the airport would not have taken this fare. So it was a return journey for him, and people in this part of Zhenyuan County typically still did not travel far, Niu Yi knew. A long way. She thought of where she would be going in only a few months, and the irony flickered lightly over her and then vanished. For this was. She agreed with her driver. This was a long way.  “I have two sons now,” he told her later, after the roads had become more winding, nearing Danzhai. He took his other hand off the wheel too for one alarming moment, to pass her his phone, two small boys on the screen, the larger one smirking at the camera, the other wide-eyed and solemn.  “Congratulations,” Niu Yi said, and meant it. “They’re cute.”  “Yes, yes, and they’re smart,” he said. “So smart. I never thought we’d have two. But it raises a dilemma now.” Now that he had started talking, the words were like a stream trickling down the mountain, picking up speed and volume as it went. “When I die, I’d like to make the memory-gift, and now I have to choose among my boys. Fu is my firstborn, but it does not feel fair that his brother gets nothing.” He used the Miao word for gift, Khoom Plig, but the Han word for memory, Jiyi, marrying them together.  “I’m sure they’ll understand,” she reassured him warmly, because it seemed important, and because after the hours and the distance and the darkness of the tunnels, she felt like they were in this together, somehow.  “Yes,” he said, and his cigarette ash tipped, toppled, and swirled by the window past her and away. “Yes.”  Niu Yi’s grandmother’s village was called “The end of the mountain,” in Miao language. The next leg of Niu Yi’s journey to get there was a precarious minivan ride up an unenclosed road. The left side of the road dropped away steeply, opening up to a hazy vista of rice-terraces stepping in their graduated deliberate way down the mountain. Niu Yi moved over in her seat, almost unconsciously. She felt like her mind was clinging to the side of the mountain, as if not gripping hard mentally, she might drift away. All of the stilted houses clung to the mountain too. Niu Yi could imagine the mountain waking up, shaking itself like a shaggy dog, and flinging them all off, into the broad openness, into the misty sky.  Her grandmother was making her way out of the front of her house as Niu Yi wheeled her small case of luggage up the steep gravelly path, chickens scattering out of her way, their quick rapid steps followed by slow wandering, to quicken again as she got closer. Quick-quick-quick-slow-slow.  Soft Miao words were murmured in greeting, as Niu Yi bent down so that she could be squeezed hard. My dear. Her grandmother’s previously bright dark eyes were filmy and distant, and she reached out for Niu Yi with her hands. The deep lines on her face had become crevasses and gulches. But Niu Yi could read welcome in the way her grandmother gripped her arms tightly.  Everything looked the same. Niu Yi had tried to remember her grandmother’s house several times on the journey here, but she’d known her mind wouldn’t work that way, and details remained stubbornly elusive. But now a surge of familiarity coursed through her in a way that felt warming and relaxing both together. That’s right, this is how it was. Just like this.  Out through the window Niu Yi could see a drone glinting off in the distance, and her grandmother’s phone resting on a little batik mat at the edge of the table was almost as sleek and modern and shiny as Niu Yi’s own, but these touches of technology felt fleeting, superimposed over a village that felt somehow outside of time, untouched by the sweep of years.  Her grandmother scooped her oil tea from an earthen pot older than Niu Yi herself.  “Mmm, it’s good,” Niu Yi nodded over her tea. The ginger salt and oil was hot and sour, and sustaining.  “You are welcome,” her grandmother said. The warmth of the word spread out, encompassing more than just the tea.  “I wanted to come back here, to see you again before . . . ”  “Before you go.” Her grandmother nodded. “You wanted to come home.  Biological immortality is a state in which the rate of mortality from senescence is stable or decreasing, thus decoupling it from chronological age.  There are no defined limits to life for amoebas, they have no set life span and have the potential to maintain their structure indefinitely. They die—of injury or disease or changes to the environment. But not old age.  But we are wired to self-destruct over time-immortal genes in throwaway bodies.  Vanda  The ship Vermilion-Amber-Sunset-Tangerine looked like streaks of thick paint, plastered heavy-handedly across an arc of the sky. Sunlight loved it, sunlight bounced off it in all directions, faceted, fractured. At night you couldn’t see it at all, only the familiar stars displaced into shifted positions, slightly blurred.  Vanda had first seen the VAST in the sky, not on a viewer or screen or image, not as a newsbreak or on social media or one of the messages that spread around the globe with wildfire speed.  She had been staying at Carbla Station, studying the stromatolites as part of her genomics research. Carbla Station was a private property, a huge sheep station, but the owners allowed particular scientific groups access to the property, because their land had the only access to the section of beach she needed. Carbla beach was made of tiny white shells, and on the edge of the beach, and in the water, were living stromatolites. They looked like rocks, but the structures were actually produced by the excretions of microorganisms. The genes of these lifeforms were the same as those that had existed over three billion years ago. Genes were little Von Neumann machines, and these were the closest they came to being immortal.  Vanda had been outside, close to her accommodation at the shearer’s quarters on the station. It was very basic accommodation, and Vanda had had to remove a tick from her calf after her first night there on the little wire-framed camp bed. Later, her mind would keep persisting that there had been a sound, something to make her look up. But she could not remember an actual sound, and no one else reported one, later. It may instead have been an absence of sound or an odd quality to the air, like a sucking-in of oxygen, or a limning of the light. Whatever it was that she couldn’t quite recall, it prickled her like prescience, and she looked up.  Dr. Vanda Michael was part of the multidisciplinary team based just outside of the small coastal town of Denham in Western Australia, working to translate the alien communications. Teams were working this same problem all around the world, but the Denham site was the most prestigious, working in the shadow of the VAST itself, figuratively anyway, as the VAST cast no real shadow. Vanda still battled with her own internal imposter syndrome at the elements of luck and timing to her own inclusion, getting to work with the eminent and brilliant academics and scientists that had gathered here.  One of them was speaking to her now. Dr. Liah Je was small, sleek, and solemn, and somewhat younger in person than her reputation had suggested.  “These calculations are nefarious,” she said to Vanda, stepping away from her screen and pushing a strand of dark hair back from her face.  “Iniquitous even,” Vanda answered, grinning.  “Heinous,” Liah noted, with her usual reserved manner. Vanda wasn’t fooled, not anymore. In the weeks since they had started working together, the unfailingly dedicated and highly regarded Dr. Je had shown herself to be in possession of a previously unguessed sly sense of humor. “It’s almost enough to drive me to drink.” she added, then.  It might be an overture. Vanda generally had trouble with social cues.  “There’s that pub in Shark Bay the physics crew were talking about,” she ventured. “And it’s Friday. We could have beer?”  A small pause followed her words. Vanda knew that if she took three strides toward the window, she would be able to catch a glimpse of the VAST overhead. Their makeshift lab had been quickly constructed, but it was much more comfortable than the shearers’ quarters had been. She didn’t usually ever drink. And she didn’t usually do well at making friends either. But an alien ship was sitting in the sky, with colors that made your heart break. And maybe all bets were off now. Maybe old things would just fall away.  “Beer, hmm?” said Dr. Liah Je. “I could do that.”  Niu Yi  From where Niu Yi sat she could see the village sprawling below her, and she scanned the sky as if there was something missing, although she’d never seen the VAST, not in person, not yet. The sky was reaching toward blue today. It would be summer soon. The seasons got under Niu Yi’s skin, sometimes it felt like she could trace the origin of her moods to the weather, the wind, the temperature. As the days warmed and grew longer, something in Niu Yi always woke, and stretched. It was an uplift to her spirit that somehow managed to catch her by surprise every time. She called it the “gasp of summer.” But there would be no seasons in space. And definitely not Underlight, or wherever it was she was going. She wondered if her mind and her emotions would be smooth and unchanging there, rather than changing in quick sharp spikes like they were wont to do.  She looked down at the paper in her lap. I wish I could draw. She’d tried. She’d brought a sketch pad and a selection of felt pens out here to try and record what she saw. Not that she could take it with her. But somehow she felt like if she could get it to stay on the page, maybe she could get it to stick in her mind too.  There were so many sketches and paintings on small canvasses piled up against one another in the corners of her grandmother’s small house. Stacks of them in the corner of the room Niu Yi slept in, depicting so many different slants of life in this village. Her grandmother always drew the things she could see, the huts and motorbikes and chickens. The mountain and the sky. The faces of the people, a story to be read in every expression, in the lines on a face. Niu Yi wished she had inherited the skill, even a little of it. The ability to draw some marks on a page, and have them suddenly become meaningful. The lines Niu Yi drew remained stubbornly just lines and nothing else, and she crumpled up her pages in frustration.  With a pang, Niu Yi thought of her grandmother’s filmy eyes and the way her grandmother tilted her chin toward wherever Niu Yi’s voice was coming from, or turned her face with small seeking movements toward the sunlight coming in the window. Her grandmother couldn’t draw anymore, either.  Niu Yi tried to press the images into her mind, like flowers into velvet. The particular deep green to the thatched roofs, the little curve up at the edge, the line it made against the sky. The rich red of the flaking wood.  But it would not stay. It never did.  Niu Yi couldn’t remember when she’d found out that other people could see pictures in their head. She could remember her dumbfounded disbelief though, when it had clicked that when other people spoke of imagining things in their mind that they meant it literally. When Niu Yi closed her eyes and tried to conjure her grandmother’s face, she couldn’t get the image to coalesce. Her mental canvass remained blank and unresponsive. She’d looked this up on her phone a couple of years ago and only found an English word for it; aphantasia. While it was nice to know she wasn’t the only one who lacked this ability, she wished there was a word in Miao language for it.  Many of the stilted houses in the village had red signs running down the length of their windows, tacked up both sides and over the top. “They’re prayers,” Niu Yi could remember her grandmother telling her when she was a little girl, watching her crane her head to try and read the writing. “Prayers for a better life.” Her grandmother’s windows were bare. Niu Yi had always supposed that was because her grandmother already had the best life.  There was a sense here, of everything falling down and being built up at the same time. Building materials stacked in precarious piles everywhere, construction, villagers industriously working on roofs all together, digging trenches. Children and dogs and chickens spilling forth into the road. Niu Yi wished she could take a picture, a video, something that would last, an image that would stick with her that she could trust. Unlike her fractured memory, her blank mind. Her thoughts preceded her down the mountain, tumbling and broken. There was rubble on the side of the road, part of the mountain, already fallen.  Vanda  When she was four, Vanda had worked out the concept of death, and she’d gripped it tightly, or it had gripped her, or both, unable to let go. When her mother had tucked her up in bed, when the sleepy songs had been sung and the kisses and hugs and goodnights all done and uttered, and her mother was trying to drift ghostlike out of the room, that was when the questions would swell like a wave within her.  “When will you die, Mummy?”  Her mother sighed. “Not for a long time. Not for many years. You’ll be all grown up yourself.”  Vanda tried to imagine being all grown up. It didn’t help.  “I don’t want you to die, Mummy. Ever.” And she’d started to cry soft tears.  Her mother would be a little reluctantly drawn back into the darkened room by her distress.  “It’s okay. Everything dies one day, in the end.”  Vanda did not know how her mother could possibly mean this to be comforting. “Everything?”  “Yes.”  “And everyone?”  “Eventually. After a long, long time. Don’t worry about it now, it’s sleepy time.”  Vanda did not see how she would sleep with this enormous truth sitting on the middle of her chest.  “But I don’t want you to die! Don’t you care? Don’t you mind?”  Her mother hesitated a little. “I’ll have lived a good long life by then.” There was something about the edges of her mother’s eyes that Vanda wasn’t sure about.  “Sleep tight now,” her mother kissed her forehead and drew her hand slowly out of Vanda’s clutching fingers. “No more calling out.”  “I don’t want to die either,” Vanda said, very softly. Her mother had gone back to her television show, Vanda could hear the muted sounds of tinned laughter. Even when she was very old, with wrinkly hands and white, white hair, she knew she would still mind.  Genes are memories. The delicate patterning of a dragonfly’s wings can persist long after mountains have worn down into the sea.  The pub at Shark Bay bore the literal name of “The Old Pub.” It was right off Main Street, and pleasant, if mediocre. The signage proclaimed it the most Western pub in Australia.  “So many people,” murmured Vanda as she maneuvered to their little high corner table with two beers in her hands.  “Of course,” said Liah. She’d changed into a dark-blue collared shirt of some delicate material, and looked immaculate as ever. “They’ve all come to see the VAST.”  “Poor dolphins,” said Vanda. Tourists had historically come to this region of Western Australia to see the dolphins as they swam up to the beach at Monkey Mia to be fed.  “Oh, I’m sure they stop in at the dolphins too while they’re here,” Liah said with a wry note in her voice. She sipped her beer. Then her head came up and she looked into the distance, as if stunned.  “Liah?” Vanda said, after a moment.  Liah turned to her, eyes still unfocused. “My father came here once,” she said, her voice so soft Vanda had to lean in to catch it over the background hubbub.  “He worked in Western Australia for a while in his early twenties,” Liah continued slowly. “This I knew. But he came up here one weekend. Not with my mother, this was before he met my mother. He came with another girl. They sat . . . ” Liah turned toward the bar and pointed. “Over there. There used to be a pool table in the middle there.”  “You have your father’s memories?” Vanda’s voice inflected upward, but it wasn’t really a question. She’d known that Liah Je had been one of the first few people in Australia to undergo the M-transfer, it had been on the news broadcasts, over a year ago. In China and a lot of Europe the procedure was becoming really common, available to wide swathes of the populations, but Australia was a slow adopter of the technology. Currently it was restricted to people who could show a case for potential advancement of knowledge in some field considered valuable in terms of likelihood of paying back to society.  “The girl was pretty,” Liah said. “She wore this flimsy orange sundress, and a bead of sweat ran down her neck and rested at her collarbone. It was hot, I guess.” Liah looked up then, and straight into Vanda’s eyes. “Yes, I have his memories,” she said, as if only just hearing the question.  “Did it hurt?” Vanda asked before wanting to kick herself in case she was prying. She really didn’t know how to navigate this friendship stuff.  “Not in the way you think,” Liah said. She still hadn’t dropped her gaze.  “Your father was brilliant,” Vanda said.  “Yes.” Liah said. “He was driven too. That is good, sometimes.” She looked away, and Vanda felt a brief stab that felt like the loss of something. “I was concerned, about the transfer. I did not want to become my father.” She looked at her beer as if she had forgotten she held it. “But it doesn’t work that way.”  “How does it work?” Vanda said gently.  “I don’t get his emotions, his thoughts,” Liah said, her detached scientific manner returning. “Just the content, not the context I guess. I’ve tried to leave the personal stuff alone, not look at it. But sometimes, like just then, it just bobs up at the surface. Like flotsam. The flotsam of a life.”  “Your father must have been glad he had you,” Vanda thought of her own parents. Her father, gone, all of his memories, lost, irretrievable. And her mother’s memories would not be gifts.  Something about Liah’s mouth hardened, and Vanda thought she’d probably said the wrong thing. This sharing of confidence with her much-respected colleague felt new and fragile, and Vanda was afraid it would drift away like dandelion fluff at the slightest disruption.  “He was a . . . possessive man, my father,” Liah said finally. “He held his knowledge tight against his chest, as if other people wanted to steal it from him. But he was dying. It makes people desperate, sometimes. He wanted to live on. And so.”  Vanda didn’t say anything, letting the silence pool between them. Her ex-husband had not been a fan of silence. If Vanda fell silent, searching for what she wanted to say or trying to work out what it was she really felt, or just simply pausing to consider, he would dash in and fill the space with his own words. His words were charming, convincing, and charismatic most of the time. But they were his, not hers.  Liah’s words came slowly forth into the space that had been left for them. “But he doesn’t. I have his memories. But I am not him.”  I’m glad, thought Vanda, but she looked down at the dregs of her beer instead of saying so.  “At first I was worried too, that people would think my results . . . weren’t mine somehow, anymore. But I don’t care. If it helps me. It opens doors.” The look she threw Vanda was oddly defiant. “People want my father’s insights. The way he would combine two apparently separate ideas, and only then would you see that they were fundamentally isomorphic at some deep level. That is what he had, that is what he could do. I would do anything to get that.”  Vanda waited.  “It doesn’t really work like that, but I’ll take anything I can and use anything I can. I’ll take it.” The ambition that Liah Je was known for made a stark and sudden appearance in her face.  “Yes,” Vanda said. And if they were going to decode the VAST’s secrets they would need all the help they could get. “What did you think when you—”  “First saw the VAST?” Liah smiled, her tension fading, and Vanda could not help smiling in response. It was one of those oft-asked and discussed questions, almost a cliché already. “I was in Sydney,” Liah said. “A friend sent me a message. I thought it was a joke. Once I was finally convinced it was real, I knew it was a game changer. That nothing would ever go back in its box again, you know? I was excited and terrified all at once. I was all lit up and kind of expanded by it. And I kept just . . . crying. It was like being tossed around on some turbulent sea.” She paused. “It’s like there are not the proper words for it.” She shook her head and her dark hair drifted back to where it had been.  “Not the proper words for it,” repeated Vanda. “Do you think that’s our problem? Do you think it’s all in there, but we just won’t ever have the proper words?” She knew that Liah knew what she was talking about. The physicists and cryptanalysts had found mathematical structure in the communications the VAST had been continuously broadcasting since it arrived. They could already tell that some of the data concerned the five platonic solids, and another section the electron configuration of the chemical elements. But the messages were built from only six protein structures, combining, and twining around each other in a way reminiscent of triple-stranded DNA. Vanda knew they were only scratching the surface.  “I’m hoping we’ll find the words,” Liah said. “I’m betting that we do.” She gave a rather irreverent grin. “But you never answered the question.”  “What question?” Vanda said.  “The question you asked me. What was your reaction when you first saw the VAST?”  Vanda paused, to let all of the things she couldn’t express rush into the space.  “I thought it was the end of the world,” she said.  Vanda, somewhere at the back of her mind, had always been waiting for the end of the world. Ruffled out of sleep by the noise of a jet or a truck making an odd low noise in the distance, she would sit up, and wait, and think, is this it? Is this how it comes? She used to wonder what it would sound like; a splintering crash; a high-pitched whine; a deep vibration on the very edge of what she could hear? She felt like she would recognize that moment, when everything ceased to be normal, and became something else instead. The moment when the end came hurtling toward her. The world could end in a million ways, but at its heart, that moment of realization would be deeply familiar, a coming home, a recognition. After all, it wouldn’t be the first time the world had ended.  Niu Yi  “Look at this,” said her grandmother, rubbing her fingers over the top of the picture as if she could glean the information through touch. Her grandmother couldn’t see the photos hardly at all, Niu Yi guessed, but she could remember what each one was, and was unerringly correct.  Niu Yi took the photo out of her grandmother’s hands, and when she looked down at it something hurt. Here was that younger part of herself she thought she’d outgrown and outcast. Here all along, waiting. It was a picture of herself, her hair bunched on both sides of her head, gap-toothed and smiling. Niu Yi had lived with her grandmother here at the end of the mountain until she was nine years old. She looked to be about six in the photo. Her naïve, innocent, hopeful self. It was a happy photo. A happy time.  “You’re just like your mother here,” her grandmother said, tapping the photo gently. “You could be her, almost.”  No. I’m not like her. Niu Yi thought. She put the photo down on the table.  “Grandmother, the hospitals are really good now, they could do a good job to help your eyes. And I have credits, we can use my credits, I have more than enough.” The government had given her more credits than she’d ever dreamed of when she’d been chosen as one of the eight thousand.  Her grandmother shook her head slowly from side to side. “It doesn’t trouble me, I haven’t lost anything, it’s all up here,” she tapped the side of her head, and Niu Yi felt an odd small envy.  “But it would be a gift, grandmother,” Niu Yi said. It was custom to always accept a gift given with a whole heart.  That night, as she tried to go to sleep listening to the eerie unearthly crooning of her grandmother’s chickens roosting under the house, Niu Yi wished she could remember her mother’s face.  Vanda  The first time the world had ended Vanda had been thirteen. Her family had been coming back from the beach, from her brother’s junior swim-squad training. Her mother and father had been in the front of the car. Declan had been eight, only eight, he’d been in the back with her, and she’d just snapped at him to shut up because he’d been trying to sing his stupid team song too loudly in a nasally purposely-out-of-tune voice. They went to overtake a truck that was turning in front of them, but a broken axle caused the truck to spin out of the corner, right into them.  Time had folded back and over on itself like dough, and Vanda had felt like she was lost in the spinning and the screeching sound that was all around her. And then the endless motion and the noise had stopped, and she was sitting in what was left of the back seat, her side wet and warm although nothing hurt yet, nothing hurt at all, listening to her mother howling.  Niu Yi  “You’ve got a visitor,” Niu Yi’s grandmother told her, as she returned to her grandmother’s with yams and carrots. It was such an unexpected and implausible thing for her grandmother to say that Niu Yi stopped and stood still.  A lean, well-dressed man came to the doorway. “Niu Yi,” he said, and took the hand that was not holding the vegetables.  “Jing,” she said. “How can you be here?”  She had met Wan Jing when they had both lived and worked at the Danzhai Wanda Tourist Village. Wanda’s poverty abatement program had built the village back in 2017, nearly thirty years ago. Her mother had moved there shortly after the village was opened, one of the first students to attend the vocational college, leaving Niu Yi with her grandmother. And Niu Yi in her turn had lived there for nearly five years before heading to Shenzhen University. Her grandmother had never left her mountain, thought Niu Yi, then her mother spent her life in within the Qiandongnan Miao and Dong Autonomous Prefecture, and now Niu Yi herself . . . who would go further than dreams.  Jing had left Danzhai Wanda Village seven or eight months earlier than she did, and she hadn’t seen him since.  “You went to study engineering,” she ventured almost shyly, as she showed him through the village, walking under the maple trees. Her grandmother would be killing a chicken to entertain their guest for dinner and had shooed them both out of the house.  “I am an engineer,” Jing said. “I work on the new high-speed train lines. And you wanted to study science.”  Niu Yi shot him a quick look before nodding in acknowledgement. She was surprised he remembered, and he’d left before she’d gone. But he hadn’t stayed in touch, and after he hadn’t returned her first message, she’d not pursued it. He’d vanished like he’d been made of mist. And now he was here.  “I remember you doing the Golden Pheasant Dance at Spring Festival,” Jing said with his soft and easy syllables. “Your face fringed with silver.” The traditional Miao garments involved an intricately beautiful silver headdress, spun light enough to wear on her head. She’d worn a bright pleated skirt, embroidered in the way her grandmother had taught her. And she’d been decked with silver bracelets, anklets, and earrings. There’d been a trick to walking without making noise, although usually making noise was exactly what you wanted to do.  They passed three men tiling a roof, singing together in antiphonal layers.  “And I remember you playing the lusheng,” Niu Yi returned. He’d been good at it, she’d admired his sensitive fingers, and the delicate strains of his music. But she was much more direct these days than she used to be. “Jing, how are you here?”  “Can I not be here?” he said, his voice light, and reminiscent somehow of the way he sang, light yet rich with undertones.  No, thought Niu Yi. This was not the village Jing was from. It made no sense to find him here.  But she made bright conversation with him as they walked up the steep trails, and found herself laughing at his anecdotes. He told her how one of the main problems they were having with the train lines was due to millipedes. The millipedes were drawn to the tracks for some inexplicable reason and made their way along them. But when the train squishes the millipedes, all of those squishy millipede bodies reduce the friction between the train and the track, and all of the stopping time calculations are thrown out, and the drivers have trouble making the trains stop in time. As always, he knew how to pick just the right details to make a story compelling.  “But why, why are they there?” Niu Yi said, her hand over her mouth to try and hold back her giggle.  “No one knows,” Jing said with perfect solemnity.  Jing had always been popular. He had always been at the center of things. Niu Yi had been caught in his orbit, with everyone else. Although it was a far-flung orbit, where she never got too close, always on the periphery.  “Look,” Niu Yi said when she saw where their footsteps had led them. In the center of the village was a long rectangular mural, the sketching engraved directly into long panels of the wood itself. “It’s our history,” she said, almost reverently, her fingers tracing the grooves in the wood, the line of a tree, of maple leaves. The long journey to find a new home. Over mountains, through rivers. The Miao people had only had a written language since the 1950s. Before then the oral histories of a thousand years were passed down in word and song, flowing like a stream. But here it was, right here, in pictures. Pictures she couldn’t take with her.  “There’s some room at the end here.” Jing said, laying his palm on the blank wood.  “I guess the future is unwritten. Or undrawn.” Niu Yi said lightly.  “What’s next for our people? What goes here?” he said, his tone matching the lightness of hers, although his eyes caught hers with an odd intensity. “Space? The stars? The wide universe? Maybe we should draw that?”  Niu Yi wanted to drop her eyes, but his gaze held her. “You know.” Her voice raised up at the end, but it was not a question.  “Niu Yi,” he said, and she felt like she was thrown back through time to the days were she would have given anything to have had him say her name like that. “Of course. Of course I know. The news pods said there was a woman who used to dance in Wanda Danzhai Tourist Village. But even before I did the research, found all of the clues, asked all of the questions, somehow I knew it was going to turn out to be you.”  “Oh, really?” Niu Yi tried to scoff. Why would anyone think that it would be her? And why should it be her anyway?  But Jing’s tone stayed serious. “Really,” he said.  Children are time capsules, carrying our genes into the future.  Vanda  On Sundays Vanda usually flew down to Perth to visit her mother. There were multiple flights available per day now catering to the Denham Research Center and the influx of people heading up to catch a glimpse of the VAST in the sky.  Vanda’s mother sat out on her patio in her retirement community villa in a little wicker chair, with the sun streaming down. In one hand she held a small pair of silver nail-scissors, and the end of her braid in the other. Holding her hair up right in front of her eyes she was slowly and deliberately snipping the little ends of her hair where it forked and split. Her mother could sit and do this for hours, not looking up.  “Hi Mum,” Vanda said. Her mother paused, offered up her cheek to be kissed, then returned her focus to her hair. Snip. “I brought you over some lasagna.”  “Did you put it in the fridge?” her mother asked, with exactly the same tone she would have used when she was the mother Vanda still remembered, her scissors glinting as they caught the sunlight. Snip, snip, snip.  “Yes,” Vanda caught her mother’s hand and gently extracted the scissors, which she put down on the patio table. Her mother’s hair was long and incongruously dark still, coiled in its braid. You could see the aging in her face though, in her sunken eyes and the lines around her mouth. Her hands, bereft of the scissors, fluttered around like little birds.  Her mother looked at Vanda, shaking her head as if agitated. “Why is it you?” she said. “Why can’t Declan be here?”  “Declan’s gone, Mum,” Vanda said. Her mother still knew that, she was pretty sure. It had been a long time since she had heard her brother’s name, and saying it made something catch inside her, still.  “All the other women in here are grandmothers,” her mother said, her gaze suddenly sharpening and fixing on Vanda.  Vanda swallowed something that was either a sigh, a sob, a hysterical giggle, or some messy hybrid of the three. “That’s not going to happen, Mum,” she said, keeping her voice as gentle as she could. Her mother got caught by certain topics sometimes, and would circle around them, unable to leave them alone. This one came up a lot. But the internal injuries she’d sustained during the car accident when she was a teenager had left her without a spleen, and without a uterus, and she’d never carry a child.  “I guess you’d need a husband for that, anyhow,” her mother sniffed.  Vanda could remember her mother, the mother she’d had before the accident. Funny and intelligent and hotheaded. She’d yell and throw her hands around dramatically, but she would soon be laughing and making up silly songs again soon enough. She was fiery, but she was never cruel.  “And I haven’t got one of those anymore,” Vanda said composedly. Her ex-husband had moved to Singapore two years ago for a new job. He’d taken all of his words with him, all his funny, bright, charming words. I can’t ask you to give up everything here to come with me, he’d said. What he’d meant was, I’m leaving, it’s over, I’ve met someone else, although Vanda hadn’t realized that till a bit later. She’d told herself that she was devastated when he left, and she was, in a way. She’d thought the house would be too quiet. But she’d found that she had room, instead, to breathe, to expand.  “I don’t want grandchildren anyway.” Her mother, once on a track, could be hard to derail. She sat hunched in on herself, as if caught by her own gravity. A gravity so strong that the person she had been could never get out. Vanda thought that her mother probably had other words for her; nicer, kinder words, but they had collapsed inward, they would never make it past her mother’s event horizon. “It’s all a trick.”  “What’s a trick, Mum?” said Vanda, thinking as she said it that probably she shouldn’t have asked.  “Having children,” her mother said with a surprising amount of vehemence. “My body made me love you. It suffused me with oxytocin hormone, and I couldn’t help it. And I do. I do yet.”  Vanda felt like she was holding her breath. When had she last ever heard her mother say she loved her, or even obliquely reference the fact?  “And this is what you think when your children are born. For a while you think that it’s okay. It’s okay that you are going to die one day, because your child exists, and your child will keep going, and because they are what is truly important. But it’s a trick,” her mother’s voice rose up in a wail and Vanda made soft shushing sounds to try and soothe her. “They die when they are eight. Or they turn into a fully-grown human, and you don’t know what goes on in their head or in their life. Because they are not yours anymore. And they are not you.  “They come over and visit sometimes and make small talk and the line of their chin reminds you of yourself, but they are not you, they are some other person. You don’t go on at all. You end. So it’s a trick.” Her mother’s voice faded away as if she were becalmed. Vanda held one of her hands, and chatted of inconsequential things, although she didn’t think her mother was listening. And she thought of the all the questions about death she had cast at her mother when she was a small child, and when her mother walked on the earth still a whole person, not just all sharp jagged remnants of a person. Don’t you mind? she had asked, bright and inquisitive, and terrified to her core by the thought of not existing, with the impunity of a four year old who had not yet learned not to ask these questions. And watching her mother’s retreat back into herself now, shrinking under her own gravity, she knew that her mother did mind, that her mother had always minded.  “You never stay long,” her mother said as she got up to leave.  “I’ve got my flight back up to Shark Bay,” Vanda said, “Working on the VAST communications is pretty intense.”  “I don’t know what that is,” her mother said, her voice thin and pale, the words coming up from somewhere very far, like they were red-shifted, moving away from her.  Vanda brought up an image on her phone. She realized that she missed having the VAST overhead, missed being able to look up and see it. She was only some seven hundred kilometers away from it down in Perth, but the sky felt lacking now somehow. She didn’t know what that meant.  “See,” she showed her mother. “It’s called the Vermilion-Amber-Sunset-Tangerine, Mum. It’s a spaceship.”  Her mother craned her neck so that she could see past the patio roof.  “You can’t see it from here,” Vanda said.  Her mother stayed looking at the sky, and for a moment Vanda felt like she would turn around, and it would be her mother again, the one she had as a kid, the one who’d loved astronomy and climbed up onto the roof of the house with her and her brother to go stargazing.  “That ship,” her mother said. And Vanda waited, but nothing more was forthcoming.  “See you next week, Mum,” Vanda said, but her mother’s hand was straying toward her scissors again, and she did not answer.  Niu Yi  The daily walks became a habit, almost a ritual. I’m only here a fortnight, Niu Yi thought, how can this become such a set part of my day, so quickly, so naturally.  “Were you really in Danzhai already?” she asked Jing, wondering at how familiar it was already, his form sitting beside her, how easy it was to say anything at all to him now. “Was it really a coincidence?” She thought she knew the answer.  “I hadn’t been back in nearly a decade,” he said.  “You came here to find me.” Not something she would have dared say, not so very long ago. But she was leaving the whole Earth behind, and she had very little time to waste on pleasantries or shyness.  “I followed you up the mountain,” he said.  “Why?”  Jing bit his lip. Zia didn’t think she’d ever seen him look as uncertain as he did now.  “Do you know how I’ve felt since they chose me?” she said, rushing in, suddenly not wanting to wait for his answer.  “How?”  “Like an imposter. Like a fake.”  “How could you ever be fake? You are the most real person I know.” And his voice sounded like the gasp of summer.  “Why on earth was it me?” In her effort to have her voice not shake she came out sounding almost angry.  Jing paused. “Genetics.”  “Phylogenetic analysis showed significant genetic differentiation to make us a distinct minority ethnic group. I know. But that applies to all of us. They could have chosen you.”  “Yes.” There was something sad and distant in his eyes. “And instead they chose you. Half genetics. Half lottery. The biggest, best lottery in the history of everything.”  “That’s just it though.”  “What is?”  “The history of everything? There are eight thousand, one hundred and ninety-two of us, only that. Carefully chosen, deliberately chosen to be representative of the cultures and races and peoples of Earth. Of as many variations as they could anyway, as they could fit into that number. They looked at genetic variations. They drew lines around cultures and decided that if your language was classified as a distinct language, not dialect, then culturally you were considered diverse too. But how are those choices anybody can make? And how are we meant to carry all of that? The history of everything? How am I meant to represent a whole culture? It’s just me. One person is not enough. One person is not a culture.”  “No one said you had to carry everything with you.”  “But who else is going to?” Niu Yi said.  As Jing walked her back to her grandmother’s, she told him about the lack of pictures in her head. “And I can’t take anything with me,” she said “Only living matter can pass into Underlight. The VAST itself is one big living entity, although I don’t really understand it.”  “Nothing at all?” Jing said, and she could see the curiosity she’d remembered quicken in his eyes.  “No,” said Niu Yi, and then she blushed. “I’ll lose my hair, my eyebrows. The top layers of my skin. It’ll be just me.” Her chin trembled.  “You know ‘Song of the Ancient Sweet Gum’?” Jing said.  “Yes.”  “The rock was tired of being beaten to pound hemp into paper. And so it ate all the paper and all the books. And that is why we had no legacy of writing,” said Jing.  Niu Yi didn’t know why he was quoting the song, but there was comfort in it somehow, nonetheless.  “You don’t need to take writing, or pictures in your head, or anywhere else. You know the songs, and the poems,” Jing said, and his hand reached down and found hers. “You will carry them, and they will carry you.”  Vanda  “All of these structures remind me of a tonal language, where the same word can mean different things,” Liah sighed. Her dark hair had escaped its restraint and she looked more ruffled than Vanda was used to seeing her, both in terms of appearance and attitude. Despite the breakthroughs that had recently come in from teams working in Chengdu and Boston, they were all feeling haunted by all that they couldn’t understand. “Like ‘Ma’ in Mandarin; it can mean mother, hemp, horse, or scold. Or it can be a word put at the end of a sentence to make it a question.” Liah rubbed at her eyes.  “Except we can’t hear the tones,” said Vanda. “And the permutations just blow out exponentially.” The long days were getting to her too. And at night she was restless, her sleeping brain filled with long strands of triple helixes, infecting her, winding around her, and spinning her loose, into the universe, into the night sky. She couldn’t see the VAST at night, although she knew it was there.  Niu Yi  Niu Yi compared the roof tiles on the houses to pangolin scales, as they did in one of the epic poems. The beautifully pleated skirts all the women wore for the festivals she compared to mountain ridges. Jing came up to play his lusheng for her grandmother, and Niu Yi was reminded that it was the children of copper after the metals were born that became the tubes inside the bamboo instrument. She didn’t need pictures of them to know them.  “Thank you,” she said to Jing, as they lingered watching the mist over the rice terraces. It was like Jing had been a piece of her memory, come to find her when she needed it. A part of her past, to remind her and bring her home.  “Niu Yi,” he said, “take me with you.”  It was impossible, what was he saying that for, what was he-  “Part of me,” Jing said. “Take part of me with you.” He leaned in closer, his eyes locked on hers. Then paused.  It was a question made of the silence, the space between them.  She used to love him, a long time ago. She was not that girl, and she did not love him anymore.  But there were other reasons than love. Nostalgia. Connection. A thread, arcing back through time to the person she used to be, to an echo of herself. A way to mourn the life she would leave behind.  She closed the gap between them and answered the question.  Vanda  Vanda set up the parallel processors to run her latest tweak of the convolutional neural network, then brought up her most recent myriad-graphs and put them in front of her tired eyes. Her brain refused to focus though. A vague guilt battered the edge of her awareness—she had failed to get down to Perth last Sunday to visit her mother. Coupled with that was a curious reluctance to leave this site at all, even for twenty-four hours. These equations, these people, the way the VAST somehow rarefied the light; it was like her oxygen; she needed it.  Her mind kept casting disparate images together, clashing like the sea against the rocks. Her ex-husband and the way he’d never waited for her, never allowed her time to coax her own thoughts out. And her mother, her pauses, all the things that couldn’t escape. And Liah, and the space between them. The way if you left something empty, there was room for something else to come forward into the space. The space, the spaces.  “Liah,” she called. Her voice steady and soft, almost like she was in a dream. “Can we load up the raw files from section 11.2E again?”  “What is it?” said Liah, coming over and putting her hand on Vanda’s shoulder.  “I think we are missing the tones, like you said,” said Vanda. “Except they are not tones, they’re silences. The pauses, the sections where the message waits. Where it stops. I think our extra layer is there in the negative space. I think we need to include that in our weightings.”  There was a moment, and then Vanda heard Liah’s indrawn breath. “I know which protocol we need to adjust the weightings,” she said. Then her voice lowered, pitched just for Vanda. “It was one of my father’s. But he never got to publish that paper. It was just in his head.” Her voice hitched with wonder. “Oh, I see it. I see how we can apply it.”  Vanda turned around. When Liah was excited her eyes looked like they were full of stars.  “Let’s get the team together,” she said.  Niu Yi  Over their evening meal of sour and spicy fish soup, Niu Yi’s grandmother said that she would come down the mountain with her, to the main hospital in Guiyang.  “You’ll get your eyes done?” Niu Yi said, surprised, but pleased.  “No,” said her grandmother. “All my life I have lived in this village. I think I will catch a ride with you.”  Vanda  The message layers superimposed over each other, merging and blending. Then the intricacy of the data came flooding forward into the space they had left for it, falling suddenly into meaning. There was a beauty to it that made Vanda gasp.  She floated on a cloud of satisfaction and achievement and euphoria for several hours until the message cohered into a whole and came crashing down on her, bringing the world with it.  Niu Yi  A gift given with a whole heart.  Niu Yi’s grandmother had given her the memory-gift, although Niu Yi tried her hardest to refuse it. But her grandmother had been more determined than Niu Yi had ever seen her, and she was not someone Niu Yi knew how to disobey. She’d thought that the person had to be dying in order to give their memories, but apparently it was also done this way, although it was not common.  Niu Yi’s head felt crowded, like she was all stuffy from a cold. Her grandmother’s memories would catch and flare inside her mind like embers, but Niu Yi was too full of grief to pay attention to them properly.  Niu Yi was feeling nauseous and would have given anything for a hot bowl of her grandmother’s oil tea, but her grandmother did not make it anymore. Niu Yi wondered whether she was carrying Jing’s child. Whether it was even possible for something to grow in Underlight, or whether it would lie curled up within her, dormant and sleeping, until the end of time.  Her grandmother had gone to live with Niu Yi’s uncle. She was diminutive now—she had always been tiny, but she had never seemed so before. She would smile pleasantly and make polite conversation and sit for hours with the sunlight on her face, but she did not remember the mountain.  Vanda  You could want something all your life, at a fundamental level, your cells crying out for it, and not get it, Vanda knew this. Because it was not for you.  According to the VAST, in eighty-three years a gamma ray burst caused by the collapse of a supermassive star would reach Earth’s solar system. With Earth in its collimated narrow beam path.  Vanda would not be alive in eighty-three years. Nor was she capable of having any descendants who would be living on the Earth. Her whole family would be gone, already. Most of them already were. And yet.  In eleven years the VAST would depart, taking with it eight thousand, one hundred and ninety-two human beings, if they chose. It would travel into “Underlight.”  But Vanda would not be one of them. Not for you the chance to live forever. Not for you.  In Underlight the more than eight thousand people would live and think and interact, but time would not find them. It was an oddly poetic sentence structure from the VAST, but all of the models said it was accurate. The VAST was sitting there in the sky, waiting for them. Alive itself in a different way—a way that had not traded immortality for quick-use disposable bodies that needed offspring to hurtle their genes into the future. It was only itself over and over again and always. They would come out of Underlight, after millennia, to arrive at another world.  To know there were people alive today who would continue out there, somehow underneath and between normal space, for close enough to forever, past their natural span, past anything anyone had expected or deserved. Didn’t that help? Wasn’t that enough?  No.  It wasn’t.  When this had coalesced for Vanda, initially a rampaging jealousy had suffused her. It’s not fair, she shrieked silently somewhere deep within herself. Oh, it’s not fair.  But the emotion had blown through her like a tremendous gust of wind, into all of the smallest parts of her, through her, and away.  Don’t you mind? she had asked her mother, when she was four years old. Don’t you mind?  And of course she minded. But this was not for her.  She had what she had always had.  A life.  A singular unique and unremarkable and finite life. Here, on this planet.  “Poor dolphins,” said Liah. The sunlight was shining on the water, and they watched the dolphins take their fish and then come back to cheekily splash the people standing in the shallows.  “They deserve to go too. Everything does,” said Vanda, up to her knees in the sea, her rolled up jeans getting wetter and wetter.  “They’re not going to give up any of those tickets to the latest greatest last best show in the universe to animals.” Then Liah’s voice became serious. “How would we ask a dolphin what it would choose anyway?”  “What would you choose?” Vanda said, shading her eyes against the glare. The VAST was overhead, but she didn’t look up at it. She would stay here, she’d already decided, even once their work wrapped up. She would live up here with the ocean and the wind and the spaceship that would stay like a promise in the sky for eleven more years.  “What would you choose?” Liah countered, teasing lights in her eyes. “Would you go if you could?”  “Of course,” said Vanda simply. It was her central and unchanging truth. Of course. Of course. But it was not for her. Someone else would go. Eight thousand, one hundred and ninety-two someone elses. “Would you?”  “Would I want to live forever?” Liah said, and she looked out to the horizon, where it was all ocean as far as the eye could see, like it was the end of the world. “Only if I could take you with me.”  Niu Yi  Niu Yi would carry them all, as best she could. She would carry them past the stars, she would carry them to the end of the universe.  The official escorts would be arriving soon. To take her to the airport where she would board a private plane to Australia, where there would be over eight thousand people from around the globe. But she was in no hurry.  Niu Yi turned her attention to the white page in front of her. She pictured her mother’s face, clear in her mind; the curve of her cheek, the expression in her eyes as she stood in Niu Yi’s grandmother’s house, with her newborn daughter in her arms. Niu Yi picked up her charcoal. And she drew a line. Samantha Murray is a writer, mathematician, and mother. Not particularly in that order. Her work has appeared in Clarkesworld, Beneath Ceaseless Skies, Interzone, and Escape Pod, among others, and been collected in The Year’s Best Australian Fantasy & Horror, and The Best Science Fiction of the Year: Volume Four. Samantha has won an Aurealis Award for Best Science Fiction short story.  Samantha lives in Western Australia in a household of unruly boys.", "text": "9700 words, novelette\nPreserved in Amber\n2021 Winner: Aurealis Award for Best Science Fiction Novella\nYou can leave a place for a long, long time. You can leave a place for a long time and never really leave. And yet never know it, until you come back to find that a part of you is waiting there, has been waiting there, all along.\nNiu Yi\nThe taxi from Guiyang Airport passed through long tunnels with curved white crescents every fifty or so meters along. It was simply some reflective material, but the bright curves leading her off into the distance through the darkness of the tunnel made her think of an Einstein-Rosen bridge, a tunnel through space-time. Is this what it will be like? Niu Yi thought, slightly nauseated from the jet lag and the speed with which the driver was taking the bends, and from the acrid sweetness of his cigarette smoke that still invaded the car’s cabin even though he has hand rested nonchalantly out of the window. Probably not. It probably wouldn’t be anything like this at all. And yet, this endless car ride, this long, long tunnel under the mountain, she could feel herself leaving one world for another. And maybe it would be a little like that, after all.\nAfter nearly two hours of quiet smoking and occasional spitting out the window, Niu Yi’s driver abruptly started talking.\n“I took my sister out on a long drive like this with a passenger once,” he said, making eye contact with Niu Yi in the rearview mirror. “It made her throw up, the trip was so long. That wasn’t even as far as this one, but I’m a driver, I’ve been driving more than twenty years now. I know distance. Still, this is far. This is a long way.”\nA long way.\nHe’d been arranged to come out from Guizhou province to pick her up, as drivers from the airport would not have taken this fare. So it was a return journey for him, and people in this part of Zhenyuan County typically still did not travel far, Niu Yi knew. A long way. She thought of where she would be going in only a few months, and the irony flickered lightly over her and then vanished. For this was. She agreed with her driver. This was a long way.\n“I have two sons now,” he told her later, after the roads had become more winding, nearing Danzhai. He took his other hand off the wheel too for one alarming moment, to pass her his phone, two small boys on the screen, the larger one smirking at the camera, the other wide-eyed and solemn.\n“Congratulations,” Niu Yi said, and meant it. “They’re cute.”\n“Yes, yes, and they’re smart,” he said. “So smart. I never thought we’d have two. But it raises a dilemma now.” Now that he had started talking, the words were like a stream trickling down the mountain, picking up speed and volume as it went. “When I die, I’d like to make the memory-gift, and now I have to choose among my boys. Fu is my firstborn, but it does not feel fair that his brother gets nothing.” He used the Miao word for gift, Khoom Plig, but the Han word for memory, Jiyi, marrying them together.\n“I’m sure they’ll understand,” she reassured him warmly, because it seemed important, and because after the hours and the distance and the darkness of the tunnels, she felt like they were in this together, somehow.\n“Yes,” he said, and his cigarette ash tipped, toppled, and swirled by the window past her and away. “Yes.”\nNiu Yi’s grandmother’s village was called “The end of the mountain,” in Miao language. The next leg of Niu Yi’s journey to get there was a precarious minivan ride up an unenclosed road. The left side of the road dropped away steeply, opening up to a hazy vista of rice-terraces stepping in their graduated deliberate way down the mountain. Niu Yi moved over in her seat, almost unconsciously. She felt like her mind was clinging to the side of the mountain, as if not gripping hard mentally, she might drift away. All of the stilted houses clung to the mountain too. Niu Yi could imagine the mountain waking up, shaking itself like a shaggy dog, and flinging them all off, into the broad openness, into the misty sky.\nHer grandmother was making her way out of the front of her house as Niu Yi wheeled her small case of luggage up the steep gravelly path, chickens scattering out of her way, their quick rapid steps followed by slow wandering, to quicken again as she got closer. Quick-quick-quick-slow-slow.\nSoft Miao words were murmured in greeting, as Niu Yi bent down so that she could be squeezed hard. My dear. Her grandmother’s previously bright dark eyes were filmy and distant, and she reached out for Niu Yi with her hands. The deep lines on her face had become crevasses and gulches. But Niu Yi could read welcome in the way her grandmother gripped her arms tightly.\nEverything looked the same. Niu Yi had tried to remember her grandmother’s house several times on the journey here, but she’d known her mind wouldn’t work that way, and details remained stubbornly elusive. But now a surge of familiarity coursed through her in a way that felt warming and relaxing both together. That’s right, this is how it was. Just like this.\nOut through the window Niu Yi could see a drone glinting off in the distance, and her grandmother’s phone resting on a little batik mat at the edge of the table was almost as sleek and modern and shiny as Niu Yi’s own, but these touches of technology felt fleeting, superimposed over a village that felt somehow outside of time, untouched by the sweep of years.\nHer grandmother scooped her oil tea from an earthen pot older than Niu Yi herself.\n“Mmm, it’s good,” Niu Yi nodded over her tea. The ginger salt and oil was hot and sour, and sustaining.\n“You are welcome,” her grandmother said. The warmth of the word spread out, encompassing more than just the tea.\n“I wanted to come back here, to see you again before . . . ”\n“Before you go.” Her grandmother nodded. “You wanted to come home.\nBiological immortality is a state in which the rate of mortality from senescence is stable or decreasing, thus decoupling it from chronological age.\nThere are no defined limits to life for amoebas, they have no set life span and have the potential to maintain their structure indefinitely. They die—of injury or disease or changes to the environment. But not old age.\nBut we are wired to self-destruct over time-immortal genes in throwaway bodies.\nVanda\nThe ship Vermilion-Amber-Sunset-Tangerine looked like streaks of thick paint, plastered heavy-handedly across an arc of the sky. Sunlight loved it, sunlight bounced off it in all directions, faceted, fractured. At night you couldn’t see it at all, only the familiar stars displaced into shifted positions, slightly blurred.\nVanda had first seen the VAST in the sky, not on a viewer or screen or image, not as a newsbreak or on social media or one of the messages that spread around the globe with wildfire speed.\nShe had been staying at Carbla Station, studying the stromatolites as part of her genomics research. Carbla Station was a private property, a huge sheep station, but the owners allowed particular scientific groups access to the property, because their land had the only access to the section of beach she needed. Carbla beach was made of tiny white shells, and on the edge of the beach, and in the water, were living stromatolites. They looked like rocks, but the structures were actually produced by the excretions of microorganisms. The genes of these lifeforms were the same as those that had existed over three billion years ago. Genes were little Von Neumann machines, and these were the closest they came to being immortal.\nVanda had been outside, close to her accommodation at the shearer’s quarters on the station. It was very basic accommodation, and Vanda had had to remove a tick from her calf after her first night there on the little wire-framed camp bed. Later, her mind would keep persisting that there had been a sound, something to make her look up. But she could not remember an actual sound, and no one else reported one, later. It may instead have been an absence of sound or an odd quality to the air, like a sucking-in of oxygen, or a limning of the light. Whatever it was that she couldn’t quite recall, it prickled her like prescience, and she looked up.\nDr. Vanda Michael was part of the multidisciplinary team based just outside of the small coastal town of Denham in Western Australia, working to translate the alien communications. Teams were working this same problem all around the world, but the Denham site was the most prestigious, working in the shadow of the VAST itself, figuratively anyway, as the VAST cast no real shadow. Vanda still battled with her own internal imposter syndrome at the elements of luck and timing to her own inclusion, getting to work with the eminent and brilliant academics and scientists that had gathered here.\nOne of them was speaking to her now. Dr. Liah Je was small, sleek, and solemn, and somewhat younger in person than her reputation had suggested.\n“These calculations are nefarious,” she said to Vanda, stepping away from her screen and pushing a strand of dark hair back from her face.\n“Iniquitous even,” Vanda answered, grinning.\n“Heinous,” Liah noted, with her usual reserved manner. Vanda wasn’t fooled, not anymore. In the weeks since they had started working together, the unfailingly dedicated and highly regarded Dr. Je had shown herself to be in possession of a previously unguessed sly sense of humor. “It’s almost enough to drive me to drink.” she added, then.\nIt might be an overture. Vanda generally had trouble with social cues.\n“There’s that pub in Shark Bay the physics crew were talking about,” she ventured. “And it’s Friday. We could have beer?”\nA small pause followed her words. Vanda knew that if she took three strides toward the window, she would be able to catch a glimpse of the VAST overhead. Their makeshift lab had been quickly constructed, but it was much more comfortable than the shearers’ quarters had been. She didn’t usually ever drink. And she didn’t usually do well at making friends either. But an alien ship was sitting in the sky, with colors that made your heart break. And maybe all bets were off now. Maybe old things would just fall away.\n“Beer, hmm?” said Dr. Liah Je. “I could do that.”\nNiu Yi\nFrom where Niu Yi sat she could see the village sprawling below her, and she scanned the sky as if there was something missing, although she’d never seen the VAST, not in person, not yet. The sky was reaching toward blue today. It would be summer soon. The seasons got under Niu Yi’s skin, sometimes it felt like she could trace the origin of her moods to the weather, the wind, the temperature. As the days warmed and grew longer, something in Niu Yi always woke, and stretched. It was an uplift to her spirit that somehow managed to catch her by surprise every time. She called it the “gasp of summer.” But there would be no seasons in space. And definitely not Underlight, or wherever it was she was going. She wondered if her mind and her emotions would be smooth and unchanging there, rather than changing in quick sharp spikes like they were wont to do.\nShe looked down at the paper in her lap. I wish I could draw. She’d tried. She’d brought a sketch pad and a selection of felt pens out here to try and record what she saw. Not that she could take it with her. But somehow she felt like if she could get it to stay on the page, maybe she could get it to stick in her mind too.\nThere were so many sketches and paintings on small canvasses piled up against one another in the corners of her grandmother’s small house. Stacks of them in the corner of the room Niu Yi slept in, depicting so many different slants of life in this village. Her grandmother always drew the things she could see, the huts and motorbikes and chickens. The mountain and the sky. The faces of the people, a story to be read in every expression, in the lines on a face. Niu Yi wished she had inherited the skill, even a little of it. The ability to draw some marks on a page, and have them suddenly become meaningful. The lines Niu Yi drew remained stubbornly just lines and nothing else, and she crumpled up her pages in frustration.\nWith a pang, Niu Yi thought of her grandmother’s filmy eyes and the way her grandmother tilted her chin toward wherever Niu Yi’s voice was coming from, or turned her face with small seeking movements toward the sunlight coming in the window. Her grandmother couldn’t draw anymore, either.\nNiu Yi tried to press the images into her mind, like flowers into velvet. The particular deep green to the thatched roofs, the little curve up at the edge, the line it made against the sky. The rich red of the flaking wood.\nBut it would not stay. It never did.\nNiu Yi couldn’t remember when she’d found out that other people could see pictures in their head. She could remember her dumbfounded disbelief though, when it had clicked that when other people spoke of imagining things in their mind that they meant it literally. When Niu Yi closed her eyes and tried to conjure her grandmother’s face, she couldn’t get the image to coalesce. Her mental canvass remained blank and unresponsive. She’d looked this up on her phone a couple of years ago and only found an English word for it; aphantasia. While it was nice to know she wasn’t the only one who lacked this ability, she wished there was a word in Miao language for it.\nMany of the stilted houses in the village had red signs running down the length of their windows, tacked up both sides and over the top. “They’re prayers,” Niu Yi could remember her grandmother telling her when she was a little girl, watching her crane her head to try and read the writing. “Prayers for a better life.” Her grandmother’s windows were bare. Niu Yi had always supposed that was because her grandmother already had the best life.\nThere was a sense here, of everything falling down and being built up at the same time. Building materials stacked in precarious piles everywhere, construction, villagers industriously working on roofs all together, digging trenches. Children and dogs and chickens spilling forth into the road. Niu Yi wished she could take a picture, a video, something that would last, an image that would stick with her that she could trust. Unlike her fractured memory, her blank mind. Her thoughts preceded her down the mountain, tumbling and broken. There was rubble on the side of the road, part of the mountain, already fallen.\nVanda\nWhen she was four, Vanda had worked out the concept of death, and she’d gripped it tightly, or it had gripped her, or both, unable to let go. When her mother had tucked her up in bed, when the sleepy songs had been sung and the kisses and hugs and goodnights all done and uttered, and her mother was trying to drift ghostlike out of the room, that was when the questions would swell like a wave within her.\n“When will you die, Mummy?”\nHer mother sighed. “Not for a long time. Not for many years. You’ll be all grown up yourself.”\nVanda tried to imagine being all grown up. It didn’t help.\n“I don’t want you to die, Mummy. Ever.” And she’d started to cry soft tears.\nHer mother would be a little reluctantly drawn back into the darkened room by her distress.\n“It’s okay. Everything dies one day, in the end.”\nVanda did not know how her mother could possibly mean this to be comforting. “Everything?”\n“Yes.”\n“And everyone?”\n“Eventually. After a long, long time. Don’t worry about it now, it’s sleepy time.”\nVanda did not see how she would sleep with this enormous truth sitting on the middle of her chest.\n“But I don’t want you to die! Don’t you care? Don’t you mind?”\nHer mother hesitated a little. “I’ll have lived a good long life by then.” There was something about the edges of her mother’s eyes that Vanda wasn’t sure about.\n“Sleep tight now,” her mother kissed her forehead and drew her hand slowly out of Vanda’s clutching fingers. “No more calling out.”\n“I don’t want to die either,” Vanda said, very softly. Her mother had gone back to her television show, Vanda could hear the muted sounds of tinned laughter. Even when she was very old, with wrinkly hands and white, white hair, she knew she would still mind.\nGenes are memories. The delicate patterning of a dragonfly’s wings can persist long after mountains have worn down into the sea.\nThe pub at Shark Bay bore the literal name of “The Old Pub.” It was right off Main Street, and pleasant, if mediocre. The signage proclaimed it the most Western pub in Australia.\n“So many people,” murmured Vanda as she maneuvered to their little high corner table with two beers in her hands.\n“Of course,” said Liah. She’d changed into a dark-blue collared shirt of some delicate material, and looked immaculate as ever. “They’ve all come to see the VAST.”\n“Poor dolphins,” said Vanda. Tourists had historically come to this region of Western Australia to see the dolphins as they swam up to the beach at Monkey Mia to be fed.\n“Oh, I’m sure they stop in at the dolphins too while they’re here,” Liah said with a wry note in her voice. She sipped her beer. Then her head came up and she looked into the distance, as if stunned.\n“Liah?” Vanda said, after a moment.\nLiah turned to her, eyes still unfocused. “My father came here once,” she said, her voice so soft Vanda had to lean in to catch it over the background hubbub.\n“He worked in Western Australia for a while in his early twenties,” Liah continued slowly. “This I knew. But he came up here one weekend. Not with my mother, this was before he met my mother. He came with another girl. They sat . . . ” Liah turned toward the bar and pointed. “Over there. There used to be a pool table in the middle there.”\n“You have your father’s memories?” Vanda’s voice inflected upward, but it wasn’t really a question. She’d known that Liah Je had been one of the first few people in Australia to undergo the M-transfer, it had been on the news broadcasts, over a year ago. In China and a lot of Europe the procedure was becoming really common, available to wide swathes of the populations, but Australia was a slow adopter of the technology. Currently it was restricted to people who could show a case for potential advancement of knowledge in some field considered valuable in terms of likelihood of paying back to society.\n“The girl was pretty,” Liah said. “She wore this flimsy orange sundress, and a bead of sweat ran down her neck and rested at her collarbone. It was hot, I guess.” Liah looked up then, and straight into Vanda’s eyes. “Yes, I have his memories,” she said, as if only just hearing the question.\n“Did it hurt?” Vanda asked before wanting to kick herself in case she was prying. She really didn’t know how to navigate this friendship stuff.\n“Not in the way you think,” Liah said. She still hadn’t dropped her gaze.\n“Your father was brilliant,” Vanda said.\n“Yes.” Liah said. “He was driven too. That is good, sometimes.” She looked away, and Vanda felt a brief stab that felt like the loss of something. “I was concerned, about the transfer. I did not want to become my father.” She looked at her beer as if she had forgotten she held it. “But it doesn’t work that way.”\n“How does it work?” Vanda said gently.\n“I don’t get his emotions, his thoughts,” Liah said, her detached scientific manner returning. “Just the content, not the context I guess. I’ve tried to leave the personal stuff alone, not look at it. But sometimes, like just then, it just bobs up at the surface. Like flotsam. The flotsam of a life.”\n“Your father must have been glad he had you,” Vanda thought of her own parents. Her father, gone, all of his memories, lost, irretrievable. And her mother’s memories would not be gifts.\nSomething about Liah’s mouth hardened, and Vanda thought she’d probably said the wrong thing. This sharing of confidence with her much-respected colleague felt new and fragile, and Vanda was afraid it would drift away like dandelion fluff at the slightest disruption.\n“He was a . . . possessive man, my father,” Liah said finally. “He held his knowledge tight against his chest, as if other people wanted to steal it from him. But he was dying. It makes people desperate, sometimes. He wanted to live on. And so.”\nVanda didn’t say anything, letting the silence pool between them. Her ex-husband had not been a fan of silence. If Vanda fell silent, searching for what she wanted to say or trying to work out what it was she really felt, or just simply pausing to consider, he would dash in and fill the space with his own words. His words were charming, convincing, and charismatic most of the time. But they were his, not hers.\nLiah’s words came slowly forth into the space that had been left for them. “But he doesn’t. I have his memories. But I am not him.”\nI’m glad, thought Vanda, but she looked down at the dregs of her beer instead of saying so.\n“At first I was worried too, that people would think my results . . . weren’t mine somehow, anymore. But I don’t care. If it helps me. It opens doors.” The look she threw Vanda was oddly defiant. “People want my father’s insights. The way he would combine two apparently separate ideas, and only then would you see that they were fundamentally isomorphic at some deep level. That is what he had, that is what he could do. I would do anything to get that.”\nVanda waited.\n“It doesn’t really work like that, but I’ll take anything I can and use anything I can. I’ll take it.” The ambition that Liah Je was known for made a stark and sudden appearance in her face.\n“Yes,” Vanda said. And if they were going to decode the VAST’s secrets they would need all the help they could get. “What did you think when you—”\n“First saw the VAST?” Liah smiled, her tension fading, and Vanda could not help smiling in response. It was one of those oft-asked and discussed questions, almost a cliché already. “I was in Sydney,” Liah said. “A friend sent me a message. I thought it was a joke. Once I was finally convinced it was real, I knew it was a game changer. That nothing would ever go back in its box again, you know? I was excited and terrified all at once. I was all lit up and kind of expanded by it. And I kept just . . . crying. It was like being tossed around on some turbulent sea.” She paused. “It’s like there are not the proper words for it.” She shook her head and her dark hair drifted back to where it had been.\n“Not the proper words for it,” repeated Vanda. “Do you think that’s our problem? Do you think it’s all in there, but we just won’t ever have the proper words?” She knew that Liah knew what she was talking about. The physicists and cryptanalysts had found mathematical structure in the communications the VAST had been continuously broadcasting since it arrived. They could already tell that some of the data concerned the five platonic solids, and another section the electron configuration of the chemical elements. But the messages were built from only six protein structures, combining, and twining around each other in a way reminiscent of triple-stranded DNA. Vanda knew they were only scratching the surface.\n“I’m hoping we’ll find the words,” Liah said. “I’m betting that we do.” She gave a rather irreverent grin. “But you never answered the question.”\n“What question?” Vanda said.\n“The question you asked me. What was your reaction when you first saw the VAST?”\nVanda paused, to let all of the things she couldn’t express rush into the space.\n“I thought it was the end of the world,” she said.\nVanda, somewhere at the back of her mind, had always been waiting for the end of the world. Ruffled out of sleep by the noise of a jet or a truck making an odd low noise in the distance, she would sit up, and wait, and think, is this it? Is this how it comes? She used to wonder what it would sound like; a splintering crash; a high-pitched whine; a deep vibration on the very edge of what she could hear? She felt like she would recognize that moment, when everything ceased to be normal, and became something else instead. The moment when the end came hurtling toward her. The world could end in a million ways, but at its heart, that moment of realization would be deeply familiar, a coming home, a recognition. After all, it wouldn’t be the first time the world had ended.\nNiu Yi\n“Look at this,” said her grandmother, rubbing her fingers over the top of the picture as if she could glean the information through touch. Her grandmother couldn’t see the photos hardly at all, Niu Yi guessed, but she could remember what each one was, and was unerringly correct.\nNiu Yi took the photo out of her grandmother’s hands, and when she looked down at it something hurt. Here was that younger part of herself she thought she’d outgrown and outcast. Here all along, waiting. It was a picture of herself, her hair bunched on both sides of her head, gap-toothed and smiling. Niu Yi had lived with her grandmother here at the end of the mountain until she was nine years old. She looked to be about six in the photo. Her naïve, innocent, hopeful self. It was a happy photo. A happy time.\n“You’re just like your mother here,” her grandmother said, tapping the photo gently. “You could be her, almost.”\nNo. I’m not like her. Niu Yi thought. She put the photo down on the table.\n“Grandmother, the hospitals are really good now, they could do a good job to help your eyes. And I have credits, we can use my credits, I have more than enough.” The government had given her more credits than she’d ever dreamed of when she’d been chosen as one of the eight thousand.\nHer grandmother shook her head slowly from side to side. “It doesn’t trouble me, I haven’t lost anything, it’s all up here,” she tapped the side of her head, and Niu Yi felt an odd small envy.\n“But it would be a gift, grandmother,” Niu Yi said. It was custom to always accept a gift given with a whole heart.\nThat night, as she tried to go to sleep listening to the eerie unearthly crooning of her grandmother’s chickens roosting under the house, Niu Yi wished she could remember her mother’s face.\nVanda\nThe first time the world had ended Vanda had been thirteen. Her family had been coming back from the beach, from her brother’s junior swim-squad training. Her mother and father had been in the front of the car. Declan had been eight, only eight, he’d been in the back with her, and she’d just snapped at him to shut up because he’d been trying to sing his stupid team song too loudly in a nasally purposely-out-of-tune voice. They went to overtake a truck that was turning in front of them, but a broken axle caused the truck to spin out of the corner, right into them.\nTime had folded back and over on itself like dough, and Vanda had felt like she was lost in the spinning and the screeching sound that was all around her. And then the endless motion and the noise had stopped, and she was sitting in what was left of the back seat, her side wet and warm although nothing hurt yet, nothing hurt at all, listening to her mother howling.\nNiu Yi\n“You’ve got a visitor,” Niu Yi’s grandmother told her, as she returned to her grandmother’s with yams and carrots. It was such an unexpected and implausible thing for her grandmother to say that Niu Yi stopped and stood still.\nA lean, well-dressed man came to the doorway. “Niu Yi,” he said, and took the hand that was not holding the vegetables.\n“Jing,” she said. “How can you be here?”\nShe had met Wan Jing when they had both lived and worked at the Danzhai Wanda Tourist Village. Wanda’s poverty abatement program had built the village back in 2017, nearly thirty years ago. Her mother had moved there shortly after the village was opened, one of the first students to attend the vocational college, leaving Niu Yi with her grandmother. And Niu Yi in her turn had lived there for nearly five years before heading to Shenzhen University. Her grandmother had never left her mountain, thought Niu Yi, then her mother spent her life in within the Qiandongnan Miao and Dong Autonomous Prefecture, and now Niu Yi herself . . . who would go further than dreams.\nJing had left Danzhai Wanda Village seven or eight months earlier than she did, and she hadn’t seen him since.\n“You went to study engineering,” she ventured almost shyly, as she showed him through the village, walking under the maple trees. Her grandmother would be killing a chicken to entertain their guest for dinner and had shooed them both out of the house.\n“I am an engineer,” Jing said. “I work on the new high-speed train lines. And you wanted to study science.”\nNiu Yi shot him a quick look before nodding in acknowledgement. She was surprised he remembered, and he’d left before she’d gone. But he hadn’t stayed in touch, and after he hadn’t returned her first message, she’d not pursued it. He’d vanished like he’d been made of mist. And now he was here.\n“I remember you doing the Golden Pheasant Dance at Spring Festival,” Jing said with his soft and easy syllables. “Your face fringed with silver.” The traditional Miao garments involved an intricately beautiful silver headdress, spun light enough to wear on her head. She’d worn a bright pleated skirt, embroidered in the way her grandmother had taught her. And she’d been decked with silver bracelets, anklets, and earrings. There’d been a trick to walking without making noise, although usually making noise was exactly what you wanted to do.\nThey passed three men tiling a roof, singing together in antiphonal layers.\n“And I remember you playing the lusheng,” Niu Yi returned. He’d been good at it, she’d admired his sensitive fingers, and the delicate strains of his music. But she was much more direct these days than she used to be. “Jing, how are you here?”\n“Can I not be here?” he said, his voice light, and reminiscent somehow of the way he sang, light yet rich with undertones.\nNo, thought Niu Yi. This was not the village Jing was from. It made no sense to find him here.\nBut she made bright conversation with him as they walked up the steep trails, and found herself laughing at his anecdotes. He told her how one of the main problems they were having with the train lines was due to millipedes. The millipedes were drawn to the tracks for some inexplicable reason and made their way along them. But when the train squishes the millipedes, all of those squishy millipede bodies reduce the friction between the train and the track, and all of the stopping time calculations are thrown out, and the drivers have trouble making the trains stop in time. As always, he knew how to pick just the right details to make a story compelling.\n“But why, why are they there?” Niu Yi said, her hand over her mouth to try and hold back her giggle.\n“No one knows,” Jing said with perfect solemnity.\nJing had always been popular. He had always been at the center of things. Niu Yi had been caught in his orbit, with everyone else. Although it was a far-flung orbit, where she never got too close, always on the periphery.\n“Look,” Niu Yi said when she saw where their footsteps had led them. In the center of the village was a long rectangular mural, the sketching engraved directly into long panels of the wood itself. “It’s our history,” she said, almost reverently, her fingers tracing the grooves in the wood, the line of a tree, of maple leaves. The long journey to find a new home. Over mountains, through rivers. The Miao people had only had a written language since the 1950s. Before then the oral histories of a thousand years were passed down in word and song, flowing like a stream. But here it was, right here, in pictures. Pictures she couldn’t take with her.\n“There’s some room at the end here.” Jing said, laying his palm on the blank wood.\n“I guess the future is unwritten. Or undrawn.” Niu Yi said lightly.\n“What’s next for our people? What goes here?” he said, his tone matching the lightness of hers, although his eyes caught hers with an odd intensity. “Space? The stars? The wide universe? Maybe we should draw that?”\nNiu Yi wanted to drop her eyes, but his gaze held her. “You know.” Her voice raised up at the end, but it was not a question.\n“Niu Yi,” he said, and she felt like she was thrown back through time to the days were she would have given anything to have had him say her name like that. “Of course. Of course I know. The news pods said there was a woman who used to dance in Wanda Danzhai Tourist Village. But even before I did the research, found all of the clues, asked all of the questions, somehow I knew it was going to turn out to be you.”\n“Oh, really?” Niu Yi tried to scoff. Why would anyone think that it would be her? And why should it be her anyway?\nBut Jing’s tone stayed serious. “Really,” he said.\nChildren are time capsules, carrying our genes into the future.\nVanda\nOn Sundays Vanda usually flew down to Perth to visit her mother. There were multiple flights available per day now catering to the Denham Research Center and the influx of people heading up to catch a glimpse of the VAST in the sky.\nVanda’s mother sat out on her patio in her retirement community villa in a little wicker chair, with the sun streaming down. In one hand she held a small pair of silver nail-scissors, and the end of her braid in the other. Holding her hair up right in front of her eyes she was slowly and deliberately snipping the little ends of her hair where it forked and split. Her mother could sit and do this for hours, not looking up.\n“Hi Mum,” Vanda said. Her mother paused, offered up her cheek to be kissed, then returned her focus to her hair. Snip. “I brought you over some lasagna.”\n“Did you put it in the fridge?” her mother asked, with exactly the same tone she would have used when she was the mother Vanda still remembered, her scissors glinting as they caught the sunlight. Snip, snip, snip.\n“Yes,” Vanda caught her mother’s hand and gently extracted the scissors, which she put down on the patio table. Her mother’s hair was long and incongruously dark still, coiled in its braid. You could see the aging in her face though, in her sunken eyes and the lines around her mouth. Her hands, bereft of the scissors, fluttered around like little birds.\nHer mother looked at Vanda, shaking her head as if agitated. “Why is it you?” she said. “Why can’t Declan be here?”\n“Declan’s gone, Mum,” Vanda said. Her mother still knew that, she was pretty sure. It had been a long time since she had heard her brother’s name, and saying it made something catch inside her, still.\n“All the other women in here are grandmothers,” her mother said, her gaze suddenly sharpening and fixing on Vanda.\nVanda swallowed something that was either a sigh, a sob, a hysterical giggle, or some messy hybrid of the three. “That’s not going to happen, Mum,” she said, keeping her voice as gentle as she could. Her mother got caught by certain topics sometimes, and would circle around them, unable to leave them alone. This one came up a lot. But the internal injuries she’d sustained during the car accident when she was a teenager had left her without a spleen, and without a uterus, and she’d never carry a child.\n“I guess you’d need a husband for that, anyhow,” her mother sniffed.\nVanda could remember her mother, the mother she’d had before the accident. Funny and intelligent and hotheaded. She’d yell and throw her hands around dramatically, but she would soon be laughing and making up silly songs again soon enough. She was fiery, but she was never cruel.\n“And I haven’t got one of those anymore,” Vanda said composedly. Her ex-husband had moved to Singapore two years ago for a new job. He’d taken all of his words with him, all his funny, bright, charming words. I can’t ask you to give up everything here to come with me, he’d said. What he’d meant was, I’m leaving, it’s over, I’ve met someone else, although Vanda hadn’t realized that till a bit later. She’d told herself that she was devastated when he left, and she was, in a way. She’d thought the house would be too quiet. But she’d found that she had room, instead, to breathe, to expand.\n“I don’t want grandchildren anyway.” Her mother, once on a track, could be hard to derail. She sat hunched in on herself, as if caught by her own gravity. A gravity so strong that the person she had been could never get out. Vanda thought that her mother probably had other words for her; nicer, kinder words, but they had collapsed inward, they would never make it past her mother’s event horizon. “It’s all a trick.”\n“What’s a trick, Mum?” said Vanda, thinking as she said it that probably she shouldn’t have asked.\n“Having children,” her mother said with a surprising amount of vehemence. “My body made me love you. It suffused me with oxytocin hormone, and I couldn’t help it. And I do. I do yet.”\nVanda felt like she was holding her breath. When had she last ever heard her mother say she loved her, or even obliquely reference the fact?\n“And this is what you think when your children are born. For a while you think that it’s okay. It’s okay that you are going to die one day, because your child exists, and your child will keep going, and because they are what is truly important. But it’s a trick,” her mother’s voice rose up in a wail and Vanda made soft shushing sounds to try and soothe her. “They die when they are eight. Or they turn into a fully-grown human, and you don’t know what goes on in their head or in their life. Because they are not yours anymore. And they are not you.\n“They come over and visit sometimes and make small talk and the line of their chin reminds you of yourself, but they are not you, they are some other person. You don’t go on at all. You end. So it’s a trick.” Her mother’s voice faded away as if she were becalmed. Vanda held one of her hands, and chatted of inconsequential things, although she didn’t think her mother was listening. And she thought of the all the questions about death she had cast at her mother when she was a small child, and when her mother walked on the earth still a whole person, not just all sharp jagged remnants of a person. Don’t you mind? she had asked, bright and inquisitive, and terrified to her core by the thought of not existing, with the impunity of a four year old who had not yet learned not to ask these questions. And watching her mother’s retreat back into herself now, shrinking under her own gravity, she knew that her mother did mind, that her mother had always minded.\n“You never stay long,” her mother said as she got up to leave.\n“I’ve got my flight back up to Shark Bay,” Vanda said, “Working on the VAST communications is pretty intense.”\n“I don’t know what that is,” her mother said, her voice thin and pale, the words coming up from somewhere very far, like they were red-shifted, moving away from her.\nVanda brought up an image on her phone. She realized that she missed having the VAST overhead, missed being able to look up and see it. She was only some seven hundred kilometers away from it down in Perth, but the sky felt lacking now somehow. She didn’t know what that meant.\n“See,” she showed her mother. “It’s called the Vermilion-Amber-Sunset-Tangerine, Mum. It’s a spaceship.”\nHer mother craned her neck so that she could see past the patio roof.\n“You can’t see it from here,” Vanda said.\nHer mother stayed looking at the sky, and for a moment Vanda felt like she would turn around, and it would be her mother again, the one she had as a kid, the one who’d loved astronomy and climbed up onto the roof of the house with her and her brother to go stargazing.\n“That ship,” her mother said. And Vanda waited, but nothing more was forthcoming.\n“See you next week, Mum,” Vanda said, but her mother’s hand was straying toward her scissors again, and she did not answer.\nNiu Yi\nThe daily walks became a habit, almost a ritual. I’m only here a fortnight, Niu Yi thought, how can this become such a set part of my day, so quickly, so naturally.\n“Were you really in Danzhai already?” she asked Jing, wondering at how familiar it was already, his form sitting beside her, how easy it was to say anything at all to him now. “Was it really a coincidence?” She thought she knew the answer.\n“I hadn’t been back in nearly a decade,” he said.\n“You came here to find me.” Not something she would have dared say, not so very long ago. But she was leaving the whole Earth behind, and she had very little time to waste on pleasantries or shyness.\n“I followed you up the mountain,” he said.\n“Why?”\nJing bit his lip. Zia didn’t think she’d ever seen him look as uncertain as he did now.\n“Do you know how I’ve felt since they chose me?” she said, rushing in, suddenly not wanting to wait for his answer.\n“How?”\n“Like an imposter. Like a fake.”\n“How could you ever be fake? You are the most real person I know.” And his voice sounded like the gasp of summer.\n“Why on earth was it me?” In her effort to have her voice not shake she came out sounding almost angry.\nJing paused. “Genetics.”\n“Phylogenetic analysis showed significant genetic differentiation to make us a distinct minority ethnic group. I know. But that applies to all of us. They could have chosen you.”\n“Yes.” There was something sad and distant in his eyes. “And instead they chose you. Half genetics. Half lottery. The biggest, best lottery in the history of everything.”\n“That’s just it though.”\n“What is?”\n“The history of everything? There are eight thousand, one hundred and ninety-two of us, only that. Carefully chosen, deliberately chosen to be representative of the cultures and races and peoples of Earth. Of as many variations as they could anyway, as they could fit into that number. They looked at genetic variations. They drew lines around cultures and decided that if your language was classified as a distinct language, not dialect, then culturally you were considered diverse too. But how are those choices anybody can make? And how are we meant to carry all of that? The history of everything? How am I meant to represent a whole culture? It’s just me. One person is not enough. One person is not a culture.”\n“No one said you had to carry everything with you.”\n“But who else is going to?” Niu Yi said.\nAs Jing walked her back to her grandmother’s, she told him about the lack of pictures in her head. “And I can’t take anything with me,” she said “Only living matter can pass into Underlight. The VAST itself is one big living entity, although I don’t really understand it.”\n“Nothing at all?” Jing said, and she could see the curiosity she’d remembered quicken in his eyes.\n“No,” said Niu Yi, and then she blushed. “I’ll lose my hair, my eyebrows. The top layers of my skin. It’ll be just me.” Her chin trembled.\n“You know ‘Song of the Ancient Sweet Gum’?” Jing said.\n“Yes.”\n“The rock was tired of being beaten to pound hemp into paper. And so it ate all the paper and all the books. And that is why we had no legacy of writing,” said Jing.\nNiu Yi didn’t know why he was quoting the song, but there was comfort in it somehow, nonetheless.\n“You don’t need to take writing, or pictures in your head, or anywhere else. You know the songs, and the poems,” Jing said, and his hand reached down and found hers. “You will carry them, and they will carry you.”\nVanda\n“All of these structures remind me of a tonal language, where the same word can mean different things,” Liah sighed. Her dark hair had escaped its restraint and she looked more ruffled than Vanda was used to seeing her, both in terms of appearance and attitude. Despite the breakthroughs that had recently come in from teams working in Chengdu and Boston, they were all feeling haunted by all that they couldn’t understand. “Like ‘Ma’ in Mandarin; it can mean mother, hemp, horse, or scold. Or it can be a word put at the end of a sentence to make it a question.” Liah rubbed at her eyes.\n“Except we can’t hear the tones,” said Vanda. “And the permutations just blow out exponentially.” The long days were getting to her too. And at night she was restless, her sleeping brain filled with long strands of triple helixes, infecting her, winding around her, and spinning her loose, into the universe, into the night sky. She couldn’t see the VAST at night, although she knew it was there.\nNiu Yi\nNiu Yi compared the roof tiles on the houses to pangolin scales, as they did in one of the epic poems. The beautifully pleated skirts all the women wore for the festivals she compared to mountain ridges. Jing came up to play his lusheng for her grandmother, and Niu Yi was reminded that it was the children of copper after the metals were born that became the tubes inside the bamboo instrument. She didn’t need pictures of them to know them.\n“Thank you,” she said to Jing, as they lingered watching the mist over the rice terraces. It was like Jing had been a piece of her memory, come to find her when she needed it. A part of her past, to remind her and bring her home.\n“Niu Yi,” he said, “take me with you.”\nIt was impossible, what was he saying that for, what was he-\n“Part of me,” Jing said. “Take part of me with you.” He leaned in closer, his eyes locked on hers. Then paused.\nIt was a question made of the silence, the space between them.\nShe used to love him, a long time ago. She was not that girl, and she did not love him anymore.\nBut there were other reasons than love. Nostalgia. Connection. A thread, arcing back through time to the person she used to be, to an echo of herself. A way to mourn the life she would leave behind.\nShe closed the gap between them and answered the question.\nVanda\nVanda set up the parallel processors to run her latest tweak of the convolutional neural network, then brought up her most recent myriad-graphs and put them in front of her tired eyes. Her brain refused to focus though. A vague guilt battered the edge of her awareness—she had failed to get down to Perth last Sunday to visit her mother. Coupled with that was a curious reluctance to leave this site at all, even for twenty-four hours. These equations, these people, the way the VAST somehow rarefied the light; it was like her oxygen; she needed it.\nHer mind kept casting disparate images together, clashing like the sea against the rocks. Her ex-husband and the way he’d never waited for her, never allowed her time to coax her own thoughts out. And her mother, her pauses, all the things that couldn’t escape. And Liah, and the space between them. The way if you left something empty, there was room for something else to come forward into the space. The space, the spaces.\n“Liah,” she called. Her voice steady and soft, almost like she was in a dream. “Can we load up the raw files from section 11.2E again?”\n“What is it?” said Liah, coming over and putting her hand on Vanda’s shoulder.\n“I think we are missing the tones, like you said,” said Vanda. “Except they are not tones, they’re silences. The pauses, the sections where the message waits. Where it stops. I think our extra layer is there in the negative space. I think we need to include that in our weightings.”\nThere was a moment, and then Vanda heard Liah’s indrawn breath. “I know which protocol we need to adjust the weightings,” she said. Then her voice lowered, pitched just for Vanda. “It was one of my father’s. But he never got to publish that paper. It was just in his head.” Her voice hitched with wonder. “Oh, I see it. I see how we can apply it.”\nVanda turned around. When Liah was excited her eyes looked like they were full of stars.\n“Let’s get the team together,” she said.\nNiu Yi\nOver their evening meal of sour and spicy fish soup, Niu Yi’s grandmother said that she would come down the mountain with her, to the main hospital in Guiyang.\n“You’ll get your eyes done?” Niu Yi said, surprised, but pleased.\n“No,” said her grandmother. “All my life I have lived in this village. I think I will catch a ride with you.”\nVanda\nThe message layers superimposed over each other, merging and blending. Then the intricacy of the data came flooding forward into the space they had left for it, falling suddenly into meaning. There was a beauty to it that made Vanda gasp.\nShe floated on a cloud of satisfaction and achievement and euphoria for several hours until the message cohered into a whole and came crashing down on her, bringing the world with it.\nNiu Yi\nA gift given with a whole heart.\nNiu Yi’s grandmother had given her the memory-gift, although Niu Yi tried her hardest to refuse it. But her grandmother had been more determined than Niu Yi had ever seen her, and she was not someone Niu Yi knew how to disobey. She’d thought that the person had to be dying in order to give their memories, but apparently it was also done this way, although it was not common.\nNiu Yi’s head felt crowded, like she was all stuffy from a cold. Her grandmother’s memories would catch and flare inside her mind like embers, but Niu Yi was too full of grief to pay attention to them properly.\nNiu Yi was feeling nauseous and would have given anything for a hot bowl of her grandmother’s oil tea, but her grandmother did not make it anymore. Niu Yi wondered whether she was carrying Jing’s child. Whether it was even possible for something to grow in Underlight, or whether it would lie curled up within her, dormant and sleeping, until the end of time.\nHer grandmother had gone to live with Niu Yi’s uncle. She was diminutive now—she had always been tiny, but she had never seemed so before. She would smile pleasantly and make polite conversation and sit for hours with the sunlight on her face, but she did not remember the mountain.\nVanda\nYou could want something all your life, at a fundamental level, your cells crying out for it, and not get it, Vanda knew this. Because it was not for you.\nAccording to the VAST, in eighty-three years a gamma ray burst caused by the collapse of a supermassive star would reach Earth’s solar system. With Earth in its collimated narrow beam path.\nVanda would not be alive in eighty-three years. Nor was she capable of having any descendants who would be living on the Earth. Her whole family would be gone, already. Most of them already were. And yet.\nIn eleven years the VAST would depart, taking with it eight thousand, one hundred and ninety-two human beings, if they chose. It would travel into “Underlight.”\nBut Vanda would not be one of them. Not for you the chance to live forever. Not for you.\nIn Underlight the more than eight thousand people would live and think and interact, but time would not find them. It was an oddly poetic sentence structure from the VAST, but all of the models said it was accurate. The VAST was sitting there in the sky, waiting for them. Alive itself in a different way—a way that had not traded immortality for quick-use disposable bodies that needed offspring to hurtle their genes into the future. It was only itself over and over again and always. They would come out of Underlight, after millennia, to arrive at another world.\nTo know there were people alive today who would continue out there, somehow underneath and between normal space, for close enough to forever, past their natural span, past anything anyone had expected or deserved. Didn’t that help? Wasn’t that enough?\nNo.\nIt wasn’t.\nWhen this had coalesced for Vanda, initially a rampaging jealousy had suffused her. It’s not fair, she shrieked silently somewhere deep within herself. Oh, it’s not fair.\nBut the emotion had blown through her like a tremendous gust of wind, into all of the smallest parts of her, through her, and away.\nDon’t you mind? she had asked her mother, when she was four years old. Don’t you mind?\nAnd of course she minded. But this was not for her.\nShe had what she had always had.\nA life.\nA singular unique and unremarkable and finite life. Here, on this planet.\n“Poor dolphins,” said Liah. The sunlight was shining on the water, and they watched the dolphins take their fish and then come back to cheekily splash the people standing in the shallows.\n“They deserve to go too. Everything does,” said Vanda, up to her knees in the sea, her rolled up jeans getting wetter and wetter.\n“They’re not going to give up any of those tickets to the latest greatest last best show in the universe to animals.” Then Liah’s voice became serious. “How would we ask a dolphin what it would choose anyway?”\n“What would you choose?” Vanda said, shading her eyes against the glare. The VAST was overhead, but she didn’t look up at it. She would stay here, she’d already decided, even once their work wrapped up. She would live up here with the ocean and the wind and the spaceship that would stay like a promise in the sky for eleven more years.\n“What would you choose?” Liah countered, teasing lights in her eyes. “Would you go if you could?”\n“Of course,” said Vanda simply. It was her central and unchanging truth. Of course. Of course. But it was not for her. Someone else would go. Eight thousand, one hundred and ninety-two someone elses. “Would you?”\n“Would I want to live forever?” Liah said, and she looked out to the horizon, where it was all ocean as far as the eye could see, like it was the end of the world. “Only if I could take you with me.”\nNiu Yi\nNiu Yi would carry them all, as best she could. She would carry them past the stars, she would carry them to the end of the universe.\nThe official escorts would be arriving soon. To take her to the airport where she would board a private plane to Australia, where there would be over eight thousand people from around the globe. But she was in no hurry.\nNiu Yi turned her attention to the white page in front of her. She pictured her mother’s face, clear in her mind; the curve of her cheek, the expression in her eyes as she stood in Niu Yi’s grandmother’s house, with her newborn daughter in her arms. Niu Yi picked up her charcoal. And she drew a line.\nSamantha Murray is a writer, mathematician, and mother. Not particularly in that order. Her work has appeared in Clarkesworld, Beneath Ceaseless Skies, Interzone, and Escape Pod, among others, and been collected in The Year’s Best Australian Fantasy & Horror, and The Best Science Fiction of the Year: Volume Four. Samantha has won an Aurealis Award for Best Science Fiction short story.\nSamantha lives in Western Australia in a household of unruly boys.", "source": "https://clarkesworldmagazine.com/murray_07_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Preserved in Amber by Samantha Murray"}