{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Thoraiya Dyer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "21QgyjYlJASCSSkejulZRyWgrm4=", "id": null, "license": null, "comments": "", "raw_text": "6290 words, short story  The Weapons of Wonderland  Hey, you!  Yes, you.  We need your help and we don’t have time to write a novel.  This ain’t no Neverending Story.  August 1st, 2066  To my beloved Eldest Daughter Alya,  I carried you in my womb so that one day you could carry those others.  You were made to carry them, as were your nine hundred and ninety-nine sisters, but I’m asking you, now, to carry something else.  It’s snowing in Miami today. I’m sitting by the frosted panes of the window shaped like a palm tree.  That’s the same window you slapped lime marmalade all over, the time you decided to make it a stained glass window, because beautiful buildings, you said, were blessed by God.  Instead of God’s blessing, we got bees.  So many bees.  You tried to make friends with them, but they kept stinging you.  Come with me, little bee-friend, you cajoled. I’ll keep you safe. Ouch! Now just stay still, little other bee-friend, I will protect—ouch!  That look of betrayal on your face.  Alya, I hope you won’t feel betrayed when I tell you that there’s no honor in carrying and birthing the clones of those billionaires who paid for you to be designed, for the ships and the hibernation chambers to be built, for the trajectory that will take you far, far past the sun until the carbon sequestration plague runs its course and our Earth returns to equilibrium.  Yes, I set you on this path, but you can step away from it.  You can carry the world instead, with your gut a substitute for your womb.  The capsule I crafted is enclosed with this letter.  In seventy-two hours, its contents will expire, should you choose not to swallow it down to safety, but I pray that you will understand that it is God’s plan, my brightest star, my dutiful firstborn.  In closing, allow me to mention that I’ve been made aware of your ex-stepmother’s violation of my trust and the release of my private diaries from 2051 to 2055. I can only assume they are waiting, like the snake in the garden, in this very communications packet alongside this letter.  Please do not read them.  I believe in you. I believe you can overcome temptation. Both the temptation to read my private reflections and the temptation simply to recycle the vital capsule. You are all that is good in Creation.  With sincerest best wishes and affection, Your Mother Maribel.  Ahem. Are you done reading that letter?  Don’t you worry about Maribel. That bitch’ll be dead any day now, if she isn’t dust already. There’s nothing you can do to save her.  Worry about us. I told you we need help, didn’t I?  So.  We’re trapped on this inhabitable comet.  You’ve heard of it, for sure.  Wonderland.  Biggest bilobar bastard ever seen in Earth’s sky. Shaped like a cartoon dog bone, spinning end on end once per day, seven hundred kilometers across and losing several meters of its ice-and-rock coating every time it passes perihelion at a measly three AU from the sun.  Wonderland’s fabulous, flaming approach doesn’t happen often.  Once every two thousand years or so.  So it would have taken some time for the sun to do the same amount of damage as we pesky humans did.  Yeah, we shot a tungsten slug at the comet, making a crater a hundred meters deep. We expected exotic minerals, not wide-eyed, flash-frozen, warm-blooded animals that looked suspiciously like scaly white rabbits.  Was it really Hale-Bopp that the Ancient Egyptians saw, or was it Wonderland? And if our big brother Jupiter had grabbed Wonderland out of orbit, would we ever have known what was inside?  Who cares?  My question is, the only really important question is, regarding that crewed probe, 99101, later dubbed Alice, the one that shot the tungsten slug, the one that’s wired to find Wonderland and smack things into it—is that dented little sardine tin still operable?  April 11th, 2051  Dear Diary,  Today, for the first time since giving up my daughter, I smiled. And somebody smiled back who wasn’t a court-ordered psychologist, or someone from the Academy trying to placate me, or a lawyer showing me again whatever it was that I signed.  Her name is Baltasara.  I’m going to see a lot of her on the three-year trip to Wonderland.  I can’t stop looking at her. Those black, unblinking eyes beneath shaggy, straight, gunmetal fringe. That exposed white nape between hair and collar. The scars on her hands.  She’s a zoologist. She managed the extinction-reversal of mountain lions in the Americas, from preserved pelts to mewling kittens. Her voice is barely a whisper, and when I catch the words “cross-species placenta” or “zero-fail implantation,” the darkness comes over me again, because I know the cost of these new technologies.  But when Baltasara is quiet at the table in the mess, when she’s turning her pencil over and over in her hands, the way that Wonderland turns, I wish she would look at me with that focus and anticipation. I wish she’d swallow me in a different kind of darkness.  “You’re going to feed us on our journey?” she whispers when her eyes brush the insignia on my breast. Like a teenager I pretend she can see through it. What is wrong with me? I remember that my body belongs to Alya. I nourished her from it, and I comforted her.  Who will comfort my body, my blood, at the Academy?  Right now, she must be learning to do without comfort.  I hope Alya can someday forgive me. When I signed, my child was a stranger to me.  It’s easy to sell a stranger.  “I’m going to feed the single-celled organisms in your gut,” I tell Baltasara. “All one hundred trillion of them. If they don’t survive, neither will we.”  “There’s a plague on Earth,” Baltasara points out wryly. “Nobody gets to survive.”  “Except for the alien rabbits.”  I smile.  She smiles.  The ship is equipped with emergency hibernation pods, but unless something malfunctions we’re all going to stay awake together, all the way to our destination.  I’m going to see a lot of her, and if I remember not to shrink and hide, she’ll see a lot of me.  Bloody alien rabbits.  They’re nothing like rabbits at all.  They do have blood, I suppose. And appendages on their heads that look like ears. Those frills are actually X-ray-absorbing umbrellas. They unfold to protect their bodies and also to power them up when they go into their radioactive tunnels to recharge.  Each time Wonderland passes perihelion, the outer rocks get hot enough to keep supplying energy and life for the next two thousand years.  The bigger the animal, though, the more energy it needs, and that’s why the rabbits have to burrow so close to the outside.  That’s why they were the ones to spill out when Alice fired the slug.  Well, and did you find out about Alice? Is she still flying?  God, you’re slow.  Do you like animals, though? You’re from Earth, right?  Will stories about the animals make you more likely to come, or less?  I could tell you more about them. Not just Wonderland rabbits, but Wonderland unicorns, caterpillars and oysters. I’m the only one left here capable of describing them to you. It’s utterly black inside the comet’s hollow interior. Or, it was, until I made a few adjustments.  Now I see the caverns in infrared. I see rabbits browsing. They need minerals for growth; they can’t live on X-rays alone.  Bacteria speckle the floor-to-ceiling spread of algae and fungi. The single-celled armies make multihued impressionist paintings in their wars for survival.  Energy oozing from the rock is the common prize.  Bacteria, fungi, and algae alike poison one another with secretions. Overlap or undermine one another.  They form deceptive structures and lay traps for one another.  You don’t have to be an Earthling for that.  August 2nd, 2066  To my beloved Eldest Daughter Alya,  I sent the letter and the capsule only hours ago, and now I can’t help but send a second, longer letter to explain myself.  I suspect that you, like the others, have no patience with my conversion. What a hypocrite, you all say about me. She enjoyed a youth with no morals and now wants to police ours. Fear of the plague has made her grasp at straws, because she can’t deal with impending death.  Without any communication from you since you left for the Academy, I can’t truly know your thoughts. I can’t be sure that any of my letters or packages have reached you.  I promise you, I’m at peace with my death.  I’ve even accepted Taki’s death.  It’s the death of all the Earth’s animals I can’t abide the thought of, and not because I have any special love of animals, but because of the instructions our Lord God gave to me, Alya.  The instructions given to us.  When I came back to Earth, still pregnant with Taki because I’d had to go into hibernation, I was so worried that I had perhaps damaged her by making the journey through space, exposing her to radiation and particles and zero gravity, not to mention the stress and emotional upheaval I felt.  God had never spoken to me before. Or I hadn’t been listening. Or I’d never truly wanted anything as much as I wanted Taki to be born healthy.  (Not true. I wanted you back. For years, I wanted you back, but it had not yet occurred to me to pray for it, even in a country as full of prayers as this one.)  I went by the church, the one with the palm tree stained glass window, ten times the size of the one in this house, but I didn’t go inside. There were icicles on the eaves and sparrow skeletons in the gutter. In the grounds, where palm trees had stood, the sheen of the carbon-sequestering algae covered the dead sticks of the tree trunks and replaced the grass around the graves.  My feet would not take me towards that black death.  Then a woman and her preteen daughter walked by me on the footpath.  The mother wore a gold and crimson scarf, with orange lipstick, and I recognized her face from the local public playground. You, my perfect Alya, and this woman’s daughter, both tumble-haired tots, had helped each other up the blue plastic slide one time.  I remembered the orange lipstick on that laughing mouth.  My daughter was gone, but her daughter was here, willowy even in a down jacket. That daughter was her mother’s height, complaining about how far it was to walk to worship.  “I don’t even believe in religion,” the daughter was whining. “Mom, you’re so embarrassing!”  “Your religious Mom is not trying to embarrass you,” answered the orange-lipsticked lady as she swayed away, ahead of me on the footpath. “Only to open your eyes to the possibility of something greater than this world, while there’s still time.”  While there’s still time.  It wasn’t fair that the woman with orange lipstick rubbed shoulders with her daughter, and that I never would with mine. You were gone, and by the time my second daughter grew up, the plague would have frozen us all. My fear for Taki made me wretched with jealousy. I wandered after them, because I had to keep watching them. I had to keep seeing greedily into the life that I didn’t have.  But I hadn’t gone more than a block before the hand of labor pain gripped my innards and squeezed.  I stumbled and went down, gasping. It was only a moment before I recovered. I wasn’t afraid of the birth itself; I knew what was happening. I only feared what I might have done to Taki in my haste to escape from Wonderland.  Nobody should have come to help me. Pregnant women were spat on. It was the end of days. Who would start a life, now, when the future was lifeless cold?  The lady with the orange lipstick bent over me. Behind her head was the golden dome of the adorned house of prayer.  “Do you need an ambulance?” she asked, frowning. “I remember you. From the playground. We thought your daughter must have died, when you started coming alone, dressed in black. Do you want me to take you to the delivery room?”  At least, I think that’s what she tried to say.  The tide was coming in. The sound of it boomed in my ears. Baltasara would have accused me of hitting my head. She would have calculated the number of direct strikes on my brain tissue by cosmic rays between Wonderland and Florida.  But I swear to God, I heard the ocean, washing up on the sand. Then it wasn’t water, it was the plague algae, creeping over ice.  The Divine spoke through the woman with the orange lipstick, then. She wasn’t asking to take me to the delivery room; she was offering to deliver me, to deliver all the creatures on Earth.  “Just leave her,” the preteen daughter said, aghast.  “We leave nothing. We save what we can save.”  God instructed Noah: Take all the species that you need on board the ship.  Alya, because of my work, I knew that every single species was needed to form a cohesive ecosystem.  An ecosystem that would not fail, as our ship ecosystem had failed on the way back from Wonderland, forcing us into hibernation.  Horses, camels, goats and donkeys alone would not do.  We needed more diversity, not less.  And yet.  Even cross-species placentas can only host placental mammals.  While my body gave birth to your sister Taki, my mind traveled. It roamed over the planet, naming all the animals, as Adam had, but in Latin, not Hebrew, and with two names each.  From Abditomys latidens and Amblysomas corriae, the Luzon broad-toothed rat and golden mole, through to Zyzomys woodwardi and Ziphius cavirostris, the Kimberly rock rat and goose-beaked whale, I named them in my head.  There are almost four thousand total placental mammal species, and at least two hundred and fifty of each makes a minimum viable population. More than a single pair is needed. Noah was wrong about that, too.  I knew it would take time for me to gather the DNA from existing banks, to convert each blueprint to rings of replicable information inside single-celled organisms, genes that were unnecessary and yet not to be discarded under highly competitive conditions.  Bacteria, tough enough to survive attempts at digestion.  Yet, bacteria made peaceful, so as not to contest with one another.  The cells would have thick walls for the planks of their ark, and the flood would be human bile, and human chyle, in human intestines, for as long as you slept; for as long as your private mission lasted.  Noah was allowed to put himself and his family on the ark, but I’ve resisted the temptation with the capsule I’ve made for you.  Because look what happened, a second calamity is here.  And I’m no prophet. No preacher.  Except to you, I hope, my brightest star, my dutiful firstborn. I hope you will have taken the capsule already and this second missive will have been superfluous.  With sincerest faith and adoration, Your Mother Maribel.  Stop wasting time.  You need to steal her.  The crewed probe Alice, I mean. Not Alya. Of course not Alya. That privately contracted soldier and her hibernating legion have launched already. She’s long gone.  Too bad about that.  Her ship would have been a billion times better than the probe.  The probe, Alice, government probe 99101, will be at the Academy, of course, maybe sealed up in a museum exhibit or otherwise quarantined, but don’t be afraid, she’ll have been sterilized by reentry.  Too bad about that, too.  Who knows what the stuff of Wonderland could have done to stop the bloody carbon-sequestering stuff you idiots made?  Too late to find out.  For the birds and the bees, anyway.  Jan 8th, 2055  Dear Diary,  The implantation worked and today I’ve an inward glow brighter than any comet.  Brighter than any star.  When I told Baltasara, she made a soft, joyful sound and swallowed me again into her eyes so that our surroundings ceased to exist. Her scarred hands gripped my wrists so tightly that she cut off the circulation. She whispered Taki’s name to me, insistently.  Taki, the warrior born of two goddesses, she said. I’d never heard the name before, but instantly I said yes.  Then she swung me in the low gravity, around and around, and we orbited one another, as our haploid genomes had orbited in the petri dish before accepting the unusual situation and merging, making our child of two mothers ready for implantation.  Wonderland is within sight, one month away.  Now motherhood is within my sight again as well. Eight months away, potentially.  Of course, I must realistically, statistically anticipate miscarriage, but what if the best outcome manifests and Taki becomes real?  How different this feels, compared with before.  With Alya, there was no other parent to be excited with me. I had hopes and dreams for her, but I wouldn’t even let myself look at them too closely, much less speak them aloud to another human being. Carrying Alya was a job, a temporary discomfort, with an end date both to anticipate and to dread.  And it wasn’t even the separation I feared. Barely out of childhood myself, I dreaded the infamous physical pain of labor.  I worried I would tear.  How little I knew of true pain.  Now I have no thought of contractions or bleeding or risks, only rewards. Of loving. Of guidance. Of being Taki’s friend and guardian. Of sharing the things she will do with her other mother, Baltasara.  Baltasara will be Mamá and I will be Mum.  I asked Baltasara about her childhood.  She said her Mamá had piloted a jetcar. Not for delivering starvation relief, but simply for jaunting about the planet, wherever she wanted to go. Instead of going to school and playing sports, young Baltasara had been wedged into the seats of exclusive private opera houses, straitjacketed by the latest fashion, and not allowed to talk to the children of the lower classes.  I told Baltasara about having to read at night by the light of a neighboring farmer’s anti-theft motion-triggered floodlights. About sharing a bedroom with my six older siblings until I ran away from home, to the big city, to betray my country’s secrets in exchange for sanctuary.  It was difficult, I said, for me to imagine an upbringing like hers.  Baltasara’s reply was quiet, as always. But more full of feeling than I had ever heard from her.  “Maribel, imagine this. Anything I wanted, I could have, my parents said. When I was five, I wanted a unicorn, so they had a veterinary surgeon perform an operation on an Andalusian mare who was worth more than the net assets of a million ordinary people. I loved her until I was ten, until the weight of her horn pushed her face bones in and gave her brain damage and she stumbled when I was riding, throwing me. I broke my collarbone. After they had her put to sleep, they stuffed her and put her in a museum. When I was fifteen, I said I wanted a second Earth, because we were ruining this one, and they laughed and drank spirits with bits of gold leaf glittering inside, from high purity quartz glasses forged at eight hundred and forty-six Kelvin and crystallized from molten magma, and I knew I had to get away from them, to somewhere dark and silent and hopeful.”  So it turns out we both ran away from very different homes.  I asked Baltasara if she felt hopeful now.  She kissed my belly, and bawled in the silent, subtly shuddering way that I imagine could have been accomplished surreptitiously, on the ground, after a fall from a unicorn.  Wonderland unicorns, you want to hear about them?  They’re white, like the rabbits.  Like all the animals, because who’s got the spare energy to manufacture pigments when you live in the dark? What a waste. The unicorns are bigger than the rabbits, but faster.  They’ve got to be.  To catch their prey.  The horns, those are for plunging into the comet between their claw-feet, for drilling down to get the radiation, instead of burrowing for it. They turn their heads upside-down and walk in circles on the spot to do it.  More like the Cheshire Cat than any Earth myth.  When their heads are upside-down and their horns are in the rock, the unicorns resemble four-legged mosquitoes more than horses.  They use their mouths to eat the rabbits, though. Round mouths with a leechlike ring of teeth. In the good times, the hot times, the radiation from a unicorn horn will practically fry a hole in your heart from fifty paces.  In the lean times, when Wonderland is passing away from perihelion, when they put their horns in the rock and get nothing, lots of them freeze like that. Eternally hopeful, hitting their heads in harder, and deeper, until death. Then, even though the microorganisms strip the flesh, there’s no wind, no earthquakes, no tides to carry away the skeletons. The dead ones stay like that forever, stuck in the ground with their heads upside-down.  Try not to have bad dreams about that.  I’ll keep the unicorns away from you.  Because humans are the worst nightmare of any animal, sentient or not.  They have bad dreams about us.  August 2nd, 2066  To my beloved Eldest Daughter Alya,  This is another addendum to my earlier communication. Because you must be wondering if I really am as devoted a mother as I have claimed. You must be wondering why I put your little sister Taki at risk like that.  I had no choice. I simply had to get away. Far away.  From Baltasara.  Baltasara predicted that the wildlife of Wonderland would be drawn to the plume of our rockets, and made sure to shut combustion down after we landed on the pivot point of the spinning comet’s mass. Yet nobody supposed the creatures would be drawn to electrical potential.  That we would find Wonderland unicorns following the cables, drilling into our hydroponics lab.  Some of them sampled the lettuce and grew green, flipper-like fronds in place of legs.  Others ground the artificial beef protein off the culture slides, eating them glass and all, and even though security bots blasted the intruders back out into the tunnel they’d bored, forever after they were distinguishable as the blotchy unicorns that sprayed milk.  So much for quarantine.  And then Baltasara, frustrated by our inability to penetrate the cavity’s depths with our damaged instruments, frustrated by the shortening of our mission by the loss of half the lab that sustained our lives, suited up, took some repair tools into the tunnels and hunted down one of the blotchy unicorns.  Killed it.  Cooked it.  Ate it.  Without so much as a word to me.  Knowing that the security bots would never let her back onto the ship.  How could she do it, after we’d been together for three years? How could she forget the lesson she had learned in childhood, the lesson of the unicorn her parents had made for her?  She parted us at a stroke, parting herself from her unborn child, without a whisper.  Then, when she did start sending messages, it became clear what she expected.  A GLASS OF MILK, BEL, she tapped enticingly onto the shell of the ship. It was milk from a Wonderland unicorn. She left some in a bucket right where she knew the undamaged sensors would pick it up. DRINK ME, she’d engraved on the pail.  And they did.  Soldiers, technicians, and engineers. One by one, they went out there, and didn’t come back, and when they appeared on the ship’s sensors again, they walked on four clawed legs, or had round mouths with leechlike teeth that could cut messages into metal but not speak.  SWITCH THEM OFF, Baltasara entreated in gored slime over rock, meaning the security bots, but she was no longer truly Baltasara.  The real Baltasara had been focused and intense, and could have found a way to defeat the security bots without begging for help. Something about eating the unicorn had diluted her reasoning faculties. It happened to all of them. Before long, they could barely write.  LET MEE INN.  She forgot that I was pregnant, or seemed to. The altered crew members abandoned their clothes and crowded near the sensors, as if unsure exactly what they wanted of the precious few of us who remained on board. After she started eating Wonderland rabbits, and grew those sensory frills all over her body, Baltasara seemed to be able to see us, even through the ship’s shielded skin.  BEL IS BIG WHY. WHY BIG. FOOD? MUCH. BUT NO FOOD SOON. FOOD HEER. HEER FOOD. COME HEER.  Alya, the woman I loved was gone. I did not abandon her. She was no longer there. I grieved more deeply than I would’ve if she’d simply died.  It was only months before her hideous transformation that I’d finally admitted to Baltasara—the real Baltasara—that Taki’s was my second pregnancy.  You must have been young, Baltasara had whispered.  I confessed to Baltasara that you, Alya, had been my ticket to settle in my new country. That my specialized scientific education, my spying and supply of restricted information during the conflict, putting my life at risk, ending with my estranged parents in prison, all had been meaningless to my new government beside the more important facts of my desperation, my youth, my health, and my ability to bear altered children.  Payment had been made in blood.  You taught me that the price was too high.  This second child would be mine to keep.  Taki would belong to me, not to the creature who had once been Baltasara.  Her language and intelligence improved for a while after she began hunting and eating the other humans who lived in Wonderland alongside her.  I SEE A SECOND SKELETON FORMING WITHIN THE BOUNDARIES OF YOUR SKELETON. MY MEMORIES WENT FOR A WHILE BUT NOW I REMEMBER WHAT IT WAS THAT WE DID. BRING TAKI TO ME AT ONCE. SHE’S YOUR TICKET TO THIS NEW COUNTRY, BEL.  I wept for the woman I had lost.  Wonderland’s got oysters and caterpillars, too.  Still got oysters, on Earth? Did they freeze? For a while they couldn’t form their shells anymore, because of ocean acidity, but that was before the carbon sequestering plague got out of hand, right?  Wonderland oysters have got stony shells and feathery open mouths, to strain the spores out of the thick, barely-moving air.  Wonderland caterpillars have long bodies, a hundred legs, and tiny teeth with which to graze on things resembling leaves. They metamorphose into flying things, the better to disperse to both ends of the bone-shaped cavity.  But everything metamorphoses here, that’s Wonderland’s greatest strength.  Seriously.  When I saw unicorns absorbing earth’s genetic material, and being strengthened instead of poisoned, I reckoned the reverse could be true. But how could I bring the contaminants aboard without risking everyone?  So, out I went.  Think I was crazy?  I was the only one who’d thought the whole thing through!  And I only risked myself.  True, my reasoning was unreliable. I was depressed. Maribel was all wrapped up in her pregnancy, totally turned inward, forgetting that our home planet was doomed.  Not realizing that, no matter our mission parameters, we had to make Wonderland work as an ark, or die along with everyone else.  Well, her body wasn’t the only one that could change.  If I couldn’t live on unicorns, if I couldn’t breathe the foul air, if I couldn’t swing around the sun every couple of thousand years and laugh as I bathed in radiation, it was over anyway!  Guess what? It’s not over.  I’m still here.  It was nothing like the unicorn my parents made me. It was not.  You got hold of that probe yet, or what?  I’m getting tired of repeating myself, and this little period of lucidity ain’t gonna last me forever. How many times have I got to say it?  Bring. Me. The. Probe.  Only you can save Earth!  July 31st, 2055  Dear Diary,  Today we few remaining unaltereds decided to run.  Baltasara has grown cunning again after capturing one of the applied mathematics majors and eating her.  Piece by claw-footed piece.  Immediately, she tapped into the communications network and almost sabotaged the security systems.  From experience, we know that the replenishment will keep her sharp for a week or more, and we can’t risk staying.  We have to attempt abandoning Wonderland with what’s left of the ship, even though our ability to produce sustenance is hampered and the pilot’s program has informed us that, even in hibernation, we’re likely all to die.  It advised us to find solace in religious writings, if we found such things comforting, and I scoffed with regrettable insensitivity.  If there is a God, we’ve gone so far beyond his purview, he couldn’t save us even if he wanted to.  But I hope these diaries will survive, even if we don’t, so the people back on Earth know not to send anyone else to Wonderland, ever. Thankfully, it’s many more months’ travel further away, now, than it was when we first arrived, and the gap between will only widen.  More time in space means more risk to Taki, though.  I no longer have any hope that she will survive.  I’ll admit, things got bad after we were left to our own devices.  Bel’s ship taking off made a hole big enough to deplete our respiratory gases and I had to eat a whole bunch of oysters so my skin would get stony and I’d survive. Only about a dozen expedition crew members, besides me, were smart enough to do that.  But it made us dumb.  Not as dumb as the oysters were. We could still think, but barely.  Thinking was slow.  Yeah, you can make a battery out of a lemon, but it’s not going to run the high-powered microprocessor that is the human brain.  We needed to eat unadulterated humans to get back to full consciousness, after the algae and the oysters sealed off the hole and gases were able to accumulate again. There were enough, mummified by the vacuum, for me to gnaw on until I got back to a semblance of myself.  Enough to remember how to speak and write.  Enough to find the instruments they left behind, to rig something up, to string together enough lemons, to be able to send these messages.  August 3rd, 2066  To my beloved Eldest Daughter Alya,  I have slept briefly, since stopping the previous letter. Energy is precious and hard to come by, these days. The Miami snow has finished falling, leaving a two-meter layer over everything, including the rooftop solar cells that I struggled to sweep last week.  I am so thin. My bones are so brittle. There is cancer in my spine from my time in space. If I fall from the roof, my back will break before the broom does.  So, you see, the price was mine to pay, after all, not Taki’s, and I am grateful to God for that.  To continue the story of my flight from Wonderland back to Earth, I was not quite anorexic by the end of our fraught journey. Not quite beyond repair, once I was back eating balanced foods and breathing clean air.  Taki, despite not being born until after I was back on Earth soil, objected to the brightness of Earth days and became, despite all my efforts, almost fully nocturnal.  I wish the two of you could have grown up together, in the same time. In the same house. Alya, you would have been a bright and sunny influence on her, I know. You would have drawn her out into the world, but it wasn’t God’s plan.  When Taki turned three years old, I tried to recreate your third birthday party. You probably don’t remember it. The one with the ocean theme, where we hung blue and green streamers from the ceiling, to be the seaweed and the waves, and you dressed as a lobster, and nabbed everything with your orange pâpier-maché claws, shrieking with wicked glee.  You were always talking. Outgoing. You loved animals, loved the water, could swim like an otter.  Taki didn’t like to get wet. She was quiet, like her other mother. Reflective. Taki kept secrets and gazed for hours at the stars, even after her lips were blue from the cold. In the dark, she’d dig in the earth, as though to find Baltasara underneath, when it was impossible, when she never knew her. She tolerated other people, but didn’t seek them out.  She’ll be ten years old, soon.  I’m not planning a party.  Instead, I’ll say goodbye to her.  When our ship from Wonderland arrived, our civilian agency had been disbanded due to lack of funds. The military debriefed us, in case Wonderland was a threat they needed to put down. Then they stopped caring. Put about the story we’d all died, and changed our names. Not that Baltasara’s parents were still alive to care. They’d died in a jetcar crash. There was some suspicion the vehicle had been sabotaged by a disgruntled servant.  Baltasara’s family had been very wealthy indeed. Only her DNA could unlock the automated inheritance vault, and she left no Earth relations behind.  Taki’s DNA unlocked the vault.  Suddenly, we had money.  I bought Taki a place in a hibernation chamber. You didn’t grow up under the same roof as your sister, but you may still meet her. It’s possible. When she turns ten, when she’s old enough to make a good candidate for hibernation, she’ll go with the rest of them, to wait for spring.  I did not buy a place for myself. The ark was too important.  With the remaining riches, I ransacked the gene banks of the world, to make my capsule. Such a tiny, precious thing.  I bid you best wishes and farewell, with this final letter, my brightest star, my dutiful firstborn. God will keep you safe, and the ark that you carry inside you. Whether you meet Taki or not, I pray we will be together in heaven, in the end, while the Earth once again sustains the species to survive the great flood.  With blindest belief and adulation, Your Mother Maribel.  So, Taki.  My child. Inheritor of my vast fortune.  What’s it gonna be?  I’ve got the mental capacity to work it out. To guess where you’re at. For a little while. With the rabbit-administrator’s triceps settling in my belly. She ran for a long time, but I caught her in the end.  She’s the last one, though, apart from my children. I could be staring at my own end.  But back to you.  You’ve just turned ten.  Earth’s looking pretty bleak, am I right? The water supply is frozen in the pipes. There’s a new bridge from Key West, but it’s solid ice. Strap on a pair of skates and you could be sightseeing in the Bahamas.  You’re at the entrance to the hibernation vault, reading your very last letters in this life.  Letters from Bel to Alya.  You’re all confused. Let me spell it out for you.  Alya’s well out of range, on the other side of the sun, and even if she wasn’t, she’s never gotten any of those messages. The people who own her and her designer womb sent the letters straight back to Bel’s automated family vault.  You’ve got them because you’ve got the right genes to unlock them. Probably still too young to understand half of those unnecessarily fancy words, right?  Right?  I’ve sent you Bel’s diaries, too. Not so you’ll understand them now, but so in about five years, which is how long it’ll take for you to ride Alice to Wonderland, you’ll get to see what an utter shit she was, not the saint you’ve no doubt built her up to be.  How she abandoned me.  You’ve got the capsule that Bel made, that Alya was supposed to get, but it’s expired now. The things people daydream about their children doing, it’s like they don’t remember how hard it was just surviving as a child.  Put it in the trash.  It’s a useless dehydrated poo dollop in foil packaging.  Bel can’t save the animals of Earth, but you can.  Taki.  Taki, I’m your Mamá, and I command you to come!  You know where Alice is, don’t mess things up. You think you’ll be revived some day on Earth, but it’s a lie. Nobody’s left to love you. Nobody’s left to care enough to wake you up. They’ll switch you off, use your corpse to open our family vault, and take everything you’ve left behind. Come to Mamá, instead, and bring friends.  Bring enemies.  My unicorn children and I will still kill and eat you. I’m up-front about that, but with your genes for fuel and your probe for a chariot we’ll regain enough humanity to be able to return.  We’ll fight the carbon sequestering plague with the weapons of Wonderland.  We’ll undo what you’ve done, even before the animals Bel tried to save really are wiped off the face of the planet. They’ll be changed but they’ll still be amazing.  It’s your choice, Taki.  Take your cells to the grave for no reason, or bring them to me.  Mamá is waiting. Thoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe.", "text": "6290 words, short story\nThe Weapons of Wonderland\nHey, you!\nYes, you.\nWe need your help and we don’t have time to write a novel.\nThis ain’t no Neverending Story.\nAugust 1st, 2066\nTo my beloved Eldest Daughter Alya,\nI carried you in my womb so that one day you could carry those others.\nYou were made to carry them, as were your nine hundred and ninety-nine sisters, but I’m asking you, now, to carry something else.\nIt’s snowing in Miami today. I’m sitting by the frosted panes of the window shaped like a palm tree.\nThat’s the same window you slapped lime marmalade all over, the time you decided to make it a stained glass window, because beautiful buildings, you said, were blessed by God.\nInstead of God’s blessing, we got bees.\nSo many bees.\nYou tried to make friends with them, but they kept stinging you.\nCome with me, little bee-friend, you cajoled. I’ll keep you safe. Ouch! Now just stay still, little other bee-friend, I will protect—ouch!\nThat look of betrayal on your face.\nAlya, I hope you won’t feel betrayed when I tell you that there’s no honor in carrying and birthing the clones of those billionaires who paid for you to be designed, for the ships and the hibernation chambers to be built, for the trajectory that will take you far, far past the sun until the carbon sequestration plague runs its course and our Earth returns to equilibrium.\nYes, I set you on this path, but you can step away from it.\nYou can carry the world instead, with your gut a substitute for your womb.\nThe capsule I crafted is enclosed with this letter.\nIn seventy-two hours, its contents will expire, should you choose not to swallow it down to safety, but I pray that you will understand that it is God’s plan, my brightest star, my dutiful firstborn.\nIn closing, allow me to mention that I’ve been made aware of your ex-stepmother’s violation of my trust and the release of my private diaries from 2051 to 2055. I can only assume they are waiting, like the snake in the garden, in this very communications packet alongside this letter.\nPlease do not read them.\nI believe in you. I believe you can overcome temptation. Both the temptation to read my private reflections and the temptation simply to recycle the vital capsule. You are all that is good in Creation.\nWith sincerest best wishes and affection, Your Mother Maribel.\nAhem. Are you done reading that letter?\nDon’t you worry about Maribel. That bitch’ll be dead any day now, if she isn’t dust already. There’s nothing you can do to save her.\nWorry about us. I told you we need help, didn’t I?\nSo.\nWe’re trapped on this inhabitable comet.\nYou’ve heard of it, for sure.\nWonderland.\nBiggest bilobar bastard ever seen in Earth’s sky. Shaped like a cartoon dog bone, spinning end on end once per day, seven hundred kilometers across and losing several meters of its ice-and-rock coating every time it passes perihelion at a measly three AU from the sun.\nWonderland’s fabulous, flaming approach doesn’t happen often.\nOnce every two thousand years or so.\nSo it would have taken some time for the sun to do the same amount of damage as we pesky humans did.\nYeah, we shot a tungsten slug at the comet, making a crater a hundred meters deep. We expected exotic minerals, not wide-eyed, flash-frozen, warm-blooded animals that looked suspiciously like scaly white rabbits.\nWas it really Hale-Bopp that the Ancient Egyptians saw, or was it Wonderland? And if our big brother Jupiter had grabbed Wonderland out of orbit, would we ever have known what was inside?\nWho cares?\nMy question is, the only really important question is, regarding that crewed probe, 99101, later dubbed Alice, the one that shot the tungsten slug, the one that’s wired to find Wonderland and smack things into it—is that dented little sardine tin still operable?\nApril 11th, 2051\nDear Diary,\nToday, for the first time since giving up my daughter, I smiled. And somebody smiled back who wasn’t a court-ordered psychologist, or someone from the Academy trying to placate me, or a lawyer showing me again whatever it was that I signed.\nHer name is Baltasara.\nI’m going to see a lot of her on the three-year trip to Wonderland.\nI can’t stop looking at her. Those black, unblinking eyes beneath shaggy, straight, gunmetal fringe. That exposed white nape between hair and collar. The scars on her hands.\nShe’s a zoologist. She managed the extinction-reversal of mountain lions in the Americas, from preserved pelts to mewling kittens. Her voice is barely a whisper, and when I catch the words “cross-species placenta” or “zero-fail implantation,” the darkness comes over me again, because I know the cost of these new technologies.\nBut when Baltasara is quiet at the table in the mess, when she’s turning her pencil over and over in her hands, the way that Wonderland turns, I wish she would look at me with that focus and anticipation. I wish she’d swallow me in a different kind of darkness.\n“You’re going to feed us on our journey?” she whispers when her eyes brush the insignia on my breast. Like a teenager I pretend she can see through it. What is wrong with me? I remember that my body belongs to Alya. I nourished her from it, and I comforted her.\nWho will comfort my body, my blood, at the Academy?\nRight now, she must be learning to do without comfort.\nI hope Alya can someday forgive me. When I signed, my child was a stranger to me.\nIt’s easy to sell a stranger.\n“I’m going to feed the single-celled organisms in your gut,” I tell Baltasara. “All one hundred trillion of them. If they don’t survive, neither will we.”\n“There’s a plague on Earth,” Baltasara points out wryly. “Nobody gets to survive.”\n“Except for the alien rabbits.”\nI smile.\nShe smiles.\nThe ship is equipped with emergency hibernation pods, but unless something malfunctions we’re all going to stay awake together, all the way to our destination.\nI’m going to see a lot of her, and if I remember not to shrink and hide, she’ll see a lot of me.\nBloody alien rabbits.\nThey’re nothing like rabbits at all.\nThey do have blood, I suppose. And appendages on their heads that look like ears. Those frills are actually X-ray-absorbing umbrellas. They unfold to protect their bodies and also to power them up when they go into their radioactive tunnels to recharge.\nEach time Wonderland passes perihelion, the outer rocks get hot enough to keep supplying energy and life for the next two thousand years.\nThe bigger the animal, though, the more energy it needs, and that’s why the rabbits have to burrow so close to the outside.\nThat’s why they were the ones to spill out when Alice fired the slug.\nWell, and did you find out about Alice? Is she still flying?\nGod, you’re slow.\nDo you like animals, though? You’re from Earth, right?\nWill stories about the animals make you more likely to come, or less?\nI could tell you more about them. Not just Wonderland rabbits, but Wonderland unicorns, caterpillars and oysters. I’m the only one left here capable of describing them to you. It’s utterly black inside the comet’s hollow interior. Or, it was, until I made a few adjustments.\nNow I see the caverns in infrared. I see rabbits browsing. They need minerals for growth; they can’t live on X-rays alone.\nBacteria speckle the floor-to-ceiling spread of algae and fungi. The single-celled armies make multihued impressionist paintings in their wars for survival.\nEnergy oozing from the rock is the common prize.\nBacteria, fungi, and algae alike poison one another with secretions. Overlap or undermine one another.\nThey form deceptive structures and lay traps for one another.\nYou don’t have to be an Earthling for that.\nAugust 2nd, 2066\nTo my beloved Eldest Daughter Alya,\nI sent the letter and the capsule only hours ago, and now I can’t help but send a second, longer letter to explain myself.\nI suspect that you, like the others, have no patience with my conversion. What a hypocrite, you all say about me. She enjoyed a youth with no morals and now wants to police ours. Fear of the plague has made her grasp at straws, because she can’t deal with impending death.\nWithout any communication from you since you left for the Academy, I can’t truly know your thoughts. I can’t be sure that any of my letters or packages have reached you.\nI promise you, I’m at peace with my death.\nI’ve even accepted Taki’s death.\nIt’s the death of all the Earth’s animals I can’t abide the thought of, and not because I have any special love of animals, but because of the instructions our Lord God gave to me, Alya.\nThe instructions given to us.\nWhen I came back to Earth, still pregnant with Taki because I’d had to go into hibernation, I was so worried that I had perhaps damaged her by making the journey through space, exposing her to radiation and particles and zero gravity, not to mention the stress and emotional upheaval I felt.\nGod had never spoken to me before. Or I hadn’t been listening. Or I’d never truly wanted anything as much as I wanted Taki to be born healthy.\n(Not true. I wanted you back. For years, I wanted you back, but it had not yet occurred to me to pray for it, even in a country as full of prayers as this one.)\nI went by the church, the one with the palm tree stained glass window, ten times the size of the one in this house, but I didn’t go inside. There were icicles on the eaves and sparrow skeletons in the gutter. In the grounds, where palm trees had stood, the sheen of the carbon-sequestering algae covered the dead sticks of the tree trunks and replaced the grass around the graves.\nMy feet would not take me towards that black death.\nThen a woman and her preteen daughter walked by me on the footpath.\nThe mother wore a gold and crimson scarf, with orange lipstick, and I recognized her face from the local public playground. You, my perfect Alya, and this woman’s daughter, both tumble-haired tots, had helped each other up the blue plastic slide one time.\nI remembered the orange lipstick on that laughing mouth.\nMy daughter was gone, but her daughter was here, willowy even in a down jacket. That daughter was her mother’s height, complaining about how far it was to walk to worship.\n“I don’t even believe in religion,” the daughter was whining. “Mom, you’re so embarrassing!”\n“Your religious Mom is not trying to embarrass you,” answered the orange-lipsticked lady as she swayed away, ahead of me on the footpath. “Only to open your eyes to the possibility of something greater than this world, while there’s still time.”\nWhile there’s still time.\nIt wasn’t fair that the woman with orange lipstick rubbed shoulders with her daughter, and that I never would with mine. You were gone, and by the time my second daughter grew up, the plague would have frozen us all. My fear for Taki made me wretched with jealousy. I wandered after them, because I had to keep watching them. I had to keep seeing greedily into the life that I didn’t have.\nBut I hadn’t gone more than a block before the hand of labor pain gripped my innards and squeezed.\nI stumbled and went down, gasping. It was only a moment before I recovered. I wasn’t afraid of the birth itself; I knew what was happening. I only feared what I might have done to Taki in my haste to escape from Wonderland.\nNobody should have come to help me. Pregnant women were spat on. It was the end of days. Who would start a life, now, when the future was lifeless cold?\nThe lady with the orange lipstick bent over me. Behind her head was the golden dome of the adorned house of prayer.\n“Do you need an ambulance?” she asked, frowning. “I remember you. From the playground. We thought your daughter must have died, when you started coming alone, dressed in black. Do you want me to take you to the delivery room?”\nAt least, I think that’s what she tried to say.\nThe tide was coming in. The sound of it boomed in my ears. Baltasara would have accused me of hitting my head. She would have calculated the number of direct strikes on my brain tissue by cosmic rays between Wonderland and Florida.\nBut I swear to God, I heard the ocean, washing up on the sand. Then it wasn’t water, it was the plague algae, creeping over ice.\nThe Divine spoke through the woman with the orange lipstick, then. She wasn’t asking to take me to the delivery room; she was offering to deliver me, to deliver all the creatures on Earth.\n“Just leave her,” the preteen daughter said, aghast.\n“We leave nothing. We save what we can save.”\nGod instructed Noah: Take all the species that you need on board the ship.\nAlya, because of my work, I knew that every single species was needed to form a cohesive ecosystem.\nAn ecosystem that would not fail, as our ship ecosystem had failed on the way back from Wonderland, forcing us into hibernation.\nHorses, camels, goats and donkeys alone would not do.\nWe needed more diversity, not less.\nAnd yet.\nEven cross-species placentas can only host placental mammals.\nWhile my body gave birth to your sister Taki, my mind traveled. It roamed over the planet, naming all the animals, as Adam had, but in Latin, not Hebrew, and with two names each.\nFrom Abditomys latidens and Amblysomas corriae, the Luzon broad-toothed rat and golden mole, through to Zyzomys woodwardi and Ziphius cavirostris, the Kimberly rock rat and goose-beaked whale, I named them in my head.\nThere are almost four thousand total placental mammal species, and at least two hundred and fifty of each makes a minimum viable population. More than a single pair is needed. Noah was wrong about that, too.\nI knew it would take time for me to gather the DNA from existing banks, to convert each blueprint to rings of replicable information inside single-celled organisms, genes that were unnecessary and yet not to be discarded under highly competitive conditions.\nBacteria, tough enough to survive attempts at digestion.\nYet, bacteria made peaceful, so as not to contest with one another.\nThe cells would have thick walls for the planks of their ark, and the flood would be human bile, and human chyle, in human intestines, for as long as you slept; for as long as your private mission lasted.\nNoah was allowed to put himself and his family on the ark, but I’ve resisted the temptation with the capsule I’ve made for you.\nBecause look what happened, a second calamity is here.\nAnd I’m no prophet. No preacher.\nExcept to you, I hope, my brightest star, my dutiful firstborn. I hope you will have taken the capsule already and this second missive will have been superfluous.\nWith sincerest faith and adoration, Your Mother Maribel.\nStop wasting time.\nYou need to steal her.\nThe crewed probe Alice, I mean. Not Alya. Of course not Alya. That privately contracted soldier and her hibernating legion have launched already. She’s long gone.\nToo bad about that.\nHer ship would have been a billion times better than the probe.\nThe probe, Alice, government probe 99101, will be at the Academy, of course, maybe sealed up in a museum exhibit or otherwise quarantined, but don’t be afraid, she’ll have been sterilized by reentry.\nToo bad about that, too.\nWho knows what the stuff of Wonderland could have done to stop the bloody carbon-sequestering stuff you idiots made?\nToo late to find out.\nFor the birds and the bees, anyway.\nJan 8th, 2055\nDear Diary,\nThe implantation worked and today I’ve an inward glow brighter than any comet.\nBrighter than any star.\nWhen I told Baltasara, she made a soft, joyful sound and swallowed me again into her eyes so that our surroundings ceased to exist. Her scarred hands gripped my wrists so tightly that she cut off the circulation. She whispered Taki’s name to me, insistently.\nTaki, the warrior born of two goddesses, she said. I’d never heard the name before, but instantly I said yes.\nThen she swung me in the low gravity, around and around, and we orbited one another, as our haploid genomes had orbited in the petri dish before accepting the unusual situation and merging, making our child of two mothers ready for implantation.\nWonderland is within sight, one month away.\nNow motherhood is within my sight again as well. Eight months away, potentially.\nOf course, I must realistically, statistically anticipate miscarriage, but what if the best outcome manifests and Taki becomes real?\nHow different this feels, compared with before.\nWith Alya, there was no other parent to be excited with me. I had hopes and dreams for her, but I wouldn’t even let myself look at them too closely, much less speak them aloud to another human being. Carrying Alya was a job, a temporary discomfort, with an end date both to anticipate and to dread.\nAnd it wasn’t even the separation I feared. Barely out of childhood myself, I dreaded the infamous physical pain of labor.\nI worried I would tear.\nHow little I knew of true pain.\nNow I have no thought of contractions or bleeding or risks, only rewards. Of loving. Of guidance. Of being Taki’s friend and guardian. Of sharing the things she will do with her other mother, Baltasara.\nBaltasara will be Mamá and I will be Mum.\nI asked Baltasara about her childhood.\nShe said her Mamá had piloted a jetcar. Not for delivering starvation relief, but simply for jaunting about the planet, wherever she wanted to go. Instead of going to school and playing sports, young Baltasara had been wedged into the seats of exclusive private opera houses, straitjacketed by the latest fashion, and not allowed to talk to the children of the lower classes.\nI told Baltasara about having to read at night by the light of a neighboring farmer’s anti-theft motion-triggered floodlights. About sharing a bedroom with my six older siblings until I ran away from home, to the big city, to betray my country’s secrets in exchange for sanctuary.\nIt was difficult, I said, for me to imagine an upbringing like hers.\nBaltasara’s reply was quiet, as always. But more full of feeling than I had ever heard from her.\n“Maribel, imagine this. Anything I wanted, I could have, my parents said. When I was five, I wanted a unicorn, so they had a veterinary surgeon perform an operation on an Andalusian mare who was worth more than the net assets of a million ordinary people. I loved her until I was ten, until the weight of her horn pushed her face bones in and gave her brain damage and she stumbled when I was riding, throwing me. I broke my collarbone. After they had her put to sleep, they stuffed her and put her in a museum. When I was fifteen, I said I wanted a second Earth, because we were ruining this one, and they laughed and drank spirits with bits of gold leaf glittering inside, from high purity quartz glasses forged at eight hundred and forty-six Kelvin and crystallized from molten magma, and I knew I had to get away from them, to somewhere dark and silent and hopeful.”\nSo it turns out we both ran away from very different homes.\nI asked Baltasara if she felt hopeful now.\nShe kissed my belly, and bawled in the silent, subtly shuddering way that I imagine could have been accomplished surreptitiously, on the ground, after a fall from a unicorn.\nWonderland unicorns, you want to hear about them?\nThey’re white, like the rabbits.\nLike all the animals, because who’s got the spare energy to manufacture pigments when you live in the dark? What a waste. The unicorns are bigger than the rabbits, but faster.\nThey’ve got to be.\nTo catch their prey.\nThe horns, those are for plunging into the comet between their claw-feet, for drilling down to get the radiation, instead of burrowing for it. They turn their heads upside-down and walk in circles on the spot to do it.\nMore like the Cheshire Cat than any Earth myth.\nWhen their heads are upside-down and their horns are in the rock, the unicorns resemble four-legged mosquitoes more than horses.\nThey use their mouths to eat the rabbits, though. Round mouths with a leechlike ring of teeth. In the good times, the hot times, the radiation from a unicorn horn will practically fry a hole in your heart from fifty paces.\nIn the lean times, when Wonderland is passing away from perihelion, when they put their horns in the rock and get nothing, lots of them freeze like that. Eternally hopeful, hitting their heads in harder, and deeper, until death. Then, even though the microorganisms strip the flesh, there’s no wind, no earthquakes, no tides to carry away the skeletons. The dead ones stay like that forever, stuck in the ground with their heads upside-down.\nTry not to have bad dreams about that.\nI’ll keep the unicorns away from you.\nBecause humans are the worst nightmare of any animal, sentient or not.\nThey have bad dreams about us.\nAugust 2nd, 2066\nTo my beloved Eldest Daughter Alya,\nThis is another addendum to my earlier communication. Because you must be wondering if I really am as devoted a mother as I have claimed. You must be wondering why I put your little sister Taki at risk like that.\nI had no choice. I simply had to get away. Far away.\nFrom Baltasara.\nBaltasara predicted that the wildlife of Wonderland would be drawn to the plume of our rockets, and made sure to shut combustion down after we landed on the pivot point of the spinning comet’s mass. Yet nobody supposed the creatures would be drawn to electrical potential.\nThat we would find Wonderland unicorns following the cables, drilling into our hydroponics lab.\nSome of them sampled the lettuce and grew green, flipper-like fronds in place of legs.\nOthers ground the artificial beef protein off the culture slides, eating them glass and all, and even though security bots blasted the intruders back out into the tunnel they’d bored, forever after they were distinguishable as the blotchy unicorns that sprayed milk.\nSo much for quarantine.\nAnd then Baltasara, frustrated by our inability to penetrate the cavity’s depths with our damaged instruments, frustrated by the shortening of our mission by the loss of half the lab that sustained our lives, suited up, took some repair tools into the tunnels and hunted down one of the blotchy unicorns.\nKilled it.\nCooked it.\nAte it.\nWithout so much as a word to me.\nKnowing that the security bots would never let her back onto the ship.\nHow could she do it, after we’d been together for three years? How could she forget the lesson she had learned in childhood, the lesson of the unicorn her parents had made for her?\nShe parted us at a stroke, parting herself from her unborn child, without a whisper.\nThen, when she did start sending messages, it became clear what she expected.\nA GLASS OF MILK, BEL, she tapped enticingly onto the shell of the ship. It was milk from a Wonderland unicorn. She left some in a bucket right where she knew the undamaged sensors would pick it up. DRINK ME, she’d engraved on the pail.\nAnd they did.\nSoldiers, technicians, and engineers. One by one, they went out there, and didn’t come back, and when they appeared on the ship’s sensors again, they walked on four clawed legs, or had round mouths with leechlike teeth that could cut messages into metal but not speak.\nSWITCH THEM OFF, Baltasara entreated in gored slime over rock, meaning the security bots, but she was no longer truly Baltasara.\nThe real Baltasara had been focused and intense, and could have found a way to defeat the security bots without begging for help. Something about eating the unicorn had diluted her reasoning faculties. It happened to all of them. Before long, they could barely write.\nLET MEE INN.\nShe forgot that I was pregnant, or seemed to. The altered crew members abandoned their clothes and crowded near the sensors, as if unsure exactly what they wanted of the precious few of us who remained on board. After she started eating Wonderland rabbits, and grew those sensory frills all over her body, Baltasara seemed to be able to see us, even through the ship’s shielded skin.\nBEL IS BIG WHY. WHY BIG. FOOD? MUCH. BUT NO FOOD SOON. FOOD HEER. HEER FOOD. COME HEER.\nAlya, the woman I loved was gone. I did not abandon her. She was no longer there. I grieved more deeply than I would’ve if she’d simply died.\nIt was only months before her hideous transformation that I’d finally admitted to Baltasara—the real Baltasara—that Taki’s was my second pregnancy.\nYou must have been young, Baltasara had whispered.\nI confessed to Baltasara that you, Alya, had been my ticket to settle in my new country. That my specialized scientific education, my spying and supply of restricted information during the conflict, putting my life at risk, ending with my estranged parents in prison, all had been meaningless to my new government beside the more important facts of my desperation, my youth, my health, and my ability to bear altered children.\nPayment had been made in blood.\nYou taught me that the price was too high.\nThis second child would be mine to keep.\nTaki would belong to me, not to the creature who had once been Baltasara.\nHer language and intelligence improved for a while after she began hunting and eating the other humans who lived in Wonderland alongside her.\nI SEE A SECOND SKELETON FORMING WITHIN THE BOUNDARIES OF YOUR SKELETON. MY MEMORIES WENT FOR A WHILE BUT NOW I REMEMBER WHAT IT WAS THAT WE DID. BRING TAKI TO ME AT ONCE. SHE’S YOUR TICKET TO THIS NEW COUNTRY, BEL.\nI wept for the woman I had lost.\nWonderland’s got oysters and caterpillars, too.\nStill got oysters, on Earth? Did they freeze? For a while they couldn’t form their shells anymore, because of ocean acidity, but that was before the carbon sequestering plague got out of hand, right?\nWonderland oysters have got stony shells and feathery open mouths, to strain the spores out of the thick, barely-moving air.\nWonderland caterpillars have long bodies, a hundred legs, and tiny teeth with which to graze on things resembling leaves. They metamorphose into flying things, the better to disperse to both ends of the bone-shaped cavity.\nBut everything metamorphoses here, that’s Wonderland’s greatest strength.\nSeriously.\nWhen I saw unicorns absorbing earth’s genetic material, and being strengthened instead of poisoned, I reckoned the reverse could be true. But how could I bring the contaminants aboard without risking everyone?\nSo, out I went.\nThink I was crazy?\nI was the only one who’d thought the whole thing through!\nAnd I only risked myself.\nTrue, my reasoning was unreliable. I was depressed. Maribel was all wrapped up in her pregnancy, totally turned inward, forgetting that our home planet was doomed.\nNot realizing that, no matter our mission parameters, we had to make Wonderland work as an ark, or die along with everyone else.\nWell, her body wasn’t the only one that could change.\nIf I couldn’t live on unicorns, if I couldn’t breathe the foul air, if I couldn’t swing around the sun every couple of thousand years and laugh as I bathed in radiation, it was over anyway!\nGuess what? It’s not over.\nI’m still here.\nIt was nothing like the unicorn my parents made me. It was not.\nYou got hold of that probe yet, or what?\nI’m getting tired of repeating myself, and this little period of lucidity ain’t gonna last me forever. How many times have I got to say it?\nBring. Me. The. Probe.\nOnly you can save Earth!\nJuly 31st, 2055\nDear Diary,\nToday we few remaining unaltereds decided to run.\nBaltasara has grown cunning again after capturing one of the applied mathematics majors and eating her.\nPiece by claw-footed piece.\nImmediately, she tapped into the communications network and almost sabotaged the security systems.\nFrom experience, we know that the replenishment will keep her sharp for a week or more, and we can’t risk staying.\nWe have to attempt abandoning Wonderland with what’s left of the ship, even though our ability to produce sustenance is hampered and the pilot’s program has informed us that, even in hibernation, we’re likely all to die.\nIt advised us to find solace in religious writings, if we found such things comforting, and I scoffed with regrettable insensitivity.\nIf there is a God, we’ve gone so far beyond his purview, he couldn’t save us even if he wanted to.\nBut I hope these diaries will survive, even if we don’t, so the people back on Earth know not to send anyone else to Wonderland, ever. Thankfully, it’s many more months’ travel further away, now, than it was when we first arrived, and the gap between will only widen.\nMore time in space means more risk to Taki, though.\nI no longer have any hope that she will survive.\nI’ll admit, things got bad after we were left to our own devices.\nBel’s ship taking off made a hole big enough to deplete our respiratory gases and I had to eat a whole bunch of oysters so my skin would get stony and I’d survive. Only about a dozen expedition crew members, besides me, were smart enough to do that.\nBut it made us dumb.\nNot as dumb as the oysters were. We could still think, but barely.\nThinking was slow.\nYeah, you can make a battery out of a lemon, but it’s not going to run the high-powered microprocessor that is the human brain.\nWe needed to eat unadulterated humans to get back to full consciousness, after the algae and the oysters sealed off the hole and gases were able to accumulate again. There were enough, mummified by the vacuum, for me to gnaw on until I got back to a semblance of myself.\nEnough to remember how to speak and write.\nEnough to find the instruments they left behind, to rig something up, to string together enough lemons, to be able to send these messages.\nAugust 3rd, 2066\nTo my beloved Eldest Daughter Alya,\nI have slept briefly, since stopping the previous letter. Energy is precious and hard to come by, these days. The Miami snow has finished falling, leaving a two-meter layer over everything, including the rooftop solar cells that I struggled to sweep last week.\nI am so thin. My bones are so brittle. There is cancer in my spine from my time in space. If I fall from the roof, my back will break before the broom does.\nSo, you see, the price was mine to pay, after all, not Taki’s, and I am grateful to God for that.\nTo continue the story of my flight from Wonderland back to Earth, I was not quite anorexic by the end of our fraught journey. Not quite beyond repair, once I was back eating balanced foods and breathing clean air.\nTaki, despite not being born until after I was back on Earth soil, objected to the brightness of Earth days and became, despite all my efforts, almost fully nocturnal.\nI wish the two of you could have grown up together, in the same time. In the same house. Alya, you would have been a bright and sunny influence on her, I know. You would have drawn her out into the world, but it wasn’t God’s plan.\nWhen Taki turned three years old, I tried to recreate your third birthday party. You probably don’t remember it. The one with the ocean theme, where we hung blue and green streamers from the ceiling, to be the seaweed and the waves, and you dressed as a lobster, and nabbed everything with your orange pâpier-maché claws, shrieking with wicked glee.\nYou were always talking. Outgoing. You loved animals, loved the water, could swim like an otter.\nTaki didn’t like to get wet. She was quiet, like her other mother. Reflective. Taki kept secrets and gazed for hours at the stars, even after her lips were blue from the cold. In the dark, she’d dig in the earth, as though to find Baltasara underneath, when it was impossible, when she never knew her. She tolerated other people, but didn’t seek them out.\nShe’ll be ten years old, soon.\nI’m not planning a party.\nInstead, I’ll say goodbye to her.\nWhen our ship from Wonderland arrived, our civilian agency had been disbanded due to lack of funds. The military debriefed us, in case Wonderland was a threat they needed to put down. Then they stopped caring. Put about the story we’d all died, and changed our names. Not that Baltasara’s parents were still alive to care. They’d died in a jetcar crash. There was some suspicion the vehicle had been sabotaged by a disgruntled servant.\nBaltasara’s family had been very wealthy indeed. Only her DNA could unlock the automated inheritance vault, and she left no Earth relations behind.\nTaki’s DNA unlocked the vault.\nSuddenly, we had money.\nI bought Taki a place in a hibernation chamber. You didn’t grow up under the same roof as your sister, but you may still meet her. It’s possible. When she turns ten, when she’s old enough to make a good candidate for hibernation, she’ll go with the rest of them, to wait for spring.\nI did not buy a place for myself. The ark was too important.\nWith the remaining riches, I ransacked the gene banks of the world, to make my capsule. Such a tiny, precious thing.\nI bid you best wishes and farewell, with this final letter, my brightest star, my dutiful firstborn. God will keep you safe, and the ark that you carry inside you. Whether you meet Taki or not, I pray we will be together in heaven, in the end, while the Earth once again sustains the species to survive the great flood.\nWith blindest belief and adulation, Your Mother Maribel.\nSo, Taki.\nMy child. Inheritor of my vast fortune.\nWhat’s it gonna be?\nI’ve got the mental capacity to work it out. To guess where you’re at. For a little while. With the rabbit-administrator’s triceps settling in my belly. She ran for a long time, but I caught her in the end.\nShe’s the last one, though, apart from my children. I could be staring at my own end.\nBut back to you.\nYou’ve just turned ten.\nEarth’s looking pretty bleak, am I right? The water supply is frozen in the pipes. There’s a new bridge from Key West, but it’s solid ice. Strap on a pair of skates and you could be sightseeing in the Bahamas.\nYou’re at the entrance to the hibernation vault, reading your very last letters in this life.\nLetters from Bel to Alya.\nYou’re all confused. Let me spell it out for you.\nAlya’s well out of range, on the other side of the sun, and even if she wasn’t, she’s never gotten any of those messages. The people who own her and her designer womb sent the letters straight back to Bel’s automated family vault.\nYou’ve got them because you’ve got the right genes to unlock them. Probably still too young to understand half of those unnecessarily fancy words, right?\nRight?\nI’ve sent you Bel’s diaries, too. Not so you’ll understand them now, but so in about five years, which is how long it’ll take for you to ride Alice to Wonderland, you’ll get to see what an utter shit she was, not the saint you’ve no doubt built her up to be.\nHow she abandoned me.\nYou’ve got the capsule that Bel made, that Alya was supposed to get, but it’s expired now. The things people daydream about their children doing, it’s like they don’t remember how hard it was just surviving as a child.\nPut it in the trash.\nIt’s a useless dehydrated poo dollop in foil packaging.\nBel can’t save the animals of Earth, but you can.\nTaki.\nTaki, I’m your Mamá, and I command you to come!\nYou know where Alice is, don’t mess things up. You think you’ll be revived some day on Earth, but it’s a lie. Nobody’s left to love you. Nobody’s left to care enough to wake you up. They’ll switch you off, use your corpse to open our family vault, and take everything you’ve left behind. Come to Mamá, instead, and bring friends.\nBring enemies.\nMy unicorn children and I will still kill and eat you. I’m up-front about that, but with your genes for fuel and your probe for a chariot we’ll regain enough humanity to be able to return.\nWe’ll fight the carbon sequestering plague with the weapons of Wonderland.\nWe’ll undo what you’ve done, even before the animals Bel tried to save really are wiped off the face of the planet. They’ll be changed but they’ll still be amazing.\nIt’s your choice, Taki.\nTake your cells to the grave for no reason, or bring them to me.\nMamá is waiting.\nThoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe.", "source": "https://clarkesworldmagazine.com/dyer_07_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Weapons of Wonderland by Thoraiya Dyer"}