{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chen Qian; Carmen Yiling Yan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "PlVcYtm9/tepitdUYYpxaF0cn9E=", "id": null, "license": null, "comments": "", "raw_text": "11440 words, novelette  Inhuman Lovers  It was never a good sign when Song Mike came looking for me at the end of the workday.  “You, come out here for a sec.” He leaned against the doorway, nodding in my direction.  I stuck my head out from behind my computer monitor and looked him up and down. The guy was red around the eyes, his blue-gray chin bristling with stubble. He wore a denim jacket draped over his police uniform shirt with the zipper open; his bulging belly really showed off the food stain stretched over it. Wrinkles covered his trousers. He’d probably spent last night sleeping in the office—no wonder his wife had run off with another man.  I stood up and gestured a hand. “Let’s go to the top floor. I need to buy a cup of coffee.”  Ten years ago, back when Quanzhou’s Citong Port District was still rolling in lucre, the city’s budget allowances had seemed inexhaustible. The police chief had bought a pile of recreational equipment and set up a police break area on the top floor. Back then, every afternoon break, everyone would get together and play billiards, fifteen bucks a match. Song Mike would always lose to me. Eventually, he stopped playing. Maybe he decided that losing to the girl rookie was too much of a loss of face.  These days, the game room and gym were a ghost town. Only the coffee vending machine in the corner still saw any use.  I invited him to an espresso and grabbed an Americano for myself. After an entire day of suffering through paperwork, I needed a pick-me-up too.  “I’ve got a job. Rich lady came calling, saying her android disappeared.” Song Mike pried up the pull tab and rubbed at his nose. “Sounds like that kind that’s been privately modded.”  “That kind?” I raised an eyebrow.  In the Port District, you couldn’t own a car on the salary from the police station. Everyone would take up some private detective jobs on their own; the higher-ups turned a blind eye, unless you went too far. Song Mike would sometimes take me on as a partner, especially when he needed to interact with females. He was an old-fashioned man; in some areas, he maintained a rare kind of prudery.  Naturally, I wasn’t against the arrangement. Who’d turn down a side gig?  “Looks like that kind of . . . ” He fished out his phone, pulled up a photo, and handed it to me.  There were two people in the photo. One was a woman, already crossed into middle age. She was dressed in a camel-colored long coat and pretty expensive-looking shoes. She faced the camera, her smile dispassionate and formal. The missing android stood at her side with a focused expression, staring at its owner’s profile. It was extraordinarily handsome, bearing a sense of artistry beyond what could be found in products off the assembly line. This guy couldn’t have come cheap.  “Isn’t that Liu Yan?” I asked.  The woman in the photograph would have been instantly recognizable to anyone in Quanzhou, with her regular appearances in business news headlines. In recent years, she’d announced her retirement and came to maintain a much lower profile, but she still remained an important figure.  “She says that’s her secretary of business affairs. It knows a lot of confidential secrets—that’s why she has to have it back.” Song Mike gave a dry cough. “I don’t think their relationship is as straightforward as she says. She couldn’t give me this android secretary’s model number. She said it was a private custom model.”  “Wow . . . ” I was admiring the handsome man in the photo once more, expressing my approval for this lady’s taste.  “She arranged to speak in person with me at her home one hour from now,” Song Mike said, retrieving his phone. “I think the conversation would go better with you there.”  “A rich lonely lady who played with fire and got burned, trying to find her missing android boy toy.” I shrugged. “Sounds like good money.”  I rose to my tiptoes and chucked my empty coffee can halfway across the room into the trash bin. Perfect shot. I glanced at my watch: “I’ll get my things. I’ll meet you in ten minutes in the parking lot.”  On previous occasions, Song Mike would mutter if you weren’t wearing a dress, who could tell you’re a woman.  But it seemed like he was in a low mood today. He only gave me a glance without saying anything.  01.  Song Mike drove his battered Volkswagen while I sat in the backseat, my laptop bouncing along on my lap. We were crossing the decayed city center of Quanzhou; in the distance, we could see the warm colors of the lanterns of Kaiyuan Temple in the dusk. The Ghost Festival was once more nearly upon us.  Flocks of jobless youths wandered the streets in the fine rain, their fluorescent plastic outfits shimmering. They climbed onto the window ledges of abandoned shopping centers, kicking their long legs and chewing gum. Someone recognized Song Mike’s car, raised a middle finger, and spat in our direction.  “Aren’t you going to deal with that?” I said, half-teasingly.  “We’re not on the clock,” Song Mike said, his tone weary. “Besides, what can we do? Beat up this crowd of brats?”  But Bin District on the city outskirts was a completely different world. The sea, surface rippling with the last light of sunset, skimmed past the car window. A line of birds returning to their nests touched down lightly upon the white shore. Here, even the sand had been imported straight from some foreign island. House prices in Bin District had hit six digits all the way back in ’72.  And our client lived in one of these villas.  Sadly, we weren’t in a mood to appreciate the rare sight of such moneyed scenery. Song Mike had me use the opportunity to look up the client’s—Liu Yan’s—background.  There was a lot of information on her on the Internet, but most of it came from official business news reports and interviews. There wasn’t much we could use. Liu Yan came from humble origins; several rounds of outer space investment in her youth had launched her into wealth. Afterward, she’d left Beijing to quietly live in Quanzhou’s Citong Port District, but she still held large numbers of shares in several noteworthy corporations. She’d been married once—her ex-husband Lu Guotao had also been a big name in the business world, only to flee under suspicion of serious business wrongdoing quite a number of years ago. They used to operate as a husband-wife team, yet Liu Yan had miraculously come through the business unscathed, managing to keep her own assets.  I rapidly flipped through the search results, picking out the important bits to read out loud. “I can’t find much negative news about her online. Does she naturally keep a low profile or is she just good at PR?”  Song Mike snorted. “How many rich people keep their asses clean?”  After his investigation into that warehouse massacre case several years ago had gotten shut down, he’d been allergic to rich folks.  I ignored him, continuing to look through the sources. “Her ex-husband Lu Guotao has an interesting background. Before he got rich off of asteroid real estate, he earned an MD in neurology, and even held a university teaching position related to AI research. He only went into business in his middle age.”  “Mm,” answered Song Mike, uninterested.  “They seemed to get along quite well as husband and wife.” I looked at the screen; just a bit of searching presented me with photos of Lu Guotao and Liu Yan together in various old news articles. There’d never been rumors of extramarital affairs associated with Lu Guotao. It was rare to see for someone at his tier of wealth.  “Not that it stopped her from getting a robot for her loneliness after her husband ran off.” Song Mike sounded awfully bitter.  We’d entered the villa district. Everyone was starting and stopping, presenting invitation codes to the countless security systems.  On either side of the sandstone-paved road were little houses shaded by palm trees. The Chinese redbuds were dropping their flowers, carpeting the ground in decaying red. Liu Yan’s house was deep within the lake area, a two-story Western-style house, completely snow-white, with a big terrace to one side extending straight into the bay. Wicker chairs and patio umbrellas were arranged on the terrace, so that you couldn’t help but envision those long, idle afternoon hours.  Only the lights in the living room were on.  We sat in the car looking at it for a while, speculating on the overall cost of Chez Liu’s security system while we were there. Several stealth surveillance drones patrolled above the roof. Not even the biggest bank in Quanzhou got fancier than that.  “You’d be as safe here as if you lived in a fortress,” I sighed. I took out my compact, straightened my hair, and touched up my makeup.  Song Mike had changed into a clean dark blue suit before leaving. I maintained it for him in the changing room at the police station for situations like the one in front of us. After his divorce, I’d taken on the duty of making him occasionally look presentable. Some people in the station gossiped that we’d gotten together, but we understood that nothing like that was going to happen between us. He’d brought me into the profession in the first place; it was natural that we’d take care of each other.  That was all.  Ten or so seconds after we rang the doorbell, the lady of the house opened the door.  Liu Yan looked somewhat younger than she had in the photos. Long, thick raven-black hair fell to her shoulders. Only a few signs of artificial tweaking marked her features, which were worthy of being described as stately and lovely. She’d known that Song Mike would bring a female partner, so she was only dressed in velvet yoga clothes and slippers.  I really hoped that I’d still have a waist as slender as hers when I was in my forties.  “Sergeant Song. Miss Ouyang.” She shook hands with us in turn. Her voice was soft and sweet. “I’m very grateful that you’d take the time to help me resolve my little personal problem.”  Song Mike nodded.  We walked into the living room and sat on one corner of the sofa. Liu Yan’s home didn’t give off any of the signs of the nouveau riche. Every article of furniture was expensive in a simple, elegant way. A dry-brush landscape ink painting scroll hung on the wall. Definitely an original, I thought.  Liu Yan personally brought us tea.  I was surprised. A fancy house like this, without a housekeeper.  “Forgive me, normally, these duties would be performed by 3908,” she explained apologetically. “After its disappearance—”  “3908?” I raised an eyebrow.  “That’s the name of my missing android secretary. It came up with the name itself. I’d wanted to give it a more humanoid name, but it was very stubborn on this point.” Liu Yan laughed.  Song Mike and I exchanged a look.  “This is also why I hope to find 3908 as soon as possible. It’s—highly intelligent. I’m afraid of it being subjected to suffering and harm.” Liu Yan hesitated for a few seconds, her thin hands clasped over her knees. The raised veins on the backs of her hands were the only places where her body revealed its true age.  “Intelligent? You mean, the program in its cybertronic brain isn’t the version generally available on the market?” Song Mike asked.  I glanced at him.  He seemed somewhat reckless today, accusing the client of exploiting a legal gray area right off the bat. This wasn’t going to help us draw out information. To tamper with an android’s cybertronic brain programming was technically a crime but faced with companies’ quest for profit and geeks’ curiosity, the law was increasingly becoming empty paper.  “That’s not important,” Liu Yan said, with a faint lift of her head. Her voice rose. “I’m simply saying, you can treat this as a missing person case with a real person. Perhaps it seems absurd to you, but ever since I started living alone, it’s been my only companion. I see it as a member of my family.”  “We understand how you feel.” Smiling at her, I took out a paper notebook and pen—for some reason, the gesture always made clients feel like they were being taken seriously. “And AI inspection is outside of our purview. It’s just that we need to understand the logic driving your android secretary’s actions to better figure out what happened to it.”  Liu Yan’s expression eased somewhat.  I stealthily shot Song Mike a look. “Could you describe the exact circumstances of its disappearance?”  “It was yesterday morning,” Liu Yan said. She became calm and methodical as she began her recollections. I was reminded that she’d once been a successful businesswoman. “3908 is also my fully authorized business representative. I had it visit the company office to interview a new director of financial affairs. But at the appointed hour, the company called me saying that 3908 hadn’t arrived at the meeting room. I was taken aback and concerned. I had my people search the entire route. 3908’s car was parked on the frontage road next to the highway near the company. The door was locked. There were no signs of force. It was simply that the android had disappeared.”  “Isn’t your android equipped with a location tracker?” Song Mike asked.  “Not anymore.” Liu Yan shook her head. “It doesn’t like having surveillance on its body. I removed the device on its behalf.”  I wrinkled my brow.  “Forgive me, ma’am.” Song Mike leaned forward. “Just what level of independence and intelligence does your android possess?”  “3908 is the work of an artist friend. I admit, it doesn’t run the standard program,” Liu Yan said. She didn’t seem to mind Song Mike’s repeated attempt to intimidate. “3908’s intellectual capacity is beyond my ability to quantify in specific terms. After all, I’m not a field expert.”  The corner of her lips curved faintly, as if she’d thought of something. “All I can say is that in day-to-day interactions, it’s completely identical to a normal human being, simply more innocent. It’s a good boy.”  “Ma’am, you’ve really got guts.” Song Mike shook his head. “Once the programming goes wrong—”  “To live in this world is to accept risk,” said Liu Yan, lifting her gaze. “Next to the impenetrability of the human heart, I’d rather have a robot as a companion.”  As police officers who interacted daily with the evils of humanity, we were both wordless for a time.  “Why do you think it disappeared? Who would want it?” I tapped the paper with the point of my pen, breaking the silence.  “I really—don’t know.” Liu Yan spread her hands a little. “I’m largely retired. I’m only involved with the company in a nominal advisory capacity. My social connections in Quanzhou aren’t complicated either. I have no enemies. It’s possible that someone kidnapped 3908 under the assumption that it has important corporate secrets in its head.”  “It wouldn’t have value to someone else on its own?” Song Mike asked again.  “In terms of monetary value, it would be worth a top-tier luxury car, I suppose. My friend’s creations have always had very high market value.” The corner of Liu Yan’s mouth lifted; her smile was a little ironic. “It could be resold after reformatting the brain. It’s very beautiful. It could easily find a buyer.”  She thought some more, then added, “I’ve also put out word that I’d be willing to ransom it back for a good price, but as of yet, no one has contacted me.”  “Interesting,” Song Mike muttered.  After the third round of tea, we said our farewells and left.  Liu Yan escorted us to the gate. A night wind was blowing; her body seemed especially frail under the soft athletic top. I once again noticed how vacant and quiet this whole villa seemed.  “We’ll contact you if we find anything,” I said, clasping her hand and shaking it gently. Surprisingly, I kind of liked her.  “If it’s already too badly destroyed when you find it, don’t show me the pictures,” she said. She sniffled. Her cool, refined outer shell had abruptly cracked. “Just tell me what happened. Don’t let me see the pictures.”  02.  “What do you think?” Back in the car, I huddled up to the heater, rubbing my hands together.  That villa was as cold as an icebox. It wasn’t even September yet, but I was covered in goose bumps.  Song Mike didn’t answer, busy lighting a cigarette.  “Their relationship probably isn’t as spicy as we envisioned. She sees that android more like a pet dog,” I added.  Or a friend. But instinct told me that Song Mike wouldn’t want to hear that word.  Once he’d deep-exhaled two masses of smoke, thoroughly polluting the air inside the car, he gave me a sidelong glance. “Did you really not notice?”  “Ah?” I leaned over, appropriated the lighter and pack of cigarettes, and lit one for myself. “Notice what?”  “That big house didn’t have a single living soul inside.” He turned the ignition; the old Volkswagen engine coughed to life. “That woman’s an android too.”  I choked on smoke, nearly hacking out a lung. “No way . . . have androids gotten that realistic already?”  I carefully thought back on how it had felt to shake hands with Liu Yan, the texture of the skin, the warmth, the amount of force exerted. All of it had been indistinguishable from a human.  “Where do you think we live? There are no prohibitions here like there are in the big cities.” Song Mike shrugged. “These hyperrealistic products have been out on the market for years.”  I shivered a little, not from cold. “Where? Out of the people we see on a day-to-day basis—”  “Where’s your mind going?” Song Mike guffawed. “Those replica people look pretty on the outside, but they all act like dopes. It’s easy to tell the difference. The one we met today is different—that’s a real high-end product. I’ve never seen this impressive a replica. But there’s still some tiny differences if you look—I can’t put them into words myself.”  “Where did you see the dopey replica people?” I asked, watching him.  He averted his gaze.  I thought about it and understood. “You’ve gone to Shuicai too?”  Shuicai Street boasted the biggest brothel in Citong Port. Every half year, the station sent someone down to inspect the girls’ health certificates. I’d gone too, and all I could say was, hell on earth. Row upon row of gene-edited girls, stunningly beautiful and mentally hobbled, sitting lined up behind the glass display window waiting for guests.  Naturally they were healthy, born with a long list of disease immunities. They would live with the ageless faces of young girls until seventy, and only then begin to decline and age.  And they’d be eternally happy, never to ponder the questions that brought pain to humankind.  Compared to me, stressing every day over making rent, I didn’t know who ought to pity whom. If they were using robots to replace them—it didn’t seem that bad a thing.  Song Mike cranked the car window down a crack, letting out the miasma that the two of us had produced. “Do you have anything else this evening?”  “Hmm?”  “Let’s pay a visit to that android maker. He lives in Shijing. No one knows his real name, but they call him the Jiali Craftsman.”  Jiali was local dialect for “puppet show.” Now that I thought about it, it made a good nickname for a maker of replica androids.  Song Mike knew him.  To tell the truth, I wasn’t surprised at all. At Chez Liu, when Song Mike didn’t expend energy on interrogating Liu Yan about her “artist friend,” I’d known that he had to already know something. Moreover, the nature of this case had turned from “rich lady trying to find her stolen sexbot on the down-low” toward a stranger direction, thoroughly arousing my sense of curiosity.  Aside from that, Song Mike’s state of mind didn’t seem quite right. I didn’t want to leave him to go at this alone.  “Let’s go. I don’t have work tomorrow,” I said.  03.  Shijing after dark was a land of wonders.  More than a decade ago, this had been the busiest place in Citong. Every day, hundreds of mega-scale interstellar cargo ships would set anchor at the port in an unceasing river, bringing with them an infinite flow of cash, new technology, and travelers. Back then, the entire Port District had been as profligate as one of the oil countries from the olden days.  We’d all thought the good times would last forever.  Then came wormhole shipping. Cargo ships no longer needed to dock here. The Port District had deteriorated with shocking speed into an underground market, even becoming a gathering place for outside fugitives and the jobless. I could be wearing a police uniform and armed with a gun, but even during the day, I’d think twice about going here alone.  Coming here with Song Mike, at least, I didn’t have to worry for my safety. He parked the battered Volkswagen outside and led me into Shijing on foot. After the rain, puddles had accumulated on the long-neglected surface of the road, reflecting the colorful storefronts on either side of the street. Most were selling bootleg video games and banned substances, with stands hawking vermicelli congee and fried oysters interspersed among them, wafting inviting scents.  As we walked, people kept coming up to him and throwing an arm over his shoulder. Only his strength of will kept him from getting dragged into a bar to “drink a couple.” As for me, I tried hard not to stare at the body self-remodeling aficionados. Their electronic organs were exposed outside their bodies, hearts and lungs even painted with fluorescent pigments, brightening and dimming with their breath and heartbeat. Noticing my peeking, they began to whistle. “Hey, these aren’t the only parts we’ve remodeled!”  I turned away my gaze.  “That lives here.” Hands in pockets, Song Mike gestured with his chin at a large, rundown building.  The windows of the building were pitch-black.  “What grudge do you have against him?” I’d heard the disgust in his voice. I inspected the stun baton hidden up my sleeve; it was black market equipment I’d gotten myself, smaller than a pencil, but capable of zapping a hulking grown man into pissing himself on the ground.  He gave me a sidelong look. “I’ll tell you afterward.”  We came to the front of the building. The glass door of the foyer had been shattered long ago. A metal grille and an old-fashioned cable lock kept the homeless out.  Song Mike rattled the metal grille. Its creaks were earsplitting in the silence of the night.  “I know you’re in there,” he bellowed. “If you don’t open the door within the next three minutes, I’m coming tomorrow with an arrest warrant.”  No sound came from inside the building.  Song Mike and I stood outside the grille. The night wind pierced my outfit.  “He’ll come out,” he said.  Indeed, a little while later, a flashlight ray brightened the interior of the building. Dragging footsteps approached. I narrowed my eyes; once they’d adjusted to the light, I could see the new arrival. The “Jiali Craftsman” was a small man, hunchbacked and hairless. He wore an old military uniform with no insignia. His face was covered in wrinkles, but his eyes were quick. He could have been anywhere from thirty to seventy.  He opened the cable lock with a jangle of keys, letting us inside. I noticed that his hands were long, white, and slender; the nails were speckled with filth. Up close, he stank of alcohol.  “You promised you wouldn’t bother me,” he complained in a little voice.  “As long as you behave, I’d naturally have better things to do than deal with you.” Song Mike snorted. “Go, let’s inspect your workshop.”  He hesitated, then took us onto a somehow still-functional elevator to the basement.  The huge space was brightly lit. When I made out the scene in front of me, I had to take a deep exhale to get myself under control, to not scream.  Human body parts lay scattered everywhere. Arms, legs, female chest cavities equipped with variously shaped breasts. Hair of every color lay bundled in the corners like giant stacks of hay. Row after row of faces hung from stands. A little girl was drawing eyebrows on one of them with a pen.  No, that wasn’t a real girl either. Upon closer inspection, she was only humanoid from the chest above. Below, her body was a tangled mess of metal supports.  Fuck, it made my hairs stand up on end. I felt cold sweat running over my goose bump-covered back. After nearly a decade as a police officer, I’d seen plenty of murder scenes, but the tableau here was uncanny beyond reason.  This definitely wasn’t Song Mike’s first time here. He wandered freely between the workbench and the lathe, casually picking up an ear here, a finger there, to inspect.  The Jiali Craftsman stood against the wall, closely watching Song Mike’s every move, his hands hidden in his sleeves.  He was afraid of the police.  “I’ve worked on nothing but fully aboveboard orders of late,” he rasped. “A clothing company on Mars requested two hundred stage models. I’ve been so busy that I haven’t left the room.”  Song Mike circled back, took out his phone, flicked it on, and held it in front of his eyes. “Did you make this?”  The screen displayed the photo of Liu Yan and the android secretary.  The Jiali Craftsman averted his eyes.  Song Mike’s knee went right up, landing a heavy blow on his stomach. A series of murky bubbling noises emerged from the small man’s throat. He curled up on himself. My brows drew together; I took a few steps back.  “I’ll ask you again. Did you make this?” Song Mike yanked his hair.  “They gave me a lot of money. Told me to keep it secret,” the Jiali Craftsman wheezed. Reflexive tears had trickled to the tip of his nose, where they dangled, catching the light.  “Stand up and tell me, who ordered it. What did they ask for.”  He tilted his head, looking first at Song Mike, then at me. His voice shook: “If I tell, I’m dead for certain. They aren’t normal people.”  I looked back at him, smiling. Song Mike never beat up innocents. If he thought he could play for my pity, he could think again.  “If you don’t tell, you’ll be dead with even more certainty.” Song Mike smiled, showing teeth. “Don’t forget the business at the warehouse. You still owe a debt.”  “That woman was the most meticulous work I’ve ever done.” The Jiali Craftsman had gone to wash his face; when he returned, he’d regained his composure. “All they asked for was quality. They didn’t rush me, and they gave me plenty of money. They were generous customers.”  “When was this?” Song Mike asked.  “Let me think—at least two, no, three years ago. A middle-aged man placed the order. He’d brought a photo with him and asked me to make a completely identical android.” The craftsman picked up a segment of metal skeleton from the workbench and rubbed at it, the neurotic gesture reminiscent of an insect quivering its antenna. “I said, if you want it to be completely identical, you’ll have to give me more photos. The next day, he sent me thousands of photos in all kinds of situations. Even some very private ones.”  I didn’t expect that. Song Mike’s expression was unreadable.  It wouldn’t be easy to get personal photos of Liu Yan. We’d just visited her home. Her security setup was more than enough to keep out any ordinary stalker.  “I quickly put together a first draft prototype for him. After seeing it, he still wasn’t satisfied, saying that it wasn’t at the level he’d hoped for.” The Jiali Craftsman hmmphed, tossing the finger segment back into the small bowl on the table. “It’s rare that someone expresses dissatisfaction with my work.”  “He wanted something that could pass for the real thing?” Song Mike’s brow furrowed.  “A few days later, he brought the original woman in,” he said. “I was shocked too. I’d assumed that he was some rich pervert trying to make a replacement goldfish for some woman he couldn’t have—an ordinary-looking middle-aged woman at that. I didn’t expect them to act quite close—like a couple that had been married for a long time.”  Song Mike and I exchanged a look.  “The woman looked much older than she did in the photos. She seemed very subdued, as if she were seriously ill. They stayed in my workshop for an entire day. I revised the prototype based on her appearance until both of them were satisfied.” The Jiali Craftsman found a grease-stained binder from under the workbench and flipped it open. It was full of photos of stunningly gorgeous young idols. He finally found a particular page within it and handed it to us.  It was Liu Yan, the wealthy matron we’d just seen. In the photo, she was expressionless. Her body below the neck had yet to be covered in skin, so that she resembled a car with the hood up.  “On the day of the order pickup, the two of them came together. The woman was casually flipping through my product photo catalog when she saw a handsome male attendant model. She joked about buying it and giving it to ‘the other her’ as a birthday present. And the man actually placed the order right then and there.” He looked down, picking at the filth under his nails, his voice becoming an indistinct mumble. “They paid in cash.”  “And you never wondered why they needed an android to look that close to the real thing?” Song Mike asked. “Seems like you didn’t learn your lesson from three years ago.”  “I did do a little research into them. They were important people, people I couldn’t afford to cross. I took their money and did my work. I didn’t want trouble.”  “Too late for that,” Song Mike said. “That male attendant android ran away. You may have created another murderer.”  Another? My breath caught.  “That has nothing to do with me,” the Jiali Craftsman was quick to reply. “They only ordered the androids’ chassis from me. I gave them two empty shells and nothing more. They said they’d take care of the cybertronic brains themselves.”  Song Mike laughed coldly. “You’re claiming you had nothing to do with the suppliers of the cybertronic brains? Who did the work at the adjustment stage?”  The Jiali Craftsman put his hands up. “Don’t! Don’t hurt me. It was all done through email.”  We both watched him.  He turned on his computer and logged into his email. I pushed him aside and did the rest myself, making a copy of all the emails between him and the supplier.  “What else do you want? Ask away.” He gave a long sigh. “I’m a dead man either way.”  Song Mike thought for a moment, then swiped at his phone screen several more times, before showing it to the Jiali Craftsman. “Is this the man who commissioned the android from you?”  The craftsman’s brows drew together, his eyes disappearing into their shadow.  “Don’t try to claim that you’ve forgotten. You’re an artist specializing in human faces,” Song Mike reminded him.  “That ought to be him,” he said softly.  04.  “Want to go eat something?” Song Mike asked me, as we exited the building.  I nodded. “You do owe me a proper meal.”  In the end, that so-called proper meal amounted to no more than two Cuban sandwiches from the bar. The owner was an old friend and left us a table in the corner.  We didn’t talk about the case as we ate.  After the complimentary post-meal sugarcane juice arrived on the table, the first thing Song Mike said was, “Ouyang, this business ends here. I’ll split the reward that comes out of tonight with you.”  I nearly punched him on the spot—in terms of physical combat, the bastard really might not be able to best me. Maybe my expression was overly savage, because Song Mike sighed. “It’s too late, isn’t it.”  I crossed my arms, glaring at him. “This has something to do with that warehouse case, doesn’t it.”  Song Mike was taken aback.  We fell back into silence. He waved his hand and ordered a shot of Jack Daniel’s. Few people knew that Song Mike had a pitifully low alcohol tolerance. After this shot, I might have to find someone to carry him back.  “It’s Lu Guotao again. Of course it’s him.” He grinned, gaze fixed on the bubbles slowly rising through the murky alcohol. “Ouyang, how much do you know about the warehouse case of ’78?”  “A bunch of hooligans were brawling in a warehouse in the Port District when someone opened fire, resulting in thirteen deaths.” I paused, then added, “After you investigated the case, you went from the rising star head of the investigation squad to a neighborhood bobby. I won’t relay all the rumors that flew around the station.”  At the time, I’d gone back to police school for advanced studies. When I returned to the station, I’d found my partner demoted, and I myself transferred to desk work for no apparent reason. Everyone else said that Song Mike had dragged me down by association. He and I had never openly discussed the business. If he wasn’t going to volunteer, I wasn’t going to ask.  The warehouse case was like a knot of silence between us.  Song Mike continued to stare at his drink. I didn’t rush him. I’d waited this many years already; what was a few extra minutes? Under the dim lighting of the bar, I suddenly realized how much he’d aged.  “In August of ’78, I was still in the investigation squad. Someone called the police saying a bad smell was coming from a warehouse in the Port District. I took the team down. You weren’t in Quanzhou at the time . . . good thing you weren’t.” Song Mike laughed humorlessly. “The scene looked like what you just saw in the Jiali Craftsman’s workshop. Only, all the bodies were real. All the pieces of bodies, more accurately. They were already rotting. We called in the coroner and cleaned up for a week. We confirmed there were thirteen dead, all of them unimportant hoodlums from Shijing District.”  “Firearms couldn’t have caused that level of carnage. How did they really die?” I asked softly.  “That’s the strangest part. Aside from the DNA of the deceased, there were biological traces from only one other person at the scene, and they weren’t even from blood. Eventually, we found that the fourteenth person on the scene was the Jiali Craftsman. Does that chickenhearted bastard pissing himself on the spot look like he could kill thirteen young men?” Song Mike said, “The deceased looked as if something had straight-up torn them apart. It took Old Li the coroner a lot of work to piece them back together for burial.”  “With a case this big, how come I never heard of the Central Office getting involved? Even most of us in the station haven’t heard about the investigation,” I said.  “It’s the Central Office that buried it.” He shrugged. “It’s not like those Shijing poors had friends in high enough places to stick up for them. They died. So what.”  “Do you suspect that someone was debugging illegal androids in that warehouse, and there was some kind of accident?” I recalled his words to the Jiali Craftsman, you still owe a debt, and his jab at Liu Yan earlier: you’ve really got guts.  And, Lu Guotao had once been an expert in artificial intelligence. The pieces of the puzzle were coming together.  “That piece of crap was already pants-pissing terrified, after personally watching those androids go berserk.” He turned the glass, wiping a sweaty hand on his clothes. “No point in arresting him. In the end, the Jiali Craftsman is only a craftsman—all he knows how to do is make the outer shell. The cybertronic brains came from someone else. His only contacts would’ve been low-level intermediaries in the organization—it would’ve been those same people taking away the out-of-control androids and leaving us only the floor covered in corpses. Poor young’uns. They’d probably only come there that day to shift cargo for a bit of spare change.”  I stared at the yellow dregs in the glass, a bitter taste rising in my throat. When I compared the timing of several matters, I suddenly understood a whole lot of things. “And Lu Guotao had something to do with this? He kicked this hornet’s nest and had to flee?”  “Of course not.” Song Mike laughed aloud. “The upper-level officials of Quanzhou wouldn’t cross this pack of rich elites for just thirteen poor people. Lu Guotao was forced to flee because of something else, something a lot bigger.”  I fell silent. Ever since the decline of Quanzhou, the local government had waited hand and foot on the wealthy who’d come here with their massive fortunes. The local transportation industry had long since gone kaput; the entire city subsisted on the cake crumbs they showered down.  Song Mike had plenty of flaws, but he was a good cop. I could imagine him latching his teeth into his opponent and refusing to let go. I was forced to laugh painedly. That demotion all those years ago now had a logical explanation. And his reason for telling me to extricate myself from the business had also become apparent.  “After Lu Guotao fled, I thought the business was finished. I couldn’t do anything even if I wanted to,” Song Mike said. “But now it looks like he and his wife Liu Yan remained in close contact. It’s very likely that he continued to control business affairs in Quanzhou through her.”  “Through Liu Yan’s android,” I corrected him. “According to the Jiali Craftsman, Liu Yan was involved in the creation of her android replica from start to finish, and she seemed seriously ill already. Do you think—the real Liu Yan’s still alive?”  “I’ll bet five bucks she’s already dead.” Song Mike said, “Any sickness they can’t cure with all that money has to be something really hopeless.”  “Agreed. I think she’s dead too.” I slowly organized my thoughts as I spoke. “Lu Guotao was secretly researching cybertronic brains this whole time. After he fell afoul of the law and fled the country, he continued to run his business through Liu Yan. Several years later, Liu Yan developed a terminal illness. As her death approached, they decided to make a Liu Yan android who could pass for the original in order to maintain their operations.”  After more consideration, I added, “They gave the android an android pet of its own. It’s a heck of an arrangement.”  Song Mike eyed me. “Maybe they didn’t want the fake Liu Yan to come into contact with too many outsiders. The risk of discovery adds up over a long period of time. To have a lonely rich lady’s android boy toy show his face as her representative is much more reasonable. A safe chain of puppets.”  I looked down, picking at the scraps of lettuce on the plate. “So, you knew from the start that Liu Yan is Lu Guotao’s ex-wife, and that Lu Guotao has dirt up his ass crack. Then why did you accept this side gig—unless you were hoping to follow the lead all the way up to Lu Guotao, arrest him, and conclude the case.”  He didn’t say anything.  I continued, “I have an even bigger question. Why would Liu Yan’s android—in other words, Lu Guotao, who’s behind everything—ask you to find the missing 3908? He has the money to just commission a new android from the Jiali Craftsman. We can forget that sentimental bullshit about the android being a companion and family member. Lu Guotao is a cold-blooded businessman; he’d equip 3908’s brain with some mechanism that would let him remotely wipe its data in case of emergency. And he definitely knows that you’re the cop who insisted on pursuing that case all those years ago. He should be avoiding you like the plague.”  Song Mike continued to refuse to meet my gaze.  I could hear my voice rising the whole time, unable to control my anger. “Buddy, this is a fucking trap. Don’t tell me you can’t tell.”  “I’m not trying to be some kind of goddamn hero,” he said at last. His voice was raspy. His stubby fingers gathered the short greasy hair from his forehead and pushed it back.  I raised a brow.  He lifted his gaze, which crossed my shoulder and fell on empty distance. “Lu Guotao knows that 3908 may have gone rogue. It’s more than he can handle himself. He’s afraid of a repeat of the incident at the warehouse, with more than hoodlums for victims. I’m one of the few people who know just how bad things can get.”  He used the last of his drink to water the decorative plant by the table. Song Mike said, “He doesn’t want to retrieve that boy toy android. He’s just letting me know, it would be great if I could help clean up a big-ass mess.”  05.  Leaving the bar that early morning, before parting ways with Song Mike, I half-bullied him into an agreement: he wasn’t going to chase after that potentially already berserk human-passing android on his own.  He agreed with a laugh, suspiciously quickly.  But as I watched that battered Volkswagen drive away in fitful zigzags, I understood there was nothing I could do. I knew almost nothing of the details of the warehouse case he’d investigated. What he’d described tonight was only the tip of the iceberg for sure. In Song Mike’s eyes, I would always be that little intern girl. He wanted to keep me out of this dangerous business out of some stupid straight man sense of pride.  Lu Guotao.  I said the name to myself silently as I returned to my cramped apartment. It was already two in the morning. I lay on the bed for half an hour, my eyes closed in vain. All I could think about was the scattered body parts in the workshop.  Irritably, I rose, grabbed my laptop, and sat with crossed legs. Song Mike had told me that Lu Guotao had been forced to depart for other lands for some other business that he couldn’t cover up. His wording had been suspiciously vague. Since I already knew Lu Guotao’s name and the timing of the case, it might not be too hard to find some leads.  I brought up my phone log and found the numbers of several Central Office high-tech crime investigators I’d met in police school. While I waited for someone to pick up, I logged into the department’s internal news network and began to slowly sift through the information.  06.  “Old Song?” I banged hard on the door.  I waited for half a minute, but there was no response.  I went straight to verifying my identity on the retina scanner and entered Song Mike’s office. A long time ago, I’d been his assistant; he never removed my access permissions after my transfer.  The interior smelled of cigarettes. I turned on the ventilation fan and went around the room, making an inspection. The old dossier on the warehouse case lay on the table, flipped through so many times that the edges were curling up. The desktop computer was still powered on. I gave the mouse a shake. A password pop-up appeared on the screen.  Never mind.  His jacket and car keys were missing.  I swore. The bastard had purposefully ditched me. This morning, I’d sent him the information I’d put together and left him a voicemail, telling him to wait for me to arrive at the office. Lu Guotao wasn’t just some mad scientist who’d played with fire and caused the one-off tragedy. If he’d lived last century, before the death penalty was abolished, the crimes he’d committed in the course of his private research into human-passing cybertronic brains would have earned him a hanging.  Even though Song Mike had been tracing Lu Guotao’s tracks for years, I still wasn’t sure if he knew just how terrifying his opponent was. Song Mike was an old-school cop. He wasn’t much good at digging up and collating online resources. And after the higher-ups shut down the warehouse case, he couldn’t have gotten the help of the station’s technicians.  I’d rushed into the station and still been too late.  I could picture how he’d look explaining, I can’t take a woman to capture a berserk killer robot. Heavens, it had been years since he left the front line, and I hadn’t seen him partake in any physical training. Chances were he couldn’t even outfight a street hoodlum anymore.  I pulled out my phone and called the station’s car modification aficionado. “Section Chief Zhang, let me borrow your car.”  The other party agreed readily.  As I drove into the hills, I rejoiced in my decision to borrow a car. The smooth highway had quickly become pitted cobblestone. The city no longer had the money to maintain these distant stretches of the public road network.  Song Mike didn’t pick up any of the calls I made en route. For my part, I tried diligently not to think about the crime scene photos in the dossier for the warehouse case.  Fortunately, I soon spotted his battered Volkswagen parked crookedly on the frontage road.  I stopped the car and felt for my gun. When shooting an android, aim for the stomach, that’s where the power source is—silently repeating my freshly gained knowledge once more, I kicked open the car door.  “Old Song!” I yelled.  My surroundings were dead quiet. Pebbly beach stretched from either side of the highway, from which rose massive boulders. Some kind of invasive species with yellow flowers grew everywhere amid the cracks in the stone.  “I’m here,” he answered, a hint of resignation showing in his voice. “Didn’t I tell you not to come?”  Exhaling in relief, I followed the voice past several boulders and saw Song Mike.  He was crouched beside a man’s corpse. No, it was a destroyed android.  3908 was still dressed in the expensive tailored suit he’d worn the day he disappeared. The shirt was pulled open; the power module in the abdomen was gone. The once-exquisite face was in ruins, as if someone had wildly hacked at it with a knife. The Jiali Craftsman’s heart would ache at the sight, I thought.  “Is the damage to the face to prevent somebody from recognizing it?” I crouched down next to him. “There isn’t much point to that, is there? He’s probably the only high-end hyperrealistic male android in the entire Port District.”  “It wasn’t me,” said Song Mike. “It was already like that when I found it. I feel like the vandal desecrated his face more out of jealousy.”  “Who would be jealous of—” I fell silent, then shook my head. “My god.”  Song Mike stood. “I suppose you came at just the right time. Help me dig a pit and bury it. If someone sees it, takes it for a human corpse, and reports it to the police, it’ll be more trouble.”  “So you forget that I’m a woman when you need physical work done?”  Together, we cleared out a shallow pit in the pebbles and shifted 3908’s corpse into it. The android’s cybertronic brain had been removed too, leaving only an empty skull cavity. As I picked up rocks and set them over it, I heard the faint squeaks of metal rubbing against plastic.  Finally, I found a distinctively patterned squarish rock and set it at the head of the grave. Then I took a few steps back and took a picture with my phone.  Song Mike eyed me. “Wanting to give Liu Yan closure? You know we can’t—”  “Don’t be such a bastard.” I sighed, “I know.”  07.  We were silent the entire drive back.  Song Mike came with me to return the car key. He made a circuit of the station; maybe he saw that my expression had relented, because he finally dared to say, “Let’s talk on the rooftop?”  The rooftop deck was deserted. An autumn rain was falling, drumming against the awning. Water drew trails down the walls.  “How did you find 3908?” I cradled a cup of hot chocolate, letting the steam warm my stiff face.  “Lu Guotao wanted us to find the body. He put the location tracker back in.” Song Mike’s voice was raspy. He didn’t buy a drink; he went straight to lighting up a cigarette. “Yesterday, I got the signal frequency from the Jiali Craftsman. Lu Guotao basically handed me 3908’s location on a platter.”  He paused. “And how did you follow me?”  I hesitated but told him the truth. “I tracked your phone.”  “Motherfucker,” he laughed. He didn’t sound like he minded.  “I’m really worried about you.”  He awkwardly scratched his head. After a long silence, he forced out a mutter of apology.  I shook my head. “Last night, I got into the traffic monitoring database and found the footage of 3908’s disappearance. Lu Guotao took 3908 himself. I was terrified, convinced that Lu Guotao was setting a trap to silence you. He’d do it. He’s that kind of person.”  “I know.” Song Mike ground out his cigarette stub under his foot. “I made a faulty assumption too. I only realized when I saw 3908’s corpse. Lu Guotao’s using me not to clean up that robot boy toy, but his robot wife.”  “Why can’t he do it himself?” I raised an eyebrow.  “Heaven knows. Maybe he can’t bear to. After all, the damned things look too much like real people.” Song Mike shrugged. “Tonight, I’ve arranged to see Lu Guotao in person, right at Chez Liu. We’ll see this business to the end. You bring your gun too.”  “And he has the guts to come?”  “I told him, if he can’t bend his dignity enough to talk things out in the open, I’m not going to take on this business.” Song Mike shook his empty pack of cigarettes as he spoke, then tossed it irritably into the rain. “When his fake wife goes insane in the middle of all those villas and mauls one of those leading citizens, he can try cleaning up the mess himself.”  I took a sip of hot beverage and closed my eyes. The comfort brought by sugar content was better than nothing.  “Say, do 3908 and Liu Yan realize they’re androids?”  “Does it make a difference?”  “I don’t know.”  “You can’t hesitate.” Song Mike turned to me, his voice hard. “There’s no room for discussion in this business.”  I sighed and promised him, “Of course, tonight we’ll take care of all the dangerous androids. They’re all massive threats to public safety. I’ve seen the dossier on the warehouse case. I know.”  He watched me. “They only look like humans. Don’t you get sentimental.”  I sighed.  08.  Song Mike remained the driver for our second time going to Chez Liu. I leaned back in the backseat, caressing the handgun in the inner pocket of my jacket. I felt that cold metallic weight right in the pit of my stomach.  I’d brought bad news to plenty of people before. The unspoken rule of the police station: maybe sending a kindly looking woman to bring ill tidings would ease the blow. So I’ve knocked open door after door, telling mothers their children have died in car crashes, telling wives their husbands have gone to prison.  In the present situation, I only needed to tell one robot that its robot buddy wasn’t coming back. I didn’t know why I felt so sad.  Their emotions were nothing more than a chunk of computer program. And any grief wouldn’t get to last very long.  I closed my eyes, thinking of Liu Yan again, that elegant, fragile middle-aged woman, that moment of loneliness and self-mockery in her expression. It was all fake, all programming. Sooner or later she’d devolve into a killer machine. She had to be eliminated. Privately, I hoped that Song Mike could do the dirty work, leaving me only the duty of helping him take care of the “fake Liu Yan”’s remains, the way we’d buried 3908.  But instinct told me that Song Mike might not be able to do it. He was an old-fashioned man. To have him shoot an innocent woman in cold blood might be asking too much of him. But someone had to do it.  Once again, I checked the number of bullets in my gun.  In the rainy night, Liu Yan’s villa looked like a glistening, exquisite toy model, luminously white.  We parked on the little slope behind the house. Song Mike looked several times at his watch. Finally, there came the quiet rumble of an engine in the distance. It was a familiar black Audi. We’d both seen it in the surveillance footage.  “You stay in the car,” Song Mike said.  That was what we’d planned previously. I nodded.  He got out of the car. Lu Guotao climbed out of the Audi too. Compared to the photos of him from before his disappearance, he’d gained weight. His long, angular face had become round and kindly. The hair at his temples had become completely white.  “Sergeant Song,” Lu Guotao said.  “I don’t want to shake hands with you,” Song Mike said, coming to a stop several paces away from him.  Their voices came through from the miniature microphone on Song Mike with a rustle of static.  “I understand. I’ve created many difficulties for you.” Lu Guotao let his hand fall, nodding. “Today, I have to ask something of you yet again.”  “How do I know that after I wipe your ass this time, there won’t be another time? There might be no end.” Song Mike said, “Are the police for you to play games with?”  “There won’t be another time,” Lu Guotao said, sliding his hand into his pocket.  My breath hitched, but the businessman only took out a pack of cigarettes. “Liu Yan and 3908 are special. I have no plans of continuing research on cybertronic brains on your turf. That business at the warehouse proved—sufficiently instructive.”  “Explain,” said Song Mike.  “The problem of high-complexity cybertronic brain and chassis coordination has never been solved. They lose control. My team and I have tried many ways to stabilize the psyche, with only short-term effectiveness.” On this subject, Lu Guotao spoke with a new liveliness, like all people talking about their beloved calling. “If the cybertronic brain is supplied with large quantities of a living person’s memories as a basis to operate upon, it’s capable of functioning normally for between three and five years, at least in the simulations. It’s a pity that there’s no way of extracting a living person’s memories nondestructively with current technology. We spent money to find a considerable number of terminally ill patients to serve as volunteers. They were happy to leave their families a bountiful inheritance.”  I felt disgusted.  Lu Guotao made it sound so nice, but in truth, his test subjects went far beyond “volunteer” terminally ill patients. The scandals that had erupted from several extraterrestrial orphanages were the real reason he fled as a fugitive years ago. Seeing the postmortem photos of those children in the dossier, I’d understood that there was no humanity in him.  “What a philanthropist. I’ll say thanks on behalf of those patients. And then you discovered that your own wife didn’t have long to live?” Song Mike interrupted.  “Yes.” Lu Guotao admitted, unperturbed.  “What did she catch?”  “A type of sequelae from space radiation. In the early years, while we were speculating on asteroid plots, she was the one who’d go out and inspect the land in person.” Lu Guotao laughed painedly. “Who knew that karma would be waiting for us twenty years later. She knew that she didn’t have much time left, so she brought up using her memories to make an android replica who could appear in person to continue running our business. Initially, I didn’t agree. It was like—”  His expression twisted. He made a gesture. “Facing my wife’s resurrected corpse.”  “I’m sorry for your pain.” Song Mike’s tone was flat. Even a wall could hear the sarcasm in his voice.  Lu Guotao, too, may have realized that the one standing across from him was not a suitable audience for his angst. He gave a cough. “But we had no other choice. I was on the lists as a wanted criminal. The risk of hiring someone else as a proxy was too great. We found the Jiali Craftsman together and commissioned her body double and a male assistant.”  “The assistant was made using a live person’s memories? Where did they come from?” Song Mike asked.  Lu Guotao lowered his head. The faint light from his cigarette illuminated his face. He looked much older than his true age.  “3908 is my replica.”  “You just said, there’s no way of—” Song Mike’s brow furrowed.  “I accepted the risk of brain damage. After the surgery, I experienced frequent episodes of epilepsy, short-term memory loss, and difficulties with emotional regulation.” Lu Guotao laughed. “But I had no other choice. If I used anyone else’s memories, the replica wouldn’t dedicate himself wholeheartedly to my interests.”  Song Mike was for a moment struck silent. I, too, was stunned in the car. 3908’s corpse lying on the rocky beach. And that ruined face. Song Mike had said that kind of malevolence came from jealousy.  Lu Guotao had killed another version of himself?  “When the android version of Liu Yan first powered on, the relationship between us was very awkward. She didn’t in fact know she was an android. We periodically revised her memories, wiping out all the continuity errors, helping her maintain a stable worldview.” Lu Guotao leaned against the car door, his words light yet urgent. “Intellectually, she knew she was my wife, but it was clear she no longer loved me. I could see it in her eyes. In the process of converting a living person to a machine, something had been lost. At first I thought that a cybertronic brain was simply incapable of emotion. Our goal was nothing more than to keep our business running. The woman who’d lived a lifetime with me was already dead.”  He laughed shrilly. The sound covered me in chills. “But she was too fucking similar to Ah-Yan. Every time I saw her, it felt like she’d never died. I wasn’t so insane that I wanted to sleep with a pile of metal and plastic—we maintained a business relationship. All the way until about a year ago, when my team and I inspected Liu Yan and 3908’s memories and discovered they’d fucking fallen in love.”  “Oh,” said Song Mike.  “I’m not so far gone that I’d be jealous of the robot version of me. Don’t look at me like that, I’m no cuckold. My wife’s been dead for years. Besides, it’s only natural that a robot version of me and a robot version of Liu Yan would fall for each other a second time.”  Lu Guotao shrugged and pinched out his cigarette. “But this introduced difficulties to our work. They couldn’t have a romantic relationship. The Jiali Craftsman didn’t include the capacity for lovemaking on the chassis he made. Who could have thought of a situation this crazy? Every time they tried to sleep together, they’d discover that their bodies didn’t match up with normal people’s. We were forced to regularly clear out entire chunks of their memories, to keep up their illusions of being real people.”  “It was too inconvenient, so you decided to get rid of 3908.”  “Inconvenient? I wrecked myself to create him.” Lu Guotao’s voice rose. “Cybertronic brains can’t take this kind of repeated manipulation. Their systems were only meant to remain stable for three to five years originally; with this whole business added in the mix, they’ve both reached the brink of obsolescence. It’s time for those two to retire. I got rid of 3908 myself.”  His voice shook. He couldn’t continue.  “But you couldn’t bear to kill Liu Yan,” Song Mike continued for him. “So you thought of me.”  “One last time. Whatever you want, I can give you. Money. A promotion. My connections in the Port District can still accomplish a thing or two.” Lu Guotao said softly, “I won’t make a new Liu Yan. She ought to rest in peace. After resolving this business, I’ll leave Earth. You’ll never see me again.”  Song Mike hmphed softly.  Their silhouettes were like two barren tree trunks in the night rain.  “You go to the villa to take care of Liu Yan. Leave things here to me,” Song Mike said to me through the communicator.  I assented, hopped out of the car, and went walking toward Chez Liu beneath the hill.  When I’d walked about a hundred meters, I heard the sound of a gunshot from behind me.  09.  Seeing her for the second time, I couldn’t help myself—I closely observed her eyes, her hair, and her chest, which faintly rose and fell as she breathed.  The Jiali Craftsman was truly preternaturally skilled.  Liu Yan noticed my gaze. She laughed and shifted aside to let me in. “You know now.”  She knew that she was an android.  “Our conversation likely won’t take long, so I won’t invite you to sit,” she said. Today she wore a light beige hemp shirt and leisure pants. Her hair was plaited behind her head in a Greek-style updo. She’d put on light makeup.  We stood on the carpet of the living room, looking at each other wordlessly.  “Old Lu took care of 3908?” Liu Yan asked, looking down.  “Yes,” I admitted.  How much did she know? Would she resist at the brink? I remembered the crime scene photos from the warehouse incident. Cold sweat trickled down my back.  “He didn’t suffer, did he?” Liu Yan said in a small voice.  Your husband gouged his face off, I thought. I dug out my phone and brought up the picture of 3908’s resting place. “No, he only removed the battery. We gave him a burial. No one will disturb him.”  “Old Lu would have also destroyed his cybertronic brain. It’s the only way to be safe.” She fixed her gaze on that deserted rocky beach for a long time. Then she hesitated, before saying, “In a moment, I hope you’ll take care of me in the same way.”  For a moment, I didn’t know what to say.  “I have many of Liu Yan’s memories. I know that androids like us must be eliminated at a certain date, or we go mad.” As she spoke, the faint lines around her eyes drew together from her smile. “Finding you two was a plan Old Lu and I came up with together. Old Lu couldn’t bear to kill me. He would put it off, day after day, until the point of no return.”  So she’d taken care to pretty herself up today. She’d known that her death was approaching and wanted to end things looking presentable.  “Where do you want to . . . ” I said.  “How about the garden? Liu Yan loved taking care of the garden best when she was alive. It makes things easier for you, too. I’ve already had someone dig the pit.” Her lashes fluttered. “I weigh one hundred thirty kilos now, as a woman of steel.”  10.  “You’re done?” Song Mike asked.  “You dumbass.” I shook my head.  Lu Guotao’s corpse lay on the hill. Half his head had been blown off. Song Mike hadn’t used a gun from the station. Thank heaven and earth, he could still keep the finer points in mind.  “If you want to turn me in when we get back to the station, I won’t blame you,” he said. He tried to light a smoke in the rain, probably thinking he looked like some kind of cool loner hero.  Sadly his lighter wasn’t the quality of Lu Guotao’s. He tried several times without success.  “Shut up.” I grabbed the legs of the deceased. “Come over and help me carry him.”  Song Mike was taken aback for a moment, then hurried over. Together, we packed Lu Guotao’s corpse into the back trunk of the Audi and drove it to Chez Liu. Earlier, I’d already found the controls for the security system inside the villa and turned off the alarms.  When it came to arranging the scene of an accident, no one was more professional than the police.  Lu Guotao had sought to destroy the robot wife he’d created, only to be killed by the rampaging android. A perfect story. To create a suitable effect, we shot a few more times at Lu Guotao and Liu Yan’s corpses. I felt sorry for Liu Yan, that she wouldn’t be able to rest in peace under the swaying roses in the garden sepulcher she’d arranged for herself.  But it was the best we could do.  We spent the return trip covered in blood and too exhausted to move a finger. Fortunately Song Mike’s battered Audi had an autopilot system; otherwise, with our shaking hands, we probably would’ve crashed to our deaths against the highway railing.  Several times, Song Mike tilted his head to look at me, wanting to say something but stopping himself.  Tonight, I didn’t have the energy for more guessing games. Song Mike’s fixation on the warehouse case over so many years had stemmed from more than a sense of justice; he had to have personal reasons. It didn’t take a genius cop to guess that.  “The thirteen people who died in that warehouse. They included your friends,” I said.  “My brothers,” he admitted, “And three boys I knew as a kid. I grew up in Shijing. I changed my identity so I could pass the civil exams and become a police officer. No one else knows.”  I nodded. I’d guessed all of it. “That Lu guy got what he deserved. His body count has hit three digits in the course of his fucked-up research. If we didn’t stop him, he’d just keep going. We were right to off him.”  Song Mike said nothing.  Whether he’d decided to shoot Lu Guotao after seeing the dossier on the orphanage disappearances, or planned it from the start, I didn’t want to ponder further. I was certain of only one thing: the world was safer with Lu Guotao six feet under. We were the police. It was our duty.  “You’re right. He deserved to eat a bullet.” At last, Song Mike covered his face and chuckled roughly. “I owe you big time.”  Epilogue.  Outside the car window, the rain continued to fall, raindrops tracing twisted tear tracks on the glass.  I supposed that was another extraordinary thing. In life, Liu Yan and Lu Guotao were a pair of selfish bastards who’d endangered other people’s lives without a care. But reincarnated into machines, they’d become a pair of endearing lovers who’d tried to prevent harm to innocents and went willingly toward their deaths.  I touched the contents of my pocket: a little strand of black artificial hair and a ring.  Once things settled, I was going to visit that rocky shore one last time. The robot version of Liu Yan had hoped that a part of her could be buried with 3908.  Once I completed this task, I should finally be able to forget her eyes.  Originally published in Chinese in Galaxy’s Edge #007, November 2020.  Translated and published in partnership with Storycom.  Born in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest.", "text": "11440 words, novelette\nInhuman Lovers\nIt was never a good sign when Song Mike came looking for me at the end of the workday.\n“You, come out here for a sec.” He leaned against the doorway, nodding in my direction.\nI stuck my head out from behind my computer monitor and looked him up and down. The guy was red around the eyes, his blue-gray chin bristling with stubble. He wore a denim jacket draped over his police uniform shirt with the zipper open; his bulging belly really showed off the food stain stretched over it. Wrinkles covered his trousers. He’d probably spent last night sleeping in the office—no wonder his wife had run off with another man.\nI stood up and gestured a hand. “Let’s go to the top floor. I need to buy a cup of coffee.”\nTen years ago, back when Quanzhou’s Citong Port District was still rolling in lucre, the city’s budget allowances had seemed inexhaustible. The police chief had bought a pile of recreational equipment and set up a police break area on the top floor. Back then, every afternoon break, everyone would get together and play billiards, fifteen bucks a match. Song Mike would always lose to me. Eventually, he stopped playing. Maybe he decided that losing to the girl rookie was too much of a loss of face.\nThese days, the game room and gym were a ghost town. Only the coffee vending machine in the corner still saw any use.\nI invited him to an espresso and grabbed an Americano for myself. After an entire day of suffering through paperwork, I needed a pick-me-up too.\n“I’ve got a job. Rich lady came calling, saying her android disappeared.” Song Mike pried up the pull tab and rubbed at his nose. “Sounds like that kind that’s been privately modded.”\n“That kind?” I raised an eyebrow.\nIn the Port District, you couldn’t own a car on the salary from the police station. Everyone would take up some private detective jobs on their own; the higher-ups turned a blind eye, unless you went too far. Song Mike would sometimes take me on as a partner, especially when he needed to interact with females. He was an old-fashioned man; in some areas, he maintained a rare kind of prudery.\nNaturally, I wasn’t against the arrangement. Who’d turn down a side gig?\n“Looks like that kind of . . . ” He fished out his phone, pulled up a photo, and handed it to me.\nThere were two people in the photo. One was a woman, already crossed into middle age. She was dressed in a camel-colored long coat and pretty expensive-looking shoes. She faced the camera, her smile dispassionate and formal. The missing android stood at her side with a focused expression, staring at its owner’s profile. It was extraordinarily handsome, bearing a sense of artistry beyond what could be found in products off the assembly line. This guy couldn’t have come cheap.\n“Isn’t that Liu Yan?” I asked.\nThe woman in the photograph would have been instantly recognizable to anyone in Quanzhou, with her regular appearances in business news headlines. In recent years, she’d announced her retirement and came to maintain a much lower profile, but she still remained an important figure.\n“She says that’s her secretary of business affairs. It knows a lot of confidential secrets—that’s why she has to have it back.” Song Mike gave a dry cough. “I don’t think their relationship is as straightforward as she says. She couldn’t give me this android secretary’s model number. She said it was a private custom model.”\n“Wow . . . ” I was admiring the handsome man in the photo once more, expressing my approval for this lady’s taste.\n“She arranged to speak in person with me at her home one hour from now,” Song Mike said, retrieving his phone. “I think the conversation would go better with you there.”\n“A rich lonely lady who played with fire and got burned, trying to find her missing android boy toy.” I shrugged. “Sounds like good money.”\nI rose to my tiptoes and chucked my empty coffee can halfway across the room into the trash bin. Perfect shot. I glanced at my watch: “I’ll get my things. I’ll meet you in ten minutes in the parking lot.”\nOn previous occasions, Song Mike would mutter if you weren’t wearing a dress, who could tell you’re a woman.\nBut it seemed like he was in a low mood today. He only gave me a glance without saying anything.\n01.\nSong Mike drove his battered Volkswagen while I sat in the backseat, my laptop bouncing along on my lap. We were crossing the decayed city center of Quanzhou; in the distance, we could see the warm colors of the lanterns of Kaiyuan Temple in the dusk. The Ghost Festival was once more nearly upon us.\nFlocks of jobless youths wandered the streets in the fine rain, their fluorescent plastic outfits shimmering. They climbed onto the window ledges of abandoned shopping centers, kicking their long legs and chewing gum. Someone recognized Song Mike’s car, raised a middle finger, and spat in our direction.\n“Aren’t you going to deal with that?” I said, half-teasingly.\n“We’re not on the clock,” Song Mike said, his tone weary. “Besides, what can we do? Beat up this crowd of brats?”\nBut Bin District on the city outskirts was a completely different world. The sea, surface rippling with the last light of sunset, skimmed past the car window. A line of birds returning to their nests touched down lightly upon the white shore. Here, even the sand had been imported straight from some foreign island. House prices in Bin District had hit six digits all the way back in ’72.\nAnd our client lived in one of these villas.\nSadly, we weren’t in a mood to appreciate the rare sight of such moneyed scenery. Song Mike had me use the opportunity to look up the client’s—Liu Yan’s—background.\nThere was a lot of information on her on the Internet, but most of it came from official business news reports and interviews. There wasn’t much we could use. Liu Yan came from humble origins; several rounds of outer space investment in her youth had launched her into wealth. Afterward, she’d left Beijing to quietly live in Quanzhou’s Citong Port District, but she still held large numbers of shares in several noteworthy corporations. She’d been married once—her ex-husband Lu Guotao had also been a big name in the business world, only to flee under suspicion of serious business wrongdoing quite a number of years ago. They used to operate as a husband-wife team, yet Liu Yan had miraculously come through the business unscathed, managing to keep her own assets.\nI rapidly flipped through the search results, picking out the important bits to read out loud. “I can’t find much negative news about her online. Does she naturally keep a low profile or is she just good at PR?”\nSong Mike snorted. “How many rich people keep their asses clean?”\nAfter his investigation into that warehouse massacre case several years ago had gotten shut down, he’d been allergic to rich folks.\nI ignored him, continuing to look through the sources. “Her ex-husband Lu Guotao has an interesting background. Before he got rich off of asteroid real estate, he earned an MD in neurology, and even held a university teaching position related to AI research. He only went into business in his middle age.”\n“Mm,” answered Song Mike, uninterested.\n“They seemed to get along quite well as husband and wife.” I looked at the screen; just a bit of searching presented me with photos of Lu Guotao and Liu Yan together in various old news articles. There’d never been rumors of extramarital affairs associated with Lu Guotao. It was rare to see for someone at his tier of wealth.\n“Not that it stopped her from getting a robot for her loneliness after her husband ran off.” Song Mike sounded awfully bitter.\nWe’d entered the villa district. Everyone was starting and stopping, presenting invitation codes to the countless security systems.\nOn either side of the sandstone-paved road were little houses shaded by palm trees. The Chinese redbuds were dropping their flowers, carpeting the ground in decaying red. Liu Yan’s house was deep within the lake area, a two-story Western-style house, completely snow-white, with a big terrace to one side extending straight into the bay. Wicker chairs and patio umbrellas were arranged on the terrace, so that you couldn’t help but envision those long, idle afternoon hours.\nOnly the lights in the living room were on.\nWe sat in the car looking at it for a while, speculating on the overall cost of Chez Liu’s security system while we were there. Several stealth surveillance drones patrolled above the roof. Not even the biggest bank in Quanzhou got fancier than that.\n“You’d be as safe here as if you lived in a fortress,” I sighed. I took out my compact, straightened my hair, and touched up my makeup.\nSong Mike had changed into a clean dark blue suit before leaving. I maintained it for him in the changing room at the police station for situations like the one in front of us. After his divorce, I’d taken on the duty of making him occasionally look presentable. Some people in the station gossiped that we’d gotten together, but we understood that nothing like that was going to happen between us. He’d brought me into the profession in the first place; it was natural that we’d take care of each other.\nThat was all.\nTen or so seconds after we rang the doorbell, the lady of the house opened the door.\nLiu Yan looked somewhat younger than she had in the photos. Long, thick raven-black hair fell to her shoulders. Only a few signs of artificial tweaking marked her features, which were worthy of being described as stately and lovely. She’d known that Song Mike would bring a female partner, so she was only dressed in velvet yoga clothes and slippers.\nI really hoped that I’d still have a waist as slender as hers when I was in my forties.\n“Sergeant Song. Miss Ouyang.” She shook hands with us in turn. Her voice was soft and sweet. “I’m very grateful that you’d take the time to help me resolve my little personal problem.”\nSong Mike nodded.\nWe walked into the living room and sat on one corner of the sofa. Liu Yan’s home didn’t give off any of the signs of the nouveau riche. Every article of furniture was expensive in a simple, elegant way. A dry-brush landscape ink painting scroll hung on the wall. Definitely an original, I thought.\nLiu Yan personally brought us tea.\nI was surprised. A fancy house like this, without a housekeeper.\n“Forgive me, normally, these duties would be performed by 3908,” she explained apologetically. “After its disappearance—”\n“3908?” I raised an eyebrow.\n“That’s the name of my missing android secretary. It came up with the name itself. I’d wanted to give it a more humanoid name, but it was very stubborn on this point.” Liu Yan laughed.\nSong Mike and I exchanged a look.\n“This is also why I hope to find 3908 as soon as possible. It’s—highly intelligent. I’m afraid of it being subjected to suffering and harm.” Liu Yan hesitated for a few seconds, her thin hands clasped over her knees. The raised veins on the backs of her hands were the only places where her body revealed its true age.\n“Intelligent? You mean, the program in its cybertronic brain isn’t the version generally available on the market?” Song Mike asked.\nI glanced at him.\nHe seemed somewhat reckless today, accusing the client of exploiting a legal gray area right off the bat. This wasn’t going to help us draw out information. To tamper with an android’s cybertronic brain programming was technically a crime but faced with companies’ quest for profit and geeks’ curiosity, the law was increasingly becoming empty paper.\n“That’s not important,” Liu Yan said, with a faint lift of her head. Her voice rose. “I’m simply saying, you can treat this as a missing person case with a real person. Perhaps it seems absurd to you, but ever since I started living alone, it’s been my only companion. I see it as a member of my family.”\n“We understand how you feel.” Smiling at her, I took out a paper notebook and pen—for some reason, the gesture always made clients feel like they were being taken seriously. “And AI inspection is outside of our purview. It’s just that we need to understand the logic driving your android secretary’s actions to better figure out what happened to it.”\nLiu Yan’s expression eased somewhat.\nI stealthily shot Song Mike a look. “Could you describe the exact circumstances of its disappearance?”\n“It was yesterday morning,” Liu Yan said. She became calm and methodical as she began her recollections. I was reminded that she’d once been a successful businesswoman. “3908 is also my fully authorized business representative. I had it visit the company office to interview a new director of financial affairs. But at the appointed hour, the company called me saying that 3908 hadn’t arrived at the meeting room. I was taken aback and concerned. I had my people search the entire route. 3908’s car was parked on the frontage road next to the highway near the company. The door was locked. There were no signs of force. It was simply that the android had disappeared.”\n“Isn’t your android equipped with a location tracker?” Song Mike asked.\n“Not anymore.” Liu Yan shook her head. “It doesn’t like having surveillance on its body. I removed the device on its behalf.”\nI wrinkled my brow.\n“Forgive me, ma’am.” Song Mike leaned forward. “Just what level of independence and intelligence does your android possess?”\n“3908 is the work of an artist friend. I admit, it doesn’t run the standard program,” Liu Yan said. She didn’t seem to mind Song Mike’s repeated attempt to intimidate. “3908’s intellectual capacity is beyond my ability to quantify in specific terms. After all, I’m not a field expert.”\nThe corner of her lips curved faintly, as if she’d thought of something. “All I can say is that in day-to-day interactions, it’s completely identical to a normal human being, simply more innocent. It’s a good boy.”\n“Ma’am, you’ve really got guts.” Song Mike shook his head. “Once the programming goes wrong—”\n“To live in this world is to accept risk,” said Liu Yan, lifting her gaze. “Next to the impenetrability of the human heart, I’d rather have a robot as a companion.”\nAs police officers who interacted daily with the evils of humanity, we were both wordless for a time.\n“Why do you think it disappeared? Who would want it?” I tapped the paper with the point of my pen, breaking the silence.\n“I really—don’t know.” Liu Yan spread her hands a little. “I’m largely retired. I’m only involved with the company in a nominal advisory capacity. My social connections in Quanzhou aren’t complicated either. I have no enemies. It’s possible that someone kidnapped 3908 under the assumption that it has important corporate secrets in its head.”\n“It wouldn’t have value to someone else on its own?” Song Mike asked again.\n“In terms of monetary value, it would be worth a top-tier luxury car, I suppose. My friend’s creations have always had very high market value.” The corner of Liu Yan’s mouth lifted; her smile was a little ironic. “It could be resold after reformatting the brain. It’s very beautiful. It could easily find a buyer.”\nShe thought some more, then added, “I’ve also put out word that I’d be willing to ransom it back for a good price, but as of yet, no one has contacted me.”\n“Interesting,” Song Mike muttered.\nAfter the third round of tea, we said our farewells and left.\nLiu Yan escorted us to the gate. A night wind was blowing; her body seemed especially frail under the soft athletic top. I once again noticed how vacant and quiet this whole villa seemed.\n“We’ll contact you if we find anything,” I said, clasping her hand and shaking it gently. Surprisingly, I kind of liked her.\n“If it’s already too badly destroyed when you find it, don’t show me the pictures,” she said. She sniffled. Her cool, refined outer shell had abruptly cracked. “Just tell me what happened. Don’t let me see the pictures.”\n02.\n“What do you think?” Back in the car, I huddled up to the heater, rubbing my hands together.\nThat villa was as cold as an icebox. It wasn’t even September yet, but I was covered in goose bumps.\nSong Mike didn’t answer, busy lighting a cigarette.\n“Their relationship probably isn’t as spicy as we envisioned. She sees that android more like a pet dog,” I added.\nOr a friend. But instinct told me that Song Mike wouldn’t want to hear that word.\nOnce he’d deep-exhaled two masses of smoke, thoroughly polluting the air inside the car, he gave me a sidelong glance. “Did you really not notice?”\n“Ah?” I leaned over, appropriated the lighter and pack of cigarettes, and lit one for myself. “Notice what?”\n“That big house didn’t have a single living soul inside.” He turned the ignition; the old Volkswagen engine coughed to life. “That woman’s an android too.”\nI choked on smoke, nearly hacking out a lung. “No way . . . have androids gotten that realistic already?”\nI carefully thought back on how it had felt to shake hands with Liu Yan, the texture of the skin, the warmth, the amount of force exerted. All of it had been indistinguishable from a human.\n“Where do you think we live? There are no prohibitions here like there are in the big cities.” Song Mike shrugged. “These hyperrealistic products have been out on the market for years.”\nI shivered a little, not from cold. “Where? Out of the people we see on a day-to-day basis—”\n“Where’s your mind going?” Song Mike guffawed. “Those replica people look pretty on the outside, but they all act like dopes. It’s easy to tell the difference. The one we met today is different—that’s a real high-end product. I’ve never seen this impressive a replica. But there’s still some tiny differences if you look—I can’t put them into words myself.”\n“Where did you see the dopey replica people?” I asked, watching him.\nHe averted his gaze.\nI thought about it and understood. “You’ve gone to Shuicai too?”\nShuicai Street boasted the biggest brothel in Citong Port. Every half year, the station sent someone down to inspect the girls’ health certificates. I’d gone too, and all I could say was, hell on earth. Row upon row of gene-edited girls, stunningly beautiful and mentally hobbled, sitting lined up behind the glass display window waiting for guests.\nNaturally they were healthy, born with a long list of disease immunities. They would live with the ageless faces of young girls until seventy, and only then begin to decline and age.\nAnd they’d be eternally happy, never to ponder the questions that brought pain to humankind.\nCompared to me, stressing every day over making rent, I didn’t know who ought to pity whom. If they were using robots to replace them—it didn’t seem that bad a thing.\nSong Mike cranked the car window down a crack, letting out the miasma that the two of us had produced. “Do you have anything else this evening?”\n“Hmm?”\n“Let’s pay a visit to that android maker. He lives in Shijing. No one knows his real name, but they call him the Jiali Craftsman.”\nJiali was local dialect for “puppet show.” Now that I thought about it, it made a good nickname for a maker of replica androids.\nSong Mike knew him.\nTo tell the truth, I wasn’t surprised at all. At Chez Liu, when Song Mike didn’t expend energy on interrogating Liu Yan about her “artist friend,” I’d known that he had to already know something. Moreover, the nature of this case had turned from “rich lady trying to find her stolen sexbot on the down-low” toward a stranger direction, thoroughly arousing my sense of curiosity.\nAside from that, Song Mike’s state of mind didn’t seem quite right. I didn’t want to leave him to go at this alone.\n“Let’s go. I don’t have work tomorrow,” I said.\n03.\nShijing after dark was a land of wonders.\nMore than a decade ago, this had been the busiest place in Citong. Every day, hundreds of mega-scale interstellar cargo ships would set anchor at the port in an unceasing river, bringing with them an infinite flow of cash, new technology, and travelers. Back then, the entire Port District had been as profligate as one of the oil countries from the olden days.\nWe’d all thought the good times would last forever.\nThen came wormhole shipping. Cargo ships no longer needed to dock here. The Port District had deteriorated with shocking speed into an underground market, even becoming a gathering place for outside fugitives and the jobless. I could be wearing a police uniform and armed with a gun, but even during the day, I’d think twice about going here alone.\nComing here with Song Mike, at least, I didn’t have to worry for my safety. He parked the battered Volkswagen outside and led me into Shijing on foot. After the rain, puddles had accumulated on the long-neglected surface of the road, reflecting the colorful storefronts on either side of the street. Most were selling bootleg video games and banned substances, with stands hawking vermicelli congee and fried oysters interspersed among them, wafting inviting scents.\nAs we walked, people kept coming up to him and throwing an arm over his shoulder. Only his strength of will kept him from getting dragged into a bar to “drink a couple.” As for me, I tried hard not to stare at the body self-remodeling aficionados. Their electronic organs were exposed outside their bodies, hearts and lungs even painted with fluorescent pigments, brightening and dimming with their breath and heartbeat. Noticing my peeking, they began to whistle. “Hey, these aren’t the only parts we’ve remodeled!”\nI turned away my gaze.\n“That lives here.” Hands in pockets, Song Mike gestured with his chin at a large, rundown building.\nThe windows of the building were pitch-black.\n“What grudge do you have against him?” I’d heard the disgust in his voice. I inspected the stun baton hidden up my sleeve; it was black market equipment I’d gotten myself, smaller than a pencil, but capable of zapping a hulking grown man into pissing himself on the ground.\nHe gave me a sidelong look. “I’ll tell you afterward.”\nWe came to the front of the building. The glass door of the foyer had been shattered long ago. A metal grille and an old-fashioned cable lock kept the homeless out.\nSong Mike rattled the metal grille. Its creaks were earsplitting in the silence of the night.\n“I know you’re in there,” he bellowed. “If you don’t open the door within the next three minutes, I’m coming tomorrow with an arrest warrant.”\nNo sound came from inside the building.\nSong Mike and I stood outside the grille. The night wind pierced my outfit.\n“He’ll come out,” he said.\nIndeed, a little while later, a flashlight ray brightened the interior of the building. Dragging footsteps approached. I narrowed my eyes; once they’d adjusted to the light, I could see the new arrival. The “Jiali Craftsman” was a small man, hunchbacked and hairless. He wore an old military uniform with no insignia. His face was covered in wrinkles, but his eyes were quick. He could have been anywhere from thirty to seventy.\nHe opened the cable lock with a jangle of keys, letting us inside. I noticed that his hands were long, white, and slender; the nails were speckled with filth. Up close, he stank of alcohol.\n“You promised you wouldn’t bother me,” he complained in a little voice.\n“As long as you behave, I’d naturally have better things to do than deal with you.” Song Mike snorted. “Go, let’s inspect your workshop.”\nHe hesitated, then took us onto a somehow still-functional elevator to the basement.\nThe huge space was brightly lit. When I made out the scene in front of me, I had to take a deep exhale to get myself under control, to not scream.\nHuman body parts lay scattered everywhere. Arms, legs, female chest cavities equipped with variously shaped breasts. Hair of every color lay bundled in the corners like giant stacks of hay. Row after row of faces hung from stands. A little girl was drawing eyebrows on one of them with a pen.\nNo, that wasn’t a real girl either. Upon closer inspection, she was only humanoid from the chest above. Below, her body was a tangled mess of metal supports.\nFuck, it made my hairs stand up on end. I felt cold sweat running over my goose bump-covered back. After nearly a decade as a police officer, I’d seen plenty of murder scenes, but the tableau here was uncanny beyond reason.\nThis definitely wasn’t Song Mike’s first time here. He wandered freely between the workbench and the lathe, casually picking up an ear here, a finger there, to inspect.\nThe Jiali Craftsman stood against the wall, closely watching Song Mike’s every move, his hands hidden in his sleeves.\nHe was afraid of the police.\n“I’ve worked on nothing but fully aboveboard orders of late,” he rasped. “A clothing company on Mars requested two hundred stage models. I’ve been so busy that I haven’t left the room.”\nSong Mike circled back, took out his phone, flicked it on, and held it in front of his eyes. “Did you make this?”\nThe screen displayed the photo of Liu Yan and the android secretary.\nThe Jiali Craftsman averted his eyes.\nSong Mike’s knee went right up, landing a heavy blow on his stomach. A series of murky bubbling noises emerged from the small man’s throat. He curled up on himself. My brows drew together; I took a few steps back.\n“I’ll ask you again. Did you make this?” Song Mike yanked his hair.\n“They gave me a lot of money. Told me to keep it secret,” the Jiali Craftsman wheezed. Reflexive tears had trickled to the tip of his nose, where they dangled, catching the light.\n“Stand up and tell me, who ordered it. What did they ask for.”\nHe tilted his head, looking first at Song Mike, then at me. His voice shook: “If I tell, I’m dead for certain. They aren’t normal people.”\nI looked back at him, smiling. Song Mike never beat up innocents. If he thought he could play for my pity, he could think again.\n“If you don’t tell, you’ll be dead with even more certainty.” Song Mike smiled, showing teeth. “Don’t forget the business at the warehouse. You still owe a debt.”\n“That woman was the most meticulous work I’ve ever done.” The Jiali Craftsman had gone to wash his face; when he returned, he’d regained his composure. “All they asked for was quality. They didn’t rush me, and they gave me plenty of money. They were generous customers.”\n“When was this?” Song Mike asked.\n“Let me think—at least two, no, three years ago. A middle-aged man placed the order. He’d brought a photo with him and asked me to make a completely identical android.” The craftsman picked up a segment of metal skeleton from the workbench and rubbed at it, the neurotic gesture reminiscent of an insect quivering its antenna. “I said, if you want it to be completely identical, you’ll have to give me more photos. The next day, he sent me thousands of photos in all kinds of situations. Even some very private ones.”\nI didn’t expect that. Song Mike’s expression was unreadable.\nIt wouldn’t be easy to get personal photos of Liu Yan. We’d just visited her home. Her security setup was more than enough to keep out any ordinary stalker.\n“I quickly put together a first draft prototype for him. After seeing it, he still wasn’t satisfied, saying that it wasn’t at the level he’d hoped for.” The Jiali Craftsman hmmphed, tossing the finger segment back into the small bowl on the table. “It’s rare that someone expresses dissatisfaction with my work.”\n“He wanted something that could pass for the real thing?” Song Mike’s brow furrowed.\n“A few days later, he brought the original woman in,” he said. “I was shocked too. I’d assumed that he was some rich pervert trying to make a replacement goldfish for some woman he couldn’t have—an ordinary-looking middle-aged woman at that. I didn’t expect them to act quite close—like a couple that had been married for a long time.”\nSong Mike and I exchanged a look.\n“The woman looked much older than she did in the photos. She seemed very subdued, as if she were seriously ill. They stayed in my workshop for an entire day. I revised the prototype based on her appearance until both of them were satisfied.” The Jiali Craftsman found a grease-stained binder from under the workbench and flipped it open. It was full of photos of stunningly gorgeous young idols. He finally found a particular page within it and handed it to us.\nIt was Liu Yan, the wealthy matron we’d just seen. In the photo, she was expressionless. Her body below the neck had yet to be covered in skin, so that she resembled a car with the hood up.\n“On the day of the order pickup, the two of them came together. The woman was casually flipping through my product photo catalog when she saw a handsome male attendant model. She joked about buying it and giving it to ‘the other her’ as a birthday present. And the man actually placed the order right then and there.” He looked down, picking at the filth under his nails, his voice becoming an indistinct mumble. “They paid in cash.”\n“And you never wondered why they needed an android to look that close to the real thing?” Song Mike asked. “Seems like you didn’t learn your lesson from three years ago.”\n“I did do a little research into them. They were important people, people I couldn’t afford to cross. I took their money and did my work. I didn’t want trouble.”\n“Too late for that,” Song Mike said. “That male attendant android ran away. You may have created another murderer.”\nAnother? My breath caught.\n“That has nothing to do with me,” the Jiali Craftsman was quick to reply. “They only ordered the androids’ chassis from me. I gave them two empty shells and nothing more. They said they’d take care of the cybertronic brains themselves.”\nSong Mike laughed coldly. “You’re claiming you had nothing to do with the suppliers of the cybertronic brains? Who did the work at the adjustment stage?”\nThe Jiali Craftsman put his hands up. “Don’t! Don’t hurt me. It was all done through email.”\nWe both watched him.\nHe turned on his computer and logged into his email. I pushed him aside and did the rest myself, making a copy of all the emails between him and the supplier.\n“What else do you want? Ask away.” He gave a long sigh. “I’m a dead man either way.”\nSong Mike thought for a moment, then swiped at his phone screen several more times, before showing it to the Jiali Craftsman. “Is this the man who commissioned the android from you?”\nThe craftsman’s brows drew together, his eyes disappearing into their shadow.\n“Don’t try to claim that you’ve forgotten. You’re an artist specializing in human faces,” Song Mike reminded him.\n“That ought to be him,” he said softly.\n04.\n“Want to go eat something?” Song Mike asked me, as we exited the building.\nI nodded. “You do owe me a proper meal.”\nIn the end, that so-called proper meal amounted to no more than two Cuban sandwiches from the bar. The owner was an old friend and left us a table in the corner.\nWe didn’t talk about the case as we ate.\nAfter the complimentary post-meal sugarcane juice arrived on the table, the first thing Song Mike said was, “Ouyang, this business ends here. I’ll split the reward that comes out of tonight with you.”\nI nearly punched him on the spot—in terms of physical combat, the bastard really might not be able to best me. Maybe my expression was overly savage, because Song Mike sighed. “It’s too late, isn’t it.”\nI crossed my arms, glaring at him. “This has something to do with that warehouse case, doesn’t it.”\nSong Mike was taken aback.\nWe fell back into silence. He waved his hand and ordered a shot of Jack Daniel’s. Few people knew that Song Mike had a pitifully low alcohol tolerance. After this shot, I might have to find someone to carry him back.\n“It’s Lu Guotao again. Of course it’s him.” He grinned, gaze fixed on the bubbles slowly rising through the murky alcohol. “Ouyang, how much do you know about the warehouse case of ’78?”\n“A bunch of hooligans were brawling in a warehouse in the Port District when someone opened fire, resulting in thirteen deaths.” I paused, then added, “After you investigated the case, you went from the rising star head of the investigation squad to a neighborhood bobby. I won’t relay all the rumors that flew around the station.”\nAt the time, I’d gone back to police school for advanced studies. When I returned to the station, I’d found my partner demoted, and I myself transferred to desk work for no apparent reason. Everyone else said that Song Mike had dragged me down by association. He and I had never openly discussed the business. If he wasn’t going to volunteer, I wasn’t going to ask.\nThe warehouse case was like a knot of silence between us.\nSong Mike continued to stare at his drink. I didn’t rush him. I’d waited this many years already; what was a few extra minutes? Under the dim lighting of the bar, I suddenly realized how much he’d aged.\n“In August of ’78, I was still in the investigation squad. Someone called the police saying a bad smell was coming from a warehouse in the Port District. I took the team down. You weren’t in Quanzhou at the time . . . good thing you weren’t.” Song Mike laughed humorlessly. “The scene looked like what you just saw in the Jiali Craftsman’s workshop. Only, all the bodies were real. All the pieces of bodies, more accurately. They were already rotting. We called in the coroner and cleaned up for a week. We confirmed there were thirteen dead, all of them unimportant hoodlums from Shijing District.”\n“Firearms couldn’t have caused that level of carnage. How did they really die?” I asked softly.\n“That’s the strangest part. Aside from the DNA of the deceased, there were biological traces from only one other person at the scene, and they weren’t even from blood. Eventually, we found that the fourteenth person on the scene was the Jiali Craftsman. Does that chickenhearted bastard pissing himself on the spot look like he could kill thirteen young men?” Song Mike said, “The deceased looked as if something had straight-up torn them apart. It took Old Li the coroner a lot of work to piece them back together for burial.”\n“With a case this big, how come I never heard of the Central Office getting involved? Even most of us in the station haven’t heard about the investigation,” I said.\n“It’s the Central Office that buried it.” He shrugged. “It’s not like those Shijing poors had friends in high enough places to stick up for them. They died. So what.”\n“Do you suspect that someone was debugging illegal androids in that warehouse, and there was some kind of accident?” I recalled his words to the Jiali Craftsman, you still owe a debt, and his jab at Liu Yan earlier: you’ve really got guts.\nAnd, Lu Guotao had once been an expert in artificial intelligence. The pieces of the puzzle were coming together.\n“That piece of crap was already pants-pissing terrified, after personally watching those androids go berserk.” He turned the glass, wiping a sweaty hand on his clothes. “No point in arresting him. In the end, the Jiali Craftsman is only a craftsman—all he knows how to do is make the outer shell. The cybertronic brains came from someone else. His only contacts would’ve been low-level intermediaries in the organization—it would’ve been those same people taking away the out-of-control androids and leaving us only the floor covered in corpses. Poor young’uns. They’d probably only come there that day to shift cargo for a bit of spare change.”\nI stared at the yellow dregs in the glass, a bitter taste rising in my throat. When I compared the timing of several matters, I suddenly understood a whole lot of things. “And Lu Guotao had something to do with this? He kicked this hornet’s nest and had to flee?”\n“Of course not.” Song Mike laughed aloud. “The upper-level officials of Quanzhou wouldn’t cross this pack of rich elites for just thirteen poor people. Lu Guotao was forced to flee because of something else, something a lot bigger.”\nI fell silent. Ever since the decline of Quanzhou, the local government had waited hand and foot on the wealthy who’d come here with their massive fortunes. The local transportation industry had long since gone kaput; the entire city subsisted on the cake crumbs they showered down.\nSong Mike had plenty of flaws, but he was a good cop. I could imagine him latching his teeth into his opponent and refusing to let go. I was forced to laugh painedly. That demotion all those years ago now had a logical explanation. And his reason for telling me to extricate myself from the business had also become apparent.\n“After Lu Guotao fled, I thought the business was finished. I couldn’t do anything even if I wanted to,” Song Mike said. “But now it looks like he and his wife Liu Yan remained in close contact. It’s very likely that he continued to control business affairs in Quanzhou through her.”\n“Through Liu Yan’s android,” I corrected him. “According to the Jiali Craftsman, Liu Yan was involved in the creation of her android replica from start to finish, and she seemed seriously ill already. Do you think—the real Liu Yan’s still alive?”\n“I’ll bet five bucks she’s already dead.” Song Mike said, “Any sickness they can’t cure with all that money has to be something really hopeless.”\n“Agreed. I think she’s dead too.” I slowly organized my thoughts as I spoke. “Lu Guotao was secretly researching cybertronic brains this whole time. After he fell afoul of the law and fled the country, he continued to run his business through Liu Yan. Several years later, Liu Yan developed a terminal illness. As her death approached, they decided to make a Liu Yan android who could pass for the original in order to maintain their operations.”\nAfter more consideration, I added, “They gave the android an android pet of its own. It’s a heck of an arrangement.”\nSong Mike eyed me. “Maybe they didn’t want the fake Liu Yan to come into contact with too many outsiders. The risk of discovery adds up over a long period of time. To have a lonely rich lady’s android boy toy show his face as her representative is much more reasonable. A safe chain of puppets.”\nI looked down, picking at the scraps of lettuce on the plate. “So, you knew from the start that Liu Yan is Lu Guotao’s ex-wife, and that Lu Guotao has dirt up his ass crack. Then why did you accept this side gig—unless you were hoping to follow the lead all the way up to Lu Guotao, arrest him, and conclude the case.”\nHe didn’t say anything.\nI continued, “I have an even bigger question. Why would Liu Yan’s android—in other words, Lu Guotao, who’s behind everything—ask you to find the missing 3908? He has the money to just commission a new android from the Jiali Craftsman. We can forget that sentimental bullshit about the android being a companion and family member. Lu Guotao is a cold-blooded businessman; he’d equip 3908’s brain with some mechanism that would let him remotely wipe its data in case of emergency. And he definitely knows that you’re the cop who insisted on pursuing that case all those years ago. He should be avoiding you like the plague.”\nSong Mike continued to refuse to meet my gaze.\nI could hear my voice rising the whole time, unable to control my anger. “Buddy, this is a fucking trap. Don’t tell me you can’t tell.”\n“I’m not trying to be some kind of goddamn hero,” he said at last. His voice was raspy. His stubby fingers gathered the short greasy hair from his forehead and pushed it back.\nI raised a brow.\nHe lifted his gaze, which crossed my shoulder and fell on empty distance. “Lu Guotao knows that 3908 may have gone rogue. It’s more than he can handle himself. He’s afraid of a repeat of the incident at the warehouse, with more than hoodlums for victims. I’m one of the few people who know just how bad things can get.”\nHe used the last of his drink to water the decorative plant by the table. Song Mike said, “He doesn’t want to retrieve that boy toy android. He’s just letting me know, it would be great if I could help clean up a big-ass mess.”\n05.\nLeaving the bar that early morning, before parting ways with Song Mike, I half-bullied him into an agreement: he wasn’t going to chase after that potentially already berserk human-passing android on his own.\nHe agreed with a laugh, suspiciously quickly.\nBut as I watched that battered Volkswagen drive away in fitful zigzags, I understood there was nothing I could do. I knew almost nothing of the details of the warehouse case he’d investigated. What he’d described tonight was only the tip of the iceberg for sure. In Song Mike’s eyes, I would always be that little intern girl. He wanted to keep me out of this dangerous business out of some stupid straight man sense of pride.\nLu Guotao.\nI said the name to myself silently as I returned to my cramped apartment. It was already two in the morning. I lay on the bed for half an hour, my eyes closed in vain. All I could think about was the scattered body parts in the workshop.\nIrritably, I rose, grabbed my laptop, and sat with crossed legs. Song Mike had told me that Lu Guotao had been forced to depart for other lands for some other business that he couldn’t cover up. His wording had been suspiciously vague. Since I already knew Lu Guotao’s name and the timing of the case, it might not be too hard to find some leads.\nI brought up my phone log and found the numbers of several Central Office high-tech crime investigators I’d met in police school. While I waited for someone to pick up, I logged into the department’s internal news network and began to slowly sift through the information.\n06.\n“Old Song?” I banged hard on the door.\nI waited for half a minute, but there was no response.\nI went straight to verifying my identity on the retina scanner and entered Song Mike’s office. A long time ago, I’d been his assistant; he never removed my access permissions after my transfer.\nThe interior smelled of cigarettes. I turned on the ventilation fan and went around the room, making an inspection. The old dossier on the warehouse case lay on the table, flipped through so many times that the edges were curling up. The desktop computer was still powered on. I gave the mouse a shake. A password pop-up appeared on the screen.\nNever mind.\nHis jacket and car keys were missing.\nI swore. The bastard had purposefully ditched me. This morning, I’d sent him the information I’d put together and left him a voicemail, telling him to wait for me to arrive at the office. Lu Guotao wasn’t just some mad scientist who’d played with fire and caused the one-off tragedy. If he’d lived last century, before the death penalty was abolished, the crimes he’d committed in the course of his private research into human-passing cybertronic brains would have earned him a hanging.\nEven though Song Mike had been tracing Lu Guotao’s tracks for years, I still wasn’t sure if he knew just how terrifying his opponent was. Song Mike was an old-school cop. He wasn’t much good at digging up and collating online resources. And after the higher-ups shut down the warehouse case, he couldn’t have gotten the help of the station’s technicians.\nI’d rushed into the station and still been too late.\nI could picture how he’d look explaining, I can’t take a woman to capture a berserk killer robot. Heavens, it had been years since he left the front line, and I hadn’t seen him partake in any physical training. Chances were he couldn’t even outfight a street hoodlum anymore.\nI pulled out my phone and called the station’s car modification aficionado. “Section Chief Zhang, let me borrow your car.”\nThe other party agreed readily.\nAs I drove into the hills, I rejoiced in my decision to borrow a car. The smooth highway had quickly become pitted cobblestone. The city no longer had the money to maintain these distant stretches of the public road network.\nSong Mike didn’t pick up any of the calls I made en route. For my part, I tried diligently not to think about the crime scene photos in the dossier for the warehouse case.\nFortunately, I soon spotted his battered Volkswagen parked crookedly on the frontage road.\nI stopped the car and felt for my gun. When shooting an android, aim for the stomach, that’s where the power source is—silently repeating my freshly gained knowledge once more, I kicked open the car door.\n“Old Song!” I yelled.\nMy surroundings were dead quiet. Pebbly beach stretched from either side of the highway, from which rose massive boulders. Some kind of invasive species with yellow flowers grew everywhere amid the cracks in the stone.\n“I’m here,” he answered, a hint of resignation showing in his voice. “Didn’t I tell you not to come?”\nExhaling in relief, I followed the voice past several boulders and saw Song Mike.\nHe was crouched beside a man’s corpse. No, it was a destroyed android.\n3908 was still dressed in the expensive tailored suit he’d worn the day he disappeared. The shirt was pulled open; the power module in the abdomen was gone. The once-exquisite face was in ruins, as if someone had wildly hacked at it with a knife. The Jiali Craftsman’s heart would ache at the sight, I thought.\n“Is the damage to the face to prevent somebody from recognizing it?” I crouched down next to him. “There isn’t much point to that, is there? He’s probably the only high-end hyperrealistic male android in the entire Port District.”\n“It wasn’t me,” said Song Mike. “It was already like that when I found it. I feel like the vandal desecrated his face more out of jealousy.”\n“Who would be jealous of—” I fell silent, then shook my head. “My god.”\nSong Mike stood. “I suppose you came at just the right time. Help me dig a pit and bury it. If someone sees it, takes it for a human corpse, and reports it to the police, it’ll be more trouble.”\n“So you forget that I’m a woman when you need physical work done?”\nTogether, we cleared out a shallow pit in the pebbles and shifted 3908’s corpse into it. The android’s cybertronic brain had been removed too, leaving only an empty skull cavity. As I picked up rocks and set them over it, I heard the faint squeaks of metal rubbing against plastic.\nFinally, I found a distinctively patterned squarish rock and set it at the head of the grave. Then I took a few steps back and took a picture with my phone.\nSong Mike eyed me. “Wanting to give Liu Yan closure? You know we can’t—”\n“Don’t be such a bastard.” I sighed, “I know.”\n07.\nWe were silent the entire drive back.\nSong Mike came with me to return the car key. He made a circuit of the station; maybe he saw that my expression had relented, because he finally dared to say, “Let’s talk on the rooftop?”\nThe rooftop deck was deserted. An autumn rain was falling, drumming against the awning. Water drew trails down the walls.\n“How did you find 3908?” I cradled a cup of hot chocolate, letting the steam warm my stiff face.\n“Lu Guotao wanted us to find the body. He put the location tracker back in.” Song Mike’s voice was raspy. He didn’t buy a drink; he went straight to lighting up a cigarette. “Yesterday, I got the signal frequency from the Jiali Craftsman. Lu Guotao basically handed me 3908’s location on a platter.”\nHe paused. “And how did you follow me?”\nI hesitated but told him the truth. “I tracked your phone.”\n“Motherfucker,” he laughed. He didn’t sound like he minded.\n“I’m really worried about you.”\nHe awkwardly scratched his head. After a long silence, he forced out a mutter of apology.\nI shook my head. “Last night, I got into the traffic monitoring database and found the footage of 3908’s disappearance. Lu Guotao took 3908 himself. I was terrified, convinced that Lu Guotao was setting a trap to silence you. He’d do it. He’s that kind of person.”\n“I know.” Song Mike ground out his cigarette stub under his foot. “I made a faulty assumption too. I only realized when I saw 3908’s corpse. Lu Guotao’s using me not to clean up that robot boy toy, but his robot wife.”\n“Why can’t he do it himself?” I raised an eyebrow.\n“Heaven knows. Maybe he can’t bear to. After all, the damned things look too much like real people.” Song Mike shrugged. “Tonight, I’ve arranged to see Lu Guotao in person, right at Chez Liu. We’ll see this business to the end. You bring your gun too.”\n“And he has the guts to come?”\n“I told him, if he can’t bend his dignity enough to talk things out in the open, I’m not going to take on this business.” Song Mike shook his empty pack of cigarettes as he spoke, then tossed it irritably into the rain. “When his fake wife goes insane in the middle of all those villas and mauls one of those leading citizens, he can try cleaning up the mess himself.”\nI took a sip of hot beverage and closed my eyes. The comfort brought by sugar content was better than nothing.\n“Say, do 3908 and Liu Yan realize they’re androids?”\n“Does it make a difference?”\n“I don’t know.”\n“You can’t hesitate.” Song Mike turned to me, his voice hard. “There’s no room for discussion in this business.”\nI sighed and promised him, “Of course, tonight we’ll take care of all the dangerous androids. They’re all massive threats to public safety. I’ve seen the dossier on the warehouse case. I know.”\nHe watched me. “They only look like humans. Don’t you get sentimental.”\nI sighed.\n08.\nSong Mike remained the driver for our second time going to Chez Liu. I leaned back in the backseat, caressing the handgun in the inner pocket of my jacket. I felt that cold metallic weight right in the pit of my stomach.\nI’d brought bad news to plenty of people before. The unspoken rule of the police station: maybe sending a kindly looking woman to bring ill tidings would ease the blow. So I’ve knocked open door after door, telling mothers their children have died in car crashes, telling wives their husbands have gone to prison.\nIn the present situation, I only needed to tell one robot that its robot buddy wasn’t coming back. I didn’t know why I felt so sad.\nTheir emotions were nothing more than a chunk of computer program. And any grief wouldn’t get to last very long.\nI closed my eyes, thinking of Liu Yan again, that elegant, fragile middle-aged woman, that moment of loneliness and self-mockery in her expression. It was all fake, all programming. Sooner or later she’d devolve into a killer machine. She had to be eliminated. Privately, I hoped that Song Mike could do the dirty work, leaving me only the duty of helping him take care of the “fake Liu Yan”’s remains, the way we’d buried 3908.\nBut instinct told me that Song Mike might not be able to do it. He was an old-fashioned man. To have him shoot an innocent woman in cold blood might be asking too much of him. But someone had to do it.\nOnce again, I checked the number of bullets in my gun.\nIn the rainy night, Liu Yan’s villa looked like a glistening, exquisite toy model, luminously white.\nWe parked on the little slope behind the house. Song Mike looked several times at his watch. Finally, there came the quiet rumble of an engine in the distance. It was a familiar black Audi. We’d both seen it in the surveillance footage.\n“You stay in the car,” Song Mike said.\nThat was what we’d planned previously. I nodded.\nHe got out of the car. Lu Guotao climbed out of the Audi too. Compared to the photos of him from before his disappearance, he’d gained weight. His long, angular face had become round and kindly. The hair at his temples had become completely white.\n“Sergeant Song,” Lu Guotao said.\n“I don’t want to shake hands with you,” Song Mike said, coming to a stop several paces away from him.\nTheir voices came through from the miniature microphone on Song Mike with a rustle of static.\n“I understand. I’ve created many difficulties for you.” Lu Guotao let his hand fall, nodding. “Today, I have to ask something of you yet again.”\n“How do I know that after I wipe your ass this time, there won’t be another time? There might be no end.” Song Mike said, “Are the police for you to play games with?”\n“There won’t be another time,” Lu Guotao said, sliding his hand into his pocket.\nMy breath hitched, but the businessman only took out a pack of cigarettes. “Liu Yan and 3908 are special. I have no plans of continuing research on cybertronic brains on your turf. That business at the warehouse proved—sufficiently instructive.”\n“Explain,” said Song Mike.\n“The problem of high-complexity cybertronic brain and chassis coordination has never been solved. They lose control. My team and I have tried many ways to stabilize the psyche, with only short-term effectiveness.” On this subject, Lu Guotao spoke with a new liveliness, like all people talking about their beloved calling. “If the cybertronic brain is supplied with large quantities of a living person’s memories as a basis to operate upon, it’s capable of functioning normally for between three and five years, at least in the simulations. It’s a pity that there’s no way of extracting a living person’s memories nondestructively with current technology. We spent money to find a considerable number of terminally ill patients to serve as volunteers. They were happy to leave their families a bountiful inheritance.”\nI felt disgusted.\nLu Guotao made it sound so nice, but in truth, his test subjects went far beyond “volunteer” terminally ill patients. The scandals that had erupted from several extraterrestrial orphanages were the real reason he fled as a fugitive years ago. Seeing the postmortem photos of those children in the dossier, I’d understood that there was no humanity in him.\n“What a philanthropist. I’ll say thanks on behalf of those patients. And then you discovered that your own wife didn’t have long to live?” Song Mike interrupted.\n“Yes.” Lu Guotao admitted, unperturbed.\n“What did she catch?”\n“A type of sequelae from space radiation. In the early years, while we were speculating on asteroid plots, she was the one who’d go out and inspect the land in person.” Lu Guotao laughed painedly. “Who knew that karma would be waiting for us twenty years later. She knew that she didn’t have much time left, so she brought up using her memories to make an android replica who could appear in person to continue running our business. Initially, I didn’t agree. It was like—”\nHis expression twisted. He made a gesture. “Facing my wife’s resurrected corpse.”\n“I’m sorry for your pain.” Song Mike’s tone was flat. Even a wall could hear the sarcasm in his voice.\nLu Guotao, too, may have realized that the one standing across from him was not a suitable audience for his angst. He gave a cough. “But we had no other choice. I was on the lists as a wanted criminal. The risk of hiring someone else as a proxy was too great. We found the Jiali Craftsman together and commissioned her body double and a male assistant.”\n“The assistant was made using a live person’s memories? Where did they come from?” Song Mike asked.\nLu Guotao lowered his head. The faint light from his cigarette illuminated his face. He looked much older than his true age.\n“3908 is my replica.”\n“You just said, there’s no way of—” Song Mike’s brow furrowed.\n“I accepted the risk of brain damage. After the surgery, I experienced frequent episodes of epilepsy, short-term memory loss, and difficulties with emotional regulation.” Lu Guotao laughed. “But I had no other choice. If I used anyone else’s memories, the replica wouldn’t dedicate himself wholeheartedly to my interests.”\nSong Mike was for a moment struck silent. I, too, was stunned in the car. 3908’s corpse lying on the rocky beach. And that ruined face. Song Mike had said that kind of malevolence came from jealousy.\nLu Guotao had killed another version of himself?\n“When the android version of Liu Yan first powered on, the relationship between us was very awkward. She didn’t in fact know she was an android. We periodically revised her memories, wiping out all the continuity errors, helping her maintain a stable worldview.” Lu Guotao leaned against the car door, his words light yet urgent. “Intellectually, she knew she was my wife, but it was clear she no longer loved me. I could see it in her eyes. In the process of converting a living person to a machine, something had been lost. At first I thought that a cybertronic brain was simply incapable of emotion. Our goal was nothing more than to keep our business running. The woman who’d lived a lifetime with me was already dead.”\nHe laughed shrilly. The sound covered me in chills. “But she was too fucking similar to Ah-Yan. Every time I saw her, it felt like she’d never died. I wasn’t so insane that I wanted to sleep with a pile of metal and plastic—we maintained a business relationship. All the way until about a year ago, when my team and I inspected Liu Yan and 3908’s memories and discovered they’d fucking fallen in love.”\n“Oh,” said Song Mike.\n“I’m not so far gone that I’d be jealous of the robot version of me. Don’t look at me like that, I’m no cuckold. My wife’s been dead for years. Besides, it’s only natural that a robot version of me and a robot version of Liu Yan would fall for each other a second time.”\nLu Guotao shrugged and pinched out his cigarette. “But this introduced difficulties to our work. They couldn’t have a romantic relationship. The Jiali Craftsman didn’t include the capacity for lovemaking on the chassis he made. Who could have thought of a situation this crazy? Every time they tried to sleep together, they’d discover that their bodies didn’t match up with normal people’s. We were forced to regularly clear out entire chunks of their memories, to keep up their illusions of being real people.”\n“It was too inconvenient, so you decided to get rid of 3908.”\n“Inconvenient? I wrecked myself to create him.” Lu Guotao’s voice rose. “Cybertronic brains can’t take this kind of repeated manipulation. Their systems were only meant to remain stable for three to five years originally; with this whole business added in the mix, they’ve both reached the brink of obsolescence. It’s time for those two to retire. I got rid of 3908 myself.”\nHis voice shook. He couldn’t continue.\n“But you couldn’t bear to kill Liu Yan,” Song Mike continued for him. “So you thought of me.”\n“One last time. Whatever you want, I can give you. Money. A promotion. My connections in the Port District can still accomplish a thing or two.” Lu Guotao said softly, “I won’t make a new Liu Yan. She ought to rest in peace. After resolving this business, I’ll leave Earth. You’ll never see me again.”\nSong Mike hmphed softly.\nTheir silhouettes were like two barren tree trunks in the night rain.\n“You go to the villa to take care of Liu Yan. Leave things here to me,” Song Mike said to me through the communicator.\nI assented, hopped out of the car, and went walking toward Chez Liu beneath the hill.\nWhen I’d walked about a hundred meters, I heard the sound of a gunshot from behind me.\n09.\nSeeing her for the second time, I couldn’t help myself—I closely observed her eyes, her hair, and her chest, which faintly rose and fell as she breathed.\nThe Jiali Craftsman was truly preternaturally skilled.\nLiu Yan noticed my gaze. She laughed and shifted aside to let me in. “You know now.”\nShe knew that she was an android.\n“Our conversation likely won’t take long, so I won’t invite you to sit,” she said. Today she wore a light beige hemp shirt and leisure pants. Her hair was plaited behind her head in a Greek-style updo. She’d put on light makeup.\nWe stood on the carpet of the living room, looking at each other wordlessly.\n“Old Lu took care of 3908?” Liu Yan asked, looking down.\n“Yes,” I admitted.\nHow much did she know? Would she resist at the brink? I remembered the crime scene photos from the warehouse incident. Cold sweat trickled down my back.\n“He didn’t suffer, did he?” Liu Yan said in a small voice.\nYour husband gouged his face off, I thought. I dug out my phone and brought up the picture of 3908’s resting place. “No, he only removed the battery. We gave him a burial. No one will disturb him.”\n“Old Lu would have also destroyed his cybertronic brain. It’s the only way to be safe.” She fixed her gaze on that deserted rocky beach for a long time. Then she hesitated, before saying, “In a moment, I hope you’ll take care of me in the same way.”\nFor a moment, I didn’t know what to say.\n“I have many of Liu Yan’s memories. I know that androids like us must be eliminated at a certain date, or we go mad.” As she spoke, the faint lines around her eyes drew together from her smile. “Finding you two was a plan Old Lu and I came up with together. Old Lu couldn’t bear to kill me. He would put it off, day after day, until the point of no return.”\nSo she’d taken care to pretty herself up today. She’d known that her death was approaching and wanted to end things looking presentable.\n“Where do you want to . . . ” I said.\n“How about the garden? Liu Yan loved taking care of the garden best when she was alive. It makes things easier for you, too. I’ve already had someone dig the pit.” Her lashes fluttered. “I weigh one hundred thirty kilos now, as a woman of steel.”\n10.\n“You’re done?” Song Mike asked.\n“You dumbass.” I shook my head.\nLu Guotao’s corpse lay on the hill. Half his head had been blown off. Song Mike hadn’t used a gun from the station. Thank heaven and earth, he could still keep the finer points in mind.\n“If you want to turn me in when we get back to the station, I won’t blame you,” he said. He tried to light a smoke in the rain, probably thinking he looked like some kind of cool loner hero.\nSadly his lighter wasn’t the quality of Lu Guotao’s. He tried several times without success.\n“Shut up.” I grabbed the legs of the deceased. “Come over and help me carry him.”\nSong Mike was taken aback for a moment, then hurried over. Together, we packed Lu Guotao’s corpse into the back trunk of the Audi and drove it to Chez Liu. Earlier, I’d already found the controls for the security system inside the villa and turned off the alarms.\nWhen it came to arranging the scene of an accident, no one was more professional than the police.\nLu Guotao had sought to destroy the robot wife he’d created, only to be killed by the rampaging android. A perfect story. To create a suitable effect, we shot a few more times at Lu Guotao and Liu Yan’s corpses. I felt sorry for Liu Yan, that she wouldn’t be able to rest in peace under the swaying roses in the garden sepulcher she’d arranged for herself.\nBut it was the best we could do.\nWe spent the return trip covered in blood and too exhausted to move a finger. Fortunately Song Mike’s battered Audi had an autopilot system; otherwise, with our shaking hands, we probably would’ve crashed to our deaths against the highway railing.\nSeveral times, Song Mike tilted his head to look at me, wanting to say something but stopping himself.\nTonight, I didn’t have the energy for more guessing games. Song Mike’s fixation on the warehouse case over so many years had stemmed from more than a sense of justice; he had to have personal reasons. It didn’t take a genius cop to guess that.\n“The thirteen people who died in that warehouse. They included your friends,” I said.\n“My brothers,” he admitted, “And three boys I knew as a kid. I grew up in Shijing. I changed my identity so I could pass the civil exams and become a police officer. No one else knows.”\nI nodded. I’d guessed all of it. “That Lu guy got what he deserved. His body count has hit three digits in the course of his fucked-up research. If we didn’t stop him, he’d just keep going. We were right to off him.”\nSong Mike said nothing.\nWhether he’d decided to shoot Lu Guotao after seeing the dossier on the orphanage disappearances, or planned it from the start, I didn’t want to ponder further. I was certain of only one thing: the world was safer with Lu Guotao six feet under. We were the police. It was our duty.\n“You’re right. He deserved to eat a bullet.” At last, Song Mike covered his face and chuckled roughly. “I owe you big time.”\nEpilogue.\nOutside the car window, the rain continued to fall, raindrops tracing twisted tear tracks on the glass.\nI supposed that was another extraordinary thing. In life, Liu Yan and Lu Guotao were a pair of selfish bastards who’d endangered other people’s lives without a care. But reincarnated into machines, they’d become a pair of endearing lovers who’d tried to prevent harm to innocents and went willingly toward their deaths.\nI touched the contents of my pocket: a little strand of black artificial hair and a ring.\nOnce things settled, I was going to visit that rocky shore one last time. The robot version of Liu Yan had hoped that a part of her could be buried with 3908.\nOnce I completed this task, I should finally be able to forget her eyes.\nOriginally published in Chinese in Galaxy’s Edge #007, November 2020.\nTranslated and published in partnership with Storycom.\nBorn in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest.", "source": "https://clarkesworldmagazine.com/chen_06_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Inhuman Lovers by Chen Qian, translated by Carmen Yiling Yan"}