{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cat Rambo", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "K8CxkuFci28lShMpHDDeGXInnNw=", "id": null, "license": null, "comments": "", "raw_text": "5720 words, short story  I'll Gnaw Your Bones, the Manticore Said  Even Duga the Prestidigitator, who never pays much attention to anything outside his own hands, raised an eyebrow when I announced I’d be hooking the manticore up to my wagon.  “Isn’t that dangerous?” my husband Rik said. He steepled his fingers, regarding me.  “The more we have pulling, the faster we get there,” I pointed out. “And Bupus has been getting fat and lazy as a tabby cat. No one pays to see a fat manticore.”  “More dangerous than any tabby cat,” Rik said.  I knew what he meant, but I kept a lightning rod at hand in the wagon seat in case of trouble. Bupus knew I’d scorch his greasy whiskers if he crossed me.  There is a tacit understanding between a beast trainer and her charges, whether it be great cats, cunning dragons, or apes and other man-like creatures. They know, and the trainer knows, that as long as certain lines aren’t crossed, that if certain expectations are met, everything will be fine and no one will get hurt.  That’s not to say I didn’t keep an eye on Bupus, watching for a twitch to his tail, the way one bulbous eye would go askew when anger was brewing. A beast’s a beast, after all, and not responsible for what they do when circumstances push them too far. Beasts still, no matter how they speak or smile or woo.  At any rate, Bupus felt obliged to maintain his reputation whenever another wagon or traveler was in earshot.  “Gnaw your bones,” he rumbled, rolling a vast oversized eyeball back at me. The woman he was trying to impress shrieked and dropped her chickens, which vanished in a white flutter among the blackberry vines and ferns that began where the road’s ground stone gave way to forest. A blue-headed jay screamed in alarm from a pine.  “Behave yourself,” I said.  He rumbled again, but nothing coherent, just a low, animal sound.  We were coming up on Piperville, which sits on a trade hub. Steel figured we’d pitch there for a week, get a little silver sparkling in our coffers, eat well for a few nights.  It had been a lean winter and times were hard all over—traveling up from Ponce’s Spring, we’d found slim pickings and audiences too worried about the dust storms to pay any attention to even our best: Laxmi the elephant dancing in pink spangles to “Waltzing Genevieve,” the pyramid of crocodiles that we froze and unfroze each performance via a lens-and-clockwork basilisk, the Unicorn Maiden, and, of course, my manticore.  Rik was driving a wagon full of machinery, packed and protected from the dust with layers of waxed canvas. He pulled up near me, so we were riding in tandem for a bit. No one was coming the opposite way for now. We’d hit some road traffic coming out of Ponce’s, but now it was only occasional, a twice an hour thing at most.  “You know what I’m looking forward to?” I called over to him.  He considered. I watched him thinking in the sunlight, my broad-shouldered and beautiful husband and just the look of him, his long scholar’s nose and silky beard, made me smile.  “Beer,” he said finally. “And clean sheets. Cleeaaaan sheets.” He drawled out the last words, smiling over at me.  “A bath,” I said.  A heartfelt groan so deep it might have come from the bottom of his soul came from him. “Oh, a bath. With towels. Thick towels.”  I was equally enraptured by the thought, so much so that I didn’t notice the wheel working loose. And Bupus, concerned with looking for people to impress, didn’t warn me. With a sideways lurch, the wagon tilted, and the wheel kept going, rolling down the roadway, neat as you please, until it passed Laxmi and she put out her trunk and snagged it.  I put on my shoes and hopped down to examine the damage. Steel heard the commotion and came back from the front of the train. He rode Beulah, the big white horse that accompanies him in the ring each time. Sometimes we laugh about how attached he is to that horse, but never where he can hear us.  The carts and caravans kept passing us. A few waved and Rik waved back. The august clowns were practicing their routine, somersaulting into the dust behind their wagon, then running to catch up with it again. Duga was practicing card tricks while his assistant drove, dividing her attention between the reins and watching him. Duga was notoriously close-mouthed about his methods; I suspected watching might be her only way to learn.  “Whaddya need?” Steel growled as he reached me.  “Looks like a linchpin fell out. Could have been a while back. Sparky’ll have a new one, I’m sure.”  His blue gaze slid skyward, sideways, anywhere to avoid meeting my eyes. “Sparky’s gone.”  It is an unfortunate fact that circuses are usually made of Family and outsiders—jossers, they call us. Steel treated Family well but was unwilling to extend that courtesy outside the circle. I’d married in, and he was forced to acknowledge me, but Sparky had been a full outsider, and Steel had made his life a misery, maintaining our cranky and antiquidated machines: the fortune teller, the tent-lifter, and Steel’s pride and joy, the spinning cups, packed now on the largest wagon and pulled by Laxmi and three oxen.  The position of circus smith had been vacant of Family for a while now, ever since Big Joy fell in love with a fire-eater and left us for the Whistling Piskie—a small, one-ring outfit that worked the coast.  So we’d lost Sparky because Steel had scrimped and shorted his wages, not to mention refusing to pay prentice fees when he wanted to take one on. More importantly, we’d lost his little traveling cart, full of tools and scrap and spare linchpins.  “So what am I going to do?” I snapped. Bupus had sat down on the road and was eying the passing caravans, more out of curiosity than hunger or desire to menace. “I’ll gnaw your bones,” he said almost conversationally, but it frightened no one in earshot. He sighed and settled his head between his paws, a green snot dribble bubbling from one kitten-sized nostril.  The Unicorn Girl pulled up her caravan. She’d been trying to repaint it the night before and there were bleary splotches of green and lavender paint smearing its sides.  “What’s going on?’ she said loudly. “Driving badly again, Tara?”  The Unicorn Girl was one of those souls with no volume control. Sitting next to her in taverns or while driving was painful. She’d bray the same stories over and over again, and was tactless and unkind. I tried to avoid her when I could.  But, oh, she pulled them in. That long, narrow, angelic face, the pearly horn emerging from her forehead, and two lush lips, peach-ripe, set like emerging sins beneath the springs of her innocent doe-like eyes.  Even now, she looked like an angel, but I knew she was just looking for gossip, something she might be able to use to buy favor or twist like a knife when necessary.  Steel looked back and forth. “Broken wagon, Lily,” he said. “You can move along.”  She dimpled, pursing her lips at him but took up her reins. The two white mares pulling her wagon were daughters of the one he rode, twins with a bad case of the wobbles but which should be good for years more, if you ignored the faint, constant trembling of their front legs. Most people didn’t notice it.  “She needs to learn to mind her tongue,” I said.  “Rik needs to come in with us,” Steel said, ignoring my comment. “He’s the smartest, he knows how to bargain. These little towns have their own customs and laws and it’s too easy to set a foot awry and land ourselves in trouble.”  Much as I hated to admit, Steel was right. Rik is the smartest of the lot, and he knows trade law like the back of his hand.  “I’ll find someone to leave with you, and Rik will ride back with the pin, soon as he can,” Steel said.  “All right,” I said. Then, as he started to wheel Beulah around. “Someone I won’t mind, Steel. Got me?”  “Got it,” he said, and rode away.  “I don’t like leaving you,” Rik said guiltily. It was a year old story, and its once upon a time had begun on our honeymoon night, with him riding out to help with the funeral of his grandfather, who had been driven into a fatal apoplectic fit by news of his marriage to someone who’d never known circus life.  “Can’t be helped,” I said crisply. He sighed.  “Tara . . . ”  “Can’t be helped.” I flapped an arm at him. “Go on, get along, faster you are to town, faster you’re back to me.”  He got out of his wagon long enough to kiss me and ruffle my hair.  “Not long,” he said. “I won’t be long.”  “We’ll leave Preddi with you,” Steel said, a quarter hour after I’d watched Rik’s caravan recede into the distance. It had taken a while for the rest of the circus to pass me, wagon after wagon. Even for such a small outfit, we had a lot of wagons.  Preddi was Rik’s father, a small, stooped man given to carelessness with his dress. He was a kindly man, I think, but difficult to get to know because his deafness distanced him.  We pulled the wagon over to the side of the road, in a margined sward thick with yellow loosestrife and dandelions. A narrow deer path led through blackberry tangles and further into the pines, a stream coming through the thick pine needles and chuckling along the rocks. I tied Bupus to the wagon, and brought out a sack of hams and loaves of bread before making several trips in to bring him buckets of water.  Preddi settled himself on the grass and extracted a deck of greasy cards from the front pocket of his flannel shirt. While I worked, he laid out hand after hand, playing poker with himself, studying it.  The day wore on.  And on. I cleaned the wagon tack, and repacked the bundles in it, mainly my training gear. Someone else would be tending my cage of beasts when they pitched camp, and truth be told, anyone could, but I still preferred to be the one who fed the crocodiles, for example, and watched for mouth rot or the white lesions that signal pox virus and cleaned their cage thoroughly enough to make sure no infection could creep in under their scales or into the tender areas around their vents.  Bupus gorged himself and then slept, but roused enough to want to play. I threw the heavy leather ball and each time his tail whipped out with frightening speed and batted it aside. Fat and lazy, he may be, but Bupus has many years left in him. They go four or five decades, and I’d raised him from the shell ten years earlier, before I’d even bought the flimsy paper ticket that led me to meet Rik.  I hadn’t known what I had at first. A sailor swapped me the egg in return for me covering his bar tab, and who knows who got the best of that bargain? I was a beast trainer for the Duke, and mainly I worked with little animals, trained squirrels and ferrets and marmosets. They juggled and danced, shot tiny plaster pistols, and engaged in duels as exquisite as any courtier’s.  The egg was bigger than my doubled fists laid knuckle and palm to knuckle and palm. It was coarse to the touch, as though threads or hairy roots had been laid over the shell and grown into it, and it was a deep yellow, the same yellow that Bupus’s eyes would open into, honey depths around clover-petaled pupils.  I kept it warm, near the hearth, but could not figure out what it might contain. Months later it hatched—lucky that I was there that day to feed the mewling, squawling hatchling chopped meat and warm milk. I wrapped the sting in padding and leather. Even then it struck out with surprising speed and strength. A manticore is a vulnerable creature, lacking human hands to defend the softness of its face, and the sting compensates for that vulnerability.  He talked a moon, perhaps a moon and a half later. I took him with me at first, when I was training the Duke’s creatures, but a marmoset decided to investigate, and I learned then that a manticore’s bite is a death grip, particularly with a marmoset’s delicate bones between its teeth.  Some beast trainers dull their more intelligent beasts. It’s an easy enough procedure, if you can drug or spell them unconscious. The knife is thin, more like a flattened awl than a blade, and you insert it at the corner of the eye, going behind the eyeball itself. Once you’ve pushed it in to the right depth, perforating the plate of the skull lying behind the eye, you swing back and forth holding it between thumb and forefinger, two cutting arcs. It bruises the eye, leaves it black and tender in the socket for days afterward, but it heals in time.  It doesn’t kill their intelligence entirely, but they become simpler. More docile, easier to manage. They don’t scheme or plot escape, and they’re less likely to lash out. Done right, even a dragon can be made clement. And those beasts prone to over-talkativeness—dryads and mermaids, for the most part—can be rendered speechless or close to it.  I’ve never done that, though my father taught me the technique. I like my talking beasts, most of the time, and on occasion, I’ve had conversation with sphinx or lamia that were as close to talking with a person as could be.  After the marmoset incident, I left Bupus at home, the establishment the Duke allowed me, a fine place with stable and mews and even a heat-room, which the Ducal coal stores kept supplied all winter long and into the chilly Tabatian springs. I kept him in a stall that had been reinforced, and there were other animals to keep him company.  I’d gone to the circus to see their creatures. They had the crocodiles, which were nothing out of the ordinary, and the elephant, which was also unremarkable, since the Duchess kept two pygmy elephants in her menagerie. And an aging hippogriff, a splendid creature even though its primaries had gone gray with age long ago. I was surprised to see his beak overgrown, as though no one had coped it in months.  “Look here,” I said to the man standing to watch the cages and make sure no one poked a finger through and lost it. “Your hippogriff is badly tended. See how he rubs his beak along the ground, how he feaks? Your tender is careless, sir.”  I was full of youth and indignation, but I softened when he perked up and said, “Can you tend them? We lost our fellow. How much would you charge?”  “No charge,” I said. “If you let me look over the hippogriff as thoroughly as I’d like to. I haven’t ever had the chance to get my hands on a live one.”  “Can you come back later, when we close up?” He looked apologetic. He was a pretty man, and his uniform made him even prettier.  “I can.” It’d mean a late night, but there was nothing going on that next morning—I could sleep in, and go to check the marmosets in the afternoon, or let the regular assistant do it, even, if I was feeling lazy.  So I came back late that night and pushed my way through the crowds eddying out, like a duck swimming against the current. He was waiting for me near the cages. I’d brought my bag of tools, and so we went from cage to cage.  He settled the hippogriff when it bated at the sight of me, flapping its wings and rearing upward. It was easily calmed, and he ran his fingers through the silky feathers around its eyes, rubbing softly over the scaly cere, until its eyes half-lidded and it chirped with pleasure, nuzzling its head along his side.  I trimmed its beak and claws and checked it over before moving on to the other animals. It took me three hours, and even so, much of that was simply telling Rik what would need to be done later on—to stop giving the crocodiles sardines, for example, before they got sick from the oiliness.  I refused pay, and he insisted that he should buy me a cup of wine, at least. How inevitable was it that I would take this beautiful man home with me?  In the morning, I showed my household to my lover. The dueling marmosets, the brace of piskies, the cockatrice kept by itself, lest it strike out in its bad temper. And Bupus, sprawled out across the courtyard. Rik was enchanted.  “A manticore!” he said. “I’ve never seen a tamed one. Or a wild one, for that matter. They come from the deserts in the land to the south, you know.”  A year later, diffidently, while the caravan was spending a month in Tabat, he mentioned to me that the hippogriff had finally succumbed to old age and the caravan would like to buy Bupus.  I refused to sell, but when I married him, the manticore came with me.  When the sun touched down on the horizon and lingered there, like a marble being rolled back and forth beneath one’s palm, we realized that there was some delay. If not tonight, though, they’d come tomorrow. Preddi and I discussed it all with shrugs and miming, agreeing to build a fire before the last of the sunlight vanished.  The woods that run beside the road there are dark and dangerous, which is why travelers stick to the road. As night had approached, there were no more passersby—everyone had found shelter where they could. Preddi and I would spread bedrolls beside the fire and keep watch in turns, but I wasn’t worried much. The smell of a manticore keeps off most predators.  But as I picked through the limbs that lay like sutures across the ground’s interwoven needles, a crackling through the dry leaves at the clearing’s edge alerted me. Preddi was near the road, gathering more wood.  As I watched I saw stealthy movement. First one, then more, as though the shadows themselves were crawling towards me. As they emerged, crawling out from the crevices beneath logs and the hollows of the trees, I saw a host of leprous, rotting rabbits, their fur blackened with drying blood, their eyes alight with foxfire. I did not know what malign force animated them, but it was clear it meant me no good.  Out of sight but not earshot, Bupus let out a simultaneous snore and long sonorous fart. Under other circumstances, it would have been funny, but now it only echoed flat and helpless as the rabbits, crouched as low to the ground as though they were snakes, writhed through the dry grasses towards me, their eyes gleaming with moon-touched luminescence.  The novelty of the sensation might have been what had me frozen. It was as though my belly were trying to crawl sideways, as though my bones had been stolen without my notice.  They were nearly to me, crawling in a sinuous motion, as though their flesh were liquid. Preddi wouldn’t hear me shout. Neither would the snoring Bupus. I strained to scream nonetheless. It seemed unreasonable not to.  And then behind me there was a noise.  A woman was coming towards me along the deer path, dressed in the onion-skin colored gown of a Palmer, carrying an ancient throwlight. It was made of bronze, and aluminum capped one end, while the other bulged with a glass lens.  She thumbed its side and it shed its cold and mechanical light across the leprous rabbits, which recoiled as though a single mass. They smoldered under the unnatural light, withered away into ringlets of oily smoke.  “I saw your fire from the road,” she said, letting the light play over the last of the rabbits. “This area is curse-ridden, and I thought you might not know to look out. Light kills them, though.”  “Thank you,” I said shakily. “Will you share our fire?”  “Yes,” she said, as though expecting the invitation. She was a small woman with a head of short, crown-curled hair—slight but with enough weight to give her substance. No jewelry was evident, only the simplicity of her robe, and the worn leather pack on her back, which she tucked her light back into.  “That’s a useful thing,” I said. “Where did you get it?”  “I found it,” she said before changing the subject. “Are you unharmed? A bite from a curse creature can fester.”  I shook my head. “They didn’t get close enough,” I said. “Good timing on your part.”  Back at the fire, I tried to convey to Preddi that there was danger in the woods. I don’t know if it got through or not. We built the fire up, and stacked the extra wood nearby, settling down to toast bread and cheese on sticks over the fire. Bupus whined for cheese, but it makes him ill, so I gave him chunks of almost-burned toasted bread instead. It’s good for his digestion. He looked reproachful, but crunched them down.  The Palmer, whose name turned out to be Lupe, and I talked, Preddi’s gaze moving between us as though he were listening, although when I tried to include him in the conversation, he gave me a blank look. I learned she was traveling from Port Wasp to Piperville, a Palmer, although she did not reveal the purpose of her pilgrimage. Well, that’s a personal thing, and not one everyone shares, so I didn’t push the question.  “You’re a beast trainer,” she said, eying me.  “I am—and my father before him, and his mother before him.”  “A tradition in your family.” Her eyes glittered in the firelight, malicious jet beads.  “Yes.”  “Do you pass down lists of what are beasts and what are people?”  I sighed. One of those. “Look,” I said. “We know which are beasts and which people. Beasts cannot overcome their natures and are not responsible for their actions. People can and are. There are four races of people: human, the Snake folk, the Dead beneath Tabat, and Angels, although no one has seen the last in centuries.”  “But although beasts are helpless before their natures, should one kill a person, they are killed in turn.”  “Of course,” I said. “Any farmer knows that a dog that bites once will bite again. They cannot help it. People can learn, so they can be punished and learn from the experience.”  She snorted and spat something fat and wet into the fire. “It’s no use talking to you,” she said. She turned to Preddi. “And what about you?” she said.  He looked at her blankly.  “He’s a little deaf,” I said.  “Ah.” She leaned forward and shouted into his ear, putting a hand on his arm to steady herself.  He looked at her, surprised. Few of us talked to Preddi—too difficult to stand there loudly repeating a phrase until it penetrated the muffling of his hearing.  I stood up and went to see to Bupus.  He was lying on his back, sprawled out like a tomcat in hot weather. Spittle roped from his gaping mouth and his knobby, chitinous tail twitched in his sleep, its tip glistening with green ichor.  I checked him over for ticks, parasites, thorns and the like. He grumbled in his sleep, turning over when I thumped him, great flanks shivering as though bitten by invisible flies.  “Gnaw your bones,” he muttered.  When I turned back to the fireside, I froze as deeply as I had with the rabbits. Off in the shadows beneath a sheltering pair of cedars, Preddi and the pilgrim woman were huddled together in his bedroll, moving in rhythm.  I was appalled on several levels. For one, you don’t want to think about your husband’s father like that. You know what I mean. Plus this woman didn’t seem very pleasant. And this was awfully sudden, so I felt as though I should make sure she didn’t chew off his face or turn out to be some sort of shifter. But above it all, I was irritated at their lack of manners. Was I supposed to act as though they weren’t there on the other side of the fire? I could understand why they hadn’t gone further, worried about the rabbits. But still. Still.  After they settled down, Preddi emerged and signaled he was ready to take his watch. He didn’t look me in the face, nor was I sure what to say. I looked him over and if he’d been enchanted in some way, I couldn’t tell, nor was I sure what the signs of such enchantment might be. So I tried to sleep, but mainly lay awake, wondering what Rik would say when he found out.  In the morning, Steel was there.  “Where’s Rik?” I said, before any other business.  “There’s been a little trouble,” Steel said.  “What trouble?”  He flapped an irritated hand at me. “Get your manticore ready while I fix the axle.” He gave Preddi and the pilgrim a glance.  “That’s Lupe, a pilgrim,” I said. “She saved my life last night.”  He grunted and turned to the axle. I roused Bupus to get him into harness, grumbling under my breath.  Preddi and Lupe walked on one side of the wagon while Steel rode on the other. I drove. Lupe leaned on Preddi as they walked, and I noticed the slight hitch to her gait, as though one leg were shorter than the other.  “You can ride with me,” I said, wondering if she’d be able to keep up otherwise. She shook her head, smiling at Preddi. It was a gesture that warmed me to her, despite my fears.  “What happened was this,” Steel said. “Lily got two farmers all riled up and throwing insults at each other. They started swinging and then we got fined for disturbing the peace.”  “Fined? How much?”  He winced.  “That much?” I said. “We don’t have any cash to spare.” Rik keeps the books for the circus, and I knew just how thin the financial razor’s edge we danced on was.  “Yes,” Steel said. “They let me out but kept the others in there. I’m supposed to raise the money. How, I don’t know. Meanwhile, they’re all sitting in jail eating their heads off and adding each day’s room and board to the total.”  “We have no extra money,” I said.  “I know.”  “I do,” Lupe said from somewhere behind us. “I could help you.”  We both turned to look at her, but Steel said the obvious thing first. “And what would you want in return?”  “A friend’s wagon went into a gorge, two miles ahead. I need someone to go into it and bring out a box of tools that he needs. He’ll come back later to retrieve the wagon itself, but he’s gone ahead to Piperville. I stayed behind to see if I could get help in getting the wagon out, but had no luck. Now I just want to bring him his tools, but I am forbidden to go within walls during my journey.”  It was flimsy, it was suspicious. But Palmers are on pilgrimage, and sometimes they act according to their geas. Steel and I exchanged glances, saying the same thing. “Not much choice here.”  “Very well,” he said.  We trudged along in silence for the next mile, except for Lupe, who chattered away to Preddi. She had a trick of touching his arm to let him know she was speaking, to look at her, and he seemed happier than his usual self. I felt guilty—had Preddi been waiting all this time for someone just to talk to? I knew Rik’s mother had died birthing him—that would have been over a quarter of a century ago.  I kept hearing her voice as we rode, high pitched inconsequentialities, the rush of words that comes from someone who has wanted to speak for a long time.  It was easy enough to see where the wagon had gone into the gorge. It was a bad place where the road narrowed—Lupe said her friend had been trying to make room for a larger wagon to pass. The blackberries were torn with its passage down the sloping, rocky side.  And when I climbed down through the brambles, since it was clear Steel had no intention of it, I saw a familiar sight: Sparky’s little wagon, tilted askew.  He was not in sight, but I found blood and tracks near the front. Only his tracks, though confused and scattered, as though being pursued.  How to play this hand? What was Lupe’s game? I opened the back door of the wagon and peered inside.  Sparky had collected scrap. Iron chains draped the walls, along with lengths of iron and lesser metals: soft copper tubing, a tarnished piece of silver netting. And in the center, his tools in their box. I opened it, trying to figure out why Lupe wanted them. Ordinary tools: screwdrivers, picks, hammers. His father had made them and carved the wooden handles himself, Sparky had told me once.  Wooden handles. I looked down at the tools again, and then at the chain draped walls. Finally I understood. I imagined Sparky being driven from his wagon seat in a cloud of elf-shot, wicked stings that burned, wicked stings that drove him in a mad rush to where he could be safely killed.  Taking a length of chain from the wall and draping it around my neck, I took the box and clambered up the side of the gorge with its awkward weight below my arm.  Lupe’s fingers twitched with eagerness as she saw it. She and Preddi stood side by side, while Steel watched the road, ready to lead Bupus on a little further if some wagon should need to pass. I went over to him and laid the box between Bupus’ front paws. Touching the manticore’s shoulder, I leaned to whisper in his ear. He looked at me, his eyes unreadable, while Steel glanced sideways, eyebrows forming a puzzled wrinkle.  “Give it to me,” Lupe said. Her voice had an odd, droning quality to it.  “Not until we have the money,” I said.  She laughed harshly and I knew deep in my bones I’d been right. I stepped aside, putting my hand on his shoulder. Steel looked between us, bewildered.  “It’s Sparky’s wagon,” I said. “Looks like he was driven away to be killed.”  “You must be confused,” she said. “That wagon belongs to my friend. I don’t know who this Sparky is.”  I continued, “And then she found she couldn’t go in his wagon because of the iron, and yet there they were, wooden handled tools that she could use. You’re some sort of Fay, aren’t you, Lupe?”  Her black eyes glittered with rage as she stared at me, searching for reply. Preddi looked between us, his face confused. I had no idea what he was making of the conversation, or if he’d actually caught any of it.  Steel stepped forward, hand on his knife.  “Stay away!” she spat. Her form quivered as she shrank in on herself, her skin wrinkling, folding, until she resembled nothing so much as an immense, papery wasp’s nest, tiny wicked fairies glittering around her in a swarm. A desiccated tuft of brown curls behatted her and she rushed at me and the box in a cloud of fairies.  Bupus’s tail batted her out of the air, neat and quick, and I laid the chain across her throat.  It immobilized her. The tiny fairies still darted in and out of her papery form, but they made no move to harm me. Cold iron is deadly to the Fays, even beyond its hampering of their powers.  I had my own tools in the wagon.  Another traveling show paid well for Lupe, enough to get all of our members out of jail. She huddled in the iron cage, quenched and calmed, and the malicious spark had vanished from her eyes. I hoped the dulling had left her with some language. I had not performed the operation in a long time.  Suprisingly, Preddi chose to go with her. All he said was “She’s a good companion” but there was no reproach in the words. Rik did not entirely understand why his father was leaving, but he took it well enough.  In the evening, I took Bupus down to the stream near our camp for a drink. The full moon rolled overhead like a tipsy yellow balloon. He paced beside me, slow steady footfalls, and as he drank, I combed out his hair with a wooden-toothed comb, removing the road dust from it. When he had drunk his fill, I wiped his face for him.  There in the moonlight, he took my wrist in his mouth, pinned between enormous molars as big as pill-bottles. I froze, imagining the teeth crushing down, the bones splintering as he ground at them. Sweat soured my arm-pits but I stood stock still.  His lips released my wrist and he nosed at my side, snuggling his head in under my arm. I let go of the breath I had been holding. Tears sprang to my eyes.  He rumbled something interrogative, muffled against the skin of my hip. I wound my fingers through his lank, greasy hair.  “No,” I said. “You didn’t hurt me.”  “Good,” he said.  I stood for a long time, looking up at the moon. Its face was washed clean by clouds, and stars came out to play around it. After a while, Bupus began to snore. Cat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "text": "5720 words, short story\nI'll Gnaw Your Bones, the Manticore Said\nEven Duga the Prestidigitator, who never pays much attention to anything outside his own hands, raised an eyebrow when I announced I’d be hooking the manticore up to my wagon.\n“Isn’t that dangerous?” my husband Rik said. He steepled his fingers, regarding me.\n“The more we have pulling, the faster we get there,” I pointed out. “And Bupus has been getting fat and lazy as a tabby cat. No one pays to see a fat manticore.”\n“More dangerous than any tabby cat,” Rik said.\nI knew what he meant, but I kept a lightning rod at hand in the wagon seat in case of trouble. Bupus knew I’d scorch his greasy whiskers if he crossed me.\nThere is a tacit understanding between a beast trainer and her charges, whether it be great cats, cunning dragons, or apes and other man-like creatures. They know, and the trainer knows, that as long as certain lines aren’t crossed, that if certain expectations are met, everything will be fine and no one will get hurt.\nThat’s not to say I didn’t keep an eye on Bupus, watching for a twitch to his tail, the way one bulbous eye would go askew when anger was brewing. A beast’s a beast, after all, and not responsible for what they do when circumstances push them too far. Beasts still, no matter how they speak or smile or woo.\nAt any rate, Bupus felt obliged to maintain his reputation whenever another wagon or traveler was in earshot.\n“Gnaw your bones,” he rumbled, rolling a vast oversized eyeball back at me. The woman he was trying to impress shrieked and dropped her chickens, which vanished in a white flutter among the blackberry vines and ferns that began where the road’s ground stone gave way to forest. A blue-headed jay screamed in alarm from a pine.\n“Behave yourself,” I said.\nHe rumbled again, but nothing coherent, just a low, animal sound.\nWe were coming up on Piperville, which sits on a trade hub. Steel figured we’d pitch there for a week, get a little silver sparkling in our coffers, eat well for a few nights.\nIt had been a lean winter and times were hard all over—traveling up from Ponce’s Spring, we’d found slim pickings and audiences too worried about the dust storms to pay any attention to even our best: Laxmi the elephant dancing in pink spangles to “Waltzing Genevieve,” the pyramid of crocodiles that we froze and unfroze each performance via a lens-and-clockwork basilisk, the Unicorn Maiden, and, of course, my manticore.\nRik was driving a wagon full of machinery, packed and protected from the dust with layers of waxed canvas. He pulled up near me, so we were riding in tandem for a bit. No one was coming the opposite way for now. We’d hit some road traffic coming out of Ponce’s, but now it was only occasional, a twice an hour thing at most.\n“You know what I’m looking forward to?” I called over to him.\nHe considered. I watched him thinking in the sunlight, my broad-shouldered and beautiful husband and just the look of him, his long scholar’s nose and silky beard, made me smile.\n“Beer,” he said finally. “And clean sheets. Cleeaaaan sheets.” He drawled out the last words, smiling over at me.\n“A bath,” I said.\nA heartfelt groan so deep it might have come from the bottom of his soul came from him. “Oh, a bath. With towels. Thick towels.”\nI was equally enraptured by the thought, so much so that I didn’t notice the wheel working loose. And Bupus, concerned with looking for people to impress, didn’t warn me. With a sideways lurch, the wagon tilted, and the wheel kept going, rolling down the roadway, neat as you please, until it passed Laxmi and she put out her trunk and snagged it.\nI put on my shoes and hopped down to examine the damage. Steel heard the commotion and came back from the front of the train. He rode Beulah, the big white horse that accompanies him in the ring each time. Sometimes we laugh about how attached he is to that horse, but never where he can hear us.\nThe carts and caravans kept passing us. A few waved and Rik waved back. The august clowns were practicing their routine, somersaulting into the dust behind their wagon, then running to catch up with it again. Duga was practicing card tricks while his assistant drove, dividing her attention between the reins and watching him. Duga was notoriously close-mouthed about his methods; I suspected watching might be her only way to learn.\n“Whaddya need?” Steel growled as he reached me.\n“Looks like a linchpin fell out. Could have been a while back. Sparky’ll have a new one, I’m sure.”\nHis blue gaze slid skyward, sideways, anywhere to avoid meeting my eyes. “Sparky’s gone.”\nIt is an unfortunate fact that circuses are usually made of Family and outsiders—jossers, they call us. Steel treated Family well but was unwilling to extend that courtesy outside the circle. I’d married in, and he was forced to acknowledge me, but Sparky had been a full outsider, and Steel had made his life a misery, maintaining our cranky and antiquidated machines: the fortune teller, the tent-lifter, and Steel’s pride and joy, the spinning cups, packed now on the largest wagon and pulled by Laxmi and three oxen.\nThe position of circus smith had been vacant of Family for a while now, ever since Big Joy fell in love with a fire-eater and left us for the Whistling Piskie—a small, one-ring outfit that worked the coast.\nSo we’d lost Sparky because Steel had scrimped and shorted his wages, not to mention refusing to pay prentice fees when he wanted to take one on. More importantly, we’d lost his little traveling cart, full of tools and scrap and spare linchpins.\n“So what am I going to do?” I snapped. Bupus had sat down on the road and was eying the passing caravans, more out of curiosity than hunger or desire to menace. “I’ll gnaw your bones,” he said almost conversationally, but it frightened no one in earshot. He sighed and settled his head between his paws, a green snot dribble bubbling from one kitten-sized nostril.\nThe Unicorn Girl pulled up her caravan. She’d been trying to repaint it the night before and there were bleary splotches of green and lavender paint smearing its sides.\n“What’s going on?’ she said loudly. “Driving badly again, Tara?”\nThe Unicorn Girl was one of those souls with no volume control. Sitting next to her in taverns or while driving was painful. She’d bray the same stories over and over again, and was tactless and unkind. I tried to avoid her when I could.\nBut, oh, she pulled them in. That long, narrow, angelic face, the pearly horn emerging from her forehead, and two lush lips, peach-ripe, set like emerging sins beneath the springs of her innocent doe-like eyes.\nEven now, she looked like an angel, but I knew she was just looking for gossip, something she might be able to use to buy favor or twist like a knife when necessary.\nSteel looked back and forth. “Broken wagon, Lily,” he said. “You can move along.”\nShe dimpled, pursing her lips at him but took up her reins. The two white mares pulling her wagon were daughters of the one he rode, twins with a bad case of the wobbles but which should be good for years more, if you ignored the faint, constant trembling of their front legs. Most people didn’t notice it.\n“She needs to learn to mind her tongue,” I said.\n“Rik needs to come in with us,” Steel said, ignoring my comment. “He’s the smartest, he knows how to bargain. These little towns have their own customs and laws and it’s too easy to set a foot awry and land ourselves in trouble.”\nMuch as I hated to admit, Steel was right. Rik is the smartest of the lot, and he knows trade law like the back of his hand.\n“I’ll find someone to leave with you, and Rik will ride back with the pin, soon as he can,” Steel said.\n“All right,” I said. Then, as he started to wheel Beulah around. “Someone I won’t mind, Steel. Got me?”\n“Got it,” he said, and rode away.\n“I don’t like leaving you,” Rik said guiltily. It was a year old story, and its once upon a time had begun on our honeymoon night, with him riding out to help with the funeral of his grandfather, who had been driven into a fatal apoplectic fit by news of his marriage to someone who’d never known circus life.\n“Can’t be helped,” I said crisply. He sighed.\n“Tara . . . ”\n“Can’t be helped.” I flapped an arm at him. “Go on, get along, faster you are to town, faster you’re back to me.”\nHe got out of his wagon long enough to kiss me and ruffle my hair.\n“Not long,” he said. “I won’t be long.”\n“We’ll leave Preddi with you,” Steel said, a quarter hour after I’d watched Rik’s caravan recede into the distance. It had taken a while for the rest of the circus to pass me, wagon after wagon. Even for such a small outfit, we had a lot of wagons.\nPreddi was Rik’s father, a small, stooped man given to carelessness with his dress. He was a kindly man, I think, but difficult to get to know because his deafness distanced him.\nWe pulled the wagon over to the side of the road, in a margined sward thick with yellow loosestrife and dandelions. A narrow deer path led through blackberry tangles and further into the pines, a stream coming through the thick pine needles and chuckling along the rocks. I tied Bupus to the wagon, and brought out a sack of hams and loaves of bread before making several trips in to bring him buckets of water.\nPreddi settled himself on the grass and extracted a deck of greasy cards from the front pocket of his flannel shirt. While I worked, he laid out hand after hand, playing poker with himself, studying it.\nThe day wore on.\nAnd on. I cleaned the wagon tack, and repacked the bundles in it, mainly my training gear. Someone else would be tending my cage of beasts when they pitched camp, and truth be told, anyone could, but I still preferred to be the one who fed the crocodiles, for example, and watched for mouth rot or the white lesions that signal pox virus and cleaned their cage thoroughly enough to make sure no infection could creep in under their scales or into the tender areas around their vents.\nBupus gorged himself and then slept, but roused enough to want to play. I threw the heavy leather ball and each time his tail whipped out with frightening speed and batted it aside. Fat and lazy, he may be, but Bupus has many years left in him. They go four or five decades, and I’d raised him from the shell ten years earlier, before I’d even bought the flimsy paper ticket that led me to meet Rik.\nI hadn’t known what I had at first. A sailor swapped me the egg in return for me covering his bar tab, and who knows who got the best of that bargain? I was a beast trainer for the Duke, and mainly I worked with little animals, trained squirrels and ferrets and marmosets. They juggled and danced, shot tiny plaster pistols, and engaged in duels as exquisite as any courtier’s.\nThe egg was bigger than my doubled fists laid knuckle and palm to knuckle and palm. It was coarse to the touch, as though threads or hairy roots had been laid over the shell and grown into it, and it was a deep yellow, the same yellow that Bupus’s eyes would open into, honey depths around clover-petaled pupils.\nI kept it warm, near the hearth, but could not figure out what it might contain. Months later it hatched—lucky that I was there that day to feed the mewling, squawling hatchling chopped meat and warm milk. I wrapped the sting in padding and leather. Even then it struck out with surprising speed and strength. A manticore is a vulnerable creature, lacking human hands to defend the softness of its face, and the sting compensates for that vulnerability.\nHe talked a moon, perhaps a moon and a half later. I took him with me at first, when I was training the Duke’s creatures, but a marmoset decided to investigate, and I learned then that a manticore’s bite is a death grip, particularly with a marmoset’s delicate bones between its teeth.\nSome beast trainers dull their more intelligent beasts. It’s an easy enough procedure, if you can drug or spell them unconscious. The knife is thin, more like a flattened awl than a blade, and you insert it at the corner of the eye, going behind the eyeball itself. Once you’ve pushed it in to the right depth, perforating the plate of the skull lying behind the eye, you swing back and forth holding it between thumb and forefinger, two cutting arcs. It bruises the eye, leaves it black and tender in the socket for days afterward, but it heals in time.\nIt doesn’t kill their intelligence entirely, but they become simpler. More docile, easier to manage. They don’t scheme or plot escape, and they’re less likely to lash out. Done right, even a dragon can be made clement. And those beasts prone to over-talkativeness—dryads and mermaids, for the most part—can be rendered speechless or close to it.\nI’ve never done that, though my father taught me the technique. I like my talking beasts, most of the time, and on occasion, I’ve had conversation with sphinx or lamia that were as close to talking with a person as could be.\nAfter the marmoset incident, I left Bupus at home, the establishment the Duke allowed me, a fine place with stable and mews and even a heat-room, which the Ducal coal stores kept supplied all winter long and into the chilly Tabatian springs. I kept him in a stall that had been reinforced, and there were other animals to keep him company.\nI’d gone to the circus to see their creatures. They had the crocodiles, which were nothing out of the ordinary, and the elephant, which was also unremarkable, since the Duchess kept two pygmy elephants in her menagerie. And an aging hippogriff, a splendid creature even though its primaries had gone gray with age long ago. I was surprised to see his beak overgrown, as though no one had coped it in months.\n“Look here,” I said to the man standing to watch the cages and make sure no one poked a finger through and lost it. “Your hippogriff is badly tended. See how he rubs his beak along the ground, how he feaks? Your tender is careless, sir.”\nI was full of youth and indignation, but I softened when he perked up and said, “Can you tend them? We lost our fellow. How much would you charge?”\n“No charge,” I said. “If you let me look over the hippogriff as thoroughly as I’d like to. I haven’t ever had the chance to get my hands on a live one.”\n“Can you come back later, when we close up?” He looked apologetic. He was a pretty man, and his uniform made him even prettier.\n“I can.” It’d mean a late night, but there was nothing going on that next morning—I could sleep in, and go to check the marmosets in the afternoon, or let the regular assistant do it, even, if I was feeling lazy.\nSo I came back late that night and pushed my way through the crowds eddying out, like a duck swimming against the current. He was waiting for me near the cages. I’d brought my bag of tools, and so we went from cage to cage.\nHe settled the hippogriff when it bated at the sight of me, flapping its wings and rearing upward. It was easily calmed, and he ran his fingers through the silky feathers around its eyes, rubbing softly over the scaly cere, until its eyes half-lidded and it chirped with pleasure, nuzzling its head along his side.\nI trimmed its beak and claws and checked it over before moving on to the other animals. It took me three hours, and even so, much of that was simply telling Rik what would need to be done later on—to stop giving the crocodiles sardines, for example, before they got sick from the oiliness.\nI refused pay, and he insisted that he should buy me a cup of wine, at least. How inevitable was it that I would take this beautiful man home with me?\nIn the morning, I showed my household to my lover. The dueling marmosets, the brace of piskies, the cockatrice kept by itself, lest it strike out in its bad temper. And Bupus, sprawled out across the courtyard. Rik was enchanted.\n“A manticore!” he said. “I’ve never seen a tamed one. Or a wild one, for that matter. They come from the deserts in the land to the south, you know.”\nA year later, diffidently, while the caravan was spending a month in Tabat, he mentioned to me that the hippogriff had finally succumbed to old age and the caravan would like to buy Bupus.\nI refused to sell, but when I married him, the manticore came with me.\nWhen the sun touched down on the horizon and lingered there, like a marble being rolled back and forth beneath one’s palm, we realized that there was some delay. If not tonight, though, they’d come tomorrow. Preddi and I discussed it all with shrugs and miming, agreeing to build a fire before the last of the sunlight vanished.\nThe woods that run beside the road there are dark and dangerous, which is why travelers stick to the road. As night had approached, there were no more passersby—everyone had found shelter where they could. Preddi and I would spread bedrolls beside the fire and keep watch in turns, but I wasn’t worried much. The smell of a manticore keeps off most predators.\nBut as I picked through the limbs that lay like sutures across the ground’s interwoven needles, a crackling through the dry leaves at the clearing’s edge alerted me. Preddi was near the road, gathering more wood.\nAs I watched I saw stealthy movement. First one, then more, as though the shadows themselves were crawling towards me. As they emerged, crawling out from the crevices beneath logs and the hollows of the trees, I saw a host of leprous, rotting rabbits, their fur blackened with drying blood, their eyes alight with foxfire. I did not know what malign force animated them, but it was clear it meant me no good.\nOut of sight but not earshot, Bupus let out a simultaneous snore and long sonorous fart. Under other circumstances, it would have been funny, but now it only echoed flat and helpless as the rabbits, crouched as low to the ground as though they were snakes, writhed through the dry grasses towards me, their eyes gleaming with moon-touched luminescence.\nThe novelty of the sensation might have been what had me frozen. It was as though my belly were trying to crawl sideways, as though my bones had been stolen without my notice.\nThey were nearly to me, crawling in a sinuous motion, as though their flesh were liquid. Preddi wouldn’t hear me shout. Neither would the snoring Bupus. I strained to scream nonetheless. It seemed unreasonable not to.\nAnd then behind me there was a noise.\nA woman was coming towards me along the deer path, dressed in the onion-skin colored gown of a Palmer, carrying an ancient throwlight. It was made of bronze, and aluminum capped one end, while the other bulged with a glass lens.\nShe thumbed its side and it shed its cold and mechanical light across the leprous rabbits, which recoiled as though a single mass. They smoldered under the unnatural light, withered away into ringlets of oily smoke.\n“I saw your fire from the road,” she said, letting the light play over the last of the rabbits. “This area is curse-ridden, and I thought you might not know to look out. Light kills them, though.”\n“Thank you,” I said shakily. “Will you share our fire?”\n“Yes,” she said, as though expecting the invitation. She was a small woman with a head of short, crown-curled hair—slight but with enough weight to give her substance. No jewelry was evident, only the simplicity of her robe, and the worn leather pack on her back, which she tucked her light back into.\n“That’s a useful thing,” I said. “Where did you get it?”\n“I found it,” she said before changing the subject. “Are you unharmed? A bite from a curse creature can fester.”\nI shook my head. “They didn’t get close enough,” I said. “Good timing on your part.”\nBack at the fire, I tried to convey to Preddi that there was danger in the woods. I don’t know if it got through or not. We built the fire up, and stacked the extra wood nearby, settling down to toast bread and cheese on sticks over the fire. Bupus whined for cheese, but it makes him ill, so I gave him chunks of almost-burned toasted bread instead. It’s good for his digestion. He looked reproachful, but crunched them down.\nThe Palmer, whose name turned out to be Lupe, and I talked, Preddi’s gaze moving between us as though he were listening, although when I tried to include him in the conversation, he gave me a blank look. I learned she was traveling from Port Wasp to Piperville, a Palmer, although she did not reveal the purpose of her pilgrimage. Well, that’s a personal thing, and not one everyone shares, so I didn’t push the question.\n“You’re a beast trainer,” she said, eying me.\n“I am—and my father before him, and his mother before him.”\n“A tradition in your family.” Her eyes glittered in the firelight, malicious jet beads.\n“Yes.”\n“Do you pass down lists of what are beasts and what are people?”\nI sighed. One of those. “Look,” I said. “We know which are beasts and which people. Beasts cannot overcome their natures and are not responsible for their actions. People can and are. There are four races of people: human, the Snake folk, the Dead beneath Tabat, and Angels, although no one has seen the last in centuries.”\n“But although beasts are helpless before their natures, should one kill a person, they are killed in turn.”\n“Of course,” I said. “Any farmer knows that a dog that bites once will bite again. They cannot help it. People can learn, so they can be punished and learn from the experience.”\nShe snorted and spat something fat and wet into the fire. “It’s no use talking to you,” she said. She turned to Preddi. “And what about you?” she said.\nHe looked at her blankly.\n“He’s a little deaf,” I said.\n“Ah.” She leaned forward and shouted into his ear, putting a hand on his arm to steady herself.\nHe looked at her, surprised. Few of us talked to Preddi—too difficult to stand there loudly repeating a phrase until it penetrated the muffling of his hearing.\nI stood up and went to see to Bupus.\nHe was lying on his back, sprawled out like a tomcat in hot weather. Spittle roped from his gaping mouth and his knobby, chitinous tail twitched in his sleep, its tip glistening with green ichor.\nI checked him over for ticks, parasites, thorns and the like. He grumbled in his sleep, turning over when I thumped him, great flanks shivering as though bitten by invisible flies.\n“Gnaw your bones,” he muttered.\nWhen I turned back to the fireside, I froze as deeply as I had with the rabbits. Off in the shadows beneath a sheltering pair of cedars, Preddi and the pilgrim woman were huddled together in his bedroll, moving in rhythm.\nI was appalled on several levels. For one, you don’t want to think about your husband’s father like that. You know what I mean. Plus this woman didn’t seem very pleasant. And this was awfully sudden, so I felt as though I should make sure she didn’t chew off his face or turn out to be some sort of shifter. But above it all, I was irritated at their lack of manners. Was I supposed to act as though they weren’t there on the other side of the fire? I could understand why they hadn’t gone further, worried about the rabbits. But still. Still.\nAfter they settled down, Preddi emerged and signaled he was ready to take his watch. He didn’t look me in the face, nor was I sure what to say. I looked him over and if he’d been enchanted in some way, I couldn’t tell, nor was I sure what the signs of such enchantment might be. So I tried to sleep, but mainly lay awake, wondering what Rik would say when he found out.\nIn the morning, Steel was there.\n“Where’s Rik?” I said, before any other business.\n“There’s been a little trouble,” Steel said.\n“What trouble?”\nHe flapped an irritated hand at me. “Get your manticore ready while I fix the axle.” He gave Preddi and the pilgrim a glance.\n“That’s Lupe, a pilgrim,” I said. “She saved my life last night.”\nHe grunted and turned to the axle. I roused Bupus to get him into harness, grumbling under my breath.\nPreddi and Lupe walked on one side of the wagon while Steel rode on the other. I drove. Lupe leaned on Preddi as they walked, and I noticed the slight hitch to her gait, as though one leg were shorter than the other.\n“You can ride with me,” I said, wondering if she’d be able to keep up otherwise. She shook her head, smiling at Preddi. It was a gesture that warmed me to her, despite my fears.\n“What happened was this,” Steel said. “Lily got two farmers all riled up and throwing insults at each other. They started swinging and then we got fined for disturbing the peace.”\n“Fined? How much?”\nHe winced.\n“That much?” I said. “We don’t have any cash to spare.” Rik keeps the books for the circus, and I knew just how thin the financial razor’s edge we danced on was.\n“Yes,” Steel said. “They let me out but kept the others in there. I’m supposed to raise the money. How, I don’t know. Meanwhile, they’re all sitting in jail eating their heads off and adding each day’s room and board to the total.”\n“We have no extra money,” I said.\n“I know.”\n“I do,” Lupe said from somewhere behind us. “I could help you.”\nWe both turned to look at her, but Steel said the obvious thing first. “And what would you want in return?”\n“A friend’s wagon went into a gorge, two miles ahead. I need someone to go into it and bring out a box of tools that he needs. He’ll come back later to retrieve the wagon itself, but he’s gone ahead to Piperville. I stayed behind to see if I could get help in getting the wagon out, but had no luck. Now I just want to bring him his tools, but I am forbidden to go within walls during my journey.”\nIt was flimsy, it was suspicious. But Palmers are on pilgrimage, and sometimes they act according to their geas. Steel and I exchanged glances, saying the same thing. “Not much choice here.”\n“Very well,” he said.\nWe trudged along in silence for the next mile, except for Lupe, who chattered away to Preddi. She had a trick of touching his arm to let him know she was speaking, to look at her, and he seemed happier than his usual self. I felt guilty—had Preddi been waiting all this time for someone just to talk to? I knew Rik’s mother had died birthing him—that would have been over a quarter of a century ago.\nI kept hearing her voice as we rode, high pitched inconsequentialities, the rush of words that comes from someone who has wanted to speak for a long time.\nIt was easy enough to see where the wagon had gone into the gorge. It was a bad place where the road narrowed—Lupe said her friend had been trying to make room for a larger wagon to pass. The blackberries were torn with its passage down the sloping, rocky side.\nAnd when I climbed down through the brambles, since it was clear Steel had no intention of it, I saw a familiar sight: Sparky’s little wagon, tilted askew.\nHe was not in sight, but I found blood and tracks near the front. Only his tracks, though confused and scattered, as though being pursued.\nHow to play this hand? What was Lupe’s game? I opened the back door of the wagon and peered inside.\nSparky had collected scrap. Iron chains draped the walls, along with lengths of iron and lesser metals: soft copper tubing, a tarnished piece of silver netting. And in the center, his tools in their box. I opened it, trying to figure out why Lupe wanted them. Ordinary tools: screwdrivers, picks, hammers. His father had made them and carved the wooden handles himself, Sparky had told me once.\nWooden handles. I looked down at the tools again, and then at the chain draped walls. Finally I understood. I imagined Sparky being driven from his wagon seat in a cloud of elf-shot, wicked stings that burned, wicked stings that drove him in a mad rush to where he could be safely killed.\nTaking a length of chain from the wall and draping it around my neck, I took the box and clambered up the side of the gorge with its awkward weight below my arm.\nLupe’s fingers twitched with eagerness as she saw it. She and Preddi stood side by side, while Steel watched the road, ready to lead Bupus on a little further if some wagon should need to pass. I went over to him and laid the box between Bupus’ front paws. Touching the manticore’s shoulder, I leaned to whisper in his ear. He looked at me, his eyes unreadable, while Steel glanced sideways, eyebrows forming a puzzled wrinkle.\n“Give it to me,” Lupe said. Her voice had an odd, droning quality to it.\n“Not until we have the money,” I said.\nShe laughed harshly and I knew deep in my bones I’d been right. I stepped aside, putting my hand on his shoulder. Steel looked between us, bewildered.\n“It’s Sparky’s wagon,” I said. “Looks like he was driven away to be killed.”\n“You must be confused,” she said. “That wagon belongs to my friend. I don’t know who this Sparky is.”\nI continued, “And then she found she couldn’t go in his wagon because of the iron, and yet there they were, wooden handled tools that she could use. You’re some sort of Fay, aren’t you, Lupe?”\nHer black eyes glittered with rage as she stared at me, searching for reply. Preddi looked between us, his face confused. I had no idea what he was making of the conversation, or if he’d actually caught any of it.\nSteel stepped forward, hand on his knife.\n“Stay away!” she spat. Her form quivered as she shrank in on herself, her skin wrinkling, folding, until she resembled nothing so much as an immense, papery wasp’s nest, tiny wicked fairies glittering around her in a swarm. A desiccated tuft of brown curls behatted her and she rushed at me and the box in a cloud of fairies.\nBupus’s tail batted her out of the air, neat and quick, and I laid the chain across her throat.\nIt immobilized her. The tiny fairies still darted in and out of her papery form, but they made no move to harm me. Cold iron is deadly to the Fays, even beyond its hampering of their powers.\nI had my own tools in the wagon.\nAnother traveling show paid well for Lupe, enough to get all of our members out of jail. She huddled in the iron cage, quenched and calmed, and the malicious spark had vanished from her eyes. I hoped the dulling had left her with some language. I had not performed the operation in a long time.\nSuprisingly, Preddi chose to go with her. All he said was “She’s a good companion” but there was no reproach in the words. Rik did not entirely understand why his father was leaving, but he took it well enough.\nIn the evening, I took Bupus down to the stream near our camp for a drink. The full moon rolled overhead like a tipsy yellow balloon. He paced beside me, slow steady footfalls, and as he drank, I combed out his hair with a wooden-toothed comb, removing the road dust from it. When he had drunk his fill, I wiped his face for him.\nThere in the moonlight, he took my wrist in his mouth, pinned between enormous molars as big as pill-bottles. I froze, imagining the teeth crushing down, the bones splintering as he ground at them. Sweat soured my arm-pits but I stood stock still.\nHis lips released my wrist and he nosed at my side, snuggling his head in under my arm. I let go of the breath I had been holding. Tears sprang to my eyes.\nHe rumbled something interrogative, muffled against the skin of my hip. I wound my fingers through his lank, greasy hair.\n“No,” I said. “You didn’t hurt me.”\n“Good,” he said.\nI stood for a long time, looking up at the moon. Its face was washed clean by clouds, and stars came out to play around it. After a while, Bupus began to snore.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "source": "https://clarkesworldmagazine.com/rambo_07_07/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: I'll Gnaw Your Bones, the Manticore Said by Cat Rambo"}