{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gu Shi; S Qiouyi Lu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "eIUL5hD8wDO7XI7YKLE4oGIiiuU=", "id": null, "license": null, "comments": "", "raw_text": "4420 words, short story  Möbius Continuum  0. The End  Five minutes ago, the skies were still clear and boundless.  The moment dark clouds bore down from between the mountains, I knew we were done for. The quarrel couldn’t have been smaller; I don’t remember what exactly I did to make Lin Ke’s eyebrows twitch, but I knew she was angry. So I poured her a cup of honey water and set it on the tea table as a silent apology.  But X drank it instead.  I hate to quarrel. When Lin Ke’s accusing finger was inches from my face, I turned and left that little log cabin. The North Atlantic wind hit me head-on, chilling me to the bone. I had not realized what my leaving meant to her. X chased after my car and tried to explain that it had been an accident. I only said two words to him: “Get in.”  Only one highway took us out of the village of Å—that place could have been the end of the world. After we had wound through three mountains, raindrops obscured the windshield; I saw the finality of our fate, realizing everything was done for. Our relationship was like a balloon: at first, there was only a deflated circle; we took turns blowing into the balloon, then carefully pinched the end shut—we couldn’t allow any air to leak. It filled and swelled until one day, perhaps the tiniest touch would make it burst. Then the entire relationship dissipated without a trace; all our effort would be meaningless.  “ . . . You should slow down; I’m serious . . . ”  X sounded nervous; he clung to his seat belt with one hand and grabbed the handle above the door with the other like a shrimp bracing for impact. Lin Ke and I had met him at a youth hostel in Stamsund—he was an old Chinese man in his sixties who spoke fluent English and was hitchhiking to his next stop. But the moment I saw him, I knew we would travel together. He introduced himself as X, as if he were an unsolved puzzle in an equation.  I really should slow down. I glanced at my dashboard; the indicator read 160 kilometers per hour. This was a mountain path; to my left were cliffs, and to my right was the sea. Slower—I took a deep breath, then eased off the gas.  I exhaled, relaxing my fingers at the same time. The car swerved, and by the time I tried to regain control of the vehicle, it was already too late. A sharp rock punctured the front left tire, followed by the screech of brakes. The rented Ford crashed into the mountain wall to the left, spun 180 degrees, flipped over the reflective guardrail, and tumbled down the cliff.  The indigo ocean flooded my field of view. I didn’t have time to feel terror; I utterly forgot my own existence and simply analyzed everything happening around me. I thought I might have hit my head, but didn’t feel any pain; I only felt a clamminess on my face.  So my blood is cold—that was my last thought.  1. Möbius Ring  Here’s something I never understood: The majority of people who experience a disaster describe their experience from a third-person perspective, as if they had witnessed the event. Yet that was exactly what I was doing: In a weak voice, I described everything I’d witnessed to the police officer—it was a winding road, I was going too fast, a rock punctured the tire, the car jerked and then crashed into the mountain wall, spinning and sinking into the sea. I didn’t tell him the other part: How the world spun as if a cameraman had flung the lens into a dryer. I was still processing what had happened when the window shattered, shooting tiny pearls of glass away from the car (and I even questioned why they didn’t fall into the car), before the ocean rushed in.  As I spoke with the police officer, X watched from the next hospital bed. He was in much better condition, only sustaining a few scrapes. Of course, if he hadn’t been so lucky, I wouldn’t have survived. The doctor said that I had broken my neck, that it was X who had dragged me out of the car and towed me to shore. He then stopped a passing car and called the police. The ambulance arrived twenty minutes later, which is the only reason why I’m now paralyzed but alive and in the hospital.  Yes, I couldn’t feel anything, as if nothing had ever existed below my neck.  Soon, only X and I were left in the room. It was a bit awkward and I didn’t know how I should break the silence. I wanted to ask Lin Ke, but knew it wouldn’t be like in the movies, that we’d be all better after a good cry. She disappeared, as if she had never existed either. I mouthed a “thanks” to X, then closed my eyes. Darkness didn’t necessarily equal sleep; when I opened my eyes three hours later, X was still staring at me motionlessly.  This time, he spoke first.  “When I was young, I was also in a serious car accident. As I lay in bed and stared at the ceiling, I felt like my future was nothing but shit.”  He took out a roll of Scotch Tape and fiddled with it.  “Then someone comforted me by saying, ‘The world we live in is like a roll of tape: You’re always traveling on the smooth side. Even if you kept pulling the tape, you’d still only ever know the one side. You’d never understand that there’s another side, the adhesive one.’”  He tore a length of tape, formed a ring with it, and said as he pointed to the inside, “But if you ask me, this side is probably closer to the essence of our world—or perhaps the essence of this tape.”  I rolled my eyes in response. If he weren’t the only moving thing in my field of vision, I would have definitely looked away.  X didn’t seem to notice my expression. “But if we change how we stick the tape, rotating it, and you kept traveling on the top . . . ” He undid the ring, pulled the tape straight, slowly turned his right hand until the tape was twisted 180 degrees, and brought the two adhesive ends back together. “Then at some point, as you’re going along the smooth side, you’ll realize that you’ve crossed over to the adhesive side and entered the inside of the world.”  “A . . . Möbius ring,” I said.  “So you already know.” X laughed and tossed the ring of tape into the trash. “I just wanted to tell you that disasters aren’t necessarily bad.”  “You mean . . . quadriplegia?”  “As a doctor, I’d say you’re lucky that your head survived.”  “Thanks . . . for your . . . reassurance.”  “Cheer up.” He stood, came to my side, then said as if declaring a prophecy, “It’s only the beginning.”  2. Auxiliary Body  I took my first step.  The pressure beneath my feet made my scalp tingle, though I knew only the tingling in my scalp was real.  This was the new product that the hospital had recommended to me. The “auxiliary body” was the latest in virtual reality technology; a microchip implanted in my cerebral cortex mapped the sensory experiences of a human-sized robot into my brain. In other words, I am controlling the robot with my head, the only sentient part left of my body.  “They’ll cultivate your skin cells in the lab and attach them to the outer shell,” the insurance agent said to me. “That way, as you walk down the street, people won’t even realize that you’re using an auxiliary body; you can return to your normal life.”  This body—I saw through it, heard through it, smelled through it. I bought a cup of coffee, then sat under a tree and watched people pass by. I could even feel the delicate warmth of sunlight on my face. I felt the coolness of the wind against my arms; I wanted to turn back, but then I woke up.  The real me only had a pillow.  X thought the free auxiliary body was the insurance company’s way of saving money: “They want you to take care of yourself; a robot is much cheaper than a full-time nurse.”  It was true. I closed my eyes again, returning to the room through the auxiliary body. I fed myself, brushed my teeth, washed my face, repositioned my body to prevent bedsores, uncovered the bed to change my diaper. It was more tedious than taking care of a dog, but I was happy doing it, because even if I only had my head, I could still take care of myself. I had dignity.  X said, “You’re only missing a job.”  I thought that was a good point. I had already gone through specialized nurse training so I could use my auxiliary body to take care of myself, so I asked X if I could work at his family clinic. He agreed. “Your salary is your medical expenses,” he said to me bluntly. “Other than that, I’ll also give your robot a charging stand.”  Just like that, I started a new life on the adhesive side of the Möbius ring. It was hard at first, but I gradually got used to it, to the point where I felt like this was my original life. X still paid me a considerable salary, so I started going out and flirting with women, going on vacations, and went to medical school. Using the auxiliary body was almost easier than using my original body. I could go to Hawai‘i and rent an auxiliary body with a six-pack, muck about until late, get out of bed, and go back to the charging stand, then start again from another auxiliary body in the university library. Every time I had to take care of my real body, I would pretend to go to the restroom, then quickly switch to the auxiliary body in the clinic: check medication, turn my body and pat my back, make sure the blood pressure and heartbeat on the monitor were normal.  “I have a very strange feeling,” I said to X. “That accident freed me from the shackles of my flesh and got me closer to freedom.”  X laughed and shook his head. “You’re still far off.”  “What makes you say that?”  “Though you’ve received your medical license, you still have to return to your body every four hours,” he said.  “Do you know some other way?” I asked.  “Of course,” he said. “Abandon your body.”  3. Klein Bottle  I stood by the operating table and took one last deep breath.  X had asked me what role I’d like to play during this operation: the surgeon, the surgeon’s assistant, or the unadulterated patient?  For a long time, I wasn’t sure if I had the courage to decapitate myself with my own hands. But X had another way of looking at it: he said the part I was cutting off was my useless body. “Don’t decide on what you’re removing by its size—you have to consider instead which part you’re throwing away.”  All the instruments were ready. I had already rehearsed the operation ten thousand times in my mind, but as I stood there for real, I still felt doubt. My head was directing my auxiliary body to cut off my real body. This auxiliary body was specialized for medical purposes. Its fingers wouldn’t tremble, and even if it lost its neural connection, it would simply lock all motions. X stood beside me; if something happened, he’d take the scalpel from my hand. I leaned in and watched as the blade inched toward my pale skin. Beneath my skin were my anterior jugular vein, trachea, larynx, and epiglottis; my carotid arteries, internal, and external jugular veins were to both sides. They were just like the textbook diagrams I had studied. Every step was quiet and methodical; all the blood vessels were linked to the channels of the apparatus. The machine extracted all the remaining blood in my body as a reserve. Beneath layers of muscle was the cervical vertebra. As I handled the spinal cord, I felt some vertigo, but I shook it off. After that, the rest was trivial. After it was all done, I stopped, opened my own eyes and, for the last time, met the gaze of my auxiliary body.  “Good night,” I said to myself.  X and I stored my head in the medical depository together. The depository was enormous, tens of thousands of square feet in area; the mechanical hand rushed to store my tiny head in its designated cubby. The monitors around us indicated the health status of every “person.”  “Your head is here too, right?” I asked X.  He shrugged and didn’t reply. Instead, he directed me to the controls in the middle of the room. A strange bottle stood there. Its neck curved toward its interior, and its body was suffused with a pea-green glaze. It looked valuable.  X said, “Since you know about the Möbius ring, you’ve probably also heard of this.” He placed his hands on the “bottle” before it became transparent. I realized then that it was a hologram. X continued, “Look here—the mouth is connected to the bottom of the bottle, so this is an impossible object. It’s—”  “A Klein bottle,” I said, finishing his statement.  “Well, you know.” He laughed, then snapped his fingers. An ant appeared inside the bottle. “If we were to put an insect inside the Klein bottle, it could travel upward along the neck of the bottle and unknowingly crawl to the outside. Because the inside of the bottle is also its outside—it can’t distinguish between the two.”  I originally thought that my soul was inside my body, but now it was on the outside: “ . . . You’re saying that I’m a Klein bottle.”  He nodded. “Yes, you finally understand.”  This was terrifying, even more terrifying than being on the adhesive side of the world. In this vast head depository, I was as tiny as an ant crawling on this continuous curved surface toward the outside. Until I broke free from my body and abandoned my Klein bottle.  “Don’t tell me this is all beginning again,” I said.  “Mmm . . . ” He folded his hands, turning off the hologram. “Have you heard of the white room?”  4. The White Room  The white room and the auxiliary body are complete opposites.  As an example of sensory duplication, what the auxiliary body observes is the exterior world, just as all humans do—sight, smell, sound, touch; the object producing these sensations is external to the body, and its inner workings are all based on instincts. When it takes a step, the auxiliary body doesn’t tell the user which bearings, levers, and screws it mobilized, nor does it inform me the amount of electricity the step consumed. It only tells me that I’m currently walking on an uneven mountain path during the autumn season.  The object of observation for the white room is the internal world.  The white room is a hollow sphere with inward-facing cameras spanning the outer shell so that any object inside it can be observed from all angles. At the same time, every facet of the object is visible to the white room. And with regards to this object, the person controlling the white room is like an omniscient god.  To link my consciousness to the white room, X made another modification to my head. We connected a specialized microchip to the visual cortex of the brain, as I was about to go from having a total of two eyes to a countless number. Even so, the first time we connected my consciousness to the white room, I was still immensely grateful to X for discarding my body, or else even if I was paraplegic, I probably could have vomited until I choked.  The expanse of white before me was borderless, because I was the border. Everything was different—it wasn’t reversed, wasn’t swapped, but was a complete inversion of inside and out. I was above, below, to the left, and to the right—I was on the outside, and the world was on the inside.  Ten days later, X put a small, black ball into the white room. It should have dropped in from the top, but I saw every facet of it at the same time, to the point where I couldn’t tell how many balls were actually in the room.  “Let me out—cut the connection, I’m begging you!” I struggled, pleading, but X ignored my protests. It was a hellish ordeal, especially when he started to rock the black ball. I felt as if someone was drilling into my brain.  “Allow time to help you see it clearly,” X said.  I had no idea what he was saying.  “Focus on just one point,” X roared, “then slide around the room.”  Easier said than done! I endured a year’s worth of training before I could control moving around within the white room. At any point in time, my focus was on one image; I would let myself circle the object of observation like a photographer pushing a lens. The faster I slid, the more of the white room I could control. I finally understood the terrifying power the room had bestowed on me when the first living butterfly entered the white room. I could observe its scaly wings and the structure of its proboscis up close, and I could see its flight trajectory from afar; I could slow down time and watch as its abdomen contracted little by little, and I could speed up time and watch it age and die. It couldn’t hide from me.  X said, “It’s time for a human to enter the white room.”  A human!  “You must carefully choose the first person to enter the white room.” He gave me a long list of names. “This is very important; they will enter your soul.”  Lin Ke—what a wonderful coincidence. I stopped at that name; even now, I could recall the warmth of that name on the tip of my tongue.  The door to my white room opened wide, and a little girl entered. She wasn’t the person in my memory—this child was only four- or five-years old, but her every step imprinted on my heart the same as ever. I could practically hear the badum-badum, creating the illusion of my heart pounding against my chest. But I soon remembered that my heart had been discarded long ago.  She spun around once at a loss, then started to look for an exit.  “Daddy . . . ” She wept, raising her chubby hands.  X—I was so anxious that my voice trembled—let her out!  No, he said. You manage that!  Before I realized what I was doing, an auxiliary body entered the white room—it was me.  My auxiliary body lifted her. She looked at me doubtfully, then wailed even more loudly, almost to the point of screaming. The sound scared me. I set her outside, then closed the door, cutting off the source of the sound.  . . . I’ll never forget those seconds of silence. That was the first time I’d used an auxiliary body to observe the white room, and it was also the first time I used the white room to observe an auxiliary body. I reached out and wanted to touch the invisible boundary between the two, but I touched nothing. If someone were to recreate this scene as Michelangelo’s “The Creation of Adam,” then as my auxiliary body reached out a finger, God—the white room still didn’t have a physical hand.  “Dammit!” I heard X swear, “You can’t use the auxiliary body and the white room simultaneously yet!”  I soon understood why. The two overlapping fields of vision caused extreme vertigo, then a terrible migraine as if someone were hammering against my head while a strange creature in my head was trying to force its way out.  X cut all the connections. I was thrust back into long-forgotten darkness, an almost-eternal tranquility—I seemed to have heard someone say, “Good night.”  5. Möbius Space-time  X said I slept for a long time.  I guess that accident damaged my brain, but the supplementary computer in the white room perfectly complemented the gaps in my memory. Sometimes I even felt like it was more familiar with my past than I was, as if everything had long been recorded already. My next lesson was to create a physical world within the white room. “This is the reason why the white room exists. It’s also your new job,” X said. “Let’s begin by recreating a little log cabin.”  So I recalled that house. It was built on a pile of rocks by the sea and had a dark brown roof and bright red walls. The lower level had an entrance hall, two bedrooms, and a bathroom; the second floor had a living room, dining room, and a kitchen. The fireplace was ornamental, but the hot air would always warm it up—if you opened the windows, the peaceful Norwegian fjords were right there.  “All the details,” X emphasized.  So I hung up photos of the aurora again, filled the cupboards with tableware and glass cups, put red wine, butter, milk, and honey into the refrigerator, and spread out a thick, mohair rug on the floor. Not long after the little log cabin was finished, Lin Ke and her parents came to visit and stayed in the little log cabin I had built. She had grown up and was now a young woman playing on her phone. As for the white room, I was in charge of the heat, the electricity, and the facilities. Lin Ke liked to say to thin air, ‘Open the curtains.’ Then I’d hurriedly let her see the constellations outside.  Wow! She’d lean against the window frame and marvel.  I improved quickly, soon constructing a number of log cabins, then a fishing village, then even an entire town. I flitted between every house and every road; I inspected the flow of every pipe. Other than the sun and the clouds, everything was under my control. A few more years passed. With the help of the computer, I could now simultaneously control the two fields of view and let my auxiliary body enter my village. I could fix the flaws of the white room through my own experience.  I polished my world and brought it closer to perfection. One day, X came. That was the last time I saw him. We met at a fishing village at the edge of the white room; that place was closest to the end of the world to me.  “This is a lot like the place where I met you,” he said.  “I modeled it off of there,” I said. “Sometimes I think the world is just like a Möbius ring; I’ve taken a long detour on the inside of the ring, but I’m finally back to the beginning.”  “Have you ever thought about the possibility,” he said as he looked at me, “that perhaps time is a Möbius ring?”  I repeated absently, “Time?”  “To us, time is a straight line that stretches forward endlessly. But is it really like that?”  “It’s not?”  “A two-dimensional object in a Möbius ring won’t sense the twist in space because its world has only one plane. As three-dimensional beings, humans can perceive the fourth dimension through the experience of time, but we can’t sense the twists in it.” He paused, then added, “Unless . . . When we cross the adhesive side of time and return to our starting point on the smooth side, we discover that we’ve become someone else.”  6. The Beginning  More and more tourists were coming to my little town. The endless work was close to overwhelming me. Over the next few years, I never stopped perfecting the computer’s settings and used it to fulfill people’s requests—I wanted to be free from the burden of the white room.  I did it.  To celebrate, I ordered the latest auxiliary body. It could taste and feel pain, and it could eat and sustain injuries like humans. Then I went to the youth hostel in Stamsund—I knew that Lin Ke vacationed here every year.  But this time, she had a man with her.  A conceited fool. Lin Ke held his hand as if he were her entire world.  “I’d like to hitch a ride,” I said to them.  “Oh, of course,” he replied foolishly, “but I’m afraid I still don’t know your name.”  X, I said.  We had driven eighty kilometers along the seaside highway. Without a doubt, she’d picked the log cabin in the town of Å again. The two of them shared a room; I had a room to myself.  When I awoke, the sky was still dark. Lin Ke sat on the bench outside, her eyes brimming with tears.  “He keeps working overtime. If he’s not making phone calls, he’s sending emails,” she said. “He’s more attracted to his computer than to me.”  I comforted her to the best of my ability and talked until my voice was hoarse. When we returned to the cabin, I saw a cup of water on the dining table. I drank it; it was a sweet honey water. Then I heard the two of them talking—all right, this time they’ll make up, I thought. But then I heard her yelling, followed by the sound of him slamming the door.  She looked heartbroken, as if her whole world had fallen apart. I chased after his car, intending to ask what exactly he was up to.  “Get in.” He only said those two words to me.  I hopped into his rented Ford and planned to comfort him. Who knew that he’d gun it, the acceleration pinning my back to the seat. Clumsily, I buckled my seat belt, then grabbed on to the handle above the door.  “You should slow down; I’m serious . . . ”  He didn’t seem to hear me. He drifted across a winding road. To my left were cliffs; to my right was the sea.  I looked at him and suddenly understood everything.  I was X; the world we were in was a Möbius space-time.  Dark clouds bore down from between the mountains. Five minutes ago, the skies were still clear and boundless.    Originally published in Chinese in Science Fiction World, June 2016.    Translated and published in partnership with Storycom.   Gu Shi is a speculative fiction writer and an urban planner. A graduate of Shanghai’s Tongji University, she obtained her master’s degree in urban planning from the China Academy of Urban Planning and Design. Since 2012, she has been working as a researcher at the academy's Urban Design Institute.  Ms. Gu has been publishing fiction since 2011 in markets like Super Nice, Science Fiction World, Mystery World, and SF King. Notable works include “Chimera,” “Memory of Time,” and “Reflection.” In 2014, she won the Silver Award for Best New Writer at the Chinese Nebula (Xingyun) Awards. Currently, she’s working on her first novel, The Reign of Eternal Delight, an alternate history set in the court of an empress ruling in the dynasty founded by Wu Zetian, the first Chinese empress.", "text": "4420 words, short story\nMöbius Continuum\n0. The End\nFive minutes ago, the skies were still clear and boundless.\nThe moment dark clouds bore down from between the mountains, I knew we were done for. The quarrel couldn’t have been smaller; I don’t remember what exactly I did to make Lin Ke’s eyebrows twitch, but I knew she was angry. So I poured her a cup of honey water and set it on the tea table as a silent apology.\nBut X drank it instead.\nI hate to quarrel. When Lin Ke’s accusing finger was inches from my face, I turned and left that little log cabin. The North Atlantic wind hit me head-on, chilling me to the bone. I had not realized what my leaving meant to her. X chased after my car and tried to explain that it had been an accident. I only said two words to him: “Get in.”\nOnly one highway took us out of the village of Å—that place could have been the end of the world. After we had wound through three mountains, raindrops obscured the windshield; I saw the finality of our fate, realizing everything was done for. Our relationship was like a balloon: at first, there was only a deflated circle; we took turns blowing into the balloon, then carefully pinched the end shut—we couldn’t allow any air to leak. It filled and swelled until one day, perhaps the tiniest touch would make it burst. Then the entire relationship dissipated without a trace; all our effort would be meaningless.\n“ . . . You should slow down; I’m serious . . . ”\nX sounded nervous; he clung to his seat belt with one hand and grabbed the handle above the door with the other like a shrimp bracing for impact. Lin Ke and I had met him at a youth hostel in Stamsund—he was an old Chinese man in his sixties who spoke fluent English and was hitchhiking to his next stop. But the moment I saw him, I knew we would travel together. He introduced himself as X, as if he were an unsolved puzzle in an equation.\nI really should slow down. I glanced at my dashboard; the indicator read 160 kilometers per hour. This was a mountain path; to my left were cliffs, and to my right was the sea. Slower—I took a deep breath, then eased off the gas.\nI exhaled, relaxing my fingers at the same time. The car swerved, and by the time I tried to regain control of the vehicle, it was already too late. A sharp rock punctured the front left tire, followed by the screech of brakes. The rented Ford crashed into the mountain wall to the left, spun 180 degrees, flipped over the reflective guardrail, and tumbled down the cliff.\nThe indigo ocean flooded my field of view. I didn’t have time to feel terror; I utterly forgot my own existence and simply analyzed everything happening around me. I thought I might have hit my head, but didn’t feel any pain; I only felt a clamminess on my face.\nSo my blood is cold—that was my last thought.\n1. Möbius Ring\nHere’s something I never understood: The majority of people who experience a disaster describe their experience from a third-person perspective, as if they had witnessed the event. Yet that was exactly what I was doing: In a weak voice, I described everything I’d witnessed to the police officer—it was a winding road, I was going too fast, a rock punctured the tire, the car jerked and then crashed into the mountain wall, spinning and sinking into the sea. I didn’t tell him the other part: How the world spun as if a cameraman had flung the lens into a dryer. I was still processing what had happened when the window shattered, shooting tiny pearls of glass away from the car (and I even questioned why they didn’t fall into the car), before the ocean rushed in.\nAs I spoke with the police officer, X watched from the next hospital bed. He was in much better condition, only sustaining a few scrapes. Of course, if he hadn’t been so lucky, I wouldn’t have survived. The doctor said that I had broken my neck, that it was X who had dragged me out of the car and towed me to shore. He then stopped a passing car and called the police. The ambulance arrived twenty minutes later, which is the only reason why I’m now paralyzed but alive and in the hospital.\nYes, I couldn’t feel anything, as if nothing had ever existed below my neck.\nSoon, only X and I were left in the room. It was a bit awkward and I didn’t know how I should break the silence. I wanted to ask Lin Ke, but knew it wouldn’t be like in the movies, that we’d be all better after a good cry. She disappeared, as if she had never existed either. I mouthed a “thanks” to X, then closed my eyes. Darkness didn’t necessarily equal sleep; when I opened my eyes three hours later, X was still staring at me motionlessly.\nThis time, he spoke first.\n“When I was young, I was also in a serious car accident. As I lay in bed and stared at the ceiling, I felt like my future was nothing but shit.”\nHe took out a roll of Scotch Tape and fiddled with it.\n“Then someone comforted me by saying, ‘The world we live in is like a roll of tape: You’re always traveling on the smooth side. Even if you kept pulling the tape, you’d still only ever know the one side. You’d never understand that there’s another side, the adhesive one.’”\nHe tore a length of tape, formed a ring with it, and said as he pointed to the inside, “But if you ask me, this side is probably closer to the essence of our world—or perhaps the essence of this tape.”\nI rolled my eyes in response. If he weren’t the only moving thing in my field of vision, I would have definitely looked away.\nX didn’t seem to notice my expression. “But if we change how we stick the tape, rotating it, and you kept traveling on the top . . . ” He undid the ring, pulled the tape straight, slowly turned his right hand until the tape was twisted 180 degrees, and brought the two adhesive ends back together. “Then at some point, as you’re going along the smooth side, you’ll realize that you’ve crossed over to the adhesive side and entered the inside of the world.”\n“A . . . Möbius ring,” I said.\n“So you already know.” X laughed and tossed the ring of tape into the trash. “I just wanted to tell you that disasters aren’t necessarily bad.”\n“You mean . . . quadriplegia?”\n“As a doctor, I’d say you’re lucky that your head survived.”\n“Thanks . . . for your . . . reassurance.”\n“Cheer up.” He stood, came to my side, then said as if declaring a prophecy, “It’s only the beginning.”\n2. Auxiliary Body\nI took my first step.\nThe pressure beneath my feet made my scalp tingle, though I knew only the tingling in my scalp was real.\nThis was the new product that the hospital had recommended to me. The “auxiliary body” was the latest in virtual reality technology; a microchip implanted in my cerebral cortex mapped the sensory experiences of a human-sized robot into my brain. In other words, I am controlling the robot with my head, the only sentient part left of my body.\n“They’ll cultivate your skin cells in the lab and attach them to the outer shell,” the insurance agent said to me. “That way, as you walk down the street, people won’t even realize that you’re using an auxiliary body; you can return to your normal life.”\nThis body—I saw through it, heard through it, smelled through it. I bought a cup of coffee, then sat under a tree and watched people pass by. I could even feel the delicate warmth of sunlight on my face. I felt the coolness of the wind against my arms; I wanted to turn back, but then I woke up.\nThe real me only had a pillow.\nX thought the free auxiliary body was the insurance company’s way of saving money: “They want you to take care of yourself; a robot is much cheaper than a full-time nurse.”\nIt was true. I closed my eyes again, returning to the room through the auxiliary body. I fed myself, brushed my teeth, washed my face, repositioned my body to prevent bedsores, uncovered the bed to change my diaper. It was more tedious than taking care of a dog, but I was happy doing it, because even if I only had my head, I could still take care of myself. I had dignity.\nX said, “You’re only missing a job.”\nI thought that was a good point. I had already gone through specialized nurse training so I could use my auxiliary body to take care of myself, so I asked X if I could work at his family clinic. He agreed. “Your salary is your medical expenses,” he said to me bluntly. “Other than that, I’ll also give your robot a charging stand.”\nJust like that, I started a new life on the adhesive side of the Möbius ring. It was hard at first, but I gradually got used to it, to the point where I felt like this was my original life. X still paid me a considerable salary, so I started going out and flirting with women, going on vacations, and went to medical school. Using the auxiliary body was almost easier than using my original body. I could go to Hawai‘i and rent an auxiliary body with a six-pack, muck about until late, get out of bed, and go back to the charging stand, then start again from another auxiliary body in the university library. Every time I had to take care of my real body, I would pretend to go to the restroom, then quickly switch to the auxiliary body in the clinic: check medication, turn my body and pat my back, make sure the blood pressure and heartbeat on the monitor were normal.\n“I have a very strange feeling,” I said to X. “That accident freed me from the shackles of my flesh and got me closer to freedom.”\nX laughed and shook his head. “You’re still far off.”\n“What makes you say that?”\n“Though you’ve received your medical license, you still have to return to your body every four hours,” he said.\n“Do you know some other way?” I asked.\n“Of course,” he said. “Abandon your body.”\n3. Klein Bottle\nI stood by the operating table and took one last deep breath.\nX had asked me what role I’d like to play during this operation: the surgeon, the surgeon’s assistant, or the unadulterated patient?\nFor a long time, I wasn’t sure if I had the courage to decapitate myself with my own hands. But X had another way of looking at it: he said the part I was cutting off was my useless body. “Don’t decide on what you’re removing by its size—you have to consider instead which part you’re throwing away.”\nAll the instruments were ready. I had already rehearsed the operation ten thousand times in my mind, but as I stood there for real, I still felt doubt. My head was directing my auxiliary body to cut off my real body. This auxiliary body was specialized for medical purposes. Its fingers wouldn’t tremble, and even if it lost its neural connection, it would simply lock all motions. X stood beside me; if something happened, he’d take the scalpel from my hand. I leaned in and watched as the blade inched toward my pale skin. Beneath my skin were my anterior jugular vein, trachea, larynx, and epiglottis; my carotid arteries, internal, and external jugular veins were to both sides. They were just like the textbook diagrams I had studied. Every step was quiet and methodical; all the blood vessels were linked to the channels of the apparatus. The machine extracted all the remaining blood in my body as a reserve. Beneath layers of muscle was the cervical vertebra. As I handled the spinal cord, I felt some vertigo, but I shook it off. After that, the rest was trivial. After it was all done, I stopped, opened my own eyes and, for the last time, met the gaze of my auxiliary body.\n“Good night,” I said to myself.\nX and I stored my head in the medical depository together. The depository was enormous, tens of thousands of square feet in area; the mechanical hand rushed to store my tiny head in its designated cubby. The monitors around us indicated the health status of every “person.”\n“Your head is here too, right?” I asked X.\nHe shrugged and didn’t reply. Instead, he directed me to the controls in the middle of the room. A strange bottle stood there. Its neck curved toward its interior, and its body was suffused with a pea-green glaze. It looked valuable.\nX said, “Since you know about the Möbius ring, you’ve probably also heard of this.” He placed his hands on the “bottle” before it became transparent. I realized then that it was a hologram. X continued, “Look here—the mouth is connected to the bottom of the bottle, so this is an impossible object. It’s—”\n“A Klein bottle,” I said, finishing his statement.\n“Well, you know.” He laughed, then snapped his fingers. An ant appeared inside the bottle. “If we were to put an insect inside the Klein bottle, it could travel upward along the neck of the bottle and unknowingly crawl to the outside. Because the inside of the bottle is also its outside—it can’t distinguish between the two.”\nI originally thought that my soul was inside my body, but now it was on the outside: “ . . . You’re saying that I’m a Klein bottle.”\nHe nodded. “Yes, you finally understand.”\nThis was terrifying, even more terrifying than being on the adhesive side of the world. In this vast head depository, I was as tiny as an ant crawling on this continuous curved surface toward the outside. Until I broke free from my body and abandoned my Klein bottle.\n“Don’t tell me this is all beginning again,” I said.\n“Mmm . . . ” He folded his hands, turning off the hologram. “Have you heard of the white room?”\n4. The White Room\nThe white room and the auxiliary body are complete opposites.\nAs an example of sensory duplication, what the auxiliary body observes is the exterior world, just as all humans do—sight, smell, sound, touch; the object producing these sensations is external to the body, and its inner workings are all based on instincts. When it takes a step, the auxiliary body doesn’t tell the user which bearings, levers, and screws it mobilized, nor does it inform me the amount of electricity the step consumed. It only tells me that I’m currently walking on an uneven mountain path during the autumn season.\nThe object of observation for the white room is the internal world.\nThe white room is a hollow sphere with inward-facing cameras spanning the outer shell so that any object inside it can be observed from all angles. At the same time, every facet of the object is visible to the white room. And with regards to this object, the person controlling the white room is like an omniscient god.\nTo link my consciousness to the white room, X made another modification to my head. We connected a specialized microchip to the visual cortex of the brain, as I was about to go from having a total of two eyes to a countless number. Even so, the first time we connected my consciousness to the white room, I was still immensely grateful to X for discarding my body, or else even if I was paraplegic, I probably could have vomited until I choked.\nThe expanse of white before me was borderless, because I was the border. Everything was different—it wasn’t reversed, wasn’t swapped, but was a complete inversion of inside and out. I was above, below, to the left, and to the right—I was on the outside, and the world was on the inside.\nTen days later, X put a small, black ball into the white room. It should have dropped in from the top, but I saw every facet of it at the same time, to the point where I couldn’t tell how many balls were actually in the room.\n“Let me out—cut the connection, I’m begging you!” I struggled, pleading, but X ignored my protests. It was a hellish ordeal, especially when he started to rock the black ball. I felt as if someone was drilling into my brain.\n“Allow time to help you see it clearly,” X said.\nI had no idea what he was saying.\n“Focus on just one point,” X roared, “then slide around the room.”\nEasier said than done! I endured a year’s worth of training before I could control moving around within the white room. At any point in time, my focus was on one image; I would let myself circle the object of observation like a photographer pushing a lens. The faster I slid, the more of the white room I could control. I finally understood the terrifying power the room had bestowed on me when the first living butterfly entered the white room. I could observe its scaly wings and the structure of its proboscis up close, and I could see its flight trajectory from afar; I could slow down time and watch as its abdomen contracted little by little, and I could speed up time and watch it age and die. It couldn’t hide from me.\nX said, “It’s time for a human to enter the white room.”\nA human!\n“You must carefully choose the first person to enter the white room.” He gave me a long list of names. “This is very important; they will enter your soul.”\nLin Ke—what a wonderful coincidence. I stopped at that name; even now, I could recall the warmth of that name on the tip of my tongue.\nThe door to my white room opened wide, and a little girl entered. She wasn’t the person in my memory—this child was only four- or five-years old, but her every step imprinted on my heart the same as ever. I could practically hear the badum-badum, creating the illusion of my heart pounding against my chest. But I soon remembered that my heart had been discarded long ago.\nShe spun around once at a loss, then started to look for an exit.\n“Daddy . . . ” She wept, raising her chubby hands.\nX—I was so anxious that my voice trembled—let her out!\nNo, he said. You manage that!\nBefore I realized what I was doing, an auxiliary body entered the white room—it was me.\nMy auxiliary body lifted her. She looked at me doubtfully, then wailed even more loudly, almost to the point of screaming. The sound scared me. I set her outside, then closed the door, cutting off the source of the sound.\n. . . I’ll never forget those seconds of silence. That was the first time I’d used an auxiliary body to observe the white room, and it was also the first time I used the white room to observe an auxiliary body. I reached out and wanted to touch the invisible boundary between the two, but I touched nothing. If someone were to recreate this scene as Michelangelo’s “The Creation of Adam,” then as my auxiliary body reached out a finger, God—the white room still didn’t have a physical hand.\n“Dammit!” I heard X swear, “You can’t use the auxiliary body and the white room simultaneously yet!”\nI soon understood why. The two overlapping fields of vision caused extreme vertigo, then a terrible migraine as if someone were hammering against my head while a strange creature in my head was trying to force its way out.\nX cut all the connections. I was thrust back into long-forgotten darkness, an almost-eternal tranquility—I seemed to have heard someone say, “Good night.”\n5. Möbius Space-time\nX said I slept for a long time.\nI guess that accident damaged my brain, but the supplementary computer in the white room perfectly complemented the gaps in my memory. Sometimes I even felt like it was more familiar with my past than I was, as if everything had long been recorded already. My next lesson was to create a physical world within the white room. “This is the reason why the white room exists. It’s also your new job,” X said. “Let’s begin by recreating a little log cabin.”\nSo I recalled that house. It was built on a pile of rocks by the sea and had a dark brown roof and bright red walls. The lower level had an entrance hall, two bedrooms, and a bathroom; the second floor had a living room, dining room, and a kitchen. The fireplace was ornamental, but the hot air would always warm it up—if you opened the windows, the peaceful Norwegian fjords were right there.\n“All the details,” X emphasized.\nSo I hung up photos of the aurora again, filled the cupboards with tableware and glass cups, put red wine, butter, milk, and honey into the refrigerator, and spread out a thick, mohair rug on the floor. Not long after the little log cabin was finished, Lin Ke and her parents came to visit and stayed in the little log cabin I had built. She had grown up and was now a young woman playing on her phone. As for the white room, I was in charge of the heat, the electricity, and the facilities. Lin Ke liked to say to thin air, ‘Open the curtains.’ Then I’d hurriedly let her see the constellations outside.\nWow! She’d lean against the window frame and marvel.\nI improved quickly, soon constructing a number of log cabins, then a fishing village, then even an entire town. I flitted between every house and every road; I inspected the flow of every pipe. Other than the sun and the clouds, everything was under my control. A few more years passed. With the help of the computer, I could now simultaneously control the two fields of view and let my auxiliary body enter my village. I could fix the flaws of the white room through my own experience.\nI polished my world and brought it closer to perfection. One day, X came. That was the last time I saw him. We met at a fishing village at the edge of the white room; that place was closest to the end of the world to me.\n“This is a lot like the place where I met you,” he said.\n“I modeled it off of there,” I said. “Sometimes I think the world is just like a Möbius ring; I’ve taken a long detour on the inside of the ring, but I’m finally back to the beginning.”\n“Have you ever thought about the possibility,” he said as he looked at me, “that perhaps time is a Möbius ring?”\nI repeated absently, “Time?”\n“To us, time is a straight line that stretches forward endlessly. But is it really like that?”\n“It’s not?”\n“A two-dimensional object in a Möbius ring won’t sense the twist in space because its world has only one plane. As three-dimensional beings, humans can perceive the fourth dimension through the experience of time, but we can’t sense the twists in it.” He paused, then added, “Unless . . . When we cross the adhesive side of time and return to our starting point on the smooth side, we discover that we’ve become someone else.”\n6. The Beginning\nMore and more tourists were coming to my little town. The endless work was close to overwhelming me. Over the next few years, I never stopped perfecting the computer’s settings and used it to fulfill people’s requests—I wanted to be free from the burden of the white room.\nI did it.\nTo celebrate, I ordered the latest auxiliary body. It could taste and feel pain, and it could eat and sustain injuries like humans. Then I went to the youth hostel in Stamsund—I knew that Lin Ke vacationed here every year.\nBut this time, she had a man with her.\nA conceited fool. Lin Ke held his hand as if he were her entire world.\n“I’d like to hitch a ride,” I said to them.\n“Oh, of course,” he replied foolishly, “but I’m afraid I still don’t know your name.”\nX, I said.\nWe had driven eighty kilometers along the seaside highway. Without a doubt, she’d picked the log cabin in the town of Å again. The two of them shared a room; I had a room to myself.\nWhen I awoke, the sky was still dark. Lin Ke sat on the bench outside, her eyes brimming with tears.\n“He keeps working overtime. If he’s not making phone calls, he’s sending emails,” she said. “He’s more attracted to his computer than to me.”\nI comforted her to the best of my ability and talked until my voice was hoarse. When we returned to the cabin, I saw a cup of water on the dining table. I drank it; it was a sweet honey water. Then I heard the two of them talking—all right, this time they’ll make up, I thought. But then I heard her yelling, followed by the sound of him slamming the door.\nShe looked heartbroken, as if her whole world had fallen apart. I chased after his car, intending to ask what exactly he was up to.\n“Get in.” He only said those two words to me.\nI hopped into his rented Ford and planned to comfort him. Who knew that he’d gun it, the acceleration pinning my back to the seat. Clumsily, I buckled my seat belt, then grabbed on to the handle above the door.\n“You should slow down; I’m serious . . . ”\nHe didn’t seem to hear me. He drifted across a winding road. To my left were cliffs; to my right was the sea.\nI looked at him and suddenly understood everything.\nI was X; the world we were in was a Möbius space-time.\nDark clouds bore down from between the mountains. Five minutes ago, the skies were still clear and boundless.\nOriginally published in Chinese in Science Fiction World, June 2016.\nTranslated and published in partnership with Storycom.\nGu Shi is a speculative fiction writer and an urban planner. A graduate of Shanghai’s Tongji University, she obtained her master’s degree in urban planning from the China Academy of Urban Planning and Design. Since 2012, she has been working as a researcher at the academy's Urban Design Institute.\nMs. Gu has been publishing fiction since 2011 in markets like Super Nice, Science Fiction World, Mystery World, and SF King. Notable works include “Chimera,” “Memory of Time,” and “Reflection.” In 2014, she won the Silver Award for Best New Writer at the Chinese Nebula (Xingyun) Awards. Currently, she’s working on her first novel, The Reign of Eternal Delight, an alternate history set in the court of an empress ruling in the dynasty founded by Wu Zetian, the first Chinese empress.", "source": "https://clarkesworldmagazine.com/gu_09_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Möbius Continuum by Gu Shi, translated by S. Qiouyi Lu"}