{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tim Sullivan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "lGSsH/QufLvlqwIIh1O9pli20go=", "id": null, "license": null, "comments": "", "raw_text": "10780 words, novelette, REPRINT  Way Down East  “Season’s starting early, eh?” Laurent said, standing on the pier and scratching his gray beard.  “Why do you say that?” Donny asked, grunting as he hoisted a lobster trap onto the deck.  “Look at that fella coming out of the CVS.” Laurent nodded toward Water Street. “He look local to you?”  A blond young man in a business suit and sunglasses was leaving the pharmacy with a white plastic bag in hand, walking up the hill toward the Penobscot Hotel. He was about the same age as Donny’s son, early thirties, but Little Donny had seldom acted as solemn as this guy, even when he was in church.  “He’s part of the Gleezer’s security detail,” Laurent said.  “Is he?” Donny asked. “Guess I forgot all about that thing,”  “Did you, now?”  Donny took a momentary break. His back was hurting so much that he was beginning to think he was getting too old for this work. Too bad he didn’t know how to do anything else.  “That guy could be a tourist,” he said, ragging on Laurent, who’d repeated every rumor he’d heard since the visitor from Gliese 581c arrived on the island yesterday.  “Wonder what they bought?” said Laurent.  “Could be anything.”  “They don’t sell just anything in the drug store.”  “Course not. I meant anything they sell in the CVS, wise guy.”  “That ain’t what you said.”  “Well, I’ll just have to watch myself from now on,” Donny said. “Make sure it’s not too complicated for you.”  “Wicked,” Laurent said.  “Ain’t it, though?”  “See on TV how the Gleezer can roll around naked and get away with it?”  “It ain’t naked,” Donny said. “It’s got that elastic thing on.”  “You can see right through it.”  “So what? What is there to see?”  “Quite a lot, if you ask me.”  “No reproductive organs, is what I meant.”  “I know what you meant.”  “Let’s get these traps baited. We can’t stand here all day gawking at everybody who comes out of the drug store.”  “All day? Ain’t even been two minutes,” Laurent muttered, climbing over the gunwale.  “If we don’t get to work, we’ll never get this boat paid off,” Donny complained. “Leave it up to you, we’d never even get away from the pier.”  “Maybe we should call it a day. Take a look at those clouds coming in from the east,” Laurent said. “We go out now, we’ll get wet.”  “A little rain won’t melt us.”  They finished baiting the traps, and Donny untied the painter. He wound it up and tossed it into the lazarette as Laurent started the engine. For a moment, he stared at the rainbow trail left on the water in their wake. He was glad he couldn’t see it anymore once they got into open water and Laurent opened up the engine to churn up some foam.  They did run into rain on the way back, enough to make them don their slickers. But it cleared off pretty soon, and once they were moored at the pier again they busied themselves putting their catch into the live tank.  A lot of the eggs attached to the female lobsters were orange, which meant they were dead. It was something they saw more and more every year. After they separated the berried ladies to be thrown back, and plopped the boys into the tank, they took a breather.  “Damn, ain’t this boat a beauty, though,” Donny said, patting the fiberglass transom.  “She sure is,” Laurent said. “High bow, low topside aft, and she cuts through the water like a dream.”  “What’ll we name her, now that we finally got her?”  “I don’t know,” Laurent said. “How about ‘Swifty’?”  “Oh, come off it. That’s just plain stupid.”  “So what’s your big idea?”  “Don’t have one yet.”  “Well, I’d say ‘Swifty’ is better than ‘Don’t Have One Yet’.”  Donny sighed. Sometimes he wondered why he even bothered.  When they were finished at sunset, Laurent talked Donny into going to Salty’s for a beer. Donny argued that he should get home, but he knew Laurent was lonely nights since June left him, except when his daughters and their husbands and kids took the ferry over from the mainland. He ended up calling Beth on the cell and told her he’d be home in an hour or two.  They drove Laurent’s truck up the hill to Salty’s and found the parking lot nearly full.  “It’s Friday night, ain’t it?” Donny said.  “Good guess, Dick Tracy.”  They parked and went in, walking past the decorative fishing nets to join the crowd. The joint was jumping. A few summer people were already in town, and their well-heeled kids were hanging out and flirting with the locals, at least those old enough to drink or get their hands on phony IDs. The jukebox was thumping rap.  Donny and Laurent sidled up to the bar and took a couple stools.  Mike, the bartender, was wiping a glass. He had to shout to make himself heard over the music and the enthusiastic bellowing of the kids. “Hello, boys.”  “What’s the word, Mike?”  “Nothin’ much.” Mike put the gleaming glass next to the other clean glasses on the shelf. “What’ll you have?”  “Two Narragansetts,” said Laurent.  “I don’t want a Nastygansett,” Donny said. “Give me a Sam Adams.”  “Big spender.” Mike fetched two bottles and poured their drinks into two tall glasses, leaving a perfect head on each.  “You’re the master, Mike,” Laurent said, blowing a little foam off the top.  “That’s what they tell me,” Mike said. “See the Gleezer’s buddies in town today?”  “One of ’em, not fifty yards from the boat, before we went for our last jaunt.”  The song on the jukebox ended, and there was a lull before the next one started.  “I hear the Gleezer wants to go out,” Mike said, his belly hanging over the cedar bar as he moved closer to speak confidentially.  “Out where?”  “Out around the Bay.”  “Who told you that?”  “One of those Secret Service fellas traveling with it,” Mike said.  “Secret Service?” Donny said. “Is the thing running for president?”  “Nope,” Laurent said. “It wasn’t born in this country.”  That got a laugh.  “So how’d you meet Secret Squirrel?” Donny asked.  “He slipped in here for a quick one last night just before closing.”  “No kiddin’?” Donny had never thought of Secret Service agents having fun, the way they were always so serious when you saw them on TV.  “Would I kid you?”  Mike turned to attend to some other customers, and the music blared once again.  Donny and Laurent nursed their beers.  “I wonder how much they’re willing to pay,” Donny hollered.  “Huh?”  “For the Gleezer’s joy ride,” Donny said. “I wonder how much the government’s willing to fork out?”  “Secret Service probably arranged a cruise already.”  “Think so?”  “Well, they’d want a luxury boat.”  “That might draw too much attention.”  “Well, if Mike heard it last night. . . . ” Laurent was thinking it over.  “Maybe we should go over to the hotel and look into it.”  “Nah, they’ve already chartered a boat.”  “How do you know that?”  “Common sense.”  “That’s something you’ve always been short on.”  “Look who’s talking, you red-headed dummy.”  They each took another pull from their beers.  “We do need to start paying off the boat,” Laurent shouted.  “That’s what I’m thinking.”  “I guess it can’t hurt to make an offer.”  “Guess not,” Donny said. “Glad you thought of it.”  Laurent downed the rest of his beer. “Me, too.”  “All right, first thing in the morning, then?”  “Why not go over there now?” Laurent said. “It ain’t even supper time yet.”  “I gotta get home.”  “Shouldn’t take too long,” Laurent said, up for an adventure now. “Frank Dunsmore’s workin’ the night shift.”  “Ain’t that just ducky?”  “Well, we know him. Now’s the time to go over to the hotel and ask him who the boss is.”  “Maybe the Gleezer’s the boss.”  “Let’s hope it talks our language then.”  Donny threw a few dollars on the bar and finished his beer. They rose from their stools.  “See you, Mike,” Donny said.  Mike waved at them, and they elbowed their way through the noisy crowd and out the door.  “Sure you’re okay drivin’?” Donny asked, glad to be away from the racket.  “I only had one beer.”  They got into the truck. “I’m thinking about the night you hit that bridge abutment in Rockland.”  “Thirty-five years ago, and you’re still talking about it.”  “You only had one before that little fender bender, as I recall.”  “I had more than one that night—’less you mean one six-pack.”  The two men laughed.  It didn’t take long to get to the hotel. In fact, it didn’t take long to get anywhere on the island. Donny didn’t mind, because he always felt lost when he went to Boston or Portland, or even Bangor. He was an island boy at heart, and he liked it that way.  The Penobscot Hotel had been built in 1896, with new wings added in the fifties and the eighties. It was elegant and expensive. Except for delivering lobsters to the kitchen loading dock, the only time Donny had been inside was his senior prom in 1973. He remembered smoking a joint in the men’s room with Laurent and some other boys with shag hairdos who were all long gone from the island now, except for one who taught at a nearby high school on the mainland . . . and Frank, the man they were going to see.  Laurent pulled into the parking lot. There were a few cars, an AIV, and some trailers and a TV van at the back of the lot, but nothing much. The public had gradually stopped paying attention since the initial buzz when the Gleezer splashed down, or the media would have been out in force. Only the likes of Laurent had kept up with the story until the Gleezer showed up on the island. Most people didn’t care all that much about it anymore, since the Gleezer had nothing to say and was kept out of sight most of the time. You could only look at the same two or three clips of it so many times.  Donny and Laurent got out without bothering to lock the truck. Nobody was going to steal from them here, because everybody either had money or were people they knew, including the Costa Rican chambermaids.  “We should have worn our tuxedos,” Laurent said as they approached the glass lobby door.  “Why, are we going to a costume party?” Donny asked, opening the door for his old buddy. “After you, Alphonse.”  “Merci, garçon.” Laurent went through his pockets as if searching in vain for a coin. “Quel dommage! J’ommet tous mes argent en l’autre pantalon!”  “You damn cheapskate frog.”  The olive green carpet was so spotless that Donny almost was afraid to walk on it. A couple of well-dressed people sat on well-upholstered chairs in the lobby, and he was pretty sure from their watchful attitude that they weren’t tourists.  The balding night manager was looking at a laptop as they walked up to him.  “Hello, Frank,” said Laurent.  Frank Dunsmore looked up and greeted them with the superior air Donny had always found so annoying. “Hello, Laurent. Long time, no see. How are you, Don?”  “All right.”  “You two want a room?”  “Funny fella,” said Laurent. “No, we just want to talk to whoever’s in charge of the Gleezer’s bunch.”  Frank looked amused, and Donny wanted to smack him. He saw Frank as a smarmy local boy who’d always sucked up to rich people so he wouldn’t have to earn an honest living as a lobsterman.  “I can’t just send you up to their floor,” Frank said with his customary self-importance. “They’ve got it cordoned off.”  “Can’t you talk to somebody up there?”  “Why? What do you want with ’em?”  “We got a business proposition to make.”  “Now, what kind of business would you two have with our distinguished guest?”  Laurent glanced at Donny, who shrugged in return. “We hear the Gleezer wants to go for a boat ride, and we’re willin’ to take it out.”  “Oh,” said Frank. “Who told you that?”  “Grapevine,” Donny said, before Laurent could answer.  “Have you two jokers seen our penthouse guest?”  “Only online and on TV,” Laurent admitted.  “Well, it’s one thing to see a picture of it, and it’s another thing seeing it live.”  “I guess so.”  “This is a very special time for the Penobscot,” Frank said, looking impressed with himself. “And for our island.”  “God bless America and the state of Maine, too,” Donny said. “Does that mean you ain’t gonna call up there, or are you planning to mess with us the rest of the night?” He was fed up with Frank’s superciliousness. “We got better things to do.”  Frank was taken aback. “All right, Don, don’t get your shorts in a bunch. I’ll call ’em, but don’t say I didn’t warn you.”  He got on the house phone and spoke to somebody.  “Couple of lobstermen have a boat to charter,” he said, among other things, including their names, which he repeated twice. He hung up after a minute and said, “You can go on up.”  “Thanks,” Laurent said.  “Just a minute,” Frank said. “I gotta go key the elevator or it won’t take you to the penthouse.”  Frank came out from behind the desk and led them to the elevator. He got inside with them and set it with a card, and then slipped out.  “Good luck, fellas,” he said as the door slid shut.  “What a jerk,” Donny said on the way up.  “Oh, he ain’t so bad,” Laurent said.  Donny watched the LED display, 1, 2, 3, and he was feeling pretty tense by the time they reached the penthouse.  “Here we go,” Laurent said, waiting for the door to open.  The delay made it seem like an awfully long time. At last it opened, loudly and irrevocably. A woman stood right in front of the door. She was dark and had short raven hair. She was very good-looking.  “Mr. Doyle and Mr. Therriault?” she said, adjusting a little electronic earpiece clamped to her left lobe.  “Yes, ma’am,” Donny said. “That’s us.”  “I’m Special Agent Hernandez,” she said.  “Nice to meet you,” Laurent said, offering his hand.  Donny shook hands with her, too. He’d never met a Special Agent before. He wondered if she spoke to the chambermaids in Spanish.  “Please put all your change and keys in this bin and step through the metal detector.”  The metal detector was behind her, and she stepped aside to let them go through. Laurent went first, followed by Donny. Special Agent Hernandez watched them as they picked up their keys and coins. So did two young men in suits down the hall, one of whom they’d seen coming out of the drug store that afternoon.  “Please come with me.” She turned and Donny watched her shapely calves flex as she led them through the penthouse suite. All the doors were closed but one.  The room she took them to was just like something in a movie, with windows on three sides so you could see the town’s lights and the white-capped water breaking on the rocks below.  “Nice,” Laurent said.  Donny didn’t say anything, embarrassed by his boots squishing.  “If you gentlemen will wait here,” the lady said. “Mr. Towson will be right with you.”  “Thank you,” Donny said.  “Help yourselves to the refreshments on the table,” she said, and then left them alone.  There were bagels, salmon, fresh fruit, bottled water, wine, and a coffee urn with cups and saucers, cutlery, and napkins. Laurent grabbed a banana, and Donny had a pumpernickel bagel, which he slathered with cream cheese using a butter knife. He bit into it and found it was as hard as a rock, but tasty. Both poured themselves some coffee into china cups and sat on the fanciest sofa Donny had ever seen in his life, holding their saucers in their laps.  “Imagine the kind of money it takes to rent this place,” Laurent said, looking around at the fancy furnishings and framed paintings on the walls.  Donny didn’t speak, because he was sure they were being monitored. He didn’t intend to say something stupid and blow this job.  Towson kept them waiting quite a while. When he finally appeared, he proved to be a trim man with thick, silvery white hair, in his late fifties, wearing a very expensive suit and a blue satin tie.  “Hi,” he said, extending a manicured hand. “I’m Jerry Towson.”  “Nice to meet you, Mr. Towson,” Laurent said, rising to shake his hand. “Laurent Therriault. This is Donny Doyle.”  Donny got up and shook with Towson, conscious of the dried chum blood under his fingernails and the smell of lobster battling with Towson’s cologne. Towson had a strong grip, though, and his gray eyes sized up a man in a hurry.  “I understand you gentlemen have a boat you’d be willing to charter for a day?” Towson asked, coming right to the point.  “Ayuh, a brand new Northern Bay 36,” Laurent said.  “Just got her this week,” Donny added.  “Do you have any objection to a thorough security check of your boat before the launch?”  “Nope,” Laurent quickly said.  Towson nodded at him, and then turned to Donny. “And you, Mr. Doyle? Do you have any objections?”  “I guess not,” Donny said, remembering that this had been his idea in the first place. “Long as nothing’s damaged.”  “I assure you we’ll be careful,” Mr. Towson said, showing his capped teeth as he smiled like a cable TV newsman. “Are there any questions?”  “Yeah, what, uh . . . ” Laurent hesitated.  “Please go on.”  “What do we do if there’s trouble?”  “Trouble?”  “Yeah,” Laurent said. “What if it runs out of the stuff it breathes, or something like that?”  “We’ll have a team there to make sure nothing goes wrong.”  “How many people?” Donny asked. “It’s only a thirty-six footer, you know.”  “Just three people, including me,” Towson said. “Is that too many passengers?”  “No, that’ll be all right,” Laurent said, glancing at his buddy.  “Fine,” Towson said. “How much do you charge for a charter cruise?”  “This’ll be the first one,” Donny said. “Make us an offer.”  “Five thousand dollars.”  Donny thought his jaw was going to hit his collarbone. “Uh . . . ”  “Yes, sir, that’ll be fine,” Laurent quickly said.  “Excellent,” Towson said. “Will a check be all right?”  “Long as it don’t bounce,” Donny said, recovering quickly from the shock.  Towson smiled. “We’ll have a cashier’s check for you tomorrow morning, and we’ll have the visitor at the dock at five o’clock sharp. After a routine security scan, we’ll be off.”  “You’ll find our boat moored right at the end of Water Street,” Donny said. “Can’t miss it. No name painted on her yet.”  “I’m sure you understand how important discretion is in this matter,” Towson said. “We ask only that you tell no one about it until after the visitor is safely ashore.”  “Okay,” Laurent said.  “Right,” Donny said.  “And just one more thing,” Towson said.  “Ayuh?”  “Are there any firearms aboard?”  “Just a Very pistol—you know, a flare gun,” Laurent said.  “Nothing else?”  “Nope,” Donny said, “we don’t shoot lobsters, we just trap ’em.”  Towson smiled. “Very good, gentlemen, you have a deal with the United States government.”  “Good enough for me,” Laurent said.  “And you, Mr. Doyle?”  “Sure,” Donny said. He was thinking about the money this could bring their way after the deal was done—television, online interviews, magazines. . . . It could turn out to be very profitable. People would want to ride on the Gleezer boat, and they’d be willing to pay for the privilege.  And even if he and Laurent didn’t make another penny off this deal, they could at least lay down a pretty hefty payment on the boat next month.  “When you said we can’t tell anybody,” Donny said to Towson, “does that include my wife?”  “Yes, I’m afraid so.”  Donny nodded. It would be hard to keep it from Beth, but it wasn’t unusual for a lobster boat to put out at five, so she wouldn’t be suspicious. He’d have a good story to tell her when he got home tomorrow, in any case.  “It’s a deal.”  They each shook hands with Towson to seal it.  “I have some things to attend to, gentlemen,” he said. “But feel free to linger here as long as you wish, and please help yourselves to food and beverages.”  “Can we take some goodies home with us?” Laurent asked.  “I’d rather you didn’t,” Towson said. “It might raise questions.”  “Well, I live alone nowadays,” Laurent said. “Nobody’s gonna question me.”  “Then I see no reason why you can’t take all you like. Good evening, gentlemen.”  He walked out of the room.  “And here I am with mouths to feed,” Donny said.  “I’ll save you some,” Laurent said, gathering up grapes, apples, and bagels, which he wrapped in napkins and stuffed into his coat pockets. He gripped a bottle of Cabernet Sauvignon in his meaty hand and started toward the door. “Give it to you when we come back tomorrow. Except for the wine, which I’m keeping.”  “The food’ll be stale.”  “Then don’t eat it,” Laurent said, as they left the panoramic view behind them on their way to the elevator. “See if I care.”  “You’re all heart.”  “Ayuh.”  Chewing on a grape, Laurent nodded at the two young men in suits as they waited for the elevator. The ride down seemed much faster. Laurent waved at Frank as he and Donny walked through the lobby.  “How’d it go?” Frank called to them, busting to know what had happened upstairs.  “Can’t talk about it, Frank,” Donny shouted back. “National security.”  In the parking lot, they looked up as a helicopter noisily flew over.  “Government or news?” Laurent said, spitting out a seed and popping another grape into his mouth.  “Don’t see what difference it makes.”  Laurent dropped Donny off at the house, looking out for wildlife along the way. Dark as it was with the birches all around, Donny noticed that a couple more shingles had fallen into the front yard as he walked up to the front door. He’d have to work on the roof this summer.  He heard the dog barking as he let himself in.  “Hello, Bert,” he said stroking the Lab’s yellow fur as he entered. “I almost had some treats for you, but no dice.”  “Did you get anything to eat?” Beth asked, coming out of the kitchen as Donny flung his coat over the newel post. He could hear the TV going in the living room.  “Ayuh.” He kissed her on the cheek, his face tickled by her long hair. She’d stopped coloring it lately, calling it her “gray badge of courage.” It wasn’t really all that gray yet. He liked the way it looked, long and feminine.  “How’s your back?” Beth asked.  “Aching a little bit, but I’m okay.”  “Little Donny called a short while ago,” Beth said. “He said he was sorry he missed you.”  “Did he, now?”  “Things are picking up for him,” Beth said, ignoring Donny’s sardonic tone. “He’s got a few gigs lined up and some time in the recording studio.”  “So he’s gonna be a rock star soon?”  “As long as he’s happy,” Beth said, looking at him with her green eyes.  Donny grunted as he sat on the bottom step and Beth helped him haul off his short boots. Bert’s tail counted time, whacking against the bottom step.  “I shouldn’t have had coffee,” Donny said, changing the subject.  “Since when do you drink coffee at Salty’s?”  He let the question pass as he stood up.  “I still have some of that Ambien Doctor Blaisdell prescribed,” Beth said. “That ought to put you out.”  “Ayuh.”  He took a bath and the pill, and he was ready to go to sleep an hour later. Beth joined him, lying down next to him in their queen size bed and rubbing his back for a few minutes.  “Everybody on the island’s talking about the Gleezer,” she said, pulling up the comforter and turning on her side to put out the lamp on the night stand.  “Day before yesterday nobody around here cared about it.”  “Kind of exciting, having it come here.”  “Kinda.”  “What do you suppose it wants?”  “Wants? What do you mean, baby?”  “Well, why this island of all the places on Earth?”  “Same reason as summer people come here, I guess.”  “For the rustic New England charm?”  They both laughed.  “Have you got something on your mind, Donny?”  “You know there’s never anything on my mind.”  “Oh, stop it.”  “It’s just that we’re gonna have a long day tomorrow.”  “Are you thinking about Little Donny?”  “Nothing I can do about him.”  Beth didn’t say anything. They’d been through it a thousand times. She believed that Little Donny was brave to be unashamed of the way he was, but Donny wondered if things might have turned out different if he had interested the boy in something besides playing the keyboard.  Beth snuggled up.  “Your nose is cold,” he said.  “Cold nose, warm heart,” she said. “Did you find orange berries on the females today?”  “Ayuh.”  “It bothers you, doesn’t it?”  “Well, sure it does,” Donny said. “What are we gonna do if the lobsters die off?”  She touched his hair. “We’ll get by.”  The Ambien was making Donny drift off, but he was thinking about tomorrow and what it might mean. He had to remind himself not to say anything to Beth about it.  And then he was asleep.  Beth was up before him, at quarter past four. She was making coffee, bacon, and eggs. Donny washed his face and came downstairs, trying to savor the delicious odors, but too worried about how things were going to go today to enjoy it much. He didn’t want Beth to notice his anxiety, though, so he talked about something he knew would prevent her from asking him any questions.  “Little Donny still got plans to marry Alan?” he asked.  “Oh, he mentions it every now and then,” Beth said, pleased to talk about their son as she cracked an egg and plopped its contents into the buttered pan.  “I know you wanted grandchildren,” Donny said.  “If they get married, maybe they can adopt.”  It wouldn’t be the same, he thought, but he kept it to himself.  They ate in silence.  Laurent picked him up at twenty minutes to five, to make sure they’d be at the pier in plenty of time. Rolling down his window, Laurent patted Bert on the head, the dog’s paws resting on the pickup’s side panel.  “Something wrong with the heater?” Donny inquired after he got in.  “Give it a chance,” Laurent replied.  “We’ll be out on the water before it warms up in here.”  “Ain’t it awful?”  It was still dark, but as they bumped down the hill from Donny’s house, the Atlantic was starting to reflect a quicksilver hint of light.  “Think the Gleezer’s sun looks different than ours?” Donny asked.  “That’s what they claim,” Laurent said. “It’s red all the time, not just at sunrise and sunset.”  “All the time? No kiddin’?”  “No kiddin’.”  “So how does there happen to be life on its planet?”  “Well, there’s water, and I guess wherever there’s water there’s life.”  As usual, Laurent drove right onto the pier. Donny thought it was kind of nice that they wouldn’t have to tote any traps today if they didn’t feel like it. They were just going to take a little cruise out onto the bay with the Gleezer. He remembered movies about space monsters and alien menaces, and it made him chuckle.  “Are you losin’ it?” Laurent said.  “Well, you gotta admit this is kinda weird, Laurent.”  Laurent laughed, too. “Can’t deny it.”  They climbed aboard and got ready for the imminent arrival of the Gleezer’s team.  A massive, black AIV—the one they’d seen in the hotel parking lot—rolled down Water Street and parked itself behind Laurent’s truck right on time, five o’clock sharp. Excepting its pristine paint job, it looked like it ought to be patrolling the streets of a war zone. Its headlights illuminated the boat and hurt Donny’s eyes.  He didn’t like having Laurent’s truck blocked off, but they weren’t going to be using it until they got back.  Towson got out of the AIV and walked toward their boat. He looked as fresh as a daisy, wearing an overcoat, his silver hair glistening from the morning mist. He had so much hair that Donny wondered if it was plugs or a wig.  “Good morning, gentlemen,” Towson said, as two young Secret Servicemen climbed aboard and looked the boat over for Weapons of Mass Destruction. This morning, they were dressed in jeans and jackets, the guy they’d seen yesterday wearing a Cubs cap over his blond hair and the other one wearing a knit watch cap. Donny hoped they wouldn’t fall into the head when they went below deck.  “Morning,” Laurent said, sniffling a bit.  “Coming down with a cold, Mr. Therriault?”  “Just allergies.”  “So it’s in the AIV?” Donny asked. “The, uh . . . visitor?”  “Yes.” Towson glanced over his shoulder. “We’ll lift it out in its environmental tank and put it on the deck whenever you’re ready.”  “No time like the present,” Donny said.  “I agree, but let’s give my men time to finish the security check first.”  A couple minutes later, they were satisfied.  Towson turned and pressed buttons on a remote. The back door of the SUV opened. Appendages that looked like they were assembled from a giant Erector Set swung a polarized glass tank over the roof and hood, depositing it on the pier. It was about the size of a coffin.  “Pretty nifty,” Laurent said.  “Do we have to haul it aboard ourselves?” Donny asked.  Towson shook his head and directed his two men to do it. They grasped handles on the sides of the glass tank and lifted it without much strain.  “The lady didn’t come?” Laurent asked, as the two Secret Service agents wrestled the tank aboard. The boat bobbed under their weight as they set it on the deck.  “Special Agent Hernandez?” Towson said. “No, I’m afraid not. She’s in charge of the team back at the hotel.”  “Too bad for you, Laurent,” Donny said. “I could tell she likes you.”  “Funny fella,” Laurent replied. “You ought to be writing for Conan O’Brien.”  “It’d pay better.”  “Well, Special Agent Hernandez is a pretty woman,” Laurent said, “wouldn’t you say, Mr. Towson?”  “I would,” Towson replied.  “Are you coming with us?” Donny asked.  “Yes, I am,” Towson said. “Why do you ask?”  “You might get your feet wet.”  “They’ve been wet before,” Towson said.  Towson reached under his coat, and for a moment Donny thought he was going to show them his handgun. Instead, he pulled an envelope from his inside breast pocket.  “Your check,” he said.  Laurent and Donny exchanged glances. Donny took the envelope, because it seemed that Laurent didn’t want to.  “Feel free to look it over,” Towson said, smiling, “if you don’t trust the federal government.”  “You never know these days,” Laurent said.  They all laughed.  “I guess it’ll be all right,” Donny said. “After all, we know where you’re staying.”  Another laugh. Maybe, Donny thought, this wouldn’t be such a bad day . . . if it didn’t rain.  “This is a fine looking vessel,” Towson said, turning his attention to the boat.  “Built this year,” Laurent said.  “AI steering system?”  “No, we couldn’t afford that. She’s got Raytheon and old-fashioned GPS, but we hardly ever need it, so. . . . ”  “I guess you know your way around this bay pretty well.”  “Ayuh, we’ve been doing this all our lives,” Donny said, suspecting that he was being patronized.  “Let’s get on board,” Laurent said, deftly hopping over the gunwale and offering a hand to Towson.  Donny untied the painter and climbed aboard as Laurent started her up. They put out slowly.  “Are we going to see the . . . ” He almost said “the Gleezer,” but caught himself. “ . . . visitor?”  “Yes.”  “Mind if we pull up some lobster traps while we’re out?” Laurent asked.  “I don’t see any reason to object.”  “All right, then. Just a few to keep us busy.”  The sun was emerging over the horizon, breaking into a million shimmering red lights on the water.  No matter how many times he saw it, Donny never got tired of it.  “Lovely,” Towson said, as they got away from shore and gathered speed. “Just lovely.”  “Grows on you,” Laurent said.  The steady sound of the boat’s diesel engine was overcome by the rattling whir of a helicopter passing overhead.  “One of yours?” Donny asked.  “In case of emergency,” Towson said.  “If a tanker comes too close, will the chopper blow her out of the water?” Donny drily asked. “That would be something to tell the grandkids about.”  “You have grandchildren, Mr. Doyle?”  That question took all the fun out of the conversation. Donny decided to clam up. He had the distinct feeling that Towson knew everything there was to know about him, right down to what he ate for breakfast. For a few minutes he’d been fooled into thinking this guy was just like anybody else.  He watched for buoys marking their traps.  Before he spotted any, Towson went into the pilot house and ordered Laurent to stop the boat.  When the engine cut off, it took a moment for Donny to hear anything, but then the familiar sounds of the waves lapping on the hull and the gulls cawing overhead slowly came to him. All he was thinking of was that he was about to see the Gleezer.  The two Secret Servicemen stood by while Towson pulled a cylindrical key out of his pocket and inserted it into a slot in the tank’s lid.  The side of the tank, rather than the lid, slowly opened. It made a ramp leading to the deck. Donny thought there would be a lot of gadgets inside, but he couldn’t see much other than the dark mass of the tank’s occupant.  The Gleezer took its time coming out.  It was wearing its protective sheath, just as Donny had seen on TV. It sort of squirmed and flopped onto the deck, almost like a fish out of water. Alarmed, Donny glanced at Towson, but the government man seemed calm.  Laurent came out of the pilot house. He was spellbound by the Gleezer.  “Is everything all right?” Laurent asked in a tone barely above a whisper.  “There’s no cause for concern,” said Towson.  “It doesn’t look all right,” Donny said. Not only that, but he could smell it right through its clear covering, and he didn’t care for the odor. It wasn’t like anything he’d ever smelled before.  The Gleezer slithered a few feet across the deck. Donny tried to think of something to compare its appearance to. A centipede, a bug, a lobster, even . . . but none of these analogies would do. It had quite a few appendages, maybe a dozen, but they didn’t look like the limbs of any animal he’d ever seen. There were two humps on either side with kidney-shaped artificial lungs in them, supplying the atmosphere the Gleezer needed to survive on Earth. Two transparent tubes connected the inflating lungs to the tank.  He knew that the lump on its back was where its brain was located, but he had no idea if it could see, smell, hear, or feel—at least not the way humans and animals did.  Frank had told the truth, for once in his life. It was one thing to see a picture of the Gleezer, and another thing to see it for real. It was only four feet away from Donny, and the sight of it made him want to jump into the drink.  He stood on the lazily yawing deck, his beloved Bay all around him, the early morning light dazzling on the dappled water. He looked away from the Gleezer and toward the sunrise until it hurt his eyes.  “You get used to its appearance,” Towson said.  “I don’t think I ever could,” Donny said. “It’s ugly.”  “You ain’t no prize yourself,” Laurent cracked from under the fly bridge.  “Nobody asked you.”  Towson frowned. “I know the visitor’s different, but it’s intelligent, and it’s sensitive.”  “Sensitive?” Donny scoffed.  “In other words, shut up,” Laurent said.  Donny turned on Laurent. “Don’t tell me to shut up, you dumb Canuck.”  “Gentlemen, please,” Towson said. “The visitor can sense your anger.”  “It can?” Laurent asked.  “Yes, it’s empathic.”  “Like on Star Trek?” Laurent asked.  “Well, no,” Towson explained. “In the same way that you and I might sense that an animal’s in pain.”  “In pain?” Donny demanded. “Who’s in pain?”  Towson left the question unanswered.  Donny looked astern toward the island. It was his home, a little piece of rock jutting out of the Atlantic. Right now he wished he was back at the house, in bed with Beth. For the first time in his adult life, he was beginning to feel a little seasick.  “You all right, Donny?” Laurent asked.  “Course I’m all right.”  “You’re looking a little pale.”  Donny grabbed a line and attached it to a metal lobster trap, watching the Gleezer peripherally. Slits in its pulsing hide opened and closed, observing him in some unknowable way, and the Secret Service detail watched them both through their human eyes.  Get a hold of yourself, man. This was your idea. It’s just a job of work. It’ll all be over in a few hours.  “If it’s all right with you, Mr. Towson, could we go check on some traps now?” Laurent asked.  “Certainly,” Towson said.  Laurent went into the pilot house and started up the engine again.  Towson approached Donny. “Have you ever been in the military, Mr. Doyle?”  “Navy.”  “Combat?”  “No.”  He expected Towson to ask more questions, but he didn’t.  “So what are you trying to say?” Donny said, angrily turning to face Towson. “You think I’m a coward or something?”  “No, sir, I don’t think that,” Towson said.  “Just let me do my work, and you and your boys and that thing enjoy the ride, and we’ll be all right.”  “Fine,” Towson said. He backed off, and grabbed the lanyard to steady himself on the slippery deck. The water was becoming choppier now that they were moving farther out to sea.  “You men have enviable lives,” he heard Towson say to Laurent a few minutes later.  “We like it,” Laurent said.  Donny snorted, unnoticed by the others. Laurent’s wife had left him, his daughters lived out of state, he was over fifty, and he had nothing but time on his hands when he wasn’t working. What did he like so much about his life? If he was so happy, why did he keep Donny out at night instead of going home and being happy by himself?  Funny thing was, though, that Donny didn’t mind hanging out nights at Salty’s all that much. He could usually be talked into it. Nevertheless, he wished he’d gone home last night, instead of going to the hotel.  He kept thinking of the Senior Prom, and how pretty Beth had looked that night all those years ago when they danced in the hotel ballroom. It wasn’t just the joint and the beers that had made him see her that way, either. She was a pretty one. When he looked at her now, he could still see that fresh young girl through the wrinkles and gray hair.  He sensed that the Gleezer was moving, undulating along the deck a few inches at a time. There wasn’t much room, but he still didn’t want to be near it, not if he could help it.  He bent over, feeling a twinge in his lower back, and stepped into the pilot house.  “What can I do you for?” Laurent asked.  “I’ll take the helm for a while,” Donny said, “if you don’t mind.”  Laurent relinquished the wheel. “There’s the buoy straight ahead. You ain’t gonna be driving for long.”  “I just want to get away from that thing.”  “Ever occur to you that it might have feelings?” Laurent said, ducking his head to go out on deck.  Donny would have sneered, but Laurent was gone already, and he didn’t really feel like sneering anyway. He knew it was likely that the Gleezer had emotions, but he couldn’t believe it after seeing the ugly beast. He could more easily believe a lobster would send him a valentine.  But Laurent had a point. The Gleezer had come across space from billions of miles away, so it had to be intelligent. In fact, it was probably a lot smarter than him.  That wasn’t saying much, he mused, as he cut the engine and steered the boat toward the buoy. He glanced over his shoulder through the hatch and saw the Gleezer throbbing like a clump of shrink-wrapped, spiny seaweed on the deck.  He was beginning to regret his show of revulsion toward the Gleezer and snapping at Towson. He started thinking about Little Donny, and realized that he had allowed himself to feel like less than a man because his son was gay. That was no way to be, and he knew it, but he couldn’t help it.  It was hard to see through the windscreen, for some reason. Donny tasted salt water on his lips, even though there was no spray inside the pilot house. He wiped his eyes with the back of his hand. He didn’t want to cry. Why couldn’t he stop it? What was wrong with him?  He sensed someone moving behind him, and glanced over his shoulder to see who it was.  It was the Gleezer.  Donny turned around to see it crawling across the deck toward the pilot house.  “What does it want?” he called out in a near panic.  Towson called out to him. “The visitor’s just curious.”  “Is it coming in here?” Donny shouted.  “No, I don’t think it has that intention,” Towson said in a reassuring tone.  The Gleezer kept inching toward the hatchway. Donny started feeling claustrophobic. He turned back toward the wheel, but he could see the Gleezer reflected in the glass, the morning sun glistening on its sheath. It was nearly five feet long, a foot and a half wide, and maybe two feet high, counting the brain hump that protruded from the top, and it was a mottled gray-green, almost black, with all those spines and spindly legs sticking out.  Did it see him? He was certain it knew he was there, but what did it think he was? Did it understand what he was, what it meant to be a man? To suffer life’s disappointments and work every day just to grow older, closer and closer to death every minute? No, of course it didn’t. How could it know what a human is?  It stopped short of coming inside and lay on the deck, quivering. He thought it made a sound, but then he realized that was just a gull screeching in the distance.  The two younger Secret Servicemen, both big guys, came over and lifted the Gleezer up.  “It wants to see more of the bay,” Donny said, feeling a bit stupid. “That’s all.”  “Yes,” Towson said. “That’s all.”  “It sure didn’t come out here to look at your boots, Donny,” Laurent said as he dropped the anchor.  “But it could have seen the Bay from the shore.”  “Not the same thing.”  “Well, I know that, Laurent,” Donny said, getting an idea. “Hey, we got that net. We could put the Gleezer in and lift him up.”  “That’d be better than you fellas just holding him like that,” Laurent agreed. “It’s up to you, Mr. Towson.”  “You don’t think it could be dangerous?” Towson asked.  “Oh, no. We’ve got a winch, so we can suspend the Gleezer right over the water if he wants.”  “The Gleezer?” Towson said. “Is that what you call our visitor?”  “Ayuh,” Laurent said. “I hope he doesn’t mind.”  “No, I don’t think so,” Towson said after a pause, as if he’d been listening to someone they couldn’t hear.  “Pretty good-natured, is he?”  “As far as we know,” Towson said. “But the visitor isn’t a he. Its gender is indeterminate.”  “Oh. Well, we promise we won’t do anything untoward that could cause an interstellar incident,” Laurent said.  Towson smiled. “You’re a man of hidden depths, Mr. Therriault.”  “Just like the sea around me,” Laurent said.  Donny wondered if Towson was insulting him by implication. Did he think Donny Doyle had no depths? Well, maybe it was true. A man who held a grudge against his own son because of something the boy couldn’t help was a shallow man, and he had to admit that to himself. He’d been through it in his mind many, many times, and he knew Beth loved Little Donny even though he’d never give her a grandchild. If Little Donny and his boyfriend could adopt a kid she’d be just as happy as if he were straight, married to a nice girl, and a proud father.  Why couldn’t he feel that way?  Laurent was lucky. He was divorced, but he was a grandfather three times over. Not only that, but he got along fine with his ex. Everything was all right in his world, no matter what. Easy-going Laurent, everybody’s pal.  He helped Laurent attach the fishing net to the winch.  “So you fish too?” Towson asked.  “Ayuh,” Laurent said. “Whatever it takes to make ends meet.”  “How do you talk to the Gleezer?” Donny asked Towson.  “I’ve got a chip in my skull that translates its communications subsonically,” Towson explained. “Everything I see and hear is conveyed to a team of exobiologists in the hotel and at labs in Washington and Houston.”  “I read about that,” Laurent said, spreading the net onto the deck. “Do you know what it’s thinking?”  “No, only what it wants me to know.”  “You’re really committed to your job, I’d say, to have that chip put in.”  “It can be removed,” Towson said, almost apologetically.  “You fellas can lay it on the net now,” Donny said.  The two Secret Servicemen placed the Gleezer on the net very carefully and stepped back.  Donny cranked up the winch, glad to be doing something besides making an ass of himself, and glad to gain a bit of distance on the Gleezer. He tried not to think of anything besides what he was doing at that moment.  He ratcheted the net up about five feet, until the Gleezer was suspended over the deck, swaying back and forth.  “Okay, boys,” he said, “swing ’er out to starboard.”  “That means to the right,” Laurent said.  Towson nodded and the two younger men obeyed. Donny wondered if those two Secret Servicemen ever spoke. Maybe he had it all wrong, and they were the ones who weren’t human.  The winch pivoted and the Gleezer hung over the water, limned by the indigo sky. The tubes trailed onto the deck and into the environmental tank.  “Everything all right?” Laurent said, looking at Towson.  “Fine,” Towson said, after a moment.  Donny, standing by the winch, wondered if the Gleezer enjoyed the ocean the same way he did. Maybe it wasn’t quite as ugly as he’d first thought. Frank had put that idea in his head last night, about seeing it. Donny had been tired, and thinking about money, so maybe he’d been more susceptible than he should have been. He was so worried about making things work out that he was as jumpy as flea these days.  This boat cost almost three hundred thousand dollars, and buying it had been a big risk, but so what? Such mundane considerations were bleached away by the morning sun climbing up over the Atlantic, as he considered the possibility of the Gleezer taking pleasure in its surroundings.  Donny turned toward Towson. “Is it . . . ?”  Towson waited for him to finish the question.  “Is it enjoying itself?”  Towson thought about that for a moment. “Yes.”  “All right, then,” Donny said. “Just tell us when to reel it in.”  “It may be a little while,” Towson said, “from what the visitor is telling me.”  They watched from the gently rocking deck for a few minutes, and Donny thought about how far the Gleezer had come from its home, more than twenty light years away, just to see a yokel like him recoil from it.  “Did I hurt it?” Donny said, surprised that he would ask.  “Hurt it?”  “Its feelings, like Laurent said.”  Towson stared straight into his eyes. “I don’t think you should worry about it. The visitor has provoked negative reactions in quite a few people since it’s been here.”  Donny looked down at the deck. “I’m sorry I was one of ’em.”  He turned away from Towson as he felt the tears starting again. What was the matter with him, carrying on like this? He wasn’t a child.  He felt a light touch on his elbow. It was Laurent.  “It’s all right, old buddy,” Laurent said softly. “Nobody’s going to tell on you.”  Now the tears really came.  “I don’t care if they do,” Donny said, wiping his face on his sleeve. “I’m turning into a bitter old man, and who cares if anybody knows it?”  “You ain’t so bad, Donny,” Laurent said, sympathy in his hazel eyes.  Donny snorted. “I guess it could be worse. I could be Frank.”  Laurent chuckled. “Ayuh, that’d be a lot worse.”  “Made a fool of myself, didn’t I?”  “No,” Laurent said. “You got a lot on your mind.”  “Don’t we all?”  “Sure do. You okay now?”  “Ayuh.”  “Well, we better make sure the Gleezer don’t fall in,” Laurent said, winking at him.  “Right. Might scare the sharks.”  They tooled around the Bay, occasionally weighing anchor to pull up some traps while the Gleezer basked in the spring sun.  “Can I give you a hand with those, sir?” the blond Secret Serviceman asked as they dropped anchor for the fourth time around nine.  “Sure,” Laurent said. “They’re pretty heavy, but you look like a strong guy.”  “I’ll do my best.”  Donny was relieved to know the kid could talk. The other one, wearing a pair of sunglasses, kept an eye on the Gleezer. That was all right with Donny; he preferred working alone.  “Were you in the Navy?” Laurent asked the helpful Secret Serviceman as they hauled on a line.  “Coast Guard.”  “Good enough to know starboard from port, I guess,” Laurent said, the veins standing out on his temples as he strained at the line. “Me and Donny both enlisted in the Navy the same day.”  “You’ve been friends a long time, huh?”  “Donny’s my best friend,” Laurent said. “Always has been, ever since we were toddlers. Our fathers were lobstermen, too. We grew up wearing yellow slickers and rain hats.”  Donny thought about his father, dead seven years now, and his mother wasting away in the nursing home in Portland. His older brother Ed had drowned in an accident while pulling traps back in 1968; he’d been only eighteen years old. Did the Gleezer have parents? Did it have brothers and sisters?  Maybe he’d do some reading about the Gleezer after this was over. When it first splashed down off an Indonesian island, the news about it was non-stop. After a few days Donny had tuned it all out, like most people. As far as his daily life was concerned, Indonesia was as far away as Gliese 581c.  But it hadn’t always been like that. He’d sailed to the Far East on a destroyer in 1975. He’d wanted to see something besides the Bay and the island, to know what was out there. He was stymied, however, by the fact that the Gleezer didn’t come from this world at all. It hadn’t just come across the sea, it had crossed the gulf of space.  In a way, though, maybe it wasn’t so different from him. It wanted to see something other than its familiar world.  The sun rose higher, warming Donny. He reflected that this was the easiest five thousand dollars he and Laurent had ever made, and they even had an extra hand to help them with the traps today.  “Mind if I ask you your name?” Laurent said to the young Secret Serviceman, “or is it a state secret?”  “My name’s Fields,” the young man said.  “Where you from, Agent Fields?” Laurent asked.  “Iowa.”  “Nice place to be from,” Laurent said.  “I’m not sure I know how to take that comment,” the kid said, grinning.  “No offense meant.”  “None taken.”  “I bet you didn’t see too many lobster boats when you were growing up out in the cornfields.”  “That’s a safe bet, Mr. Therriault.”  “Call me Laurent.”  A sailboat tacked into the wind and kept pace with them for a while.  “What’ll we do if they approach?” the other young Secret Serviceman asked.  Towson indicated that the chopper was not far away.  “Jeez, they aren’t gonna blow ’em out of the water, are they?” Donny said, alarmed at the prospect.  “We’ll keep the visitor safe,” Towson said. “That’s our job.”  “Those are our neighbors,” Donny said, “not terrorists.”  “We’re not going to do anything to them, unless they threaten the visitor. Do you think that’s likely, Mr. Doyle?”  “Only if they’re New Yorkers.”  Towson didn’t seem to get the joke at first, but then he smiled. “I’m from New York.”  “Sorry.”  “That’s all right.”  “You a Yankees man or a Mets man?”  “Yankees.”  “I wouldn’t mention that to many people around here.”  “Yes, I know,” Towson said, “but I hope we can call off the hostilities until the season gets underway.”  “That I can’t guarantee.” Donny went into a long peroration about Boston’s pitching staff, starters and relievers both, the powerful Red Sox batting order, and the Colombian kid who’d led the league in stolen bases last year. “He’s just about invisible when he tags second,” Donny said, “like greased lightning.”  “He’s quite a base runner,” Towson agreed.  Donny had hoped to distract Towson until the sailboat passed them. It continued to keep pace at a fair distance, and now he could see that someone on deck was watching through binoculars. Towson never took his eyes off it.  “We’ll have to report them if they take pictures,” Towson said.  “And then what?”  “Their cameras will be confiscated.”  “But why? Everybody’s seen pictures of the Gleezer.”  “I have my orders, Mr. Doyle.”  Donny had almost been feeling friendly enough to let the government man call him by his first name, but after that exchange he decided he’d let Towson go on calling him Mr. Doyle.  “You can’t blame people for being curious,” he said.  “I don’t blame them for anything,” Towson replied. “I’m just following protocol.”  “Hell of a country, ain’t it?” Donny said, “Regular people can’t even take a snapshot of the first visitor from another planet.”  “It’s not my decision.”  “No, I guess not. You’re only following orders, right?”  “Yes, that’s right.”  This was more like talking to a brick wall than a man, Donny thought, so he gave up trying and went back to work in silence. He was relieved to see that the sailboat had tacked to the south, without anyone aboard taking pictures, as far as he could tell. He’d never seen that particular boat before, and he wondered if it had come around the back side of the island from Castine, or maybe up from Camden.  “How’s the Gleezer doing up there?” Laurent asked, as he’d been asking every few minutes.  “So far, okay,” Towson said.  “Glad somebody around here’s having a good time,” Donny muttered to himself as he hefted a trap onto the deck and took a look at the contents.  “Uh, oh,” he said, “we got some trouble, Laurent.”  “Fight?”  “Ayuh,” Donny said, “this fella’s missing his pincher.”  Donny found the claw in the trap, along with a two pound male.  “Ornery, ain’t you?” Donny said to the battle’s victor as he held it dripping up to the sunlight.  “I’ve been wondering about something,” Laurent said to the kid.  “What’s that, Mr. Therriault?”  “Didn’t I tell you to call me Laurent? How did the President get along with the Gleezer?”  The kid didn’t say anything.  “I mean, what did she think of it?”  “She was courteous, cordial, and diplomatic,” Towson said, stepping in.  Agent Fields was trying hard not to laugh, Donny noticed. Maybe the President was as repulsed by the Gleezer as he was.  The Gleezer didn’t seem to bother Laurent much, but that was Laurent. Nothing bothered him all that much, not even losing his wife after a quarter century of marriage. He’d probably have a new one as soon as the divorce was finalized. Donny knew a couple widows who had their eyes on his old buddy. Now that Laurent was half-owner of this peapod, he’d have to fight off the ladies when he started dating again, especially once he and Donny really got the business going, bought more boats, hired some local boys, and sold lobsters wholesale to the big supermarket and restaurant chains.  At least they’d already put the first part of their plan into play, even if they’d gone into hock to buy the boat.  That was how Donny passed the rest of the morning, daydreaming and hauling up traps, until he noticed Laurent looking worried as he gazed aft. He was watching the three Secret Servicemen.  Towson spoke to his boys in low tones as they huddled with him. Donny couldn’t hear what he said, but he had the impression that something was wrong, especially with the way Agent Fields looked up at the net.  “Want us to haul it in?” Laurent asked.  Towson ignored him, almost as if he hadn’t heard him speak. He groped his way to the gunwale nearest to the net and stared straight at it.  “What is it?” Donny said.  Towson was very somber, and Agent Fields seemed worried. The quiet kid in the watch cap looked scared. Donny glanced at Laurent, who shrugged. He hadn’t heard what Towson had told his boys, either.  “The visitor’s dead,” Towson said.  “Dead . . . ?” Laurent’s mouth hung open.  “How can that be?” Donny said, feeling as if he’d just fallen overboard. “It’s just been laying up there, sunning itself. What could have killed it?”  “I don’t know, perhaps natural causes,” Towson said. “But it’s dead. All communication has stopped.”  “Maybe it’s just the chip,” Laurent said.  “No, the visitor let me know that it was dying just before the end.” Towson’s slate eyes didn’t blink.  “Jeez,” Laurent said.  “It can’t die on our boat,” Donny said, thinking about the possible consequences. There went all the dreams of capitalizing on the Gleezer’s little excursion around the bay. “You never even said it was sick.”  “I didn’t know,” Towson said. “There was only so much the exobiologists could figure out.”  “Was it very old?” Laurent said.  “We don’t know how long its species’ lifespan normally runs.”  “It came here to die,” Donny said, beginning to understand. “It came all the way to Earth just to die.”  “I’m afraid so.”  Donny looked up at the strange shape suspended over the Bay. “I wonder why?”  “Maybe it didn’t want to make the folks back home unhappy,” Laurent ventured.  The two young Secret Service agents swung the winch around, and Donny ratcheted it down until the Gleezer lay on the deck, still as a stone. Nobody spoke for a long time.  “The poor thing,” Laurent said at last.  The men stood in a circle around the alien’s corpse.  “Did it suffer?” Donny asked.  “What?” Towson said, still staring at the Gleezer.  “Was it in pain when it died?”  “It seemed peaceful,” Towson said, as if he were answering someone a long, long way away.  “Should we put it in its tank, sir?” Agent Fields asked.  “Yes, I suppose we should,” Towson said.  “What good will that do the Gleezer now?” Donny asked.  “None, but we don’t want it to decay. The chopper will lower a sling to take the tank back to the mainland. There’s a team staying at the suite who’ll examine it.”  “Frank’s gonna have to make some room in the hotel freezer,” Donny said.  “Yes, we may have to do that until arrangements can be made,” Towson said. “But for now, let’s get the visitor inside the tank.”  Donny worked the winch. Towson turned the tank on its side, and the two younger Secret Service agents guided the dead Gleezer over to it. They tilted the net until the Gleezer’s remains slid into the environmental tank. Once Towson was sure it was completely enclosed and the tubes were coiled inside the tank, he gently shut the ramp, now positioned as the lid. The tank hissed as it locked.  Donny didn’t know whether to admire Towson’s professionalism or to be contemptuous of his coolness. He decided to give the man the benefit of the doubt. Towson would probably be forced to retire from the Secret Service after this incident.  “Do you think one of us should say something?” Laurent asked.  “Say something?” Towson repeated.  “A prayer,” Donny said.  “Would one of you like to offer a few words?”  It was silent except for the gulls. The boat rocked back and forth. They all gazed at the Gleezer’s tank. No one spoke.  “Here comes the chopper,” said the Secret Serviceman whose name Donny didn’t know.  The approaching helicopter made a racket overhead and dipped as the sling was lowered toward the deck. It was the work of only a few seconds to lift and secure the environmental tank inside the sling. Everyone stood back as it went up, their clothing snapping like flags in the rotor’s wind.  They watched the helicopter fly back toward the island.  “I guess you’ll want us to take you in,” Laurent said.  “If you don’t mind,” Towson said.  Laurent went back into the pilot house.  “I’m sorry,” Donny said to Towson.  “Thank you, Mr. Doyle,” Towson said.  “What will they do with the . . . body?” Donny asked.  “I don’t know,” Towson said. “Dissection, most likely.”  Donny nodded.  “It’s too bad it can’t be sent home.”  “Yes, it’s too bad,” Towson said, “but a lot can be learned from its remains.”  “Why do you suppose it came here?” Donny asked.  “As far as I know,” Towson said, “it never revealed anything more than its desire to visit our world.”  “And now we’ll never know.”  “Probably not.”  “Imagine . . . ” Donny said.  “Imagine what?”  “How lonely it must have been.”  Towson nodded. There was no more talk until they said goodbye on the pier.  “Thank you, gentlemen,” Towson said, “on behalf of your government and myself personally.”  “We got paid pretty well,” said Laurent, as the two younger Secret Servicemen climbed into the AIV.  “Not enough,” Towson said. He shook hands with Laurent and Donny, and got in to join his men. “Goodbye.”  “Bye,” Laurent said.  The door slid shut and the AIV backed itself up and turned around, heading up Water Street. It passed a couple of kids, who paid no attention to it.  Donny and Laurent watched until it was out of sight.  “Let’s get those lobsters in the tank,” Laurent said, after a while.  They climbed back aboard and got to work. The Gleezer’s strange scent lingered, but it was fading quickly. Donny separated one berried female from the others, and was pleased to see that her eggs were clear, not orange.  After a while, he had an idea.  “I got a name for the boat,” he said.  “What is it?”  “The Gleezer,” Donny said. “Like it?”  Laurent looked out at the Bay for a moment, and then said, “Yes, I do.”  “Know what else?”  “What’s that?”  “I think I’m gonna call my son tonight.”  “Good idea,” Laurent said. “Let me know how Little Donny’s doing, will you?”  “I sure will.”  “I’ll call my girls too. See how everybody is.”  “You gonna tell ’em?” Donny asked.  “Tell ’em what?”  “About what happened today?”  “I guess so,” Laurent said, after a moment. “It’s not something we can keep quiet, anyway. Might as well tell ’em.”  “Ayuh.”  They went back to work baiting traps.  Behind them, the sea rolled on as it had for billions of years.    Originally published in Asimov’s Science Fiction, December, 2008.  Tim Sullivan is the author of the novels Destiny's End, The Parasite War, The Martian Viking, and Lords of Creation, and edited the horror anthologies Tropical Chills and Cold Shocks. He has also appeared as an actor in many movies, directed, and written several screenplays. His critically acclaimed short stories have appeared in most of the genre's major markets. He lives in South Miami, Florida with critic Fiona Kellegan.", "text": "10780 words, novelette, REPRINT\nWay Down East\n“Season’s starting early, eh?” Laurent said, standing on the pier and scratching his gray beard.\n“Why do you say that?” Donny asked, grunting as he hoisted a lobster trap onto the deck.\n“Look at that fella coming out of the CVS.” Laurent nodded toward Water Street. “He look local to you?”\nA blond young man in a business suit and sunglasses was leaving the pharmacy with a white plastic bag in hand, walking up the hill toward the Penobscot Hotel. He was about the same age as Donny’s son, early thirties, but Little Donny had seldom acted as solemn as this guy, even when he was in church.\n“He’s part of the Gleezer’s security detail,” Laurent said.\n“Is he?” Donny asked. “Guess I forgot all about that thing,”\n“Did you, now?”\nDonny took a momentary break. His back was hurting so much that he was beginning to think he was getting too old for this work. Too bad he didn’t know how to do anything else.\n“That guy could be a tourist,” he said, ragging on Laurent, who’d repeated every rumor he’d heard since the visitor from Gliese 581c arrived on the island yesterday.\n“Wonder what they bought?” said Laurent.\n“Could be anything.”\n“They don’t sell just anything in the drug store.”\n“Course not. I meant anything they sell in the CVS, wise guy.”\n“That ain’t what you said.”\n“Well, I’ll just have to watch myself from now on,” Donny said. “Make sure it’s not too complicated for you.”\n“Wicked,” Laurent said.\n“Ain’t it, though?”\n“See on TV how the Gleezer can roll around naked and get away with it?”\n“It ain’t naked,” Donny said. “It’s got that elastic thing on.”\n“You can see right through it.”\n“So what? What is there to see?”\n“Quite a lot, if you ask me.”\n“No reproductive organs, is what I meant.”\n“I know what you meant.”\n“Let’s get these traps baited. We can’t stand here all day gawking at everybody who comes out of the drug store.”\n“All day? Ain’t even been two minutes,” Laurent muttered, climbing over the gunwale.\n“If we don’t get to work, we’ll never get this boat paid off,” Donny complained. “Leave it up to you, we’d never even get away from the pier.”\n“Maybe we should call it a day. Take a look at those clouds coming in from the east,” Laurent said. “We go out now, we’ll get wet.”\n“A little rain won’t melt us.”\nThey finished baiting the traps, and Donny untied the painter. He wound it up and tossed it into the lazarette as Laurent started the engine. For a moment, he stared at the rainbow trail left on the water in their wake. He was glad he couldn’t see it anymore once they got into open water and Laurent opened up the engine to churn up some foam.\nThey did run into rain on the way back, enough to make them don their slickers. But it cleared off pretty soon, and once they were moored at the pier again they busied themselves putting their catch into the live tank.\nA lot of the eggs attached to the female lobsters were orange, which meant they were dead. It was something they saw more and more every year. After they separated the berried ladies to be thrown back, and plopped the boys into the tank, they took a breather.\n“Damn, ain’t this boat a beauty, though,” Donny said, patting the fiberglass transom.\n“She sure is,” Laurent said. “High bow, low topside aft, and she cuts through the water like a dream.”\n“What’ll we name her, now that we finally got her?”\n“I don’t know,” Laurent said. “How about ‘Swifty’?”\n“Oh, come off it. That’s just plain stupid.”\n“So what’s your big idea?”\n“Don’t have one yet.”\n“Well, I’d say ‘Swifty’ is better than ‘Don’t Have One Yet’.”\nDonny sighed. Sometimes he wondered why he even bothered.\nWhen they were finished at sunset, Laurent talked Donny into going to Salty’s for a beer. Donny argued that he should get home, but he knew Laurent was lonely nights since June left him, except when his daughters and their husbands and kids took the ferry over from the mainland. He ended up calling Beth on the cell and told her he’d be home in an hour or two.\nThey drove Laurent’s truck up the hill to Salty’s and found the parking lot nearly full.\n“It’s Friday night, ain’t it?” Donny said.\n“Good guess, Dick Tracy.”\nThey parked and went in, walking past the decorative fishing nets to join the crowd. The joint was jumping. A few summer people were already in town, and their well-heeled kids were hanging out and flirting with the locals, at least those old enough to drink or get their hands on phony IDs. The jukebox was thumping rap.\nDonny and Laurent sidled up to the bar and took a couple stools.\nMike, the bartender, was wiping a glass. He had to shout to make himself heard over the music and the enthusiastic bellowing of the kids. “Hello, boys.”\n“What’s the word, Mike?”\n“Nothin’ much.” Mike put the gleaming glass next to the other clean glasses on the shelf. “What’ll you have?”\n“Two Narragansetts,” said Laurent.\n“I don’t want a Nastygansett,” Donny said. “Give me a Sam Adams.”\n“Big spender.” Mike fetched two bottles and poured their drinks into two tall glasses, leaving a perfect head on each.\n“You’re the master, Mike,” Laurent said, blowing a little foam off the top.\n“That’s what they tell me,” Mike said. “See the Gleezer’s buddies in town today?”\n“One of ’em, not fifty yards from the boat, before we went for our last jaunt.”\nThe song on the jukebox ended, and there was a lull before the next one started.\n“I hear the Gleezer wants to go out,” Mike said, his belly hanging over the cedar bar as he moved closer to speak confidentially.\n“Out where?”\n“Out around the Bay.”\n“Who told you that?”\n“One of those Secret Service fellas traveling with it,” Mike said.\n“Secret Service?” Donny said. “Is the thing running for president?”\n“Nope,” Laurent said. “It wasn’t born in this country.”\nThat got a laugh.\n“So how’d you meet Secret Squirrel?” Donny asked.\n“He slipped in here for a quick one last night just before closing.”\n“No kiddin’?” Donny had never thought of Secret Service agents having fun, the way they were always so serious when you saw them on TV.\n“Would I kid you?”\nMike turned to attend to some other customers, and the music blared once again.\nDonny and Laurent nursed their beers.\n“I wonder how much they’re willing to pay,” Donny hollered.\n“Huh?”\n“For the Gleezer’s joy ride,” Donny said. “I wonder how much the government’s willing to fork out?”\n“Secret Service probably arranged a cruise already.”\n“Think so?”\n“Well, they’d want a luxury boat.”\n“That might draw too much attention.”\n“Well, if Mike heard it last night. . . . ” Laurent was thinking it over.\n“Maybe we should go over to the hotel and look into it.”\n“Nah, they’ve already chartered a boat.”\n“How do you know that?”\n“Common sense.”\n“That’s something you’ve always been short on.”\n“Look who’s talking, you red-headed dummy.”\nThey each took another pull from their beers.\n“We do need to start paying off the boat,” Laurent shouted.\n“That’s what I’m thinking.”\n“I guess it can’t hurt to make an offer.”\n“Guess not,” Donny said. “Glad you thought of it.”\nLaurent downed the rest of his beer. “Me, too.”\n“All right, first thing in the morning, then?”\n“Why not go over there now?” Laurent said. “It ain’t even supper time yet.”\n“I gotta get home.”\n“Shouldn’t take too long,” Laurent said, up for an adventure now. “Frank Dunsmore’s workin’ the night shift.”\n“Ain’t that just ducky?”\n“Well, we know him. Now’s the time to go over to the hotel and ask him who the boss is.”\n“Maybe the Gleezer’s the boss.”\n“Let’s hope it talks our language then.”\nDonny threw a few dollars on the bar and finished his beer. They rose from their stools.\n“See you, Mike,” Donny said.\nMike waved at them, and they elbowed their way through the noisy crowd and out the door.\n“Sure you’re okay drivin’?” Donny asked, glad to be away from the racket.\n“I only had one beer.”\nThey got into the truck. “I’m thinking about the night you hit that bridge abutment in Rockland.”\n“Thirty-five years ago, and you’re still talking about it.”\n“You only had one before that little fender bender, as I recall.”\n“I had more than one that night—’less you mean one six-pack.”\nThe two men laughed.\nIt didn’t take long to get to the hotel. In fact, it didn’t take long to get anywhere on the island. Donny didn’t mind, because he always felt lost when he went to Boston or Portland, or even Bangor. He was an island boy at heart, and he liked it that way.\nThe Penobscot Hotel had been built in 1896, with new wings added in the fifties and the eighties. It was elegant and expensive. Except for delivering lobsters to the kitchen loading dock, the only time Donny had been inside was his senior prom in 1973. He remembered smoking a joint in the men’s room with Laurent and some other boys with shag hairdos who were all long gone from the island now, except for one who taught at a nearby high school on the mainland . . . and Frank, the man they were going to see.\nLaurent pulled into the parking lot. There were a few cars, an AIV, and some trailers and a TV van at the back of the lot, but nothing much. The public had gradually stopped paying attention since the initial buzz when the Gleezer splashed down, or the media would have been out in force. Only the likes of Laurent had kept up with the story until the Gleezer showed up on the island. Most people didn’t care all that much about it anymore, since the Gleezer had nothing to say and was kept out of sight most of the time. You could only look at the same two or three clips of it so many times.\nDonny and Laurent got out without bothering to lock the truck. Nobody was going to steal from them here, because everybody either had money or were people they knew, including the Costa Rican chambermaids.\n“We should have worn our tuxedos,” Laurent said as they approached the glass lobby door.\n“Why, are we going to a costume party?” Donny asked, opening the door for his old buddy. “After you, Alphonse.”\n“Merci, garçon.” Laurent went through his pockets as if searching in vain for a coin. “Quel dommage! J’ommet tous mes argent en l’autre pantalon!”\n“You damn cheapskate frog.”\nThe olive green carpet was so spotless that Donny almost was afraid to walk on it. A couple of well-dressed people sat on well-upholstered chairs in the lobby, and he was pretty sure from their watchful attitude that they weren’t tourists.\nThe balding night manager was looking at a laptop as they walked up to him.\n“Hello, Frank,” said Laurent.\nFrank Dunsmore looked up and greeted them with the superior air Donny had always found so annoying. “Hello, Laurent. Long time, no see. How are you, Don?”\n“All right.”\n“You two want a room?”\n“Funny fella,” said Laurent. “No, we just want to talk to whoever’s in charge of the Gleezer’s bunch.”\nFrank looked amused, and Donny wanted to smack him. He saw Frank as a smarmy local boy who’d always sucked up to rich people so he wouldn’t have to earn an honest living as a lobsterman.\n“I can’t just send you up to their floor,” Frank said with his customary self-importance. “They’ve got it cordoned off.”\n“Can’t you talk to somebody up there?”\n“Why? What do you want with ’em?”\n“We got a business proposition to make.”\n“Now, what kind of business would you two have with our distinguished guest?”\nLaurent glanced at Donny, who shrugged in return. “We hear the Gleezer wants to go for a boat ride, and we’re willin’ to take it out.”\n“Oh,” said Frank. “Who told you that?”\n“Grapevine,” Donny said, before Laurent could answer.\n“Have you two jokers seen our penthouse guest?”\n“Only online and on TV,” Laurent admitted.\n“Well, it’s one thing to see a picture of it, and it’s another thing seeing it live.”\n“I guess so.”\n“This is a very special time for the Penobscot,” Frank said, looking impressed with himself. “And for our island.”\n“God bless America and the state of Maine, too,” Donny said. “Does that mean you ain’t gonna call up there, or are you planning to mess with us the rest of the night?” He was fed up with Frank’s superciliousness. “We got better things to do.”\nFrank was taken aback. “All right, Don, don’t get your shorts in a bunch. I’ll call ’em, but don’t say I didn’t warn you.”\nHe got on the house phone and spoke to somebody.\n“Couple of lobstermen have a boat to charter,” he said, among other things, including their names, which he repeated twice. He hung up after a minute and said, “You can go on up.”\n“Thanks,” Laurent said.\n“Just a minute,” Frank said. “I gotta go key the elevator or it won’t take you to the penthouse.”\nFrank came out from behind the desk and led them to the elevator. He got inside with them and set it with a card, and then slipped out.\n“Good luck, fellas,” he said as the door slid shut.\n“What a jerk,” Donny said on the way up.\n“Oh, he ain’t so bad,” Laurent said.\nDonny watched the LED display, 1, 2, 3, and he was feeling pretty tense by the time they reached the penthouse.\n“Here we go,” Laurent said, waiting for the door to open.\nThe delay made it seem like an awfully long time. At last it opened, loudly and irrevocably. A woman stood right in front of the door. She was dark and had short raven hair. She was very good-looking.\n“Mr. Doyle and Mr. Therriault?” she said, adjusting a little electronic earpiece clamped to her left lobe.\n“Yes, ma’am,” Donny said. “That’s us.”\n“I’m Special Agent Hernandez,” she said.\n“Nice to meet you,” Laurent said, offering his hand.\nDonny shook hands with her, too. He’d never met a Special Agent before. He wondered if she spoke to the chambermaids in Spanish.\n“Please put all your change and keys in this bin and step through the metal detector.”\nThe metal detector was behind her, and she stepped aside to let them go through. Laurent went first, followed by Donny. Special Agent Hernandez watched them as they picked up their keys and coins. So did two young men in suits down the hall, one of whom they’d seen coming out of the drug store that afternoon.\n“Please come with me.” She turned and Donny watched her shapely calves flex as she led them through the penthouse suite. All the doors were closed but one.\nThe room she took them to was just like something in a movie, with windows on three sides so you could see the town’s lights and the white-capped water breaking on the rocks below.\n“Nice,” Laurent said.\nDonny didn’t say anything, embarrassed by his boots squishing.\n“If you gentlemen will wait here,” the lady said. “Mr. Towson will be right with you.”\n“Thank you,” Donny said.\n“Help yourselves to the refreshments on the table,” she said, and then left them alone.\nThere were bagels, salmon, fresh fruit, bottled water, wine, and a coffee urn with cups and saucers, cutlery, and napkins. Laurent grabbed a banana, and Donny had a pumpernickel bagel, which he slathered with cream cheese using a butter knife. He bit into it and found it was as hard as a rock, but tasty. Both poured themselves some coffee into china cups and sat on the fanciest sofa Donny had ever seen in his life, holding their saucers in their laps.\n“Imagine the kind of money it takes to rent this place,” Laurent said, looking around at the fancy furnishings and framed paintings on the walls.\nDonny didn’t speak, because he was sure they were being monitored. He didn’t intend to say something stupid and blow this job.\nTowson kept them waiting quite a while. When he finally appeared, he proved to be a trim man with thick, silvery white hair, in his late fifties, wearing a very expensive suit and a blue satin tie.\n“Hi,” he said, extending a manicured hand. “I’m Jerry Towson.”\n“Nice to meet you, Mr. Towson,” Laurent said, rising to shake his hand. “Laurent Therriault. This is Donny Doyle.”\nDonny got up and shook with Towson, conscious of the dried chum blood under his fingernails and the smell of lobster battling with Towson’s cologne. Towson had a strong grip, though, and his gray eyes sized up a man in a hurry.\n“I understand you gentlemen have a boat you’d be willing to charter for a day?” Towson asked, coming right to the point.\n“Ayuh, a brand new Northern Bay 36,” Laurent said.\n“Just got her this week,” Donny added.\n“Do you have any objection to a thorough security check of your boat before the launch?”\n“Nope,” Laurent quickly said.\nTowson nodded at him, and then turned to Donny. “And you, Mr. Doyle? Do you have any objections?”\n“I guess not,” Donny said, remembering that this had been his idea in the first place. “Long as nothing’s damaged.”\n“I assure you we’ll be careful,” Mr. Towson said, showing his capped teeth as he smiled like a cable TV newsman. “Are there any questions?”\n“Yeah, what, uh . . . ” Laurent hesitated.\n“Please go on.”\n“What do we do if there’s trouble?”\n“Trouble?”\n“Yeah,” Laurent said. “What if it runs out of the stuff it breathes, or something like that?”\n“We’ll have a team there to make sure nothing goes wrong.”\n“How many people?” Donny asked. “It’s only a thirty-six footer, you know.”\n“Just three people, including me,” Towson said. “Is that too many passengers?”\n“No, that’ll be all right,” Laurent said, glancing at his buddy.\n“Fine,” Towson said. “How much do you charge for a charter cruise?”\n“This’ll be the first one,” Donny said. “Make us an offer.”\n“Five thousand dollars.”\nDonny thought his jaw was going to hit his collarbone. “Uh . . . ”\n“Yes, sir, that’ll be fine,” Laurent quickly said.\n“Excellent,” Towson said. “Will a check be all right?”\n“Long as it don’t bounce,” Donny said, recovering quickly from the shock.\nTowson smiled. “We’ll have a cashier’s check for you tomorrow morning, and we’ll have the visitor at the dock at five o’clock sharp. After a routine security scan, we’ll be off.”\n“You’ll find our boat moored right at the end of Water Street,” Donny said. “Can’t miss it. No name painted on her yet.”\n“I’m sure you understand how important discretion is in this matter,” Towson said. “We ask only that you tell no one about it until after the visitor is safely ashore.”\n“Okay,” Laurent said.\n“Right,” Donny said.\n“And just one more thing,” Towson said.\n“Ayuh?”\n“Are there any firearms aboard?”\n“Just a Very pistol—you know, a flare gun,” Laurent said.\n“Nothing else?”\n“Nope,” Donny said, “we don’t shoot lobsters, we just trap ’em.”\nTowson smiled. “Very good, gentlemen, you have a deal with the United States government.”\n“Good enough for me,” Laurent said.\n“And you, Mr. Doyle?”\n“Sure,” Donny said. He was thinking about the money this could bring their way after the deal was done—television, online interviews, magazines. . . . It could turn out to be very profitable. People would want to ride on the Gleezer boat, and they’d be willing to pay for the privilege.\nAnd even if he and Laurent didn’t make another penny off this deal, they could at least lay down a pretty hefty payment on the boat next month.\n“When you said we can’t tell anybody,” Donny said to Towson, “does that include my wife?”\n“Yes, I’m afraid so.”\nDonny nodded. It would be hard to keep it from Beth, but it wasn’t unusual for a lobster boat to put out at five, so she wouldn’t be suspicious. He’d have a good story to tell her when he got home tomorrow, in any case.\n“It’s a deal.”\nThey each shook hands with Towson to seal it.\n“I have some things to attend to, gentlemen,” he said. “But feel free to linger here as long as you wish, and please help yourselves to food and beverages.”\n“Can we take some goodies home with us?” Laurent asked.\n“I’d rather you didn’t,” Towson said. “It might raise questions.”\n“Well, I live alone nowadays,” Laurent said. “Nobody’s gonna question me.”\n“Then I see no reason why you can’t take all you like. Good evening, gentlemen.”\nHe walked out of the room.\n“And here I am with mouths to feed,” Donny said.\n“I’ll save you some,” Laurent said, gathering up grapes, apples, and bagels, which he wrapped in napkins and stuffed into his coat pockets. He gripped a bottle of Cabernet Sauvignon in his meaty hand and started toward the door. “Give it to you when we come back tomorrow. Except for the wine, which I’m keeping.”\n“The food’ll be stale.”\n“Then don’t eat it,” Laurent said, as they left the panoramic view behind them on their way to the elevator. “See if I care.”\n“You’re all heart.”\n“Ayuh.”\nChewing on a grape, Laurent nodded at the two young men in suits as they waited for the elevator. The ride down seemed much faster. Laurent waved at Frank as he and Donny walked through the lobby.\n“How’d it go?” Frank called to them, busting to know what had happened upstairs.\n“Can’t talk about it, Frank,” Donny shouted back. “National security.”\nIn the parking lot, they looked up as a helicopter noisily flew over.\n“Government or news?” Laurent said, spitting out a seed and popping another grape into his mouth.\n“Don’t see what difference it makes.”\nLaurent dropped Donny off at the house, looking out for wildlife along the way. Dark as it was with the birches all around, Donny noticed that a couple more shingles had fallen into the front yard as he walked up to the front door. He’d have to work on the roof this summer.\nHe heard the dog barking as he let himself in.\n“Hello, Bert,” he said stroking the Lab’s yellow fur as he entered. “I almost had some treats for you, but no dice.”\n“Did you get anything to eat?” Beth asked, coming out of the kitchen as Donny flung his coat over the newel post. He could hear the TV going in the living room.\n“Ayuh.” He kissed her on the cheek, his face tickled by her long hair. She’d stopped coloring it lately, calling it her “gray badge of courage.” It wasn’t really all that gray yet. He liked the way it looked, long and feminine.\n“How’s your back?” Beth asked.\n“Aching a little bit, but I’m okay.”\n“Little Donny called a short while ago,” Beth said. “He said he was sorry he missed you.”\n“Did he, now?”\n“Things are picking up for him,” Beth said, ignoring Donny’s sardonic tone. “He’s got a few gigs lined up and some time in the recording studio.”\n“So he’s gonna be a rock star soon?”\n“As long as he’s happy,” Beth said, looking at him with her green eyes.\nDonny grunted as he sat on the bottom step and Beth helped him haul off his short boots. Bert’s tail counted time, whacking against the bottom step.\n“I shouldn’t have had coffee,” Donny said, changing the subject.\n“Since when do you drink coffee at Salty’s?”\nHe let the question pass as he stood up.\n“I still have some of that Ambien Doctor Blaisdell prescribed,” Beth said. “That ought to put you out.”\n“Ayuh.”\nHe took a bath and the pill, and he was ready to go to sleep an hour later. Beth joined him, lying down next to him in their queen size bed and rubbing his back for a few minutes.\n“Everybody on the island’s talking about the Gleezer,” she said, pulling up the comforter and turning on her side to put out the lamp on the night stand.\n“Day before yesterday nobody around here cared about it.”\n“Kind of exciting, having it come here.”\n“Kinda.”\n“What do you suppose it wants?”\n“Wants? What do you mean, baby?”\n“Well, why this island of all the places on Earth?”\n“Same reason as summer people come here, I guess.”\n“For the rustic New England charm?”\nThey both laughed.\n“Have you got something on your mind, Donny?”\n“You know there’s never anything on my mind.”\n“Oh, stop it.”\n“It’s just that we’re gonna have a long day tomorrow.”\n“Are you thinking about Little Donny?”\n“Nothing I can do about him.”\nBeth didn’t say anything. They’d been through it a thousand times. She believed that Little Donny was brave to be unashamed of the way he was, but Donny wondered if things might have turned out different if he had interested the boy in something besides playing the keyboard.\nBeth snuggled up.\n“Your nose is cold,” he said.\n“Cold nose, warm heart,” she said. “Did you find orange berries on the females today?”\n“Ayuh.”\n“It bothers you, doesn’t it?”\n“Well, sure it does,” Donny said. “What are we gonna do if the lobsters die off?”\nShe touched his hair. “We’ll get by.”\nThe Ambien was making Donny drift off, but he was thinking about tomorrow and what it might mean. He had to remind himself not to say anything to Beth about it.\nAnd then he was asleep.\nBeth was up before him, at quarter past four. She was making coffee, bacon, and eggs. Donny washed his face and came downstairs, trying to savor the delicious odors, but too worried about how things were going to go today to enjoy it much. He didn’t want Beth to notice his anxiety, though, so he talked about something he knew would prevent her from asking him any questions.\n“Little Donny still got plans to marry Alan?” he asked.\n“Oh, he mentions it every now and then,” Beth said, pleased to talk about their son as she cracked an egg and plopped its contents into the buttered pan.\n“I know you wanted grandchildren,” Donny said.\n“If they get married, maybe they can adopt.”\nIt wouldn’t be the same, he thought, but he kept it to himself.\nThey ate in silence.\nLaurent picked him up at twenty minutes to five, to make sure they’d be at the pier in plenty of time. Rolling down his window, Laurent patted Bert on the head, the dog’s paws resting on the pickup’s side panel.\n“Something wrong with the heater?” Donny inquired after he got in.\n“Give it a chance,” Laurent replied.\n“We’ll be out on the water before it warms up in here.”\n“Ain’t it awful?”\nIt was still dark, but as they bumped down the hill from Donny’s house, the Atlantic was starting to reflect a quicksilver hint of light.\n“Think the Gleezer’s sun looks different than ours?” Donny asked.\n“That’s what they claim,” Laurent said. “It’s red all the time, not just at sunrise and sunset.”\n“All the time? No kiddin’?”\n“No kiddin’.”\n“So how does there happen to be life on its planet?”\n“Well, there’s water, and I guess wherever there’s water there’s life.”\nAs usual, Laurent drove right onto the pier. Donny thought it was kind of nice that they wouldn’t have to tote any traps today if they didn’t feel like it. They were just going to take a little cruise out onto the bay with the Gleezer. He remembered movies about space monsters and alien menaces, and it made him chuckle.\n“Are you losin’ it?” Laurent said.\n“Well, you gotta admit this is kinda weird, Laurent.”\nLaurent laughed, too. “Can’t deny it.”\nThey climbed aboard and got ready for the imminent arrival of the Gleezer’s team.\nA massive, black AIV—the one they’d seen in the hotel parking lot—rolled down Water Street and parked itself behind Laurent’s truck right on time, five o’clock sharp. Excepting its pristine paint job, it looked like it ought to be patrolling the streets of a war zone. Its headlights illuminated the boat and hurt Donny’s eyes.\nHe didn’t like having Laurent’s truck blocked off, but they weren’t going to be using it until they got back.\nTowson got out of the AIV and walked toward their boat. He looked as fresh as a daisy, wearing an overcoat, his silver hair glistening from the morning mist. He had so much hair that Donny wondered if it was plugs or a wig.\n“Good morning, gentlemen,” Towson said, as two young Secret Servicemen climbed aboard and looked the boat over for Weapons of Mass Destruction. This morning, they were dressed in jeans and jackets, the guy they’d seen yesterday wearing a Cubs cap over his blond hair and the other one wearing a knit watch cap. Donny hoped they wouldn’t fall into the head when they went below deck.\n“Morning,” Laurent said, sniffling a bit.\n“Coming down with a cold, Mr. Therriault?”\n“Just allergies.”\n“So it’s in the AIV?” Donny asked. “The, uh . . . visitor?”\n“Yes.” Towson glanced over his shoulder. “We’ll lift it out in its environmental tank and put it on the deck whenever you’re ready.”\n“No time like the present,” Donny said.\n“I agree, but let’s give my men time to finish the security check first.”\nA couple minutes later, they were satisfied.\nTowson turned and pressed buttons on a remote. The back door of the SUV opened. Appendages that looked like they were assembled from a giant Erector Set swung a polarized glass tank over the roof and hood, depositing it on the pier. It was about the size of a coffin.\n“Pretty nifty,” Laurent said.\n“Do we have to haul it aboard ourselves?” Donny asked.\nTowson shook his head and directed his two men to do it. They grasped handles on the sides of the glass tank and lifted it without much strain.\n“The lady didn’t come?” Laurent asked, as the two Secret Service agents wrestled the tank aboard. The boat bobbed under their weight as they set it on the deck.\n“Special Agent Hernandez?” Towson said. “No, I’m afraid not. She’s in charge of the team back at the hotel.”\n“Too bad for you, Laurent,” Donny said. “I could tell she likes you.”\n“Funny fella,” Laurent replied. “You ought to be writing for Conan O’Brien.”\n“It’d pay better.”\n“Well, Special Agent Hernandez is a pretty woman,” Laurent said, “wouldn’t you say, Mr. Towson?”\n“I would,” Towson replied.\n“Are you coming with us?” Donny asked.\n“Yes, I am,” Towson said. “Why do you ask?”\n“You might get your feet wet.”\n“They’ve been wet before,” Towson said.\nTowson reached under his coat, and for a moment Donny thought he was going to show them his handgun. Instead, he pulled an envelope from his inside breast pocket.\n“Your check,” he said.\nLaurent and Donny exchanged glances. Donny took the envelope, because it seemed that Laurent didn’t want to.\n“Feel free to look it over,” Towson said, smiling, “if you don’t trust the federal government.”\n“You never know these days,” Laurent said.\nThey all laughed.\n“I guess it’ll be all right,” Donny said. “After all, we know where you’re staying.”\nAnother laugh. Maybe, Donny thought, this wouldn’t be such a bad day . . . if it didn’t rain.\n“This is a fine looking vessel,” Towson said, turning his attention to the boat.\n“Built this year,” Laurent said.\n“AI steering system?”\n“No, we couldn’t afford that. She’s got Raytheon and old-fashioned GPS, but we hardly ever need it, so. . . . ”\n“I guess you know your way around this bay pretty well.”\n“Ayuh, we’ve been doing this all our lives,” Donny said, suspecting that he was being patronized.\n“Let’s get on board,” Laurent said, deftly hopping over the gunwale and offering a hand to Towson.\nDonny untied the painter and climbed aboard as Laurent started her up. They put out slowly.\n“Are we going to see the . . . ” He almost said “the Gleezer,” but caught himself. “ . . . visitor?”\n“Yes.”\n“Mind if we pull up some lobster traps while we’re out?” Laurent asked.\n“I don’t see any reason to object.”\n“All right, then. Just a few to keep us busy.”\nThe sun was emerging over the horizon, breaking into a million shimmering red lights on the water.\nNo matter how many times he saw it, Donny never got tired of it.\n“Lovely,” Towson said, as they got away from shore and gathered speed. “Just lovely.”\n“Grows on you,” Laurent said.\nThe steady sound of the boat’s diesel engine was overcome by the rattling whir of a helicopter passing overhead.\n“One of yours?” Donny asked.\n“In case of emergency,” Towson said.\n“If a tanker comes too close, will the chopper blow her out of the water?” Donny drily asked. “That would be something to tell the grandkids about.”\n“You have grandchildren, Mr. Doyle?”\nThat question took all the fun out of the conversation. Donny decided to clam up. He had the distinct feeling that Towson knew everything there was to know about him, right down to what he ate for breakfast. For a few minutes he’d been fooled into thinking this guy was just like anybody else.\nHe watched for buoys marking their traps.\nBefore he spotted any, Towson went into the pilot house and ordered Laurent to stop the boat.\nWhen the engine cut off, it took a moment for Donny to hear anything, but then the familiar sounds of the waves lapping on the hull and the gulls cawing overhead slowly came to him. All he was thinking of was that he was about to see the Gleezer.\nThe two Secret Servicemen stood by while Towson pulled a cylindrical key out of his pocket and inserted it into a slot in the tank’s lid.\nThe side of the tank, rather than the lid, slowly opened. It made a ramp leading to the deck. Donny thought there would be a lot of gadgets inside, but he couldn’t see much other than the dark mass of the tank’s occupant.\nThe Gleezer took its time coming out.\nIt was wearing its protective sheath, just as Donny had seen on TV. It sort of squirmed and flopped onto the deck, almost like a fish out of water. Alarmed, Donny glanced at Towson, but the government man seemed calm.\nLaurent came out of the pilot house. He was spellbound by the Gleezer.\n“Is everything all right?” Laurent asked in a tone barely above a whisper.\n“There’s no cause for concern,” said Towson.\n“It doesn’t look all right,” Donny said. Not only that, but he could smell it right through its clear covering, and he didn’t care for the odor. It wasn’t like anything he’d ever smelled before.\nThe Gleezer slithered a few feet across the deck. Donny tried to think of something to compare its appearance to. A centipede, a bug, a lobster, even . . . but none of these analogies would do. It had quite a few appendages, maybe a dozen, but they didn’t look like the limbs of any animal he’d ever seen. There were two humps on either side with kidney-shaped artificial lungs in them, supplying the atmosphere the Gleezer needed to survive on Earth. Two transparent tubes connected the inflating lungs to the tank.\nHe knew that the lump on its back was where its brain was located, but he had no idea if it could see, smell, hear, or feel—at least not the way humans and animals did.\nFrank had told the truth, for once in his life. It was one thing to see a picture of the Gleezer, and another thing to see it for real. It was only four feet away from Donny, and the sight of it made him want to jump into the drink.\nHe stood on the lazily yawing deck, his beloved Bay all around him, the early morning light dazzling on the dappled water. He looked away from the Gleezer and toward the sunrise until it hurt his eyes.\n“You get used to its appearance,” Towson said.\n“I don’t think I ever could,” Donny said. “It’s ugly.”\n“You ain’t no prize yourself,” Laurent cracked from under the fly bridge.\n“Nobody asked you.”\nTowson frowned. “I know the visitor’s different, but it’s intelligent, and it’s sensitive.”\n“Sensitive?” Donny scoffed.\n“In other words, shut up,” Laurent said.\nDonny turned on Laurent. “Don’t tell me to shut up, you dumb Canuck.”\n“Gentlemen, please,” Towson said. “The visitor can sense your anger.”\n“It can?” Laurent asked.\n“Yes, it’s empathic.”\n“Like on Star Trek?” Laurent asked.\n“Well, no,” Towson explained. “In the same way that you and I might sense that an animal’s in pain.”\n“In pain?” Donny demanded. “Who’s in pain?”\nTowson left the question unanswered.\nDonny looked astern toward the island. It was his home, a little piece of rock jutting out of the Atlantic. Right now he wished he was back at the house, in bed with Beth. For the first time in his adult life, he was beginning to feel a little seasick.\n“You all right, Donny?” Laurent asked.\n“Course I’m all right.”\n“You’re looking a little pale.”\nDonny grabbed a line and attached it to a metal lobster trap, watching the Gleezer peripherally. Slits in its pulsing hide opened and closed, observing him in some unknowable way, and the Secret Service detail watched them both through their human eyes.\nGet a hold of yourself, man. This was your idea. It’s just a job of work. It’ll all be over in a few hours.\n“If it’s all right with you, Mr. Towson, could we go check on some traps now?” Laurent asked.\n“Certainly,” Towson said.\nLaurent went into the pilot house and started up the engine again.\nTowson approached Donny. “Have you ever been in the military, Mr. Doyle?”\n“Navy.”\n“Combat?”\n“No.”\nHe expected Towson to ask more questions, but he didn’t.\n“So what are you trying to say?” Donny said, angrily turning to face Towson. “You think I’m a coward or something?”\n“No, sir, I don’t think that,” Towson said.\n“Just let me do my work, and you and your boys and that thing enjoy the ride, and we’ll be all right.”\n“Fine,” Towson said. He backed off, and grabbed the lanyard to steady himself on the slippery deck. The water was becoming choppier now that they were moving farther out to sea.\n“You men have enviable lives,” he heard Towson say to Laurent a few minutes later.\n“We like it,” Laurent said.\nDonny snorted, unnoticed by the others. Laurent’s wife had left him, his daughters lived out of state, he was over fifty, and he had nothing but time on his hands when he wasn’t working. What did he like so much about his life? If he was so happy, why did he keep Donny out at night instead of going home and being happy by himself?\nFunny thing was, though, that Donny didn’t mind hanging out nights at Salty’s all that much. He could usually be talked into it. Nevertheless, he wished he’d gone home last night, instead of going to the hotel.\nHe kept thinking of the Senior Prom, and how pretty Beth had looked that night all those years ago when they danced in the hotel ballroom. It wasn’t just the joint and the beers that had made him see her that way, either. She was a pretty one. When he looked at her now, he could still see that fresh young girl through the wrinkles and gray hair.\nHe sensed that the Gleezer was moving, undulating along the deck a few inches at a time. There wasn’t much room, but he still didn’t want to be near it, not if he could help it.\nHe bent over, feeling a twinge in his lower back, and stepped into the pilot house.\n“What can I do you for?” Laurent asked.\n“I’ll take the helm for a while,” Donny said, “if you don’t mind.”\nLaurent relinquished the wheel. “There’s the buoy straight ahead. You ain’t gonna be driving for long.”\n“I just want to get away from that thing.”\n“Ever occur to you that it might have feelings?” Laurent said, ducking his head to go out on deck.\nDonny would have sneered, but Laurent was gone already, and he didn’t really feel like sneering anyway. He knew it was likely that the Gleezer had emotions, but he couldn’t believe it after seeing the ugly beast. He could more easily believe a lobster would send him a valentine.\nBut Laurent had a point. The Gleezer had come across space from billions of miles away, so it had to be intelligent. In fact, it was probably a lot smarter than him.\nThat wasn’t saying much, he mused, as he cut the engine and steered the boat toward the buoy. He glanced over his shoulder through the hatch and saw the Gleezer throbbing like a clump of shrink-wrapped, spiny seaweed on the deck.\nHe was beginning to regret his show of revulsion toward the Gleezer and snapping at Towson. He started thinking about Little Donny, and realized that he had allowed himself to feel like less than a man because his son was gay. That was no way to be, and he knew it, but he couldn’t help it.\nIt was hard to see through the windscreen, for some reason. Donny tasted salt water on his lips, even though there was no spray inside the pilot house. He wiped his eyes with the back of his hand. He didn’t want to cry. Why couldn’t he stop it? What was wrong with him?\nHe sensed someone moving behind him, and glanced over his shoulder to see who it was.\nIt was the Gleezer.\nDonny turned around to see it crawling across the deck toward the pilot house.\n“What does it want?” he called out in a near panic.\nTowson called out to him. “The visitor’s just curious.”\n“Is it coming in here?” Donny shouted.\n“No, I don’t think it has that intention,” Towson said in a reassuring tone.\nThe Gleezer kept inching toward the hatchway. Donny started feeling claustrophobic. He turned back toward the wheel, but he could see the Gleezer reflected in the glass, the morning sun glistening on its sheath. It was nearly five feet long, a foot and a half wide, and maybe two feet high, counting the brain hump that protruded from the top, and it was a mottled gray-green, almost black, with all those spines and spindly legs sticking out.\nDid it see him? He was certain it knew he was there, but what did it think he was? Did it understand what he was, what it meant to be a man? To suffer life’s disappointments and work every day just to grow older, closer and closer to death every minute? No, of course it didn’t. How could it know what a human is?\nIt stopped short of coming inside and lay on the deck, quivering. He thought it made a sound, but then he realized that was just a gull screeching in the distance.\nThe two younger Secret Servicemen, both big guys, came over and lifted the Gleezer up.\n“It wants to see more of the bay,” Donny said, feeling a bit stupid. “That’s all.”\n“Yes,” Towson said. “That’s all.”\n“It sure didn’t come out here to look at your boots, Donny,” Laurent said as he dropped the anchor.\n“But it could have seen the Bay from the shore.”\n“Not the same thing.”\n“Well, I know that, Laurent,” Donny said, getting an idea. “Hey, we got that net. We could put the Gleezer in and lift him up.”\n“That’d be better than you fellas just holding him like that,” Laurent agreed. “It’s up to you, Mr. Towson.”\n“You don’t think it could be dangerous?” Towson asked.\n“Oh, no. We’ve got a winch, so we can suspend the Gleezer right over the water if he wants.”\n“The Gleezer?” Towson said. “Is that what you call our visitor?”\n“Ayuh,” Laurent said. “I hope he doesn’t mind.”\n“No, I don’t think so,” Towson said after a pause, as if he’d been listening to someone they couldn’t hear.\n“Pretty good-natured, is he?”\n“As far as we know,” Towson said. “But the visitor isn’t a he. Its gender is indeterminate.”\n“Oh. Well, we promise we won’t do anything untoward that could cause an interstellar incident,” Laurent said.\nTowson smiled. “You’re a man of hidden depths, Mr. Therriault.”\n“Just like the sea around me,” Laurent said.\nDonny wondered if Towson was insulting him by implication. Did he think Donny Doyle had no depths? Well, maybe it was true. A man who held a grudge against his own son because of something the boy couldn’t help was a shallow man, and he had to admit that to himself. He’d been through it in his mind many, many times, and he knew Beth loved Little Donny even though he’d never give her a grandchild. If Little Donny and his boyfriend could adopt a kid she’d be just as happy as if he were straight, married to a nice girl, and a proud father.\nWhy couldn’t he feel that way?\nLaurent was lucky. He was divorced, but he was a grandfather three times over. Not only that, but he got along fine with his ex. Everything was all right in his world, no matter what. Easy-going Laurent, everybody’s pal.\nHe helped Laurent attach the fishing net to the winch.\n“So you fish too?” Towson asked.\n“Ayuh,” Laurent said. “Whatever it takes to make ends meet.”\n“How do you talk to the Gleezer?” Donny asked Towson.\n“I’ve got a chip in my skull that translates its communications subsonically,” Towson explained. “Everything I see and hear is conveyed to a team of exobiologists in the hotel and at labs in Washington and Houston.”\n“I read about that,” Laurent said, spreading the net onto the deck. “Do you know what it’s thinking?”\n“No, only what it wants me to know.”\n“You’re really committed to your job, I’d say, to have that chip put in.”\n“It can be removed,” Towson said, almost apologetically.\n“You fellas can lay it on the net now,” Donny said.\nThe two Secret Servicemen placed the Gleezer on the net very carefully and stepped back.\nDonny cranked up the winch, glad to be doing something besides making an ass of himself, and glad to gain a bit of distance on the Gleezer. He tried not to think of anything besides what he was doing at that moment.\nHe ratcheted the net up about five feet, until the Gleezer was suspended over the deck, swaying back and forth.\n“Okay, boys,” he said, “swing ’er out to starboard.”\n“That means to the right,” Laurent said.\nTowson nodded and the two younger men obeyed. Donny wondered if those two Secret Servicemen ever spoke. Maybe he had it all wrong, and they were the ones who weren’t human.\nThe winch pivoted and the Gleezer hung over the water, limned by the indigo sky. The tubes trailed onto the deck and into the environmental tank.\n“Everything all right?” Laurent said, looking at Towson.\n“Fine,” Towson said, after a moment.\nDonny, standing by the winch, wondered if the Gleezer enjoyed the ocean the same way he did. Maybe it wasn’t quite as ugly as he’d first thought. Frank had put that idea in his head last night, about seeing it. Donny had been tired, and thinking about money, so maybe he’d been more susceptible than he should have been. He was so worried about making things work out that he was as jumpy as flea these days.\nThis boat cost almost three hundred thousand dollars, and buying it had been a big risk, but so what? Such mundane considerations were bleached away by the morning sun climbing up over the Atlantic, as he considered the possibility of the Gleezer taking pleasure in its surroundings.\nDonny turned toward Towson. “Is it . . . ?”\nTowson waited for him to finish the question.\n“Is it enjoying itself?”\nTowson thought about that for a moment. “Yes.”\n“All right, then,” Donny said. “Just tell us when to reel it in.”\n“It may be a little while,” Towson said, “from what the visitor is telling me.”\nThey watched from the gently rocking deck for a few minutes, and Donny thought about how far the Gleezer had come from its home, more than twenty light years away, just to see a yokel like him recoil from it.\n“Did I hurt it?” Donny said, surprised that he would ask.\n“Hurt it?”\n“Its feelings, like Laurent said.”\nTowson stared straight into his eyes. “I don’t think you should worry about it. The visitor has provoked negative reactions in quite a few people since it’s been here.”\nDonny looked down at the deck. “I’m sorry I was one of ’em.”\nHe turned away from Towson as he felt the tears starting again. What was the matter with him, carrying on like this? He wasn’t a child.\nHe felt a light touch on his elbow. It was Laurent.\n“It’s all right, old buddy,” Laurent said softly. “Nobody’s going to tell on you.”\nNow the tears really came.\n“I don’t care if they do,” Donny said, wiping his face on his sleeve. “I’m turning into a bitter old man, and who cares if anybody knows it?”\n“You ain’t so bad, Donny,” Laurent said, sympathy in his hazel eyes.\nDonny snorted. “I guess it could be worse. I could be Frank.”\nLaurent chuckled. “Ayuh, that’d be a lot worse.”\n“Made a fool of myself, didn’t I?”\n“No,” Laurent said. “You got a lot on your mind.”\n“Don’t we all?”\n“Sure do. You okay now?”\n“Ayuh.”\n“Well, we better make sure the Gleezer don’t fall in,” Laurent said, winking at him.\n“Right. Might scare the sharks.”\nThey tooled around the Bay, occasionally weighing anchor to pull up some traps while the Gleezer basked in the spring sun.\n“Can I give you a hand with those, sir?” the blond Secret Serviceman asked as they dropped anchor for the fourth time around nine.\n“Sure,” Laurent said. “They’re pretty heavy, but you look like a strong guy.”\n“I’ll do my best.”\nDonny was relieved to know the kid could talk. The other one, wearing a pair of sunglasses, kept an eye on the Gleezer. That was all right with Donny; he preferred working alone.\n“Were you in the Navy?” Laurent asked the helpful Secret Serviceman as they hauled on a line.\n“Coast Guard.”\n“Good enough to know starboard from port, I guess,” Laurent said, the veins standing out on his temples as he strained at the line. “Me and Donny both enlisted in the Navy the same day.”\n“You’ve been friends a long time, huh?”\n“Donny’s my best friend,” Laurent said. “Always has been, ever since we were toddlers. Our fathers were lobstermen, too. We grew up wearing yellow slickers and rain hats.”\nDonny thought about his father, dead seven years now, and his mother wasting away in the nursing home in Portland. His older brother Ed had drowned in an accident while pulling traps back in 1968; he’d been only eighteen years old. Did the Gleezer have parents? Did it have brothers and sisters?\nMaybe he’d do some reading about the Gleezer after this was over. When it first splashed down off an Indonesian island, the news about it was non-stop. After a few days Donny had tuned it all out, like most people. As far as his daily life was concerned, Indonesia was as far away as Gliese 581c.\nBut it hadn’t always been like that. He’d sailed to the Far East on a destroyer in 1975. He’d wanted to see something besides the Bay and the island, to know what was out there. He was stymied, however, by the fact that the Gleezer didn’t come from this world at all. It hadn’t just come across the sea, it had crossed the gulf of space.\nIn a way, though, maybe it wasn’t so different from him. It wanted to see something other than its familiar world.\nThe sun rose higher, warming Donny. He reflected that this was the easiest five thousand dollars he and Laurent had ever made, and they even had an extra hand to help them with the traps today.\n“Mind if I ask you your name?” Laurent said to the young Secret Serviceman, “or is it a state secret?”\n“My name’s Fields,” the young man said.\n“Where you from, Agent Fields?” Laurent asked.\n“Iowa.”\n“Nice place to be from,” Laurent said.\n“I’m not sure I know how to take that comment,” the kid said, grinning.\n“No offense meant.”\n“None taken.”\n“I bet you didn’t see too many lobster boats when you were growing up out in the cornfields.”\n“That’s a safe bet, Mr. Therriault.”\n“Call me Laurent.”\nA sailboat tacked into the wind and kept pace with them for a while.\n“What’ll we do if they approach?” the other young Secret Serviceman asked.\nTowson indicated that the chopper was not far away.\n“Jeez, they aren’t gonna blow ’em out of the water, are they?” Donny said, alarmed at the prospect.\n“We’ll keep the visitor safe,” Towson said. “That’s our job.”\n“Those are our neighbors,” Donny said, “not terrorists.”\n“We’re not going to do anything to them, unless they threaten the visitor. Do you think that’s likely, Mr. Doyle?”\n“Only if they’re New Yorkers.”\nTowson didn’t seem to get the joke at first, but then he smiled. “I’m from New York.”\n“Sorry.”\n“That’s all right.”\n“You a Yankees man or a Mets man?”\n“Yankees.”\n“I wouldn’t mention that to many people around here.”\n“Yes, I know,” Towson said, “but I hope we can call off the hostilities until the season gets underway.”\n“That I can’t guarantee.” Donny went into a long peroration about Boston’s pitching staff, starters and relievers both, the powerful Red Sox batting order, and the Colombian kid who’d led the league in stolen bases last year. “He’s just about invisible when he tags second,” Donny said, “like greased lightning.”\n“He’s quite a base runner,” Towson agreed.\nDonny had hoped to distract Towson until the sailboat passed them. It continued to keep pace at a fair distance, and now he could see that someone on deck was watching through binoculars. Towson never took his eyes off it.\n“We’ll have to report them if they take pictures,” Towson said.\n“And then what?”\n“Their cameras will be confiscated.”\n“But why? Everybody’s seen pictures of the Gleezer.”\n“I have my orders, Mr. Doyle.”\nDonny had almost been feeling friendly enough to let the government man call him by his first name, but after that exchange he decided he’d let Towson go on calling him Mr. Doyle.\n“You can’t blame people for being curious,” he said.\n“I don’t blame them for anything,” Towson replied. “I’m just following protocol.”\n“Hell of a country, ain’t it?” Donny said, “Regular people can’t even take a snapshot of the first visitor from another planet.”\n“It’s not my decision.”\n“No, I guess not. You’re only following orders, right?”\n“Yes, that’s right.”\nThis was more like talking to a brick wall than a man, Donny thought, so he gave up trying and went back to work in silence. He was relieved to see that the sailboat had tacked to the south, without anyone aboard taking pictures, as far as he could tell. He’d never seen that particular boat before, and he wondered if it had come around the back side of the island from Castine, or maybe up from Camden.\n“How’s the Gleezer doing up there?” Laurent asked, as he’d been asking every few minutes.\n“So far, okay,” Towson said.\n“Glad somebody around here’s having a good time,” Donny muttered to himself as he hefted a trap onto the deck and took a look at the contents.\n“Uh, oh,” he said, “we got some trouble, Laurent.”\n“Fight?”\n“Ayuh,” Donny said, “this fella’s missing his pincher.”\nDonny found the claw in the trap, along with a two pound male.\n“Ornery, ain’t you?” Donny said to the battle’s victor as he held it dripping up to the sunlight.\n“I’ve been wondering about something,” Laurent said to the kid.\n“What’s that, Mr. Therriault?”\n“Didn’t I tell you to call me Laurent? How did the President get along with the Gleezer?”\nThe kid didn’t say anything.\n“I mean, what did she think of it?”\n“She was courteous, cordial, and diplomatic,” Towson said, stepping in.\nAgent Fields was trying hard not to laugh, Donny noticed. Maybe the President was as repulsed by the Gleezer as he was.\nThe Gleezer didn’t seem to bother Laurent much, but that was Laurent. Nothing bothered him all that much, not even losing his wife after a quarter century of marriage. He’d probably have a new one as soon as the divorce was finalized. Donny knew a couple widows who had their eyes on his old buddy. Now that Laurent was half-owner of this peapod, he’d have to fight off the ladies when he started dating again, especially once he and Donny really got the business going, bought more boats, hired some local boys, and sold lobsters wholesale to the big supermarket and restaurant chains.\nAt least they’d already put the first part of their plan into play, even if they’d gone into hock to buy the boat.\nThat was how Donny passed the rest of the morning, daydreaming and hauling up traps, until he noticed Laurent looking worried as he gazed aft. He was watching the three Secret Servicemen.\nTowson spoke to his boys in low tones as they huddled with him. Donny couldn’t hear what he said, but he had the impression that something was wrong, especially with the way Agent Fields looked up at the net.\n“Want us to haul it in?” Laurent asked.\nTowson ignored him, almost as if he hadn’t heard him speak. He groped his way to the gunwale nearest to the net and stared straight at it.\n“What is it?” Donny said.\nTowson was very somber, and Agent Fields seemed worried. The quiet kid in the watch cap looked scared. Donny glanced at Laurent, who shrugged. He hadn’t heard what Towson had told his boys, either.\n“The visitor’s dead,” Towson said.\n“Dead . . . ?” Laurent’s mouth hung open.\n“How can that be?” Donny said, feeling as if he’d just fallen overboard. “It’s just been laying up there, sunning itself. What could have killed it?”\n“I don’t know, perhaps natural causes,” Towson said. “But it’s dead. All communication has stopped.”\n“Maybe it’s just the chip,” Laurent said.\n“No, the visitor let me know that it was dying just before the end.” Towson’s slate eyes didn’t blink.\n“Jeez,” Laurent said.\n“It can’t die on our boat,” Donny said, thinking about the possible consequences. There went all the dreams of capitalizing on the Gleezer’s little excursion around the bay. “You never even said it was sick.”\n“I didn’t know,” Towson said. “There was only so much the exobiologists could figure out.”\n“Was it very old?” Laurent said.\n“We don’t know how long its species’ lifespan normally runs.”\n“It came here to die,” Donny said, beginning to understand. “It came all the way to Earth just to die.”\n“I’m afraid so.”\nDonny looked up at the strange shape suspended over the Bay. “I wonder why?”\n“Maybe it didn’t want to make the folks back home unhappy,” Laurent ventured.\nThe two young Secret Service agents swung the winch around, and Donny ratcheted it down until the Gleezer lay on the deck, still as a stone. Nobody spoke for a long time.\n“The poor thing,” Laurent said at last.\nThe men stood in a circle around the alien’s corpse.\n“Did it suffer?” Donny asked.\n“What?” Towson said, still staring at the Gleezer.\n“Was it in pain when it died?”\n“It seemed peaceful,” Towson said, as if he were answering someone a long, long way away.\n“Should we put it in its tank, sir?” Agent Fields asked.\n“Yes, I suppose we should,” Towson said.\n“What good will that do the Gleezer now?” Donny asked.\n“None, but we don’t want it to decay. The chopper will lower a sling to take the tank back to the mainland. There’s a team staying at the suite who’ll examine it.”\n“Frank’s gonna have to make some room in the hotel freezer,” Donny said.\n“Yes, we may have to do that until arrangements can be made,” Towson said. “But for now, let’s get the visitor inside the tank.”\nDonny worked the winch. Towson turned the tank on its side, and the two younger Secret Service agents guided the dead Gleezer over to it. They tilted the net until the Gleezer’s remains slid into the environmental tank. Once Towson was sure it was completely enclosed and the tubes were coiled inside the tank, he gently shut the ramp, now positioned as the lid. The tank hissed as it locked.\nDonny didn’t know whether to admire Towson’s professionalism or to be contemptuous of his coolness. He decided to give the man the benefit of the doubt. Towson would probably be forced to retire from the Secret Service after this incident.\n“Do you think one of us should say something?” Laurent asked.\n“Say something?” Towson repeated.\n“A prayer,” Donny said.\n“Would one of you like to offer a few words?”\nIt was silent except for the gulls. The boat rocked back and forth. They all gazed at the Gleezer’s tank. No one spoke.\n“Here comes the chopper,” said the Secret Serviceman whose name Donny didn’t know.\nThe approaching helicopter made a racket overhead and dipped as the sling was lowered toward the deck. It was the work of only a few seconds to lift and secure the environmental tank inside the sling. Everyone stood back as it went up, their clothing snapping like flags in the rotor’s wind.\nThey watched the helicopter fly back toward the island.\n“I guess you’ll want us to take you in,” Laurent said.\n“If you don’t mind,” Towson said.\nLaurent went back into the pilot house.\n“I’m sorry,” Donny said to Towson.\n“Thank you, Mr. Doyle,” Towson said.\n“What will they do with the . . . body?” Donny asked.\n“I don’t know,” Towson said. “Dissection, most likely.”\nDonny nodded.\n“It’s too bad it can’t be sent home.”\n“Yes, it’s too bad,” Towson said, “but a lot can be learned from its remains.”\n“Why do you suppose it came here?” Donny asked.\n“As far as I know,” Towson said, “it never revealed anything more than its desire to visit our world.”\n“And now we’ll never know.”\n“Probably not.”\n“Imagine . . . ” Donny said.\n“Imagine what?”\n“How lonely it must have been.”\nTowson nodded. There was no more talk until they said goodbye on the pier.\n“Thank you, gentlemen,” Towson said, “on behalf of your government and myself personally.”\n“We got paid pretty well,” said Laurent, as the two younger Secret Servicemen climbed into the AIV.\n“Not enough,” Towson said. He shook hands with Laurent and Donny, and got in to join his men. “Goodbye.”\n“Bye,” Laurent said.\nThe door slid shut and the AIV backed itself up and turned around, heading up Water Street. It passed a couple of kids, who paid no attention to it.\nDonny and Laurent watched until it was out of sight.\n“Let’s get those lobsters in the tank,” Laurent said, after a while.\nThey climbed back aboard and got to work. The Gleezer’s strange scent lingered, but it was fading quickly. Donny separated one berried female from the others, and was pleased to see that her eggs were clear, not orange.\nAfter a while, he had an idea.\n“I got a name for the boat,” he said.\n“What is it?”\n“The Gleezer,” Donny said. “Like it?”\nLaurent looked out at the Bay for a moment, and then said, “Yes, I do.”\n“Know what else?”\n“What’s that?”\n“I think I’m gonna call my son tonight.”\n“Good idea,” Laurent said. “Let me know how Little Donny’s doing, will you?”\n“I sure will.”\n“I’ll call my girls too. See how everybody is.”\n“You gonna tell ’em?” Donny asked.\n“Tell ’em what?”\n“About what happened today?”\n“I guess so,” Laurent said, after a moment. “It’s not something we can keep quiet, anyway. Might as well tell ’em.”\n“Ayuh.”\nThey went back to work baiting traps.\nBehind them, the sea rolled on as it had for billions of years.\nOriginally published in Asimov’s Science Fiction, December, 2008.\nTim Sullivan is the author of the novels Destiny's End, The Parasite War, The Martian Viking, and Lords of Creation, and edited the horror anthologies Tropical Chills and Cold Shocks. He has also appeared as an actor in many movies, directed, and written several screenplays. His critically acclaimed short stories have appeared in most of the genre's major markets. He lives in South Miami, Florida with critic Fiona Kellegan.", "source": "https://clarkesworldmagazine.com/sullivan_11_15_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Way Down East by Tim Sullivan"}