{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "RMLpDCaOuzcZMz+uG2BGHu2O2Nk=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: A Quarantine Soapbox  Much like Matt Dixon’s robot on the cover of this month’s issue, I’ve felt a little boxed in this month. I’m currently in mandatory quarantine following a COVID test for the third time in the last two weeks. I should make it clear that I’m not at risk, though. This is solely for the protection of the doctors who will be performing my fifth procedure of the year. The fourth was just over a week ago, and the other quarantine was for a procedure that had to be canceled when the staff at the medical center looked at my chart and saw my history of cardiac issues.  I’ve tried to put all this time locked away to good use, as I had hundreds of packages to send out to print subscribers—all those back issues finally arrived from the new printer—and managed to get through them done ahead of schedule. The local postmaster hates me for it, but I was able to get everything to the post office during the small gap between quarantines. The packages are now making their way around the world.  Amidst test results and scheduling appointments, the 2021 Hugo Award finalists were announced. I was very pleased to see “Monster” by Naomi Kritzer and “Helicopter Story” by Isabel Fall—both from our January 2020 issue—on the ballot for Best Novelette. Unfortunately, if you go back and try to read them, you’ll only find one. Isabel’s story (originally published under another name) was removed from the issue after some particularly unpleasant and distressing online attacks and statements were made against her, the story, its defenders, and us. It’s unfortunate that legitimate and well-intentioned critiques of the story were lost among conspiracy theories and indefensible speculation about the author’s identity. We lost not only the story, but the opportunity to have a critical conversation about what it actually said. Instead, it became a story about what happened.  She ultimately requested that we remove the story for her own health, which, intended or not, was placed in jeopardy by the perpetrators of those attacks. We honored that request and continue to support Isabel’s right to have it published (or not published) where and how she sees fit. Will it return to publication? That’s Isabel’s decision and something she’s currently considering. Given all that happened, I do ask that people give her the time to properly weigh her options and respect her decision whatever it may be.  Every year, there are stories on the ballot that people don’t like or even hate. The fact of the matter is that a significant number of people believed she was worthy, and legitimately honored her work. We celebrate both Isabel’s and Naomi’s nominations and all the other works/people on the ballot this year, even the ones we didn’t personally like or necessarily agree with.  This nomination is a big deal to Isabel, her fans, and us. It would be nice if more people would have respect for the moment, but in the Twitter age that would be nothing short of miraculous. Knowing it would come, even with the title change, the rain on the parade still felt painfully and disappointingly fast. However, to honor that side of the equation with more oxygen would simply add further insult to existing injury. Instead, we’d like to address the larger group of people we saw more cheering her on (publicly and privately). Your respect, support, and kind words mean more than you know. You are very much appreciated. Special kudos also go to the few people that actually apologized for their role in the original abuse. That gives hope where it is needed.  Stepping off my soapbox, I’d also like to thank the people who saw fit to nominate me for Best Editor Short Form. This is my ninth time on the ballot, and it never gets old. I’m currently 0-8, but this is a historically tough category. I’ve had the honor of losing to some of my favorite editors in the field and perhaps someday they’ll be able to say the same of me. In the meantime, I’m just thrilled to be a part of the gang. Thank you.  That’s all I have for now. I must return to my quarantine box. By the time you read this, my next (and almost definitely last) procedure will be completed. Hopefully without the unexpected. I look forward to all of us having a wonderful and safe May. Take care! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: A Quarantine Soapbox\nMuch like Matt Dixon’s robot on the cover of this month’s issue, I’ve felt a little boxed in this month. I’m currently in mandatory quarantine following a COVID test for the third time in the last two weeks. I should make it clear that I’m not at risk, though. This is solely for the protection of the doctors who will be performing my fifth procedure of the year. The fourth was just over a week ago, and the other quarantine was for a procedure that had to be canceled when the staff at the medical center looked at my chart and saw my history of cardiac issues.\nI’ve tried to put all this time locked away to good use, as I had hundreds of packages to send out to print subscribers—all those back issues finally arrived from the new printer—and managed to get through them done ahead of schedule. The local postmaster hates me for it, but I was able to get everything to the post office during the small gap between quarantines. The packages are now making their way around the world.\nAmidst test results and scheduling appointments, the 2021 Hugo Award finalists were announced. I was very pleased to see “Monster” by Naomi Kritzer and “Helicopter Story” by Isabel Fall—both from our January 2020 issue—on the ballot for Best Novelette. Unfortunately, if you go back and try to read them, you’ll only find one. Isabel’s story (originally published under another name) was removed from the issue after some particularly unpleasant and distressing online attacks and statements were made against her, the story, its defenders, and us. It’s unfortunate that legitimate and well-intentioned critiques of the story were lost among conspiracy theories and indefensible speculation about the author’s identity. We lost not only the story, but the opportunity to have a critical conversation about what it actually said. Instead, it became a story about what happened.\nShe ultimately requested that we remove the story for her own health, which, intended or not, was placed in jeopardy by the perpetrators of those attacks. We honored that request and continue to support Isabel’s right to have it published (or not published) where and how she sees fit. Will it return to publication? That’s Isabel’s decision and something she’s currently considering. Given all that happened, I do ask that people give her the time to properly weigh her options and respect her decision whatever it may be.\nEvery year, there are stories on the ballot that people don’t like or even hate. The fact of the matter is that a significant number of people believed she was worthy, and legitimately honored her work. We celebrate both Isabel’s and Naomi’s nominations and all the other works/people on the ballot this year, even the ones we didn’t personally like or necessarily agree with.\nThis nomination is a big deal to Isabel, her fans, and us. It would be nice if more people would have respect for the moment, but in the Twitter age that would be nothing short of miraculous. Knowing it would come, even with the title change, the rain on the parade still felt painfully and disappointingly fast. However, to honor that side of the equation with more oxygen would simply add further insult to existing injury. Instead, we’d like to address the larger group of people we saw more cheering her on (publicly and privately). Your respect, support, and kind words mean more than you know. You are very much appreciated. Special kudos also go to the few people that actually apologized for their role in the original abuse. That gives hope where it is needed.\nStepping off my soapbox, I’d also like to thank the people who saw fit to nominate me for Best Editor Short Form. This is my ninth time on the ballot, and it never gets old. I’m currently 0-8, but this is a historically tough category. I’ve had the honor of losing to some of my favorite editors in the field and perhaps someday they’ll be able to say the same of me. In the meantime, I’m just thrilled to be a part of the gang. Thank you.\nThat’s all I have for now. I must return to my quarantine box. By the time you read this, my next (and almost definitely last) procedure will be completed. Hopefully without the unexpected. I look forward to all of us having a wonderful and safe May. Take care!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_05_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Quarantine Soapbox by Neil Clarke"}