{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Pat Presley", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1qgmxPaIsrtzKglFJ3SLlZvcDM8=", "id": null, "license": null, "comments": "", "raw_text": "Cover Art  Postcards from Asia: The Floodplain    Pat Presley was born in the oldest part of Bangkok, The Rattanakosin Island, where he grew up in what he believed to be a haunted house full of snakes, trees, and ancient relics his grand-uncle collected. Besides attending an old French missionary school, he learned from watching. When it was the time to further his education he hoped to become a doctor just to make a lot of money, but then decided he best be an idealistic architect. Neither one panned out, so he stopped making plans and relearned everything from scratch. Pat went back to drawing late into the night and remembered how great it was to be a kid who gets to stay up way past his bedtime.  Although some people wonder about his age, he was old enough to see Star Wars in the theater.", "text": "Cover Art\nPostcards from Asia: The Floodplain\nPat Presley was born in the oldest part of Bangkok, The Rattanakosin Island, where he grew up in what he believed to be a haunted house full of snakes, trees, and ancient relics his grand-uncle collected. Besides attending an old French missionary school, he learned from watching. When it was the time to further his education he hoped to become a doctor just to make a lot of money, but then decided he best be an idealistic architect. Neither one panned out, so he stopped making plans and relearned everything from scratch. Pat went back to drawing late into the night and remembered how great it was to be a kid who gets to stay up way past his bedtime.\nAlthough some people wonder about his age, he was old enough to see Star Wars in the theater.", "source": "https://clarkesworldmagazine.com/artbio_145/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Postcards from Asia: The Floodplain by Pat Presley"}