{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "8xVuLWhK0BSyaW/9jCCqe8UOvy0=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Sharp-pointed Tendrils & the Span of Control: A Conversation with Jay Lake  A village girl sold by her father to be raised as a courtesan and trained to kill. A dwarf with sewn together lips. A mechanical man. A city on the brink of destruction. Secret societies, giant mechanisms in the sky, top secret airplanes, and an equatorial wall reaching to the sky. These are but a few of the elements of Jay Lake's many stories and novels.  A diplomat's son, Lake traveled the world in his youth and finally settled in Portland, Oregon. In the last ten years, he's published more than 240 short stories, garnering him the John W. Campbell Award for Best New Writer and nominations for the Hugo and World Fantasy Awards. He compiled many of his recent short stories in The Sky That Wraps.  After seven novels, including Mainspring, Green, Madness of Flowers, and Death of a Starship, Lake continues to pursue, as he says below, \"themes of responsibility and belonging/alienation, personhood and choice.\"  Ultimately, he said, he writes about, \"Story. People. Language. Love. Responsibility. Justice, or the lack thereof. Decisions and consequences. Writing is like living, every day is different.\"  These days Lake is battling cancer with the same openness, courage, and twisted brilliance that he has applied to his craft over the last decade. He often blogs about his treatment and recovery. With super-human tenacity, he refuses to let cancer rob him of his life and voice.  \"Fiction at its best opens the mind and heart,\" said Lake. \"Speculative fiction is just one way to do that. I fell in love with the genre as a grade-schooler, and it's where my passion lies. If my passion were detective stories or nurse romances or narrative nonfiction about the history of arts and crafts, I'd probably feel much the same way.\"  Below, Lake and I talk about movement, sharp-pointed tendrils, and stories yet to be written.    You grew up in Taiwan and Nigeria, moved around often, attended a top tier boarding school in New England and went to college in Texas... and you now live in Portland, Oregon. I'm betting that you've lived in a mess of other places as well. How has all this movement in your life influenced your writing? Influenced your sense of movement and place in your fiction?  Oh, I've been a lot of places. Will go to a lot more if my life permits me. Though I do think Portland is a permanent home base at this point in my life.  All that moving around has given me an incredibly sharp sense of place, of setting. Likewise for physical detail. When I first started writing seriously, around 1990, I was reasonably good at those. Plot and characterization skills were alarmingly lacking — I'm still growing into those — but the landscape of the world is burned deeply into me as a result of my peripatetic childhood.  There's a deeper thematic issue that runs through both my real life and my writing that arises from this sense of movement. I have no hometown. I'm not \"from\" anywhere. So identity, place, the Wolfeian return home; these things permeate and perhaps even dominate my work. Not purposefully. I just find them there, whether I meant to put them in or not.  What comes first — character, setting, plot, image, sight, sound, or something else?  Occasionally a title, but usually a concept. Could be something as simple as a name, a telling detail, a set piece or an action being taken by a character. My definition of a \"story idea\" is much looser than most writers of whom I am aware. That's because, especially at short length, I am a \"follow the headlights\" writer. I rarely know a damned thing about my endings until well after I've finished the piece. If then.  So a short story grows from this seed, then proceeds in a linear fashion. I've written out of reading order a handful of times in my life, even in work with fairly complex and self-referential structure. To me writing seems to be an extension of reading, except from a book that's not on the page until I got to it.  My novels are a bit more organized, though that process has evolved. I used to mightily resist outlining. It seemed to take the creative snap out for me. I was pushed to do it for commercial and contractual reasons. Now they are becoming more and more weighty and complex. Trial of Flowers had a five paragraph outline back around 2005. Kalimpura's outline, just completed, clocks in well over thirty pages.  By the time I start writing a novel, a whole lot of that stuff is in place. The novel grows from there. I have books a-borning in my head which have been gestating for years. Sunspin. Original Destiny, Manifest Sin. Someday they will spring to life, miraculous and replete with complexity. But they will do this through the magic of outlines. (Sunspin's incomplete outline currently stands at 70 pages or so.)  How did you go about building the world of the novel Green? Was the process similar to or different from that of creating Clockwork Earth?  The Clockwork Earth was created as a conceit at a workshop in response to an exercise, and eventually morphed into a series of trade novels. So it was very top-down in terms of design and execution.  Green, on the other hand, began life as a short story of the same title published in Aeon magazine. So it grew organically, as I noted previously, before sprouting into a finished whole. Oddly, I used the short story as the outline of the first third of the book. That expanded 7,000 words into about 50,000 words. The balance of the book riffed from there, with me extracting the world-building in a sort of fit of ret-conning from the short story.  Are you still writing a story a week? What are the benefits of writing fast and writing often? Draw-backs?  Novels, and cancer, have taken a story a week away long since. Once I was working seriously on novels, with their rather eccentric production cycles, I simply couldn't also sustain a short story a week. I write the equivalent, or more, wordage annually, less the time taken off these past few years for surgeries and chemotherapy. It's just structured differently.  I still write fast. In fact, my challenge has been to slow down. I can't write too slowly, any more than I can ride a bicycle too slowly. I wobble and lose control. But the benefit is that you wind up with words on the page. That is, after all, the core fungible commodity of the writer. Also, I have a short attention span. If it took me years to write a novel, I think I'd have to find another passion.  Draw-backs to writing quickly can include a tendency to gloss over things and a certain lack of depth in one's fiction. Part of my journey as a writer has been learning to use the revision process as away to interpose a certain steeping of quality between the initial work and the final. I have the odd problem of writing quite clean first drafts. That is a temptation to laziness in revision, quite frankly. One I have to work consciously to overcome, even now.  How does a short story work on the reader?  With little, sharp-pointed tendrils that slide behind the eyeballs and tweak the brain. A story, at any length, is a form of mind control practiced by the author on the (usually) willing reader. \"I have a vision and I hereby impart it to you.\" The mechanics of imparting that vision are both the craft and magic of story-telling. As to how it works, there are nine and ninety ways...  Is there a landmark story in your career? Can you talk some about the writing of that story?  Oh, if there is one it's probably \"Into the Gardens of Sweet Night.\" That story won first place in Writers of the Future, was on the 2004 Hugo ballot for Best Novelette, and was a key part of me winning the John W. Campbell Award for Best New Writer.  I wrote it for Bruce Holland Rogers, of all things, for an anthology he was editing back in 2002. It was dreadfully overlength and he didn't take it, though I did sell him another story called \"The Courtesy of Guests.\" I workshopped \"Gardens\" with the Wordos in Eugene, Oregon, and sent it off to Writers of the Future.  One thing to note about that story is that when I wrote it, the piece was well outside my span of control. That's a concept I picked up from my work in business consulting, but in writing I use it to refer to the idea that one can hold a certain amount of story in one's head — character, plot, continuity, etc. Back in 2002-2003, my span of control was perhaps 6,000 words. Anything longer, such as \"Gardens\", required laborious effort on my part to keep straight. Writing within my span of control is an organic, joyful process. Writing beyond it was damned hard work.  These days my span of control is about 200,000 words. So unless I'm writing a doorstop trilogy (Sunspin), I can keep an entire novel spinning in my head throughout the drafting process. That's not to say I don't make mistakes, but they are readily remedied on revision.  An observation I would make to writers at any career level is to examine their span of control and consider what it might mean to them to expand it. I suspect most successful working pros can do what I do, or do it even better. But it's definitely a learned skill, acquired through extensive practice.  Did you enjoy compiling The Sky That Wraps? Any stories not make the cut that you wish had? Notice any patterns or learn any lessons from looking through all those stories? How has your understanding of the form changed since your first efforts?  Oh, heck yeah that was fun. I just wish I could have included more of my work. I don't suppose there's anything I really wish I could have included that I wound up not including, but the winnowing process was certainly a challenge.  With a few exceptions, The Sky That Wraps is all work of the last couple of years. I didn't really get a retrospective on my own work while compiling it, in a developmental sense. I certainly saw my own themes of responsibility and belonging/alienation, personhood and choice reflected through much of the fiction I selected.  As for my understanding of the form, the more I do this, the less I understand it. Maybe someday I'll start getting smarter again. This past decade of my career has been a movement from process to instinct.  What have you learned from workshopping with newer writers?  Everything? I love workshopping with newer writers, because it forces me to think about aspects of fiction and craft that in many cases I have long since subsumed into subconsciousness. I can re-examine my own work and my own assumptions. Plus it's a way to pay forward, to honor and thank the dozens and dozens of writers who have aided and mentored me over the years, and continue to do so.  Who are you reading these days? Whose work excites you?  I spent the first six months of this year in chemotherapy, which pretty much robbed me of my ability to read new fiction. I've just had half my liver removed for a suspected metastasis after chemo (it turned out not to be so on the pathology report, but there was no other way to find out), so that has further clouded my mind. Counting the surgery last year, it's been well over a year since I've done any significant new reading.  Which really, really sucks.  Even so, I try. I have a Paul Haines book next up on my pile. At the beginning of chemo I managed to read Jeff VanderMeer's brilliant Finch. I really want to read Amelia Beamer's new zombie novel. We have so many terrific writers, and even without cancer, my own writing career has put a real crimp in my reading time. Ultimately they come out of the same time budget, unfortunately.  If you could see around corners and into the future, what do you think the literary landscape will look like in ten years?  My eyes don't reach that far. Fragmented, confused, tottering on the brink of death, populated by disrespectful young turks, cranky old farts, and disruptive business models. In other words, pretty much like today.  What's next for you?  Some time without chemo or surgery. Kalimpura, the third Green book. If the cancer wolf stays away from the door, Sunspin. Short fiction. Articles. My kid. Life. Love.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nSharp-pointed Tendrils & the Span of Control: A Conversation with Jay Lake\nA village girl sold by her father to be raised as a courtesan and trained to kill. A dwarf with sewn together lips. A mechanical man. A city on the brink of destruction. Secret societies, giant mechanisms in the sky, top secret airplanes, and an equatorial wall reaching to the sky. These are but a few of the elements of Jay Lake's many stories and novels.\nA diplomat's son, Lake traveled the world in his youth and finally settled in Portland, Oregon. In the last ten years, he's published more than 240 short stories, garnering him the John W. Campbell Award for Best New Writer and nominations for the Hugo and World Fantasy Awards. He compiled many of his recent short stories in The Sky That Wraps.\nAfter seven novels, including Mainspring, Green, Madness of Flowers, and Death of a Starship, Lake continues to pursue, as he says below, \"themes of responsibility and belonging/alienation, personhood and choice.\"\nUltimately, he said, he writes about, \"Story. People. Language. Love. Responsibility. Justice, or the lack thereof. Decisions and consequences. Writing is like living, every day is different.\"\nThese days Lake is battling cancer with the same openness, courage, and twisted brilliance that he has applied to his craft over the last decade. He often blogs about his treatment and recovery. With super-human tenacity, he refuses to let cancer rob him of his life and voice.\n\"Fiction at its best opens the mind and heart,\" said Lake. \"Speculative fiction is just one way to do that. I fell in love with the genre as a grade-schooler, and it's where my passion lies. If my passion were detective stories or nurse romances or narrative nonfiction about the history of arts and crafts, I'd probably feel much the same way.\"\nBelow, Lake and I talk about movement, sharp-pointed tendrils, and stories yet to be written.\nYou grew up in Taiwan and Nigeria, moved around often, attended a top tier boarding school in New England and went to college in Texas... and you now live in Portland, Oregon. I'm betting that you've lived in a mess of other places as well. How has all this movement in your life influenced your writing? Influenced your sense of movement and place in your fiction?\nOh, I've been a lot of places. Will go to a lot more if my life permits me. Though I do think Portland is a permanent home base at this point in my life.\nAll that moving around has given me an incredibly sharp sense of place, of setting. Likewise for physical detail. When I first started writing seriously, around 1990, I was reasonably good at those. Plot and characterization skills were alarmingly lacking — I'm still growing into those — but the landscape of the world is burned deeply into me as a result of my peripatetic childhood.\nThere's a deeper thematic issue that runs through both my real life and my writing that arises from this sense of movement. I have no hometown. I'm not \"from\" anywhere. So identity, place, the Wolfeian return home; these things permeate and perhaps even dominate my work. Not purposefully. I just find them there, whether I meant to put them in or not.\nWhat comes first — character, setting, plot, image, sight, sound, or something else?\nOccasionally a title, but usually a concept. Could be something as simple as a name, a telling detail, a set piece or an action being taken by a character. My definition of a \"story idea\" is much looser than most writers of whom I am aware. That's because, especially at short length, I am a \"follow the headlights\" writer. I rarely know a damned thing about my endings until well after I've finished the piece. If then.\nSo a short story grows from this seed, then proceeds in a linear fashion. I've written out of reading order a handful of times in my life, even in work with fairly complex and self-referential structure. To me writing seems to be an extension of reading, except from a book that's not on the page until I got to it.\nMy novels are a bit more organized, though that process has evolved. I used to mightily resist outlining. It seemed to take the creative snap out for me. I was pushed to do it for commercial and contractual reasons. Now they are becoming more and more weighty and complex. Trial of Flowers had a five paragraph outline back around 2005. Kalimpura's outline, just completed, clocks in well over thirty pages.\nBy the time I start writing a novel, a whole lot of that stuff is in place. The novel grows from there. I have books a-borning in my head which have been gestating for years. Sunspin. Original Destiny, Manifest Sin. Someday they will spring to life, miraculous and replete with complexity. But they will do this through the magic of outlines. (Sunspin's incomplete outline currently stands at 70 pages or so.)\nHow did you go about building the world of the novel Green? Was the process similar to or different from that of creating Clockwork Earth?\nThe Clockwork Earth was created as a conceit at a workshop in response to an exercise, and eventually morphed into a series of trade novels. So it was very top-down in terms of design and execution.\nGreen, on the other hand, began life as a short story of the same title published in Aeon magazine. So it grew organically, as I noted previously, before sprouting into a finished whole. Oddly, I used the short story as the outline of the first third of the book. That expanded 7,000 words into about 50,000 words. The balance of the book riffed from there, with me extracting the world-building in a sort of fit of ret-conning from the short story.\nAre you still writing a story a week? What are the benefits of writing fast and writing often? Draw-backs?\nNovels, and cancer, have taken a story a week away long since. Once I was working seriously on novels, with their rather eccentric production cycles, I simply couldn't also sustain a short story a week. I write the equivalent, or more, wordage annually, less the time taken off these past few years for surgeries and chemotherapy. It's just structured differently.\nI still write fast. In fact, my challenge has been to slow down. I can't write too slowly, any more than I can ride a bicycle too slowly. I wobble and lose control. But the benefit is that you wind up with words on the page. That is, after all, the core fungible commodity of the writer. Also, I have a short attention span. If it took me years to write a novel, I think I'd have to find another passion.\nDraw-backs to writing quickly can include a tendency to gloss over things and a certain lack of depth in one's fiction. Part of my journey as a writer has been learning to use the revision process as away to interpose a certain steeping of quality between the initial work and the final. I have the odd problem of writing quite clean first drafts. That is a temptation to laziness in revision, quite frankly. One I have to work consciously to overcome, even now.\nHow does a short story work on the reader?\nWith little, sharp-pointed tendrils that slide behind the eyeballs and tweak the brain. A story, at any length, is a form of mind control practiced by the author on the (usually) willing reader. \"I have a vision and I hereby impart it to you.\" The mechanics of imparting that vision are both the craft and magic of story-telling. As to how it works, there are nine and ninety ways...\nIs there a landmark story in your career? Can you talk some about the writing of that story?\nOh, if there is one it's probably \"Into the Gardens of Sweet Night.\" That story won first place in Writers of the Future, was on the 2004 Hugo ballot for Best Novelette, and was a key part of me winning the John W. Campbell Award for Best New Writer.\nI wrote it for Bruce Holland Rogers, of all things, for an anthology he was editing back in 2002. It was dreadfully overlength and he didn't take it, though I did sell him another story called \"The Courtesy of Guests.\" I workshopped \"Gardens\" with the Wordos in Eugene, Oregon, and sent it off to Writers of the Future.\nOne thing to note about that story is that when I wrote it, the piece was well outside my span of control. That's a concept I picked up from my work in business consulting, but in writing I use it to refer to the idea that one can hold a certain amount of story in one's head — character, plot, continuity, etc. Back in 2002-2003, my span of control was perhaps 6,000 words. Anything longer, such as \"Gardens\", required laborious effort on my part to keep straight. Writing within my span of control is an organic, joyful process. Writing beyond it was damned hard work.\nThese days my span of control is about 200,000 words. So unless I'm writing a doorstop trilogy (Sunspin), I can keep an entire novel spinning in my head throughout the drafting process. That's not to say I don't make mistakes, but they are readily remedied on revision.\nAn observation I would make to writers at any career level is to examine their span of control and consider what it might mean to them to expand it. I suspect most successful working pros can do what I do, or do it even better. But it's definitely a learned skill, acquired through extensive practice.\nDid you enjoy compiling The Sky That Wraps? Any stories not make the cut that you wish had? Notice any patterns or learn any lessons from looking through all those stories? How has your understanding of the form changed since your first efforts?\nOh, heck yeah that was fun. I just wish I could have included more of my work. I don't suppose there's anything I really wish I could have included that I wound up not including, but the winnowing process was certainly a challenge.\nWith a few exceptions, The Sky That Wraps is all work of the last couple of years. I didn't really get a retrospective on my own work while compiling it, in a developmental sense. I certainly saw my own themes of responsibility and belonging/alienation, personhood and choice reflected through much of the fiction I selected.\nAs for my understanding of the form, the more I do this, the less I understand it. Maybe someday I'll start getting smarter again. This past decade of my career has been a movement from process to instinct.\nWhat have you learned from workshopping with newer writers?\nEverything? I love workshopping with newer writers, because it forces me to think about aspects of fiction and craft that in many cases I have long since subsumed into subconsciousness. I can re-examine my own work and my own assumptions. Plus it's a way to pay forward, to honor and thank the dozens and dozens of writers who have aided and mentored me over the years, and continue to do so.\nWho are you reading these days? Whose work excites you?\nI spent the first six months of this year in chemotherapy, which pretty much robbed me of my ability to read new fiction. I've just had half my liver removed for a suspected metastasis after chemo (it turned out not to be so on the pathology report, but there was no other way to find out), so that has further clouded my mind. Counting the surgery last year, it's been well over a year since I've done any significant new reading.\nWhich really, really sucks.\nEven so, I try. I have a Paul Haines book next up on my pile. At the beginning of chemo I managed to read Jeff VanderMeer's brilliant Finch. I really want to read Amelia Beamer's new zombie novel. We have so many terrific writers, and even without cancer, my own writing career has put a real crimp in my reading time. Ultimately they come out of the same time budget, unfortunately.\nIf you could see around corners and into the future, what do you think the literary landscape will look like in ten years?\nMy eyes don't reach that far. Fragmented, confused, tottering on the brink of death, populated by disrespectful young turks, cranky old farts, and disruptive business models. In other words, pretty much like today.\nWhat's next for you?\nSome time without chemo or surgery. Kalimpura, the third Green book. If the cancer wolf stays away from the door, Sunspin. Short fiction. Articles. My kid. Life. Love.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/lake_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sharp-pointed Tendrils & the Span of Control: A Conversation with Jay Lake by Jeremy L. C. Jones"}