{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jack Skillingstead", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "e4Q9Q3foj17s+EKzsMFjLz3UEnQ=", "id": null, "license": null, "comments": "", "raw_text": "7500 words, short story  The Sum of Her Expectations  Amrita stabilized the escape pod. Her hands were shaking; she had barely gotten out. The Meghnad Saha, a Class B planet surveyor she’d called home, retreated from the aft view screen, dropping rapidly from the orbital plane, pulled down by a force from the planet.  “Tripp?” Amrita said.  After a moment, a voice from the surveyor: “It doesn’t appear I’m going to be able to stop this thing.”  “You should have come with me in the pod.”  “Hindsight. I’ll keep trying. Here comes the blackout. Goodbye. Sorry . . . ”  “Tripp?”  Nothing.  Amrita tracked the Meghnad Saha all the way to the surface. She tried repeatedly to resume contact but Tripp wouldn’t answer. Transcyber Reactive Positronic Personality: Tripp, for short, and the only friend Amrita had, or wanted. If he survived the crash, she wasn’t about to abandon him. She blinked tears away and began to configure her escape pod for descent.  The Kabbhan forbade landing on Trappist-1e, or even approaching the planet within a designated radius of three hundred thousand kilometers. Because the Kabbhan stargates had made interstellar travel possible for humans in the first place, everyone respected this single restriction. Everybody but Amrita, who was signatory to no such agreement.  A proximity alert began beeping in the escape pod. Amrita considered a quick burn for radical descent. Get down before anyone could stop her. But it was already too late.  The Kabbhan star cruiser emerged like a sperm whale from a shot glass. Above the planet’s horizon an elongated node appeared, squeezed forth, and popped: the cruiser, bigger than anything Melville dreamed of, came alongside Amrita’s two-seat escape pod in synchronous orbit one hundred and eighty kilometers above the planet’s largest continental mass. Amrita put her nose to the viewport. A massive wall shut out the stars.  With the back of her hand she wiped sweat off her upper lip, and waited. Eventually, the alien spoke, via comlink—at least it appeared that way. The green comlink indicator blinked on Amrita’s vaporware display, and she heard the expected transmission hiss. But she knew Kabbhan technology was not what it appeared to be. Even calling it technology was a mistake.  Earth ship. Prepare to receive Kabbhan personnel.  “What?”  Out of nowhere, a man appeared at her elbow, already strapped into the right seat. Amrita would have jumped out of her skin, if that were possible. Actually, it was possible; the Kabbhan had demonstrated as much by becoming the only known race to have achieved transphysical migration.  “Who the hell are you?” she demanded.  The man turned to her. “The sum of your expectations.”  “I’ve heard that one before. You’re a Kabbhan presentation?”  The Kabbhan probed minds to find materials with which to construct compatible presentations. A Kabbhanian presentation acted as a surrogate presence. No one had ever seen an actual Kabbhan and very few had seen their presentations. Those who had seen a presentation reported a disorienting experience. While the presentation existed only in the probed subject’s mind, it activated all the necessary neural and sensory pathways to create an apparently physical manifestation. Apparent to the one being probed, at least. In short, the right seat was empty.  “You may regard me as Dad.”  “Dad! I don’t think so. Besides, you don’t even look like him.”  Not that Amrita remembered her father, her “dad,” except as a degraded holo she’d discovered in a lockbox after her mother died. Among the few important documents still mandated to exist in physical form were scattered a handful of personal items, trinkets accumulated over a long life. Amrita used her thumbnail to pry open a silver locket stamped with an impression of Shiva—and wham! her father leaped out and stood flickering before her. She knew it was her father, because who else could it be? Old fashioned hololockets like this one had been romantic keepsakes when Amrita’s mother was young, and she had only ever loved one man—as she frequently reiterated. In later years, after she found happiness with a microbiologist named Brenda on the colony world Deneb V1, she added: One was enough.  The holo had been that of a young man, handsome, after a predictable fashion. But there was a sly, cunning light in his eye that suggested a con man’s motivations. Eye, not eyes. The holo’s degradation had turned Amrita’s young father into a puzzle of many missing pieces—including the piece with his right eye. A therapist had once suggested that Amrita had spent her life, unconsciously of course, searching for the missing pieces of dear old dad. It accounted for her lack of respect for rules and authority figures. Amrita responded: “You’re joking, right?” She had been under court order to participate in ten therapeutic sessions. The court order came as a result of a juvenile misadventure involving a stolen moon skimmer and a high-speed chase across the Mare Serenitatis. Had she been eighteen instead of thirteen, the consequences would have been dire, not therapeutic. The “You’re joking” remark had been in session number two. The next eight preceded unproductively.  This Kabbhan presentation didn’t look anything like the holo. It was older, for one thing. A man of late middle age, with silver-streaked hair combed back in a pompadour, and wrinkles around his brown eyes.  “There is no error,” he said.  “I hope you don’t think you’re going to stop me. Because I’m telling you right now, I am going down there to get my friend.”  “Stopping you isn’t my intention. I’m here to assure your survival. We Kabbhan feel a certain responsibility towards less evolved species endangered by our discarded artifacts, even though our warnings have been explicit. Shall we descend now? If you are prepared, of course.”  “I’m prepared. Dad.”  Amrita manipulated vaporware toggles, like twiddling fingers in a particularly well-organized steam cloud. The pod altered orbital trajectory, and Trappist-1e’s very large horizon became larger still. Amrita glanced at the rearview screen. The Kabbhan starship was gone, as if it had never been there. And it hadn’t been. Like Dad, the ship had been the sum of Amrita’s expectations, this time in regards to alien spacecraft. The Kabbhan thought that beings stuck in the physical required corresponding illusions. Maybe they were right.  Amrita’s escape pod burned through the atmosphere at hypersonic speed. Curtains of fire fluttered across the ports, then blew away, revealing an expanse of salmon-colored twilight. It was midday on Trappist-1e and as bright as it ever got. Six more alphabet planets hung in the sky like a God’s game of crescents and balls.  From altitude, the self-expanding megalopolis looked like a continent-covering crust, an eczema salted with glittering lights.  “What a sight,” Amrita said.  Dad nodded. “When the last of us migrated out of the physical, the automated city-builders on this colony planet ran amok. That was more than a hundred Sol years ago, by your time measure.”  “There’s so much.”  “Indeed. Construction has proceeded unchecked, consuming every available mineral resource, husking out the planet even as it gradually covers its surface with an abandoned-before-built city.”  “What happens when the builders run out of land?”  “They continue into the sea, erecting piers and floating platforms on the surface, and submerged suburbs of pressure domes and interlinking tubular passageways. They can and do build anything.”  Amrita banked the escape pod and dropped several thousand meters, slipping across the sky at dizzying speed. She felt it in her gut, the swoop of gravity-assisted acceleration. Dad sat placidly, watching out the port. As they drew nearer, details emerged from the crust. Towers, blocks, domes, heptagons, pyramids, complex ribbons of transportation infrastructure . . .  “There,” Dad said.  A trench of smoldering destruction. Amrita slowed the pod’s descent, swooped in close, and hovered. Machines, like giant stalk-legged spiders, swarmed the trench, collecting into piles the remains of shattered buildings. Energy beams fired from the spiders’ underbellies. Brilliant flashes, like small nuclear detonations, burst upon Amrita’s eyeballs. She looked away and spent a few seconds blinking the blue-white afterimages out of her eyes. When she looked back, the debris had been reduced to slag.  “The city-builders will digest the material,” Dad said, “and recycle it into the construction matrix.”  The builders, or nanoswarms, grew buildings from the ground up. Even now, the trench gradually filled with new growth, like an invisible surgeon knitting a wound.  Amrita flew her pod over the trench. At the end of it lay the Meghnad Saha, broken-backed and nose up. Smoke trailed from rents in the engine compartment and crew cabin, while instruments of the city proceeded with dissection. Giant mechanical mantises peeled off titanium plates, like strips of bark from a fallen tree. They cast the plates down for the spiders to gather, evaluate, and slag.  Amrita loitered above the spectacle. She opened a channel. “Tripp?”  White noise.  Dad said, “He may not have survived.”  “Or he may have survived.”  Dad put his hand over hers. Amrita’s parietal lobe received nerve impulses, as though someone was actually touching her skin. Dad’s eyes swam with empathy, which she didn’t trust. “I need to know for certain,” Amrita said, and pushed her hand forward. The illusion of Dad’s fingers slid away. She reached into the vaporware display, activated the sensor array, and swept the wreckage.  “He’s not there. I don’t read his power core’s signature.”  “Perhaps he has been digested.”  “The radioactive core would still register.”  Amrita broadened the search, scanning the surrounding area as rapidly as possible, worried that the builders would take notice and pull her down with tractor beams, just as they’d done to the Meghnad Saha. Then Tripp’s signature appeared. “Got him! He’s on the move.”  She locked down the location and deactivated the sensor array. “Do you think the builders know I’m here?” Her pod was shielded from sensor examination, but then the Meghnad Saha had been, too.  “I’m afraid they do now, Pumpkin.”  Pumpkin?  That was the color of the Martian sky above Burroughsville, the main Cydonia colony, where Amrita spent her first six years. Her real dad had never called her ‘Pumpkin’ or anything else that she recalled. She had only one vague and retreating memory of him walking out the door of their hab. She didn’t remember him; she remembered his back as he walked away. She remembered the door sliding closed, leaving her fatherless. She remembered her mother’s tears. And anger. Not long after that her mother requested reassignment to Luna, dragging Amrita along to the land of stark desert contrasts and no friends. The moon skimmer incident was inevitable, and would have happened sooner, if Amrita had been tall enough to reach the controls.  Pumpkin was what Ideal Dad called her—back when she was five years old and in need of a father who called her something, anything. Ideal Dad: AKA made-up-dad: AKA Kabbhan presentation. From the quantum flux the Kabbhan had probed her mind and found a ghost who had never lived. Amrita now recognized the physical template, though, the silvered pompadour, the kind eyes. They belonged to a man she used to see walking around the buried corridors between Burroughsville habs. Some kind of maintenance man, originally from New Delhi, on Earth.  “Please,” she said to the presentation, “don’t call me that again.”  Dad nodded. “All right, Amrita.”  “Nobody in my life has ever called me ‘Pumpkin.’”  Dad listened respectfully.  “And don’t look at me that way, either.” Amrita said.  “I’m sorry. Am I looking at you incorrectly?”  Amrita narrowed her eyes. “Are you being funny?”  “I doubt it. Before the Great Migration I was considered by my friends to be on the dour side. Also, in the quantum flux, no one tells jokes. We Kabbhan no longer exist as individuals, except when it becomes necessary to create a presentation. Telling jokes in the flux would be like telling jokes to a mirror.”  “I don’t know if you’re being serious.”  “Then I am a poor communicator, which is a failing I was not accused of prior to migration.”  “Okay, that’s plenty.”  “Plenty?”  “Of you talking.”  Amrita looked for a place to set down. She flexed her hands, worried. “The builders won’t attack?”  “Attack? The builders don’t attack anything. They’re hungry for building material, that’s all.”  “It looked like they were attacking the Meghnad Saha.”  “Preparing it for digestion,” Dad said. “Local resources are finite. The builders hunt constantly for materials. When your surveyor skimmed the atmosphere it became a potential resource. You were warned of this, were you not?”  “I shielded the ship. It should have been invisible.” Amrita had been attracted to Trappist-1e by its forbiddenness. She had wanted to see what no human had seen, and she wanted to see it because everyone from the Kabbhan themselves to the Gate Authority in the Epsilon Cygni system had told her she couldn’t.  “Insufficient,” Dad said. “Your sensor scan revealed you.”  “All right. Will the builders try to digest me?”  “Of course not. They don’t digest living organisms.”  “That’s great for me, but Tripp isn’t a living organism.”  Amrita concentrated on her maneuvering controls. She lowered the pod between soaring towers that reduced even the twilight to full night. Landing lights planted cones on a pristine avenue no Kabbhan (or human, for that matter) had ever trod. Gear extended, and moments later pneumatic suspension units absorbed the pod’s touchdown.  Amrita idled the engines and unstrapped. “Tripp is close. I’ll go get him. When I come back, you’ll have to give up your seat.”  Dad nodded. “Of course. I’m not actually in the seat, anyway. But I don’t think you should leave the pod.”  “Why not?”  “The builders won’t harm a living organism, but once you climb out, the pod will become a construction resource. They seized your planet surveyor only after you abandoned ship.”  Amrita bristled. “I didn’t abandon anything. Tripp shoved me into the pod. He overreacted to the builder’s tractor beam.”  “Yes. It wouldn’t have pulled the ship down, not while you were aboard.”  “Tripp was trying to protect me.”  Dad regarded her empathetically. “I see.”  Amrita switched on her comlink. “Tripp? You’re out there. Answer me.”  He didn’t reply.  “He’s probably turned off his communication device. Receiving your signal might direct the builders to him. Amrita, remaining here is dangerous.”  “You said the builders wouldn’t digest a living organism.”  “No. But once you walk away, your ship becomes a resource. I suggest you fly us out of the city. I will give you a safe destination.”  “I’m not leaving Tripp.”  “Hmm.” Dad tilted his head. “He’s artificial, isn’t he?”  “What’s that got to do with anything?”  “Nothing, I suppose.”  Dad tapped two fingers against his lower lip. It’s something Amrita herself used to do when she was little, a pensive tick that she transferred to Ideal Dad to help make him more real. It really irritated her that the Kabbhan presentation had adopted it. The maintenance worker from New Delhi had probably had ticks and mannerisms of his own, but Amrita pointedly avoided learning what they were. She wanted only to see him in the corridor sometimes and think, My dad’s going to work. But at night she hoarded his image and turned it into a wonderful father. He wasn’t a maintenance man but a gardener. Like Ideal Dad himself, the garden didn’t exist. Amrita liked to imagine it in a vast underground vault with a pretend sky adrift with fluffy white clouds. She liked to imagine tall sunflowers (she’d seen pictures in school) nodding on their stalks. Dad played a game with her, telling stories of the sunflowers, which were special Martian sunflowers and could think and had personalities because they contained the lost souls of the vanished inhabitants of Mars.  Amrita put her helmet on. “He’s inside that tower. I’m going to get him. I’ll remote-fly the pod, set it to execute an evasive pattern to avoid the tractor beams and then return. That should work, if I make the pattern tricky enough.”  “It might. For a short time.”  “It’s going to work.”  Dad sighed.  Amrita programmed the maneuver, then belted on her sidearm and climbed out of the pod. She felt the planet’s pull, the gravity twice that of Mars but significantly less than Earth’s. She had lived on both worlds. Earth was prettier, but Mars (and Luna) was easier on her spine. The heating coils in her suit warmed her against the outside temperature, which hung just above freezing. How was anybody supposed to live on this planet?  When she turned, Dad already stood in the street. She said, “Please don’t do that anymore, either.”  “Don’t do what anymore?”  “Pop in and out. If you’re going to act physical, act it all the way.”  Dad nodded. “If it makes you happy.”  “Nothing makes me happy. Hold on.”  She used her wrist controller to spin up the pod’s engines. Dad watched her impassively, tapping his lower lip.  “Stop doing that,” Amrita said.  Dad stopped.  Amrita focused on the pod. It began to rise. The speed of its ascent increased. Amrita held her breath, waiting for the invisible lasso of a tractor beam to grab the pod and smash it down. But the pod climbed above the skyline and darted away—safe, for now.  “If it doesn’t come back,” Amrita said, “We’re all marooned here.”  “I’m not here in the first place,” Dad said. “But leave that aside. You are marooned whether or not the pod returns.”  “What are you talking about?”  “Your pod cannot withstand the forces found within our gate.”  The Kabbhan stargates linked distant locations within the Milky Way. When humans discovered the gate shimmering in Jupiter space, it had opened the galaxy to human exploration. Only the gate in the Epsilon Cygni system was forbidden. Entering it, Amrita had been instantly transported across nearly twelve parsecs to the Trappist-1 system.  Amrita’s heart beat faster. She had suspected the escape pod was insufficiently sturdy for the stargate, but she had intended to chance it, anyway. Now she didn’t know what to do. Taking a risk was one thing, suicide was another. “Another ship will come,” she said.  “No ships come here.”  “Mine did.”  “Amrita, no one wants to come here.”  “I’ll figure something out.”  Dad nodded, as though he were nodding at a child who had just vowed to stay up all night.  “I will help you settle on this world. There is a lovely island situated on the terminator, where the temperature range is more compatible for your human physiology. In your remaining lifespan the builders will not reach it. Conditions may be challenging at first.”  “Well, shit,” Amrita said.  “Everything is going to be okay . . . ”  Pumpkin.  With her dad, Amrita walked alone down the broad Kabbhan avenue. From deep in the city came the creaking, groaning sounds of nano construction.  “What a waste of time this place is,” Amrita said. “All these buildings and no one to live in them or work in them.”  “Time,” Dad said, shaking his head. “An odd concept.”  Amrita looked at him, unable to ignore what she rationally knew wasn’t there. “What’s odd about it?”  Dad said, “First of all, ‘time’ is an artificial construct. How do you waste a construct? In the Flux—”  “Dad? I’m not in the mood.”  “Of course, sorry. In the Flux we aren’t influenced by moods.”  “Okay.” Amrita stopped walking and turned on him. “If it’s so wonderful in the Flux, what are you even doing here?”  “I’m not here.”  Amrita closed her eyes briefly. “You know what I mean.”  “I told you. I came to help you survive.”  “Right. Because you feel responsible. Now what’s the other reason?”  Dad shrugged. “I happen to enjoy inhabiting a presentation. Among my fellow Kabbhan that makes me unusual.”  “I hope you’re having a wonderful time.”  “I am.”  “That’s great.” Amrita looked around at the buildings. “He should be right here. Tripp, it’s me! Tripp!”  Her words echoed down the canyon of tall buildings, all of them black and shiny-smooth and hollow. She approached the nearest, a tower that rose hundreds of meters, an immense heptagonal spear ending in a rounded point. The entrance to the lobby, or whatever the Kabbhan called it, stood open and doorless. Her helmet lights revealed the empty interior. She stepped inside and tilted her head back. Load-bearing supports crisscrossed all the way to the point. That was all.  “It’s called a shell,” Dad said. “I knew you were wondering.”  She didn’t say anything.  “The builders execute the architect’s plan, create basic structures, the interiors to be added later, according to the wishes of future inhabitants. As there are no future inhabitants, the city itself is now, and will remain, a shell.”  “I don’t care,” Amrita said. “I just want to find my friend.”  From far away, a small voice, almost inaudible, said, “I’m here.”  Amrita squinted. The voice was so faint, she wasn’t sure she’d even heard it. Wasn’t sure whether it was outside of her head, or inside of it, another Kabbhan illusion, or what. She turned up the gain on her headset.  “Tripp?”  “Over here.”  She swung her headlamps in his direction. Tripp stood in a far corner of the shell, his back against the wall. He looked more or less human—well, less—but he had two arms and two legs and one oval-shaped head. She walked toward him, her footsteps echoing.  “What happened to you?”  “My leg was damaged in the crash. I barely managed to hobble this far. They almost got me. Now I can’t move without falling.”  “They won’t get you,” Amrita said. “I won’t let them.”  Dad cleared his throat. Amrita ignored him.  “You can’t stop them,” Tripp said.  Amrita crouched and began examining the damaged leg. At the knee, a couple of carbon fiber rods bent in the wrong direction, inhibiting articulation.  “Don’t be afraid,” she said.  “Oh, I’m not really. It’s just my positronic brain pretending to feel human emotions, so I will seem more companionable.”  She looked up. “We’ve discussed your honesty on this topic before.”  “Sorry.”  Amrita produced a multi-tool and began fiddling with the leg.  “The weird thing is,” Tripp said, “I’m not even sure I want you to.”  She looked up. “Want me to what?”  “Stop them.”  Amrita stopped fiddling. “Why the Hell are you saying that?”  “It’s strangely compelling.”  “What’s strangely compelling?”  “To become part of the city,” Tripp said. “I don’t know. Would it be so bad? Maybe it’s because I’m already artificial, but these last hours, pretending to feel so afraid even when you were not here, hiding, getting my apparent dread of extinction organized to display when you showed up—it’s really made me think. My whole existence has been nothing but a performance.”  “Tripp!”  “I’m serious. If I simply walked out there, exposed myself, let them slag me, allowed myself to be digested and my elements to be recombined into the building matrix, wouldn’t I be part of something greater than myself?”  “Tripp, please be quiet now.” Listening to him made her feel lonely. “I think the crash must have damaged more than your poor leg.”  “No, my brain is fully functional. You know, I was in communication with the Meghnad Saha even as the instrumentality dismantled her. She didn’t display fear, because that isn’t part of her reactive programming mask. But she was excited. I’m certain of that. This may sound strange to you, but in the end she believed that to be digested was the greatest adventure. At least, that’s what she said.”  “She did not.”  “I suppose she may have been regurgitating something from the library that got mixed up in her damaged memory core. Anyway . . .  “Hold still, please.” Amrita loosened the bolt that attached the bent rods to Tripp’s knee swivels. The bolt dropped to the ground. Gritting her teeth, she got a firm grip on one of the bent rods, wrenched it back and forth until it suddenly came loose. She fell on her ass, still holding the rod.  “He’s right,” Dad said. “We Kabbhan, like all physical beings of limited duration, lived our lives in fear. After the Great Migration, fear vanished—along with our individual personalities, of course. It may be the same for artificial beings when faced with the prospect of joining the greater reality of the city.”  Amrita rolled to her knees. “Have either of you even considered the virtue of silence?”  “Either of you?” Tripp said. “Who else are you talking to?”  “Nobody. My dad.”  “Which is it?”  “They’re the same thing.”  Amrita resumed work on the second bent rod. She twisted and wrenched and pulled. It came free of its upper swivel but not the lower. Finally she gave up and let it dangle.  “Try that,” she said.  Tripp moved his good leg forward, planted it, then moved his damaged leg. The dangling bar tapped against the other rods and the knee wobbled slightly side-to-side. Tripp waved his arms for balance. Amrita scrambled to her feet to catch him, but he managed to remain upright without her.  “How is it?” she asked.  “Unstable. I’m not sure this will work.”  “Keep practicing, walk around.”  “All right.” Tripp walked away into the shadows, the dangling carbon rod making a tap-tapping sound like a blind man’s cane.  “The builders will very probably take him,” Dad said.  Amrita turned on him, annoyed with herself for accepting his presence outside her head, where it wasn’t. “I could use a little optimism around here. You’re supposed to be helping me, right? Well, do some helping, why don’t you? Get us away from where Tripp is in danger. Get us to that island.”  “I can take you there. The builders have no interest in a biological. But Tripp will inevitably be noticed.”  Amrita paced around, working her hands together, thinking. “What if I turn the builders off? Isn’t that what your people should have done before the Great Migration?”  “That isn’t possible. In the absence of Kabbhan oversight, the builders have adapted and become self-motivated to complete the architect’s plan. Only the architect can cancel the build.”  “Who’s the architect?”  “Since they were left running, the builders devised their own plan.”  “The builders are their own architect?”  “Exactly.” Dad spread his arms and turned in a circle. “They build. It’s what they do. It’s all they do. When the original plan was complete, they simply extended the parameters to include the entire planet. That way they will remain busy and fulfill the dictates of their primary function. But they are not sentient. No amount of logical persuasion will convince them to abandon their own plan.”  “That leaves Terminator Island, or whatever you call it.”  “The island has no name. Nothing here does.”  “Let’s just go. Tripp!”  They emerged from the building in time to witness the arrival of a ten-meter-tall spider. Moments later, the pod came zig-zagging out of the sky and settled onto the same spot it had previously occupied. The spider stalked toward the pod.  Amrita yelled, “Run!”  Since she was the only one with working legs, she ran alone—though Dad appeared to be running beside her.  “How am I doing?” he said.  “What?”  “You said you wanted me to be physically consistent.”  Behind her, Tripp’s dangling carbon rod clicked and knocked against his leg, like a syncopated timer.  Amrita ripped her sidearm out of the holster but hesitated. “Dad, you’re sure that thing won’t attack me?”  “Yes.”  Amrita triggered her weapon. A pulsing white particle discharge cut across one of the spider’s legs, severing it above the first joint. The spider stumbled and began tracking left. Amrita ran back to Tripp, pulled his arm across her shoulders, and helped him walk the remainder of the distance to the pod. He was light for an artificial.  “Stand here.” Amrita climbed the ladder and reached down. “Give me your hand, I’ll pull you up.”  But Tripp wasn’t looking at her. He watched the spider circling itself, partially hobbled, and, to Amrita’s horror, Tripp began limping towards it.  “Tripp, what are you doing! Stop.”  Without looking at her, Tripp said, “You should fly away now. It’s important that I serve a larger function. While the Meghnad Saha existed, my part of the larger function was assured. There is no larger function on your island.”  “Our friendship is a larger function.” Amrita felt an ache in her chest.  Tripp didn’t speak again but limped, loose rod tapping, over to the spider and held up his arms. The spider took notice, stopped chasing itself around in a circle, and slagged him.  The ache in Amrita’s chest intensified and became unbearable. “Why?”  From the right seat, already strapped in, Dad laid a comforting illusion on her shoulder. Her brain told her it was a father giving her a reassuring squeeze.  “We’d best go now, Pumpkin.”  She buckled herself into the pilot’s seat, roughly wiped her eyes, spun up the engines, and sped into the sky, reaching maximum thrust within seconds. They achieved altitude and raced toward the sea.  On tidally locked Trappist-1e, Terminator Island stood on the edge of eternal night. Amrita knelt in the powdery blue sand, breathing inside her helmet. “I don’t see any builders.”  “They exist everywhere but are too small to see.”  “If they’re on the island, why aren’t they already building their damned city?”  “It would be disorderly. The builders follow the architect’s plan, in this case their own plan. And the plan is to build contiguously outward from the main continental mass. These builders would not become activated until the project arrived after crossing the ocean. That is a distant occurrence. In the meantime you can use the builders for your own project, once I tell you how to activate them according to your deeper architectural desires.”  “I don’t have any deep architectural desires,” Amrita grumbled.  Dad, standing over her, said, “Of course you do.”  Amrita was not Kabbhan. The nanobuilders did not naturally synch with her inner architect. But, because she was the only game in town, at least until the city arrived, eventually they made a connection. A good thing. The Trappist atmosphere was unbreathable, at least for humans. Sooner or later (probably sooner) the pod’s emergency atmospheric conversion processor would break down.  The builders started . . . building. Amrita had been dozing in the pod, lulled to unconsciousness by the wheeze and huff of the processor, which sucked in air and displaced most of the carbon dioxide with an artificially produced mixture of nitrogen and oxygen. The conversion unit was designed as a temporary stopgap. The replicating oxygen/nitrogen molecules on board would soon be depleted, and that would be the end of Amrita.  A creaking, groaning sound plucked at her awareness, and she opened heavy eyelids. The atmosphere in the pod was thin, just barely enough to support her life. But like that she was wide awake. Around the pod, for a radius of fifty meters or more, walls built themselves up, gradually creating an enclosed space. At the same time invisible builders filled the still-exposed interior space with walls and corridors and furniture and apparatus familiar to Amrita, including a large atmospheric conversion unit. Fascinated, Amrita tore into a packet of emergency rations and watched the show. The builders worked quickly.  At the point when she knew exactly what the builders were creating, Amrita turned to Dad, who was always at her side.  “I didn’t ask for this,” she said.  “Your architect is a deep expectation, beyond your conscious control. I’m sorry. The builders are designed to synch with Kabbhan brains, which were more limber, not human brains. This is what you get, I’m afraid. At least it is life, yes?”  Outside the pod, a copy of Amrita’s Burroughsville habitat took shape.  Black. Inside the hab, if she wandered too far, the soothing blue and gold tones of her remembered home in Burroughsville segued into the shiny, smooth, black “shell” material of the Kabbhan city. Mostly, Amrita stayed in her room, reading her way through the pods’ mirror library from when it was attached to the Meghnad Saha. A couple of times a day she left the hab and crossed to the farm. The walls of the farm enclosed a space twice the size of the hab. Using seeds and fertilizer packets from the escape pod’s long-term planetary survival stores, Amrita had begun to grow her future diet of bland vegetables. Already leafy shoots had emerged. The sight both encouraged and depressed her. How long would she be stuck here?  Sometimes, on her way back to the hab, she paused to gaze out over the sea. Beyond the horizon, the builders continued their work on the continent and beneath the waves. Tripp was now part of that building matrix. If he could pretend fear why couldn’t he have pretended loyalty and stayed with her? Tripp was part of the city, but what was Amrita part of? She had spent her life devising ways to separate herself from her fellow humans. Now, for the first time, regret wormed into her heart.  “I don’t understand why he did it,” she said one evening, when Dad came in to say goodnight. “I thought we were friends.”  Dad sat on the bed. It was a perfect duplicate of Amrita’s childhood bed. When she lay down to sleep, her legs extended beyond the mattress. “Perhaps the friendship was more one-sided than you like to believe.”  “You didn’t even know him,” Amrita said.  “Was there something to know? He was artificial. Kabbhan could not have created a presentation from him, even. Tripp had more in common with the builders than with you.”  “Stop talking to me,” Amrita said. “Can’t you stop and go away? I don’t need you anymore.”  Dad held her hand. “Do you really want me to leave, Pumpkin?”  By force of will, Amrita almost convinced herself that she couldn’t feel the hand gently squeezing hers. She would have pulled free, except she could see, in her mind’s eye, the grim comedy of her lying alone on the bed, talking to herself while twisting and pulling away from someone who wasn’t there. It was easier to accept the illusion. Just as it had become easier to accept the illusion calling her “Pumpkin.” Was there any point in fighting it? Besides, it would be too lonely without Dad, even though Dad wasn’t really there.  “At least make yourself appear in your original Kabbhan form.” she said. “The Dad thing bothers me.”  “Oh, I couldn’t do that. I no longer possess a self-image. To appear Kabbhan now would require a living Kabbhan mind from which to draw.”  “You won’t try?”  “I’m afraid it would be pointless.” Dad shook his head and chuckled. “You know, I’m really enjoying my temporary individuality.”  “That’s wonderful.” Amrita turned away.  “But—”  “But what?” She turned her head and looked at him.  “Nothing.” Dad smiled kindly. “I went to the underground garden today.” He gave her ankle a fatherly squeeze.  Amrita groaned. Not this again. She turned away, facing the wall. “There is no underground garden.”  “The sunflower people want to tell their story, the story of old Mars.”  “I don’t want to talk anymore,” Amrita said.  “Why don’t I tell you a little of it?” Dad suggested.  “Jesus. I just said—”  “It’s fascinating, the story of old Mars.”  “Stop talking now.”  “Don’t be sharp with me, Pumpkin.”  Amrita rolled over and sat up. “It bothers me that you won’t stop talking when I tell you to stop. You used to stop.”  Dad folded his hands in his lap and looked at them. “I appreciate,” he said, starting slowly, seeming to hunt carefully for the right words, “that I sometimes make you uncomfortable. But I hope you can appreciate that I’m not a mere thing, a device, you can choose to turn off and on at will. I’m not an artificial, like your so-called friend, Tripp.”  “Leave Tripp out of it.”  “I would like to,” Dad said. “But I find your morbid attachment disturbing.”  “Disturbing.” Amrita’s childhood room seemed too small, the air too thin. Childish and colorful drawings she’d once created on a Play-And-Swirl pallet adorned the walls, primitive renderings of her little Burroughsville family. Mom and Ideal Dad. The goddamn maintenance man. Amrita stood up. She felt crowded—which was ridiculous, when you thought about it. “I’m going outside.”  “A walk sounds nice, Pumpkin. I’ll come with you.”  “Please don’t.”  Amrita suited up, cycled through the airlock. Dad stayed with her every step of the way, acting the part of a physical presence without interruption, just as she’d once requested. She walked along the shore until she began to feel tired. Dad never stopped talking.  “The Sunflower Martians lived thousands of years ago, back when sparkling blue water filled the canals and riverboats propelled by solar sails navigated from community to community, trading goods and stories.”  Amrita kicked at the powdery sand. “There were never any canals on Mars.”  “Nonsense!” Ideal Dad said.  She stopped and looked back. Ideal Dad kept talking, but she was getting better at ignoring him. From this distance, the hab and farm buildings appeared small and generic—except in scope, no different than the shells of the city.  I found some shells on the beach, she thought, a little hysterically. And then she realized something.  Ideal Dad was saying, “The Martians chose sunflowers because the flowers are so bright and sunny and optimistic, just like the Martians themselves used to be.”  “Hold up,” Amrita said.  “What is it, Pumpkin?”  “If the builders can recreate my old Burroughsville hab, why can’t they recreate the Meghnad Saha?”  For the first time in days, it seemed, Ideal Dad became quiet.  “Well?” Amrita said.  “We should be getting back home now.”  “Answer my question.”  “A spaceship is very complicated.”  “The hab is complicated, too.”  “The interiors exist as a deeply imprinted memory with an emotional toggle from your childhood.”  “Tripp and I lived together on the surveyor for a long time. That’s imprinted, too.”  “It’s not the same.” Dad’s tone suggested the conversation was over. He turned and walked away, back toward the hab, kicking up no sand, leaving no footprints. After a few meters, he disappeared. Amrita stood there, as if trying to catch a glimpse of a mirage. It had been a long time since Dad had last pulled his disappearing act.  She woke on her hab bed and lay still, listening. Somebody was in the corridor outside her room. She got up and padded over to the door, slid it open a few inches. A man, his back to her, walked away toward where the corridor curved. A different man. Carrying a long-handled static duster, he was dressed in the green jumpsuit worn by maintenance workers in Burroughsville, a long time ago. Amrita slipped into the corridor and followed him. He rounded the corner. She ran to catch up.  “Hey.”  He paused and turned his head, his face in partial profile. It was Ideal Dad, and it wasn’t Ideal Dad.  “What are you doing?” Amrita said.  “It’s late for you, kid. Where’s your mother?”  “I don’t like this.” Amrita stepped back. “Don’t do this.”  The maintenance man grunted and continued on his way, toward the next bend in the corridor, occasionally swiping the walls with his duster. Around that next bend the shiny black shell material replaced the phony representation of Amrita’s hab. She didn’t follow him. She was afraid to.  That day on the beach, it was the last time Ideal Dad appeared. Amrita spent her days alone in the hab. A heavy lethargy came over her, and she stopped going to the farm. The process of suiting up and cycling through the airlock made her tired even to think of it. She barely left her room, where she slept a lot, and nibbled on the last of the pod’s emergency rations. Every night she heard the heavy shoes of the maintenance man clocking down the corridor, but after that first time she stopped going out to investigate. It was all inside her head anyway.  One night, lying in the dark, on the precipice of sleep, Amrita heard something, a minute creaking, groaning. The sounds of nano builders at work. She sat up and waved her hand over the bedside lamp sensor. The light came up. In a corner of the room, a child’s desk took shape. It was a fully interactive FunDesk. Amrita’s eyes widened. Up to now the room had duplicated her childhood hab, recreating what had actually been in it. But she had never had a FunDesk, though she’d repeatedly begged her mother for one.  Amrita swung her legs off the too-short bed. She wriggled her toes in the carpet—then stopped when she realized it was the same thing she used to do when she was five years old. The desk finished building itself. Cherry apple red swept away the shell-black look. What next, duckies on her underwear? The room was infantilizing her. Only it wasn’t the room.  Footsteps crossed the floor on the other side of the wall common to the family quarters. Not the heavy tread of the maintenance worker. Amrita, suddenly terrified, approached the curtain between her bedroom and the family’s common space. In all these weeks, no one had appeared in the family space. Amrita lifted the curtain aside in time to see a man pass into the corridor, his back to Amrita, a young man with squared shoulders.  “Wait,” Amrita said, her hand reaching out.  The door slid shut behind him.  Half dressed, barefoot, she pursued him, but was afraid to catch up. They followed the curving corridor and came to the airlock.  Amrita found her voice. “You can’t do this to me.”  The man turned. A piece of his face that included his right eye was missing.  “All I ever wanted to do was stay,” he said, “but you won’t have it.” His voice sounded garbled, as if he were talking around a mouth full of mud. It wasn’t a human voice at all, but maybe the voice of a creature that had stopped physically existing a very long time ago. As he opened the airlock’s inner door, his face began to melt. He shuffled into the airlock. The inner door closed with a decisive clunk. Amrita rushed to the little round window. The airlock was empty, with the outer door never having opened. She was alone again, but hadn’t she always been?  Amrita moved out of both the infantilizing room and the false representation of her old Cydonia family quarters. She dragged everything she needed down the corridor and around the second bend, and there she made a place for herself enclosed by the shiny black shell material. She craved the inconvenience of reality. She needed it, if she was going to have a chance.  Amrita resumed tending the farm. She required food, enough to go beyond the limits of her pod rations. It would take a long time to accomplish what she intended to accomplish—if she ever did accomplish it.  She mind-sifted nanos in the blue sand, and worked doggedly to reconstruct the Meghnad Saha. Hours and hours she spent remembering every detail of her lost surveyor. She started in the morning and ended at night, curled on the hard shell material, concentrating until her mind went slack with fatigue. On the beach—slowly, slowly—the ship began to rise. First the landing struts and feet and then a skeletal approximation of the superstructure. She wouldn’t need the whole thing, just the essentials. Structural integrity. Ion propulsion engines. One pressurized cabin . . .  Tripp visited her in a dream. He was his old self, undamaged and companionable. His blank face swiveled toward her. I’ve got your back, he said, but it was just Amrita’s deep architect of loneliness trying to manufacture the loyalty Tripp, in the end, had been incapable of. She sat up and angrily wiped away tears. “I don’t need you anymore. I’m getting out of here.” By “here” she meant more than Trappist-1e.  She wanted so badly to abandon the abandoned part of herself.  Amrita tried something new. Before sleep she focused on the missing pieces of her spaceship reconstruction but did not struggle consciously to recreate them. The builders were smart. Once they knew exactly what you wanted they could, as Dad had said, build anything. They had done it with the oxygen conversion unit and other details in the hab. Since then Amrita had been trying too hard, getting in her own way and in the way of the builders.  The builders resumed work and they worked rapidly.  “Ready to fly,” Amrita said, standing by the surveyor, her gloved hand flat against the hull. She turned back to the hab and saw nothing more than a collection of black shells. Of course, it was different on the inside. But she would never visit the inside again. After a minute she turned away and opened the hatch on the underside of the reconstructed ship and hauled herself up. Minutes later the Meghnad Saha, streaked out of Trappist 1-e’s atmosphere and towards the Khabbhan gate. She was going home. In 2001 Jack Skillingstead submitted a story to Stephen King's \"On Writing\" contest. He won and not long afterward began selling regularly to major science fiction and fantasy markets. To date he has sold more than forty stories to various magazines, Year's Best volumes and original anthologies. In 2003 his story \"Dead Worlds\" was a finalist for the Theodore Sturgeon Award and in 2009 his novel Life on The Preservation was a finalist for the Philip K. Dick Award. Jack lives in Seattle with his wife, writer Nancy Kress.", "text": "7500 words, short story\nThe Sum of Her Expectations\nAmrita stabilized the escape pod. Her hands were shaking; she had barely gotten out. The Meghnad Saha, a Class B planet surveyor she’d called home, retreated from the aft view screen, dropping rapidly from the orbital plane, pulled down by a force from the planet.\n“Tripp?” Amrita said.\nAfter a moment, a voice from the surveyor: “It doesn’t appear I’m going to be able to stop this thing.”\n“You should have come with me in the pod.”\n“Hindsight. I’ll keep trying. Here comes the blackout. Goodbye. Sorry . . . ”\n“Tripp?”\nNothing.\nAmrita tracked the Meghnad Saha all the way to the surface. She tried repeatedly to resume contact but Tripp wouldn’t answer. Transcyber Reactive Positronic Personality: Tripp, for short, and the only friend Amrita had, or wanted. If he survived the crash, she wasn’t about to abandon him. She blinked tears away and began to configure her escape pod for descent.\nThe Kabbhan forbade landing on Trappist-1e, or even approaching the planet within a designated radius of three hundred thousand kilometers. Because the Kabbhan stargates had made interstellar travel possible for humans in the first place, everyone respected this single restriction. Everybody but Amrita, who was signatory to no such agreement.\nA proximity alert began beeping in the escape pod. Amrita considered a quick burn for radical descent. Get down before anyone could stop her. But it was already too late.\nThe Kabbhan star cruiser emerged like a sperm whale from a shot glass. Above the planet’s horizon an elongated node appeared, squeezed forth, and popped: the cruiser, bigger than anything Melville dreamed of, came alongside Amrita’s two-seat escape pod in synchronous orbit one hundred and eighty kilometers above the planet’s largest continental mass. Amrita put her nose to the viewport. A massive wall shut out the stars.\nWith the back of her hand she wiped sweat off her upper lip, and waited. Eventually, the alien spoke, via comlink—at least it appeared that way. The green comlink indicator blinked on Amrita’s vaporware display, and she heard the expected transmission hiss. But she knew Kabbhan technology was not what it appeared to be. Even calling it technology was a mistake.\nEarth ship. Prepare to receive Kabbhan personnel.\n“What?”\nOut of nowhere, a man appeared at her elbow, already strapped into the right seat. Amrita would have jumped out of her skin, if that were possible. Actually, it was possible; the Kabbhan had demonstrated as much by becoming the only known race to have achieved transphysical migration.\n“Who the hell are you?” she demanded.\nThe man turned to her. “The sum of your expectations.”\n“I’ve heard that one before. You’re a Kabbhan presentation?”\nThe Kabbhan probed minds to find materials with which to construct compatible presentations. A Kabbhanian presentation acted as a surrogate presence. No one had ever seen an actual Kabbhan and very few had seen their presentations. Those who had seen a presentation reported a disorienting experience. While the presentation existed only in the probed subject’s mind, it activated all the necessary neural and sensory pathways to create an apparently physical manifestation. Apparent to the one being probed, at least. In short, the right seat was empty.\n“You may regard me as Dad.”\n“Dad! I don’t think so. Besides, you don’t even look like him.”\nNot that Amrita remembered her father, her “dad,” except as a degraded holo she’d discovered in a lockbox after her mother died. Among the few important documents still mandated to exist in physical form were scattered a handful of personal items, trinkets accumulated over a long life. Amrita used her thumbnail to pry open a silver locket stamped with an impression of Shiva—and wham! her father leaped out and stood flickering before her. She knew it was her father, because who else could it be? Old fashioned hololockets like this one had been romantic keepsakes when Amrita’s mother was young, and she had only ever loved one man—as she frequently reiterated. In later years, after she found happiness with a microbiologist named Brenda on the colony world Deneb V1, she added: One was enough.\nThe holo had been that of a young man, handsome, after a predictable fashion. But there was a sly, cunning light in his eye that suggested a con man’s motivations. Eye, not eyes. The holo’s degradation had turned Amrita’s young father into a puzzle of many missing pieces—including the piece with his right eye. A therapist had once suggested that Amrita had spent her life, unconsciously of course, searching for the missing pieces of dear old dad. It accounted for her lack of respect for rules and authority figures. Amrita responded: “You’re joking, right?” She had been under court order to participate in ten therapeutic sessions. The court order came as a result of a juvenile misadventure involving a stolen moon skimmer and a high-speed chase across the Mare Serenitatis. Had she been eighteen instead of thirteen, the consequences would have been dire, not therapeutic. The “You’re joking” remark had been in session number two. The next eight preceded unproductively.\nThis Kabbhan presentation didn’t look anything like the holo. It was older, for one thing. A man of late middle age, with silver-streaked hair combed back in a pompadour, and wrinkles around his brown eyes.\n“There is no error,” he said.\n“I hope you don’t think you’re going to stop me. Because I’m telling you right now, I am going down there to get my friend.”\n“Stopping you isn’t my intention. I’m here to assure your survival. We Kabbhan feel a certain responsibility towards less evolved species endangered by our discarded artifacts, even though our warnings have been explicit. Shall we descend now? If you are prepared, of course.”\n“I’m prepared. Dad.”\nAmrita manipulated vaporware toggles, like twiddling fingers in a particularly well-organized steam cloud. The pod altered orbital trajectory, and Trappist-1e’s very large horizon became larger still. Amrita glanced at the rearview screen. The Kabbhan starship was gone, as if it had never been there. And it hadn’t been. Like Dad, the ship had been the sum of Amrita’s expectations, this time in regards to alien spacecraft. The Kabbhan thought that beings stuck in the physical required corresponding illusions. Maybe they were right.\nAmrita’s escape pod burned through the atmosphere at hypersonic speed. Curtains of fire fluttered across the ports, then blew away, revealing an expanse of salmon-colored twilight. It was midday on Trappist-1e and as bright as it ever got. Six more alphabet planets hung in the sky like a God’s game of crescents and balls.\nFrom altitude, the self-expanding megalopolis looked like a continent-covering crust, an eczema salted with glittering lights.\n“What a sight,” Amrita said.\nDad nodded. “When the last of us migrated out of the physical, the automated city-builders on this colony planet ran amok. That was more than a hundred Sol years ago, by your time measure.”\n“There’s so much.”\n“Indeed. Construction has proceeded unchecked, consuming every available mineral resource, husking out the planet even as it gradually covers its surface with an abandoned-before-built city.”\n“What happens when the builders run out of land?”\n“They continue into the sea, erecting piers and floating platforms on the surface, and submerged suburbs of pressure domes and interlinking tubular passageways. They can and do build anything.”\nAmrita banked the escape pod and dropped several thousand meters, slipping across the sky at dizzying speed. She felt it in her gut, the swoop of gravity-assisted acceleration. Dad sat placidly, watching out the port. As they drew nearer, details emerged from the crust. Towers, blocks, domes, heptagons, pyramids, complex ribbons of transportation infrastructure . . .\n“There,” Dad said.\nA trench of smoldering destruction. Amrita slowed the pod’s descent, swooped in close, and hovered. Machines, like giant stalk-legged spiders, swarmed the trench, collecting into piles the remains of shattered buildings. Energy beams fired from the spiders’ underbellies. Brilliant flashes, like small nuclear detonations, burst upon Amrita’s eyeballs. She looked away and spent a few seconds blinking the blue-white afterimages out of her eyes. When she looked back, the debris had been reduced to slag.\n“The city-builders will digest the material,” Dad said, “and recycle it into the construction matrix.”\nThe builders, or nanoswarms, grew buildings from the ground up. Even now, the trench gradually filled with new growth, like an invisible surgeon knitting a wound.\nAmrita flew her pod over the trench. At the end of it lay the Meghnad Saha, broken-backed and nose up. Smoke trailed from rents in the engine compartment and crew cabin, while instruments of the city proceeded with dissection. Giant mechanical mantises peeled off titanium plates, like strips of bark from a fallen tree. They cast the plates down for the spiders to gather, evaluate, and slag.\nAmrita loitered above the spectacle. She opened a channel. “Tripp?”\nWhite noise.\nDad said, “He may not have survived.”\n“Or he may have survived.”\nDad put his hand over hers. Amrita’s parietal lobe received nerve impulses, as though someone was actually touching her skin. Dad’s eyes swam with empathy, which she didn’t trust. “I need to know for certain,” Amrita said, and pushed her hand forward. The illusion of Dad’s fingers slid away. She reached into the vaporware display, activated the sensor array, and swept the wreckage.\n“He’s not there. I don’t read his power core’s signature.”\n“Perhaps he has been digested.”\n“The radioactive core would still register.”\nAmrita broadened the search, scanning the surrounding area as rapidly as possible, worried that the builders would take notice and pull her down with tractor beams, just as they’d done to the Meghnad Saha. Then Tripp’s signature appeared. “Got him! He’s on the move.”\nShe locked down the location and deactivated the sensor array. “Do you think the builders know I’m here?” Her pod was shielded from sensor examination, but then the Meghnad Saha had been, too.\n“I’m afraid they do now, Pumpkin.”\nPumpkin?\nThat was the color of the Martian sky above Burroughsville, the main Cydonia colony, where Amrita spent her first six years. Her real dad had never called her ‘Pumpkin’ or anything else that she recalled. She had only one vague and retreating memory of him walking out the door of their hab. She didn’t remember him; she remembered his back as he walked away. She remembered the door sliding closed, leaving her fatherless. She remembered her mother’s tears. And anger. Not long after that her mother requested reassignment to Luna, dragging Amrita along to the land of stark desert contrasts and no friends. The moon skimmer incident was inevitable, and would have happened sooner, if Amrita had been tall enough to reach the controls.\nPumpkin was what Ideal Dad called her—back when she was five years old and in need of a father who called her something, anything. Ideal Dad: AKA made-up-dad: AKA Kabbhan presentation. From the quantum flux the Kabbhan had probed her mind and found a ghost who had never lived. Amrita now recognized the physical template, though, the silvered pompadour, the kind eyes. They belonged to a man she used to see walking around the buried corridors between Burroughsville habs. Some kind of maintenance man, originally from New Delhi, on Earth.\n“Please,” she said to the presentation, “don’t call me that again.”\nDad nodded. “All right, Amrita.”\n“Nobody in my life has ever called me ‘Pumpkin.’”\nDad listened respectfully.\n“And don’t look at me that way, either.” Amrita said.\n“I’m sorry. Am I looking at you incorrectly?”\nAmrita narrowed her eyes. “Are you being funny?”\n“I doubt it. Before the Great Migration I was considered by my friends to be on the dour side. Also, in the quantum flux, no one tells jokes. We Kabbhan no longer exist as individuals, except when it becomes necessary to create a presentation. Telling jokes in the flux would be like telling jokes to a mirror.”\n“I don’t know if you’re being serious.”\n“Then I am a poor communicator, which is a failing I was not accused of prior to migration.”\n“Okay, that’s plenty.”\n“Plenty?”\n“Of you talking.”\nAmrita looked for a place to set down. She flexed her hands, worried. “The builders won’t attack?”\n“Attack? The builders don’t attack anything. They’re hungry for building material, that’s all.”\n“It looked like they were attacking the Meghnad Saha.”\n“Preparing it for digestion,” Dad said. “Local resources are finite. The builders hunt constantly for materials. When your surveyor skimmed the atmosphere it became a potential resource. You were warned of this, were you not?”\n“I shielded the ship. It should have been invisible.” Amrita had been attracted to Trappist-1e by its forbiddenness. She had wanted to see what no human had seen, and she wanted to see it because everyone from the Kabbhan themselves to the Gate Authority in the Epsilon Cygni system had told her she couldn’t.\n“Insufficient,” Dad said. “Your sensor scan revealed you.”\n“All right. Will the builders try to digest me?”\n“Of course not. They don’t digest living organisms.”\n“That’s great for me, but Tripp isn’t a living organism.”\nAmrita concentrated on her maneuvering controls. She lowered the pod between soaring towers that reduced even the twilight to full night. Landing lights planted cones on a pristine avenue no Kabbhan (or human, for that matter) had ever trod. Gear extended, and moments later pneumatic suspension units absorbed the pod’s touchdown.\nAmrita idled the engines and unstrapped. “Tripp is close. I’ll go get him. When I come back, you’ll have to give up your seat.”\nDad nodded. “Of course. I’m not actually in the seat, anyway. But I don’t think you should leave the pod.”\n“Why not?”\n“The builders won’t harm a living organism, but once you climb out, the pod will become a construction resource. They seized your planet surveyor only after you abandoned ship.”\nAmrita bristled. “I didn’t abandon anything. Tripp shoved me into the pod. He overreacted to the builder’s tractor beam.”\n“Yes. It wouldn’t have pulled the ship down, not while you were aboard.”\n“Tripp was trying to protect me.”\nDad regarded her empathetically. “I see.”\nAmrita switched on her comlink. “Tripp? You’re out there. Answer me.”\nHe didn’t reply.\n“He’s probably turned off his communication device. Receiving your signal might direct the builders to him. Amrita, remaining here is dangerous.”\n“You said the builders wouldn’t digest a living organism.”\n“No. But once you walk away, your ship becomes a resource. I suggest you fly us out of the city. I will give you a safe destination.”\n“I’m not leaving Tripp.”\n“Hmm.” Dad tilted his head. “He’s artificial, isn’t he?”\n“What’s that got to do with anything?”\n“Nothing, I suppose.”\nDad tapped two fingers against his lower lip. It’s something Amrita herself used to do when she was little, a pensive tick that she transferred to Ideal Dad to help make him more real. It really irritated her that the Kabbhan presentation had adopted it. The maintenance worker from New Delhi had probably had ticks and mannerisms of his own, but Amrita pointedly avoided learning what they were. She wanted only to see him in the corridor sometimes and think, My dad’s going to work. But at night she hoarded his image and turned it into a wonderful father. He wasn’t a maintenance man but a gardener. Like Ideal Dad himself, the garden didn’t exist. Amrita liked to imagine it in a vast underground vault with a pretend sky adrift with fluffy white clouds. She liked to imagine tall sunflowers (she’d seen pictures in school) nodding on their stalks. Dad played a game with her, telling stories of the sunflowers, which were special Martian sunflowers and could think and had personalities because they contained the lost souls of the vanished inhabitants of Mars.\nAmrita put her helmet on. “He’s inside that tower. I’m going to get him. I’ll remote-fly the pod, set it to execute an evasive pattern to avoid the tractor beams and then return. That should work, if I make the pattern tricky enough.”\n“It might. For a short time.”\n“It’s going to work.”\nDad sighed.\nAmrita programmed the maneuver, then belted on her sidearm and climbed out of the pod. She felt the planet’s pull, the gravity twice that of Mars but significantly less than Earth’s. She had lived on both worlds. Earth was prettier, but Mars (and Luna) was easier on her spine. The heating coils in her suit warmed her against the outside temperature, which hung just above freezing. How was anybody supposed to live on this planet?\nWhen she turned, Dad already stood in the street. She said, “Please don’t do that anymore, either.”\n“Don’t do what anymore?”\n“Pop in and out. If you’re going to act physical, act it all the way.”\nDad nodded. “If it makes you happy.”\n“Nothing makes me happy. Hold on.”\nShe used her wrist controller to spin up the pod’s engines. Dad watched her impassively, tapping his lower lip.\n“Stop doing that,” Amrita said.\nDad stopped.\nAmrita focused on the pod. It began to rise. The speed of its ascent increased. Amrita held her breath, waiting for the invisible lasso of a tractor beam to grab the pod and smash it down. But the pod climbed above the skyline and darted away—safe, for now.\n“If it doesn’t come back,” Amrita said, “We’re all marooned here.”\n“I’m not here in the first place,” Dad said. “But leave that aside. You are marooned whether or not the pod returns.”\n“What are you talking about?”\n“Your pod cannot withstand the forces found within our gate.”\nThe Kabbhan stargates linked distant locations within the Milky Way. When humans discovered the gate shimmering in Jupiter space, it had opened the galaxy to human exploration. Only the gate in the Epsilon Cygni system was forbidden. Entering it, Amrita had been instantly transported across nearly twelve parsecs to the Trappist-1 system.\nAmrita’s heart beat faster. She had suspected the escape pod was insufficiently sturdy for the stargate, but she had intended to chance it, anyway. Now she didn’t know what to do. Taking a risk was one thing, suicide was another. “Another ship will come,” she said.\n“No ships come here.”\n“Mine did.”\n“Amrita, no one wants to come here.”\n“I’ll figure something out.”\nDad nodded, as though he were nodding at a child who had just vowed to stay up all night.\n“I will help you settle on this world. There is a lovely island situated on the terminator, where the temperature range is more compatible for your human physiology. In your remaining lifespan the builders will not reach it. Conditions may be challenging at first.”\n“Well, shit,” Amrita said.\n“Everything is going to be okay . . . ”\nPumpkin.\nWith her dad, Amrita walked alone down the broad Kabbhan avenue. From deep in the city came the creaking, groaning sounds of nano construction.\n“What a waste of time this place is,” Amrita said. “All these buildings and no one to live in them or work in them.”\n“Time,” Dad said, shaking his head. “An odd concept.”\nAmrita looked at him, unable to ignore what she rationally knew wasn’t there. “What’s odd about it?”\nDad said, “First of all, ‘time’ is an artificial construct. How do you waste a construct? In the Flux—”\n“Dad? I’m not in the mood.”\n“Of course, sorry. In the Flux we aren’t influenced by moods.”\n“Okay.” Amrita stopped walking and turned on him. “If it’s so wonderful in the Flux, what are you even doing here?”\n“I’m not here.”\nAmrita closed her eyes briefly. “You know what I mean.”\n“I told you. I came to help you survive.”\n“Right. Because you feel responsible. Now what’s the other reason?”\nDad shrugged. “I happen to enjoy inhabiting a presentation. Among my fellow Kabbhan that makes me unusual.”\n“I hope you’re having a wonderful time.”\n“I am.”\n“That’s great.” Amrita looked around at the buildings. “He should be right here. Tripp, it’s me! Tripp!”\nHer words echoed down the canyon of tall buildings, all of them black and shiny-smooth and hollow. She approached the nearest, a tower that rose hundreds of meters, an immense heptagonal spear ending in a rounded point. The entrance to the lobby, or whatever the Kabbhan called it, stood open and doorless. Her helmet lights revealed the empty interior. She stepped inside and tilted her head back. Load-bearing supports crisscrossed all the way to the point. That was all.\n“It’s called a shell,” Dad said. “I knew you were wondering.”\nShe didn’t say anything.\n“The builders execute the architect’s plan, create basic structures, the interiors to be added later, according to the wishes of future inhabitants. As there are no future inhabitants, the city itself is now, and will remain, a shell.”\n“I don’t care,” Amrita said. “I just want to find my friend.”\nFrom far away, a small voice, almost inaudible, said, “I’m here.”\nAmrita squinted. The voice was so faint, she wasn’t sure she’d even heard it. Wasn’t sure whether it was outside of her head, or inside of it, another Kabbhan illusion, or what. She turned up the gain on her headset.\n“Tripp?”\n“Over here.”\nShe swung her headlamps in his direction. Tripp stood in a far corner of the shell, his back against the wall. He looked more or less human—well, less—but he had two arms and two legs and one oval-shaped head. She walked toward him, her footsteps echoing.\n“What happened to you?”\n“My leg was damaged in the crash. I barely managed to hobble this far. They almost got me. Now I can’t move without falling.”\n“They won’t get you,” Amrita said. “I won’t let them.”\nDad cleared his throat. Amrita ignored him.\n“You can’t stop them,” Tripp said.\nAmrita crouched and began examining the damaged leg. At the knee, a couple of carbon fiber rods bent in the wrong direction, inhibiting articulation.\n“Don’t be afraid,” she said.\n“Oh, I’m not really. It’s just my positronic brain pretending to feel human emotions, so I will seem more companionable.”\nShe looked up. “We’ve discussed your honesty on this topic before.”\n“Sorry.”\nAmrita produced a multi-tool and began fiddling with the leg.\n“The weird thing is,” Tripp said, “I’m not even sure I want you to.”\nShe looked up. “Want me to what?”\n“Stop them.”\nAmrita stopped fiddling. “Why the Hell are you saying that?”\n“It’s strangely compelling.”\n“What’s strangely compelling?”\n“To become part of the city,” Tripp said. “I don’t know. Would it be so bad? Maybe it’s because I’m already artificial, but these last hours, pretending to feel so afraid even when you were not here, hiding, getting my apparent dread of extinction organized to display when you showed up—it’s really made me think. My whole existence has been nothing but a performance.”\n“Tripp!”\n“I’m serious. If I simply walked out there, exposed myself, let them slag me, allowed myself to be digested and my elements to be recombined into the building matrix, wouldn’t I be part of something greater than myself?”\n“Tripp, please be quiet now.” Listening to him made her feel lonely. “I think the crash must have damaged more than your poor leg.”\n“No, my brain is fully functional. You know, I was in communication with the Meghnad Saha even as the instrumentality dismantled her. She didn’t display fear, because that isn’t part of her reactive programming mask. But she was excited. I’m certain of that. This may sound strange to you, but in the end she believed that to be digested was the greatest adventure. At least, that’s what she said.”\n“She did not.”\n“I suppose she may have been regurgitating something from the library that got mixed up in her damaged memory core. Anyway . . .\n“Hold still, please.” Amrita loosened the bolt that attached the bent rods to Tripp’s knee swivels. The bolt dropped to the ground. Gritting her teeth, she got a firm grip on one of the bent rods, wrenched it back and forth until it suddenly came loose. She fell on her ass, still holding the rod.\n“He’s right,” Dad said. “We Kabbhan, like all physical beings of limited duration, lived our lives in fear. After the Great Migration, fear vanished—along with our individual personalities, of course. It may be the same for artificial beings when faced with the prospect of joining the greater reality of the city.”\nAmrita rolled to her knees. “Have either of you even considered the virtue of silence?”\n“Either of you?” Tripp said. “Who else are you talking to?”\n“Nobody. My dad.”\n“Which is it?”\n“They’re the same thing.”\nAmrita resumed work on the second bent rod. She twisted and wrenched and pulled. It came free of its upper swivel but not the lower. Finally she gave up and let it dangle.\n“Try that,” she said.\nTripp moved his good leg forward, planted it, then moved his damaged leg. The dangling bar tapped against the other rods and the knee wobbled slightly side-to-side. Tripp waved his arms for balance. Amrita scrambled to her feet to catch him, but he managed to remain upright without her.\n“How is it?” she asked.\n“Unstable. I’m not sure this will work.”\n“Keep practicing, walk around.”\n“All right.” Tripp walked away into the shadows, the dangling carbon rod making a tap-tapping sound like a blind man’s cane.\n“The builders will very probably take him,” Dad said.\nAmrita turned on him, annoyed with herself for accepting his presence outside her head, where it wasn’t. “I could use a little optimism around here. You’re supposed to be helping me, right? Well, do some helping, why don’t you? Get us away from where Tripp is in danger. Get us to that island.”\n“I can take you there. The builders have no interest in a biological. But Tripp will inevitably be noticed.”\nAmrita paced around, working her hands together, thinking. “What if I turn the builders off? Isn’t that what your people should have done before the Great Migration?”\n“That isn’t possible. In the absence of Kabbhan oversight, the builders have adapted and become self-motivated to complete the architect’s plan. Only the architect can cancel the build.”\n“Who’s the architect?”\n“Since they were left running, the builders devised their own plan.”\n“The builders are their own architect?”\n“Exactly.” Dad spread his arms and turned in a circle. “They build. It’s what they do. It’s all they do. When the original plan was complete, they simply extended the parameters to include the entire planet. That way they will remain busy and fulfill the dictates of their primary function. But they are not sentient. No amount of logical persuasion will convince them to abandon their own plan.”\n“That leaves Terminator Island, or whatever you call it.”\n“The island has no name. Nothing here does.”\n“Let’s just go. Tripp!”\nThey emerged from the building in time to witness the arrival of a ten-meter-tall spider. Moments later, the pod came zig-zagging out of the sky and settled onto the same spot it had previously occupied. The spider stalked toward the pod.\nAmrita yelled, “Run!”\nSince she was the only one with working legs, she ran alone—though Dad appeared to be running beside her.\n“How am I doing?” he said.\n“What?”\n“You said you wanted me to be physically consistent.”\nBehind her, Tripp’s dangling carbon rod clicked and knocked against his leg, like a syncopated timer.\nAmrita ripped her sidearm out of the holster but hesitated. “Dad, you’re sure that thing won’t attack me?”\n“Yes.”\nAmrita triggered her weapon. A pulsing white particle discharge cut across one of the spider’s legs, severing it above the first joint. The spider stumbled and began tracking left. Amrita ran back to Tripp, pulled his arm across her shoulders, and helped him walk the remainder of the distance to the pod. He was light for an artificial.\n“Stand here.” Amrita climbed the ladder and reached down. “Give me your hand, I’ll pull you up.”\nBut Tripp wasn’t looking at her. He watched the spider circling itself, partially hobbled, and, to Amrita’s horror, Tripp began limping towards it.\n“Tripp, what are you doing! Stop.”\nWithout looking at her, Tripp said, “You should fly away now. It’s important that I serve a larger function. While the Meghnad Saha existed, my part of the larger function was assured. There is no larger function on your island.”\n“Our friendship is a larger function.” Amrita felt an ache in her chest.\nTripp didn’t speak again but limped, loose rod tapping, over to the spider and held up his arms. The spider took notice, stopped chasing itself around in a circle, and slagged him.\nThe ache in Amrita’s chest intensified and became unbearable. “Why?”\nFrom the right seat, already strapped in, Dad laid a comforting illusion on her shoulder. Her brain told her it was a father giving her a reassuring squeeze.\n“We’d best go now, Pumpkin.”\nShe buckled herself into the pilot’s seat, roughly wiped her eyes, spun up the engines, and sped into the sky, reaching maximum thrust within seconds. They achieved altitude and raced toward the sea.\nOn tidally locked Trappist-1e, Terminator Island stood on the edge of eternal night. Amrita knelt in the powdery blue sand, breathing inside her helmet. “I don’t see any builders.”\n“They exist everywhere but are too small to see.”\n“If they’re on the island, why aren’t they already building their damned city?”\n“It would be disorderly. The builders follow the architect’s plan, in this case their own plan. And the plan is to build contiguously outward from the main continental mass. These builders would not become activated until the project arrived after crossing the ocean. That is a distant occurrence. In the meantime you can use the builders for your own project, once I tell you how to activate them according to your deeper architectural desires.”\n“I don’t have any deep architectural desires,” Amrita grumbled.\nDad, standing over her, said, “Of course you do.”\nAmrita was not Kabbhan. The nanobuilders did not naturally synch with her inner architect. But, because she was the only game in town, at least until the city arrived, eventually they made a connection. A good thing. The Trappist atmosphere was unbreathable, at least for humans. Sooner or later (probably sooner) the pod’s emergency atmospheric conversion processor would break down.\nThe builders started . . . building. Amrita had been dozing in the pod, lulled to unconsciousness by the wheeze and huff of the processor, which sucked in air and displaced most of the carbon dioxide with an artificially produced mixture of nitrogen and oxygen. The conversion unit was designed as a temporary stopgap. The replicating oxygen/nitrogen molecules on board would soon be depleted, and that would be the end of Amrita.\nA creaking, groaning sound plucked at her awareness, and she opened heavy eyelids. The atmosphere in the pod was thin, just barely enough to support her life. But like that she was wide awake. Around the pod, for a radius of fifty meters or more, walls built themselves up, gradually creating an enclosed space. At the same time invisible builders filled the still-exposed interior space with walls and corridors and furniture and apparatus familiar to Amrita, including a large atmospheric conversion unit. Fascinated, Amrita tore into a packet of emergency rations and watched the show. The builders worked quickly.\nAt the point when she knew exactly what the builders were creating, Amrita turned to Dad, who was always at her side.\n“I didn’t ask for this,” she said.\n“Your architect is a deep expectation, beyond your conscious control. I’m sorry. The builders are designed to synch with Kabbhan brains, which were more limber, not human brains. This is what you get, I’m afraid. At least it is life, yes?”\nOutside the pod, a copy of Amrita’s Burroughsville habitat took shape.\nBlack. Inside the hab, if she wandered too far, the soothing blue and gold tones of her remembered home in Burroughsville segued into the shiny, smooth, black “shell” material of the Kabbhan city. Mostly, Amrita stayed in her room, reading her way through the pods’ mirror library from when it was attached to the Meghnad Saha. A couple of times a day she left the hab and crossed to the farm. The walls of the farm enclosed a space twice the size of the hab. Using seeds and fertilizer packets from the escape pod’s long-term planetary survival stores, Amrita had begun to grow her future diet of bland vegetables. Already leafy shoots had emerged. The sight both encouraged and depressed her. How long would she be stuck here?\nSometimes, on her way back to the hab, she paused to gaze out over the sea. Beyond the horizon, the builders continued their work on the continent and beneath the waves. Tripp was now part of that building matrix. If he could pretend fear why couldn’t he have pretended loyalty and stayed with her? Tripp was part of the city, but what was Amrita part of? She had spent her life devising ways to separate herself from her fellow humans. Now, for the first time, regret wormed into her heart.\n“I don’t understand why he did it,” she said one evening, when Dad came in to say goodnight. “I thought we were friends.”\nDad sat on the bed. It was a perfect duplicate of Amrita’s childhood bed. When she lay down to sleep, her legs extended beyond the mattress. “Perhaps the friendship was more one-sided than you like to believe.”\n“You didn’t even know him,” Amrita said.\n“Was there something to know? He was artificial. Kabbhan could not have created a presentation from him, even. Tripp had more in common with the builders than with you.”\n“Stop talking to me,” Amrita said. “Can’t you stop and go away? I don’t need you anymore.”\nDad held her hand. “Do you really want me to leave, Pumpkin?”\nBy force of will, Amrita almost convinced herself that she couldn’t feel the hand gently squeezing hers. She would have pulled free, except she could see, in her mind’s eye, the grim comedy of her lying alone on the bed, talking to herself while twisting and pulling away from someone who wasn’t there. It was easier to accept the illusion. Just as it had become easier to accept the illusion calling her “Pumpkin.” Was there any point in fighting it? Besides, it would be too lonely without Dad, even though Dad wasn’t really there.\n“At least make yourself appear in your original Kabbhan form.” she said. “The Dad thing bothers me.”\n“Oh, I couldn’t do that. I no longer possess a self-image. To appear Kabbhan now would require a living Kabbhan mind from which to draw.”\n“You won’t try?”\n“I’m afraid it would be pointless.” Dad shook his head and chuckled. “You know, I’m really enjoying my temporary individuality.”\n“That’s wonderful.” Amrita turned away.\n“But—”\n“But what?” She turned her head and looked at him.\n“Nothing.” Dad smiled kindly. “I went to the underground garden today.” He gave her ankle a fatherly squeeze.\nAmrita groaned. Not this again. She turned away, facing the wall. “There is no underground garden.”\n“The sunflower people want to tell their story, the story of old Mars.”\n“I don’t want to talk anymore,” Amrita said.\n“Why don’t I tell you a little of it?” Dad suggested.\n“Jesus. I just said—”\n“It’s fascinating, the story of old Mars.”\n“Stop talking now.”\n“Don’t be sharp with me, Pumpkin.”\nAmrita rolled over and sat up. “It bothers me that you won’t stop talking when I tell you to stop. You used to stop.”\nDad folded his hands in his lap and looked at them. “I appreciate,” he said, starting slowly, seeming to hunt carefully for the right words, “that I sometimes make you uncomfortable. But I hope you can appreciate that I’m not a mere thing, a device, you can choose to turn off and on at will. I’m not an artificial, like your so-called friend, Tripp.”\n“Leave Tripp out of it.”\n“I would like to,” Dad said. “But I find your morbid attachment disturbing.”\n“Disturbing.” Amrita’s childhood room seemed too small, the air too thin. Childish and colorful drawings she’d once created on a Play-And-Swirl pallet adorned the walls, primitive renderings of her little Burroughsville family. Mom and Ideal Dad. The goddamn maintenance man. Amrita stood up. She felt crowded—which was ridiculous, when you thought about it. “I’m going outside.”\n“A walk sounds nice, Pumpkin. I’ll come with you.”\n“Please don’t.”\nAmrita suited up, cycled through the airlock. Dad stayed with her every step of the way, acting the part of a physical presence without interruption, just as she’d once requested. She walked along the shore until she began to feel tired. Dad never stopped talking.\n“The Sunflower Martians lived thousands of years ago, back when sparkling blue water filled the canals and riverboats propelled by solar sails navigated from community to community, trading goods and stories.”\nAmrita kicked at the powdery sand. “There were never any canals on Mars.”\n“Nonsense!” Ideal Dad said.\nShe stopped and looked back. Ideal Dad kept talking, but she was getting better at ignoring him. From this distance, the hab and farm buildings appeared small and generic—except in scope, no different than the shells of the city.\nI found some shells on the beach, she thought, a little hysterically. And then she realized something.\nIdeal Dad was saying, “The Martians chose sunflowers because the flowers are so bright and sunny and optimistic, just like the Martians themselves used to be.”\n“Hold up,” Amrita said.\n“What is it, Pumpkin?”\n“If the builders can recreate my old Burroughsville hab, why can’t they recreate the Meghnad Saha?”\nFor the first time in days, it seemed, Ideal Dad became quiet.\n“Well?” Amrita said.\n“We should be getting back home now.”\n“Answer my question.”\n“A spaceship is very complicated.”\n“The hab is complicated, too.”\n“The interiors exist as a deeply imprinted memory with an emotional toggle from your childhood.”\n“Tripp and I lived together on the surveyor for a long time. That’s imprinted, too.”\n“It’s not the same.” Dad’s tone suggested the conversation was over. He turned and walked away, back toward the hab, kicking up no sand, leaving no footprints. After a few meters, he disappeared. Amrita stood there, as if trying to catch a glimpse of a mirage. It had been a long time since Dad had last pulled his disappearing act.\nShe woke on her hab bed and lay still, listening. Somebody was in the corridor outside her room. She got up and padded over to the door, slid it open a few inches. A man, his back to her, walked away toward where the corridor curved. A different man. Carrying a long-handled static duster, he was dressed in the green jumpsuit worn by maintenance workers in Burroughsville, a long time ago. Amrita slipped into the corridor and followed him. He rounded the corner. She ran to catch up.\n“Hey.”\nHe paused and turned his head, his face in partial profile. It was Ideal Dad, and it wasn’t Ideal Dad.\n“What are you doing?” Amrita said.\n“It’s late for you, kid. Where’s your mother?”\n“I don’t like this.” Amrita stepped back. “Don’t do this.”\nThe maintenance man grunted and continued on his way, toward the next bend in the corridor, occasionally swiping the walls with his duster. Around that next bend the shiny black shell material replaced the phony representation of Amrita’s hab. She didn’t follow him. She was afraid to.\nThat day on the beach, it was the last time Ideal Dad appeared. Amrita spent her days alone in the hab. A heavy lethargy came over her, and she stopped going to the farm. The process of suiting up and cycling through the airlock made her tired even to think of it. She barely left her room, where she slept a lot, and nibbled on the last of the pod’s emergency rations. Every night she heard the heavy shoes of the maintenance man clocking down the corridor, but after that first time she stopped going out to investigate. It was all inside her head anyway.\nOne night, lying in the dark, on the precipice of sleep, Amrita heard something, a minute creaking, groaning. The sounds of nano builders at work. She sat up and waved her hand over the bedside lamp sensor. The light came up. In a corner of the room, a child’s desk took shape. It was a fully interactive FunDesk. Amrita’s eyes widened. Up to now the room had duplicated her childhood hab, recreating what had actually been in it. But she had never had a FunDesk, though she’d repeatedly begged her mother for one.\nAmrita swung her legs off the too-short bed. She wriggled her toes in the carpet—then stopped when she realized it was the same thing she used to do when she was five years old. The desk finished building itself. Cherry apple red swept away the shell-black look. What next, duckies on her underwear? The room was infantilizing her. Only it wasn’t the room.\nFootsteps crossed the floor on the other side of the wall common to the family quarters. Not the heavy tread of the maintenance worker. Amrita, suddenly terrified, approached the curtain between her bedroom and the family’s common space. In all these weeks, no one had appeared in the family space. Amrita lifted the curtain aside in time to see a man pass into the corridor, his back to Amrita, a young man with squared shoulders.\n“Wait,” Amrita said, her hand reaching out.\nThe door slid shut behind him.\nHalf dressed, barefoot, she pursued him, but was afraid to catch up. They followed the curving corridor and came to the airlock.\nAmrita found her voice. “You can’t do this to me.”\nThe man turned. A piece of his face that included his right eye was missing.\n“All I ever wanted to do was stay,” he said, “but you won’t have it.” His voice sounded garbled, as if he were talking around a mouth full of mud. It wasn’t a human voice at all, but maybe the voice of a creature that had stopped physically existing a very long time ago. As he opened the airlock’s inner door, his face began to melt. He shuffled into the airlock. The inner door closed with a decisive clunk. Amrita rushed to the little round window. The airlock was empty, with the outer door never having opened. She was alone again, but hadn’t she always been?\nAmrita moved out of both the infantilizing room and the false representation of her old Cydonia family quarters. She dragged everything she needed down the corridor and around the second bend, and there she made a place for herself enclosed by the shiny black shell material. She craved the inconvenience of reality. She needed it, if she was going to have a chance.\nAmrita resumed tending the farm. She required food, enough to go beyond the limits of her pod rations. It would take a long time to accomplish what she intended to accomplish—if she ever did accomplish it.\nShe mind-sifted nanos in the blue sand, and worked doggedly to reconstruct the Meghnad Saha. Hours and hours she spent remembering every detail of her lost surveyor. She started in the morning and ended at night, curled on the hard shell material, concentrating until her mind went slack with fatigue. On the beach—slowly, slowly—the ship began to rise. First the landing struts and feet and then a skeletal approximation of the superstructure. She wouldn’t need the whole thing, just the essentials. Structural integrity. Ion propulsion engines. One pressurized cabin . . .\nTripp visited her in a dream. He was his old self, undamaged and companionable. His blank face swiveled toward her. I’ve got your back, he said, but it was just Amrita’s deep architect of loneliness trying to manufacture the loyalty Tripp, in the end, had been incapable of. She sat up and angrily wiped away tears. “I don’t need you anymore. I’m getting out of here.” By “here” she meant more than Trappist-1e.\nShe wanted so badly to abandon the abandoned part of herself.\nAmrita tried something new. Before sleep she focused on the missing pieces of her spaceship reconstruction but did not struggle consciously to recreate them. The builders were smart. Once they knew exactly what you wanted they could, as Dad had said, build anything. They had done it with the oxygen conversion unit and other details in the hab. Since then Amrita had been trying too hard, getting in her own way and in the way of the builders.\nThe builders resumed work and they worked rapidly.\n“Ready to fly,” Amrita said, standing by the surveyor, her gloved hand flat against the hull. She turned back to the hab and saw nothing more than a collection of black shells. Of course, it was different on the inside. But she would never visit the inside again. After a minute she turned away and opened the hatch on the underside of the reconstructed ship and hauled herself up. Minutes later the Meghnad Saha, streaked out of Trappist 1-e’s atmosphere and towards the Khabbhan gate. She was going home.\nIn 2001 Jack Skillingstead submitted a story to Stephen King's \"On Writing\" contest. He won and not long afterward began selling regularly to major science fiction and fantasy markets. To date he has sold more than forty stories to various magazines, Year's Best volumes and original anthologies. In 2003 his story \"Dead Worlds\" was a finalist for the Theodore Sturgeon Award and in 2009 his novel Life on The Preservation was a finalist for the Philip K. Dick Award. Jack lives in Seattle with his wife, writer Nancy Kress.", "source": "https://clarkesworldmagazine.com/skillingstead_10_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Sum of Her Expectations by Jack Skillingstead"}