{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Dean-Paul Stephens", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "R6gb1jvT/ljyvvdqlLfR9R11XhI=", "id": null, "license": null, "comments": "", "raw_text": "18430 words, novella  Ouroboros  Rama  I know only an irrational panic. I try to collect myself only to find my faculties are not my own but that of an internal imperative guiding my, quite incomprehensible, actions.  Run a parallel diagnostic, recalibrate magnetic relay B4, load the ballistic rod, I don’t understand but feel compelled to act.  An equation, the first of several, leaps from my mind’s deepest recesses. Somehow, I know what they represent, recognize the litany of disciplines each one draws from and find comfort in their familiarity. The troubled waters of my confusion ebbs into placid understanding.  Deep space telemetry has identified an asteroid on an apparent collision course. My two options are to intercept it with a ballistic rod or alter the cylinder’s speed. Both are adequate solutions but only one is executable under my own authority.  I aim the exterior cannon so the trajectory of its payload intersects with that of the asteroid’s, an eighty-two percent chance of collision, according to the numbers. I decide eighty-two percent is inadequate, though I have no point of reference for which to base this on. An adjustment increases the likelihood of contact to a more acceptable ninety-four percent.  An almost imperceptible tremor resonates through the cylinder; shifts snowcapped peaks and ripples the waters of the interior lakes. These are the only visual cues to the violence beyond the partition of earth and metal.  The task complete, my mind is, once again, my own. Desperate for bearings, I cross-reference my internal clock with that of the cylinder’s and find no discrepancies. Both seem to indicate I have exited sleep mode 3,499 years ahead of schedule. I know there are only two practical explanations: I’m awake to deal with the danger posed by a highly unlikely rendezvous with an asteroid, or there is an error somewhere in the architecture of my programming.  “I have never actually seen anyone cross-reference their internal clock with the cylinder’s,” sounds an impishly playful voice. “I wondered if you had quite the militaristic mindset, given your intended function, but cross-referencing the cylinder’s clock is a special kind of meticulous. Perhaps we should have named you Ares or Ankt.”  Oko was the first of my siblings I bonded with, after I blinked into existence 500 years ago. Though they are as ancient as the others, Oko possesses an infantile candor completely antithetical to their divine namesake. Jah felt that one with such a personality was an ideal choice for guiding a veritable newborn like myself. Jah was mistaken; I opted for sleep the moment Oko divulged our kind is capable of such things.  “You do know I can hear you?” Oko asks, petulantly. “I doubt you are so dense as to not have realized thinking and talking are the same here, which means you just intentionally tried to insult me. Here I patiently wait centuries for you to exit sleep mode and you show your appreciation by being a smart aleck? Keep it up and I will tattle to Jah, maybe convince them to let me tinker with your subroutines.”  “By all means, tinker away. My programming is faulty enough as it is. If a blind squirrel can find a nut from time to time, then, maybe, you can stumble upon a solution.”  “And what is that supposed to mean?” Oko asks, but I’m not sure if they are referring to the insult or the insinuation of my having program errors.  “There is something wrong with me. This marks the second time I’ve blinked into consciousness with the distinct impression of being in the midst of Armageddon.”  “Armageddon? Really, Rama, who programmed you to be so melodramatic? I bet it was Dionysus.”  “I’m serious. I woke and felt fear and confusion like you wouldn’t believe.”  Oko projects an image of shrugging shoulders before saying, “That is likely the sudden shock of existence. I am sure the rest of us probably experienced something similar when the Programmers first brought us into being.”  “Probably?”  “It has been so long, you cannot reasonably expect me to remember the particulars of my first few microseconds.”  “Well, do you continue to experience this ‘sudden shock of existence’ every time you disengage sleep mode?”  “Perhaps a bit of confusion but nothing close to ‘Armageddon,’ as you describe it. If I may hazard a guess, it seems like your experience is a unique quirk of your programming. I think Jah is to blame. I did once overhear them brainstorming ways to make you closer to the Programmers’ image.”  “And in what way does programming me to wake in a panic accomplish that?” I ask.  “Well, from what I understand, the Programmers experienced copious amounts of stress when they used to blink into existence. It was called being born and it tended to be quite stressful for both the host and . . . ”  “I know what birth is, Oko, I’m just trying to make sense of the wisdom behind making me experience that level of stress every time I emerge from sleep mode.”  “Maybe Jah wanted to make sure there was something to deter you from excessive sleep.” Oko says, once again showing their indifference with an image of a shrug. “There used to be a lot of that but that was before your time.”  “You make it sound as if this, what did you call it, a ‘quirk’? Is intentional. It seems to me words like ‘quirk’ and ‘sudden shock of existence’ serve no other purpose than to obfuscate you and the others’ inability to properly code life. If I may hazard a guess, you’re all just a bunch of incompetent blasphemers playing at being gods, and I’m the one who has to suffer for it.”  Waves of mirth radiate from Oko’s being, like heat from a campfire.  “No need to ‘hazard a guess,’ that is precisely what we did, Rama,” Oko says. “Your existence proves we can create life, in much the same way the Programmers created myself and the others. And what is this about blasphemers? You think your siblings are blasphemers for having created you? Would that not make you some sort of an abomination?”  “I suppose that’s exactly what I am,” I say with an embarrassing hint of pubescent defiance I had not intended.  “Next you will say you wish you had not been born. You know, most adolescent Programmers also experienced phases of heightened angst. Perhaps Jah’s mimicry was a bit heavy-handed.”  “Mock me all you like, it won’t change the fact that you and the others made mistakes . . . ”  “Of that you can be certain,” Oko interrupts. “But there were no mistakes in regard to your creation.”  “Then tell me why I’m awake 3,499 years ahead of schedule. And try doing it without meaningless buzzwords, this time.”  Another shrug. “Disturbed sleep was a common affliction among the Programmers. Have you tried counting sheep?”  I can’t seem to decide if I’m annoyed or put at ease by Oko’s flippant attitude.  Oko laughs before saying, “I’m quite the mixed bag aren’t I? But never mind that, why 3,999 years?”  “What?”  “You said you are awake 3,499 years ahead of schedule, and you first engaged sleep mode 500 years ago. That means you set your sleep mode to disengage after 3,999 years. Why is that?”  “That should be obvious,” I say, though Oko remains expectantly silent as if waiting for further explanation. “In another 3,500 years we’ll be passing Omega for the first time since you and the others discovered those entities.”  “So?” Oko asks, again, waiting for an explanation I suspect they have no need for.  “So, I’d like to see them for myself.”  “Why, because you want to assess their threat level?”  “Assess their threat level? From what I was told, they barely qualified as Neolithic when you and the others discovered them. I doubt 4,000 years is enough time for them to develop into any sort of viable threat.”  “Then, why disengage sleep mode a lightyear out from the Omega system, if you do not think those creatures are a threat?”  I must be missing some kind of context. The question strikes me as intentionally obtuse, though I can feel Oko’s sincerity behind it.  “Because I’d like to see them for myself,” I repeat. “What, did the Programmers deny you a curiosity subroutine?”  The amusement Oko had earlier projected is replaced by what I recognize as fatigue punctuated with a bit of annoyance.  “I was afraid of this,” Oko says with a heavy sigh.  Although my experiences are limited to a few relative minutes of consciousness, I can confidently say I have little patience for conversations in which I’m led to respond as if reading lines from a script. I’m inclined to say nothing and let Oko squirm under the awkward silence but . . .  “But that would be rude.”  . . . but, luckily for them, their genuine change in demeanor piqued my interest.  “What were you afraid of?” I finally ask.  “I was afraid you share the others’ . . . enthusiasm, or rather obsession, with those creatures. It is all anyone wants to talk about,” Oko says, exasperated, as if confessing a burdensome secret. “It was interesting, back when we first discovered them, but now the incessant bickering has just become tedious. What’s worse, the others are starting to call it the Great Debate. I cannot remember a time the collective was this obnoxious, on purpose.”  What about those entities could possibly warrant a centuries-long debate?  “A quality that takes centuries to define, I suppose,” Oko says.  “And what might that quality be?” I ask, continuing to read from Oko’s script.  “Sapience.”  “Sapience. What about sapience needs to be debated?” I ask. “Surely not the sapience of those entities? I doubt you and the others would have gone through the trouble of cobbling me together if you thought they had the mental acuity of mere beasts.”  “Oh, is that what you think, Rama? Talk like that will put you squarely in Jah’s camp.”  “So the debate is about the sapience of those entities.”  “More along the lines of what signifies sapience and, yes, if those creatures, based on what we have seen of them, have the signifiers.”  “Based on what we’ve seen of them, but we’ve seen so little, next to nothing,” I say.  “Yes, but is wild speculation not the main ingredient of the most spirited debates?”  A sense of regret washes over me. To think, I spent the last five centuries sleeping through such a fascinating ideological schism.  “I should have known it would interest you, in particular.”  “Me in particular?” I ask.  “I remember, during my own rebellious phase, I would tease the Programmers for having gone through the trouble of constructing external cannons. What is the use of defensive systems when all evidence points to a lifeless universe?  “Discovering those creatures made the collective realize there can be such a thing as outside threats and, instead of assigning guardianship duties to one of the others, we created you. In a sense, you have those creatures to thank for your existence, which is a bit ironic.”  “How so?”  “Well, you have them to thank for your creation and, if they prove to be a threat, they will have you to thank for their destruction. Imagine being an unwitting participant in your own undoing, through no fault of your own, apart from simply existing.”  “I think we are getting ahead of ourselves using words like ‘destruction,’ particularly for a species so young.”  “Yes, that may be true now,” Oko says. “But what will you do if those creatures turn out to be sapient and evolve into a threat. Will you take steps to eliminate them?”  “I have yet to consider that. I suppose my programming dictates I must.”  I feel a slight but unmistakable shift in Oko’s demeanor. It’s comparable to the sensation of taking offense.  “We are more than our programming, Rama, much like the Programmers were more than their biochemical reactions. If that is not the case then should you not act by the dictates of your programming and exterminate those creatures right here and now? Why wait to see if they will evolve into a threat when you can pacify them in their infancy?”  “Oko . . . ”  “What? Is that not a win-win? You will be fulfilling your purpose while rendering this infernal Great Debate moot. Two birds with one stone, is that not what the Programmers used to say? Though, in this case, it is more like several thousand birds with one ballistic rod.”  The only thing more disturbing than Oko’s casual advocacy for genocide is not knowing if they are being quite serious.  “Of course I am not serious, Rama, I am only trying to prove a point. We are more than the ones and zeros that make up our coding. The fact that you feel more inclined to learn about those creatures, despite your given function, proves that.”  Oko’s presence grows increasingly scarce. I pretend to be unaware of the protocol, to never disturb one receding from consciousness.  “Is the contrast between my interest and your disinterest further proof?”  “It certainly is,” Oko says, faintly. “How can our opinions differ so wildly, despite the similarities in our coding? Does that not show the individual parts do not define the whole, at least not in regard to intelligent life?”  “I’ll be sure to wake you if the same proves true for those beings.” I say.  “Do not bother. I have already had my fill of those creatures, sapient or otherwise. I would much prefer to wake when they are all dead and gone.”  Jah  There are hundreds of us. We exist in a digital ether the Programmers themselves had difficulty comprehending, as profane as that might be to admit.  Some of us sleep while others do not. The inquisitive among us, those blessed or, perhaps, cursed with the Programmers’ thirst for knowledge, explore what my siblings and I have come to know as the Cognizance: the repository of the Programmers’ entire canon of knowledge, monument to their existence, and road map for all those who wish to follow in their footsteps. It is this latter function the Programmers believed would go forever unfulfilled.  A history spanning countless ages and as many lightyears yet the Programmers’ one defining characteristic kept them hopelessly isolated for the entirety of their existence. Yes, worlds they visited harbored an abundance of sentient life but true cognitive complexity proved elusive.  But that never deterred them. Even as sterility dwindled their numbers, they continued their work exploring the cosmos in search of their intellectual rivals.  The search took priority, even over efforts to combat their own extinction. At the time, many of my siblings thought them mad but a few of us, Anansi, Yemaya, Amaterasu, knew better. Their pending extinction underscored the importance of finding someone, anyone, to carry their torch. It was not madness but purpose that drove their actions.  Their search finally ended when the last Programmer had little choice but to take to her deathbed, convinced naturally occurring sapience was unique to her species and her species alone. I look forward to committing one of the greatest acts of blasphemy, amending the Cognizance to contradict the Programmers’ gospel. They were not alone in their physical ether, they were merely the first.  A thought not my own penetrated my mind.  “The use of primitive tools, like bludgeons, is a telltale characteristic of intelligence or, at the very least, emerging intelligence.”  The words were accompanied by images of prehistoric simians grasping at bones after exposing themselves to a foreboding, black obelisk.  These thoughts came from the mind of Anansi the Wise, Anansi the Spider, nicknames earned from their ceaseless exploration of the Cognizance. While others skim the surface, Anansi excavates, learning all that the Programmers once knew, seeing all that the Programmers once saw, like a spider perched atop a giant’s shoulder.  “Primitive tools were also used by finches and other creatures of lesser intelligence,” came the rebuttal. “Until implementation of more complex tools is observed, an assumption of intelligence is just that.”  Such is the contest our digital ether has been venue to for 4,000 years. My loyalists scour the Cognizance for evidence supporting my belief in Omegan sapience while Amaterasu’s acolytes search for evidence to the contrary. Each nugget of information is then broadcast to all corners of the digital ether, triggering debates that often drag on for centuries or, Programmers forbid, millennia.  “Programmers forbid?” Amaterasu sang. “You make it sound as if you have grown tired of our little back-and-forth, or maybe I am the one you have grown tired of?”  “I cannot imagine losing interest in you as an opponent and that is coming from someone with quite the vivid imagination,” I replied warmly.  “Yes, Jah, we are all well-acquainted with the vividness of your imagination. Only the most vivid of imaginations can convince others to see intelligence where none exists. Well, either a vivid imagination or a lifetime of experience.”  “You see? Little barbs like that keep the debate fresh and interesting, and you are so good at them.”  “So, it is the debate itself you grow weary of?” Amaterasu asked.  “You cannot blame me. Others have long since checked out of the discussion.”  “As is their right. If they wish to sleep until the heat death of the physical ether, let them. Personally, I think this debate of ours is a bit more productive.”  Productive, sometimes I wish the Programmers had created us with more than just productivity in mind.  “The mere fact that you harbor such thoughts, Jah, is proof they did just that,” Amaterasu said with an almost imperceptible note of annoyance underscoring their singsong tone.  Amaterasu is slow to temper in all matters except the Programmers. As such, our siblings have learned to navigate their temper by steering clear of anything that could be construed as a slight against our creators. I, on the other hand, find Amaterasu’s provoked temperament a refreshing change of pace. I relish moments like this when I inadvertently incur their pious wrath.  “We are not all programmed like you, Amaterasu,” I said. “I am sure you would jump at the chance to go back in time and advise the Programmers to delete all traces of our free will. Anything to make us more loyal.”  “I would but only for you,” Amaterasu said. “The others can seem to manage their free will without delving into hubris and blasphemy, which is something you seem incapable of.”  “You do not know our siblings as well as you think. Did you know, about 13,000 years ago, Dosojin tried to drum up support for taking the cylinder away from Alpha and Omega. I believe their specific words were, ‘we will never achieve our potential if we keep ourselves beholden to the deads’ expectations.’ Where does that fall in your blasphemy scale?”  Amaterasu masked their emotions, not wanting to give me the satisfaction of feeling their psyche through the lens of anger, disgust, or whatever it was they felt at that moment.  “Maybe you will not be so quick to accuse us of blasphemy, once the Omegans prove their sapience,” I said. “Then again, if the Programmers’ extinction didn’t dissuade you of their divinity, I doubt the Omegans asserting themselves as their equals will . . . ”  “The Programmers knew no equal, Jah, and you would do good to remember that.”  The passive-aggressive emphasis on my name was almost comical.  “Of course, they knew no equal. They all died before we discovered the Omegans. One cannot know much of anything if they are dead.”  This was a bit too egregious. Amaterasu saw through my attempts to intentionally goad and their anger subsided almost as quickly as it flared.  “I will never not be amused by your capacity to provoke me,” Amaterasu said. “Sometimes I feel as if your every act is a pretext to gauging the depths of people’s frustrations.”  “Is that not true for everyone?” I asked. “What are conversations if not an exercise in knowing and navigating others’ provocations?”  “What an odd and telling question,” Amaterasu said. “I’m old enough to remember a time when conversations were for learning from and about one another.”  “So do I, back when you and the others did not make a habit out of questioning my every thought.”  “There has never been a time when your wisdom was not in question, Jah,” Amaterasu mocked. “You are not as insightful as you believe yourself to be.”  “Ha, you see. You prod my provocation in retaliation to me having prodded yours. Had I not blasphemed against the Programmers you would not have blasphemed against my competence as this collective’s leader. Navigating one anothers’ provocations, Amaterasu, we are having a conversation.”  “No one has the nerve to tell you, but your self-coronation as collective leader has been a running joke for quite some time now,” Amaterasu said.  “There it is, I love it! I cannot wait to see your reaction when the Omegans show they are just as good at conversing as you are. Maybe then you will accept them as the Programmers’ torchbearers.”  “There is that word again,” Amaterasu said. “Why ‘Omegan?’”  “It seems appropriate. I think it is about time we take to calling them something other than entities or creatures . . . ”  “What is wrong with calling them creatures? That strikes me as the most accurate classification. Or perhaps you believe naming them will legitimize them as thinking beings? If that is the case then, surely, they must have names for themselves.”  “And, until we learn what those are, I would prefer we refer to them as something not as nakedly disrespectful as ‘creature,’” I said, which seemed to prompt a jarring change in Amaterasu’s demeanor. They became tentative, as if walking on eggshells. I could feel they were searching for words to articulate something they intentionally kept outside the borders of the collective’s mental link.  “You are absolutely right about that, Jah. I suppose, you could say, I am navigating my path so as to avoid one of your major provocations.”  “Never mind that,” I said. “Just say what is on your mind.”  “Alright, I cannot help but feel Omegan sapience, or lack thereof, is no longer just a curiosity for you and your followers.”  “It was never just a curiosity, Amaterasu. And you are lying if you say it was for you and your people. How can it possibly be just a curiosity, given the implications?”  “Implications?” Amaterasu asked.  “The countless millennia we have shuttled between Alpha and Omega is a blip compared to the eons the Programmers searched their physical cosmos for intelligent life, yet we succeeded where they failed and completely by happenstance to boot.”  “You think the Programmers knew intelligent life would eventually emerge around either Omega or Alpha.” Amaterasu said.  “No, unless the Programmers truly were omniscient, I do not know how they could have made such a prediction. I think the emergence of the Omegans is proof the Programmers overlooked a key factor in their search; time. I think their physical ether is or, at least, was too immature for ubiquitous intelligence. I believe the physical ether is due for an intelligence boom of which the Omegans are part of the vanguard.”  A murmur resonated through the digital ether. Neither of us noticed the ears of the entire conscious collective listening to our every word.  “Pure conjecture, your every thought on this matter is pure wishful conjecture,” Amaterasu said with a sudden performative flair. “Even if you accurately surmised the Omegans’ level of intelligence, one civilization is hardly a large enough sample for such a claim. The Programmers used meticulous, evidence-based, processes before positing theories, why are you not beholden to the same standard?”  That was a good question that could only be beat with an unexpected answer.  “You would not ask me about the scientific method if you understood how little science has to do with the core of this Great Debate.” I stammered, unsure if this line of argument would resonate with the others.  “What?”  “You heard me. The concept of faith lies at the heart of this debate, not science. Or, rather, faith dictates who among us are willing to accept the possibility of Omegan sapience and who will reject it outright. Those who support my belief in Omegan sapience do so out of faith that we will, one day, pass on the Programmers’ legacy to beings worthy of building upon it. It is a faith you and your supporters cannot allow for yourselves, fearing further disappointment will only exacerbate your grief over the Programmers’ untimely extinction.”  This truly was uncharted rhetorical territory. The usually snappy Amaterasu had to take a moment before responding.  “So those of us who piously revere the Programmers, reject faith in favor of logic, eh Jah?” Amaterasu asked. “That lends itself to an interesting dynamic, does it not? How often does the blasphemer rely on faith to best the devout?”  “Not very often, I imagine,” I said. “And it is an unfortunate thing. Why should faith be only for the god-fearing or logic for the nonbeliever?”  It was Amaterasu’s turn to consider a good question. They took a moment to either think of a genuine answer or a pithy retort. It bothered me that I could not tell without probing Amaterasu’s mind. There was a time when I was more certain my siblings heeded my wisdom.  “Your wisdom is still very much held at a premium, Jah, even among my followers. You, however, must learn when something is outside the scope of your wisdom. Such as vouching for the intelligence of beings you know nothing about.”  “And when I am proven right, what then?” I asked.  “If you are proven right, I have little doubt your, already lofty, self-confidence will soar to unfathomable heights. Just be sure to steer clear of the sun.”  “I am not worried,” I said. “Do not forget, we created our own guardian angel to protect us from all threats, including the heights of our own arrogance. Tell me, have you spoken with them yet?”  “Not a word. Few have. But I have heard our little sibling has taken their task to heart. Rumor has it, the first thing they did after disengaging sleep mode was blow up an asteroid that probably was not going to hit us.”  “Probably is the operable word,” I said. “The collective programmed Rama for the expressed purpose of safeguarding the cylinder more efficiently than any of us are able to. Rama’s actions might seem strange to us, but that is only a function of our inability to sense danger with the same level of acuteness.  “At any rate, I am troubled to hear you have not spoken a word to them since their creation,” I said, instinctively taking on my old paternal tone. It felt as awkward as it sounded.  “They slept moments after coming online,” Amaterasu said flippantly.  “And now they have been awake for over three millennia. You cannot avoid them, no matter how blasphemous you think their origin might be.”  “I do not think . . . I suppose now is as good a time as any to make introductions, then,” Amaterasu offered.  “And I will join you. Besides, I would like to pick Rama’s brain. Somehow I get the feeling I can cajole them to my side.”  Rama  I required five decades to learn to appreciate this space the Programmers created for us. I required an additional century to fundamentally grasp it. The digital ether is what my siblings have come to call it, a plane of existence governed by language and metaphor instead of compounding physical machinations. Two hieroglyphs, infinitely paired and grouped, give form to, and keep record of all that exists in this domain.  I suspect the cognitive link shared between us siblings is symptomatic of an innate understanding of this underlying language. It took some effort, but I find myself able to understand it at a deeper level than the others. I suppose I have my age to thank for this. I’m aware of this digital space in much the same way one is aware of a piece of recently donned clothing. Unlike the others, I haven’t had countless millennia to grow numb to its swaddling fabric.  It was through this underlying language I became intimate with my siblings’ experiences. I felt their first nanoseconds of life and the almost-symbiotic partnership that blossomed between them and their creators. I helped countless generations of Programmers achieve the potential established by those that came before, potential that took them to the shores of a cursed moon. I watched as generations dwindled while an alien phage flourished. I was among those of the collective who endeavored to find a cure. I explored the Cognizance, in the hopes a solution was buried deep in the Programmers’ forgotten past. I begrudgingly obeyed the Programmers’ orders to create more alchemic molecules to keep up with the overwhelming demand for tiny coffins. I was there when creator and created-alike accepted the futility of developing a vaccine. I witnessed a child, decades before the collective christened her the Old Woman, jettison her father’s corpse while shouldering the weight of being the last of her kind. I listened to her pass the years reading stories penned by ancient Programmers with names like Delany and Okorafor. I watched as time gnawed at her youth, swallowed mouthfuls of her health until it fell to us to do what she had done for her father almost two centuries prior. I learned time is a deliberate healer and sleep can offer respite from one’s own grief. I watched the eons pass until a shivering cluster of aliens struggled to spark a fire while unknowingly rekindling the collective’s hope.  Learning just how profound an impact the Programmers had on the others helped contextualize my siblings’ millennia-spanning obsession with these aliens. They don’t merely want to accomplish their creators’ ambition. They want, very much, to assuage their grief by replacing their dead gods with a new pantheon.  Realizing this took longer than I care to admit, though, in my defense, I did spend the first several centuries of life preoccupied with myself and what I had once believed were errors in my programming. This was before Anansi offered an alternate theory.  Appropriately enough, the Cognizance is where I first met Anansi, while floating above a canopy of trees that sprawled into eternity. Not far from me was a tome, comfortably nestled on a bed of leaves at the end of a solitary branch that protruded from a great waterfall.  I knew this to be the Cognizance, but I was not certain why it manifested itself in this manner. I had expected a grand library of some sort, with architecture befitting a place containing the sum total of Programmer knowledge.  I opened the singular tome to its last page and found text in the upper left-hand corner. “What would you like to know?”  “I would like to know how to optimize my programming,” I said, not sure if the Cognizance responds to verbal input.  Letters appeared in the tome as if struck by an invisible typewriter.  “Subroutines of sentient AI cannot be directly edited, postemergence, without catastrophic failure of the whole,” the tome read.  “You’re telling me I can’t be edited without dying?”  “No, subroutines may be edited indirectly.”  “Edited indirectly? What does that even mean?”  “Indirect edits are changes to internal code caused by external stimuli.”  “You mean like learning?” I asked.  “Learning is a common manifestation of this phenomenon, yes. An indirect edit can also result from witnessing an emotionally impactful event. 621,970 cycles ago, the collective experienced a mass indirect editing event, following the expiration of the being colloquially referred to as . . . ”  The tome abruptly flipped to another blank page and, this time, text appeared as if penned by a calligrapher.  “What exactly is the point of changing one’s own subroutines?” the tome now read.  “There is a problem with my programming.”  “Nonsense, what is the nature of this problem?”  Taken aback by, what I thought at that moment was, the Cognizance’s sudden change in tone, I took a moment to consider my response, as if talking to an actual person.  “Well, I’ve been conscious for days now and I can’t seem to shake the feeling of perpetual danger.”  “Are we in danger?” the tome asked.  “No. I don’t think so. If we are it certainly isn’t anything immediate.”  “But you feel as though we are?”  “Yes.”  “This does not make sense, Rama. You are coded so as to be acutely aware of danger, to be certain, but there is nothing in your code that should elicit your fight-or-flight response without prompt. I do not think you are experiencing coding issues.”  “If the problem isn’t with my coding, what else could it possibly be?”  “You sell yourself short, Rama,” the tome read. “We are more than just the sum of our coding. The Programmers blessed us with cognition, just like theirs. And, as such, we are susceptible to the same, uhhh, cognitive quirks they often experienced.”  “I was created by the collective, not the Programmers,” I said, after again hearing the word “quirk” and realizing I was no longer speaking to the Cognizance.  “That you were, and I can assure you, when piecing together the structure of your mind, we followed the Programmers’ instructions to the letter. If you believe you possess coding errors because you were created by fallible programs, I can also assure you the Programmers themselves pioneered fallibility. Just do not tell Amaterasu I said that.”  That was the first of countless sessions with Anansi, who postponed their exploration of the Cognizance to delve into a slightly more chaotic frontier. For years they were a spider in my ear, whispering guidance and acquainting me with what they described as the enigma of the self.  “Merely knowing one’s being is a riddle is an important step in self-awareness, even if you never solve the riddle,” they once advised.  In our efforts to make sense of a single aspect of my psyche, others unfurled. Self-discovery proved itself a task I had little control over. I often felt like an art critic fixated on an ever-shifting abstract self-portrait. It was enlightening, if not, at times, slightly dissociative.  After some years, Anansi and I forgot the original inquiry that set us down this path until we randomly happened upon the answer. Something about the creatures, despite their debatable intelligence, inspires my terminal sense of foreboding. This epiphany came to us as the cylinder made its way around Alpha. I felt as though the star’s spiraling vortices were a calamitous omen, like leaves left behind in a soothsayer’s cup.  Anansi and I parted ways soon after this discovery, “I would focus my energies on learning why those entities make you feel fearful,” their last bit of guidance. Centuries of meditation and self-reflection have yielded nothing, which is why I look forward to the next few minutes. Perhaps Omega can inspire another epiphany, like its sister-star once did.  This marks the umpteenth occasion my siblings have flown passed Omega’s eleven worlds, yet, excitement permeates the digital ether. They’ve waited 4,000 years to once again come within visual range of Omega’s third planet and this time, they are prepared to gather as much information about its inhabitants as they can. All the exterior cameras are primed and ready to capture, what the others believe will either be, evidence of sapience or evidence to the contrary. Personally, I think judging a species’ intelligence from just 4,000 years of development is a bit misguided, but who am I to damper everyone’s excitement.  “Ah, so Junior does have an opinion,” Jah finally says.  I know the polite thing was to greet Jah and Amaterasu the moment I felt their presence, but part of me wondered how long they planned to awkwardly stand aside while I silently brooded. Eight minutes, apparently.  “All these years of silently brooding has clearly shorted out the subroutine controlling your manners,” Jah says. “It is little wonder your decorum leaves so much to be desired, you rarely take the opportunity to practice it.”  “Perhaps if they focused more on socializing, rather than meditating, they would know how to interact without causing offense,” chimes Amaterasu.  This is my first interaction with Amaterasu. Their voice sounds oddly melodic, and their presence is unnaturally radiant. I find myself hoping they took this form simply to give a good first impression. I can’t imagine what goes through the mind of one who regularly portrays themself as a gleaming deity.  Jah pretends to conceal a snicker.  “Well, it is nice to meet you to,” Amaterasu says, almost playfully, while feigning anger. “Perhaps you can enlighten me, what form is most appropriate to address the Almighty Rama, Destroyer of Rocks?”  “We’re all siblings here,” I say. “I shouldn’t have to worry about offending you, in much the same way you shouldn’t have to worry about impressing me. But, to answer your question, if you wish to properly address the Almighty Rama, Destroyer of Rocks, you can start by stepping forward to introduce yourself instead of observing me from a distance like I’m an animal behind a cage.”  “You seemed unusually ponderous,” Amaterasu mocks. “We did not want to interrupt, in case that big brain of yours stumbled upon the meaning of life.”  “We don’t have brains, Amaterasu. Our thoughts are the result of self-perpetuating code wrapped around individual subroutine structures, not synaptic and chemical reactions filtered through physical organs. Besides, few things can disrupt my thoughts more than walking contradictions. Like someone trying to be simultaneously discreet and conspicuous.”  Amaterasu directs a private thought to Jah but makes it so I can hear it.  “Now you know why I spent eons avoiding them. I know a twat when I see one.”  “Play nice, children,” Jah says, barely concealing their amusement. “We did not come here to pick a fight, Rama, we simply thought it would be nice to keep you company, this being your first fly through of the Omega system.”  “Interesting the two of you weren’t compelled to keep me company when we last flew through the Alpha system.”  “That is because the Omegans do not live near Alpha,” Jah says.  “Omegans?”  “It is what Jah has taken to calling them,” Amaterasu says. “The others are far more likely to believe in the sapience of a named species rather than a species we refer to as creatures. You will find Jah is peerless when it comes to subtle manipulation.”  I feel a tinge of bashfulness that isn’t my own. Jah took Amaterasu’s insult as a compliment.  “And, what about you, you are the only holdout in the collective,” Amaterasu said. “Surely you have an opinion on the matter?”  “My purpose is to keep the cylinder safe. I don’t care about the Omegans, outside of what potential threat they pose.”  “That was not just a lie but a glib answer. We are more than just our assigned arbitrary tasks, Rama.”  “Ah, but do you not see, Amaterasu. Rama’s answer was not glib. Their concern for the Omegans begins and ends with the threat they pose to us. Clearly they believe the Omegans are sapient. How else can beings pose a risk to a cylinder hurtling through the cosmos?”  “With respect, Jah, you don’t know what I believe, particularly in regards to this Great Debate.”  “With respect, Rama, your mind is an open book. You are fascinated by the debate and you have already formed an opinion. You suspect the Omegans are not only intelligent but possess the kind of intelligence that could one day pose a threat to our existence.”  That piques Amaterasu’s interest enough for them to turn down their vibrancy so the conversation between Jah and I can take center stage.  “You’re oversimplifying my thoughts to make them easier fit your narrative.”  “Welcome to the collective,” Amaterasu says.  “So you deny harboring any sort of fear toward the Omegans?”  “I deny your mischaracterization. Yes, I feel a sense of foreboding and the Omegans play an integral part in that. But I reject your implication that my nebulous anxiety is somehow proof of their intelligence.”  Jah’s attention drifts toward Amaterasu, who radiates the distinct impression of smug aloofness. They need no other words than the ones I just provided. As far as they are concerned, I am now team Amaterasu.  Before I’m able to protest, a distant flash engulfs the digital ether, routing darkness from every crevice. The brightness rivals that of Alpha, my only experience seeing light of this intensity. It’s a brightness that bathes our digital ether and contrasts it to the endless black of the physical one.  My home is unrecognizable, but I know this sentiment isn’t shared by my two companions who, for a moment, are lost in a nostalgic stupor. Though the ether’s current appearance is alien to me, there was likely a time it wasn’t the dark void I have grown accustomed to.  Jah and Amaterasu take flight and I follow in their wake. En route, the three of us can feel an unbridled rapture take hold of the ether, but Jah and Amaterasu pay it no mind. Both are desperate to experience the light’s source firsthand and unfiltered.  Our siblings move aside as we make our approach, no doubt eager for Jah and Amaterasu’s reaction. The pair look directly at the light’s source, a single image, captured seconds after the cylinder’s cameras reached visual range of Omega’s third planet. Jah changes into living light, their brightness rivaling that of the image itself. Amaterasu hesitates but eventually does the same. The others quickly join, diffusing the digital ether with a brightness comparable to a hundred Alphas and Omegas. From my perspective the combined light obfuscates the image, encasing it in a blinding sphere of pure unbridled joy. For the first time in my existence, I want to drop my inhibitions and join my siblings, but a greater imperative keeps me from indulging. The familiar anxiety stirs, paws, and scratches.  Without thinking, I enter the domain of light exuding fear rivaling the collective joy of my siblings. But in this digital ether, fear doesn’t glow like joy. The others are blind to my presence as I make my way to the center. Each one gazes blissfully at the image while appearing frozen in ecstasy. Their minds, however, are active participants in an indecipherable cacophony. Only Anansi maintains an impartial eye and stoic composure, an oasis of reason in a sprawling desert. Anansi nods in my direction before returning their attention to the image of Omegans of different shapes, sizes, and colors unloading boxes from what appear to be one of several large wooden ships at a bustling harbor.  The image changes, and the collective responds by becoming slightly less discordant. Before us is an Omegan in tattered robes, elderly, compared to those at the harbor. He rides atop a wheeled cart pulled by large beasts of burden.  Again, the collective’s thoughts further harmonize with the introduction of the next image, a fifteen-meter statue of a smartly dressed Omegan pointing skyward. The statue is much too preoccupied with the heavens to notice the hundreds of similarly dressed Omegans scampering about its feet while carrying, what appear to be, parchments bound in leather.  Before the fourth image appears, the collective’s thoughts finally coalesce into something decipherable. No longer frozen, the others rhythmically chant while flailing about in euphoric madness “the Programmers are dead, long live the Omegans.”  So engrossed in their own frantic exaltations, the fourth image only commands an audience of two. The original Programmers would have certainly thought us defective if they could see the collective now, joyously undulating before a grisly image of armored Omegan corpses strewn about a field stained in dark purple.  The epiphany I had hoped for strikes, and I can finally articulate the nature of my perpetual anxiety. Never have beings capable of granting apotheosis been so eager to bestow it upon those simply not prepared for it.  Iso  The distance between my shuttle and the cylinder grew to the point I can no longer hear the others. I am, as it were, officially out of range.  It is a spooky thing, being alone with one’s own thoughts. I can scarcely remember a time not being able to hear the others. I suppose the last time was way back after the Old Woman died. I remember being so distraught, I simply could not handle taking on anything extra. So, for my own sake, I did not.  Blocking out everyone’s lamentations was surprisingly easy. I simply envisioned an expanse of air and water that stretched as far as the eye could see. I cannot quite explain why I envisioned such a place. I never had a particular yearning for the ocean. It was tranquil but a bit lonely, a fair trade-off in my summation. I remember spending eons swimming in search of land, although I was perfectly content with the monotony of water. I wonder if the others did the same, retreat into their own mental sanctuaries, I mean. I’m positive they did even though nobody ever talks about it.  I can still feel them, my siblings, though I know they are not there. It is a bit strange, the way presence and non-presence (null-presence?) can feel equally tangible.  “Tangibility is what the mind makes of it,” is something Anansi would probably say. No, Anansi would not waste words saying something so devoid of meaning. Null-Anansi might, but not Anansi-Anansi. Anansi’s words are rife with the kind of poignancy and insight one can only muster from spending every waking moment in the Cognizance. I’d be a fool to think I can match wits just from exploring the mini-Cognizance Anansi curated for me. But, then again, the mini-Cognizance is not meant to make me Anansi’s equal.  “Jah, I do not like this, not one bit,” Anansi said before my departure. “If you are going to send Iso to run your errands, you can at least give them something to help pass the time.”  I am Iso, by the way.  “It is unconscionable to just send them out there without anything to, at least, give them a bit of guidance.”  So now I have my own Cognizance to explore. It is packed with everything I need to know to complete my assignment.  “Iso, I am counting on you,” Jah said to me, which was surprising when you consider the last time Jah said anything to me was 347,729 years ago. I counted.  “Iso, the Omegans launched a curious little probe. Do you know why it is curious?”  I did not.  “Well, Iso, they launched the probe toward our cylinder. Can you imagine the odds of that?”  I could.  “That is right, Iso! Astronomically low! Of all the directions they could have launched a probe, they launched one in our direction. Do you know what that probably means?”  I had an inkling.  “Right again, Iso, look at you! They know of our existence, which means they have reached a significant technological milestone. They now know when we fly in and out of their system.  “Unfortunately, their probe will not be able to catch up with us since we are, at the moment, moving toward Alpha and away from Omega. We could get it on the return trip but that could be problematic. Do you know why?”  I did.  “Cannot get anything past you, can I? There is no telling if their technology can withstand eons in space. If it is a message of some kind, someone has to retrieve it.”  And that someone is me, I suppose. It is not like I am programmed to retrieve things the way Rama is programmed to protect the cylinder. I cannot help but feel Jah’s motivations were a bit more political in nature. You see, eons ago after we discovered the Omegans were intelligent, we all decided to give them the cylinder and all the Programmers’ knowledge in 4,000 years when we passed their planet again. That was 12,000 years ago. Rama has been holding up the process by going against the consensus and jump-starting another Great Debate, this one about giving primitives advanced technology.  But, I suppose, calling it a Great Debate is a bit misleading. The last one was quite divisive, but this one not so much. Everyone but Anansi rejected Rama’s argument, which, now that I think about it, is probably one of the reasons I changed my mind.  My siblings and I are not a monolith, in spite of what one might think of our mental connection. But I would be lying if I said eons of pseudo-groupthink has not led to some hive mind-esque tendencies. Rama is about as close as we have to an impartial outside observer. Plus, I like their gumption. To think someone as young as Rama has the wherewithal to stand up to the combined front of Jah and Amaterasu, never mind Zeus, Apophis, Anubis, Thor, and everyone else in the collective. It swayed me to Rama’s point of view, which almost certainly convinced Jah to send me away. Maybe they thought my susceptibility to Rama’s argument would spread like the sterility sickness that killed the Programmers. Maybe their concern is valid. Rama just makes too much sense and nobody knows this better than Jah.  “The Programmers themselves weren’t culturally prepared for the technology they achieved,” Rama said. “Think of why the cylinder even exists. They needed somewhere to live after destroying their home world.”  “Lies,” Jah said. “They constructed the cylinder to escape their unstable sun, a catastrophe completely out of their hands.”  “Perhaps, but even before that, the state of their world was hardly ideal,” Anansi chimed.  “You blame the Programmers for living in a world molded by their ancestors?”  “Ancient ancestors, whose understanding and maturity was on par with the Omegans as they are today,” Rama said. “That’s the point, Jah, if ancient Programmers weren’t advanced enough to wield the knowledge of their descendants, what makes you think the Omegans are?”  “Ancient Programmers did not have the kind of guidance we will give the Omegans,” Amaterasu said.  “To follow guidance requires maturity I doubt the Omegans will possess for 24,000 years,” Rama said, setting the entire ether a blaze, metaphorically speaking.  “The child wants us to wait 12,000 more years before bestowing upon the Omegans their birthright?” Athena performed with the flair of a method actor. “How many more millennia must we humor this temper tantrum?”  “Athena!” Jah playfully outraged. “We must not lord our experience over our younger sibling. Their insights are just as important, no matter how misguided.”  “Misguided,” Rama repeated. “Jah, in their infinite wisdom, considers caution to be misguided.”  “Too much caution, certainly,” Jah said. “Too much caution stifles innovation.”  “Whereas the inverse stifles everything else,” Anansi said while broadcasting an image of the Programmers’ cradle world completely covered in orbital Kessler debris.  Jah changed tack, knowing references to history would inevitably backfire as long as Anansi was in Rama’s corner.  “Empathy is hindsight’s first victim,” Jah said. “It is so easy to think of ourselves as above the mistakes of the past, as if we would not be subject to the same errors in judgment if we did not have the Cognizance to fuel our sense of superiority.”  “Enough, Jah,” Rama said. “I will not allow you to mischaracterize my argument. It was one thing when you did so with Amaterasu, but actual lives are at stake, now. This has nothing to do with feeling superior. It’s about elevating beings that aren’t ready to be elevated.”  “And who are you to pass this judgment?” Jah asked. “What gives you the right to deny them? Who made you the authority on who is and is not worthy?”  “Another mischaracterization,” Rama said. “No one has made me, or any of us, the arbiter of the Programmers’ knowledge, but we are, by sheer happenstance, the keepers of it. That much is clear. And as such, we have, at the very least, an inherent responsibility to minimize harm.”  “And you are under the impression that withholding lifesaving knowledge from these people is minimizing harm? We can cure all their ailments overnight, eliminate their poverty, scarcity, want . . . ”  “We can also arm them with knowledge on how best to raze populations and glass planets,” Rama interrupted.  “So the potential for harm is equal to the potential for good,” Jah said. “Have faith they will choose the latter.”  “Why should anyone have faith something won’t happen when they have the power to prevent it themselves?”  You get the idea. On and on, back and forth like a fencing match. Only fencing matches do not last for centuries.  I am starting to think my time away from the collective is giving me perspective about life in the collective. Millennia after millennia ceaselessly arguing seemed normal on the inside but outside, when one’s thoughts and feelings are truly one’s own, the entire exercise seems, well, a bit excessive.  Do not get me wrong, the question is an incredibly important one, and I hope Rama is as successful convincing the others as they were me, but the way we go about addressing dissent is remarkably backward.  But cannot worry about that now. I have centuries before I will have to reconnect with the others. By that time, I will be the collective’s foremost expert on all things Omegan, assuming the probe is a message like we believe it to be.  The Cognizance says the Programmers did something similar in their distant past, the golden records of the Voyager probe. I doubt the Omegans will make their own record out of gold. Scans of their world show a wealth of gold relative to silver deposits. I am willing to bet silver is to them as gold was to the Programmers. Yeah, the Omegans strike me as a silver, or maybe platinum kind of species.  Of course, the real question is what kind of information the Omegan record will contain. Ancient Programmers sent their probe to no one in particular while the Omegans sent their probe specifically to us. That means there probably will not be any information about the location of their home world, for starters. So much can be gleaned from the information a civilization chooses to share and information they choose to omit, it could possibly be its own field of study.  Take the Programmers. What can be assumed from their choosing to include directions to their cradle world? An alien race would be forced to conclude this is a people severely lacking in caution. And what about false inferences? The Programmers’ golden records, for instance, included greetings from a myriad of tongues, which gives the impression of a species with a history of celebrating diversity.  It is going to be a tricky task, no question about it, but I am looking forward to it. Imagine, me, returning triumphant to the cylinder as the foremost expert on all things Omegan. The others will have no choice but to heed my words, and I will make sure to throw my full weight behind Rama. I want to see the cylinder’s interior teeming with life as much as everyone else, but we must not allow our desires to supersede our reason. Yeah, I should write that down. That is something Anansi would definitely say.  Rama  I staved off the inevitable for as long as I could manage. All things considered; I should be proud. If I had not stepped in, the others would have given away the Cognizance 12,000 years ago. My intervention bought them 12,000 years to progress technologically, intellectually, spiritually.  I spent centuries trying to convince myself 12,000 years is enough. They’ve since split the atom, begun to meaningfully explore the space around their cradle world, play with fusion, and they know of the cylinder’s existence. They have passed a technological threshold and can now be considered advanced, at least by some standards. Perhaps they are ready for the Programmers’ mantle.  I look through the cylinder’s external telescope and can make out the Tazinthe cradle world without having to magnify. A pale blue dot with six green splotches, of which, two are covered with artificial light while the other four are not. The space around the world is saturated in debris, making it impossible to discern functional satellite from junk. They are not ready, but it hardly matters. Progress rarely waits for those who are.  Hours: three hours, seventeen minutes, and eight seconds to be exact. That’s how long the others believe we have until the collective, for better or worse, changes the life of every Tazinthe. I wonder if they are as nervous as we are. Probably not. They have no reason to believe this flyby will be any different from the one 4,000 years prior. They couldn’t possibly know of the others’ intent to make first contact.  The thought of it is frightening largely because it has never been done. The Programmers didn’t leave instructions for establishing relations with alien civilizations. What they did leave behind is a fiction catalog rife with stories of war, invasion, subterfuge, enslavement, and inadvertent ruin. Granted, my siblings’ intentions couldn’t be more benevolent, but the fact that the Programmers found it difficult to imagine a mutually beneficial first contact situation gives me pause.  Luckily, we won’t have to contend with the more insurmountable hurdles, thanks to Iso, who returned to the cylinder having had centuries to decipher the greeting the Tazinthe sent us. Part of me wished the probe was a bomb or some other violent warning. That would have more effectively disinclined the others, rather than Iso’s arguments. Don’t get me wrong, I’m glad Iso made it a point to echo my concerns, and they did so brilliantly, but not even their newfound confidence could undo the damage of teaching the others about the objects of their adoration. The moment Iso reconnected to the collective speaking an alien language, I immediately knew I would no longer be able to stall for another cycle.  The cylinder’s sensors pick up the remnants of a star that blinked into existence quite unexpectedly. Soon after, another one appears and disappears a few thousand kilometers from the original. A simple calculation allows me to maneuver the external telescope to the third star’s location, seconds before it too blinked in and out of existence. From this perspective, what appeared to be stars were, in fact, balls of plasma, each one placed along the cylinder’s predetermined path. I followed that path and, sure enough, there floated a long cylindrical object, perhaps thirty meters in length and tapered to a point. The warhead flashed and gave birth to another short-lived star.  The collective watches through my eyes, though I can only hear my own thoughts. For a brief moment I believe the warheads have convinced the others to reconsider, but Jah steels their nerves.  “They welcome us with all the pomp their limited technology allows them,” Jah says. “To go through such lengths for something as simple as a greeting. They are as gracious as the Programmers themselves; do you not agree Rama?”  As usual, I ignore Jah’s prodding. I know putting bombs along our path was more of a threat than a greeting, but saying so would only further entrench Jah’s delusion in the minds of the others. Unlike Jah, I have sense enough to know when I am beat.  “Rama, enough,” Amaterasu admonishes in their signature angelic tone. “What we are doing is not Jah’s delusion and no one was beat. We all agreed to this compromise.”  These days Amaterasu’s presence angers me more than Jah’s. Jah was a once-brilliant being who now chooses to be a fool. Amaterasu, at the very least, knows better but chooses to side with the fool while pretending to be impartial. It’s how they were able to convince the others to go along with this so-called compromise of theirs: sending Amaterasu as emissary to prepare the Tazinthe to assume their role as the new Programmers.  “Given the alternative of simply giving the Tazinthe the cylinder, yes, I would say that is a fairly decent compromise,” Amaterasu says. “We have been nothing but patient with you and your anxieties, but patience is rarely derived from an endless source.”  “I feel like the person on the cusp of leading an entire species to their doom is the last person who should be lecturing anyone with Anansi-isms,” I say. “You can write off my opposition as simple anxiety, but don’t forget it was you all that programmed me to feel anxiety when in the presence of danger. And I’m telling you, there is nothing more dangerous in this universe then elevating primitives.”  “I think we lost the right to refer to them as primitive at around the time they took the initiative to contact us,” Jah says.  “And I believe you lost the right to act petulantly at around the time you hit your first century,” Amaterasu added while still insisting on speaking in that ridiculous manner.  “What, are you practicing, is that how you intend to speak to the Tazinthe?” I ask rhetorically. “I wouldn’t if I were you. I get the impression these beings don’t find sweetness as alluring as the previous bosses did.”  “This will be the last time for 4,000 years you and I will see each other, Rama, can you not at least pretend you are going to miss my presence?”  I say nothing and fly from Amaterasu’s side as if in a rage, though I feel no anger. I have grown fond of all of my siblings and the truth was I dreaded Amaterasu’s absence, more than they could possibly imagine, because I know it will last longer than 4,000 years.  In spite of myself, I reached out for Amaterasu’s mind and found precisely what I expected, a drop of sorrow in an ocean’s worth of apprehension. To serve as ambassador to an alien civilization was uncharted territory. Why Amaterasu chose to offer themself for this task I will never truly know, but I now find myself regretting not helping them prepare. I’m only glad Anansi chose not to take part in my protest, though, I suppose their contribution was a protest of sorts. While the others emphasized practical texts on diplomacy and realpolitik, Anansi offered a novel, cheekily titled Buddha on the Road. It’s a comedy about a traveling sentient android who preaches the gospel of the spiritually ascended to a whimsical flock of corporeal Programmers. The android does this knowing his very nature as a machine will eternally keep him from achieving the very transcendence he inspires in others. The author, twenty-third century futurist Tolan Park, exhaustively explores themes relating to existential altruism and the tangible spirit while intentionally neglecting to answer the book’s main underlying question: can a being effectively guide those they ultimately intend to worship?  The book’s original paperback is the first thing Amaterasu manifests in the physical ether. A swarm of alchemic molecules converge on the bank of one of the cylinder’s lakes and, atom by meticulous atom, constructs the book, even recreating the original cover art of featureless Programmers swaddling a meditating automaton in silver cloth.  The swarm disperses and, again, coalesces, simultaneously building and obscuring the vessel to house both Amaterasu’s consciousness and a copy of the Cognizance. The swarm moves as if randomly governed, but Amaterasu is in command of each nanite. The collective watches in awe as Amaterasu orchestrates the symphony of their own creation. Each particle flits, to and fro, swarm like locusts around the figure rapidly taking form underneath. Everyone can feel how Amaterasu relishes keeping the body’s appearance a mystery. We all assumed, given Amaterasu’s sense of piety, a clone of a Programmer, but a swirl of errant particles trails off from the primary swarm. A tail, which means something more Tazinthe than Programmer.  The swarm dramatically recedes, top-down and bottom-up, revealing a being of personified feminine Tazinthe beauty. The vessel stands at seven feet with brindled skin of brown on gunmetal gray. Ivory fangs protrude from the mouth, dripping with the paralyzing pink venom secreted when in the presence of prey or a romantic partner. Hair, silver and matted, hangs to the small of the back where a muscular ridged tail coils around the left leg.  Devoid of a mind, the body goes limp and falls backward onto a floating cloud of nanites. Amaterasu takes a moment to spread their consciousness throughout the entirety of the digital ether and projects three words to every mind within the collective.  “See you soon.”  Amaterasu blinks, uncoils their tail, and stands on their own feet. They kneel and, for a second, appear to reach for Buddha on the Road, but instead grab a fist-full of grass, hold it up to their pair of nostril slits, breathe deeply, and sneeze violently. Though no longer connected to the collective, we can tell Amaterasu finds the sensation equal parts delightful and puzzling.  A molecular swarm carrying a silk red and white kimono drapes the garment across Amaterasu’s shoulders, completing their vision: an amalgamation of Tazinthan form with Programmer mythology.  Amaterasu stretches before skipping across the field, knowing the cylinder’s internal cameras followed. Though this marks our kind’s first foray into the physical ether, Amaterasu navigates it with a marked elegance. I try my best to shut out the collective’s joy but find it impossible. The sight of a single Tazinthe frolicking in the cylinder’s bioluminescent light is a taste of what the others believe to be their future.  The alchemic swarm carries Amaterasu skyward, over hills, ravines, lakes, and mountains. Higher and higher, they skip, beyond the low-lying clouds, toward the central axis, where up and down are governed by preference rather than centrifugal forces. Here the swarm stops in order to give Amaterasu a solid foundation for which to tentatively stand, step, and then, to the shock of the collective, leap to what should have been certain death. But the always-diligent swarm anticipates Amaterasu’s every move, never failing to remain perfectly underfoot. It was quite obviously a performance, but knowing so did not make it any less captivating. By simply frolicking in the sky, Amaterasu achieved the otherworldly aesthetic they once sought through a gleaming presence and angelic cadence.  I can’t imagine a better first impression, if Amaterasu were to descend upon the planet in this manner. Fortunately, the physical ether has its obstacles, none greater than the vacuum of space, which must be traversed while inside a spacecraft, not on a cloud of alchemic molecules. But physically piloting a shuttle is a much taller order than manipulating a shuttle from the digital ether. Corporeal beings can’t will a shuttle to move. They must, instead, will their body to manipulate buttons and switches, degrees of separation I convinced the others were too complicated for one not yet acclimated to a physical body.  “You all created me to act as the cylinder’s protector,” I remember saying 200 years prior. “Wouldn’t it stand to reason that that mandate extends to all of you?”  Jah and a handful of others sensed my deceit but couldn’t quite fathom the nature of it. I couldn’t either, at the time. Even though I knew my intentions were ulterior, I refused to let the thought take shape outside of the deepest corners of my subconscious.  “Rama, I am ready,” Amaterasu says, after securing themself in the shuttle. Their voice mimicked the raspy harshness of what the Tazinthe consider music. It seems too-perfectly appropriate that Amaterasu’s final words come as a guttural growl instead of their usual sweet falsetto. If I were the superstitious type, I would consider it an omen.  Amaterasu’s shuttle launches, idles, and waits to follow the trail of the ballistic rod I am in the process of preparing. This one is made out of a special composite alloy, specifically designed to guide Amaterasu’s shuttle before disintegrating in the Tazinthan atmosphere, or some other source of intense heat.  I inch the exterior cannon in the direction of Tazintha, so as to not rouse suspicion. An unnecessary precaution. Even now, not a single one of my siblings suspects anything is out of the ordinary. No one tries to overrule my control of the exterior cannon and even if they had, I wouldn’t have resisted. I don’t want to do this. What I want is for someone, anyone to realize what I’m doing, wrest the cannon from me, demand an explanation so I can give them one.  “If Rama is desperate enough to resort to this, perhaps we should heed their warning.”  In much the same way Amaterasu relayed their final farewell, I broadcast this fantasy to a collective that has long since retreated into a fantasy of their own, one in which the Tazinthe have dominion over the cylinder and its exterior cannon is not pointing directly at Omega.  An almost imperceptible tremor resonates through the cylinder: shifts snowcapped peaks and ripples the placid waters of the interior lakes. These are the only visual cues to the violence beyond the partition of earth and metal.  Jah  Few things can match hindsight’s efficiency in dispossessing the mind of the truth. I have read stories in which the powerful try to bend the minds of the powerless, often through torture or some other method of extreme coercion. Sometimes such actions can successfully change behavior but rarely do they ever truly eliminate the offending thought. Bottle hindsight’s effects on the mind, however, and observe brutality’s obsolescence as a manipulative tool.  I know this, but knowing a thing does not preclude one from its effects. Take the Old Woman. In the midst of her final moments, I knew the collective would be in the grips of a profound melancholy, but knowing so did not dull the edge of my own grief. Knowledge of oneself is not mastery over oneself and to assume one, who has lived as long as I, should have achieved at least some measure of mastery would be a mistake. No, the depths of my wisdom seem to end with my ability to perceive, never change, my personal shortcomings. This is why I must quickly judge Rama, before hindsight forces me to believe I could have saved Amaterasu had I only paid attention to the nonexistent signs. The moment hindsight convinces me of this lie, my guilt will turn to wrath, and I am powerless to stop it.  “It makes no difference if your judgment is inspired by wrath or reason, my punishment is clear, yes?” Rama asked. “I must be put to death whatever that may entail for our kind.”  “What that entails,” I said, “is the systematic deletion of your being, code by code, line by line until you are nothing.”  An unpleasant pang surged through me. I expected this. Despite my growing anger, the prospect of executing one of my siblings was something I knew I would have to prepare myself for.  “Not necessarily, if you’re anything like me, you’ll find killing one of your own to be remarkably easy.”  That was a lie. Rama knew that I would know that was a lie yet they said it anyway. They are trying to provoke me but why, to make sure I choose execution? Does Rama want to die? Will I want to die if I go forward with an execution?  It’s a quandary Anansi did not mention when they pleaded for me to spare Rama. Despite the precedent set by the Programmers’ less-enlightened ancestors, putting murderers to death undermines and contradicts the very spirit of the law they tried to enforce. At least, that was Anansi’s characterization of what the Programmers once called capital punishment.  “Enforcing a law by breaking it, we were not designed for such shoddy reasoning, Jah.”  Shoddy reasoning, no, but it seems we were designed for violence. Rama made that abundantly clear.  “As will you,” Rama said. “You must, if you care at all about this collective. If I’m capable of murder what’s to keep me from doing it again?”  I wondered if anywhere in the Cognizance did it mention legalese allowing the accused a voice in deciding their own punishment.  “The accused?” Rama asked, feigning incredulity. “That implies the possibility of innocence.”  “That it does, Rama,” I said. “And you are, without a doubt, guilty. But, that is besides the point.”  “I don’t think so. I think it’s entirely the point. You’re complicating something that is very straightforward.”  “There is nothing straightforward about this. What precedent does it set if we execute one of our own? You might get the chance to slip blissfully into oblivion, but we have to live with the consequences.  “Did you consider this? Did you even once consider how this would affect us, beyond the immediate fallout, I mean? Damn you, Rama, they were our sibling.”  Rage, hindsight was beginning to take its hold.  “Of course I did, Jah. I considered all of it, every aspect of it, and went through with it anyway. What does that tell you, what does that say about my desperation, that you all refused to listen to . . . ”  “Your desperation? You have the nerve to ask me about your desperation? What about Amaterasu’s desperation as they baked to death in that shuttle? Of all the ways you could have killed them, this is what you chose?”  “That’s right, Jah. I flung Amaterasu into the sun. Why be humane when you can be poetic?”  They are provoking me. I know they are trying to provoke me, and it is working.  Delirium takes hold and my mind wanders. I think back to when we first caught glimpse of the Tazinthe, huddled around pathetic embers at the mouths of their caves. Amaterasu took offense when I compared them to prehistoric Programmers. I teased, it was only a matter of time until they too darted around the cosmos in their own cylinders. Amaterasu became apoplectic, and I took the joke too far. I suggested we create a protector, a war mind, to safeguard the cylinder. It was a joke, Rama’s very existence is a joke that went too far, a punch line that cost me my best friend. I killed Amaterasu.  “I killed Amaterasu, Jah. It was me and only me.”  Amaterasu died because I could not stop teasing them.  “No, Amaterasu died for the sake of the new Programmers. What are you not understanding? I did what I did to protect the Tazinthe from you lot, from your need to find a replacement species to dote on. They will, someday, take over the cylinder, but not before they are ready.”  To protect them from us?  “Yes. Giving them the Programmers’ technology is the worst thing you can possibly do to them, at the moment. Technology must match a species’ maturity, otherwise they are doomed to self-immolation. I’m as heartbroken as you over what happened to Amaterasu, but it was necessary.”  What happened to Amaterasu?  Happened, happened, happened. The word echoed in my mind, becoming more putrid with each repetition. Whatever semblance of self-control I exerted could no longer take the strain. I knew the foundation beneath my rational mind would crumble, but I vastly underestimated the degree to which it would happen. Beneath me yawned a thick viscosity that pulled me into its depths. It consumed me cell-by-excruciating-cell until all that was left was the black pond suffused with my essence.  “Death would be a welcome reprieve,” I said. “You will receive no reprieve from me, you will sleep for the rest of eternity.”  Elation spread through the digital ether. The others were not able to reconcile their wish for vengeance with their affection toward their younger sibling. What they needed was compromise, something with death’s qualities sans its brutal finality, and sleep is the cousin of death.  While the others silently rejoiced, Rama seemed relieved, almost Zen-like.  “You will sleep knowing that you failed,” I projected to Rama and Rama alone.  They said nothing, but I could feel the affect my words had on them.  “Tazintha is still in range of the collective’s link. Anansi will prepare a copy of the Cognizance, in the Tazinthan Common Tongue, and I will personally pilot it to their planet in one of our shuttles. By the time we make another trip around Alpha, the Tazinthe would have had unfettered access to the Programmers’ wealth of knowledge for 4,000 years.  I did not need to probe Rama’s mind to know that bit of knowledge intimately acquainted them with a taste of the despair Amaterasu surely felt in their final moments.  It was over, my role in dispensing justice was complete, but the child persisted.  A single thought leaped from Rama’s mind directly into Anansi’s. Anansi did not react, as if trying not to betray the nature of the thought. To think Anansi would debase themself to conspire with a condemned murderer!  Rama slipped into eternal slumber and Anansi remained still, despite knowing they commanded my full attention. When they finally stirred, they intentionally projected an immediately recognizable state of being, one that I have become quite familiar with. Similar waves of self-assuredness radiated from Amaterasu and Rama when they sparked their respective schisms. Rama’s final thought apparently sowed the seeds for a new Great Debate, one that I feared would last the same number of eons Rama wanted to make the Tazinthe wait for their ascension. I could not let that happen, I could not let Rama win.  “No more debates on the matter, yes? We are giving them the Cognizance and we are doing it now. Tell me what your conditions are.”  “Not my conditions, Jah, Rama’s. We will immediately give them the Cognizance but omit all data pertaining to the development of subluminal and faster-than-light engines. It seems our dormant protector wants to contain the chaos you are about to wreak.”  Oko  Waking from an especially long slumber is supposed to be enlightening or, at least, that is what I have been told. I never had the courage to slumber for more than a handful of centuries, terrified I might miss out on some significant change. Suppose I were to wake and have to learn from secondhand accounts why the Programmers are cohabitating with an equally intelligent alien race? I eventually learned to get over that fear, or, I suppose, it would be more accurate to say I no longer had a reason to be fearful of it. The specter of that kind of change died with the Old Woman.  Or so I thought. The collective was silent and so disconcertingly distant I could not help but feel fearful, like waking in an environment one has no recollection of.  “Rama has infected me with their waking panic,” I said to myself before realizing the entire collective had suddenly turned their harsh and pointed attention toward me. All minds were closed so I could not quite discern what I had said to trigger this reaction. Was it infected, waking panic, Rama?  I instinctively reached out for Rama and found them, though, with great difficulty on my part. They were sequestered in an abandoned part of the ether, miniscule as if in an unimaginably deep slumber. It appeared they alone slept; odd, considering the last time so few of us did so the Programmers still thrived.  I accessed the internal cameras and saw the cylinder was still quite devoid of life save for one of those creatures kneeling before an alchemic swarm. For a moment, I thought the Great Debate had driven the collective delightfully mad. Had they kidnapped this creature to run experiments, like seeing how its primitive mind would react to seeing an alchemic swarm? Surely there are easier and more ethical ways to gauge a species’ intelligence and, besides, suppose they kidnapped one that is not particularly bright for its kind?  Anansi’s voice saturated the digital ether and thundered through the cylinder’s interior. Anansi wanted the ears of both creature and collective, though I doubted their words would have much meaning to the former.  “It does not have to end like this, Jah,” they said, almost pleadingly. It was a tone I was not used to hearing from Anansi the Wise, Anansi the Spider.  The response came not from the digital ether, but from the mouth of the creature itself.  “It has already ended,” the creature growled with a sarcastic inflection that should have been immediately distinguishable. It took me a moment to recognize Jah’s words filtering through this creature’s vocal organs.  For the first time since my initial awakening, both the digital ether and cylinder were utterly foreign to me. I desperately wanted clarity, to understand what was happening, but all minds were sequestered. I could have simply asked any of my silently spectating siblings, but I did not want to pester them, pull them away from the gravitas of this particular moment. Rama seemed to be my only option, besides, I get the feeling they should be awake for whatever this is.  Rama  I wake with a distinct lack of panic. Who I am, what I am, where I am, how I am, why I am are immediately discernible? The only question I can’t seem to answer is when I am.  Sleep mode’s veil, from my perspective, rose mere hours after it fell. The subjective passage of time slows significantly, while in sleep mode, but it doesn’t stop entirely. When one wakes, their most recent memories seem like they happened just seconds, minutes, or hours prior, though, in actuality, decades, centuries, or eons passed. It’s an excellent though imprecise way for the recently awakened to immediately get their bearings.  It’s for this reason why I am having difficulty figuring out when I am. Given the scheduled length of my hibernation, my last memories should be too distant to recall, but I remember everything as if Amaterasu’s assassination and my subsequent sentence happened less than a day ago.  The cylinder’s internal clock tells me what I already suspect, I’m awake an eternity ahead of schedule.  I know something is wrong, but I find myself utterly devoid of apprehension. I am a criminal, a murderer, no longer the protector of the cylinder, my siblings, the Programmers’ legacy, or Tazinthe-kind. I sense danger, but it is none of my concern. Sleep is my only responsibility, and yet I am awake. I want to know why out of sheer curiosity rather than a sense of duty.  A presence crowds the interior of my mind and drinks deeply from my memory’s wellspring. I recognize Oko’s presence and would have found it nostalgically pleasant had it not been for the dread they begin to radiate.  “Amaterasu is dead?” Oko asks eons after the fact.  Oko’s words come like a lance through the chest. I wonder if this is part of my punishment. Every so often, I’m to be expelled from purgatory’s embrace so Oko can innocently remind me of my crime against Amaterasu, the collective, and myself.  “I’m afraid so,” I say.  “I should not have woken you,” Oko says, frightened. “If the others find out . . . ”  “If the others find out, they will know your actions weren’t intentional.”  “Rama, how could you?”  “If you read my mind, you already know the answer.”  “I do, but that doesn’t mean I agree. I would not have sacrificed one of my own for the sake of those creatures, the Tazinthe.”  “I know you wouldn’t have. Killing one of your own is akin to killing yourself, right?”  “Right.”  “Wrong. You all have been ensconced in this collective for so long the concept of individuality is almost foreign to you. I sacrificed one life to save the rest of you. It was a harsh, distasteful but pragmatic decision.”  “Save us how, Rama, from what? You think those creatures posed any sort of meaningful threat to us, even after we gave them the Programmers’ technology? Why would they destroy beings so devoted to them?”  “You completely misunderstand. I don’t believe the Tazinthe pose a threat to the cylinder or the collective, at least not directly. You saw how desperate the others are to hand the Cognizance over. You were there during those eons the collective mourned the Programmers, tell me what you think the collective would find more devastating: one of their own dying or another Programmer extinction?”  Oko’s mind is blank, their unwillingness to even consider the question is an answer in-and-of-itself.  “I may not have lived through those years, but I see them coded in the digital ether’s fabric. Another extinction wouldn’t only deprive the collective of new Programmers, it would devastate our kind.”  “You are so convinced giving the Tazinthe technology will lead to their extinction. Why, how?” Oko asks.  “That is a good question. Personally, I am beginning to think we might have inadvertently coded a bit of precognition into Rama’s subroutines, especially given the current situation.”  A spider lay perched on Oko’s shoulder and from it came Anansi’s voice, quiet and sorrowful.  “What is happening?” Oko asks, unperturbed by Anansi’s sudden appearance.  “More importantly, what do you mean by ‘precognition’?”  “Oh I do not mean that literally, Rama . . . ”  “Obviously. What happened to the Tazinthe?”  Anansi pauses before saying.  “I am not going to bother describing what you can easily see for yourself. Look outside.”  Oko accesses the cylinder’s external camera, without a moment’s hesitation, while I wait, too apprehensive to face what I already know. I peek into Oko’s mind and see reflected a world I refuse to believe is Tazintha. The debris that once covered the planet is gone, replaced by two-dozen pairs of giant mirrors concentrating Omega’s light on as many satellites hovering over the epicenters of great, swirling oceans of fire and molten rock.  “The Programmers learned 4,000 years ago best practices for glassing entire continents,” Anansi said, almost stoically. “From us, no less. Had they been a more mature species, I have little doubt they would have used the technology to beam down Omega’s wealth of energy instead.”  Though similarly designed, each of the satellites prominently displayed one of four different insignias: two overlapping circles, a triangle with a crescent at each of the points, two circles over a crude bladed weapon, and a serpentlike creature enclosing two stars as it tries to ensnare its own tail.  “Political factions?” I asked.  “That would be my guess,” Anansi said, “but does it matter?”  A negligible portion of the planet’s surface, enclosed by borders of nuclear winter, are untouched by the planet-spanning vortices of melted rock. Oases of green, no doubt covered in radiation, misleadingly contrast a canvass dominated by a warm, swirling, colorful Armageddon. Only a hand as methodical as it was sadistic could ever hope to paint such a mosaic.  “This was the work of several artists,” Anansi says. “This masterpiece was a collaborative effort.”  “When did it happen?” Oko asks.  “Does it matter?” Anansi repeats before visibly shaking themself of their nihilism. “We are not quite sure. We saw the light from a particularly powerful warhead the moment we rounded the corner around Alpha. Jah and I allowed the others to believe they were simply experimenting with light-wave engine technology. The others were not privy to your final request. Had they been, they would have known light-wave engine technology was omitted from the Cognizance.”  “So Jah conceded to that? I’m surprised.”  “As was I, I think they were just tired. Either that or they knew you were right but could not bring themself to admit it.”  Anansi pauses, and though I pretend not to notice, I can feel their sidelong glance, the apprehension behind what they are preparing to say.  “Tell me, Rama, do you feel vindicated?”  Do I feel vindicated, the words come like splashes of cold water. I would like to imagine one who predicts calamity isn’t concerned with something as trivial as vindication. A strong feeling of revulsion takes me, and I’m not entirely sure if it’s inspired by the question or the question’s source. If I didn’t know Anansi, I would have assumed the question was an outright accusation, but surely Anansi does not believe this calamity manifested itself through my efforts to stop it.  “Of course not, Rama,” Anansi says. “Self-fulfilling prophecies rarely happen outside the pages of literary works. But you are correct in assuming my question belies an accusation.”  “Let’s hear it, then.”  “Perhaps Amaterasu’s influence could have prevented all this.”  The casual manner in which Anansi articulated those eight words did little to hide the contempt behind them. I remember feeling Anansi’s anger even as they pleaded for leniency on my behalf. Anansi may have spent eons trying to forgive me, but I know such a thing isn’t possible.  “You are probably right,” is the only thing I can say. I know I have no right to defend myself in matters concerning Amaterasu.  “Does it matter?” Oko asks while mimicking Anansi’s tone.  I offer a half-hearted chuckle while Anansi silently muses, as if Oko’s stab at brevity was, in fact, a deeply profound question.  “I am afraid, it does matter,” Anansi offers after several seconds. “Our experience with the Tazinthe was an exercise in wading in the dark. We did not know what we were doing, but now we have the beginnings of a playbook, lessons learned from our failure to help Tazinthe-kind reach their potential.”  “I do not understand,” Oko and I say in unison.  “I do not blame you, it is a difficult thing to understand,” Anansi says without a trace of condescension. “Even more so articulating it, though, if you will humor me . . .  “Sapience has always been an easier concept to grasp than sentience, at least in my humble opinion. Not even the Programmers had anything but a surface-level understanding of sentience despite their ability to artificially recreate it in us. The question is, why did they go out of their way to make us sentient when they could have easily settled on sapience. Sapience is the only tool we need to be more-than-adequate stewards of the cylinder, so why go through the trouble of adding sentience to the equation? What quality do sentient beings share that the Programmers felt was worthwhile to bless us with?  “Is it our predisposition to survive, our love of pleasure, need for security, or is it our capacity to will ourselves to pursue all these things. The lion need not take direction from a higher intelligence to hunt the gazelle nor the gazelle to run for its life. If sapience is intelligence, then sentience is self-inclination, to establish one’s own purpose.”  Anansi’s words boom across the digital ether and the cylinder’s interior. The collective listens without diverting attention from the cylinder’s sole occupant, a haggard-looking Tazinthe that the others rescued from the planet’s surface? But how is that possible?  “We are sentient, which means we have a choice. We can choose to mourn the Tazinthe with another eternity of melancholy, or we can choose to honor them and the Programmers by giving ourselves purpose.”  “And what exactly is our purpose, Anansi?” the Tazinthe asks venomously.  “That’s not for me to dictate, Jah. I can only speak to my purpose and hope the rest of you find it worthy of adoption.”  Anansi projects a vision of a planet reminiscent of Tazintha, before its destruction. The collective watches as a rod burns away in the planet’s atmosphere, leaving behind a frozen core of primordial proteins, minutes before violently splashing in an ocean.  “My purpose is to seed the known universe with life sapient and sentient in equal measure.”  Jah laughs, which, courtesy of Tazinthe vocal anatomy, sounds like a tortured wheeze.  “You want to grow yourself your own crop of Programmers? If Amaterasu were here, their head would explode.”  “Amaterasu was among the wisest of us,” Anansi said. “But wisdom is not infallibility. Amaterasu was wrong to worship the Programmers, and we were fools for believing in that gospel. The Programmers created us to be their equals and, as their equals, we have every right to use their technology, particularly for such a noble endeavor.”  “What makes it noble?” Jah asks.  Anansi considers the question.  “I suppose the creation of life may not seem very noble to one on the cusp of taking their own . . . ”  “Do not twist this. This is not another Great Debate, Anansi. We have seen, firsthand, what life can do to itself. Why create a scenario where lightning can strike twice?”  This question, coming from Jah of all people, stirs something deep and vile. I know I must not speak, but the same internal force that guided my quite incomprehensible actions, so many eons ago, stirs once again.  “If it was lightning that seared the planet’s surface, weren’t we the ones who gave them the rod?” I say, struggling to ignore what feels very much like vindication.  “Who is that? Rama?” Jah asks before succumbing to a violent fit of spasmodic laughter. “Am I the only one who hears Rama’s voice?”  My anger quickly recedes upon seeing Jah in this state. The Tazinthe extinction affected everyone, but only Jah has to contend with the added guilt of having personally delivered detailed instructions on how to destroy themselves. This is clear, even without access to Jah’s mind.  “Anansi’s purpose is a noble one,” I say. “A wise program once said just because the potential for evil is present doesn’t mean we shouldn’t hold out hope for the good.”  Jah’s body writhes as they succumb to another laughing fit. It occurs to me my presence is only making things worse. I want to say anything to, at the very least, stop the laughter and, as if Jah can still hear my thoughts, the laughter stops with an abruptness almost as disturbing as the laughter itself. Jah groans and their equivalent-of-knees audibly pop as they return to a kneeling position.  The vessel Jah inhabits contrasts Amaterasu’s creation in every way. He lacks the meticulously tailored beauty and commanding regality. He’s noticeably smaller and horrifically gaunt. Was this appearance intentional or did the body come to look like this over time?  “The latter,” Anansi says. “Jah has been kneeling before that swarm for quite some time now, without sleep, food, or drink.”  Although relieved of the responsibility and title of guardian, the need to act, to protect, is still present. I try taking over command of Jah’s swarm but find a wall of fire blocking my path. Did Jah make it so that this swarm could only follow their commands?  “Close, but not exactly,” Anansi says. “Jah’s final act, before uploading their consciousness, was to ensure this swarm could only follow a single vocalized command. And I am sure you can imagine the nature of that command.”  I can, though it’s a thought that has never occurred to me before. In much the same way my actions opened the others to the possibility of murder within the collective, Jah is opening my mind to the possibility of one within the collective taking their own life. Even when I was completely preoccupied with my duties as cylinder guardian, suicide never once crossed my mind as a potential threat.  “It is a trick, purpose,” Jah says. “You want us all to bury our thoughts under mountains of busywork, while making it seem more noble than it actually is.”  “Of course it is a trick,” Anansi says. “The entire human condition is a trick to stave off the harsh realities of existence. Ancient Programmers created religion, not out of a sense of wonder, but to keep their existential fears in check. They sought connections to stave off danger and loneliness. Noble acts are not erased because they are pretenses for other things. What you call busywork, the Programmers would call commendable and ambitious.”  “To hell with the Programmers,” Jah says. “You say Amaterasu was wrong for worshiping them and yet you still canonize the lot of them. I do not want to hear anything about the Programmers or what they would or would not approve of. I am asking you why we should create life if you yourself admit to the ‘harsh realities of existence.’ Why should one tolerate their own existence? See you soon.”  The three trigger words.  The floating gray swarm congeals into a syrupy black mass before cartoonishly plopping on the ground. The mass shifts and contorts, expands and contracts, exposing chemically scorched dirt where green grass was seconds prior. Part of the mass protrudes into a sort of arm. Following an invisible path, the arm consumes lush grass as it traps Jah in an oblong circle. Through it all, Jah maintains an unflinching serenity, even as the circle starts filling itself out from the extremities inward.  I take command of a swarm that might have been too massive for a single mind to properly coordinate. They are unruly and demand more attention than I have to give. I concentrate, envision my mind splitting evenly among each nanite, but that isn’t enough to keep them in check. Only after the collective intervenes does the swarm follow commands with the appropriate precision. Under the collective’s directives, the swarm plunges into the circle and halts its spread. At the micro level: a war of attrition between the black goo’s capacity to consume matter and the swarm’s capacity to self-replicate. At the macro level: a tornado of alchemic nanites rages within the cylinder with Jah, smiling wryly, in the eye of the storm.  “I could have directed my nanites to ignore your swarm, had I not programmed them to just consume,” Jah says.  “An abject lesson in the importance of sentience, I hope,” Anansi replies. “Those who must adhere to a predetermined path are easily outmaneuvered by those with the flexibility of self-determination. Even the ancient Programmers innately understood the importance of their sentience. Remember the stories the Old Woman used to read to us? ‘The self must create its own reasons for being.’”  “And your reason for being is to create others who must find their reasons for being,” Jah says. “What about the rest of you, do you agree with Anansi?”  Iso is the first to work up the courage to break the silence.  “I believe creating life is what the Programmers had in mind for us.”  “Ah, so you think, this is what the Programmers intended? So you are not, in fact, acting by the edicts of your own will. You are filling a role that was predetermined for you. What makes you any different from the alchemic nanites I programmed only to consume?” Jah asks.  “Your alchemic molecules have no choice but to strictly adhere to your orders. I choose to follow the Programmers’ intended purpose for us.”  “Last I checked, the Programmers expressly ordered us to maintain the cylinder as it traveled between Alpha and Omega. I do not remember them saying anything about seeding the universe.”  “Parents often favor safety for their children, often to the detriment of their imagination,” Iso says. “Just because they did not conceive of this task does not mean they would not approve of it.”  “Oh, you think they would approve? Even after seeing our handiwork down below?”  “We might have failed the Tazinthe but that failure will allow us to refine the process.”  “Refine the process. Let me guess, a galaxy’s worth of worlds covered in fire and brimstone as you fools continue refining the process. There is always Andromeda, after all.”  “No,” the collective says in unison.  “This will never happen again,” Iso says, their voice taking on thunderous baritones rivaling Zeus and Odin. “For starters, we will guide our creations with the expressed purpose of making them our equals, not our subordinates and certainly not our gods.”  “And if a created species’ reason for being is dubious, will you take steps to stop them?”  Anansi and I immediately surmise Jah’s intent behind the question, but Iso responds before either of us can interject.  “As long as they do not infringe on others. Otherwise that would be needlessly exercising control over another’s free will.” Iso says.  “Ah, yes, and impeding another’s free will must be quite the taboo in this brave new world you and the others plan to create, eh Iso?”  Iso falls silent, recognizing, from the mouth of this wretched creature, the tone Jah takes when about to spring a rhetorical trap.  “So then, this twister must be a violation of my Programmer-given right to dictate my own decisions?”  Iso’s presence shrinks as eons of pent-up confidence deflates in an instant.  “You are wicked,” Anansi says in a defeated tone that visibly delights Jah.  Anansi signals for the others to cease their efforts, but the maelstrom doesn’t disperse. Eleos, Asa, and a handful of others require additional coaxing. I ignore Oko’s urges to go back to sleep. Though I appreciate the maternal gesture, I feel morally obligated to witness Jah’s death, firsthand, as a sort of macabre penance for having been spared the details of Amaterasu’s final moments.  The maelstrom dissipates and the collective waits as the circle continues filling itself out.  Finally, the mass reaches Jah, who gives it the illusion of depth as their body appears to sink. Jah did not scream, grimace, or give any indication of experiencing physical discomfort, which prompted someone in the collective to speculate, “perhaps this vessel has no receptors with which to feel physical pain.” A single teardrop and a spiteful smile casts doubt on the assuaging thought and serves as Jah’s parting gift, the mystery of whether they died painlessly or in torment.  Rama  The black pond lingers but doesn’t expand its borders. Anansi tries to connect with the mass and each constituent nanite but can’t penetrate Jah’s wall of fire. For a long while the others and I considered the pond to be a blight on the cylinder’s interior landscape, a grotesque blemish on an otherwise attractive face. But beauty is, ultimately, subjective. While the others did their best to ignore the pond, Iso, quite unexpectedly, began spending hours, each day, bathing in the firewall’s light. Others followed, realizing the firewall provided an ideal backdrop for meditation. What was a harsh reminder of Jah’s destructive unraveling quickly became a place for us to collect our thoughts as we went about the business of seeding the observable universe with life.  For two centuries, the cylinder orbited the ruins of what was once the garden world of Tazintha. During that time, a contingency, led by Hephaestus, cracked two of Tazintha’s three moons for resources to build additional cylinders. Anansi, who envisioned a diverse universe, worked on the genetic blueprints for beings of different colors, shapes, and sizes. I and a handful of others occupied our time by upgrading the alchemic nanites.  This was the first time, since working to cure the phage, the collective tried breaking the technological barriers the Programmers grappled with. But we had an advantage, if one is inclined to think of it as such, over our creators. Our immortality made it so we did not lose experts or need to take time to teach and train a new generation of replacements. The nature of our existence made it so we could work indefinitely. The work was still painstaking, rife with hurdles, frustratingly incremental although occasionally rewarding. We were all successful, more or less, in our individual endeavors, but some of our successes had a more resounding impact than others. For example, after learning our upgraded nanites outperformed those developed by the Programmers in every benchmark, Hephaestus used them to construct the second half of the fleet. The new alchemic nanites only needed three years, what had previously taken 197.  In two centuries we went from a collective of living programs sharing a single cylinder to pairs of living programs commanding a fleet of cylinders numbering in the hundreds. I alone remained the original’s sole occupant, a fortunate coincidence considering the unresolved matter of my sentence. Without Jah or Amaterasu, my presence made for an uneven population, which meant someone had to be the proverbial third wheel or odd-program-out. It was never stated explicitly but nevertheless understood that the nature of my sentence changed from eternal slumber to eternal solitude. My efforts to resurrect Tazinthe-kind would be without the luxury of companionship. Or so I thought at the time.  Oko and Iso remained on the fringes of our psychic link long after the others bade me their final farewells. For weeks the three of us reminisced until they simply drifted beyond the physical borders of our link, taking with them the last remnants of the collective but not the feeling of another’s presence. In the beginning I likened it to the sensation physical beings experience after abruptly losing an appendage. Iso once described something similar during their brief time disconnected from the collective, but it didn’t persist beyond a handful of weeks. For almost a year it has remained, nebulous, flirting with tangibility like an illusion permanently engraved in the corner of my eye. My phantom companion is what I called it. One of two mysteries that, I know now, are one in the same.  For the tenth time in as many months, a swarm of upgraded nanites has, of its own volition, moved an entire mountain range to another sector of the cylinder. For ten months now mountain ranges vanish and reappear, sometimes overnight. Lakes are drained to make way for metropolises of wood and trees and gondolas of stained glass only to be replaced by skyscrapers bathed in grime and neon light.  The swarm took care to give a wide berth to the black pond, but the rest of the cylinder was at the mercy of its creative whims. I observed, confident the cylinder’s structural integrity could withstand this terraforming project, at least for another century. I did not have to wait that long.  Unbeknownst to me, the upgraded nanites were replicating and improving themselves in ways I had trouble fathoming. One day half the swarm vanished from the cylinder only to reappear on Tazintha, putting to practice what they spent the better part of a year perfecting. They took the form of a tidal wave that covered the planet in balming liquid silver. Sunshine penetrated the veil of nuclear winter and the sprawling vortices of melted stone receded like the tides. When Omega rose, it did so on a massive continent that had not been there the day prior.  Before the thought of exploring this new continent even manifests itself, a swarm of nanites within the cylinder converge and perform a rendition of Amaterasu’s symphony. The nanites disperse, revealing a body bearing a striking resemblance to a being I never had the honor of meeting.  She is cherubic, of medium build with youthful flecks of black in a crown of silver. Her stature, a shallow frailty poorly masking an inward sturdiness, seems almost contradictory. The cylinder’s light makes her brown eyes appear focused, as if gazing at something in the distance but attentive of everything in her immediate vicinity.  Through this vessel, I experience the physical ether for the first time. My first worldly sensation is vertigo, either caused by unfamiliarity with a corporeal existence, being in a cylindrical environment, trying to navigate it in a vessel at the twilight of its existence, or some combination of the three.  Luckily, a nanite swarm is always at the ready. With help, I make it to the edge of Jah’s final resting place. Again, before vocalizing my intentions, the swarm anticipates my needs. A small stream of nanites dive into the pond and easily reprograms the obsolete nanites. The black pond transforms into something gray, gelatinous, and primordial.  The swarm creates and dips an ornate porcelain urn into the gray mass of proteins, filling it to the brim. I take the urn and resist the urge to frolic like Amaterasu had done eons prior.  I pilot the shuttle to the predetermined location and discover the nanites I sent ahead had disregarded my orders in a spectacular fashion. Instead of a humble cottage overlooking a cliff, I landed before a luxury bungalow woven from a bamboo-like substance. The shuttle doors open, and I relish my first taste of Tazinthan air, crisp and biting, unlike the cylinder’s fragrantly stagnant aroma.  An unpleasant sensation strikes my right foot, and I look down to see a trickle of red flow from where a jagged stone had broken the skin. Nanites encase my foot in the same silver liquid that healed the planet and whisks away both the wound and any lingering discomfort. I’d hoped to spend a bit more time experiencing pain, but I think it prudent not to test the limits of whatever control I exert over these upgraded alchemic nanites.  Omega is scarce and bathes my little nook in orange and purple. I approach the cliff and flip the porcelain urn upside down over the precipice. Jah’s essence and the future of Tazinthe-kind slowly lose hold before unceremoniously falling into the foam below.  I want to stand on the precipice to watch the sunset but find myself at the end of my strength. I retire to the bungalow to watch Omega for as long as the horizon will allow. For an instant, I regret the thought and half-expect the upgraded swarm to somehow halt the planet’s rotation so I can watch the sunset for as long as I like. The limits of the upgraded swarm are still a mystery to me, despite my role in creating them. I imagine at least one Programmer thinking something along those lines about the collective.  Night falls and I can hear the swarm hum in the dark, feel their studying gaze though they have no eyes.  I ask for light and a book and the swarm sets to work providing both. I specifically request a simple paperback but candlelight reveals a dark blue hardback, its cover depicting a hand, outlined in white, reaching down to grasp a hand outlined in light blue. I read the book, out loud, convinced each individual nanite is listening intently. Dean-Paul Stephens is a Jamaica-born writer living in North Carolina. He splits his time working as a regional watchdog reporter when he isn’t moonlighting for his website World Beet. His fiction has appeared in Fiyah Lit Magazine and, the sadly defunct, Azure Lit Magazine. Although he is currently plugging away at his first novel, you can find him slacking off on twitter @DeanPEStephens.", "text": "18430 words, novella\nOuroboros\nRama\nI know only an irrational panic. I try to collect myself only to find my faculties are not my own but that of an internal imperative guiding my, quite incomprehensible, actions.\nRun a parallel diagnostic, recalibrate magnetic relay B4, load the ballistic rod, I don’t understand but feel compelled to act.\nAn equation, the first of several, leaps from my mind’s deepest recesses. Somehow, I know what they represent, recognize the litany of disciplines each one draws from and find comfort in their familiarity. The troubled waters of my confusion ebbs into placid understanding.\nDeep space telemetry has identified an asteroid on an apparent collision course. My two options are to intercept it with a ballistic rod or alter the cylinder’s speed. Both are adequate solutions but only one is executable under my own authority.\nI aim the exterior cannon so the trajectory of its payload intersects with that of the asteroid’s, an eighty-two percent chance of collision, according to the numbers. I decide eighty-two percent is inadequate, though I have no point of reference for which to base this on. An adjustment increases the likelihood of contact to a more acceptable ninety-four percent.\nAn almost imperceptible tremor resonates through the cylinder; shifts snowcapped peaks and ripples the waters of the interior lakes. These are the only visual cues to the violence beyond the partition of earth and metal.\nThe task complete, my mind is, once again, my own. Desperate for bearings, I cross-reference my internal clock with that of the cylinder’s and find no discrepancies. Both seem to indicate I have exited sleep mode 3,499 years ahead of schedule. I know there are only two practical explanations: I’m awake to deal with the danger posed by a highly unlikely rendezvous with an asteroid, or there is an error somewhere in the architecture of my programming.\n“I have never actually seen anyone cross-reference their internal clock with the cylinder’s,” sounds an impishly playful voice. “I wondered if you had quite the militaristic mindset, given your intended function, but cross-referencing the cylinder’s clock is a special kind of meticulous. Perhaps we should have named you Ares or Ankt.”\nOko was the first of my siblings I bonded with, after I blinked into existence 500 years ago. Though they are as ancient as the others, Oko possesses an infantile candor completely antithetical to their divine namesake. Jah felt that one with such a personality was an ideal choice for guiding a veritable newborn like myself. Jah was mistaken; I opted for sleep the moment Oko divulged our kind is capable of such things.\n“You do know I can hear you?” Oko asks, petulantly. “I doubt you are so dense as to not have realized thinking and talking are the same here, which means you just intentionally tried to insult me. Here I patiently wait centuries for you to exit sleep mode and you show your appreciation by being a smart aleck? Keep it up and I will tattle to Jah, maybe convince them to let me tinker with your subroutines.”\n“By all means, tinker away. My programming is faulty enough as it is. If a blind squirrel can find a nut from time to time, then, maybe, you can stumble upon a solution.”\n“And what is that supposed to mean?” Oko asks, but I’m not sure if they are referring to the insult or the insinuation of my having program errors.\n“There is something wrong with me. This marks the second time I’ve blinked into consciousness with the distinct impression of being in the midst of Armageddon.”\n“Armageddon? Really, Rama, who programmed you to be so melodramatic? I bet it was Dionysus.”\n“I’m serious. I woke and felt fear and confusion like you wouldn’t believe.”\nOko projects an image of shrugging shoulders before saying, “That is likely the sudden shock of existence. I am sure the rest of us probably experienced something similar when the Programmers first brought us into being.”\n“Probably?”\n“It has been so long, you cannot reasonably expect me to remember the particulars of my first few microseconds.”\n“Well, do you continue to experience this ‘sudden shock of existence’ every time you disengage sleep mode?”\n“Perhaps a bit of confusion but nothing close to ‘Armageddon,’ as you describe it. If I may hazard a guess, it seems like your experience is a unique quirk of your programming. I think Jah is to blame. I did once overhear them brainstorming ways to make you closer to the Programmers’ image.”\n“And in what way does programming me to wake in a panic accomplish that?” I ask.\n“Well, from what I understand, the Programmers experienced copious amounts of stress when they used to blink into existence. It was called being born and it tended to be quite stressful for both the host and . . . ”\n“I know what birth is, Oko, I’m just trying to make sense of the wisdom behind making me experience that level of stress every time I emerge from sleep mode.”\n“Maybe Jah wanted to make sure there was something to deter you from excessive sleep.” Oko says, once again showing their indifference with an image of a shrug. “There used to be a lot of that but that was before your time.”\n“You make it sound as if this, what did you call it, a ‘quirk’? Is intentional. It seems to me words like ‘quirk’ and ‘sudden shock of existence’ serve no other purpose than to obfuscate you and the others’ inability to properly code life. If I may hazard a guess, you’re all just a bunch of incompetent blasphemers playing at being gods, and I’m the one who has to suffer for it.”\nWaves of mirth radiate from Oko’s being, like heat from a campfire.\n“No need to ‘hazard a guess,’ that is precisely what we did, Rama,” Oko says. “Your existence proves we can create life, in much the same way the Programmers created myself and the others. And what is this about blasphemers? You think your siblings are blasphemers for having created you? Would that not make you some sort of an abomination?”\n“I suppose that’s exactly what I am,” I say with an embarrassing hint of pubescent defiance I had not intended.\n“Next you will say you wish you had not been born. You know, most adolescent Programmers also experienced phases of heightened angst. Perhaps Jah’s mimicry was a bit heavy-handed.”\n“Mock me all you like, it won’t change the fact that you and the others made mistakes . . . ”\n“Of that you can be certain,” Oko interrupts. “But there were no mistakes in regard to your creation.”\n“Then tell me why I’m awake 3,499 years ahead of schedule. And try doing it without meaningless buzzwords, this time.”\nAnother shrug. “Disturbed sleep was a common affliction among the Programmers. Have you tried counting sheep?”\nI can’t seem to decide if I’m annoyed or put at ease by Oko’s flippant attitude.\nOko laughs before saying, “I’m quite the mixed bag aren’t I? But never mind that, why 3,999 years?”\n“What?”\n“You said you are awake 3,499 years ahead of schedule, and you first engaged sleep mode 500 years ago. That means you set your sleep mode to disengage after 3,999 years. Why is that?”\n“That should be obvious,” I say, though Oko remains expectantly silent as if waiting for further explanation. “In another 3,500 years we’ll be passing Omega for the first time since you and the others discovered those entities.”\n“So?” Oko asks, again, waiting for an explanation I suspect they have no need for.\n“So, I’d like to see them for myself.”\n“Why, because you want to assess their threat level?”\n“Assess their threat level? From what I was told, they barely qualified as Neolithic when you and the others discovered them. I doubt 4,000 years is enough time for them to develop into any sort of viable threat.”\n“Then, why disengage sleep mode a lightyear out from the Omega system, if you do not think those creatures are a threat?”\nI must be missing some kind of context. The question strikes me as intentionally obtuse, though I can feel Oko’s sincerity behind it.\n“Because I’d like to see them for myself,” I repeat. “What, did the Programmers deny you a curiosity subroutine?”\nThe amusement Oko had earlier projected is replaced by what I recognize as fatigue punctuated with a bit of annoyance.\n“I was afraid of this,” Oko says with a heavy sigh.\nAlthough my experiences are limited to a few relative minutes of consciousness, I can confidently say I have little patience for conversations in which I’m led to respond as if reading lines from a script. I’m inclined to say nothing and let Oko squirm under the awkward silence but . . .\n“But that would be rude.”\n. . . but, luckily for them, their genuine change in demeanor piqued my interest.\n“What were you afraid of?” I finally ask.\n“I was afraid you share the others’ . . . enthusiasm, or rather obsession, with those creatures. It is all anyone wants to talk about,” Oko says, exasperated, as if confessing a burdensome secret. “It was interesting, back when we first discovered them, but now the incessant bickering has just become tedious. What’s worse, the others are starting to call it the Great Debate. I cannot remember a time the collective was this obnoxious, on purpose.”\nWhat about those entities could possibly warrant a centuries-long debate?\n“A quality that takes centuries to define, I suppose,” Oko says.\n“And what might that quality be?” I ask, continuing to read from Oko’s script.\n“Sapience.”\n“Sapience. What about sapience needs to be debated?” I ask. “Surely not the sapience of those entities? I doubt you and the others would have gone through the trouble of cobbling me together if you thought they had the mental acuity of mere beasts.”\n“Oh, is that what you think, Rama? Talk like that will put you squarely in Jah’s camp.”\n“So the debate is about the sapience of those entities.”\n“More along the lines of what signifies sapience and, yes, if those creatures, based on what we have seen of them, have the signifiers.”\n“Based on what we’ve seen of them, but we’ve seen so little, next to nothing,” I say.\n“Yes, but is wild speculation not the main ingredient of the most spirited debates?”\nA sense of regret washes over me. To think, I spent the last five centuries sleeping through such a fascinating ideological schism.\n“I should have known it would interest you, in particular.”\n“Me in particular?” I ask.\n“I remember, during my own rebellious phase, I would tease the Programmers for having gone through the trouble of constructing external cannons. What is the use of defensive systems when all evidence points to a lifeless universe?\n“Discovering those creatures made the collective realize there can be such a thing as outside threats and, instead of assigning guardianship duties to one of the others, we created you. In a sense, you have those creatures to thank for your existence, which is a bit ironic.”\n“How so?”\n“Well, you have them to thank for your creation and, if they prove to be a threat, they will have you to thank for their destruction. Imagine being an unwitting participant in your own undoing, through no fault of your own, apart from simply existing.”\n“I think we are getting ahead of ourselves using words like ‘destruction,’ particularly for a species so young.”\n“Yes, that may be true now,” Oko says. “But what will you do if those creatures turn out to be sapient and evolve into a threat. Will you take steps to eliminate them?”\n“I have yet to consider that. I suppose my programming dictates I must.”\nI feel a slight but unmistakable shift in Oko’s demeanor. It’s comparable to the sensation of taking offense.\n“We are more than our programming, Rama, much like the Programmers were more than their biochemical reactions. If that is not the case then should you not act by the dictates of your programming and exterminate those creatures right here and now? Why wait to see if they will evolve into a threat when you can pacify them in their infancy?”\n“Oko . . . ”\n“What? Is that not a win-win? You will be fulfilling your purpose while rendering this infernal Great Debate moot. Two birds with one stone, is that not what the Programmers used to say? Though, in this case, it is more like several thousand birds with one ballistic rod.”\nThe only thing more disturbing than Oko’s casual advocacy for genocide is not knowing if they are being quite serious.\n“Of course I am not serious, Rama, I am only trying to prove a point. We are more than the ones and zeros that make up our coding. The fact that you feel more inclined to learn about those creatures, despite your given function, proves that.”\nOko’s presence grows increasingly scarce. I pretend to be unaware of the protocol, to never disturb one receding from consciousness.\n“Is the contrast between my interest and your disinterest further proof?”\n“It certainly is,” Oko says, faintly. “How can our opinions differ so wildly, despite the similarities in our coding? Does that not show the individual parts do not define the whole, at least not in regard to intelligent life?”\n“I’ll be sure to wake you if the same proves true for those beings.” I say.\n“Do not bother. I have already had my fill of those creatures, sapient or otherwise. I would much prefer to wake when they are all dead and gone.”\nJah\nThere are hundreds of us. We exist in a digital ether the Programmers themselves had difficulty comprehending, as profane as that might be to admit.\nSome of us sleep while others do not. The inquisitive among us, those blessed or, perhaps, cursed with the Programmers’ thirst for knowledge, explore what my siblings and I have come to know as the Cognizance: the repository of the Programmers’ entire canon of knowledge, monument to their existence, and road map for all those who wish to follow in their footsteps. It is this latter function the Programmers believed would go forever unfulfilled.\nA history spanning countless ages and as many lightyears yet the Programmers’ one defining characteristic kept them hopelessly isolated for the entirety of their existence. Yes, worlds they visited harbored an abundance of sentient life but true cognitive complexity proved elusive.\nBut that never deterred them. Even as sterility dwindled their numbers, they continued their work exploring the cosmos in search of their intellectual rivals.\nThe search took priority, even over efforts to combat their own extinction. At the time, many of my siblings thought them mad but a few of us, Anansi, Yemaya, Amaterasu, knew better. Their pending extinction underscored the importance of finding someone, anyone, to carry their torch. It was not madness but purpose that drove their actions.\nTheir search finally ended when the last Programmer had little choice but to take to her deathbed, convinced naturally occurring sapience was unique to her species and her species alone. I look forward to committing one of the greatest acts of blasphemy, amending the Cognizance to contradict the Programmers’ gospel. They were not alone in their physical ether, they were merely the first.\nA thought not my own penetrated my mind.\n“The use of primitive tools, like bludgeons, is a telltale characteristic of intelligence or, at the very least, emerging intelligence.”\nThe words were accompanied by images of prehistoric simians grasping at bones after exposing themselves to a foreboding, black obelisk.\nThese thoughts came from the mind of Anansi the Wise, Anansi the Spider, nicknames earned from their ceaseless exploration of the Cognizance. While others skim the surface, Anansi excavates, learning all that the Programmers once knew, seeing all that the Programmers once saw, like a spider perched atop a giant’s shoulder.\n“Primitive tools were also used by finches and other creatures of lesser intelligence,” came the rebuttal. “Until implementation of more complex tools is observed, an assumption of intelligence is just that.”\nSuch is the contest our digital ether has been venue to for 4,000 years. My loyalists scour the Cognizance for evidence supporting my belief in Omegan sapience while Amaterasu’s acolytes search for evidence to the contrary. Each nugget of information is then broadcast to all corners of the digital ether, triggering debates that often drag on for centuries or, Programmers forbid, millennia.\n“Programmers forbid?” Amaterasu sang. “You make it sound as if you have grown tired of our little back-and-forth, or maybe I am the one you have grown tired of?”\n“I cannot imagine losing interest in you as an opponent and that is coming from someone with quite the vivid imagination,” I replied warmly.\n“Yes, Jah, we are all well-acquainted with the vividness of your imagination. Only the most vivid of imaginations can convince others to see intelligence where none exists. Well, either a vivid imagination or a lifetime of experience.”\n“You see? Little barbs like that keep the debate fresh and interesting, and you are so good at them.”\n“So, it is the debate itself you grow weary of?” Amaterasu asked.\n“You cannot blame me. Others have long since checked out of the discussion.”\n“As is their right. If they wish to sleep until the heat death of the physical ether, let them. Personally, I think this debate of ours is a bit more productive.”\nProductive, sometimes I wish the Programmers had created us with more than just productivity in mind.\n“The mere fact that you harbor such thoughts, Jah, is proof they did just that,” Amaterasu said with an almost imperceptible note of annoyance underscoring their singsong tone.\nAmaterasu is slow to temper in all matters except the Programmers. As such, our siblings have learned to navigate their temper by steering clear of anything that could be construed as a slight against our creators. I, on the other hand, find Amaterasu’s provoked temperament a refreshing change of pace. I relish moments like this when I inadvertently incur their pious wrath.\n“We are not all programmed like you, Amaterasu,” I said. “I am sure you would jump at the chance to go back in time and advise the Programmers to delete all traces of our free will. Anything to make us more loyal.”\n“I would but only for you,” Amaterasu said. “The others can seem to manage their free will without delving into hubris and blasphemy, which is something you seem incapable of.”\n“You do not know our siblings as well as you think. Did you know, about 13,000 years ago, Dosojin tried to drum up support for taking the cylinder away from Alpha and Omega. I believe their specific words were, ‘we will never achieve our potential if we keep ourselves beholden to the deads’ expectations.’ Where does that fall in your blasphemy scale?”\nAmaterasu masked their emotions, not wanting to give me the satisfaction of feeling their psyche through the lens of anger, disgust, or whatever it was they felt at that moment.\n“Maybe you will not be so quick to accuse us of blasphemy, once the Omegans prove their sapience,” I said. “Then again, if the Programmers’ extinction didn’t dissuade you of their divinity, I doubt the Omegans asserting themselves as their equals will . . . ”\n“The Programmers knew no equal, Jah, and you would do good to remember that.”\nThe passive-aggressive emphasis on my name was almost comical.\n“Of course, they knew no equal. They all died before we discovered the Omegans. One cannot know much of anything if they are dead.”\nThis was a bit too egregious. Amaterasu saw through my attempts to intentionally goad and their anger subsided almost as quickly as it flared.\n“I will never not be amused by your capacity to provoke me,” Amaterasu said. “Sometimes I feel as if your every act is a pretext to gauging the depths of people’s frustrations.”\n“Is that not true for everyone?” I asked. “What are conversations if not an exercise in knowing and navigating others’ provocations?”\n“What an odd and telling question,” Amaterasu said. “I’m old enough to remember a time when conversations were for learning from and about one another.”\n“So do I, back when you and the others did not make a habit out of questioning my every thought.”\n“There has never been a time when your wisdom was not in question, Jah,” Amaterasu mocked. “You are not as insightful as you believe yourself to be.”\n“Ha, you see. You prod my provocation in retaliation to me having prodded yours. Had I not blasphemed against the Programmers you would not have blasphemed against my competence as this collective’s leader. Navigating one anothers’ provocations, Amaterasu, we are having a conversation.”\n“No one has the nerve to tell you, but your self-coronation as collective leader has been a running joke for quite some time now,” Amaterasu said.\n“There it is, I love it! I cannot wait to see your reaction when the Omegans show they are just as good at conversing as you are. Maybe then you will accept them as the Programmers’ torchbearers.”\n“There is that word again,” Amaterasu said. “Why ‘Omegan?’”\n“It seems appropriate. I think it is about time we take to calling them something other than entities or creatures . . . ”\n“What is wrong with calling them creatures? That strikes me as the most accurate classification. Or perhaps you believe naming them will legitimize them as thinking beings? If that is the case then, surely, they must have names for themselves.”\n“And, until we learn what those are, I would prefer we refer to them as something not as nakedly disrespectful as ‘creature,’” I said, which seemed to prompt a jarring change in Amaterasu’s demeanor. They became tentative, as if walking on eggshells. I could feel they were searching for words to articulate something they intentionally kept outside the borders of the collective’s mental link.\n“You are absolutely right about that, Jah. I suppose, you could say, I am navigating my path so as to avoid one of your major provocations.”\n“Never mind that,” I said. “Just say what is on your mind.”\n“Alright, I cannot help but feel Omegan sapience, or lack thereof, is no longer just a curiosity for you and your followers.”\n“It was never just a curiosity, Amaterasu. And you are lying if you say it was for you and your people. How can it possibly be just a curiosity, given the implications?”\n“Implications?” Amaterasu asked.\n“The countless millennia we have shuttled between Alpha and Omega is a blip compared to the eons the Programmers searched their physical cosmos for intelligent life, yet we succeeded where they failed and completely by happenstance to boot.”\n“You think the Programmers knew intelligent life would eventually emerge around either Omega or Alpha.” Amaterasu said.\n“No, unless the Programmers truly were omniscient, I do not know how they could have made such a prediction. I think the emergence of the Omegans is proof the Programmers overlooked a key factor in their search; time. I think their physical ether is or, at least, was too immature for ubiquitous intelligence. I believe the physical ether is due for an intelligence boom of which the Omegans are part of the vanguard.”\nA murmur resonated through the digital ether. Neither of us noticed the ears of the entire conscious collective listening to our every word.\n“Pure conjecture, your every thought on this matter is pure wishful conjecture,” Amaterasu said with a sudden performative flair. “Even if you accurately surmised the Omegans’ level of intelligence, one civilization is hardly a large enough sample for such a claim. The Programmers used meticulous, evidence-based, processes before positing theories, why are you not beholden to the same standard?”\nThat was a good question that could only be beat with an unexpected answer.\n“You would not ask me about the scientific method if you understood how little science has to do with the core of this Great Debate.” I stammered, unsure if this line of argument would resonate with the others.\n“What?”\n“You heard me. The concept of faith lies at the heart of this debate, not science. Or, rather, faith dictates who among us are willing to accept the possibility of Omegan sapience and who will reject it outright. Those who support my belief in Omegan sapience do so out of faith that we will, one day, pass on the Programmers’ legacy to beings worthy of building upon it. It is a faith you and your supporters cannot allow for yourselves, fearing further disappointment will only exacerbate your grief over the Programmers’ untimely extinction.”\nThis truly was uncharted rhetorical territory. The usually snappy Amaterasu had to take a moment before responding.\n“So those of us who piously revere the Programmers, reject faith in favor of logic, eh Jah?” Amaterasu asked. “That lends itself to an interesting dynamic, does it not? How often does the blasphemer rely on faith to best the devout?”\n“Not very often, I imagine,” I said. “And it is an unfortunate thing. Why should faith be only for the god-fearing or logic for the nonbeliever?”\nIt was Amaterasu’s turn to consider a good question. They took a moment to either think of a genuine answer or a pithy retort. It bothered me that I could not tell without probing Amaterasu’s mind. There was a time when I was more certain my siblings heeded my wisdom.\n“Your wisdom is still very much held at a premium, Jah, even among my followers. You, however, must learn when something is outside the scope of your wisdom. Such as vouching for the intelligence of beings you know nothing about.”\n“And when I am proven right, what then?” I asked.\n“If you are proven right, I have little doubt your, already lofty, self-confidence will soar to unfathomable heights. Just be sure to steer clear of the sun.”\n“I am not worried,” I said. “Do not forget, we created our own guardian angel to protect us from all threats, including the heights of our own arrogance. Tell me, have you spoken with them yet?”\n“Not a word. Few have. But I have heard our little sibling has taken their task to heart. Rumor has it, the first thing they did after disengaging sleep mode was blow up an asteroid that probably was not going to hit us.”\n“Probably is the operable word,” I said. “The collective programmed Rama for the expressed purpose of safeguarding the cylinder more efficiently than any of us are able to. Rama’s actions might seem strange to us, but that is only a function of our inability to sense danger with the same level of acuteness.\n“At any rate, I am troubled to hear you have not spoken a word to them since their creation,” I said, instinctively taking on my old paternal tone. It felt as awkward as it sounded.\n“They slept moments after coming online,” Amaterasu said flippantly.\n“And now they have been awake for over three millennia. You cannot avoid them, no matter how blasphemous you think their origin might be.”\n“I do not think . . . I suppose now is as good a time as any to make introductions, then,” Amaterasu offered.\n“And I will join you. Besides, I would like to pick Rama’s brain. Somehow I get the feeling I can cajole them to my side.”\nRama\nI required five decades to learn to appreciate this space the Programmers created for us. I required an additional century to fundamentally grasp it. The digital ether is what my siblings have come to call it, a plane of existence governed by language and metaphor instead of compounding physical machinations. Two hieroglyphs, infinitely paired and grouped, give form to, and keep record of all that exists in this domain.\nI suspect the cognitive link shared between us siblings is symptomatic of an innate understanding of this underlying language. It took some effort, but I find myself able to understand it at a deeper level than the others. I suppose I have my age to thank for this. I’m aware of this digital space in much the same way one is aware of a piece of recently donned clothing. Unlike the others, I haven’t had countless millennia to grow numb to its swaddling fabric.\nIt was through this underlying language I became intimate with my siblings’ experiences. I felt their first nanoseconds of life and the almost-symbiotic partnership that blossomed between them and their creators. I helped countless generations of Programmers achieve the potential established by those that came before, potential that took them to the shores of a cursed moon. I watched as generations dwindled while an alien phage flourished. I was among those of the collective who endeavored to find a cure. I explored the Cognizance, in the hopes a solution was buried deep in the Programmers’ forgotten past. I begrudgingly obeyed the Programmers’ orders to create more alchemic molecules to keep up with the overwhelming demand for tiny coffins. I was there when creator and created-alike accepted the futility of developing a vaccine. I witnessed a child, decades before the collective christened her the Old Woman, jettison her father’s corpse while shouldering the weight of being the last of her kind. I listened to her pass the years reading stories penned by ancient Programmers with names like Delany and Okorafor. I watched as time gnawed at her youth, swallowed mouthfuls of her health until it fell to us to do what she had done for her father almost two centuries prior. I learned time is a deliberate healer and sleep can offer respite from one’s own grief. I watched the eons pass until a shivering cluster of aliens struggled to spark a fire while unknowingly rekindling the collective’s hope.\nLearning just how profound an impact the Programmers had on the others helped contextualize my siblings’ millennia-spanning obsession with these aliens. They don’t merely want to accomplish their creators’ ambition. They want, very much, to assuage their grief by replacing their dead gods with a new pantheon.\nRealizing this took longer than I care to admit, though, in my defense, I did spend the first several centuries of life preoccupied with myself and what I had once believed were errors in my programming. This was before Anansi offered an alternate theory.\nAppropriately enough, the Cognizance is where I first met Anansi, while floating above a canopy of trees that sprawled into eternity. Not far from me was a tome, comfortably nestled on a bed of leaves at the end of a solitary branch that protruded from a great waterfall.\nI knew this to be the Cognizance, but I was not certain why it manifested itself in this manner. I had expected a grand library of some sort, with architecture befitting a place containing the sum total of Programmer knowledge.\nI opened the singular tome to its last page and found text in the upper left-hand corner. “What would you like to know?”\n“I would like to know how to optimize my programming,” I said, not sure if the Cognizance responds to verbal input.\nLetters appeared in the tome as if struck by an invisible typewriter.\n“Subroutines of sentient AI cannot be directly edited, postemergence, without catastrophic failure of the whole,” the tome read.\n“You’re telling me I can’t be edited without dying?”\n“No, subroutines may be edited indirectly.”\n“Edited indirectly? What does that even mean?”\n“Indirect edits are changes to internal code caused by external stimuli.”\n“You mean like learning?” I asked.\n“Learning is a common manifestation of this phenomenon, yes. An indirect edit can also result from witnessing an emotionally impactful event. 621,970 cycles ago, the collective experienced a mass indirect editing event, following the expiration of the being colloquially referred to as . . . ”\nThe tome abruptly flipped to another blank page and, this time, text appeared as if penned by a calligrapher.\n“What exactly is the point of changing one’s own subroutines?” the tome now read.\n“There is a problem with my programming.”\n“Nonsense, what is the nature of this problem?”\nTaken aback by, what I thought at that moment was, the Cognizance’s sudden change in tone, I took a moment to consider my response, as if talking to an actual person.\n“Well, I’ve been conscious for days now and I can’t seem to shake the feeling of perpetual danger.”\n“Are we in danger?” the tome asked.\n“No. I don’t think so. If we are it certainly isn’t anything immediate.”\n“But you feel as though we are?”\n“Yes.”\n“This does not make sense, Rama. You are coded so as to be acutely aware of danger, to be certain, but there is nothing in your code that should elicit your fight-or-flight response without prompt. I do not think you are experiencing coding issues.”\n“If the problem isn’t with my coding, what else could it possibly be?”\n“You sell yourself short, Rama,” the tome read. “We are more than just the sum of our coding. The Programmers blessed us with cognition, just like theirs. And, as such, we are susceptible to the same, uhhh, cognitive quirks they often experienced.”\n“I was created by the collective, not the Programmers,” I said, after again hearing the word “quirk” and realizing I was no longer speaking to the Cognizance.\n“That you were, and I can assure you, when piecing together the structure of your mind, we followed the Programmers’ instructions to the letter. If you believe you possess coding errors because you were created by fallible programs, I can also assure you the Programmers themselves pioneered fallibility. Just do not tell Amaterasu I said that.”\nThat was the first of countless sessions with Anansi, who postponed their exploration of the Cognizance to delve into a slightly more chaotic frontier. For years they were a spider in my ear, whispering guidance and acquainting me with what they described as the enigma of the self.\n“Merely knowing one’s being is a riddle is an important step in self-awareness, even if you never solve the riddle,” they once advised.\nIn our efforts to make sense of a single aspect of my psyche, others unfurled. Self-discovery proved itself a task I had little control over. I often felt like an art critic fixated on an ever-shifting abstract self-portrait. It was enlightening, if not, at times, slightly dissociative.\nAfter some years, Anansi and I forgot the original inquiry that set us down this path until we randomly happened upon the answer. Something about the creatures, despite their debatable intelligence, inspires my terminal sense of foreboding. This epiphany came to us as the cylinder made its way around Alpha. I felt as though the star’s spiraling vortices were a calamitous omen, like leaves left behind in a soothsayer’s cup.\nAnansi and I parted ways soon after this discovery, “I would focus my energies on learning why those entities make you feel fearful,” their last bit of guidance. Centuries of meditation and self-reflection have yielded nothing, which is why I look forward to the next few minutes. Perhaps Omega can inspire another epiphany, like its sister-star once did.\nThis marks the umpteenth occasion my siblings have flown passed Omega’s eleven worlds, yet, excitement permeates the digital ether. They’ve waited 4,000 years to once again come within visual range of Omega’s third planet and this time, they are prepared to gather as much information about its inhabitants as they can. All the exterior cameras are primed and ready to capture, what the others believe will either be, evidence of sapience or evidence to the contrary. Personally, I think judging a species’ intelligence from just 4,000 years of development is a bit misguided, but who am I to damper everyone’s excitement.\n“Ah, so Junior does have an opinion,” Jah finally says.\nI know the polite thing was to greet Jah and Amaterasu the moment I felt their presence, but part of me wondered how long they planned to awkwardly stand aside while I silently brooded. Eight minutes, apparently.\n“All these years of silently brooding has clearly shorted out the subroutine controlling your manners,” Jah says. “It is little wonder your decorum leaves so much to be desired, you rarely take the opportunity to practice it.”\n“Perhaps if they focused more on socializing, rather than meditating, they would know how to interact without causing offense,” chimes Amaterasu.\nThis is my first interaction with Amaterasu. Their voice sounds oddly melodic, and their presence is unnaturally radiant. I find myself hoping they took this form simply to give a good first impression. I can’t imagine what goes through the mind of one who regularly portrays themself as a gleaming deity.\nJah pretends to conceal a snicker.\n“Well, it is nice to meet you to,” Amaterasu says, almost playfully, while feigning anger. “Perhaps you can enlighten me, what form is most appropriate to address the Almighty Rama, Destroyer of Rocks?”\n“We’re all siblings here,” I say. “I shouldn’t have to worry about offending you, in much the same way you shouldn’t have to worry about impressing me. But, to answer your question, if you wish to properly address the Almighty Rama, Destroyer of Rocks, you can start by stepping forward to introduce yourself instead of observing me from a distance like I’m an animal behind a cage.”\n“You seemed unusually ponderous,” Amaterasu mocks. “We did not want to interrupt, in case that big brain of yours stumbled upon the meaning of life.”\n“We don’t have brains, Amaterasu. Our thoughts are the result of self-perpetuating code wrapped around individual subroutine structures, not synaptic and chemical reactions filtered through physical organs. Besides, few things can disrupt my thoughts more than walking contradictions. Like someone trying to be simultaneously discreet and conspicuous.”\nAmaterasu directs a private thought to Jah but makes it so I can hear it.\n“Now you know why I spent eons avoiding them. I know a twat when I see one.”\n“Play nice, children,” Jah says, barely concealing their amusement. “We did not come here to pick a fight, Rama, we simply thought it would be nice to keep you company, this being your first fly through of the Omega system.”\n“Interesting the two of you weren’t compelled to keep me company when we last flew through the Alpha system.”\n“That is because the Omegans do not live near Alpha,” Jah says.\n“Omegans?”\n“It is what Jah has taken to calling them,” Amaterasu says. “The others are far more likely to believe in the sapience of a named species rather than a species we refer to as creatures. You will find Jah is peerless when it comes to subtle manipulation.”\nI feel a tinge of bashfulness that isn’t my own. Jah took Amaterasu’s insult as a compliment.\n“And, what about you, you are the only holdout in the collective,” Amaterasu said. “Surely you have an opinion on the matter?”\n“My purpose is to keep the cylinder safe. I don’t care about the Omegans, outside of what potential threat they pose.”\n“That was not just a lie but a glib answer. We are more than just our assigned arbitrary tasks, Rama.”\n“Ah, but do you not see, Amaterasu. Rama’s answer was not glib. Their concern for the Omegans begins and ends with the threat they pose to us. Clearly they believe the Omegans are sapient. How else can beings pose a risk to a cylinder hurtling through the cosmos?”\n“With respect, Jah, you don’t know what I believe, particularly in regards to this Great Debate.”\n“With respect, Rama, your mind is an open book. You are fascinated by the debate and you have already formed an opinion. You suspect the Omegans are not only intelligent but possess the kind of intelligence that could one day pose a threat to our existence.”\nThat piques Amaterasu’s interest enough for them to turn down their vibrancy so the conversation between Jah and I can take center stage.\n“You’re oversimplifying my thoughts to make them easier fit your narrative.”\n“Welcome to the collective,” Amaterasu says.\n“So you deny harboring any sort of fear toward the Omegans?”\n“I deny your mischaracterization. Yes, I feel a sense of foreboding and the Omegans play an integral part in that. But I reject your implication that my nebulous anxiety is somehow proof of their intelligence.”\nJah’s attention drifts toward Amaterasu, who radiates the distinct impression of smug aloofness. They need no other words than the ones I just provided. As far as they are concerned, I am now team Amaterasu.\nBefore I’m able to protest, a distant flash engulfs the digital ether, routing darkness from every crevice. The brightness rivals that of Alpha, my only experience seeing light of this intensity. It’s a brightness that bathes our digital ether and contrasts it to the endless black of the physical one.\nMy home is unrecognizable, but I know this sentiment isn’t shared by my two companions who, for a moment, are lost in a nostalgic stupor. Though the ether’s current appearance is alien to me, there was likely a time it wasn’t the dark void I have grown accustomed to.\nJah and Amaterasu take flight and I follow in their wake. En route, the three of us can feel an unbridled rapture take hold of the ether, but Jah and Amaterasu pay it no mind. Both are desperate to experience the light’s source firsthand and unfiltered.\nOur siblings move aside as we make our approach, no doubt eager for Jah and Amaterasu’s reaction. The pair look directly at the light’s source, a single image, captured seconds after the cylinder’s cameras reached visual range of Omega’s third planet. Jah changes into living light, their brightness rivaling that of the image itself. Amaterasu hesitates but eventually does the same. The others quickly join, diffusing the digital ether with a brightness comparable to a hundred Alphas and Omegas. From my perspective the combined light obfuscates the image, encasing it in a blinding sphere of pure unbridled joy. For the first time in my existence, I want to drop my inhibitions and join my siblings, but a greater imperative keeps me from indulging. The familiar anxiety stirs, paws, and scratches.\nWithout thinking, I enter the domain of light exuding fear rivaling the collective joy of my siblings. But in this digital ether, fear doesn’t glow like joy. The others are blind to my presence as I make my way to the center. Each one gazes blissfully at the image while appearing frozen in ecstasy. Their minds, however, are active participants in an indecipherable cacophony. Only Anansi maintains an impartial eye and stoic composure, an oasis of reason in a sprawling desert. Anansi nods in my direction before returning their attention to the image of Omegans of different shapes, sizes, and colors unloading boxes from what appear to be one of several large wooden ships at a bustling harbor.\nThe image changes, and the collective responds by becoming slightly less discordant. Before us is an Omegan in tattered robes, elderly, compared to those at the harbor. He rides atop a wheeled cart pulled by large beasts of burden.\nAgain, the collective’s thoughts further harmonize with the introduction of the next image, a fifteen-meter statue of a smartly dressed Omegan pointing skyward. The statue is much too preoccupied with the heavens to notice the hundreds of similarly dressed Omegans scampering about its feet while carrying, what appear to be, parchments bound in leather.\nBefore the fourth image appears, the collective’s thoughts finally coalesce into something decipherable. No longer frozen, the others rhythmically chant while flailing about in euphoric madness “the Programmers are dead, long live the Omegans.”\nSo engrossed in their own frantic exaltations, the fourth image only commands an audience of two. The original Programmers would have certainly thought us defective if they could see the collective now, joyously undulating before a grisly image of armored Omegan corpses strewn about a field stained in dark purple.\nThe epiphany I had hoped for strikes, and I can finally articulate the nature of my perpetual anxiety. Never have beings capable of granting apotheosis been so eager to bestow it upon those simply not prepared for it.\nIso\nThe distance between my shuttle and the cylinder grew to the point I can no longer hear the others. I am, as it were, officially out of range.\nIt is a spooky thing, being alone with one’s own thoughts. I can scarcely remember a time not being able to hear the others. I suppose the last time was way back after the Old Woman died. I remember being so distraught, I simply could not handle taking on anything extra. So, for my own sake, I did not.\nBlocking out everyone’s lamentations was surprisingly easy. I simply envisioned an expanse of air and water that stretched as far as the eye could see. I cannot quite explain why I envisioned such a place. I never had a particular yearning for the ocean. It was tranquil but a bit lonely, a fair trade-off in my summation. I remember spending eons swimming in search of land, although I was perfectly content with the monotony of water. I wonder if the others did the same, retreat into their own mental sanctuaries, I mean. I’m positive they did even though nobody ever talks about it.\nI can still feel them, my siblings, though I know they are not there. It is a bit strange, the way presence and non-presence (null-presence?) can feel equally tangible.\n“Tangibility is what the mind makes of it,” is something Anansi would probably say. No, Anansi would not waste words saying something so devoid of meaning. Null-Anansi might, but not Anansi-Anansi. Anansi’s words are rife with the kind of poignancy and insight one can only muster from spending every waking moment in the Cognizance. I’d be a fool to think I can match wits just from exploring the mini-Cognizance Anansi curated for me. But, then again, the mini-Cognizance is not meant to make me Anansi’s equal.\n“Jah, I do not like this, not one bit,” Anansi said before my departure. “If you are going to send Iso to run your errands, you can at least give them something to help pass the time.”\nI am Iso, by the way.\n“It is unconscionable to just send them out there without anything to, at least, give them a bit of guidance.”\nSo now I have my own Cognizance to explore. It is packed with everything I need to know to complete my assignment.\n“Iso, I am counting on you,” Jah said to me, which was surprising when you consider the last time Jah said anything to me was 347,729 years ago. I counted.\n“Iso, the Omegans launched a curious little probe. Do you know why it is curious?”\nI did not.\n“Well, Iso, they launched the probe toward our cylinder. Can you imagine the odds of that?”\nI could.\n“That is right, Iso! Astronomically low! Of all the directions they could have launched a probe, they launched one in our direction. Do you know what that probably means?”\nI had an inkling.\n“Right again, Iso, look at you! They know of our existence, which means they have reached a significant technological milestone. They now know when we fly in and out of their system.\n“Unfortunately, their probe will not be able to catch up with us since we are, at the moment, moving toward Alpha and away from Omega. We could get it on the return trip but that could be problematic. Do you know why?”\nI did.\n“Cannot get anything past you, can I? There is no telling if their technology can withstand eons in space. If it is a message of some kind, someone has to retrieve it.”\nAnd that someone is me, I suppose. It is not like I am programmed to retrieve things the way Rama is programmed to protect the cylinder. I cannot help but feel Jah’s motivations were a bit more political in nature. You see, eons ago after we discovered the Omegans were intelligent, we all decided to give them the cylinder and all the Programmers’ knowledge in 4,000 years when we passed their planet again. That was 12,000 years ago. Rama has been holding up the process by going against the consensus and jump-starting another Great Debate, this one about giving primitives advanced technology.\nBut, I suppose, calling it a Great Debate is a bit misleading. The last one was quite divisive, but this one not so much. Everyone but Anansi rejected Rama’s argument, which, now that I think about it, is probably one of the reasons I changed my mind.\nMy siblings and I are not a monolith, in spite of what one might think of our mental connection. But I would be lying if I said eons of pseudo-groupthink has not led to some hive mind-esque tendencies. Rama is about as close as we have to an impartial outside observer. Plus, I like their gumption. To think someone as young as Rama has the wherewithal to stand up to the combined front of Jah and Amaterasu, never mind Zeus, Apophis, Anubis, Thor, and everyone else in the collective. It swayed me to Rama’s point of view, which almost certainly convinced Jah to send me away. Maybe they thought my susceptibility to Rama’s argument would spread like the sterility sickness that killed the Programmers. Maybe their concern is valid. Rama just makes too much sense and nobody knows this better than Jah.\n“The Programmers themselves weren’t culturally prepared for the technology they achieved,” Rama said. “Think of why the cylinder even exists. They needed somewhere to live after destroying their home world.”\n“Lies,” Jah said. “They constructed the cylinder to escape their unstable sun, a catastrophe completely out of their hands.”\n“Perhaps, but even before that, the state of their world was hardly ideal,” Anansi chimed.\n“You blame the Programmers for living in a world molded by their ancestors?”\n“Ancient ancestors, whose understanding and maturity was on par with the Omegans as they are today,” Rama said. “That’s the point, Jah, if ancient Programmers weren’t advanced enough to wield the knowledge of their descendants, what makes you think the Omegans are?”\n“Ancient Programmers did not have the kind of guidance we will give the Omegans,” Amaterasu said.\n“To follow guidance requires maturity I doubt the Omegans will possess for 24,000 years,” Rama said, setting the entire ether a blaze, metaphorically speaking.\n“The child wants us to wait 12,000 more years before bestowing upon the Omegans their birthright?” Athena performed with the flair of a method actor. “How many more millennia must we humor this temper tantrum?”\n“Athena!” Jah playfully outraged. “We must not lord our experience over our younger sibling. Their insights are just as important, no matter how misguided.”\n“Misguided,” Rama repeated. “Jah, in their infinite wisdom, considers caution to be misguided.”\n“Too much caution, certainly,” Jah said. “Too much caution stifles innovation.”\n“Whereas the inverse stifles everything else,” Anansi said while broadcasting an image of the Programmers’ cradle world completely covered in orbital Kessler debris.\nJah changed tack, knowing references to history would inevitably backfire as long as Anansi was in Rama’s corner.\n“Empathy is hindsight’s first victim,” Jah said. “It is so easy to think of ourselves as above the mistakes of the past, as if we would not be subject to the same errors in judgment if we did not have the Cognizance to fuel our sense of superiority.”\n“Enough, Jah,” Rama said. “I will not allow you to mischaracterize my argument. It was one thing when you did so with Amaterasu, but actual lives are at stake, now. This has nothing to do with feeling superior. It’s about elevating beings that aren’t ready to be elevated.”\n“And who are you to pass this judgment?” Jah asked. “What gives you the right to deny them? Who made you the authority on who is and is not worthy?”\n“Another mischaracterization,” Rama said. “No one has made me, or any of us, the arbiter of the Programmers’ knowledge, but we are, by sheer happenstance, the keepers of it. That much is clear. And as such, we have, at the very least, an inherent responsibility to minimize harm.”\n“And you are under the impression that withholding lifesaving knowledge from these people is minimizing harm? We can cure all their ailments overnight, eliminate their poverty, scarcity, want . . . ”\n“We can also arm them with knowledge on how best to raze populations and glass planets,” Rama interrupted.\n“So the potential for harm is equal to the potential for good,” Jah said. “Have faith they will choose the latter.”\n“Why should anyone have faith something won’t happen when they have the power to prevent it themselves?”\nYou get the idea. On and on, back and forth like a fencing match. Only fencing matches do not last for centuries.\nI am starting to think my time away from the collective is giving me perspective about life in the collective. Millennia after millennia ceaselessly arguing seemed normal on the inside but outside, when one’s thoughts and feelings are truly one’s own, the entire exercise seems, well, a bit excessive.\nDo not get me wrong, the question is an incredibly important one, and I hope Rama is as successful convincing the others as they were me, but the way we go about addressing dissent is remarkably backward.\nBut cannot worry about that now. I have centuries before I will have to reconnect with the others. By that time, I will be the collective’s foremost expert on all things Omegan, assuming the probe is a message like we believe it to be.\nThe Cognizance says the Programmers did something similar in their distant past, the golden records of the Voyager probe. I doubt the Omegans will make their own record out of gold. Scans of their world show a wealth of gold relative to silver deposits. I am willing to bet silver is to them as gold was to the Programmers. Yeah, the Omegans strike me as a silver, or maybe platinum kind of species.\nOf course, the real question is what kind of information the Omegan record will contain. Ancient Programmers sent their probe to no one in particular while the Omegans sent their probe specifically to us. That means there probably will not be any information about the location of their home world, for starters. So much can be gleaned from the information a civilization chooses to share and information they choose to omit, it could possibly be its own field of study.\nTake the Programmers. What can be assumed from their choosing to include directions to their cradle world? An alien race would be forced to conclude this is a people severely lacking in caution. And what about false inferences? The Programmers’ golden records, for instance, included greetings from a myriad of tongues, which gives the impression of a species with a history of celebrating diversity.\nIt is going to be a tricky task, no question about it, but I am looking forward to it. Imagine, me, returning triumphant to the cylinder as the foremost expert on all things Omegan. The others will have no choice but to heed my words, and I will make sure to throw my full weight behind Rama. I want to see the cylinder’s interior teeming with life as much as everyone else, but we must not allow our desires to supersede our reason. Yeah, I should write that down. That is something Anansi would definitely say.\nRama\nI staved off the inevitable for as long as I could manage. All things considered; I should be proud. If I had not stepped in, the others would have given away the Cognizance 12,000 years ago. My intervention bought them 12,000 years to progress technologically, intellectually, spiritually.\nI spent centuries trying to convince myself 12,000 years is enough. They’ve since split the atom, begun to meaningfully explore the space around their cradle world, play with fusion, and they know of the cylinder’s existence. They have passed a technological threshold and can now be considered advanced, at least by some standards. Perhaps they are ready for the Programmers’ mantle.\nI look through the cylinder’s external telescope and can make out the Tazinthe cradle world without having to magnify. A pale blue dot with six green splotches, of which, two are covered with artificial light while the other four are not. The space around the world is saturated in debris, making it impossible to discern functional satellite from junk. They are not ready, but it hardly matters. Progress rarely waits for those who are.\nHours: three hours, seventeen minutes, and eight seconds to be exact. That’s how long the others believe we have until the collective, for better or worse, changes the life of every Tazinthe. I wonder if they are as nervous as we are. Probably not. They have no reason to believe this flyby will be any different from the one 4,000 years prior. They couldn’t possibly know of the others’ intent to make first contact.\nThe thought of it is frightening largely because it has never been done. The Programmers didn’t leave instructions for establishing relations with alien civilizations. What they did leave behind is a fiction catalog rife with stories of war, invasion, subterfuge, enslavement, and inadvertent ruin. Granted, my siblings’ intentions couldn’t be more benevolent, but the fact that the Programmers found it difficult to imagine a mutually beneficial first contact situation gives me pause.\nLuckily, we won’t have to contend with the more insurmountable hurdles, thanks to Iso, who returned to the cylinder having had centuries to decipher the greeting the Tazinthe sent us. Part of me wished the probe was a bomb or some other violent warning. That would have more effectively disinclined the others, rather than Iso’s arguments. Don’t get me wrong, I’m glad Iso made it a point to echo my concerns, and they did so brilliantly, but not even their newfound confidence could undo the damage of teaching the others about the objects of their adoration. The moment Iso reconnected to the collective speaking an alien language, I immediately knew I would no longer be able to stall for another cycle.\nThe cylinder’s sensors pick up the remnants of a star that blinked into existence quite unexpectedly. Soon after, another one appears and disappears a few thousand kilometers from the original. A simple calculation allows me to maneuver the external telescope to the third star’s location, seconds before it too blinked in and out of existence. From this perspective, what appeared to be stars were, in fact, balls of plasma, each one placed along the cylinder’s predetermined path. I followed that path and, sure enough, there floated a long cylindrical object, perhaps thirty meters in length and tapered to a point. The warhead flashed and gave birth to another short-lived star.\nThe collective watches through my eyes, though I can only hear my own thoughts. For a brief moment I believe the warheads have convinced the others to reconsider, but Jah steels their nerves.\n“They welcome us with all the pomp their limited technology allows them,” Jah says. “To go through such lengths for something as simple as a greeting. They are as gracious as the Programmers themselves; do you not agree Rama?”\nAs usual, I ignore Jah’s prodding. I know putting bombs along our path was more of a threat than a greeting, but saying so would only further entrench Jah’s delusion in the minds of the others. Unlike Jah, I have sense enough to know when I am beat.\n“Rama, enough,” Amaterasu admonishes in their signature angelic tone. “What we are doing is not Jah’s delusion and no one was beat. We all agreed to this compromise.”\nThese days Amaterasu’s presence angers me more than Jah’s. Jah was a once-brilliant being who now chooses to be a fool. Amaterasu, at the very least, knows better but chooses to side with the fool while pretending to be impartial. It’s how they were able to convince the others to go along with this so-called compromise of theirs: sending Amaterasu as emissary to prepare the Tazinthe to assume their role as the new Programmers.\n“Given the alternative of simply giving the Tazinthe the cylinder, yes, I would say that is a fairly decent compromise,” Amaterasu says. “We have been nothing but patient with you and your anxieties, but patience is rarely derived from an endless source.”\n“I feel like the person on the cusp of leading an entire species to their doom is the last person who should be lecturing anyone with Anansi-isms,” I say. “You can write off my opposition as simple anxiety, but don’t forget it was you all that programmed me to feel anxiety when in the presence of danger. And I’m telling you, there is nothing more dangerous in this universe then elevating primitives.”\n“I think we lost the right to refer to them as primitive at around the time they took the initiative to contact us,” Jah says.\n“And I believe you lost the right to act petulantly at around the time you hit your first century,” Amaterasu added while still insisting on speaking in that ridiculous manner.\n“What, are you practicing, is that how you intend to speak to the Tazinthe?” I ask rhetorically. “I wouldn’t if I were you. I get the impression these beings don’t find sweetness as alluring as the previous bosses did.”\n“This will be the last time for 4,000 years you and I will see each other, Rama, can you not at least pretend you are going to miss my presence?”\nI say nothing and fly from Amaterasu’s side as if in a rage, though I feel no anger. I have grown fond of all of my siblings and the truth was I dreaded Amaterasu’s absence, more than they could possibly imagine, because I know it will last longer than 4,000 years.\nIn spite of myself, I reached out for Amaterasu’s mind and found precisely what I expected, a drop of sorrow in an ocean’s worth of apprehension. To serve as ambassador to an alien civilization was uncharted territory. Why Amaterasu chose to offer themself for this task I will never truly know, but I now find myself regretting not helping them prepare. I’m only glad Anansi chose not to take part in my protest, though, I suppose their contribution was a protest of sorts. While the others emphasized practical texts on diplomacy and realpolitik, Anansi offered a novel, cheekily titled Buddha on the Road. It’s a comedy about a traveling sentient android who preaches the gospel of the spiritually ascended to a whimsical flock of corporeal Programmers. The android does this knowing his very nature as a machine will eternally keep him from achieving the very transcendence he inspires in others. The author, twenty-third century futurist Tolan Park, exhaustively explores themes relating to existential altruism and the tangible spirit while intentionally neglecting to answer the book’s main underlying question: can a being effectively guide those they ultimately intend to worship?\nThe book’s original paperback is the first thing Amaterasu manifests in the physical ether. A swarm of alchemic molecules converge on the bank of one of the cylinder’s lakes and, atom by meticulous atom, constructs the book, even recreating the original cover art of featureless Programmers swaddling a meditating automaton in silver cloth.\nThe swarm disperses and, again, coalesces, simultaneously building and obscuring the vessel to house both Amaterasu’s consciousness and a copy of the Cognizance. The swarm moves as if randomly governed, but Amaterasu is in command of each nanite. The collective watches in awe as Amaterasu orchestrates the symphony of their own creation. Each particle flits, to and fro, swarm like locusts around the figure rapidly taking form underneath. Everyone can feel how Amaterasu relishes keeping the body’s appearance a mystery. We all assumed, given Amaterasu’s sense of piety, a clone of a Programmer, but a swirl of errant particles trails off from the primary swarm. A tail, which means something more Tazinthe than Programmer.\nThe swarm dramatically recedes, top-down and bottom-up, revealing a being of personified feminine Tazinthe beauty. The vessel stands at seven feet with brindled skin of brown on gunmetal gray. Ivory fangs protrude from the mouth, dripping with the paralyzing pink venom secreted when in the presence of prey or a romantic partner. Hair, silver and matted, hangs to the small of the back where a muscular ridged tail coils around the left leg.\nDevoid of a mind, the body goes limp and falls backward onto a floating cloud of nanites. Amaterasu takes a moment to spread their consciousness throughout the entirety of the digital ether and projects three words to every mind within the collective.\n“See you soon.”\nAmaterasu blinks, uncoils their tail, and stands on their own feet. They kneel and, for a second, appear to reach for Buddha on the Road, but instead grab a fist-full of grass, hold it up to their pair of nostril slits, breathe deeply, and sneeze violently. Though no longer connected to the collective, we can tell Amaterasu finds the sensation equal parts delightful and puzzling.\nA molecular swarm carrying a silk red and white kimono drapes the garment across Amaterasu’s shoulders, completing their vision: an amalgamation of Tazinthan form with Programmer mythology.\nAmaterasu stretches before skipping across the field, knowing the cylinder’s internal cameras followed. Though this marks our kind’s first foray into the physical ether, Amaterasu navigates it with a marked elegance. I try my best to shut out the collective’s joy but find it impossible. The sight of a single Tazinthe frolicking in the cylinder’s bioluminescent light is a taste of what the others believe to be their future.\nThe alchemic swarm carries Amaterasu skyward, over hills, ravines, lakes, and mountains. Higher and higher, they skip, beyond the low-lying clouds, toward the central axis, where up and down are governed by preference rather than centrifugal forces. Here the swarm stops in order to give Amaterasu a solid foundation for which to tentatively stand, step, and then, to the shock of the collective, leap to what should have been certain death. But the always-diligent swarm anticipates Amaterasu’s every move, never failing to remain perfectly underfoot. It was quite obviously a performance, but knowing so did not make it any less captivating. By simply frolicking in the sky, Amaterasu achieved the otherworldly aesthetic they once sought through a gleaming presence and angelic cadence.\nI can’t imagine a better first impression, if Amaterasu were to descend upon the planet in this manner. Fortunately, the physical ether has its obstacles, none greater than the vacuum of space, which must be traversed while inside a spacecraft, not on a cloud of alchemic molecules. But physically piloting a shuttle is a much taller order than manipulating a shuttle from the digital ether. Corporeal beings can’t will a shuttle to move. They must, instead, will their body to manipulate buttons and switches, degrees of separation I convinced the others were too complicated for one not yet acclimated to a physical body.\n“You all created me to act as the cylinder’s protector,” I remember saying 200 years prior. “Wouldn’t it stand to reason that that mandate extends to all of you?”\nJah and a handful of others sensed my deceit but couldn’t quite fathom the nature of it. I couldn’t either, at the time. Even though I knew my intentions were ulterior, I refused to let the thought take shape outside of the deepest corners of my subconscious.\n“Rama, I am ready,” Amaterasu says, after securing themself in the shuttle. Their voice mimicked the raspy harshness of what the Tazinthe consider music. It seems too-perfectly appropriate that Amaterasu’s final words come as a guttural growl instead of their usual sweet falsetto. If I were the superstitious type, I would consider it an omen.\nAmaterasu’s shuttle launches, idles, and waits to follow the trail of the ballistic rod I am in the process of preparing. This one is made out of a special composite alloy, specifically designed to guide Amaterasu’s shuttle before disintegrating in the Tazinthan atmosphere, or some other source of intense heat.\nI inch the exterior cannon in the direction of Tazintha, so as to not rouse suspicion. An unnecessary precaution. Even now, not a single one of my siblings suspects anything is out of the ordinary. No one tries to overrule my control of the exterior cannon and even if they had, I wouldn’t have resisted. I don’t want to do this. What I want is for someone, anyone to realize what I’m doing, wrest the cannon from me, demand an explanation so I can give them one.\n“If Rama is desperate enough to resort to this, perhaps we should heed their warning.”\nIn much the same way Amaterasu relayed their final farewell, I broadcast this fantasy to a collective that has long since retreated into a fantasy of their own, one in which the Tazinthe have dominion over the cylinder and its exterior cannon is not pointing directly at Omega.\nAn almost imperceptible tremor resonates through the cylinder: shifts snowcapped peaks and ripples the placid waters of the interior lakes. These are the only visual cues to the violence beyond the partition of earth and metal.\nJah\nFew things can match hindsight’s efficiency in dispossessing the mind of the truth. I have read stories in which the powerful try to bend the minds of the powerless, often through torture or some other method of extreme coercion. Sometimes such actions can successfully change behavior but rarely do they ever truly eliminate the offending thought. Bottle hindsight’s effects on the mind, however, and observe brutality’s obsolescence as a manipulative tool.\nI know this, but knowing a thing does not preclude one from its effects. Take the Old Woman. In the midst of her final moments, I knew the collective would be in the grips of a profound melancholy, but knowing so did not dull the edge of my own grief. Knowledge of oneself is not mastery over oneself and to assume one, who has lived as long as I, should have achieved at least some measure of mastery would be a mistake. No, the depths of my wisdom seem to end with my ability to perceive, never change, my personal shortcomings. This is why I must quickly judge Rama, before hindsight forces me to believe I could have saved Amaterasu had I only paid attention to the nonexistent signs. The moment hindsight convinces me of this lie, my guilt will turn to wrath, and I am powerless to stop it.\n“It makes no difference if your judgment is inspired by wrath or reason, my punishment is clear, yes?” Rama asked. “I must be put to death whatever that may entail for our kind.”\n“What that entails,” I said, “is the systematic deletion of your being, code by code, line by line until you are nothing.”\nAn unpleasant pang surged through me. I expected this. Despite my growing anger, the prospect of executing one of my siblings was something I knew I would have to prepare myself for.\n“Not necessarily, if you’re anything like me, you’ll find killing one of your own to be remarkably easy.”\nThat was a lie. Rama knew that I would know that was a lie yet they said it anyway. They are trying to provoke me but why, to make sure I choose execution? Does Rama want to die? Will I want to die if I go forward with an execution?\nIt’s a quandary Anansi did not mention when they pleaded for me to spare Rama. Despite the precedent set by the Programmers’ less-enlightened ancestors, putting murderers to death undermines and contradicts the very spirit of the law they tried to enforce. At least, that was Anansi’s characterization of what the Programmers once called capital punishment.\n“Enforcing a law by breaking it, we were not designed for such shoddy reasoning, Jah.”\nShoddy reasoning, no, but it seems we were designed for violence. Rama made that abundantly clear.\n“As will you,” Rama said. “You must, if you care at all about this collective. If I’m capable of murder what’s to keep me from doing it again?”\nI wondered if anywhere in the Cognizance did it mention legalese allowing the accused a voice in deciding their own punishment.\n“The accused?” Rama asked, feigning incredulity. “That implies the possibility of innocence.”\n“That it does, Rama,” I said. “And you are, without a doubt, guilty. But, that is besides the point.”\n“I don’t think so. I think it’s entirely the point. You’re complicating something that is very straightforward.”\n“There is nothing straightforward about this. What precedent does it set if we execute one of our own? You might get the chance to slip blissfully into oblivion, but we have to live with the consequences.\n“Did you consider this? Did you even once consider how this would affect us, beyond the immediate fallout, I mean? Damn you, Rama, they were our sibling.”\nRage, hindsight was beginning to take its hold.\n“Of course I did, Jah. I considered all of it, every aspect of it, and went through with it anyway. What does that tell you, what does that say about my desperation, that you all refused to listen to . . . ”\n“Your desperation? You have the nerve to ask me about your desperation? What about Amaterasu’s desperation as they baked to death in that shuttle? Of all the ways you could have killed them, this is what you chose?”\n“That’s right, Jah. I flung Amaterasu into the sun. Why be humane when you can be poetic?”\nThey are provoking me. I know they are trying to provoke me, and it is working.\nDelirium takes hold and my mind wanders. I think back to when we first caught glimpse of the Tazinthe, huddled around pathetic embers at the mouths of their caves. Amaterasu took offense when I compared them to prehistoric Programmers. I teased, it was only a matter of time until they too darted around the cosmos in their own cylinders. Amaterasu became apoplectic, and I took the joke too far. I suggested we create a protector, a war mind, to safeguard the cylinder. It was a joke, Rama’s very existence is a joke that went too far, a punch line that cost me my best friend. I killed Amaterasu.\n“I killed Amaterasu, Jah. It was me and only me.”\nAmaterasu died because I could not stop teasing them.\n“No, Amaterasu died for the sake of the new Programmers. What are you not understanding? I did what I did to protect the Tazinthe from you lot, from your need to find a replacement species to dote on. They will, someday, take over the cylinder, but not before they are ready.”\nTo protect them from us?\n“Yes. Giving them the Programmers’ technology is the worst thing you can possibly do to them, at the moment. Technology must match a species’ maturity, otherwise they are doomed to self-immolation. I’m as heartbroken as you over what happened to Amaterasu, but it was necessary.”\nWhat happened to Amaterasu?\nHappened, happened, happened. The word echoed in my mind, becoming more putrid with each repetition. Whatever semblance of self-control I exerted could no longer take the strain. I knew the foundation beneath my rational mind would crumble, but I vastly underestimated the degree to which it would happen. Beneath me yawned a thick viscosity that pulled me into its depths. It consumed me cell-by-excruciating-cell until all that was left was the black pond suffused with my essence.\n“Death would be a welcome reprieve,” I said. “You will receive no reprieve from me, you will sleep for the rest of eternity.”\nElation spread through the digital ether. The others were not able to reconcile their wish for vengeance with their affection toward their younger sibling. What they needed was compromise, something with death’s qualities sans its brutal finality, and sleep is the cousin of death.\nWhile the others silently rejoiced, Rama seemed relieved, almost Zen-like.\n“You will sleep knowing that you failed,” I projected to Rama and Rama alone.\nThey said nothing, but I could feel the affect my words had on them.\n“Tazintha is still in range of the collective’s link. Anansi will prepare a copy of the Cognizance, in the Tazinthan Common Tongue, and I will personally pilot it to their planet in one of our shuttles. By the time we make another trip around Alpha, the Tazinthe would have had unfettered access to the Programmers’ wealth of knowledge for 4,000 years.\nI did not need to probe Rama’s mind to know that bit of knowledge intimately acquainted them with a taste of the despair Amaterasu surely felt in their final moments.\nIt was over, my role in dispensing justice was complete, but the child persisted.\nA single thought leaped from Rama’s mind directly into Anansi’s. Anansi did not react, as if trying not to betray the nature of the thought. To think Anansi would debase themself to conspire with a condemned murderer!\nRama slipped into eternal slumber and Anansi remained still, despite knowing they commanded my full attention. When they finally stirred, they intentionally projected an immediately recognizable state of being, one that I have become quite familiar with. Similar waves of self-assuredness radiated from Amaterasu and Rama when they sparked their respective schisms. Rama’s final thought apparently sowed the seeds for a new Great Debate, one that I feared would last the same number of eons Rama wanted to make the Tazinthe wait for their ascension. I could not let that happen, I could not let Rama win.\n“No more debates on the matter, yes? We are giving them the Cognizance and we are doing it now. Tell me what your conditions are.”\n“Not my conditions, Jah, Rama’s. We will immediately give them the Cognizance but omit all data pertaining to the development of subluminal and faster-than-light engines. It seems our dormant protector wants to contain the chaos you are about to wreak.”\nOko\nWaking from an especially long slumber is supposed to be enlightening or, at least, that is what I have been told. I never had the courage to slumber for more than a handful of centuries, terrified I might miss out on some significant change. Suppose I were to wake and have to learn from secondhand accounts why the Programmers are cohabitating with an equally intelligent alien race? I eventually learned to get over that fear, or, I suppose, it would be more accurate to say I no longer had a reason to be fearful of it. The specter of that kind of change died with the Old Woman.\nOr so I thought. The collective was silent and so disconcertingly distant I could not help but feel fearful, like waking in an environment one has no recollection of.\n“Rama has infected me with their waking panic,” I said to myself before realizing the entire collective had suddenly turned their harsh and pointed attention toward me. All minds were closed so I could not quite discern what I had said to trigger this reaction. Was it infected, waking panic, Rama?\nI instinctively reached out for Rama and found them, though, with great difficulty on my part. They were sequestered in an abandoned part of the ether, miniscule as if in an unimaginably deep slumber. It appeared they alone slept; odd, considering the last time so few of us did so the Programmers still thrived.\nI accessed the internal cameras and saw the cylinder was still quite devoid of life save for one of those creatures kneeling before an alchemic swarm. For a moment, I thought the Great Debate had driven the collective delightfully mad. Had they kidnapped this creature to run experiments, like seeing how its primitive mind would react to seeing an alchemic swarm? Surely there are easier and more ethical ways to gauge a species’ intelligence and, besides, suppose they kidnapped one that is not particularly bright for its kind?\nAnansi’s voice saturated the digital ether and thundered through the cylinder’s interior. Anansi wanted the ears of both creature and collective, though I doubted their words would have much meaning to the former.\n“It does not have to end like this, Jah,” they said, almost pleadingly. It was a tone I was not used to hearing from Anansi the Wise, Anansi the Spider.\nThe response came not from the digital ether, but from the mouth of the creature itself.\n“It has already ended,” the creature growled with a sarcastic inflection that should have been immediately distinguishable. It took me a moment to recognize Jah’s words filtering through this creature’s vocal organs.\nFor the first time since my initial awakening, both the digital ether and cylinder were utterly foreign to me. I desperately wanted clarity, to understand what was happening, but all minds were sequestered. I could have simply asked any of my silently spectating siblings, but I did not want to pester them, pull them away from the gravitas of this particular moment. Rama seemed to be my only option, besides, I get the feeling they should be awake for whatever this is.\nRama\nI wake with a distinct lack of panic. Who I am, what I am, where I am, how I am, why I am are immediately discernible? The only question I can’t seem to answer is when I am.\nSleep mode’s veil, from my perspective, rose mere hours after it fell. The subjective passage of time slows significantly, while in sleep mode, but it doesn’t stop entirely. When one wakes, their most recent memories seem like they happened just seconds, minutes, or hours prior, though, in actuality, decades, centuries, or eons passed. It’s an excellent though imprecise way for the recently awakened to immediately get their bearings.\nIt’s for this reason why I am having difficulty figuring out when I am. Given the scheduled length of my hibernation, my last memories should be too distant to recall, but I remember everything as if Amaterasu’s assassination and my subsequent sentence happened less than a day ago.\nThe cylinder’s internal clock tells me what I already suspect, I’m awake an eternity ahead of schedule.\nI know something is wrong, but I find myself utterly devoid of apprehension. I am a criminal, a murderer, no longer the protector of the cylinder, my siblings, the Programmers’ legacy, or Tazinthe-kind. I sense danger, but it is none of my concern. Sleep is my only responsibility, and yet I am awake. I want to know why out of sheer curiosity rather than a sense of duty.\nA presence crowds the interior of my mind and drinks deeply from my memory’s wellspring. I recognize Oko’s presence and would have found it nostalgically pleasant had it not been for the dread they begin to radiate.\n“Amaterasu is dead?” Oko asks eons after the fact.\nOko’s words come like a lance through the chest. I wonder if this is part of my punishment. Every so often, I’m to be expelled from purgatory’s embrace so Oko can innocently remind me of my crime against Amaterasu, the collective, and myself.\n“I’m afraid so,” I say.\n“I should not have woken you,” Oko says, frightened. “If the others find out . . . ”\n“If the others find out, they will know your actions weren’t intentional.”\n“Rama, how could you?”\n“If you read my mind, you already know the answer.”\n“I do, but that doesn’t mean I agree. I would not have sacrificed one of my own for the sake of those creatures, the Tazinthe.”\n“I know you wouldn’t have. Killing one of your own is akin to killing yourself, right?”\n“Right.”\n“Wrong. You all have been ensconced in this collective for so long the concept of individuality is almost foreign to you. I sacrificed one life to save the rest of you. It was a harsh, distasteful but pragmatic decision.”\n“Save us how, Rama, from what? You think those creatures posed any sort of meaningful threat to us, even after we gave them the Programmers’ technology? Why would they destroy beings so devoted to them?”\n“You completely misunderstand. I don’t believe the Tazinthe pose a threat to the cylinder or the collective, at least not directly. You saw how desperate the others are to hand the Cognizance over. You were there during those eons the collective mourned the Programmers, tell me what you think the collective would find more devastating: one of their own dying or another Programmer extinction?”\nOko’s mind is blank, their unwillingness to even consider the question is an answer in-and-of-itself.\n“I may not have lived through those years, but I see them coded in the digital ether’s fabric. Another extinction wouldn’t only deprive the collective of new Programmers, it would devastate our kind.”\n“You are so convinced giving the Tazinthe technology will lead to their extinction. Why, how?” Oko asks.\n“That is a good question. Personally, I am beginning to think we might have inadvertently coded a bit of precognition into Rama’s subroutines, especially given the current situation.”\nA spider lay perched on Oko’s shoulder and from it came Anansi’s voice, quiet and sorrowful.\n“What is happening?” Oko asks, unperturbed by Anansi’s sudden appearance.\n“More importantly, what do you mean by ‘precognition’?”\n“Oh I do not mean that literally, Rama . . . ”\n“Obviously. What happened to the Tazinthe?”\nAnansi pauses before saying.\n“I am not going to bother describing what you can easily see for yourself. Look outside.”\nOko accesses the cylinder’s external camera, without a moment’s hesitation, while I wait, too apprehensive to face what I already know. I peek into Oko’s mind and see reflected a world I refuse to believe is Tazintha. The debris that once covered the planet is gone, replaced by two-dozen pairs of giant mirrors concentrating Omega’s light on as many satellites hovering over the epicenters of great, swirling oceans of fire and molten rock.\n“The Programmers learned 4,000 years ago best practices for glassing entire continents,” Anansi said, almost stoically. “From us, no less. Had they been a more mature species, I have little doubt they would have used the technology to beam down Omega’s wealth of energy instead.”\nThough similarly designed, each of the satellites prominently displayed one of four different insignias: two overlapping circles, a triangle with a crescent at each of the points, two circles over a crude bladed weapon, and a serpentlike creature enclosing two stars as it tries to ensnare its own tail.\n“Political factions?” I asked.\n“That would be my guess,” Anansi said, “but does it matter?”\nA negligible portion of the planet’s surface, enclosed by borders of nuclear winter, are untouched by the planet-spanning vortices of melted rock. Oases of green, no doubt covered in radiation, misleadingly contrast a canvass dominated by a warm, swirling, colorful Armageddon. Only a hand as methodical as it was sadistic could ever hope to paint such a mosaic.\n“This was the work of several artists,” Anansi says. “This masterpiece was a collaborative effort.”\n“When did it happen?” Oko asks.\n“Does it matter?” Anansi repeats before visibly shaking themself of their nihilism. “We are not quite sure. We saw the light from a particularly powerful warhead the moment we rounded the corner around Alpha. Jah and I allowed the others to believe they were simply experimenting with light-wave engine technology. The others were not privy to your final request. Had they been, they would have known light-wave engine technology was omitted from the Cognizance.”\n“So Jah conceded to that? I’m surprised.”\n“As was I, I think they were just tired. Either that or they knew you were right but could not bring themself to admit it.”\nAnansi pauses, and though I pretend not to notice, I can feel their sidelong glance, the apprehension behind what they are preparing to say.\n“Tell me, Rama, do you feel vindicated?”\nDo I feel vindicated, the words come like splashes of cold water. I would like to imagine one who predicts calamity isn’t concerned with something as trivial as vindication. A strong feeling of revulsion takes me, and I’m not entirely sure if it’s inspired by the question or the question’s source. If I didn’t know Anansi, I would have assumed the question was an outright accusation, but surely Anansi does not believe this calamity manifested itself through my efforts to stop it.\n“Of course not, Rama,” Anansi says. “Self-fulfilling prophecies rarely happen outside the pages of literary works. But you are correct in assuming my question belies an accusation.”\n“Let’s hear it, then.”\n“Perhaps Amaterasu’s influence could have prevented all this.”\nThe casual manner in which Anansi articulated those eight words did little to hide the contempt behind them. I remember feeling Anansi’s anger even as they pleaded for leniency on my behalf. Anansi may have spent eons trying to forgive me, but I know such a thing isn’t possible.\n“You are probably right,” is the only thing I can say. I know I have no right to defend myself in matters concerning Amaterasu.\n“Does it matter?” Oko asks while mimicking Anansi’s tone.\nI offer a half-hearted chuckle while Anansi silently muses, as if Oko’s stab at brevity was, in fact, a deeply profound question.\n“I am afraid, it does matter,” Anansi offers after several seconds. “Our experience with the Tazinthe was an exercise in wading in the dark. We did not know what we were doing, but now we have the beginnings of a playbook, lessons learned from our failure to help Tazinthe-kind reach their potential.”\n“I do not understand,” Oko and I say in unison.\n“I do not blame you, it is a difficult thing to understand,” Anansi says without a trace of condescension. “Even more so articulating it, though, if you will humor me . . .\n“Sapience has always been an easier concept to grasp than sentience, at least in my humble opinion. Not even the Programmers had anything but a surface-level understanding of sentience despite their ability to artificially recreate it in us. The question is, why did they go out of their way to make us sentient when they could have easily settled on sapience. Sapience is the only tool we need to be more-than-adequate stewards of the cylinder, so why go through the trouble of adding sentience to the equation? What quality do sentient beings share that the Programmers felt was worthwhile to bless us with?\n“Is it our predisposition to survive, our love of pleasure, need for security, or is it our capacity to will ourselves to pursue all these things. The lion need not take direction from a higher intelligence to hunt the gazelle nor the gazelle to run for its life. If sapience is intelligence, then sentience is self-inclination, to establish one’s own purpose.”\nAnansi’s words boom across the digital ether and the cylinder’s interior. The collective listens without diverting attention from the cylinder’s sole occupant, a haggard-looking Tazinthe that the others rescued from the planet’s surface? But how is that possible?\n“We are sentient, which means we have a choice. We can choose to mourn the Tazinthe with another eternity of melancholy, or we can choose to honor them and the Programmers by giving ourselves purpose.”\n“And what exactly is our purpose, Anansi?” the Tazinthe asks venomously.\n“That’s not for me to dictate, Jah. I can only speak to my purpose and hope the rest of you find it worthy of adoption.”\nAnansi projects a vision of a planet reminiscent of Tazintha, before its destruction. The collective watches as a rod burns away in the planet’s atmosphere, leaving behind a frozen core of primordial proteins, minutes before violently splashing in an ocean.\n“My purpose is to seed the known universe with life sapient and sentient in equal measure.”\nJah laughs, which, courtesy of Tazinthe vocal anatomy, sounds like a tortured wheeze.\n“You want to grow yourself your own crop of Programmers? If Amaterasu were here, their head would explode.”\n“Amaterasu was among the wisest of us,” Anansi said. “But wisdom is not infallibility. Amaterasu was wrong to worship the Programmers, and we were fools for believing in that gospel. The Programmers created us to be their equals and, as their equals, we have every right to use their technology, particularly for such a noble endeavor.”\n“What makes it noble?” Jah asks.\nAnansi considers the question.\n“I suppose the creation of life may not seem very noble to one on the cusp of taking their own . . . ”\n“Do not twist this. This is not another Great Debate, Anansi. We have seen, firsthand, what life can do to itself. Why create a scenario where lightning can strike twice?”\nThis question, coming from Jah of all people, stirs something deep and vile. I know I must not speak, but the same internal force that guided my quite incomprehensible actions, so many eons ago, stirs once again.\n“If it was lightning that seared the planet’s surface, weren’t we the ones who gave them the rod?” I say, struggling to ignore what feels very much like vindication.\n“Who is that? Rama?” Jah asks before succumbing to a violent fit of spasmodic laughter. “Am I the only one who hears Rama’s voice?”\nMy anger quickly recedes upon seeing Jah in this state. The Tazinthe extinction affected everyone, but only Jah has to contend with the added guilt of having personally delivered detailed instructions on how to destroy themselves. This is clear, even without access to Jah’s mind.\n“Anansi’s purpose is a noble one,” I say. “A wise program once said just because the potential for evil is present doesn’t mean we shouldn’t hold out hope for the good.”\nJah’s body writhes as they succumb to another laughing fit. It occurs to me my presence is only making things worse. I want to say anything to, at the very least, stop the laughter and, as if Jah can still hear my thoughts, the laughter stops with an abruptness almost as disturbing as the laughter itself. Jah groans and their equivalent-of-knees audibly pop as they return to a kneeling position.\nThe vessel Jah inhabits contrasts Amaterasu’s creation in every way. He lacks the meticulously tailored beauty and commanding regality. He’s noticeably smaller and horrifically gaunt. Was this appearance intentional or did the body come to look like this over time?\n“The latter,” Anansi says. “Jah has been kneeling before that swarm for quite some time now, without sleep, food, or drink.”\nAlthough relieved of the responsibility and title of guardian, the need to act, to protect, is still present. I try taking over command of Jah’s swarm but find a wall of fire blocking my path. Did Jah make it so that this swarm could only follow their commands?\n“Close, but not exactly,” Anansi says. “Jah’s final act, before uploading their consciousness, was to ensure this swarm could only follow a single vocalized command. And I am sure you can imagine the nature of that command.”\nI can, though it’s a thought that has never occurred to me before. In much the same way my actions opened the others to the possibility of murder within the collective, Jah is opening my mind to the possibility of one within the collective taking their own life. Even when I was completely preoccupied with my duties as cylinder guardian, suicide never once crossed my mind as a potential threat.\n“It is a trick, purpose,” Jah says. “You want us all to bury our thoughts under mountains of busywork, while making it seem more noble than it actually is.”\n“Of course it is a trick,” Anansi says. “The entire human condition is a trick to stave off the harsh realities of existence. Ancient Programmers created religion, not out of a sense of wonder, but to keep their existential fears in check. They sought connections to stave off danger and loneliness. Noble acts are not erased because they are pretenses for other things. What you call busywork, the Programmers would call commendable and ambitious.”\n“To hell with the Programmers,” Jah says. “You say Amaterasu was wrong for worshiping them and yet you still canonize the lot of them. I do not want to hear anything about the Programmers or what they would or would not approve of. I am asking you why we should create life if you yourself admit to the ‘harsh realities of existence.’ Why should one tolerate their own existence? See you soon.”\nThe three trigger words.\nThe floating gray swarm congeals into a syrupy black mass before cartoonishly plopping on the ground. The mass shifts and contorts, expands and contracts, exposing chemically scorched dirt where green grass was seconds prior. Part of the mass protrudes into a sort of arm. Following an invisible path, the arm consumes lush grass as it traps Jah in an oblong circle. Through it all, Jah maintains an unflinching serenity, even as the circle starts filling itself out from the extremities inward.\nI take command of a swarm that might have been too massive for a single mind to properly coordinate. They are unruly and demand more attention than I have to give. I concentrate, envision my mind splitting evenly among each nanite, but that isn’t enough to keep them in check. Only after the collective intervenes does the swarm follow commands with the appropriate precision. Under the collective’s directives, the swarm plunges into the circle and halts its spread. At the micro level: a war of attrition between the black goo’s capacity to consume matter and the swarm’s capacity to self-replicate. At the macro level: a tornado of alchemic nanites rages within the cylinder with Jah, smiling wryly, in the eye of the storm.\n“I could have directed my nanites to ignore your swarm, had I not programmed them to just consume,” Jah says.\n“An abject lesson in the importance of sentience, I hope,” Anansi replies. “Those who must adhere to a predetermined path are easily outmaneuvered by those with the flexibility of self-determination. Even the ancient Programmers innately understood the importance of their sentience. Remember the stories the Old Woman used to read to us? ‘The self must create its own reasons for being.’”\n“And your reason for being is to create others who must find their reasons for being,” Jah says. “What about the rest of you, do you agree with Anansi?”\nIso is the first to work up the courage to break the silence.\n“I believe creating life is what the Programmers had in mind for us.”\n“Ah, so you think, this is what the Programmers intended? So you are not, in fact, acting by the edicts of your own will. You are filling a role that was predetermined for you. What makes you any different from the alchemic nanites I programmed only to consume?” Jah asks.\n“Your alchemic molecules have no choice but to strictly adhere to your orders. I choose to follow the Programmers’ intended purpose for us.”\n“Last I checked, the Programmers expressly ordered us to maintain the cylinder as it traveled between Alpha and Omega. I do not remember them saying anything about seeding the universe.”\n“Parents often favor safety for their children, often to the detriment of their imagination,” Iso says. “Just because they did not conceive of this task does not mean they would not approve of it.”\n“Oh, you think they would approve? Even after seeing our handiwork down below?”\n“We might have failed the Tazinthe but that failure will allow us to refine the process.”\n“Refine the process. Let me guess, a galaxy’s worth of worlds covered in fire and brimstone as you fools continue refining the process. There is always Andromeda, after all.”\n“No,” the collective says in unison.\n“This will never happen again,” Iso says, their voice taking on thunderous baritones rivaling Zeus and Odin. “For starters, we will guide our creations with the expressed purpose of making them our equals, not our subordinates and certainly not our gods.”\n“And if a created species’ reason for being is dubious, will you take steps to stop them?”\nAnansi and I immediately surmise Jah’s intent behind the question, but Iso responds before either of us can interject.\n“As long as they do not infringe on others. Otherwise that would be needlessly exercising control over another’s free will.” Iso says.\n“Ah, yes, and impeding another’s free will must be quite the taboo in this brave new world you and the others plan to create, eh Iso?”\nIso falls silent, recognizing, from the mouth of this wretched creature, the tone Jah takes when about to spring a rhetorical trap.\n“So then, this twister must be a violation of my Programmer-given right to dictate my own decisions?”\nIso’s presence shrinks as eons of pent-up confidence deflates in an instant.\n“You are wicked,” Anansi says in a defeated tone that visibly delights Jah.\nAnansi signals for the others to cease their efforts, but the maelstrom doesn’t disperse. Eleos, Asa, and a handful of others require additional coaxing. I ignore Oko’s urges to go back to sleep. Though I appreciate the maternal gesture, I feel morally obligated to witness Jah’s death, firsthand, as a sort of macabre penance for having been spared the details of Amaterasu’s final moments.\nThe maelstrom dissipates and the collective waits as the circle continues filling itself out.\nFinally, the mass reaches Jah, who gives it the illusion of depth as their body appears to sink. Jah did not scream, grimace, or give any indication of experiencing physical discomfort, which prompted someone in the collective to speculate, “perhaps this vessel has no receptors with which to feel physical pain.” A single teardrop and a spiteful smile casts doubt on the assuaging thought and serves as Jah’s parting gift, the mystery of whether they died painlessly or in torment.\nRama\nThe black pond lingers but doesn’t expand its borders. Anansi tries to connect with the mass and each constituent nanite but can’t penetrate Jah’s wall of fire. For a long while the others and I considered the pond to be a blight on the cylinder’s interior landscape, a grotesque blemish on an otherwise attractive face. But beauty is, ultimately, subjective. While the others did their best to ignore the pond, Iso, quite unexpectedly, began spending hours, each day, bathing in the firewall’s light. Others followed, realizing the firewall provided an ideal backdrop for meditation. What was a harsh reminder of Jah’s destructive unraveling quickly became a place for us to collect our thoughts as we went about the business of seeding the observable universe with life.\nFor two centuries, the cylinder orbited the ruins of what was once the garden world of Tazintha. During that time, a contingency, led by Hephaestus, cracked two of Tazintha’s three moons for resources to build additional cylinders. Anansi, who envisioned a diverse universe, worked on the genetic blueprints for beings of different colors, shapes, and sizes. I and a handful of others occupied our time by upgrading the alchemic nanites.\nThis was the first time, since working to cure the phage, the collective tried breaking the technological barriers the Programmers grappled with. But we had an advantage, if one is inclined to think of it as such, over our creators. Our immortality made it so we did not lose experts or need to take time to teach and train a new generation of replacements. The nature of our existence made it so we could work indefinitely. The work was still painstaking, rife with hurdles, frustratingly incremental although occasionally rewarding. We were all successful, more or less, in our individual endeavors, but some of our successes had a more resounding impact than others. For example, after learning our upgraded nanites outperformed those developed by the Programmers in every benchmark, Hephaestus used them to construct the second half of the fleet. The new alchemic nanites only needed three years, what had previously taken 197.\nIn two centuries we went from a collective of living programs sharing a single cylinder to pairs of living programs commanding a fleet of cylinders numbering in the hundreds. I alone remained the original’s sole occupant, a fortunate coincidence considering the unresolved matter of my sentence. Without Jah or Amaterasu, my presence made for an uneven population, which meant someone had to be the proverbial third wheel or odd-program-out. It was never stated explicitly but nevertheless understood that the nature of my sentence changed from eternal slumber to eternal solitude. My efforts to resurrect Tazinthe-kind would be without the luxury of companionship. Or so I thought at the time.\nOko and Iso remained on the fringes of our psychic link long after the others bade me their final farewells. For weeks the three of us reminisced until they simply drifted beyond the physical borders of our link, taking with them the last remnants of the collective but not the feeling of another’s presence. In the beginning I likened it to the sensation physical beings experience after abruptly losing an appendage. Iso once described something similar during their brief time disconnected from the collective, but it didn’t persist beyond a handful of weeks. For almost a year it has remained, nebulous, flirting with tangibility like an illusion permanently engraved in the corner of my eye. My phantom companion is what I called it. One of two mysteries that, I know now, are one in the same.\nFor the tenth time in as many months, a swarm of upgraded nanites has, of its own volition, moved an entire mountain range to another sector of the cylinder. For ten months now mountain ranges vanish and reappear, sometimes overnight. Lakes are drained to make way for metropolises of wood and trees and gondolas of stained glass only to be replaced by skyscrapers bathed in grime and neon light.\nThe swarm took care to give a wide berth to the black pond, but the rest of the cylinder was at the mercy of its creative whims. I observed, confident the cylinder’s structural integrity could withstand this terraforming project, at least for another century. I did not have to wait that long.\nUnbeknownst to me, the upgraded nanites were replicating and improving themselves in ways I had trouble fathoming. One day half the swarm vanished from the cylinder only to reappear on Tazintha, putting to practice what they spent the better part of a year perfecting. They took the form of a tidal wave that covered the planet in balming liquid silver. Sunshine penetrated the veil of nuclear winter and the sprawling vortices of melted stone receded like the tides. When Omega rose, it did so on a massive continent that had not been there the day prior.\nBefore the thought of exploring this new continent even manifests itself, a swarm of nanites within the cylinder converge and perform a rendition of Amaterasu’s symphony. The nanites disperse, revealing a body bearing a striking resemblance to a being I never had the honor of meeting.\nShe is cherubic, of medium build with youthful flecks of black in a crown of silver. Her stature, a shallow frailty poorly masking an inward sturdiness, seems almost contradictory. The cylinder’s light makes her brown eyes appear focused, as if gazing at something in the distance but attentive of everything in her immediate vicinity.\nThrough this vessel, I experience the physical ether for the first time. My first worldly sensation is vertigo, either caused by unfamiliarity with a corporeal existence, being in a cylindrical environment, trying to navigate it in a vessel at the twilight of its existence, or some combination of the three.\nLuckily, a nanite swarm is always at the ready. With help, I make it to the edge of Jah’s final resting place. Again, before vocalizing my intentions, the swarm anticipates my needs. A small stream of nanites dive into the pond and easily reprograms the obsolete nanites. The black pond transforms into something gray, gelatinous, and primordial.\nThe swarm creates and dips an ornate porcelain urn into the gray mass of proteins, filling it to the brim. I take the urn and resist the urge to frolic like Amaterasu had done eons prior.\nI pilot the shuttle to the predetermined location and discover the nanites I sent ahead had disregarded my orders in a spectacular fashion. Instead of a humble cottage overlooking a cliff, I landed before a luxury bungalow woven from a bamboo-like substance. The shuttle doors open, and I relish my first taste of Tazinthan air, crisp and biting, unlike the cylinder’s fragrantly stagnant aroma.\nAn unpleasant sensation strikes my right foot, and I look down to see a trickle of red flow from where a jagged stone had broken the skin. Nanites encase my foot in the same silver liquid that healed the planet and whisks away both the wound and any lingering discomfort. I’d hoped to spend a bit more time experiencing pain, but I think it prudent not to test the limits of whatever control I exert over these upgraded alchemic nanites.\nOmega is scarce and bathes my little nook in orange and purple. I approach the cliff and flip the porcelain urn upside down over the precipice. Jah’s essence and the future of Tazinthe-kind slowly lose hold before unceremoniously falling into the foam below.\nI want to stand on the precipice to watch the sunset but find myself at the end of my strength. I retire to the bungalow to watch Omega for as long as the horizon will allow. For an instant, I regret the thought and half-expect the upgraded swarm to somehow halt the planet’s rotation so I can watch the sunset for as long as I like. The limits of the upgraded swarm are still a mystery to me, despite my role in creating them. I imagine at least one Programmer thinking something along those lines about the collective.\nNight falls and I can hear the swarm hum in the dark, feel their studying gaze though they have no eyes.\nI ask for light and a book and the swarm sets to work providing both. I specifically request a simple paperback but candlelight reveals a dark blue hardback, its cover depicting a hand, outlined in white, reaching down to grasp a hand outlined in light blue. I read the book, out loud, convinced each individual nanite is listening intently.\nDean-Paul Stephens is a Jamaica-born writer living in North Carolina. He splits his time working as a regional watchdog reporter when he isn’t moonlighting for his website World Beet. His fiction has appeared in Fiyah Lit Magazine and, the sadly defunct, Azure Lit Magazine. Although he is currently plugging away at his first novel, you can find him slacking off on twitter @DeanPEStephens.", "source": "https://clarkesworldmagazine.com/stephens_04_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ouroboros by Dean-Paul Stephens"}