{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason S Ridler", "hostname": "clarkesworldmagazine.com", "date": "2003-11-05", "categories": "", "tags": "", "fingerprint": "BDGWDk9Kuen+7Gb2kk7Smaonp9o=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Frankenstein's Soldier: David Morrell and the Creation of Rambo  Monsters are constructed from the passions of their age. In Mary Shelley’s 1818 novel Frankenstein, Dr. Victor Frankenstein creates life out of corpses using arcane science that defies the natural world. The creature comes to life but is an abomination to its creator, who abandons it to a world that will despise him. When Victor betrays the creature's trust, refusing to make a mate, the monster destroys everything Victor loves and forces him on a death race across the ice floes of the Arctic. In processing gothic obsessions and her own tragedies as the mother of stillborn children, Shelly created a modern fable of horror and one of the greatest symbols of the dark side of human ambition and cruelty.  In 1960s America, on the campus of Penn State, a kindred spirit to Frankenstein’s monster was born, a creature of darkness and sympathy. His ingredients included the passions of the age (war, violence, tragedy) and also the unique influences of its author: daring TV shows, Ernest Hemingway, pulp science fiction writers and respected men of letters, Socrates, and America’s war hero, Audie Murphy. From such materials came the literary creature known as Rambo. His Frankenstein is Dr. David Morrell.  Political opinions should not be shared. Political activities were forbidden. And an oath of loyalty had to be signed. These were the requirements for a foreigner wanting temporary residence in the US in 1966. If David Morrell refused or disobeyed, he’d be thrown out of graduate school at Penn State and sent back to his native Canada. So he accepted the government's terms and entered a country seething with dissenting political opinion, growing political activity, and intergenerational acts of defiance. From these elements would emerge a symbol, a product of American dissent and the violence of war, rooted in the imagination of a quiet Canadian.  Like Dr. Frankenstein, Morrell bears little resemblance to the killing machine he birthed. It is one of Rambo’s great personal ironies that his father had the misfortune of coming from a sleepy city in a proud but dour nation. But such appearances can be deceiving. Morrell was born on April 24, 1943 in Kitchener, Ontario. His father died during World War II, and his widowed mother could not care for him. At four years old, he entered an orphanage. Boarding homes followed until his mother remarried and reclaimed her son. Morrell was a restless teen and TV was his salvation. He’d burn out his eyes watching the worlds outside of Kitchener, stories and adventures in fiction and reality. In 1962, at seventeen years old, Morrell was hooked on Route 66, a pioneering show about two friends traveling the US in a dapper convertible and getting into trouble, from crooked juries and family inheritance schemes to mine collapses and pregnancies on Native land. Route 66 was littered with famous and soon-to-be famous co-stars like Buster Keaton, Robert Redford, and William Shatner. When actor George Maharis left the series in season three, his character was replaced with Lincoln “Linc” Case (played by Glenn Corbett), a former Army Ranger with one tour in Vietnam. Linc was perhaps the “first continuing character in a US network TV show who reflected the emerging Vietnam experience.”  Vietnam was meaningless to Morrell, but Route 66 opened his mind. The credits claimed the show he loved was written each week by a writer with the audacious name of Sterling Silliphant. People wrote scripts and got paid to write them? That was it. Morrell would become a writer and get the hell out of Kitchener. Silliphant’s blending of action and emotional drama would be his model. Morrell wrote his hero and, amazingly, Silliphant answered with two pages, single-spaced, giving Morrell the encouragement he needed.  The short version: write. Keep writing. Don’t stop. It takes time and effort. You can eventually make it. “Eventually you’ll find other people who want to be writers. You’ll trade ideas with them. You’ll critique one another’s work. Keep writing. When you think you have something of merit, send it out. Chances are, the first items you submit won’t be accepted, but you can’t be discouraged. Keep writing. One day, if you have something of promise to say, somebody somewhere will see it and become excited and help you. It is just that simple, and that’s terribly difficult.” Compared to summers grinding Styrofoam containers at a factory job and being chained to the fender machines at the local car plant, being a writer seemed like heaven.  Morrell enrolled in the BA Literature program at St. Jerome College to expedite his literary education. His world of literature grew. Socrates, Rimbaud, and most of all, Ernest Hemingway captivated him. In particular, Philip Young’s work on Hemingway, written in the tough vernacular of his subject, convinced Morrell to get a graduate degree in literature. Morrell needed a day job before he could sell his words, and being a literature professor seemed a good match. Silliphant could be an inspiration, but Young could be a mentor. So, with his BA complete and his future still uncertain, Morrell signed on for grad school in the US, where he wrote an MA on Hemingway’s style. All the while, Vietnam crept deeper and deeper into America’s consciousness. Including Morrell's.  “The only time I’d heard about Vietnam was three years earlier in a 1963 Route 66 episode,” he recalled, “ . . . about a US soldier who returned from Vietnam (wherever that was) and had trouble shutting down his war mentality . . . In Canada, I’d never paid attention to the bits about the war. It simply wasn’t on my radar.” Canada’s role in Vietnam had been minor, and not combat.  US involvement began in the dwindling days of French control of Indochina. With the French defeat at Dien Bien Phu in 1954 and the creation of two Vietnams, Washington found itself advisor to a new country recast in a Cold War context, yet saddled with the challenges of imperialism and the aftermath of its violence. A string of setbacks and successes cumulated when South Vietnam’s President Diem was assassinated by his own army in 1963, with the full knowledge of President John F. Kennedy. With the Gulf of Tonkin incident of 1964, President Lyndon Johnson was allowed to authorize the deployment of US troops without declaring war. Morrell arrived in the US when there were nearly 400,000 US troops deployed to Vietnam. Draftee tours lasted two years. These soldiers fought a difficult jungle war against a phenomenally dedicated enemy on its own turf and with two decades of experience and victories against the Japanese, the French, and now the American-backed South Vietnamese. Even with American firepower, the guerrilla war on the ground was often brutal, full of terror, confusion, elusive enemies, and suspect allies. Despite some tactical innovations and successes, the US wasn’t sure what kind of war it was fighting. The price for such uncertainly was in the lives of civilian and military dead and wounded, and the mental health of the returning soldiers. Many who returned to the US hoped education would provide a brighter future.  Six veterans of jungle warfare in Southeast Asia ended up in Morrell’s composition classroom, “where they had major problems accepting me as an authority figure. We were all in our early 20s, but they’d been risking their lives in a far-off jungle. As far as they were concerned, I was a draft dodger. Their hostility was strong enough that I asked for an after-class meeting.” Morrell told them about his family and foreign origins and his desire to help. They relaxed and opened up about their war and its aftershocks. Nightmares. Loud noises cranked out sweat and made them dive for cover. These men were angry. They were frustrated. They were scared. They were certainly suffering from post-traumatic stress disorder, or PTSD, but that diagnostic term hid in the future. The closest term Morrell could find came from the Great War: “shell shock”: the psychological breakdown of men who endured the hell of shellfire and trench warfare too long. The trauma of war and the stigma of Vietnam wrought a potent disdain within grunts and officers alike. Morrell’s experience was echoed even in such vaulted places as the Army Command and General Staff College during and after the war. When Professor Roger Spiller taught there after the fall of Saigon in 1975, he was amazed to find the war his students had fought in wasn’t mentioned.  “For years after the war in Vietnam the college offered no courses on it, as if the school’s managers would do anything to avoid referring to the war. It might as well have been fought on Mars.” Outside the classroom, Spiller also made peace with the wild, angry vets. In return, they spoke in whispers. One had held a trench until his ammunition ran out, killing all his enemies but one. The soldier had fumbled for a pistol, but drew his knife instead. Silence filled the pause as the soldier reflected on what happened next.  “‘It was wet,’ he said quietly, ‘very wet.’” Despite their professional appearances, these men had suffered what Morrell’s students described: depression, nightmares, terror at loud sounds. But talking about it was stigma and career suicide.  Morrell was no soldier, but the library offered him at least a fighting chance to understand the veterans in his class. It was there he discovered not only shell shock, but the story of Audie Murphy, America’s most decorated soldier of World War II and winner of the Medal of Honor. The Texas native was initially denied a spot in the Navy and Marines because of his short stature, but he found a home in the Army. Murphy had an almost unnatural talent for combat. In Italy and France, he showed bottomless bravery for facing overwhelming odds, and his audacity was matched by a sure hand with a gun. He would receive thirty-four medals. His commendation for the Medal of Honor noted that in action in France, he stood alone calling artillery fire on approaching tanks. When one of his own tank destroyers was hit, he climbed aboard its burning husk and fired the .50 caliber machine gun. “He was alone and exposed to German fire from three sides, but his deadly fire killed dozens of Germans and caused their infantry attack to waver. The enemy tanks, losing infantry support, began to fall back.” Despite the Germans throwing everything they had available at him, even injuring Murphy’s leg, the one-man army held out. While his artillery direction killed many, he killed or wounded at least fifty by his own hand, and his personal body count for the war totaled a reputed 240. Murphy’s post-war career as an actor in westerns fit the image of a brave and tough man, but behind the veneer was the pain and agony of a combat survivor. Depression and nightmares stalked Murphy and led him to domestic violence and alcohol, sleeping with a gun under his pillow and waking up firing it in the dark. Murphy’s memoir To Hell and Back is a classic combat soldier’s view of war from the ground, but later in life, he wished to write about the hardship of returning home.  College campuses were hotbeds of anti-war sentiment and challenges to the old orthodoxies of the past. Civil rights, feminism, and disdain for the war in Vietnam fueled radical movements, peaceful protests, and confrontations with a dozen forms of authority, legitimate and otherwise. Violence against students by police and National Guard became commonplace, culminating in the horrors of Kent State, Ohio, where the National Guard fired on unarmed protesters and killed four and injured nine. All the while, graveyards on Morrell’s rural route back home to Canada filled with members of his generation, fatalities of Vietnam, people he wouldn't see again in class next year. Anger and defiance seethed through the zeitgeist, fueling conflict between generations, between worldviews, between war and antiwar movements and more.  Morrell began to see the world of Vietnam and the violence on campuses as eerily similar . . . but remained silent on these issues. He'd given his word. To speak out, one way or another, was to invite permanent exile from his adopted country. But the ideas of the zeitgeist would not leave him alone. His solution, though he didn’t know it at the time, lay in fiction. At Penn State, he met and was mentored by Philip Klass, a scholar who wrote satirical science fiction under the penname William Tenn. Klass, the first professional writer of fiction Morrell had ever met, saw talent in the young academic and pushed him to learn the technique of professional fiction. Morrell wrote short stories, scripts and more. But only half of Silliphant’s prophecy had come true: he stacked up rejections. No editor wanted what he had to write. Despair bloomed.  In 1968, as the Tet Offensive destroyed America’s belief that the war in Vietnam was ending, Morrell began a novel called First Blood. He imagined: what if, in the maelstrom of tension and anger in the US, one of the symbols of authority pushed around someone like Audie Murphy, someone who knew how to fight back with vicious efficiency? And what if he’d fought in Vietnam, a young-man’s war filled with guerrillas, special operations, and the blurring of the lines between war and peace, civilian and soldier, right and wrong?  Morrell wrote about a bearded, long-haired, vagrant Vietnam veteran with a special operations background, coming into conflict with a small town Police Chief, himself a veteran of the brutal Chosin Valley battle of the Korean War. Their conflict escalates into a war between generations, worldviews, and war-fighting technique. The common thread is how anger destroys their ability to relate to one another. The result is carnage. When the soldier’s former CO is brought in, Morrell purposely names him Captain Sam Trautman: metaphorically, “Uncle Sam” has come to stop the monster it created. The name Morrell gave his veteran protagonist came from serendipity. Morrell’s wife bought apples from a local orchard that were delicious. Morrell asked their name, which he initially misheard as Rimbaud, the French poet-soldier. His wife corrected him. “Rambo.”  But the novel sprawled into a messy draft that pitted the entire town against one man, and a year later, like Frankenstein after making his monster, Morrell abandoned the novel. Instead, he focused on his dissertation on American novelist John Barth, convinced he’d never hack it as a commercial writer. It had been nine years since Route 66 had pulled him out of a haze and given him purpose, and he seemed no further along than when he started. But, when the dissertation was complete, Morrell did what Frankenstein did not: he returned to his monster and rescued him from the fire.  The draft had value. It just needed skinning. The plot was streamlined. The narrative switched between Rambo and Police Chief Teasle, each POV being given equal weight. Morrell had been inspired by a line from The Last Days of Socrates, where the Greek philosopher noted that “no one commits evil intentionally. I’m not sure he’s right about that, but he makes a good point. Most of us have a rationalization for our behavior. I might be appalled by what someone else does, but that person will provide all sorts of reasons for what he or she considers a justifiable act.” Morrell wrote it with the intent to give readers the thrill of seeing both points of view. But it was clear that sympathy lay with the frenzied and frustrated Rambo.  On May 28, 1971, a plane crash in Virginia killed not only Audie Murphy but his future memoir about surviving the trauma of war. That June, Morrell finished the final draft of First Blood. The novel was bought and published the next year. The next year, the novel was published and Rambo was let loose in popular culture.  And not even death in that novel could stop him. Instead, he became the icon of American violence at war, heroic and damned, unstoppable and doomed, patriot and dissident, through four movies, with a fifth on the way, children’s television, theatrical productions, film homage, his own brand of knives, and more.  There are now doubts that the next Rambo film will be made, but if there’s one thing you can bank on, it is this: Rambo will return. Whether you like it or not.  Further Reading  Paul Bridle, Canada and the International Commissions in Indochina, 1954-1972. (Toronto: Canadian Institute of International Affairs, 1973).  David Morrell, Me and Rambo: The Story Behind the Story (MEI Publishing, 2012, Kindle Edition):  David Morrell, The Successful Novelist, author notes at http://pabook.libraries.psu.edu/palitmap/bios/Morrell__David.html  Audie Murphy, To Hell and Back (New York: Holt Publishing, 2001; originally published in 1949).  John Prados, “JFK and the Diem Coup,” National Security Archive (5 November 2003).  Nat Segaloff, Sterling Silliphant: The Fingers of God; The Story of Hollywood's Hottest Writer Who Rode Route 66, Mastered Disaster Films, and Lived His Life Like It Was a Movie (BearManor Media, 2013), 33-34.  Mary Shelly, Frankenstein, or, the Modern Prometheus (London: 1818).  Roger Spiller, In the School of War (Lincoln and London: University of Nebraska Books, 2010).  Philip Young, Ernest Hemingway: A Reconsideration (Penn State University Press: 1965). Jason S. Ridler is a writer, improv actor, and historian. He is the author of A Triumph for Sakura, Blood and Sawdust, the Spar Battersea thrillers and the upcoming Brimstone Files series for Night Shade Books. He's also published over sixty-five stories in such magazines and anthologies as The Big Click, Beneath Ceaseless Skies, Out of the Gutter, and more. He also writes the column FXXK WRITING! for Flash Fiction Online. A former punk rock musician and cemetery groundskeeper, Mr. Ridler holds a Ph.D. in War Studies from the Royal Military College of Canada. He lives in Berkeley, CA.", "text": "Non-Fiction\nFrankenstein's Soldier: David Morrell and the Creation of Rambo\nMonsters are constructed from the passions of their age. In Mary Shelley’s 1818 novel Frankenstein, Dr. Victor Frankenstein creates life out of corpses using arcane science that defies the natural world. The creature comes to life but is an abomination to its creator, who abandons it to a world that will despise him. When Victor betrays the creature's trust, refusing to make a mate, the monster destroys everything Victor loves and forces him on a death race across the ice floes of the Arctic. In processing gothic obsessions and her own tragedies as the mother of stillborn children, Shelly created a modern fable of horror and one of the greatest symbols of the dark side of human ambition and cruelty.\nIn 1960s America, on the campus of Penn State, a kindred spirit to Frankenstein’s monster was born, a creature of darkness and sympathy. His ingredients included the passions of the age (war, violence, tragedy) and also the unique influences of its author: daring TV shows, Ernest Hemingway, pulp science fiction writers and respected men of letters, Socrates, and America’s war hero, Audie Murphy. From such materials came the literary creature known as Rambo. His Frankenstein is Dr. David Morrell.\nPolitical opinions should not be shared. Political activities were forbidden. And an oath of loyalty had to be signed. These were the requirements for a foreigner wanting temporary residence in the US in 1966. If David Morrell refused or disobeyed, he’d be thrown out of graduate school at Penn State and sent back to his native Canada. So he accepted the government's terms and entered a country seething with dissenting political opinion, growing political activity, and intergenerational acts of defiance. From these elements would emerge a symbol, a product of American dissent and the violence of war, rooted in the imagination of a quiet Canadian.\nLike Dr. Frankenstein, Morrell bears little resemblance to the killing machine he birthed. It is one of Rambo’s great personal ironies that his father had the misfortune of coming from a sleepy city in a proud but dour nation. But such appearances can be deceiving. Morrell was born on April 24, 1943 in Kitchener, Ontario. His father died during World War II, and his widowed mother could not care for him. At four years old, he entered an orphanage. Boarding homes followed until his mother remarried and reclaimed her son. Morrell was a restless teen and TV was his salvation. He’d burn out his eyes watching the worlds outside of Kitchener, stories and adventures in fiction and reality. In 1962, at seventeen years old, Morrell was hooked on Route 66, a pioneering show about two friends traveling the US in a dapper convertible and getting into trouble, from crooked juries and family inheritance schemes to mine collapses and pregnancies on Native land. Route 66 was littered with famous and soon-to-be famous co-stars like Buster Keaton, Robert Redford, and William Shatner. When actor George Maharis left the series in season three, his character was replaced with Lincoln “Linc” Case (played by Glenn Corbett), a former Army Ranger with one tour in Vietnam. Linc was perhaps the “first continuing character in a US network TV show who reflected the emerging Vietnam experience.”\nVietnam was meaningless to Morrell, but Route 66 opened his mind. The credits claimed the show he loved was written each week by a writer with the audacious name of Sterling Silliphant. People wrote scripts and got paid to write them? That was it. Morrell would become a writer and get the hell out of Kitchener. Silliphant’s blending of action and emotional drama would be his model. Morrell wrote his hero and, amazingly, Silliphant answered with two pages, single-spaced, giving Morrell the encouragement he needed.\nThe short version: write. Keep writing. Don’t stop. It takes time and effort. You can eventually make it. “Eventually you’ll find other people who want to be writers. You’ll trade ideas with them. You’ll critique one another’s work. Keep writing. When you think you have something of merit, send it out. Chances are, the first items you submit won’t be accepted, but you can’t be discouraged. Keep writing. One day, if you have something of promise to say, somebody somewhere will see it and become excited and help you. It is just that simple, and that’s terribly difficult.” Compared to summers grinding Styrofoam containers at a factory job and being chained to the fender machines at the local car plant, being a writer seemed like heaven.\nMorrell enrolled in the BA Literature program at St. Jerome College to expedite his literary education. His world of literature grew. Socrates, Rimbaud, and most of all, Ernest Hemingway captivated him. In particular, Philip Young’s work on Hemingway, written in the tough vernacular of his subject, convinced Morrell to get a graduate degree in literature. Morrell needed a day job before he could sell his words, and being a literature professor seemed a good match. Silliphant could be an inspiration, but Young could be a mentor. So, with his BA complete and his future still uncertain, Morrell signed on for grad school in the US, where he wrote an MA on Hemingway’s style. All the while, Vietnam crept deeper and deeper into America’s consciousness. Including Morrell's.\n“The only time I’d heard about Vietnam was three years earlier in a 1963 Route 66 episode,” he recalled, “ . . . about a US soldier who returned from Vietnam (wherever that was) and had trouble shutting down his war mentality . . . In Canada, I’d never paid attention to the bits about the war. It simply wasn’t on my radar.” Canada’s role in Vietnam had been minor, and not combat.\nUS involvement began in the dwindling days of French control of Indochina. With the French defeat at Dien Bien Phu in 1954 and the creation of two Vietnams, Washington found itself advisor to a new country recast in a Cold War context, yet saddled with the challenges of imperialism and the aftermath of its violence. A string of setbacks and successes cumulated when South Vietnam’s President Diem was assassinated by his own army in 1963, with the full knowledge of President John F. Kennedy. With the Gulf of Tonkin incident of 1964, President Lyndon Johnson was allowed to authorize the deployment of US troops without declaring war. Morrell arrived in the US when there were nearly 400,000 US troops deployed to Vietnam. Draftee tours lasted two years. These soldiers fought a difficult jungle war against a phenomenally dedicated enemy on its own turf and with two decades of experience and victories against the Japanese, the French, and now the American-backed South Vietnamese. Even with American firepower, the guerrilla war on the ground was often brutal, full of terror, confusion, elusive enemies, and suspect allies. Despite some tactical innovations and successes, the US wasn’t sure what kind of war it was fighting. The price for such uncertainly was in the lives of civilian and military dead and wounded, and the mental health of the returning soldiers. Many who returned to the US hoped education would provide a brighter future.\nSix veterans of jungle warfare in Southeast Asia ended up in Morrell’s composition classroom, “where they had major problems accepting me as an authority figure. We were all in our early 20s, but they’d been risking their lives in a far-off jungle. As far as they were concerned, I was a draft dodger. Their hostility was strong enough that I asked for an after-class meeting.” Morrell told them about his family and foreign origins and his desire to help. They relaxed and opened up about their war and its aftershocks. Nightmares. Loud noises cranked out sweat and made them dive for cover. These men were angry. They were frustrated. They were scared. They were certainly suffering from post-traumatic stress disorder, or PTSD, but that diagnostic term hid in the future. The closest term Morrell could find came from the Great War: “shell shock”: the psychological breakdown of men who endured the hell of shellfire and trench warfare too long. The trauma of war and the stigma of Vietnam wrought a potent disdain within grunts and officers alike. Morrell’s experience was echoed even in such vaulted places as the Army Command and General Staff College during and after the war. When Professor Roger Spiller taught there after the fall of Saigon in 1975, he was amazed to find the war his students had fought in wasn’t mentioned.\n“For years after the war in Vietnam the college offered no courses on it, as if the school’s managers would do anything to avoid referring to the war. It might as well have been fought on Mars.” Outside the classroom, Spiller also made peace with the wild, angry vets. In return, they spoke in whispers. One had held a trench until his ammunition ran out, killing all his enemies but one. The soldier had fumbled for a pistol, but drew his knife instead. Silence filled the pause as the soldier reflected on what happened next.\n“‘It was wet,’ he said quietly, ‘very wet.’” Despite their professional appearances, these men had suffered what Morrell’s students described: depression, nightmares, terror at loud sounds. But talking about it was stigma and career suicide.\nMorrell was no soldier, but the library offered him at least a fighting chance to understand the veterans in his class. It was there he discovered not only shell shock, but the story of Audie Murphy, America’s most decorated soldier of World War II and winner of the Medal of Honor. The Texas native was initially denied a spot in the Navy and Marines because of his short stature, but he found a home in the Army. Murphy had an almost unnatural talent for combat. In Italy and France, he showed bottomless bravery for facing overwhelming odds, and his audacity was matched by a sure hand with a gun. He would receive thirty-four medals. His commendation for the Medal of Honor noted that in action in France, he stood alone calling artillery fire on approaching tanks. When one of his own tank destroyers was hit, he climbed aboard its burning husk and fired the .50 caliber machine gun. “He was alone and exposed to German fire from three sides, but his deadly fire killed dozens of Germans and caused their infantry attack to waver. The enemy tanks, losing infantry support, began to fall back.” Despite the Germans throwing everything they had available at him, even injuring Murphy’s leg, the one-man army held out. While his artillery direction killed many, he killed or wounded at least fifty by his own hand, and his personal body count for the war totaled a reputed 240. Murphy’s post-war career as an actor in westerns fit the image of a brave and tough man, but behind the veneer was the pain and agony of a combat survivor. Depression and nightmares stalked Murphy and led him to domestic violence and alcohol, sleeping with a gun under his pillow and waking up firing it in the dark. Murphy’s memoir To Hell and Back is a classic combat soldier’s view of war from the ground, but later in life, he wished to write about the hardship of returning home.\nCollege campuses were hotbeds of anti-war sentiment and challenges to the old orthodoxies of the past. Civil rights, feminism, and disdain for the war in Vietnam fueled radical movements, peaceful protests, and confrontations with a dozen forms of authority, legitimate and otherwise. Violence against students by police and National Guard became commonplace, culminating in the horrors of Kent State, Ohio, where the National Guard fired on unarmed protesters and killed four and injured nine. All the while, graveyards on Morrell’s rural route back home to Canada filled with members of his generation, fatalities of Vietnam, people he wouldn't see again in class next year. Anger and defiance seethed through the zeitgeist, fueling conflict between generations, between worldviews, between war and antiwar movements and more.\nMorrell began to see the world of Vietnam and the violence on campuses as eerily similar . . . but remained silent on these issues. He'd given his word. To speak out, one way or another, was to invite permanent exile from his adopted country. But the ideas of the zeitgeist would not leave him alone. His solution, though he didn’t know it at the time, lay in fiction. At Penn State, he met and was mentored by Philip Klass, a scholar who wrote satirical science fiction under the penname William Tenn. Klass, the first professional writer of fiction Morrell had ever met, saw talent in the young academic and pushed him to learn the technique of professional fiction. Morrell wrote short stories, scripts and more. But only half of Silliphant’s prophecy had come true: he stacked up rejections. No editor wanted what he had to write. Despair bloomed.\nIn 1968, as the Tet Offensive destroyed America’s belief that the war in Vietnam was ending, Morrell began a novel called First Blood. He imagined: what if, in the maelstrom of tension and anger in the US, one of the symbols of authority pushed around someone like Audie Murphy, someone who knew how to fight back with vicious efficiency? And what if he’d fought in Vietnam, a young-man’s war filled with guerrillas, special operations, and the blurring of the lines between war and peace, civilian and soldier, right and wrong?\nMorrell wrote about a bearded, long-haired, vagrant Vietnam veteran with a special operations background, coming into conflict with a small town Police Chief, himself a veteran of the brutal Chosin Valley battle of the Korean War. Their conflict escalates into a war between generations, worldviews, and war-fighting technique. The common thread is how anger destroys their ability to relate to one another. The result is carnage. When the soldier’s former CO is brought in, Morrell purposely names him Captain Sam Trautman: metaphorically, “Uncle Sam” has come to stop the monster it created. The name Morrell gave his veteran protagonist came from serendipity. Morrell’s wife bought apples from a local orchard that were delicious. Morrell asked their name, which he initially misheard as Rimbaud, the French poet-soldier. His wife corrected him. “Rambo.”\nBut the novel sprawled into a messy draft that pitted the entire town against one man, and a year later, like Frankenstein after making his monster, Morrell abandoned the novel. Instead, he focused on his dissertation on American novelist John Barth, convinced he’d never hack it as a commercial writer. It had been nine years since Route 66 had pulled him out of a haze and given him purpose, and he seemed no further along than when he started. But, when the dissertation was complete, Morrell did what Frankenstein did not: he returned to his monster and rescued him from the fire.\nThe draft had value. It just needed skinning. The plot was streamlined. The narrative switched between Rambo and Police Chief Teasle, each POV being given equal weight. Morrell had been inspired by a line from The Last Days of Socrates, where the Greek philosopher noted that “no one commits evil intentionally. I’m not sure he’s right about that, but he makes a good point. Most of us have a rationalization for our behavior. I might be appalled by what someone else does, but that person will provide all sorts of reasons for what he or she considers a justifiable act.” Morrell wrote it with the intent to give readers the thrill of seeing both points of view. But it was clear that sympathy lay with the frenzied and frustrated Rambo.\nOn May 28, 1971, a plane crash in Virginia killed not only Audie Murphy but his future memoir about surviving the trauma of war. That June, Morrell finished the final draft of First Blood. The novel was bought and published the next year. The next year, the novel was published and Rambo was let loose in popular culture.\nAnd not even death in that novel could stop him. Instead, he became the icon of American violence at war, heroic and damned, unstoppable and doomed, patriot and dissident, through four movies, with a fifth on the way, children’s television, theatrical productions, film homage, his own brand of knives, and more.\nThere are now doubts that the next Rambo film will be made, but if there’s one thing you can bank on, it is this: Rambo will return. Whether you like it or not.\nFurther Reading\nPaul Bridle, Canada and the International Commissions in Indochina, 1954-1972. (Toronto: Canadian Institute of International Affairs, 1973).\nDavid Morrell, Me and Rambo: The Story Behind the Story (MEI Publishing, 2012, Kindle Edition):\nDavid Morrell, The Successful Novelist, author notes at http://pabook.libraries.psu.edu/palitmap/bios/Morrell__David.html\nAudie Murphy, To Hell and Back (New York: Holt Publishing, 2001; originally published in 1949).\nJohn Prados, “JFK and the Diem Coup,” National Security Archive (5 November 2003).\nNat Segaloff, Sterling Silliphant: The Fingers of God; The Story of Hollywood's Hottest Writer Who Rode Route 66, Mastered Disaster Films, and Lived His Life Like It Was a Movie (BearManor Media, 2013), 33-34.\nMary Shelly, Frankenstein, or, the Modern Prometheus (London: 1818).\nRoger Spiller, In the School of War (Lincoln and London: University of Nebraska Books, 2010).\nPhilip Young, Ernest Hemingway: A Reconsideration (Penn State University Press: 1965).\nJason S. Ridler is a writer, improv actor, and historian. He is the author of A Triumph for Sakura, Blood and Sawdust, the Spar Battersea thrillers and the upcoming Brimstone Files series for Night Shade Books. He's also published over sixty-five stories in such magazines and anthologies as The Big Click, Beneath Ceaseless Skies, Out of the Gutter, and more. He also writes the column FXXK WRITING! for Flash Fiction Online. A former punk rock musician and cemetery groundskeeper, Mr. Ridler holds a Ph.D. in War Studies from the Royal Military College of Canada. He lives in Berkeley, CA.", "source": "https://clarkesworldmagazine.com/ridler_08_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Frankenstein's Soldier: David Morrell and the Creation of Rambo by Jason Ridler"}