{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Carrie Sessarego", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "lqBYfbpUxnrLmFC+E+EuDd7ej0M=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Ghosts of Christmas Past: The Victorian Christmas Ghost Story Tradition  “Marley was dead, to begin with,” says Charles Dickens in the most famous Christmas ghost story. While modern readers continue to enjoy A Christmas Carol, few are aware that it was one of hundreds of Christmas-themed ghost stories that flourished in written form during the Victorian era. These stories represented a perfect meeting of interest in science and in spiritualism, in the availability of cheap printed fiction, and in the acceptance in England of Christmas as a major holiday with customs we continue to practice today.  The tradition of telling ghost stories in the winter seems to be a very old one, referenced as far back as William Shakespeare’s A Winter’s Tale, and Christopher Marlowe’s The Jew of Malta. As Jerome K. Jerome put it in 1891:   “Whenever five or six English-speaking people meet ’round a fire on Christmas Eve, they start telling each other ghost stories. Nothing satisfies us on Christmas Eve but to hear each other tell authentic anecdotes about specters. It is a genial, festive season, and we love to muse upon graves, and dead bodies, and murders, and blood.”  However, Christmas was considered a minor holiday in England and in America at the beginning of the Victorian era, which lasted from 1837–1901 (with the careers of many authors overlapping the beginning and end of the era somewhat). Christmas celebrations were banned by the Puritan Parliament of 1647 and throughout much of the 1700s Christmas was celebrated quietly, if at all. In the absence of other festivities, winter ghost stories persisted, according to Henry Bourne, who wrote in 1725 that “nothing is commoner in country places than for a whole family in a winter’s evening to sit ’round the fire and tell stories of apparitions and ghosts.”  Regency aristocrats, who loved any excuse to throw a party, celebrated “The Twelve Days of Christmas,” with Christmas Day itself as a quiet day for family and church. They reserved the largest of the Twelve Day celebrations for January 6, the Feast of Epiphany. Regency aristocrats and gentry decorated with winter greenery, and over the course of the twelve days they enjoyed a Yule log, games, dancing, and mummery. Gift giving was minimal, and there were no Christmas trees or visits from Santa. A genteel family, such as those featured in Jane Austen’s Emma, saw the season as a sensible excuse for family visits, a dinner, and possibly a dance. As Mr. Elton observes,   This is quite the season indeed for friendly meetings. At Christmas everybody invites their friends about them, and people think little of even the worst weather.  Christmas Day was not even a day off for most people, as it was not recognized as a Bank Holiday in the UK until 1871, which is why Bob Cratchit, in 1843’s A Christmas Carol, enjoys a modest feast with his family on Christmas Eve but must hurry to work on Christmas Day.  The combined forces of Queen Victoria and Charles Dickens led to the opulent Christmas celebrations that we see today. Queen Victoria was charmed by Prince Albert’s description of a German Christmas tree, and made the custom of having a decorated tree common in England. She emphasized Christmas as a family time that included, and indeed centered, children. Gift giving became popular, and an inexpensive postal service led to the practice of sending Christmas Cards. Father Christmas, formerly a feature of adult celebrations, gradually became interchangeable with the American Santa Claus and delivered presents to good boys and girls, in accordance with his description in “A Visit from Saint Nicholas” by Clement Clarke Moore (written in 1823). Authors and artists such as Charles Dickens, Washington Irving, and Thomas Nast spread the word and popularized these new features of Christmas.  Into this atmosphere came cheap printed material—and an abundance of Christmas-themed stories for popular consumption. At this time, literacy was so sufficiently widespread that most illiterate people could find someone to read out loud for them. This was a common entertainment not only at home, but also in public houses. The 1830’s saw the advent of inexpensive serialized fiction that kept printed matter affordable and addictive as literacy continued to spread thanks to educational reforms. The tradition of telling stories at winter crystallized into a new written phenomenon.  Many periodicals sold annual collections, specially bound and suitable for gift giving, as well as special editions of Christmas stories. Charles Dickens published a weekly literary magazine called Household Words, followed by another magazine, All the Year Round. Both had extra Christmas issues for which Dickens and other authors wrote Christmas stories. The 1863 Christmas issue offered seven stories for fourpence (in today’s money, about $1.78 US dollars). Several other periodicals followed a similar practice, thus converting an oral tradition into a new written one.  This loose definition led to an amazing variety of stories, from the terrifying to the comical to the gruesome to the heartwarming. Mary Oliphant uses her sweet and touching story “The Lady’s Walk” to explore the economic and social pressures on a young woman in rural Scotland. Jerome K. Jerome’s story “The Ghost of the Blue Chamber” is hilariously funny. Louisa May Alcott’s novella The Abbot’s Ghost; Or, Maurice Treherne’s Temptation, originally published under the name A.M. Barnard, is a romance. “How Peter Parley Laid a Ghost,” an anonymous story in a children’s publication, strives to be entertaining and educational, and teaches children not to be afraid of ghosts, not even ones like the rumored:   . . . implacable figure of a White Lady, who sat on the keystone of the arch, engaged in the doleful, but tidy duty of combing her long golden hair, for the better accomplishment of which occupation the lady carried her head in her lap.  The Victorian era was one of intense tension between public fascination with science and with spiritualism, a tension that only added to the popularity of printed ghost stories and influenced their content. Charles Darwin’s theory of evolution upended science, religion, and philosophy. Naturalists, both professional and amateur, collected and studied plant and animal species across the globe. Explorers mapped the poles and astronomers mapped the skies. Arthur Conan Doyle’s Sherlock Holmes made his first appearance in “A Study in Scarlet,” which was printed in Beeton’s Christmas Annual. The Sherlock Holmes stories emphasized rational, calm, logical deduction over superstition and intuition. Anything seemed possible.  In keeping with this scientific age, many Victorian Christmas ghost stories sought to explain the seemingly supernatural phenomenon by mundane means at the end of the story. This sometimes had a preachy tone, as if to say, “How silly must one be to believe in ghosts!” Dickens makes especially hilarious fun of spiritualists in “The Haunted House,” in which an unfortunate man must share a train compartment with a spiritualist:   “You will excuse me,” said the gentleman contemptuously, “if I am too much in advance of common humanity to trouble myself at all about it. I have passed the night—as indeed I pass the whole of my time now—in spiritual intercourse.”  “O!” said I, something snappishly.  The gentleman goes on to relate the spirit’s most recent communications:   “A bird in the hand,” said the gentleman, reading his last entry with great solemnity, “Is worth two in the Bosh.”  “Truly I am of the same opinion,” said I; “but shouldn’t it be Bush?”  “It came to me, Bosh,” returned the gentleman.  The practice of spiritualism boomed during the Victorian era. Spiritualists believed that through a variety of means, mediums could facilitate communication between the living and the dead. They saw this as both a religious movement (one that championed abolition as well as rights for women) and as an extension of scientific experimentation. The very speed at which scientific discoveries and technological innovations were being made only added to the idea that a barrier between the living and the dead might quite plausibly and rationally be breached. In the words of historian Nicola Bown:   The Victorians were haunted by the supernatural. They delighted in ghost stories and fairy tales, and in legends of strange gods, demons, and spirits; in pantomimes and extravaganzas full of supernatural machinery; in gothic yarns of reanimated corpses and vampires. Even avowedly realist novels were full of dreams, premonitions, and second sight. It was not simply a matter of stories and storytelling, though, for the material world they inhabited often seemed somehow supernatural. Disembodied voices over the telephone, the superhuman speed of the railway, near-instantaneous communication through telegraph wires: the collapsing of time and distance by modern technologies that were transforming daily life was often felt to be uncanny.  In contrast to ghost stories that took great pains to establish mundane explanations, other stories were unabashedly and completely supernatural, in keeping not only with the fascination with spiritualism, specifically, but also with a general public fascination with death and with the unknown. These stories feature a wide variety of ghostly figures and creepy hallways, escaped lunatics and convicts, and musical instruments that play themselves.  More impressively, authors managed to wring chills from such mundane objects as a door knocker (A Christmas Carol, by Charles Dickens), bedsheets (“Oh, Whistle, and I’ll Come to You, My Lad,” by M. R. James), and a duffel bag (“The Kit-Bag,” by Algernon Blackwood). “The Nutcracker and the Mouse King,” by E. T. A. Hoffmann, naturally, wreaks terror with a cursed nutcracker and murderous mice, and “The Doll’s Ghost,” by F. Marion Crawford, involves a doll that says “Pa-pa.” Famous ghost story author M. R. James offered this advice on writing ghost stories:   Many common objects may be made the vehicles of retribution, and where retribution is not called for, of malice. Be careful how you handle the packet you pick up in the carriage-drive, particularly if it contains nail-parings and hair. Do not, in any case, bring it into the house. It may not be alone . . .  A Christmas Carol is by far the most famous Christmas ghost story. Published in 1843, it was an instant hit. Dickens gave public readings of the story in England and America for years, giving at least one hundred and twenty-seven performances. Dickens’ primary motivation, besides earning money for himself, was to spread awareness of the plight of the urban poor, and his book emphasized the idea of charitable giving at Christmas. It also popularized the new customs that Queen Victoria had introduced and created new ones. The book popularized the greeting, “Merry Christmas,” and the saying, “Bah! Humbug,” and demonstrated to readers that previously rural Christmas traditions could be incorporated into urban life. The book is also replete with ghosts, far many more than the Ghosts of Past, Present, and Future:   The air was filled with phantoms, wandering hither and thither in restless haste, and moaning as they went. Every one of them wore chains like Marley’s Ghost; some few (they might be guilty governments) were linked together; none were free. Many had been personally known to Scrooge in their lives. He had been quite familiar with one old ghost, in a white waistcoat, with a monstrous iron safe attached to its ankle, who cried piteously at being unable to assist a wretched woman with an infant, whom it saw below upon a doorstep. The misery with them all was, clearly, that they sought to interfere, for good, in human matters, and had lost the power forever.”  And the story is sometimes funny and sometimes touching, but often truly terrifying, as in this quote from earlier in the book:   After several turns, he sat down again. As he threw his head back in the chair, his glance happened to rest upon a bell, a disused bell, that hung in the room, and communicated for some purpose now forgotten with a chamber in the highest story of the building. It was with great astonishment, and with a strange, inexplicable dread, that as he looked, he saw this bell begin to swing. It swung so softly in the outset that it scarcely made a sound; but soon it rang out loudly, and so did every bell in the house.  This might have lasted half a minute, or a minute, but it seemed an hour. The bells ceased as they had begun, together. They were succeeded by a clanking noise, deep down below; as if some person were dragging a heavy chain over the casks in the wine-merchant’s cellar. Scrooge then remembered to have heard that ghosts in haunted houses were described as dragging chains.  The cellar door flew open with a booming sound, and then he heard the noise much louder, on the floors below; then coming up the stairs; then coming straight towards his door.  While A Christmas Carol is the best-remembered Christmas story, it was preceded and followed by dozens of others. The definition of a “Christmas ghost story” is and was a loose one. In some stories, such as “Old Hooker’s Ghost; or, Christmas Gambols at Huntingfield Hall,” Christmas celebrations are woven directly into the story and are integral to the plot. Other stories barely refer to the holiday but are still considered Christmas stories. M. R. James’ “Oh, Whistle, and I’ll Come to You, My Lad” never directly references Christmas, but takes place during a professor’s winter holiday and thus earns a lasting place in “Best Christmas Ghost Story” lists. Henry James’ “The Turn of the Screw” uses a framing device that takes place at Christmas, beginning,   The story had held us, ’round the fire, sufficiently breathless, but except the obvious remark that it was gruesome, as, on Christmas Eve in an old house, a strange tale should essentially be, I remember no comment uttered ’til somebody happened to say that it was the only case he had met in which such a visitation had fallen on a child.  While the Victorians achieved a peak level of Christmas ghost stories in written form, the phenomena of telling spooky stories in the winter season in general, and on Christmas Eve specially, preceded the era and lives on in modified form today. Now, no Christmas holiday season is complete without a winter-themed horror novel or a new Christmas-themed horror movie. These movies are modern penny dreadfuls, often shot with a small or medium budget and consumed at home for a relatively small price. It seems that the urge to stay inside, get warm, and enjoy being scared in a safe environment endures. Carrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats.", "text": "Non-Fiction\nGhosts of Christmas Past: The Victorian Christmas Ghost Story Tradition\n“Marley was dead, to begin with,” says Charles Dickens in the most famous Christmas ghost story. While modern readers continue to enjoy A Christmas Carol, few are aware that it was one of hundreds of Christmas-themed ghost stories that flourished in written form during the Victorian era. These stories represented a perfect meeting of interest in science and in spiritualism, in the availability of cheap printed fiction, and in the acceptance in England of Christmas as a major holiday with customs we continue to practice today.\nThe tradition of telling ghost stories in the winter seems to be a very old one, referenced as far back as William Shakespeare’s A Winter’s Tale, and Christopher Marlowe’s The Jew of Malta. As Jerome K. Jerome put it in 1891:\n“Whenever five or six English-speaking people meet ’round a fire on Christmas Eve, they start telling each other ghost stories. Nothing satisfies us on Christmas Eve but to hear each other tell authentic anecdotes about specters. It is a genial, festive season, and we love to muse upon graves, and dead bodies, and murders, and blood.”\nHowever, Christmas was considered a minor holiday in England and in America at the beginning of the Victorian era, which lasted from 1837–1901 (with the careers of many authors overlapping the beginning and end of the era somewhat). Christmas celebrations were banned by the Puritan Parliament of 1647 and throughout much of the 1700s Christmas was celebrated quietly, if at all. In the absence of other festivities, winter ghost stories persisted, according to Henry Bourne, who wrote in 1725 that “nothing is commoner in country places than for a whole family in a winter’s evening to sit ’round the fire and tell stories of apparitions and ghosts.”\nRegency aristocrats, who loved any excuse to throw a party, celebrated “The Twelve Days of Christmas,” with Christmas Day itself as a quiet day for family and church. They reserved the largest of the Twelve Day celebrations for January 6, the Feast of Epiphany. Regency aristocrats and gentry decorated with winter greenery, and over the course of the twelve days they enjoyed a Yule log, games, dancing, and mummery. Gift giving was minimal, and there were no Christmas trees or visits from Santa. A genteel family, such as those featured in Jane Austen’s Emma, saw the season as a sensible excuse for family visits, a dinner, and possibly a dance. As Mr. Elton observes,\nThis is quite the season indeed for friendly meetings. At Christmas everybody invites their friends about them, and people think little of even the worst weather.\nChristmas Day was not even a day off for most people, as it was not recognized as a Bank Holiday in the UK until 1871, which is why Bob Cratchit, in 1843’s A Christmas Carol, enjoys a modest feast with his family on Christmas Eve but must hurry to work on Christmas Day.\nThe combined forces of Queen Victoria and Charles Dickens led to the opulent Christmas celebrations that we see today. Queen Victoria was charmed by Prince Albert’s description of a German Christmas tree, and made the custom of having a decorated tree common in England. She emphasized Christmas as a family time that included, and indeed centered, children. Gift giving became popular, and an inexpensive postal service led to the practice of sending Christmas Cards. Father Christmas, formerly a feature of adult celebrations, gradually became interchangeable with the American Santa Claus and delivered presents to good boys and girls, in accordance with his description in “A Visit from Saint Nicholas” by Clement Clarke Moore (written in 1823). Authors and artists such as Charles Dickens, Washington Irving, and Thomas Nast spread the word and popularized these new features of Christmas.\nInto this atmosphere came cheap printed material—and an abundance of Christmas-themed stories for popular consumption. At this time, literacy was so sufficiently widespread that most illiterate people could find someone to read out loud for them. This was a common entertainment not only at home, but also in public houses. The 1830’s saw the advent of inexpensive serialized fiction that kept printed matter affordable and addictive as literacy continued to spread thanks to educational reforms. The tradition of telling stories at winter crystallized into a new written phenomenon.\nMany periodicals sold annual collections, specially bound and suitable for gift giving, as well as special editions of Christmas stories. Charles Dickens published a weekly literary magazine called Household Words, followed by another magazine, All the Year Round. Both had extra Christmas issues for which Dickens and other authors wrote Christmas stories. The 1863 Christmas issue offered seven stories for fourpence (in today’s money, about $1.78 US dollars). Several other periodicals followed a similar practice, thus converting an oral tradition into a new written one.\nThis loose definition led to an amazing variety of stories, from the terrifying to the comical to the gruesome to the heartwarming. Mary Oliphant uses her sweet and touching story “The Lady’s Walk” to explore the economic and social pressures on a young woman in rural Scotland. Jerome K. Jerome’s story “The Ghost of the Blue Chamber” is hilariously funny. Louisa May Alcott’s novella The Abbot’s Ghost; Or, Maurice Treherne’s Temptation, originally published under the name A.M. Barnard, is a romance. “How Peter Parley Laid a Ghost,” an anonymous story in a children’s publication, strives to be entertaining and educational, and teaches children not to be afraid of ghosts, not even ones like the rumored:\n. . . implacable figure of a White Lady, who sat on the keystone of the arch, engaged in the doleful, but tidy duty of combing her long golden hair, for the better accomplishment of which occupation the lady carried her head in her lap.\nThe Victorian era was one of intense tension between public fascination with science and with spiritualism, a tension that only added to the popularity of printed ghost stories and influenced their content. Charles Darwin’s theory of evolution upended science, religion, and philosophy. Naturalists, both professional and amateur, collected and studied plant and animal species across the globe. Explorers mapped the poles and astronomers mapped the skies. Arthur Conan Doyle’s Sherlock Holmes made his first appearance in “A Study in Scarlet,” which was printed in Beeton’s Christmas Annual. The Sherlock Holmes stories emphasized rational, calm, logical deduction over superstition and intuition. Anything seemed possible.\nIn keeping with this scientific age, many Victorian Christmas ghost stories sought to explain the seemingly supernatural phenomenon by mundane means at the end of the story. This sometimes had a preachy tone, as if to say, “How silly must one be to believe in ghosts!” Dickens makes especially hilarious fun of spiritualists in “The Haunted House,” in which an unfortunate man must share a train compartment with a spiritualist:\n“You will excuse me,” said the gentleman contemptuously, “if I am too much in advance of common humanity to trouble myself at all about it. I have passed the night—as indeed I pass the whole of my time now—in spiritual intercourse.”\n“O!” said I, something snappishly.\nThe gentleman goes on to relate the spirit’s most recent communications:\n“A bird in the hand,” said the gentleman, reading his last entry with great solemnity, “Is worth two in the Bosh.”\n“Truly I am of the same opinion,” said I; “but shouldn’t it be Bush?”\n“It came to me, Bosh,” returned the gentleman.\nThe practice of spiritualism boomed during the Victorian era. Spiritualists believed that through a variety of means, mediums could facilitate communication between the living and the dead. They saw this as both a religious movement (one that championed abolition as well as rights for women) and as an extension of scientific experimentation. The very speed at which scientific discoveries and technological innovations were being made only added to the idea that a barrier between the living and the dead might quite plausibly and rationally be breached. In the words of historian Nicola Bown:\nThe Victorians were haunted by the supernatural. They delighted in ghost stories and fairy tales, and in legends of strange gods, demons, and spirits; in pantomimes and extravaganzas full of supernatural machinery; in gothic yarns of reanimated corpses and vampires. Even avowedly realist novels were full of dreams, premonitions, and second sight. It was not simply a matter of stories and storytelling, though, for the material world they inhabited often seemed somehow supernatural. Disembodied voices over the telephone, the superhuman speed of the railway, near-instantaneous communication through telegraph wires: the collapsing of time and distance by modern technologies that were transforming daily life was often felt to be uncanny.\nIn contrast to ghost stories that took great pains to establish mundane explanations, other stories were unabashedly and completely supernatural, in keeping not only with the fascination with spiritualism, specifically, but also with a general public fascination with death and with the unknown. These stories feature a wide variety of ghostly figures and creepy hallways, escaped lunatics and convicts, and musical instruments that play themselves.\nMore impressively, authors managed to wring chills from such mundane objects as a door knocker (A Christmas Carol, by Charles Dickens), bedsheets (“Oh, Whistle, and I’ll Come to You, My Lad,” by M. R. James), and a duffel bag (“The Kit-Bag,” by Algernon Blackwood). “The Nutcracker and the Mouse King,” by E. T. A. Hoffmann, naturally, wreaks terror with a cursed nutcracker and murderous mice, and “The Doll’s Ghost,” by F. Marion Crawford, involves a doll that says “Pa-pa.” Famous ghost story author M. R. James offered this advice on writing ghost stories:\nMany common objects may be made the vehicles of retribution, and where retribution is not called for, of malice. Be careful how you handle the packet you pick up in the carriage-drive, particularly if it contains nail-parings and hair. Do not, in any case, bring it into the house. It may not be alone . . .\nA Christmas Carol is by far the most famous Christmas ghost story. Published in 1843, it was an instant hit. Dickens gave public readings of the story in England and America for years, giving at least one hundred and twenty-seven performances. Dickens’ primary motivation, besides earning money for himself, was to spread awareness of the plight of the urban poor, and his book emphasized the idea of charitable giving at Christmas. It also popularized the new customs that Queen Victoria had introduced and created new ones. The book popularized the greeting, “Merry Christmas,” and the saying, “Bah! Humbug,” and demonstrated to readers that previously rural Christmas traditions could be incorporated into urban life. The book is also replete with ghosts, far many more than the Ghosts of Past, Present, and Future:\nThe air was filled with phantoms, wandering hither and thither in restless haste, and moaning as they went. Every one of them wore chains like Marley’s Ghost; some few (they might be guilty governments) were linked together; none were free. Many had been personally known to Scrooge in their lives. He had been quite familiar with one old ghost, in a white waistcoat, with a monstrous iron safe attached to its ankle, who cried piteously at being unable to assist a wretched woman with an infant, whom it saw below upon a doorstep. The misery with them all was, clearly, that they sought to interfere, for good, in human matters, and had lost the power forever.”\nAnd the story is sometimes funny and sometimes touching, but often truly terrifying, as in this quote from earlier in the book:\nAfter several turns, he sat down again. As he threw his head back in the chair, his glance happened to rest upon a bell, a disused bell, that hung in the room, and communicated for some purpose now forgotten with a chamber in the highest story of the building. It was with great astonishment, and with a strange, inexplicable dread, that as he looked, he saw this bell begin to swing. It swung so softly in the outset that it scarcely made a sound; but soon it rang out loudly, and so did every bell in the house.\nThis might have lasted half a minute, or a minute, but it seemed an hour. The bells ceased as they had begun, together. They were succeeded by a clanking noise, deep down below; as if some person were dragging a heavy chain over the casks in the wine-merchant’s cellar. Scrooge then remembered to have heard that ghosts in haunted houses were described as dragging chains.\nThe cellar door flew open with a booming sound, and then he heard the noise much louder, on the floors below; then coming up the stairs; then coming straight towards his door.\nWhile A Christmas Carol is the best-remembered Christmas story, it was preceded and followed by dozens of others. The definition of a “Christmas ghost story” is and was a loose one. In some stories, such as “Old Hooker’s Ghost; or, Christmas Gambols at Huntingfield Hall,” Christmas celebrations are woven directly into the story and are integral to the plot. Other stories barely refer to the holiday but are still considered Christmas stories. M. R. James’ “Oh, Whistle, and I’ll Come to You, My Lad” never directly references Christmas, but takes place during a professor’s winter holiday and thus earns a lasting place in “Best Christmas Ghost Story” lists. Henry James’ “The Turn of the Screw” uses a framing device that takes place at Christmas, beginning,\nThe story had held us, ’round the fire, sufficiently breathless, but except the obvious remark that it was gruesome, as, on Christmas Eve in an old house, a strange tale should essentially be, I remember no comment uttered ’til somebody happened to say that it was the only case he had met in which such a visitation had fallen on a child.\nWhile the Victorians achieved a peak level of Christmas ghost stories in written form, the phenomena of telling spooky stories in the winter season in general, and on Christmas Eve specially, preceded the era and lives on in modified form today. Now, no Christmas holiday season is complete without a winter-themed horror novel or a new Christmas-themed horror movie. These movies are modern penny dreadfuls, often shot with a small or medium budget and consumed at home for a relatively small price. It seems that the urge to stay inside, get warm, and enjoy being scared in a safe environment endures.\nCarrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats.", "source": "https://clarkesworldmagazine.com/sessarego_12_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ghosts of Christmas Past: The Victorian Christmas Ghost Story Tradition by Carrie Sessarego"}