{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "uL23JFro7iNw8aRfm5MXj4cjyic=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Time Threads, Epistolary Novels, and Collaboration: A Conversation with Amal El-Mohtar and Max Gladstone  Time is a slippery thing. So are stories. They intertwine. So when a story tackles time, and you invest your time in tackling that story . . . things get very interesting.  Red and Blue slip along time threads. They’re on different sides of a war unlike any you’ve ever seen. They leave notes for one another, chiding and taunting each other over each bumble or successful mission. Cleverly told with each of their signature sensibilities on display, El-Mohtar and Gladstone weave a tale that hurdles through both space and time.  Amal El-Mohtar and Max Gladstone are the award-winning authors of dozens of short stories and novels. Their fiction has appeared everywhere from Clarkesworld Magazine to Tor.com, Fireside Fiction, Lightspeed, Uncanny, Strange Horizons, Apex, and more. Their new book written together is This Is How You Lose the Time War, which will be available July 16th from Tor Books.   How did you two meet?  Amal: We met at Readercon in 2014. I used to be on the programming committee, and was attending one of the panels for which I’d written up a description. Max was on that panel, being characteristically brilliant, saying all the things that I’d hoped someone would while designing it—to the extent that I found myself frustrated that I wasn’t just having the conversation with him myself! Later that evening we met properly at a party, and I remember saying something like “Hey, I think if we sat down and talked for a while we could solve some of the world’s problems.” And then within a year I was inviting him and his wife to my wedding, and within two years we were writing a novella together! Still working on those world problems, though.  Max: Ad astra per et cetera!  What made you want to write a book together?  Max: Have you met Amal? I mean, really! From the earliest stages of our friendship we were always bouncing ideas off each other, sharing our own lives and points of view, and so often we’d find ourselves approaching the same idea from different directions—and getting excited by the pattern of each other’s thought, our different angles on the world. And our writing felt complementary too—different angles of approach, but all captured by the same black hole, all drawn down toward the same unseen destination. We knew we had to work on something together, and a novella seemed like the ideal form: small and focused enough to test us, but expansive enough to contain a multiverse with the right technique.  What did your process for crafting this novel look like? Did each of you tackle one side of the time war?  Amal: Ironically—given the epistolary nature of the project—we wrote the whole thing while in each other’s company, over the course of a writing retreat, time stolen from a convention, and a visit I made to Boston. We knew we were coming into this project with very different styles and aptitudes, and chose letter writing to make a virtue of those differences. So we divided by character: One of us would write the letter, and the other would write the situation in which the letter was received. Then we’d swap laptops, read what we’d written, exclaim in delight, and move on to the next part.  Max: Dividing the war like that made the writing process mimic the movement of our characters in a way that felt electric. As Red and Blue orbited one another in tighter and tighter circles, so did our writing.  Did you ever play games or challenge each other to who could finish their sections first?  Amal: Not exactly! Max writes roughly four times as fast as I do, and descriptions of space and action and movement come much more naturally to him than to me. So the first few exchanges involved him finishing his section and waiting (with genuine kind patience because he is the literal best human) for me to finish my painstaking canoodling through poetry and sensory affect.  But as we went on, as we read each other’s sections and got more excited and delighted by each other’s work, we started learning from each other, and he slowed down while I sped up, so that by Act Two we were finishing at almost exactly the same time, so that swapping laptops and reading the work felt like this beautiful choreographed dance as we generated a positive feedback loop of encouragement and cheer.  Max: In that way the whole process was a game!  Did you edit each other’s sections?  Amal: Very little; we’d catch typos and continuity errors in each other’s sections, but mostly do the editing ourselves within what we’d written.  Max: Every once in a while we’d drop a margin comment about continuity, but for the most part the “editing” took place in the form of long conversations about what needed to happen next, how we’d have to revise our earlier work. Then we’d break, work separately, and crow about our success.  How did you deal with the paradoxes inherently associated with time travel stories?  Amal: Part of that is spoilers, but most of it is many-worlds interpretation and quantum decoherence and just generally backgrounding mechanics in order to foreground character and feeling. We also lean into the resonance of how letters are their own kind of time travel, in which you’re less concerned with moving forward or backward so long as you’re moving towards each other.  If you could slip along the time thread to any period, what would it be and why?  Amal: So many variables here—can I move in space? Is it a one-way trip? How long can I stay? Do I only get one shot? Am I universally translated? Am I always appearing as myself or do I get something like the Doctor’s Psychic Paper to help me along? Can I affect proceedings?  I think I’ve often felt the desire to look backwards to a place or time that was Good, that was better in some way than our present moment, or that Could Have Been Good If. I’m wary of that desire now. Sure I’d love to have listened to Enheduanna recite her praise-verse to Inanna in Ur, or read any of the millions of books that have been lost or destroyed over millennia, or talk to Coleridge about The Arabian Nights, or go on a very long walk with Naomi Mitchison—but I think the end of this kind of exercise is to realize what you care deeply about now, what you don’t want to miss out on, what you want for the future. And I guess really what I want is to slip along the time thread to a place with a stable climate and the liberation of all sentient beings—even if it’s moving into the future a day at a time.  What made you choose to have these characters on each side of the war interact in almost a playful manner by leaving hidden notes for each other?  Max: We started writing letters to each other early in our friendship—for many reasons, really. A letter is an utterly unique gift. It’s untracked, unarchived, unsearched. There is no public, performative component of a letter—as there is in so much of our lives these days, especially if you’re in on social media in any active professional sense. Letter writing felt like something small and real snatched away from an increasingly mad world. I could fall into a letter knowing Amal would be there to catch me, and vice versa. And, as Amal has mentioned, letters have their own sort of time travel—they’re bits of time and soul spread across the writing of them, sent forward to a correspondent who may be in desperate need of just that time, just that soul. There’s something of the secret agent to any writer of letters. In a way, the whole book came from that seed.  Besides each other, what other writer, living or dead would you like to collaborate with?  Amal: Bracketing all the amazing people with whom I’ve already collaborated (C.S.E. Cooney, Nicole Kornher-Stace, Caitlyn Paxson, Cat Valente, Jessica P. Wick) or discussed collaborating (Fran Wilde, Arkady Martine)—Lin-Manuel Miranda. I mean, why not. And Rebecca Sugar while I’m at it. Actually, like, the three of us, maybe, in a room together, making things happen. And George Eliot.  Max: Can I join?  Amal: In my head we’re already breaking narrative ground on the Queer Middlemarch Meets Moana in Space project of our dreams!  Did the story grow out of the telling or did you both figure out the structure and plot before fleshing it out chapter by chapter?  Amal: We had a rough act-based breakdown of story beats, and would discuss the situation in which the letter was to be received, but not the contents of the letters themselves, which were always a surprise, even when we were aware of what forward plot-motion they were supposed to accomplish. I remember there was one climactic point where we kept going back and forth trying to figure out how to denoue the ment of it all, and we paced across that tiny gazebo until we both lay down on the floor and stared at the ceiling for a while, full of the what but incapable of articulating the how.  We got there eventually, though!  What is one piece of writing advice that has stuck with you?  Amal: I first encountered this anonymously on Tumblr, but some googling suggests it’s attributed to Jane Smiley: “Every first draft is perfect, because all a first draft has to do is exist.” I am fantastic at giving this advice and absolutely dreadful at internalizing it.  Max: No one gave me this advice, but for years now I’ve had on my desktop a Post-it note saying in all caps: YOU DO NOT NEED PERMISSION. Obviously not comprehensive life advice! I mean, permission is important for any activity that involves more than one person! But when creating in solitude or in a tight pair, it’s important to remember that, yes, you can write this sentence, make this comparison, turn the scene in just this way. These characters can go that far over the line. You can make this work about something you love, rather than something you think other people want to read. The worst you’ll get is a scene that does not work, a character that falls flat. (That’s part of the relief of working with someone, too—you can see instantly what works for them and what doesn’t.) What exists that doesn’t work can always be fixed. What doesn’t exist, can’t.  What is one piece of writing advice that you gave each other?  Amal: “Hey Max, maybe you should eat something.”  Max: “Just keep going! It’s amazing already, and if anything needs fixing we’ll fix it in post!”  What projects are you working on next?  Amal: We’re working on scripting the pilot episode for a This Is How You Lose the Time War TV show! It’s very early days yet but the process has been so exciting to me—Max has a lot more experience with scripts and serialized fictions more generally, and it’s been wonderful to get to learn this form alongside him. Speaking more singly—and with the weary awareness of how often I’ve said this in interviews over the last mumblety years—I’m finishing a doctoral dissertation and determining when exactly, between writing criticism and short fiction and teaching and traveling, I can knuckle down to a novel.  Max: So much! This summer sees the release of This Is How You Lose The Time War and Empress of Forever. My main projects after that are still in motion but include the climactic conclusion of the Craft Sequence, another book I can’t talk about much just yet, the Time War TV series of course, another video project I can’t talk about yet, and, after all that, blue skies and the open sea. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nTime Threads, Epistolary Novels, and Collaboration: A Conversation with Amal El-Mohtar and Max Gladstone\nTime is a slippery thing. So are stories. They intertwine. So when a story tackles time, and you invest your time in tackling that story . . . things get very interesting.\nRed and Blue slip along time threads. They’re on different sides of a war unlike any you’ve ever seen. They leave notes for one another, chiding and taunting each other over each bumble or successful mission. Cleverly told with each of their signature sensibilities on display, El-Mohtar and Gladstone weave a tale that hurdles through both space and time.\nAmal El-Mohtar and Max Gladstone are the award-winning authors of dozens of short stories and novels. Their fiction has appeared everywhere from Clarkesworld Magazine to Tor.com, Fireside Fiction, Lightspeed, Uncanny, Strange Horizons, Apex, and more. Their new book written together is This Is How You Lose the Time War, which will be available July 16th from Tor Books.\nHow did you two meet?\nAmal: We met at Readercon in 2014. I used to be on the programming committee, and was attending one of the panels for which I’d written up a description. Max was on that panel, being characteristically brilliant, saying all the things that I’d hoped someone would while designing it—to the extent that I found myself frustrated that I wasn’t just having the conversation with him myself! Later that evening we met properly at a party, and I remember saying something like “Hey, I think if we sat down and talked for a while we could solve some of the world’s problems.” And then within a year I was inviting him and his wife to my wedding, and within two years we were writing a novella together! Still working on those world problems, though.\nMax: Ad astra per et cetera!\nWhat made you want to write a book together?\nMax: Have you met Amal? I mean, really! From the earliest stages of our friendship we were always bouncing ideas off each other, sharing our own lives and points of view, and so often we’d find ourselves approaching the same idea from different directions—and getting excited by the pattern of each other’s thought, our different angles on the world. And our writing felt complementary too—different angles of approach, but all captured by the same black hole, all drawn down toward the same unseen destination. We knew we had to work on something together, and a novella seemed like the ideal form: small and focused enough to test us, but expansive enough to contain a multiverse with the right technique.\nWhat did your process for crafting this novel look like? Did each of you tackle one side of the time war?\nAmal: Ironically—given the epistolary nature of the project—we wrote the whole thing while in each other’s company, over the course of a writing retreat, time stolen from a convention, and a visit I made to Boston. We knew we were coming into this project with very different styles and aptitudes, and chose letter writing to make a virtue of those differences. So we divided by character: One of us would write the letter, and the other would write the situation in which the letter was received. Then we’d swap laptops, read what we’d written, exclaim in delight, and move on to the next part.\nMax: Dividing the war like that made the writing process mimic the movement of our characters in a way that felt electric. As Red and Blue orbited one another in tighter and tighter circles, so did our writing.\nDid you ever play games or challenge each other to who could finish their sections first?\nAmal: Not exactly! Max writes roughly four times as fast as I do, and descriptions of space and action and movement come much more naturally to him than to me. So the first few exchanges involved him finishing his section and waiting (with genuine kind patience because he is the literal best human) for me to finish my painstaking canoodling through poetry and sensory affect.\nBut as we went on, as we read each other’s sections and got more excited and delighted by each other’s work, we started learning from each other, and he slowed down while I sped up, so that by Act Two we were finishing at almost exactly the same time, so that swapping laptops and reading the work felt like this beautiful choreographed dance as we generated a positive feedback loop of encouragement and cheer.\nMax: In that way the whole process was a game!\nDid you edit each other’s sections?\nAmal: Very little; we’d catch typos and continuity errors in each other’s sections, but mostly do the editing ourselves within what we’d written.\nMax: Every once in a while we’d drop a margin comment about continuity, but for the most part the “editing” took place in the form of long conversations about what needed to happen next, how we’d have to revise our earlier work. Then we’d break, work separately, and crow about our success.\nHow did you deal with the paradoxes inherently associated with time travel stories?\nAmal: Part of that is spoilers, but most of it is many-worlds interpretation and quantum decoherence and just generally backgrounding mechanics in order to foreground character and feeling. We also lean into the resonance of how letters are their own kind of time travel, in which you’re less concerned with moving forward or backward so long as you’re moving towards each other.\nIf you could slip along the time thread to any period, what would it be and why?\nAmal: So many variables here—can I move in space? Is it a one-way trip? How long can I stay? Do I only get one shot? Am I universally translated? Am I always appearing as myself or do I get something like the Doctor’s Psychic Paper to help me along? Can I affect proceedings?\nI think I’ve often felt the desire to look backwards to a place or time that was Good, that was better in some way than our present moment, or that Could Have Been Good If. I’m wary of that desire now. Sure I’d love to have listened to Enheduanna recite her praise-verse to Inanna in Ur, or read any of the millions of books that have been lost or destroyed over millennia, or talk to Coleridge about The Arabian Nights, or go on a very long walk with Naomi Mitchison—but I think the end of this kind of exercise is to realize what you care deeply about now, what you don’t want to miss out on, what you want for the future. And I guess really what I want is to slip along the time thread to a place with a stable climate and the liberation of all sentient beings—even if it’s moving into the future a day at a time.\nWhat made you choose to have these characters on each side of the war interact in almost a playful manner by leaving hidden notes for each other?\nMax: We started writing letters to each other early in our friendship—for many reasons, really. A letter is an utterly unique gift. It’s untracked, unarchived, unsearched. There is no public, performative component of a letter—as there is in so much of our lives these days, especially if you’re in on social media in any active professional sense. Letter writing felt like something small and real snatched away from an increasingly mad world. I could fall into a letter knowing Amal would be there to catch me, and vice versa. And, as Amal has mentioned, letters have their own sort of time travel—they’re bits of time and soul spread across the writing of them, sent forward to a correspondent who may be in desperate need of just that time, just that soul. There’s something of the secret agent to any writer of letters. In a way, the whole book came from that seed.\nBesides each other, what other writer, living or dead would you like to collaborate with?\nAmal: Bracketing all the amazing people with whom I’ve already collaborated (C.S.E. Cooney, Nicole Kornher-Stace, Caitlyn Paxson, Cat Valente, Jessica P. Wick) or discussed collaborating (Fran Wilde, Arkady Martine)—Lin-Manuel Miranda. I mean, why not. And Rebecca Sugar while I’m at it. Actually, like, the three of us, maybe, in a room together, making things happen. And George Eliot.\nMax: Can I join?\nAmal: In my head we’re already breaking narrative ground on the Queer Middlemarch Meets Moana in Space project of our dreams!\nDid the story grow out of the telling or did you both figure out the structure and plot before fleshing it out chapter by chapter?\nAmal: We had a rough act-based breakdown of story beats, and would discuss the situation in which the letter was to be received, but not the contents of the letters themselves, which were always a surprise, even when we were aware of what forward plot-motion they were supposed to accomplish. I remember there was one climactic point where we kept going back and forth trying to figure out how to denoue the ment of it all, and we paced across that tiny gazebo until we both lay down on the floor and stared at the ceiling for a while, full of the what but incapable of articulating the how.\nWe got there eventually, though!\nWhat is one piece of writing advice that has stuck with you?\nAmal: I first encountered this anonymously on Tumblr, but some googling suggests it’s attributed to Jane Smiley: “Every first draft is perfect, because all a first draft has to do is exist.” I am fantastic at giving this advice and absolutely dreadful at internalizing it.\nMax: No one gave me this advice, but for years now I’ve had on my desktop a Post-it note saying in all caps: YOU DO NOT NEED PERMISSION. Obviously not comprehensive life advice! I mean, permission is important for any activity that involves more than one person! But when creating in solitude or in a tight pair, it’s important to remember that, yes, you can write this sentence, make this comparison, turn the scene in just this way. These characters can go that far over the line. You can make this work about something you love, rather than something you think other people want to read. The worst you’ll get is a scene that does not work, a character that falls flat. (That’s part of the relief of working with someone, too—you can see instantly what works for them and what doesn’t.) What exists that doesn’t work can always be fixed. What doesn’t exist, can’t.\nWhat is one piece of writing advice that you gave each other?\nAmal: “Hey Max, maybe you should eat something.”\nMax: “Just keep going! It’s amazing already, and if anything needs fixing we’ll fix it in post!”\nWhat projects are you working on next?\nAmal: We’re working on scripting the pilot episode for a This Is How You Lose the Time War TV show! It’s very early days yet but the process has been so exciting to me—Max has a lot more experience with scripts and serialized fictions more generally, and it’s been wonderful to get to learn this form alongside him. Speaking more singly—and with the weary awareness of how often I’ve said this in interviews over the last mumblety years—I’m finishing a doctoral dissertation and determining when exactly, between writing criticism and short fiction and teaching and traveling, I can knuckle down to a novel.\nMax: So much! This summer sees the release of This Is How You Lose The Time War and Empress of Forever. My main projects after that are still in motion but include the climactic conclusion of the Craft Sequence, another book I can’t talk about much just yet, the Time War TV series of course, another video project I can’t talk about yet, and, after all that, blue skies and the open sea.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/el-mohtar_gladstone_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Time Threads, Epistolary Novels, and Collaboration: A Conversation with Amal El-Mohtar and Max Gladstone by Chris Urie"}