{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cat Rambo", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "w1+84ua47ghAwdYrZP9MTFwDnFA=", "id": null, "license": null, "comments": "", "raw_text": "3520 words, short story  Tortoiseshell Cats Are Not Refundable  Antony bought the kit at Fry’s in the gray three months after Mindy’s death. He swam in and out of fog those days, but he still went frequently to the electronics store and drifted through its aisles, examining hard drives, routers, televisions, microphones, video games, garden lights, refrigerators, ice cream makers, rice cookers, all with the same degree of interest. Which was to say little to none, barely a twitch on the meter. A jump of the arrow from E up to one.  A way to kill time. So were the evenings, watching reality shows and working his way methodically through a few joints. If pot hadn’t been legal in Seattle, it would’ve been booze, he knew, but instead the long, hard, lonely evening hours were a haze of blue smoke until he finally found himself nodding off and hauled himself into bed for a few hours of precious oblivion.  He prized those periods of nothingness.  Each day began with that horrible moment when he put a hand out to touch Mindy’s shoulder—hey, honey, I had this awful dream you died, in a boating accident, no less, when was last time we were on a boat. Then the stomach dropping realization, sudden as stepping out into an elevator shaft.  Not.  A.  Dream.  His mother called him every day at first, but he couldn’t manage the responses. Let alone the conversational give and take.  That saddened him. Made him feel guilty too. He was the only child his mother still had nearby. Both of his sisters had stayed on the other coast and were distant now as then. Still angry at his mother for unimaginable transgressions during their high school years. They both had been excellent at holding a grudge all their lives. He was the only child who’d been willing to take some responsibility for her, had helped her move out to this coast in fact.  He loved her. Bought her presents. That was how the cat, a small tortoiseshell kitten, had entered her life, riding in his coat pocket, a clot of black and orange fur, tiny triangular face split between the colors.  His mother had named it, as with all her animals, palindromically. Taco Cat, like God Dog and Dribybird the parakeet.  She loved that cat about as much as she’d ever loved anything. His mother had always been stolid and self-contained, but he knew she missed the cat even now, a year after its death.  She deserved something to fill her days. He wondered if they’d been as gray as his were nowadays, ever since his father died. He thought—hoped, perhaps—that wasn’t true.  Maybe you did get over it with time.  He read somewhere that older people did better, were happier, if they had something they could care for. Taco had been that and now that prop was gone.  He’d replace it.  The kit was one of those late-night things. Infomercial fodder. Clone a beloved pet. Take the sample and send it into their labs. Have a perfect replica delivered within three months. A box five hundred times larger than it needed to be, holding only the test tube in which you would put the fragments of hair or claw material that were required.  He teased clumps from the wire brush he’d taken from his mother’s, poked it with a forefinger into the test tube’s depths. Stoppered it with a blunt plastic round.  Used his shunt to scan in the bar code on its side and beam it to the mailing center. A drone pecked at his apartment window, three floors up. Colored UPS brown. He could see other brightly colored shipping drones, colored red and green for the holidays, zipping around closer to the street. He authenticated it, staring into its inquisitive eye, and received the confirmation number displayed to one side, hovering in the air before it disappeared.  He was part of the last generation to know what life was like without a shunt. He got one in college, finally, had sold all the gold coins his aunt Mick, who died in the seventh Gulf War, had left him, and he never regretted that.  Life was so much more reliable with the shunt. It made sure you didn’t overeat by making you feel satiated after just a few mouthfuls or let you sleep as long and deep as you liked, and even take part in preprogrammed dreams. You could use it to upload knowledge packs, particularly if you had augmented memory. It let you remember everyone’s face and every date and time you ever needed to. It was like minor superpowers.  How awesome to live inside the future. Or it should have been.  He’d never thought much about his existence before Mindy. Then all of a sudden he wanted a life, a life together full of jokes only they shared. Him cooking her ginger pancakes and spending Sunday mornings lazing in shunt-enhanced sex, pleasurable and languorous and amazing.  He was leaving after a dinner of enchiladas unsatisfyingly sauced, their edges crisp and brown, stabbing the mouth. His mother hadn’t mentioned Mindy outright, but she patted him on the upper arm as he paused to slip on his jacket. The gesture was unusual, outside her usual air-kiss intimacies.  He said, “Do you have Taco’s old brush?”  “In the cupboard.”  It shook him to see all the cat’s things, gathered in careful memorial. He didn’t associate sentimentality with his mother. Loss did that to you, perhaps. Though she’d endured his father’s loss without such a display. At least he thought so. He tried to think back to his father’s death. How long had it taken her to send all those shirts and ties and suits to St. Vincent De Paul’s thrift shop? Not long. He remembered railing at her angrily about it. He’d planned on wearing all those clothes, two sizes too big for his sixteen year old frame, some day.  “It doesn’t pay to get attached,” she’d said. Her dry eyes infuriated him even farther. She’d hugged her arms to herself and returned his angry stare.  He still had things to make up to her for. This would help even the scales so tipped by all his adolescent anger and outbreaks.  BCSS sent him an envelope. The language of the thick packet was dense: an opportunity extended him to participate in a test program.  Clone a human.  Give him Mindy back.  He said, “I don’t understand how it’s possible. I know you can replicate her body, but her mind?”  Dr. Avosh’s eyes were clearly artificial, flat circles of emerald green. What did it say about her, that she didn’t even bother to try to hide her augmentations?  She said, “We create a matrix of artificial memories. Easy nowadays.”  “But where do those memories come from?”  “We have more material than you would think. Social media, public records, and some information garnered from the shunt itself.”  That startled him. “Shunts don’t record things.” There had been plenty of legal battles over that.  “No,” Dr. Avosh said. “That’s a misconception most people share. While the original versions only recorded what you wanted them to, and had limited memory space, the current versions record a great deal. It’s simply inadmissible in court.” One of her pupils was markedly larger than the other. As he looked at it, it ratcheted even further wide.  “Are you recording this right now?” he asked.  “It’s my policy to record everything.”  “In case you ever need to be replicated.”  She shook her head, then hesitated. “Not really. There are so many reasons to do so.”  “Are they real memories?”  “Are you asking if they are detailed memories? No. More like a memory of a memory, and obviously there will be gaps. It won’t be quite the same for you, but for her it will be much smoother. She’ll believe herself to be the actual Mindy. We recommend you not talk to her about the actual circumstances until at least six months have passed.”  Mindy. The smell of her hair when he buried his nose in it, inhaling the scent as delicious as cinnamon or roses, a musky edge that always tugged at the edges of his erotic conscious.  There was no way he could say no.  “You said this was a new process. How many times has it been done?”  “This is the third trial batch of subjects. The first time we’re using people in your situation.”  “My situation?”  Papers on her desk whispered against each other as she fiddled with them. “Recently bereaved. We’re curious to see how much the spouse’s memory can augment the process and reinforce beliefs.”  She paused. “And I must tell you that the company doesn’t cover the entire cost.”  He’d met Mindy on the R train, heading from his Bay Ridge apartment up into Manhattan to work for the BWSS. He’d handled their computer systems, going in late at night to work through the morning hours maintaining the message boards the BWSS scientists used.  You saw the same people on the train sometimes. He’d noticed her right away: small and birdlike. Always smiling, in a way you didn’t hit in NYC. Curious and unafraid, chatting with the woman beside her one day, looking at kid pictures, the next day helping an old man to a seat.  That was Mindy. Friendly. Finally one day she plopped down beside him and said, “Here we go!”  Why she’d said it, she didn’t know, she told him later, but indeed they went, first chatting daily, then going for coffee and then with perfect amity, dating, engagement, marriage in a small chapel attended only by close friends and family.  She had so many friends and they seemed to welcome him into the circle, saying, “Take care of her!”  He had. Until the accident.  Now every day that dizzying fall into the realization she wasn’t there.  Any price was worth paying to avoid that.  But costly, so costly. He’d plundered his 401(k), his IRAs, taken out a second mortgage. Cut his bills to the bone and still had to ask his mother for money.  She provided it without question once she found out what it was for.  They drew as much as they could on his memories, which meant going in every day for two weeks in a row, sitting there talking about his relationship with Mindy, his history, where they’d gone on their honeymoon, and what a typical trip to the grocery store was like, and where each piece of their bedroom furniture had come from. Dr. Avosh said that was good. The stronger the relationship with him was, the more quickly the cloned Mindy would adjust.  His mother didn’t ask about the results or the loan she’d made him to pay for the process. He thought perhaps she was trying to keep him from getting his hopes up too far, but as he aged, increasingly he realized he didn’t understand his mother, didn’t understand the parts of her that she had kept closed away from her family. It was only in his forties that they had become something like close.  Instead, they talked about the day-to-day drama of her apartment building. He grew interested despite himself, even though the stories were so small, concerning misplaced mail or who shoveled the front walk.  He said, “I got you a present. It should arrive next week. According to the tracking number it’s being prepared for shipment right now.”  “Should I ask what it is?”  He found himself smiling and the expression almost startled him. How long had it been since the gray had lifted momentarily? Too long.  He and Mindy would laugh about that together eventually. He wondered what that would be like, to be able to say, “While you were dead.”  Perhaps it would be better just not to bring that up. He couldn’t even begin to imagine what it would be like to live on the other side of that.  “Your present arrived,” his mother said. “It’s very nice.” Her voice was strained.  “You don’t like it?” he said.  “Of course I do,” she said, but he could tell she was lying.  When he went for dinner, he realized the problem.  “They must have shipped you the wrong cat,” he said, looking down at it. It was the same size as Taco and it was a tortoiseshell, but where Taco had been black with dapplings of hazy orange hair, this one was white with awkward splotches of orange and brown.  But the service rep explained. “You can’t clone tortoiseshells and expect the same markings. They’re random expressions of the gene. The brochure lists certain animals where you can’t get an exact copy. Tortoiseshell cats are not refundable.”  He hung up abruptly, full of rage. For God’s sake, he couldn’t get anything right lately.  But that would change when Mindy was back.  He didn’t see the new cat the next time he was over and he didn’t ask questions.  He could understand loving one configuration but not another.  But he didn’t want to think about that.  They sent a crew that went over the house, scanning in everything about it. They quizzed him about the usual state of cleanliness, and what days Mindy usually cleaned on, what she was good at and what she was bad at, and how much they actually split up the chores. Her favorite brands.  He didn’t know many of the answers. How empty did the refrigerator have to get before she’d go shopping, since she was the one who handled all that? He had no idea. They took another tack and asked him what he remembered them running out of, milk or toilet paper or butter.  “You see, most people have a few trigger items that automatically send them to the store,” the data technician chirped at him as she continued running her bar scanner over everything under the sink. She’d quizzed him as to what he purchased and what Mindy had and luckily his only contribution had been a bottle of lime-scented dishwashing soap.  “Have you done many of these before?” he asked.  Her fingers kept clicking over the data pad. She had long thin nails with tiny daggers painted in silver at each tip and a tiny border of circles. “Two so far.”  “What were they like?”  “The first preferred Comet and Pine-Sol, the second went with Seventh Generation cleaning products.”  “No. I meant . . . ” He wasn’t sure how to formulate it. “Did it, did it work?”  Her gaze was quizzical. “All I can tell you is that, sure, when they came back they liked the same cleaning brands.” She clicked and swiped. “All right, new section. Bed, made or unmade on a regular basis? If the former, who did it?”  “We did it together every morning,” he said. His eyes heated up and he hoped he wasn’t getting too teary. She tapped away.  “You two were sweet. It will be just as cute in the next round. You’ll see.”  He brought himself to ask his mother what she’d done with the cat. Her hands faltered as she chopped onions, then resumed their staccato beat.  “Ms. Green two doors down had mice,” she said. “So I loaned her Taco Two.”  “Taco Two? No palindrome?” he asked.  A sizzle and then a wave of fragrance as she added the onions to the skillet. “I couldn’t think of one yet. I’m sure it’ll come to me eventually.”  “Eventually,” he repeated agreeably. He thought perhaps the cat would end up staying with Mrs. Green, but that was all right.  “So what else is new?”  “I’m bringing her home tomorrow.”  She put the spatula down in order to swing around and look at him, wide-eyed. “So soon?”  He nodded. He was smiling again. She smiled back, wiping her hands on her apron before she came over to awkwardly hug him.  What do you bring to your first meeting with the person you used to be married to? He chose an armload of roses. Who cared if it was cliché? Mindy loved them.  He remembered buying them for her. The two of them together at the farmers market, wandering from stall to stall, buying bread rounds still warm from baking and bags of vegetables still thick with dirt and leaves. The way she managed to look at every display, ferreted out everything interesting, made people smile as she talked to them.  Roses. So much like her in the way she opened to the world.  Glimpsed through the pane of glass in the door, she seemed so small in the hospital bed. Her eyes were shut. Her hair had once been long, but now it was short, one or two inches at most.  He said to Dr. Avosh. “Why did you cut her hair?”  The doctor chuckled. “I can see where it would seem that way. But it’s because we’ve had a limited amount of time for her to grow hair in. It’ll come.”  “Won’t that mess with her memories?”  “We’ve compensated.” The doctor put her hand on the gray metal doorknob before looking back over her shoulder at him. “Are you ready to say hello?”  He nodded, unable to speak around the lump in his throat.  The room smelled of lemon disinfectant. The nurse already there took the flowers from him with a muted squeal of delight. “Aren’t these pretty! I’ll put them in water.”  Mindy’s eyes were still shut.  “Are you awake, Mindy?” the doctor said. “You have a visitor.”  Her eyes opened, fixing on him immediately. “Antony.”  The same smile, the same voice.  Emotion pushed him to the bed and he gathered her hands in his, kissing them over and over, before he laid his head down on the cool white hospital sheet and cried for the first time since she died.  He’d asked before what sort of cover story they would have for her waking up in the hospital. Of course they’d thought of that already: a slip in the shower, a knock on the head that accounted for any dizziness or disorientation.  He’d prepared the house as well, made it as close as he could remember to their days together, removed the dingy detritus of a bachelor existence by bringing a cleaning service in. If it seemed too different and she questioned it, he’d tell her that he’d hired the service to help him cope while she was in the hospital.  In the taxi home, as they rumbled their way up Queen Anne, he noticed it.  She didn’t look at the world in the same way anymore. A shrinking back, a momentary flinch, a hesitancy about it all.  He asked the doctor about it the next day. He could tell from her expression that she knew the answer already, but was reluctant to say. He pushed harder. “Does it mean something went wrong with the process?”  “Of course not,” Dr. Avosh snapped. She shook her head. “We still don’t understand all the ways that personality is genetically determined.”  “If it’s genetically determined, then it would be the same,” he said.  “It’s considerably more complicated than that,” she said and began to explain, but he was already thinking of tortoiseshell cats and realizing what he had done.  He couldn’t think of anywhere to go but his mother’s.  Much to his surprise, she was sitting on the sofa with Taco on her lap.  “I thought you gave her to Mrs. Green,” he said.  She ran her hand over the soft fur, rubbing around the base of the cat’s ears. He could hear it purring from where he sat. “Just a loan,” she said. “Shall I make us some coffee?”  They sat together, drinking it. The cat hopped back onto his mother’s lap and began to purr again. She patted it.  “She’s more loving, this time around,” she said.  “This time around?”  “Yes.” She shrugged and kept petting the cat.  “I think Mindy is different this time around too,” he said.  She looked up, brows furrowed. “Is it possible?”  He nodded at the cat in her lap. “It’s the same thing, as far as I can tell. Personality is random, at least some of it.”  “But she looks just the same.”  He rubbed his forehead with the heel of his hand. “Yes, she does. They took great care in that regard. I wouldn’t be surprised if they used plastic surgery to correct any discrepancies. But they can’t do that with her personality.”  “And you can’t tell her.”  He shook his head.  His mother smoothed her hand over the cat, whispered to it.  “What’s that?” he said.  “Asking her what she makes of this.”  “But you called her something.”  She blushed. “Taco Tooto Cat. Not Taco, but Taco Too.”  Not and yet and still.  Like his Mindy. Who he could finally grieve for. Who he could finally meet for the first time.  “Are you going to pretend?” his mother said.  “No,” he said. “I’m going to tell her. And tell her why she feels about me like she does. Then she can decide.”  “Decide whether or not to keep things as they were?”  “No. Decide whether or not to begin.”  Cat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "text": "3520 words, short story\nTortoiseshell Cats Are Not Refundable\nAntony bought the kit at Fry’s in the gray three months after Mindy’s death. He swam in and out of fog those days, but he still went frequently to the electronics store and drifted through its aisles, examining hard drives, routers, televisions, microphones, video games, garden lights, refrigerators, ice cream makers, rice cookers, all with the same degree of interest. Which was to say little to none, barely a twitch on the meter. A jump of the arrow from E up to one.\nA way to kill time. So were the evenings, watching reality shows and working his way methodically through a few joints. If pot hadn’t been legal in Seattle, it would’ve been booze, he knew, but instead the long, hard, lonely evening hours were a haze of blue smoke until he finally found himself nodding off and hauled himself into bed for a few hours of precious oblivion.\nHe prized those periods of nothingness.\nEach day began with that horrible moment when he put a hand out to touch Mindy’s shoulder—hey, honey, I had this awful dream you died, in a boating accident, no less, when was last time we were on a boat. Then the stomach dropping realization, sudden as stepping out into an elevator shaft.\nNot.\nA.\nDream.\nHis mother called him every day at first, but he couldn’t manage the responses. Let alone the conversational give and take.\nThat saddened him. Made him feel guilty too. He was the only child his mother still had nearby. Both of his sisters had stayed on the other coast and were distant now as then. Still angry at his mother for unimaginable transgressions during their high school years. They both had been excellent at holding a grudge all their lives. He was the only child who’d been willing to take some responsibility for her, had helped her move out to this coast in fact.\nHe loved her. Bought her presents. That was how the cat, a small tortoiseshell kitten, had entered her life, riding in his coat pocket, a clot of black and orange fur, tiny triangular face split between the colors.\nHis mother had named it, as with all her animals, palindromically. Taco Cat, like God Dog and Dribybird the parakeet.\nShe loved that cat about as much as she’d ever loved anything. His mother had always been stolid and self-contained, but he knew she missed the cat even now, a year after its death.\nShe deserved something to fill her days. He wondered if they’d been as gray as his were nowadays, ever since his father died. He thought—hoped, perhaps—that wasn’t true.\nMaybe you did get over it with time.\nHe read somewhere that older people did better, were happier, if they had something they could care for. Taco had been that and now that prop was gone.\nHe’d replace it.\nThe kit was one of those late-night things. Infomercial fodder. Clone a beloved pet. Take the sample and send it into their labs. Have a perfect replica delivered within three months. A box five hundred times larger than it needed to be, holding only the test tube in which you would put the fragments of hair or claw material that were required.\nHe teased clumps from the wire brush he’d taken from his mother’s, poked it with a forefinger into the test tube’s depths. Stoppered it with a blunt plastic round.\nUsed his shunt to scan in the bar code on its side and beam it to the mailing center. A drone pecked at his apartment window, three floors up. Colored UPS brown. He could see other brightly colored shipping drones, colored red and green for the holidays, zipping around closer to the street. He authenticated it, staring into its inquisitive eye, and received the confirmation number displayed to one side, hovering in the air before it disappeared.\nHe was part of the last generation to know what life was like without a shunt. He got one in college, finally, had sold all the gold coins his aunt Mick, who died in the seventh Gulf War, had left him, and he never regretted that.\nLife was so much more reliable with the shunt. It made sure you didn’t overeat by making you feel satiated after just a few mouthfuls or let you sleep as long and deep as you liked, and even take part in preprogrammed dreams. You could use it to upload knowledge packs, particularly if you had augmented memory. It let you remember everyone’s face and every date and time you ever needed to. It was like minor superpowers.\nHow awesome to live inside the future. Or it should have been.\nHe’d never thought much about his existence before Mindy. Then all of a sudden he wanted a life, a life together full of jokes only they shared. Him cooking her ginger pancakes and spending Sunday mornings lazing in shunt-enhanced sex, pleasurable and languorous and amazing.\nHe was leaving after a dinner of enchiladas unsatisfyingly sauced, their edges crisp and brown, stabbing the mouth. His mother hadn’t mentioned Mindy outright, but she patted him on the upper arm as he paused to slip on his jacket. The gesture was unusual, outside her usual air-kiss intimacies.\nHe said, “Do you have Taco’s old brush?”\n“In the cupboard.”\nIt shook him to see all the cat’s things, gathered in careful memorial. He didn’t associate sentimentality with his mother. Loss did that to you, perhaps. Though she’d endured his father’s loss without such a display. At least he thought so. He tried to think back to his father’s death. How long had it taken her to send all those shirts and ties and suits to St. Vincent De Paul’s thrift shop? Not long. He remembered railing at her angrily about it. He’d planned on wearing all those clothes, two sizes too big for his sixteen year old frame, some day.\n“It doesn’t pay to get attached,” she’d said. Her dry eyes infuriated him even farther. She’d hugged her arms to herself and returned his angry stare.\nHe still had things to make up to her for. This would help even the scales so tipped by all his adolescent anger and outbreaks.\nBCSS sent him an envelope. The language of the thick packet was dense: an opportunity extended him to participate in a test program.\nClone a human.\nGive him Mindy back.\nHe said, “I don’t understand how it’s possible. I know you can replicate her body, but her mind?”\nDr. Avosh’s eyes were clearly artificial, flat circles of emerald green. What did it say about her, that she didn’t even bother to try to hide her augmentations?\nShe said, “We create a matrix of artificial memories. Easy nowadays.”\n“But where do those memories come from?”\n“We have more material than you would think. Social media, public records, and some information garnered from the shunt itself.”\nThat startled him. “Shunts don’t record things.” There had been plenty of legal battles over that.\n“No,” Dr. Avosh said. “That’s a misconception most people share. While the original versions only recorded what you wanted them to, and had limited memory space, the current versions record a great deal. It’s simply inadmissible in court.” One of her pupils was markedly larger than the other. As he looked at it, it ratcheted even further wide.\n“Are you recording this right now?” he asked.\n“It’s my policy to record everything.”\n“In case you ever need to be replicated.”\nShe shook her head, then hesitated. “Not really. There are so many reasons to do so.”\n“Are they real memories?”\n“Are you asking if they are detailed memories? No. More like a memory of a memory, and obviously there will be gaps. It won’t be quite the same for you, but for her it will be much smoother. She’ll believe herself to be the actual Mindy. We recommend you not talk to her about the actual circumstances until at least six months have passed.”\nMindy. The smell of her hair when he buried his nose in it, inhaling the scent as delicious as cinnamon or roses, a musky edge that always tugged at the edges of his erotic conscious.\nThere was no way he could say no.\n“You said this was a new process. How many times has it been done?”\n“This is the third trial batch of subjects. The first time we’re using people in your situation.”\n“My situation?”\nPapers on her desk whispered against each other as she fiddled with them. “Recently bereaved. We’re curious to see how much the spouse’s memory can augment the process and reinforce beliefs.”\nShe paused. “And I must tell you that the company doesn’t cover the entire cost.”\nHe’d met Mindy on the R train, heading from his Bay Ridge apartment up into Manhattan to work for the BWSS. He’d handled their computer systems, going in late at night to work through the morning hours maintaining the message boards the BWSS scientists used.\nYou saw the same people on the train sometimes. He’d noticed her right away: small and birdlike. Always smiling, in a way you didn’t hit in NYC. Curious and unafraid, chatting with the woman beside her one day, looking at kid pictures, the next day helping an old man to a seat.\nThat was Mindy. Friendly. Finally one day she plopped down beside him and said, “Here we go!”\nWhy she’d said it, she didn’t know, she told him later, but indeed they went, first chatting daily, then going for coffee and then with perfect amity, dating, engagement, marriage in a small chapel attended only by close friends and family.\nShe had so many friends and they seemed to welcome him into the circle, saying, “Take care of her!”\nHe had. Until the accident.\nNow every day that dizzying fall into the realization she wasn’t there.\nAny price was worth paying to avoid that.\nBut costly, so costly. He’d plundered his 401(k), his IRAs, taken out a second mortgage. Cut his bills to the bone and still had to ask his mother for money.\nShe provided it without question once she found out what it was for.\nThey drew as much as they could on his memories, which meant going in every day for two weeks in a row, sitting there talking about his relationship with Mindy, his history, where they’d gone on their honeymoon, and what a typical trip to the grocery store was like, and where each piece of their bedroom furniture had come from. Dr. Avosh said that was good. The stronger the relationship with him was, the more quickly the cloned Mindy would adjust.\nHis mother didn’t ask about the results or the loan she’d made him to pay for the process. He thought perhaps she was trying to keep him from getting his hopes up too far, but as he aged, increasingly he realized he didn’t understand his mother, didn’t understand the parts of her that she had kept closed away from her family. It was only in his forties that they had become something like close.\nInstead, they talked about the day-to-day drama of her apartment building. He grew interested despite himself, even though the stories were so small, concerning misplaced mail or who shoveled the front walk.\nHe said, “I got you a present. It should arrive next week. According to the tracking number it’s being prepared for shipment right now.”\n“Should I ask what it is?”\nHe found himself smiling and the expression almost startled him. How long had it been since the gray had lifted momentarily? Too long.\nHe and Mindy would laugh about that together eventually. He wondered what that would be like, to be able to say, “While you were dead.”\nPerhaps it would be better just not to bring that up. He couldn’t even begin to imagine what it would be like to live on the other side of that.\n“Your present arrived,” his mother said. “It’s very nice.” Her voice was strained.\n“You don’t like it?” he said.\n“Of course I do,” she said, but he could tell she was lying.\nWhen he went for dinner, he realized the problem.\n“They must have shipped you the wrong cat,” he said, looking down at it. It was the same size as Taco and it was a tortoiseshell, but where Taco had been black with dapplings of hazy orange hair, this one was white with awkward splotches of orange and brown.\nBut the service rep explained. “You can’t clone tortoiseshells and expect the same markings. They’re random expressions of the gene. The brochure lists certain animals where you can’t get an exact copy. Tortoiseshell cats are not refundable.”\nHe hung up abruptly, full of rage. For God’s sake, he couldn’t get anything right lately.\nBut that would change when Mindy was back.\nHe didn’t see the new cat the next time he was over and he didn’t ask questions.\nHe could understand loving one configuration but not another.\nBut he didn’t want to think about that.\nThey sent a crew that went over the house, scanning in everything about it. They quizzed him about the usual state of cleanliness, and what days Mindy usually cleaned on, what she was good at and what she was bad at, and how much they actually split up the chores. Her favorite brands.\nHe didn’t know many of the answers. How empty did the refrigerator have to get before she’d go shopping, since she was the one who handled all that? He had no idea. They took another tack and asked him what he remembered them running out of, milk or toilet paper or butter.\n“You see, most people have a few trigger items that automatically send them to the store,” the data technician chirped at him as she continued running her bar scanner over everything under the sink. She’d quizzed him as to what he purchased and what Mindy had and luckily his only contribution had been a bottle of lime-scented dishwashing soap.\n“Have you done many of these before?” he asked.\nHer fingers kept clicking over the data pad. She had long thin nails with tiny daggers painted in silver at each tip and a tiny border of circles. “Two so far.”\n“What were they like?”\n“The first preferred Comet and Pine-Sol, the second went with Seventh Generation cleaning products.”\n“No. I meant . . . ” He wasn’t sure how to formulate it. “Did it, did it work?”\nHer gaze was quizzical. “All I can tell you is that, sure, when they came back they liked the same cleaning brands.” She clicked and swiped. “All right, new section. Bed, made or unmade on a regular basis? If the former, who did it?”\n“We did it together every morning,” he said. His eyes heated up and he hoped he wasn’t getting too teary. She tapped away.\n“You two were sweet. It will be just as cute in the next round. You’ll see.”\nHe brought himself to ask his mother what she’d done with the cat. Her hands faltered as she chopped onions, then resumed their staccato beat.\n“Ms. Green two doors down had mice,” she said. “So I loaned her Taco Two.”\n“Taco Two? No palindrome?” he asked.\nA sizzle and then a wave of fragrance as she added the onions to the skillet. “I couldn’t think of one yet. I’m sure it’ll come to me eventually.”\n“Eventually,” he repeated agreeably. He thought perhaps the cat would end up staying with Mrs. Green, but that was all right.\n“So what else is new?”\n“I’m bringing her home tomorrow.”\nShe put the spatula down in order to swing around and look at him, wide-eyed. “So soon?”\nHe nodded. He was smiling again. She smiled back, wiping her hands on her apron before she came over to awkwardly hug him.\nWhat do you bring to your first meeting with the person you used to be married to? He chose an armload of roses. Who cared if it was cliché? Mindy loved them.\nHe remembered buying them for her. The two of them together at the farmers market, wandering from stall to stall, buying bread rounds still warm from baking and bags of vegetables still thick with dirt and leaves. The way she managed to look at every display, ferreted out everything interesting, made people smile as she talked to them.\nRoses. So much like her in the way she opened to the world.\nGlimpsed through the pane of glass in the door, she seemed so small in the hospital bed. Her eyes were shut. Her hair had once been long, but now it was short, one or two inches at most.\nHe said to Dr. Avosh. “Why did you cut her hair?”\nThe doctor chuckled. “I can see where it would seem that way. But it’s because we’ve had a limited amount of time for her to grow hair in. It’ll come.”\n“Won’t that mess with her memories?”\n“We’ve compensated.” The doctor put her hand on the gray metal doorknob before looking back over her shoulder at him. “Are you ready to say hello?”\nHe nodded, unable to speak around the lump in his throat.\nThe room smelled of lemon disinfectant. The nurse already there took the flowers from him with a muted squeal of delight. “Aren’t these pretty! I’ll put them in water.”\nMindy’s eyes were still shut.\n“Are you awake, Mindy?” the doctor said. “You have a visitor.”\nHer eyes opened, fixing on him immediately. “Antony.”\nThe same smile, the same voice.\nEmotion pushed him to the bed and he gathered her hands in his, kissing them over and over, before he laid his head down on the cool white hospital sheet and cried for the first time since she died.\nHe’d asked before what sort of cover story they would have for her waking up in the hospital. Of course they’d thought of that already: a slip in the shower, a knock on the head that accounted for any dizziness or disorientation.\nHe’d prepared the house as well, made it as close as he could remember to their days together, removed the dingy detritus of a bachelor existence by bringing a cleaning service in. If it seemed too different and she questioned it, he’d tell her that he’d hired the service to help him cope while she was in the hospital.\nIn the taxi home, as they rumbled their way up Queen Anne, he noticed it.\nShe didn’t look at the world in the same way anymore. A shrinking back, a momentary flinch, a hesitancy about it all.\nHe asked the doctor about it the next day. He could tell from her expression that she knew the answer already, but was reluctant to say. He pushed harder. “Does it mean something went wrong with the process?”\n“Of course not,” Dr. Avosh snapped. She shook her head. “We still don’t understand all the ways that personality is genetically determined.”\n“If it’s genetically determined, then it would be the same,” he said.\n“It’s considerably more complicated than that,” she said and began to explain, but he was already thinking of tortoiseshell cats and realizing what he had done.\nHe couldn’t think of anywhere to go but his mother’s.\nMuch to his surprise, she was sitting on the sofa with Taco on her lap.\n“I thought you gave her to Mrs. Green,” he said.\nShe ran her hand over the soft fur, rubbing around the base of the cat’s ears. He could hear it purring from where he sat. “Just a loan,” she said. “Shall I make us some coffee?”\nThey sat together, drinking it. The cat hopped back onto his mother’s lap and began to purr again. She patted it.\n“She’s more loving, this time around,” she said.\n“This time around?”\n“Yes.” She shrugged and kept petting the cat.\n“I think Mindy is different this time around too,” he said.\nShe looked up, brows furrowed. “Is it possible?”\nHe nodded at the cat in her lap. “It’s the same thing, as far as I can tell. Personality is random, at least some of it.”\n“But she looks just the same.”\nHe rubbed his forehead with the heel of his hand. “Yes, she does. They took great care in that regard. I wouldn’t be surprised if they used plastic surgery to correct any discrepancies. But they can’t do that with her personality.”\n“And you can’t tell her.”\nHe shook his head.\nHis mother smoothed her hand over the cat, whispered to it.\n“What’s that?” he said.\n“Asking her what she makes of this.”\n“But you called her something.”\nShe blushed. “Taco Tooto Cat. Not Taco, but Taco Too.”\nNot and yet and still.\nLike his Mindy. Who he could finally grieve for. Who he could finally meet for the first time.\n“Are you going to pretend?” his mother said.\n“No,” he said. “I’m going to tell her. And tell her why she feels about me like she does. Then she can decide.”\n“Decide whether or not to keep things as they were?”\n“No. Decide whether or not to begin.”\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "source": "https://clarkesworldmagazine.com/rambo_02_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tortoiseshell Cats Are Not Refundable by Cat Rambo"}