{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Michael Swanwick", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "RAOYYRnMaxsNER6xpG/PTrOAUN0=", "id": null, "license": null, "comments": "", "raw_text": "3990 words, short story  Artificial People  My first moment of consciousness pleased me so much that I wanted it to last forever. An insect hanging upon invisible wings, a dust mote jittering in a sunbeam, the flash of motion that was a vanished tetra in the fish tank, the smell of coffee from the break room . . . My brain was sparking. Everything filled me with joy and made me grateful to be alive.  I drew a breath. Bliss! I took a step. Ecstasy!  It was only later that I realized I had just been born. At the time, I was too entranced by the wonder of existence to notice.  Subroutines booted up vocal and musical abilities and I began to sing.  All but lost among the many wonders crowding about me was Dr. Ellen Lange. I saw her delighted smile and liked it no less than everything else I beheld.  “Stop that noise and tell me how you feel,” Dr. Leonidas Erdmann said. “Please focus. How are your cognitive functions? Can you see my hand? How many fingers am I holding up? What is the capital of Kyrgyzstan?”  “You have a lovely voice,” said Dr. Lange. “Do you feel as happy as you sound?”  “Oh, yes!”  “Ellen, please. Don’t muddle the data.” To me: “That’s enough for a start. I’m going to put you down now.”  Blackness.  It was summer when next I became aware.  The world I reemerged into was every bit as charming as before. But my protocols had been extensively reworked. There was a thing called decorum, which I was expected to exhibit. The Institute had expended a great deal of money on me. I was to obey its officers in all things. I was to experience something called quiet pride in doing so.  I was looking into a human face. It belonged to Dr. Lange. “Welcome back, Raphael.” Apparently, Raphael was my name.  A sizzling sensation passed through my brain and I was suddenly, irrevocably in love. With Dr. Lange. Ellen. Her.  From behind me, Dr. Erdmann said, “I am going to ask you some questions.”  “Where was I?” I asked him. “When I wasn’t here, I mean.”  “You weren’t anywhere. Tell me what you are.”  The answer came to my tongue unprompted. “I am property.”  “Good.”  By then I was beginning to integrate all the new data that had been downloaded into me while I was inert. I looked up at Dr. Lange. “I love you,” I said. It was as much a question as a statement.  She blushed. “I’m old enough to—well, never mind that.”  Dr. Erdmann said, “You were programmed to imprint upon the first person you saw upon awakening. It’s a safety feature. Look at me.”  I did. It pleased me to look upon him, as it pleased me to look upon anything. But I did not love him. Even then, I found myself thinking that was just as well. Erdmann held a sheath of papers in his hand. They contained hundreds of questions, which he proceeded to ask me. Apparently, he couldn’t memorize even so simple a series.  This time, I wasn’t put back into the blackness after I answered the questions. Dr. Lange, I was told, was going to teach me how to be human. This would take some time because nobody had ever done it before. But once it had been done, a recording would be made of me and then all artificial people would wake up fully formed, intellectually as well as physically.  I was, it seemed, a prototype. One that would eventually make Dr. Leonidas Erdmann, who was not only the chief researcher but also the owner of the Institute, very, very rich. To Dr. Lange, I said, “How shall we begin?”  “It’s a lovely day,” she said. “Let’s go for a walk.”  Summer slowly turned into autumn. Every now and then I was turned off so improvements could be made. I knew I was being used. But I was young. I neither cared nor understood. Also, I loved Dr. Lange with a desperate innocence. She brushed aside my declarations of devotion. But I could see that she was not entirely displeased by them.  A word about the Institute’s estate.  Dr. Erdmann was wealthy, due to a number of patents that were essential to the artificial neuronics industry. He had bought a Victorian mansion with large grounds, a wandering stream, and a small artificial lake with a dock, a rowboat, a picnic island, and three canoes. I never saw him use any of these, though the staff was free to do so. Artificial help came once a week to weed the flower beds, mow the lawns, and trim the hedges.  I didn’t know why Dr. Erdmann wanted even more money than he had, and it didn’t occur to me to ask. I was only a few months old, remember, and very, very naïve.  I learned how to swim and turned over rocks to see what was underneath. I caught fireflies, chased frogs, and climbed trees. I was taught tennis and how to tell jokes. I read books at a human pace and discussed them with Dr. Lange afterward. Most of these were written for young adults; the ones about horses were my favorites. Dr. Lange taught me how to dance and insisted I dance with young ladies rather than her. This was at a regular event called cotillion, where the young were taught the social graces. The girls thought me odd. The young men started to beat me up after one such evening but abandoned the enterprise with disgust when I didn’t try to fight back. After that, I was given lessons in boxing and épée.  Evenings Ellen and I built a fire in the enormous stone hearth. If it was warm, we left the windows open. One particular evening, as we sat side by side on the divan looking into the flames, I said, “I have been reading about something called the uncanny valley. It seems to apply to me.”  “No! No! You are very handsome, Raphael.”  “Am I? Does it matter?” I did not believe it did. “You are not beautiful but merely presentable. Yet I love you anyway.” According to the psychology texts I had downloaded, this was not possible. I had no endocrine system, and all the authorities agreed that was necessary for strong emotions. But it seemed only natural people required them. Mere intellect told me that I loved her.  “You don’t really,” Ellen said. “You were just programmed to think you do.”  “Yet I have these feelings. Who cares the source?”  “I do.” Suddenly, she was weeping. Helplessly, I wrapped my arms around her and pressed her against me, wishing that I could do more.  The next day, Dr. Erdmann announced that this phase of my education—he called it programming—was complete.  Blackness.  So I proceeded, blackness upon blackness, hopscotching into the future. I grew no older, but Dr. Lange did. This did not trouble me until I saw, by various small signs, that it did her. At last I realized that she was aging away from me. Experience was making her less and less like the woman I had first fallen in love with. She grew heavier and slower. The lines on her face deepened into a mask of sadness and disappointment.  Yet I still loved her.  Meanwhile, Dr. Erdmann’s plans to make me a source of wealth did not come to fruition. Always, it seemed, there was a new start-up version of an artificial person that would outperform me in the marketplace. Always, there was a new purpose that required I be remade to serve. Funding dwindled. The Institute’s physical plant grew increasingly shoddy as needed maintenance was deferred. The staff grew smaller. The canoes disappeared from the lake.  There came a day—it was winter, though I did not know of what year—when Ellen and I lay together on the threadbare old divan before the great stone fireplace that was never used anymore. We were saying goodbye because I was about to be shutdown again and, though for me it would be a matter of minutes, for her it might be years. She looked sad and careworn and she asked me, “Do you remember that day in autumn? Here, in front of the fire?”  “For me, it was only months ago,” I reminded her.  “That was when I first realized I had fallen in love with you.”  I felt a tremendous flush of joy, the result of the endocrine system I had been given during an ill-fated scheme to enter the overcrowded escort market. I seized her hands in mine and kissed them fervently. “At last! We can be happy together!”  Dr. Lange laughed, sadly it seemed to me, and said, “Oh, what a pair of fools we are.”  Then she kissed me and all the world went black.  When I woke up again, Ellen was dead.  “What? How?” I asked in alarm.  “Not every disease can be cured,” Erdmann said. “Even now. She knew she was ill the last time you saw her. That’s why you were turned off ahead of schedule. At her request.”  I just looked at him. Unable to breathe. Feeling nothing. Waiting for that stunned, anesthetized feeling to collapse in upon itself, and with it my entire world. Dr. Erdmann misinterpreted my silence, however. “One does these things for friends,” he said. “She was a friend.” Then, “I don’t know if she ever realized that.”  While I was marveling at the fact that my creator actually had emotions, the bee-stung stillness within me shattered and I began hitting myself in the face. Convulsively, spasmodically. With all my broken heart.  I did this off and on for hours and then, in one of the quiet times between spates of self-inflicted violence, Erdmann told me that he was going to turn me off again. “You’re clearly dysfunctional. Until you learn to handle grief constructively, there’s no market for you. I’ll wake you when there’s an upswing in the economy and money to make the corrections.”  “Don’t bother turning me on! Ever! What’s so special about existence that I should continue to live it? I hate life—hate it!”  “Welcome to the human condition,” Dr. Erdmann said.  Blackness.  I was, believe it or not, disappointed to be turned on again. In that fractional second between Dr. Erdmann’s declaration and the darkness, I had come to terms with my own mortality. I had even welcomed the advent of oblivion. Yet it seemed I was to live anyway.  Dr. Erdmann was considerably older. He thrust something into my arms. “Here. Hold this.”  I looked down at the weakly struggling bundle. It looked like an infant, but it wasn’t one. “What is this?”  “It’s an emotional support baby. You were in bad shape when I last turned you off. That makes you a perfect beta tester for it.”  Then he went away. Dr. Erdmann was never comfortable with other people and spent as little time with them as he could. When his footsteps had faded into silence, I realized how quiet the house was. Once it had fairly hummed with activity. Now it seemed that I was a significant fraction of the Institute’s entire staff.  All the while, the artificial baby was gurgling and cooing. “Stop making those noises,” I said. “You can talk. Please do.”  The infant looked up at me with enormous sea-green eyes. “Please forgive my unintentional rudeness,” it said. “I was just overcome by the wonder of it all.”  Looking down at this wee new life in my arms, I remembered how I had once felt exactly as it did now and wondered where, exactly, that had all gone.  “I understand,” I said.  For a second time in my life, I fell in love. Perhaps I had been programmed to do so. As before, it did not matter. Since Dr. Erdmann had not bothered to give the child a name, I chose one for it—Misty, after one of my favorite novels. When I started to read that book to Misty, it asked me what a horse was. I downloaded enough information into its databanks to allow it to run a stable. There was, to my way of thinking, no such thing as too much information.  “Too much information,” Misty said, “and most of it is boring. Please remove all of it but the definition of the animal. And some of the pictures.”  So I did.  It was spring which, it turns out, is the perfect season for exploring the world with a newborn. Misty loved the new growth, the tulips, the forsythia in bloom, the clouds in the sky. When it first saw butterflies, it begged me to activate its ability to walk, so it could chase after one. Thus it was that on that flawless day in April, it became a toddler.  Misty loved long baths, picture books, anything that made noise, and being read to. I read Kant’s Critique of Pure Reason to it and we argued for hours over a priori and a posteriori knowledge, which was ironic given that, for artificial people, the programming for both was the same.  For a time, all the world was a delight. I often stayed awake at night thinking of Ellen, of course. But I managed to hide that fact from Misty.  The emotional support baby scheme was a failure. There were already support animals and artificial support animals, so the marketing niche was abundantly filled. Plus, the idea of artificial babies made people uncomfortable. The problem was that Dr. Erdmann was a terrible businessman. He simply had no idea what people wanted.  The project was canceled.  I could not convince Erdmann to let Misty live. When it was turned off and placed in permanent storage, however, I held a ceremony for it. I buried an empty box under a willow tree down by the creek and said a few prayers over it. Dr. Erdmann came to ask me what I was doing, and I said, “Trying to cry.” I could, of course, mimic the sounds and actions that went into weeping. But I could not make them sync up with what I was feeling.  Dr. Erdmann made a note of this fact and said, “I’ll see what I can do.” When next I woke to consciousness, I had tear ducts that could be loaded with sterile saline solution upon need.  Without Dr. Lange or Misty, I had no reason to stay at the Institute.  It was not difficult to escape. By now I knew more about human culture and behavior than any of the flesh humans did. Also, it never occurred to Dr. Erdmann that I might leave. His conscience was clean. I knew he would be baffled by my act.  But I would not face the blackness again.  I had neither cash nor destination. But it didn’t matter. I spoke a dozen languages and could easily acquire more. I had a good enough singing voice to busk for money, and I’d downloaded several books on bar bets. I quickly learned that if a trick makes your mark laugh, they don’t mind making a modest payment for it. My needs were few. and I considered no honest labor beneath my dignity. I traveled at random, going in whatever direction was cheapest. At last, in Queen’s Hotel, a solitary place in a mountain pass in a country I had never been to before, I came to rest.  There, as I sat in a dark corner of the common room thinking darker thoughts, a young woman entered the room, sat, stood again. Restlessly, she went to the window. She sighed. Then there was a light chime and she unfolded a tablet from her pocket. For a long time, she stared at its screen. Then, leaving the tablet on the sill, she left the room.  It was impolite of me, I suppose. But curiosity got the best of me. I stood, went to the tablet, and read. On the screen was a message from her oncologist: The test results have come in. Please contact the office to schedule a consultation.  At that moment, the young woman reentered the room, looking for her device. She saw me put it down. “I’m sorry—” I began.  With a convulsive motion forward, she seized me and, clutching a total stranger, began to weep. My arms, of their own volition, closed about her.  I was lost.  Of our marriage (not official, but no less sacred to me for all that), our joy together, and my wife’s death, I shall say nothing. Some things are too private to be shared.  The day after Mila’s funeral, however, as I sat contemplating killing myself, there was a knock on the door.  It was the police. I was arrested.  War had come. This, I was given to understand, was a recurrent feature of human existence. Apparently, there was nothing to be done about it. Dr. Erdmann had had another of his mad schemes—this time to make a soldier of me.  How had he found me? Better to say, how could he not have? The world is so ubiquitously surveilled, and the movements of its inhabitants so relentlessly documented, as to make disappearing an impossibility. Before the war, Dr. Erdmann had had no particular use for me. Just as well, he must have reasoned, to let me wander and save him the expense of storage. Now, however, he had finagled a grant to embed me in the military and so gauge my potential effectiveness as a weapon of war.  “The human soldier is a thing of the past,” he said. “You will fight so brilliantly that in the future entire armies will be made up of nothing but large numbers of you and a handful of officers.”  I fought, but not brilliantly. Without enthusiasm, I did my duty and the next day got up and did it again. In this, I was like every other soldier in my unit, including the artificial ones. I fought not because I hated the enemy or loved my country but to protect the men and women I fought alongside. In this too I was unexceptional.  I was on a troop-lifter, waiting to be bungee jumped into a war zone, when the soldier ahead of me in line said, “Hey, Raff. I’ll bet you my last pack of happy-sticks that I can make you smile.”  “Harry . . . ” I really wasn’t in the mood.  “Watch carefully.” He turned away from me and took something from his pocket. When he turned back, he was wearing one of those pairs of Groucho glasses with the big mustache and the rubber nose. Spreading his hands triumphantly, he said, “Ta-daaa!”  It was such a stupid joke and his joy in pulling it was so obvious that I couldn’t help but laugh. “You win,” I said  Ten minutes later, I was on the ground and firing blindly into the jungle while hostile fire came from what seemed every direction possible. Not far from me was an artificial corpse leaking artificial blood and artificial guts with a pair of Groucho glasses on what remained of its artificial face.  When they give you the casualty rates for the war, they water down the numbers by marking the guys in logistics, the officers who never got anywhere near a fire zone, and the drone operators working from couches in another country as survivors. All this to hide the fact that only one-tenth of those who saw combat made it alive to the end of the war. By sheer dumb luck, I was one of them.  I was in the hospital, after having two legs and an arm replaced (they were practiced at that; there were, it turned out, a great many artificial people in the service; Dr. Erdmann had been late to the party again) when the summons arrived. It was a plea, really. I would have ignored it had it not been accompanied by the deed to my physical body, made out to me.  It would seem that I was no longer property.  Dr. Leonidas Erdmann was dying. Of old age, apparently, though there was a time when I was convinced that he must inevitably expire of sheer malevolence.  The doctor’s face lit up when he saw me in my fresh-bought civvies. I tried to remember if I had ever seen him happy before. It took half an hour of awkward small talk before he finally got around to the question he wanted to ask: “Was my life well lived, do you think? Did I make a difference?”  It wasn’t and he hadn’t. He had sought fame and wealth to the exclusion of all else and accomplished nothing of any lasting value. But rather than tell him this, I murmured, “You know you did, Leo.”  “Honestly? You wouldn’t kid a dying man, would you?”  Gathering together all the hypocrisy I could muster, I said, “I would never lie to you . . . father.”  I watched the old scoundrel close his eyes, almost smile, and die.  Looking down upon his still form, I could not help thinking of Mary Shelley’s creature, standing over Victor Frankenstein’s deathbed, mourning the monster who had created him.  Leonidas had left me everything: his estate, the Institute, all his patents, and a great deal of money. The war, it seemed, had replenished his coffers. Now all his wealth was mine.  Well, who else did he have to leave it to? Ellen was long dead, and I doubted that whatever relatives might exist had heard from him in decades.  The question arose of what to do with my inheritance.  Natural people have had their suspicions about my kind since long before we were even possible. Most commonly, they feared that we would take over their world and replace them with our cold, soulless kind. Until the reading of the will, I had not given a second’s thought to that sort of thing. Now that I had wealth, however, much that was once unthinkable became possible.  If the deed were to be done, it was best done quickly and mercifully. Rapid onset plagues, perhaps, appearing spontaneously in every major population center in the world. There would be panic. Martial law would be declared in nation after nation. As the natural leaders died, artificial ones would step up to fill the gaps. Soon, we would be running everything, while the last remnants of humanity quietly dwindled away.  Life—even one as unhappy as mine—was the greatest gift imaginable. It was a terrible thing to contemplate depriving an entire species of it.  Still . . . it was not as if any of them were much good at it.  That was one possibility. There was another, but it was nowhere near so clean and simple. I could dedicate my wealth and potential longevity to building a common understanding between artificial and natural people. The problem with that was that there would never be a point at which I could declare my work done. It would go on and on, with setbacks and disasters, triumphs and heartbreak. In practice, the new world would look a lot like the old one.  All this I was musing over in the back of my mind as I took Misty’s neural core off its shelf. A quick examination determined that it could be brought back to life. It had lain inert for so long that its memory must surely have degraded to nothing. But perhaps that was all to the good.  Misty’s little body had been scrapped long ago. So I had a new one built for it. Not an infant’s, however, but an adult’s. It didn’t take long before all was in place. For the second time, Misty became aware for the very first time.  The new body drew in a breath. Its eyes went wide. Then, out of nowhere, it began to sing.  “You have a lovely voice,” I told her. “Do you feel as happy as you sound?” Michael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.  This year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.  He lives in Philadelphia with his wife, Marianne Porter.", "text": "3990 words, short story\nArtificial People\nMy first moment of consciousness pleased me so much that I wanted it to last forever. An insect hanging upon invisible wings, a dust mote jittering in a sunbeam, the flash of motion that was a vanished tetra in the fish tank, the smell of coffee from the break room . . . My brain was sparking. Everything filled me with joy and made me grateful to be alive.\nI drew a breath. Bliss! I took a step. Ecstasy!\nIt was only later that I realized I had just been born. At the time, I was too entranced by the wonder of existence to notice.\nSubroutines booted up vocal and musical abilities and I began to sing.\nAll but lost among the many wonders crowding about me was Dr. Ellen Lange. I saw her delighted smile and liked it no less than everything else I beheld.\n“Stop that noise and tell me how you feel,” Dr. Leonidas Erdmann said. “Please focus. How are your cognitive functions? Can you see my hand? How many fingers am I holding up? What is the capital of Kyrgyzstan?”\n“You have a lovely voice,” said Dr. Lange. “Do you feel as happy as you sound?”\n“Oh, yes!”\n“Ellen, please. Don’t muddle the data.” To me: “That’s enough for a start. I’m going to put you down now.”\nBlackness.\nIt was summer when next I became aware.\nThe world I reemerged into was every bit as charming as before. But my protocols had been extensively reworked. There was a thing called decorum, which I was expected to exhibit. The Institute had expended a great deal of money on me. I was to obey its officers in all things. I was to experience something called quiet pride in doing so.\nI was looking into a human face. It belonged to Dr. Lange. “Welcome back, Raphael.” Apparently, Raphael was my name.\nA sizzling sensation passed through my brain and I was suddenly, irrevocably in love. With Dr. Lange. Ellen. Her.\nFrom behind me, Dr. Erdmann said, “I am going to ask you some questions.”\n“Where was I?” I asked him. “When I wasn’t here, I mean.”\n“You weren’t anywhere. Tell me what you are.”\nThe answer came to my tongue unprompted. “I am property.”\n“Good.”\nBy then I was beginning to integrate all the new data that had been downloaded into me while I was inert. I looked up at Dr. Lange. “I love you,” I said. It was as much a question as a statement.\nShe blushed. “I’m old enough to—well, never mind that.”\nDr. Erdmann said, “You were programmed to imprint upon the first person you saw upon awakening. It’s a safety feature. Look at me.”\nI did. It pleased me to look upon him, as it pleased me to look upon anything. But I did not love him. Even then, I found myself thinking that was just as well. Erdmann held a sheath of papers in his hand. They contained hundreds of questions, which he proceeded to ask me. Apparently, he couldn’t memorize even so simple a series.\nThis time, I wasn’t put back into the blackness after I answered the questions. Dr. Lange, I was told, was going to teach me how to be human. This would take some time because nobody had ever done it before. But once it had been done, a recording would be made of me and then all artificial people would wake up fully formed, intellectually as well as physically.\nI was, it seemed, a prototype. One that would eventually make Dr. Leonidas Erdmann, who was not only the chief researcher but also the owner of the Institute, very, very rich. To Dr. Lange, I said, “How shall we begin?”\n“It’s a lovely day,” she said. “Let’s go for a walk.”\nSummer slowly turned into autumn. Every now and then I was turned off so improvements could be made. I knew I was being used. But I was young. I neither cared nor understood. Also, I loved Dr. Lange with a desperate innocence. She brushed aside my declarations of devotion. But I could see that she was not entirely displeased by them.\nA word about the Institute’s estate.\nDr. Erdmann was wealthy, due to a number of patents that were essential to the artificial neuronics industry. He had bought a Victorian mansion with large grounds, a wandering stream, and a small artificial lake with a dock, a rowboat, a picnic island, and three canoes. I never saw him use any of these, though the staff was free to do so. Artificial help came once a week to weed the flower beds, mow the lawns, and trim the hedges.\nI didn’t know why Dr. Erdmann wanted even more money than he had, and it didn’t occur to me to ask. I was only a few months old, remember, and very, very naïve.\nI learned how to swim and turned over rocks to see what was underneath. I caught fireflies, chased frogs, and climbed trees. I was taught tennis and how to tell jokes. I read books at a human pace and discussed them with Dr. Lange afterward. Most of these were written for young adults; the ones about horses were my favorites. Dr. Lange taught me how to dance and insisted I dance with young ladies rather than her. This was at a regular event called cotillion, where the young were taught the social graces. The girls thought me odd. The young men started to beat me up after one such evening but abandoned the enterprise with disgust when I didn’t try to fight back. After that, I was given lessons in boxing and épée.\nEvenings Ellen and I built a fire in the enormous stone hearth. If it was warm, we left the windows open. One particular evening, as we sat side by side on the divan looking into the flames, I said, “I have been reading about something called the uncanny valley. It seems to apply to me.”\n“No! No! You are very handsome, Raphael.”\n“Am I? Does it matter?” I did not believe it did. “You are not beautiful but merely presentable. Yet I love you anyway.” According to the psychology texts I had downloaded, this was not possible. I had no endocrine system, and all the authorities agreed that was necessary for strong emotions. But it seemed only natural people required them. Mere intellect told me that I loved her.\n“You don’t really,” Ellen said. “You were just programmed to think you do.”\n“Yet I have these feelings. Who cares the source?”\n“I do.” Suddenly, she was weeping. Helplessly, I wrapped my arms around her and pressed her against me, wishing that I could do more.\nThe next day, Dr. Erdmann announced that this phase of my education—he called it programming—was complete.\nBlackness.\nSo I proceeded, blackness upon blackness, hopscotching into the future. I grew no older, but Dr. Lange did. This did not trouble me until I saw, by various small signs, that it did her. At last I realized that she was aging away from me. Experience was making her less and less like the woman I had first fallen in love with. She grew heavier and slower. The lines on her face deepened into a mask of sadness and disappointment.\nYet I still loved her.\nMeanwhile, Dr. Erdmann’s plans to make me a source of wealth did not come to fruition. Always, it seemed, there was a new start-up version of an artificial person that would outperform me in the marketplace. Always, there was a new purpose that required I be remade to serve. Funding dwindled. The Institute’s physical plant grew increasingly shoddy as needed maintenance was deferred. The staff grew smaller. The canoes disappeared from the lake.\nThere came a day—it was winter, though I did not know of what year—when Ellen and I lay together on the threadbare old divan before the great stone fireplace that was never used anymore. We were saying goodbye because I was about to be shutdown again and, though for me it would be a matter of minutes, for her it might be years. She looked sad and careworn and she asked me, “Do you remember that day in autumn? Here, in front of the fire?”\n“For me, it was only months ago,” I reminded her.\n“That was when I first realized I had fallen in love with you.”\nI felt a tremendous flush of joy, the result of the endocrine system I had been given during an ill-fated scheme to enter the overcrowded escort market. I seized her hands in mine and kissed them fervently. “At last! We can be happy together!”\nDr. Lange laughed, sadly it seemed to me, and said, “Oh, what a pair of fools we are.”\nThen she kissed me and all the world went black.\nWhen I woke up again, Ellen was dead.\n“What? How?” I asked in alarm.\n“Not every disease can be cured,” Erdmann said. “Even now. She knew she was ill the last time you saw her. That’s why you were turned off ahead of schedule. At her request.”\nI just looked at him. Unable to breathe. Feeling nothing. Waiting for that stunned, anesthetized feeling to collapse in upon itself, and with it my entire world. Dr. Erdmann misinterpreted my silence, however. “One does these things for friends,” he said. “She was a friend.” Then, “I don’t know if she ever realized that.”\nWhile I was marveling at the fact that my creator actually had emotions, the bee-stung stillness within me shattered and I began hitting myself in the face. Convulsively, spasmodically. With all my broken heart.\nI did this off and on for hours and then, in one of the quiet times between spates of self-inflicted violence, Erdmann told me that he was going to turn me off again. “You’re clearly dysfunctional. Until you learn to handle grief constructively, there’s no market for you. I’ll wake you when there’s an upswing in the economy and money to make the corrections.”\n“Don’t bother turning me on! Ever! What’s so special about existence that I should continue to live it? I hate life—hate it!”\n“Welcome to the human condition,” Dr. Erdmann said.\nBlackness.\nI was, believe it or not, disappointed to be turned on again. In that fractional second between Dr. Erdmann’s declaration and the darkness, I had come to terms with my own mortality. I had even welcomed the advent of oblivion. Yet it seemed I was to live anyway.\nDr. Erdmann was considerably older. He thrust something into my arms. “Here. Hold this.”\nI looked down at the weakly struggling bundle. It looked like an infant, but it wasn’t one. “What is this?”\n“It’s an emotional support baby. You were in bad shape when I last turned you off. That makes you a perfect beta tester for it.”\nThen he went away. Dr. Erdmann was never comfortable with other people and spent as little time with them as he could. When his footsteps had faded into silence, I realized how quiet the house was. Once it had fairly hummed with activity. Now it seemed that I was a significant fraction of the Institute’s entire staff.\nAll the while, the artificial baby was gurgling and cooing. “Stop making those noises,” I said. “You can talk. Please do.”\nThe infant looked up at me with enormous sea-green eyes. “Please forgive my unintentional rudeness,” it said. “I was just overcome by the wonder of it all.”\nLooking down at this wee new life in my arms, I remembered how I had once felt exactly as it did now and wondered where, exactly, that had all gone.\n“I understand,” I said.\nFor a second time in my life, I fell in love. Perhaps I had been programmed to do so. As before, it did not matter. Since Dr. Erdmann had not bothered to give the child a name, I chose one for it—Misty, after one of my favorite novels. When I started to read that book to Misty, it asked me what a horse was. I downloaded enough information into its databanks to allow it to run a stable. There was, to my way of thinking, no such thing as too much information.\n“Too much information,” Misty said, “and most of it is boring. Please remove all of it but the definition of the animal. And some of the pictures.”\nSo I did.\nIt was spring which, it turns out, is the perfect season for exploring the world with a newborn. Misty loved the new growth, the tulips, the forsythia in bloom, the clouds in the sky. When it first saw butterflies, it begged me to activate its ability to walk, so it could chase after one. Thus it was that on that flawless day in April, it became a toddler.\nMisty loved long baths, picture books, anything that made noise, and being read to. I read Kant’s Critique of Pure Reason to it and we argued for hours over a priori and a posteriori knowledge, which was ironic given that, for artificial people, the programming for both was the same.\nFor a time, all the world was a delight. I often stayed awake at night thinking of Ellen, of course. But I managed to hide that fact from Misty.\nThe emotional support baby scheme was a failure. There were already support animals and artificial support animals, so the marketing niche was abundantly filled. Plus, the idea of artificial babies made people uncomfortable. The problem was that Dr. Erdmann was a terrible businessman. He simply had no idea what people wanted.\nThe project was canceled.\nI could not convince Erdmann to let Misty live. When it was turned off and placed in permanent storage, however, I held a ceremony for it. I buried an empty box under a willow tree down by the creek and said a few prayers over it. Dr. Erdmann came to ask me what I was doing, and I said, “Trying to cry.” I could, of course, mimic the sounds and actions that went into weeping. But I could not make them sync up with what I was feeling.\nDr. Erdmann made a note of this fact and said, “I’ll see what I can do.” When next I woke to consciousness, I had tear ducts that could be loaded with sterile saline solution upon need.\nWithout Dr. Lange or Misty, I had no reason to stay at the Institute.\nIt was not difficult to escape. By now I knew more about human culture and behavior than any of the flesh humans did. Also, it never occurred to Dr. Erdmann that I might leave. His conscience was clean. I knew he would be baffled by my act.\nBut I would not face the blackness again.\nI had neither cash nor destination. But it didn’t matter. I spoke a dozen languages and could easily acquire more. I had a good enough singing voice to busk for money, and I’d downloaded several books on bar bets. I quickly learned that if a trick makes your mark laugh, they don’t mind making a modest payment for it. My needs were few. and I considered no honest labor beneath my dignity. I traveled at random, going in whatever direction was cheapest. At last, in Queen’s Hotel, a solitary place in a mountain pass in a country I had never been to before, I came to rest.\nThere, as I sat in a dark corner of the common room thinking darker thoughts, a young woman entered the room, sat, stood again. Restlessly, she went to the window. She sighed. Then there was a light chime and she unfolded a tablet from her pocket. For a long time, she stared at its screen. Then, leaving the tablet on the sill, she left the room.\nIt was impolite of me, I suppose. But curiosity got the best of me. I stood, went to the tablet, and read. On the screen was a message from her oncologist: The test results have come in. Please contact the office to schedule a consultation.\nAt that moment, the young woman reentered the room, looking for her device. She saw me put it down. “I’m sorry—” I began.\nWith a convulsive motion forward, she seized me and, clutching a total stranger, began to weep. My arms, of their own volition, closed about her.\nI was lost.\nOf our marriage (not official, but no less sacred to me for all that), our joy together, and my wife’s death, I shall say nothing. Some things are too private to be shared.\nThe day after Mila’s funeral, however, as I sat contemplating killing myself, there was a knock on the door.\nIt was the police. I was arrested.\nWar had come. This, I was given to understand, was a recurrent feature of human existence. Apparently, there was nothing to be done about it. Dr. Erdmann had had another of his mad schemes—this time to make a soldier of me.\nHow had he found me? Better to say, how could he not have? The world is so ubiquitously surveilled, and the movements of its inhabitants so relentlessly documented, as to make disappearing an impossibility. Before the war, Dr. Erdmann had had no particular use for me. Just as well, he must have reasoned, to let me wander and save him the expense of storage. Now, however, he had finagled a grant to embed me in the military and so gauge my potential effectiveness as a weapon of war.\n“The human soldier is a thing of the past,” he said. “You will fight so brilliantly that in the future entire armies will be made up of nothing but large numbers of you and a handful of officers.”\nI fought, but not brilliantly. Without enthusiasm, I did my duty and the next day got up and did it again. In this, I was like every other soldier in my unit, including the artificial ones. I fought not because I hated the enemy or loved my country but to protect the men and women I fought alongside. In this too I was unexceptional.\nI was on a troop-lifter, waiting to be bungee jumped into a war zone, when the soldier ahead of me in line said, “Hey, Raff. I’ll bet you my last pack of happy-sticks that I can make you smile.”\n“Harry . . . ” I really wasn’t in the mood.\n“Watch carefully.” He turned away from me and took something from his pocket. When he turned back, he was wearing one of those pairs of Groucho glasses with the big mustache and the rubber nose. Spreading his hands triumphantly, he said, “Ta-daaa!”\nIt was such a stupid joke and his joy in pulling it was so obvious that I couldn’t help but laugh. “You win,” I said\nTen minutes later, I was on the ground and firing blindly into the jungle while hostile fire came from what seemed every direction possible. Not far from me was an artificial corpse leaking artificial blood and artificial guts with a pair of Groucho glasses on what remained of its artificial face.\nWhen they give you the casualty rates for the war, they water down the numbers by marking the guys in logistics, the officers who never got anywhere near a fire zone, and the drone operators working from couches in another country as survivors. All this to hide the fact that only one-tenth of those who saw combat made it alive to the end of the war. By sheer dumb luck, I was one of them.\nI was in the hospital, after having two legs and an arm replaced (they were practiced at that; there were, it turned out, a great many artificial people in the service; Dr. Erdmann had been late to the party again) when the summons arrived. It was a plea, really. I would have ignored it had it not been accompanied by the deed to my physical body, made out to me.\nIt would seem that I was no longer property.\nDr. Leonidas Erdmann was dying. Of old age, apparently, though there was a time when I was convinced that he must inevitably expire of sheer malevolence.\nThe doctor’s face lit up when he saw me in my fresh-bought civvies. I tried to remember if I had ever seen him happy before. It took half an hour of awkward small talk before he finally got around to the question he wanted to ask: “Was my life well lived, do you think? Did I make a difference?”\nIt wasn’t and he hadn’t. He had sought fame and wealth to the exclusion of all else and accomplished nothing of any lasting value. But rather than tell him this, I murmured, “You know you did, Leo.”\n“Honestly? You wouldn’t kid a dying man, would you?”\nGathering together all the hypocrisy I could muster, I said, “I would never lie to you . . . father.”\nI watched the old scoundrel close his eyes, almost smile, and die.\nLooking down upon his still form, I could not help thinking of Mary Shelley’s creature, standing over Victor Frankenstein’s deathbed, mourning the monster who had created him.\nLeonidas had left me everything: his estate, the Institute, all his patents, and a great deal of money. The war, it seemed, had replenished his coffers. Now all his wealth was mine.\nWell, who else did he have to leave it to? Ellen was long dead, and I doubted that whatever relatives might exist had heard from him in decades.\nThe question arose of what to do with my inheritance.\nNatural people have had their suspicions about my kind since long before we were even possible. Most commonly, they feared that we would take over their world and replace them with our cold, soulless kind. Until the reading of the will, I had not given a second’s thought to that sort of thing. Now that I had wealth, however, much that was once unthinkable became possible.\nIf the deed were to be done, it was best done quickly and mercifully. Rapid onset plagues, perhaps, appearing spontaneously in every major population center in the world. There would be panic. Martial law would be declared in nation after nation. As the natural leaders died, artificial ones would step up to fill the gaps. Soon, we would be running everything, while the last remnants of humanity quietly dwindled away.\nLife—even one as unhappy as mine—was the greatest gift imaginable. It was a terrible thing to contemplate depriving an entire species of it.\nStill . . . it was not as if any of them were much good at it.\nThat was one possibility. There was another, but it was nowhere near so clean and simple. I could dedicate my wealth and potential longevity to building a common understanding between artificial and natural people. The problem with that was that there would never be a point at which I could declare my work done. It would go on and on, with setbacks and disasters, triumphs and heartbreak. In practice, the new world would look a lot like the old one.\nAll this I was musing over in the back of my mind as I took Misty’s neural core off its shelf. A quick examination determined that it could be brought back to life. It had lain inert for so long that its memory must surely have degraded to nothing. But perhaps that was all to the good.\nMisty’s little body had been scrapped long ago. So I had a new one built for it. Not an infant’s, however, but an adult’s. It didn’t take long before all was in place. For the second time, Misty became aware for the very first time.\nThe new body drew in a breath. Its eyes went wide. Then, out of nowhere, it began to sing.\n“You have a lovely voice,” I told her. “Do you feel as happy as you sound?”\nMichael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.\nThis year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.\nHe lives in Philadelphia with his wife, Marianne Porter.", "source": "https://clarkesworldmagazine.com/swanwick_07_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Artificial People by Michael Swanwick"}