{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2017-10-19", "categories": "", "tags": "", "fingerprint": "dEGEYC4dqf3wNCnmD9d9M5NwTAw=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Husky Genes and the Anthropocene: A Conversation with Paul McAuley  The only constant in life is change. For better or worse, everything is in flux. The more technologically advanced humans become, the more power we have to change the planet on a global scale. We’re already using science and technology to change ourselves.  Austral by Paul McAuley shows us a world where climate change has remade swaths of the earth. Antarctica has become somewhat habitable and human beings have started manipulating their own genes. Austral is a Husky, someone who has had their genetic code modified. Shunned by society, she works as a prison guard in Antarctica. But she’s also the estranged relative of a powerful politician. When that politician makes a visit to the prison where she works, she becomes embroiled in an escape plot but she hatches her own plan to earn what is rightfully hers.  Paul McAuley is a British botanist and author. He’s won the Philip K. Dick, Arthur C. Clarke, John W. Campbell, and the British Fantasy Award. His newest novel is Austral out from Gollancz on October 19th, 2017.   What inspired your novel Austral?  In 1997, I was one of a dozen or so scientists and writers at a meeting in a research station above the Arctic Circle in Sweden, discussing stories about science and the stories science tells itself. It was May, the beginning of summer’s white nights, when the sun never sets, yet snow was still a couple of meters deep and at all hours, people were buzzing around on snow mobiles or tramping out to ice-fishing huts on a frozen lake nearby.  On our day off, some of us took a train to Tromsø, in Norway. As the train descended towards the coast, we passed through an entire season, from a snowy plateau to conifer forests stepping down towards fjords, and that’s what I drew on, some twenty years later, when I began to consider writing about the greening of polar territories during global warming. What use would people find for these new lands? How would they live there, and how would living there change them?  Why Antarctica? There had already been a good number of novels set in various versions of a warming Arctic by the time I began to think about Austral, and when I was growing up the story of Robert Scott’s doomed attempt to be the first to reach the south pole was still part of the British national mythos.  I read Apsley Cherry-Garrard’s fantastic account of Scott’s Terra Nova expedition, The Worst Journey in the World, at an impressionable age, and reread it before starting to write Austral. More inspiration came from a map of the land that lies beneath Antarctica’s ice cap, and a map of what Antarctica would look like if all that ice melted (the two maps aren’t the same, because sea levels would be raised by melting of the ice, and removal of its weight would cause some of the land to rise). I also studied detailed maps of the Antarctic Peninsula, the northernmost part of the continent, which is already being affected by climate change. The trek that Austral makes is through the actual territory of the peninsula; the towns and settlements are named for real places.  Austral features a unique look into the future at the effects of global warming. What inspired your creation of the ecopoets?  Most geologists agree that we have entered a new epoch, the Anthropocene, where human activity is laying down recognizable markers that will persist for millions of years—carbon isotopes spread by nuclear tests, plastic waste, fly ash, and concrete—and has become a force that’s reshaping the planet towards an unknown end point. There are plenty of fictional dystopic visions of how climate change will change the world, but few that explore how people might be able to accommodate to those changes, and do their best to ameliorate them. How it might be possible to have a good Anthropocene—or at least, the best possible Anthropocene.  To take responsibility for our actions, to adopt new ways of living, and to accept our place in nature and the responsibilities that come with it, and act accordingly. That’s the philosophy of the ecopoets, who are responsible for quickening the biomes spreading across new lands revealed by the retreat of the Antarctic ice. Terraforming is an old idea in science fiction—it was coined by Jack Williamson in his story “Collision Orbit” in 1942. The ecopoets are terraforming part of Earth by reclaiming it for nature.  Austral is a deep and complex character. Did she inspire the story or did the story come first and her creation second, a result of the story?  Story development and character development ran in parallel, both rising from Austral’s initial predicament, and her wrongheaded idea about how to best escape it. Many characters in science fiction are tough, competent, and always manage to make the right choices. I was interested in the story of a character who is tough and competent, yet always manages to make the wrong choice, and gets deeper and deeper into trouble. That’s what drives the story, complicated by her need to make sense of her family’s history, which is woven into the history of the colonization of Antarctica. The past casts a long shadow in the future of Austral, in all kinds of ways.  What was one piece of information you found when researching this novel that really surprised you?  That there are moss gardens in the Antarctic Peninsula, and they’re growing at an ever-faster rate as the territory warms. Also, too late for the novel: house flies, introduced via cruise ships, have now infiltrated the peninsula’s ecosystem.  How has your training in botany and zoology influenced your fiction?  It’s made me overcautious about getting things wrong, which means that I do far too much research. On the other hand, I do enjoy the research; part of my training enables me to ruthlessly track down pertinent information and squeeze useful data from it. And it has left me with an abiding interest in how species knit functioning ecologies together—the deep entangled complexity of the blooming, buzzing hedgerow which Darwin refers to in the final paragraph of The Origin of Species; entanglements whose checks and balances we still don’t fully understand. Like The Quiet War and Gardens of the Sun, Austral is a novel in which I explore that, and indulge in extreme gardening—the creation of new ecologies.  Austral moves along at a clip, how do you balance the quick pacing of the story with the quieter scenes of character development?  The quieter scenes are pauses for breath after intense moments, which gives a kind of natural rhythm to the story. I like to follow Graham Greene’s advice, in A Sort of Life, that action is best portrayed as economically as possible. ‘A subject, a verb, an object, perhaps a rhythm—little else.’ Tension lies not in the moment of action, but the build-up towards it, and how the characters deal with the aftermath. That’s where the quieter scenes come in. Two characters trying to come to terms with each other and their predicament.  What does your writing process look like?  Pretty messy and illogical, I guess. I don’t plan extensively, or write detailed outlines. Most of my writing—as far as novels are concerned, anyway—is a non-linear attempt to reach the end point of story that grows ever more complicated as it progresses. The first draft is quite often riddled with false starts and dead-ends, mostly because it takes a while to get inside the heads of my characters, and I’m forcing the story in directions they wouldn’t take. That’s done straight to screen, aided by all kinds of notes made on rough paper. When I finally have a first draft, the fun part—rewriting—begins. I scribble all over a printout, transcribe the changes and make more changes, then rinse and repeat as necessary.  What project are you working on next?  A kind of Samurai Western set on a dying world about six billion years in the future.  As a researcher at Oxford and UCLA, what were you working on? What did you discover?  I was working on plant-animal symbioses—specifically, animals with single-celled algae growing in certain parts of their cells. The animal provides a home and various nutrients; the algae secrete sugars and lipids which their hosts use. My model organism was the simple pond animal, green hydra, but I also worked on sea anemones and reef-forming corals. My principal discoveries centered on how the host cells control their populations of algae.  Symbiosis was a fairly obscure field back then (I quit to become a full-time writer in 1996), but now coral reefs are the canaries in the climate-change coal mine, and the deleterious effect of warming oceans on coral reefs hinge on their relationship with their symbiotic algae. Overwarm water stresses algae; the corals spit them out—that’s what coral bleaching is—and become weakened, often fatally. Coral-reef scientists were discussing this in the 1980s and 1990s, so I had an early window on one of the ways that climate change was reshaping our world. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nHusky Genes and the Anthropocene: A Conversation with Paul McAuley\nThe only constant in life is change. For better or worse, everything is in flux. The more technologically advanced humans become, the more power we have to change the planet on a global scale. We’re already using science and technology to change ourselves.\nAustral by Paul McAuley shows us a world where climate change has remade swaths of the earth. Antarctica has become somewhat habitable and human beings have started manipulating their own genes. Austral is a Husky, someone who has had their genetic code modified. Shunned by society, she works as a prison guard in Antarctica. But she’s also the estranged relative of a powerful politician. When that politician makes a visit to the prison where she works, she becomes embroiled in an escape plot but she hatches her own plan to earn what is rightfully hers.\nPaul McAuley is a British botanist and author. He’s won the Philip K. Dick, Arthur C. Clarke, John W. Campbell, and the British Fantasy Award. His newest novel is Austral out from Gollancz on October 19th, 2017.\nWhat inspired your novel Austral?\nIn 1997, I was one of a dozen or so scientists and writers at a meeting in a research station above the Arctic Circle in Sweden, discussing stories about science and the stories science tells itself. It was May, the beginning of summer’s white nights, when the sun never sets, yet snow was still a couple of meters deep and at all hours, people were buzzing around on snow mobiles or tramping out to ice-fishing huts on a frozen lake nearby.\nOn our day off, some of us took a train to Tromsø, in Norway. As the train descended towards the coast, we passed through an entire season, from a snowy plateau to conifer forests stepping down towards fjords, and that’s what I drew on, some twenty years later, when I began to consider writing about the greening of polar territories during global warming. What use would people find for these new lands? How would they live there, and how would living there change them?\nWhy Antarctica? There had already been a good number of novels set in various versions of a warming Arctic by the time I began to think about Austral, and when I was growing up the story of Robert Scott’s doomed attempt to be the first to reach the south pole was still part of the British national mythos.\nI read Apsley Cherry-Garrard’s fantastic account of Scott’s Terra Nova expedition, The Worst Journey in the World, at an impressionable age, and reread it before starting to write Austral. More inspiration came from a map of the land that lies beneath Antarctica’s ice cap, and a map of what Antarctica would look like if all that ice melted (the two maps aren’t the same, because sea levels would be raised by melting of the ice, and removal of its weight would cause some of the land to rise). I also studied detailed maps of the Antarctic Peninsula, the northernmost part of the continent, which is already being affected by climate change. The trek that Austral makes is through the actual territory of the peninsula; the towns and settlements are named for real places.\nAustral features a unique look into the future at the effects of global warming. What inspired your creation of the ecopoets?\nMost geologists agree that we have entered a new epoch, the Anthropocene, where human activity is laying down recognizable markers that will persist for millions of years—carbon isotopes spread by nuclear tests, plastic waste, fly ash, and concrete—and has become a force that’s reshaping the planet towards an unknown end point. There are plenty of fictional dystopic visions of how climate change will change the world, but few that explore how people might be able to accommodate to those changes, and do their best to ameliorate them. How it might be possible to have a good Anthropocene—or at least, the best possible Anthropocene.\nTo take responsibility for our actions, to adopt new ways of living, and to accept our place in nature and the responsibilities that come with it, and act accordingly. That’s the philosophy of the ecopoets, who are responsible for quickening the biomes spreading across new lands revealed by the retreat of the Antarctic ice. Terraforming is an old idea in science fiction—it was coined by Jack Williamson in his story “Collision Orbit” in 1942. The ecopoets are terraforming part of Earth by reclaiming it for nature.\nAustral is a deep and complex character. Did she inspire the story or did the story come first and her creation second, a result of the story?\nStory development and character development ran in parallel, both rising from Austral’s initial predicament, and her wrongheaded idea about how to best escape it. Many characters in science fiction are tough, competent, and always manage to make the right choices. I was interested in the story of a character who is tough and competent, yet always manages to make the wrong choice, and gets deeper and deeper into trouble. That’s what drives the story, complicated by her need to make sense of her family’s history, which is woven into the history of the colonization of Antarctica. The past casts a long shadow in the future of Austral, in all kinds of ways.\nWhat was one piece of information you found when researching this novel that really surprised you?\nThat there are moss gardens in the Antarctic Peninsula, and they’re growing at an ever-faster rate as the territory warms. Also, too late for the novel: house flies, introduced via cruise ships, have now infiltrated the peninsula’s ecosystem.\nHow has your training in botany and zoology influenced your fiction?\nIt’s made me overcautious about getting things wrong, which means that I do far too much research. On the other hand, I do enjoy the research; part of my training enables me to ruthlessly track down pertinent information and squeeze useful data from it. And it has left me with an abiding interest in how species knit functioning ecologies together—the deep entangled complexity of the blooming, buzzing hedgerow which Darwin refers to in the final paragraph of The Origin of Species; entanglements whose checks and balances we still don’t fully understand. Like The Quiet War and Gardens of the Sun, Austral is a novel in which I explore that, and indulge in extreme gardening—the creation of new ecologies.\nAustral moves along at a clip, how do you balance the quick pacing of the story with the quieter scenes of character development?\nThe quieter scenes are pauses for breath after intense moments, which gives a kind of natural rhythm to the story. I like to follow Graham Greene’s advice, in A Sort of Life, that action is best portrayed as economically as possible. ‘A subject, a verb, an object, perhaps a rhythm—little else.’ Tension lies not in the moment of action, but the build-up towards it, and how the characters deal with the aftermath. That’s where the quieter scenes come in. Two characters trying to come to terms with each other and their predicament.\nWhat does your writing process look like?\nPretty messy and illogical, I guess. I don’t plan extensively, or write detailed outlines. Most of my writing—as far as novels are concerned, anyway—is a non-linear attempt to reach the end point of story that grows ever more complicated as it progresses. The first draft is quite often riddled with false starts and dead-ends, mostly because it takes a while to get inside the heads of my characters, and I’m forcing the story in directions they wouldn’t take. That’s done straight to screen, aided by all kinds of notes made on rough paper. When I finally have a first draft, the fun part—rewriting—begins. I scribble all over a printout, transcribe the changes and make more changes, then rinse and repeat as necessary.\nWhat project are you working on next?\nA kind of Samurai Western set on a dying world about six billion years in the future.\nAs a researcher at Oxford and UCLA, what were you working on? What did you discover?\nI was working on plant-animal symbioses—specifically, animals with single-celled algae growing in certain parts of their cells. The animal provides a home and various nutrients; the algae secrete sugars and lipids which their hosts use. My model organism was the simple pond animal, green hydra, but I also worked on sea anemones and reef-forming corals. My principal discoveries centered on how the host cells control their populations of algae.\nSymbiosis was a fairly obscure field back then (I quit to become a full-time writer in 1996), but now coral reefs are the canaries in the climate-change coal mine, and the deleterious effect of warming oceans on coral reefs hinge on their relationship with their symbiotic algae. Overwarm water stresses algae; the corals spit them out—that’s what coral bleaching is—and become weakened, often fatally. Coral-reef scientists were discussing this in the 1980s and 1990s, so I had an early window on one of the ways that climate change was reshaping our world.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/mcauley_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Husky Genes and the Anthropocene: A Conversation with Paul McAuley by Chris Urie"}