{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mary Rosenblum", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "UBRIANFchQk7iMDGnqS2wqGcLS4=", "id": null, "license": null, "comments": "", "raw_text": "16160 words, novelette, REPRINT  Lion Walk  Tahira Ghani stared down at all that was left of the trespasser, the stunner pointed down at the summer yellow grass. The big California condor she had interrupted spread it’s huge stretch of wings and gave a reproachful squawk, scattering the smaller turkey vultures. A hot breeze washed their carrion scent over her, but she barely noticed. The pride probably hadn’t left much and the coy-dogs—well on their way to emulating the Pleistocene wild dogs—had cleaned up whatever the lions hadn’t eaten before the vultures even had a chance. She squatted beside the mess, smelling a trace of blood, spilled gut, lion, and the musky tang of violent death on the hot wind. A torn, bloodstained piece of black fabric fluttered in the breeze, snagged on a hawthorn. Flies swarmed over the few vertebrae and the piece of a rib that remained, the rags of flesh dark red-brown now, the color of old blood. A strand of auburn hair caught her eye, tangled among grass stems. Long. A woman? Like the other one. Caucasian this time. She read the diary of last night in the scuffed ground where the lions had killed, the tracks leading to it, faint on the dry grass, human prints overlaid with lion. She squatted, the stunner in one hand, her dun suncloth coverall hot against her thighs. Laid her fingertips lightly on the double imprint; woman, lion. Brought her hand to her mouth and touched her tongue to her fingertips, tasting dust, dead leaves, and lion.  Running. No shoes. Tahira stood, wiped her fingers on her coverall and circled the dusty patch of ground that gave up this information, shaded her eyes to stare at the single print, the faint ovals of toes, ball of foot. No blood, so she hadn’t been barefoot long. Frowning, she searched the prairie bisected by the willow-clad banks of the river. Maybe the intruder had thought the river could save her. Barefoot? In the distance, beyond the summer yellow grass and white fluff of the seeding thistles, the stark peaks of the Rockies jutted against the cloudless sky. Once they had had snow on them, even in the summer. Not in her lifetime. Her frown deepened as she studied the marks where the lions had lain to eat. Coy-dog tracks pocked the dust and flattened grass, along with the prints of the turkey vultures. The condor had chased them away and now they circled patiently overhead waiting for her to leave. By tomorrow, you’d find no traces to prove that someone had died and the lions had eaten here.  Tahira’s frown deepened as she used her link to video the site. She dug into her daypack for a plastic bag, waved the blow flies from the vertebrae and carefully bagged them. Plenty of flesh for a DNA identification. If this trespasser had wanted to be eaten, she could not have done a better job of placing herself in the old lioness’s path.  Just like the other one.  Tahira collected the fabric and hair, added them to the bag, then trudged back to her skimmer, stowed the stunner in the scabbard beneath the saddle and climbed aboard. The vultures were already descending, dodging the condor’s half-hearted feints, squabbling as they searched for overlooked scraps, their huge black wings raising dust from the scuffed ground. She pulled out her link and texted a report of the intruder’s death to her boss. Then she frowned at the screen and turned it off. He’ll scream about the PR aspects. Not now.  The fabric, torn, dirty, and bloody as it was, had had the feel of silk, the sexy kind of shirt you might buy to wear for a lover. Tahira toed the skimmer to life and lifted gently from the riverbank.  Thoughtfully, she pulled her AR goggles on and zoomed in on the ground as she spiraled slowly outward from the site of the killing, reading the night’s traffic in the bent grass stems, the wisp of tan hair snagged on a tangle of riverbank willow.  She knew where this pride would be lying up, didn’t need to search for their signatures with the tracking software. Every major mammal in the Pleistocene Preserve was chipped, from coy-dogs to the new pair of giant sloths that had the gene engineers popping champagne corks, but after her years here, she rarely needed to use a chip to find what she was looking for.  Tahira accelerated until the wind pulled her lips back from her teeth. Not one Perimeter alarm had gone off last night. Same with the last one.  Tahira spied a patch of tawny hide in the shade beneath a clump of hawthorn a split second before the goggles ringed it with red and flashed an ID number above it. She braked hard, spiraled back and down. That was the small male, the one with the ragged ear, one of the old lioness’s last surviving cubs. He was a classic African type, with a full tawny mane and only a hint of the Pleistocene striping and narrower head. Which meant he was on the cull list. Like the old lioness. The IDs of the rest of the pride flashed into view. Right where she knew they would be. The old lioness was on her feet, looking up at the skimmer, her scarred face and faded, ratty fur a testament to her age. She was smart and she learned quickly. An offering like the girl would have been too good to pass up the first time. This second offering would have been easier to take.  Tahira sighed, and spun the skimmer away, out over the broad plain of yellow summer grass patched with the dusty gray green of hawthorn and the darker junipers. A small herd of antelope raised their heads as she soared over, tails flashing nervously. The big herd would be farther north, she’d check on them as she circled home. A hawk soared at eye level as she rose, turned its attention back to the ground, searching for rodents flushed by the antelope below. Tahira checked on the horse herd, found them southward, watering at the grassy back of the narrow river, whose waters ran clear and dark. Automatically, she noted the dwindling feeder stream that would be down to a trickle in another month. No glaciers to keep rivers running out here, not anymore. Dark tails whisked their dun sides and they stamped dark-striped legs at the biting flies. The gene engineers were winning here, too. They had engineered the original Przewalksi’s horse into a chunky look-alike to the horses that had grazed this plain in the Pleistocene. They were working hard on the elephants now. Some of the recent calves were going to be huge and hairy. She did a quick count of the herd using her link software to scan the GPS chips, although she really didn’t need to. She’d have all the numbers available from the daily sat-scan when she got back to Admin. She didn’t have to do the rounds in person at all, but she liked to see for herself.  And the last body hadn’t showed up on the Security report at Admin. She suspected this one wouldn’t either.  The lead mare raised her head as she circled. The lame filly was gone, probably brought down by the same lion pride that had taken the trespasser. They would have gotten the filly long ago except that the old lead mare was her dam and had protected her foal fiercely, with the whole herd to back her up. Luck must have aided the pride. The old lioness was showing her age, and avoided the hard kills now.  So she had taken the meal that had walked up and asked to be eaten.  How in the name of all that was unholy had the trespasser gotten past the Perimeter?  Tahira kicked the skimmer to high speed, circled south to where the bison herd grazed the lowlands, their huge, erect horns another testament to the geneticists wizardry. The eastern elephant troop was hanging around there right now, close enough to the monorail to give the tourists a good show. Sure enough, a train had stopped and even at her height and speed she could make out the passengers hanging out the windows, pointing their links. Their tour goggles would pick out the hairy Mastodon-type calves for them and explain in a pleasant voice how the engineers were tweaking the genome. The old cow raised her trunk to blow at Tahira as she skimmed by, then went back to scooping dust from the wallow they’d created, tossing it in ochre showers over her back. Tahira didn’t see any of the camels, but they were probably all back in trees, out of the sun. They, too, were changing. The old lioness was the only remaining lion that carried wholly African genes, had been wild-caught as a cub.  Tahira liked her for that.  With a sigh, Tahira grounded the skimmer to text a quick report on her find to her boss. Then she shut off the link before he could reply and swung the skimmer northward to find the big antelope herd.  The sun was dipping toward the horizon by the time she returned to Admin. Only the solar farm beyond the low, ochre buildings, row upon row of collectors following the sun, spelled ‘tech.’ The earth-brick buildings might have been built by some primitive peoples, blending gently into the summer prairie. Tech was pretty much invisible now—except in the dry lands where the ranked mirrors of the solar farms and the wind towers had supplanted juniper and sage. But nobody went out there. Her village would have suited this landscape, she thought. Huts decaying slowly into the shriveling desert that had once fed lions and antelope and people. Tahira set the skimmer down hard and fast on the small landing pad behind the building. The trickle of water down the central interior water-wall washed a breath of moist cool and greenery-scent over her as she entered, tempting her to strip, shower, and sit in the pool. She ached after her full day on the skimmer. Once upon a time, she had not ached. It was time to make another appointment at the geri clinic. Or perhaps not. Every cycle had a natural end. Well, perhaps that was no longer true. Tahira sighed at the angry blink of the red priority icon above the holo deck.  She ignored it and instead seated herself on her working cushion, doing full lotus for concentration. Called up Security. Some eye somewhere must have seen the girl last night. She started a search for predator-prey movement, narrowed the profile to a human’s mass. No point in watching rodents and coy-dogs. That got her lions, antelope, bison calves. A headache blossomed behind her eyes as the images flickered through her field.  Then . . . there she was. Shadowy, slender, her arms, neck, face, legs stark white in the night-eye recording, that black shirt that would be torn and bloodied revealing a deep cleavage and breasts that were small enough to be natural, not sculpted. Tahira’s eyes narrowed. Short shorts, sexy clothes, nothing you’d wear into the thorny scrub of the Preserve. Sandals, so she had lost them, running. No blood on that white skin. She hadn’t waded through the hawthorn then. How old? Sixteen? No, she decided. Less. Maybe fourteen. That was how old her daughter had been, last time she had seen her. Tahira tasted blood, realized she was biting her lip. She watched the girl wince, bend a slender leg to rub at something—thorn or bite. She looked lost. Pissed. Stood up by a date pissed.  Then, her expression changed from lost-and-angry to startled. Then frightened. She looked around and for an instant her eyes seemed to meet Tahira’s. Accusingly.  Like an antelope, she turned and bolted, running through the grass and thorns. One of the sandals flew off, a twinkle of motion on the screen.  “Don’t run.” Tahira said out loud.  In the holo field the girl kept running and in a second vanished from the eye’s sweep.  Tahira found herself standing. Muttered a curse. She skimmed to the next eye, which should have picked up the girl’s panicked flight and probably the kill, since it covered that sector.  It showed her grass, scrub, the scurry of a small rodent, the silent float of an owl. The small dying shriek of the rodent made her flinch, then she skimmed back through that eye’s sequence.  Nothing. She slowed the segment, watched the owl creep across the scene. Frowned. Seed heads bowed the grass. This species had finished seeding weeks ago and the seed heads had shattered, spilling their ripe seeds.  She copied and filed both sequences and had the station AI code them for search identification. Then she set the AI searching the Preserve’s security base for an exact match to the quiet scene recorded by the second eye. Within a minute, a 99% match popped up in her holo field. Side by side, two owls floated and twin shrieks split the quiet. She checked the properties. Yep. The scene had been recorded five weeks ago, on a quiet night with . . . she checked . . . no Security alerts, not even a native antelope bumping the Perimeter fence.  For several moments, she frowned at the now-frozen images, then blanked them. This time, she directed her AI to match the visual image of the girl running, but she directed it to search the web, excluding only the Preserve data files.  That search was going to take some time.  With a sigh, she emailed the video of the girl and the twin owl sequences to her boss, then reached into the holo field to touch the angry, blinking priority icon.  It took five full minutes for Carlo to appear. Which meant he was probably in bed. With someone. He had just spent a week at a body-spa and he was probably trying out the upgrades. Tahira braced herself as Carlo’s face and torso appeared in the field, yes, wrapped in a silken robe, his usually-perfect hair tousled. “About time.” His eyes narrowed. “Where were you? I called you as soon as I got your report but your link didn’t answer.”  “Checking the range.”  “You have software to do that.”  “The software didn’t find her. I did.”  “Has the media gotten hold of this?” Carlo looked over his shoulder, back to her, lowered his voice. “I assume not, or my interface would have picked it up and alerted me.” His dark eyes snapped. “All right. This time, you need to find out how the trespasser got in. And why Security failed to alert you. Again. Meanwhile, you will euthanize the lions involved. As insurance against media clamor. We will have done all we could do.”  “It’s not the lions’ fault.” Tahira shook her head. “The girl was meant to run into them. She was dropped right in front of them.”  “What do you mean she was dropped?” He ran a hand through his hair. “Make sense, Tahira, will you?”  “She was dropped.” Tahira bit the words off. “By a skimmer, helicopter. Something. She was in sandals. Bedroom type. I just emailed you the Security clip that did pick her up. And the clip that was used to replace most of the visuals.”  He stared at her. “That’s unbelievable.” He chopped her words aside with the flat of his hand. “Do you know how much it would cost to do that kind of hack job? Worry about the Perimeter security. Something is down. The lion euthanasia shows the public that we’re doing a good job of dealing with this. The US media will howl if they get hold of this. You know how they feel about the Preserve.”  Yes, she knew.  “I can sacrifice you or I can sacrifice a lion or two. You decide, Tahira.” Carlo’s eyes narrowed. “And before you say anything, you’re a hell of a lot more valuable to me than the lions, they’re breeding just fine. Besides, as soon as the genetics geeks get their Panthera leo atrox phenotype we won’t use African lions anymore anyway. So let’s just call it moot and drop it.” He glanced over his shoulder again and his mouth tightened briefly. Turned back to Tahira. “I am ordering you to euthanize a lion that killed this person. Make sure you get a DNA match so we can prove it, and I’ll leave it to you to get the right one. I’ll let you claim it was a rogue animal and make it plausible.”  He was giving her a lot. Carlo could have demanded the whole pride—the media would press for it. He could have fired her. “Can we talk about how this girl got in here? She was a girl, Carlo. Dressed for a hot date. Go take a look at that clip I sent you. She did not hike in from the Perimeter. I think that’s a bit more important than pleasing the media.”  “No, it’s not.” Carlo cut her off with another chop of his aristocratic hand. “If we’re lucky, nobody will pick it up. Make sure you secure those video files. The administrative contract for the Preserve comes up for renewal in one month. The US will push hard to take it over, as usual. If you want a job a month from now, you’d better hope the World Council thinks we’re doing a good job here and doesn’t award the contract somewhere else.” The holo field blanked.  Tahira stared into the opalescent shimmer.  He was right. The vast Preserve, the huge central section of the US that had been restored to its Pleistocene ecology, including megafauna and the species that had inhabited this land millions of years ago, was part of a giant experiment in ecological climate control. And genetic engineering. And a huge tourist draw, which the US did like. A lot of countries were uneasy about it, seeing a threat to their own grasslands and dwindling wildlands as the growing Gaiist movement used carbon credit leverage to pressure for more preservation. Too much media outcry and the US might garner enough support to end the Preserve and take over control of the huge area again, never mind the carbon credits they’d then owe. It was a matter of national pride, she thought sourly. That had always transcended logic.  She made herself a pot of very black tea and began to go through the security records for the past twenty-four hours, searching for human-sized mass or any sign of a small-craft landing. As the sun cleared the horizon, she finally shut down her station and stumbled off to her small room behind the water-wall, sprawling sweaty and fully clothed across her bed.  No airspace invasion, no vehicles, nobody on foot. Maybe the girl had teleported in. She laughed sourly. Sure.  Just like the last one.  “Tahira? Hey, Tahira, are you okay?”  Jen’s voice. Tahira blinked crusted eyes, swimming up from a deep pool of sleep and dreams she couldn’t remember but that had stalked her like lions. “Late night.” She realized that she had spoken in Sotho, switched to English. “Sorry. I just need some tea.” She sat up, stiff and sticky in her dirty clothes, rubbed her eyes.  “I already made you some.” Jen stood in the doorway, nervous, a mug in one hand. “When you didn’t hear me come in I figured you really needed tea.”  “Yeah. Thanks.” Tahira got up, glad that she hadn’t stripped last night and took the mug. “I appreciate it.” She gave him a smile because this too-earnest graduate student had tried to climb into her bed a week ago, never mind the age difference. And her ‘no thanks’ had apparently bruised him. She swallowed a stinging gulp of the strong-enough tea, gave Jen a nod of approval. Usually, he made it too weak.  “You got official mail.” Jen stood just outside the door, as if a strand of Perimeter fencing blocked it, his beaded and braided, silver-white hair—stark contrast to his tawny skin and intended to be sexy—swinging forward around his face with his nod. “Security seal. Looks important.”  “Yeah.” Tahira drank more tea. The official execution orders. “We had another trespasser last night.”  “You’re kidding.” Jen’s eyes got round. “No, you’re not. Another . . . another kill? What are we going to do about it?”  She brushed past him, angry because two plus two was a simple equation. But guilt stabbed her. He had brought strong tea. And he didn’t really understand the Preserve politics. She paused, looked back and shrugged. “I’ll have to kill one of the lions of course. Even though it wasn’t really their fault.”  The information didn’t move him, but why should it? He was a graduate student, studying the symbiosis of lions and one of the predatory wasp species. Esoteric stuff. A study that provided a comfortable living and yielded information. Lions were just the food providers for his wasps, who laid their eggs in the larvae of a biting fly that pestered the lions. And the wasps were just a day job, a means to an income. He’d study whatever he was paid to study. She sighed. “Come have some breakfast with me, eh? I found a fresh guinea hen nest yesterday.”  She softboiled the small, tan eggs and they ate them together as she listened to him prattle on about his wasp collecting, larvae counts, population fluctuations. When he left on his skimmer, with his collecting nets, sample bags, and a stunner, Tahira stripped and scrubbed herself clean of last night’s sweat and the smell of violent death. She stripped the bed, tossed the dirty sheets into the sonic cleaner, and padded barefoot, in a clean shift, to the lab refrigerator where she had stored the trespasser’s bones. The bag containing the black shirt lay on the floor beside the refrigerator. She picked it up, smoothed out the torn and blood-stiffened fabric within its plastic shroud. Why did you come here? She spoke silently to the girl’s spirit. The lioness’s killing was innocent. My killing of the lioness will not be innocent and it will be my burden not yours. Anger burned through her. “Your death was not innocent,” she said aloud. “You brought it with you and left it like poison on innocent ground.”  But her own words sounded hollow and that image nagged at her . . . the ‘where’s my date?’ body language, that single, decorative sandal tumbling through the air, bright against the stark night-vision landscape. Dropping the shirt, she took out the bag with the vertebrae and hair and got to work.  The first thing she did was file a full report to the local Sheriff’s Department. That meant the media would have the news within the hour. The Sheriff’s security leaked like a sieve. Next, she started the DNA scan. She was only required to run a minimal ID scan, but she did a full analysis. The longer she spent on this easily-rationalized task, the longer she could put off the euthanasia. By noon, her back ached from standing and the building’s major-domo announced Deputy Malthers. Shawn. He always handled Preserve issues. She sent the data to her personal workspace and shut down the lab, retreating into the main room and the cool breath of water-wall. “Come in.” She admitted him and he sighed in the cool air, removing his hat, half moons of sweat darkening the tan sun-cloth of his uniform.  “Tahira.” He nodded, his weathered face closed and cautious. “You had an intruder, huh?” Another one, his eyes accused. “Supposedly your fence is tight. Do I have to worry about lions in the hotel lobbies?”  “You know you don’t, Shawn.” Tahira studied the tight lines around his eyes. “The Perimeter isn’t porous—to animals. Who chewed on you?”  “My boss, the Sheriff. The governor chewed on him.” He sighed and tossed his hat onto the corner of the table. “He’s getting more pressure from the Take Back America people. They got the news even before the media could post it on the net. Can I have a glass of water?” He gave her a plaintive look. “I know you run a tight ship, Tahira, but jeeze, two deaths in two months? This is too good for the media to pass up. You should see the hit rates.”  “Sit down. I’m sorry.” She headed for the kitchen. “I didn’t get much sleep. Did you get the DNA scan I sent your office?” She carried two full glasses and a pitcher of water back, set the tray on the low table near her work field.  “Yeah. No match.” He took a glass, drank half of it in long, gulping swallows. Wiped his mouth on his sleeve. “She’s not a missing person. I sent it to the national DNA database, but you know how long that takes.” He rolled his eyes. “They’ve got a six month backlog and that’s just on violent crime. I still haven’t heard back on our first Jane Doe.”  At least he had said ‘our’, although technically, the Preserve was administered by the World Council and not under local jurisdiction. Still, the World Council liked to let local law deal with matters if at all possible. Tahira sat down on her cushion. The holo field shimmered to life and she opened the data file, staring thoughtfully as the letters, numbers, and icons winked like emerging stars.  “I know her.” She spoke to the galaxy of numbers and icons—the translation of those rags of flesh and bits of bone. “She grew up in a slum.” The heavy metal load in her hair could only belong to a child of the unclensed suburban wasteland. “She was very young, less than sixteen, I am guessing. European, probably Scotch-Irish, no Asian or African genes, minimum melanin.” Her skin would have been very fair and the red in her hair was natural beneath its cheap dye. Poor all her life, considering the uncorrected genetic predisposition to cholesterol and cancer. She would not have had an uncomplicated middle age, if she had lived. She would have died young, relatively speaking. Unless she earned the money for genetic repair. “Look at this.” She called up the security clip, ran it. Listened to Malthers’ soft indrawn breath.  “She didn’t expect lions.” His face was grim. “And she sure didn’t get lost from one of your tours, huh?”  “Nobody gets lost from our tours.” Tahira shook her head. “And no, she did not expect lions.”  “You got any ideas?”  “This cost a lot of money.” She looked at him. “Hacking our security. It would be expensive. We do not use cheap security.”  He was looking at her quizzically, his thick brows drawn down over those so very blue eyes.  “Some things,” she said slowly, remembering, “don’t change.”  “Like what?”  Her link chimed. “I have a tour scheduled.” She stood, feeling age in her bones, even though they worked perfectly, levering her young-muscled body erect. As if invisible teleomeres were shortening, ticking like a clock. “I have to go. If I find anything out, I will email you.”  He headed for the door, paused to look back. “Stop by the office.” Those so blue eyes fixed on her face. “I’ll buy you a beer.” The door closed behind him, breathing hot dust into the room.  The tour was an expensive one, which was why she had to lead it. It would be a package with a hotel, maybe a body spa, the Preserve and a tour conducted personally by the Manager. That was her. Her contract specified how many of these she had to do each month. Originally, Carlo had suggested she wear native dress. When she had told him that would be a ragged T-shirt with the name of a football team on it, he had shut up and not mentioned it again. The tourists were waiting beside their air-conditioned tour bus, looking around at the dusty little compound, pointing their links at the buildings, the guinea hens scratching in the shade. The link videoed the image and instantly searched the web for a match, downloading informational links. The life cycle of the guinea hen, the history of the Preserve, the blueprints for the buildings, if you wanted to look at them. Their tour guide spotted her and said something. Instantly they all, nearly in unison, pointed their links at her.  A part of her wanted to duck, as if they were pointing weapons. The gesture was, her hindbrain told her, the same. Was it, she wondered briefly, that this pointing of links to acquire information was a hostile act? Or was it that the men who had fired on the refugees when she was a child hadn’t been hostile, had treated the dealing of death as casually as these tourists treated the gathering of information? She didn’t know, hid her flinch and smiled for them as the guide did the introduction that they weren’t listening to. Their eyes were on their links as she downloaded onto their screens life and death, love and loss, success and failure, rendered in text and images. She climbed onto the bus after them, took the plush seat up front, facing them. The guide sat beside her in the other rear-facing seat. Some of the tourists were from off-planet, perhaps one of the orbital platforms or perhaps even Mars. They had brown skin, lighter than her Lesotho skin, but their bodies seemed frail, out of proportion. They looked at her, eyes bright.  They did not look quite human.  “Go straight out of the compound and take the first right,” she told the driver, who was a regular. “We’ll take the road down along the river.”  “We’re here to see the Mastodon calves.” One of the off-planet tourists looked up from her link. “The park map IDs them to the west, over in the hills.”  “The old cow always brings them down to their favorite place on the river at dusk, to drink.” Tahira spoke patiently. “You’ll have time to stretch your legs and have some dinner before they show up.”  “Why don’t we just go where they are?” Someone else spoke up.  “Our rhythms are more flexible than those of the animals.” She kept her voice patient. “They know we will be there at the river, we are usually there, that does not bother them. It is familiar. If we arrive unexpectedly in an unusual place . . . they will be bothered. And that is unhealthy.”  That didn’t satisfy all of them but she didn’t expect it to.  “Hey.” A woman with a very young face, golden skin, and hair as silvery white as Jen looked up from her screen. “I just got a newsfeed . . . a tourist got killed by a lion! Last night! This is the second lion kill!”  Murmurs swept the bus and all eyes focused on the link screens.  “It wasn’t a tourist.” Her words fell like stones into the murmur and eyes pried themselves from link screens. “A young woman was dropped from a hovercraft for the lions to find.” She spoke into silence now. All eyes were on her and somehow, this felt no different than the pointed links. “She was intended to die. Someone videoed her death. That person will sell the video for a lot of money. Violent death is very valuable. It is an ugly trade.” Only the purr of the bus’s power plant could be heard now. “But it is a very old trade. No matter. I saw the vehicle that brought her, I saw the person who operated it. I observe that lion pride every night and I was there in the darkness. He will be caught.”  “That’s not on the newsfeed.” The accusatory voice came from the rear of the bus. From one of the off-worlders. Tahira shrugged. “I did not tell the media this. But you are safe.” Her smile was genuine this time. “The lion pride does not water where we will be. This is not their territory.”  She wasn’t sure if they were relieved or disappointed. She cut off their questions by launching into her usual lecture, pointing out the changing ecosystem—it had not reached full climax equilibrium yet—directing their links to the coy-dog family holed up in the shade, waiting the cool of evening. The puppies were playing a game of tug with a scrap of dirty hide and links bristled, zooming in to record. The larger animals were all chipped so the links would offer up the ID information for each animal, their stage of development toward the Pleistocene ideal as the engineers evolved them into their own ancestors.  Voyeurs, she thought as they pointed and murmured. An observable reality, but not personal. Not threatening.  She politely refused to say any more about the death, telling them only that the authorities would handle it. The tourists were distracted by the smaller horse herd. One of the young stallions had been challenging the herd sire over the past few weeks and he chose this day to take his challenge to a new level. Dust rose in tan clouds as the two horses circled and feinted, ears flat, striking snake-like for a bite, whirling to kick. This time, the youngster wasn’t backing down and the two stallions rose, chest to chest, teeth bared. “These horses are very much like the Equus verae, the horses that grazed this plane a million years ago. If you’ll put on your glasses, you’ll be able to identify the young male.” She paused while the tourists all fumbled for the glasses they’d been given at the start. They were slaved to hers. She IDed the young male by chip number and a green halo instantly surrounded him. “This young stallion was foaled four years ago in the spring. The engineers believe that he is a good likeness of the original Equus verae. All the stock began with Przewalksi’s Horse, the last truly wild horse species.” They were all watching now, as the stallions shouldered and circled, wheeling to kick, or rearing to feint and bite at each other’s faces. Tahira stifled a sigh. “The herd sire is nearly ten years old. That’s a long life for a herd sire.” The young challenger had been born of artificial insemination with the new, improved genes. If the old herd sire didn’t get ousted soon, she’d have to help a new challenger along. “This is not reality,” she murmured. “It is our version of reality.”  “Pardon?” One of the off-worlders had moved to the front of the bus for a better look, was pointing his link at the fight, recording.  “Nothing.” She shook her head. “I was just talking to myself.”  “It’s so . . . uncontrolled.” He had friendly dark eyes and a wide smile that made his too-fragile body seem less different. “Hard to imagine living in a world this . . . chaotic.”  “It’s not chaotic,” she said softly. “Only humans are chaotic.”  The horses saved her from the questions surfacing in his eyes. The young stallion whirled as the herd sire struck and his heels caught the herd sire full in the face. They heard the thud of hoof on bone, even at this distance, and the sire went down in a cloud of dust. He struggled instantly to his feet, but his jaw looked twisted and blood darkened the dun hide. A low murmur of horror washed through the bus.  “What now?” The white-haired woman’s voice rose over the babble. “What will happen now?”  “This was an accident. Fights like this rarely result in serious injury.” Tahira blocked the tourist glasses, but had her own zoom in on the injured stallion. No point in showing them the bloody details up close. The youngster had run him a few meters from the mares and now trotted back and forth, tossing his head, tail erect as the ousted sire stood with head drooping. She winced at the white gleam of either bone or teeth visible in the bloody mess of his face. Violence seemed to be gathering over the Preserve like a dark cloud. “His jaw is broken.” She didn’t need the text diagnosis scrolling across the visual field. “He won’t be able to eat. The lions will probably kill him, or even the wild dogs. This coy-dog is heavier than the old North American coyotes and they hunt in small packs. They occasionally kill large prey species, mostly when the animal is weak or crippled.”  “Why don’t you do something about it?” A woman spoke up, her voice shrill.  “You could take him in and heal him, right?”  “And what will the lions eat tonight?” Tahira faced the woman, watched horror and anger ripple across her features. “These are not our rules. They are much older than us,” she said gently. “That is what the Preserve is all about . . . returning to the old rules. Without the horse, a lion cub may die because of insufficient nutrition.” She waited for the horrified comments to ebb. You could hear the excitement beneath the horror. Now they had a prize in the video files they’d just uploaded to their personal space—something to show proudly to friends, so they could commiserate over that raw moment of blood, and pain, and imminent death. The woman who had spoken up wasn’t satisfied. She was talking about cruelty and emails to powerful people.  “Did you make this happen for us?” The off-worlder was looking at her, and his eyes were shocked and cold.  “No.” She met those eyes, saw her own reflection in them, tiny and perfect. “But I knew the old stallion would be forced out sooner or later. The horses decided to make it happen now. The kick was a freak accident. Horses are good at dodging.”  He didn’t believe her. You cannot conceive of no control, she thought. And wondered suddenly if her daughter had gone off-planet. The Council Security Forces were everywhere. She had never thought of that before, and it chilled her, she was not quite sure why. She would be much older than this man, now.  They moved on and the tour guide, a seasoned professional, texted her a request to show them something to change the now-soured mood. She had anticipated this and had already called up her inventory. “Turn left just past that clump of willow . . . yes, there.”  The bus took the dirt track easily, it’s off-road suspension barely sloshing the drinks that the attendant was handing out. “The engineers have had excellent success with the long-horned bison. They are very like the bison that grazed this plain during the Pleistocene. Three cows have calved this month and the latest was last night. She scanned for the IDs, found the three cows in close proximity 200 meters from the road. “They’re out in the grass, so we can watch them without disturbing them. If you’ll look through the left windows and follow the arrow directions on your glasses, they’ll direct you to the calves.” A green arrow winked on her glasses, pointing to the right and as she turned her head, it was replaced by one pointing straight up. She lifted her head, and there, in the distance, she spied the small black dots that were the grazing bison. The bus had come to a halt. “Have you all found the bison?” She waited while the slow ones fumbled their way to the bison herd. Zoom while they were panning and they’d get sick every time. “Okay, here we go.” The field blurred and suddenly seemed to be rushing toward her. The tiny specks enlarged, became a dozen shaggy brown beasts with their noses in the sun-burned grass, backs dotted with cowbirds. Small white herons stalked among them, snatching up beetles and the occasional rodent stirred up by the bison’s hooves. Their long horns gleamed in the sun as they tossed their heads at flies.  The newborn calf hugged his mother’s flank, his horns mere bumps. He suddenly butted beneath her flank, tail wriggling as he nursed. The collective sigh from the tourists made the guide breathe his own sigh of relief, she noted. Well, upset guests would hardly give him a fat tip. She let them watch the two older calves butt heads and the herd even obliged by grazing closer to the bus. By the time they moved on to the elephant watching spot for cocktails and their gourmet dinner, the mood was festive once more, the injured stallion forgotten.  Tomorrow, she would go check on him. Assure herself that the predators had found him. Injured as he was, the dog pack that patrolled that territory would almost certainly take him, but perhaps not right away. She called up that sector, scanned the predator inventory. To her relief, the lions were headed in that direction. They should get to him quickly.  During dinner they lucked out and a scimitar cat—quite shy and a rare sighting—chose that night to come down to the river to drink. The tourists flocked to the windows, their links pointing as they videoed in night mode. The elephants showed on time and the new Mammoth type calf went so far as to walk nearly up to the bus, trunk lifted in curiosity, before his mother shooed him nervously away, and stomped a threat toward them, her ears erect, trunk curled back like a cobra.  The tour guide looked pleased, as if Tahira had orchestrated the whole show. Tahira sat back in her seat as they returned to the compound in the gathering darkness, answering questions, giving small lectures on the history of the Preserve, the geneticists’ work, the effect of the huge preserve areas on climate stability. They asked occasional questions about the injured stallion.  No one brought up the dead girl. Not one.  She climbed down from the bus into the cooling night beneath the white arch of the Milky Way and a sliver of new moon. They would go back to the comfort of the resort to have dessert and drinks and to compare video clips. The tour guide gave her a wide grin and a wave as the door closed, anticipating good tips, obviously.  Jen would have left for the day and she would have the place to herself.  You have a visitor, the door murmured as she reached the verandah. He had an official security pass to enter. His personal ID is blocked. “I know who it is.” She sighed, then straightened her shoulders. “Open.”  “What the hell is going on, Tahira?” Detective Malthers levered himself up from the sofa in the main room. “Do you know just how much trouble you’re going to cause me when my boss starts getting the feeds?”  “He has his link shut off tonight? I would have thought he’d have the news already.” She headed for the kitchen wall, thirsty. “And if I protest your use of a security pass to override my door lock, I hope you can produce the warrant.” She closed her eyes as he seized her arm. Halted. “Shawn . . . I’m sorry.”  “Sorry?” He spun her around to face him, his face pale. “You withheld information from me? You lied to me about that girl’s death? And then you spill it to a bunch of tourists?” His nostrils were pinched. “You’d damn well better be sorry.”  Some of them had certainly blogged from the bus. She had counted on that. She met his eyes. “I did not lie to you.”  “Then why did you tell them . . . ” His eyes narrowed and he let go of her arm. “No way. No way you do that.”  “Do what?” She widened her eyes. “If I tell a story to tourists to enliven their trip and they exaggerate it in their personal blogs, this is not a crime. Your boss can deny whatever he wishes to deny and if the outcry is loud enough, my boss will probably fire me. Would you like some water?”  “What do you think you’re going to do?” His voice was harsh.  “Go to bed.” She filled a glass from the refrigerator tap, filled a second glass.  “I’m going to get a warrant for your arrest.” He ignored the proffered glass.  “On what grounds?” She raised an eyebrow. “I suspect your boss will not agree with you. It will be hard enough to deal with the media when they get hold of the tourists’ mistaken statements. It will be much worse if you have arrested the manager of the Preserve and then have to release her. Your boss is very conscious of his media image.”  “I’m staying here tonight.” He glared at her.  “Be my guest.” She shrugged. “I told you, I’m going to bed.”  “Good.” He stretched out on the sofa, his jaw set.  She turned her back on him and activated her holo-field. Checked the Preserve first. Minor Perimeter alerts only—a couple of licensed backcountry backpackers who had retreated when they triggered the broadcast security announcement, a small herd of pronghorn that moved off when the repulsion field activated, broadcasting an unpleasant sonic pulse that discouraged most wildlife and the occasional lost livestock. Nothing else. Red icons signaled stationary chips—indicating that a bearer hadn’t moved for twelve hours. That usually represented death or serious injury. She checked the IDs . . . all prey species except for one elephant from the northernmost herd. An old female, but not so old that she should be dying yet. The elephants and the larger predators had been implanted with biometric chips. Tahira checked it, found signs of physical distress, but no clear diagnosis. She transferred the ID to her link. She’d fly over in the morning and check on it, on her rounds to chip new births. See what had happened.  Her AI search of the Security video of the running girl had turned up a match. Eighty-nine percent. Tahira drew a deep breath, touched the green icon. A merchant site. Models? A naked woman lounged suggestively on a grizzly’s hide, caressing the dead, snarling face, tongue-tip peeking pink from lush, crimson lips. The secure interface requested a user ID and password. And a credit card. The entry fee made her purse her lips. She flagged the link, emailed it.  Malthers was peering at his link, his feet propped on the arm of the sofa. He looked up as she shut down her field. “What if the person who dropped her was a woman?” His eyes were hard.  She shrugged. “You are too tall for that sofa. Would you like me to inflate the guest bed?”  “No, thank you.” He went back to his link. “I don’t plan on sleeping.”  “While you are up, then, maybe you can see what’s for sale on the video sex markets. I just sent you a link that you might . . . find interesting. I don’t have the budget to access it.” She turned and went into her room. When she woke briefly in the middle of the night, the light in the main room was still on and he was sitting on the sofa, hunched over his link.  She slept without dreaming, after that, and when she woke, he was gone.  The door seal sighed as it released and Jen strode in, bringing a smell of hot noontime dust and heat, a hint of lion and sex. “Hey, how was your tour last night? Did they do a fancy spread?” He came up behind her, dropped his collecting bag onto the tiles with a small thump. “What’s with the reporters outside? The newsfeeds were full of the killing this morning. You were a witness? To the girl’s death?” His sandy brows arched over his pale eyes. “You didn’t tell me that.”  “I know I didn’t.” Tahira waved her hand through the field and the numbers and icons, the map of this girl’s history written in molecules, winked out. “Let’s not talk about it, okay?”  “You haven’t opened your secure email from the boss yet.”  “I know what it says.” She sighed.  “Tahira . . . ” His hands came to rest lightly on her shoulders. “I work with the lions, too. I can do this euthanasia for you. You don’t have to. Just give me the chip ID.”  His hands offered comfort not sex. She let her shoulders relax a bit beneath the warmth and acknowledged the small heat of desire between her legs. He was very pretty. He would try hard to please her in bed. Her shiver of anticipation made her . . . sad. She was old enough to be his grandmother. The flesh had its own morality. She sighed, and his hands slid from her shoulders as she rose. “I appreciate your offer.” She smiled for him. “But it is my duty. It is my failing that the girl was able to be here.”  “That’s not true.” He shook his head, frowning. “She bought hackware good enough to get through the Perimeter sensors. It’s happened before. Remember those rich kids that came in here with a rifle? Right after I started working here? The ones who thought they were going to kill an elephant? That’s not your responsibility—that’s the responsibility of the company that contracts security to the Preserve.”  “That’s not what happened.” Tahira blanked the icons with a wave of her hand. “This is not like those teenage poachers with their utterly inadequate rifles. I knew they were there.”  “So her hackware was better, that’s all.” Jen shrugged. “Come on, Tahira. Nobody is blaming you . . . except you.”  “I doubt that is true.” She turned to meet his pale eyes. “Her mother? A lover? Who is mourning her? She was a girl, Jen, even if nobody claimed her as missing. The poor don’t bother. You know that no one will really look. You know where they have gone.” She turned away from the blue incomprehension of his eyes. “But they are blaming me. Besides, she was not rich enough to afford that level of hackware.”  He shook his head and heaved a sigh for her to hear. She ignored it as she ran through the surveillance program, suppressing a twinge of guilt because she hadn’t yet checked on the stationary elephant cow. Everything was fine, although the main horse herd was pushing into the grazing territory of the old mare’s small, splinter herd. This was a dry year and the grass was poor. She’d have to let them get pushed off their riverside pasture. That would weaken this year’s crop of still-nursing foals, and increase the kill rate by the northern pride. If another dry spring followed, she thought, the small herd would probably end up being absorbed back into the larger group. The old mare wouldn’t survive that merger.  The guide reports were routine. No problems, no accidents on any of the daily motorized tours currently winding through the Preserve and only a sprained ankle from one of the self-guided backpacking treks that were in progress. The hiker had been handled by a contracted first aid skimmer and planned to continue the trek in an augmented cast, having signed a health waiver. Tahira checked the location of the various lion prides and elephant groups to make sure that the guides would provide visual contact for the guests. Four were lion treks and one was an elephant trek. But all their guides were experienced and they could find the chip signatures with their own software. They were all on target to give the paying hikers the thrill of a live sighting. Routine day. She retinaed the report, packed a few necessary items into her field bag, then left Jen to his microscope and took the skimmer out into the Preserve.  Shawn had not gotten his warrant, but then she had known he would fail.  She swung north, to check up on the stationary elephant before she started her chip work. It was a long flight, clear to the northwestern boundary of the Preserve, within sight of the monorail. The old cow was down after all, on her side in the shade of a thin copse of trees. She raised her head as Tahira skimmed over, ears erect, trunk curled as she got her forefeet under her, tried to heave herself to her feet. Two aunties had stayed with her and as she collapsed into the dust once more, they hurried up, stroking her with their trunks, watching Tahira warily as she landed the skimmer and approached cautiously. The dust beneath the old cow’s hindquarters had turned to mud from her urine. No sign of defecation. A blockage? Perhaps she had eaten something that damaged her gastrointestinal system. Her temperature was slightly elevated and when Tahira zoomed in with her glasses, sure enough the cow’s membranes looked pale. No sign of any external trauma. Natural causes. She selected the diagnosis, uploaded visuals to the cow’s file, and set it to alert her when vitals fell to imminent death levels. She would return to make a more complete diagnosis then. For the record.  She caught a glimpse of movement from the corner of her eye as she removed her glasses. Bear? Sure enough, when she slipped them back on, a green ring haloed the bushes where she had seen the movement and the ID appeared. One of the short-faced bears, another of the engineers’ triumphant recreations. They were drawn by death. One of the aunties blew noisily and rushed the bushes, trunk high. The bear retreated, growling, circled around to windward. Tahira retreated to her skimmer, although the bear was focused on the dying cow. Unlikely that the aunties would allow it to hasten the old cow’s end.  Natural causes, she thought as she lifted to swing eastward again. You could label the girl’s death as natural causes. To the lions it had been a natural end. The monorail was curving along the white arch of track on its first run of the morning. In a few moments the tourists would surely spot the cow and the questions would start pouring into Admin from the passengers. All the tourist monorails carried a direct link to Preserve Administration. Tahira set the skimmer on auto, homing on the ID of the bison herd she needed to chip, and quickly edited out an image of the cow and her aunties from the old cow’s ID file. She selected one of her taken in the past, with her last calf, set her link to record and smiled for the tourists. Quickly, in a warm and positive tone, she explained the situation, that the cow was dying of natural causes, the aunties were attending her, and that this (insert mother and calf image here) was part of the natural cycle of life and death, that the old cow’s flesh would nourish wild dog cubs (she called up a file, inserted a recent shot of three pups playing) and the scavenger population. She uploaded the video file to Administration and texted Amy Shen, the head of PR, to expect questions about the dying cow and offer this Special Message from the Manager. Amy would run the file through her editing software to smooth out any rough edges and in a few minutes, when the worried texts came in, the tourists would have her reassuring explanation.  Maybe she should have made one for the dead girl? Tahira kicked the skimmer to full speed, ducked down behind the wind screen as they streaked across the foothills of the mountains.  It took her the rest of the day to chip the bison calves and stalk a litter of wild dog pups old enough for chips. Half grown, they were skittish, full of hormones and already squabbling with the ranking alphas. But she finally got good shots, and planted a chip in a solid muscle mass. The new ID files opened and she recorded the pertinent data. Now the pups and the calves were part of the database. Their deaths would have meaning, value, would contribute to the slowly growing mass of information about this stable environment.  What had the girl’s death contributed?  A meal for the lions, she thought. At a price.  It was getting dark. She texted Jen that she was going to stay out and check on the lion pride before she came in. Told him to go home, activate Security when he left, she’d see him tomorrow. She knew where the pride would be, didn’t need to check her link. It was too early yet for them to head down to the river. She grounded the skimmer, ate an energy bar from her bag, drank some water, and used her link to access the Preserve database and check on the animals.  Nothing out of the ordinary. No Security alerts, nothing but the normal rhythms of day ending and night beginning. Shift change, she thought as she stuffed the wrapper into her pocket and capped her water bottle. Time. It was fully dark now, the Milky Way a white shimmer across the star spangled sky. She stared up at it. Different sky than the one over the refugee camp. Maybe it wasn’t, but it looked different. She frowned, bothered suddenly that she didn’t know if the constellations had been the same in that girlhood sky, or if memory had warped the images in her mind. It bothered her a lot. Frowning she lifted the skimmer, donned her glasses set to night-vision, and went looking for the lion pride. She flew low, skimming above the brush, weaving around the trees. Someone watching for her might think she was checking on the wildlife, scanning chips. She dipped south so that she’d meet the pride on their way down to the river.  Red blossomed at the top of her glasses’ heads-up visual field. Perimeter violation? Tahira’s stomach clenched. Why an alert this time? She crouched behind the windscreen as she dropped lower, weaving through the tops of the trees. A map flashed into existence now, red dots marking the path of the intruder as he activated the sensors scattered across the Preserve. Tahira watched another red icon blossom on the screen map. He was heading for the place where the girl had died and the steady progress suggested that he wasn’t trying very hard to hide and certainly wasn’t using hackware.  No. This was just some fool who chose tonight to violate the Perimeter. An idiot. A thrill seeker. Furious she circled south to come in straight behind the intruder, slowed the skimmer to its limit, weaving through the brush now, twigs whispering against the skimmer’s flanks, clawing at her legs. She was briefly thankful for her tough, suncloth pants that resisted the thorns. She followed the trespasser’s path on her map. He should be about a hundred yards ahead, almost at the site where the girl had died.  Something slammed into her, an invisible fist that loosened her grasp on the skimmer’s nav bar and tossed her sideways out of the seat. The skimmer compensated as soon as her hand left the bar, shying sideways to stay underneath her, slowing and settling automatically. She clutched at the bar to take control again, but her right arm didn’t work and before she could process that, shift to her left hand, the skimmer grounded gently. For a moment, Tahira stared at the bar, then realized that her sleeve was wet, warm liquid was dripping steadily onto her pants and the dusty ground beside the skimmer. Dark. Blood. Her head spun briefly and she swallowed dry nausea.  What do you think you’re going to do? She heard Shawn’s furious voice in her head. Not much. She climbed off the skimmer, her knees suddenly shaky.  “I don’t want to kill you.” The hard, cold voice came from the tall hawthorn scrub that edged the grassy area where the skimmer had come down. “But you’re not going to get in my way. You can yell for help as soon as I’m done here.”  “Did you bring another one to die?” Tahira faced the voice. She was still wearing her glasses, but they didn’t register an ID. No surprise. Anyone doing this would have had his ID chip removed long ago, would use temporary, fake chips. “How much do you get for these? And what do the girls think? That this is just another porn shoot, this time out in the dust? She didn’t expect the lions.”  “What the hell are you talking about?” A figure emerged from the concealing hawthorn. Tall. Dressed in chameleon-fabric so that his silhouette was hard to make out. The projectile rifle, night-scoped, ugly, and efficient looking wasn’t hard to make out at all. Something about the voice was wrong, nagged at her, but her head was full of sticky glue and she couldn’t think of what it was.  “I asked you a question.” The voice grated at her ears.  “You’re the one who’s making the snuff vids, recording the girls as they run into the old lioness’s pride and die.” She would have spat the words, but that sense of wrong was building in her head.  The figure stepped forward suddenly and before Tahira’s gone-fuzzy reflexes could kick in, had shoved Tahira back against the skimmer, her back arched under the pressure of the trespasser’s body, her good arm bent behind her. She blinked into pale gray eyes in a hard, weathered face framed by cropped-short gray-white hair. Sucked in a breath that was half pain, half surprise.  A woman.  “Shawn said it might be a she.” She laughed, drunk on the pain that had begun to throb in her right shoulder and side, burning like a growing fire, radiating through her flesh.  “Yeah, I’m a she. That was my daughter your lions ate. You folks don’t care, but I do.” Her breath blasted Tahira’s face. “They’re going to pay for that tonight.”  “Your daughter?” Tahira blinked, trying to focus her eyes. “That’s why your hackware is so poor? You just walked in here to shoot lions? You don’t care if we catch you?”  “I don’t care one bit.” The cold pale eyes bored into hers. “If you hadn’t decided to hang out and protect them, I wouldn’t have had to shoot you. I figured you folks trust your software instead of using your eyes. I know how tracking software works . . . It’s pretty easy to fool if you know how.” She laughed and the sound was like glass breaking. “I was a wild-meat hunter for the black market—when there was still wild meat to hunt. I know all about tracking software. Maybe the people who babble about karmic balance are right, eh?” The shattered laugh came again. “After all the animals I killed, one of them killed my daughter. But the score is going to end in my favor.”  “You fool.” Tahira twisted her hand free, planted it against the woman’s chest and shoved. Her strength surprised both of them and the woman stumbled back a step. “You’ve ruined this night. You’ve ruined my chance to catch the one who killed your daughter and the girl he killed before her. You and your misguided revenge. He’s not going to come back, not after he realizes people were here waiting for him. Damn you.”  “What the crap are you talking about?”  “I’m not talking any crap.” Tahira closed her eyes. Game over, she thought. “How do you even know that your daughter was the girl who was killed here? We haven’t identified the DNA yet.”  “I found the image on the web.” The woman’s voice grated, harsh as stone. “I was looking for her, used a video search engine, uploaded a bunch of recent pictures of her. And the engine found a match. With lions.” She spat. “One of your tourists videoed it. Her running. The lions after her.” She spat again. “And you people just stood around.”  “No one stood around. I saw that video.” Tahira stood still as the gun muzzle lifted, fixed on her chest.  “The media said she sneaked in. I figured she was showing off to prove something . . . because I used to run around in the African wastelands for the meat collectors. She was such a city kid.” For a moment her voice wavered. Then it went cold again. “You want to tell me your version?”  “You didn’t look back to check the source of that image match, did you? If you want to go check it, you’ll find it’s a teaser for a very expensive, password-only, porn site. I think your daughter believed she was making a porn vid. Right until the end.” Tahira pulled out her link, watched the gun muzzle lift and steady. Touched up the video file from the Security eye, passed it over.  The woman took it, poised, the gun ready. Yes, Tahira thought. She had the body language of one who expected attack. She remembered that body posture all too well. The woman stepped back, out of range, looked at the link with one eye on Tahira. Then her posture stiffened and the link held her full attention.  I could kill her now, Tahira thought. Our children are our greatest weakness. She waited, watching the sky, straining her ears to hear any whisper of a silenced skimmer. The woman must be reviewing the clip over and over again. Finally she looked up, pocketed the link. The gun muzzle had sunk to rest on the ground and she didn’t lift it.  “What’s your stake in this?” Her voice was steady. “You came out here to put your life on the line for a damn lion?”  “No . . . and yes.” Tahira closed her eyes again, briefly, summoning the will to push the grinding pain in her shoulder down deeper inside her. “The lioness . . . the old one, the one that killed your daughter . . . was wild caught. There are no more lions to catch. These are being changed, their genes altered to make them what we want . . . the Pleistocene American Lion. The world that the lioness came from is gone. My world. Your world, too, I think.” She pulled her lips back from her teeth. “She is innocent of murder the way your rifle is innocent of murder, even if you point it at me and pull the trigger. You and I . . . ” Her lips stretched tighter. “We are not innocent of our daughters’ murders.” She watched the gun muzzle jerk upward, tensed for one second as it wavered, drifted lower. “My elder daughter did what your daughter did.” The entire Preserve seemed to be holding its breath. Even the insects had hushed. “I knew what she was doing and pretended I did not. She had no future, there was no aid, everyone was hungry. I took the flour and oil she brought home and I did not ask where the money came from.” She did not look away from the pale oval of the woman’s face. “They made a video of her death. I got someone to find it for me eventually. To buy it. Her death was a commodity, for sale on the market. As is your daughter’s.” She waited for the gun to come up but it did not.  “My younger daughter was six.” She said the words flatly, without inflection. “I sold her to the World Council Forces so that she would not have to do what her sister did. They call it sponsoring, but when you do that, you relinquish all rights to that child. Later, I paid a lot of money to find out where she was and when she was fourteen, I saw her. On a training mission, doing crowd control. She looked at me.” Tahira took a deep breath. “She did not know me. By then, I had been lucky, had found a job with the North American Pleistocene Preserve and my superiors found that I was . . . talented. That was many years ago. My daughter is past middle age now.” She glanced up as a tiny chime sounded from the skimmer. “That is our lioness and her pride.” She took a deep breath. “This is a delicately balanced trap.”  “What do you want me to do?”  “I think it’s too late.” She sighed. “He will certainly be scanning the ground for any human-sized life signatures, in case this is the trap he expects and I have brought the police.”  “He won’t see me.” The woman laughed her broken-glass laugh. “Illegal technology is always a step ahead of legal. Your motion detectors saw me, but you wouldn’t have picked me up on your scan.”  “He has inside help and so he might have access to our entire security network.” She shrugged. “I do not think that is likely since only I have complete access to it, but it is possible.”  “In that case we’re screwed.” The woman shrugged, her expression unreadable in the dark. “What do I do?”  “I want him on the ground.” Tahira closed her eyes as the world wavered. “He thinks I’m a witness and he needs to make sure I’m dead. I have a first aid kit behind the seat.” Cold sweat bathed her face, prickling under her arms. “It has a touch menu. Select stimulant, human, emergency, and get two patches.” She struggled to hang onto consciousness, eyes closed, nausea wringing her stomach. The woman brushed against her, fumbling behind the seat. A moment later cool fingers seized her wrist, pushed her sleeve up and Tahira felt the sting of the stim patch on the inside of her elbow.  “That’s going to make you bleed more.”  “I know.” Tahira straightened as energy washed through her, banishing the nausea, brightening the shadows. “Can’t be helped.” She touched the first aid menu, selected one small and one medium blood-stop patch. “Help me with the shirt.” She winced as the woman opened the front, pulled the fabric down over her shoulder and arm. “Cover the entire wound, use the small one on the entry . . . ”  “I know how to use a patch.”  Tahira sighed as the woman smoothed the patches over the ruin of the entry and exit wounds. The fast-acting local quickly numbed the grinding pain, reduced it to a low-level throb that she could shut out for now.  “You guys carry a hospital on these things.”  “We permit a few extreme hikers.” Tahira drew a slow breath, let it out, judging the strength of the remaining pain. “We are preoccupied with death.” She bared her teeth at the woman. “You sold vids of your kills along with your illegal meat, didn’t you?”  The woman didn’t answer, but of course, she did. Tahira straightened. That was the lure of what would otherwise be no different from a farm or vat raised steak. If you couldn’t pull the trigger yourself, you could still watch it die. “You hide,” she said. “I’m going to move the skimmer ahead of the pride, ground it again. He’s going to come down and look for me.”  “He’s going to drop a grenade on you and leave.” The woman sounded contemptuous.  “Oh no.” Tahira grinned. “Like you, I’m wearing a chameleon field. And I also have a small device that a clever grad student hacked up—it generates the thermal effect of a 150-pound antelope. He was studying night hunting, trying to determine the importance of scent, thermal detection, sound, and sight in predator species. Our killer should think it’s me.” She shrugged. “He has been very careful not to leave any traces. I suspect that if I did not patrol as regularly as I do, we would never have known that anyone was killed here.” Another few hours, and only the scrap of fabric would have marked that kill site. “One of us needs to kill him.” She lifted her hand. “I would prefer that the lions do it.”  “How do you know they can?”  Tahira shrugged her good shoulder. “I will make it possible. If they do not, you or I will do it.” She pulled the highly illegal gun from her waistband, was impressed that the woman didn’t flinch.  “You could have shot me. While I was looking at the vid.” For a moment, she was silent. “I like you.” Her teeth flashed briefly. “You would have made a good meat hunter.”  “I think not.” Tahira stretched her lips back from her teeth. “But I am not sure we are so different. You know to stay downwind from the pride? They’re hunting.”  “I know.”  “I need my link.” Tahira held out her hand. The woman glanced at it, shrugged, handed it over. Tahira nodded and climbed onto the skimmer, hoping he showed before the stim patch ran out. She wasn’t sure she could tolerate a second dose. At least the bleeding seemed to have stopped. Lifting, she drifted ahead of the pride, watching her enviro-panel, reading wind, calculating distance and scent drift. Set the skimmer gently down, half hidden by hawthorn scrub. Just hidden enough, she hoped, to make him think that he might have missed her last time, when he dropped the girl. The meat-hunter’s daughter.  Glancing at her watch, she planted the thick disk of the bio-signature generator in a clump of hawthorn, and hiked downwind, zooming in on the spot with her glasses. She had keyed the link to the lioness’s ID, figured she had about fifteen minutes before she’d need to return and move the skimmer. The lions knew her scent, so hopefully her presence wouldn’t disturb their regular hunting routine.  Five minutes left. She started to get to her feet to relieve her thigh muscles, when she caught the faintest whisper of disturbed air, like the wings of an owl. She froze, eyes fixed on the landscape beyond the grounded skimmer. A vague shape of matte black blocked her view of grass and shrubs. A military shadow field, of course.  She didn’t see him get out of the shadowed skimmer, but of course, he would also be using a chameleon field. Sure enough, a clump of sun dried grass winked out for a moment, then reappeared. He knew where she was—or where he thought she was. He was being cautious.  She had not prayed to any gods for a long time. Not since she had handed over her young daughter to the World Council Force sponsorship coordinator. Gods were like lions, they belonged to the old world. But now she bent her head, prayed that those old, dying gods would gather wind, scent, instinct, and make one thing right in the old way.  He did not fear the lions. She could see it in his preoccupied focus on the clump of brush where she had hidden the generator. They were just park amusements, useful as a movie prop, able to kill a helpless and unarmed girl. Not a threat to him. He had a gun, after all. She bared her teeth at his hubris. It would please the old gods.  The lioness charged in a rush of motion where no motion had existed. The man spun, hand coming up. Light flared and the lioness tumbled, regained her feet in an instant and with a leap, her front feet hit his shoulders, knocking him flat, her claws digging in to hold him. He had time for a choked cry before her jaws closed on his throat. A second lioness charged in, taking him by the thigh. Dust rose, white in her night-vision, as he thrashed, strangling slowly. The lion grunts and chesty growls were the only sound. The other members of the pride had circled in, tearing his belly open before he had quite died.  Tahira started as something moved beside her. The meat hunter squatted silently next to her, her posture intent, not speaking. A loop of intestine gleamed wetly. He had stopped struggling, had finally died. The lioness who had taken him stood up, bit at his dead shoulder and shook her head heavily. She walked a few steps away from the feeding pride, snarled as one of the males took a step toward her, lashed out at him. Her strike was weak, wobbly, and her hindquarters swayed as she staggered away from the others.  “She’s dying,” Tahira said softly. “He shot her.” Her eyes widened as she noticed the faint striping on the lioness’s shoulders. This was not the old one. This was one of the younger animals, the ones that were beginning to resemble their Pleistocene ancestors. She pointed her link at it. Yes, this was the oldest of the younger females, the one who had been pushing the old lioness of late. As she watched the pride feeding, she spotted the old lioness, noticed that she was limping. Not much, but it had been enough to let the beta lioness take over.  Perhaps the old mare had kicked her, when the pride had taken her foal. Tahira let her breath out slowly, pain beginning to seep through the stim’s numbness. Maybe that limp would heal and the lioness would keep her rank now, maybe not. The next female in rank was timid, not likely to challenge her soon.  She might keep her leadership.  For a time.  Tahira got to her feet, feeling shaky to her bones. “You should leave now. Take his skimmer. It got him through the boundary, it will take you out. Sell it quickly. Just in case. I will erase your entry from Security.”  The meat hunter faced her, her expression enigmatic, the years, the past, graven into her weathered face. “What about you?”  “I have some things to fix yet.” She met the woman’s eyes. They reminded her of African sky, blue, dry, and empty. “Your part is over.”  For a moment the woman didn’t move. Then she lifted a finger to her forehead in a salute, turned and strode through the brush to the man’s skimmer. A moment later it lifted and vanished.  The pride had settled down to a serious feeding now and already the scavengers had begun to gather. One of the wild dogs darted in to snatch a scrap, then fled, butt tucked as a young male charged. She could come back in a couple of days, pick up any last evidence. Record the young lioness’s death as an official euthanasia.  She limped to the skimmer, washed by waves of weakness, hoping she wouldn’t fall off before she got back to Administration.  A red icon winked on the control panel. A Security alert. Muttering a curse because she would have thought the meat hunter was more careful than that, Tahira touched it.  Official intrusion with legal permission, contact estimate five minutes.  Tahira leaned against the skimmer and closed her eyes. Legal permission. He got his warrant after all? She waited for the whisper of the grounding skimmer.  “Tahira.” Shawn’s voice sounded harsh. “What the hell is going on? You’ve got lions right behind you. Eating something.”  He was afraid. Her lips twitched and she almost smiled. “They’re busy. They won’t bother us. I think I need a ride.” She forced her eyes open. “I’m not sure I can get the skimmer back on my own. Did you come to arrest me?”  “Damn right.” He appeared beside her, watching the lions. “Hospital first, I think.”  “That’s probably a good idea.” She forced herself straight, looked him in the face. “Did you access that link? Buy the video?”  “Yes.” He looked briefly away.  “The man who dropped them here . . . ” She pointed with her chin toward the lions. Mistake. The world began to turn slowly.  “You’re sure?”  She couldn’t read his expression. “Yes. Take this.” She handed him the stunner from the skimmer. “I don’t think the lions will bother me, but if one does, this will stop it.” She walked away before he could react, circled around to reach the dead lioness, one eye on the feeding lions. They knew she was there, paid as little attention as they gave the coy-dogs that had gathered. She took the tissue sample quickly, dropped it into a collection bag and returned with the last ounce of her strength.  She was done. She let him take over, gave in and let the slowly turning landscape speed up until it swept her away. Was aware of jostling, a sense of speed, a low muttered monologue of cursing. Faded in and out of lights and bustle and the dim distant knowledge in the back of her brain that this must be the resort medical facility. Someone was arguing loudly, right over her. It hurt her head and she retreated into darkness.  When she opened her eyes it was light, daylight bright, and her mouth felt like a Preserve riverbed in a drought.  “They want you to drink this.” Shawn leaned into view, holding a plastic squeeze-bag of yellow-green liquid with a drinking tube.  She sucked at the liquid, winced, and swallowed. There was no way to make electrolytes taste good.  “The bullet did a lot of soft tissue damage but missed anything important,” he said mildly. “Made a big hole though. They left some drains in.”  She peered at the bandages swathing her left arm. It didn’t hurt, but that would probably change when the meds wore off. “Can I leave?”  “I think they’ll let you go if you sign all kinds of waivers absolving them from blame.”  “And do we go to jail from here?”  His eyes narrowed slightly. “That depends. We can talk about it.”  He was right about waivers. She signed and retinaed a half-dozen absolutions of all liability but finally they carted her to the entry in a motorized chair and let her escape. Shawn offered her his arm and she leaned on it. Harder than she thought she would need to. He was driving a small, rather scuffed up electric. His private car? “You’re not on duty?” She realized he was wearing a casual sun shirt and khakis. “Your day off?”  “My day off.” He slid into the driver’s seat, touched on the air-conditioning and sat there as the hot interior air cooled. “Want to tell me?”  “And if I don’t?”  He shrugged. Turned those dry, blue eyes on her. “I guess I could still arrest you on suspicion of being an accessory to a murder.”  “I am that.” And she told him, leaning back against the still-warm plastic of the seat as the car hummed to life and Shawn drove her back to the Preserve. She told him the whole story from her comments on the tour bus, to her ambush by the meat hunter and the arrival of the vid maker.  He didn’t say a word.  She finished as they entered the ornate gates of the Preserve and she closed her eyes, exhausted by the telling, her shoulder starting to hurt now with a muffled throb that promised worse to come.  “A meat hunter.” Shawn parked in the afternoon shade cast by the building’s solar panels. “I’m surprised you don’t want me to go after her.”  “Why?” Tahira opened one eye. “Her world is as dead as mine is. There is no wild meat to hunt any more. Not the kind that made her a living.”  “She could come back to poach.”  “She won’t.”  “You are so sure.”  “I am.”  Shawn sighed. “So you’ve achieved your justice. The lions killed the man the same way they killed the girl. And now you want me to just walk away and call it over. Do you think that ends it, Tahira?”  The bitterness in his voice surprised her. “Of course that doesn’t end it.” She opened her eyes, faced him. “He was not the boss. He was simply a tool. It’s way too big a business. I doubt it will ever end, Shawn.” She opened the electric’s door one-handed, amazed at how heavy it was. “Our species is addicted to death. And now, on the brink of conquering it, we love it even more.” She pulled herself to her feet as he came around to help her and amazingly managed not to sway. “But this ends it here.”  “Are you sure of that, too?”  “Yes.” She looked him in the face. “I am.”  He lifted his eyes, fixed them on the dry blue sky above. “Even if you die?”  “If I die, the information to end it here will come to you.” She started for the entrance, judging the distance. Maybe too far. When he caught up to her, took her arm, she let him, leaned on him. He was angry, radiating like a range fire.  “I guess I’d just like to know who made you judge and jury.”  The door scanned her hardware and opened, breathing cool air over them. The water-wall filled the building with the scent of rain and she took a deep breath, happy in this single moment of sensation. “I appointed myself.” She sank onto one of the floor cushions. “There is beer in the refrigerator. Why don’t you bring us each one? Since you are not on duty?”  He did, handed her the tall glass, sat down across from her, his expression thoughtful. He was older than Jen, his face lined with his years of work. She studied the lines around his eyes, seeing the echoes of old laughter, of sorrow, of life.  “What does this Preserve mean to you?” He looked up suddenly.  She took a sip of her beer, relishing the cool, slightly bitter taste, the dewy chill of the glass against her lips. Life, she thought, is made up of moments. We simply fail to notice most of them. “I have asked myself that question for a long time.” She studied the tiny, silver bubbles rising through the amber liquid. “I’m a lot older than you, Shawn. I’m a product of world that is now dead.”  “Africa,” he murmured.  “Africa is a continent.” She lifted her glass in his direction. “Lesotho. Once upon a time, long before you were born, my people raised and reintroduced lions to the dying plains. We had killed them all and now, many generations later, we brought them back. Only we didn’t know the plains were dying, but they were. We, the Lesotho people, succeeded. For a while.” She lifted one shoulder in a half-shrug. “But the plains died, then the lions died, and ultimately . . . ” She drank more beer. “Lesotho died. Here . . . I found a trace of that dead world.”  “The lions?” Shawn leaned forward and touched her hand lightly.  “Them, too.” She tilted her head to study him, aware that she was getting drunk. “But it is not the world I knew. We did not care enough about that world to bring it back. Why not, Shawn?”  “No tourist value,” he said softly.  “This world the engineers are creating is so old that it is new.” She tried to smile, but it felt crooked. “The merely old has no value. Still . . . there are lions.” She took another swallow of her beer. “And this is a refuge. From memory, if nothing else.”  The entry chimed. “Hey, Tahira, you’re back.” Jen breezed through, bringing in the scent of dust and afternoon heat. “Hi, have we met?” He offered a hand to Shawn as he rose from the cushion. “I’m Jen, a grad student. I study bugs.”  “Hi, Jen. I was just leaving.” Shawn got to his feet, hesitated, then leaned down. “To memories.” He touched his glass to hers.  She hesitated for a moment, met his eyes. Found . . . compassion there.  Jen looked from one to the other, puzzled, as they emptied their glasses. Shawn took them to the kitchen wall, lifted a hand to her, then left, the door whispering shut behind him.  “What was that all about?” He set his field pack against the wall.  “He was deciding whether or not to arrest me.” Tahira watched Jen fill a glass of water. “I’d like some water, too, please.”  “What’s with the arrest thing?” He turned, smiling, a full glass in each hand. “And what happened to your arm? Did you have an accident with the skimmer?”  “Yes. I did.” She took the glass. “Sit down, Jen.”  He sat, the first tickle of alarm tightening the skin of his eyes before he quickly banished it with a smooth, careful smile.  “I have done a number of things in my long life.” Tahira sipped her water. “One was computer security. I was very good. The systems these days are more advanced, but not excessively so.”  “How interesting.”  He was doing the facial expression well, but his body betrayed him, tension lifting his shoulders, straightening the curve of his spine. “Yes,” she said. “So I was able to trace your alterations to the security platform.” She raised her hand to silence him as he opened his mouth. “And I was also able to document the source of the Security breach and ID you. It’s documented, Jen. Archived in hard media to be released to the authorities either on my say-so, or upon my death.”  “I . . . I didn’t know . . . anyone was going to get killed.” His face had gone white and in an instant, the planes and angles of maturity had softened to the rounded face of a child. “It . . . I was horrified. I didn’t know . . . but they’d . . . I didn’t dare say . . . I couldn’t tell . . . ”  Was I ever a child like this? she wondered. She tried to remember. Didn’t think so. Her older daughter had never been a child either. Not really. What about her younger daughter? Had they allowed her to be a child before she became a soldier? She hoped so. With all her heart. That was what I bought for you, she thought. Sighed. “You already knew that girl was dead when I first told you we’d had an intruder. Relax, Jen.” She lifted her hand to silence him. “You are a pawn in this game. You will do one thing for me and then you are free to keep studying your bugs . . . Although I suggest that you look into a transfer to another research program as quickly as you can engineer it.” She studied his bowed head and hunched shoulders. “If something does happen to me, you will certainly be a suspect, so it might be unsafe for you to remain here.”  “What do you want me to do?” he mumbled.  “You will run the DNA analysis on the bones that we found. I will give you a sample of lion DNA and you will make sure that you find that DNA associated with the dead girl. It may be there already. If it is not you will find it.”  “That’s all?” He raised his head, the fearful hope in his eyes painful to look at.  “That’s all.” You would not have survived in my world, she thought.  “I . . . I already put in a grant proposal.” He looked away, swallowed. “I’d be doing it at the Antarctic preserve, looking at the symbiotic bacteria that still exist near the pole.”  Ah, guilt. It would get him out of her sight quickly, at least. “Good.” She nodded. “Here.” She fumbled the collection bag from her coveralls. Handed it to him. The bit of flesh had turned brown and ugly. “This is your DNA.”  He took it and fled. She suspected she wouldn’t see him before he left—not if he could avoid it. Which suited her just fine.  The beer had given her energy, or maybe it had been the compassion in Shawn’s eyes. She had not expected . . . understanding. But now, exhaustion was creeping through her. She opened her holo field and set it to secure, in case Jen was brave enough to return. She opened the camera control and set it to face view only. Her boss would not see her bandages.  Carlo answered quickly, seated in his teak and real-leather desk-recliner. “Did you get my messages?” He looked angry, his jet hair, usually immaculate, slightly mussed as if he had run his hand through it. “What is all this in the media? Tourists claiming that you were a witness to that intruder’s death?”  “I have already informed the authorities that it was a mistake.” She gave him a smooth smile. “The small brush-fire of blogging will fade quickly.”  “This is the last thing we need, Tahira.” He scowled at her. “Such carelessness is unlike you. You know better than to do anything that will incite negative public attention. What were you thinking?”  “I needed to make myself bait,” she said simply. “That was the surest and fastest method.”  He was far more mature than Jen and his face betrayed nothing, not even the tic of an eyelid gave him away. Almost, she could believe . . . “Our security is very very cutting edge. I sent you the inserted visuals that replaced the images of the girl’s dying. Perhaps Jen was in a hurry.” She shrugged. “But he had neither the access nor the expertise to allow an intruder to come and go through the Security shield without triggering any alarm or record. The intruder had a password.”  “How could someone have that?”  She had almost believed that she had made a mistake, but his tone betrayed him. He was asking a rhetorical question. “Only two people have a password, Carlo. You and I. There is no real anonymity in the net. Not for a long time now.” She smiled at him, pleasantly. “I do not believe you are one of the major players here. If I did . . . ” She bared her teeth at him. “I would not be talking to you. I think you merely . . . got a percentage. Rental. And perhaps a copy of the video? Does that excite you? A real and violent death, with real fear, and real blood?”  He flinched then, and her stomach twisted.  “That was how they came to ask you, wasn’t it? You are a customer.” She kept the disgust out of her voice, because it was not yet time to end this conversation. “I have archived a file of all my suspicions and all the evidence I have uncovered to support them. It is not sufficient to convict you. But it is sufficient to let those with greater investigative skills than I have find out the truth. Then they will convict you. On the day of my death, the archive goes to the appropriate World Council committee members.”  “Blackmail?” His lip curled. “Is that so much better than what I did?”  “It’s not blackmail.” She shrugged. “It is simply an insurance policy. To make sure that this does not happen again here.”  He didn’t believe her.  “I am finishing up the DNA scan of the dead girl. I have already euthanized the lioness that attacked her. You may release that information to the media and the public. You may make whatever statement about blogger inaccuracies you choose and that will, as I said, fade away. If anything”—her lip curled—“it will increase traffic to the Preserve. As you know, violent death is a potent pheromone.”  His reaction was more visible this time.  She ended the link. Rudely.  She was entitled to be rude.  “He is too well protected.” She was speaking to Shawn’s absence, heard her own defensive tone. “He is insulated by too much money and too many connections. He would emerge from the ashes of an investigation and nothing would change.” She closed down her field, got to her feet, feeling age in her flesh. How much longer did she have? “Perhaps I am too much a product of my old world. To me, justice is direct—an eye for an eye. The justice of the old gods. Of the lions.”  She had bought the old lioness a second chance. It might not buy her much time at all, or she might get another season before she was ousted by one of the younger, striped, new females that made the gene engineers so happy. She had a tour scheduled tomorrow. The note on the green calendar field on the wall was flashing its reminder. She stretched her shoulder, testing the limits of the pain. If she slept well, she could do it, perhaps with less energy. There would be questions. She would have to decide on the answers before then, would this time do Shawn the courtesy of telling him what her answers would be.  And soon it would be nothing more than an ephemera floating in webspace, evoked from time to time like a fading ghost, through some odd search connection that summoned up a stale blog entry. The world was full of ghosts.  Instead of going to her bed, she slipped outside and found her skimmer parked in its usual place. Someone had cleaned the blood from it. She found her spare glasses in the tool compartment, slipped them on and lifted into the darkness. The lions would be hunting and she might catch the pride on their way down to the river. The pain in her shoulder faded as she toed the skimmer up to speed and slid through the bright bubble of a yesterday that had never really happened.    Originally published in Asimov’s Science Fiction, January 2009.  Mary Rosenblum attended the prestigious Clarion West Writers workshop in 1988, where she sold her first SF story to Asimov's Magazine editor Gardner Dozois and her writing career took off. She published multiple novels with NY publishers as Mary Rosenblum in SF and Mary Freeman in mystery, was a Hugo and Nebula finalist, won the Sideways and Compton Cook awards, and received a lot of critical acclaim for her fiction, both short stories and novels. She began teaching writing more than fifteen years and also works one-on- one with novice writers as a \"literary midwife\" taking authors through drafts, final editing, publisher-matching, and self promotion of their books, to make sure it gets done right. She has twice returned to teach the Clarion West Writers workshop and lives in rural western Oregon where she is a licensed pilot and flies a small plane to as many cool and faraway places as she can.", "text": "16160 words, novelette, REPRINT\nLion Walk\nTahira Ghani stared down at all that was left of the trespasser, the stunner pointed down at the summer yellow grass. The big California condor she had interrupted spread it’s huge stretch of wings and gave a reproachful squawk, scattering the smaller turkey vultures. A hot breeze washed their carrion scent over her, but she barely noticed. The pride probably hadn’t left much and the coy-dogs—well on their way to emulating the Pleistocene wild dogs—had cleaned up whatever the lions hadn’t eaten before the vultures even had a chance. She squatted beside the mess, smelling a trace of blood, spilled gut, lion, and the musky tang of violent death on the hot wind. A torn, bloodstained piece of black fabric fluttered in the breeze, snagged on a hawthorn. Flies swarmed over the few vertebrae and the piece of a rib that remained, the rags of flesh dark red-brown now, the color of old blood. A strand of auburn hair caught her eye, tangled among grass stems. Long. A woman? Like the other one. Caucasian this time. She read the diary of last night in the scuffed ground where the lions had killed, the tracks leading to it, faint on the dry grass, human prints overlaid with lion. She squatted, the stunner in one hand, her dun suncloth coverall hot against her thighs. Laid her fingertips lightly on the double imprint; woman, lion. Brought her hand to her mouth and touched her tongue to her fingertips, tasting dust, dead leaves, and lion.\nRunning. No shoes. Tahira stood, wiped her fingers on her coverall and circled the dusty patch of ground that gave up this information, shaded her eyes to stare at the single print, the faint ovals of toes, ball of foot. No blood, so she hadn’t been barefoot long. Frowning, she searched the prairie bisected by the willow-clad banks of the river. Maybe the intruder had thought the river could save her. Barefoot? In the distance, beyond the summer yellow grass and white fluff of the seeding thistles, the stark peaks of the Rockies jutted against the cloudless sky. Once they had had snow on them, even in the summer. Not in her lifetime. Her frown deepened as she studied the marks where the lions had lain to eat. Coy-dog tracks pocked the dust and flattened grass, along with the prints of the turkey vultures. The condor had chased them away and now they circled patiently overhead waiting for her to leave. By tomorrow, you’d find no traces to prove that someone had died and the lions had eaten here.\nTahira’s frown deepened as she used her link to video the site. She dug into her daypack for a plastic bag, waved the blow flies from the vertebrae and carefully bagged them. Plenty of flesh for a DNA identification. If this trespasser had wanted to be eaten, she could not have done a better job of placing herself in the old lioness’s path.\nJust like the other one.\nTahira collected the fabric and hair, added them to the bag, then trudged back to her skimmer, stowed the stunner in the scabbard beneath the saddle and climbed aboard. The vultures were already descending, dodging the condor’s half-hearted feints, squabbling as they searched for overlooked scraps, their huge black wings raising dust from the scuffed ground. She pulled out her link and texted a report of the intruder’s death to her boss. Then she frowned at the screen and turned it off. He’ll scream about the PR aspects. Not now.\nThe fabric, torn, dirty, and bloody as it was, had had the feel of silk, the sexy kind of shirt you might buy to wear for a lover. Tahira toed the skimmer to life and lifted gently from the riverbank.\nThoughtfully, she pulled her AR goggles on and zoomed in on the ground as she spiraled slowly outward from the site of the killing, reading the night’s traffic in the bent grass stems, the wisp of tan hair snagged on a tangle of riverbank willow.\nShe knew where this pride would be lying up, didn’t need to search for their signatures with the tracking software. Every major mammal in the Pleistocene Preserve was chipped, from coy-dogs to the new pair of giant sloths that had the gene engineers popping champagne corks, but after her years here, she rarely needed to use a chip to find what she was looking for.\nTahira accelerated until the wind pulled her lips back from her teeth. Not one Perimeter alarm had gone off last night. Same with the last one.\nTahira spied a patch of tawny hide in the shade beneath a clump of hawthorn a split second before the goggles ringed it with red and flashed an ID number above it. She braked hard, spiraled back and down. That was the small male, the one with the ragged ear, one of the old lioness’s last surviving cubs. He was a classic African type, with a full tawny mane and only a hint of the Pleistocene striping and narrower head. Which meant he was on the cull list. Like the old lioness. The IDs of the rest of the pride flashed into view. Right where she knew they would be. The old lioness was on her feet, looking up at the skimmer, her scarred face and faded, ratty fur a testament to her age. She was smart and she learned quickly. An offering like the girl would have been too good to pass up the first time. This second offering would have been easier to take.\nTahira sighed, and spun the skimmer away, out over the broad plain of yellow summer grass patched with the dusty gray green of hawthorn and the darker junipers. A small herd of antelope raised their heads as she soared over, tails flashing nervously. The big herd would be farther north, she’d check on them as she circled home. A hawk soared at eye level as she rose, turned its attention back to the ground, searching for rodents flushed by the antelope below. Tahira checked on the horse herd, found them southward, watering at the grassy back of the narrow river, whose waters ran clear and dark. Automatically, she noted the dwindling feeder stream that would be down to a trickle in another month. No glaciers to keep rivers running out here, not anymore. Dark tails whisked their dun sides and they stamped dark-striped legs at the biting flies. The gene engineers were winning here, too. They had engineered the original Przewalksi’s horse into a chunky look-alike to the horses that had grazed this plain in the Pleistocene. They were working hard on the elephants now. Some of the recent calves were going to be huge and hairy. She did a quick count of the herd using her link software to scan the GPS chips, although she really didn’t need to. She’d have all the numbers available from the daily sat-scan when she got back to Admin. She didn’t have to do the rounds in person at all, but she liked to see for herself.\nAnd the last body hadn’t showed up on the Security report at Admin. She suspected this one wouldn’t either.\nThe lead mare raised her head as she circled. The lame filly was gone, probably brought down by the same lion pride that had taken the trespasser. They would have gotten the filly long ago except that the old lead mare was her dam and had protected her foal fiercely, with the whole herd to back her up. Luck must have aided the pride. The old lioness was showing her age, and avoided the hard kills now.\nSo she had taken the meal that had walked up and asked to be eaten.\nHow in the name of all that was unholy had the trespasser gotten past the Perimeter?\nTahira kicked the skimmer to high speed, circled south to where the bison herd grazed the lowlands, their huge, erect horns another testament to the geneticists wizardry. The eastern elephant troop was hanging around there right now, close enough to the monorail to give the tourists a good show. Sure enough, a train had stopped and even at her height and speed she could make out the passengers hanging out the windows, pointing their links. Their tour goggles would pick out the hairy Mastodon-type calves for them and explain in a pleasant voice how the engineers were tweaking the genome. The old cow raised her trunk to blow at Tahira as she skimmed by, then went back to scooping dust from the wallow they’d created, tossing it in ochre showers over her back. Tahira didn’t see any of the camels, but they were probably all back in trees, out of the sun. They, too, were changing. The old lioness was the only remaining lion that carried wholly African genes, had been wild-caught as a cub.\nTahira liked her for that.\nWith a sigh, Tahira grounded the skimmer to text a quick report on her find to her boss. Then she shut off the link before he could reply and swung the skimmer northward to find the big antelope herd.\nThe sun was dipping toward the horizon by the time she returned to Admin. Only the solar farm beyond the low, ochre buildings, row upon row of collectors following the sun, spelled ‘tech.’ The earth-brick buildings might have been built by some primitive peoples, blending gently into the summer prairie. Tech was pretty much invisible now—except in the dry lands where the ranked mirrors of the solar farms and the wind towers had supplanted juniper and sage. But nobody went out there. Her village would have suited this landscape, she thought. Huts decaying slowly into the shriveling desert that had once fed lions and antelope and people. Tahira set the skimmer down hard and fast on the small landing pad behind the building. The trickle of water down the central interior water-wall washed a breath of moist cool and greenery-scent over her as she entered, tempting her to strip, shower, and sit in the pool. She ached after her full day on the skimmer. Once upon a time, she had not ached. It was time to make another appointment at the geri clinic. Or perhaps not. Every cycle had a natural end. Well, perhaps that was no longer true. Tahira sighed at the angry blink of the red priority icon above the holo deck.\nShe ignored it and instead seated herself on her working cushion, doing full lotus for concentration. Called up Security. Some eye somewhere must have seen the girl last night. She started a search for predator-prey movement, narrowed the profile to a human’s mass. No point in watching rodents and coy-dogs. That got her lions, antelope, bison calves. A headache blossomed behind her eyes as the images flickered through her field.\nThen . . . there she was. Shadowy, slender, her arms, neck, face, legs stark white in the night-eye recording, that black shirt that would be torn and bloodied revealing a deep cleavage and breasts that were small enough to be natural, not sculpted. Tahira’s eyes narrowed. Short shorts, sexy clothes, nothing you’d wear into the thorny scrub of the Preserve. Sandals, so she had lost them, running. No blood on that white skin. She hadn’t waded through the hawthorn then. How old? Sixteen? No, she decided. Less. Maybe fourteen. That was how old her daughter had been, last time she had seen her. Tahira tasted blood, realized she was biting her lip. She watched the girl wince, bend a slender leg to rub at something—thorn or bite. She looked lost. Pissed. Stood up by a date pissed.\nThen, her expression changed from lost-and-angry to startled. Then frightened. She looked around and for an instant her eyes seemed to meet Tahira’s. Accusingly.\nLike an antelope, she turned and bolted, running through the grass and thorns. One of the sandals flew off, a twinkle of motion on the screen.\n“Don’t run.” Tahira said out loud.\nIn the holo field the girl kept running and in a second vanished from the eye’s sweep.\nTahira found herself standing. Muttered a curse. She skimmed to the next eye, which should have picked up the girl’s panicked flight and probably the kill, since it covered that sector.\nIt showed her grass, scrub, the scurry of a small rodent, the silent float of an owl. The small dying shriek of the rodent made her flinch, then she skimmed back through that eye’s sequence.\nNothing. She slowed the segment, watched the owl creep across the scene. Frowned. Seed heads bowed the grass. This species had finished seeding weeks ago and the seed heads had shattered, spilling their ripe seeds.\nShe copied and filed both sequences and had the station AI code them for search identification. Then she set the AI searching the Preserve’s security base for an exact match to the quiet scene recorded by the second eye. Within a minute, a 99% match popped up in her holo field. Side by side, two owls floated and twin shrieks split the quiet. She checked the properties. Yep. The scene had been recorded five weeks ago, on a quiet night with . . . she checked . . . no Security alerts, not even a native antelope bumping the Perimeter fence.\nFor several moments, she frowned at the now-frozen images, then blanked them. This time, she directed her AI to match the visual image of the girl running, but she directed it to search the web, excluding only the Preserve data files.\nThat search was going to take some time.\nWith a sigh, she emailed the video of the girl and the twin owl sequences to her boss, then reached into the holo field to touch the angry, blinking priority icon.\nIt took five full minutes for Carlo to appear. Which meant he was probably in bed. With someone. He had just spent a week at a body-spa and he was probably trying out the upgrades. Tahira braced herself as Carlo’s face and torso appeared in the field, yes, wrapped in a silken robe, his usually-perfect hair tousled. “About time.” His eyes narrowed. “Where were you? I called you as soon as I got your report but your link didn’t answer.”\n“Checking the range.”\n“You have software to do that.”\n“The software didn’t find her. I did.”\n“Has the media gotten hold of this?” Carlo looked over his shoulder, back to her, lowered his voice. “I assume not, or my interface would have picked it up and alerted me.” His dark eyes snapped. “All right. This time, you need to find out how the trespasser got in. And why Security failed to alert you. Again. Meanwhile, you will euthanize the lions involved. As insurance against media clamor. We will have done all we could do.”\n“It’s not the lions’ fault.” Tahira shook her head. “The girl was meant to run into them. She was dropped right in front of them.”\n“What do you mean she was dropped?” He ran a hand through his hair. “Make sense, Tahira, will you?”\n“She was dropped.” Tahira bit the words off. “By a skimmer, helicopter. Something. She was in sandals. Bedroom type. I just emailed you the Security clip that did pick her up. And the clip that was used to replace most of the visuals.”\nHe stared at her. “That’s unbelievable.” He chopped her words aside with the flat of his hand. “Do you know how much it would cost to do that kind of hack job? Worry about the Perimeter security. Something is down. The lion euthanasia shows the public that we’re doing a good job of dealing with this. The US media will howl if they get hold of this. You know how they feel about the Preserve.”\nYes, she knew.\n“I can sacrifice you or I can sacrifice a lion or two. You decide, Tahira.” Carlo’s eyes narrowed. “And before you say anything, you’re a hell of a lot more valuable to me than the lions, they’re breeding just fine. Besides, as soon as the genetics geeks get their Panthera leo atrox phenotype we won’t use African lions anymore anyway. So let’s just call it moot and drop it.” He glanced over his shoulder again and his mouth tightened briefly. Turned back to Tahira. “I am ordering you to euthanize a lion that killed this person. Make sure you get a DNA match so we can prove it, and I’ll leave it to you to get the right one. I’ll let you claim it was a rogue animal and make it plausible.”\nHe was giving her a lot. Carlo could have demanded the whole pride—the media would press for it. He could have fired her. “Can we talk about how this girl got in here? She was a girl, Carlo. Dressed for a hot date. Go take a look at that clip I sent you. She did not hike in from the Perimeter. I think that’s a bit more important than pleasing the media.”\n“No, it’s not.” Carlo cut her off with another chop of his aristocratic hand. “If we’re lucky, nobody will pick it up. Make sure you secure those video files. The administrative contract for the Preserve comes up for renewal in one month. The US will push hard to take it over, as usual. If you want a job a month from now, you’d better hope the World Council thinks we’re doing a good job here and doesn’t award the contract somewhere else.” The holo field blanked.\nTahira stared into the opalescent shimmer.\nHe was right. The vast Preserve, the huge central section of the US that had been restored to its Pleistocene ecology, including megafauna and the species that had inhabited this land millions of years ago, was part of a giant experiment in ecological climate control. And genetic engineering. And a huge tourist draw, which the US did like. A lot of countries were uneasy about it, seeing a threat to their own grasslands and dwindling wildlands as the growing Gaiist movement used carbon credit leverage to pressure for more preservation. Too much media outcry and the US might garner enough support to end the Preserve and take over control of the huge area again, never mind the carbon credits they’d then owe. It was a matter of national pride, she thought sourly. That had always transcended logic.\nShe made herself a pot of very black tea and began to go through the security records for the past twenty-four hours, searching for human-sized mass or any sign of a small-craft landing. As the sun cleared the horizon, she finally shut down her station and stumbled off to her small room behind the water-wall, sprawling sweaty and fully clothed across her bed.\nNo airspace invasion, no vehicles, nobody on foot. Maybe the girl had teleported in. She laughed sourly. Sure.\nJust like the last one.\n“Tahira? Hey, Tahira, are you okay?”\nJen’s voice. Tahira blinked crusted eyes, swimming up from a deep pool of sleep and dreams she couldn’t remember but that had stalked her like lions. “Late night.” She realized that she had spoken in Sotho, switched to English. “Sorry. I just need some tea.” She sat up, stiff and sticky in her dirty clothes, rubbed her eyes.\n“I already made you some.” Jen stood in the doorway, nervous, a mug in one hand. “When you didn’t hear me come in I figured you really needed tea.”\n“Yeah. Thanks.” Tahira got up, glad that she hadn’t stripped last night and took the mug. “I appreciate it.” She gave him a smile because this too-earnest graduate student had tried to climb into her bed a week ago, never mind the age difference. And her ‘no thanks’ had apparently bruised him. She swallowed a stinging gulp of the strong-enough tea, gave Jen a nod of approval. Usually, he made it too weak.\n“You got official mail.” Jen stood just outside the door, as if a strand of Perimeter fencing blocked it, his beaded and braided, silver-white hair—stark contrast to his tawny skin and intended to be sexy—swinging forward around his face with his nod. “Security seal. Looks important.”\n“Yeah.” Tahira drank more tea. The official execution orders. “We had another trespasser last night.”\n“You’re kidding.” Jen’s eyes got round. “No, you’re not. Another . . . another kill? What are we going to do about it?”\nShe brushed past him, angry because two plus two was a simple equation. But guilt stabbed her. He had brought strong tea. And he didn’t really understand the Preserve politics. She paused, looked back and shrugged. “I’ll have to kill one of the lions of course. Even though it wasn’t really their fault.”\nThe information didn’t move him, but why should it? He was a graduate student, studying the symbiosis of lions and one of the predatory wasp species. Esoteric stuff. A study that provided a comfortable living and yielded information. Lions were just the food providers for his wasps, who laid their eggs in the larvae of a biting fly that pestered the lions. And the wasps were just a day job, a means to an income. He’d study whatever he was paid to study. She sighed. “Come have some breakfast with me, eh? I found a fresh guinea hen nest yesterday.”\nShe softboiled the small, tan eggs and they ate them together as she listened to him prattle on about his wasp collecting, larvae counts, population fluctuations. When he left on his skimmer, with his collecting nets, sample bags, and a stunner, Tahira stripped and scrubbed herself clean of last night’s sweat and the smell of violent death. She stripped the bed, tossed the dirty sheets into the sonic cleaner, and padded barefoot, in a clean shift, to the lab refrigerator where she had stored the trespasser’s bones. The bag containing the black shirt lay on the floor beside the refrigerator. She picked it up, smoothed out the torn and blood-stiffened fabric within its plastic shroud. Why did you come here? She spoke silently to the girl’s spirit. The lioness’s killing was innocent. My killing of the lioness will not be innocent and it will be my burden not yours. Anger burned through her. “Your death was not innocent,” she said aloud. “You brought it with you and left it like poison on innocent ground.”\nBut her own words sounded hollow and that image nagged at her . . . the ‘where’s my date?’ body language, that single, decorative sandal tumbling through the air, bright against the stark night-vision landscape. Dropping the shirt, she took out the bag with the vertebrae and hair and got to work.\nThe first thing she did was file a full report to the local Sheriff’s Department. That meant the media would have the news within the hour. The Sheriff’s security leaked like a sieve. Next, she started the DNA scan. She was only required to run a minimal ID scan, but she did a full analysis. The longer she spent on this easily-rationalized task, the longer she could put off the euthanasia. By noon, her back ached from standing and the building’s major-domo announced Deputy Malthers. Shawn. He always handled Preserve issues. She sent the data to her personal workspace and shut down the lab, retreating into the main room and the cool breath of water-wall. “Come in.” She admitted him and he sighed in the cool air, removing his hat, half moons of sweat darkening the tan sun-cloth of his uniform.\n“Tahira.” He nodded, his weathered face closed and cautious. “You had an intruder, huh?” Another one, his eyes accused. “Supposedly your fence is tight. Do I have to worry about lions in the hotel lobbies?”\n“You know you don’t, Shawn.” Tahira studied the tight lines around his eyes. “The Perimeter isn’t porous—to animals. Who chewed on you?”\n“My boss, the Sheriff. The governor chewed on him.” He sighed and tossed his hat onto the corner of the table. “He’s getting more pressure from the Take Back America people. They got the news even before the media could post it on the net. Can I have a glass of water?” He gave her a plaintive look. “I know you run a tight ship, Tahira, but jeeze, two deaths in two months? This is too good for the media to pass up. You should see the hit rates.”\n“Sit down. I’m sorry.” She headed for the kitchen. “I didn’t get much sleep. Did you get the DNA scan I sent your office?” She carried two full glasses and a pitcher of water back, set the tray on the low table near her work field.\n“Yeah. No match.” He took a glass, drank half of it in long, gulping swallows. Wiped his mouth on his sleeve. “She’s not a missing person. I sent it to the national DNA database, but you know how long that takes.” He rolled his eyes. “They’ve got a six month backlog and that’s just on violent crime. I still haven’t heard back on our first Jane Doe.”\nAt least he had said ‘our’, although technically, the Preserve was administered by the World Council and not under local jurisdiction. Still, the World Council liked to let local law deal with matters if at all possible. Tahira sat down on her cushion. The holo field shimmered to life and she opened the data file, staring thoughtfully as the letters, numbers, and icons winked like emerging stars.\n“I know her.” She spoke to the galaxy of numbers and icons—the translation of those rags of flesh and bits of bone. “She grew up in a slum.” The heavy metal load in her hair could only belong to a child of the unclensed suburban wasteland. “She was very young, less than sixteen, I am guessing. European, probably Scotch-Irish, no Asian or African genes, minimum melanin.” Her skin would have been very fair and the red in her hair was natural beneath its cheap dye. Poor all her life, considering the uncorrected genetic predisposition to cholesterol and cancer. She would not have had an uncomplicated middle age, if she had lived. She would have died young, relatively speaking. Unless she earned the money for genetic repair. “Look at this.” She called up the security clip, ran it. Listened to Malthers’ soft indrawn breath.\n“She didn’t expect lions.” His face was grim. “And she sure didn’t get lost from one of your tours, huh?”\n“Nobody gets lost from our tours.” Tahira shook her head. “And no, she did not expect lions.”\n“You got any ideas?”\n“This cost a lot of money.” She looked at him. “Hacking our security. It would be expensive. We do not use cheap security.”\nHe was looking at her quizzically, his thick brows drawn down over those so very blue eyes.\n“Some things,” she said slowly, remembering, “don’t change.”\n“Like what?”\nHer link chimed. “I have a tour scheduled.” She stood, feeling age in her bones, even though they worked perfectly, levering her young-muscled body erect. As if invisible teleomeres were shortening, ticking like a clock. “I have to go. If I find anything out, I will email you.”\nHe headed for the door, paused to look back. “Stop by the office.” Those so blue eyes fixed on her face. “I’ll buy you a beer.” The door closed behind him, breathing hot dust into the room.\nThe tour was an expensive one, which was why she had to lead it. It would be a package with a hotel, maybe a body spa, the Preserve and a tour conducted personally by the Manager. That was her. Her contract specified how many of these she had to do each month. Originally, Carlo had suggested she wear native dress. When she had told him that would be a ragged T-shirt with the name of a football team on it, he had shut up and not mentioned it again. The tourists were waiting beside their air-conditioned tour bus, looking around at the dusty little compound, pointing their links at the buildings, the guinea hens scratching in the shade. The link videoed the image and instantly searched the web for a match, downloading informational links. The life cycle of the guinea hen, the history of the Preserve, the blueprints for the buildings, if you wanted to look at them. Their tour guide spotted her and said something. Instantly they all, nearly in unison, pointed their links at her.\nA part of her wanted to duck, as if they were pointing weapons. The gesture was, her hindbrain told her, the same. Was it, she wondered briefly, that this pointing of links to acquire information was a hostile act? Or was it that the men who had fired on the refugees when she was a child hadn’t been hostile, had treated the dealing of death as casually as these tourists treated the gathering of information? She didn’t know, hid her flinch and smiled for them as the guide did the introduction that they weren’t listening to. Their eyes were on their links as she downloaded onto their screens life and death, love and loss, success and failure, rendered in text and images. She climbed onto the bus after them, took the plush seat up front, facing them. The guide sat beside her in the other rear-facing seat. Some of the tourists were from off-planet, perhaps one of the orbital platforms or perhaps even Mars. They had brown skin, lighter than her Lesotho skin, but their bodies seemed frail, out of proportion. They looked at her, eyes bright.\nThey did not look quite human.\n“Go straight out of the compound and take the first right,” she told the driver, who was a regular. “We’ll take the road down along the river.”\n“We’re here to see the Mastodon calves.” One of the off-planet tourists looked up from her link. “The park map IDs them to the west, over in the hills.”\n“The old cow always brings them down to their favorite place on the river at dusk, to drink.” Tahira spoke patiently. “You’ll have time to stretch your legs and have some dinner before they show up.”\n“Why don’t we just go where they are?” Someone else spoke up.\n“Our rhythms are more flexible than those of the animals.” She kept her voice patient. “They know we will be there at the river, we are usually there, that does not bother them. It is familiar. If we arrive unexpectedly in an unusual place . . . they will be bothered. And that is unhealthy.”\nThat didn’t satisfy all of them but she didn’t expect it to.\n“Hey.” A woman with a very young face, golden skin, and hair as silvery white as Jen looked up from her screen. “I just got a newsfeed . . . a tourist got killed by a lion! Last night! This is the second lion kill!”\nMurmurs swept the bus and all eyes focused on the link screens.\n“It wasn’t a tourist.” Her words fell like stones into the murmur and eyes pried themselves from link screens. “A young woman was dropped from a hovercraft for the lions to find.” She spoke into silence now. All eyes were on her and somehow, this felt no different than the pointed links. “She was intended to die. Someone videoed her death. That person will sell the video for a lot of money. Violent death is very valuable. It is an ugly trade.” Only the purr of the bus’s power plant could be heard now. “But it is a very old trade. No matter. I saw the vehicle that brought her, I saw the person who operated it. I observe that lion pride every night and I was there in the darkness. He will be caught.”\n“That’s not on the newsfeed.” The accusatory voice came from the rear of the bus. From one of the off-worlders. Tahira shrugged. “I did not tell the media this. But you are safe.” Her smile was genuine this time. “The lion pride does not water where we will be. This is not their territory.”\nShe wasn’t sure if they were relieved or disappointed. She cut off their questions by launching into her usual lecture, pointing out the changing ecosystem—it had not reached full climax equilibrium yet—directing their links to the coy-dog family holed up in the shade, waiting the cool of evening. The puppies were playing a game of tug with a scrap of dirty hide and links bristled, zooming in to record. The larger animals were all chipped so the links would offer up the ID information for each animal, their stage of development toward the Pleistocene ideal as the engineers evolved them into their own ancestors.\nVoyeurs, she thought as they pointed and murmured. An observable reality, but not personal. Not threatening.\nShe politely refused to say any more about the death, telling them only that the authorities would handle it. The tourists were distracted by the smaller horse herd. One of the young stallions had been challenging the herd sire over the past few weeks and he chose this day to take his challenge to a new level. Dust rose in tan clouds as the two horses circled and feinted, ears flat, striking snake-like for a bite, whirling to kick. This time, the youngster wasn’t backing down and the two stallions rose, chest to chest, teeth bared. “These horses are very much like the Equus verae, the horses that grazed this plane a million years ago. If you’ll put on your glasses, you’ll be able to identify the young male.” She paused while the tourists all fumbled for the glasses they’d been given at the start. They were slaved to hers. She IDed the young male by chip number and a green halo instantly surrounded him. “This young stallion was foaled four years ago in the spring. The engineers believe that he is a good likeness of the original Equus verae. All the stock began with Przewalksi’s Horse, the last truly wild horse species.” They were all watching now, as the stallions shouldered and circled, wheeling to kick, or rearing to feint and bite at each other’s faces. Tahira stifled a sigh. “The herd sire is nearly ten years old. That’s a long life for a herd sire.” The young challenger had been born of artificial insemination with the new, improved genes. If the old herd sire didn’t get ousted soon, she’d have to help a new challenger along. “This is not reality,” she murmured. “It is our version of reality.”\n“Pardon?” One of the off-worlders had moved to the front of the bus for a better look, was pointing his link at the fight, recording.\n“Nothing.” She shook her head. “I was just talking to myself.”\n“It’s so . . . uncontrolled.” He had friendly dark eyes and a wide smile that made his too-fragile body seem less different. “Hard to imagine living in a world this . . . chaotic.”\n“It’s not chaotic,” she said softly. “Only humans are chaotic.”\nThe horses saved her from the questions surfacing in his eyes. The young stallion whirled as the herd sire struck and his heels caught the herd sire full in the face. They heard the thud of hoof on bone, even at this distance, and the sire went down in a cloud of dust. He struggled instantly to his feet, but his jaw looked twisted and blood darkened the dun hide. A low murmur of horror washed through the bus.\n“What now?” The white-haired woman’s voice rose over the babble. “What will happen now?”\n“This was an accident. Fights like this rarely result in serious injury.” Tahira blocked the tourist glasses, but had her own zoom in on the injured stallion. No point in showing them the bloody details up close. The youngster had run him a few meters from the mares and now trotted back and forth, tossing his head, tail erect as the ousted sire stood with head drooping. She winced at the white gleam of either bone or teeth visible in the bloody mess of his face. Violence seemed to be gathering over the Preserve like a dark cloud. “His jaw is broken.” She didn’t need the text diagnosis scrolling across the visual field. “He won’t be able to eat. The lions will probably kill him, or even the wild dogs. This coy-dog is heavier than the old North American coyotes and they hunt in small packs. They occasionally kill large prey species, mostly when the animal is weak or crippled.”\n“Why don’t you do something about it?” A woman spoke up, her voice shrill.\n“You could take him in and heal him, right?”\n“And what will the lions eat tonight?” Tahira faced the woman, watched horror and anger ripple across her features. “These are not our rules. They are much older than us,” she said gently. “That is what the Preserve is all about . . . returning to the old rules. Without the horse, a lion cub may die because of insufficient nutrition.” She waited for the horrified comments to ebb. You could hear the excitement beneath the horror. Now they had a prize in the video files they’d just uploaded to their personal space—something to show proudly to friends, so they could commiserate over that raw moment of blood, and pain, and imminent death. The woman who had spoken up wasn’t satisfied. She was talking about cruelty and emails to powerful people.\n“Did you make this happen for us?” The off-worlder was looking at her, and his eyes were shocked and cold.\n“No.” She met those eyes, saw her own reflection in them, tiny and perfect. “But I knew the old stallion would be forced out sooner or later. The horses decided to make it happen now. The kick was a freak accident. Horses are good at dodging.”\nHe didn’t believe her. You cannot conceive of no control, she thought. And wondered suddenly if her daughter had gone off-planet. The Council Security Forces were everywhere. She had never thought of that before, and it chilled her, she was not quite sure why. She would be much older than this man, now.\nThey moved on and the tour guide, a seasoned professional, texted her a request to show them something to change the now-soured mood. She had anticipated this and had already called up her inventory. “Turn left just past that clump of willow . . . yes, there.”\nThe bus took the dirt track easily, it’s off-road suspension barely sloshing the drinks that the attendant was handing out. “The engineers have had excellent success with the long-horned bison. They are very like the bison that grazed this plain during the Pleistocene. Three cows have calved this month and the latest was last night. She scanned for the IDs, found the three cows in close proximity 200 meters from the road. “They’re out in the grass, so we can watch them without disturbing them. If you’ll look through the left windows and follow the arrow directions on your glasses, they’ll direct you to the calves.” A green arrow winked on her glasses, pointing to the right and as she turned her head, it was replaced by one pointing straight up. She lifted her head, and there, in the distance, she spied the small black dots that were the grazing bison. The bus had come to a halt. “Have you all found the bison?” She waited while the slow ones fumbled their way to the bison herd. Zoom while they were panning and they’d get sick every time. “Okay, here we go.” The field blurred and suddenly seemed to be rushing toward her. The tiny specks enlarged, became a dozen shaggy brown beasts with their noses in the sun-burned grass, backs dotted with cowbirds. Small white herons stalked among them, snatching up beetles and the occasional rodent stirred up by the bison’s hooves. Their long horns gleamed in the sun as they tossed their heads at flies.\nThe newborn calf hugged his mother’s flank, his horns mere bumps. He suddenly butted beneath her flank, tail wriggling as he nursed. The collective sigh from the tourists made the guide breathe his own sigh of relief, she noted. Well, upset guests would hardly give him a fat tip. She let them watch the two older calves butt heads and the herd even obliged by grazing closer to the bus. By the time they moved on to the elephant watching spot for cocktails and their gourmet dinner, the mood was festive once more, the injured stallion forgotten.\nTomorrow, she would go check on him. Assure herself that the predators had found him. Injured as he was, the dog pack that patrolled that territory would almost certainly take him, but perhaps not right away. She called up that sector, scanned the predator inventory. To her relief, the lions were headed in that direction. They should get to him quickly.\nDuring dinner they lucked out and a scimitar cat—quite shy and a rare sighting—chose that night to come down to the river to drink. The tourists flocked to the windows, their links pointing as they videoed in night mode. The elephants showed on time and the new Mammoth type calf went so far as to walk nearly up to the bus, trunk lifted in curiosity, before his mother shooed him nervously away, and stomped a threat toward them, her ears erect, trunk curled back like a cobra.\nThe tour guide looked pleased, as if Tahira had orchestrated the whole show. Tahira sat back in her seat as they returned to the compound in the gathering darkness, answering questions, giving small lectures on the history of the Preserve, the geneticists’ work, the effect of the huge preserve areas on climate stability. They asked occasional questions about the injured stallion.\nNo one brought up the dead girl. Not one.\nShe climbed down from the bus into the cooling night beneath the white arch of the Milky Way and a sliver of new moon. They would go back to the comfort of the resort to have dessert and drinks and to compare video clips. The tour guide gave her a wide grin and a wave as the door closed, anticipating good tips, obviously.\nJen would have left for the day and she would have the place to herself.\nYou have a visitor, the door murmured as she reached the verandah. He had an official security pass to enter. His personal ID is blocked. “I know who it is.” She sighed, then straightened her shoulders. “Open.”\n“What the hell is going on, Tahira?” Detective Malthers levered himself up from the sofa in the main room. “Do you know just how much trouble you’re going to cause me when my boss starts getting the feeds?”\n“He has his link shut off tonight? I would have thought he’d have the news already.” She headed for the kitchen wall, thirsty. “And if I protest your use of a security pass to override my door lock, I hope you can produce the warrant.” She closed her eyes as he seized her arm. Halted. “Shawn . . . I’m sorry.”\n“Sorry?” He spun her around to face him, his face pale. “You withheld information from me? You lied to me about that girl’s death? And then you spill it to a bunch of tourists?” His nostrils were pinched. “You’d damn well better be sorry.”\nSome of them had certainly blogged from the bus. She had counted on that. She met his eyes. “I did not lie to you.”\n“Then why did you tell them . . . ” His eyes narrowed and he let go of her arm. “No way. No way you do that.”\n“Do what?” She widened her eyes. “If I tell a story to tourists to enliven their trip and they exaggerate it in their personal blogs, this is not a crime. Your boss can deny whatever he wishes to deny and if the outcry is loud enough, my boss will probably fire me. Would you like some water?”\n“What do you think you’re going to do?” His voice was harsh.\n“Go to bed.” She filled a glass from the refrigerator tap, filled a second glass.\n“I’m going to get a warrant for your arrest.” He ignored the proffered glass.\n“On what grounds?” She raised an eyebrow. “I suspect your boss will not agree with you. It will be hard enough to deal with the media when they get hold of the tourists’ mistaken statements. It will be much worse if you have arrested the manager of the Preserve and then have to release her. Your boss is very conscious of his media image.”\n“I’m staying here tonight.” He glared at her.\n“Be my guest.” She shrugged. “I told you, I’m going to bed.”\n“Good.” He stretched out on the sofa, his jaw set.\nShe turned her back on him and activated her holo-field. Checked the Preserve first. Minor Perimeter alerts only—a couple of licensed backcountry backpackers who had retreated when they triggered the broadcast security announcement, a small herd of pronghorn that moved off when the repulsion field activated, broadcasting an unpleasant sonic pulse that discouraged most wildlife and the occasional lost livestock. Nothing else. Red icons signaled stationary chips—indicating that a bearer hadn’t moved for twelve hours. That usually represented death or serious injury. She checked the IDs . . . all prey species except for one elephant from the northernmost herd. An old female, but not so old that she should be dying yet. The elephants and the larger predators had been implanted with biometric chips. Tahira checked it, found signs of physical distress, but no clear diagnosis. She transferred the ID to her link. She’d fly over in the morning and check on it, on her rounds to chip new births. See what had happened.\nHer AI search of the Security video of the running girl had turned up a match. Eighty-nine percent. Tahira drew a deep breath, touched the green icon. A merchant site. Models? A naked woman lounged suggestively on a grizzly’s hide, caressing the dead, snarling face, tongue-tip peeking pink from lush, crimson lips. The secure interface requested a user ID and password. And a credit card. The entry fee made her purse her lips. She flagged the link, emailed it.\nMalthers was peering at his link, his feet propped on the arm of the sofa. He looked up as she shut down her field. “What if the person who dropped her was a woman?” His eyes were hard.\nShe shrugged. “You are too tall for that sofa. Would you like me to inflate the guest bed?”\n“No, thank you.” He went back to his link. “I don’t plan on sleeping.”\n“While you are up, then, maybe you can see what’s for sale on the video sex markets. I just sent you a link that you might . . . find interesting. I don’t have the budget to access it.” She turned and went into her room. When she woke briefly in the middle of the night, the light in the main room was still on and he was sitting on the sofa, hunched over his link.\nShe slept without dreaming, after that, and when she woke, he was gone.\nThe door seal sighed as it released and Jen strode in, bringing a smell of hot noontime dust and heat, a hint of lion and sex. “Hey, how was your tour last night? Did they do a fancy spread?” He came up behind her, dropped his collecting bag onto the tiles with a small thump. “What’s with the reporters outside? The newsfeeds were full of the killing this morning. You were a witness? To the girl’s death?” His sandy brows arched over his pale eyes. “You didn’t tell me that.”\n“I know I didn’t.” Tahira waved her hand through the field and the numbers and icons, the map of this girl’s history written in molecules, winked out. “Let’s not talk about it, okay?”\n“You haven’t opened your secure email from the boss yet.”\n“I know what it says.” She sighed.\n“Tahira . . . ” His hands came to rest lightly on her shoulders. “I work with the lions, too. I can do this euthanasia for you. You don’t have to. Just give me the chip ID.”\nHis hands offered comfort not sex. She let her shoulders relax a bit beneath the warmth and acknowledged the small heat of desire between her legs. He was very pretty. He would try hard to please her in bed. Her shiver of anticipation made her . . . sad. She was old enough to be his grandmother. The flesh had its own morality. She sighed, and his hands slid from her shoulders as she rose. “I appreciate your offer.” She smiled for him. “But it is my duty. It is my failing that the girl was able to be here.”\n“That’s not true.” He shook his head, frowning. “She bought hackware good enough to get through the Perimeter sensors. It’s happened before. Remember those rich kids that came in here with a rifle? Right after I started working here? The ones who thought they were going to kill an elephant? That’s not your responsibility—that’s the responsibility of the company that contracts security to the Preserve.”\n“That’s not what happened.” Tahira blanked the icons with a wave of her hand. “This is not like those teenage poachers with their utterly inadequate rifles. I knew they were there.”\n“So her hackware was better, that’s all.” Jen shrugged. “Come on, Tahira. Nobody is blaming you . . . except you.”\n“I doubt that is true.” She turned to meet his pale eyes. “Her mother? A lover? Who is mourning her? She was a girl, Jen, even if nobody claimed her as missing. The poor don’t bother. You know that no one will really look. You know where they have gone.” She turned away from the blue incomprehension of his eyes. “But they are blaming me. Besides, she was not rich enough to afford that level of hackware.”\nHe shook his head and heaved a sigh for her to hear. She ignored it as she ran through the surveillance program, suppressing a twinge of guilt because she hadn’t yet checked on the stationary elephant cow. Everything was fine, although the main horse herd was pushing into the grazing territory of the old mare’s small, splinter herd. This was a dry year and the grass was poor. She’d have to let them get pushed off their riverside pasture. That would weaken this year’s crop of still-nursing foals, and increase the kill rate by the northern pride. If another dry spring followed, she thought, the small herd would probably end up being absorbed back into the larger group. The old mare wouldn’t survive that merger.\nThe guide reports were routine. No problems, no accidents on any of the daily motorized tours currently winding through the Preserve and only a sprained ankle from one of the self-guided backpacking treks that were in progress. The hiker had been handled by a contracted first aid skimmer and planned to continue the trek in an augmented cast, having signed a health waiver. Tahira checked the location of the various lion prides and elephant groups to make sure that the guides would provide visual contact for the guests. Four were lion treks and one was an elephant trek. But all their guides were experienced and they could find the chip signatures with their own software. They were all on target to give the paying hikers the thrill of a live sighting. Routine day. She retinaed the report, packed a few necessary items into her field bag, then left Jen to his microscope and took the skimmer out into the Preserve.\nShawn had not gotten his warrant, but then she had known he would fail.\nShe swung north, to check up on the stationary elephant before she started her chip work. It was a long flight, clear to the northwestern boundary of the Preserve, within sight of the monorail. The old cow was down after all, on her side in the shade of a thin copse of trees. She raised her head as Tahira skimmed over, ears erect, trunk curled as she got her forefeet under her, tried to heave herself to her feet. Two aunties had stayed with her and as she collapsed into the dust once more, they hurried up, stroking her with their trunks, watching Tahira warily as she landed the skimmer and approached cautiously. The dust beneath the old cow’s hindquarters had turned to mud from her urine. No sign of defecation. A blockage? Perhaps she had eaten something that damaged her gastrointestinal system. Her temperature was slightly elevated and when Tahira zoomed in with her glasses, sure enough the cow’s membranes looked pale. No sign of any external trauma. Natural causes. She selected the diagnosis, uploaded visuals to the cow’s file, and set it to alert her when vitals fell to imminent death levels. She would return to make a more complete diagnosis then. For the record.\nShe caught a glimpse of movement from the corner of her eye as she removed her glasses. Bear? Sure enough, when she slipped them back on, a green ring haloed the bushes where she had seen the movement and the ID appeared. One of the short-faced bears, another of the engineers’ triumphant recreations. They were drawn by death. One of the aunties blew noisily and rushed the bushes, trunk high. The bear retreated, growling, circled around to windward. Tahira retreated to her skimmer, although the bear was focused on the dying cow. Unlikely that the aunties would allow it to hasten the old cow’s end.\nNatural causes, she thought as she lifted to swing eastward again. You could label the girl’s death as natural causes. To the lions it had been a natural end. The monorail was curving along the white arch of track on its first run of the morning. In a few moments the tourists would surely spot the cow and the questions would start pouring into Admin from the passengers. All the tourist monorails carried a direct link to Preserve Administration. Tahira set the skimmer on auto, homing on the ID of the bison herd she needed to chip, and quickly edited out an image of the cow and her aunties from the old cow’s ID file. She selected one of her taken in the past, with her last calf, set her link to record and smiled for the tourists. Quickly, in a warm and positive tone, she explained the situation, that the cow was dying of natural causes, the aunties were attending her, and that this (insert mother and calf image here) was part of the natural cycle of life and death, that the old cow’s flesh would nourish wild dog cubs (she called up a file, inserted a recent shot of three pups playing) and the scavenger population. She uploaded the video file to Administration and texted Amy Shen, the head of PR, to expect questions about the dying cow and offer this Special Message from the Manager. Amy would run the file through her editing software to smooth out any rough edges and in a few minutes, when the worried texts came in, the tourists would have her reassuring explanation.\nMaybe she should have made one for the dead girl? Tahira kicked the skimmer to full speed, ducked down behind the wind screen as they streaked across the foothills of the mountains.\nIt took her the rest of the day to chip the bison calves and stalk a litter of wild dog pups old enough for chips. Half grown, they were skittish, full of hormones and already squabbling with the ranking alphas. But she finally got good shots, and planted a chip in a solid muscle mass. The new ID files opened and she recorded the pertinent data. Now the pups and the calves were part of the database. Their deaths would have meaning, value, would contribute to the slowly growing mass of information about this stable environment.\nWhat had the girl’s death contributed?\nA meal for the lions, she thought. At a price.\nIt was getting dark. She texted Jen that she was going to stay out and check on the lion pride before she came in. Told him to go home, activate Security when he left, she’d see him tomorrow. She knew where the pride would be, didn’t need to check her link. It was too early yet for them to head down to the river. She grounded the skimmer, ate an energy bar from her bag, drank some water, and used her link to access the Preserve database and check on the animals.\nNothing out of the ordinary. No Security alerts, nothing but the normal rhythms of day ending and night beginning. Shift change, she thought as she stuffed the wrapper into her pocket and capped her water bottle. Time. It was fully dark now, the Milky Way a white shimmer across the star spangled sky. She stared up at it. Different sky than the one over the refugee camp. Maybe it wasn’t, but it looked different. She frowned, bothered suddenly that she didn’t know if the constellations had been the same in that girlhood sky, or if memory had warped the images in her mind. It bothered her a lot. Frowning she lifted the skimmer, donned her glasses set to night-vision, and went looking for the lion pride. She flew low, skimming above the brush, weaving around the trees. Someone watching for her might think she was checking on the wildlife, scanning chips. She dipped south so that she’d meet the pride on their way down to the river.\nRed blossomed at the top of her glasses’ heads-up visual field. Perimeter violation? Tahira’s stomach clenched. Why an alert this time? She crouched behind the windscreen as she dropped lower, weaving through the tops of the trees. A map flashed into existence now, red dots marking the path of the intruder as he activated the sensors scattered across the Preserve. Tahira watched another red icon blossom on the screen map. He was heading for the place where the girl had died and the steady progress suggested that he wasn’t trying very hard to hide and certainly wasn’t using hackware.\nNo. This was just some fool who chose tonight to violate the Perimeter. An idiot. A thrill seeker. Furious she circled south to come in straight behind the intruder, slowed the skimmer to its limit, weaving through the brush now, twigs whispering against the skimmer’s flanks, clawing at her legs. She was briefly thankful for her tough, suncloth pants that resisted the thorns. She followed the trespasser’s path on her map. He should be about a hundred yards ahead, almost at the site where the girl had died.\nSomething slammed into her, an invisible fist that loosened her grasp on the skimmer’s nav bar and tossed her sideways out of the seat. The skimmer compensated as soon as her hand left the bar, shying sideways to stay underneath her, slowing and settling automatically. She clutched at the bar to take control again, but her right arm didn’t work and before she could process that, shift to her left hand, the skimmer grounded gently. For a moment, Tahira stared at the bar, then realized that her sleeve was wet, warm liquid was dripping steadily onto her pants and the dusty ground beside the skimmer. Dark. Blood. Her head spun briefly and she swallowed dry nausea.\nWhat do you think you’re going to do? She heard Shawn’s furious voice in her head. Not much. She climbed off the skimmer, her knees suddenly shaky.\n“I don’t want to kill you.” The hard, cold voice came from the tall hawthorn scrub that edged the grassy area where the skimmer had come down. “But you’re not going to get in my way. You can yell for help as soon as I’m done here.”\n“Did you bring another one to die?” Tahira faced the voice. She was still wearing her glasses, but they didn’t register an ID. No surprise. Anyone doing this would have had his ID chip removed long ago, would use temporary, fake chips. “How much do you get for these? And what do the girls think? That this is just another porn shoot, this time out in the dust? She didn’t expect the lions.”\n“What the hell are you talking about?” A figure emerged from the concealing hawthorn. Tall. Dressed in chameleon-fabric so that his silhouette was hard to make out. The projectile rifle, night-scoped, ugly, and efficient looking wasn’t hard to make out at all. Something about the voice was wrong, nagged at her, but her head was full of sticky glue and she couldn’t think of what it was.\n“I asked you a question.” The voice grated at her ears.\n“You’re the one who’s making the snuff vids, recording the girls as they run into the old lioness’s pride and die.” She would have spat the words, but that sense of wrong was building in her head.\nThe figure stepped forward suddenly and before Tahira’s gone-fuzzy reflexes could kick in, had shoved Tahira back against the skimmer, her back arched under the pressure of the trespasser’s body, her good arm bent behind her. She blinked into pale gray eyes in a hard, weathered face framed by cropped-short gray-white hair. Sucked in a breath that was half pain, half surprise.\nA woman.\n“Shawn said it might be a she.” She laughed, drunk on the pain that had begun to throb in her right shoulder and side, burning like a growing fire, radiating through her flesh.\n“Yeah, I’m a she. That was my daughter your lions ate. You folks don’t care, but I do.” Her breath blasted Tahira’s face. “They’re going to pay for that tonight.”\n“Your daughter?” Tahira blinked, trying to focus her eyes. “That’s why your hackware is so poor? You just walked in here to shoot lions? You don’t care if we catch you?”\n“I don’t care one bit.” The cold pale eyes bored into hers. “If you hadn’t decided to hang out and protect them, I wouldn’t have had to shoot you. I figured you folks trust your software instead of using your eyes. I know how tracking software works . . . It’s pretty easy to fool if you know how.” She laughed and the sound was like glass breaking. “I was a wild-meat hunter for the black market—when there was still wild meat to hunt. I know all about tracking software. Maybe the people who babble about karmic balance are right, eh?” The shattered laugh came again. “After all the animals I killed, one of them killed my daughter. But the score is going to end in my favor.”\n“You fool.” Tahira twisted her hand free, planted it against the woman’s chest and shoved. Her strength surprised both of them and the woman stumbled back a step. “You’ve ruined this night. You’ve ruined my chance to catch the one who killed your daughter and the girl he killed before her. You and your misguided revenge. He’s not going to come back, not after he realizes people were here waiting for him. Damn you.”\n“What the crap are you talking about?”\n“I’m not talking any crap.” Tahira closed her eyes. Game over, she thought. “How do you even know that your daughter was the girl who was killed here? We haven’t identified the DNA yet.”\n“I found the image on the web.” The woman’s voice grated, harsh as stone. “I was looking for her, used a video search engine, uploaded a bunch of recent pictures of her. And the engine found a match. With lions.” She spat. “One of your tourists videoed it. Her running. The lions after her.” She spat again. “And you people just stood around.”\n“No one stood around. I saw that video.” Tahira stood still as the gun muzzle lifted, fixed on her chest.\n“The media said she sneaked in. I figured she was showing off to prove something . . . because I used to run around in the African wastelands for the meat collectors. She was such a city kid.” For a moment her voice wavered. Then it went cold again. “You want to tell me your version?”\n“You didn’t look back to check the source of that image match, did you? If you want to go check it, you’ll find it’s a teaser for a very expensive, password-only, porn site. I think your daughter believed she was making a porn vid. Right until the end.” Tahira pulled out her link, watched the gun muzzle lift and steady. Touched up the video file from the Security eye, passed it over.\nThe woman took it, poised, the gun ready. Yes, Tahira thought. She had the body language of one who expected attack. She remembered that body posture all too well. The woman stepped back, out of range, looked at the link with one eye on Tahira. Then her posture stiffened and the link held her full attention.\nI could kill her now, Tahira thought. Our children are our greatest weakness. She waited, watching the sky, straining her ears to hear any whisper of a silenced skimmer. The woman must be reviewing the clip over and over again. Finally she looked up, pocketed the link. The gun muzzle had sunk to rest on the ground and she didn’t lift it.\n“What’s your stake in this?” Her voice was steady. “You came out here to put your life on the line for a damn lion?”\n“No . . . and yes.” Tahira closed her eyes again, briefly, summoning the will to push the grinding pain in her shoulder down deeper inside her. “The lioness . . . the old one, the one that killed your daughter . . . was wild caught. There are no more lions to catch. These are being changed, their genes altered to make them what we want . . . the Pleistocene American Lion. The world that the lioness came from is gone. My world. Your world, too, I think.” She pulled her lips back from her teeth. “She is innocent of murder the way your rifle is innocent of murder, even if you point it at me and pull the trigger. You and I . . . ” Her lips stretched tighter. “We are not innocent of our daughters’ murders.” She watched the gun muzzle jerk upward, tensed for one second as it wavered, drifted lower. “My elder daughter did what your daughter did.” The entire Preserve seemed to be holding its breath. Even the insects had hushed. “I knew what she was doing and pretended I did not. She had no future, there was no aid, everyone was hungry. I took the flour and oil she brought home and I did not ask where the money came from.” She did not look away from the pale oval of the woman’s face. “They made a video of her death. I got someone to find it for me eventually. To buy it. Her death was a commodity, for sale on the market. As is your daughter’s.” She waited for the gun to come up but it did not.\n“My younger daughter was six.” She said the words flatly, without inflection. “I sold her to the World Council Forces so that she would not have to do what her sister did. They call it sponsoring, but when you do that, you relinquish all rights to that child. Later, I paid a lot of money to find out where she was and when she was fourteen, I saw her. On a training mission, doing crowd control. She looked at me.” Tahira took a deep breath. “She did not know me. By then, I had been lucky, had found a job with the North American Pleistocene Preserve and my superiors found that I was . . . talented. That was many years ago. My daughter is past middle age now.” She glanced up as a tiny chime sounded from the skimmer. “That is our lioness and her pride.” She took a deep breath. “This is a delicately balanced trap.”\n“What do you want me to do?”\n“I think it’s too late.” She sighed. “He will certainly be scanning the ground for any human-sized life signatures, in case this is the trap he expects and I have brought the police.”\n“He won’t see me.” The woman laughed her broken-glass laugh. “Illegal technology is always a step ahead of legal. Your motion detectors saw me, but you wouldn’t have picked me up on your scan.”\n“He has inside help and so he might have access to our entire security network.” She shrugged. “I do not think that is likely since only I have complete access to it, but it is possible.”\n“In that case we’re screwed.” The woman shrugged, her expression unreadable in the dark. “What do I do?”\n“I want him on the ground.” Tahira closed her eyes as the world wavered. “He thinks I’m a witness and he needs to make sure I’m dead. I have a first aid kit behind the seat.” Cold sweat bathed her face, prickling under her arms. “It has a touch menu. Select stimulant, human, emergency, and get two patches.” She struggled to hang onto consciousness, eyes closed, nausea wringing her stomach. The woman brushed against her, fumbling behind the seat. A moment later cool fingers seized her wrist, pushed her sleeve up and Tahira felt the sting of the stim patch on the inside of her elbow.\n“That’s going to make you bleed more.”\n“I know.” Tahira straightened as energy washed through her, banishing the nausea, brightening the shadows. “Can’t be helped.” She touched the first aid menu, selected one small and one medium blood-stop patch. “Help me with the shirt.” She winced as the woman opened the front, pulled the fabric down over her shoulder and arm. “Cover the entire wound, use the small one on the entry . . . ”\n“I know how to use a patch.”\nTahira sighed as the woman smoothed the patches over the ruin of the entry and exit wounds. The fast-acting local quickly numbed the grinding pain, reduced it to a low-level throb that she could shut out for now.\n“You guys carry a hospital on these things.”\n“We permit a few extreme hikers.” Tahira drew a slow breath, let it out, judging the strength of the remaining pain. “We are preoccupied with death.” She bared her teeth at the woman. “You sold vids of your kills along with your illegal meat, didn’t you?”\nThe woman didn’t answer, but of course, she did. Tahira straightened. That was the lure of what would otherwise be no different from a farm or vat raised steak. If you couldn’t pull the trigger yourself, you could still watch it die. “You hide,” she said. “I’m going to move the skimmer ahead of the pride, ground it again. He’s going to come down and look for me.”\n“He’s going to drop a grenade on you and leave.” The woman sounded contemptuous.\n“Oh no.” Tahira grinned. “Like you, I’m wearing a chameleon field. And I also have a small device that a clever grad student hacked up—it generates the thermal effect of a 150-pound antelope. He was studying night hunting, trying to determine the importance of scent, thermal detection, sound, and sight in predator species. Our killer should think it’s me.” She shrugged. “He has been very careful not to leave any traces. I suspect that if I did not patrol as regularly as I do, we would never have known that anyone was killed here.” Another few hours, and only the scrap of fabric would have marked that kill site. “One of us needs to kill him.” She lifted her hand. “I would prefer that the lions do it.”\n“How do you know they can?”\nTahira shrugged her good shoulder. “I will make it possible. If they do not, you or I will do it.” She pulled the highly illegal gun from her waistband, was impressed that the woman didn’t flinch.\n“You could have shot me. While I was looking at the vid.” For a moment, she was silent. “I like you.” Her teeth flashed briefly. “You would have made a good meat hunter.”\n“I think not.” Tahira stretched her lips back from her teeth. “But I am not sure we are so different. You know to stay downwind from the pride? They’re hunting.”\n“I know.”\n“I need my link.” Tahira held out her hand. The woman glanced at it, shrugged, handed it over. Tahira nodded and climbed onto the skimmer, hoping he showed before the stim patch ran out. She wasn’t sure she could tolerate a second dose. At least the bleeding seemed to have stopped. Lifting, she drifted ahead of the pride, watching her enviro-panel, reading wind, calculating distance and scent drift. Set the skimmer gently down, half hidden by hawthorn scrub. Just hidden enough, she hoped, to make him think that he might have missed her last time, when he dropped the girl. The meat-hunter’s daughter.\nGlancing at her watch, she planted the thick disk of the bio-signature generator in a clump of hawthorn, and hiked downwind, zooming in on the spot with her glasses. She had keyed the link to the lioness’s ID, figured she had about fifteen minutes before she’d need to return and move the skimmer. The lions knew her scent, so hopefully her presence wouldn’t disturb their regular hunting routine.\nFive minutes left. She started to get to her feet to relieve her thigh muscles, when she caught the faintest whisper of disturbed air, like the wings of an owl. She froze, eyes fixed on the landscape beyond the grounded skimmer. A vague shape of matte black blocked her view of grass and shrubs. A military shadow field, of course.\nShe didn’t see him get out of the shadowed skimmer, but of course, he would also be using a chameleon field. Sure enough, a clump of sun dried grass winked out for a moment, then reappeared. He knew where she was—or where he thought she was. He was being cautious.\nShe had not prayed to any gods for a long time. Not since she had handed over her young daughter to the World Council Force sponsorship coordinator. Gods were like lions, they belonged to the old world. But now she bent her head, prayed that those old, dying gods would gather wind, scent, instinct, and make one thing right in the old way.\nHe did not fear the lions. She could see it in his preoccupied focus on the clump of brush where she had hidden the generator. They were just park amusements, useful as a movie prop, able to kill a helpless and unarmed girl. Not a threat to him. He had a gun, after all. She bared her teeth at his hubris. It would please the old gods.\nThe lioness charged in a rush of motion where no motion had existed. The man spun, hand coming up. Light flared and the lioness tumbled, regained her feet in an instant and with a leap, her front feet hit his shoulders, knocking him flat, her claws digging in to hold him. He had time for a choked cry before her jaws closed on his throat. A second lioness charged in, taking him by the thigh. Dust rose, white in her night-vision, as he thrashed, strangling slowly. The lion grunts and chesty growls were the only sound. The other members of the pride had circled in, tearing his belly open before he had quite died.\nTahira started as something moved beside her. The meat hunter squatted silently next to her, her posture intent, not speaking. A loop of intestine gleamed wetly. He had stopped struggling, had finally died. The lioness who had taken him stood up, bit at his dead shoulder and shook her head heavily. She walked a few steps away from the feeding pride, snarled as one of the males took a step toward her, lashed out at him. Her strike was weak, wobbly, and her hindquarters swayed as she staggered away from the others.\n“She’s dying,” Tahira said softly. “He shot her.” Her eyes widened as she noticed the faint striping on the lioness’s shoulders. This was not the old one. This was one of the younger animals, the ones that were beginning to resemble their Pleistocene ancestors. She pointed her link at it. Yes, this was the oldest of the younger females, the one who had been pushing the old lioness of late. As she watched the pride feeding, she spotted the old lioness, noticed that she was limping. Not much, but it had been enough to let the beta lioness take over.\nPerhaps the old mare had kicked her, when the pride had taken her foal. Tahira let her breath out slowly, pain beginning to seep through the stim’s numbness. Maybe that limp would heal and the lioness would keep her rank now, maybe not. The next female in rank was timid, not likely to challenge her soon.\nShe might keep her leadership.\nFor a time.\nTahira got to her feet, feeling shaky to her bones. “You should leave now. Take his skimmer. It got him through the boundary, it will take you out. Sell it quickly. Just in case. I will erase your entry from Security.”\nThe meat hunter faced her, her expression enigmatic, the years, the past, graven into her weathered face. “What about you?”\n“I have some things to fix yet.” She met the woman’s eyes. They reminded her of African sky, blue, dry, and empty. “Your part is over.”\nFor a moment the woman didn’t move. Then she lifted a finger to her forehead in a salute, turned and strode through the brush to the man’s skimmer. A moment later it lifted and vanished.\nThe pride had settled down to a serious feeding now and already the scavengers had begun to gather. One of the wild dogs darted in to snatch a scrap, then fled, butt tucked as a young male charged. She could come back in a couple of days, pick up any last evidence. Record the young lioness’s death as an official euthanasia.\nShe limped to the skimmer, washed by waves of weakness, hoping she wouldn’t fall off before she got back to Administration.\nA red icon winked on the control panel. A Security alert. Muttering a curse because she would have thought the meat hunter was more careful than that, Tahira touched it.\nOfficial intrusion with legal permission, contact estimate five minutes.\nTahira leaned against the skimmer and closed her eyes. Legal permission. He got his warrant after all? She waited for the whisper of the grounding skimmer.\n“Tahira.” Shawn’s voice sounded harsh. “What the hell is going on? You’ve got lions right behind you. Eating something.”\nHe was afraid. Her lips twitched and she almost smiled. “They’re busy. They won’t bother us. I think I need a ride.” She forced her eyes open. “I’m not sure I can get the skimmer back on my own. Did you come to arrest me?”\n“Damn right.” He appeared beside her, watching the lions. “Hospital first, I think.”\n“That’s probably a good idea.” She forced herself straight, looked him in the face. “Did you access that link? Buy the video?”\n“Yes.” He looked briefly away.\n“The man who dropped them here . . . ” She pointed with her chin toward the lions. Mistake. The world began to turn slowly.\n“You’re sure?”\nShe couldn’t read his expression. “Yes. Take this.” She handed him the stunner from the skimmer. “I don’t think the lions will bother me, but if one does, this will stop it.” She walked away before he could react, circled around to reach the dead lioness, one eye on the feeding lions. They knew she was there, paid as little attention as they gave the coy-dogs that had gathered. She took the tissue sample quickly, dropped it into a collection bag and returned with the last ounce of her strength.\nShe was done. She let him take over, gave in and let the slowly turning landscape speed up until it swept her away. Was aware of jostling, a sense of speed, a low muttered monologue of cursing. Faded in and out of lights and bustle and the dim distant knowledge in the back of her brain that this must be the resort medical facility. Someone was arguing loudly, right over her. It hurt her head and she retreated into darkness.\nWhen she opened her eyes it was light, daylight bright, and her mouth felt like a Preserve riverbed in a drought.\n“They want you to drink this.” Shawn leaned into view, holding a plastic squeeze-bag of yellow-green liquid with a drinking tube.\nShe sucked at the liquid, winced, and swallowed. There was no way to make electrolytes taste good.\n“The bullet did a lot of soft tissue damage but missed anything important,” he said mildly. “Made a big hole though. They left some drains in.”\nShe peered at the bandages swathing her left arm. It didn’t hurt, but that would probably change when the meds wore off. “Can I leave?”\n“I think they’ll let you go if you sign all kinds of waivers absolving them from blame.”\n“And do we go to jail from here?”\nHis eyes narrowed slightly. “That depends. We can talk about it.”\nHe was right about waivers. She signed and retinaed a half-dozen absolutions of all liability but finally they carted her to the entry in a motorized chair and let her escape. Shawn offered her his arm and she leaned on it. Harder than she thought she would need to. He was driving a small, rather scuffed up electric. His private car? “You’re not on duty?” She realized he was wearing a casual sun shirt and khakis. “Your day off?”\n“My day off.” He slid into the driver’s seat, touched on the air-conditioning and sat there as the hot interior air cooled. “Want to tell me?”\n“And if I don’t?”\nHe shrugged. Turned those dry, blue eyes on her. “I guess I could still arrest you on suspicion of being an accessory to a murder.”\n“I am that.” And she told him, leaning back against the still-warm plastic of the seat as the car hummed to life and Shawn drove her back to the Preserve. She told him the whole story from her comments on the tour bus, to her ambush by the meat hunter and the arrival of the vid maker.\nHe didn’t say a word.\nShe finished as they entered the ornate gates of the Preserve and she closed her eyes, exhausted by the telling, her shoulder starting to hurt now with a muffled throb that promised worse to come.\n“A meat hunter.” Shawn parked in the afternoon shade cast by the building’s solar panels. “I’m surprised you don’t want me to go after her.”\n“Why?” Tahira opened one eye. “Her world is as dead as mine is. There is no wild meat to hunt any more. Not the kind that made her a living.”\n“She could come back to poach.”\n“She won’t.”\n“You are so sure.”\n“I am.”\nShawn sighed. “So you’ve achieved your justice. The lions killed the man the same way they killed the girl. And now you want me to just walk away and call it over. Do you think that ends it, Tahira?”\nThe bitterness in his voice surprised her. “Of course that doesn’t end it.” She opened her eyes, faced him. “He was not the boss. He was simply a tool. It’s way too big a business. I doubt it will ever end, Shawn.” She opened the electric’s door one-handed, amazed at how heavy it was. “Our species is addicted to death. And now, on the brink of conquering it, we love it even more.” She pulled herself to her feet as he came around to help her and amazingly managed not to sway. “But this ends it here.”\n“Are you sure of that, too?”\n“Yes.” She looked him in the face. “I am.”\nHe lifted his eyes, fixed them on the dry blue sky above. “Even if you die?”\n“If I die, the information to end it here will come to you.” She started for the entrance, judging the distance. Maybe too far. When he caught up to her, took her arm, she let him, leaned on him. He was angry, radiating like a range fire.\n“I guess I’d just like to know who made you judge and jury.”\nThe door scanned her hardware and opened, breathing cool air over them. The water-wall filled the building with the scent of rain and she took a deep breath, happy in this single moment of sensation. “I appointed myself.” She sank onto one of the floor cushions. “There is beer in the refrigerator. Why don’t you bring us each one? Since you are not on duty?”\nHe did, handed her the tall glass, sat down across from her, his expression thoughtful. He was older than Jen, his face lined with his years of work. She studied the lines around his eyes, seeing the echoes of old laughter, of sorrow, of life.\n“What does this Preserve mean to you?” He looked up suddenly.\nShe took a sip of her beer, relishing the cool, slightly bitter taste, the dewy chill of the glass against her lips. Life, she thought, is made up of moments. We simply fail to notice most of them. “I have asked myself that question for a long time.” She studied the tiny, silver bubbles rising through the amber liquid. “I’m a lot older than you, Shawn. I’m a product of world that is now dead.”\n“Africa,” he murmured.\n“Africa is a continent.” She lifted her glass in his direction. “Lesotho. Once upon a time, long before you were born, my people raised and reintroduced lions to the dying plains. We had killed them all and now, many generations later, we brought them back. Only we didn’t know the plains were dying, but they were. We, the Lesotho people, succeeded. For a while.” She lifted one shoulder in a half-shrug. “But the plains died, then the lions died, and ultimately . . . ” She drank more beer. “Lesotho died. Here . . . I found a trace of that dead world.”\n“The lions?” Shawn leaned forward and touched her hand lightly.\n“Them, too.” She tilted her head to study him, aware that she was getting drunk. “But it is not the world I knew. We did not care enough about that world to bring it back. Why not, Shawn?”\n“No tourist value,” he said softly.\n“This world the engineers are creating is so old that it is new.” She tried to smile, but it felt crooked. “The merely old has no value. Still . . . there are lions.” She took another swallow of her beer. “And this is a refuge. From memory, if nothing else.”\nThe entry chimed. “Hey, Tahira, you’re back.” Jen breezed through, bringing in the scent of dust and afternoon heat. “Hi, have we met?” He offered a hand to Shawn as he rose from the cushion. “I’m Jen, a grad student. I study bugs.”\n“Hi, Jen. I was just leaving.” Shawn got to his feet, hesitated, then leaned down. “To memories.” He touched his glass to hers.\nShe hesitated for a moment, met his eyes. Found . . . compassion there.\nJen looked from one to the other, puzzled, as they emptied their glasses. Shawn took them to the kitchen wall, lifted a hand to her, then left, the door whispering shut behind him.\n“What was that all about?” He set his field pack against the wall.\n“He was deciding whether or not to arrest me.” Tahira watched Jen fill a glass of water. “I’d like some water, too, please.”\n“What’s with the arrest thing?” He turned, smiling, a full glass in each hand. “And what happened to your arm? Did you have an accident with the skimmer?”\n“Yes. I did.” She took the glass. “Sit down, Jen.”\nHe sat, the first tickle of alarm tightening the skin of his eyes before he quickly banished it with a smooth, careful smile.\n“I have done a number of things in my long life.” Tahira sipped her water. “One was computer security. I was very good. The systems these days are more advanced, but not excessively so.”\n“How interesting.”\nHe was doing the facial expression well, but his body betrayed him, tension lifting his shoulders, straightening the curve of his spine. “Yes,” she said. “So I was able to trace your alterations to the security platform.” She raised her hand to silence him as he opened his mouth. “And I was also able to document the source of the Security breach and ID you. It’s documented, Jen. Archived in hard media to be released to the authorities either on my say-so, or upon my death.”\n“I . . . I didn’t know . . . anyone was going to get killed.” His face had gone white and in an instant, the planes and angles of maturity had softened to the rounded face of a child. “It . . . I was horrified. I didn’t know . . . but they’d . . . I didn’t dare say . . . I couldn’t tell . . . ”\nWas I ever a child like this? she wondered. She tried to remember. Didn’t think so. Her older daughter had never been a child either. Not really. What about her younger daughter? Had they allowed her to be a child before she became a soldier? She hoped so. With all her heart. That was what I bought for you, she thought. Sighed. “You already knew that girl was dead when I first told you we’d had an intruder. Relax, Jen.” She lifted her hand to silence him. “You are a pawn in this game. You will do one thing for me and then you are free to keep studying your bugs . . . Although I suggest that you look into a transfer to another research program as quickly as you can engineer it.” She studied his bowed head and hunched shoulders. “If something does happen to me, you will certainly be a suspect, so it might be unsafe for you to remain here.”\n“What do you want me to do?” he mumbled.\n“You will run the DNA analysis on the bones that we found. I will give you a sample of lion DNA and you will make sure that you find that DNA associated with the dead girl. It may be there already. If it is not you will find it.”\n“That’s all?” He raised his head, the fearful hope in his eyes painful to look at.\n“That’s all.” You would not have survived in my world, she thought.\n“I . . . I already put in a grant proposal.” He looked away, swallowed. “I’d be doing it at the Antarctic preserve, looking at the symbiotic bacteria that still exist near the pole.”\nAh, guilt. It would get him out of her sight quickly, at least. “Good.” She nodded. “Here.” She fumbled the collection bag from her coveralls. Handed it to him. The bit of flesh had turned brown and ugly. “This is your DNA.”\nHe took it and fled. She suspected she wouldn’t see him before he left—not if he could avoid it. Which suited her just fine.\nThe beer had given her energy, or maybe it had been the compassion in Shawn’s eyes. She had not expected . . . understanding. But now, exhaustion was creeping through her. She opened her holo field and set it to secure, in case Jen was brave enough to return. She opened the camera control and set it to face view only. Her boss would not see her bandages.\nCarlo answered quickly, seated in his teak and real-leather desk-recliner. “Did you get my messages?” He looked angry, his jet hair, usually immaculate, slightly mussed as if he had run his hand through it. “What is all this in the media? Tourists claiming that you were a witness to that intruder’s death?”\n“I have already informed the authorities that it was a mistake.” She gave him a smooth smile. “The small brush-fire of blogging will fade quickly.”\n“This is the last thing we need, Tahira.” He scowled at her. “Such carelessness is unlike you. You know better than to do anything that will incite negative public attention. What were you thinking?”\n“I needed to make myself bait,” she said simply. “That was the surest and fastest method.”\nHe was far more mature than Jen and his face betrayed nothing, not even the tic of an eyelid gave him away. Almost, she could believe . . . “Our security is very very cutting edge. I sent you the inserted visuals that replaced the images of the girl’s dying. Perhaps Jen was in a hurry.” She shrugged. “But he had neither the access nor the expertise to allow an intruder to come and go through the Security shield without triggering any alarm or record. The intruder had a password.”\n“How could someone have that?”\nShe had almost believed that she had made a mistake, but his tone betrayed him. He was asking a rhetorical question. “Only two people have a password, Carlo. You and I. There is no real anonymity in the net. Not for a long time now.” She smiled at him, pleasantly. “I do not believe you are one of the major players here. If I did . . . ” She bared her teeth at him. “I would not be talking to you. I think you merely . . . got a percentage. Rental. And perhaps a copy of the video? Does that excite you? A real and violent death, with real fear, and real blood?”\nHe flinched then, and her stomach twisted.\n“That was how they came to ask you, wasn’t it? You are a customer.” She kept the disgust out of her voice, because it was not yet time to end this conversation. “I have archived a file of all my suspicions and all the evidence I have uncovered to support them. It is not sufficient to convict you. But it is sufficient to let those with greater investigative skills than I have find out the truth. Then they will convict you. On the day of my death, the archive goes to the appropriate World Council committee members.”\n“Blackmail?” His lip curled. “Is that so much better than what I did?”\n“It’s not blackmail.” She shrugged. “It is simply an insurance policy. To make sure that this does not happen again here.”\nHe didn’t believe her.\n“I am finishing up the DNA scan of the dead girl. I have already euthanized the lioness that attacked her. You may release that information to the media and the public. You may make whatever statement about blogger inaccuracies you choose and that will, as I said, fade away. If anything”—her lip curled—“it will increase traffic to the Preserve. As you know, violent death is a potent pheromone.”\nHis reaction was more visible this time.\nShe ended the link. Rudely.\nShe was entitled to be rude.\n“He is too well protected.” She was speaking to Shawn’s absence, heard her own defensive tone. “He is insulated by too much money and too many connections. He would emerge from the ashes of an investigation and nothing would change.” She closed down her field, got to her feet, feeling age in her flesh. How much longer did she have? “Perhaps I am too much a product of my old world. To me, justice is direct—an eye for an eye. The justice of the old gods. Of the lions.”\nShe had bought the old lioness a second chance. It might not buy her much time at all, or she might get another season before she was ousted by one of the younger, striped, new females that made the gene engineers so happy. She had a tour scheduled tomorrow. The note on the green calendar field on the wall was flashing its reminder. She stretched her shoulder, testing the limits of the pain. If she slept well, she could do it, perhaps with less energy. There would be questions. She would have to decide on the answers before then, would this time do Shawn the courtesy of telling him what her answers would be.\nAnd soon it would be nothing more than an ephemera floating in webspace, evoked from time to time like a fading ghost, through some odd search connection that summoned up a stale blog entry. The world was full of ghosts.\nInstead of going to her bed, she slipped outside and found her skimmer parked in its usual place. Someone had cleaned the blood from it. She found her spare glasses in the tool compartment, slipped them on and lifted into the darkness. The lions would be hunting and she might catch the pride on their way down to the river. The pain in her shoulder faded as she toed the skimmer up to speed and slid through the bright bubble of a yesterday that had never really happened.\nOriginally published in Asimov’s Science Fiction, January 2009.\nMary Rosenblum attended the prestigious Clarion West Writers workshop in 1988, where she sold her first SF story to Asimov's Magazine editor Gardner Dozois and her writing career took off. She published multiple novels with NY publishers as Mary Rosenblum in SF and Mary Freeman in mystery, was a Hugo and Nebula finalist, won the Sideways and Compton Cook awards, and received a lot of critical acclaim for her fiction, both short stories and novels. She began teaching writing more than fifteen years and also works one-on- one with novice writers as a \"literary midwife\" taking authors through drafts, final editing, publisher-matching, and self promotion of their books, to make sure it gets done right. She has twice returned to teach the Clarion West Writers workshop and lives in rural western Oregon where she is a licensed pilot and flies a small plane to as many cool and faraway places as she can.", "source": "https://clarkesworldmagazine.com/rosenblum_07_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Lion Walk by Mary Rosenblum"}