{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/b3UNnRKeSR4zZeksLCr+IJCd30=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  About the Story by Isabel Fall  Yesterday, I removed the story “I Sexually Identify as an Attack Helicopter” by Isabel Fall from the current issue of Clarkesworld Magazine. The recent barrage of attacks on Isabel have taken a toll and I ask that even if you disagree with the decision, that you respect it. This is not censorship. She needed this to be done for her own personal safety and health. It does not rule out the possibility that the story will be restored (changed or unchanged) at some future point, but that’s not our priority right now.  I sincerely regret that the timing of my surgery contributed to this situation. I’ve been offline for much of the internet storm, most of which occurred on Twitter. I feel terrible that I wasn’t there to help mitigate the attacks that have ultimately hurt Isabel and allowed this situation to escalate.  I’d like to start by addressing some of the misinformation that I’ve seen:  \r\n  This was not a hoax. Isabel honestly and very personally wanted to take away some of the power of that very hurtful meme. The story had been through multiple revisions over many months and it had been seen by sensitivity readers, including trans people.  Isabel’s bio is intentionally short and internet presence negligible. I understand that to be a common practice for trans people who are wary of attacks from anti-trans campaigners. Unfortunately, the same shield used against them opened her up to an unexpected attack from others. Furthermore, Isabel was not out as trans when this story was published. Various claims being made against her pressured Isabel into publicly outing herself as a defense against the attacks. That should never be the case and is very disturbing to me.  Isabel was born in 1988. That does not make one a neo-Nazi. I’m honestly surprised and disappointed that I have to say that.  The comments posted by someone representing Isabel were at her request. I would have done so myself if I had been able.  Many of the initial comments on the story were posted by regular readers with names or email addresses I recognized. Privately, there were many similar responses in email from a diverse group of readers, authors, and agents. While there are some that went unrecognized, in context, we had no reason to suspect anyone was trolling us. That doesn’t mean there weren’t any, but they did not shift the tone of the comments or reach significant numbers by that point in the conversation.  Peter Watts’ comment was not someone masquerading as him.  The story was neither award bait (in January?!) nor clickbait. Both are unpleasant practices and we have no tolerance for either. I can at least see how the latter might have been assumed by the title, but it was not the intention.  We don’t restrict ourselves to publishing “name” authors. There was even another new author in that issue.  I was not hiding. I was recovering from surgery and still am.  Some hopefully obvious things that need to be said to provide context:  \r\n  There is no one true transgender experience. It’s a diverse path and what works for some trans people may not work for others. How wide that path is perceived can vary by person. (I’d say this is a common trait across all communities.)  There’s a long history of marginalized communities attempting to subvert their oppressors by reclaiming slang, nicknames, and labels.  Stories that involve sensitive subjects can be risky. We don’t want to shy away from that. To do so would be equivalent to ignoring the existence of that the people that they represent. Suggesting that these stories shouldn’t appear in broader SF publications denies their place in the wider community and limits their audience. That is not to say the choice to go narrow isn’t a valid course. It’s the author’s choice when and where they want their story to be heard.  Twitter can be dangerous. Discussions there tend to lack nuance, and it is very easy to amplify negative accusations. This leads to a cycle of anger and retaliation that can quickly shut down effective discussion. We can’t control what happens there, but we can hopefully learn how to better avoid setting off such storms, and to respond better to them if and when they happen.  And perhaps most importantly, positive interpretations do not invalidate negative ones. Negative interpretations do not invalidate positive ones. We don’t control how a story makes us feel and liking or not liking one are both valid responses. Regardless of which side they stood on, many were attacked for their position on this work. It still continues even in the story’s absence.  What have we learned?  \r\n  Even with ownvoices authorship and ownvoices sensitivity reading, it is still possible to miss something. In this case we can see two groups of trans readers with directly opposing views that are deeply rooted in their own experience and perspectives. In some cases, what made the story speak to some is also what alienated others. Neither perspective is wrong, but they appear to be incompatible with one another on some level. Knowing that this was a potentially controversial story, we should have employed a broader range of sensitivity readers. This is not to say those we worked with failed, but rather that they only represented a slice of the community and additional perspectives could have helped inform us of a potential conflict. It may not have “fixed” things but it would have provided opportunities to better prepare ourselves and our readers for what lay ahead. This was an oversight.  In some cases, information contained in the bio is critical to gaining the trust of a reader. I would never have pressured Isabel to out herself as trans in her bio, but it’s clear, given the way that information shifted the discussion, that would have helped some readers be a bit more trusting of Isabel, the venue, the story, and what she was hoping to accomplish with it. Should the work ever be restored, additional information will be included along with the story to help properly warn and inform the reader about potential issues. In the future, we will also provide the bio to our sensitivity readers.  That we didn’t understand enough about trans politics to properly advise a new author who was wading into the deep end. I’m not suggesting that we tell an author what they can and can’t say, but had the previous two items be done correctly, we would have been in a better place to prepare her. Because of those failures, our knowledge gap contributed to the problem.  Going forward, we will bear these lessons in mind, and hopefully we will become better at fulfilling our responsibilities to our authors, and to our readers.  In the meantime I offer my sincere apologies to those who were hurt by the story or the ensuing storms. While our lives have likely been quite different, I do understand what it is like to be bullied and harassed for an extended period of time. I can empathize, even if I can’t fully understand life in your shoes.  I have also privately apologized to Isabel. She has chosen to sign over her payment for this story to Trans Lifeline, “a non-profit organization offering direct emotional and financial support to trans people in crisis—for the trans community, by the trans community.” They have been a vital resource for her and inspired by her actions, I have decided to match the gift.  Through the course of these events, I’ve encountered many deeply personal stories from readers and authors. I’d like to thank those people for sharing and providing many of us with further opportunities to learn from their experiences. Aside from getting to know Isabel, that has been the high point of this experience. I wish you all the best and appreciate you taking the time to share.  A thank you also goes to the people who emailed me throughout all of this. Over the last two days, I’ve read just about all of it and I apologize for not responding individually. Even though each day of my recovery is better, finishing this announcement has required multiple sittings. I know many of you are concerned for Isabel and I have shared that sentiment. I am too.  Take care,  Neil Clarke Editor, Clarkesworld Magazine Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nAbout the Story by Isabel Fall\nYesterday, I removed the story “I Sexually Identify as an Attack Helicopter” by Isabel Fall from the current issue of Clarkesworld Magazine. The recent barrage of attacks on Isabel have taken a toll and I ask that even if you disagree with the decision, that you respect it. This is not censorship. She needed this to be done for her own personal safety and health. It does not rule out the possibility that the story will be restored (changed or unchanged) at some future point, but that’s not our priority right now.\nI sincerely regret that the timing of my surgery contributed to this situation. I’ve been offline for much of the internet storm, most of which occurred on Twitter. I feel terrible that I wasn’t there to help mitigate the attacks that have ultimately hurt Isabel and allowed this situation to escalate.\nI’d like to start by addressing some of the misinformation that I’ve seen:\n- This was not a hoax. Isabel honestly and very personally wanted to take away some of the power of that very hurtful meme. The story had been through multiple revisions over many months and it had been seen by sensitivity readers, including trans people.\n- Isabel’s bio is intentionally short and internet presence negligible. I understand that to be a common practice for trans people who are wary of attacks from anti-trans campaigners. Unfortunately, the same shield used against them opened her up to an unexpected attack from others. Furthermore, Isabel was not out as trans when this story was published. Various claims being made against her pressured Isabel into publicly outing herself as a defense against the attacks. That should never be the case and is very disturbing to me.\n- Isabel was born in 1988. That does not make one a neo-Nazi. I’m honestly surprised and disappointed that I have to say that.\n- The comments posted by someone representing Isabel were at her request. I would have done so myself if I had been able.\n- Many of the initial comments on the story were posted by regular readers with names or email addresses I recognized. Privately, there were many similar responses in email from a diverse group of readers, authors, and agents. While there are some that went unrecognized, in context, we had no reason to suspect anyone was trolling us. That doesn’t mean there weren’t any, but they did not shift the tone of the comments or reach significant numbers by that point in the conversation.\n- Peter Watts’ comment was not someone masquerading as him.\n- The story was neither award bait (in January?!) nor clickbait. Both are unpleasant practices and we have no tolerance for either. I can at least see how the latter might have been assumed by the title, but it was not the intention.\n- We don’t restrict ourselves to publishing “name” authors. There was even another new author in that issue.\n- I was not hiding. I was recovering from surgery and still am.\nSome hopefully obvious things that need to be said to provide context:\n- There is no one true transgender experience. It’s a diverse path and what works for some trans people may not work for others. How wide that path is perceived can vary by person. (I’d say this is a common trait across all communities.)\n- There’s a long history of marginalized communities attempting to subvert their oppressors by reclaiming slang, nicknames, and labels.\n- Stories that involve sensitive subjects can be risky. We don’t want to shy away from that. To do so would be equivalent to ignoring the existence of that the people that they represent. Suggesting that these stories shouldn’t appear in broader SF publications denies their place in the wider community and limits their audience. That is not to say the choice to go narrow isn’t a valid course. It’s the author’s choice when and where they want their story to be heard.\n- Twitter can be dangerous. Discussions there tend to lack nuance, and it is very easy to amplify negative accusations. This leads to a cycle of anger and retaliation that can quickly shut down effective discussion. We can’t control what happens there, but we can hopefully learn how to better avoid setting off such storms, and to respond better to them if and when they happen.\n- And perhaps most importantly, positive interpretations do not invalidate negative ones. Negative interpretations do not invalidate positive ones. We don’t control how a story makes us feel and liking or not liking one are both valid responses. Regardless of which side they stood on, many were attacked for their position on this work. It still continues even in the story’s absence.\nWhat have we learned?\n- Even with ownvoices authorship and ownvoices sensitivity reading, it is still possible to miss something. In this case we can see two groups of trans readers with directly opposing views that are deeply rooted in their own experience and perspectives. In some cases, what made the story speak to some is also what alienated others. Neither perspective is wrong, but they appear to be incompatible with one another on some level. Knowing that this was a potentially controversial story, we should have employed a broader range of sensitivity readers. This is not to say those we worked with failed, but rather that they only represented a slice of the community and additional perspectives could have helped inform us of a potential conflict. It may not have “fixed” things but it would have provided opportunities to better prepare ourselves and our readers for what lay ahead. This was an oversight.\n- In some cases, information contained in the bio is critical to gaining the trust of a reader. I would never have pressured Isabel to out herself as trans in her bio, but it’s clear, given the way that information shifted the discussion, that would have helped some readers be a bit more trusting of Isabel, the venue, the story, and what she was hoping to accomplish with it. Should the work ever be restored, additional information will be included along with the story to help properly warn and inform the reader about potential issues. In the future, we will also provide the bio to our sensitivity readers.\n- That we didn’t understand enough about trans politics to properly advise a new author who was wading into the deep end. I’m not suggesting that we tell an author what they can and can’t say, but had the previous two items be done correctly, we would have been in a better place to prepare her. Because of those failures, our knowledge gap contributed to the problem.\nGoing forward, we will bear these lessons in mind, and hopefully we will become better at fulfilling our responsibilities to our authors, and to our readers.\nIn the meantime I offer my sincere apologies to those who were hurt by the story or the ensuing storms. While our lives have likely been quite different, I do understand what it is like to be bullied and harassed for an extended period of time. I can empathize, even if I can’t fully understand life in your shoes.\nI have also privately apologized to Isabel. She has chosen to sign over her payment for this story to Trans Lifeline, “a non-profit organization offering direct emotional and financial support to trans people in crisis—for the trans community, by the trans community.” They have been a vital resource for her and inspired by her actions, I have decided to match the gift.\nThrough the course of these events, I’ve encountered many deeply personal stories from readers and authors. I’d like to thank those people for sharing and providing many of us with further opportunities to learn from their experiences. Aside from getting to know Isabel, that has been the high point of this experience. I wish you all the best and appreciate you taking the time to share.\nA thank you also goes to the people who emailed me throughout all of this. Over the last two days, I’ve read just about all of it and I apologize for not responding individually. Even though each day of my recovery is better, finishing this announcement has required multiple sittings. I know many of you are concerned for Isabel and I have shared that sentiment. I am too.\nTake care,\nNeil Clarke\nEditor, Clarkesworld Magazine\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/fall_01_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Story by Isabel Fall"}