{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "13uMzmB2wlBu2tqcoZqdNnQ9DZU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Joy of Helping  Recently, Tor Books published Invisible Planets, the first English-language anthology of contemporary Chinese SF (by “contemporary,” I mean roughly something like “written during the 21st century”). I was both the anthology’s editor and translator.  As I started to do publicity for the book, one question came up again and again: What motivated me to do translations in the first place?  I’ve given various answers to this question over the years: diversifying my own writing career, contributing to the variety of voices in English-language SF, practicing a different set of skills related to writing but aren’t writing (translation, after all, is a performance art), and so on.  But the answers all feel slightly unsatisfying.  I got started in translation almost purely by accident. My friend, Chen Qiufan, an amazing writer who began publishing tales of dazzling technical brilliance and profound social insight in college, had one of his stories translated into English and asked me to take a look. I read the translation and found it competent, but I also thought it failed to capture his voice, perhaps the most important quality in a translation. I offered to redo the translation from scratch and to submit the English version to various markets on his behalf.  At that moment, I wasn’t thinking about how doing a translation would teach me a new skill; I wasn’t thinking about the ethical duties owed an author by a translator; I wasn’t thinking about how my small decision would play into the larger conversation about diversity in SF; I wasn’t thinking about the opportunity costs of doing translation instead of my original work; I wasn’t thinking about the publicity benefits of attaching my name to another piece of text by a different author; I wasn’t thinking about favors bestowed or owed; I wasn’t thinking about how this affected my career goals, long-term or short-term.  I just wanted to help a friend reach more readers. That, in the end, is the only motivation that really mattered, that really brought me joy.  That story, “The Fish of Lijiang,” ended up as the first translation bought by Clarkesworld. And from that accidental beginning, I’ve built up a sizable body of work as a translator and editor alongside my existing career as a short fiction writer and novelist.  Now, to be sure, I was inspired in my initial decision by what Qiufan had done for me. He had, after all, reached out to me several years earlier and connected me with my Chinese publishers. That was how we got to know each other, read each other’s stories, and became friends. But I didn’t think of it as repaying a debt. We did not keep a running tally of favors we had done for each other. Such a thing would have felt out of character for both of us, alien.  The truth is: It feels good to help people. Even today, much of my motivation in editing and translating stories from China is still tied up with this satisfaction of helping writers reach readers. Surely I would have written more original works and made more money without these translations—but I think I wouldn’t have been as happy.  And we don’t acknowledge and celebrate the joy of helping enough.  It’s also important to acknowledge that we like to be helped. I have been helped countless times in my career by friends, editors, readers, fellow authors—even Invisible Planets wouldn’t have been possible without the help of all the authors and many others along the way. All of us have probably had experiences where a friend’s insightful comments improved our stories while the friend remained unacknowledged, or a reprint sales opportunity came up because someone recommended our story without us ever finding out who it was, or we got onto a panel because someone more famous and accomplished thought it helpful to boost our voices. The sun feels brighter on those days, and even the writing seems to come out of the word-mines more easily.  It’s nice to be able to make someone feel that, isn’t it?  As freelancers in the uncertain publishing industry, writers are bombarded with advice on how to develop our careers and to think strategically. Sometimes it almost seems as if we’re supposed to feel foolish if our motivation for doing something is simply to help someone with no expectation of any advantage whatsoever. And if we do receive help, we are conditioned to think of it as part of some implied exchange, a favor owed that might be called in someday. Neither reaction, I submit, is necessary. Helping someone truly is its own reward.  I don’t want to imply that the desire to help needs to reach some pure Platonic ideal. We are complex creatures with complicated problems and tangled motivations. The desire to help is often tied up with other motivations as well—that’s okay. I’m not advocating that you become saints. I just think it’s good for us to recognize the vital role played by basic kindness in work, in play, in everything we do. It’s good to want to be kind and to want others to be kind.  I also don’t want to leave you with the impression that thinking about your career strategically or negotiating hard for every advantage is somehow not a good thing. Indeed, writers can all learn to negotiate better in their business and to value their own time and services more. But it’s worth keeping in mind the importance of the essential freedom we have of opting out of that framework from time to time. Despite the perpetual refrain that we live in a capitalist society, we’re not rational optimization machines constantly calculating the best allocation of our limited resources for economic well-being. It’s part of our nature to want to help others, and we need not feel foolish for wanting to step outside the exchange economy from time to time, to simply feel human by offering a helping hand.  As we grow more confident in our own abilities, acquire more skills, and are offered more opportunities, we do derive satisfaction from helping others in the way that we have been helped. It’s neither necessary nor helpful to think of such acts as part of some implied exchange. The metaphor of “paying it forward” can be useful, but fundamentally, extending a helping hand is just a part of living a satisfying life.  The next time you decide that you want to beta-read someone’s manuscript without reciprocal expectation, give away reprint rights to a story for a magazine that you think might grow into a viable market someday, yield your spot on a panel to a writer who has had less exposure, recommend another author for an opportunity that you think they can benefit from more, or simply do something nice to help a fellow SFF fan, you need not agonize over whether you’re doing the best for your career or if you’ve given as much as you’ve taken. You need not even examine your own motivations to see if they’re sufficiently pure to be worth celebrating. Life is too short to tally up all the opportunity costs. Be grateful when you’re helped, but feel no sense of obligation. You’re allowed to feel good about having been kind, however great or small the gesture. Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "Non-Fiction\nAnother Word: The Joy of Helping\nRecently, Tor Books published Invisible Planets, the first English-language anthology of contemporary Chinese SF (by “contemporary,” I mean roughly something like “written during the 21st century”). I was both the anthology’s editor and translator.\nAs I started to do publicity for the book, one question came up again and again: What motivated me to do translations in the first place?\nI’ve given various answers to this question over the years: diversifying my own writing career, contributing to the variety of voices in English-language SF, practicing a different set of skills related to writing but aren’t writing (translation, after all, is a performance art), and so on.\nBut the answers all feel slightly unsatisfying.\nI got started in translation almost purely by accident. My friend, Chen Qiufan, an amazing writer who began publishing tales of dazzling technical brilliance and profound social insight in college, had one of his stories translated into English and asked me to take a look. I read the translation and found it competent, but I also thought it failed to capture his voice, perhaps the most important quality in a translation. I offered to redo the translation from scratch and to submit the English version to various markets on his behalf.\nAt that moment, I wasn’t thinking about how doing a translation would teach me a new skill; I wasn’t thinking about the ethical duties owed an author by a translator; I wasn’t thinking about how my small decision would play into the larger conversation about diversity in SF; I wasn’t thinking about the opportunity costs of doing translation instead of my original work; I wasn’t thinking about the publicity benefits of attaching my name to another piece of text by a different author; I wasn’t thinking about favors bestowed or owed; I wasn’t thinking about how this affected my career goals, long-term or short-term.\nI just wanted to help a friend reach more readers. That, in the end, is the only motivation that really mattered, that really brought me joy.\nThat story, “The Fish of Lijiang,” ended up as the first translation bought by Clarkesworld. And from that accidental beginning, I’ve built up a sizable body of work as a translator and editor alongside my existing career as a short fiction writer and novelist.\nNow, to be sure, I was inspired in my initial decision by what Qiufan had done for me. He had, after all, reached out to me several years earlier and connected me with my Chinese publishers. That was how we got to know each other, read each other’s stories, and became friends. But I didn’t think of it as repaying a debt. We did not keep a running tally of favors we had done for each other. Such a thing would have felt out of character for both of us, alien.\nThe truth is: It feels good to help people. Even today, much of my motivation in editing and translating stories from China is still tied up with this satisfaction of helping writers reach readers. Surely I would have written more original works and made more money without these translations—but I think I wouldn’t have been as happy.\nAnd we don’t acknowledge and celebrate the joy of helping enough.\nIt’s also important to acknowledge that we like to be helped. I have been helped countless times in my career by friends, editors, readers, fellow authors—even Invisible Planets wouldn’t have been possible without the help of all the authors and many others along the way. All of us have probably had experiences where a friend’s insightful comments improved our stories while the friend remained unacknowledged, or a reprint sales opportunity came up because someone recommended our story without us ever finding out who it was, or we got onto a panel because someone more famous and accomplished thought it helpful to boost our voices. The sun feels brighter on those days, and even the writing seems to come out of the word-mines more easily.\nIt’s nice to be able to make someone feel that, isn’t it?\nAs freelancers in the uncertain publishing industry, writers are bombarded with advice on how to develop our careers and to think strategically. Sometimes it almost seems as if we’re supposed to feel foolish if our motivation for doing something is simply to help someone with no expectation of any advantage whatsoever. And if we do receive help, we are conditioned to think of it as part of some implied exchange, a favor owed that might be called in someday. Neither reaction, I submit, is necessary. Helping someone truly is its own reward.\nI don’t want to imply that the desire to help needs to reach some pure Platonic ideal. We are complex creatures with complicated problems and tangled motivations. The desire to help is often tied up with other motivations as well—that’s okay. I’m not advocating that you become saints. I just think it’s good for us to recognize the vital role played by basic kindness in work, in play, in everything we do. It’s good to want to be kind and to want others to be kind.\nI also don’t want to leave you with the impression that thinking about your career strategically or negotiating hard for every advantage is somehow not a good thing. Indeed, writers can all learn to negotiate better in their business and to value their own time and services more. But it’s worth keeping in mind the importance of the essential freedom we have of opting out of that framework from time to time. Despite the perpetual refrain that we live in a capitalist society, we’re not rational optimization machines constantly calculating the best allocation of our limited resources for economic well-being. It’s part of our nature to want to help others, and we need not feel foolish for wanting to step outside the exchange economy from time to time, to simply feel human by offering a helping hand.\nAs we grow more confident in our own abilities, acquire more skills, and are offered more opportunities, we do derive satisfaction from helping others in the way that we have been helped. It’s neither necessary nor helpful to think of such acts as part of some implied exchange. The metaphor of “paying it forward” can be useful, but fundamentally, extending a helping hand is just a part of living a satisfying life.\nThe next time you decide that you want to beta-read someone’s manuscript without reciprocal expectation, give away reprint rights to a story for a magazine that you think might grow into a viable market someday, yield your spot on a panel to a writer who has had less exposure, recommend another author for an opportunity that you think they can benefit from more, or simply do something nice to help a fellow SFF fan, you need not agonize over whether you’re doing the best for your career or if you’ve given as much as you’ve taken. You need not even examine your own motivations to see if they’re sufficiently pure to be worth celebrating. Life is too short to tally up all the opportunity costs. Be grateful when you’re helped, but feel no sense of obligation. You’re allowed to feel good about having been kind, however great or small the gesture.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/another_word_12_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Joy of Helping by Ken Liu"}