{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "J5M2oBday9RZWiYZ3+8UNH6vsCU=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Calibrating the Stakes: A Conversation with Alastair Reynolds  Alastair Reynolds was born in Barry, South Wales. He earned degrees in astronomy from the Newcastle University in England and a PhD from the University of St. Andrews in Scotland. He began writing science fiction in his teens, and had his first publication in Interzone in 1990: “Nunivak Snowflakes.” In 1991 he moved to the Netherlands, where he worked for the European Space Agency as an astrophysicist. He did a postdoc at Utrecht University from ’94-’96, then went back to the Netherlands. His debut novel, Revelation Space, came out with Gollancz in 2000. In 2004, he became a full-time writer, returning to Wales in 2008. In 2009, he signed a ten book £1 million deal with Gollancz.  Revelation Space received a BSFA nomination and was an Arthur C. Clarke Award finalist; sequel Chasm City took the BSFA for Best Novel. Every year since 2000 Reynolds’ fiction has landed on major awards ballots and finalists lists, including the Hugo Awards. He received acclaim internationally, with Kurd Lasswitz and Grand prix de l'Imaginaire nominations and a Seiun win. Most recently, Reynolds received Locus Awards in 2016 for Slow Bullets and 2017 for Revenger. A stage version of Diamond Dogs was put on in Chicago in 2017, and short stories “Beyond the Aquila Rift” and “Zima Blue” were both adapted as animated shorts for Netflix’s Love, Death & Robots series.  Besides trying to keep up with the demand for his fiction, he says he’s “a keen runner, amateur musician, and am currently building a 1/8th scale flying model of a P51-D Mustang, my all-time favorite aircraft.”   Your first short fiction publication, “Nunivak Snowflakes,” came out in 1990. Your debut novel Revelation Space followed 10 years later. What was the road to breaking in like for you? Did it take a while to start selling novels? And if so, what changed, what made it happen?  After trying to break into the magazine market for about five years, I had a small rash of sales around 1989-1991. I thought I’d cracked it! Then it all dried up again and I didn’t really start to sell again until the middle of the decade. It took a certain amount of dogged confidence in my own abilities to keep going. But I wasn’t all that bothered: those were busy years, with lots going on besides a sideline in science fiction writing. I completed my PhD, moved to the Netherlands, got my first salary, studied Dutch, learned to drive, took up horse riding and indoor climbing, met my wife, and began to travel extensively for work. It wasn’t until a period of unemployment between contracts, in 1997, that I had a chance to return to a novel-in-progress and polish it for submission. That book then took two years to sell, but at no point was it ever rejected. I got an offer for it in 1999 and it came out a year later. I don’t think there was any real evolution in my methods; it was just a question of patience and persistence and getting on with other stuff.  You were born and live in Wales but you have also lived in Newcastle, Scotland, and the Netherlands. Did living in different places and being exposed to different cultures have any sort of impact on your writing or your process?  I’m sure it did, and continues to do so, although it won’t necessarily be reflected in the writing in an obvious, linear fashion. The first thing to say is that I’ve moved around all my life, ever since I was tiny. I’ve been in Wales since 2007 and that’s the first time I’ve ever lived in the same house for more than ten years. I’ve always felt happily rootless. Living in the Netherlands was a fantastic experience, doubly so because I worked for an international organization. ESA showed me that people from different cultures can work together very effectively. I’d like to write a novel with a pan-European setting one day.  At this point, your work set in the Revelation Space universe spans nearly two decades of publishing, most recently with 2018’s Elysium Fire, a sort-of SF/police procedural, where implant failures are killing citizens in growing numbers, among other things. Looking at the entire Revelation Space body of work, what are some of your favorite story moments or ideas? What do you love most about these books and stories?  It’s even longer than that, as my second published story, “Dilation Sleep,” is sort of set in a vague, proto-form of the Revelation Space universe. That was written in the eighties! By the time I did “A Spy in Europa,” I was edging toward the idea that there was a future history somewhere in the making.  Looking at the whole thing—which I’ve lately, and pretentiously, started referring to as a “mosaic” of stories and novels, rather than a series—there are bits I’m pleased with. I like the relativistic chase scene in Redemption Ark, with the two ships trying ever more desperate tactics. I like the invention of the cathedrals in Absolution Gap. It started as a doodle: I drew a cathedral then put tank tracks on it, and a (non-LED) lightbulb went off. I still love the manic invention of the cathedrals and the whole subculture around them. I know the ending to that book is a matter of division among readers, but I think the cathedrals offer some pretty entertaining scenery on the way. I was very much influenced by the films of Jeunet and Caro at the time, which I think shows through, especially in the grotesquerie of the characters.  As for the series—sorry, mosaic—as a whole, I love the constraints I built into it right at the start. No faster than light travel is the obvious one. It’s not nearly as restricting as might be thought. For every story idea it shuts down, there’s another one that you couldn’t possibly do in an FTL setting. The whole harrowing arc of Ana Khouri’s life, for instance—being separated from her husband, and unable to get back to him—wouldn’t play in Star Trek. I’m not the only writer limiting themselves to non-FTL physics, of course—many others had done so. But I think what marked Revelation Space out was that it wasn’t common to marry space opera and non-FTL travel in the same universe. Probably because it was an awkward marriage! I think it took me a few books and stories to figure out the shape of the story that worked best in that setting.  What is the hardest or trickiest part of writing in a universe you started two decades ago, a universe for which you’ve built so many narratives, characters, and concepts?  Playing within the established rules, not contradicting the implicit storyline. There’s no Bible to any of this stuff, just a few files on my PC and some moldering connections in my brain. Oh, and Wiki pages! That said, I’m not even trying to make the thing one hundred percent internally consistent—it jumped that shark about twenty years ago.  It’s more of a mood, an atmosphere, which I’m working hard to sustain, while at the same time exploiting the richness of the backdrop, where possible. The Prefect Dreyfus stories are particularly tricky, as they’re set a little earlier in the timeline and to a degree we know what’s occurring later. The stakes have to be calibrated quite carefully, making the story involving enough, but at the same time we know that the world must be saved. I backed off a little on the scale of the crisis in the second book, deliberately. I felt that if there were an escalation from the first one, things would be getting absurd by the third or fourth title, but if I dialed it down a bit (and gave the characters a bit more room to breathe), then I could go almost anywhere with the next one.  In 2009, you signed a £1 million deal with Gollancz to write ten books in ten years. How did it go? Did it change anything about the way you write?  It’s still an ongoing thing, believe it or not. The book deal didn’t activate until I delivered Blue Remembered Earth. Around the same time, the editor I’d been working with for the previous nine books departed at short notice, and a period of editorial limbo followed, meaning that we were very, very quickly off-piste. There were other factors, some of them personal: I lost my father very unexpectedly at the start of that deal, something I certainly hadn’t counted on. Now we seem to be back onto a fairly stable book-a-year schedule. It’s a schedule that suits my temperament most of the time, since I write fairly quickly, and equally quickly want to move onto something new. If I’ve added to the difficulty, it’s in doing too many extracurricular projects such as other novels, novellas, short stories and so on. I’ve put a temporary brake on most of that stuff until I’ve delivered the last novel in the contract, which will not be for a year or two.  Your website says you have “sixteen novels and more than seventy short stories.” Did you ever hit a slump—a period of time where you either couldn’t write, couldn’t sell, or both? And how did you deal with it?  I’ve alluded to the ups and downs of my first decade, after I broke into the magazines, but before I had a novel out. 1997 was the only time when I seriously considered quitting. I’d broken back into the magazines—well, Interzone, which was really the only market interested in my stuff—but at the same time I didn’t sense that my stories were making any impact beyond those pages. Inevitably, you look at stuff like The Year’s Best Science Fiction and wonder what it would take to make it into those hallowed contents. My stories weren’t even making the “also recommended” pages at the back of Gardner Dozois’ editions. Then, within a year or less, it all happened. A German editor asked for translation rights to one of my earlier stories. Gardner took a story of mine for reprinting, and then not long after bought one for Asimov’s. Interzone kept buying my stuff, and I felt there was a slight uptick of interest with each story. All that was enough to keep me going. My wife and I would go out to our favorite steak house whenever one of these developments happened—until they closed it down!  I’ve never had a serious creative slump. I’ve hit obstacles with various projects, sometimes serious obstacles, but I’ve always either powered on through with sheer bloody-mindedness, or (more likely) switched over to some other thing. I’ve got various strategies for unblocking myself: all fairly obvious. Walks are good. So is going to the cinema. I don’t know why, but something about being exposed to a different narrative form seems to help grease the creative gears.  I’ve had tough periods when there has been bereavement or illness to contend with—the usual stuff we all go through—as well as the inevitable speed bumps of any professional career, but I’ve always managed to keep grinding through and get some work done. That’s not to say I take it for granted: I’m very, very grateful to still be in a position where writing is a viable occupation, two decades after I began publishing novels. It’s not to be taken lightly and I don’t. That said, I feel like I’ve still got the energy and enthusiasm to keep at it, if the fates allow.  After publishing science fiction short stories and novels for two decades, do you feel like either market has changed in any specific, important ways?  I’m sure it has, but to the extent that I’m aware of those changes . . . not hugely. Books are still a thing; magazines are still a thing. Collections are still a thing; anthologies are still a thing. Novellas are still strong—if not stronger than ever. The process by which I get my words out into the world hasn’t changed to any radical degree. By accident or design, most of my stuff ends up in traditional media rather than being exclusively online, but that’s more a reflection of the professional circles I move in, rather than a deliberate strategy on my part.  In terms of the changes that have overtaken the field, and which I’m in a position to note, I think the opening up of science fiction to more diverse voices has been, and will continue to be, incredibly important for the vitality and longevity of the field. The one thing you can definitely say about the form at the moment, if you look at the buzz around certain writers and their works, is that science fiction is trending young, multicultural, and fully—and at times angrily—engaged with the world. Obviously, there are going to be times when the science fiction that we might be comfortable with begins to be edged out or eclipsed by newer forms, some of which we might not even want to think of as science fiction. But that’s all to the good of the field. As Pete Townsend said, music must change! Most of us were drawn to science fiction not because it was cozy and familiar, but because it was a bit unfamiliar and challenging. Long may it remain so. If I can still have a seat at the table as the field evolves, I’m grateful, but it’s not my birthright.  How does your short fiction writing process differ from your novella and novel process?  Not hugely. After you’ve finished a 150,000 word novel, a 15,000 word short story ought to feel like a walk in the park, but it’s rarely the case. It all feels like hard work, most of the time. I don’t actually enjoy writing. I enjoy rewriting, and polishing, but not the creative slog of actually getting words and ideas down. It’s a bit like running. I’m a keen runner but I hate running. I do it purely for the thrill of finishing, the warm glow of intolerable self-satisfaction and smugness that follows.  On a more serious level, I tend to think of fiction requiring the intersection of a minimum set of nonobvious ideas. Short stories need at least two intersecting ideas that don’t seem to belong together. That’s why they’re hard to write: you get one idea, but not the other one. I’ve had stories parked in the “one idea” folder for years, before the second idea crashes in and allows the thing to be written. Sometimes it’s a moment of blinding revelation where you realize that two stories can be mashed together to make one that works. Afterward, you stare at the adjacent files in slack-jawed incomprehension, wondering why that obvious marriage didn’t occur to you six months ago.  It goes on from there. Novellas need more gristle: three or four ideas. Novels are yet more work. It’s like stirring a stew, adding ingredients until it no longer feels thin. Then (if you’re me) you realize you’ve over-thickened it and need to start taking stuff out. I hasten to add I’ve never made a stew.  Your 2016 book, Revenger, centers on teenaged Arafura Ness and her older sister Adrana. It features space pirates as well as a spacefaring civilization that only partly understands the technologies they use. Do you feel like this is an inevitable categorization of a coming-of-age story? Or was writing a young adult book the goal?  I’ve walked a treacherously narrow line with these books, trying to have my cake and eat it. I don’t think they’re YA so much as YA-approachable, which in my contorted view of things is not quite the same category. My impulse for those books was several-fold. I’d written a shorter novel: my Doctor Who tie-in. That wasn’t done as YA but it was done with an idea that younger readers ought to be able to pick it up.  My agent liked the energy behind it and suggested that I might want to think of something with the same fun, accessible spirit, within the context of my normal series of novels. There was also a willingness from my publisher to go down that route. I was up for that, especially because I’d had a definite itch that needed to be scratched, which we might summarize as Delany’s Nova meets early Larry Niven’s Known Space meets steampunk, meets Robert Louis Stevenson, Melville, Dumas, and a heavy salting of Jack Aubrey by way of Horatio Hornblower. That impulse to do a “nautical” space opera has been with me since at least my mid-teens, but I felt I needed to read and ingest a huge amount of material before I could approach it with the right confidence. Obviously, the series starts off with young protagonists. As I’ve pointed out, so does Tess of the D’Urbervilles, and so does Dune.  Locus made a decision that the book was YA, and that was fine: it’s their call, they’re my friends, and I was grateful for the recognition.  You are a big Doctor Who fan and wrote a Doctor Who book. What are your thoughts on the latest season?  These lightweights, with their superficial knowledge only going back to the Baker era . . .  I’m (also) a long-haul Doctor Who fan, prepared for a bit of turbulence! I didn’t think the season got off to a particularly auspicious start, but that won’t be the first time and it won’t be the last. The episode with . . . the surprising buried thing . . . won me ’round rather persuasively, and now I can’t wait to see where we go after these revelations. Jodie Whittaker is a very good Doctor, in my view, and I hope she sticks around a bit. For myself, I’d like it to get back to being a little scarier, but the show has always moved through waves. Do you want a bit of trivia, by the way? I know the guy who designed the new sonic screwdriver. He’s the brother of my longtime guitar tutor.  One day I hope the producers will run out of scripts and ask themselves if they know any enthusiastic, prolific, lifelong Whovians who live extremely locally to BBC Wales.  Book two, Shadow Captain, begins three months after book one but is generally less lighthearted. Tensions rise between the sisters Ness as they struggle to determine who they want to be and how to use their ship. What can you tell us about book three, Bone Silence?  I think the difference between books one and two is mostly a matter of voice. Lots of really horrible stuff happens in both, so it’s not really that one is darker than the other. With Shadow Captain, I decided I wanted to tell it in Adrana’s voice, and that I wanted her account to sound distinct from Fura’s. With Revenger, there’s an evolution in that Fura starts off quite posh and then gets saltier and more piratical as we go through the book, not just in her dialogue, but in her own account of the action.  For Adrana’s narrative, I decided to immerse myself in Austen, booting her voice up in my head, and then filtering it through this madcap space opera storyline with ancient civilizations and haunted skulls. What I learned was that Austen is a wonderfully modern writer—who knew! Everything you’d ever need to know about dialogue. I think she reads much more legibly to us than, say, Dickens or Hardy, even though she predates both. I read a review somewhere that said something like “the trouble with this book is that it reads like Jane Austen in space” to which my response would be, that’s a feature, dude, not a bug. On the other hand, someone compared the books to “Jane Austen on crack,” or words to that effect, and meant it approvingly.  Bone Silence is a slightly different kettle of fish again. I had to think about voice and point of view, obviously. There were two choices: go back to Fura or introduce a third narrator. I went for the second option. There are lots of clues as to who that narrator might be, but it’s not explicit. It did however give me a license to go even more over-the-top in places, as this is very much a story being told, and perhaps embroidered in the telling.  What has been the most challenging aspect of writing Bone Silence? And what’s been the most fun?  I decided early on that if I was going to go for a third person narration, I had the option of putting the sisters into different storylines playing out in parallel. They’re separated in Revenger, but we only get Fura’s point of view. This time I came up with the idea of putting them on different ships and throwing different sorts of peril at them. This sounded fine in theory but getting the two timelines to mesh was an absolute months-long nightmare. It felt like I was stuck in a Groundhog Day loop in which I’d come to work each morning and attempt to resolve this riddle but never get nearer to a solution. I don’t have the Internet in my writing den but I do have a very naughty distraction, which is a beautiful metallic blue-gray 22-fret Stratocaster. Eventually, even the Strat had to be banished, until I found a way through the problem. Which—when I did—seemed trivial and obvious in hindsight.  After that, sticking pins into my eyes would have been fun, but I really enjoyed writing the main space battle halfway through the book, when Revenger is fending off the squadron. I really felt that I was getting the payoff for reading and processing just an enormous, obscene amount of space opera, WW2 submarine films, nautical fiction, and history from the age of fighting sail. Ideally, as a writer, you want to get to a position where you can believe, even if it’s only for a moment, that no one else on the planet is capable of coming up with these exact sets of words. You might be deluded, but on rare days you might just be right.  You’ve talked before about the term “hard SF” and scientific rigor as it relates to your writing. What are some of your favorite concepts from your books that absolutely aren’t scientifically sound? And what are some of your favorite scientifically rigorous concepts? Or perhaps your favorite deeply researched bits, those things which readers probably won’t know just how much work went into them?  I’ve never been entirely comfortable with the hard SF label and have been edging away from it over the years. It’s not that I don’t like some hard SF, or that I don’t occasionally wish to write something that might, under certain generous criteria, be considered hard SF. But the term carries so much ideological baggage, as well as setting up expectations in the minds of the readers, that I’d rather not be encumbered by it. And you are right to note that some of my ideas haven’t been at all scientifically sound.  Without going into details, I’m very pleased with the central conceit in Permafrost, to do with MRI scanners . . . I had a real “oh yes!” moment when I came up with that, but although it’s dressed up with some quantum mumbo jumbo in the story, it’s not in any sense possible. I also (keeping with the theme of time travel) like the idea in my very first story, “Nunivak Snowflakes,” about calibrating time machines using fish and frogs.  As for slightly more plausible ideas . . . I like the speculation about dark matter planets in one of the Merlin stories (“Hideaway”)—the idea that if you had a sufficiently dense concentration of dark matter, it could form a planetlike mass that could then orbit inside the volume of a planet made of conventional matter. I’m sure it’d been done before but I wasn’t aware of it.  My deeply researched bits haven’t always been as satisfying to me as the times where I just winged an idea. I remember in a quite early story, “The Real Story,” I tried to work out the aerodynamics of BASE jumping on Mars and came up with something quite similar to a wingsuit. I also had a situation in another early piece, “Great Wall of Mars,” where packages were being catapulted up from a secret Mars base to one of the moons, slowly altering its momentum. The conceit is a few throwaway lines in the story, but the editor wanted me to demonstrate that the maths was plausible, so I actually had to supply my workings out. That’s not how I like to operate, though. I’d go so far now as to say that any short story that depends on a bit of physics being correct for the story to work is not going to be a story with much longevity.  You had Permafrost come out March 2019 from Tor.com Publishing, and Bone Silence completes the Revenger series. What are you working on now, or what do you have coming out next, that readers can look forward to? And what can you tell us about it?  I have one short story coming out in March in Jonathan Strahan’s new anthology, Made to Order, and that’s it for 2020. I’m working on a new novel in the Revelation Space universe right now, set primarily after the events of Absolution Gap. It’s not a sequel to that book, nor a direct continuation of any of the others, even though there is some connective tissue and one or two minor characters in common. My hope will be that it can be read as a standalone. That one should appear in early 2021. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nCalibrating the Stakes: A Conversation with Alastair Reynolds\nAlastair Reynolds was born in Barry, South Wales. He earned degrees in astronomy from the Newcastle University in England and a PhD from the University of St. Andrews in Scotland. He began writing science fiction in his teens, and had his first publication in Interzone in 1990: “Nunivak Snowflakes.” In 1991 he moved to the Netherlands, where he worked for the European Space Agency as an astrophysicist. He did a postdoc at Utrecht University from ’94-’96, then went back to the Netherlands. His debut novel, Revelation Space, came out with Gollancz in 2000. In 2004, he became a full-time writer, returning to Wales in 2008. In 2009, he signed a ten book £1 million deal with Gollancz.\nRevelation Space received a BSFA nomination and was an Arthur C. Clarke Award finalist; sequel Chasm City took the BSFA for Best Novel. Every year since 2000 Reynolds’ fiction has landed on major awards ballots and finalists lists, including the Hugo Awards. He received acclaim internationally, with Kurd Lasswitz and Grand prix de l'Imaginaire nominations and a Seiun win. Most recently, Reynolds received Locus Awards in 2016 for Slow Bullets and 2017 for Revenger. A stage version of Diamond Dogs was put on in Chicago in 2017, and short stories “Beyond the Aquila Rift” and “Zima Blue” were both adapted as animated shorts for Netflix’s Love, Death & Robots series.\nBesides trying to keep up with the demand for his fiction, he says he’s “a keen runner, amateur musician, and am currently building a 1/8th scale flying model of a P51-D Mustang, my all-time favorite aircraft.”\nYour first short fiction publication, “Nunivak Snowflakes,” came out in 1990. Your debut novel Revelation Space followed 10 years later. What was the road to breaking in like for you? Did it take a while to start selling novels? And if so, what changed, what made it happen?\nAfter trying to break into the magazine market for about five years, I had a small rash of sales around 1989-1991. I thought I’d cracked it! Then it all dried up again and I didn’t really start to sell again until the middle of the decade. It took a certain amount of dogged confidence in my own abilities to keep going. But I wasn’t all that bothered: those were busy years, with lots going on besides a sideline in science fiction writing. I completed my PhD, moved to the Netherlands, got my first salary, studied Dutch, learned to drive, took up horse riding and indoor climbing, met my wife, and began to travel extensively for work. It wasn’t until a period of unemployment between contracts, in 1997, that I had a chance to return to a novel-in-progress and polish it for submission. That book then took two years to sell, but at no point was it ever rejected. I got an offer for it in 1999 and it came out a year later. I don’t think there was any real evolution in my methods; it was just a question of patience and persistence and getting on with other stuff.\nYou were born and live in Wales but you have also lived in Newcastle, Scotland, and the Netherlands. Did living in different places and being exposed to different cultures have any sort of impact on your writing or your process?\nI’m sure it did, and continues to do so, although it won’t necessarily be reflected in the writing in an obvious, linear fashion. The first thing to say is that I’ve moved around all my life, ever since I was tiny. I’ve been in Wales since 2007 and that’s the first time I’ve ever lived in the same house for more than ten years. I’ve always felt happily rootless. Living in the Netherlands was a fantastic experience, doubly so because I worked for an international organization. ESA showed me that people from different cultures can work together very effectively. I’d like to write a novel with a pan-European setting one day.\nAt this point, your work set in the Revelation Space universe spans nearly two decades of publishing, most recently with 2018’s Elysium Fire, a sort-of SF/police procedural, where implant failures are killing citizens in growing numbers, among other things. Looking at the entire Revelation Space body of work, what are some of your favorite story moments or ideas? What do you love most about these books and stories?\nIt’s even longer than that, as my second published story, “Dilation Sleep,” is sort of set in a vague, proto-form of the Revelation Space universe. That was written in the eighties! By the time I did “A Spy in Europa,” I was edging toward the idea that there was a future history somewhere in the making.\nLooking at the whole thing—which I’ve lately, and pretentiously, started referring to as a “mosaic” of stories and novels, rather than a series—there are bits I’m pleased with. I like the relativistic chase scene in Redemption Ark, with the two ships trying ever more desperate tactics. I like the invention of the cathedrals in Absolution Gap. It started as a doodle: I drew a cathedral then put tank tracks on it, and a (non-LED) lightbulb went off. I still love the manic invention of the cathedrals and the whole subculture around them. I know the ending to that book is a matter of division among readers, but I think the cathedrals offer some pretty entertaining scenery on the way. I was very much influenced by the films of Jeunet and Caro at the time, which I think shows through, especially in the grotesquerie of the characters.\nAs for the series—sorry, mosaic—as a whole, I love the constraints I built into it right at the start. No faster than light travel is the obvious one. It’s not nearly as restricting as might be thought. For every story idea it shuts down, there’s another one that you couldn’t possibly do in an FTL setting. The whole harrowing arc of Ana Khouri’s life, for instance—being separated from her husband, and unable to get back to him—wouldn’t play in Star Trek. I’m not the only writer limiting themselves to non-FTL physics, of course—many others had done so. But I think what marked Revelation Space out was that it wasn’t common to marry space opera and non-FTL travel in the same universe. Probably because it was an awkward marriage! I think it took me a few books and stories to figure out the shape of the story that worked best in that setting.\nWhat is the hardest or trickiest part of writing in a universe you started two decades ago, a universe for which you’ve built so many narratives, characters, and concepts?\nPlaying within the established rules, not contradicting the implicit storyline. There’s no Bible to any of this stuff, just a few files on my PC and some moldering connections in my brain. Oh, and Wiki pages! That said, I’m not even trying to make the thing one hundred percent internally consistent—it jumped that shark about twenty years ago.\nIt’s more of a mood, an atmosphere, which I’m working hard to sustain, while at the same time exploiting the richness of the backdrop, where possible. The Prefect Dreyfus stories are particularly tricky, as they’re set a little earlier in the timeline and to a degree we know what’s occurring later. The stakes have to be calibrated quite carefully, making the story involving enough, but at the same time we know that the world must be saved. I backed off a little on the scale of the crisis in the second book, deliberately. I felt that if there were an escalation from the first one, things would be getting absurd by the third or fourth title, but if I dialed it down a bit (and gave the characters a bit more room to breathe), then I could go almost anywhere with the next one.\nIn 2009, you signed a £1 million deal with Gollancz to write ten books in ten years. How did it go? Did it change anything about the way you write?\nIt’s still an ongoing thing, believe it or not. The book deal didn’t activate until I delivered Blue Remembered Earth. Around the same time, the editor I’d been working with for the previous nine books departed at short notice, and a period of editorial limbo followed, meaning that we were very, very quickly off-piste. There were other factors, some of them personal: I lost my father very unexpectedly at the start of that deal, something I certainly hadn’t counted on. Now we seem to be back onto a fairly stable book-a-year schedule. It’s a schedule that suits my temperament most of the time, since I write fairly quickly, and equally quickly want to move onto something new. If I’ve added to the difficulty, it’s in doing too many extracurricular projects such as other novels, novellas, short stories and so on. I’ve put a temporary brake on most of that stuff until I’ve delivered the last novel in the contract, which will not be for a year or two.\nYour website says you have “sixteen novels and more than seventy short stories.” Did you ever hit a slump—a period of time where you either couldn’t write, couldn’t sell, or both? And how did you deal with it?\nI’ve alluded to the ups and downs of my first decade, after I broke into the magazines, but before I had a novel out. 1997 was the only time when I seriously considered quitting. I’d broken back into the magazines—well, Interzone, which was really the only market interested in my stuff—but at the same time I didn’t sense that my stories were making any impact beyond those pages. Inevitably, you look at stuff like The Year’s Best Science Fiction and wonder what it would take to make it into those hallowed contents. My stories weren’t even making the “also recommended” pages at the back of Gardner Dozois’ editions. Then, within a year or less, it all happened. A German editor asked for translation rights to one of my earlier stories. Gardner took a story of mine for reprinting, and then not long after bought one for Asimov’s. Interzone kept buying my stuff, and I felt there was a slight uptick of interest with each story. All that was enough to keep me going. My wife and I would go out to our favorite steak house whenever one of these developments happened—until they closed it down!\nI’ve never had a serious creative slump. I’ve hit obstacles with various projects, sometimes serious obstacles, but I’ve always either powered on through with sheer bloody-mindedness, or (more likely) switched over to some other thing. I’ve got various strategies for unblocking myself: all fairly obvious. Walks are good. So is going to the cinema. I don’t know why, but something about being exposed to a different narrative form seems to help grease the creative gears.\nI’ve had tough periods when there has been bereavement or illness to contend with—the usual stuff we all go through—as well as the inevitable speed bumps of any professional career, but I’ve always managed to keep grinding through and get some work done. That’s not to say I take it for granted: I’m very, very grateful to still be in a position where writing is a viable occupation, two decades after I began publishing novels. It’s not to be taken lightly and I don’t. That said, I feel like I’ve still got the energy and enthusiasm to keep at it, if the fates allow.\nAfter publishing science fiction short stories and novels for two decades, do you feel like either market has changed in any specific, important ways?\nI’m sure it has, but to the extent that I’m aware of those changes . . . not hugely. Books are still a thing; magazines are still a thing. Collections are still a thing; anthologies are still a thing. Novellas are still strong—if not stronger than ever. The process by which I get my words out into the world hasn’t changed to any radical degree. By accident or design, most of my stuff ends up in traditional media rather than being exclusively online, but that’s more a reflection of the professional circles I move in, rather than a deliberate strategy on my part.\nIn terms of the changes that have overtaken the field, and which I’m in a position to note, I think the opening up of science fiction to more diverse voices has been, and will continue to be, incredibly important for the vitality and longevity of the field. The one thing you can definitely say about the form at the moment, if you look at the buzz around certain writers and their works, is that science fiction is trending young, multicultural, and fully—and at times angrily—engaged with the world. Obviously, there are going to be times when the science fiction that we might be comfortable with begins to be edged out or eclipsed by newer forms, some of which we might not even want to think of as science fiction. But that’s all to the good of the field. As Pete Townsend said, music must change! Most of us were drawn to science fiction not because it was cozy and familiar, but because it was a bit unfamiliar and challenging. Long may it remain so. If I can still have a seat at the table as the field evolves, I’m grateful, but it’s not my birthright.\nHow does your short fiction writing process differ from your novella and novel process?\nNot hugely. After you’ve finished a 150,000 word novel, a 15,000 word short story ought to feel like a walk in the park, but it’s rarely the case. It all feels like hard work, most of the time. I don’t actually enjoy writing. I enjoy rewriting, and polishing, but not the creative slog of actually getting words and ideas down. It’s a bit like running. I’m a keen runner but I hate running. I do it purely for the thrill of finishing, the warm glow of intolerable self-satisfaction and smugness that follows.\nOn a more serious level, I tend to think of fiction requiring the intersection of a minimum set of nonobvious ideas. Short stories need at least two intersecting ideas that don’t seem to belong together. That’s why they’re hard to write: you get one idea, but not the other one. I’ve had stories parked in the “one idea” folder for years, before the second idea crashes in and allows the thing to be written. Sometimes it’s a moment of blinding revelation where you realize that two stories can be mashed together to make one that works. Afterward, you stare at the adjacent files in slack-jawed incomprehension, wondering why that obvious marriage didn’t occur to you six months ago.\nIt goes on from there. Novellas need more gristle: three or four ideas. Novels are yet more work. It’s like stirring a stew, adding ingredients until it no longer feels thin. Then (if you’re me) you realize you’ve over-thickened it and need to start taking stuff out. I hasten to add I’ve never made a stew.\nYour 2016 book, Revenger, centers on teenaged Arafura Ness and her older sister Adrana. It features space pirates as well as a spacefaring civilization that only partly understands the technologies they use. Do you feel like this is an inevitable categorization of a coming-of-age story? Or was writing a young adult book the goal?\nI’ve walked a treacherously narrow line with these books, trying to have my cake and eat it. I don’t think they’re YA so much as YA-approachable, which in my contorted view of things is not quite the same category. My impulse for those books was several-fold. I’d written a shorter novel: my Doctor Who tie-in. That wasn’t done as YA but it was done with an idea that younger readers ought to be able to pick it up.\nMy agent liked the energy behind it and suggested that I might want to think of something with the same fun, accessible spirit, within the context of my normal series of novels. There was also a willingness from my publisher to go down that route. I was up for that, especially because I’d had a definite itch that needed to be scratched, which we might summarize as Delany’s Nova meets early Larry Niven’s Known Space meets steampunk, meets Robert Louis Stevenson, Melville, Dumas, and a heavy salting of Jack Aubrey by way of Horatio Hornblower. That impulse to do a “nautical” space opera has been with me since at least my mid-teens, but I felt I needed to read and ingest a huge amount of material before I could approach it with the right confidence. Obviously, the series starts off with young protagonists. As I’ve pointed out, so does Tess of the D’Urbervilles, and so does Dune.\nLocus made a decision that the book was YA, and that was fine: it’s their call, they’re my friends, and I was grateful for the recognition.\nYou are a big Doctor Who fan and wrote a Doctor Who book. What are your thoughts on the latest season?\nThese lightweights, with their superficial knowledge only going back to the Baker era . . .\nI’m (also) a long-haul Doctor Who fan, prepared for a bit of turbulence! I didn’t think the season got off to a particularly auspicious start, but that won’t be the first time and it won’t be the last. The episode with . . . the surprising buried thing . . . won me ’round rather persuasively, and now I can’t wait to see where we go after these revelations. Jodie Whittaker is a very good Doctor, in my view, and I hope she sticks around a bit. For myself, I’d like it to get back to being a little scarier, but the show has always moved through waves. Do you want a bit of trivia, by the way? I know the guy who designed the new sonic screwdriver. He’s the brother of my longtime guitar tutor.\nOne day I hope the producers will run out of scripts and ask themselves if they know any enthusiastic, prolific, lifelong Whovians who live extremely locally to BBC Wales.\nBook two, Shadow Captain, begins three months after book one but is generally less lighthearted. Tensions rise between the sisters Ness as they struggle to determine who they want to be and how to use their ship. What can you tell us about book three, Bone Silence?\nI think the difference between books one and two is mostly a matter of voice. Lots of really horrible stuff happens in both, so it’s not really that one is darker than the other. With Shadow Captain, I decided I wanted to tell it in Adrana’s voice, and that I wanted her account to sound distinct from Fura’s. With Revenger, there’s an evolution in that Fura starts off quite posh and then gets saltier and more piratical as we go through the book, not just in her dialogue, but in her own account of the action.\nFor Adrana’s narrative, I decided to immerse myself in Austen, booting her voice up in my head, and then filtering it through this madcap space opera storyline with ancient civilizations and haunted skulls. What I learned was that Austen is a wonderfully modern writer—who knew! Everything you’d ever need to know about dialogue. I think she reads much more legibly to us than, say, Dickens or Hardy, even though she predates both. I read a review somewhere that said something like “the trouble with this book is that it reads like Jane Austen in space” to which my response would be, that’s a feature, dude, not a bug. On the other hand, someone compared the books to “Jane Austen on crack,” or words to that effect, and meant it approvingly.\nBone Silence is a slightly different kettle of fish again. I had to think about voice and point of view, obviously. There were two choices: go back to Fura or introduce a third narrator. I went for the second option. There are lots of clues as to who that narrator might be, but it’s not explicit. It did however give me a license to go even more over-the-top in places, as this is very much a story being told, and perhaps embroidered in the telling.\nWhat has been the most challenging aspect of writing Bone Silence? And what’s been the most fun?\nI decided early on that if I was going to go for a third person narration, I had the option of putting the sisters into different storylines playing out in parallel. They’re separated in Revenger, but we only get Fura’s point of view. This time I came up with the idea of putting them on different ships and throwing different sorts of peril at them. This sounded fine in theory but getting the two timelines to mesh was an absolute months-long nightmare. It felt like I was stuck in a Groundhog Day loop in which I’d come to work each morning and attempt to resolve this riddle but never get nearer to a solution. I don’t have the Internet in my writing den but I do have a very naughty distraction, which is a beautiful metallic blue-gray 22-fret Stratocaster. Eventually, even the Strat had to be banished, until I found a way through the problem. Which—when I did—seemed trivial and obvious in hindsight.\nAfter that, sticking pins into my eyes would have been fun, but I really enjoyed writing the main space battle halfway through the book, when Revenger is fending off the squadron. I really felt that I was getting the payoff for reading and processing just an enormous, obscene amount of space opera, WW2 submarine films, nautical fiction, and history from the age of fighting sail. Ideally, as a writer, you want to get to a position where you can believe, even if it’s only for a moment, that no one else on the planet is capable of coming up with these exact sets of words. You might be deluded, but on rare days you might just be right.\nYou’ve talked before about the term “hard SF” and scientific rigor as it relates to your writing. What are some of your favorite concepts from your books that absolutely aren’t scientifically sound? And what are some of your favorite scientifically rigorous concepts? Or perhaps your favorite deeply researched bits, those things which readers probably won’t know just how much work went into them?\nI’ve never been entirely comfortable with the hard SF label and have been edging away from it over the years. It’s not that I don’t like some hard SF, or that I don’t occasionally wish to write something that might, under certain generous criteria, be considered hard SF. But the term carries so much ideological baggage, as well as setting up expectations in the minds of the readers, that I’d rather not be encumbered by it. And you are right to note that some of my ideas haven’t been at all scientifically sound.\nWithout going into details, I’m very pleased with the central conceit in Permafrost, to do with MRI scanners . . . I had a real “oh yes!” moment when I came up with that, but although it’s dressed up with some quantum mumbo jumbo in the story, it’s not in any sense possible. I also (keeping with the theme of time travel) like the idea in my very first story, “Nunivak Snowflakes,” about calibrating time machines using fish and frogs.\nAs for slightly more plausible ideas . . . I like the speculation about dark matter planets in one of the Merlin stories (“Hideaway”)—the idea that if you had a sufficiently dense concentration of dark matter, it could form a planetlike mass that could then orbit inside the volume of a planet made of conventional matter. I’m sure it’d been done before but I wasn’t aware of it.\nMy deeply researched bits haven’t always been as satisfying to me as the times where I just winged an idea. I remember in a quite early story, “The Real Story,” I tried to work out the aerodynamics of BASE jumping on Mars and came up with something quite similar to a wingsuit. I also had a situation in another early piece, “Great Wall of Mars,” where packages were being catapulted up from a secret Mars base to one of the moons, slowly altering its momentum. The conceit is a few throwaway lines in the story, but the editor wanted me to demonstrate that the maths was plausible, so I actually had to supply my workings out. That’s not how I like to operate, though. I’d go so far now as to say that any short story that depends on a bit of physics being correct for the story to work is not going to be a story with much longevity.\nYou had Permafrost come out March 2019 from Tor.com Publishing, and Bone Silence completes the Revenger series. What are you working on now, or what do you have coming out next, that readers can look forward to? And what can you tell us about it?\nI have one short story coming out in March in Jonathan Strahan’s new anthology, Made to Order, and that’s it for 2020. I’m working on a new novel in the Revelation Space universe right now, set primarily after the events of Absolution Gap. It’s not a sequel to that book, nor a direct continuation of any of the others, even though there is some connective tissue and one or two minor characters in common. My hope will be that it can be read as a standalone. That one should appear in early 2021.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/reynolds_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Calibrating the Stakes: A Conversation with Alastair Reynolds by Arley Sorg"}