{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "v9pimkWUNjHObd8cYaBbmAM7YZw=", "id": null, "license": null, "comments": "", "raw_text": "Interview  If It Scares You, Write It: A Conversation with Nnedi Okorafor  Nnedi Okorafor is the award-winning author of Zahrah the Windseeker, The Shadow Seeker, and Long Juju Man. Her writing is beautiful, relentlessly weird, and utterly engrossing.  “I enjoy nonsense and weirdness,” Okorafor said. “Carnivorous hummingbirds, for example. An enormous wormlike creature moving beneath the sands who is obsessed with the number ten, not the typical numbers of seven, one, or three... ten. Spontaneous forests. Sparkling lizards that can infest a house giving it unlimited electricity but also the problem of constant static. A mosque made of glass and solar cells which blooms with fragrant periwinkle daisies on its roof at midnight every night. I love those kinds of things.”  For good reason, Okorafor’s fiction has been called “highly original” and “endlessly imaginative.” Her work has been favorably compared to that of Octavia Butler and Nalo Hopkinson for her deft blending of contemporary and traditional themes and forms. Reviews of her writing praise her courageous female characters and her breath-taking descriptions.  Okorafor is a spontaneous writer who writes with urgency, and as a result her stories read like magical evocations of living beings.  “When a story comes to me, I have to write it or it won’t let me rest,” Okorafor said. “The characters are real to me. I hear their voices. Their actions affect me. The places I write about exist. I’ve felt the sting of their sand storms and smelled their forests. The creatures really do bite, snarl, sing, spit, sting, etc. When I’m writing, I’m there and I enjoy being there.”  Okorafor’s novels Who Fears Death (DAW) and Akata Witch (Penguin) are due out in 2010. Her chapter book Iridessa and the Fire-Bellied Dragon Frog (Disney Press) is also scheduled for release next year. Her short story, “From the Lost Diary of TreeFrog7” appeared in the May 2009 issue of Clarkesworld.  Below, Okorafor and I talk about urban grasshoppers and a girl who chooses to do it on her own.    When you look out on the literary landscape, where do you see yourself?  That’s a good question. I still don’t really know. I’m not a perfect fit anywhere.  From what seed or seeds did your novel, Zahrah the Windseeker, grow? And can you share the story of its cultivation?  Zahrah the Windseeker started with a place. Ginen—an entire planet populated with foliage. This world came to me long before Zahrah the Windseeker. I initially wrote a novel called Ginen. This was never published. In that novel, I detailed Ginen—the people, the cultures, the advanced plant technology, the bloated overly patriarchal chief, his miserable wives, and of course the forests and their flora and fauna, there was so much in that novel. I even wrote a field guide to keep track.  When I finished the novel Ginen, I still wanted to spend time in that world. I’d written another book called The Legend of Arrö-yo which was about a woman who could fly, a windseeker named Arrö-yo.  You see, I just write. I have stories and they are all connected and each story is more of the puzzle I’m putting together for myself. At some point, Zahrah came to me. She was a young girl who was nothing like Arrö-yo, except that she, too, was a windseeker. Arrö-yo was from earth but Zahrah was from Ginen. And Zahrah lived near a really wild forest. I knew she had to go in there. The story practically wrote itself.  My subsequent novel, The Shadow Speaker, eventually ends up in Ginen, too... albeit in a different part.  What did writing Zahrah the Windseeker teach you about the craft that helped with writing The Shadow Speaker?  That‘s hard to say because I wrote two novels in-between Zahrah the Windseeker and The Shadow Speaker. I think each novel that I write helps me hone my craft that much more. I will say that writing Zahrah the Windseeker taught me how to write in first person. I originally wrote it in third. My editors asked me to change it to first. I’m always up for a challenge, so I said, sure. After I did Zahrah, I developed a taste for the first person narrative. The Shadow Speaker is in third but my forthcoming adult novel, Who Fears Death, is in first. That is a direct result of the work I did on Zahrah the Windseeker.  What is the appeal of a near future earth ravaged by bioterrorism? What does a somewhat apocalyptic setting let you do as a writer that a more normal, present-day earth wouldn’t?  I love the idea of the earth rebelling. I love the idea of human beings having no clue WTF is going on. I love the idea of the laws of physics going haywire. Human begins seek to control, they seek to be at the top of their self-created hierarchy, above all creatures. We’re arrogant as hell even though we don’t know what’s going on half the time.  Also, I have an obsession with chaos and destruction. Tornados, earthquakes, hurricanes, sudden, unexpected horrible change. Writing it is my way of facing it.  The post-apocalyptic world that Ejii lives in is my worst nightmare. There is little control or predictability. People can’t even predict the weather. The weather forecasts have to come with the reminder that it is N.I.U.F, “Not Including Unpredictable Factors.” In Ejii’s world, one must learn to move with the earth, by its rules to survive, as opposed to forcing the earth to conform to one’s own rules as we do today. This makes for a different kind of story and different kinds of characters.  How did you go about building the world(s) of Zahrah the Windseeker and The Shadow Speaker? How do you balance the exotic and the familiar? Invite the reader in so thoroughly? Your descriptions are utterly breath-taking!  I see the world as an exotic place. Just last week, I was walking through campus when I saw a giant grasshopper sitting on the wall. I’m a professor at Chicago State University, a university smack dab in the south side of Chicago. So this was an “urban grasshopper,” I guess. My urge was to stop and catch it and examine it. See how it behaved. Feel the strength of its legs when it leapt from my hand. Look at it up close and note every design on its body. This is a creature that we see all the time but when you look at it, really look at it, you see its exotic beauty. I still maintain a sense of wonder when I look around me, I guess. I’ve been like this since I was a kid. I tap into this when I write and describe things. I’m drawing from observations I’ve made of things in real life.  You’ve spent much of your life in the Chicago area. What does Chicago mean to you as an artist? In what ways does it feed your creativity?  I was born in Cincinnati, Ohio but I have lived in the suburbs of Chicago since I was about six. Living in the suburbs of Chicago gave me lots of space and a lot of empty weed-filled lots to explore. It’s in these empty lots, forest preserves and nature centers that I cultivated my love for flora and fauna.  Also in these suburbs I experienced a lot of extremely blatant racism. In the 80s of South Holland, Illinois it was like the 60s. My family was one of the first black family to move into that neighborhood. Thank goodness I was a fast runner. I learned early what it was to save my own ass from the bad guys. Then when we moved to Olympia Fields, Illinois, it flipped to experiencing discrimination from black Americans for being African and for “acting white.”  I was a sort of outcast in multiple communities. So I grew up with little interest in “fitting in.” I just did my thing. And I’m still doing that.  Your protagonists Ejii and Zahrah are certainly different characters in different novels, but in their heart-of-hearts, what do they share? How are they similar?  They’re both really brave girls. With Zahrah, you see her go into that forbidden forest. She cries and sulks and flees from things, etc, but I remember thinking as I wrote her story that I could never do what she did. Have you ever been in a forest at night? Imagine it. Deep in an enormous really wild forest, away from civilization, alone, seeking out something terrible as opposed to running from it. This girl chooses to do this on her own. That’s totally insane! I love it.  Ejii is a bit more hardcore than Zahrah. I especially learned this when I wrote the early scene where she gets in a fist fight with her cousin (who was a boy about her age). This was not an innocent fight. It was absolutely vicious. And in getting into it, Ejii was throwing off all the cultural baggage that normally should have stopped her from doing such a thing. She eventually, by her own choice, goes out into a dangerous environment- in this case a post-apocalyptic Sahara Desert. She, too, possesses a deep deep courage.  As you mention above, you are always up for a challenge and you embrace spontaneity and weirdness as a writer. What does “courage” mean in terms of writing, of being a writer. Or, put a little differently, what would you/do you tell your creative writing students about courage and writing?  If it scares you to write it, then you should definitely write it. My forthcoming novel Who Fears Death is full of moments and situations that I wanted to pull back from or skip over. I didn’t want to look at certain issues, practices or situations. But I knew that if I was feeling that way then that’s where the good stuff was, so I faced it. When I wrote these parts, I was plagued with nightmares, felt depressed, etc, it was pretty awful. But after having the courage to face what scared me, I was able to produce a work that went beyond my usual type of writing. Now I have to face the fear of my mother reading it but that’s another story, ha ha.  And, lastly, what is just beyond the horizon for you?  As it says at the very beginning of Erykah Badu’s “New Amerykah Part One” album, “More action. More excitement. More everything.” I’m just getting started. Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nIf It Scares You, Write It: A Conversation with Nnedi Okorafor\nNnedi Okorafor is the award-winning author of Zahrah the Windseeker, The Shadow Seeker, and Long Juju Man. Her writing is beautiful, relentlessly weird, and utterly engrossing.\n“I enjoy nonsense and weirdness,” Okorafor said. “Carnivorous hummingbirds, for example. An enormous wormlike creature moving beneath the sands who is obsessed with the number ten, not the typical numbers of seven, one, or three... ten. Spontaneous forests. Sparkling lizards that can infest a house giving it unlimited electricity but also the problem of constant static. A mosque made of glass and solar cells which blooms with fragrant periwinkle daisies on its roof at midnight every night. I love those kinds of things.”\nFor good reason, Okorafor’s fiction has been called “highly original” and “endlessly imaginative.” Her work has been favorably compared to that of Octavia Butler and Nalo Hopkinson for her deft blending of contemporary and traditional themes and forms. Reviews of her writing praise her courageous female characters and her breath-taking descriptions.\nOkorafor is a spontaneous writer who writes with urgency, and as a result her stories read like magical evocations of living beings.\n“When a story comes to me, I have to write it or it won’t let me rest,” Okorafor said. “The characters are real to me. I hear their voices. Their actions affect me. The places I write about exist. I’ve felt the sting of their sand storms and smelled their forests. The creatures really do bite, snarl, sing, spit, sting, etc. When I’m writing, I’m there and I enjoy being there.”\nOkorafor’s novels Who Fears Death (DAW) and Akata Witch (Penguin) are due out in 2010. Her chapter book Iridessa and the Fire-Bellied Dragon Frog (Disney Press) is also scheduled for release next year. Her short story, “From the Lost Diary of TreeFrog7” appeared in the May 2009 issue of Clarkesworld.\nBelow, Okorafor and I talk about urban grasshoppers and a girl who chooses to do it on her own.\nWhen you look out on the literary landscape, where do you see yourself?\nThat’s a good question. I still don’t really know. I’m not a perfect fit anywhere.\nFrom what seed or seeds did your novel, Zahrah the Windseeker, grow? And can you share the story of its cultivation?\nZahrah the Windseeker started with a place. Ginen—an entire planet populated with foliage. This world came to me long before Zahrah the Windseeker. I initially wrote a novel called Ginen. This was never published. In that novel, I detailed Ginen—the people, the cultures, the advanced plant technology, the bloated overly patriarchal chief, his miserable wives, and of course the forests and their flora and fauna, there was so much in that novel. I even wrote a field guide to keep track.\nWhen I finished the novel Ginen, I still wanted to spend time in that world. I’d written another book called The Legend of Arrö-yo which was about a woman who could fly, a windseeker named Arrö-yo.\nYou see, I just write. I have stories and they are all connected and each story is more of the puzzle I’m putting together for myself. At some point, Zahrah came to me. She was a young girl who was nothing like Arrö-yo, except that she, too, was a windseeker. Arrö-yo was from earth but Zahrah was from Ginen. And Zahrah lived near a really wild forest. I knew she had to go in there. The story practically wrote itself.\nMy subsequent novel, The Shadow Speaker, eventually ends up in Ginen, too... albeit in a different part.\nWhat did writing Zahrah the Windseeker teach you about the craft that helped with writing The Shadow Speaker?\nThat‘s hard to say because I wrote two novels in-between Zahrah the Windseeker and The Shadow Speaker. I think each novel that I write helps me hone my craft that much more. I will say that writing Zahrah the Windseeker taught me how to write in first person. I originally wrote it in third. My editors asked me to change it to first. I’m always up for a challenge, so I said, sure. After I did Zahrah, I developed a taste for the first person narrative. The Shadow Speaker is in third but my forthcoming adult novel, Who Fears Death, is in first. That is a direct result of the work I did on Zahrah the Windseeker.\nWhat is the appeal of a near future earth ravaged by bioterrorism? What does a somewhat apocalyptic setting let you do as a writer that a more normal, present-day earth wouldn’t?\nI love the idea of the earth rebelling. I love the idea of human beings having no clue WTF is going on. I love the idea of the laws of physics going haywire. Human begins seek to control, they seek to be at the top of their self-created hierarchy, above all creatures. We’re arrogant as hell even though we don’t know what’s going on half the time.\nAlso, I have an obsession with chaos and destruction. Tornados, earthquakes, hurricanes, sudden, unexpected horrible change. Writing it is my way of facing it.\nThe post-apocalyptic world that Ejii lives in is my worst nightmare. There is little control or predictability. People can’t even predict the weather. The weather forecasts have to come with the reminder that it is N.I.U.F, “Not Including Unpredictable Factors.” In Ejii’s world, one must learn to move with the earth, by its rules to survive, as opposed to forcing the earth to conform to one’s own rules as we do today. This makes for a different kind of story and different kinds of characters.\nHow did you go about building the world(s) of Zahrah the Windseeker and The Shadow Speaker? How do you balance the exotic and the familiar? Invite the reader in so thoroughly? Your descriptions are utterly breath-taking!\nI see the world as an exotic place. Just last week, I was walking through campus when I saw a giant grasshopper sitting on the wall. I’m a professor at Chicago State University, a university smack dab in the south side of Chicago. So this was an “urban grasshopper,” I guess. My urge was to stop and catch it and examine it. See how it behaved. Feel the strength of its legs when it leapt from my hand. Look at it up close and note every design on its body. This is a creature that we see all the time but when you look at it, really look at it, you see its exotic beauty. I still maintain a sense of wonder when I look around me, I guess. I’ve been like this since I was a kid. I tap into this when I write and describe things. I’m drawing from observations I’ve made of things in real life.\nYou’ve spent much of your life in the Chicago area. What does Chicago mean to you as an artist? In what ways does it feed your creativity?\nI was born in Cincinnati, Ohio but I have lived in the suburbs of Chicago since I was about six. Living in the suburbs of Chicago gave me lots of space and a lot of empty weed-filled lots to explore. It’s in these empty lots, forest preserves and nature centers that I cultivated my love for flora and fauna.\nAlso in these suburbs I experienced a lot of extremely blatant racism. In the 80s of South Holland, Illinois it was like the 60s. My family was one of the first black family to move into that neighborhood. Thank goodness I was a fast runner. I learned early what it was to save my own ass from the bad guys. Then when we moved to Olympia Fields, Illinois, it flipped to experiencing discrimination from black Americans for being African and for “acting white.”\nI was a sort of outcast in multiple communities. So I grew up with little interest in “fitting in.” I just did my thing. And I’m still doing that.\nYour protagonists Ejii and Zahrah are certainly different characters in different novels, but in their heart-of-hearts, what do they share? How are they similar?\nThey’re both really brave girls. With Zahrah, you see her go into that forbidden forest. She cries and sulks and flees from things, etc, but I remember thinking as I wrote her story that I could never do what she did. Have you ever been in a forest at night? Imagine it. Deep in an enormous really wild forest, away from civilization, alone, seeking out something terrible as opposed to running from it. This girl chooses to do this on her own. That’s totally insane! I love it.\nEjii is a bit more hardcore than Zahrah. I especially learned this when I wrote the early scene where she gets in a fist fight with her cousin (who was a boy about her age). This was not an innocent fight. It was absolutely vicious. And in getting into it, Ejii was throwing off all the cultural baggage that normally should have stopped her from doing such a thing. She eventually, by her own choice, goes out into a dangerous environment- in this case a post-apocalyptic Sahara Desert. She, too, possesses a deep deep courage.\nAs you mention above, you are always up for a challenge and you embrace spontaneity and weirdness as a writer. What does “courage” mean in terms of writing, of being a writer. Or, put a little differently, what would you/do you tell your creative writing students about courage and writing?\nIf it scares you to write it, then you should definitely write it. My forthcoming novel Who Fears Death is full of moments and situations that I wanted to pull back from or skip over. I didn’t want to look at certain issues, practices or situations. But I knew that if I was feeling that way then that’s where the good stuff was, so I faced it. When I wrote these parts, I was plagued with nightmares, felt depressed, etc, it was pretty awful. But after having the courage to face what scared me, I was able to produce a work that went beyond my usual type of writing. Now I have to face the fear of my mother reading it but that’s another story, ha ha.\nAnd, lastly, what is just beyond the horizon for you?\nAs it says at the very beginning of Erykah Badu’s “New Amerykah Part One” album, “More action. More excitement. More everything.” I’m just getting started.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/okorafor_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: If It Scares You, Write It: A Conversation with Nnedi Okorafor by Jeremy L. C. Jones"}