{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Peter M Ferenczi", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5/vBTtP/+KicwvJixrfpuTw6zeE=", "id": null, "license": null, "comments": "", "raw_text": "4920 words, short story  The Womb Factory  Mei stood, hand on her swollen belly. Her stomach rumbled with the hunger that woke her each morning. Four steps took her and her burden to the window, which slid up scant centimeters before hitting bolts ensuring it went no further. The opening allowed air into the room, but no girl, not even Nuan with her misshapen skull, could have fit her head through the slot. The nets to discourage jumping, installed when the industrial park was a city unto itself and the window bolts hadn’t yet been added, hung in tatters at the first story.  Mei put her face sideways to the opening. The breeze that morning carried the chemical tang of Shantou away from her, and the air smelled relatively pure.  The bell for first breakfast, second group, rang in the corridor, and Mei heard the bustle of girls emerging from their rooms though her thin door. Eight short steps took her into the line shuffling in slippers towards the eating room at the end of the hall.  The attendant, in her white uniform with the brown stain Mei had noticed a week ago, stood at the door. As the girls filed by, she touched the front edge of a tablet against their bellies. In most cases, the tablet chirped. The attendant would fish around a multi-pocketed pack at her thick waist and wordlessly hand over a small plastic disk.  Mei accepted the press of the tablet against the bulge under her smock with downcast eyes. Nothing good came of antagonizing the attendants, she’d quickly learned. The tablet chirped, corresponding with the thing inside her.  When she’d first arrived, before they put the egg inside her, the tablet had been silent, and the attendant had given her a white disk. This morning she got a purple one. It had been red at dinner the night before.  She entered the room, with its light green peeling paint, the single long table and bench seats. She took her disk to a low window in one wall and slid it across the counter there. A hand snatched it and a tray emerged with a purple bowl full of the usual gelatinous substance, something that tasted vaguely like congee. It came with a spoon and a cup of weak tea.  Mei took her breakfast and moved toward her end of the table, where the misfit girls clustered like a flock of awkward sheep. She sat next to chubby Fen Hua, who was attacking a bowl with her habitual total focus—she seemed to be the only girl whose body refused to relinquish its fat stores to the thing growing inside it. Crooked, simple Nuan mechanically spooned food into her mouth a little farther down, the occasional drop falling back into the bowl for recycling.  As Mei began to bury her hunger under the glop, a new girl sat down across from her. Mei had noticed that many new arrivals gravitated to her end of the table, perhaps sensing the lack of threat. Most graduated out to one clique or another soon after.  She looked very young, skinny in the shapeless gown they all wore. Her face was pale and her posture telegraphed fear.  Mei kept her gaze averted. She didn’t need to talk to the newcomer to know her story. She would be from a small village somewhere in the provinces surrounding Shantou. Her family would have faced privations, debts, deaths caused by flu and/or the domino fall of diseased crops.  A man would have appeared in the village, driving a clean truck. He would have had tea with the girl’s father or eldest brother and discussed something in low, urgent tones. And depending on the particulars of her family, her father or brother would have looked at her with calculating or desperate eyes. She would not likely see the sheaf of bills that passed from one hand to another. There would be a tearful parting, or not.  There were no tears when the man offered to take away the extra mouth that had befallen Mei’s uncle. She was the troublesome daughter of his city-living brother who’d died, along with his wife, during the flu season two years earlier.  “I will keep your share for you, for when you are finished,” he told her in farewell.  She knew he lied, but in her ignorance was cautiously excited to escape the resentfulness of his family, to make her own way. That feeling didn’t last long.  The new girl was still frozen in front of her bowl. Mei was halfway through her own.  “You should eat,” she said in a low voice, modulated to just carry over the murmur of conversation in the room. The attendants didn’t like a ruckus.  The girl didn’t seem to hear.  Mei nudged her slippered foot under the table. The girl’s vacant stare shifted up from the bowl. Mei pointedly shoved the western-style spoon into the mush and brought it to her mouth.  “Eat,” she said.  The girl hesitantly began to eat from her small, white bowl. It was the kind for newcomers and girls in their rest period, formulated to feed one, not two.  “It’s not so bad, see?”  She got no answer.  Back in her room, Mei settled herself in her chair. It was hard compared to the one in her old bedroom, but it was better than anything in her uncle’s small hut, with its thin mats on a packed earth floor. Sitting made her gravid state a little more bearable.  She turned on her tablet and listlessly flicked through the games. The attendants called the tablets a privilege, but Mei intuited that without them, the girls’ crushing boredom could become a problem for the operation.  In her case, the thing wasn’t much help anyway. She didn’t even bother with the video selection, mostly ridiculous state-approved soap operas. The games never changed. She settled on go and placed virtual stones on the board as the app’s limited AI tried to outwit her.  A car door slamming pulled her out of the game: comings and goings were rare for the derelict dorm complex. She went to her window and looked down at the cracked parking lot that fronted the building, sensed other girls in other rooms doing the same.  It was the bright orange Changfeng that appeared every two weeks or so. The usual young man, wearing dark augmented sunglasses and a leather jacket, carrying a small white and blue cooler. He trotted up to the entrance of the building, batting aside a skein of netting. Faintly, she heard him speaking into the intercom.  In the girls’ unchanging world, the young man’s arrival always inspired discussion—his appearance, his purpose, his eligibility. None had ever seen him closer than from their high windows in the otherwise empty building, but most had theories about his personality and his attitudes towards the princesses locked in their tower.  Mei didn’t follow their gossip. The man was an element of the factory, her enemy.  Her stomach was growling again when the bell rang for second breakfast. She knew it was the thing in her belly that absorbed all the energy, but she was the one who felt the hunger.  In the hallway, she found herself walking next to the new arrival, who surprised her by murmuring, “My name is Jia Li.”  “I’m Mei.”  They were scanned by the attendant, received their disks. Mei collected another large purple bowl, while Jia Li was given a white cup. They sat next to each other.  “It is too early for lunch,” observed Jia Li.  “There are six meals a day here. This is second breakfast,” said Mei.  Jia Li poked at the glop in the cup.  “We have not even started to work yet. Why so much food?” she asked.  Mei glanced at her.  “You don’t know what this place is.”  Jia Li stared at her cup.  “A factory.”  “A womb factory,” said Mei. From the silence, she guessed that the girl didn’t understand. “We make things inside us. Like babies, but not babies.”  Jia Li’s cup froze on the way to her mouth.  “Father said I was going to work in a factory,” she whispered.  “You are. But not with your hands.” Mei thought of the young man and his delivery. She was sure it was a new batch of eggs.  “Soon you will start. Don’t be afraid,” she said, thinking of her own terror when, ten weeks ago, the attendant had entered her room, shown her the white oblong shape and said, ‘Relax and this will be easier.’  “An attendant will put a small thing inside you. It doesn’t hurt. It will grow. In three months, the cycle will be finished, and you will rest for two weeks.” The girl would find out eventually that “rest” really meant “heal,” she thought.  “But . . . what . . . what are we making?” asked Jia Li.  “Have you heard of biobots?”  “What? No.”  “Well, it’s like a toy. But alive.”  Mei remembered the commercials she would see for something called a FurryBuddy while browsing on her tablet, when her parents were alive and the world still made sense. There was a boy, perhaps eight years old, sitting on a couch in a sunlit room. Next to him was a smaller creature, covered in golden fur, like a cross between a monkey and a dog. Its oversized brown eyes shone in a face covered with short hair. Plush-toy limbs, stubby fingers. The bottoms of its feet, visible as it sat on the couch with its legs too short to bend at the knee, had dog-like pads on them.  It held an old-fashioned book on its lap and told a story in its high-pitched voice. The child squealed with pleasure. In another scene the pair frolicked in a field. In another they walked along a sidewalk in a prosperous neighborhood, with the creature calling out in English the names of objects they passed.  She’d asked her father for one, and he’d smiled thinly.  “Those are too expensive for a professor’s salary,” he’d said. He’d ruffled her hair, as if trying to brush away her disappointment. “You’re better off using your imagination to make your dolls talk.”  Jia Li was speaking. “I don’t understand,” she said. “What is it?”  Fascinated by them, Mei had learned all that she could, even if she couldn’t own one.  “It is like an animal with a computer in its head,” she said. “It’s like a pet that talks. It plays games, teaches things, languages . . . ”  “But, how can we make a computer?”  “The computer, they put inside us. We grow the animal around it.”  Jia Li digested that.  “Then it goes to school to be a teacher?”  Mei pictured a classroom full of the furry creatures and couldn’t suppress a grim smile.  “No, the important stuff is already in its computer.”  Back in the room, playing games, waiting for the lunch bell. Her attention wandered, as it often did, back to the tablet itself. It looked just like the one the attendants had, but only ran a few programs, distractions for the girls. There was, of course, no Internet access, no way to get messages out. Not that most of the girls would make a stink even if they could—any trouble would quickly find their families, which might mean that they had nowhere to return to at the end of their two-year contract.  Mei didn’t care too much about that.  The tablet was tantalizingly similar to one she’d been issued in school. It, too, had been restricted to certain functions, but plenty of kids knew that pushing an unfolded paperclip through a small hole in the back of the device while holding down two buttons made the tablet ask for an unlock code: because the school had never changed it, it was “00000.” Then you could play all the games you wanted.  If Mei could unlock this tablet, she had imagined a thousand or more times, she could do something other than play games. Maybe she could reach out for help.  She was certain that the operation was illegal. Real biobots like FurryBuddies were made in fancy bioengineering factories by big companies, not by little groups of girls hidden in abandoned worker dormitories. But it must be cheaper to grow something almost as good in people, just like the phones made in illegal backcountry factories were almost as good as the ones made by the big brands.  The problem was that this tablet wasn’t quite like Mei’s old school-issued device: it had no pin hole in the back. She’d tried every possible combination of button presses, but all she’d managed to do was freeze the tablet a dozen times. If there was a workaround, it would be online—meaning it might as well be carved on the dark side of the moon.  She was trapped by the lack of some trivial thing, and that lack would cost her two years in this place.  A sudden fury uncoiled in her chest. Before she realized what she was doing, her hand swept the tablet off her lap. As it spun through the air, she was seized by a child’s terror. She was misbehaving, and she would be punished.  But by the time it clattered to a stop on the linoleum floor, she’d mastered the feeling. She was already in hell. Whatever this exercise of will cost her, she would pay it.  She tottered over to the dark tablet, stooped with a grunt, and picked it up. The casing flexed and she saw that the front and back halves had come loose in the impact. At least the screen wasn’t cracked.  She was about to try snapping the split halves back together when a thought froze her. There had been no hole for the paper clip. Now, there was a hole of a sort.  Gently, she pried the two halves further apart, until the back suddenly popped free. Inside was the usual green plastic with metallic traceries, a gray block that was likely the battery.  And right where the hole in the case of her school-issued tablet had been was a tiny white circle. She pressed on it with her finger nail and it clicked in. Release, and it popped back out. The paperclip switch.  The lunch bell rang.  Mei mechanically packed the food paste into her mouth, trying to speed up time. She hadn’t felt hope like this since . . . she blinked. Since before her parents got sick. Part of her tried to rein in that feeling, but it was impossible.  She looked up, and realized that Jia Li had asked her a question.  “What?” She didn’t mean to sound irritated, but knew she did. The other girl looked down.  “I was just wondering why we have to spend so much time alone. In our rooms,” she said softly.  “Oh. It has to do with the eggs. They can connect to things from inside us, like what happens with the tablet when the attendant checks you in for a meal. They keep us apart so that they don’t interfere with each other.” Mei had overheard this from girls who had been there longer, and it seemed believable as anything.  “It’s lonely,” said Jia Li.  “It’s better than having to deal with that lot,” said Mei, cutting her eyes toward the other end of the table.  “They aren’t nice?”  “Well, they can be pretty mean to Nuan there, or fat Fen Hua. And if you aren’t careful, they may decide they don’t like you, either,” said Mei, unable to keep the bitterness out of her voice.  “And you? Why don’t they like you?”  “Can’t you hear the city in my accent? They can, and that’s all the reason they need.”  But she knew that wasn’t all of it. The others seemed to accept that this place was their lot, that it was what their families needed of them. Sure, they had been scared, but for the most part they’d settled into it, made friends.  But Mei couldn’t. She could try to help Jia Li understand what was happening, but she couldn’t relax and make small talk about something else. In her mind, this was an ongoing violation, and pretending otherwise would be acquiescing to it. So the others mocked her city background, but she knew that was just shorthand for their resentment of her resentment.  Jia Li didn’t say anything for a while, and Mei half figured she’d decided against aligning herself with a pariah and was plotting her way into the safety of a clique. But she finally spoke.  “Well, they must be quite stupid.”  Mei couldn’t help but smile.  After the eternity of first lunch, the door was closed behind her again. She carefully took up the tablet, and lifted the back cover away. Pursing her lips, she held down the two buttons on the front and pressed the little circular switch.  The screen went blank. The China Telecom logo came up. And then a dialog for entering an unlock code.  Holding her breath, Mei touched the “0” key on the onscreen keyboard five times. The screen blanked for a moment, then came back . . . unchanged. The same request for a code. Failure.  A harsh bark of frustration escaped her throat and she stared unbelievingly at the screen. She had been sure. It had to work. And it had not.  I can guess it, she thought, it’s only five numbers . . . but she knew she couldn’t. After a few tries, the tablet would lock itself entirely, become useless.  Mei took a deep breath. There was a number. If it wasn’t random, she had a chance of figuring it out. But she was still clueless when the bell for second lunch rang.  First dinner. Second dinner. A night of twisting dreams and fragile sleep. She woke once to screams leaking from the delivery room: one of the girls in the chair. She briefly wondered who, then realized she didn’t care and drifted back into nightmares before the sounds stopped.  First breakfast. Second breakfast. First lunch. The bells, the bowls, newly unendurable.  I let myself hope, she thought. So much worse than not having hoped at all.  She was peripherally aware that Jia Li was sitting next to her. Had asked a question. She tapped Mei’s shoulder softly, which stirred memories of tentative taps during other recent meals. As then, Mei fixed her with a flat stare, wanted to say they could talk later, but speaking seemed far too difficult. She turned back to her food, and Jia Li remained silent.  “ . . .number . . . ”  The word landed on Mei’s mind like a leaf on water, drifting out of context. She shook herself alert. A conversation down the table. Two girls, part of the clique headed by Ai Bao. Mei’s concentration bored into their words, barely audible above the murmur of conversation in the room.  “He must have connections,” said the first girl.  “Or money.”  “Or both!”  “How much do you think a car like that costs?”  It sounded like gossip about the young man with the Changfeng. But could it be linked . . . ? She turned to the girls.  “Excuse me, what number were you just talking about?”  The pair turned and glared, and Mei realized that in her excitement she’d stepped out of place.  Ai Bao noticed.  “Hey city girl,” she said with quiet venom, “our business isn’t yours.”  Mei looked down, choking on her frustration, her heart hammering. In her peripheral vision, she saw Jia Li stand with her tray and walk down toward the other girls.  “Can I sit with you?” Mei heard her say. “I’m from Yangtouqui.” A village tiny enough that Mei had never heard of it.  “My cousin married a man from Bianshan, not far away,” said one of the girls.  “I know it, I have an aunt who lives there,” said Jia Li. “Who is he?”  Mei, now ignored by the other girls, stared at her bowl and struggled to keep back tears. She had been alone before, and now she was again. She should get used to it.  Meal times flashed by. She’d tried “12345” on the tablet but didn’t dare guess again.  She was getting green bowls now, meaning she was due within two weeks. She’d known despair when her parents died, but this was different, open-ended, extending to the horizons of her being.  It had been four days since her failure to guess the code when Jia Li again sat next to her at first breakfast.  “The number they spoke of is the license plate of the Changfeng that comes here,” she said. “It is a very auspicious number. They think he must have bribed someone, a lot, to have gotten it.”  The droning static of hopelessness in Mei’s mind was suddenly quiet.  “Do you know it?”  “They say it is A99988. Though they also say in a week, he should be back again.” With more eggs.  Mei looked at Jia Li, her face flushing as she realized how unfairly she had discounted the girl.  “Thank you. Thank you.”  “It woke you up. I guessed it was important. Why?”  Mei hesitated, not wanting to give hope and then take it away.  “It could be useful,” she said quietly. “I’ll tell you more when I can.”  Jia Li nodded. Mei noticed that her bowl was now blue, no longer white.  “The attendant came to you . . . ”  “Yes.”  “Are you . . . ?”  “I didn’t like it. But there are many things I don’t like,” said Jia Li. “Ai Bao, for example, is cruel. Her friends are frightened. But you are angry. That is better, for being here.”  “Maybe. But it’s hard.”  “I know.”  Back in her room, Mei keyed in 99988. The tablet’s start page flashed up, offering many more options than before. She shook with excitement, and felt an extra thrill as she saw the local and wide area connectivity icons at the top of the screen . . . but it began to waver as they remained transparent. No connection. Jiggering settings didn’t help.  She took a deep breath. She wouldn’t accept that her progress had been towards a dead end. She tried the browser, the various pre-installed messaging apps, but always ended up at the same error message: “No Internet connection found, please check settings and try again.”  She felt despair hovering around her, waiting for her to weaken so that it could retake her.  Almost idly, not allowing herself to consider the death of hope, she browsed through the rest of the newly available apps. Mostly, it was basic stuff—the usual calendar and note-taking kind of thing. But then she found an unusual subfolder.  Brightleaf Biomanagement.  She worked straight through the first night. The applications were configuration interfaces for biobots. At first they seemed impossibly complicated, but by poring over the help and scrutinizing the embedded tutorials, she built a rudimentary understanding. She became adept at identifying what she could ignore so she could focus on the relevant elements.  At first breakfast, Jia Li looked at her with concern.  “You seem tired . . . is it . . . ?”  Mei smiled, and Jia Li hesitantly smiled back.  “I’m tired, but it’s OK. It’s not that that’s keeping me awake. It’s . . . ”  She wanted to tell her everything, how she’d figured out that the tablets were linking to the biobots in the girls, fine tuning their development. How Mei could now interact with the thing inside her, could control some aspects of it. But with the attendants, the other girls, who knew what ears listening, she couldn’t. She shook her head.  “Insomnia. It’s just something that happens to me sometimes.”  The day seemed to move in fast-forward. She buried herself in the programming apps, and during meals her mind churned furiously over the latest setback, often finding a solution by the time she finished eating.  Jia Li sat next to her at each meal. The two exchanged brief smiles, but her new friend seemed otherwise content to let Mei focus inward, and she was grateful for it.  At second dinner, Mei noticed that Jia Li was among the last to arrive. She looked pale.  “Hey, are you OK?” she asked.  “I don’t feel too good.”  “If you’re really sick, you can tell the attendant,” said Mei. “But don’t bother her if you don’t need to, you know.”  Jia Li nodded. “I’ll see. Maybe.”  Mei turned to her food, let her mind drift back to programming problems.  That night she fell asleep while working with her tablet, and woke with a start in her chair. She rubbed her eyes, disoriented, with the vague sense that she’d heard something.  Then a girl’s scream echoed in the corridor. It froze her, sent her pulse racing. She heard the murmur of voices as well, receding, and sobbing. More screams, now muffled behind the delivery room door. She wondered whose turn it was, and the dinner table with its colored bowls flashed in her mind’s eye. She tried to visualize who had a yellow bowl, the last color. She couldn’t.  Mei didn’t realize she was looking for Jia Li until the door to the dining room closed. The last girls were getting their trays. Jia Li wasn’t among them. Nor was she further down the table. Mei craned her neck, just to be sure.  Maybe she overslept, since she had been sick. Maybe they let her stay in her room.  She looked up from her bowl to see Nuan staring at her from across the table. The shy, slow girl looked down, but Mei kept watching her, and after a few seconds she looked up again.  “The white truck came last night,” she said softly in her nasal voice.  “What?” There was a white truck that dropped off supplies sometimes, but Mei had never seen it come at night.  “At night, it takes girls,” said Nuan.  Mei felt ice run down her spine.  “What do you mean?”  “It hears the screaming, sometimes. It comes.”  Mei couldn’t speak. A bit farther down the table, Fen Hua had stopped chewing.  “Some girls get sick from the egg,” Fen Hua muttered to her bowl. “Makes bad problems. Screaming. They go. Nobody sees.”  Mei took a shuddering breath, then plunged her spoon back into her bowl. She forced her mind back to the programs, felt like she walked a tightrope over despair.  When her time came, it was bad. As she was led to the reclined chair with its stirrups, she was seized by an image of Jia Li writhing there in agony, her body rejecting the thing that had successfully taken hold in Mei’s womb.  Then the pain drove the image away, but it couldn’t dispel the sense of her body out of her control, enslaved to this creature that now wanted out and demanded her participation. And out it eventually came.  She kept her eyes squeezed shut as the attendant cut the cord. She heard its first mewling squeals, high pitched like a kitten’s. A morbid curiosity opened her eyes and she glimpsed it as the attendant carried it away, much smaller than a human baby, wriggling and pink and red.  It was bad. But it would have been so much worse without the knowledge that she’d made her mark on the little beast, that it was in a way her servant as well.  “Would you like to hear a story?” asked Doodles.  It had been a week since Karin’s mother had bought her the creature, in one of the little shops down on Canal. It was cute, but despite its soft, warm fur and the fact that it could speak, there was something about it that made her uncomfortable. Watching it daintily opening a pack of the dense, hard biscuits that it ate, the fact that they had to leave a bathroom door ajar because it couldn’t reach the knob, the bottle of antibacterial gel it fastidiously used next to the toilet . . . it was like having a pet that was also a house guest. Yet it seemed to have less personality than her cat Sandy—it was too chipper, too much like the annoying guide AIs that popped up alongside new apps to “help” you use them.  It wasn’t even a real FurryBuddy, though Karin didn’t have the heart to tell her mom that. It was glitchy, sometimes spouting garbled nonsense or freezing in place for a minute or more before popping back to life as if nothing had happened.  But sometimes the stories were fun. Weird fairy tales, or stuff about monsters and aliens. It was as if someone had just dumped the text of a bunch of old books into the thing’s memory—which was actually pretty likely, given its knock-off status, she thought. As it told the stories, its emphasis and pauses were sometimes off, its body language often out of sync, but not enough to ruin them.  “OK,” said Karin.  Doodles nodded, but it seemed to pause longer than usual before saying, “This story is in a Cantonese dialect. Would you like me to translate it into English?”  “Uh, sure.”  The creature smiled vacantly and swayed gently back and forth, a sign that Karin knew meant the computer in its head was chewing over something.  Then it stopped moving and looked at her. Karin had never seen the expression it wore before: flat, no hint of a smile, eyes hooded rather than brightly wide. It began to speak in an affectless voice, arms at its sides, staring straight at her.  “Hello. My name is Mei Feng. I made this toy. I did not want to. This is my story . . . ” Peter M. Ferenczi has written extensively about technology for national magazines and the web, sometimes as a cheerleader, sometimes as a catcaller and concerned citizen of the world. He writes speculative fiction in the hope that he may infect others with the bone-deep reading addiction that's plagued him since he resolved the alphabet into words. Born in California, he's drifted east, living in North Carolina, New York, England, and now France. Along the way he acquired a couple of degrees, a love of photography and a taste for travel. He lives in Paris with his wife.", "text": "4920 words, short story\nThe Womb Factory\nMei stood, hand on her swollen belly. Her stomach rumbled with the hunger that woke her each morning. Four steps took her and her burden to the window, which slid up scant centimeters before hitting bolts ensuring it went no further. The opening allowed air into the room, but no girl, not even Nuan with her misshapen skull, could have fit her head through the slot. The nets to discourage jumping, installed when the industrial park was a city unto itself and the window bolts hadn’t yet been added, hung in tatters at the first story.\nMei put her face sideways to the opening. The breeze that morning carried the chemical tang of Shantou away from her, and the air smelled relatively pure.\nThe bell for first breakfast, second group, rang in the corridor, and Mei heard the bustle of girls emerging from their rooms though her thin door. Eight short steps took her into the line shuffling in slippers towards the eating room at the end of the hall.\nThe attendant, in her white uniform with the brown stain Mei had noticed a week ago, stood at the door. As the girls filed by, she touched the front edge of a tablet against their bellies. In most cases, the tablet chirped. The attendant would fish around a multi-pocketed pack at her thick waist and wordlessly hand over a small plastic disk.\nMei accepted the press of the tablet against the bulge under her smock with downcast eyes. Nothing good came of antagonizing the attendants, she’d quickly learned. The tablet chirped, corresponding with the thing inside her.\nWhen she’d first arrived, before they put the egg inside her, the tablet had been silent, and the attendant had given her a white disk. This morning she got a purple one. It had been red at dinner the night before.\nShe entered the room, with its light green peeling paint, the single long table and bench seats. She took her disk to a low window in one wall and slid it across the counter there. A hand snatched it and a tray emerged with a purple bowl full of the usual gelatinous substance, something that tasted vaguely like congee. It came with a spoon and a cup of weak tea.\nMei took her breakfast and moved toward her end of the table, where the misfit girls clustered like a flock of awkward sheep. She sat next to chubby Fen Hua, who was attacking a bowl with her habitual total focus—she seemed to be the only girl whose body refused to relinquish its fat stores to the thing growing inside it. Crooked, simple Nuan mechanically spooned food into her mouth a little farther down, the occasional drop falling back into the bowl for recycling.\nAs Mei began to bury her hunger under the glop, a new girl sat down across from her. Mei had noticed that many new arrivals gravitated to her end of the table, perhaps sensing the lack of threat. Most graduated out to one clique or another soon after.\nShe looked very young, skinny in the shapeless gown they all wore. Her face was pale and her posture telegraphed fear.\nMei kept her gaze averted. She didn’t need to talk to the newcomer to know her story. She would be from a small village somewhere in the provinces surrounding Shantou. Her family would have faced privations, debts, deaths caused by flu and/or the domino fall of diseased crops.\nA man would have appeared in the village, driving a clean truck. He would have had tea with the girl’s father or eldest brother and discussed something in low, urgent tones. And depending on the particulars of her family, her father or brother would have looked at her with calculating or desperate eyes. She would not likely see the sheaf of bills that passed from one hand to another. There would be a tearful parting, or not.\nThere were no tears when the man offered to take away the extra mouth that had befallen Mei’s uncle. She was the troublesome daughter of his city-living brother who’d died, along with his wife, during the flu season two years earlier.\n“I will keep your share for you, for when you are finished,” he told her in farewell.\nShe knew he lied, but in her ignorance was cautiously excited to escape the resentfulness of his family, to make her own way. That feeling didn’t last long.\nThe new girl was still frozen in front of her bowl. Mei was halfway through her own.\n“You should eat,” she said in a low voice, modulated to just carry over the murmur of conversation in the room. The attendants didn’t like a ruckus.\nThe girl didn’t seem to hear.\nMei nudged her slippered foot under the table. The girl’s vacant stare shifted up from the bowl. Mei pointedly shoved the western-style spoon into the mush and brought it to her mouth.\n“Eat,” she said.\nThe girl hesitantly began to eat from her small, white bowl. It was the kind for newcomers and girls in their rest period, formulated to feed one, not two.\n“It’s not so bad, see?”\nShe got no answer.\nBack in her room, Mei settled herself in her chair. It was hard compared to the one in her old bedroom, but it was better than anything in her uncle’s small hut, with its thin mats on a packed earth floor. Sitting made her gravid state a little more bearable.\nShe turned on her tablet and listlessly flicked through the games. The attendants called the tablets a privilege, but Mei intuited that without them, the girls’ crushing boredom could become a problem for the operation.\nIn her case, the thing wasn’t much help anyway. She didn’t even bother with the video selection, mostly ridiculous state-approved soap operas. The games never changed. She settled on go and placed virtual stones on the board as the app’s limited AI tried to outwit her.\nA car door slamming pulled her out of the game: comings and goings were rare for the derelict dorm complex. She went to her window and looked down at the cracked parking lot that fronted the building, sensed other girls in other rooms doing the same.\nIt was the bright orange Changfeng that appeared every two weeks or so. The usual young man, wearing dark augmented sunglasses and a leather jacket, carrying a small white and blue cooler. He trotted up to the entrance of the building, batting aside a skein of netting. Faintly, she heard him speaking into the intercom.\nIn the girls’ unchanging world, the young man’s arrival always inspired discussion—his appearance, his purpose, his eligibility. None had ever seen him closer than from their high windows in the otherwise empty building, but most had theories about his personality and his attitudes towards the princesses locked in their tower.\nMei didn’t follow their gossip. The man was an element of the factory, her enemy.\nHer stomach was growling again when the bell rang for second breakfast. She knew it was the thing in her belly that absorbed all the energy, but she was the one who felt the hunger.\nIn the hallway, she found herself walking next to the new arrival, who surprised her by murmuring, “My name is Jia Li.”\n“I’m Mei.”\nThey were scanned by the attendant, received their disks. Mei collected another large purple bowl, while Jia Li was given a white cup. They sat next to each other.\n“It is too early for lunch,” observed Jia Li.\n“There are six meals a day here. This is second breakfast,” said Mei.\nJia Li poked at the glop in the cup.\n“We have not even started to work yet. Why so much food?” she asked.\nMei glanced at her.\n“You don’t know what this place is.”\nJia Li stared at her cup.\n“A factory.”\n“A womb factory,” said Mei. From the silence, she guessed that the girl didn’t understand. “We make things inside us. Like babies, but not babies.”\nJia Li’s cup froze on the way to her mouth.\n“Father said I was going to work in a factory,” she whispered.\n“You are. But not with your hands.” Mei thought of the young man and his delivery. She was sure it was a new batch of eggs.\n“Soon you will start. Don’t be afraid,” she said, thinking of her own terror when, ten weeks ago, the attendant had entered her room, shown her the white oblong shape and said, ‘Relax and this will be easier.’\n“An attendant will put a small thing inside you. It doesn’t hurt. It will grow. In three months, the cycle will be finished, and you will rest for two weeks.” The girl would find out eventually that “rest” really meant “heal,” she thought.\n“But . . . what . . . what are we making?” asked Jia Li.\n“Have you heard of biobots?”\n“What? No.”\n“Well, it’s like a toy. But alive.”\nMei remembered the commercials she would see for something called a FurryBuddy while browsing on her tablet, when her parents were alive and the world still made sense. There was a boy, perhaps eight years old, sitting on a couch in a sunlit room. Next to him was a smaller creature, covered in golden fur, like a cross between a monkey and a dog. Its oversized brown eyes shone in a face covered with short hair. Plush-toy limbs, stubby fingers. The bottoms of its feet, visible as it sat on the couch with its legs too short to bend at the knee, had dog-like pads on them.\nIt held an old-fashioned book on its lap and told a story in its high-pitched voice. The child squealed with pleasure. In another scene the pair frolicked in a field. In another they walked along a sidewalk in a prosperous neighborhood, with the creature calling out in English the names of objects they passed.\nShe’d asked her father for one, and he’d smiled thinly.\n“Those are too expensive for a professor’s salary,” he’d said. He’d ruffled her hair, as if trying to brush away her disappointment. “You’re better off using your imagination to make your dolls talk.”\nJia Li was speaking. “I don’t understand,” she said. “What is it?”\nFascinated by them, Mei had learned all that she could, even if she couldn’t own one.\n“It is like an animal with a computer in its head,” she said. “It’s like a pet that talks. It plays games, teaches things, languages . . . ”\n“But, how can we make a computer?”\n“The computer, they put inside us. We grow the animal around it.”\nJia Li digested that.\n“Then it goes to school to be a teacher?”\nMei pictured a classroom full of the furry creatures and couldn’t suppress a grim smile.\n“No, the important stuff is already in its computer.”\nBack in the room, playing games, waiting for the lunch bell. Her attention wandered, as it often did, back to the tablet itself. It looked just like the one the attendants had, but only ran a few programs, distractions for the girls. There was, of course, no Internet access, no way to get messages out. Not that most of the girls would make a stink even if they could—any trouble would quickly find their families, which might mean that they had nowhere to return to at the end of their two-year contract.\nMei didn’t care too much about that.\nThe tablet was tantalizingly similar to one she’d been issued in school. It, too, had been restricted to certain functions, but plenty of kids knew that pushing an unfolded paperclip through a small hole in the back of the device while holding down two buttons made the tablet ask for an unlock code: because the school had never changed it, it was “00000.” Then you could play all the games you wanted.\nIf Mei could unlock this tablet, she had imagined a thousand or more times, she could do something other than play games. Maybe she could reach out for help.\nShe was certain that the operation was illegal. Real biobots like FurryBuddies were made in fancy bioengineering factories by big companies, not by little groups of girls hidden in abandoned worker dormitories. But it must be cheaper to grow something almost as good in people, just like the phones made in illegal backcountry factories were almost as good as the ones made by the big brands.\nThe problem was that this tablet wasn’t quite like Mei’s old school-issued device: it had no pin hole in the back. She’d tried every possible combination of button presses, but all she’d managed to do was freeze the tablet a dozen times. If there was a workaround, it would be online—meaning it might as well be carved on the dark side of the moon.\nShe was trapped by the lack of some trivial thing, and that lack would cost her two years in this place.\nA sudden fury uncoiled in her chest. Before she realized what she was doing, her hand swept the tablet off her lap. As it spun through the air, she was seized by a child’s terror. She was misbehaving, and she would be punished.\nBut by the time it clattered to a stop on the linoleum floor, she’d mastered the feeling. She was already in hell. Whatever this exercise of will cost her, she would pay it.\nShe tottered over to the dark tablet, stooped with a grunt, and picked it up. The casing flexed and she saw that the front and back halves had come loose in the impact. At least the screen wasn’t cracked.\nShe was about to try snapping the split halves back together when a thought froze her. There had been no hole for the paper clip. Now, there was a hole of a sort.\nGently, she pried the two halves further apart, until the back suddenly popped free. Inside was the usual green plastic with metallic traceries, a gray block that was likely the battery.\nAnd right where the hole in the case of her school-issued tablet had been was a tiny white circle. She pressed on it with her finger nail and it clicked in. Release, and it popped back out. The paperclip switch.\nThe lunch bell rang.\nMei mechanically packed the food paste into her mouth, trying to speed up time. She hadn’t felt hope like this since . . . she blinked. Since before her parents got sick. Part of her tried to rein in that feeling, but it was impossible.\nShe looked up, and realized that Jia Li had asked her a question.\n“What?” She didn’t mean to sound irritated, but knew she did. The other girl looked down.\n“I was just wondering why we have to spend so much time alone. In our rooms,” she said softly.\n“Oh. It has to do with the eggs. They can connect to things from inside us, like what happens with the tablet when the attendant checks you in for a meal. They keep us apart so that they don’t interfere with each other.” Mei had overheard this from girls who had been there longer, and it seemed believable as anything.\n“It’s lonely,” said Jia Li.\n“It’s better than having to deal with that lot,” said Mei, cutting her eyes toward the other end of the table.\n“They aren’t nice?”\n“Well, they can be pretty mean to Nuan there, or fat Fen Hua. And if you aren’t careful, they may decide they don’t like you, either,” said Mei, unable to keep the bitterness out of her voice.\n“And you? Why don’t they like you?”\n“Can’t you hear the city in my accent? They can, and that’s all the reason they need.”\nBut she knew that wasn’t all of it. The others seemed to accept that this place was their lot, that it was what their families needed of them. Sure, they had been scared, but for the most part they’d settled into it, made friends.\nBut Mei couldn’t. She could try to help Jia Li understand what was happening, but she couldn’t relax and make small talk about something else. In her mind, this was an ongoing violation, and pretending otherwise would be acquiescing to it. So the others mocked her city background, but she knew that was just shorthand for their resentment of her resentment.\nJia Li didn’t say anything for a while, and Mei half figured she’d decided against aligning herself with a pariah and was plotting her way into the safety of a clique. But she finally spoke.\n“Well, they must be quite stupid.”\nMei couldn’t help but smile.\nAfter the eternity of first lunch, the door was closed behind her again. She carefully took up the tablet, and lifted the back cover away. Pursing her lips, she held down the two buttons on the front and pressed the little circular switch.\nThe screen went blank. The China Telecom logo came up. And then a dialog for entering an unlock code.\nHolding her breath, Mei touched the “0” key on the onscreen keyboard five times. The screen blanked for a moment, then came back . . . unchanged. The same request for a code. Failure.\nA harsh bark of frustration escaped her throat and she stared unbelievingly at the screen. She had been sure. It had to work. And it had not.\nI can guess it, she thought, it’s only five numbers . . . but she knew she couldn’t. After a few tries, the tablet would lock itself entirely, become useless.\nMei took a deep breath. There was a number. If it wasn’t random, she had a chance of figuring it out. But she was still clueless when the bell for second lunch rang.\nFirst dinner. Second dinner. A night of twisting dreams and fragile sleep. She woke once to screams leaking from the delivery room: one of the girls in the chair. She briefly wondered who, then realized she didn’t care and drifted back into nightmares before the sounds stopped.\nFirst breakfast. Second breakfast. First lunch. The bells, the bowls, newly unendurable.\nI let myself hope, she thought. So much worse than not having hoped at all.\nShe was peripherally aware that Jia Li was sitting next to her. Had asked a question. She tapped Mei’s shoulder softly, which stirred memories of tentative taps during other recent meals. As then, Mei fixed her with a flat stare, wanted to say they could talk later, but speaking seemed far too difficult. She turned back to her food, and Jia Li remained silent.\n“ . . .number . . . ”\nThe word landed on Mei’s mind like a leaf on water, drifting out of context. She shook herself alert. A conversation down the table. Two girls, part of the clique headed by Ai Bao. Mei’s concentration bored into their words, barely audible above the murmur of conversation in the room.\n“He must have connections,” said the first girl.\n“Or money.”\n“Or both!”\n“How much do you think a car like that costs?”\nIt sounded like gossip about the young man with the Changfeng. But could it be linked . . . ? She turned to the girls.\n“Excuse me, what number were you just talking about?”\nThe pair turned and glared, and Mei realized that in her excitement she’d stepped out of place.\nAi Bao noticed.\n“Hey city girl,” she said with quiet venom, “our business isn’t yours.”\nMei looked down, choking on her frustration, her heart hammering. In her peripheral vision, she saw Jia Li stand with her tray and walk down toward the other girls.\n“Can I sit with you?” Mei heard her say. “I’m from Yangtouqui.” A village tiny enough that Mei had never heard of it.\n“My cousin married a man from Bianshan, not far away,” said one of the girls.\n“I know it, I have an aunt who lives there,” said Jia Li. “Who is he?”\nMei, now ignored by the other girls, stared at her bowl and struggled to keep back tears. She had been alone before, and now she was again. She should get used to it.\nMeal times flashed by. She’d tried “12345” on the tablet but didn’t dare guess again.\nShe was getting green bowls now, meaning she was due within two weeks. She’d known despair when her parents died, but this was different, open-ended, extending to the horizons of her being.\nIt had been four days since her failure to guess the code when Jia Li again sat next to her at first breakfast.\n“The number they spoke of is the license plate of the Changfeng that comes here,” she said. “It is a very auspicious number. They think he must have bribed someone, a lot, to have gotten it.”\nThe droning static of hopelessness in Mei’s mind was suddenly quiet.\n“Do you know it?”\n“They say it is A99988. Though they also say in a week, he should be back again.” With more eggs.\nMei looked at Jia Li, her face flushing as she realized how unfairly she had discounted the girl.\n“Thank you. Thank you.”\n“It woke you up. I guessed it was important. Why?”\nMei hesitated, not wanting to give hope and then take it away.\n“It could be useful,” she said quietly. “I’ll tell you more when I can.”\nJia Li nodded. Mei noticed that her bowl was now blue, no longer white.\n“The attendant came to you . . . ”\n“Yes.”\n“Are you . . . ?”\n“I didn’t like it. But there are many things I don’t like,” said Jia Li. “Ai Bao, for example, is cruel. Her friends are frightened. But you are angry. That is better, for being here.”\n“Maybe. But it’s hard.”\n“I know.”\nBack in her room, Mei keyed in 99988. The tablet’s start page flashed up, offering many more options than before. She shook with excitement, and felt an extra thrill as she saw the local and wide area connectivity icons at the top of the screen . . . but it began to waver as they remained transparent. No connection. Jiggering settings didn’t help.\nShe took a deep breath. She wouldn’t accept that her progress had been towards a dead end. She tried the browser, the various pre-installed messaging apps, but always ended up at the same error message: “No Internet connection found, please check settings and try again.”\nShe felt despair hovering around her, waiting for her to weaken so that it could retake her.\nAlmost idly, not allowing herself to consider the death of hope, she browsed through the rest of the newly available apps. Mostly, it was basic stuff—the usual calendar and note-taking kind of thing. But then she found an unusual subfolder.\nBrightleaf Biomanagement.\nShe worked straight through the first night. The applications were configuration interfaces for biobots. At first they seemed impossibly complicated, but by poring over the help and scrutinizing the embedded tutorials, she built a rudimentary understanding. She became adept at identifying what she could ignore so she could focus on the relevant elements.\nAt first breakfast, Jia Li looked at her with concern.\n“You seem tired . . . is it . . . ?”\nMei smiled, and Jia Li hesitantly smiled back.\n“I’m tired, but it’s OK. It’s not that that’s keeping me awake. It’s . . . ”\nShe wanted to tell her everything, how she’d figured out that the tablets were linking to the biobots in the girls, fine tuning their development. How Mei could now interact with the thing inside her, could control some aspects of it. But with the attendants, the other girls, who knew what ears listening, she couldn’t. She shook her head.\n“Insomnia. It’s just something that happens to me sometimes.”\nThe day seemed to move in fast-forward. She buried herself in the programming apps, and during meals her mind churned furiously over the latest setback, often finding a solution by the time she finished eating.\nJia Li sat next to her at each meal. The two exchanged brief smiles, but her new friend seemed otherwise content to let Mei focus inward, and she was grateful for it.\nAt second dinner, Mei noticed that Jia Li was among the last to arrive. She looked pale.\n“Hey, are you OK?” she asked.\n“I don’t feel too good.”\n“If you’re really sick, you can tell the attendant,” said Mei. “But don’t bother her if you don’t need to, you know.”\nJia Li nodded. “I’ll see. Maybe.”\nMei turned to her food, let her mind drift back to programming problems.\nThat night she fell asleep while working with her tablet, and woke with a start in her chair. She rubbed her eyes, disoriented, with the vague sense that she’d heard something.\nThen a girl’s scream echoed in the corridor. It froze her, sent her pulse racing. She heard the murmur of voices as well, receding, and sobbing. More screams, now muffled behind the delivery room door. She wondered whose turn it was, and the dinner table with its colored bowls flashed in her mind’s eye. She tried to visualize who had a yellow bowl, the last color. She couldn’t.\nMei didn’t realize she was looking for Jia Li until the door to the dining room closed. The last girls were getting their trays. Jia Li wasn’t among them. Nor was she further down the table. Mei craned her neck, just to be sure.\nMaybe she overslept, since she had been sick. Maybe they let her stay in her room.\nShe looked up from her bowl to see Nuan staring at her from across the table. The shy, slow girl looked down, but Mei kept watching her, and after a few seconds she looked up again.\n“The white truck came last night,” she said softly in her nasal voice.\n“What?” There was a white truck that dropped off supplies sometimes, but Mei had never seen it come at night.\n“At night, it takes girls,” said Nuan.\nMei felt ice run down her spine.\n“What do you mean?”\n“It hears the screaming, sometimes. It comes.”\nMei couldn’t speak. A bit farther down the table, Fen Hua had stopped chewing.\n“Some girls get sick from the egg,” Fen Hua muttered to her bowl. “Makes bad problems. Screaming. They go. Nobody sees.”\nMei took a shuddering breath, then plunged her spoon back into her bowl. She forced her mind back to the programs, felt like she walked a tightrope over despair.\nWhen her time came, it was bad. As she was led to the reclined chair with its stirrups, she was seized by an image of Jia Li writhing there in agony, her body rejecting the thing that had successfully taken hold in Mei’s womb.\nThen the pain drove the image away, but it couldn’t dispel the sense of her body out of her control, enslaved to this creature that now wanted out and demanded her participation. And out it eventually came.\nShe kept her eyes squeezed shut as the attendant cut the cord. She heard its first mewling squeals, high pitched like a kitten’s. A morbid curiosity opened her eyes and she glimpsed it as the attendant carried it away, much smaller than a human baby, wriggling and pink and red.\nIt was bad. But it would have been so much worse without the knowledge that she’d made her mark on the little beast, that it was in a way her servant as well.\n“Would you like to hear a story?” asked Doodles.\nIt had been a week since Karin’s mother had bought her the creature, in one of the little shops down on Canal. It was cute, but despite its soft, warm fur and the fact that it could speak, there was something about it that made her uncomfortable. Watching it daintily opening a pack of the dense, hard biscuits that it ate, the fact that they had to leave a bathroom door ajar because it couldn’t reach the knob, the bottle of antibacterial gel it fastidiously used next to the toilet . . . it was like having a pet that was also a house guest. Yet it seemed to have less personality than her cat Sandy—it was too chipper, too much like the annoying guide AIs that popped up alongside new apps to “help” you use them.\nIt wasn’t even a real FurryBuddy, though Karin didn’t have the heart to tell her mom that. It was glitchy, sometimes spouting garbled nonsense or freezing in place for a minute or more before popping back to life as if nothing had happened.\nBut sometimes the stories were fun. Weird fairy tales, or stuff about monsters and aliens. It was as if someone had just dumped the text of a bunch of old books into the thing’s memory—which was actually pretty likely, given its knock-off status, she thought. As it told the stories, its emphasis and pauses were sometimes off, its body language often out of sync, but not enough to ruin them.\n“OK,” said Karin.\nDoodles nodded, but it seemed to pause longer than usual before saying, “This story is in a Cantonese dialect. Would you like me to translate it into English?”\n“Uh, sure.”\nThe creature smiled vacantly and swayed gently back and forth, a sign that Karin knew meant the computer in its head was chewing over something.\nThen it stopped moving and looked at her. Karin had never seen the expression it wore before: flat, no hint of a smile, eyes hooded rather than brightly wide. It began to speak in an affectless voice, arms at its sides, staring straight at her.\n“Hello. My name is Mei Feng. I made this toy. I did not want to. This is my story . . . ”\nPeter M. Ferenczi has written extensively about technology for national magazines and the web, sometimes as a cheerleader, sometimes as a catcaller and concerned citizen of the world.\nHe writes speculative fiction in the hope that he may infect others with the bone-deep reading addiction that's plagued him since he resolved the alphabet into words.\nBorn in California, he's drifted east, living in North Carolina, New York, England, and now France. Along the way he acquired a couple of degrees, a love of photography and a taste for travel. He lives in Paris with his wife.", "source": "https://clarkesworldmagazine.com/ferenczi_04_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Womb Factory by Peter M. Ferenczi"}