{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kristin Mandigma", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "PErgiMt1N4KkCDcINTpH3tpGxbY=", "id": null, "license": null, "comments": "", "raw_text": "1150 words, short story  Excerpt from a Letter by a Social-realist Aswang  I apologize for this late reply. Our mail service has been erratic recently due to a spate of troublesome security-related issues. I don’t think I need to elaborate. You must have read the latest reports. These government spooks are hopelessly incompetent but they (very) occasionally evince flashes of human-like logic. I expect it will only take them a matter of time before they figure it out, with or without their torturous diagrams, at which point I may have to seriously consider the advisability of having one of our supporters open another German bank account. As a diversion, if nothing else, and I have had nothing entertaining to watch on cable television (which I believe has also been bugged because it persists in showing me nothing but Disney) for a while. Just between the two of us—I do believe that if fatuous, single-minded politicians were not an irrevocable fact of life, like having to use the toilet, we would have to invent them.  Now, to your letter. I confess to having read it with some consternation. I am well acquainted with your penchant for morbid humor and yet the suggestion that I might write a short “piece” for a speculative fiction magazine struck me as more perverse than usual. What on earth is speculative fiction anyway? I believe you are referring to one of those ridiculous publications which traffic in sensationalizing the human imagination while actually claiming to enrich it by virtue of setting it loose from the moorings of elitist literary fiction? Or whatever? And by elitist substitute “realist,” I suppose. You argue that speculative fiction is merely a convenient “ideologically neutral” term to describe a certain grouping of popular genre fiction, but then follow it up with a defensive polemic on its revolutionary significance with regard to encapsulating the “popular” Filipino experience. To which I ask: As opposed to what?  I believe, Comrade, that you are conflating ideology with bourgeois hair-splitting. When it comes down to it, how is this novel you sent along with your letter, this novel about an interstellar war between monster cockroaches and alienated capitalist soldiers, supposed to be a valid form of social commentary? I do not care if the main character is a Filipino infantryman. I assume he is capitalist, too. Furthermore, since he is far too busy killing cockroaches in godforsaken planets on a spaceship (which is definitely not a respectable proletarian occupation), his insights into the future of Marxist revolution in the Philippines must be suspect, at best. And this Robert Heinlein fellow you mention, I assume, is another imperialist Westerner? I thought so. Comrade, I must admit to being troubled by your choice of reading fare these days. And do not think you can fob me off with claims that your favorite novel at the moment is written by a socialist author. I do not trust socialists. The only socialists I know are white-collar fascist trolls who watch too many Sylvester Stallone movies. Sellouts, the lot of them. Do not get me started on the kapre, they are all closet theists. An inevitable by-product of all that repulsive tobacco, I should say.  With regard to your question about how I perceive myself as an “Other,” let me make it clear that I am as fantastic to myself as rice. I do not waste time sitting around brooding about my mythic status and why the notion that I have lived for five hundred years ought to send me into a paroxysm of metaphysical Angst for the benefit of self-indulgent, overprivileged, cultural hegemonists who fancy themselves writers. So there are times in the month when half of me flies off to—as you put it so charmingly—eat babies. Well, I ask you, so what? For your information, I only eat babies whose parents are far too entrenched in the oppressive capitalist superstructure to expect them to be redeemed as good dialectical materialists. It is a legitimate form of population control, I dare say.  I think the real issue here is not my dietary habits but whether or not my being an aswang makes me any less of a Filipino and a communist. I think that being an aswang is a category of social difference—imposed by an external utilitarian authority—like sexuality and income bracket. Nobody conceives of being gay just as a literary trope. Do they? To put it in another way: I do not concieve of my biological constitution as a significant marker of my identity. Men, women, gays, aswang, talk show hosts, politicians, even these speculative fiction non-idealists you speak of—we are all subject to the evils of capitalism, class struggle, the eschatological workings of history, and the inevitability of socialist relations. In this scheme of things, whether or not one eats dried fish or (imperialist) babies for sustenance should be somewhat irrelevant.  I would also like to address in more depth your rather confused contention that the intellectual enlightenment of the Filipino masses lies not in “contemporary” (I presume you meant to say “outdated” but were too busy contradicting yourself) realistic literature, but in a new artistic imaginative “paradigm” (again, this unseemly bourgeois terminology!). As I have said, I would emphatically beg to differ. Being an aswang—not just the commodified subject, but the fetishistic object of this new literature you speak of—has not enlightened me in any way about the true nature of society, about modes of production, about historical progress. I am a nationalist not because I am an aswang, but despite of it. You only have to consider the example of those notorious Transylvanian vampires. No one would ever call them patriots, except insofar as they speak like Bela Lugosi.  Before I end this letter, I must add another caveat: my first reaction upon meeting Jose Rizal in Paris during the International Exposition was not to eat him, as malicious rumors would have you believe. In fact, we spoke cordially and had an extended conversation about Hegel in a cafe. I do think that he is just another overrated ilustrado poseur—brilliant, of course, but with a dangerous touch of the Trotskyite utopian about him. I prefer Bonifacio, for obvious reasons.  In closing, let me say, as Marx does, that “one has to leave philosophy aside.” You must inure yourself against these pernicious novels about cockroaches and spaceships (and did you mention dragons? all dragons are either Freudians or fascists) for they can only lead you to a totalizing anthropogenetic attitude towards the world. Concentrate on the real work that needs to be done, Comrade.  (For all that, let me thank you for the sweaters. I can only hope you did not buy them in that cursed cesspool of superexploitation, SM Shoemart. It is getting quite cold here in America, hivemind of evil, and it has been increasingly impractical for me to fly out without any sort of protective covering.)  Long live the Philippines! Long live the Revolution!  Kristin Mandigma lives in Manila, Philippines where she works as a research analyst. She also helps out with a small non-profit called Read Or Die (also known as First World Imperialists Please Send Books), which promotes literacy and literary awareness in the Philippines, and maintains a website on Filipino literature at http://libro.ph.", "text": "1150 words, short story\nExcerpt from a Letter by a Social-realist Aswang\nI apologize for this late reply. Our mail service has been erratic recently due to a spate of troublesome security-related issues. I don’t think I need to elaborate. You must have read the latest reports. These government spooks are hopelessly incompetent but they (very) occasionally evince flashes of human-like logic. I expect it will only take them a matter of time before they figure it out, with or without their torturous diagrams, at which point I may have to seriously consider the advisability of having one of our supporters open another German bank account. As a diversion, if nothing else, and I have had nothing entertaining to watch on cable television (which I believe has also been bugged because it persists in showing me nothing but Disney) for a while. Just between the two of us—I do believe that if fatuous, single-minded politicians were not an irrevocable fact of life, like having to use the toilet, we would have to invent them.\nNow, to your letter. I confess to having read it with some consternation. I am well acquainted with your penchant for morbid humor and yet the suggestion that I might write a short “piece” for a speculative fiction magazine struck me as more perverse than usual. What on earth is speculative fiction anyway? I believe you are referring to one of those ridiculous publications which traffic in sensationalizing the human imagination while actually claiming to enrich it by virtue of setting it loose from the moorings of elitist literary fiction? Or whatever? And by elitist substitute “realist,” I suppose. You argue that speculative fiction is merely a convenient “ideologically neutral” term to describe a certain grouping of popular genre fiction, but then follow it up with a defensive polemic on its revolutionary significance with regard to encapsulating the “popular” Filipino experience. To which I ask: As opposed to what?\nI believe, Comrade, that you are conflating ideology with bourgeois hair-splitting. When it comes down to it, how is this novel you sent along with your letter, this novel about an interstellar war between monster cockroaches and alienated capitalist soldiers, supposed to be a valid form of social commentary? I do not care if the main character is a Filipino infantryman. I assume he is capitalist, too. Furthermore, since he is far too busy killing cockroaches in godforsaken planets on a spaceship (which is definitely not a respectable proletarian occupation), his insights into the future of Marxist revolution in the Philippines must be suspect, at best. And this Robert Heinlein fellow you mention, I assume, is another imperialist Westerner? I thought so. Comrade, I must admit to being troubled by your choice of reading fare these days. And do not think you can fob me off with claims that your favorite novel at the moment is written by a socialist author. I do not trust socialists. The only socialists I know are white-collar fascist trolls who watch too many Sylvester Stallone movies. Sellouts, the lot of them. Do not get me started on the kapre, they are all closet theists. An inevitable by-product of all that repulsive tobacco, I should say.\nWith regard to your question about how I perceive myself as an “Other,” let me make it clear that I am as fantastic to myself as rice. I do not waste time sitting around brooding about my mythic status and why the notion that I have lived for five hundred years ought to send me into a paroxysm of metaphysical Angst for the benefit of self-indulgent, overprivileged, cultural hegemonists who fancy themselves writers. So there are times in the month when half of me flies off to—as you put it so charmingly—eat babies. Well, I ask you, so what? For your information, I only eat babies whose parents are far too entrenched in the oppressive capitalist superstructure to expect them to be redeemed as good dialectical materialists. It is a legitimate form of population control, I dare say.\nI think the real issue here is not my dietary habits but whether or not my being an aswang makes me any less of a Filipino and a communist. I think that being an aswang is a category of social difference—imposed by an external utilitarian authority—like sexuality and income bracket. Nobody conceives of being gay just as a literary trope. Do they? To put it in another way: I do not concieve of my biological constitution as a significant marker of my identity. Men, women, gays, aswang, talk show hosts, politicians, even these speculative fiction non-idealists you speak of—we are all subject to the evils of capitalism, class struggle, the eschatological workings of history, and the inevitability of socialist relations. In this scheme of things, whether or not one eats dried fish or (imperialist) babies for sustenance should be somewhat irrelevant.\nI would also like to address in more depth your rather confused contention that the intellectual enlightenment of the Filipino masses lies not in “contemporary” (I presume you meant to say “outdated” but were too busy contradicting yourself) realistic literature, but in a new artistic imaginative “paradigm” (again, this unseemly bourgeois terminology!). As I have said, I would emphatically beg to differ. Being an aswang—not just the commodified subject, but the fetishistic object of this new literature you speak of—has not enlightened me in any way about the true nature of society, about modes of production, about historical progress. I am a nationalist not because I am an aswang, but despite of it. You only have to consider the example of those notorious Transylvanian vampires. No one would ever call them patriots, except insofar as they speak like Bela Lugosi.\nBefore I end this letter, I must add another caveat: my first reaction upon meeting Jose Rizal in Paris during the International Exposition was not to eat him, as malicious rumors would have you believe. In fact, we spoke cordially and had an extended conversation about Hegel in a cafe. I do think that he is just another overrated ilustrado poseur—brilliant, of course, but with a dangerous touch of the Trotskyite utopian about him. I prefer Bonifacio, for obvious reasons.\nIn closing, let me say, as Marx does, that “one has to leave philosophy aside.” You must inure yourself against these pernicious novels about cockroaches and spaceships (and did you mention dragons? all dragons are either Freudians or fascists) for they can only lead you to a totalizing anthropogenetic attitude towards the world. Concentrate on the real work that needs to be done, Comrade.\n(For all that, let me thank you for the sweaters. I can only hope you did not buy them in that cursed cesspool of superexploitation, SM Shoemart. It is getting quite cold here in America, hivemind of evil, and it has been increasingly impractical for me to fly out without any sort of protective covering.)\nLong live the Philippines! Long live the Revolution!\nKristin Mandigma lives in Manila, Philippines where she works as a research analyst. She also helps out with a small non-profit called Read Or Die (also known as First World Imperialists Please Send Books), which promotes literacy and literary awareness in the Philippines, and maintains a website on Filipino literature at http://libro.ph.", "source": "https://clarkesworldmagazine.com/mandigma_10_07/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Excerpt from a Letter by a Social-realist Aswang by Kristin Mandigma"}