{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Susan Palwick", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "96EPekDP0e7jL88FcHLxkn39YOY=", "id": null, "license": null, "comments": "", "raw_text": "13040 words, novelette, REPRINT  Going After Bobo  I was the only one home when the GPS satellites finally came back online. It was already dark out by then, and it had been snowing all afternoon. I’d been sitting at the kitchen table with my algebra book, trying to concentrate on quadratic equations, and then the handheld beeped and lit up and the transmitter signal started blipping on the screen, and I looked at it and cursed and ran upstairs to double-check the signal position against my topo map. And then I cursed some more, and started throwing on warm clothing.  I’d spent five days staring at my handheld, praying that the screen would light up again, please, please, so I’d be able to see where Bobo was. The only time he’d even stayed away from home overnight, and it was when the satellites were out. Just my luck.  Or maybe David had planned it that way. Bobo had been missing since Monday, the day the satellites went down, and David had probably opened the door for him when I wasn’t looking, like always, and then given him an extra kick, gloating because he knew I wouldn’t be able to follow Bobo’s signal.  I hadn’t been too worried yet, on Monday. Bobo was gone when I got back from school, but I thought he’d come home for dinner, the way he always did. When he didn’t, I went outside and called him and checked in neighbors’ yards. I started to get scared when I couldn’t find him, but Mom said not to worry, Bobo would come back later, and even if he didn’t, he’d probably be okay even if he stayed out overnight.  But he wasn’t back for breakfast on Tuesday, either, and by that night I was frantic, especially since the satellites were still down and I had no idea where Bobo was and I couldn’t find him in any of the places where he usually hung out. Wednesday and Thursday and Friday were hell. I carried the handheld with me everyplace, waiting for it to light up again, hunched over it every second, even at school, while Johnny Schuster and Leon Flanking carried on in the background the way they always did. “Hey, Mike! Hey Michael—you know what we’re doing after school today? We’re driving down to Carson, Mike. Yeah, we’re going down to Carson City, and you know what we’re going to do down there? We’re going to—”  Usually I was pretty good at just ignoring them. I knew I couldn’t let them get to me, because that was what they wanted. They wanted me to fight them and get in trouble, and I couldn’t do that to Mom, not with so much trouble in the family already. I didn’t want her to know what Johnny and Leon were saying; I didn’t want her to have to think about Johnny and Leon at all, or why they were picking on me. Our families used to be friends, but that was a long time ago, before my father died and theirs went to jail. Johnny and Leon think it was all my father’s fault, as if their own dads couldn’t have said no, even if my dad was the one who came up with the idea. So they’re mean to me, because my father isn’t around anymore for them to blame.  It was harder to ignore them the week the satellites were down. Mom’s bosses were checking up on her a lot more, because their handhelds weren’t working either. We got calls at home every night to make sure she was really there, and when she was at work, somebody had to go with her if she even left the building. Just like the old days, before the handhelds. And God only knew what David was up to. I guess he was still going to his warehouse job, driving a forklift and moving boxes around, because his boss would have called the probation office if he hadn’t shown up. But he wasn’t coming home when he was supposed to, and every time he did come home, he and Mom had screaming fights, even worse than usual.  So I had five days of not knowing where Bobo was, while Johnny and Leon baited me at school and Mom and David yelled at each other at home. And then finally the satellites came back online on Friday. The GPS people had been talking about how they might have to knock the whole system out of orbit and put up another one—which would have been a mess—but finally some earthside keyboard jockey managed to fix whatever the hackers had done.  Which was great, except that down here in Reno it had been snowing for hours, and according to the GPS, I was going to have to climb 3,200 feet to reach Bobo. Mom came in just as I was stuffing some extra energy bars in my pack. I knew she wouldn’t want me going out, and I wasn’t up to fighting with her about it, so I’d been hoping the snow would delay her for a few hours, maybe even keep her down in Carson overnight. I should have known better. That’s what Mom’s new SUV was for: getting home, even in shitty weather.  She looked tired. She always looks tired after a shift.  “What are you doing?” she said, and looked over my shoulder at the handheld screen, and then at the topo map next to it. “Oh, Jesus, Mike. It’s on top of Peavine!”  I could smell her shampoo. She always smells like shampoo after a shift. I didn’t want to think about what she smells like before she showers to come home.  “He’s on top of Peavine,” I said. “Bobo’s on top of Peavine.”  Mom shook her head. “Honey—no. You can’t go up there.”  “Mom, he could be hurt! He could have a broken leg or something and not be able to move and just be lying there!” The signal hadn’t moved at all. If it had been lower down the mountain, I would have thought that maybe some family had taken Bobo in, but there still weren’t any houses that high. The top of Peavine was one of the few places the developers hadn’t gotten to yet.  “Sweetheart.” Mom’s voice was very quiet. “Michael, turn around. Come on. Turn around and look at me.”  I didn’t turn around. I stuffed a few more energy bars in my pack, and Mom put her hands on my shoulders and said, “Michael, he’s dead.”  I still kept my back to her. “You don’t know that!”  “He’s been gone for five days now, and the signal’s on top of Peavine. He has to be dead. A coyote got him and dragged him up there. He’s never gone that high by himself, has he?”  She was right. In the year he’d had the transmitter, Bobo had never gone anywhere much, certainly not anywhere far. He’d liked exploring the neighbors’ yards, and the strips of wild land between the developments, where there were voles and mice. And coyotes.  “So he decided to go exploring,” I said, and zipped my pack shut. “I have to go find out, anyway.”  “Michael, there’s nothing to find out. He’s dead. You know that.”  “I do not know that! I don’t know anything.” Except that David’s a piece of shit. I did turn around, then, because I wanted to see her face when I said, “He hasn’t been home since Monday, Mom, so how do I know what’s happened? I haven’t even seen him.”  I guess I was up to fighting, after all. It was an awful thing to say, because it would only remind her of what we were all trying to forget, but I was still happy when she looked away from me, sharply, with a hiss of indrawn breath. She didn’t curse me out, though, even though I deserved it. She didn’t even leave the room. Instead she looked back at me, after a minute, and put her hands on my shoulders again. “You can’t go out there. Not in this weather. It wouldn’t even be safe to take the SUV, or I’d drive you—”  “He could be lying hurt in the snow,” I said. “Or holed up somewhere, or—”  “Michael, he’s dead.” I didn’t answer. Mom squeezed my shoulders and said gently, “And even if he were alive, you couldn’t reach him in time. Not all that way; not in this weather. Not even in the SUV.”  “I just want to know,” I said. I looked right at her when I said it. I wasn’t saying it to be mean, this time. “I can’t stand not knowing.”  “You do know,” she said. She sounded very sad. “You just won’t let yourself know that you know.”  “Okay,” I told her, my throat tight. “I can’t stand not seeing, then. Is that better?”  She took her hands off my shoulders and sighed. “I’ll call Letty, but it’s not going to do any good. Is your brother home?”  “No,” I said. David should have been home an hour before that. I wondered if he even knew that the satellites were back up.  Mom frowned. “Do you know where he is?”  “Of course not,” I said. “Do you think I care? Call the sheriff’s office, if you want to know where he is.”  Mom gave me one of her patented warning looks. “Michael—”  “He let Bobo out,” I said. “You know he did. He did it on purpose, just like all the other times. Do you think I care where the fuck he is?”  “I’m going to go call Letty,” Mom said.  David hated Bobo the minute we got him. He was my tenth birthday present from Mom and Dad. The four of us went to the pet store to pick him out, but when David saw the kittens, he just wrinkled his nose and backed up a few feet. David was always doing things like that, trying to be cool by pretending he couldn’t stand the rest of us.  David and I used to be friends, when we were younger. We played catch and rode our bikes and dug around in the dirt pretending we were gold miners, and once David even pulled me out of the way of a rattlesnake, because I didn’t recognize the funny noise in the bushes and had gone to see what it was. I was six then, and David was ten. I’ll never forget how pale he was after he yanked me away from the rattling, how scared he looked when he yelled at me never, ever to do that again.  The four-year difference didn’t matter back then, except that it meant David knew a lot more than I did. But once he got into high school, David didn’t want anything to do with any of us, especially his little brother. And all of a sudden he didn’t seem so smart to me anymore, even though he thought he was smarter than shit.  I named my new kitten Bobcat, because he had that tawny coat and little tufts on his ears. His name got shortened to Bobo pretty quickly, though, and that’s what we always called him—everybody except David, who called him “Hairball.” By the time Dad died, Bobo was a really big cat: fifteen pounds, anyway, which was some comfort when David started “accidentally” letting Bobo out of the house. I figured he could hold his own against most other cats, maybe even against owls. I tried not to think about cars and coyotes, and people with guns.  He started going over the fence right away, but he was good about coming home. He always showed up for meals, even if sometimes he brought along his own dessert: dead grasshoppers, and mice and voles, and once a baby bird. Dr. Mills says that when cats bring you dead prey, it’s because they think you’re their kittens, and they’re trying to feed you.  Bobo was a good cat, but David kept letting him out, no matter how much I yelled at him about it. Mom tried to ground David a couple of times, but it didn’t work. David just laughed. He kept letting Bobo out, and Bobo kept going over the fence. It took me four months of allowance, plus Christmas and birthday money, to save up enough for the transmitter chip and the handheld. David laughed about that, too.  “He’s just a fucking cat, Mike. Jesus Christ, what are you spending all your money on that transmitter thing for?”  “So I can find him if he gets lost,” I said, my stomach clenching. Even then, I could hardly stand to talk to David.  “If he gets lost, so what? They have a million more cats at the pound.”  And you’d let them all out if you could, wouldn’t you? “They don’t have a million who are mine,” I said, and Mom looked up from chopping onions in the kitchen. It was one of her days off.  “David, leave him alone. You’re the one who should be paying for that transmitter, you know.” And they got into a huge fight, and David stomped out of the house and roared off in his rattletrap Jeep, and when all the dust had settled, Mom came and found me in my room. She sat down on the side of the bed and smoothed my hair back from my forehead, as if I was seven again instead of thirteen, and Bobo jumped down from where he’d been lying on my feet. He’d been licking the place where Dr. Mills had put the transmitter chip in his shoulder. Dr. Mills said that licking would help the wound heal, but that if Bobo started biting it, he’d have to wear one of those weird plastic collars that looks like a lampshade. I hadn’t seen him biting it yet, but I was keeping an eye on him. When Mom sat on the bed, he resettled himself under my desk lamp, where the light from the bulb warmed the wood, and went back to licking.  Bobo always liked warm places. Dr. Mills says all cats do.  Mom stroked my forehead, and watched Bobo for a little while, and then said, “Michael—sometimes you can know exactly where people are, and still not be able to protect them.” As if I didn’t know that. As if any of us had been able to protect Dad from his own stupidity, even though the pit bosses knew exactly where he was every time he dealt a hand.  I knew Mom was thinking about Dad, but there was no point talking about it. Dad was gone, and Bobo was right in front of me. “I’d keep him inside if I could, Mom! If David—”  “I know,” she said. “I know you would.” And then she gave me a quick kiss on the forehead and went downstairs again, and after a while, Bobo got off the desk and came back to lie on my feet. Watching him lick his shoulder, I wondered what it felt like to have a transmitter.  I’m the only one in the family who doesn’t know.  Letty’s Mom’s best friend; they’ve known each other since second grade. Letty works for the BLM, and they have really good topo maps, so she could tell me exactly where Bobo was: just inside the mouth of an abandoned mine.  “He could have crawled there to get out of the snow,” I said. The transmitter signal still hadn’t moved. Mom and Letty exchanged looks, and then Mom got up.  “I’m going upstairs now,” she said. “You two talk.”  “He could have,” I said.  “Oh, Michael,” Mom said. She started to say something else, but then she stopped. “Talk to Letty,” she said, and turned and left the room.  I listened to Mom’s footsteps going upstairs, and after a minute Letty said, “Mike, it’s not safe to go out there now. You know that, right? It wouldn’t be safe even in a truck. Not in this weather. And in the snow, you can know exactly where something is and still not be able to get at it.”  “I know,” I said. “Like that hiker last year. The one whose body they didn’t find until spring.” Except that the hiker hadn’t had a transmitter, so they hadn’t known where he was. It didn’t matter. For ten days after he went missing, the cops and the BLM had search teams and helicopters all over the mountain, and never mind the weather.  “Yes,” Letty said, very quietly. “Exactly.” She waited for me to say something, but I didn’t. “That guy was dying, you know. He was in a lot of pain all the time. His wife said later she thought maybe that was why he went out in a storm like that, while he could still go out at all.”  Letty stopped and waited again, and I kept my head down. “He went out in bad weather,” she said finally, “near dark. It’s snowing now, and you were getting ready to hike up the mountain when your mom got home at seven-thirty. Michael?”  “Bobo could still be alive,” I said fiercely. “It’s not like anybody else cares. It’s not like the state’s going to spend thousands of dollars on a search and rescue!”  “So you were thinking—what?” Letty said. “That you’d go up there and get everybody hysterical, and get a search going, and while they were at it, they’d bring Bobo back? Was that the plan?”  “No,” I said. I felt a little sick. I hadn’t thought about any of that. I hadn’t even thought about how I was going to get Bobo back down the mountain once I found him. “I just—I just wanted to get Bobo, that’s all. I thought I could go up there and it would be okay. I’ve hiked in snow before.”  “At night?” Letty asked. Then she sighed. “Mike, you know, a lot of people care about Bobo. Your mom cares, and I care, and Rich Mills cares. He was a sweet cat, and we know you love him. But we care about you, too.”  “I’m fine,” I told her. I wasn’t sitting in the mouth of a mine during a snowstorm. I wasn’t registered with the sheriff’s office.  “You wouldn’t be fine if you went up on Peavine tonight,” Letty said. “That’s the point. And even if Bobo’s still alive—and I don’t think he can be, Michael—you can’t help him if you’re frozen to death in a gully somewhere. Okay?”  I stared at the handheld, at the stationary signal. I thought about Bobo huddled in the mouth of the mine, getting colder and colder. He hated being cold. “Is it true that when you freeze to death,” I said, “you feel warm at the end?”  “That’s what I hear,” Letty said. “I don’t plan to test it.”  “I don’t either. That wasn’t what I meant.”  “Good. Don’t do anything stupid, Mike. Search and rescue might not be able to get you out of it.”  I felt like I was suffocating. “I was putting food in my pack. An entire box of energy bars. Ask Mom.”  Letty shrugged. “Energy bars won’t keep you from freezing.”  “I know that.”  “Good. And one more thing: don’t you pay any mind to those Schuster and Flanking kids. They’re slime.”  I jerked my head up. How did she know about that? She raised an eyebrow when she saw my face, and said, “People talk. Folks at my office have kids in your school. The bullies are slime, Michael, and everybody knows it. Don’t let them give you grief. Your mother’s a good person.”  “I know she is.” I wanted to ask Letty if she’d told Mom about Johnny and Leon, wanted to beg her not to tell Mom, but the way adults did things, that probably meant that telling Mom would be the first thing she’d do.  Letty nodded. “Good. Just ignore them, then.”  It was easy for her to say. She didn’t have to listen to them all the time. “That wasn’t why I was going out,” I told her. “I was going after Bobo.”  “I know you were,” Letty said. “I also know nothing’s simple.” She folded her topo map and stood up and said, “I’d better be getting on home, before the weather gets any worse. Tell your Mom I’ll talk to her tomorrow. And try to have a good weekend.” She ruffled my hair before she went, the way Mom had when Bobo got the chip. Letty hadn’t done that since I was little. I didn’t move. I just sat there, looking at the blip on the handheld.  After a while I went up to my room. David hadn’t come back yet, not that I cared, and Mom’s door was closed. I knew she was sleeping off the shift. I also knew she’d be out of bed and downstairs in two seconds if she heard David coming in or me going out. She’d hung the front and back doors with bells, brass things from Nepal or someplace she’d gotten at Pier One. You couldn’t go out or come in without making a racket, and you couldn’t take the bells off the door without making one, either. “You learn to sleep lightly when you have babies,” Mom told me once, as if either me or David had been babies for years. And our windows were old, and pretty noisy in their own right. And it was snowing harder.  So I just sat on my bed and stared out the window at the snow, trying not to think. My window faces east, away from Peavine, towards downtown. I couldn’t see the lights from the casinos because of the snow, but I knew they were there. After a while it stopped snowing, and a few stars came out between the clouds, and so did the neon: the blue and white stripes of the Peppermill, which stands apart from everything else, south of downtown, and the bright white of the Hilton a bit north of that—“the Mother ship,” Mom always calls it—and then, clustered downtown, the red of Circus Circus and the green of Harrah’s, which Mom calls Oz City, and the flashing purple of the Silverado, where Dad used to work.  Dad loved this view; he was so proud that we could look down on the city. He couldn’t stop crowing about it to all his friends. I remember when he brought George Flanking and Howard Schuster, Leon and Johnny’s dads, into my room so they could look out my window, too. So they could see “the panorama.” That was what Dad called it. We’d never been able to see anything from our old windows, except more trailers across the way. “I’m going to get us out of this box,” Dad said when we lived there. “We’re going to live in a real house, I swear we are.” And then we moved here, to a real house, and pretty soon that wasn’t big enough for him, either.  I shut my blinds and flopped down on my bed. Someplace a dog had started to bark, and then another joined in, and another and another, until the whole damn neighborhood was going nuts. And then I heard what must have set them off: the yipping howl of a coyote, trotting between houses looking for prey.  When we bought our house five years ago, the street ended a block from here, and that was where the mountain started. Winter mornings, sometimes, we’d see coyotes in our driveway. Now the developers have built another hundred houses up the street, with more subdivisions going up all the time: fancy houses, big, the kind we could never afford, the kind that made Dad’s eyes narrow, that made him spend hours hunched over his desk. The kind he talked about when he went out drinking with George and Howard, I guess. I don’t know who’s buying those big houses; casino and warehouse workers can’t afford places like that. Mom could, maybe, if she weren’t saving for nursing school. The only people I can think of who might live there are the ones who work for the development companies.  So we don’t get coyotes in our driveway anymore, but they’re still around. They travel in back of the houses, next to the six-foot fences people put around their yards. There’s still sagebrush between the subdivisions, and rabbits, and you can still follow those little strips of wildness to the really wild places, up on the mountain.  Coyotes are unbelievably smart, and they’ll eat anything if they have to, and it doesn’t bother them when people cut the land into pieces. They like it, because the boundaries between city and wilderness are where rodents live, and rodents are about coyotes’ favorite food, aside from cats. So when we cut things up for them, there are more edges where they can hunt. It doesn’t hurt that we’ve killed most of the wolves, who eat coyotes when they can, or that coyotes look so much like dogs. They can sneak in just about anyplace. Dr. Mills says there are coyotes living in New York City now, in Central Park. There are millions of them, all over the country.  Ranchers and farmers hate them because they’re so hard to kill, and because even if you kill them, there are always more. But I can’t hate them, not even for eating cats. They’re smart and they’re beautiful, and they’re just trying to get by, and as far as I can tell, they’re doing a better job of it than we are. They know how to work the system. That’s what Dad thought he was doing, but he wasn’t smart enough.  I lay there, listening to that coyote and to all the dogs, still trying not to think, but thinking anyway: about what a weird town this is, where you get casinos and coyotes both, where the developers are covering everything with new subdivisions, but there’s still a mountain where you can die. After a while it got quiet again, and I peeked out the window and saw more snow. A while after that I heard the bells jangling downstairs, and heard Mom’s feet hitting her bedroom floor and thudding down the stairs. When she and David started yelling at each other, I pulled my pillow over my head and finally managed to go to sleep.  It wasn’t snowing when I woke up on Saturday, but it looked like it might start again any minute. The transmitter signal still hadn’t moved, and when I thought about Bobo out there in the cold, I felt my own heart freezing in my chest. I heard voices from downstairs, and smelled coffee and bacon. Mom and David were both home, then. I threw on clothing and grabbed the handheld and ran down to the kitchen.  “Good morning,” Mom said, and handed me a plate of bacon and eggs. She was wearing sweats and looked pretty relaxed. David was wearing his bathrobe and scowling, but David always scowls. I wondered what he was doing up so early. “Any change on the screen, Mike?”  “No,” I said. I knew she didn’t think there ever would be, and I wondered why she’d asked. David’s face had gone from scowling to murderous, but that was all right, because I planned to be out the door as soon as possible.  “Okay,” Mom said. “We’re all going up there after breakfast.”  “We are?” I said.  “Your brother’s coming whether he wants to or not, and I asked Letty to come too. Rich Mills has to work this morning. Unless you’d rather not have all those people, honey.”  “It’s okay,” I said. So that’s what David was doing up. Mom was making him come as punishment, so he could see what he’d done, and Letty was coming because she had the maps, and maybe to help Mom keep me and David apart if we tried to kill each other. And Mom wouldn’t think it was important to have Dr. Mills there, because she didn’t think Bobo was still alive. I put down my plate and gulped down some coffee and said, “I’m going to go put the carrying case in the SUV.”  “You’re going to eat first,” Mom said. “Sit down.”  I sat. Driving up Peavine in the snow wasn’t exactly Mom’s idea of a day off; the least I could do was not give her any lip. David bit into his toast and said around a mouthful of bread, “I’m not going.”  That was fine with me, but I wasn’t going to say so in front of Mom. It was their fight. “You’re coming,” she told him. “And if Bobo’s still alive you’re paying the vet bills, and if he’s not, you’re buying your brother another cat. And if we get another cat you’ll damn well help us keep it in the house, or I’ll call the sheriff’s office myself and tell them to take you off probation and put you in jail, David, I swear to God I will!”  She would, too. Even David knew that much. He scowled up at her and said, “The cat didn’t want to stay in the house.”  “That’s not the issue,” Mom said, and I stuffed my face full of eggs to keep from screaming at David that he’d hated Bobo, that he’d wanted Bobo to die, and that I hoped he’d die, too: alone, in the cold.  I remembered one of the first times David had let Bobo out. Bobo didn’t have the transmitter yet, and I was in the backyard calling his name. Suddenly I saw something race over the fence and he ran up to me, mewing and mewing, his tail all puffy. I picked him up and carried him inside and he stayed on my lap, with his face stuck into my armpit like he was hiding, for half an hour, until finally he calmed down and stopped shaking and jumped down to get some food. I’d hoped that whatever had spooked him so badly would keep him from wanting to go out again, even if David opened all the doors and windows, but I guess he forgot how scared he’d been. “He didn’t want to freeze to death, either,” I said.  David pushed his chair back from the table and said, “Look, whatever happened to your fucking cat, it’s not my fault, and I’m not wasting my day off going up there.” He looked at Mom and said, “Do whatever you want: it doesn’t matter. I might as well be in prison already.”  “Bullshit,” Mom said. “If you go to prison, you’ll lose a lot more than a Saturday. Do you have any idea how lucky you are not to be there already? Especially after the stunts you’ve been pulling this week?” Nevada’s a zero-tolerance drug state, even for minors, so when David got caught driving stoned last year, with most of a lid of pot in the glove compartment of his Jeep, Mom had to use every connection she had to get him probation instead of jail. It would have been a “juvenile facility,” since David was still a few weeks short of eighteen, but Mom says her connections said that wouldn’t make much difference. Juvenile facilities are worse, if anything.  Mom didn’t say who her connections are, and I don’t want to know. Whoever they are, I figure they didn’t help David entirely out of the goodness of their hearts. I figure they were scared of what Mom could tell people about them, even if what she does is legal.  “I told you,” David said, “I’ve just been hanging out with some guys from work. You know: eating dinner, playing pool? I was in town.”  “Right,” Mom said. “And there’s no way anybody could check that with the satellites down, is there? That’s what you were counting on.”  David rolled his eyes. “What time did the damn GPS go back up last night? Six-thirty or something? We were still eating then. We were at that pizza place in the mall. Call the sheriff’s office and ask them, if you don’t believe me.” He jerked a thumb at my handheld and said, “How stupid do you think I am? I knew it could come back online any second. What, I’m going to take off for Mexico or something?”  Mom didn’t bother to answer. She and I were the smart ones in the family: David took after Dad. Anybody stupid enough to get caught with that much pot was stupid enough to do just about anything else, as far as I could tell, but the only time I’d even started to say anything like that, right after his arrest, David had just glared at me and said, “Yeah, well, if you’d had to look at what I had to look at, you’d smoke dope too, baby brother.”  As if I hadn’t wanted to look. As if I hadn’t kept trying to go outside. As if even now I didn’t keep imagining what it had looked like, a million different ways, enough to keep me awake, sometimes.  But even then, I knew that David had only said it to make me feel guilty. He knew just how to get at everybody. Now he gestured at the handheld again and said bitterly, “I can’t wipe my ass without those people knowing about it.”  He was needling Mom, because that’s what Dad had always said about dealing blackjack at the Silverado. The dealers were under surveillance all the time: from pit bosses, from hidden cameras. “You can’t get away from it,” Dad said. “It’s like working in a goddamn box, with the walls closing in on you.” But Dad chose his box, and so did David.  “That’s not the issue,” Mom told David again. “It’s more than staying in county limits, David. You’re supposed to come home straight after work. You know that.”  “So you’re my jailor now? Just like the casino was Dad’s and the Lyon County cops are—”  “Stop it,” Mom said, her voice icy. “I’m not your jailor. I’m the one who kept you out of jail. You agreed to the terms of the probation!”  “Like you agreed to all those terms when you decided to go down to Carson and play nurse?”  Mom was out of her chair then, and David was out of his, and they stood nose to nose, glaring at each other, and I knew that there was no way we were all going up on Peavine today, because they wouldn’t be able to sit in the same car even if David had wanted to go, even if I’d wanted him there. Nothing David says to Mom ever makes any real sense, but he knows exactly how to get to her. Sometimes he has to keep at it for a while, but Mom always snaps eventually, even if the same thing has happened a million times before. Just like Bobo being scared by something outside, and still going out again when David gave him the chance. David knows exactly how to get people to hurt themselves.  They were still eye to eye, like cats circling each other before a fight, when the doorbell rang. “I’ll get it,” I said. Maybe it was Letty, and I could warn her about what was happening before she came inside.  It was a cop. “Good morning, son,” he said. “I’m looking for David. That your brother?”  “Yeah,” I said, but my legs felt like wood, and I didn’t seem to be able to get out of the way.  “Don’t worry,” he said. “It’s just a routine drug test.”  That was supposed to happen on Fridays. So David had skipped his drug test, too. My stomach shriveled some more. “Will he have to go to jail?” I said. The house would be a lot quieter if David was in jail, but school would be worse. If David went to jail, he’d probably be in the same place as George Flanking and Howard Schuster, and I didn’t want to think too much about that.  The cop’s face softened. “No. Not if he’s clean. He’ll get a warning, that’s all.”  And then Mom, behind me, said, “Michael, let him in,” and my legs came alive and I got out of the doorway, fast, and the cop came in, tipping his hat to Mom.  “Morning, ma’am.” I wondered if Mom was remembering the last time the cops were at our house. I wondered if this cop was one of her connections. I wonder that about all kinds of people: my teachers and all the cops and storekeepers and Dr. Mills, even. I hate wondering it, but that’s another thing I can’t talk to Mom about. It would just hurt her. It would just make me like David, or like Aunt Tina, who hasn’t even talked to us since Mom started working down in Carson.  The fight Aunt Tina picked with Mom was as bad as any of David’s: worse, maybe, because she doesn’t even live with us. She wasn’t even here when Dad died. It was none of her business. “Oh, Sherry! How can you do that, of all things? With your boys the ages they are, after what their father did? How will be they be able to hold their heads up, knowing—”  “Knowing that their mother’s keeping a roof over their head? My secretarial job doesn’t pay enough, Tina, not by itself—and if you know what else I can do to earn a hundred thousand a year, go right ahead and tell me!”  It was perfectly legal, and it would let Mom earn enough money to go to nursing school at UNR and get a job none of us would have to be embarrassed about. That’s what she kept telling us. A year, she’d said, or two at the most. But it had already been two years, and she hadn’t saved enough to quit yet, because the hundred thousand didn’t include food or clothing or insurance, or all the tests Mom has to have to make sure she’s still healthy. She has drug tests, too. She gets more tests than David does, even though she’s not a criminal and never did anything wrong, and she has to pay for all of hers. And when she’s in Carson she can’t go into a casino or a bar by herself, and she can’t be seen in a restaurant with a man, and she has to be registered with the Lyon County Sheriff’s Office—because technically, she’s not in Carson at all. Her job’s not legal in big towns: not in Reno, not in Vegas, not even in lousy little Carson City, the most pathetic excuse for a state capitol you ever saw. Mom has to work right outside Carson, in Lyon County, which is still plenty close enough to be convenient for her connections.  It used to be that the women at Mom’s job couldn’t even leave the buildings where they work without somebody going with them, but now they have transmitters, instead. And it used to be that they had to work every day for three weeks, living at the job, and then get one week off, but some of them got together and lobbied to change that, because so many of them were single mothers, and they wanted to be able to go home to their kids at night. But they still can’t live in the same county where they work, which is why Mom has to commute between Reno and Carson. Highway 395’s the only way to get down there, and those thirty-five miles can get really bad in the winter. That’s why Mom had to buy the SUV. The SUV wasn’t included in the hundred thousand, either.  Mom doesn’t know that I know a lot of this. I’ve heard her and Letty talking about it, especially about all the tests. Letty’s afraid Mom’s going to get something horrible and die, but Mom keeps pooh-poohing her. “For heaven’s sake, Letty; it’s not like they don’t have to wear condoms!”  I got out of the cop’s way and tried not to think about him wearing a condom. It’s hard not to get really mad at Dad whenever I think things like that. It’s hard not to get even madder at David. He has it easier than Mom does, and it’s not fair. She’s not the criminal.  I followed the cop into the kitchen. Mom was chit-chatting about the weather and pouring him a cup of coffee; David was disappearing down the hall to the bathroom, carrying a little plastic cup. I looked at the drug kit, sitting on the table next to our half-eaten breakfasts. “Only takes two minutes,” the cop told me, “and then I’ll be out of here and leave you folks to your weekend. Ma’am, you mind if I take my jacket off?”  “Of course not,” she said, and he did, and when I saw the gun in its holster I took a step back, even though of course the cop would be wearing a gun, all cops wear guns. Nearly everybody around here owns guns anyway, except us. And Mom bit her lip and the cop stepped back too, away from me, raising his hands. He looked sad.  “Hey, hey, son, it’s all right. I’ll put the jacket back on.”  “You don’t have to,” I said, my face burning. “I’m going up to my room, anyway.” I wanted to get out of there before David came back out of the bathroom with his precious bodily fluids. I didn’t want to stand around and find out what the drug tests said. So I went upstairs, wondering if there was anybody in the entire fucking town who didn’t know everything about anything that had ever happened to us.  I flopped down on my bed again, waiting for the jangle of bells that would mean the cop had left. It came pretty quickly, and then there was another right after it, and I didn’t hear any yelling, so I figured everything was okay. The phone had rung, somewhere in there. One of David’s loser friends, maybe. Maybe he’d gone out. Maybe I wouldn’t have to deal with him today. I wanted to be out on the mountain, climbing up to Bobo, but I knew the SUV would get there more quickly than I could, even with the delay.  But when I went back downstairs, David was in the living room watching TV and Mom and Letty were sitting at the kitchen table, looking worried. I looked at Mom and she said, “Relax. Your brother’s clean.”  “Okay,” I said. She and Letty had probably been talking about me. “Are we leaving soon?”  Mom looked down at the table. “Michael, honey, I’m sorry. We can’t leave right away. I’m waiting for a call from the doctor.”  I squinted at her. “From the doctor?”  “I’m fine,” Mom said. “It’s nothing, really. She’s looking at some test results, that’s all, and I may need to take some antibiotics. But I don’t want to miss the call. We’ll go right after that, okay?”  “I’m going now,” I said. I thought they had to wear condoms. “He’s been up there since last night, Mom!”  Letty started to stand up. “Mike, I’ll drive you—”  “You don’t have to,” I said. Right then, as much as I wanted to reach Bobo quickly, I wanted to be alone even more. “You can catch up with me after the doctor calls. Stay and talk to Mom.” Stay and keep Mom and David out of each other’s hair, I meant, and maybe Letty knew that, because she nodded and sat back down.  “Okay. We’ll follow you as soon as we can. Be careful.”  “Don’t worry,” I said. “It’s not like you don’t know where I’m going.”  It felt good to be out, away from Mom and David, where I could finally breathe again. I cut over to the wild strip on the edge of our subdivision and started working my way up, past the new construction sites where the dump trucks and jackhammers were roaring away, even on Saturday, up to where all the signs say Bureau of Land Management and National Forest Service. The signs don’t mean much, because the Forest Service and the BLM can sell the land to developers anytime they want. Right now, though, the signs meant that I was on the edge of wildness stretching for miles, all the way to Tahoe.  When the construction noises faded, I started hearing the gunfire. Shooters come up on Peavine for target practice; you can always find rifle shells on the trails, and there are all kinds of abandoned cars and washing machines and refrigerators that people have hauled up here and shot into Swiss cheese. Sometimes the metal has so many holes you wonder how it holds its shape at all. “Redneck lace,” Dad used to call it—Dad who’d grown up in a trailer, and was so proud that he’d gotten us out of one: Dad who couldn’t stand being called a redneck, even though he came up on Peavine every weekend with George Schuster and Howard Flanking, so they could drink beer and shoot skeet.  After he died, I couldn’t come up on the mountain for a long time. But gunfire’s one of those things you can’t get away from here, any more than you can avoid new subdivisions, and Peavine’s the only place I can come to be alone, really alone. I can hike up here for hours and never see anybody else. The gunfire’s far away, and nearby are sagebrush and rabbits and hawks. In the summer you see lizards and snakes, and in the winter, in the snow, you see the fresh tracks of deer and antelope. I’ve seen prints that looked like mountain lion; I’ve seen prints that looked like dog, but were probably coyote.  I hiked hard, pushing myself, taking the steepest trails. It takes me three hours to get to the top of Peavine in good weather, and today I wanted the most direct route I could find. When you’re slogging up a fifteen percent grade in the snow, it’s harder to think about how miserable your cat would be, stuck up here in weather like this, and it’s harder to think about what you want to do to your brother for letting him out. It’s harder to think about who you know might be wearing condoms, or how condoms can break even when they’re used right. It’s harder to think about how angry you are that your mother’s connections don’t have to be tested before she is, to make sure she doesn’t catch anything.  Mom never lied to me. She wouldn’t say “some antibiotics” if she really meant “years of AIDS drugs.” She wouldn’t say it was nothing if she was scared she might be infected with something that could kill her. I was angry anyway, because nothing was fair.  So that fifteen percent grade was just what I needed. If Mom and Letty followed me, they’d be coming the easy way, up the road. They’d probably be angry if they couldn’t find me, but they’d also get to the mine before I did, and they’d be able to drive Bobo back down. I hadn’t been able to bring the carrying case with me, but I wouldn’t be able to get it back down the mountain with Bobo in it anyway, not by myself. I hoped Mom had remembered to put the carrying case in the SUV. I hoped Bobo would still be in any kind of shape to need the carrying case at all.  I’m sorry, I told him as I climbed. I’m sorry I didn’t come after you sooner. I’m sorry I couldn’t protect you from David. I’m sorry about whatever scared you. Bobo, please be alive. Please be okay.  After a while, it started to snow. I kept going. I was wearing my warmest thermals and I was covered in Gore-Tex, and I had enough food in the pack for three days. And if Mom and Letty drove up in the snow and couldn’t find me because I’d come back down, they’d really start freaking. So I headed on up, except that as soon as I could, I cut over to the road. I didn’t see any fresh tire marks, which meant they were still behind me. I tromped along, checking the GPS every once in a while to make sure the signal hadn’t moved, and then I heard a horn and turned around and saw headlights.  It was Dr. Mills. “Hey, Mike. I drove by your house when I got off work, and your mom said you’d headed up here.” I scrambled into his truck; he had the heater blasting, and it felt good. “I hope you don’t mind that your mom didn’t come. My old truck can take the wear better than that fancy Suburban she has, and there’s only so much room in here.”  There was still plenty of room in the front seat. I glanced back at the flatbed: Dr. Mills had brought a carrying case, but of course on the way down, we’d want to be able to have Bobo in front with us, where it was warm. The part about Mom could have meant just about anything, depending on whether it was his excuse or hers. If it was hers, she could have been hoping that Dr. Mills would run a male-bonding father-figure trip on me, or she could have still been waiting for the doctor to call, or she and Letty could have been trying to force David to stay in the house somehow. Or all of the above. If it was his—I didn’t want to think about what it meant for him to be saving wear on her SUV, or not wanting her in the truck at all. Dr. Mills is married. I didn’t want to think about him driving down to Carson.  So I looked at the handheld again. “He’s in an old mine up here,” I said.  “Mmm-hmmm. That’s what your mom told me. How long since he’s moved?”  “Not since the satellites came back up,” I said, and Dr. Mills nodded. He stayed quiet for a long time, and finally I said, “You think he’s dead, don’t you? That’s what Mom thinks.”  The snow was coming down harder now, the windshield wipers squeaking in a rhythm that kept trying to lull me to sleep. Dr. Mills could have told me he didn’t want to go on; he could have turned around. He didn’t do that. He knew I had to see as much as I could. “Michael,” he said finally, “I’ve been a vet for fifteen years, and I’ve seen plenty of miracles. Animals are amazing. But I have to tell you, I think it would take a miracle for Bobo not to be dead.”  “Okay,” I said, trying to keep my voice steady.  “With coyotes,” he said, “usually it’s quick. They break the necks of their prey, the same as cats do with birds and mice. So unless Bobo got away for a few minutes and then got caught again, he wouldn’t have suffered long.”  “Okay,” I said, and looked at my hands. I wondered how long it would take me to break David’s neck, and how much I could make him suffer while I did it. And then I thought, there goes David again, making me want to do something stupid, something that would only mean I was hurting myself.  It took us ten more minutes to get to the mine, and by then the snow was coming down so hard that we could hardly see a foot ahead of the truck. We got out and started walking towards where the mine should have been, snow stinging our faces. It was really cold. I couldn’t see anything but snow: no rocks, not even the scrubby pines that grow up here. And within about ten feet I realized that the mine entrance was completely buried, and that even if we’d been able to find it, we’d probably need to dig through five feet of snow to get to Bobo.  “Michael,” Dr. Mills yelled into my ear, over the wind. “Michael, I’m sorry. We have to go back.”  I tried to say, “I know,” but my voice wouldn’t work. I turned around and headed towards the truck, and when I was back inside it I started shivering, even when the heat was blasting again. I sat in the front seat, with the empty space between me and Dr. Mills where Bobo should have been, and shivered and hugged myself. Finally I said, “You get warm, just before you freeze to death. If the coyotes didn’t kill him—or if he went up on his own—”  “He’s not in pain,” Dr. Mills said. “That’s a cliché, isn’t it? But it’s true. Michael, wherever he is now, he doesn’t hurt. I can promise you that.” And then he started telling me about some poem called “The Heaven of Animals,” where the animals remain true to their natures. The predators still hunt and exult over their kill, and their prey rise up again every morning, perfectly renewed, joyously taking their proper part in the chase.  I guess it’s a nice idea, but all I could think about was Bobo, shivering, hiding his head under my arm because he was scared.  So we drove on down the mountain, and pretty soon the snow stopped coming down so hard, and when we got back down to the developments, there was hardly any snow at all. You could still hear the construction equipment, and gunfire far off. Maybe the target shooters had moved farther down to get away from the snow. Dr. Mills hadn’t said anything for a while, but when we started hearing the guns, he looked over at me.  Don’t, I thought. Don’t say it. Don’t say anything. Just take me home, Dr. Mills, please. Don’t say it.  “I never told you,” he said, very quietly, “how sorry I am about what happened to your dad.”  I stared straight ahead, thinking about Bobo, thinking about the hiker who’d died on Peavine. I wondered how long it would take the snow to melt.  When Bobo was a kitten, Dad used to dangle pieces of string for him. He always dangled them just high enough so Bobo couldn’t get at them, and he’d laugh and laugh, watching Bobo jump. “We’re going to enter this cat in the Olympics,” he said. “Look at him! He must’ve made three feet that time!”  Bobo had lots of toys he could play with anytime he wanted, balls and catnip mice and crumpled-up pieces of paper I’d toss on the floor for him. But the minute Dad dangled that string, he’d stop playing with the stuff he could catch and go after the thing he couldn’t have.  “Just like you,” Mom always told him, watching them. “Just like you, Bill, jumping at what you’ll never be able to get.”  “Aw, now, Sherry! Why can’t we have a Lexus? Why can’t we have one of those fancy home theaters, huh?”  I thought he was kidding. Maybe Mom did, too.  When Dr. Mills dropped me off at home, David was gone, which was a good thing, because I don’t know what I would have done if I’d had to look at him. Mom and Letty were still there. They tried to talk to me.  I didn’t want to talk. I went straight up to my room and took off all the Gore-Tex and went to bed. I didn’t want to think about what we didn’t need anymore: the toys and the litter box and Bobo’s food and water bowls. I knew I’d have to throw it all away. Mom had told David he had to get me another cat, but how could I get another cat? David would just let it out again. When I got into bed, I remembered that the handheld was still in my jacket pocket, and somehow that hurt more than anything else. I pulled my pillow over my head and turned my face to the wall. The pillow blocked out a lot, but I still heard the phone, and I still heard the jangling bells when Letty left, and I still heard them again when David came in. I couldn’t block out the sounds of him and Mom yelling at each other, no matter how hard I tried.  I got up and tried to do homework, but that just made me think about how I was going to have to go to school on Monday morning. I tried to read, but all the words seemed flat and tasteless, like week-old bread. So finally I just sat on my bed, staring out at the casinos. They looked so small from here, little boxes you could pick up and throw like dice. And then I heard a coyote, off in the other direction.  Being good is one of the smallest boxes there is: Mom knows that, and so do I, and so did Dad. Mom was the only one who never complained about it, but what did I know? Maybe she hated it as much as I did. I didn’t see how she could like it. Maybe she felt like Dad said he’d always felt, like the walls were closing in on her. “If I could just get outside,” he always told me. “Working in that damn casino, no daylight anywhere, all those people watching you all the time, you just want to go outside and take a walk, Mike, you know what I mean?”  After Dr. Mills drove me up to the mine, I knew what Dad meant. I sat there with the walls closing in on me, and I couldn’t breathe. I needed more room. I wanted to be outside with the coyotes, running around the outside of the boxes, invisible. Even if you try to watch a coyote to see what it’s doing, even if you try to track it, it will disappear on you. It will fade into the grass, into the sagebrush, into shadows. And you’ll know that wherever it is, it’s laughing.  Sunday was quiet. David stayed in front of the TV, and I finally got my homework done, and Mom cleaned the house, humming to herself while she worked. She had to be on antibiotics for ten days, and she couldn’t work until the infection was gone. “Ten-day vacation,” she told me cheerfully, but she didn’t get paid vacations any more than she got anything else. All it meant was ten days’ pay out of the nursing-school fund.  Once I asked her what would happen if the Lyon County sheriff’s office saw her transmitter signal outside the building where she works. What if they tracked it and found her in a bar, or in a casino, or in a restaurant with a man? Would she go to jail?  She’d shaken her head and said very gently, “No, honey, I’d just lose my job. And I’d never do that, because it would be stupid.” Because it would be like what Dad did, she meant. “Don’t worry.”  When I got up on Monday morning, my stomach hurt already. I hadn’t been able to sleep very well, because I kept thinking about Bobo buried in the snow. I kept wondering about what I hadn’t been able to see, worrying that maybe there’d been some way to save him and I hadn’t figured it out.  I couldn’t stand the idea of going to school. I couldn’t stand facing Johnny and Leon; I couldn’t stand the idea of going through all that and not being able to come home and have Bobo comfort me, curling up on my stomach the way he always did to get warm. I’d always been able to tell Bobo everything I couldn’t talk about to anybody else, and now he was gone.  But I had to go to school, so I wouldn’t upset Mom.  I had an algebra test first period. I knew the material; I could have done all the problems, but I couldn’t make my hands move. I just sat there and stared at the paper, and when Mrs. Ogilvy called time, I handed it in blank.  She looked at it, and both her eyebrows went up. “Michael?”  “I didn’t feel like it,” I said.  “You didn’t—Michael, are you sick? Do you want to go to the nurse?”  “No,” I said, and walked away, out into the hall, to my next class, which was English. We were talking about Julius Caesar. I sat against the back wall and fell asleep, and when the bell rang I got up and went to Biology, where we were dissecting frogs. Biology was always bad, because Johnny and Leon were in there. They grabbed the lab station next to mine, and whenever they thought they could get away with it they whispered, “Hey, Mike, know what we’re gonna do after school? Hey, Mike—we’re gonna drive down to Carson. We’re gonna drive down to Carson and fuck your mother!”  Donna Mauro, my lab partner, said, “They are such jerks.”  “Yeah,” I said, but I couldn’t even look at Donna, because I was too ashamed. I knew everybody in school knew what my mother did, but that didn’t mean I liked it when Johnny and Leon reminded them. I wondered if one of Donna’s parents worked for the BLM and had talked to Letty, but it could have been just about anybody.  I stared down at the frog. We were supposed to be looking for the heart. I pretended it was Johnny instead, and sliced off a leg. Then I pretended it was Leon, and sliced off the other leg.  Donna just watched me. “Um, Mike? What are you doing?”  “I thought I’d have frog legs for lunch,” I said. My voice sounded weird to me, tinny. “Want one?”  “Um—Mike, that’s cool, but we have to find the heart now.”  I handed her the scalpel. “Here. You find the heart.”  And then I turned and walked away.  It was really easy, actually. I just walked out of the room, like I had to go to the bathroom but had forgotten to ask permission. Behind me I could hear Mr. Favaro, our teacher, saying something, and Donna answering, but the voices didn’t really reach me. I felt like I was inside a bubble: I could see outside, but everything was muffled, and no one could get inside. They’d just bounce off.  It was wonderful.  I walked along the hall, and Mr. Favaro ran up behind me, gabbling something. I had to listen really carefully to make out what he was saying. It sounded like he was on the moon. “Mike? Michael? Is there something you need to tell me?”  I considered this. “No,” I said. If I’d been Leon or Johnny or one of the bad kids, Mr. Favaro probably would have yelled at me and told me to get back inside the room, now, but he was spooked because it was me acting this way. So he gabbled some more, and I ignored him, and finally he ran away in the other direction, towards the principal’s office.  I just walked out the door. My jacket was back in my locker, but it was pretty warm out, at least in the sun, and I wasn’t cold. The bubble kept me warm. I started walking down a gully that angled down past the football field. I could hear voices behind me; I didn’t stop to try to figure out what they were saying. But then a van pulled up alongside the gully, and people got out, and the voices started again. “Michael. Michael Michael Michael Michael Michael.”  “What?” I said. Ms. Dellafield was there, the principal, and Mr. Ambrose, the school nurse, and two guidance counselors whose names I could never remember. They all looked really scared. I blinked at them. “I just wanted to take a walk,” I said, but they were in a semicircle around me, pushing at the edges of the bubble, herding me towards the van. “You don’t have to do this,” I told them. “Really. I’m fine. I was just taking a walk.”  They didn’t listen. They kept herding me towards the van, and then I was inside it, and the door was closing.  They drove me back to school, and then they herded me into Mr. Ambrose’s office, and then Ms. Dellafield went to call Mom while Mr. Ambrose and the two guidance counselors stood there and watched me, like they were going to tackle me if I tried to move. “Why are you doing this?” I kept asking them. “I was just going for a walk.” It didn’t make any sense. I’d seen other kids walk out of classes: they’d never gotten this kind of attention. “I’ll go back to biology, okay? I’ll dissect my frog. You don’t have to call my mother!”  And at the same time I thought, thank God Mom’s home today. Thank God she’s not down in Carson, so that Ms. Dellafield doesn’t have to hear them say whatever they say when they answer the phone there, not that there’s any chance that Ms. Dellafield doesn’t know where Mom works, since everybody else knows it. But even all that didn’t bother me as much as usual, because the bubble was still basically holding. Mr. Ambrose and the guidance counselors kept asking me how I was, and I kept telling them I was fine, thank you, and how are all of you today? And they kept looking more and more worried, as if I’d answered them in another language, one where “fine” meant “my eyeballs are about to explode.” So I sat there feeling fine, if a little far away, and thinking, these people are really weird.  And finally, after about half an hour, I heard voices outside Mr. Ambrose’s office, and then the door opened and Mom came in. She was leaning on David. David had his arm around her, and he was really pale. It was the same way he’d looked after he pulled me away from the rattlesnake.  I squinted at him and said, “What are you doing here? What happened?”  “She called me,” David said. He sounded like he was choking. “At work. When they called her. So we could come over here together.”  I looked at Mom. She was crying, and then I got really scared. “What’s going on?” I said. “Mom, what’s wrong? Are you okay? Did something happen to Letty?” Maybe Mom had called Ms. Dellafield and said something had happened and they had to find me. But that wouldn’t explain the van and the guidance counselors, would it? If something had happened to Letty, wouldn’t Mom have driven over here to tell me herself?  Everybody just stared at me. Mom stopped crying, and wiped her eyes, and said very quietly, “Michael, the question is, are you okay?”  “I’m fine! Why does everybody keep asking me that? I was just going for a walk! Why doesn’t anybody believe me?”  And Mom started crying again and David shook his head and said, “Oh, you stupid—”  “David.” Ms. Dellafield sounded very tired. “Don’t.”  I felt like I was going crazy. “Would somebody please tell me what’s going on? I was just—”  “Michael,” Mom said, “that’s what your father said, too.”  I blinked. The room had gotten impossibly quiet, as if nobody else was even breathing. Mom said, “He said he was just going for a walk, and then he went out into the yard. Don’t you remember?”  I looked away from all of them, out the window. I didn’t remember that. I didn’t remember anything that had happened that day, before the shot. It didn’t matter: everyone else at school knew the story, and they’d remembered it for me. “I really was just going for a walk,” I said, and then, “I don’t even have a gun.”  Ms. Dellafield said I should take the rest of the day off, so Mom and David and I drove home together, in David’s jeep. When Ms. Dellafield called Mom at home, Mom had been too upset even to drive, so she’d called David and he’d left work and picked her up and driven her to school. He drove us all home, too. He drove really carefully. Once a squirrel ran into the road and David slowed down until it got out of his way. I’d never seen him drive like that before. And when we were walking into the house, Mom tripped, and David reached out to steady her.  The last time I’d seen Mom and David leaning on each other, they’d been coming in from the yard. I remembered that part. My ears had still been ringing, but Letty wouldn’t let me go, no matter how hard I fought. She’d been eating lunch with us when it happened. “Let me see,” I kept telling her, trying to break free. “Let me go out there! I want to see what happened!”  But Letty wouldn’t let go, because the first thing that happened after the shot was that Mom and David ran out into the yard, and David started screaming, and then Mom yelled at Letty, “Keep Michael inside! Don’t let him come out here!”  And they came back inside, and Mom called the police, and I kept saying, “I want to go see,” and David kept shaking his head and saying, “No you don’t, Michael, you don’t want to see this, you really don’t,” and Letty wouldn’t let go of me. And the cops came and asked everybody questions, and then Letty took me to her house, and by the time I got home, Mom and David had cleaned up the backyard, picked up all the little pieces of bone and brain, so that there was nothing left to see at all.  Dad was stupid. You can’t beat the house: anybody who’s ever been anywhere near a casino knows that. But he and George and Howard were trying. They’d worked out a system, the newspaper said; George or Howard, never both at once, would go in and play at Dad’s table, and Dad would touch a cheek or scratch an ear, always a different signal, so they’d know when to double their bets. And then when they won, they’d split the take with him. They tried to be smart. They didn’t do it very often, but it was often enough for the pit bosses and the cameras to catch on. And somehow, when Dad came home that day, he knew he’d been caught. He knew the walls were closing in.  George and Howard went to jail. I guess Dad knew he’d have to go there too. I guess he thought that was just too small a box.  Nobody said anything for a long time, after we got home from school. Mom started unloading the dishwasher, moving in little jerks like somebody in an old silent movie, and David sat down at the kitchen table, and I went to the fridge and got a drink of juice. And finally David said, “Why the hell did you do that?”  He didn’t sound angry, or like he was trying to piss me off. He just sounded lost. And I hadn’t been trying to do anything; I’d just been going for a walk, but I’d said that at least a million times by now and it was no good. Nobody believed me, or nobody cared. So instead I said, “Why did you keep letting Bobo out?”  And Mom, with her back to us, stopped moving; she stood there, holding a plate, looking down at the open dishwasher. And David said, “I don’t know.”  Mom turned and looked at him, then, and I looked at Mom. David never admitted there was anything he didn’t know. He stared down at the table and said, “You kept saying you wanted to go outside. You kept—you were fighting to go outside. The cat wanted to go out, Michael. He did.” He looked up, straight at me; his chin was trembling. “You didn’t even have to look at it. It wasn’t fair.”  His voice sounded much younger, then, and I flashed back on that day when he saved me from the rattlesnake, when we were still friends, and all of a sudden my bubble burst and I was back in the world, where it hurt to breathe, where the air against my skin felt like sandpaper. “So you wanted me to get my wish by having to look at Bobo?” I said. “Is that it? Like I wanted any of it to happen, you fuckhead? Like—”  “Shhhh,” Mom said, and came over and hugged me. “Shhhh. It’s all right now. It’s all right. I’m sorry. I’m sorry. David—”  “Forget it,” David said. “None of it matters anymore, anyway.”  “Yes it does,” Mom said. “David, I made you do too much. I—”  “I want to go for a walk now,” I said. I was going to scream if I couldn’t get outside; I was going to scream or break something. “Can we just go for a walk? All of us? You can watch me, okay? I promise not to do anything stupid. Please?”  Mom and David have gotten along a lot better since then. Letty and I talked about it, once. She said they’d probably been fighting so much because David was mad at Mom for making him help her in the yard when Dad died, and Mom felt guilty about it, and didn’t even know she did, and kept lashing out at him. And none of us were talking about anything, so it festered. Letty said that what I did at school that day was exactly what I needed to do to remind Mom and David how much they could still lose, to make them stop being mad at each other. And I told her I hadn’t been trying to do anything, and anyway I hadn’t even remembered what Dad had said before he went out into the yard. She said it didn’t matter. It was instinct, she said. She said people still have instincts, even when they live in boxes, and that we can’t ever lose them completely, not if we’re still alive at all. Look at Bobo, she told me. You got him from a pet store. He’d never even lived outside, but he still wanted to get out. He still knew he was supposed to be hunting mice.  In June, when the snow melted from the top of Peavine, I hiked back up to the mine. I’d been back on the mountain before that, of course, but I hadn’t gone up that high: maybe because I thought I wouldn’t be able to see anything yet, maybe because I was afraid I would. But that Saturday I woke up, and it was sunny and warm, and Mom and David were both at work, and I thought, okay. This is the day. I’ll go up there by myself, to see. To say goodbye.  All those months, the transmitter signal hadn’t moved.  So I hiked up, past the developments, through rocks and sagebrush, scattering basking lizards. I saw a few rabbits and a couple of hawks, and I heard gunfire, but I didn’t see any people.  When I got to the mine, I peered inside and couldn’t see anything. I’d brought a flashlight, but it’s dangerous to go inside abandoned mines. Even if it’s safe to breathe the air, even if you don’t get trapped, you don’t know what else might be in there with you. Snakes. Coyotes.  So I shone the flashlight inside and looked for anything that might have been a cat once. There were dirt and rocks, but I couldn’t even see anything that looked like bones. The handheld said this was the place, though, so I scrabbled around in the dirt a little bit, and played the flashlight over every surface the beam would reach, and finally, maybe two feet inside the mine, I saw something glinting in a crevice in the rock.  It was the chip: just the chip, a tiny little piece of silver circuitry, sitting there all by itself. Maybe there’d been bones too, for a while, and something had carried them off. Or maybe something had eaten Bobo and left a pile of scat here, with the chip in it, and everything had gone back into the ground except the chip. I don’t know. All I knew was that Bobo was gone, and I still missed him, and there wasn’t even anything that had been him to bring back with me.  I sat there and looked at the chip for a while, and then I put the handheld next to it. And then I went and sat on a rock outside the mine, in the sun.  It was pretty. There were wildflowers all over the place, and you could see for miles. And I sat there and thought, I could just leave. I could just walk away, walk in the other direction, clear to Tahoe, walk away from all the boxes. I don’t have a transmitter. Nobody would know where I was. I could walk as long as I wanted.  But there are boxes everywhere, aren’t there? Even at Tahoe, maybe especially at Tahoe, where all the rich people build their fancy houses. And if I walked away, Mom and David wouldn’t know where I was. They wouldn’t even have a transmitter signal. And I knew what that felt like. I remembered staring at the dark screen, when the satellites were offline. I remembered staring at it, and trying not to cry, and praying. Please, Bobo, come back home. Please come back, Bobo. I love you.  So I sat there for a while, looking out over the city. And then I ate an energy bar and drank some water, and headed back down the mountain, back home.    Originally published in Asimov’s Science Fiction Magazine, May 2000. Susan Palwick is an Associate Professor of English at the University of Nevada, Reno. She has published four novels, all with Tor--the most recent is 2013's Mending the Moon--and a story collection with Tachyon, The Fate of Mice. Her work has won the IAFA Crawford Award and the ALA Alex Award, and has been shortlisted for the World Fantasy and Mythopoeic Awards.", "text": "13040 words, novelette, REPRINT\nGoing After Bobo\nI was the only one home when the GPS satellites finally came back online. It was already dark out by then, and it had been snowing all afternoon. I’d been sitting at the kitchen table with my algebra book, trying to concentrate on quadratic equations, and then the handheld beeped and lit up and the transmitter signal started blipping on the screen, and I looked at it and cursed and ran upstairs to double-check the signal position against my topo map. And then I cursed some more, and started throwing on warm clothing.\nI’d spent five days staring at my handheld, praying that the screen would light up again, please, please, so I’d be able to see where Bobo was. The only time he’d even stayed away from home overnight, and it was when the satellites were out. Just my luck.\nOr maybe David had planned it that way. Bobo had been missing since Monday, the day the satellites went down, and David had probably opened the door for him when I wasn’t looking, like always, and then given him an extra kick, gloating because he knew I wouldn’t be able to follow Bobo’s signal.\nI hadn’t been too worried yet, on Monday. Bobo was gone when I got back from school, but I thought he’d come home for dinner, the way he always did. When he didn’t, I went outside and called him and checked in neighbors’ yards. I started to get scared when I couldn’t find him, but Mom said not to worry, Bobo would come back later, and even if he didn’t, he’d probably be okay even if he stayed out overnight.\nBut he wasn’t back for breakfast on Tuesday, either, and by that night I was frantic, especially since the satellites were still down and I had no idea where Bobo was and I couldn’t find him in any of the places where he usually hung out. Wednesday and Thursday and Friday were hell. I carried the handheld with me everyplace, waiting for it to light up again, hunched over it every second, even at school, while Johnny Schuster and Leon Flanking carried on in the background the way they always did. “Hey, Mike! Hey Michael—you know what we’re doing after school today? We’re driving down to Carson, Mike. Yeah, we’re going down to Carson City, and you know what we’re going to do down there? We’re going to—”\nUsually I was pretty good at just ignoring them. I knew I couldn’t let them get to me, because that was what they wanted. They wanted me to fight them and get in trouble, and I couldn’t do that to Mom, not with so much trouble in the family already. I didn’t want her to know what Johnny and Leon were saying; I didn’t want her to have to think about Johnny and Leon at all, or why they were picking on me. Our families used to be friends, but that was a long time ago, before my father died and theirs went to jail. Johnny and Leon think it was all my father’s fault, as if their own dads couldn’t have said no, even if my dad was the one who came up with the idea. So they’re mean to me, because my father isn’t around anymore for them to blame.\nIt was harder to ignore them the week the satellites were down. Mom’s bosses were checking up on her a lot more, because their handhelds weren’t working either. We got calls at home every night to make sure she was really there, and when she was at work, somebody had to go with her if she even left the building. Just like the old days, before the handhelds. And God only knew what David was up to. I guess he was still going to his warehouse job, driving a forklift and moving boxes around, because his boss would have called the probation office if he hadn’t shown up. But he wasn’t coming home when he was supposed to, and every time he did come home, he and Mom had screaming fights, even worse than usual.\nSo I had five days of not knowing where Bobo was, while Johnny and Leon baited me at school and Mom and David yelled at each other at home. And then finally the satellites came back online on Friday. The GPS people had been talking about how they might have to knock the whole system out of orbit and put up another one—which would have been a mess—but finally some earthside keyboard jockey managed to fix whatever the hackers had done.\nWhich was great, except that down here in Reno it had been snowing for hours, and according to the GPS, I was going to have to climb 3,200 feet to reach Bobo. Mom came in just as I was stuffing some extra energy bars in my pack. I knew she wouldn’t want me going out, and I wasn’t up to fighting with her about it, so I’d been hoping the snow would delay her for a few hours, maybe even keep her down in Carson overnight. I should have known better. That’s what Mom’s new SUV was for: getting home, even in shitty weather.\nShe looked tired. She always looks tired after a shift.\n“What are you doing?” she said, and looked over my shoulder at the handheld screen, and then at the topo map next to it. “Oh, Jesus, Mike. It’s on top of Peavine!”\nI could smell her shampoo. She always smells like shampoo after a shift. I didn’t want to think about what she smells like before she showers to come home.\n“He’s on top of Peavine,” I said. “Bobo’s on top of Peavine.”\nMom shook her head. “Honey—no. You can’t go up there.”\n“Mom, he could be hurt! He could have a broken leg or something and not be able to move and just be lying there!” The signal hadn’t moved at all. If it had been lower down the mountain, I would have thought that maybe some family had taken Bobo in, but there still weren’t any houses that high. The top of Peavine was one of the few places the developers hadn’t gotten to yet.\n“Sweetheart.” Mom’s voice was very quiet. “Michael, turn around. Come on. Turn around and look at me.”\nI didn’t turn around. I stuffed a few more energy bars in my pack, and Mom put her hands on my shoulders and said, “Michael, he’s dead.”\nI still kept my back to her. “You don’t know that!”\n“He’s been gone for five days now, and the signal’s on top of Peavine. He has to be dead. A coyote got him and dragged him up there. He’s never gone that high by himself, has he?”\nShe was right. In the year he’d had the transmitter, Bobo had never gone anywhere much, certainly not anywhere far. He’d liked exploring the neighbors’ yards, and the strips of wild land between the developments, where there were voles and mice. And coyotes.\n“So he decided to go exploring,” I said, and zipped my pack shut. “I have to go find out, anyway.”\n“Michael, there’s nothing to find out. He’s dead. You know that.”\n“I do not know that! I don’t know anything.” Except that David’s a piece of shit. I did turn around, then, because I wanted to see her face when I said, “He hasn’t been home since Monday, Mom, so how do I know what’s happened? I haven’t even seen him.”\nI guess I was up to fighting, after all. It was an awful thing to say, because it would only remind her of what we were all trying to forget, but I was still happy when she looked away from me, sharply, with a hiss of indrawn breath. She didn’t curse me out, though, even though I deserved it. She didn’t even leave the room. Instead she looked back at me, after a minute, and put her hands on my shoulders again. “You can’t go out there. Not in this weather. It wouldn’t even be safe to take the SUV, or I’d drive you—”\n“He could be lying hurt in the snow,” I said. “Or holed up somewhere, or—”\n“Michael, he’s dead.” I didn’t answer. Mom squeezed my shoulders and said gently, “And even if he were alive, you couldn’t reach him in time. Not all that way; not in this weather. Not even in the SUV.”\n“I just want to know,” I said. I looked right at her when I said it. I wasn’t saying it to be mean, this time. “I can’t stand not knowing.”\n“You do know,” she said. She sounded very sad. “You just won’t let yourself know that you know.”\n“Okay,” I told her, my throat tight. “I can’t stand not seeing, then. Is that better?”\nShe took her hands off my shoulders and sighed. “I’ll call Letty, but it’s not going to do any good. Is your brother home?”\n“No,” I said. David should have been home an hour before that. I wondered if he even knew that the satellites were back up.\nMom frowned. “Do you know where he is?”\n“Of course not,” I said. “Do you think I care? Call the sheriff’s office, if you want to know where he is.”\nMom gave me one of her patented warning looks. “Michael—”\n“He let Bobo out,” I said. “You know he did. He did it on purpose, just like all the other times. Do you think I care where the fuck he is?”\n“I’m going to go call Letty,” Mom said.\nDavid hated Bobo the minute we got him. He was my tenth birthday present from Mom and Dad. The four of us went to the pet store to pick him out, but when David saw the kittens, he just wrinkled his nose and backed up a few feet. David was always doing things like that, trying to be cool by pretending he couldn’t stand the rest of us.\nDavid and I used to be friends, when we were younger. We played catch and rode our bikes and dug around in the dirt pretending we were gold miners, and once David even pulled me out of the way of a rattlesnake, because I didn’t recognize the funny noise in the bushes and had gone to see what it was. I was six then, and David was ten. I’ll never forget how pale he was after he yanked me away from the rattling, how scared he looked when he yelled at me never, ever to do that again.\nThe four-year difference didn’t matter back then, except that it meant David knew a lot more than I did. But once he got into high school, David didn’t want anything to do with any of us, especially his little brother. And all of a sudden he didn’t seem so smart to me anymore, even though he thought he was smarter than shit.\nI named my new kitten Bobcat, because he had that tawny coat and little tufts on his ears. His name got shortened to Bobo pretty quickly, though, and that’s what we always called him—everybody except David, who called him “Hairball.” By the time Dad died, Bobo was a really big cat: fifteen pounds, anyway, which was some comfort when David started “accidentally” letting Bobo out of the house. I figured he could hold his own against most other cats, maybe even against owls. I tried not to think about cars and coyotes, and people with guns.\nHe started going over the fence right away, but he was good about coming home. He always showed up for meals, even if sometimes he brought along his own dessert: dead grasshoppers, and mice and voles, and once a baby bird. Dr. Mills says that when cats bring you dead prey, it’s because they think you’re their kittens, and they’re trying to feed you.\nBobo was a good cat, but David kept letting him out, no matter how much I yelled at him about it. Mom tried to ground David a couple of times, but it didn’t work. David just laughed. He kept letting Bobo out, and Bobo kept going over the fence. It took me four months of allowance, plus Christmas and birthday money, to save up enough for the transmitter chip and the handheld. David laughed about that, too.\n“He’s just a fucking cat, Mike. Jesus Christ, what are you spending all your money on that transmitter thing for?”\n“So I can find him if he gets lost,” I said, my stomach clenching. Even then, I could hardly stand to talk to David.\n“If he gets lost, so what? They have a million more cats at the pound.”\nAnd you’d let them all out if you could, wouldn’t you? “They don’t have a million who are mine,” I said, and Mom looked up from chopping onions in the kitchen. It was one of her days off.\n“David, leave him alone. You’re the one who should be paying for that transmitter, you know.” And they got into a huge fight, and David stomped out of the house and roared off in his rattletrap Jeep, and when all the dust had settled, Mom came and found me in my room. She sat down on the side of the bed and smoothed my hair back from my forehead, as if I was seven again instead of thirteen, and Bobo jumped down from where he’d been lying on my feet. He’d been licking the place where Dr. Mills had put the transmitter chip in his shoulder. Dr. Mills said that licking would help the wound heal, but that if Bobo started biting it, he’d have to wear one of those weird plastic collars that looks like a lampshade. I hadn’t seen him biting it yet, but I was keeping an eye on him. When Mom sat on the bed, he resettled himself under my desk lamp, where the light from the bulb warmed the wood, and went back to licking.\nBobo always liked warm places. Dr. Mills says all cats do.\nMom stroked my forehead, and watched Bobo for a little while, and then said, “Michael—sometimes you can know exactly where people are, and still not be able to protect them.” As if I didn’t know that. As if any of us had been able to protect Dad from his own stupidity, even though the pit bosses knew exactly where he was every time he dealt a hand.\nI knew Mom was thinking about Dad, but there was no point talking about it. Dad was gone, and Bobo was right in front of me. “I’d keep him inside if I could, Mom! If David—”\n“I know,” she said. “I know you would.” And then she gave me a quick kiss on the forehead and went downstairs again, and after a while, Bobo got off the desk and came back to lie on my feet. Watching him lick his shoulder, I wondered what it felt like to have a transmitter.\nI’m the only one in the family who doesn’t know.\nLetty’s Mom’s best friend; they’ve known each other since second grade. Letty works for the BLM, and they have really good topo maps, so she could tell me exactly where Bobo was: just inside the mouth of an abandoned mine.\n“He could have crawled there to get out of the snow,” I said. The transmitter signal still hadn’t moved. Mom and Letty exchanged looks, and then Mom got up.\n“I’m going upstairs now,” she said. “You two talk.”\n“He could have,” I said.\n“Oh, Michael,” Mom said. She started to say something else, but then she stopped. “Talk to Letty,” she said, and turned and left the room.\nI listened to Mom’s footsteps going upstairs, and after a minute Letty said, “Mike, it’s not safe to go out there now. You know that, right? It wouldn’t be safe even in a truck. Not in this weather. And in the snow, you can know exactly where something is and still not be able to get at it.”\n“I know,” I said. “Like that hiker last year. The one whose body they didn’t find until spring.” Except that the hiker hadn’t had a transmitter, so they hadn’t known where he was. It didn’t matter. For ten days after he went missing, the cops and the BLM had search teams and helicopters all over the mountain, and never mind the weather.\n“Yes,” Letty said, very quietly. “Exactly.” She waited for me to say something, but I didn’t. “That guy was dying, you know. He was in a lot of pain all the time. His wife said later she thought maybe that was why he went out in a storm like that, while he could still go out at all.”\nLetty stopped and waited again, and I kept my head down. “He went out in bad weather,” she said finally, “near dark. It’s snowing now, and you were getting ready to hike up the mountain when your mom got home at seven-thirty. Michael?”\n“Bobo could still be alive,” I said fiercely. “It’s not like anybody else cares. It’s not like the state’s going to spend thousands of dollars on a search and rescue!”\n“So you were thinking—what?” Letty said. “That you’d go up there and get everybody hysterical, and get a search going, and while they were at it, they’d bring Bobo back? Was that the plan?”\n“No,” I said. I felt a little sick. I hadn’t thought about any of that. I hadn’t even thought about how I was going to get Bobo back down the mountain once I found him. “I just—I just wanted to get Bobo, that’s all. I thought I could go up there and it would be okay. I’ve hiked in snow before.”\n“At night?” Letty asked. Then she sighed. “Mike, you know, a lot of people care about Bobo. Your mom cares, and I care, and Rich Mills cares. He was a sweet cat, and we know you love him. But we care about you, too.”\n“I’m fine,” I told her. I wasn’t sitting in the mouth of a mine during a snowstorm. I wasn’t registered with the sheriff’s office.\n“You wouldn’t be fine if you went up on Peavine tonight,” Letty said. “That’s the point. And even if Bobo’s still alive—and I don’t think he can be, Michael—you can’t help him if you’re frozen to death in a gully somewhere. Okay?”\nI stared at the handheld, at the stationary signal. I thought about Bobo huddled in the mouth of the mine, getting colder and colder. He hated being cold. “Is it true that when you freeze to death,” I said, “you feel warm at the end?”\n“That’s what I hear,” Letty said. “I don’t plan to test it.”\n“I don’t either. That wasn’t what I meant.”\n“Good. Don’t do anything stupid, Mike. Search and rescue might not be able to get you out of it.”\nI felt like I was suffocating. “I was putting food in my pack. An entire box of energy bars. Ask Mom.”\nLetty shrugged. “Energy bars won’t keep you from freezing.”\n“I know that.”\n“Good. And one more thing: don’t you pay any mind to those Schuster and Flanking kids. They’re slime.”\nI jerked my head up. How did she know about that? She raised an eyebrow when she saw my face, and said, “People talk. Folks at my office have kids in your school. The bullies are slime, Michael, and everybody knows it. Don’t let them give you grief. Your mother’s a good person.”\n“I know she is.” I wanted to ask Letty if she’d told Mom about Johnny and Leon, wanted to beg her not to tell Mom, but the way adults did things, that probably meant that telling Mom would be the first thing she’d do.\nLetty nodded. “Good. Just ignore them, then.”\nIt was easy for her to say. She didn’t have to listen to them all the time. “That wasn’t why I was going out,” I told her. “I was going after Bobo.”\n“I know you were,” Letty said. “I also know nothing’s simple.” She folded her topo map and stood up and said, “I’d better be getting on home, before the weather gets any worse. Tell your Mom I’ll talk to her tomorrow. And try to have a good weekend.” She ruffled my hair before she went, the way Mom had when Bobo got the chip. Letty hadn’t done that since I was little. I didn’t move. I just sat there, looking at the blip on the handheld.\nAfter a while I went up to my room. David hadn’t come back yet, not that I cared, and Mom’s door was closed. I knew she was sleeping off the shift. I also knew she’d be out of bed and downstairs in two seconds if she heard David coming in or me going out. She’d hung the front and back doors with bells, brass things from Nepal or someplace she’d gotten at Pier One. You couldn’t go out or come in without making a racket, and you couldn’t take the bells off the door without making one, either. “You learn to sleep lightly when you have babies,” Mom told me once, as if either me or David had been babies for years. And our windows were old, and pretty noisy in their own right. And it was snowing harder.\nSo I just sat on my bed and stared out the window at the snow, trying not to think. My window faces east, away from Peavine, towards downtown. I couldn’t see the lights from the casinos because of the snow, but I knew they were there. After a while it stopped snowing, and a few stars came out between the clouds, and so did the neon: the blue and white stripes of the Peppermill, which stands apart from everything else, south of downtown, and the bright white of the Hilton a bit north of that—“the Mother ship,” Mom always calls it—and then, clustered downtown, the red of Circus Circus and the green of Harrah’s, which Mom calls Oz City, and the flashing purple of the Silverado, where Dad used to work.\nDad loved this view; he was so proud that we could look down on the city. He couldn’t stop crowing about it to all his friends. I remember when he brought George Flanking and Howard Schuster, Leon and Johnny’s dads, into my room so they could look out my window, too. So they could see “the panorama.” That was what Dad called it. We’d never been able to see anything from our old windows, except more trailers across the way. “I’m going to get us out of this box,” Dad said when we lived there. “We’re going to live in a real house, I swear we are.” And then we moved here, to a real house, and pretty soon that wasn’t big enough for him, either.\nI shut my blinds and flopped down on my bed. Someplace a dog had started to bark, and then another joined in, and another and another, until the whole damn neighborhood was going nuts. And then I heard what must have set them off: the yipping howl of a coyote, trotting between houses looking for prey.\nWhen we bought our house five years ago, the street ended a block from here, and that was where the mountain started. Winter mornings, sometimes, we’d see coyotes in our driveway. Now the developers have built another hundred houses up the street, with more subdivisions going up all the time: fancy houses, big, the kind we could never afford, the kind that made Dad’s eyes narrow, that made him spend hours hunched over his desk. The kind he talked about when he went out drinking with George and Howard, I guess. I don’t know who’s buying those big houses; casino and warehouse workers can’t afford places like that. Mom could, maybe, if she weren’t saving for nursing school. The only people I can think of who might live there are the ones who work for the development companies.\nSo we don’t get coyotes in our driveway anymore, but they’re still around. They travel in back of the houses, next to the six-foot fences people put around their yards. There’s still sagebrush between the subdivisions, and rabbits, and you can still follow those little strips of wildness to the really wild places, up on the mountain.\nCoyotes are unbelievably smart, and they’ll eat anything if they have to, and it doesn’t bother them when people cut the land into pieces. They like it, because the boundaries between city and wilderness are where rodents live, and rodents are about coyotes’ favorite food, aside from cats. So when we cut things up for them, there are more edges where they can hunt. It doesn’t hurt that we’ve killed most of the wolves, who eat coyotes when they can, or that coyotes look so much like dogs. They can sneak in just about anyplace. Dr. Mills says there are coyotes living in New York City now, in Central Park. There are millions of them, all over the country.\nRanchers and farmers hate them because they’re so hard to kill, and because even if you kill them, there are always more. But I can’t hate them, not even for eating cats. They’re smart and they’re beautiful, and they’re just trying to get by, and as far as I can tell, they’re doing a better job of it than we are. They know how to work the system. That’s what Dad thought he was doing, but he wasn’t smart enough.\nI lay there, listening to that coyote and to all the dogs, still trying not to think, but thinking anyway: about what a weird town this is, where you get casinos and coyotes both, where the developers are covering everything with new subdivisions, but there’s still a mountain where you can die. After a while it got quiet again, and I peeked out the window and saw more snow. A while after that I heard the bells jangling downstairs, and heard Mom’s feet hitting her bedroom floor and thudding down the stairs. When she and David started yelling at each other, I pulled my pillow over my head and finally managed to go to sleep.\nIt wasn’t snowing when I woke up on Saturday, but it looked like it might start again any minute. The transmitter signal still hadn’t moved, and when I thought about Bobo out there in the cold, I felt my own heart freezing in my chest. I heard voices from downstairs, and smelled coffee and bacon. Mom and David were both home, then. I threw on clothing and grabbed the handheld and ran down to the kitchen.\n“Good morning,” Mom said, and handed me a plate of bacon and eggs. She was wearing sweats and looked pretty relaxed. David was wearing his bathrobe and scowling, but David always scowls. I wondered what he was doing up so early. “Any change on the screen, Mike?”\n“No,” I said. I knew she didn’t think there ever would be, and I wondered why she’d asked. David’s face had gone from scowling to murderous, but that was all right, because I planned to be out the door as soon as possible.\n“Okay,” Mom said. “We’re all going up there after breakfast.”\n“We are?” I said.\n“Your brother’s coming whether he wants to or not, and I asked Letty to come too. Rich Mills has to work this morning. Unless you’d rather not have all those people, honey.”\n“It’s okay,” I said. So that’s what David was doing up. Mom was making him come as punishment, so he could see what he’d done, and Letty was coming because she had the maps, and maybe to help Mom keep me and David apart if we tried to kill each other. And Mom wouldn’t think it was important to have Dr. Mills there, because she didn’t think Bobo was still alive. I put down my plate and gulped down some coffee and said, “I’m going to go put the carrying case in the SUV.”\n“You’re going to eat first,” Mom said. “Sit down.”\nI sat. Driving up Peavine in the snow wasn’t exactly Mom’s idea of a day off; the least I could do was not give her any lip. David bit into his toast and said around a mouthful of bread, “I’m not going.”\nThat was fine with me, but I wasn’t going to say so in front of Mom. It was their fight. “You’re coming,” she told him. “And if Bobo’s still alive you’re paying the vet bills, and if he’s not, you’re buying your brother another cat. And if we get another cat you’ll damn well help us keep it in the house, or I’ll call the sheriff’s office myself and tell them to take you off probation and put you in jail, David, I swear to God I will!”\nShe would, too. Even David knew that much. He scowled up at her and said, “The cat didn’t want to stay in the house.”\n“That’s not the issue,” Mom said, and I stuffed my face full of eggs to keep from screaming at David that he’d hated Bobo, that he’d wanted Bobo to die, and that I hoped he’d die, too: alone, in the cold.\nI remembered one of the first times David had let Bobo out. Bobo didn’t have the transmitter yet, and I was in the backyard calling his name. Suddenly I saw something race over the fence and he ran up to me, mewing and mewing, his tail all puffy. I picked him up and carried him inside and he stayed on my lap, with his face stuck into my armpit like he was hiding, for half an hour, until finally he calmed down and stopped shaking and jumped down to get some food. I’d hoped that whatever had spooked him so badly would keep him from wanting to go out again, even if David opened all the doors and windows, but I guess he forgot how scared he’d been. “He didn’t want to freeze to death, either,” I said.\nDavid pushed his chair back from the table and said, “Look, whatever happened to your fucking cat, it’s not my fault, and I’m not wasting my day off going up there.” He looked at Mom and said, “Do whatever you want: it doesn’t matter. I might as well be in prison already.”\n“Bullshit,” Mom said. “If you go to prison, you’ll lose a lot more than a Saturday. Do you have any idea how lucky you are not to be there already? Especially after the stunts you’ve been pulling this week?” Nevada’s a zero-tolerance drug state, even for minors, so when David got caught driving stoned last year, with most of a lid of pot in the glove compartment of his Jeep, Mom had to use every connection she had to get him probation instead of jail. It would have been a “juvenile facility,” since David was still a few weeks short of eighteen, but Mom says her connections said that wouldn’t make much difference. Juvenile facilities are worse, if anything.\nMom didn’t say who her connections are, and I don’t want to know. Whoever they are, I figure they didn’t help David entirely out of the goodness of their hearts. I figure they were scared of what Mom could tell people about them, even if what she does is legal.\n“I told you,” David said, “I’ve just been hanging out with some guys from work. You know: eating dinner, playing pool? I was in town.”\n“Right,” Mom said. “And there’s no way anybody could check that with the satellites down, is there? That’s what you were counting on.”\nDavid rolled his eyes. “What time did the damn GPS go back up last night? Six-thirty or something? We were still eating then. We were at that pizza place in the mall. Call the sheriff’s office and ask them, if you don’t believe me.” He jerked a thumb at my handheld and said, “How stupid do you think I am? I knew it could come back online any second. What, I’m going to take off for Mexico or something?”\nMom didn’t bother to answer. She and I were the smart ones in the family: David took after Dad. Anybody stupid enough to get caught with that much pot was stupid enough to do just about anything else, as far as I could tell, but the only time I’d even started to say anything like that, right after his arrest, David had just glared at me and said, “Yeah, well, if you’d had to look at what I had to look at, you’d smoke dope too, baby brother.”\nAs if I hadn’t wanted to look. As if I hadn’t kept trying to go outside. As if even now I didn’t keep imagining what it had looked like, a million different ways, enough to keep me awake, sometimes.\nBut even then, I knew that David had only said it to make me feel guilty. He knew just how to get at everybody. Now he gestured at the handheld again and said bitterly, “I can’t wipe my ass without those people knowing about it.”\nHe was needling Mom, because that’s what Dad had always said about dealing blackjack at the Silverado. The dealers were under surveillance all the time: from pit bosses, from hidden cameras. “You can’t get away from it,” Dad said. “It’s like working in a goddamn box, with the walls closing in on you.” But Dad chose his box, and so did David.\n“That’s not the issue,” Mom told David again. “It’s more than staying in county limits, David. You’re supposed to come home straight after work. You know that.”\n“So you’re my jailor now? Just like the casino was Dad’s and the Lyon County cops are—”\n“Stop it,” Mom said, her voice icy. “I’m not your jailor. I’m the one who kept you out of jail. You agreed to the terms of the probation!”\n“Like you agreed to all those terms when you decided to go down to Carson and play nurse?”\nMom was out of her chair then, and David was out of his, and they stood nose to nose, glaring at each other, and I knew that there was no way we were all going up on Peavine today, because they wouldn’t be able to sit in the same car even if David had wanted to go, even if I’d wanted him there. Nothing David says to Mom ever makes any real sense, but he knows exactly how to get to her. Sometimes he has to keep at it for a while, but Mom always snaps eventually, even if the same thing has happened a million times before. Just like Bobo being scared by something outside, and still going out again when David gave him the chance. David knows exactly how to get people to hurt themselves.\nThey were still eye to eye, like cats circling each other before a fight, when the doorbell rang. “I’ll get it,” I said. Maybe it was Letty, and I could warn her about what was happening before she came inside.\nIt was a cop. “Good morning, son,” he said. “I’m looking for David. That your brother?”\n“Yeah,” I said, but my legs felt like wood, and I didn’t seem to be able to get out of the way.\n“Don’t worry,” he said. “It’s just a routine drug test.”\nThat was supposed to happen on Fridays. So David had skipped his drug test, too. My stomach shriveled some more. “Will he have to go to jail?” I said. The house would be a lot quieter if David was in jail, but school would be worse. If David went to jail, he’d probably be in the same place as George Flanking and Howard Schuster, and I didn’t want to think too much about that.\nThe cop’s face softened. “No. Not if he’s clean. He’ll get a warning, that’s all.”\nAnd then Mom, behind me, said, “Michael, let him in,” and my legs came alive and I got out of the doorway, fast, and the cop came in, tipping his hat to Mom.\n“Morning, ma’am.” I wondered if Mom was remembering the last time the cops were at our house. I wondered if this cop was one of her connections. I wonder that about all kinds of people: my teachers and all the cops and storekeepers and Dr. Mills, even. I hate wondering it, but that’s another thing I can’t talk to Mom about. It would just hurt her. It would just make me like David, or like Aunt Tina, who hasn’t even talked to us since Mom started working down in Carson.\nThe fight Aunt Tina picked with Mom was as bad as any of David’s: worse, maybe, because she doesn’t even live with us. She wasn’t even here when Dad died. It was none of her business. “Oh, Sherry! How can you do that, of all things? With your boys the ages they are, after what their father did? How will be they be able to hold their heads up, knowing—”\n“Knowing that their mother’s keeping a roof over their head? My secretarial job doesn’t pay enough, Tina, not by itself—and if you know what else I can do to earn a hundred thousand a year, go right ahead and tell me!”\nIt was perfectly legal, and it would let Mom earn enough money to go to nursing school at UNR and get a job none of us would have to be embarrassed about. That’s what she kept telling us. A year, she’d said, or two at the most. But it had already been two years, and she hadn’t saved enough to quit yet, because the hundred thousand didn’t include food or clothing or insurance, or all the tests Mom has to have to make sure she’s still healthy. She has drug tests, too. She gets more tests than David does, even though she’s not a criminal and never did anything wrong, and she has to pay for all of hers. And when she’s in Carson she can’t go into a casino or a bar by herself, and she can’t be seen in a restaurant with a man, and she has to be registered with the Lyon County Sheriff’s Office—because technically, she’s not in Carson at all. Her job’s not legal in big towns: not in Reno, not in Vegas, not even in lousy little Carson City, the most pathetic excuse for a state capitol you ever saw. Mom has to work right outside Carson, in Lyon County, which is still plenty close enough to be convenient for her connections.\nIt used to be that the women at Mom’s job couldn’t even leave the buildings where they work without somebody going with them, but now they have transmitters, instead. And it used to be that they had to work every day for three weeks, living at the job, and then get one week off, but some of them got together and lobbied to change that, because so many of them were single mothers, and they wanted to be able to go home to their kids at night. But they still can’t live in the same county where they work, which is why Mom has to commute between Reno and Carson. Highway 395’s the only way to get down there, and those thirty-five miles can get really bad in the winter. That’s why Mom had to buy the SUV. The SUV wasn’t included in the hundred thousand, either.\nMom doesn’t know that I know a lot of this. I’ve heard her and Letty talking about it, especially about all the tests. Letty’s afraid Mom’s going to get something horrible and die, but Mom keeps pooh-poohing her. “For heaven’s sake, Letty; it’s not like they don’t have to wear condoms!”\nI got out of the cop’s way and tried not to think about him wearing a condom. It’s hard not to get really mad at Dad whenever I think things like that. It’s hard not to get even madder at David. He has it easier than Mom does, and it’s not fair. She’s not the criminal.\nI followed the cop into the kitchen. Mom was chit-chatting about the weather and pouring him a cup of coffee; David was disappearing down the hall to the bathroom, carrying a little plastic cup. I looked at the drug kit, sitting on the table next to our half-eaten breakfasts. “Only takes two minutes,” the cop told me, “and then I’ll be out of here and leave you folks to your weekend. Ma’am, you mind if I take my jacket off?”\n“Of course not,” she said, and he did, and when I saw the gun in its holster I took a step back, even though of course the cop would be wearing a gun, all cops wear guns. Nearly everybody around here owns guns anyway, except us. And Mom bit her lip and the cop stepped back too, away from me, raising his hands. He looked sad.\n“Hey, hey, son, it’s all right. I’ll put the jacket back on.”\n“You don’t have to,” I said, my face burning. “I’m going up to my room, anyway.” I wanted to get out of there before David came back out of the bathroom with his precious bodily fluids. I didn’t want to stand around and find out what the drug tests said. So I went upstairs, wondering if there was anybody in the entire fucking town who didn’t know everything about anything that had ever happened to us.\nI flopped down on my bed again, waiting for the jangle of bells that would mean the cop had left. It came pretty quickly, and then there was another right after it, and I didn’t hear any yelling, so I figured everything was okay. The phone had rung, somewhere in there. One of David’s loser friends, maybe. Maybe he’d gone out. Maybe I wouldn’t have to deal with him today. I wanted to be out on the mountain, climbing up to Bobo, but I knew the SUV would get there more quickly than I could, even with the delay.\nBut when I went back downstairs, David was in the living room watching TV and Mom and Letty were sitting at the kitchen table, looking worried. I looked at Mom and she said, “Relax. Your brother’s clean.”\n“Okay,” I said. She and Letty had probably been talking about me. “Are we leaving soon?”\nMom looked down at the table. “Michael, honey, I’m sorry. We can’t leave right away. I’m waiting for a call from the doctor.”\nI squinted at her. “From the doctor?”\n“I’m fine,” Mom said. “It’s nothing, really. She’s looking at some test results, that’s all, and I may need to take some antibiotics. But I don’t want to miss the call. We’ll go right after that, okay?”\n“I’m going now,” I said. I thought they had to wear condoms. “He’s been up there since last night, Mom!”\nLetty started to stand up. “Mike, I’ll drive you—”\n“You don’t have to,” I said. Right then, as much as I wanted to reach Bobo quickly, I wanted to be alone even more. “You can catch up with me after the doctor calls. Stay and talk to Mom.” Stay and keep Mom and David out of each other’s hair, I meant, and maybe Letty knew that, because she nodded and sat back down.\n“Okay. We’ll follow you as soon as we can. Be careful.”\n“Don’t worry,” I said. “It’s not like you don’t know where I’m going.”\nIt felt good to be out, away from Mom and David, where I could finally breathe again. I cut over to the wild strip on the edge of our subdivision and started working my way up, past the new construction sites where the dump trucks and jackhammers were roaring away, even on Saturday, up to where all the signs say Bureau of Land Management and National Forest Service. The signs don’t mean much, because the Forest Service and the BLM can sell the land to developers anytime they want. Right now, though, the signs meant that I was on the edge of wildness stretching for miles, all the way to Tahoe.\nWhen the construction noises faded, I started hearing the gunfire. Shooters come up on Peavine for target practice; you can always find rifle shells on the trails, and there are all kinds of abandoned cars and washing machines and refrigerators that people have hauled up here and shot into Swiss cheese. Sometimes the metal has so many holes you wonder how it holds its shape at all. “Redneck lace,” Dad used to call it—Dad who’d grown up in a trailer, and was so proud that he’d gotten us out of one: Dad who couldn’t stand being called a redneck, even though he came up on Peavine every weekend with George Schuster and Howard Flanking, so they could drink beer and shoot skeet.\nAfter he died, I couldn’t come up on the mountain for a long time. But gunfire’s one of those things you can’t get away from here, any more than you can avoid new subdivisions, and Peavine’s the only place I can come to be alone, really alone. I can hike up here for hours and never see anybody else. The gunfire’s far away, and nearby are sagebrush and rabbits and hawks. In the summer you see lizards and snakes, and in the winter, in the snow, you see the fresh tracks of deer and antelope. I’ve seen prints that looked like mountain lion; I’ve seen prints that looked like dog, but were probably coyote.\nI hiked hard, pushing myself, taking the steepest trails. It takes me three hours to get to the top of Peavine in good weather, and today I wanted the most direct route I could find. When you’re slogging up a fifteen percent grade in the snow, it’s harder to think about how miserable your cat would be, stuck up here in weather like this, and it’s harder to think about what you want to do to your brother for letting him out. It’s harder to think about who you know might be wearing condoms, or how condoms can break even when they’re used right. It’s harder to think about how angry you are that your mother’s connections don’t have to be tested before she is, to make sure she doesn’t catch anything.\nMom never lied to me. She wouldn’t say “some antibiotics” if she really meant “years of AIDS drugs.” She wouldn’t say it was nothing if she was scared she might be infected with something that could kill her. I was angry anyway, because nothing was fair.\nSo that fifteen percent grade was just what I needed. If Mom and Letty followed me, they’d be coming the easy way, up the road. They’d probably be angry if they couldn’t find me, but they’d also get to the mine before I did, and they’d be able to drive Bobo back down. I hadn’t been able to bring the carrying case with me, but I wouldn’t be able to get it back down the mountain with Bobo in it anyway, not by myself. I hoped Mom had remembered to put the carrying case in the SUV. I hoped Bobo would still be in any kind of shape to need the carrying case at all.\nI’m sorry, I told him as I climbed. I’m sorry I didn’t come after you sooner. I’m sorry I couldn’t protect you from David. I’m sorry about whatever scared you. Bobo, please be alive. Please be okay.\nAfter a while, it started to snow. I kept going. I was wearing my warmest thermals and I was covered in Gore-Tex, and I had enough food in the pack for three days. And if Mom and Letty drove up in the snow and couldn’t find me because I’d come back down, they’d really start freaking. So I headed on up, except that as soon as I could, I cut over to the road. I didn’t see any fresh tire marks, which meant they were still behind me. I tromped along, checking the GPS every once in a while to make sure the signal hadn’t moved, and then I heard a horn and turned around and saw headlights.\nIt was Dr. Mills. “Hey, Mike. I drove by your house when I got off work, and your mom said you’d headed up here.” I scrambled into his truck; he had the heater blasting, and it felt good. “I hope you don’t mind that your mom didn’t come. My old truck can take the wear better than that fancy Suburban she has, and there’s only so much room in here.”\nThere was still plenty of room in the front seat. I glanced back at the flatbed: Dr. Mills had brought a carrying case, but of course on the way down, we’d want to be able to have Bobo in front with us, where it was warm. The part about Mom could have meant just about anything, depending on whether it was his excuse or hers. If it was hers, she could have been hoping that Dr. Mills would run a male-bonding father-figure trip on me, or she could have still been waiting for the doctor to call, or she and Letty could have been trying to force David to stay in the house somehow. Or all of the above. If it was his—I didn’t want to think about what it meant for him to be saving wear on her SUV, or not wanting her in the truck at all. Dr. Mills is married. I didn’t want to think about him driving down to Carson.\nSo I looked at the handheld again. “He’s in an old mine up here,” I said.\n“Mmm-hmmm. That’s what your mom told me. How long since he’s moved?”\n“Not since the satellites came back up,” I said, and Dr. Mills nodded. He stayed quiet for a long time, and finally I said, “You think he’s dead, don’t you? That’s what Mom thinks.”\nThe snow was coming down harder now, the windshield wipers squeaking in a rhythm that kept trying to lull me to sleep. Dr. Mills could have told me he didn’t want to go on; he could have turned around. He didn’t do that. He knew I had to see as much as I could. “Michael,” he said finally, “I’ve been a vet for fifteen years, and I’ve seen plenty of miracles. Animals are amazing. But I have to tell you, I think it would take a miracle for Bobo not to be dead.”\n“Okay,” I said, trying to keep my voice steady.\n“With coyotes,” he said, “usually it’s quick. They break the necks of their prey, the same as cats do with birds and mice. So unless Bobo got away for a few minutes and then got caught again, he wouldn’t have suffered long.”\n“Okay,” I said, and looked at my hands. I wondered how long it would take me to break David’s neck, and how much I could make him suffer while I did it. And then I thought, there goes David again, making me want to do something stupid, something that would only mean I was hurting myself.\nIt took us ten more minutes to get to the mine, and by then the snow was coming down so hard that we could hardly see a foot ahead of the truck. We got out and started walking towards where the mine should have been, snow stinging our faces. It was really cold. I couldn’t see anything but snow: no rocks, not even the scrubby pines that grow up here. And within about ten feet I realized that the mine entrance was completely buried, and that even if we’d been able to find it, we’d probably need to dig through five feet of snow to get to Bobo.\n“Michael,” Dr. Mills yelled into my ear, over the wind. “Michael, I’m sorry. We have to go back.”\nI tried to say, “I know,” but my voice wouldn’t work. I turned around and headed towards the truck, and when I was back inside it I started shivering, even when the heat was blasting again. I sat in the front seat, with the empty space between me and Dr. Mills where Bobo should have been, and shivered and hugged myself. Finally I said, “You get warm, just before you freeze to death. If the coyotes didn’t kill him—or if he went up on his own—”\n“He’s not in pain,” Dr. Mills said. “That’s a cliché, isn’t it? But it’s true. Michael, wherever he is now, he doesn’t hurt. I can promise you that.” And then he started telling me about some poem called “The Heaven of Animals,” where the animals remain true to their natures. The predators still hunt and exult over their kill, and their prey rise up again every morning, perfectly renewed, joyously taking their proper part in the chase.\nI guess it’s a nice idea, but all I could think about was Bobo, shivering, hiding his head under my arm because he was scared.\nSo we drove on down the mountain, and pretty soon the snow stopped coming down so hard, and when we got back down to the developments, there was hardly any snow at all. You could still hear the construction equipment, and gunfire far off. Maybe the target shooters had moved farther down to get away from the snow. Dr. Mills hadn’t said anything for a while, but when we started hearing the guns, he looked over at me.\nDon’t, I thought. Don’t say it. Don’t say anything. Just take me home, Dr. Mills, please. Don’t say it.\n“I never told you,” he said, very quietly, “how sorry I am about what happened to your dad.”\nI stared straight ahead, thinking about Bobo, thinking about the hiker who’d died on Peavine. I wondered how long it would take the snow to melt.\nWhen Bobo was a kitten, Dad used to dangle pieces of string for him. He always dangled them just high enough so Bobo couldn’t get at them, and he’d laugh and laugh, watching Bobo jump. “We’re going to enter this cat in the Olympics,” he said. “Look at him! He must’ve made three feet that time!”\nBobo had lots of toys he could play with anytime he wanted, balls and catnip mice and crumpled-up pieces of paper I’d toss on the floor for him. But the minute Dad dangled that string, he’d stop playing with the stuff he could catch and go after the thing he couldn’t have.\n“Just like you,” Mom always told him, watching them. “Just like you, Bill, jumping at what you’ll never be able to get.”\n“Aw, now, Sherry! Why can’t we have a Lexus? Why can’t we have one of those fancy home theaters, huh?”\nI thought he was kidding. Maybe Mom did, too.\nWhen Dr. Mills dropped me off at home, David was gone, which was a good thing, because I don’t know what I would have done if I’d had to look at him. Mom and Letty were still there. They tried to talk to me.\nI didn’t want to talk. I went straight up to my room and took off all the Gore-Tex and went to bed. I didn’t want to think about what we didn’t need anymore: the toys and the litter box and Bobo’s food and water bowls. I knew I’d have to throw it all away. Mom had told David he had to get me another cat, but how could I get another cat? David would just let it out again. When I got into bed, I remembered that the handheld was still in my jacket pocket, and somehow that hurt more than anything else. I pulled my pillow over my head and turned my face to the wall. The pillow blocked out a lot, but I still heard the phone, and I still heard the jangling bells when Letty left, and I still heard them again when David came in. I couldn’t block out the sounds of him and Mom yelling at each other, no matter how hard I tried.\nI got up and tried to do homework, but that just made me think about how I was going to have to go to school on Monday morning. I tried to read, but all the words seemed flat and tasteless, like week-old bread. So finally I just sat on my bed, staring out at the casinos. They looked so small from here, little boxes you could pick up and throw like dice. And then I heard a coyote, off in the other direction.\nBeing good is one of the smallest boxes there is: Mom knows that, and so do I, and so did Dad. Mom was the only one who never complained about it, but what did I know? Maybe she hated it as much as I did. I didn’t see how she could like it. Maybe she felt like Dad said he’d always felt, like the walls were closing in on her. “If I could just get outside,” he always told me. “Working in that damn casino, no daylight anywhere, all those people watching you all the time, you just want to go outside and take a walk, Mike, you know what I mean?”\nAfter Dr. Mills drove me up to the mine, I knew what Dad meant. I sat there with the walls closing in on me, and I couldn’t breathe. I needed more room. I wanted to be outside with the coyotes, running around the outside of the boxes, invisible. Even if you try to watch a coyote to see what it’s doing, even if you try to track it, it will disappear on you. It will fade into the grass, into the sagebrush, into shadows. And you’ll know that wherever it is, it’s laughing.\nSunday was quiet. David stayed in front of the TV, and I finally got my homework done, and Mom cleaned the house, humming to herself while she worked. She had to be on antibiotics for ten days, and she couldn’t work until the infection was gone. “Ten-day vacation,” she told me cheerfully, but she didn’t get paid vacations any more than she got anything else. All it meant was ten days’ pay out of the nursing-school fund.\nOnce I asked her what would happen if the Lyon County sheriff’s office saw her transmitter signal outside the building where she works. What if they tracked it and found her in a bar, or in a casino, or in a restaurant with a man? Would she go to jail?\nShe’d shaken her head and said very gently, “No, honey, I’d just lose my job. And I’d never do that, because it would be stupid.” Because it would be like what Dad did, she meant. “Don’t worry.”\nWhen I got up on Monday morning, my stomach hurt already. I hadn’t been able to sleep very well, because I kept thinking about Bobo buried in the snow. I kept wondering about what I hadn’t been able to see, worrying that maybe there’d been some way to save him and I hadn’t figured it out.\nI couldn’t stand the idea of going to school. I couldn’t stand facing Johnny and Leon; I couldn’t stand the idea of going through all that and not being able to come home and have Bobo comfort me, curling up on my stomach the way he always did to get warm. I’d always been able to tell Bobo everything I couldn’t talk about to anybody else, and now he was gone.\nBut I had to go to school, so I wouldn’t upset Mom.\nI had an algebra test first period. I knew the material; I could have done all the problems, but I couldn’t make my hands move. I just sat there and stared at the paper, and when Mrs. Ogilvy called time, I handed it in blank.\nShe looked at it, and both her eyebrows went up. “Michael?”\n“I didn’t feel like it,” I said.\n“You didn’t—Michael, are you sick? Do you want to go to the nurse?”\n“No,” I said, and walked away, out into the hall, to my next class, which was English. We were talking about Julius Caesar. I sat against the back wall and fell asleep, and when the bell rang I got up and went to Biology, where we were dissecting frogs. Biology was always bad, because Johnny and Leon were in there. They grabbed the lab station next to mine, and whenever they thought they could get away with it they whispered, “Hey, Mike, know what we’re gonna do after school? Hey, Mike—we’re gonna drive down to Carson. We’re gonna drive down to Carson and fuck your mother!”\nDonna Mauro, my lab partner, said, “They are such jerks.”\n“Yeah,” I said, but I couldn’t even look at Donna, because I was too ashamed. I knew everybody in school knew what my mother did, but that didn’t mean I liked it when Johnny and Leon reminded them. I wondered if one of Donna’s parents worked for the BLM and had talked to Letty, but it could have been just about anybody.\nI stared down at the frog. We were supposed to be looking for the heart. I pretended it was Johnny instead, and sliced off a leg. Then I pretended it was Leon, and sliced off the other leg.\nDonna just watched me. “Um, Mike? What are you doing?”\n“I thought I’d have frog legs for lunch,” I said. My voice sounded weird to me, tinny. “Want one?”\n“Um—Mike, that’s cool, but we have to find the heart now.”\nI handed her the scalpel. “Here. You find the heart.”\nAnd then I turned and walked away.\nIt was really easy, actually. I just walked out of the room, like I had to go to the bathroom but had forgotten to ask permission. Behind me I could hear Mr. Favaro, our teacher, saying something, and Donna answering, but the voices didn’t really reach me. I felt like I was inside a bubble: I could see outside, but everything was muffled, and no one could get inside. They’d just bounce off.\nIt was wonderful.\nI walked along the hall, and Mr. Favaro ran up behind me, gabbling something. I had to listen really carefully to make out what he was saying. It sounded like he was on the moon. “Mike? Michael? Is there something you need to tell me?”\nI considered this. “No,” I said. If I’d been Leon or Johnny or one of the bad kids, Mr. Favaro probably would have yelled at me and told me to get back inside the room, now, but he was spooked because it was me acting this way. So he gabbled some more, and I ignored him, and finally he ran away in the other direction, towards the principal’s office.\nI just walked out the door. My jacket was back in my locker, but it was pretty warm out, at least in the sun, and I wasn’t cold. The bubble kept me warm. I started walking down a gully that angled down past the football field. I could hear voices behind me; I didn’t stop to try to figure out what they were saying. But then a van pulled up alongside the gully, and people got out, and the voices started again. “Michael. Michael Michael Michael Michael Michael.”\n“What?” I said. Ms. Dellafield was there, the principal, and Mr. Ambrose, the school nurse, and two guidance counselors whose names I could never remember. They all looked really scared. I blinked at them. “I just wanted to take a walk,” I said, but they were in a semicircle around me, pushing at the edges of the bubble, herding me towards the van. “You don’t have to do this,” I told them. “Really. I’m fine. I was just taking a walk.”\nThey didn’t listen. They kept herding me towards the van, and then I was inside it, and the door was closing.\nThey drove me back to school, and then they herded me into Mr. Ambrose’s office, and then Ms. Dellafield went to call Mom while Mr. Ambrose and the two guidance counselors stood there and watched me, like they were going to tackle me if I tried to move. “Why are you doing this?” I kept asking them. “I was just going for a walk.” It didn’t make any sense. I’d seen other kids walk out of classes: they’d never gotten this kind of attention. “I’ll go back to biology, okay? I’ll dissect my frog. You don’t have to call my mother!”\nAnd at the same time I thought, thank God Mom’s home today. Thank God she’s not down in Carson, so that Ms. Dellafield doesn’t have to hear them say whatever they say when they answer the phone there, not that there’s any chance that Ms. Dellafield doesn’t know where Mom works, since everybody else knows it. But even all that didn’t bother me as much as usual, because the bubble was still basically holding. Mr. Ambrose and the guidance counselors kept asking me how I was, and I kept telling them I was fine, thank you, and how are all of you today? And they kept looking more and more worried, as if I’d answered them in another language, one where “fine” meant “my eyeballs are about to explode.” So I sat there feeling fine, if a little far away, and thinking, these people are really weird.\nAnd finally, after about half an hour, I heard voices outside Mr. Ambrose’s office, and then the door opened and Mom came in. She was leaning on David. David had his arm around her, and he was really pale. It was the same way he’d looked after he pulled me away from the rattlesnake.\nI squinted at him and said, “What are you doing here? What happened?”\n“She called me,” David said. He sounded like he was choking. “At work. When they called her. So we could come over here together.”\nI looked at Mom. She was crying, and then I got really scared. “What’s going on?” I said. “Mom, what’s wrong? Are you okay? Did something happen to Letty?” Maybe Mom had called Ms. Dellafield and said something had happened and they had to find me. But that wouldn’t explain the van and the guidance counselors, would it? If something had happened to Letty, wouldn’t Mom have driven over here to tell me herself?\nEverybody just stared at me. Mom stopped crying, and wiped her eyes, and said very quietly, “Michael, the question is, are you okay?”\n“I’m fine! Why does everybody keep asking me that? I was just going for a walk! Why doesn’t anybody believe me?”\nAnd Mom started crying again and David shook his head and said, “Oh, you stupid—”\n“David.” Ms. Dellafield sounded very tired. “Don’t.”\nI felt like I was going crazy. “Would somebody please tell me what’s going on? I was just—”\n“Michael,” Mom said, “that’s what your father said, too.”\nI blinked. The room had gotten impossibly quiet, as if nobody else was even breathing. Mom said, “He said he was just going for a walk, and then he went out into the yard. Don’t you remember?”\nI looked away from all of them, out the window. I didn’t remember that. I didn’t remember anything that had happened that day, before the shot. It didn’t matter: everyone else at school knew the story, and they’d remembered it for me. “I really was just going for a walk,” I said, and then, “I don’t even have a gun.”\nMs. Dellafield said I should take the rest of the day off, so Mom and David and I drove home together, in David’s jeep. When Ms. Dellafield called Mom at home, Mom had been too upset even to drive, so she’d called David and he’d left work and picked her up and driven her to school. He drove us all home, too. He drove really carefully. Once a squirrel ran into the road and David slowed down until it got out of his way. I’d never seen him drive like that before. And when we were walking into the house, Mom tripped, and David reached out to steady her.\nThe last time I’d seen Mom and David leaning on each other, they’d been coming in from the yard. I remembered that part. My ears had still been ringing, but Letty wouldn’t let me go, no matter how hard I fought. She’d been eating lunch with us when it happened. “Let me see,” I kept telling her, trying to break free. “Let me go out there! I want to see what happened!”\nBut Letty wouldn’t let go, because the first thing that happened after the shot was that Mom and David ran out into the yard, and David started screaming, and then Mom yelled at Letty, “Keep Michael inside! Don’t let him come out here!”\nAnd they came back inside, and Mom called the police, and I kept saying, “I want to go see,” and David kept shaking his head and saying, “No you don’t, Michael, you don’t want to see this, you really don’t,” and Letty wouldn’t let go of me. And the cops came and asked everybody questions, and then Letty took me to her house, and by the time I got home, Mom and David had cleaned up the backyard, picked up all the little pieces of bone and brain, so that there was nothing left to see at all.\nDad was stupid. You can’t beat the house: anybody who’s ever been anywhere near a casino knows that. But he and George and Howard were trying. They’d worked out a system, the newspaper said; George or Howard, never both at once, would go in and play at Dad’s table, and Dad would touch a cheek or scratch an ear, always a different signal, so they’d know when to double their bets. And then when they won, they’d split the take with him. They tried to be smart. They didn’t do it very often, but it was often enough for the pit bosses and the cameras to catch on. And somehow, when Dad came home that day, he knew he’d been caught. He knew the walls were closing in.\nGeorge and Howard went to jail. I guess Dad knew he’d have to go there too. I guess he thought that was just too small a box.\nNobody said anything for a long time, after we got home from school. Mom started unloading the dishwasher, moving in little jerks like somebody in an old silent movie, and David sat down at the kitchen table, and I went to the fridge and got a drink of juice. And finally David said, “Why the hell did you do that?”\nHe didn’t sound angry, or like he was trying to piss me off. He just sounded lost. And I hadn’t been trying to do anything; I’d just been going for a walk, but I’d said that at least a million times by now and it was no good. Nobody believed me, or nobody cared. So instead I said, “Why did you keep letting Bobo out?”\nAnd Mom, with her back to us, stopped moving; she stood there, holding a plate, looking down at the open dishwasher. And David said, “I don’t know.”\nMom turned and looked at him, then, and I looked at Mom. David never admitted there was anything he didn’t know. He stared down at the table and said, “You kept saying you wanted to go outside. You kept—you were fighting to go outside. The cat wanted to go out, Michael. He did.” He looked up, straight at me; his chin was trembling. “You didn’t even have to look at it. It wasn’t fair.”\nHis voice sounded much younger, then, and I flashed back on that day when he saved me from the rattlesnake, when we were still friends, and all of a sudden my bubble burst and I was back in the world, where it hurt to breathe, where the air against my skin felt like sandpaper. “So you wanted me to get my wish by having to look at Bobo?” I said. “Is that it? Like I wanted any of it to happen, you fuckhead? Like—”\n“Shhhh,” Mom said, and came over and hugged me. “Shhhh. It’s all right now. It’s all right. I’m sorry. I’m sorry. David—”\n“Forget it,” David said. “None of it matters anymore, anyway.”\n“Yes it does,” Mom said. “David, I made you do too much. I—”\n“I want to go for a walk now,” I said. I was going to scream if I couldn’t get outside; I was going to scream or break something. “Can we just go for a walk? All of us? You can watch me, okay? I promise not to do anything stupid. Please?”\nMom and David have gotten along a lot better since then. Letty and I talked about it, once. She said they’d probably been fighting so much because David was mad at Mom for making him help her in the yard when Dad died, and Mom felt guilty about it, and didn’t even know she did, and kept lashing out at him. And none of us were talking about anything, so it festered. Letty said that what I did at school that day was exactly what I needed to do to remind Mom and David how much they could still lose, to make them stop being mad at each other. And I told her I hadn’t been trying to do anything, and anyway I hadn’t even remembered what Dad had said before he went out into the yard. She said it didn’t matter. It was instinct, she said. She said people still have instincts, even when they live in boxes, and that we can’t ever lose them completely, not if we’re still alive at all. Look at Bobo, she told me. You got him from a pet store. He’d never even lived outside, but he still wanted to get out. He still knew he was supposed to be hunting mice.\nIn June, when the snow melted from the top of Peavine, I hiked back up to the mine. I’d been back on the mountain before that, of course, but I hadn’t gone up that high: maybe because I thought I wouldn’t be able to see anything yet, maybe because I was afraid I would. But that Saturday I woke up, and it was sunny and warm, and Mom and David were both at work, and I thought, okay. This is the day. I’ll go up there by myself, to see. To say goodbye.\nAll those months, the transmitter signal hadn’t moved.\nSo I hiked up, past the developments, through rocks and sagebrush, scattering basking lizards. I saw a few rabbits and a couple of hawks, and I heard gunfire, but I didn’t see any people.\nWhen I got to the mine, I peered inside and couldn’t see anything. I’d brought a flashlight, but it’s dangerous to go inside abandoned mines. Even if it’s safe to breathe the air, even if you don’t get trapped, you don’t know what else might be in there with you. Snakes. Coyotes.\nSo I shone the flashlight inside and looked for anything that might have been a cat once. There were dirt and rocks, but I couldn’t even see anything that looked like bones. The handheld said this was the place, though, so I scrabbled around in the dirt a little bit, and played the flashlight over every surface the beam would reach, and finally, maybe two feet inside the mine, I saw something glinting in a crevice in the rock.\nIt was the chip: just the chip, a tiny little piece of silver circuitry, sitting there all by itself. Maybe there’d been bones too, for a while, and something had carried them off. Or maybe something had eaten Bobo and left a pile of scat here, with the chip in it, and everything had gone back into the ground except the chip. I don’t know. All I knew was that Bobo was gone, and I still missed him, and there wasn’t even anything that had been him to bring back with me.\nI sat there and looked at the chip for a while, and then I put the handheld next to it. And then I went and sat on a rock outside the mine, in the sun.\nIt was pretty. There were wildflowers all over the place, and you could see for miles. And I sat there and thought, I could just leave. I could just walk away, walk in the other direction, clear to Tahoe, walk away from all the boxes. I don’t have a transmitter. Nobody would know where I was. I could walk as long as I wanted.\nBut there are boxes everywhere, aren’t there? Even at Tahoe, maybe especially at Tahoe, where all the rich people build their fancy houses. And if I walked away, Mom and David wouldn’t know where I was. They wouldn’t even have a transmitter signal. And I knew what that felt like. I remembered staring at the dark screen, when the satellites were offline. I remembered staring at it, and trying not to cry, and praying. Please, Bobo, come back home. Please come back, Bobo. I love you.\nSo I sat there for a while, looking out over the city. And then I ate an energy bar and drank some water, and headed back down the mountain, back home.\nOriginally published in Asimov’s Science Fiction Magazine, May 2000.\nSusan Palwick is an Associate Professor of English at the University of Nevada, Reno. She has published four novels, all with Tor--the most recent is 2013's Mending the Moon--and a story collection with Tachyon, The Fate of Mice. Her work has won the IAFA Crawford Award and the ALA Alex Award, and has been shortlisted for the World Fantasy and Mythopoeic Awards.", "source": "https://clarkesworldmagazine.com/palwick_04_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Going After Bobo by Susan Palwick"}