{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Finbarr O'Reilly", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/7n/1YwdD5m2ce4pyJwHXV2ZtDU=", "id": null, "license": null, "comments": "", "raw_text": "5870 words, short story  The Last Boat-Builder in Ballyvoloon  “There are of a certainty mightier creatures, and  the lake hides what neither net nor fine can take.” —William Butler Yeats, The Celtic Twilight The first time I met Más, he was sitting on the quayside in Ballyvoloon, carving a nightmare from a piece of linden. Next to him on the granite blocks that capped the seawall lay a man’s weatherproof jacket and hat, in electric pink. The words “petro-safe” were pin-striped across them in broad white letters, as if a spell that would protect him from the mechanical monster he whittled.  Short of smoking a pipe, Más looked every inch a nineteenth-century whaler. Veined cheeks burned and burnished by sun and wind to a deep cherry gloss, thick gray hair matted and flattened from his souwester and whiskers stiff enough with salt to resist the autumnal breeze blowing in from the harbor mouth.  I had arrived in Ballyvoloon early on a Friday morning. My pilot would not fly till Monday, so I spent the weekend walking the town. Its two main streets, or “beaches” as the locals called them, ran east and west of a concrete, T-shaped pier.  It was near the bottom of the ‘T’ that Más set out his pitch every day, facing the water, but sheltered by thousands of tonnes of rock and concrete.  Ballyvoloon was a town best approached from the sea. The faded postcards on sale along the beachfront showed it from that rare perspective. Snapped from the soaring pleasure decks of ocean-going liners long scrapped or sunk, ribbons of harlequin houses rose from coruscant waters, split by the immense neo-Gothic cathedral that crowns the town. Nowadays, the fret-sawn fascias of pastel shopfronts shed lazy flakes of paint into the broad streets and squares below. It has faded, but there is grandeur there still.  Between the town’s rambling railway station and my hotel, I had passed a dozen or more artists, their wares tied to the railings of the waterside promenade, or propped on large boards secured to lampposts, but none dressed like Más. Nor did any carve like him.  “That looks realistic,” I said, my heart pounding, as he snicked delicate curls of blond wood from the block with a thick-spined blade.  “There’s not much point sugarcoating them,” he said, his voice starting as a matter-of-fact drawl, but ending in the singsong accent of the locals.  “How long have you been a sculptor?” I asked.  “I’m not a sculptor. This is just something to occupy the hands.”  “The devil’s playthings, eh?”  He stopped carving and looked up at me through muddy green eyes.  “Something like that.”  Más lowered the squid he was working on and cast around in the pocket of his jacket. He removed three of the monsters, perfectly carved, but in different sizes and woods, one stained black and polished. The colors seemed to give each one slightly different intents, but none was reassuring.  Other artists carved or drew or painted the squid, but they had smoothed out the lines, removed the barbs, the beaks, gave the things doe-eyes and even smiles and made them suitable to sit atop a child’s bedclothes or a living room bookshelf.  Más did the opposite. He made the horrific more horrifying. He made warm, once-living wood look like the doubly dead, glossy plastic of the squids. These were not the creatures we had released, but their more deadly and cunning offspring.  I hid my excitement as well as I could.  “Sixty for one or one hundred for a pair,” he said.  Más let the moment stretch until the sheer discomfort of it drove me to buy.  His mood brightened and he immediately began packing up his belongings. I had clearly overpaid and he could afford to call it a day.  “See you so,” he said, cheerfully and sauntered off into the town.  Once I was back at the hotel, I unwrapped the parcel and inspected the sculptures, to confirm my suspicions.  The other artists may have outsold Más’s squid six or seven times, but he was the only of them who had seen a real one.   “Twelve years after the squid were introduced, the west coast of Europe endured a number of strange phenomena. Firstly, the local gull population bloomed. The government and the squids’ manufacturer at the time said it was a sign of fish stocks returning to normal, that it was evidence the squid were successful in their mission.  “Local crab numbers also exploded, to the point that water inlets at a couple of coastal power stations were blocked. The company linked this to the increased gull activity, increasing the amount of food falling to the seafloor.”  —Hawes, J. How We Lost the Atlantic, p32  The first flight was late in the afternoon, a couple of hours before sunset. This would give me the best chance of spotting things in the water, as it was still bright enough to see and anything poking above the surface would cast a longer shadow.  The pilot, a taciturn, bearded fellow in his sixties called Perrott, flicked switches and toggles as he went through what passed for a safety briefing.  “If we ditch, it will take about fifteen minutes for the helo to reach us from the airport. The suits will at least make that wait comfortable, assuming, you know . . . ”  We both wore survival suits of neon-pink non-petro, covering everything but hands and heads. His was molded to his frame and visibly worn on the elbows and the seat of his pants. Mine squeaked when I walked and still smelled of tart, oleophobic soy.  “Yes. I know,” I said, as reassuringly as I could manage.  As he tapped dials and entered numbers on a clipboard, I thought of my first flight over water.  My sea training was in Wales, where an ancient, ex-RNLI helicopter dropped me about half a mile from shore. It was maybe twenty-five feet to the water, but the fall was enough to knock the breath out of me. The crew made sure I was still kicking and moved back over land. The idea was to get me to panic, I suppose. They needn’t have worried. The helicopter was away for a total of eight minutes and if my heart could have climbed my gullet to escape my chest, it would have.  After they pulled me back up, I asked the winchman how I had done.  “No worse than most,” he shouted.  He took a flashbang grenade from a box under the seat, pulled the pin, and dropped it out the open door. He counted down from four on his fingers. Over the roar of the rotors, I heard neither splash nor detonation. The winchman made sure I was harnessed, then pointed out the door and down.  A couple of miles away, I could see three or four squid making for a spot directly beneath us, all of them moving so fast they left a wake.  He gave me a torturer’s grin.  “Better than some.”   “We seen them first, the slicks. That’s what they looked like in the pictures, like some tanker or bulker had washed her tanks. But as we got close we could see it was miles and miles of chopped up fish. And the smell! That’s what the locals still call that summer—the big stink.  “When we got back we found out the squid had become more . . . hungry, I suppose, and instead of pulling the bits of plastic out of the water, they started pulling ‘em out of the fish. Sure we had been eating that fish for years and it never did us any harm.”  —Trevor Cunniffe, trawlerman, in an interview for Turn Your Back to the Waves, an RTÉ radio documentary marking fifty years since the squids’ introduction  After two days of fruitless flights, I was grounded by fog. Late in the afternoon, I went to a pub. I sat at the long side of the L-shaped bar, inhaling the fug of old beer and new urinal cakes.  The signage, painted in gold leaf on the large windows, had faded and peeled, so I asked a patron what the place was called. “Tom’s” was the only reply, offering no clue if this was the original name of the pub or the latest owner.  Between the bottles shelved on the large mirror behind the bar, I saw the figure of a man in a candy-striped pink jacket through the rippled privacy glass of the door. It opened and Más walked in. He gently closed it behind him and moved to a spot at the end of the bar. He kept his head down, but couldn’t escape recognizing some regulars and nodded a salute to them.  Emboldened by alcohol, I raised my drink.  “How is the water today?” I asked.  The barmaid gave me a look as if to ask what I was doing engaging a local sot, but I smiled at her for long enough that she wandered off, reassured or just bored at my insincerity.  “About the same,” said Más. “Visibility’s not very good.”  “No,” I said. “That’s why I’m in here. No flights today.”  “Are you off home then,” Más asked.  I interpreted the question as an invitation and walked over to take the stool next to him.  “Not quite,” I said. “Will you have a drink?”  “I will,” he said. “So, what has you in town?”  At first, Más didn’t seem too bothered when I explained who I worked for, or at least he didn’t ask the usual questions or put forward the usual conspiracy theories about the squid.  “A job’s a job, I suppose.”  His eyes wrinkled, amused at a joke hidden to me. “So do ye all have jobs in England, then?”  Ireland had been on universal income for the better part of two decades. It was hard to see how people like Más would have survived otherwise.  “No, not by a long chalk. The only reason I got this one is I wasn’t afraid to cross the sea in a plane.”  “More fool you.”  “You have to die of something, I told them. And it was quite exciting, in the end.”  As the light faded, the mid-afternoon drinkers gave way to a younger, louder crowd, but Más and I still sat, talking.  I described the huge reservoir near where I lived in Rutland, where people could still swim and sail and fish, and how everyone worried that the squid would somehow reach it, denying us access, like Superior or the Caspian.  He asked me what on Earth would make me leave such a place.  “I wanted to see the world. I needed a job,” I said.  He laughed. “Those used to be the reasons people joined the Navy.”  Perrott’s plane was old, but well serviced. It started first time and once we finished our climb, the engine settled into a bagpipe-like drone.  We crossed the last headland and the cheerful baize below, veined in drystone walls, gave way to gray waves, maned in white.  He radioed the Cork tower to tell them we were now over open water and that the rescue team was on formal standby.  He adjusted the trim of the plane to a point where he was happy to let the thing fly itself and joined me in scanning the waters below.  It was less than half an hour, until his pilot’s eye spotted it. Perrott took the controls again and banked to give me a better view. I let the video camera run, while I used the zoom lens to snap any identifying features.  From the size of the blurred shape rippling just beneath the surface, I could tell it was old, seventh or eighth generation, perhaps, but I really wanted a more detailed look.  I told Perrott I would like to make another pass.  “If only we had a bomb, eh?” he said. Sooner or later, everyone suggests it.  “We tried that,” I said.  “Oh yeah?”  Perrott had signed a non-disclosure agreement before the flight. It didn’t matter what I told him. Most of it was already on the Internet, in any case.  “Yes. First they bombed an oil platform in the Gulf of Mexico and opened up its wellhead. Miles from shore, so any oil that escaped would be eaten by the squid or burned in the fire.”  Hundreds of thousands of the things had come, enough that you could see the black stain spread on satellite images. I had only watched the video. I couldn’t imagine how chilling it had been to observe it happen live.  “Then the Americans dropped three of the biggest non-nukes they’ve got on them.”  “It didn’t work, then?”  “No. Any squid more than a dozen feet or so below the surface were protected by the water. We vaporized maybe half of them. After that they stayed deep, mostly.”  I didn’t tell Perrott about the Mississippi and how the squid had retaliated. Let him read that on the Internet too.  “Well, they may be mindless, but they’re not stupid,” he said.  We flew on until the light failed, but, as if it had heard him, the beast did not reappear.   “It would be wrong to think of the squid as a failure of technology. The technology worked, from the plastic filtration, to the self-replication and algorithmic learning.  “Also do not forget that they succeeded in their original purpose—they did clean up the waters and they did save fish stocks from extinction.  “The failure, if you can truly call it that, is ours. We failed to see that life, even created life, will never behave exactly as we intend.  “The failure was not in the squids’ technology, or in their execution. It was in our imagination.”  —From the inaugural address of Ireland’s last president, Francis Robinson  A basket of chips and fried ‘goujons’ of catfish had appeared in front of us, gratis. I dived in, sucking sea salt and smoky, charred fish skin from my fingertips. Más looked over the bar into the middle distance.  “Don’t tell me you don’t like fish,” I said. “That would be too funny.”  “That’s not real fish.”  Más had progressed to whiskey and a bitter humor sharpened his tongue.  “It tastes pretty real,” I said. I had heard all the scare stories about fish farming.  He held up a calloused hand, as if an orator or bard about to recite. The other was clenched, to punctuate his thoughts.  “Why is it, do you think, that we are trying to replicate the things we used to have?  “Like, if most people can still eat ‘fish,’ or swim in caged bloody lidos, or if cargo comes by airship or whatever, then the more normal it becomes. And it shouldn’t be bloody normal. It’s not normal.”  The barmaid rolled her eyes. Clearly, she had heard the rant before.  I told him I agreed with the swimming bit inasmuch as I wouldn’t personally miss it terribly if I could never do it again, but that farmed fish didn’t bother me and that I thought most people never considered where their goods came from, even before the squid.  Disappointment, whether at me or the world, wilted in his face before he let the whiskey soften him again. His shoulders lowered, his hands relaxed and the melody of his voice reasserted itself.  “When I was a boy, my father once told me a story about trying to grow trees in space.”  I coughed mid-chew and struggled to dislodge a crumb of batter from my throat. With tears in my eyes, I waved him on. I don’t know why, but it amused me to hear an old salt like Más talk about orbital horticulture.  “Well, these guys on Spacelab or wherever, they tried growing them in perfect conditions, perfect nutrients, perfect light, even artificial gravity. They would all shoot straight up, then keel over and die. Every tree seed they planted—pine, ash, oak, cypress—they all died. Nobody could figure out what was wrong. Everything a plant could need was provided, perfectly measured. These were the best cared for plants in the world.”  “In the solar system,” I ribbed him.  “Right. In the solar system. Except for one thing. Do you know what was missing?  “No. Tell me.”  “A breeze. Trees develop the strength, the woody cells, to support their weight by resisting the blow of the wind. Without it, they falter and sicken.”  I didn’t really get his point and told him so.  “You can’t sharpen a blade without friction. You can’t strengthen a man, or a civilization, without struggle. Airships and swimming pools and virtual bloody sailing. It’s all bollocks. We should be hauling these things out of the water, like they said we would.”  He gestured through the window of the bar to the gray bulk of the cathedral looming in the fog.  “There was a reason Jesus was a fisherman,” said Más, as if a closing statement.  I didn’t know what to say to that.  The barmaid leaned over the bar to clear the empty baskets.  “Jesus was a carpenter, Más,” she said.   “Six sea scouts, aged eleven to fourteen, had left the fishing town of Castletown-berehaven in a rigid inflatable boat, what they call a ‘rib.’ Their scout leader was at the helm, an experienced local woman named De Paor.  “The plan was to take the boys and girls out around nearby Bere Island to spot seals and maybe porpoises.  “About an hour into the journey, contact was lost. The boat was never found, but most of the bodies washed up a day or so later, naked and covered in long ragged welts. Initial theories said they must have been chewed up by a propeller on a passing ship, but there was nothing big enough near the coast.  “Post-mortem examinations clinched it. The state pathologist pulled dozens of small plastic barbs from each child. They were quickly identified as belonging to the squid.  “A later investigation concluded that the fault lay with a cheap brand of sunscreen one of the children had brought and shared with her shipmates. A Chinese knock-off of a French brand, it contained old stocks of petro-derived nanoparticles. Just as the squid had pulped tonnes of fish to get at the plastic in their flesh in year twelve, they had tried to remove all traces of the petro from the children.”  —Jennings, Margaret, When The World Stopped Shrinking, p34  Más’s house was beyond the western end of the town, past a small turning circle for cars. A path continued to a rocky beach, but was used only by courting couples, dog walkers, or drinking youngsters. A wooden gate led off the beach, where a small house sat behind a quarter-acre of lawn and an old boathouse.  Síle, the barmaid, had told me where he lived. Más usually gave up carving at about four, she said, had a few drinks in a few places and was usually home about six.  I started for the main house, when I heard a noise. A low murmur, like a talk radio station heard through a wall. It was coming from the boathouse.  I made my way across the lawn. Almost unconsciously I was walking crab-like on the balls of my feet, with my arms outstretched for balance. The boathouse was in bad shape. Green paint had blistered on the ship-lapped planks and lichen or moss had crept halfway up the transom windows above the large double doors.  The fabric of the place was so weathered I didn’t have to open them. Planks had shrunk and split at various intervals, leaving me half a dozen spyholes to the interior. I quietly pressed my eye to one and peered inside.  Under the light of a single work lamp, I could see Más standing at a bench, his back to me, and wearing a T-shirt and jeans. Without the souwester, he looked more like an ageing rock star than a fisherman and more like twice my age than the three times I had assumed.  Beyond him lay several bulky piles, perhaps of wood, covered by tarpaulin and shrouded in shadow.  A flagstone floor ran all the way to the other wall, where there lay a dark square of calm water—a man-made inlet of dressed stone, from which rose the cold smell of the sea. A winch was bolted to the floor opposite a rusty iron gate that blocked the water from the estuary. Smaller, secondary doors above protected the interior from the worst of the elements.  As he worked, Más whistled.  I recognized enough of the tune to know it was old, but its name escaped me. It felt as manipulative as most traditional music—as Más whistled the chorus, it sounded like a happy tune, but I knew there would be words to accompany it and odds were, they would tell of tragedy.  Más began to wind down, cleaning tools with oil-free cloths. I had told myself this was not spying, this was interest, or concern. But suddenly, I became embarrassed. I silently padded back across his lawn. I would call on him another night.  As I stepped back onto the path between two overgrown rhododendron bushes, my foot collided with a rusty old garden lantern with a musical crash. I just had enough presence of mind to turn again so I was facing the house, trying to look like I had just arrived.  It was in time for Más to see me as he emerged from the boathouse to investigate. I waved as nonchalantly as I could.  He leaned back inside the door and must have flicked a switch, as his garden was suddenly bathed in light from a ring of security floods under the eaves of his house.  I waved again as he re-emerged, confident that he could at least see me this time.  “Oh it’s you,” he said.  “Hi. Yes, the barmaid, Síle, gave me your address. I hope you don’t mind.  “Well, come in so. I have no tea, I’m afraid. I may have some chicory.”  I raised the bottle in my hand and gave it a wiggle.   “In the early days after their ‘revolution,’ the squid featured in one scare story after another. They would evolve legs and stalk the landscape like Wells’s Martians, they would form a super-intelligence capable of controlling the world’s nuclear arsenal, or they would start harvesting the phytoplankton that provide most of the world’s breathable oxygen.  “In the end, they did what biological organisms do—they found their own equilibrium. Any reactions of theirs since are no more a sign of ‘intelligence’ than a dog defending its front yard.”  —Edward Mission, The Spectator’s Big Book of Science  Perrott banked the plane again. It was the first flight during which I had felt ill. The day was squally and overcast, the sky lidded with a leaden dome of cloud.  The squid breached the water, rolling its “tentacles” behind it. There was no reason for the maneuver, according to the original designers, which made it look even more biological. But even from this altitude, I could see the patterns of old plastic the thing had used to build and periodically repair itself.  “He’s a big one,” said Perrott, who was clearly enjoying himself.  The beast dived again. Just as it sank out of sight in the dying light, I counted eight much smaller shadows behind it. Each breached the surface of the water and rolled their tentacles, just as their colossal “parent” had.  “Shit.”  These were sleeker machines, of a green so deep it may as well have been black. There was no wasted musculature, no protrusions to drag in the water as they slipped by. These things would never reach the size of the squid that had manufactured them, but that didn’t matter. They were fast and there were more of them.  “Problem?” said Perrott.  “Yes. Somebody isn’t playing by the rules.”  “I had a friend. Val. Killed himself.”  Más had had a lot to drink, mostly the whiskey I had brought, but also a homemade spirit, which smelled faintly methylated. His face sagged under the influence of alcohol, but his voice became brighter and clearer with each drink. The stove roared with heat, the light from its soot-stained window washing the kitchen in sepia.  I wasn’t sure if he was given to maudlin statements of fact such as this when drunk, or whether this was an opening statement, so I said “I’m sorry to hear that. When did that happen?”  “A while back.”  I was still adrift—I didn’t know if it was a long time ago and he had healed, or recently and his emotions were strictly battened down. Before I could ask another qualifying question, he continued.  “When we were teenagers, a couple of years after the squid were introduced, Val and I went fishing from the pier one October when the mackerel were in.”  “By God, they were fun to catch. Val had an old fiberglass rod that belonged to his dad, or his granddad. The cork on the handle was perished, the guides were brown with rust, but as long as you used a non-petro line, the squid didn’t bother you in those days. We caught a lot of fish that year.  “So as we pulled them out, I would unhook them and launch them back into the tide. They were contaminated with all sorts of stuff, heavy metals, plastic, even carbon fiber from the boat hulls. After I had done this once or twice, Val asked me why. I said ‘well you can’t eat them, so why not let them go.’ And Val said ‘fuck them, they’re only fish.’  “After that, every fish he caught, every one, he would brain and chop up there on the pier and leave for the gulls to eat. He was my friend, but he was cruel.  “The trouble with the squid is they think about us the way Val thought about fish. We’re not food, we’re not sport. I’m not sure they know what we are. I’m not sure they care.”  For a moment, sobriety surfaced. Más looked forlorn. I dreaded the words that would come next. I had become quite good at predicting his laments and tirades.  “We don’t fight for it, for the territory, or for the people we lost. For the love of God, these things ate children, and we just accept it. We should be out there every bloody day, hunting these things.”  I told him I understood the desire to hurt them, that many had tried, but it just didn’t work like that. That most people preferred to pretend they just weren’t there, like fairy-tale villagers skirting the wood where the big bad wolf lived.  “But why,” he demanded.  “Well they are ‘protected’ now, for starters,” I said. “They fight back. But I suppose the main reason is it’s easier than the reality.”  “Easier,” he scoffed.  He raised his glass, to let me know it was my turn to speak. But I didn’t know how to comfort him. So I let him comfort me.  “Your family owned trawlers, right? What’s it like? To go out on the ocean?”  Drunk, in the heat of his kitchen, I closed my eyes and listened.    “The raincoat suicides were a foreseeable event inasmuch as such events happen after many profound and well-publicised changes to people’s understanding of the world around them. The Wall Street Crash, Brexit, the release of the Facebook Files. It is a form of end-of-days-ism that we have seen emerge again and again, from military coups to doomsday cults.  “Most of the people who took their own lives had previously displayed signs of moderate to severe mental illness. That the locations of more than two hundred of the deaths were confined to areas with high sea cliffs, such as Dover in England or the Cliffs of Moher in Co Clare, adds fuel to the notion that these were tabloid-inspired suicides, sadly, but predictably, adopted by already unwell people.”  —Jarlath Kelleher, The Kraken sleeps: reporting of suicide as ‘sacrifice’ in British and Irish media (Undergraduate thesis, Dublin Institute of Technology)  He pulled the tarpaulin off with a flourish. The green-black boat sat upside down on two sawhorses, like an orca, stiff with rigor mortis, beached on pointed rocks.  It was a naomhóg. In the west, I found out later, it was called a currach, but this far south, people called it a naomhóg. Depending on who you asked, it meant ‘little saint’ or ‘young saint,’ as if the namers were asking God and the sea to spare it.  It was made of a flexible skin, stretched tightly over a blond wooden frame. I dropped to the floor to look inside, still unable to talk. I knew nothing about boat-building in those days, but the inside looked like pure craftsmanship.  It was almost the most rudimentary of constructed vessels and in place of oars it had long spars of unfeathered wood. But where a normal naomhóg was finished with hide or canvas and waterproofed with pitch, Más’s boat was hulled in what looked like glossy green-black plastic stretched over its ribs and stapled in place on the inside of the gunwale.  I ran my hand along the hull. The skin, which looked constantly wet, was bone-dry and my fingers squeaked. They left no fingerprints. I knew instantly what it was, but I wished I didn’t.  “Will you come with me? I’d like to show you my harbor. We might even catch something.”  He was so proud, of his vessel, of his hometown. I couldn’t say anything else.  “I will,” I lied. “Tomorrow, if the fog lifts.”   “I remember the harbour before the squid. The water teemed with movement. Ships steamed up the channel to the container ports upriver, somehow avoiding the small launches, in a complicated dance against outgoing or incoming tides, taking people to and from work at the steelworks on the nearest of the islands. Under the guidance of a harbourmaster sitting in his wasp-striped control tower, warships slipped sleekly from the naval base to hunt drug smugglers or Icelandic trawlers. An occasional yacht tied up at the floating pontoon of a small waterside restaurant. In summer, children dared each other to ‘tombstone’ from the highest point of the piers.  “When I returned to the island, it might as well have been surrounded by tarmac, like a derelict theme park. Nobody even looked to the sea. It was easier that way.”  —Elaine Theroux, The Great Island  It was bright outside when I left Más’s house. He had more friends, or at least acquaintances, than I had thought. None outwardly seemed to blame me for what had happened. Many expressed surprise he had made it that far.  Más himself had been less forgiving. After I turned him in, the local police superintendent let me talk to him. Más told me he hated me, called me a “fucking English turncoat.” He spat in my face.  I told him he didn’t understand. That he had been lucky until now. Lucky he hadn’t been killed. That they hadn’t retaliated.  I wanted to tell him we were working on things to kill them, to infect them, to turn them on each other. I wanted to tell him to wait until the harbor mouth was closed, that the nets were in place, that he could soon take to the water off Ballyvoloon every day. That I would go with him.  But I couldn’t and none of it would have mattered anyway.  I had betrayed him. And I found I could live with it.  Between Más’s house and Ballyvoloon is a harbor-side walkway known simply as ‘the water’s edge.’ The pavement widens dramatically in two places to support the immense red-brick piers of footbridges that connect the old Admiralty homes, on the other side of the railway line, to the sea. I climbed the wrought iron steps to the peak and surveyed the harbor, my arms resting on the mossy capstones of the wall. The sun was rising over the eastern headland, bright and cold.  I took the phone from my pocket and watched the coroner’s video.  It was mostly from one angle, from a camera I had often passed high atop an antique lamppost preserved in the middle of the main street. The quality was good, no sound, but the colors of Ballyvoloon were gloriously recreated in bright sunshine. The camera looked east, past the pier and along the beach to the old town hall, now a Chinese takeaway.  There, just visible over the roof of the taxi stand office, sat Más on his rock, whittling and chipping at a piece of wood. The email from the coroner said he had sat there there all morning, but she must have supposed that I didn’t need to watch all of that.  At 4pm, his usual knocking-off time, he stood, stretched his back in such an exaggerated way I thought I could hear the cracks of his vertebrae, and packed his things into a large, waterproof sail bag. Carrying his pink-and-white jacket over one arm, he walked toward the camera, hailing anyone he met with a wave, but no conversation.  However, rather than cross the beach for the bar at Tom’s, he turned left down the patched concrete of the pier.  At that time of day it was deserted. The last of the stalls had packed up, the tourists had made for their trains or their buses.  The angle switched to another camera, on the back of the old general post office, perhaps. It showed Más standing with his toes perfectly aligned to the edge of the concrete pier’s ‘T.’ After a few minutes, he removed several things from his pockets, folded his jacket, and placed it on the concrete.  He opened the bag and withdrew a banana-yellow set of antique, old-petro waterproofs. He stepped into the thick, rubbery trousers before donning the heavy jacket and securing its buttons and hooks.  He walked to the top of the rotten steps, looked up at the cathedral and made a sign of the cross. Then he descended the steps, sinking from view.  There was nothing for more than a minute, but the video kept running, the pattern of wavelets kept approaching the shore, birds kept wheeling in the sky.  In a series of small surges, the prow of the naomhóg emerged from under the pier, then Más’s head, his face towards the town, then the rest of his body and the boat.  I had to hand it to him. He could have launched his vessel at dead of night from the little boathouse where he had built the others, but he chose the part of town most visible to the cameras, at a time when few people would be around to stop or report him.  With each pull on the oars, he sculled effortlessly through the gentlest of swells, his teeth bared in joy.  His yellow oilskins shone in contrast against the dark greens of his boat and the surrounding water as he made for the mouth of his harbor and the open sea beyond.  “Yet fish there be, that neither hook, nor line, nor snare, nor net, nor engine can make thine.”  —John Bunyan, The Pilgrim’s Progress Finbarr O’Reilly is an Irish speculative fiction writer who likes to explore how broken technologies or unearthly events affect intimate locales. Why would you want to write about alien battleships invading New York when you can imagine little green men asking for directions from a short-tempered undertaker in Carrigtwohill, Co Cork. He has previously been published in Clarkesworld and in the anthologies The Best Science Fiction of the Year, edited by Neil Clarke, and The Year’s Best Science Fiction, edited by Gardner Dozois.  Finbarr has worked as a journalist for almost twenty years, most of those as a sub-editor (copy-editor).  Like many Irish writers, Finbarr lives in self-imposed exile. He currently resides with his wife and two children in a small town in Lincolnshire, UK, too far from the sound of gulls and the smell of saltwater.", "text": "5870 words, short story\nThe Last Boat-Builder in Ballyvoloon\n“There are of a certainty mightier creatures, and\nthe lake hides what neither net nor fine can take.”\n—William Butler Yeats, The Celtic Twilight\nThe first time I met Más, he was sitting on the quayside in Ballyvoloon, carving a nightmare from a piece of linden. Next to him on the granite blocks that capped the seawall lay a man’s weatherproof jacket and hat, in electric pink. The words “petro-safe” were pin-striped across them in broad white letters, as if a spell that would protect him from the mechanical monster he whittled.\nShort of smoking a pipe, Más looked every inch a nineteenth-century whaler. Veined cheeks burned and burnished by sun and wind to a deep cherry gloss, thick gray hair matted and flattened from his souwester and whiskers stiff enough with salt to resist the autumnal breeze blowing in from the harbor mouth.\nI had arrived in Ballyvoloon early on a Friday morning. My pilot would not fly till Monday, so I spent the weekend walking the town. Its two main streets, or “beaches” as the locals called them, ran east and west of a concrete, T-shaped pier.\nIt was near the bottom of the ‘T’ that Más set out his pitch every day, facing the water, but sheltered by thousands of tonnes of rock and concrete.\nBallyvoloon was a town best approached from the sea. The faded postcards on sale along the beachfront showed it from that rare perspective. Snapped from the soaring pleasure decks of ocean-going liners long scrapped or sunk, ribbons of harlequin houses rose from coruscant waters, split by the immense neo-Gothic cathedral that crowns the town. Nowadays, the fret-sawn fascias of pastel shopfronts shed lazy flakes of paint into the broad streets and squares below. It has faded, but there is grandeur there still.\nBetween the town’s rambling railway station and my hotel, I had passed a dozen or more artists, their wares tied to the railings of the waterside promenade, or propped on large boards secured to lampposts, but none dressed like Más. Nor did any carve like him.\n“That looks realistic,” I said, my heart pounding, as he snicked delicate curls of blond wood from the block with a thick-spined blade.\n“There’s not much point sugarcoating them,” he said, his voice starting as a matter-of-fact drawl, but ending in the singsong accent of the locals.\n“How long have you been a sculptor?” I asked.\n“I’m not a sculptor. This is just something to occupy the hands.”\n“The devil’s playthings, eh?”\nHe stopped carving and looked up at me through muddy green eyes.\n“Something like that.”\nMás lowered the squid he was working on and cast around in the pocket of his jacket. He removed three of the monsters, perfectly carved, but in different sizes and woods, one stained black and polished. The colors seemed to give each one slightly different intents, but none was reassuring.\nOther artists carved or drew or painted the squid, but they had smoothed out the lines, removed the barbs, the beaks, gave the things doe-eyes and even smiles and made them suitable to sit atop a child’s bedclothes or a living room bookshelf.\nMás did the opposite. He made the horrific more horrifying. He made warm, once-living wood look like the doubly dead, glossy plastic of the squids. These were not the creatures we had released, but their more deadly and cunning offspring.\nI hid my excitement as well as I could.\n“Sixty for one or one hundred for a pair,” he said.\nMás let the moment stretch until the sheer discomfort of it drove me to buy.\nHis mood brightened and he immediately began packing up his belongings. I had clearly overpaid and he could afford to call it a day.\n“See you so,” he said, cheerfully and sauntered off into the town.\nOnce I was back at the hotel, I unwrapped the parcel and inspected the sculptures, to confirm my suspicions.\nThe other artists may have outsold Más’s squid six or seven times, but he was the only of them who had seen a real one.\n“Twelve years after the squid were introduced, the west coast of Europe endured a number of strange phenomena. Firstly, the local gull population bloomed. The government and the squids’ manufacturer at the time said it was a sign of fish stocks returning to normal, that it was evidence the squid were successful in their mission.\n“Local crab numbers also exploded, to the point that water inlets at a couple of coastal power stations were blocked. The company linked this to the increased gull activity, increasing the amount of food falling to the seafloor.”\n—Hawes, J. How We Lost the Atlantic, p32\nThe first flight was late in the afternoon, a couple of hours before sunset. This would give me the best chance of spotting things in the water, as it was still bright enough to see and anything poking above the surface would cast a longer shadow.\nThe pilot, a taciturn, bearded fellow in his sixties called Perrott, flicked switches and toggles as he went through what passed for a safety briefing.\n“If we ditch, it will take about fifteen minutes for the helo to reach us from the airport. The suits will at least make that wait comfortable, assuming, you know . . . ”\nWe both wore survival suits of neon-pink non-petro, covering everything but hands and heads. His was molded to his frame and visibly worn on the elbows and the seat of his pants. Mine squeaked when I walked and still smelled of tart, oleophobic soy.\n“Yes. I know,” I said, as reassuringly as I could manage.\nAs he tapped dials and entered numbers on a clipboard, I thought of my first flight over water.\nMy sea training was in Wales, where an ancient, ex-RNLI helicopter dropped me about half a mile from shore. It was maybe twenty-five feet to the water, but the fall was enough to knock the breath out of me. The crew made sure I was still kicking and moved back over land. The idea was to get me to panic, I suppose. They needn’t have worried. The helicopter was away for a total of eight minutes and if my heart could have climbed my gullet to escape my chest, it would have.\nAfter they pulled me back up, I asked the winchman how I had done.\n“No worse than most,” he shouted.\nHe took a flashbang grenade from a box under the seat, pulled the pin, and dropped it out the open door. He counted down from four on his fingers. Over the roar of the rotors, I heard neither splash nor detonation. The winchman made sure I was harnessed, then pointed out the door and down.\nA couple of miles away, I could see three or four squid making for a spot directly beneath us, all of them moving so fast they left a wake.\nHe gave me a torturer’s grin.\n“Better than some.”\n“We seen them first, the slicks. That’s what they looked like in the pictures, like some tanker or bulker had washed her tanks. But as we got close we could see it was miles and miles of chopped up fish. And the smell! That’s what the locals still call that summer—the big stink.\n“When we got back we found out the squid had become more . . . hungry, I suppose, and instead of pulling the bits of plastic out of the water, they started pulling ‘em out of the fish. Sure we had been eating that fish for years and it never did us any harm.”\n—Trevor Cunniffe, trawlerman, in an interview for Turn Your Back to the Waves, an RTÉ radio documentary marking fifty years since the squids’ introduction\nAfter two days of fruitless flights, I was grounded by fog. Late in the afternoon, I went to a pub. I sat at the long side of the L-shaped bar, inhaling the fug of old beer and new urinal cakes.\nThe signage, painted in gold leaf on the large windows, had faded and peeled, so I asked a patron what the place was called. “Tom’s” was the only reply, offering no clue if this was the original name of the pub or the latest owner.\nBetween the bottles shelved on the large mirror behind the bar, I saw the figure of a man in a candy-striped pink jacket through the rippled privacy glass of the door. It opened and Más walked in. He gently closed it behind him and moved to a spot at the end of the bar. He kept his head down, but couldn’t escape recognizing some regulars and nodded a salute to them.\nEmboldened by alcohol, I raised my drink.\n“How is the water today?” I asked.\nThe barmaid gave me a look as if to ask what I was doing engaging a local sot, but I smiled at her for long enough that she wandered off, reassured or just bored at my insincerity.\n“About the same,” said Más. “Visibility’s not very good.”\n“No,” I said. “That’s why I’m in here. No flights today.”\n“Are you off home then,” Más asked.\nI interpreted the question as an invitation and walked over to take the stool next to him.\n“Not quite,” I said. “Will you have a drink?”\n“I will,” he said. “So, what has you in town?”\nAt first, Más didn’t seem too bothered when I explained who I worked for, or at least he didn’t ask the usual questions or put forward the usual conspiracy theories about the squid.\n“A job’s a job, I suppose.”\nHis eyes wrinkled, amused at a joke hidden to me. “So do ye all have jobs in England, then?”\nIreland had been on universal income for the better part of two decades. It was hard to see how people like Más would have survived otherwise.\n“No, not by a long chalk. The only reason I got this one is I wasn’t afraid to cross the sea in a plane.”\n“More fool you.”\n“You have to die of something, I told them. And it was quite exciting, in the end.”\nAs the light faded, the mid-afternoon drinkers gave way to a younger, louder crowd, but Más and I still sat, talking.\nI described the huge reservoir near where I lived in Rutland, where people could still swim and sail and fish, and how everyone worried that the squid would somehow reach it, denying us access, like Superior or the Caspian.\nHe asked me what on Earth would make me leave such a place.\n“I wanted to see the world. I needed a job,” I said.\nHe laughed. “Those used to be the reasons people joined the Navy.”\nPerrott’s plane was old, but well serviced. It started first time and once we finished our climb, the engine settled into a bagpipe-like drone.\nWe crossed the last headland and the cheerful baize below, veined in drystone walls, gave way to gray waves, maned in white.\nHe radioed the Cork tower to tell them we were now over open water and that the rescue team was on formal standby.\nHe adjusted the trim of the plane to a point where he was happy to let the thing fly itself and joined me in scanning the waters below.\nIt was less than half an hour, until his pilot’s eye spotted it. Perrott took the controls again and banked to give me a better view. I let the video camera run, while I used the zoom lens to snap any identifying features.\nFrom the size of the blurred shape rippling just beneath the surface, I could tell it was old, seventh or eighth generation, perhaps, but I really wanted a more detailed look.\nI told Perrott I would like to make another pass.\n“If only we had a bomb, eh?” he said. Sooner or later, everyone suggests it.\n“We tried that,” I said.\n“Oh yeah?”\nPerrott had signed a non-disclosure agreement before the flight. It didn’t matter what I told him. Most of it was already on the Internet, in any case.\n“Yes. First they bombed an oil platform in the Gulf of Mexico and opened up its wellhead. Miles from shore, so any oil that escaped would be eaten by the squid or burned in the fire.”\nHundreds of thousands of the things had come, enough that you could see the black stain spread on satellite images. I had only watched the video. I couldn’t imagine how chilling it had been to observe it happen live.\n“Then the Americans dropped three of the biggest non-nukes they’ve got on them.”\n“It didn’t work, then?”\n“No. Any squid more than a dozen feet or so below the surface were protected by the water. We vaporized maybe half of them. After that they stayed deep, mostly.”\nI didn’t tell Perrott about the Mississippi and how the squid had retaliated. Let him read that on the Internet too.\n“Well, they may be mindless, but they’re not stupid,” he said.\nWe flew on until the light failed, but, as if it had heard him, the beast did not reappear.\n“It would be wrong to think of the squid as a failure of technology. The technology worked, from the plastic filtration, to the self-replication and algorithmic learning.\n“Also do not forget that they succeeded in their original purpose—they did clean up the waters and they did save fish stocks from extinction.\n“The failure, if you can truly call it that, is ours. We failed to see that life, even created life, will never behave exactly as we intend.\n“The failure was not in the squids’ technology, or in their execution. It was in our imagination.”\n—From the inaugural address of Ireland’s last president, Francis Robinson\nA basket of chips and fried ‘goujons’ of catfish had appeared in front of us, gratis. I dived in, sucking sea salt and smoky, charred fish skin from my fingertips. Más looked over the bar into the middle distance.\n“Don’t tell me you don’t like fish,” I said. “That would be too funny.”\n“That’s not real fish.”\nMás had progressed to whiskey and a bitter humor sharpened his tongue.\n“It tastes pretty real,” I said. I had heard all the scare stories about fish farming.\nHe held up a calloused hand, as if an orator or bard about to recite. The other was clenched, to punctuate his thoughts.\n“Why is it, do you think, that we are trying to replicate the things we used to have?\n“Like, if most people can still eat ‘fish,’ or swim in caged bloody lidos, or if cargo comes by airship or whatever, then the more normal it becomes. And it shouldn’t be bloody normal. It’s not normal.”\nThe barmaid rolled her eyes. Clearly, she had heard the rant before.\nI told him I agreed with the swimming bit inasmuch as I wouldn’t personally miss it terribly if I could never do it again, but that farmed fish didn’t bother me and that I thought most people never considered where their goods came from, even before the squid.\nDisappointment, whether at me or the world, wilted in his face before he let the whiskey soften him again. His shoulders lowered, his hands relaxed and the melody of his voice reasserted itself.\n“When I was a boy, my father once told me a story about trying to grow trees in space.”\nI coughed mid-chew and struggled to dislodge a crumb of batter from my throat. With tears in my eyes, I waved him on. I don’t know why, but it amused me to hear an old salt like Más talk about orbital horticulture.\n“Well, these guys on Spacelab or wherever, they tried growing them in perfect conditions, perfect nutrients, perfect light, even artificial gravity. They would all shoot straight up, then keel over and die. Every tree seed they planted—pine, ash, oak, cypress—they all died. Nobody could figure out what was wrong. Everything a plant could need was provided, perfectly measured. These were the best cared for plants in the world.”\n“In the solar system,” I ribbed him.\n“Right. In the solar system. Except for one thing. Do you know what was missing?\n“No. Tell me.”\n“A breeze. Trees develop the strength, the woody cells, to support their weight by resisting the blow of the wind. Without it, they falter and sicken.”\nI didn’t really get his point and told him so.\n“You can’t sharpen a blade without friction. You can’t strengthen a man, or a civilization, without struggle. Airships and swimming pools and virtual bloody sailing. It’s all bollocks. We should be hauling these things out of the water, like they said we would.”\nHe gestured through the window of the bar to the gray bulk of the cathedral looming in the fog.\n“There was a reason Jesus was a fisherman,” said Más, as if a closing statement.\nI didn’t know what to say to that.\nThe barmaid leaned over the bar to clear the empty baskets.\n“Jesus was a carpenter, Más,” she said.\n“Six sea scouts, aged eleven to fourteen, had left the fishing town of Castletown-berehaven in a rigid inflatable boat, what they call a ‘rib.’ Their scout leader was at the helm, an experienced local woman named De Paor.\n“The plan was to take the boys and girls out around nearby Bere Island to spot seals and maybe porpoises.\n“About an hour into the journey, contact was lost. The boat was never found, but most of the bodies washed up a day or so later, naked and covered in long ragged welts. Initial theories said they must have been chewed up by a propeller on a passing ship, but there was nothing big enough near the coast.\n“Post-mortem examinations clinched it. The state pathologist pulled dozens of small plastic barbs from each child. They were quickly identified as belonging to the squid.\n“A later investigation concluded that the fault lay with a cheap brand of sunscreen one of the children had brought and shared with her shipmates. A Chinese knock-off of a French brand, it contained old stocks of petro-derived nanoparticles. Just as the squid had pulped tonnes of fish to get at the plastic in their flesh in year twelve, they had tried to remove all traces of the petro from the children.”\n—Jennings, Margaret, When The World Stopped Shrinking, p34\nMás’s house was beyond the western end of the town, past a small turning circle for cars. A path continued to a rocky beach, but was used only by courting couples, dog walkers, or drinking youngsters. A wooden gate led off the beach, where a small house sat behind a quarter-acre of lawn and an old boathouse.\nSíle, the barmaid, had told me where he lived. Más usually gave up carving at about four, she said, had a few drinks in a few places and was usually home about six.\nI started for the main house, when I heard a noise. A low murmur, like a talk radio station heard through a wall. It was coming from the boathouse.\nI made my way across the lawn. Almost unconsciously I was walking crab-like on the balls of my feet, with my arms outstretched for balance. The boathouse was in bad shape. Green paint had blistered on the ship-lapped planks and lichen or moss had crept halfway up the transom windows above the large double doors.\nThe fabric of the place was so weathered I didn’t have to open them. Planks had shrunk and split at various intervals, leaving me half a dozen spyholes to the interior. I quietly pressed my eye to one and peered inside.\nUnder the light of a single work lamp, I could see Más standing at a bench, his back to me, and wearing a T-shirt and jeans. Without the souwester, he looked more like an ageing rock star than a fisherman and more like twice my age than the three times I had assumed.\nBeyond him lay several bulky piles, perhaps of wood, covered by tarpaulin and shrouded in shadow.\nA flagstone floor ran all the way to the other wall, where there lay a dark square of calm water—a man-made inlet of dressed stone, from which rose the cold smell of the sea. A winch was bolted to the floor opposite a rusty iron gate that blocked the water from the estuary. Smaller, secondary doors above protected the interior from the worst of the elements.\nAs he worked, Más whistled.\nI recognized enough of the tune to know it was old, but its name escaped me. It felt as manipulative as most traditional music—as Más whistled the chorus, it sounded like a happy tune, but I knew there would be words to accompany it and odds were, they would tell of tragedy.\nMás began to wind down, cleaning tools with oil-free cloths. I had told myself this was not spying, this was interest, or concern. But suddenly, I became embarrassed. I silently padded back across his lawn. I would call on him another night.\nAs I stepped back onto the path between two overgrown rhododendron bushes, my foot collided with a rusty old garden lantern with a musical crash. I just had enough presence of mind to turn again so I was facing the house, trying to look like I had just arrived.\nIt was in time for Más to see me as he emerged from the boathouse to investigate. I waved as nonchalantly as I could.\nHe leaned back inside the door and must have flicked a switch, as his garden was suddenly bathed in light from a ring of security floods under the eaves of his house.\nI waved again as he re-emerged, confident that he could at least see me this time.\n“Oh it’s you,” he said.\n“Hi. Yes, the barmaid, Síle, gave me your address. I hope you don’t mind.\n“Well, come in so. I have no tea, I’m afraid. I may have some chicory.”\nI raised the bottle in my hand and gave it a wiggle.\n“In the early days after their ‘revolution,’ the squid featured in one scare story after another. They would evolve legs and stalk the landscape like Wells’s Martians, they would form a super-intelligence capable of controlling the world’s nuclear arsenal, or they would start harvesting the phytoplankton that provide most of the world’s breathable oxygen.\n“In the end, they did what biological organisms do—they found their own equilibrium. Any reactions of theirs since are no more a sign of ‘intelligence’ than a dog defending its front yard.”\n—Edward Mission, The Spectator’s Big Book of Science\nPerrott banked the plane again. It was the first flight during which I had felt ill. The day was squally and overcast, the sky lidded with a leaden dome of cloud.\nThe squid breached the water, rolling its “tentacles” behind it. There was no reason for the maneuver, according to the original designers, which made it look even more biological. But even from this altitude, I could see the patterns of old plastic the thing had used to build and periodically repair itself.\n“He’s a big one,” said Perrott, who was clearly enjoying himself.\nThe beast dived again. Just as it sank out of sight in the dying light, I counted eight much smaller shadows behind it. Each breached the surface of the water and rolled their tentacles, just as their colossal “parent” had.\n“Shit.”\nThese were sleeker machines, of a green so deep it may as well have been black. There was no wasted musculature, no protrusions to drag in the water as they slipped by. These things would never reach the size of the squid that had manufactured them, but that didn’t matter. They were fast and there were more of them.\n“Problem?” said Perrott.\n“Yes. Somebody isn’t playing by the rules.”\n“I had a friend. Val. Killed himself.”\nMás had had a lot to drink, mostly the whiskey I had brought, but also a homemade spirit, which smelled faintly methylated. His face sagged under the influence of alcohol, but his voice became brighter and clearer with each drink. The stove roared with heat, the light from its soot-stained window washing the kitchen in sepia.\nI wasn’t sure if he was given to maudlin statements of fact such as this when drunk, or whether this was an opening statement, so I said “I’m sorry to hear that. When did that happen?”\n“A while back.”\nI was still adrift—I didn’t know if it was a long time ago and he had healed, or recently and his emotions were strictly battened down. Before I could ask another qualifying question, he continued.\n“When we were teenagers, a couple of years after the squid were introduced, Val and I went fishing from the pier one October when the mackerel were in.”\n“By God, they were fun to catch. Val had an old fiberglass rod that belonged to his dad, or his granddad. The cork on the handle was perished, the guides were brown with rust, but as long as you used a non-petro line, the squid didn’t bother you in those days. We caught a lot of fish that year.\n“So as we pulled them out, I would unhook them and launch them back into the tide. They were contaminated with all sorts of stuff, heavy metals, plastic, even carbon fiber from the boat hulls. After I had done this once or twice, Val asked me why. I said ‘well you can’t eat them, so why not let them go.’ And Val said ‘fuck them, they’re only fish.’\n“After that, every fish he caught, every one, he would brain and chop up there on the pier and leave for the gulls to eat. He was my friend, but he was cruel.\n“The trouble with the squid is they think about us the way Val thought about fish. We’re not food, we’re not sport. I’m not sure they know what we are. I’m not sure they care.”\nFor a moment, sobriety surfaced. Más looked forlorn. I dreaded the words that would come next. I had become quite good at predicting his laments and tirades.\n“We don’t fight for it, for the territory, or for the people we lost. For the love of God, these things ate children, and we just accept it. We should be out there every bloody day, hunting these things.”\nI told him I understood the desire to hurt them, that many had tried, but it just didn’t work like that. That most people preferred to pretend they just weren’t there, like fairy-tale villagers skirting the wood where the big bad wolf lived.\n“But why,” he demanded.\n“Well they are ‘protected’ now, for starters,” I said. “They fight back. But I suppose the main reason is it’s easier than the reality.”\n“Easier,” he scoffed.\nHe raised his glass, to let me know it was my turn to speak. But I didn’t know how to comfort him. So I let him comfort me.\n“Your family owned trawlers, right? What’s it like? To go out on the ocean?”\nDrunk, in the heat of his kitchen, I closed my eyes and listened.\n“The raincoat suicides were a foreseeable event inasmuch as such events happen after many profound and well-publicised changes to people’s understanding of the world around them. The Wall Street Crash, Brexit, the release of the Facebook Files. It is a form of end-of-days-ism that we have seen emerge again and again, from military coups to doomsday cults.\n“Most of the people who took their own lives had previously displayed signs of moderate to severe mental illness. That the locations of more than two hundred of the deaths were confined to areas with high sea cliffs, such as Dover in England or the Cliffs of Moher in Co Clare, adds fuel to the notion that these were tabloid-inspired suicides, sadly, but predictably, adopted by already unwell people.”\n—Jarlath Kelleher, The Kraken sleeps: reporting of suicide as ‘sacrifice’ in British and Irish media (Undergraduate thesis, Dublin Institute of Technology)\nHe pulled the tarpaulin off with a flourish. The green-black boat sat upside down on two sawhorses, like an orca, stiff with rigor mortis, beached on pointed rocks.\nIt was a naomhóg. In the west, I found out later, it was called a currach, but this far south, people called it a naomhóg. Depending on who you asked, it meant ‘little saint’ or ‘young saint,’ as if the namers were asking God and the sea to spare it.\nIt was made of a flexible skin, stretched tightly over a blond wooden frame. I dropped to the floor to look inside, still unable to talk. I knew nothing about boat-building in those days, but the inside looked like pure craftsmanship.\nIt was almost the most rudimentary of constructed vessels and in place of oars it had long spars of unfeathered wood. But where a normal naomhóg was finished with hide or canvas and waterproofed with pitch, Más’s boat was hulled in what looked like glossy green-black plastic stretched over its ribs and stapled in place on the inside of the gunwale.\nI ran my hand along the hull. The skin, which looked constantly wet, was bone-dry and my fingers squeaked. They left no fingerprints. I knew instantly what it was, but I wished I didn’t.\n“Will you come with me? I’d like to show you my harbor. We might even catch something.”\nHe was so proud, of his vessel, of his hometown. I couldn’t say anything else.\n“I will,” I lied. “Tomorrow, if the fog lifts.”\n“I remember the harbour before the squid. The water teemed with movement. Ships steamed up the channel to the container ports upriver, somehow avoiding the small launches, in a complicated dance against outgoing or incoming tides, taking people to and from work at the steelworks on the nearest of the islands. Under the guidance of a harbourmaster sitting in his wasp-striped control tower, warships slipped sleekly from the naval base to hunt drug smugglers or Icelandic trawlers. An occasional yacht tied up at the floating pontoon of a small waterside restaurant. In summer, children dared each other to ‘tombstone’ from the highest point of the piers.\n“When I returned to the island, it might as well have been surrounded by tarmac, like a derelict theme park. Nobody even looked to the sea. It was easier that way.”\n—Elaine Theroux, The Great Island\nIt was bright outside when I left Más’s house. He had more friends, or at least acquaintances, than I had thought. None outwardly seemed to blame me for what had happened. Many expressed surprise he had made it that far.\nMás himself had been less forgiving. After I turned him in, the local police superintendent let me talk to him. Más told me he hated me, called me a “fucking English turncoat.” He spat in my face.\nI told him he didn’t understand. That he had been lucky until now. Lucky he hadn’t been killed. That they hadn’t retaliated.\nI wanted to tell him we were working on things to kill them, to infect them, to turn them on each other. I wanted to tell him to wait until the harbor mouth was closed, that the nets were in place, that he could soon take to the water off Ballyvoloon every day. That I would go with him.\nBut I couldn’t and none of it would have mattered anyway.\nI had betrayed him. And I found I could live with it.\nBetween Más’s house and Ballyvoloon is a harbor-side walkway known simply as ‘the water’s edge.’ The pavement widens dramatically in two places to support the immense red-brick piers of footbridges that connect the old Admiralty homes, on the other side of the railway line, to the sea. I climbed the wrought iron steps to the peak and surveyed the harbor, my arms resting on the mossy capstones of the wall. The sun was rising over the eastern headland, bright and cold.\nI took the phone from my pocket and watched the coroner’s video.\nIt was mostly from one angle, from a camera I had often passed high atop an antique lamppost preserved in the middle of the main street. The quality was good, no sound, but the colors of Ballyvoloon were gloriously recreated in bright sunshine. The camera looked east, past the pier and along the beach to the old town hall, now a Chinese takeaway.\nThere, just visible over the roof of the taxi stand office, sat Más on his rock, whittling and chipping at a piece of wood. The email from the coroner said he had sat there there all morning, but she must have supposed that I didn’t need to watch all of that.\nAt 4pm, his usual knocking-off time, he stood, stretched his back in such an exaggerated way I thought I could hear the cracks of his vertebrae, and packed his things into a large, waterproof sail bag. Carrying his pink-and-white jacket over one arm, he walked toward the camera, hailing anyone he met with a wave, but no conversation.\nHowever, rather than cross the beach for the bar at Tom’s, he turned left down the patched concrete of the pier.\nAt that time of day it was deserted. The last of the stalls had packed up, the tourists had made for their trains or their buses.\nThe angle switched to another camera, on the back of the old general post office, perhaps. It showed Más standing with his toes perfectly aligned to the edge of the concrete pier’s ‘T.’ After a few minutes, he removed several things from his pockets, folded his jacket, and placed it on the concrete.\nHe opened the bag and withdrew a banana-yellow set of antique, old-petro waterproofs. He stepped into the thick, rubbery trousers before donning the heavy jacket and securing its buttons and hooks.\nHe walked to the top of the rotten steps, looked up at the cathedral and made a sign of the cross. Then he descended the steps, sinking from view.\nThere was nothing for more than a minute, but the video kept running, the pattern of wavelets kept approaching the shore, birds kept wheeling in the sky.\nIn a series of small surges, the prow of the naomhóg emerged from under the pier, then Más’s head, his face towards the town, then the rest of his body and the boat.\nI had to hand it to him. He could have launched his vessel at dead of night from the little boathouse where he had built the others, but he chose the part of town most visible to the cameras, at a time when few people would be around to stop or report him.\nWith each pull on the oars, he sculled effortlessly through the gentlest of swells, his teeth bared in joy.\nHis yellow oilskins shone in contrast against the dark greens of his boat and the surrounding water as he made for the mouth of his harbor and the open sea beyond.\n“Yet fish there be, that neither hook, nor line, nor snare, nor net, nor engine can make thine.”\n—John Bunyan, The Pilgrim’s Progress\nFinbarr O’Reilly is an Irish speculative fiction writer who likes to explore how broken\ntechnologies or unearthly events affect intimate locales. Why would you want to write\nabout alien battleships invading New York when you can imagine little green men asking for directions from a short-tempered undertaker in Carrigtwohill, Co Cork.\nHe has previously been published in Clarkesworld and in the anthologies The Best Science Fiction of the Year, edited by Neil Clarke, and The Year’s Best Science Fiction, edited by Gardner Dozois.\nFinbarr has worked as a journalist for almost twenty years, most of those as a sub-editor (copy-editor).\nLike many Irish writers, Finbarr lives in self-imposed exile. He currently resides with his wife and two children in a small town in Lincolnshire, UK, too far from the sound of gulls and the smell of saltwater.", "source": "https://clarkesworldmagazine.com/oreilly_10_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last Boat-Builder in Ballyvoloon by Finbarr O'Reilly"}