{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rebecca Campbell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "m5oxEKisyDunrfoqaBBoI7iGcDg=", "id": null, "license": null, "comments": "", "raw_text": "9620 words, novelette  An Important Failure  2021 Winner: Theodore A. Sturgeon Memorial Award 2021 Finalist: Aurora Award for Best Novelette/Novella It’s 1607 (according to some calendars) and a falling cone from an elderly Pinaceae sitchensis catches on the rotting bark of a nurse log that sprouted while Al-Ma’mun founded the House of Wisdom in Baghdad. On this particular north Pacific island, the days are cold, and the water in Kaatza—the big lake near where this cone has fallen—freezes thick enough that one can walk out from the villages at the southeast end and look down to see cutthroat trout flickering underfoot. On the other side of the world, the Thames has also frozen, and stout winter children play across the canvasses of lowland painters, who preserve in oil the white-stained landscapes of northern Europe. In il Bosco Che Suona—the Valley of Song, the singing forest in the Alps north of Cremona where luthiers go to find their violins hidden in the trunks of trees—the winter is bitter, slowing the growth of Picea abies until its rings are infinitesimal, a dense tonewood unlike any material before or since.  Ninety years after the cone drops near Kaatza, Antonio Stradivari travels to il Bosco Che Suona on the old road from Cremona to select wood for his workshop. He rests his head against one trunk and listens to its cold history. This is the Little Ice Age as written in the rings of a spruce tree. It sounds like a violin.  Jacob woke Mason after midnight. Ten minutes later, they walked out to the old truck, gassed up for the occasion, stale with multigenerational BO, since it had belonged to their grandfather before it was Jake’s. The dusty fug relieved by Sophie’s botanicals: nasturtium; wood rose; one of her cash crops, a strain of CBD-rich indica she had been nurturing for years, called Nepenthe. They drove along the empty street, from the deeply green lakeshore to the old firebreak, gouged out of stone and clay twenty years before. Along disintegrating logging roads to the old burns where Mason could still see char. As kids, they had hiked here to secret rivers and campsites out of cell phone range.  Jacob drove in silence. Mason stared out the window at the ghost forest. Twice they got out to clear the road and Mason looked up into the low bush—blackened Douglas fir still towering over the blackberries and alder. Recovery plants, fast growing opportunists emerging from the last wildfire.  “Cougars?” he asked.  “A lot of them lately,” Jacob said. “They’ve followed the deer. It’s good news. But makes working at night a bit more exciting.”  He thought he spotted its silhouette in the darkness above them and wondered what it saw, in turn—competitors or prey in the disorienting headlights. The eagles had come back, nesting in the ghost trees. So had black-tailed deer and robins. The microclimates had changed as the forests began their slow return, though, a prefigure of what the coast would be in a hundred years: arbutus further inland, outside its original ranges; Garry oak farther west and north as the coast dried out. In a thousand years, it would be another sort of forest. If it was still there.  In two hours they made it to the edge of the surviving rain forest, which—on the west coast of the island’s mountains—had dodged the wildfires that destroyed most of everything else in the last twenty years. Twenty minutes on a rutted track, until they pulled over and met a guy, silent, nodding to Jacob as he climbed into the cab, directing them to an even narrower dirt track.  “This’s Chris,” Jacob said.  Mason-Chris nodded. So did the guy.  They weren’t far from the tree, which stood in what was still a provincial park, technically, though the trails were rarely maintained, and what boot prints he could see were probably other poachers. This was the largest surviving Sitka spruce in the world, and maybe people still wanted to see it, even if the busloads of school kids were rare, and the marine biology station at Bamfield had been shuttered for years.  Three more men waiting. A few gestures indicated the direction they’d drop it. The time it would take. Mason-Chris hung back, watching the wiry old faller put on his helmet, his chainsaw beside him. They waited for the breeze to still. There was a kind of quiet he never felt in Vancouver, even now when it was marred by shuffling men. Or cougars. Then the chainsaw flooded them and he heard nothing but its whine as it cut through the trunk, kindred to the kind that grew in La Fiemme, the Valley of Song in the Italian Alps where—it was rumored—a skilled lumberman could hear a violin hiding in the trunk.  He’d heard there might be another ancient Sitka in Kitimat, but that was too far to travel, even for something as precious as old-growth tonewood. This one, though, he’d remembered visiting as a kid. Its size; the unlikely fact of its survival after two centuries of logging and wildfires.  It didn’t take that long. A deep cut on either side in the direction of one of the other available roads, where a big truck probably waited. Then the wedges. The high, sweet note of the hammer. Waiting. Waiting. Until something inside it tore, and it fell, bounced, a thrash of branches like tendriled ocean creatures, or waves, like hair, like a body in spasm. Then it was still. Silence held for a moment longer, before they got to work limbing and bucking it.  Mason-Chris watched all the wiry, furtive men from—where? Port Alberni? Or maybe one of the transient camps, to which resource officers and RCMP turned temporary blind eyes because even they weren’t assholes enough to burn down a five-year camp that had organized showers and a septic system built of old truck tires. As long as the outsiders kept their problems—opioids, smuggling—out of town.  “Deal with the stump,” Jacob said.  Mason-Chris didn’t know what it meant, so Jacob repeated, “Stump. Cover it over with whatever you can find on the ground.”  “Is that really a problem? We’re pretty deep in.”  “They still send drones through.”  “Why would they even—anyway, I need to—”  “—I’ll get you when it’s time.”  Behind him, the stump was brightly pale in the darkness, sweet and resinous. He dropped branches over three meters of open wound, admiring the heartwood, which was surprisingly free of infestation, whether beetle or fungus. Behind him the tree grew steadily simpler, its branches tossed away, its trunk straight and handsome and more than four hundred years old. A baby compared to the ancient ones, the bristlecone or the big Norway spruce that had lived for nearly ten thousand years. But what would a bristlecone sound like? Sitka spruce, though, he had heard often and loved.  “—Chris.”  He’d get to Cremona and apprentice to Aldo, because Eddie knew him and could write a letter. He’d visit the Valley of Song and see what survived of the European spruce, and he would tell the master luthiers this story of poaching old growth in a provincial park. They would laugh and clap him on the back and—  “—Chris. Come on.”  Dragged away from his plans for Cremona and back to the immediate problem of sourcing old growth for a perfect violin, he saw that the tired, sweaty men had begun stripping their gear in the darkness, lit by phones and helmets. He didn’t actually know what he was looking for, but he worked his way down the long, straight sections nearest the base, running his hands over the rough bark to look at the interiors by the light of his phone.  “This is it, Jake.” he said without thinking. The group hushed. Ignored it. “This is the one.”  The other guys melted into the darkness. It was close to daylight by then, and while the forest floor was still dark, Mason could see the sky for the first time since the clouds overtook the stars.  Jake squatted by the section.  “Are you sure?” he asked.  Mason tried to listen to it. Before the tree fell, he had felt alive to the world around him—the shudder of leaves, and the faintly padding feet of the cougar—but now the wood was inert. Whatever he thought he had heard—the thin high notes of a violin he had not yet built—had evaporated.  “Yes,” he said. “I’m sure.”  It took them two hours to get it to the truck. Then another three to get to home.  “What’ll happen to the rest of it?” Mason asked.  “Firewood went for thousand bucks a cord last winter. That tree could keep a lot of people warm. There’s pulp, still. Mills will buy it up without asking too many questions. You don’t get the same kind of cash, but it’s safer and less work. And you know. Fentanyl. Or oxy.”  Behind them, the quarter of old-growth spruce remained silent, except where the truck creaked in resistance to its enormous weight.  “There are luthiers around the world who would kill for that, in a few years.”  “Sure. Or it’ll heat someone’s house this winter.”  They made it home late that morning, their eyes gritty with exhaustion. Jake sat in the cab for a long moment, then said, “I’m going to grab a swim, then get to work in the greenhouse.”  Mason knew he should help, but he found himself following the old route through the house to the bedroom he still thought of as his: the dark kitchen, past the bunches of garlic, the bookshelves in the living room piled with National Geographics from the twentieth century. Past the windowsills that still held grandma’s things: Beach glass and thunder eggs. Feathers. Stained glass that caught no light in a window shrouded by bush.  He lay in the cool, stale room where the carpet had been discolored by water seeping through the wall forty years before. It smelled like being ten, like summer, like his mother. Like the thousands of nights his family had passed between the wood-paneled walls, the narrow window facing south toward Cowichan Lake—or Kaatza, as Sophie called it in keeping with her friends in the local band—out which they had all stared and wondered what would happen next.  During the Little Ice Age, global temperatures dropped about 1°C, on average. There are debates regarding the causes of these aberrant winters. At least one trigger may have been the mass death of people in North and South America, with ninety percent of the population, by some estimates, dead after contact with Europeans.  Lost languages and cities; toddlers and great grandmothers and handsome young men and dreamy girls; villages and trade routes and favorite jokes. After so many deaths, an area of agricultural land the size of France returned to forest. This regreening sequestered enough carbon from the preindustrial atmosphere that temperatures took centuries to recover and begin their steady rise to the present day. The wild and empty continent of later explorers was—in part—a sepulcher, a monument inscribed with languages they could not speak, full of witnesses to that terrible loss.  From the cold and darkness of a hundred million deaths, to the chilly woodsmen of the Valley of Song, to Paganini playing il Cannone Guarnerius, it is a long and terrible history.  At Kaatza, the disaster is slow, despite temporary changes in climate, because the smallpox that will ravage the coast has not yet arrived. People go about their business on the water and in the forest, from the Pacific coast to the Salish Sea. Children are born. Songs are composed. The nurse log disintegrates. The little spruce rooted there rises toward the light, its heartwood formed in an apocalypse.  In addition to Nepenthe, Jake and Sophie grew a THC-rich sativa, which Mason disliked because it made him paranoid, but which sold steadily as far away as Seattle, and kept—in Jake’s words—the old homestead together. Sophie raised it hydroponically in Grandpa’s old workshop, while Nepenthe grew in the market garden by the lake, catching southern exposure on a warm brick wall with the espaliered peaches and lemongrass.  Later that afternoon, Mason visited the piece under a tarp in a corner of the workshop. Mason had been greedy, and there was material for two-dozen violins, assuming he found within it the billets he needed. He tried to remember what Eddie had done the last time they toured the mills for legal maple, willow, and spruce. Eddie could hear a violin in a slab of big-leaf maple, could feel willow’s sonic geometries as he tested its spring with his hands. If Eddie were here, the quarter would speak. He was still listening when Sophie shouldered through the door, a watering can in either hand.  “There are two more,” she said, gesturing toward the door.  He grabbed them, warm with sunlight. Together they watered the market garden. Potatoes and tomatoes. Chili peppers and mint. And Nepenthe, the deep botanical fug of its leaves rising in the heat of the afternoon. Mason took cannabis oil away every visit, dropping onto his tongue in a resinous burn, applying the ointment to his right wrist where the tendons ached. More effective than anything he could afford legally.  “You ever going legit?”  Sophie shrugged. “If it hasn’t happened by now, I doubt we’ll ever get licensed. I applied again last year but never heard anything. Jacob said you got what you needed?”  Mason nodded, the tree crashed again through his mind. “He’s helping someone cut firewood. He said you should sleep while you can. How long do we sit on it, anyway?”  “It’s got to season. A decade, probably. Ideally a century, but you know.”  She nodded, then led him through the hydroponics to a tiny room full of geranium slips and tomatoes. “Lots to do, Mason. Keep watering.”  In the third decade of the twenty-first century, a girl is born in Surrey Memorial Hospital. The labor is six hours. The child—magnificently named Masami Lucretia Delgado—has tiny, pointed fingers and strong hands that are precise in their movements, as though waiting for the fingerboard of a violin even in the moment of her birth. When she is three years old, an ad interrupts her cartoon, and she waits first in irritation, then in fascination, jabbing at the corner of the screen where the skip button should appear, but does not. Instead of a cartoon cloud who sings about rainbows and unicorns, she watches an ad for life insurance that features a little girl so like Masami, she seems to be a mirror, or a twin, with bright black hair and curious brown eyes. This little girl—the other Masami—holds a violin to her chin and plays something that makes Masami’s heart rise in her chest. A white cloud drifting higher and higher among the rainbows.  Masami is too small to name what she hears, and though it marks her forever, she soon forgets this first encounter with destiny. Something of it must remain with her, however, because a year later she hears the sound of a violin and asks her mother, that, that, was is that?  She’s four. Her father shows her violin videos. Outside the air is opaque with smoke from the fires on the north shore, which systematically destroy the huge houses overlooking Burrard Inlet. The pipeline that terminated in Burnaby has cracked again, somewhere up-country, who knows where, and spilled two thousand barrels of diluted bitumen into a lake. But Masami is too small to understand, and when she hears the sound of Marguerite Fell playing the ex-Kajnaco violin—from a quartet made by Guadagnini in Milan in 1780—she is transported, and some portion of her soul will never return from that transport. Her future is, at that moment, fixed. Her tiny hands will grow into her violin, the instrument less an exterior object than an extension of her body. She is, neurologically, emotionally, and psychologically, part violin. It’s in her heart, in her muscle memory. By the time she’s fourteen she’ll have cubital tunnel syndrome and need regular physio to deal with nerve compression. Her body has grown up around the violin the way a tree grows over a nurse log.  Masami Delgado was the reason Mason poached the last of the ancient Sitka spruce. But it wasn’t her fault.  Actually, maybe Eddie started it with one of those offhand comments about sourcing tonewood. Shuffling through the workshop in old jeans, pockets sagging with pencils and calipers, a finger plane. He stopped at Mason’s bench, where Mason was mending a violin they got cheap from someone leaving town. He was still surprised to find Eddie trusted him to touch instruments. For a long time he’d just swept the shop floor, drove the van, tended the glue pot. He still did those things, but he also got to replace a split tuning peg on a student violin, and it felt good to hold it in his hands, feeling the thin shell of its body, saying to it “Come on, little guy, let’s get you sorted.”  “It’s never going to sound the same,” Eddie said.  He listened to the long bow draw. “Yeah. It’s not great. But it’s solid for a student—”  “No.” Eddie said, in the abrupt way that always left Mason feeling like he’d said something stupid. “No. It’s the wood.”  He ran his finger down the bright spruce face. “This is pretty young stuff. More carbon in the atmosphere changes the density of the wood. We’re never going to see the same kind of old growth again, even if the forests recover. You need to drop the G.”  Mason listened. Eddie was right.  That night Eddie took him along to hear Delgado play at the Chan Center, a rare treat, like the time early in his apprenticeship when he accompanied Eddie to hear Alu Vila playing Bach on the ex-Norfolk, darkly redolent of 1805. Delgado had just received—for a three-year loan from the Canada Council for the Arts—the Plaisir violin of 1689, and had invited Eddie backstage to celebrate her first concert. Eddie, world-renowned luthier and representative of the CC, had been appointed its custodian for Delgado’s term. She was thirteen. She played the Kreutzer Sonata.  “We’re going to go check out the saddle,” he said during the intermission.  “Why?”  Eddie shrugged, and the lights dimmed again.  Backstage, Delgado’s parents hovered. Mason—still disoriented by the evening’s performance—couldn’t speak.  “May I?” Eddie said. She nodded. Her eyes never left the violin.  Mason screwed up his courage, “You have it for three years?” She nodded. “And then that’s it?”  Her mother answered. “You don’t get it twice.”  It hurt him that something that fit so perfectly onto her shoulder should be lost. She should have it for the rest of her life, on international tours, and in recording studios. It should be hers by some right of genius.  “I wish,” Mason said, “you could have it forever.” But then Eddie was finished and her parents were shepherding her away, and he realized he hadn’t heard her voice, not once.  As they waited for an Uber, Eddie said, “It’s not going to last.” Wildfires were burning on the north shore, and the sunset was an angry smudge. Mason thought about dying trees, and the sound of old growth leaving the world.  “What do we do?”  “Nothing we can do. The saddle’s been wearing noticeably for decades now. Could be a split forming, though I didn’t seen anything on the last CT scan. Maybe it’ll show in the next twenty years. Or maybe it’ll be longer than that. I don’t know.”  “We can’t replace it?”  “We can. But we won’t. They aren’t immortal. Eventually it will be unplayable, and then it will go to sleep.”  That night Mason walked down Granville Street past the shuttered theaters that had once been full of music. He circled back to Hastings, and walked out toward his little room in a building on Gore, where the rent was almost decent. Then he searched through Eddie’s database and found the transcendental geometries of the Plaisir violin, emissary of the seventeenth century, where in the workshops of Cremona luthiers made instruments so perfect they seemed not to have been built, but grown. Alien seashells. The seedpods of strange flowers. He had touched one today, felt its lightness against his palm, patinated by centuries of sweat, the oil of many hands and faces, rich with life. All that alchemy of tree and climate, genius and history. She would have it for three years. Then the saddle would split, and it would be lost forever.  That was the day he formed the plan: a violin made as purely and patiently as he could manage, following the guidance of long-dead luthiers, passed down to him through Eddie. And when it was finished, he would got to the Po Valley and join the Scuola Internazionale di Liuteria Cremona, where he would tell a dozen old Italian masters the story of his accomplishment.  But the materials he’d need weren’t just expensive, they were nonexistent. Trees of the five hundred ppm present wouldn’t do. He needed old growth, with heartwood grown in the last climate minimum, when Kaatza froze and the last Viking settlement on Greenland disappeared under the ice. He needed Gaboon ebony, nearly extinct, smuggled out of Nigeria or Cameroon.  “Everything I can afford,” he told Eddie the next day, “is ugly.” Unspoken: too ugly for Delgado, who deserved more than the world could offer these days.  “Not ugly,” Eddie said, “Different. But not ugly.” He picked up the violin Mason had assembled from salvaged materials Eddie had discarded. Then he seemed to think, and he said, “Let me show you something,” before disappearing up the stairs and into the shop, returning with a fiddle Mason had often looked at, a rough old thing, a curiosity.  “Some guy made this out of a post from a longhouse like a hundred and fifty years ago. If he can do that, you can figure something out.”  The longhouse had stood in a long-gone Musqueam village way down on southwest Marine Drive. The violin had a cedar front, a maple neck and back that Eddie insisted had come from a stack of firewood. He’d had some dendrochronologist look at it, dating the woods to the seventeen hundreds. Maybe some fiddler lost his on the crossing, or gambled it away, like in a song, but he’d landed on the edge of nowhere, and built something new from what he’d found. Not well built by many rules, and the sound was drowsy, sure, but deep, Mason could hear that just bowing the strings. He wondered what it would sound like in Delgado’s hands. Something by de Sarasate. A Bach violin concerto. Or maybe it would be some dance number, once played in a small front room while the rain fell outside, and Vancouver wasn’t even a city yet, a song interrupted, escaping from the violin when her fingers touched it. Maybe, he thought, it would be earlier sounds from an equally rainy night, a longhouse on the south slope toward the river, a rainy hillside that had not yet thought of becoming Vancouver. Voices. Laughter. A language he didn’t know, and a moment captured in the reverberating matrices of the wood itself.  A few weeks after he returned from poaching the giant spruce, and had begun to accumulate the necessary components for his violin, wildfires scoured the Fraser Valley and the north shore, and the smell of smoke brimmed his eyes with love and dread so he had to call them, just to make sure.  “Still here.” Jake said. “You okay?”  Mason could not answer that, because who was okay? No one was okay. Everyone was fine. “It smells like smoke here,” he said. “Eddie’s not doing too good with the COPD.”  “Yeah?”  The world had smelled like this when he and Mom had arrived, grubby with two months in the emergency camp on Nanaimo’s waterfront, waiting for the highways to reopen so they could go home. That’s what Mom had said to him every night: we’ll go home, soon. Not to the house in Cobble Hill, which was gone now, but out to the lake. To Grandma.  “Sophie wants to bring in trembling aspen for the other side of the firebreak, to slow the burn—” here Jake went on at length about the plans to bring in a colony, borrowed from a stand downriver. Mason couldn’t concentrate on what he said, but it was good to hear his voice and know that around him the house was darkening as the sun set, and outside you could, if you were lucky, hear the resident barn owl’s nightly call. Sophie still at work in the garden, hauling wheelbarrows to the compost. In his smoky room, Mason’s eyes ached until, finally, he wept.  Then, suddenly, Delgado was fifteen, an intensely silent teenager in heavy black eyeliner who wore combat boots in summer and rarely spoke when she came in for strings. Then she was sixteen and her time with the Plaisir nearly over, her parents joking tensely about how much it all cost—the travel, the extra tuition, the time.  Meanwhile, Mason made violins from the salvaged spruce and maple of a demolished bungalow on East Tenth, where he did some day labor for extra cash. In the evenings, he listened to each piece he’d nicked from the job, knocking it with a knuckle and wondering about its strengths, its provenance. He broke down a chest of drawers from Goodwill, scraping away the paint to show flamed maple. Oak flooring coated in decades of grime. A cricket bat made of willow, deeply scarred, might have provided the blocks he needed, but it was worm-eaten to the core.  He searched Stanley Park and found a shining willow near Beaver Lake, unusually straight. Salix lucida lasiandra, not the Salix alba preferred by the old Cremonese luthiers, but similarly easy to carve, and stable enough if he could find a straight length of trunk and season it properly. Resting his head against the trunk, he once again listened for the violin hiding within it, some sonic quality in the way it responded to his heartbeat, or his hand upon the bark.  He returned on a rainy night in January, alone, his backpack damp and heavy with gear: A hacksaw. Rope. More than anyone in the world, he missed Jacob, who had always—even when they were both kids orphaned by fire and pandemic—been cleverer and stronger than he was.  He’d have to top it, which was a ludicrous endeavor, and he could hear Jake laughing, and their grandfather’s anxious snort—the snort that meant, don’t do it, kiddo. Despite the snort, Mason persisted. Willow was essential, and if he could snare vacant lot rabbits and skin them for glue, he could climb and top a willow, then walk back across town to Eddie’s, where the wood might begin its secret transformation into something useable.  He’d climbed trees a lot as a kid. Higher even than Jake, who had a longer reach, but who was afraid of heights. It made them equals, according to Grandma. When he and Mom had arrived from the temporary camp in Nanaimo, after the rain hit in October and the fires down the coast died for the season, Jake was already there. He was waiting for his Dad to come back from the interior, where he’d gone to fight the big fire outside Princeton, when the dead pines went up like matches in the scorched afternoons. But he died by smoke inhalation on the side of a crowded road along with a hundred others, and Jake stayed, and later—when Mom left to look for work and caught the flu and died—the two of them lived like brothers.  Jake never talked about it, like Mason never talked about his mom, dying in the third wave of a new pandemic when he was seven, a few years after they’d landed back on the homestead. They all worked on the hydroponics in the workshop and the market garden on the south slope toward the lake. Weed was legal in the province back then, but the Cowichan Valley’s economy was—by conservative estimates—still more than half dark, and mostly driven by small operations like Grandma’s. And while he and Jake were orphans in a grow-op, Sophie was somewhere south of them in Langford, learning to garden with her grandfather. Eddie had just finished his years in Italy with Aldo, and was about to set up his own shop in Vancouver. Sophie studied horticulture on the mainland, then returned to Langford with a lot of knowledge and nowhere to turn it, until Jake found her on a beach in Sooke. Eddie won double gold at the Violin Society of America. Mason left school early for a cabinetry apprenticeship until a festival, where he picked up the unfinished body of a fiddle—spruce, maple, willow—and found the thing he was made to do.  All those people—those accidents—led him here, after midnight in the shivering wet of a rain forest park in November, and he was older than he liked to admit. Nevertheless, he pulled himself up to the lowest branch, then struggled from handhold to foothold until he was high enough to cut, relieved when the unusually straight center fell with a sound that was both troubling and familiar, the tree swaying in response to the dropped weight. He descended, limbed it, bucked it in convenient lengths, and packed five of them in his rucksack. Then, looking up, he saw a straight branch just below his cut, and he could not resist it. He remembered Jake’s wrinkled look of dread when they climbed too high, his warnings, “Do you know what could happen?”  “I know,” Mason said, and swung up into the willow. He was a couple of meters up when the branch on which he stood—one hand snaking around to grab his hacksaw—snapped. Willow is a brittle, fast-growing tree, splendid in its youth, but soon senescent. This one, more than fifty years old, could not support a man’s weight a second time that night.  The ground was wet and spinning and he said, as though someone might be there, “Help me, help me,” and he thought of his mother, standing just behind his shoulder, about to answer him, pick him up, carry him home. But she wasn’t, of course, so he lay still until the ground righted itself, and the pain steadied: not faded, but no longer in crescendo. He could still move his toes. Then he found he could stand. His left shoulder screamed, but his left fingers could move. He hauled himself fifty meters to Pipeline Road and called an Uber. It was nearly a week’s wages to get back home.  His shoulder never healed properly: a new MRSA at the hospital, one without a name that hung out in the linens. Not one of the virulent kinds that kills you in two days, but the other ones, that persist under the skin. There was an open sinus that ran from the outer edge of his shoulder, right above where the bone had cracked. It was three months before he could work again, but Eddie kept his place, and emergency disability got him through, though he didn’t eat much once his savings ran out.  When he told Jake the story—a joke, look what I did, what would Grandpa say—Sophie threatened to come over and look after him, and when he refused she just sent him Nepenthe. A few weeks out of the hospital and he could move his left arm enough to dress himself, and Eddie helped him put Sophie’s ointment on his left shoulder. He smoked it, too, in the basement in front of his workbench, the deep, slow breaths easing his shoulders out of their hunch, until he felt almost okay. By then Delgado’s term with the Plaisir had ended, and she celebrated those three glorious years with a last concert at the Chan Center, for which Mason had a ticket, and which he missed because he was still in the hospital.  “Don’t worry,” Eddie told him. “There’s a recording.”  “You know what I mean.”  “I think it’s going to Prefontaine. A kid in Saskatoon. He’s good.”  “But what’s she going to play?”  Eddie shrugged. “There are a lot of beautiful violins.”  “No.” Mason said, in rare disagreement. “There aren’t.”  He ran into Delgado’s father on the street, once. “She won’t touch a violin. It’s been six months.”  “She’s probably—”  “—all she does is play video games. She’s staying out. She’s so angry.”  He went on, then he had to be somewhere and he left Mason on the sidewalk. He stood for a moment blocking traffic, thinking of Delgado speaking bitterly and at length about the globe’s many failed revolutions, her rapidly narrowing future, and he wanted to tell her: please wait, just a little longer, for me to finish it.  A year later she received the extraordinarily fine ex-Jiang violin from an anonymous donor. He went to hear her play Bach at the Orpheum Theatre, with the Vancouver philharmonic accompanying. She was eighteen. When she came into the shop, she smiled through the eyeliner, and he asked her, “Where next? Buenos Aires?”  “I haven’t seen you in weeks. What happened to your shoulder?”  “I fell weird. Not Buenos Aires? Singapore?”  “Oh. Yeah, it’s hard to rationalize unless you’ve got a lot of work. I might be playing a gig in Toronto next year. And I was down in Seattle.”  “Recording, then?”  “Maybe. I’m working on early childhood education,”  “Oh,” he said, surprised. “Oh. Cool.”  “Eventually it’ll be music therapy. Gives me something to do with the lessons Mom and Dad paid for.”  It hurt him to hear that, though he didn’t know if that was some pain she felt but did not speak, or whether it was his own hope, which he did not like to acknowledge, for fear of smashing it. That she’d get another term with the Plaisir. That when she was finished with it, he’d present her with his own creation, and her career would be transformed as the violin opened up, becoming something new as she played it. He had not imagined her in a classroom with toddlers, playing “Pop Goes the Weasel” while they marched in circles around a bright orange carpet. But neither had he imagined himself working for Eddie for his entire adult life, and here he was.  For a few years after the fall he made nothing new, just ran the shop and stirred the glue pot, and made sure that Eddie took his meds and saw his doctor. But as his arm recovered, sort of, and he no longer dreamed of falling, he could stand to look at the willow again. He could even look at the old Jack Daniels box in a corner of the storage room, which held the violin in its constituent parks. You could mistake it for kindling, if you didn’t know.  It still took him three years to open the box and begin work on the forms, slowly because his left shoulder remained weak and sometimes his left hand failed. But for an hour sometimes, in the evenings, he worked ribs and blocks of willow in the basement workshop at night, where he often stayed on a cot in case Eddie needed help.  It took another five years of austerity to pay black market prices for Gaboon ebony from Nigeria, the whole time worrying the trees would all be dead before he could save the money. In the end, the wood he needed for the fingerboard, tailpiece, and saddle cleaned out what was left of his Cremona account. But he saved money on the tuning pegs, which were boxwood poached from Queen Elizabeth Park and stained a fine black.  By then, Mason had moved into the shop—temporarily they said—to keep an eye on Eddie, because he’d got old. He’d always been old, in Mason’s mind, fifty when Mason joined the firm at twenty-two, but not old old. Now he shuffled around the workshop, skinnier every year, quieter. Pretty soon he stopped going down to the basement because of the stairs, so Mason set his workbench up in what had been a dining room. Eddie could still watch the till, but he hardly spoke to customers, and he was happiest at the bench in his dressing gown, working on some delicate job, listening to the grubby speakers that sat on the kitchen counter.  Once while they were having coffee, Eddie reached across the table for a spoon and his wrist emerged from the ragged cuff of his hoody. Mason was transfixed by how thin it was, how the skin had begun to pucker and spot, the careful way he picked up the spoon, as though every action required some calculation.  “What are you now, seventy?” he said without thinking.  “Dude. I’m seventy-six.”  “Oh,” Mason said. Thought. “Then I must be—shit.”  Eddie laughed. Coughed. “Yeah. Exactly.”  The January he began shaping big-leaf maple (from an antique dresser) into the violin’s neck, a king tide rolled over the flats by the hospital and the science center. That restarted talk about a sea gate at the mouth of False Creek, though debate continued about how much of the original coastline should be preserved. The old beaches flooded now, water creeping up over the grass below the planetarium. Once Mason saw a river otter slip across a concrete path and into False Creek. The river otter seemed untroubled by his new home, just like the seagull or the ducks.  He went back to the shop to tell Eddie about the first finger of floodwaters sliding across Main Street like a prefigure. Fifty cm rise as predicted, then another half-meter from a king tide, and here we were, in the future, watching mussels grow over the bases of pillars that had once upheld shades over the park benches of wealthy Yaletown residents. He wanted to say to the walls that had once contained False Creek: turn it back.  He got home to find Eddie listening to Melchior play the Bach exercises on the Bourbon viola. Mason stowed the billets in the basement workshop. He could hear Melchior upstairs while he did it, louder than Eddie usually did, so some of the low notes rattled the door to the workshop.  Up the stairs, eyes still full of the floodwaters engulfing Main Street, he stopped in the doorway about to spill his news and said, “What’s wrong?”  Wildfires in the Po Valley, burning farms and groves left dry by a five-year drought. Cremona engulfed, and at least a thousand people dead. The Museo del Violino lost, and a pietà, a portrait of St. Sebastian from a small town. An altar piece and a collection of fine instruments stored in Torino.  “No more Cremona,” Eddie said. “I should have asked Aldo last week—”  Melchior filled the tired silence.  “I wish,” Eddie said in the torn voice of a night spent coughing in the lumpy old futon chair in the corner of his room, which bore the dark marks of his hands where he had been resting them for forty years. “I wish I’d enjoyed it all more.”  “I don’t—”  “—I mean, sure I should have done more to change things and been a proper revolutionary or whatever the fuck. But actually I just wish I’d spent less time thinking about it, and more—I miss coffee, you know? Really good coffee and drinking it in a coffee shop. I miss knowing I could get on an airplane at any time and go to Cremona and see Aldo, just to see him. I don’t think I enjoyed it enough. And here we are. And it’s too late.”  “It’s not too late,” Mason said.  “No more elephants. No more ebony trees. No more Cremona. No more Aldo.”  “It’s not.” He thought of the silence after the chainsaw, and the men who waited as the spruce fell, cougars moving soundlessly in the tinderbox woods around them. He thought of the storm of its branches hitting the ground, and the way it shuddered under his feet, and how he had found it, the core pieces, the heartwood of his violin, which had been alive in the seventeenth century, and which had waited on a hillside until now.  First Eddie laughed, “Oh, dude,” he said, and coughed.  Mason thumped the old man’s back with his good arm, still saying, “It’s not too late.”  He couldn’t explain it because they had arranged a silence regarding the violin, and the things he did to build it. He couldn’t explain, but it wasn’t too late because under a tarp in a shed, in that bit of land between the lake and the ghost forest, the spruce had been seasoning for fifteen years. In a box under his workbench he had black market Gaboon ebony for the fingerboard, one of the last shipments smuggled out of Nigeria: fine-pored, dense, deeply black ebony. He had glue made from the skins of rabbits he had trapped at night. He had carved the geometrically perfect scroll of its neck from a piece of two hundred year old big-leaf maple. And soon, soon, he would bring them together into something miraculous.  It must happen soon, though, looking down at the old man, his lips and chin slick with sputum coughed up in the last paroxysm.  “You look like your dad,” was the first thing Jacob said to him when, late on the third day of travel, he reached the house by the lake, slack-jawed and greasy-haired (once that trip had been measured in hours, you could be there and back in a day). It had been fifteen years since his last visit. His shoulder—numb with the weight of his backpack—twitched in its socket, swollen and tender. He was limping, too, by the time he made it to their gate.  “I feel like I got old like, suddenly. How’s Sophie?”  “Great,” she answered. Mason started. In his exhaustion he had not realized that the frizzle-haired figure in the doorway was Sophie, the greenish light of the lantern casting her face in craggy shadows and lines. “Yeah, we age hard now,” she said. “But that’s everyone. And your shoulder’s still bad. I’ll look at it.”  They lifted his backpack, then helped him with his shirt. Sophie’s sweet, botanical scent and her fingers overtook him, then a hot cloth washing away the dried fluids that had seeped from the open wound in his shoulder.  “It’s an abscess.” she said. “But I imagine you know that. Do you still have a doctor? Are they giving you anything? I don’t like the smell.”  He no longer had a doctor, but the guy at the clinic helped sometimes. “Nothing to do except surgery.”  Then the heavy skunk of Nepenthe overtook the ache, a scent that reminded him of his grandmother’s garden on a hot day, penetrating and astringent beneath the peppermint and lemon balm.  “It smells like—” he said in a voice that seemed to come from far away, but he couldn’t tell them, exactly, what it smelled like. Like home, maybe. Like his mother, when he had a mother. Then they helped him to the old back bedroom. He didn’t remember anything after that.  When he woke shortly before noon, Sophie was gone but Jake was there on the porch outside the kitchen, drinking something sort of like coffee made out of toasted barley.  “She’s been working with the Forestry Lab at UVic on some trees. Someone she knew in undergrad got ahold of her and they’ve been working together. Genetic mods. Fast growing. Carbon sinks. Drought resistant. It’s promising.”  It was the first good news Mason had heard in a long time. Together they walked up to the gardens she’d been building on old house sites. The street still showed traces of tarmac, if he kept his eyes fixed on the remaining yellow street paint. If he looked between his feet and listened to Jacob talk, and felt the lake breeze, the town could be as it was when he was a kid. Maybe. Or when his mother lived here before the fires. Or before that, when their grandparents built this homestead at the edge of nowhere and Ts'uubaa-asatx kids played in the lake.  But then, Ts'uubaa-asatx kids still played in the lake, and white kids, and the Sikh kids had returned to Paldi when the village grew up around the temple again. Kids climbed through the alders that grew in the path of old fires, picking blackberries rich with the heat of a new world. Kids fishing and weeding garden plots where the houses had been demolished. Kids singing songs he didn’t recognize.  Jacob was limping slightly now. They stopped when they saw Sophie in the middle of a garden near the water, her hair a frizz of gray in the sunlight, and a couple of boys and girls nearby, their arms full of green. Her hands were dirty, right up to the elbows, and when she saw them walking toward her, she waved the carrot tops she held.  “Rajinder brought some Jersey cows from up-island,” she explained. “They like the carrot tops. It’s our turn to get a couple of liters. The butter is ah-fucking-mayzing.”  That evening they ate a soft farmer’s cheese from Rajinder’s herd, and she talked about the trees, the plantation on the old townsite, about more plans with Ts'uubaa-asatx Nation, a gang of kids replanting the burned-out subdivisions from twenty years before. You couldn’t see the old roads in some places, she said. It’s like they’re gone.  “Where?”  “Everywhere,” she said. “It’s the regreening. We lost what, ninety percent of our population to the mainland? So why not give it all back? Some of the Cowichan kids started it in the subdivisions nearer the coast, torching the houses last winter. Give it a couple of hundred years, and people will be making violins from the trees we’re planting.”  He didn’t want to say it, but her newly wild world—without roads, without houses—filled him with a terrible bitterness he could not describe. “They won’t sound the same,” he said.  “Nope,” Jacob said. “Not at all the same.”  That night he lay a long time in the half-sleep of pain and painkillers, his shoulder numb from Sophie’s ministrations that evening. He could not escape the crash of the old Sitka spruce hitting the ground, the crunch of five hundred years of upward growth giving in, finally, to gravity. He wondered if it would still be standing if he hadn’t mentioned it to Jake fifteen years ago, in the middle of the night, when he was going to demolition sites looking for old spruce and wild with ambition for Delgado, who would play Moscow and Barcelona and Singapore. Jake had asked where it was: Did he remember how to get there? Could he find it on a map?  Mason did remember, and said I’d like to be there. I’d like to listen to it. A couple of months later, Jake had mentioned it again, and here we are, he thought, his shoulder throbbing dully on the other side of Nepenthe.  The day Mason returned from the island, Eddie woke him up just before midnight, when it was still hot and airless.  “I gotta. Go. In.” he said.  “Where?” Mason asked, stupidly, then realized what Eddie meant, found his shoes and helped the old man down to the curb, where they waited for an Uber, then waited at the hospital for seven hours, Eddie silent, breathing roughly in, and raggedly out again, while other patients paced, sometimes shouted, and a fluorescent tube above their heads flickered and hissed.  They kept him in for a couple of days. When Mason visited him with things from home—his tablet, a sweater, a newly refurbished violin for inspection—he was a shrunken, cranky man, complaining to the nurse in a small, petulant voice. It was so hot. Could they do something about it? The heat.  Mason sat with him while he ate, then walked an hour back to the shop, where he had set up a bed in the basement, the nearly-cool room that smelled of wood shavings and resin and glue, which was comforting while—on the other side of the peninsula—Eddie struggled with each breath in turn. Here it was almost quiet. Just Mason and the remaining problem: the sound post. Properly speaking, it should be made of spruce, like the front, but he wanted something that had seasoned longer than fifteen years. Something precious to hide away, something only he would know about.  There was the old fiddle, the one some frontiersman made out of wood salvaged from the skids that once ran through Gastown and the beams of longhouse. Once, shortly after he met her, Delgado came into the shop for an order of strings and Eddie brought it out. She played “Where Does That River Run?” and he had laughed, and asked her to play again, anything, to wake the violin up and keep it alive a little longer. She had played at length and with wild generosity: sweet old waltzes; the Québécois “Reel de Napoleon”; a Cape Breton lament.  Humming, he climbed the stairs. He let himself into the shop and opened the display case that held the old fiddle.  It was another crime. Nevertheless, he carried it downstairs to his bench. He did not want to think too much, so he worked quickly: pulling the old sound post out and adding a new one, returning the violin to the store’s display case. Downstairs, the old bit of dowel was rough against his fingers. Cedar, maybe from the same post in the longhouse on the Fraser, light and ancient and marked by the original luthier’s rough knife. Fragrant when he warmed it with his hands, but no potent aromatics, just a deep and redolent dust.  Then he fitted it, and it hid so perfectly in his violin, maybe no one would know the terrible thing he had done, the secret history he had stolen like all the other secret histories that constituted his violin. He knew, though, all the courses that materials took, from Nigeria, from the islands, from demolished bungalows in east Van, from vacant lot rabbits, and from Stanley Park.  Even from his bed, even on oxygen, Eddie was critical when Mason brought it upstairs, examining it with an eyeglass until he conceded that the sound was as fine, in its own way, as any number of other violins he’d seen. Finer, even, than the composites he’d started to use for his own work (when he could work), corene and carbon fiber.  “You made something, kid.” It had been a long time since anyone had called him kid, even Eddie. “Does it have a name?” Eddie asked.  “Does it need one?” If it had to be named it should be something elegant and sonorous. Kiidk'yaas. “I don’t know. The Vancouver violin.”  “Better than that.”  Eddie wouldn’t play it, and neither would Mason. Delgado was swamped at the center, and had a toddler, so while the violin—Spruce Goose?—was finished in September, they didn’t hear it until the New Year.  She was late. That was okay. The toddler was with her, which was slightly disturbing, but Mason figured they could keep her away from the detritus of the apartment, which was mostly workshop. And there were dry little cookies, at least, to feed her, at the back of a kitchen cupboard.  “I meant to leave her at home, but you know Johnny got a last minute shift—”  “No worries,” Eddie said, quietly because he could only speak quietly now. “We’re just happy to see you.”  “This is it?”  Mason’s throat was unaccountably closed, so he just—Delgado juggled Belinda from one arm to the other. “Oh,” she said. “Oh.”  “Mommy?” Belinda murmured, sleepy.  “I’m going to put you down for a sec.”  She rubbed her hands on her jeans, Belinda now squatting at her feet, leaning on her knee.  “Oh,” she said. He thought he saw a tremor. Her face dropped into her neck, so her hair fell forward and she looked as she had when she was fourteen and coming into the shop for new strings special-ordered from Berlin, talking about Bach.  Then the bow drawn across the open E, and he heard it, the sweetly deep, the brightly clear reverberation. Delgado made a wild little laugh and ran a scale, another scale, then interlocking arpeggios. Ševčík.  At her feet, Belinda spoke to a little blue bear, patting her threadbare ears.  Delgado dropped the violin from her neck, cradled it. Her eyes were bright, as though with tears, but her voice was warm.  “It is—oh, Mason!”  “Will you play something?”  She played Beethoven. The Kreutzer Sonata, as though she remembered the night that had stuck forever in Mason’s heart: the Chan Center, and the Plaisir violin, and Delgado. Eddie leaned to the left side of his wheelchair, his eyes closed, the oxygen tank hissing faintly, the sound of people at the window, Belinda’s murmurs to Bear. All these interruptions should be maddening, but they were not, and only seemed to complement the room’s fragile magic.  When she was finished she sat heavily on the remaining chair.  “How long have you been working on it?”  “A while,” Mason said and saw her as she had been, fifteen and brilliant with an actual future stretching all the way to Paris. He had imagined hearing it for the first time in some acoustically perfect opera house, because the world would have recovered by then. He knew it was foolish, but it hurt to think Delgado would never carry it away from this provincial little corner.  “What will you do with it now,” she asked, a wobble in her voice, the harmonics of longing. “Who’ll play it?”  It was strange to him that she needed to ask.  “No.” she said when she understood. “Oh no. No.”  Belinda looked up from Bear. “Mommy. Mommy?”  “You can use it in your classroom, can’t you? I think it’ll age okay. It’ll open up.”  She didn’t respond for a minute, but crouched down to where Belinda sat with Bear, her brow furrowed with worry for her mother. Then she stood and asked, “Does it have a name?”  “See? It should have a name,” Eddie said.  Mason heard the oceanic crash of falling spruce, his own cry as he hit the dirt at the base of a shining willow in Stanley Park. The market garden and the homestead, the lake, the abandoned subdivisions and the burn lines that still showed through the underbrush, the ghost forests, the dead black teeth of what had once—a long time ago—been a rainforest. And among them, Jacob still cutting lumber and helping out at the garage when he could, fishing and hunting. Sophie in the greenhouses and the gardens, with her new Garry oak trees and her transfigured arbutus, the beetle-resistant spruce that would never, ever, be the kind of tonewood he wanted. The firebreaks of trembling aspen, the return of cougars. The steady erosion of human shapes: foundations and roads all lost to the burgeoning forest.  “Nepenthe?”  As he said it, he wasn’t sure what it meant: a physick that would make the end easier; a draft of healing medicine.  “Nepenthe.” Eddie said. “There it is.”  “Remember,” Sophie had said before he left. “You’re going to come back here for good, eventually. It’s still home.”  Unspoken: come back when Eddie has died and you’re ready to give up on global dreams and figure out how to live out the rest of your days in this shopworn future.  He had just nodded through the ache of disappointment that had accompanied him for decades, now. But a tiny, exhausted part of him almost liked imagining it, how he’d go back to work in the garden, raising saplings for the new forest that even now overtook the old world, watching kids disappear into the wild.  Masami Lucretia Delgado plays the Nepenthe violin daily for forty-five years, even if it’s only ten minutes when she gets home from work, her kids playing noisily outside the bedroom. Five minutes before everyone else is awake, Belinda fourteen and saying Mom are you seriously playing right now? she plays it on the day they leave their apartment because the seawall at the mouth of False Creek has failed. She plays it in the back of a car as they drive inland, toward interim housing in which they’ll live for five years. Nepenthe is a fixture in the temporary-but-actually-permanent school she establishes in a slipshod village on the Fraser River. Together, she and Nepenthe accompany Belinda’s wedding, and Masami’s grandchildren fall asleep to lullabies from those strings. Despite her daily practice, she will never hear its most perfect expression: the violin will be its best long after the maker is dead, and the first hands that played it are too crippled by arthritis to make more than sighs. But she will play on while she can, because the violin must not go to sleep, and the longer she plays it, the more the alchemy of sound—the resin, perhaps, the glue, the cellular acoustics of the wood itself—will transform the object, preparing it for its ultimate player. Maybe her youngest daughter—the finest musician of all her children—or her granddaughter, will first hear the violin open up into its richest, fullest tone. Maybe it will be someone a hundred years in the future, who lives in a different world than we do, but who will pick up the instrument and draw her bow across the strings, releasing the reverberations of a thousand thousand crimes and accidents into the singing air. Rebecca Campbell is a Canadian writer and teacher whose speculative fiction has appeared most recently in The Magazine of Fantasy and Science Fiction and Shadows and Tall Trees. Her work has won the Sunburst and Theodore Sturgeon Memorial Award, and been nominated for the Aurora Award. NeWest Press published her first novel, The Paradise Engine, in 2013, and in 2022, Undertow Publications will publish her First World War horror novella, The Talosite. She mostly uses her PhD in Canadian literature to make up sad futures and weird fictions.", "text": "9620 words, novelette\nAn Important Failure\n2021 Winner: Theodore A. Sturgeon Memorial Award\n2021 Finalist: Aurora Award for Best Novelette/Novella\nIt’s 1607 (according to some calendars) and a falling cone from an elderly Pinaceae sitchensis catches on the rotting bark of a nurse log that sprouted while Al-Ma’mun founded the House of Wisdom in Baghdad. On this particular north Pacific island, the days are cold, and the water in Kaatza—the big lake near where this cone has fallen—freezes thick enough that one can walk out from the villages at the southeast end and look down to see cutthroat trout flickering underfoot. On the other side of the world, the Thames has also frozen, and stout winter children play across the canvasses of lowland painters, who preserve in oil the white-stained landscapes of northern Europe. In il Bosco Che Suona—the Valley of Song, the singing forest in the Alps north of Cremona where luthiers go to find their violins hidden in the trunks of trees—the winter is bitter, slowing the growth of Picea abies until its rings are infinitesimal, a dense tonewood unlike any material before or since.\nNinety years after the cone drops near Kaatza, Antonio Stradivari travels to il Bosco Che Suona on the old road from Cremona to select wood for his workshop. He rests his head against one trunk and listens to its cold history. This is the Little Ice Age as written in the rings of a spruce tree. It sounds like a violin.\nJacob woke Mason after midnight. Ten minutes later, they walked out to the old truck, gassed up for the occasion, stale with multigenerational BO, since it had belonged to their grandfather before it was Jake’s. The dusty fug relieved by Sophie’s botanicals: nasturtium; wood rose; one of her cash crops, a strain of CBD-rich indica she had been nurturing for years, called Nepenthe. They drove along the empty street, from the deeply green lakeshore to the old firebreak, gouged out of stone and clay twenty years before. Along disintegrating logging roads to the old burns where Mason could still see char. As kids, they had hiked here to secret rivers and campsites out of cell phone range.\nJacob drove in silence. Mason stared out the window at the ghost forest. Twice they got out to clear the road and Mason looked up into the low bush—blackened Douglas fir still towering over the blackberries and alder. Recovery plants, fast growing opportunists emerging from the last wildfire.\n“Cougars?” he asked.\n“A lot of them lately,” Jacob said. “They’ve followed the deer. It’s good news. But makes working at night a bit more exciting.”\nHe thought he spotted its silhouette in the darkness above them and wondered what it saw, in turn—competitors or prey in the disorienting headlights. The eagles had come back, nesting in the ghost trees. So had black-tailed deer and robins. The microclimates had changed as the forests began their slow return, though, a prefigure of what the coast would be in a hundred years: arbutus further inland, outside its original ranges; Garry oak farther west and north as the coast dried out. In a thousand years, it would be another sort of forest. If it was still there.\nIn two hours they made it to the edge of the surviving rain forest, which—on the west coast of the island’s mountains—had dodged the wildfires that destroyed most of everything else in the last twenty years. Twenty minutes on a rutted track, until they pulled over and met a guy, silent, nodding to Jacob as he climbed into the cab, directing them to an even narrower dirt track.\n“This’s Chris,” Jacob said.\nMason-Chris nodded. So did the guy.\nThey weren’t far from the tree, which stood in what was still a provincial park, technically, though the trails were rarely maintained, and what boot prints he could see were probably other poachers. This was the largest surviving Sitka spruce in the world, and maybe people still wanted to see it, even if the busloads of school kids were rare, and the marine biology station at Bamfield had been shuttered for years.\nThree more men waiting. A few gestures indicated the direction they’d drop it. The time it would take. Mason-Chris hung back, watching the wiry old faller put on his helmet, his chainsaw beside him. They waited for the breeze to still. There was a kind of quiet he never felt in Vancouver, even now when it was marred by shuffling men. Or cougars. Then the chainsaw flooded them and he heard nothing but its whine as it cut through the trunk, kindred to the kind that grew in La Fiemme, the Valley of Song in the Italian Alps where—it was rumored—a skilled lumberman could hear a violin hiding in the trunk.\nHe’d heard there might be another ancient Sitka in Kitimat, but that was too far to travel, even for something as precious as old-growth tonewood. This one, though, he’d remembered visiting as a kid. Its size; the unlikely fact of its survival after two centuries of logging and wildfires.\nIt didn’t take that long. A deep cut on either side in the direction of one of the other available roads, where a big truck probably waited. Then the wedges. The high, sweet note of the hammer. Waiting. Waiting. Until something inside it tore, and it fell, bounced, a thrash of branches like tendriled ocean creatures, or waves, like hair, like a body in spasm. Then it was still. Silence held for a moment longer, before they got to work limbing and bucking it.\nMason-Chris watched all the wiry, furtive men from—where? Port Alberni? Or maybe one of the transient camps, to which resource officers and RCMP turned temporary blind eyes because even they weren’t assholes enough to burn down a five-year camp that had organized showers and a septic system built of old truck tires. As long as the outsiders kept their problems—opioids, smuggling—out of town.\n“Deal with the stump,” Jacob said.\nMason-Chris didn’t know what it meant, so Jacob repeated, “Stump. Cover it over with whatever you can find on the ground.”\n“Is that really a problem? We’re pretty deep in.”\n“They still send drones through.”\n“Why would they even—anyway, I need to—”\n“—I’ll get you when it’s time.”\nBehind him, the stump was brightly pale in the darkness, sweet and resinous. He dropped branches over three meters of open wound, admiring the heartwood, which was surprisingly free of infestation, whether beetle or fungus. Behind him the tree grew steadily simpler, its branches tossed away, its trunk straight and handsome and more than four hundred years old. A baby compared to the ancient ones, the bristlecone or the big Norway spruce that had lived for nearly ten thousand years. But what would a bristlecone sound like? Sitka spruce, though, he had heard often and loved.\n“—Chris.”\nHe’d get to Cremona and apprentice to Aldo, because Eddie knew him and could write a letter. He’d visit the Valley of Song and see what survived of the European spruce, and he would tell the master luthiers this story of poaching old growth in a provincial park. They would laugh and clap him on the back and—\n“—Chris. Come on.”\nDragged away from his plans for Cremona and back to the immediate problem of sourcing old growth for a perfect violin, he saw that the tired, sweaty men had begun stripping their gear in the darkness, lit by phones and helmets. He didn’t actually know what he was looking for, but he worked his way down the long, straight sections nearest the base, running his hands over the rough bark to look at the interiors by the light of his phone.\n“This is it, Jake.” he said without thinking. The group hushed. Ignored it. “This is the one.”\nThe other guys melted into the darkness. It was close to daylight by then, and while the forest floor was still dark, Mason could see the sky for the first time since the clouds overtook the stars.\nJake squatted by the section.\n“Are you sure?” he asked.\nMason tried to listen to it. Before the tree fell, he had felt alive to the world around him—the shudder of leaves, and the faintly padding feet of the cougar—but now the wood was inert. Whatever he thought he had heard—the thin high notes of a violin he had not yet built—had evaporated.\n“Yes,” he said. “I’m sure.”\nIt took them two hours to get it to the truck. Then another three to get to home.\n“What’ll happen to the rest of it?” Mason asked.\n“Firewood went for thousand bucks a cord last winter. That tree could keep a lot of people warm. There’s pulp, still. Mills will buy it up without asking too many questions. You don’t get the same kind of cash, but it’s safer and less work. And you know. Fentanyl. Or oxy.”\nBehind them, the quarter of old-growth spruce remained silent, except where the truck creaked in resistance to its enormous weight.\n“There are luthiers around the world who would kill for that, in a few years.”\n“Sure. Or it’ll heat someone’s house this winter.”\nThey made it home late that morning, their eyes gritty with exhaustion. Jake sat in the cab for a long moment, then said, “I’m going to grab a swim, then get to work in the greenhouse.”\nMason knew he should help, but he found himself following the old route through the house to the bedroom he still thought of as his: the dark kitchen, past the bunches of garlic, the bookshelves in the living room piled with National Geographics from the twentieth century. Past the windowsills that still held grandma’s things: Beach glass and thunder eggs. Feathers. Stained glass that caught no light in a window shrouded by bush.\nHe lay in the cool, stale room where the carpet had been discolored by water seeping through the wall forty years before. It smelled like being ten, like summer, like his mother. Like the thousands of nights his family had passed between the wood-paneled walls, the narrow window facing south toward Cowichan Lake—or Kaatza, as Sophie called it in keeping with her friends in the local band—out which they had all stared and wondered what would happen next.\nDuring the Little Ice Age, global temperatures dropped about 1°C, on average. There are debates regarding the causes of these aberrant winters. At least one trigger may have been the mass death of people in North and South America, with ninety percent of the population, by some estimates, dead after contact with Europeans.\nLost languages and cities; toddlers and great grandmothers and handsome young men and dreamy girls; villages and trade routes and favorite jokes. After so many deaths, an area of agricultural land the size of France returned to forest. This regreening sequestered enough carbon from the preindustrial atmosphere that temperatures took centuries to recover and begin their steady rise to the present day. The wild and empty continent of later explorers was—in part—a sepulcher, a monument inscribed with languages they could not speak, full of witnesses to that terrible loss.\nFrom the cold and darkness of a hundred million deaths, to the chilly woodsmen of the Valley of Song, to Paganini playing il Cannone Guarnerius, it is a long and terrible history.\nAt Kaatza, the disaster is slow, despite temporary changes in climate, because the smallpox that will ravage the coast has not yet arrived. People go about their business on the water and in the forest, from the Pacific coast to the Salish Sea. Children are born. Songs are composed. The nurse log disintegrates. The little spruce rooted there rises toward the light, its heartwood formed in an apocalypse.\nIn addition to Nepenthe, Jake and Sophie grew a THC-rich sativa, which Mason disliked because it made him paranoid, but which sold steadily as far away as Seattle, and kept—in Jake’s words—the old homestead together. Sophie raised it hydroponically in Grandpa’s old workshop, while Nepenthe grew in the market garden by the lake, catching southern exposure on a warm brick wall with the espaliered peaches and lemongrass.\nLater that afternoon, Mason visited the piece under a tarp in a corner of the workshop. Mason had been greedy, and there was material for two-dozen violins, assuming he found within it the billets he needed. He tried to remember what Eddie had done the last time they toured the mills for legal maple, willow, and spruce. Eddie could hear a violin in a slab of big-leaf maple, could feel willow’s sonic geometries as he tested its spring with his hands. If Eddie were here, the quarter would speak. He was still listening when Sophie shouldered through the door, a watering can in either hand.\n“There are two more,” she said, gesturing toward the door.\nHe grabbed them, warm with sunlight. Together they watered the market garden. Potatoes and tomatoes. Chili peppers and mint. And Nepenthe, the deep botanical fug of its leaves rising in the heat of the afternoon. Mason took cannabis oil away every visit, dropping onto his tongue in a resinous burn, applying the ointment to his right wrist where the tendons ached. More effective than anything he could afford legally.\n“You ever going legit?”\nSophie shrugged. “If it hasn’t happened by now, I doubt we’ll ever get licensed. I applied again last year but never heard anything. Jacob said you got what you needed?”\nMason nodded, the tree crashed again through his mind. “He’s helping someone cut firewood. He said you should sleep while you can. How long do we sit on it, anyway?”\n“It’s got to season. A decade, probably. Ideally a century, but you know.”\nShe nodded, then led him through the hydroponics to a tiny room full of geranium slips and tomatoes. “Lots to do, Mason. Keep watering.”\nIn the third decade of the twenty-first century, a girl is born in Surrey Memorial Hospital. The labor is six hours. The child—magnificently named Masami Lucretia Delgado—has tiny, pointed fingers and strong hands that are precise in their movements, as though waiting for the fingerboard of a violin even in the moment of her birth. When she is three years old, an ad interrupts her cartoon, and she waits first in irritation, then in fascination, jabbing at the corner of the screen where the skip button should appear, but does not. Instead of a cartoon cloud who sings about rainbows and unicorns, she watches an ad for life insurance that features a little girl so like Masami, she seems to be a mirror, or a twin, with bright black hair and curious brown eyes. This little girl—the other Masami—holds a violin to her chin and plays something that makes Masami’s heart rise in her chest. A white cloud drifting higher and higher among the rainbows.\nMasami is too small to name what she hears, and though it marks her forever, she soon forgets this first encounter with destiny. Something of it must remain with her, however, because a year later she hears the sound of a violin and asks her mother, that, that, was is that?\nShe’s four. Her father shows her violin videos. Outside the air is opaque with smoke from the fires on the north shore, which systematically destroy the huge houses overlooking Burrard Inlet. The pipeline that terminated in Burnaby has cracked again, somewhere up-country, who knows where, and spilled two thousand barrels of diluted bitumen into a lake. But Masami is too small to understand, and when she hears the sound of Marguerite Fell playing the ex-Kajnaco violin—from a quartet made by Guadagnini in Milan in 1780—she is transported, and some portion of her soul will never return from that transport. Her future is, at that moment, fixed. Her tiny hands will grow into her violin, the instrument less an exterior object than an extension of her body. She is, neurologically, emotionally, and psychologically, part violin. It’s in her heart, in her muscle memory. By the time she’s fourteen she’ll have cubital tunnel syndrome and need regular physio to deal with nerve compression. Her body has grown up around the violin the way a tree grows over a nurse log.\nMasami Delgado was the reason Mason poached the last of the ancient Sitka spruce. But it wasn’t her fault.\nActually, maybe Eddie started it with one of those offhand comments about sourcing tonewood. Shuffling through the workshop in old jeans, pockets sagging with pencils and calipers, a finger plane. He stopped at Mason’s bench, where Mason was mending a violin they got cheap from someone leaving town. He was still surprised to find Eddie trusted him to touch instruments. For a long time he’d just swept the shop floor, drove the van, tended the glue pot. He still did those things, but he also got to replace a split tuning peg on a student violin, and it felt good to hold it in his hands, feeling the thin shell of its body, saying to it “Come on, little guy, let’s get you sorted.”\n“It’s never going to sound the same,” Eddie said.\nHe listened to the long bow draw. “Yeah. It’s not great. But it’s solid for a student—”\n“No.” Eddie said, in the abrupt way that always left Mason feeling like he’d said something stupid. “No. It’s the wood.”\nHe ran his finger down the bright spruce face. “This is pretty young stuff. More carbon in the atmosphere changes the density of the wood. We’re never going to see the same kind of old growth again, even if the forests recover. You need to drop the G.”\nMason listened. Eddie was right.\nThat night Eddie took him along to hear Delgado play at the Chan Center, a rare treat, like the time early in his apprenticeship when he accompanied Eddie to hear Alu Vila playing Bach on the ex-Norfolk, darkly redolent of 1805. Delgado had just received—for a three-year loan from the Canada Council for the Arts—the Plaisir violin of 1689, and had invited Eddie backstage to celebrate her first concert. Eddie, world-renowned luthier and representative of the CC, had been appointed its custodian for Delgado’s term. She was thirteen. She played the Kreutzer Sonata.\n“We’re going to go check out the saddle,” he said during the intermission.\n“Why?”\nEddie shrugged, and the lights dimmed again.\nBackstage, Delgado’s parents hovered. Mason—still disoriented by the evening’s performance—couldn’t speak.\n“May I?” Eddie said. She nodded. Her eyes never left the violin.\nMason screwed up his courage, “You have it for three years?” She nodded. “And then that’s it?”\nHer mother answered. “You don’t get it twice.”\nIt hurt him that something that fit so perfectly onto her shoulder should be lost. She should have it for the rest of her life, on international tours, and in recording studios. It should be hers by some right of genius.\n“I wish,” Mason said, “you could have it forever.” But then Eddie was finished and her parents were shepherding her away, and he realized he hadn’t heard her voice, not once.\nAs they waited for an Uber, Eddie said, “It’s not going to last.” Wildfires were burning on the north shore, and the sunset was an angry smudge. Mason thought about dying trees, and the sound of old growth leaving the world.\n“What do we do?”\n“Nothing we can do. The saddle’s been wearing noticeably for decades now. Could be a split forming, though I didn’t seen anything on the last CT scan. Maybe it’ll show in the next twenty years. Or maybe it’ll be longer than that. I don’t know.”\n“We can’t replace it?”\n“We can. But we won’t. They aren’t immortal. Eventually it will be unplayable, and then it will go to sleep.”\nThat night Mason walked down Granville Street past the shuttered theaters that had once been full of music. He circled back to Hastings, and walked out toward his little room in a building on Gore, where the rent was almost decent. Then he searched through Eddie’s database and found the transcendental geometries of the Plaisir violin, emissary of the seventeenth century, where in the workshops of Cremona luthiers made instruments so perfect they seemed not to have been built, but grown. Alien seashells. The seedpods of strange flowers. He had touched one today, felt its lightness against his palm, patinated by centuries of sweat, the oil of many hands and faces, rich with life. All that alchemy of tree and climate, genius and history. She would have it for three years. Then the saddle would split, and it would be lost forever.\nThat was the day he formed the plan: a violin made as purely and patiently as he could manage, following the guidance of long-dead luthiers, passed down to him through Eddie. And when it was finished, he would got to the Po Valley and join the Scuola Internazionale di Liuteria Cremona, where he would tell a dozen old Italian masters the story of his accomplishment.\nBut the materials he’d need weren’t just expensive, they were nonexistent. Trees of the five hundred ppm present wouldn’t do. He needed old growth, with heartwood grown in the last climate minimum, when Kaatza froze and the last Viking settlement on Greenland disappeared under the ice. He needed Gaboon ebony, nearly extinct, smuggled out of Nigeria or Cameroon.\n“Everything I can afford,” he told Eddie the next day, “is ugly.” Unspoken: too ugly for Delgado, who deserved more than the world could offer these days.\n“Not ugly,” Eddie said, “Different. But not ugly.” He picked up the violin Mason had assembled from salvaged materials Eddie had discarded. Then he seemed to think, and he said, “Let me show you something,” before disappearing up the stairs and into the shop, returning with a fiddle Mason had often looked at, a rough old thing, a curiosity.\n“Some guy made this out of a post from a longhouse like a hundred and fifty years ago. If he can do that, you can figure something out.”\nThe longhouse had stood in a long-gone Musqueam village way down on southwest Marine Drive. The violin had a cedar front, a maple neck and back that Eddie insisted had come from a stack of firewood. He’d had some dendrochronologist look at it, dating the woods to the seventeen hundreds. Maybe some fiddler lost his on the crossing, or gambled it away, like in a song, but he’d landed on the edge of nowhere, and built something new from what he’d found. Not well built by many rules, and the sound was drowsy, sure, but deep, Mason could hear that just bowing the strings. He wondered what it would sound like in Delgado’s hands. Something by de Sarasate. A Bach violin concerto. Or maybe it would be some dance number, once played in a small front room while the rain fell outside, and Vancouver wasn’t even a city yet, a song interrupted, escaping from the violin when her fingers touched it. Maybe, he thought, it would be earlier sounds from an equally rainy night, a longhouse on the south slope toward the river, a rainy hillside that had not yet thought of becoming Vancouver. Voices. Laughter. A language he didn’t know, and a moment captured in the reverberating matrices of the wood itself.\nA few weeks after he returned from poaching the giant spruce, and had begun to accumulate the necessary components for his violin, wildfires scoured the Fraser Valley and the north shore, and the smell of smoke brimmed his eyes with love and dread so he had to call them, just to make sure.\n“Still here.” Jake said. “You okay?”\nMason could not answer that, because who was okay? No one was okay. Everyone was fine. “It smells like smoke here,” he said. “Eddie’s not doing too good with the COPD.”\n“Yeah?”\nThe world had smelled like this when he and Mom had arrived, grubby with two months in the emergency camp on Nanaimo’s waterfront, waiting for the highways to reopen so they could go home. That’s what Mom had said to him every night: we’ll go home, soon. Not to the house in Cobble Hill, which was gone now, but out to the lake. To Grandma.\n“Sophie wants to bring in trembling aspen for the other side of the firebreak, to slow the burn—” here Jake went on at length about the plans to bring in a colony, borrowed from a stand downriver. Mason couldn’t concentrate on what he said, but it was good to hear his voice and know that around him the house was darkening as the sun set, and outside you could, if you were lucky, hear the resident barn owl’s nightly call. Sophie still at work in the garden, hauling wheelbarrows to the compost. In his smoky room, Mason’s eyes ached until, finally, he wept.\nThen, suddenly, Delgado was fifteen, an intensely silent teenager in heavy black eyeliner who wore combat boots in summer and rarely spoke when she came in for strings. Then she was sixteen and her time with the Plaisir nearly over, her parents joking tensely about how much it all cost—the travel, the extra tuition, the time.\nMeanwhile, Mason made violins from the salvaged spruce and maple of a demolished bungalow on East Tenth, where he did some day labor for extra cash. In the evenings, he listened to each piece he’d nicked from the job, knocking it with a knuckle and wondering about its strengths, its provenance. He broke down a chest of drawers from Goodwill, scraping away the paint to show flamed maple. Oak flooring coated in decades of grime. A cricket bat made of willow, deeply scarred, might have provided the blocks he needed, but it was worm-eaten to the core.\nHe searched Stanley Park and found a shining willow near Beaver Lake, unusually straight. Salix lucida lasiandra, not the Salix alba preferred by the old Cremonese luthiers, but similarly easy to carve, and stable enough if he could find a straight length of trunk and season it properly. Resting his head against the trunk, he once again listened for the violin hiding within it, some sonic quality in the way it responded to his heartbeat, or his hand upon the bark.\nHe returned on a rainy night in January, alone, his backpack damp and heavy with gear: A hacksaw. Rope. More than anyone in the world, he missed Jacob, who had always—even when they were both kids orphaned by fire and pandemic—been cleverer and stronger than he was.\nHe’d have to top it, which was a ludicrous endeavor, and he could hear Jake laughing, and their grandfather’s anxious snort—the snort that meant, don’t do it, kiddo. Despite the snort, Mason persisted. Willow was essential, and if he could snare vacant lot rabbits and skin them for glue, he could climb and top a willow, then walk back across town to Eddie’s, where the wood might begin its secret transformation into something useable.\nHe’d climbed trees a lot as a kid. Higher even than Jake, who had a longer reach, but who was afraid of heights. It made them equals, according to Grandma. When he and Mom had arrived from the temporary camp in Nanaimo, after the rain hit in October and the fires down the coast died for the season, Jake was already there. He was waiting for his Dad to come back from the interior, where he’d gone to fight the big fire outside Princeton, when the dead pines went up like matches in the scorched afternoons. But he died by smoke inhalation on the side of a crowded road along with a hundred others, and Jake stayed, and later—when Mom left to look for work and caught the flu and died—the two of them lived like brothers.\nJake never talked about it, like Mason never talked about his mom, dying in the third wave of a new pandemic when he was seven, a few years after they’d landed back on the homestead. They all worked on the hydroponics in the workshop and the market garden on the south slope toward the lake. Weed was legal in the province back then, but the Cowichan Valley’s economy was—by conservative estimates—still more than half dark, and mostly driven by small operations like Grandma’s. And while he and Jake were orphans in a grow-op, Sophie was somewhere south of them in Langford, learning to garden with her grandfather. Eddie had just finished his years in Italy with Aldo, and was about to set up his own shop in Vancouver. Sophie studied horticulture on the mainland, then returned to Langford with a lot of knowledge and nowhere to turn it, until Jake found her on a beach in Sooke. Eddie won double gold at the Violin Society of America. Mason left school early for a cabinetry apprenticeship until a festival, where he picked up the unfinished body of a fiddle—spruce, maple, willow—and found the thing he was made to do.\nAll those people—those accidents—led him here, after midnight in the shivering wet of a rain forest park in November, and he was older than he liked to admit. Nevertheless, he pulled himself up to the lowest branch, then struggled from handhold to foothold until he was high enough to cut, relieved when the unusually straight center fell with a sound that was both troubling and familiar, the tree swaying in response to the dropped weight. He descended, limbed it, bucked it in convenient lengths, and packed five of them in his rucksack. Then, looking up, he saw a straight branch just below his cut, and he could not resist it. He remembered Jake’s wrinkled look of dread when they climbed too high, his warnings, “Do you know what could happen?”\n“I know,” Mason said, and swung up into the willow. He was a couple of meters up when the branch on which he stood—one hand snaking around to grab his hacksaw—snapped. Willow is a brittle, fast-growing tree, splendid in its youth, but soon senescent. This one, more than fifty years old, could not support a man’s weight a second time that night.\nThe ground was wet and spinning and he said, as though someone might be there, “Help me, help me,” and he thought of his mother, standing just behind his shoulder, about to answer him, pick him up, carry him home. But she wasn’t, of course, so he lay still until the ground righted itself, and the pain steadied: not faded, but no longer in crescendo. He could still move his toes. Then he found he could stand. His left shoulder screamed, but his left fingers could move. He hauled himself fifty meters to Pipeline Road and called an Uber. It was nearly a week’s wages to get back home.\nHis shoulder never healed properly: a new MRSA at the hospital, one without a name that hung out in the linens. Not one of the virulent kinds that kills you in two days, but the other ones, that persist under the skin. There was an open sinus that ran from the outer edge of his shoulder, right above where the bone had cracked. It was three months before he could work again, but Eddie kept his place, and emergency disability got him through, though he didn’t eat much once his savings ran out.\nWhen he told Jake the story—a joke, look what I did, what would Grandpa say—Sophie threatened to come over and look after him, and when he refused she just sent him Nepenthe. A few weeks out of the hospital and he could move his left arm enough to dress himself, and Eddie helped him put Sophie’s ointment on his left shoulder. He smoked it, too, in the basement in front of his workbench, the deep, slow breaths easing his shoulders out of their hunch, until he felt almost okay. By then Delgado’s term with the Plaisir had ended, and she celebrated those three glorious years with a last concert at the Chan Center, for which Mason had a ticket, and which he missed because he was still in the hospital.\n“Don’t worry,” Eddie told him. “There’s a recording.”\n“You know what I mean.”\n“I think it’s going to Prefontaine. A kid in Saskatoon. He’s good.”\n“But what’s she going to play?”\nEddie shrugged. “There are a lot of beautiful violins.”\n“No.” Mason said, in rare disagreement. “There aren’t.”\nHe ran into Delgado’s father on the street, once. “She won’t touch a violin. It’s been six months.”\n“She’s probably—”\n“—all she does is play video games. She’s staying out. She’s so angry.”\nHe went on, then he had to be somewhere and he left Mason on the sidewalk. He stood for a moment blocking traffic, thinking of Delgado speaking bitterly and at length about the globe’s many failed revolutions, her rapidly narrowing future, and he wanted to tell her: please wait, just a little longer, for me to finish it.\nA year later she received the extraordinarily fine ex-Jiang violin from an anonymous donor. He went to hear her play Bach at the Orpheum Theatre, with the Vancouver philharmonic accompanying. She was eighteen. When she came into the shop, she smiled through the eyeliner, and he asked her, “Where next? Buenos Aires?”\n“I haven’t seen you in weeks. What happened to your shoulder?”\n“I fell weird. Not Buenos Aires? Singapore?”\n“Oh. Yeah, it’s hard to rationalize unless you’ve got a lot of work. I might be playing a gig in Toronto next year. And I was down in Seattle.”\n“Recording, then?”\n“Maybe. I’m working on early childhood education,”\n“Oh,” he said, surprised. “Oh. Cool.”\n“Eventually it’ll be music therapy. Gives me something to do with the lessons Mom and Dad paid for.”\nIt hurt him to hear that, though he didn’t know if that was some pain she felt but did not speak, or whether it was his own hope, which he did not like to acknowledge, for fear of smashing it. That she’d get another term with the Plaisir. That when she was finished with it, he’d present her with his own creation, and her career would be transformed as the violin opened up, becoming something new as she played it. He had not imagined her in a classroom with toddlers, playing “Pop Goes the Weasel” while they marched in circles around a bright orange carpet. But neither had he imagined himself working for Eddie for his entire adult life, and here he was.\nFor a few years after the fall he made nothing new, just ran the shop and stirred the glue pot, and made sure that Eddie took his meds and saw his doctor. But as his arm recovered, sort of, and he no longer dreamed of falling, he could stand to look at the willow again. He could even look at the old Jack Daniels box in a corner of the storage room, which held the violin in its constituent parks. You could mistake it for kindling, if you didn’t know.\nIt still took him three years to open the box and begin work on the forms, slowly because his left shoulder remained weak and sometimes his left hand failed. But for an hour sometimes, in the evenings, he worked ribs and blocks of willow in the basement workshop at night, where he often stayed on a cot in case Eddie needed help.\nIt took another five years of austerity to pay black market prices for Gaboon ebony from Nigeria, the whole time worrying the trees would all be dead before he could save the money. In the end, the wood he needed for the fingerboard, tailpiece, and saddle cleaned out what was left of his Cremona account. But he saved money on the tuning pegs, which were boxwood poached from Queen Elizabeth Park and stained a fine black.\nBy then, Mason had moved into the shop—temporarily they said—to keep an eye on Eddie, because he’d got old. He’d always been old, in Mason’s mind, fifty when Mason joined the firm at twenty-two, but not old old. Now he shuffled around the workshop, skinnier every year, quieter. Pretty soon he stopped going down to the basement because of the stairs, so Mason set his workbench up in what had been a dining room. Eddie could still watch the till, but he hardly spoke to customers, and he was happiest at the bench in his dressing gown, working on some delicate job, listening to the grubby speakers that sat on the kitchen counter.\nOnce while they were having coffee, Eddie reached across the table for a spoon and his wrist emerged from the ragged cuff of his hoody. Mason was transfixed by how thin it was, how the skin had begun to pucker and spot, the careful way he picked up the spoon, as though every action required some calculation.\n“What are you now, seventy?” he said without thinking.\n“Dude. I’m seventy-six.”\n“Oh,” Mason said. Thought. “Then I must be—shit.”\nEddie laughed. Coughed. “Yeah. Exactly.”\nThe January he began shaping big-leaf maple (from an antique dresser) into the violin’s neck, a king tide rolled over the flats by the hospital and the science center. That restarted talk about a sea gate at the mouth of False Creek, though debate continued about how much of the original coastline should be preserved. The old beaches flooded now, water creeping up over the grass below the planetarium. Once Mason saw a river otter slip across a concrete path and into False Creek. The river otter seemed untroubled by his new home, just like the seagull or the ducks.\nHe went back to the shop to tell Eddie about the first finger of floodwaters sliding across Main Street like a prefigure. Fifty cm rise as predicted, then another half-meter from a king tide, and here we were, in the future, watching mussels grow over the bases of pillars that had once upheld shades over the park benches of wealthy Yaletown residents. He wanted to say to the walls that had once contained False Creek: turn it back.\nHe got home to find Eddie listening to Melchior play the Bach exercises on the Bourbon viola. Mason stowed the billets in the basement workshop. He could hear Melchior upstairs while he did it, louder than Eddie usually did, so some of the low notes rattled the door to the workshop.\nUp the stairs, eyes still full of the floodwaters engulfing Main Street, he stopped in the doorway about to spill his news and said, “What’s wrong?”\nWildfires in the Po Valley, burning farms and groves left dry by a five-year drought. Cremona engulfed, and at least a thousand people dead. The Museo del Violino lost, and a pietà, a portrait of St. Sebastian from a small town. An altar piece and a collection of fine instruments stored in Torino.\n“No more Cremona,” Eddie said. “I should have asked Aldo last week—”\nMelchior filled the tired silence.\n“I wish,” Eddie said in the torn voice of a night spent coughing in the lumpy old futon chair in the corner of his room, which bore the dark marks of his hands where he had been resting them for forty years. “I wish I’d enjoyed it all more.”\n“I don’t—”\n“—I mean, sure I should have done more to change things and been a proper revolutionary or whatever the fuck. But actually I just wish I’d spent less time thinking about it, and more—I miss coffee, you know? Really good coffee and drinking it in a coffee shop. I miss knowing I could get on an airplane at any time and go to Cremona and see Aldo, just to see him. I don’t think I enjoyed it enough. And here we are. And it’s too late.”\n“It’s not too late,” Mason said.\n“No more elephants. No more ebony trees. No more Cremona. No more Aldo.”\n“It’s not.” He thought of the silence after the chainsaw, and the men who waited as the spruce fell, cougars moving soundlessly in the tinderbox woods around them. He thought of the storm of its branches hitting the ground, and the way it shuddered under his feet, and how he had found it, the core pieces, the heartwood of his violin, which had been alive in the seventeenth century, and which had waited on a hillside until now.\nFirst Eddie laughed, “Oh, dude,” he said, and coughed.\nMason thumped the old man’s back with his good arm, still saying, “It’s not too late.”\nHe couldn’t explain it because they had arranged a silence regarding the violin, and the things he did to build it. He couldn’t explain, but it wasn’t too late because under a tarp in a shed, in that bit of land between the lake and the ghost forest, the spruce had been seasoning for fifteen years. In a box under his workbench he had black market Gaboon ebony for the fingerboard, one of the last shipments smuggled out of Nigeria: fine-pored, dense, deeply black ebony. He had glue made from the skins of rabbits he had trapped at night. He had carved the geometrically perfect scroll of its neck from a piece of two hundred year old big-leaf maple. And soon, soon, he would bring them together into something miraculous.\nIt must happen soon, though, looking down at the old man, his lips and chin slick with sputum coughed up in the last paroxysm.\n“You look like your dad,” was the first thing Jacob said to him when, late on the third day of travel, he reached the house by the lake, slack-jawed and greasy-haired (once that trip had been measured in hours, you could be there and back in a day). It had been fifteen years since his last visit. His shoulder—numb with the weight of his backpack—twitched in its socket, swollen and tender. He was limping, too, by the time he made it to their gate.\n“I feel like I got old like, suddenly. How’s Sophie?”\n“Great,” she answered. Mason started. In his exhaustion he had not realized that the frizzle-haired figure in the doorway was Sophie, the greenish light of the lantern casting her face in craggy shadows and lines. “Yeah, we age hard now,” she said. “But that’s everyone. And your shoulder’s still bad. I’ll look at it.”\nThey lifted his backpack, then helped him with his shirt. Sophie’s sweet, botanical scent and her fingers overtook him, then a hot cloth washing away the dried fluids that had seeped from the open wound in his shoulder.\n“It’s an abscess.” she said. “But I imagine you know that. Do you still have a doctor? Are they giving you anything? I don’t like the smell.”\nHe no longer had a doctor, but the guy at the clinic helped sometimes. “Nothing to do except surgery.”\nThen the heavy skunk of Nepenthe overtook the ache, a scent that reminded him of his grandmother’s garden on a hot day, penetrating and astringent beneath the peppermint and lemon balm.\n“It smells like—” he said in a voice that seemed to come from far away, but he couldn’t tell them, exactly, what it smelled like. Like home, maybe. Like his mother, when he had a mother. Then they helped him to the old back bedroom. He didn’t remember anything after that.\nWhen he woke shortly before noon, Sophie was gone but Jake was there on the porch outside the kitchen, drinking something sort of like coffee made out of toasted barley.\n“She’s been working with the Forestry Lab at UVic on some trees. Someone she knew in undergrad got ahold of her and they’ve been working together. Genetic mods. Fast growing. Carbon sinks. Drought resistant. It’s promising.”\nIt was the first good news Mason had heard in a long time. Together they walked up to the gardens she’d been building on old house sites. The street still showed traces of tarmac, if he kept his eyes fixed on the remaining yellow street paint. If he looked between his feet and listened to Jacob talk, and felt the lake breeze, the town could be as it was when he was a kid. Maybe. Or when his mother lived here before the fires. Or before that, when their grandparents built this homestead at the edge of nowhere and Ts'uubaa-asatx kids played in the lake.\nBut then, Ts'uubaa-asatx kids still played in the lake, and white kids, and the Sikh kids had returned to Paldi when the village grew up around the temple again. Kids climbed through the alders that grew in the path of old fires, picking blackberries rich with the heat of a new world. Kids fishing and weeding garden plots where the houses had been demolished. Kids singing songs he didn’t recognize.\nJacob was limping slightly now. They stopped when they saw Sophie in the middle of a garden near the water, her hair a frizz of gray in the sunlight, and a couple of boys and girls nearby, their arms full of green. Her hands were dirty, right up to the elbows, and when she saw them walking toward her, she waved the carrot tops she held.\n“Rajinder brought some Jersey cows from up-island,” she explained. “They like the carrot tops. It’s our turn to get a couple of liters. The butter is ah-fucking-mayzing.”\nThat evening they ate a soft farmer’s cheese from Rajinder’s herd, and she talked about the trees, the plantation on the old townsite, about more plans with Ts'uubaa-asatx Nation, a gang of kids replanting the burned-out subdivisions from twenty years before. You couldn’t see the old roads in some places, she said. It’s like they’re gone.\n“Where?”\n“Everywhere,” she said. “It’s the regreening. We lost what, ninety percent of our population to the mainland? So why not give it all back? Some of the Cowichan kids started it in the subdivisions nearer the coast, torching the houses last winter. Give it a couple of hundred years, and people will be making violins from the trees we’re planting.”\nHe didn’t want to say it, but her newly wild world—without roads, without houses—filled him with a terrible bitterness he could not describe. “They won’t sound the same,” he said.\n“Nope,” Jacob said. “Not at all the same.”\nThat night he lay a long time in the half-sleep of pain and painkillers, his shoulder numb from Sophie’s ministrations that evening. He could not escape the crash of the old Sitka spruce hitting the ground, the crunch of five hundred years of upward growth giving in, finally, to gravity. He wondered if it would still be standing if he hadn’t mentioned it to Jake fifteen years ago, in the middle of the night, when he was going to demolition sites looking for old spruce and wild with ambition for Delgado, who would play Moscow and Barcelona and Singapore. Jake had asked where it was: Did he remember how to get there? Could he find it on a map?\nMason did remember, and said I’d like to be there. I’d like to listen to it. A couple of months later, Jake had mentioned it again, and here we are, he thought, his shoulder throbbing dully on the other side of Nepenthe.\nThe day Mason returned from the island, Eddie woke him up just before midnight, when it was still hot and airless.\n“I gotta. Go. In.” he said.\n“Where?” Mason asked, stupidly, then realized what Eddie meant, found his shoes and helped the old man down to the curb, where they waited for an Uber, then waited at the hospital for seven hours, Eddie silent, breathing roughly in, and raggedly out again, while other patients paced, sometimes shouted, and a fluorescent tube above their heads flickered and hissed.\nThey kept him in for a couple of days. When Mason visited him with things from home—his tablet, a sweater, a newly refurbished violin for inspection—he was a shrunken, cranky man, complaining to the nurse in a small, petulant voice. It was so hot. Could they do something about it? The heat.\nMason sat with him while he ate, then walked an hour back to the shop, where he had set up a bed in the basement, the nearly-cool room that smelled of wood shavings and resin and glue, which was comforting while—on the other side of the peninsula—Eddie struggled with each breath in turn. Here it was almost quiet. Just Mason and the remaining problem: the sound post. Properly speaking, it should be made of spruce, like the front, but he wanted something that had seasoned longer than fifteen years. Something precious to hide away, something only he would know about.\nThere was the old fiddle, the one some frontiersman made out of wood salvaged from the skids that once ran through Gastown and the beams of longhouse. Once, shortly after he met her, Delgado came into the shop for an order of strings and Eddie brought it out. She played “Where Does That River Run?” and he had laughed, and asked her to play again, anything, to wake the violin up and keep it alive a little longer. She had played at length and with wild generosity: sweet old waltzes; the Québécois “Reel de Napoleon”; a Cape Breton lament.\nHumming, he climbed the stairs. He let himself into the shop and opened the display case that held the old fiddle.\nIt was another crime. Nevertheless, he carried it downstairs to his bench. He did not want to think too much, so he worked quickly: pulling the old sound post out and adding a new one, returning the violin to the store’s display case. Downstairs, the old bit of dowel was rough against his fingers. Cedar, maybe from the same post in the longhouse on the Fraser, light and ancient and marked by the original luthier’s rough knife. Fragrant when he warmed it with his hands, but no potent aromatics, just a deep and redolent dust.\nThen he fitted it, and it hid so perfectly in his violin, maybe no one would know the terrible thing he had done, the secret history he had stolen like all the other secret histories that constituted his violin. He knew, though, all the courses that materials took, from Nigeria, from the islands, from demolished bungalows in east Van, from vacant lot rabbits, and from Stanley Park.\nEven from his bed, even on oxygen, Eddie was critical when Mason brought it upstairs, examining it with an eyeglass until he conceded that the sound was as fine, in its own way, as any number of other violins he’d seen. Finer, even, than the composites he’d started to use for his own work (when he could work), corene and carbon fiber.\n“You made something, kid.” It had been a long time since anyone had called him kid, even Eddie. “Does it have a name?” Eddie asked.\n“Does it need one?” If it had to be named it should be something elegant and sonorous. Kiidk'yaas. “I don’t know. The Vancouver violin.”\n“Better than that.”\nEddie wouldn’t play it, and neither would Mason. Delgado was swamped at the center, and had a toddler, so while the violin—Spruce Goose?—was finished in September, they didn’t hear it until the New Year.\nShe was late. That was okay. The toddler was with her, which was slightly disturbing, but Mason figured they could keep her away from the detritus of the apartment, which was mostly workshop. And there were dry little cookies, at least, to feed her, at the back of a kitchen cupboard.\n“I meant to leave her at home, but you know Johnny got a last minute shift—”\n“No worries,” Eddie said, quietly because he could only speak quietly now. “We’re just happy to see you.”\n“This is it?”\nMason’s throat was unaccountably closed, so he just—Delgado juggled Belinda from one arm to the other. “Oh,” she said. “Oh.”\n“Mommy?” Belinda murmured, sleepy.\n“I’m going to put you down for a sec.”\nShe rubbed her hands on her jeans, Belinda now squatting at her feet, leaning on her knee.\n“Oh,” she said. He thought he saw a tremor. Her face dropped into her neck, so her hair fell forward and she looked as she had when she was fourteen and coming into the shop for new strings special-ordered from Berlin, talking about Bach.\nThen the bow drawn across the open E, and he heard it, the sweetly deep, the brightly clear reverberation. Delgado made a wild little laugh and ran a scale, another scale, then interlocking arpeggios. Ševčík.\nAt her feet, Belinda spoke to a little blue bear, patting her threadbare ears.\nDelgado dropped the violin from her neck, cradled it. Her eyes were bright, as though with tears, but her voice was warm.\n“It is—oh, Mason!”\n“Will you play something?”\nShe played Beethoven. The Kreutzer Sonata, as though she remembered the night that had stuck forever in Mason’s heart: the Chan Center, and the Plaisir violin, and Delgado. Eddie leaned to the left side of his wheelchair, his eyes closed, the oxygen tank hissing faintly, the sound of people at the window, Belinda’s murmurs to Bear. All these interruptions should be maddening, but they were not, and only seemed to complement the room’s fragile magic.\nWhen she was finished she sat heavily on the remaining chair.\n“How long have you been working on it?”\n“A while,” Mason said and saw her as she had been, fifteen and brilliant with an actual future stretching all the way to Paris. He had imagined hearing it for the first time in some acoustically perfect opera house, because the world would have recovered by then. He knew it was foolish, but it hurt to think Delgado would never carry it away from this provincial little corner.\n“What will you do with it now,” she asked, a wobble in her voice, the harmonics of longing. “Who’ll play it?”\nIt was strange to him that she needed to ask.\n“No.” she said when she understood. “Oh no. No.”\nBelinda looked up from Bear. “Mommy. Mommy?”\n“You can use it in your classroom, can’t you? I think it’ll age okay. It’ll open up.”\nShe didn’t respond for a minute, but crouched down to where Belinda sat with Bear, her brow furrowed with worry for her mother. Then she stood and asked, “Does it have a name?”\n“See? It should have a name,” Eddie said.\nMason heard the oceanic crash of falling spruce, his own cry as he hit the dirt at the base of a shining willow in Stanley Park. The market garden and the homestead, the lake, the abandoned subdivisions and the burn lines that still showed through the underbrush, the ghost forests, the dead black teeth of what had once—a long time ago—been a rainforest. And among them, Jacob still cutting lumber and helping out at the garage when he could, fishing and hunting. Sophie in the greenhouses and the gardens, with her new Garry oak trees and her transfigured arbutus, the beetle-resistant spruce that would never, ever, be the kind of tonewood he wanted. The firebreaks of trembling aspen, the return of cougars. The steady erosion of human shapes: foundations and roads all lost to the burgeoning forest.\n“Nepenthe?”\nAs he said it, he wasn’t sure what it meant: a physick that would make the end easier; a draft of healing medicine.\n“Nepenthe.” Eddie said. “There it is.”\n“Remember,” Sophie had said before he left. “You’re going to come back here for good, eventually. It’s still home.”\nUnspoken: come back when Eddie has died and you’re ready to give up on global dreams and figure out how to live out the rest of your days in this shopworn future.\nHe had just nodded through the ache of disappointment that had accompanied him for decades, now. But a tiny, exhausted part of him almost liked imagining it, how he’d go back to work in the garden, raising saplings for the new forest that even now overtook the old world, watching kids disappear into the wild.\nMasami Lucretia Delgado plays the Nepenthe violin daily for forty-five years, even if it’s only ten minutes when she gets home from work, her kids playing noisily outside the bedroom. Five minutes before everyone else is awake, Belinda fourteen and saying Mom are you seriously playing right now? she plays it on the day they leave their apartment because the seawall at the mouth of False Creek has failed. She plays it in the back of a car as they drive inland, toward interim housing in which they’ll live for five years. Nepenthe is a fixture in the temporary-but-actually-permanent school she establishes in a slipshod village on the Fraser River. Together, she and Nepenthe accompany Belinda’s wedding, and Masami’s grandchildren fall asleep to lullabies from those strings. Despite her daily practice, she will never hear its most perfect expression: the violin will be its best long after the maker is dead, and the first hands that played it are too crippled by arthritis to make more than sighs. But she will play on while she can, because the violin must not go to sleep, and the longer she plays it, the more the alchemy of sound—the resin, perhaps, the glue, the cellular acoustics of the wood itself—will transform the object, preparing it for its ultimate player. Maybe her youngest daughter—the finest musician of all her children—or her granddaughter, will first hear the violin open up into its richest, fullest tone. Maybe it will be someone a hundred years in the future, who lives in a different world than we do, but who will pick up the instrument and draw her bow across the strings, releasing the reverberations of a thousand thousand crimes and accidents into the singing air.\nRebecca Campbell is a Canadian writer and teacher whose speculative fiction has appeared most recently in The Magazine of Fantasy and Science Fiction and Shadows and Tall Trees. Her work has won the Sunburst and Theodore Sturgeon Memorial Award, and been nominated for the Aurora Award. NeWest Press published her first novel, The Paradise Engine, in 2013, and in 2022, Undertow Publications will publish her First World War horror novella, The Talosite. She mostly uses her PhD in Canadian literature to make up sad futures and weird fictions.", "source": "https://clarkesworldmagazine.com/campbell_08_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Important Failure by Rebecca Campbell"}