{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "YwiIptrG0cZg6EgNqzcON3U+JR0=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Biker Chick Who Rides Her Own Bike: A Conversation with Nathan Long  Jane Carver gnashes her teeth, shakes her head. Ol' Dutch wants him \"a piece.\" Taunting, heckling. . . he's more of a nuisance than an outright threat to Carver.  Besides, Carver's got a record and doesn't need another strike against her, so she throws a leg over her \"fat-boy\" motorcycle and smokes her Marlboro. She's a self-professed \"swamp-trash country girl,\" a biker chick, tough as nails. She can take care of herself, thank you very much.  Then Ol' Dutch goes too far.  \"You can say all you want to me,\" says Jane Carver. \"Sticks and stones and all that, but no man, or woman for that matter, puts hands on me without invitation. It's not a code or a creed or something I even think about. It just sets me off, and when I get my mad-on the world turns red and hot and Jane isn't driving the bus anymore. I punch him once. Once.\"  That single punch is more than enough to kill Ol' Dutch and launch Jane Carver into a weird and wild ride that begins standing over a dead body on the sidewalk in front of a bar and leads to Waar, a planet where the sky is \"Ty-D-Bol blue,\" the locals are purple, and nothing seems quite right.  Jane Carver of Waar is adventure fiction at its rowdiest. And it's Nathan Long at his freest, loosest, and most wildly inventive.  Very much a voice-driven, character-rich narrative, Jane simultaneously pays tribute to and parodies Edgar Rice Burroughs' iconic John Carter of Mars stories.  Long's previous novels are set in the Warhammer Fantasy universe. His first trilogy features Reiner Hetzau and his band of criminals. The premise is simple: the Blackhearts are given the option of punishment for their crimes or they can complete impossible missions for Count Manfred. Fortunately for readers, they choose the latter. In 2006, Long took over as the writer in charge of William King's iconic Warhammer duo, Gotrek and Felix. Most recently, he's begun the novel-length tales of Ulrika the Vampire.  In the Warhammer universe, Long favors dark heroes, tight plots, gallows humor, and brutal action. On Waar, Long eases up on the reins a little and really cuts loose.  Below, Long and I discuss Jane Carver, John Carter, and moving the plot along.   What do you enjoy about writing fiction in general and what did you enjoy about writing Jane Carver of Waar in particular?  In general, I love telling stories. I was an avid reader as a kid, but like a lot of avid readers, the kind that live the stories and want to disappear into the books, I didn't just want to sit on the sidelines. I wanted to tell my own and pull people into my stories the way other had pulled me into theirs.  More specifically, I love plot and character, and how each generates the other. While I like world building and scene setting, what I really love is coming up with an interesting, engaging character, then figuring out how I can ruin their day with a nasty, twisty, plot. I like the puzzle box challenge of plotting, fitting all the elements of the story into a tight structure in order to make a balanced whole that also moves along at a brisk pace and comes to a satisfying conclusion.  With Jane, what I loved was her voice. So much of my fiction is set in pre-industrial fantasy worlds, in which I have to be careful to describe everything in ways that make sense with the setting. For instance, I can't describe a charge of cavalry smashing into a wall of infantry like a freight train, because there are no freight trains in that world. With Jane, all that's out the window. Jane is a modern gal sent to a pre-industrial planet, who has brought her modern vocabulary and idiom with her. If she wants to describe a striped, six-limbed alien as having the face of the MGM lion, or say that the flower of an alien plant was the pink of a hooker's hot-pants, I don't have to stop her. She can say whatever she wants.  To me, that's one of the central gags of the book — taking the old fashioned scenery and situations of planetary romance and seeing them through the eyes — and the vernacular — of someone who doesn't usually get to be the hero of that kind of book.  Where on earth did you find Jane Carver?  I came up with Jane because, while I loved John Carter of Mars and all its imitators, the heroes always bored the shit out of me. They were always tall, square-jawed, stern-eyed men with no sense of humor and no self-doubt. Jane was my reaction to that. As I said above, I wanted to see what would happen if a different kind of person had the same kind of adventure John Carter and all his stuffed shirt buddies had. And Jane was about as different as I could think of.  I didn't want to make her a typical adventure heroine either. I didn't want Jane to start weak and powerless and grow strong through adversity. Nor did I want her to be the cold killer who has abandoned her femininity in order to fight injustice. I've seen those heroines too many times before. I wanted Jane to be a kind of woman I've met many times in real life, but rarely in books — the boisterous gal at the honky-tonk, the brassy broad at the ren faire, the biker chick who rides her own bike, and doesn't need any help picking it back up again when she ditches, thank you very much. I wanted her to be woman who could take care of herself, but who too often let her appetites get her into trouble — both of which are ideal attributes for an action heroine to have.  What do you admire about Edgar Rice Burroughs' fiction and his vision of the world?  Edgar Rice Burroughs was a master of invention. He created many fantastic worlds — Barsoom, Pellucidar, Tarzan's Africa — and characters — John Carter, the Mucker, and of course Tarzan, who is perhaps the most recognizable adventure hero ever.  Burroughs was also a genius at coming up with monsters, races, places, machines, strange pseudo-science, and incredible situations. He is the great American father of genre. Science fiction and adventure fiction would not have been the same without him, nor nearly as fun.  What he was not so good at, however, was plot and character. As I said above, John Carter is a bit of a cardboard cut-out, and ERB's other characters are the same. They are all pretty much interchangeable. Tarzan on Mars would be John Carter, and John Carter in the jungle would be Tarzan. His plots are fairly interchangeable too, all very linear and episodic across all his series. I hold neither of these things against him, however. He was self taught, and a man of his time and place, writing at the beginning of a genre and inventing it as he went along. If he were alive today, with the benefit of having read a century's worth of the science fiction and fantasy that he helped invent, he would very likely write with more modern techniques and sophistication. Hopefully he would remain as original as well.  How'd you go about plotting Jane Carver of Waar?  I am of the note card and three act structure school. Once I have a rough idea for a story and a firm idea of how it ends, I start laying it out in three acts, using the ends of the acts and the mid-point as markers for where my major turns should go, then filling in the scenes around them using post-its. Once I have all my post-its laid out, I pour over them a while, tearing some up and replacing them with others until everything makes sense and the scenes flow smoothly, and there are no continuity problems.  With Jane, I was not as careful with the plot as I normally would be. I would usually be a lot tighter and symmetrical, weaving subplots through and making sure that things at the beginning pay off neatly at the end, but I wanted the book to mimic the Barsoom books not just in spirit but in structure, and, as they were originally written as serial chapters that appeared in pulp magazines, they tend to be very linear and episodic. Dejah Thoris is kidnapped, John Carter races off to rescue her, but before he can save her, she is taken to another place, so he races off to rescue her again, but before he can save her, she is taken to another place, and so on until he finally saves her at the end of the book. I wasn't quite as linear as that, but I did let the story follow it's nose, and play out in distinct episodes more than I normally would.  Can you talk a little about building Waar?  I'm ashamed to say that, just like the plotting, I was not as careful with Jane as I have been with other books. Indeed, I basically just made it up as I went along. I had some basic concepts before I started. I knew I wanted Waar to have a very hide-bound, honor-bound society. I knew I wanted there to be parallels to a lot of the races and animals that appeared in the Barsoom books, but I didn't want to make it a one-for-one recreation. I deliberately didn't re-read the John Carter books before I started writing. I wanted Jane to be fueled by the memories of what the Barsoom books felt like to read when I was a kid, not how they actually were.  Is there a part of Waar you'd most like to visit? Least like to visit?  Hmmm. Good question. Of all the places in the book, I think I'd like to explore Ormolu, the capital city of Ora. I set a fair amount of action there, but there is so much more to explore — much more than there was space to mention in the midst of the plot.  As for the place I'd least like to go, I would pick the inside of the Temple of Ormolu, since it is said that, but for its priests, no-one who enters it ever returns to the outside world.  Any advice for writing action scenes?  Be briefer than you think you need to be. I have a tendency to overwrite action, and I really have to watch it. Blow by blow descriptions gets boring pretty quickly. Try to get the feeling of movement and danger into it too. An action scene where there doesn't seem to be any risk or danger for your hero isn't going to thrill anyone.  Also, an action scene has to move the plot along just like any other scene. If nothing has changed for your heroes at the end of an action scene, it probably wasn't necessary.  Will we be seeing Jane Carver again?  Absolutely. I am hard at work on the sequel, Swords of Waar, as we speak.  And what's next for you?  I've got quite a lot coming down the pike. In addition to Jane Carver of Waar, which comes out on March 6th, I have two Warhammer books debuting soon. First is the Gotrek and Felix Anthology, which comes out March 27th, in which I have one short story and one novella. After that is Bloodsworn, the third in the Ulrika the Vampire series, which comes out may 29th. Also Swords of Waar is supposed to come out later this year, but I don't know the date yet, and I have a few under the radar projects which I can't talk about yet, but which I'm really excited about. Stay tuned!  Any parting words of advice, encouragement, or mischief?  I'll give you the advice I've been trying to give myself for the past few months: turn off the Internet once in a while. You'll be able to concentrate more on your writing, you'll see things first hand instead of on YouTube, and you might pick up a book by accident and read it. That would be a good thing, particularly if it was mine.  Thanks again for interviewing me. I had a blast!  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nThe Biker Chick Who Rides Her Own Bike: A Conversation with Nathan Long\nJane Carver gnashes her teeth, shakes her head. Ol' Dutch wants him \"a piece.\" Taunting, heckling. . . he's more of a nuisance than an outright threat to Carver.\nBesides, Carver's got a record and doesn't need another strike against her, so she throws a leg over her \"fat-boy\" motorcycle and smokes her Marlboro. She's a self-professed \"swamp-trash country girl,\" a biker chick, tough as nails. She can take care of herself, thank you very much.\nThen Ol' Dutch goes too far.\n\"You can say all you want to me,\" says Jane Carver. \"Sticks and stones and all that, but no man, or woman for that matter, puts hands on me without invitation. It's not a code or a creed or something I even think about. It just sets me off, and when I get my mad-on the world turns red and hot and Jane isn't driving the bus anymore. I punch him once. Once.\"\nThat single punch is more than enough to kill Ol' Dutch and launch Jane Carver into a weird and wild ride that begins standing over a dead body on the sidewalk in front of a bar and leads to Waar, a planet where the sky is \"Ty-D-Bol blue,\" the locals are purple, and nothing seems quite right.\nJane Carver of Waar is adventure fiction at its rowdiest. And it's Nathan Long at his freest, loosest, and most wildly inventive.\nVery much a voice-driven, character-rich narrative, Jane simultaneously pays tribute to and parodies Edgar Rice Burroughs' iconic John Carter of Mars stories.\nLong's previous novels are set in the Warhammer Fantasy universe. His first trilogy features Reiner Hetzau and his band of criminals. The premise is simple: the Blackhearts are given the option of punishment for their crimes or they can complete impossible missions for Count Manfred. Fortunately for readers, they choose the latter. In 2006, Long took over as the writer in charge of William King's iconic Warhammer duo, Gotrek and Felix. Most recently, he's begun the novel-length tales of Ulrika the Vampire.\nIn the Warhammer universe, Long favors dark heroes, tight plots, gallows humor, and brutal action. On Waar, Long eases up on the reins a little and really cuts loose.\nBelow, Long and I discuss Jane Carver, John Carter, and moving the plot along.\nWhat do you enjoy about writing fiction in general and what did you enjoy about writing Jane Carver of Waar in particular?\nIn general, I love telling stories. I was an avid reader as a kid, but like a lot of avid readers, the kind that live the stories and want to disappear into the books, I didn't just want to sit on the sidelines. I wanted to tell my own and pull people into my stories the way other had pulled me into theirs.\nMore specifically, I love plot and character, and how each generates the other. While I like world building and scene setting, what I really love is coming up with an interesting, engaging character, then figuring out how I can ruin their day with a nasty, twisty, plot. I like the puzzle box challenge of plotting, fitting all the elements of the story into a tight structure in order to make a balanced whole that also moves along at a brisk pace and comes to a satisfying conclusion.\nWith Jane, what I loved was her voice. So much of my fiction is set in pre-industrial fantasy worlds, in which I have to be careful to describe everything in ways that make sense with the setting. For instance, I can't describe a charge of cavalry smashing into a wall of infantry like a freight train, because there are no freight trains in that world. With Jane, all that's out the window. Jane is a modern gal sent to a pre-industrial planet, who has brought her modern vocabulary and idiom with her. If she wants to describe a striped, six-limbed alien as having the face of the MGM lion, or say that the flower of an alien plant was the pink of a hooker's hot-pants, I don't have to stop her. She can say whatever she wants.\nTo me, that's one of the central gags of the book — taking the old fashioned scenery and situations of planetary romance and seeing them through the eyes — and the vernacular — of someone who doesn't usually get to be the hero of that kind of book.\nWhere on earth did you find Jane Carver?\nI came up with Jane because, while I loved John Carter of Mars and all its imitators, the heroes always bored the shit out of me. They were always tall, square-jawed, stern-eyed men with no sense of humor and no self-doubt. Jane was my reaction to that. As I said above, I wanted to see what would happen if a different kind of person had the same kind of adventure John Carter and all his stuffed shirt buddies had. And Jane was about as different as I could think of.\nI didn't want to make her a typical adventure heroine either. I didn't want Jane to start weak and powerless and grow strong through adversity. Nor did I want her to be the cold killer who has abandoned her femininity in order to fight injustice. I've seen those heroines too many times before. I wanted Jane to be a kind of woman I've met many times in real life, but rarely in books — the boisterous gal at the honky-tonk, the brassy broad at the ren faire, the biker chick who rides her own bike, and doesn't need any help picking it back up again when she ditches, thank you very much. I wanted her to be woman who could take care of herself, but who too often let her appetites get her into trouble — both of which are ideal attributes for an action heroine to have.\nWhat do you admire about Edgar Rice Burroughs' fiction and his vision of the world?\nEdgar Rice Burroughs was a master of invention. He created many fantastic worlds — Barsoom, Pellucidar, Tarzan's Africa — and characters — John Carter, the Mucker, and of course Tarzan, who is perhaps the most recognizable adventure hero ever.\nBurroughs was also a genius at coming up with monsters, races, places, machines, strange pseudo-science, and incredible situations. He is the great American father of genre. Science fiction and adventure fiction would not have been the same without him, nor nearly as fun.\nWhat he was not so good at, however, was plot and character. As I said above, John Carter is a bit of a cardboard cut-out, and ERB's other characters are the same. They are all pretty much interchangeable. Tarzan on Mars would be John Carter, and John Carter in the jungle would be Tarzan. His plots are fairly interchangeable too, all very linear and episodic across all his series. I hold neither of these things against him, however. He was self taught, and a man of his time and place, writing at the beginning of a genre and inventing it as he went along. If he were alive today, with the benefit of having read a century's worth of the science fiction and fantasy that he helped invent, he would very likely write with more modern techniques and sophistication. Hopefully he would remain as original as well.\nHow'd you go about plotting Jane Carver of Waar?\nI am of the note card and three act structure school. Once I have a rough idea for a story and a firm idea of how it ends, I start laying it out in three acts, using the ends of the acts and the mid-point as markers for where my major turns should go, then filling in the scenes around them using post-its. Once I have all my post-its laid out, I pour over them a while, tearing some up and replacing them with others until everything makes sense and the scenes flow smoothly, and there are no continuity problems.\nWith Jane, I was not as careful with the plot as I normally would be. I would usually be a lot tighter and symmetrical, weaving subplots through and making sure that things at the beginning pay off neatly at the end, but I wanted the book to mimic the Barsoom books not just in spirit but in structure, and, as they were originally written as serial chapters that appeared in pulp magazines, they tend to be very linear and episodic. Dejah Thoris is kidnapped, John Carter races off to rescue her, but before he can save her, she is taken to another place, so he races off to rescue her again, but before he can save her, she is taken to another place, and so on until he finally saves her at the end of the book. I wasn't quite as linear as that, but I did let the story follow it's nose, and play out in distinct episodes more than I normally would.\nCan you talk a little about building Waar?\nI'm ashamed to say that, just like the plotting, I was not as careful with Jane as I have been with other books. Indeed, I basically just made it up as I went along. I had some basic concepts before I started. I knew I wanted Waar to have a very hide-bound, honor-bound society. I knew I wanted there to be parallels to a lot of the races and animals that appeared in the Barsoom books, but I didn't want to make it a one-for-one recreation. I deliberately didn't re-read the John Carter books before I started writing. I wanted Jane to be fueled by the memories of what the Barsoom books felt like to read when I was a kid, not how they actually were.\nIs there a part of Waar you'd most like to visit? Least like to visit?\nHmmm. Good question. Of all the places in the book, I think I'd like to explore Ormolu, the capital city of Ora. I set a fair amount of action there, but there is so much more to explore — much more than there was space to mention in the midst of the plot.\nAs for the place I'd least like to go, I would pick the inside of the Temple of Ormolu, since it is said that, but for its priests, no-one who enters it ever returns to the outside world.\nAny advice for writing action scenes?\nBe briefer than you think you need to be. I have a tendency to overwrite action, and I really have to watch it. Blow by blow descriptions gets boring pretty quickly. Try to get the feeling of movement and danger into it too. An action scene where there doesn't seem to be any risk or danger for your hero isn't going to thrill anyone.\nAlso, an action scene has to move the plot along just like any other scene. If nothing has changed for your heroes at the end of an action scene, it probably wasn't necessary.\nWill we be seeing Jane Carver again?\nAbsolutely. I am hard at work on the sequel, Swords of Waar, as we speak.\nAnd what's next for you?\nI've got quite a lot coming down the pike. In addition to Jane Carver of Waar, which comes out on March 6th, I have two Warhammer books debuting soon. First is the Gotrek and Felix Anthology, which comes out March 27th, in which I have one short story and one novella. After that is Bloodsworn, the third in the Ulrika the Vampire series, which comes out may 29th. Also Swords of Waar is supposed to come out later this year, but I don't know the date yet, and I have a few under the radar projects which I can't talk about yet, but which I'm really excited about. Stay tuned!\nAny parting words of advice, encouragement, or mischief?\nI'll give you the advice I've been trying to give myself for the past few months: turn off the Internet once in a while. You'll be able to concentrate more on your writing, you'll see things first hand instead of on YouTube, and you might pick up a book by accident and read it. That would be a good thing, particularly if it was mine.\nThanks again for interviewing me. I had a blast!\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/long_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Biker Chick Who Rides Her Own Bike: A Conversation with Nathan Long by Jeremy L. C. Jones"}