{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lisa L Hannett", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xkSBv0voeb4jTuhQM+vyJQhd+xs=", "id": null, "license": null, "comments": "", "raw_text": "3310 words, short story  Sweet Subtleties  Javier calls me Una, though I’m not the first. There are leftovers all around his studio. Evidence of other, more perishable versions. Two white chocolate legs on a Grecian plinth in the corner, drained of their caramel filling. A banquet of fondant hands, some of which I’ve worn, amputated on trays next to the stove. Butter-dipped petals crumbled on plates, lips that have failed to hold a pucker. Butterscotch ears, taffy lashes, glacé cherry nipples. Nougat breasts, pre-used, fondled shapeless. Beside them, tools are scattered on wooden tables. Mixing bowls, whisks, chisels, flame-bottles. Needles, toothpicks, sickle probes, pliers. Pastry brushes hardening in dishes of glycerin. In alphabetical rows on the baker’s rack, there are macadamias, marshmallows, mignardises. Shards of rock candies, brown, yellow and green, that Javier uses to tint our irises. Gumdrop kidneys, red-hot livers, gelatin lungs. So many treats crammed into clear jars, ready to be pressed into cavities, tissue-wrapped and stuffed into limbs. Swallowed by throats that aren’t always mine.  “Delicious,” I say as Javier jams grenadine capsules into my sinuses, a surprise for clients with a taste for fizz. “Delicious.” The word bubbles, vowels thick and popping in all the wrong places. Gently frowning, Javier crushes my larynx with his thumbs. He fiddles with the broken musk-sticks, tweaking and poking, then binds the voice box anew with licorice cords. I try again.  “Delicious.”  Still not right. The tone is off. The timbre. It’s phlegmatic, not alluring. Hoary, not whorish. It will put people off their meals, not whet appetites. It doesn’t sound like me.  Javier’s palm on my half-open mouth is salty. His long fingers gully my cheeks. I wait in silence as he breaks and rebuilds, breaks and rebuilds. Concentrating on my lungs, my throat. Clearing them. Making sure they are dry. I don’t mind being hushed. Not really. Not at the moment. If anything goes wrong, if I collapse this instant, if I crack or dissolve, at least my last words will have been pleasant. Something sweet to remember me by.  It won’t be like before, he said. There will be no weeping. No throttling chest-rattle. No thick, unbreathable air.  On Monday, I made my latest debut—I make so many. Served after the soup but before the viande at the Salon Indien du Grand Café. My striptease was an enormous success. Fresh and unmarked, clad in edible cellophane, my marzipan dusted with peach velvet. Even the stuffiest top-hat couldn’t resist. Javier had contrived a device to drop sugared cherries onto every tongue that probed between my legs. Dozens of gentlemen laughed and slurped, delighted I was a virgin for each of them.  “Marvelous,” they shouted, licking slick chops. “Belle Una, tonight you’re more divine than ever!”  “Marvelous,” I say, calm and mostly clear. Mostly. Close enough.  Sugar-spun wigs line a window ledge above Javier’s workbench. Faceless heads, all of them. Now visible, now obscured, as he bobs over me, intent on his work. The hairdos are exquisite. Some pinned up in elaborate curls, some plaited, some styled after Godiva. Glinting honey strands. Carmine. Deep ganache. Exquisite, all of them, despite showing signs of wear.  Between soot-streaked portraits on the walls, wooden shelves support a horde of glass molds. As one, they gape at me from across the room. Their faces as like to each other as I am to them. High brows and cheekbones, pert mouths, strong jaws, noses so straight we’d be ugly if it weren’t for our delicate nostrils. Javier insists we are identical, indistinguishable, impeccable casts of the original. We must be the same, he tells us. We must be. We must.  Once people have well and truly fallen in love, he said, they do not want variety. They want the same Una they enjoyed yesterday, last week, last month. They want the same Una, now and always. The same Una that Javier, confectioner gourmand, is forever recreating.  For the hauts bohème on Wednesday evening, I played the role of limonadière. Stationed behind the bar counter, I wept pomegranate jewels while spouting absinthe verses. Odes to beauty, freedom, love. Javier encouraged this crowd unreservedly. “They’ve loose clothes, loose hair, loose morals,” he said. “And loose purse-strings.” Under his guidance, the bohèmes tickled my limbs with the bows of gypsy violins. Scratched me with pen nibs. Trailed paintbrushes along my soft places. With each stroke, swirls of hippocras bled to my surface. Ale, brandy, champagne, rum. One by one, the lushes lapped it all up. They prefer drink to desserts, Javier said. Those with maudlin constitutions cannot keep anything substantial down.  “Una, chère Una,” the bohos cried, slurring into their cups. “Promise never to leave us again.’  Emotional drunks, I thought. Glutting themselves into confusion. Muddled on passion and wine. Can’t they see I’m here? I am forever here.  “I feel—” I begin. Javier traps my jaw. Holds it still. Wary of what, I wonder? That it will fall off with talk, no doubt. That I’ll run out of things to say before tonight’s performance.  I feel solid, I want to assure him. I feel settled. Take it easy now. Easy. I’m going nowhere. I’m right here.  Friday’s connoisseurs ate with torturous restraint.  “Pace yourselves,” the women said, cracking knuckles with the sharp edges of their fans.  “Sugar is a mere distraction for the palate,” said the men. “It will never satiate.”  As centerpiece on their ruby tablecloth, I sat with legs pretzeled into Sadean poses. Wearing garters of hardened molasses, nothing more. By the second remove of sorbet, my contorted ankles and wrists had crumbled. I couldn’t stand for all the gold in the world. My paralysis thrilled our hosts no end—as did Javier’s copper blades. Two daggers per guest. Honed to ravage goodies from my thighs, rump, belly. Tantalized, the feasters took turns at fossicking. At knifing currant ants and blackberry spiders from my innards.  “What an illusion,” they moaned, crunching aniseed antennae. “So convincing, so real . . . And not even a splash of blood! When did you learn such tricks, chère fille? Why have you not beguiled us this way before? No matter, no matter. Bravo, chère Una, et encore!”  Tips are highest when egos are stroked, my confectioner says. When pomposity is rewarded with flirtation. So Javier slapped their bony backs. He stooped and kowtowed. I bowed as best I could. Waggling my fingers and toes. Letting them caress me long after the coins had rolled.  Rigged with peanut-brittle bones, my digits made such a gratifying snap when the party finally succumbed. When they gave into temptation. Indulged in wounding and breaking.  Javier ribbons my chin with silk to hold it in place for a few minutes. My neck needs patching; he’s made quite the mess of it. He spritzes rosewater to keep me malleable, then shuffles to the stove. Bent over hotplates, he sings quietly as he stirs. His plainchant quickens the pots’ ingredients. Sifted flour, hen-milk, vanilla essence. A sprinkling of salty eye-dew to bring his subtleties to life. Over and over, mournfully low, he garnishes the mixture with tears and base notes of my name.  Una, Una, he whispers, adding a pinch of cardamom to freckle my skin. Una, this time you’ll be just right.  For tonight’s outcall, Javier embeds a diadem of Jordan almonds into my curls. “The candied treasure of Priam,” he says, chiseling them into my scalp. Content, he moves on to my hazel eyes. Sets them with a stony stare, like Helen’s transfixed by the sight of her city ablaze. She’s a favorite of Javier’s. Peerless Helen. Unforgettable Helen. With that legendary face. All those ships sailing after it. Lately, while assembling and reassembling me, he’s worn grooves into her story, worn it thin with retelling. The affair. The abduction. The hoopla and heartbreak. His sunken cheeks gain a healthy sheen as he talks of truces made and broken. Gifts offered, shunned, accepted. The permanence, the stubbornness of young lovers. The tale spills from him like powdered ginger, spicy and sharp, as he presses buttercream icing into my moist gaps.  While he pokes and prods, I make predictable observations. Repeating comments he himself once made. Repeating threadbare conversations. Repeating things he’ll smile to hear.  From the shelf, the molds watch us, unblinking.  “Ignore them,” I say, repeating, repeating. “It’s just the two of us now.”  Javier rubs the scowl from my forehead. Heats a spoon and melts saffron into my eyebrows. Sunshine lilts through the studio’s crescent windows as he works. The deep gold of late afternoon adds fire to his story. Promises broken, omens ignored, the grief and wrath of Achilles. Every word igniting, ablaze. But when he reaches the sack of Troy, Javier pauses. Unwilling to narrate the ending, he backtracks. As always, to Helen.  Concentrating, he plunges a series of long plaits into my scalp without letting even a drop of custard ooze out. Carefully, precisely, he stretches them down my spine. I’m half-bowed under the weight of so much hair. He fusses with the braids, fusses.  “Menelaus is furious when his wife returns,” he eventually says. “Can you imagine? Almost as furious as when she first left. How dare she have survived so much without him? How dare he remain such a fool in her presence.”  I shrug. Javier pushes my shoulders back down, checks for wrinkles. Checks the portrait above the assembly table. Nodding, he reaches up to drape an icing chiton over my nakedness. I am taller than him by a hand, but he is clever as a monkey when it comes to climbing. Hopping from footstool to bench and back, he maneuvers around me, the long tube of material bunched in his arms. Though the gauze is thinner than faith, the strength of his recipe keeps it together.  That, and his devilish fingers.  They dart in and out, gathering, smoothing, fluffing my garment until it blouses in wondrous folds. Pins appear, disappear. Puncturing, piercing, holding the fabric in place. Javier’s lips smack as he thinks, as he tucks. He steps back to take me all in. Steps up, tugs a pleat. Steps back, cocks his head. Steps up, fidgets a cord around my waist. Steps back, smacks, annoyed. Up and back, up and back. Step-ball-change, once more from the top. Up and back in the perfectionist’s dance.  At last, he is satisfied. A pendant is the final touch, a mille-feuille heart on a string of rarified gold. “You are a feast,” he says, coiling the cold thing around my throat. “You are a picture.” Overcome, he smacks lips and hands—and his cufflink catches on my neckline. Catches, and tears.  The robes sigh apart, exposing me from gullet to gut. Javier rushes to fix it. He flaps and gouges, making it worse. Up and back, up and back, he flaps, gouges, wrecks and ruins. Up and back, the necklace snaps. The silver bonbons he’d spent hours spiraling around my cinnamon aureoles are scraped loose. Part of my rib cage concaves. Tiny candies plink to the floor.  But there is air in my chest. There is breath. Surely, this is good?  “And he is ever at mercy of the gods,” Javier mutters, smudging my marzipan to keep the custard from seeping out. “We’ll have to cancel, Una. Reschedule for another time. We can’t arrive with you in this state—what will they think?”  “You underestimate—” I almost say yourself, but taste the error before it’s spoken. A confectioner does not reach Javier’s standing without resolve. Without ego. Instead, I reassure him with a familiar wink. “Tonight, I’ll play the mystic. You know the routine. Smoke, mirrors, communing with spirits. It’s only fitting.” I look down at my Hellenistic garb. The ragged flaps of material lift easily and, thankfully, with minimal debris. I fasten them on my left shoulder, covering the worst of the mess. Leaving my heart and one flawless breast bare.  Holding his gaze, I curtsy. “A seer should ever reveal as much as she obscures. N’est-ce pas?”  His laugh is a sad little bark.  “And you are a vision,” he says.  I am ready to go, but Javier is nervous.  I don’t tell him he’s being silly. Don’t remind him I’ve survived three vigorous outings this week, mostly intact. He doesn’t need to hear it. There’s no limit to his talent, no damage he can’t reverse. I’m living proof, I could tell him. I’m here because of him. I’m here. But he’s heard it all before.  Everything will be fine, I could say. Three faultless soirées in the space of a week. Three journeys, survived. As many trips as Helen made, or more, depending on Javier’s mood when telling stories. And only a few pieces lost, despite the Sadeans. Nothing important. I’m still together—we’re still together. Everything is fine.  Even so, Javier is nervous.  “They want to see you, Una. That’s all, so they say. After so long. Only to see you.” He is speaking to me, but his back is turned. Facing the faded oil painting. “They’ve got countless portraits, cameos, ambrotypes. Countless memories. Insufficient, they say. It’s just not the same.” Javier snorts. “So now, finally, they want to see you.”  Vacant glass eyes gaze down from the shelves. The molds sneer at me. Waiting their turn.  “I’ll give it my all,” I say, the phrase stale on my tongue.  “Yes, of course, ma chère,” Javier replies to the wall. “You always have.”  In the mansion’s grand dining hall, dinner is imminent. The sideboard is weighed down with a hoard of gold dishes. Steaming tureens, saucières, bain-maries. The room suffocates with aromas of the meal to come. Fine claret is decanted. Muscat and champagne are chilling for later. Legions of silverware are arranged in ranks beside plates. Crystal stemware gleams. Footmen stand at the ready. Carafes of ice-water dripping condensation onto their white gloves. Poised to begin service, they look out over the room. Vigilant, unblinking.  As always, Madame dominates the table’s head while Monsieur commands the foot. Eight rigid people occupy the seats between. Men sporting versions of the same black-and-white suits. Women in lusterless monochrome. All posturing, variations with the same facial features. To my left, Javier folds and refolds his napkin. A cue, perhaps? I await further signals—but like the hors d’oeuvres and drinks, none are forthcoming. For all his anxiety, my confectioner has neglected to give me instructions. Am I the centerpiece this evening? Am I the dessert? Our hosts have offered no guidance. Made no requests. The moment we entered, they simply invited me to sit. To join them at table, like a guest.  They want to see you, Javier said.  They all do, don’t they? They want the same Una, over and over. I am always her. Over and over.  But tonight I am also sibyl, oracle, prophetess. Tonight I am breathless from seeing so much. Seeing and being seen.  “A striking resemblance,” Maman says at last.  “We had heard,” says Papa, mustache bristling. “But, you understand, we needed to see for ourselves.”  “Of course,” replies Javier. “Of course. Remarkable, n’est-ce pas?”  I shiver under their scrutiny.  “How many of these—” says the youngest Demoiselle, la sœur, jeweled hand fluttering. Grasping for an explanation. “How long has it been—? How did you reconstruct—? I mean, look at her. Just, look. Please tell me this isn’t her death mask . . . ”  They look and look and look away.  “Absolutely not,” whispers Javier. “Does she look dead to you?”  Of course, I repeat silently. Of course. Remarkable, n’est-ce pas?  I reach down. Pull my legs up one at a time. Twist until I’m perched like a swami on the mahogany chair. Mousse leaks from my hips. Cream swills in my guts. I exhale and collect my thoughts. Prepare my premonitions. Summon my ghosts.  “Shall we begin?”  One of the black-ties glares at me. “Una was much more lithe,” he says. “Much more vibrant. Such an exquisite dancer, such a beautiful singer. To have wasted her life on vulgar cabaret . . . ”  “Slinking in alleys . . . ”  “Scuffling for coin in dank, decrepit places . . . ”  “Cafés and folies.” Top-hat shakes, spits. “Damp, even in summer. Small wonder the wheeze got her—”  My joints stiffen as he speaks. Vein-syrup coagulates. Grenadine clogs my nostrils. I exaggerate a cough, swallow fizz. Use spittle and phlegm to demand their attention. “Shall we begin?”  “Heartbreaking,” says another. “Clearly, a wife cannot survive on sugar, liquor, and promises alone . . . ”  “A husband should provide more—”  “Ça suffit,” says Maman. “My daughter made her own choices. What’s done is done.”  “But this,” says Papa, crossing himself. Expression doughy. “She has had no say in this.”  “Open your eyes,” I intone with all the gravitas of Helen on the ramparts. Fire flickers in my gaze. “Open your eyes. Una is here.”  Give them what they desire, my confectioner once told me, and the audience will never forget you.  Cardamom flakes from my cheeks as I grin, enigmatic. Remember me? Peppermint auras smoke from my mouth, sweet and pervasive. What a show we’ve planned! What a performance. There will be no weeping this time. No throttling chest-rattle. No thick, unbreathable air. It won’t be like before.  Remember?  I am weightless, seeing them here, being seen. I am buoyant.  A fairy-floss spirit spins out of my fingertips. She clouds up to the ceiling, floats down the walls. Shrouds the gallery of portraits hung there. “Una,” I say, louder now. At my command, the specter coalesces. Straight nose, high brows, Helen’s fixed stare. She is the mold, the paintings, replicated in floating skeins of cotton candy. “Una is here.”  My eyeballs roll back in their sockets. The undersides are concave. Hollow, but not void. Diamond-shaped dragées trickle out. Dry-tears. My pupils turn skullward, but I am not blind. I am Delphic. Past, present, future. All-knowing. All-seeing.  I look and look and don’t look away.  Chairs screech back from the table. Heels chatter their exit, but not mouths. Mouths are black lines, firm-clenched or drooping. Mouths are hidden behind satin-gloved fingers, closed behind handkerchiefs. Mouths are quivering disgust. There will be no licks, no nibbles from these. No kisses.  Maman’s handmaiden swats the apparition, clearing a path so her mistress can leave. Papa sniffs. Dabs his lowered eyes. Orders servants back to the kitchens. Follows them out. Javier sits rigid as meringue beside me. Will he add this story to his repertoire? Will he tell the next Una what he’s told us already, over and over, so many times?  Give them what they desire, he said.  Specters, spirits, sweet subtleties.  “Wait,” Javier says as his in-laws retreat from the room. Indecorous penguins, making their excuses before the entrée. “Stay! You wanted to see—”  New memories to replace the old.  Pulling, pulling, the ghost unspools from my heart. She spills. She aches.  “Is this not her face?” he says, leaning close enough to kiss. “Is Una not right here? Is she not perfect?”  “This is not her face,” I repeat. Wrong, try again. My thoughts are muddled, drunk on passion and time. “You wanted to see.” Musk falls from my gums. Bohèmes break brittle bones. No, wait. Not quite. That’s not alphabetical—macadamias, marshmallows, mignardises. Better. My fingers snap, one by one. Bohèmes bones break brittle. Sherbet foams from my mouth, grenadine from my nostrils. Custard seeps, melts my delicate robes. My hands find, flail, flounder in Javier’s warm grip. Cream gluts from my sternum, splattering the Wedgwood. Shaking, my head teeters. Throbs. Tilts.  “She is not perfect,” says the ghost.  Forced skyward, Helen’s stony gaze comes to rest on the ceiling rose.  “This is not her face.”  Will Javier tell the next Una this story?  Give them what they desire, he said.  New memories.  Remember?  My chest heaves, drowning in buttercream. The ghost breaks its tether, unmoors, dissolves. “This is not her face,” she says. Not quite. The tone is off. The thick-glugging timbre. “Javier.”  Try again and again.  “Una is not right here.” Lisa L Hannett hails from Ottawa, Canada but now lives in Adelaide, South Australia—city of churches, bizarre murders and pie floaters. Her short stories have been published in Clarkesworld Magazine, Fantasy Magazine, Weird Tales, ChiZine, Shimmer, Steampunk II: Steampunk Reloaded, the Year's Best Australian Fantasy and Horror (2010 & 2011), and Imaginarium 2012: Best Canadian Speculative Writing, among other places. She has won three Aurealis Awards, including Best Collection 2011 for her first book, Bluegrass Symphony (Ticonderoga), which was also nominated for a World Fantasy Award. Midnight and Moonshine, co-authored with Angela Slatter, will be published in 2012. Lisa has a PhD in medieval Icelandic literature, and is a graduate of Clarion South. You can find her on Twitter @LisaLHannett.", "text": "3310 words, short story\nSweet Subtleties\nJavier calls me Una, though I’m not the first. There are leftovers all around his studio. Evidence of other, more perishable versions. Two white chocolate legs on a Grecian plinth in the corner, drained of their caramel filling. A banquet of fondant hands, some of which I’ve worn, amputated on trays next to the stove. Butter-dipped petals crumbled on plates, lips that have failed to hold a pucker. Butterscotch ears, taffy lashes, glacé cherry nipples. Nougat breasts, pre-used, fondled shapeless. Beside them, tools are scattered on wooden tables. Mixing bowls, whisks, chisels, flame-bottles. Needles, toothpicks, sickle probes, pliers. Pastry brushes hardening in dishes of glycerin. In alphabetical rows on the baker’s rack, there are macadamias, marshmallows, mignardises. Shards of rock candies, brown, yellow and green, that Javier uses to tint our irises. Gumdrop kidneys, red-hot livers, gelatin lungs. So many treats crammed into clear jars, ready to be pressed into cavities, tissue-wrapped and stuffed into limbs. Swallowed by throats that aren’t always mine.\n“Delicious,” I say as Javier jams grenadine capsules into my sinuses, a surprise for clients with a taste for fizz. “Delicious.” The word bubbles, vowels thick and popping in all the wrong places. Gently frowning, Javier crushes my larynx with his thumbs. He fiddles with the broken musk-sticks, tweaking and poking, then binds the voice box anew with licorice cords. I try again.\n“Delicious.”\nStill not right. The tone is off. The timbre. It’s phlegmatic, not alluring. Hoary, not whorish. It will put people off their meals, not whet appetites. It doesn’t sound like me.\nJavier’s palm on my half-open mouth is salty. His long fingers gully my cheeks. I wait in silence as he breaks and rebuilds, breaks and rebuilds. Concentrating on my lungs, my throat. Clearing them. Making sure they are dry. I don’t mind being hushed. Not really. Not at the moment. If anything goes wrong, if I collapse this instant, if I crack or dissolve, at least my last words will have been pleasant. Something sweet to remember me by.\nIt won’t be like before, he said. There will be no weeping. No throttling chest-rattle. No thick, unbreathable air.\nOn Monday, I made my latest debut—I make so many. Served after the soup but before the viande at the Salon Indien du Grand Café. My striptease was an enormous success. Fresh and unmarked, clad in edible cellophane, my marzipan dusted with peach velvet. Even the stuffiest top-hat couldn’t resist. Javier had contrived a device to drop sugared cherries onto every tongue that probed between my legs. Dozens of gentlemen laughed and slurped, delighted I was a virgin for each of them.\n“Marvelous,” they shouted, licking slick chops. “Belle Una, tonight you’re more divine than ever!”\n“Marvelous,” I say, calm and mostly clear. Mostly. Close enough.\nSugar-spun wigs line a window ledge above Javier’s workbench. Faceless heads, all of them. Now visible, now obscured, as he bobs over me, intent on his work. The hairdos are exquisite. Some pinned up in elaborate curls, some plaited, some styled after Godiva. Glinting honey strands. Carmine. Deep ganache. Exquisite, all of them, despite showing signs of wear.\nBetween soot-streaked portraits on the walls, wooden shelves support a horde of glass molds. As one, they gape at me from across the room. Their faces as like to each other as I am to them. High brows and cheekbones, pert mouths, strong jaws, noses so straight we’d be ugly if it weren’t for our delicate nostrils. Javier insists we are identical, indistinguishable, impeccable casts of the original. We must be the same, he tells us. We must be. We must.\nOnce people have well and truly fallen in love, he said, they do not want variety. They want the same Una they enjoyed yesterday, last week, last month. They want the same Una, now and always. The same Una that Javier, confectioner gourmand, is forever recreating.\nFor the hauts bohème on Wednesday evening, I played the role of limonadière. Stationed behind the bar counter, I wept pomegranate jewels while spouting absinthe verses. Odes to beauty, freedom, love. Javier encouraged this crowd unreservedly. “They’ve loose clothes, loose hair, loose morals,” he said. “And loose purse-strings.” Under his guidance, the bohèmes tickled my limbs with the bows of gypsy violins. Scratched me with pen nibs. Trailed paintbrushes along my soft places. With each stroke, swirls of hippocras bled to my surface. Ale, brandy, champagne, rum. One by one, the lushes lapped it all up. They prefer drink to desserts, Javier said. Those with maudlin constitutions cannot keep anything substantial down.\n“Una, chère Una,” the bohos cried, slurring into their cups. “Promise never to leave us again.’\nEmotional drunks, I thought. Glutting themselves into confusion. Muddled on passion and wine. Can’t they see I’m here? I am forever here.\n“I feel—” I begin. Javier traps my jaw. Holds it still. Wary of what, I wonder? That it will fall off with talk, no doubt. That I’ll run out of things to say before tonight’s performance.\nI feel solid, I want to assure him. I feel settled. Take it easy now. Easy. I’m going nowhere. I’m right here.\nFriday’s connoisseurs ate with torturous restraint.\n“Pace yourselves,” the women said, cracking knuckles with the sharp edges of their fans.\n“Sugar is a mere distraction for the palate,” said the men. “It will never satiate.”\nAs centerpiece on their ruby tablecloth, I sat with legs pretzeled into Sadean poses. Wearing garters of hardened molasses, nothing more. By the second remove of sorbet, my contorted ankles and wrists had crumbled. I couldn’t stand for all the gold in the world. My paralysis thrilled our hosts no end—as did Javier’s copper blades. Two daggers per guest. Honed to ravage goodies from my thighs, rump, belly. Tantalized, the feasters took turns at fossicking. At knifing currant ants and blackberry spiders from my innards.\n“What an illusion,” they moaned, crunching aniseed antennae. “So convincing, so real . . . And not even a splash of blood! When did you learn such tricks, chère fille? Why have you not beguiled us this way before? No matter, no matter. Bravo, chère Una, et encore!”\nTips are highest when egos are stroked, my confectioner says. When pomposity is rewarded with flirtation. So Javier slapped their bony backs. He stooped and kowtowed. I bowed as best I could. Waggling my fingers and toes. Letting them caress me long after the coins had rolled.\nRigged with peanut-brittle bones, my digits made such a gratifying snap when the party finally succumbed. When they gave into temptation. Indulged in wounding and breaking.\nJavier ribbons my chin with silk to hold it in place for a few minutes. My neck needs patching; he’s made quite the mess of it. He spritzes rosewater to keep me malleable, then shuffles to the stove. Bent over hotplates, he sings quietly as he stirs. His plainchant quickens the pots’ ingredients. Sifted flour, hen-milk, vanilla essence. A sprinkling of salty eye-dew to bring his subtleties to life. Over and over, mournfully low, he garnishes the mixture with tears and base notes of my name.\nUna, Una, he whispers, adding a pinch of cardamom to freckle my skin. Una, this time you’ll be just right.\nFor tonight’s outcall, Javier embeds a diadem of Jordan almonds into my curls. “The candied treasure of Priam,” he says, chiseling them into my scalp. Content, he moves on to my hazel eyes. Sets them with a stony stare, like Helen’s transfixed by the sight of her city ablaze. She’s a favorite of Javier’s. Peerless Helen. Unforgettable Helen. With that legendary face. All those ships sailing after it. Lately, while assembling and reassembling me, he’s worn grooves into her story, worn it thin with retelling. The affair. The abduction. The hoopla and heartbreak. His sunken cheeks gain a healthy sheen as he talks of truces made and broken. Gifts offered, shunned, accepted. The permanence, the stubbornness of young lovers. The tale spills from him like powdered ginger, spicy and sharp, as he presses buttercream icing into my moist gaps.\nWhile he pokes and prods, I make predictable observations. Repeating comments he himself once made. Repeating threadbare conversations. Repeating things he’ll smile to hear.\nFrom the shelf, the molds watch us, unblinking.\n“Ignore them,” I say, repeating, repeating. “It’s just the two of us now.”\nJavier rubs the scowl from my forehead. Heats a spoon and melts saffron into my eyebrows. Sunshine lilts through the studio’s crescent windows as he works. The deep gold of late afternoon adds fire to his story. Promises broken, omens ignored, the grief and wrath of Achilles. Every word igniting, ablaze. But when he reaches the sack of Troy, Javier pauses. Unwilling to narrate the ending, he backtracks. As always, to Helen.\nConcentrating, he plunges a series of long plaits into my scalp without letting even a drop of custard ooze out. Carefully, precisely, he stretches them down my spine. I’m half-bowed under the weight of so much hair. He fusses with the braids, fusses.\n“Menelaus is furious when his wife returns,” he eventually says. “Can you imagine? Almost as furious as when she first left. How dare she have survived so much without him? How dare he remain such a fool in her presence.”\nI shrug. Javier pushes my shoulders back down, checks for wrinkles. Checks the portrait above the assembly table. Nodding, he reaches up to drape an icing chiton over my nakedness. I am taller than him by a hand, but he is clever as a monkey when it comes to climbing. Hopping from footstool to bench and back, he maneuvers around me, the long tube of material bunched in his arms. Though the gauze is thinner than faith, the strength of his recipe keeps it together.\nThat, and his devilish fingers.\nThey dart in and out, gathering, smoothing, fluffing my garment until it blouses in wondrous folds. Pins appear, disappear. Puncturing, piercing, holding the fabric in place. Javier’s lips smack as he thinks, as he tucks. He steps back to take me all in. Steps up, tugs a pleat. Steps back, cocks his head. Steps up, fidgets a cord around my waist. Steps back, smacks, annoyed. Up and back, up and back. Step-ball-change, once more from the top. Up and back in the perfectionist’s dance.\nAt last, he is satisfied. A pendant is the final touch, a mille-feuille heart on a string of rarified gold. “You are a feast,” he says, coiling the cold thing around my throat. “You are a picture.” Overcome, he smacks lips and hands—and his cufflink catches on my neckline. Catches, and tears.\nThe robes sigh apart, exposing me from gullet to gut. Javier rushes to fix it. He flaps and gouges, making it worse. Up and back, up and back, he flaps, gouges, wrecks and ruins. Up and back, the necklace snaps. The silver bonbons he’d spent hours spiraling around my cinnamon aureoles are scraped loose. Part of my rib cage concaves. Tiny candies plink to the floor.\nBut there is air in my chest. There is breath. Surely, this is good?\n“And he is ever at mercy of the gods,” Javier mutters, smudging my marzipan to keep the custard from seeping out. “We’ll have to cancel, Una. Reschedule for another time. We can’t arrive with you in this state—what will they think?”\n“You underestimate—” I almost say yourself, but taste the error before it’s spoken. A confectioner does not reach Javier’s standing without resolve. Without ego. Instead, I reassure him with a familiar wink. “Tonight, I’ll play the mystic. You know the routine. Smoke, mirrors, communing with spirits. It’s only fitting.” I look down at my Hellenistic garb. The ragged flaps of material lift easily and, thankfully, with minimal debris. I fasten them on my left shoulder, covering the worst of the mess. Leaving my heart and one flawless breast bare.\nHolding his gaze, I curtsy. “A seer should ever reveal as much as she obscures. N’est-ce pas?”\nHis laugh is a sad little bark.\n“And you are a vision,” he says.\nI am ready to go, but Javier is nervous.\nI don’t tell him he’s being silly. Don’t remind him I’ve survived three vigorous outings this week, mostly intact. He doesn’t need to hear it. There’s no limit to his talent, no damage he can’t reverse. I’m living proof, I could tell him. I’m here because of him. I’m here. But he’s heard it all before.\nEverything will be fine, I could say. Three faultless soirées in the space of a week. Three journeys, survived. As many trips as Helen made, or more, depending on Javier’s mood when telling stories. And only a few pieces lost, despite the Sadeans. Nothing important. I’m still together—we’re still together. Everything is fine.\nEven so, Javier is nervous.\n“They want to see you, Una. That’s all, so they say. After so long. Only to see you.” He is speaking to me, but his back is turned. Facing the faded oil painting. “They’ve got countless portraits, cameos, ambrotypes. Countless memories. Insufficient, they say. It’s just not the same.” Javier snorts. “So now, finally, they want to see you.”\nVacant glass eyes gaze down from the shelves. The molds sneer at me. Waiting their turn.\n“I’ll give it my all,” I say, the phrase stale on my tongue.\n“Yes, of course, ma chère,” Javier replies to the wall. “You always have.”\nIn the mansion’s grand dining hall, dinner is imminent. The sideboard is weighed down with a hoard of gold dishes. Steaming tureens, saucières, bain-maries. The room suffocates with aromas of the meal to come. Fine claret is decanted. Muscat and champagne are chilling for later. Legions of silverware are arranged in ranks beside plates. Crystal stemware gleams. Footmen stand at the ready. Carafes of ice-water dripping condensation onto their white gloves. Poised to begin service, they look out over the room. Vigilant, unblinking.\nAs always, Madame dominates the table’s head while Monsieur commands the foot. Eight rigid people occupy the seats between. Men sporting versions of the same black-and-white suits. Women in lusterless monochrome. All posturing, variations with the same facial features. To my left, Javier folds and refolds his napkin. A cue, perhaps? I await further signals—but like the hors d’oeuvres and drinks, none are forthcoming. For all his anxiety, my confectioner has neglected to give me instructions. Am I the centerpiece this evening? Am I the dessert? Our hosts have offered no guidance. Made no requests. The moment we entered, they simply invited me to sit. To join them at table, like a guest.\nThey want to see you, Javier said.\nThey all do, don’t they? They want the same Una, over and over. I am always her. Over and over.\nBut tonight I am also sibyl, oracle, prophetess. Tonight I am breathless from seeing so much. Seeing and being seen.\n“A striking resemblance,” Maman says at last.\n“We had heard,” says Papa, mustache bristling. “But, you understand, we needed to see for ourselves.”\n“Of course,” replies Javier. “Of course. Remarkable, n’est-ce pas?”\nI shiver under their scrutiny.\n“How many of these—” says the youngest Demoiselle, la sœur, jeweled hand fluttering. Grasping for an explanation. “How long has it been—? How did you reconstruct—? I mean, look at her. Just, look. Please tell me this isn’t her death mask . . . ”\nThey look and look and look away.\n“Absolutely not,” whispers Javier. “Does she look dead to you?”\nOf course, I repeat silently. Of course. Remarkable, n’est-ce pas?\nI reach down. Pull my legs up one at a time. Twist until I’m perched like a swami on the mahogany chair. Mousse leaks from my hips. Cream swills in my guts. I exhale and collect my thoughts. Prepare my premonitions. Summon my ghosts.\n“Shall we begin?”\nOne of the black-ties glares at me. “Una was much more lithe,” he says. “Much more vibrant. Such an exquisite dancer, such a beautiful singer. To have wasted her life on vulgar cabaret . . . ”\n“Slinking in alleys . . . ”\n“Scuffling for coin in dank, decrepit places . . . ”\n“Cafés and folies.” Top-hat shakes, spits. “Damp, even in summer. Small wonder the wheeze got her—”\nMy joints stiffen as he speaks. Vein-syrup coagulates. Grenadine clogs my nostrils. I exaggerate a cough, swallow fizz. Use spittle and phlegm to demand their attention. “Shall we begin?”\n“Heartbreaking,” says another. “Clearly, a wife cannot survive on sugar, liquor, and promises alone . . . ”\n“A husband should provide more—”\n“Ça suffit,” says Maman. “My daughter made her own choices. What’s done is done.”\n“But this,” says Papa, crossing himself. Expression doughy. “She has had no say in this.”\n“Open your eyes,” I intone with all the gravitas of Helen on the ramparts. Fire flickers in my gaze. “Open your eyes. Una is here.”\nGive them what they desire, my confectioner once told me, and the audience will never forget you.\nCardamom flakes from my cheeks as I grin, enigmatic. Remember me? Peppermint auras smoke from my mouth, sweet and pervasive. What a show we’ve planned! What a performance. There will be no weeping this time. No throttling chest-rattle. No thick, unbreathable air. It won’t be like before.\nRemember?\nI am weightless, seeing them here, being seen. I am buoyant.\nA fairy-floss spirit spins out of my fingertips. She clouds up to the ceiling, floats down the walls. Shrouds the gallery of portraits hung there. “Una,” I say, louder now. At my command, the specter coalesces. Straight nose, high brows, Helen’s fixed stare. She is the mold, the paintings, replicated in floating skeins of cotton candy. “Una is here.”\nMy eyeballs roll back in their sockets. The undersides are concave. Hollow, but not void. Diamond-shaped dragées trickle out. Dry-tears. My pupils turn skullward, but I am not blind. I am Delphic. Past, present, future. All-knowing. All-seeing.\nI look and look and don’t look away.\nChairs screech back from the table. Heels chatter their exit, but not mouths. Mouths are black lines, firm-clenched or drooping. Mouths are hidden behind satin-gloved fingers, closed behind handkerchiefs. Mouths are quivering disgust. There will be no licks, no nibbles from these. No kisses.\nMaman’s handmaiden swats the apparition, clearing a path so her mistress can leave. Papa sniffs. Dabs his lowered eyes. Orders servants back to the kitchens. Follows them out. Javier sits rigid as meringue beside me. Will he add this story to his repertoire? Will he tell the next Una what he’s told us already, over and over, so many times?\nGive them what they desire, he said.\nSpecters, spirits, sweet subtleties.\n“Wait,” Javier says as his in-laws retreat from the room. Indecorous penguins, making their excuses before the entrée. “Stay! You wanted to see—”\nNew memories to replace the old.\nPulling, pulling, the ghost unspools from my heart. She spills. She aches.\n“Is this not her face?” he says, leaning close enough to kiss. “Is Una not right here? Is she not perfect?”\n“This is not her face,” I repeat. Wrong, try again. My thoughts are muddled, drunk on passion and time. “You wanted to see.” Musk falls from my gums. Bohèmes break brittle bones. No, wait. Not quite. That’s not alphabetical—macadamias, marshmallows, mignardises. Better. My fingers snap, one by one. Bohèmes bones break brittle. Sherbet foams from my mouth, grenadine from my nostrils. Custard seeps, melts my delicate robes. My hands find, flail, flounder in Javier’s warm grip. Cream gluts from my sternum, splattering the Wedgwood. Shaking, my head teeters. Throbs. Tilts.\n“She is not perfect,” says the ghost.\nForced skyward, Helen’s stony gaze comes to rest on the ceiling rose.\n“This is not her face.”\nWill Javier tell the next Una this story?\nGive them what they desire, he said.\nNew memories.\nRemember?\nMy chest heaves, drowning in buttercream. The ghost breaks its tether, unmoors, dissolves. “This is not her face,” she says. Not quite. The tone is off. The thick-glugging timbre. “Javier.”\nTry again and again.\n“Una is not right here.”\nLisa L Hannett hails from Ottawa, Canada but now lives in Adelaide, South Australia—city of churches, bizarre murders and pie floaters. Her short stories have been published in Clarkesworld Magazine, Fantasy Magazine, Weird Tales, ChiZine, Shimmer, Steampunk II: Steampunk Reloaded, the Year's Best Australian Fantasy and Horror (2010 & 2011), and Imaginarium 2012: Best Canadian Speculative Writing, among other places. She has won three Aurealis Awards, including Best Collection 2011 for her first book, Bluegrass Symphony (Ticonderoga), which was also nominated for a World Fantasy Award. Midnight and Moonshine, co-authored with Angela Slatter, will be published in 2012. Lisa has a PhD in medieval Icelandic literature, and is a graduate of Clarion South. You can find her on Twitter @LisaLHannett.", "source": "https://clarkesworldmagazine.com/hannett_12_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sweet Subtleties by Lisa L Hannett"}