{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MUskF555ZWvRn3ilwuFihFap/hI=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Wouldn't it be Nice?  I’ve already forgotten where and why, but I was recently reading an article that included a interesting passing comment—one or two wealthy Silicon Valley tech-types could completely change the literary landscape by annually donating a few million to one or two dozen organizations. It’s essentially a return to the old-school patronage model, but with publishers as the primary focus.  Ok, time to dream a little, and since we’re dreaming, we can remove some of potential pitfalls.In this scenario: we’re working with a good accountant and have been guaranteed at least ten years of funding with no editorial interference, so long as we continue to publish science fiction on our current schedule or better. After all, this isn’t meant to be a nightmare!  It probably says something about me that the first two things I’d do involve fair pay and marketing. The fair pay thing is pretty straight-forward and would impact everyone from artists and authors to slush readers and editors. If we’re going to commit to some serious work, we need to make sure that our team is taken care of and has the flexibility to take on what comes next. What I’d consider marketing probably isn’t what you think. It’s not directly about raising awareness for Clarkesworld, it’s about bringing new readers and writers into short fiction—around the world. It involves education and opportunity. It’s a long-term, rising tide solution to a problem faced by people working in short fiction.  For a while, I’ve been contemplating using some of my old skills as an instructional designer to build online courses. I’ve probably put the most thought into an open course for foreign authors who want to learn how to navigate the US publishing ecosystem. Most of that could easily be repurposed as the foundation for several other courses for other communities of authors looking to find their place in the field. On the reader side, a companion project would be centered around creating free course materials for teachers and professors interested in incorporating modern science fiction or science fiction concepts into their curriculum. I guess I haven’t really wandered too far away from my academic roots after all. I still tend to see education as a solution for most problems.  I’d also like to try using foreign language editions—or even well-developed partnerships—as a tool to reach more readers for the stories we already publish and as a place to cultivate and provide opportunities for other language authors in their own markets. This would require bringing in translators and language-specific editors to handle the translations as well as the locally-submitted stories. And, of course, I’d be in close communication with those editors to see which stories should be translated and bring back into Clarkesworld-prime. Bridges should go two-ways.  Overall, it seems like a nice way to expose the authors in both markets to a much larger community and potentially put a dent in some of those artificial genre walls that exist solely because of language. Going solely by the populations of native speakers, Spanish would be an obvious choice. Spanish is also widely spoken in this country, so that could make the logistics behind this kind of integrated trial project a bit easier to handle. (Yes, Chinese is spoken by more people, but we’re already working on something there, so it’s off the table.)  None of these things happen quickly or provide immediate and meaningful results. It takes time, and a ten year window such as the one dreamed of here, would be more than adequate to try a variety of techniques and provide opportunities to adapt to the specific needs of each community. I’m assuming our wealthy sponsor doesn’t just like us, but believes in our vision to grow a global science fiction market and wants to see it happen.  After all, that’s why they chose us.  Sadly, it doesn’t appear that this person exists—if I’m wrong, email me. Reality currently requires that we work much more slowly with far fewer resources. That doesn’t mean we won’t try to take these steps forward when and where we can. It also provides incentive for us to grow our subscriber base, probably by about 17,000. Yeah . . . I know, but it’s something worth flushing out a bit more and working towards! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Wouldn't it be Nice?\nI’ve already forgotten where and why, but I was recently reading an article that included a interesting passing comment—one or two wealthy Silicon Valley tech-types could completely change the literary landscape by annually donating a few million to one or two dozen organizations. It’s essentially a return to the old-school patronage model, but with publishers as the primary focus.\nOk, time to dream a little, and since we’re dreaming, we can remove some of potential pitfalls.In this scenario: we’re working with a good accountant and have been guaranteed at least ten years of funding with no editorial interference, so long as we continue to publish science fiction on our current schedule or better. After all, this isn’t meant to be a nightmare!\nIt probably says something about me that the first two things I’d do involve fair pay and marketing. The fair pay thing is pretty straight-forward and would impact everyone from artists and authors to slush readers and editors. If we’re going to commit to some serious work, we need to make sure that our team is taken care of and has the flexibility to take on what comes next. What I’d consider marketing probably isn’t what you think. It’s not directly about raising awareness for Clarkesworld, it’s about bringing new readers and writers into short fiction—around the world. It involves education and opportunity. It’s a long-term, rising tide solution to a problem faced by people working in short fiction.\nFor a while, I’ve been contemplating using some of my old skills as an instructional designer to build online courses. I’ve probably put the most thought into an open course for foreign authors who want to learn how to navigate the US publishing ecosystem. Most of that could easily be repurposed as the foundation for several other courses for other communities of authors looking to find their place in the field. On the reader side, a companion project would be centered around creating free course materials for teachers and professors interested in incorporating modern science fiction or science fiction concepts into their curriculum. I guess I haven’t really wandered too far away from my academic roots after all. I still tend to see education as a solution for most problems.\nI’d also like to try using foreign language editions—or even well-developed partnerships—as a tool to reach more readers for the stories we already publish and as a place to cultivate and provide opportunities for other language authors in their own markets. This would require bringing in translators and language-specific editors to handle the translations as well as the locally-submitted stories. And, of course, I’d be in close communication with those editors to see which stories should be translated and bring back into Clarkesworld-prime. Bridges should go two-ways.\nOverall, it seems like a nice way to expose the authors in both markets to a much larger community and potentially put a dent in some of those artificial genre walls that exist solely because of language. Going solely by the populations of native speakers, Spanish would be an obvious choice. Spanish is also widely spoken in this country, so that could make the logistics behind this kind of integrated trial project a bit easier to handle. (Yes, Chinese is spoken by more people, but we’re already working on something there, so it’s off the table.)\nNone of these things happen quickly or provide immediate and meaningful results. It takes time, and a ten year window such as the one dreamed of here, would be more than adequate to try a variety of techniques and provide opportunities to adapt to the specific needs of each community. I’m assuming our wealthy sponsor doesn’t just like us, but believes in our vision to grow a global science fiction market and wants to see it happen.\nAfter all, that’s why they chose us.\nSadly, it doesn’t appear that this person exists—if I’m wrong, email me. Reality currently requires that we work much more slowly with far fewer resources. That doesn’t mean we won’t try to take these steps forward when and where we can. It also provides incentive for us to grow our subscriber base, probably by about 17,000. Yeah . . . I know, but it’s something worth flushing out a bit more and working towards!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_11_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Wouldn't it be Nice? by Neil Clarke"}