{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "E Catherine Tobler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p55HwIoxYB6cqzOQ0MA8cn+ub2c=", "id": null, "license": null, "comments": "", "raw_text": "5890 words, short story  The Abduction of Europa  BOLAJI  Everything blurs.  This morning, I thought it was the condensation of my breath upon the helmet’s convex interior, but it’s something else. Deep space shapes our eyes in ways unknown. Under this pressure, Europa is hazy, distant water plumes fogging the horizon, but closer too, and I think there is an undiscovered crevasse. We should be more mindful, but we soldier on, single file, metal cleats biting into the thin ice that covers Europa’s salt ocean. Marius is already lost and though we walk toward Thrace Terminal, it has never seemed so distant. The second icecat seized up three days ago and no human has made this journey on foot.  We should be perfectly fine—our suits were made for this world, heavy enough so that we will not struggle in the lesser gravity, thick enough to shield us from the radiation pouring from the sky. Beyond the haze, Jupiter churns in eternal storm. Before we left Thrace Terminal, we were mindful of the red spot, seeming to reemerge from having been swallowed—but I cannot see it now, Jupiter’s immensity hesitant to rise.  It used to bother me, the idea that we would be dead in a day without all the shielding we live behind. That radiation would squash us like bugs, but you get used to it. Space is hostile, my father used to say, but so too the ocean. We were not built for these spaces, so must change ourselves to enter them. It has always been so; history tells us this.  A low vibration churns in my gut as I stab my cleat into the ice and push myself through another step. Endless miles of ice, the naked sky above us. I peek at that sky and my knees jelly at the sight of Galileo Station coming into view, framed against the vast milk-in-coffee expanse of Jupiter. The station’s helium collection pods catch the distant sunlight and look like strands of spider web. They dance, but not in any wind. They plummet, into the clouds and gone, before returning with their precious cargo. The idea that the station is populated, that somehow people live within its walls, troubles my mind. Against the bulk of Jupiter, the station is no more than a pinprick, and if we living creatures fit within that pinprick—  I am made to feel small. Nausea punches a clammy hand into my throat. I try to swallow it down, because vomiting in a containment suit is no one’s idea of a good time. The smell of my body is overwhelming, the silent admission that I escalated this endeavor, that Marius died, that they would send Kotto alone for us. Alone.  It is the idea of paperwork that calms my mind; paper is a thing of the past, of course—it will be a series of cold keys and colder screens, making my fingertips chill with every swipe, but the idea of the work to come comforts, even if the idea of Kotto behind me does not. If you had to have anyone come after you, on a distant ice-clad moon where your partner had been—swallowed, my mind whispers.  Tragically taken, I amend.  Kotto would not be anyone’s first choice. Kotto knows walls and vehicles; she doesn’t know sky and ice. She doesn’t know the stories of these distant places the way I do.  KOTTO  They say that after a while, you don’t notice the cold.  The station is cold and Europa, being four hundred and eighty-five million fucking miles from the sun, is naturally and one-hundred percent organically, cold. You think you won’t miss it—that far away, you’ll be locked up tight inside Thrace Terminal and too busy working. You’ll be diving into a goddamn alien ocean—what’s to miss? All that warmth is what.  You don’t dream about sex—you dream about sunlight, about the way it looked falling through leaves, about the way it felt on your skin. They say you can’t remember—you were too young, born on Schiaparelli Station, shot toward Galileo as a teen, your family devoted to the deep; you’ve only ever seen holos of trees you foolish, foolish girl, but you remember what that light looked like. Like fucking heaven.  I talk about light a lot in my mental assessments. I’m told that station-borns tend to have some trouble with natural light, or lack thereof. Something in our mind remembers it wasn’t supposed to be all darkness and cold; something inside still hungers for what we’ve never known. And Europa, despite being one of the brightest objects in the goddamn sky, isn’t ever quite bright enough from the surface.  She’s all silver and ice—the Snow Queen, Marius called her—but you know that means she’s cold. Bolaji talks about the life that runs beneath her frozen surface, crackling in copper coils, and I thought at first he meant the ocean—but he means the lineae, which look like bloodied shadows to me.  They meant to remove me from service once, given that my eyes cannot see the full color spectrum, but in the end decided that would be a waste, given my family’s devotion to the deeps. Once you’re out here, what else is there to do—it’s not like we’re building entertainment complexes or schools. We aren’t making cities—though aren’t we, every station is a city in miniature—and there aren’t exactly other jobs that need filling. This deep in, everyone’s a garbage collector, a plumber, a chef.  I’d trained and advanced at the top of every class as if born to water, so it wasn’t like they could kick me without consequence. There are a good many of us, but still not enough. Deep space science remains a sparse thing. Most people stayed where they were born, in the warm, sunshiny splendor of Earth. Fucking Earth. It’s no more than a pinprick in the sky and I still crave it. Wonder what the oceans taste like. Wonder if I’ll ever get there.  “Hold.”  My voice crackles out of my suit and ahead of me, Bolaji pauses in our trek. I draw alongside him, watching the plumes of vapor that haze the sky. Somewhere else, our helmets might dot with moisture, but here, the plumes fall as snow and ice—it’s too damn cold on the surface to stay liquid for long. But Bolaji’s helmet is fogged and I lift a gloved hand, trying to wipe it away. It’s on the inside—he’s breathing too hard and I wonder if he’s got what Marius had, what we’re trying to deny he had. Shrieking about the lost station—he’d found it, he’d found it, but there was no lost station, we’d know. Wouldn’t we?  People out there, it was said, they get sick and go mad because of the cold, because of the dark. You can’t tell a person’s gone mad, not until they melt down. But Bolaji’s eyes are steady on me.  “Gotta get Marius out of your head,” I say. “What happened happened, Bolaji—you were good to go after him, but goddamn. Some people aren’t made for this kind of place, even if they were born out here.”  But there’s something else in Bolaji’s eyes even as he nods at me and agrees. There’s something else and I don’t press. What did he see that I couldn’t see? There’s no because. I just don’t. I’m fucking tired and we’ll be sleeping another night on the ice and I’m tired. So tired of the cold they said I would stop noticing. They never said when—but they said I would.  MARIUS  On the edge of the salt ocean, a growing limb of night’s dark spreads and Marius can’t make sense of it quickly enough. The ocean has no edge, no shore because the ice cap covers Europa entire. In turn, the ocean covers every bit of rocky ground. But here, there is a shore, an outcropping where Marius stands barefoot. The limb of darkness spreads like water through sand toward him.  “Bolaji, can you see this?”  There is no reply.  Marius kneels upon the shore where it feels like mica, thin and flaking. He dips his hands into the darkness and recoils at the sudden warmth. He has not known such a sensation outside being tangled with another body. (He thinks of William, pushes the memory away—that was another life, another planet.) The darkness creeps up his arms, to the elbow, to the shoulder. At that point, it feels as if a great maw has taken him in and the memory of cold is erased. This world was never cold, its ocean never solid.  Marius watches the shore retreat at an alarming speed; the sparkling mica glints and is then gone as the salt ocean swells over his head. He thrashes, turning to look at what has a hold of him, but there is no face. Only clouded arms of ink, the limb of night having dissolved itself in the salt water.  He learned to swim as a child on Schiaparelli Station and took top placements. It would be different in an ocean, they said; a calm and controlled pool was not an ocean where one would encounter tides, currents, undertow. Pools did not contain living creatures. Any creature on Europa, should its ocean prove salty, would be called a halophile—salt lover—but Marius always remembered “halo” for angels.  The angel before Marius has a halo, and the deeper he is pulled, the more it glows in golden splendor. Oxygen deprivation can cause a mind to hallucinate, but Marius remains certain of what he sees before him. Certain, too, of the way his lungs have quieted, of the way he doesn’t feel cold, because every synapse is shutting down.  BOLAJI  When Zeus abducted Europa, he came to her in the form of a striking white bull and she, in praise of his beauty, draped him with hand-woven garlands of flowers. Endless scent and color streamed from his grand horns and he reveled in the feel of her upon his back.  Europa, they would have you believe, so reveled in the feel of him beneath her, strong and sure and warmer than anything she had ever known, that she did not notice he was carrying her away from the shore, not until they were in the sea’s wet, not until he had pulled her under and changed into a man more beautiful than any before him—for of course, he was no man at all.  They say Europa did not scream (Marius screamed—my people say a traveler to distant lands should make no enemies and this was not our intent—never our intent), but by then, she was under water. How could anyone have known? The foam that rushed to shore could have easily been from her thrashing in the water, trying to escape Zeus’s maniacal hold—but it was only the gentle swelling tide, they say, carrying flower petals to shore in the wake of a beautiful wedding.  Europa’s tides are well-concealed beneath a cap of ice, plumes of water escaping when they can. But once free, they freeze and become part of the ice forevermore. Europa stretches infinite before us. Ahead, I can see the curved ridges we will likely take shelter in if we mean to rest and hydrate. The Delphi Flexus is not endless, but looks such from where we walk; we have to cross its boundary, and then the penitentes—the spikes of ice that prove this world is melting and refreezing in turn—before Thrace Terminal becomes a possibility.  I am torn between which is a more severe loss: Marius or the two icecats. Kotto would say the icecats, given our present circumstances. I am worried I would agree.  Within the flexus, we find a curve of ice in which to shelter. There will be no fire, but our suits are equipped with a series of chemical warming layers that should see us through. Likewise, there is a liquid feeding system, and though it is not my mother’s moin moin, it will do. My mother told me the death that kills a man begins as an appetite, and perhaps this is what she meant, so when Kotto bids me eat, I activate the suit’s feeding tube, tonguing once for water, twice for pureed food. There are two more meals to be had, which means at least two nights without. Possibly more. We will arrive at Thrace Terminal hungry.  “Bolaji, what—”  Kotto grabs my arm and extends it away from my body. The soft suit is the only thing that separates us from certain death via cold or radiation, and by the soft light radiating from her helmet, I can see what she sees. The sleeve of my suit has torn, from elbow to wrist, the fabric gaping open as if the sleeve has been unbuttoned. Every layer is ripped, ruined, and something pale rests within.  It is so pale, I do not even recognize my own arm for my skin is not this color, but brown. I stare, for I have never seen such a thing—has it been burned by cold? If my suit has been compromised, why have I not perished?  Kotto moves swiftly, cracking her case open to retrieve the emergency patch kit. I want to tell her to stop, but I sit silently, creamed spinach puree growing sour on my tongue. I should be dead. Why am I not dead? Kotto works fast—her hands are sure as she seals the entire length of the sleeve back together. In the cold, frost begins to crackle over the binding.  “Kotto.”  “Sssh.”  She does not have to tell me twice.  KOTTO  They say that in deep space, the extraordinary will become ordinary and eventually you stop noticing it. When the extraordinary is one’s everyday job, it’s nothing to fuss over. We live in space, we are settling the entire system, these acts are no longer magic. These people—they need to stop talking, because they’re so fucking wrong.  Bolaji’s arm should not be that color—it’s like ice, Europan ice. But it’s also not. If the lineae within Europa’s ice look like shadows to me, charcoal lines hastily sketched, this ice is different, for his veins make a lineae of their own, these deep blue. Or, what I presume to be blue. I should not be able to see this color—but here it is. I have never seen it, and yet I know it. An ancestral memory, my therapist would say. I want to ask Bolaji what color the lines are, but the suit needs to be sealed, and once it’s sealed we say nothing.  “Kotto.”  “Sssh.” I lift my hand, as if I could place it over his mouth to silence him. But he stays silent. Trembling. His eyes are wide and I tell myself they are not getting pale, they are as brown as they ever were, calling to mind the blackwood jungles my grandmother left me paintings of. So deep one could get lost, until the sunlight pierced the trunks and—oh Bolaji. What the hell? This was a simple rescue, nothing more.  Beyond the goddamn color of his arm, Bolaji should be dead. I am certain this fact presses on him as much as on me. His suit was opened to space, to the Europan air which stands at nearly three hundred degrees below zero. Nothing can survive that. Not even the icecats proved able and they were built for it.  Beneath my feet, the ice rumbles. Our training is so ingrained, I don’t even have to say “move!” before we’re in motion. We know.  As stable as the surface should be, deep space remains largely unknown and hostile. Perhaps we were not meant to come this far—we are too fragile, too alive to know the depth of this cold. Europa is only doing what Europa does best. Under the strain of Jupiter above her, carting her deeper into the stars, she cracks and groans and spews water from her belly. Most of this water falls to coat the ground in fresh ice; some escapes into space.  Bolaji and I climb up the flexus and slide down its backside, avoiding the spew of ice water. Despite the danger, I am grinning as we glide down the ice, over bumps and ridges as the crews on Mars often traverse the sand dunes. At the bottom of the ridge, our ice cleats stab us steady, though the ground rumbles still. High in the hazy sky, more water plumes.  “Kotto—”  “Bolaji, move,” I say, because I want some distance between us and that plume. If we’re resting at all (he should be dead, Bolaji should be dead), it’s not going to be on top of Europa’s vomiting mouth.  MARIUS  Others have been on Europa for eons, so long that when they try to convey it in numbers and words, Marius is overwhelmed. Others believe he has a mind for science, but Marius can’t digest what they transmit. Images flood his tear-blurred vision—another star system, far from where he now floats. An explosion, a nebula, debris hurtling through space. These simple things, Marius slowly understands.  Marius cannot understand his own star system in its infancy, but when he realizes that nine worlds are spinning into creation around a violently bright sun (he still counts Pluto), he can taste tears on my lips. He views the planets as children, small but growing larger, hauling in rock and gas, coalescing atmospheres tolerable and toxic, flinging comets here and moons there. He watches young Mars flood and old Mars perish; Valles Marineris cracks wide and he fears the entire planet will split in two, but she holds, dusty and dead.  No one has witnessed this, Marius thinks, though is quickly reminded by the strong body beneath his own that Others were here first. Others witnessed. This was theirs until slumber and gravity drew them into the depths where they slept, Marius and his kind cracked Europa’s ice like an egg, pierced her salty ocean, drilled into her rocky mantle. (Crude, but he thinks of William again—cracking, piercing, drilling.)  Marius tries to speak, but is under water, and cannot understand how he is breathing, let alone how he might speak. He thinks he should not have left the station, but he had to, otherwise there would be no this. He was called to leave the station, knowing where to find them, knowing they had something to show him—the lost station, the end of all he had sought. Bolaji should never have followed—Marius is certain where the fault lies.  He stretches into the cold dark and when he can no longer see any brightness above, loses his sense of direction. Everything is featureless black, as if nothing has ever been created. In this black, there has never been a sun, nor any speck of light, until something startling and green darts through the salted water. Glowing Others murmurate across his vision, one sliding through Marius’s palm small as a flower.  The beings draw so near that they swarm around Marius, against his skin—skin, not suit, and he wonders when it was lost, and why he is not dead (is he dead?). When they swarm with more fury, his throat grows raw from screaming. He is not yet dead, he is not yet—  BOLAJI  Europa, once carried to Crete where she was to be queen, was welcomed by Asterion—he of the labyrinth, the creature that was half man, half monster. Did Asterion challenge Zeus for Europa’s fair hand? There are no such stories of what became of her there—but for the one that my mind creates: that Europa, enraged after being taken from her home and life, turned on them both; that Athena looked down in her wisdom and recognizing a warrior soul, transformed what remained of the garland of flowers into a sword. Europa killed Zeus and imprisoned Asterion within the labyrinth, before tracing the path of spilled flowers back home.  I am certain this did not happen, but it seems so, as Kotto jostles me into consciousness once more. She stands as fiery, sword-brandishing Europa above me, intent on slaughtering whatever obstacle lands in our path. I have never seen Kotto as such before and it steals my breath. Kotto keeps always to herself, intent on her work, on finding the smallest organisms that call Europa’s oceans home. She cared nothing for humanity—only what life might exist elsewhere. When she found the first, this was the only time I heard her laugh; she said they were yellow-orange, but they glowed green for me.  My tongue is numb in my mouth; I cannot answer her when she speaks, nor can I fully understand what she has said. She glows, as if she has become one of the salt-loving organisms of the deep. I nod and she seems pleased, vanishing from my sight. We move, but I am not walking. Kotto drags me on the emergency sledge. As if I have broken a leg. As if I am incapable.  A look down at my legs tells me I am incapable. My suit has split wide again, exposing my legs to the air. At some point, it is clear that Kotto tried to seal the rends, but they split the binding again and again. I cannot fathom why; I do not feel larger, and my body is not shaped differently. But the skin that gleams up from the torn suit is wholly white, as clear as ice, with thousands of blue lineae running beneath.  This should startle me, but between the evidence and the emotion, there is a great gulf of nothing. One cannot reach the other. I study the legs as if they were Europan ice, following each lineae until I can no longer trace its path. They wind across the legs and disappear under, and I imagine I see patterns within them: sharp-edged stars and the lump that is Zuma Rock. I have only ever seen this rock in images handed down from lifetimes before my own: a gray and hulking lump rising quite suddenly from the trees as if it were dropped from space. My many-times-great grandfather was said to have climbed it; my many-times-great grandmother said that was absurd. And yet, here I am on Europa. I picture my many-times-great grandfather upon this rock and I am calmed.  Come morning—is it morning?—the idea of the rock still rests within me. I feel it as if upon my tongue, salty and weighting it down so I cannot speak when Kotto looks at me. But I see it upon her face. Something else has happened, something she has no explanation for, and the following morning (the ice so very bright beneath Jupiter’s glowing orb), she will have no explanation for what comes next.  I want to speak to her; I want to write her a letter. My fingers crave the feel of keys, of a cold glass screen, so that I might tell her how Europa surely followed that trail of broken flowers home. So that I might tell her how Zuma Rock rises black from the greenery, and how my many-times-great grandfather stood upon it, barefoot, naked, the way I will stand upon the ice before the consumed shell of my body falls away.  KOTTO  One man should not weigh so much in this gravity.  The sledge is ingenious, locking Bolaji firmly into place, so he is not jostled no matter the terrain we cover. The runners have blades, but like an ice skate possess something of a toe pick, which I can latch into the ice to keep the entire thing from moving. I do this now, kneeling on the ice as I try to catch my breath. We’ll share our last meal in a few hours; tomorrow will be hungry, and Thrace Terminal is at least another day beyond. Water isn’t a problem, at least; Europa’s ocean water freezes clean, desalinated, and our suits are equipped with a sealed system that will allow me to store and melt ice for drinking.  Marius should never have come out—it’s easy to convince myself of this. When Marius left the station, shrieking about finding a lost station (the lost station—madness—we had not been here before, had we), Bolaji, in his good nature, followed. No one went onto the ice alone—ever, ever, ever. Going alone was certain death. Not that Marius cared or waited—his discovery, he cried, would not wait. Of course he took an icecat. Of course Bolaji took another to follow. And now—we were nearly fucked, but the universe had surely seen worse, even if we had not.  I went alone, didn’t I? Charged out after Bolaji without a second, without a third. Just went, and I shouldn’t have. Was it worth two lives, Kotto? This goddamn lost station? What the hell does deep space do to a mind? What did Marius see that I did not?  “Bolaji.”  He’s so still, the ice color having creeped up his cheeks. He tries to move his mouth, but cannot open it. His water tube remains tucked in the corner; he’s unable to even tongue that away, which is probably best. A slow trickle is better than nothing. If I can get him back to Thrace Terminal, if we can get him in sickbay—I don’t know. Medicine isn’t my thing—first aid sure, but not this. And this isn’t like anything I’ve ever seen.  “Can you try to sit up?”  Bolaji nods at me, but doesn’t move. He should be able to sit up, only his legs secured to the sledge; his hands curl around the handles, but he could move them if he wanted. If he was able. I bite the inside of my cheek and taste salt. Maybe whatever’s happened to him won’t let him. Was this part of what happened to Marius?  The known part was Bolaji radioing back, shrieking that Marius had found it—had found it and we were going to be famous and known and it was better than standing on Zuma Rock naked. Maybe this thing had a hold of him then, too. Was this what extreme cold did to a person? No; cold like this killed a person flat out. Why the hell wasn’t Bolaji dead? Why weren’t we all?  “Not sitting up is also fine.”  Bolaji watches me like I’m something he’s never seen instead of someone he’s worked with for seven years. He did a brief stint on Galileo Station, but his heart was never there. When I accused him of wanting a moon of his own, brand new ground he could sink his feet into, he joked that I always wanted an ocean no one had peed in. He wasn’t entirely wrong.  “Come on. If you stop slowing me down, we can make the spikes, and that means . . . Thrace is still damn far away . . . ”  The sledge seems lighter when I pull it back into motion. When I dreamed of alien oceans, I dreamed of beasts big enough to pull crafts through them. Not our crafts—their own. These beasts were never not industrious, crafting marvelous cities at the edge of every ocean they possessed—and probably peed in.  But the beasts here are smaller and according to Bolaji, brighter, glowing green. What had Marius found that could compete with that? We’d found life—goddamn alien life—and he was throwing himself out onto the ice for what. For this?  I glance back at Bolaji, whose arms are raised, hands reaching for something I cannot see. Something he probably can’t see, either. But what I see turns my stomach; the gloves of his suit are ripped. But more than that maybe, because the fabric looks eaten away. Something in the air, a contaminant we couldn’t detect, something in the ice? The exposure to long, continued cold?  The penitentes rise like stalagmites from the ice field ahead. The thin blades of ice, some running dark with trapped minerals, are all turned the same direction, as if something has caught their attention. That something is the far-distant sun. I wonder what it would be like, to stretch under its warmth, to watch it melt this entire ball of ice into a whole, free-flowing ocean. Some worlds, I remind myself, are like that.  I position the sledge within the shelter of two penitentes, and laugh at myself for doing so. It’s not as if there’s someone out here to find us. It’s not as if anyone else is looking. Tomorrow, I’ll be in radio range of Thrace; tomorrow, they’ll know. I draw on my feeding tube, food first, water second, and watch the sky until sleep claims me. I don’t mean to sleep long—Bolaji can’t be left alone—but four hours have passed by the time I look upon the Jupiter-bright sky again.  “If you pick up the pace,” I tell Bolaji, “we can cover some good ground here—how’s your water, anyhow?”  I pick my way to the side of the sledge, reaching for the controls on the arm of Bolaji’s suit. His water level is too high—he hasn’t consumed any in the time we’ve been traveling, and when I look at his helmet, I see why. Bolaji is gone. His suit flutters empty, but for a puddle of what looks like water.  MARIUS  At this point, Europa’s ocean is one hundred and eleven kilometers straight down, and Marius can see forever. The water swarms with life, hydrothermal vents spewing warmth into the ocean cold. Vast columns of bubbles stream upward, into the dark. Salt bursts across his tongue, but something beyond that, something metallic and true.  Here, life abounds. Small, insistent. Larger, established. A crèche of crabs cling to the hot chimneys, hearts fluttering beneath their transparent exoskeletons. Eels, worms, and Others, so many Others. They have been here a long time, have made nests and smoothed hollows in the Europan rock where the world is forever warm.  Others carry Marius over the crater and the crab-crusted remains of anchor points rising from the rocky ground. Marius recognizes the broken frame, the shattered drill. A lost station, the lost station—but this lost station is Thrace Terminal, and the markings on the steel legs confirm it. He does not remember Thrace Terminal being lost, but can see it the way he has seen the past—an explosion, a water-pale nebula, debris hurtling through the black salted sea. These simple things Marius understands.  Marius and Others glide toward still-standing Thrace Terminal; the water tastes of metal, thermal vents scattering bubbles in their wake, broken petals that will perish before they reach the ice cap.  BOLAJI  Europa followed flowers; I follow water.  All thoughts of the suit, of Kotto, of Marius, have gone; these came Before. They are not Now. Now and here, there is only the water, the salt having transformed my body into something Other. I spread through the water, following the currents created by the deep thermal vents—even up here, beneath the ice, my body knows the way the water flows; can sense the warmth and cool entwined.  If there is purpose, it is only in growth. Why do we change? How do we endure? Why do we stretch for depths we have no hope of reaching? What happens when we do reach them? I think briefly of a man upon a rock, sweat-stained and aching. I think of how he must have looked at the land below him, at the froth of impossibly green trees, and this is how I survey the waters beneath me now. They are small, but filled with life.  I travel as the water, pushing up through the ice clefts as I will, flinging myself into the sky which spreads clear and bright, before raining back to the ocean below. Pieces of me freeze on Europa’s porcelain face, but I am more than these; I spread infinite, seven times as big as Earth’s oceans, butting against the ice cap. Tonguing it into deeper water.  KOTTO  Thrace Terminal stands black and skeletal against the ice. The distant sunlight gleams off the towers, off the ice that wraps her steel legs. She’s still far off, but I breathe easier at seeing her familiar shape. If the extraordinary is supposed to become commonplace, then maybe the commonplace also becomes extraordinary, especially when we are forced from its confines. You don’t dream about sex; you dream about familiar walls, your possessions no matter how meager, everyone you know.  I flick my comms to life, already itching to get inside the station and take my helmet off. I want to breathe the stale, recycled air. I want to walk barefoot down the chilly corridors in morning. I want to attend my next goddamn mental assessment and show them I did it. I made it.  “Kotto to Thrace Terminal.”  But the sledge, folded back into the emergency pack at my back, weighs heavy. I made it back, but alone. I did it, but couldn’t bring Bolaji with me. Couldn’t pull Marius back from whatever cliff he’d jumped off. Do you believe Bolaji had anything to do with Marius’s condition? With his disappearance? They will ask, won’t they? What will I answer? Bolaji did not make it, and Marius did not make it—what can I say? The cold has frozen me to the core—envy encases my heart and I cannot feel what perhaps I should for them, for the loss of them.  “Thrace Terminal—Kotto, fucking Christ.”  “Not quite that.” But I try to smile at the sound of Rey’s voice—something familiar, something warm. “Have you in sight—probably tomorrow, unless you send an icecat.” I relay my coordinates and hear Rey dispatching a crew for me.  My steps quicken at the thought; my walk hastens to a run, but when my helmet clouds with breath, I slow. No sense in overdoing it, not if they’re sending people for me.  What did Marius and Bolaji find? What did they know? Why didn’t you find it? Maybe you couldn’t fucking see it, Kotto—the changes in the ice, the changes in the water. Or did you find it and were simply unable to see the way Bolaji and Marius could?  When the ground rumbles, I wonder at the speed at which they’ve come. I strain to hear the icecats clawing their way cross the miles-thick ice, but they’re still too far distant. The vibration through the ice is pervasive, and I track it, as if dancing.  If they say that eventually you don’t notice the cold, must it also come to pass that after a while, you grow so accustomed to the world you inhabit, you forget it’s hostile? You forget that a rumble isn’t always a transplanted icecat; sometimes, it’s the native ice-buried ocean you’ve come to study. Sometimes, it’s a plume of water and vapor erupting from a fissure in the ice. A plume of water that seems to enfold you like an arm, like a garland of flowers, drawing you toward the arctic waters.  I tumble and when I at last come to rest against a gently curved flexus, I’m breathing hard. The world beyond my helmet is hazy, but I can see the tear in my sleeve. Elbow to wrist, my arm gone to Europan ice. Deep blue lineae trace a new map to new lands upon me. Europa swims gray and I think it’s the condensation of breath on my helmet—but it’s something else.  I have forgotten the cold.  Everything blurs.", "text": "5890 words, short story\nThe Abduction of Europa\nBOLAJI\nEverything blurs.\nThis morning, I thought it was the condensation of my breath upon the helmet’s convex interior, but it’s something else. Deep space shapes our eyes in ways unknown. Under this pressure, Europa is hazy, distant water plumes fogging the horizon, but closer too, and I think there is an undiscovered crevasse. We should be more mindful, but we soldier on, single file, metal cleats biting into the thin ice that covers Europa’s salt ocean. Marius is already lost and though we walk toward Thrace Terminal, it has never seemed so distant. The second icecat seized up three days ago and no human has made this journey on foot.\nWe should be perfectly fine—our suits were made for this world, heavy enough so that we will not struggle in the lesser gravity, thick enough to shield us from the radiation pouring from the sky. Beyond the haze, Jupiter churns in eternal storm. Before we left Thrace Terminal, we were mindful of the red spot, seeming to reemerge from having been swallowed—but I cannot see it now, Jupiter’s immensity hesitant to rise.\nIt used to bother me, the idea that we would be dead in a day without all the shielding we live behind. That radiation would squash us like bugs, but you get used to it. Space is hostile, my father used to say, but so too the ocean. We were not built for these spaces, so must change ourselves to enter them. It has always been so; history tells us this.\nA low vibration churns in my gut as I stab my cleat into the ice and push myself through another step. Endless miles of ice, the naked sky above us. I peek at that sky and my knees jelly at the sight of Galileo Station coming into view, framed against the vast milk-in-coffee expanse of Jupiter. The station’s helium collection pods catch the distant sunlight and look like strands of spider web. They dance, but not in any wind. They plummet, into the clouds and gone, before returning with their precious cargo. The idea that the station is populated, that somehow people live within its walls, troubles my mind. Against the bulk of Jupiter, the station is no more than a pinprick, and if we living creatures fit within that pinprick—\nI am made to feel small. Nausea punches a clammy hand into my throat. I try to swallow it down, because vomiting in a containment suit is no one’s idea of a good time. The smell of my body is overwhelming, the silent admission that I escalated this endeavor, that Marius died, that they would send Kotto alone for us. Alone.\nIt is the idea of paperwork that calms my mind; paper is a thing of the past, of course—it will be a series of cold keys and colder screens, making my fingertips chill with every swipe, but the idea of the work to come comforts, even if the idea of Kotto behind me does not. If you had to have anyone come after you, on a distant ice-clad moon where your partner had been—swallowed, my mind whispers.\nTragically taken, I amend.\nKotto would not be anyone’s first choice. Kotto knows walls and vehicles; she doesn’t know sky and ice. She doesn’t know the stories of these distant places the way I do.\nKOTTO\nThey say that after a while, you don’t notice the cold.\nThe station is cold and Europa, being four hundred and eighty-five million fucking miles from the sun, is naturally and one-hundred percent organically, cold. You think you won’t miss it—that far away, you’ll be locked up tight inside Thrace Terminal and too busy working. You’ll be diving into a goddamn alien ocean—what’s to miss? All that warmth is what.\nYou don’t dream about sex—you dream about sunlight, about the way it looked falling through leaves, about the way it felt on your skin. They say you can’t remember—you were too young, born on Schiaparelli Station, shot toward Galileo as a teen, your family devoted to the deep; you’ve only ever seen holos of trees you foolish, foolish girl, but you remember what that light looked like. Like fucking heaven.\nI talk about light a lot in my mental assessments. I’m told that station-borns tend to have some trouble with natural light, or lack thereof. Something in our mind remembers it wasn’t supposed to be all darkness and cold; something inside still hungers for what we’ve never known. And Europa, despite being one of the brightest objects in the goddamn sky, isn’t ever quite bright enough from the surface.\nShe’s all silver and ice—the Snow Queen, Marius called her—but you know that means she’s cold. Bolaji talks about the life that runs beneath her frozen surface, crackling in copper coils, and I thought at first he meant the ocean—but he means the lineae, which look like bloodied shadows to me.\nThey meant to remove me from service once, given that my eyes cannot see the full color spectrum, but in the end decided that would be a waste, given my family’s devotion to the deeps. Once you’re out here, what else is there to do—it’s not like we’re building entertainment complexes or schools. We aren’t making cities—though aren’t we, every station is a city in miniature—and there aren’t exactly other jobs that need filling. This deep in, everyone’s a garbage collector, a plumber, a chef.\nI’d trained and advanced at the top of every class as if born to water, so it wasn’t like they could kick me without consequence. There are a good many of us, but still not enough. Deep space science remains a sparse thing. Most people stayed where they were born, in the warm, sunshiny splendor of Earth. Fucking Earth. It’s no more than a pinprick in the sky and I still crave it. Wonder what the oceans taste like. Wonder if I’ll ever get there.\n“Hold.”\nMy voice crackles out of my suit and ahead of me, Bolaji pauses in our trek. I draw alongside him, watching the plumes of vapor that haze the sky. Somewhere else, our helmets might dot with moisture, but here, the plumes fall as snow and ice—it’s too damn cold on the surface to stay liquid for long. But Bolaji’s helmet is fogged and I lift a gloved hand, trying to wipe it away. It’s on the inside—he’s breathing too hard and I wonder if he’s got what Marius had, what we’re trying to deny he had. Shrieking about the lost station—he’d found it, he’d found it, but there was no lost station, we’d know. Wouldn’t we?\nPeople out there, it was said, they get sick and go mad because of the cold, because of the dark. You can’t tell a person’s gone mad, not until they melt down. But Bolaji’s eyes are steady on me.\n“Gotta get Marius out of your head,” I say. “What happened happened, Bolaji—you were good to go after him, but goddamn. Some people aren’t made for this kind of place, even if they were born out here.”\nBut there’s something else in Bolaji’s eyes even as he nods at me and agrees. There’s something else and I don’t press. What did he see that I couldn’t see? There’s no because. I just don’t. I’m fucking tired and we’ll be sleeping another night on the ice and I’m tired. So tired of the cold they said I would stop noticing. They never said when—but they said I would.\nMARIUS\nOn the edge of the salt ocean, a growing limb of night’s dark spreads and Marius can’t make sense of it quickly enough. The ocean has no edge, no shore because the ice cap covers Europa entire. In turn, the ocean covers every bit of rocky ground. But here, there is a shore, an outcropping where Marius stands barefoot. The limb of darkness spreads like water through sand toward him.\n“Bolaji, can you see this?”\nThere is no reply.\nMarius kneels upon the shore where it feels like mica, thin and flaking. He dips his hands into the darkness and recoils at the sudden warmth. He has not known such a sensation outside being tangled with another body. (He thinks of William, pushes the memory away—that was another life, another planet.) The darkness creeps up his arms, to the elbow, to the shoulder. At that point, it feels as if a great maw has taken him in and the memory of cold is erased. This world was never cold, its ocean never solid.\nMarius watches the shore retreat at an alarming speed; the sparkling mica glints and is then gone as the salt ocean swells over his head. He thrashes, turning to look at what has a hold of him, but there is no face. Only clouded arms of ink, the limb of night having dissolved itself in the salt water.\nHe learned to swim as a child on Schiaparelli Station and took top placements. It would be different in an ocean, they said; a calm and controlled pool was not an ocean where one would encounter tides, currents, undertow. Pools did not contain living creatures. Any creature on Europa, should its ocean prove salty, would be called a halophile—salt lover—but Marius always remembered “halo” for angels.\nThe angel before Marius has a halo, and the deeper he is pulled, the more it glows in golden splendor. Oxygen deprivation can cause a mind to hallucinate, but Marius remains certain of what he sees before him. Certain, too, of the way his lungs have quieted, of the way he doesn’t feel cold, because every synapse is shutting down.\nBOLAJI\nWhen Zeus abducted Europa, he came to her in the form of a striking white bull and she, in praise of his beauty, draped him with hand-woven garlands of flowers. Endless scent and color streamed from his grand horns and he reveled in the feel of her upon his back.\nEuropa, they would have you believe, so reveled in the feel of him beneath her, strong and sure and warmer than anything she had ever known, that she did not notice he was carrying her away from the shore, not until they were in the sea’s wet, not until he had pulled her under and changed into a man more beautiful than any before him—for of course, he was no man at all.\nThey say Europa did not scream (Marius screamed—my people say a traveler to distant lands should make no enemies and this was not our intent—never our intent), but by then, she was under water. How could anyone have known? The foam that rushed to shore could have easily been from her thrashing in the water, trying to escape Zeus’s maniacal hold—but it was only the gentle swelling tide, they say, carrying flower petals to shore in the wake of a beautiful wedding.\nEuropa’s tides are well-concealed beneath a cap of ice, plumes of water escaping when they can. But once free, they freeze and become part of the ice forevermore. Europa stretches infinite before us. Ahead, I can see the curved ridges we will likely take shelter in if we mean to rest and hydrate. The Delphi Flexus is not endless, but looks such from where we walk; we have to cross its boundary, and then the penitentes—the spikes of ice that prove this world is melting and refreezing in turn—before Thrace Terminal becomes a possibility.\nI am torn between which is a more severe loss: Marius or the two icecats. Kotto would say the icecats, given our present circumstances. I am worried I would agree.\nWithin the flexus, we find a curve of ice in which to shelter. There will be no fire, but our suits are equipped with a series of chemical warming layers that should see us through. Likewise, there is a liquid feeding system, and though it is not my mother’s moin moin, it will do. My mother told me the death that kills a man begins as an appetite, and perhaps this is what she meant, so when Kotto bids me eat, I activate the suit’s feeding tube, tonguing once for water, twice for pureed food. There are two more meals to be had, which means at least two nights without. Possibly more. We will arrive at Thrace Terminal hungry.\n“Bolaji, what—”\nKotto grabs my arm and extends it away from my body. The soft suit is the only thing that separates us from certain death via cold or radiation, and by the soft light radiating from her helmet, I can see what she sees. The sleeve of my suit has torn, from elbow to wrist, the fabric gaping open as if the sleeve has been unbuttoned. Every layer is ripped, ruined, and something pale rests within.\nIt is so pale, I do not even recognize my own arm for my skin is not this color, but brown. I stare, for I have never seen such a thing—has it been burned by cold? If my suit has been compromised, why have I not perished?\nKotto moves swiftly, cracking her case open to retrieve the emergency patch kit. I want to tell her to stop, but I sit silently, creamed spinach puree growing sour on my tongue. I should be dead. Why am I not dead? Kotto works fast—her hands are sure as she seals the entire length of the sleeve back together. In the cold, frost begins to crackle over the binding.\n“Kotto.”\n“Sssh.”\nShe does not have to tell me twice.\nKOTTO\nThey say that in deep space, the extraordinary will become ordinary and eventually you stop noticing it. When the extraordinary is one’s everyday job, it’s nothing to fuss over. We live in space, we are settling the entire system, these acts are no longer magic. These people—they need to stop talking, because they’re so fucking wrong.\nBolaji’s arm should not be that color—it’s like ice, Europan ice. But it’s also not. If the lineae within Europa’s ice look like shadows to me, charcoal lines hastily sketched, this ice is different, for his veins make a lineae of their own, these deep blue. Or, what I presume to be blue. I should not be able to see this color—but here it is. I have never seen it, and yet I know it. An ancestral memory, my therapist would say. I want to ask Bolaji what color the lines are, but the suit needs to be sealed, and once it’s sealed we say nothing.\n“Kotto.”\n“Sssh.” I lift my hand, as if I could place it over his mouth to silence him. But he stays silent. Trembling. His eyes are wide and I tell myself they are not getting pale, they are as brown as they ever were, calling to mind the blackwood jungles my grandmother left me paintings of. So deep one could get lost, until the sunlight pierced the trunks and—oh Bolaji. What the hell? This was a simple rescue, nothing more.\nBeyond the goddamn color of his arm, Bolaji should be dead. I am certain this fact presses on him as much as on me. His suit was opened to space, to the Europan air which stands at nearly three hundred degrees below zero. Nothing can survive that. Not even the icecats proved able and they were built for it.\nBeneath my feet, the ice rumbles. Our training is so ingrained, I don’t even have to say “move!” before we’re in motion. We know.\nAs stable as the surface should be, deep space remains largely unknown and hostile. Perhaps we were not meant to come this far—we are too fragile, too alive to know the depth of this cold. Europa is only doing what Europa does best. Under the strain of Jupiter above her, carting her deeper into the stars, she cracks and groans and spews water from her belly. Most of this water falls to coat the ground in fresh ice; some escapes into space.\nBolaji and I climb up the flexus and slide down its backside, avoiding the spew of ice water. Despite the danger, I am grinning as we glide down the ice, over bumps and ridges as the crews on Mars often traverse the sand dunes. At the bottom of the ridge, our ice cleats stab us steady, though the ground rumbles still. High in the hazy sky, more water plumes.\n“Kotto—”\n“Bolaji, move,” I say, because I want some distance between us and that plume. If we’re resting at all (he should be dead, Bolaji should be dead), it’s not going to be on top of Europa’s vomiting mouth.\nMARIUS\nOthers have been on Europa for eons, so long that when they try to convey it in numbers and words, Marius is overwhelmed. Others believe he has a mind for science, but Marius can’t digest what they transmit. Images flood his tear-blurred vision—another star system, far from where he now floats. An explosion, a nebula, debris hurtling through space. These simple things, Marius slowly understands.\nMarius cannot understand his own star system in its infancy, but when he realizes that nine worlds are spinning into creation around a violently bright sun (he still counts Pluto), he can taste tears on my lips. He views the planets as children, small but growing larger, hauling in rock and gas, coalescing atmospheres tolerable and toxic, flinging comets here and moons there. He watches young Mars flood and old Mars perish; Valles Marineris cracks wide and he fears the entire planet will split in two, but she holds, dusty and dead.\nNo one has witnessed this, Marius thinks, though is quickly reminded by the strong body beneath his own that Others were here first. Others witnessed. This was theirs until slumber and gravity drew them into the depths where they slept, Marius and his kind cracked Europa’s ice like an egg, pierced her salty ocean, drilled into her rocky mantle. (Crude, but he thinks of William again—cracking, piercing, drilling.)\nMarius tries to speak, but is under water, and cannot understand how he is breathing, let alone how he might speak. He thinks he should not have left the station, but he had to, otherwise there would be no this. He was called to leave the station, knowing where to find them, knowing they had something to show him—the lost station, the end of all he had sought. Bolaji should never have followed—Marius is certain where the fault lies.\nHe stretches into the cold dark and when he can no longer see any brightness above, loses his sense of direction. Everything is featureless black, as if nothing has ever been created. In this black, there has never been a sun, nor any speck of light, until something startling and green darts through the salted water. Glowing Others murmurate across his vision, one sliding through Marius’s palm small as a flower.\nThe beings draw so near that they swarm around Marius, against his skin—skin, not suit, and he wonders when it was lost, and why he is not dead (is he dead?). When they swarm with more fury, his throat grows raw from screaming. He is not yet dead, he is not yet—\nBOLAJI\nEuropa, once carried to Crete where she was to be queen, was welcomed by Asterion—he of the labyrinth, the creature that was half man, half monster. Did Asterion challenge Zeus for Europa’s fair hand? There are no such stories of what became of her there—but for the one that my mind creates: that Europa, enraged after being taken from her home and life, turned on them both; that Athena looked down in her wisdom and recognizing a warrior soul, transformed what remained of the garland of flowers into a sword. Europa killed Zeus and imprisoned Asterion within the labyrinth, before tracing the path of spilled flowers back home.\nI am certain this did not happen, but it seems so, as Kotto jostles me into consciousness once more. She stands as fiery, sword-brandishing Europa above me, intent on slaughtering whatever obstacle lands in our path. I have never seen Kotto as such before and it steals my breath. Kotto keeps always to herself, intent on her work, on finding the smallest organisms that call Europa’s oceans home. She cared nothing for humanity—only what life might exist elsewhere. When she found the first, this was the only time I heard her laugh; she said they were yellow-orange, but they glowed green for me.\nMy tongue is numb in my mouth; I cannot answer her when she speaks, nor can I fully understand what she has said. She glows, as if she has become one of the salt-loving organisms of the deep. I nod and she seems pleased, vanishing from my sight. We move, but I am not walking. Kotto drags me on the emergency sledge. As if I have broken a leg. As if I am incapable.\nA look down at my legs tells me I am incapable. My suit has split wide again, exposing my legs to the air. At some point, it is clear that Kotto tried to seal the rends, but they split the binding again and again. I cannot fathom why; I do not feel larger, and my body is not shaped differently. But the skin that gleams up from the torn suit is wholly white, as clear as ice, with thousands of blue lineae running beneath.\nThis should startle me, but between the evidence and the emotion, there is a great gulf of nothing. One cannot reach the other. I study the legs as if they were Europan ice, following each lineae until I can no longer trace its path. They wind across the legs and disappear under, and I imagine I see patterns within them: sharp-edged stars and the lump that is Zuma Rock. I have only ever seen this rock in images handed down from lifetimes before my own: a gray and hulking lump rising quite suddenly from the trees as if it were dropped from space. My many-times-great grandfather was said to have climbed it; my many-times-great grandmother said that was absurd. And yet, here I am on Europa. I picture my many-times-great grandfather upon this rock and I am calmed.\nCome morning—is it morning?—the idea of the rock still rests within me. I feel it as if upon my tongue, salty and weighting it down so I cannot speak when Kotto looks at me. But I see it upon her face. Something else has happened, something she has no explanation for, and the following morning (the ice so very bright beneath Jupiter’s glowing orb), she will have no explanation for what comes next.\nI want to speak to her; I want to write her a letter. My fingers crave the feel of keys, of a cold glass screen, so that I might tell her how Europa surely followed that trail of broken flowers home. So that I might tell her how Zuma Rock rises black from the greenery, and how my many-times-great grandfather stood upon it, barefoot, naked, the way I will stand upon the ice before the consumed shell of my body falls away.\nKOTTO\nOne man should not weigh so much in this gravity.\nThe sledge is ingenious, locking Bolaji firmly into place, so he is not jostled no matter the terrain we cover. The runners have blades, but like an ice skate possess something of a toe pick, which I can latch into the ice to keep the entire thing from moving. I do this now, kneeling on the ice as I try to catch my breath. We’ll share our last meal in a few hours; tomorrow will be hungry, and Thrace Terminal is at least another day beyond. Water isn’t a problem, at least; Europa’s ocean water freezes clean, desalinated, and our suits are equipped with a sealed system that will allow me to store and melt ice for drinking.\nMarius should never have come out—it’s easy to convince myself of this. When Marius left the station, shrieking about finding a lost station (the lost station—madness—we had not been here before, had we), Bolaji, in his good nature, followed. No one went onto the ice alone—ever, ever, ever. Going alone was certain death. Not that Marius cared or waited—his discovery, he cried, would not wait. Of course he took an icecat. Of course Bolaji took another to follow. And now—we were nearly fucked, but the universe had surely seen worse, even if we had not.\nI went alone, didn’t I? Charged out after Bolaji without a second, without a third. Just went, and I shouldn’t have. Was it worth two lives, Kotto? This goddamn lost station? What the hell does deep space do to a mind? What did Marius see that I did not?\n“Bolaji.”\nHe’s so still, the ice color having creeped up his cheeks. He tries to move his mouth, but cannot open it. His water tube remains tucked in the corner; he’s unable to even tongue that away, which is probably best. A slow trickle is better than nothing. If I can get him back to Thrace Terminal, if we can get him in sickbay—I don’t know. Medicine isn’t my thing—first aid sure, but not this. And this isn’t like anything I’ve ever seen.\n“Can you try to sit up?”\nBolaji nods at me, but doesn’t move. He should be able to sit up, only his legs secured to the sledge; his hands curl around the handles, but he could move them if he wanted. If he was able. I bite the inside of my cheek and taste salt. Maybe whatever’s happened to him won’t let him. Was this part of what happened to Marius?\nThe known part was Bolaji radioing back, shrieking that Marius had found it—had found it and we were going to be famous and known and it was better than standing on Zuma Rock naked. Maybe this thing had a hold of him then, too. Was this what extreme cold did to a person? No; cold like this killed a person flat out. Why the hell wasn’t Bolaji dead? Why weren’t we all?\n“Not sitting up is also fine.”\nBolaji watches me like I’m something he’s never seen instead of someone he’s worked with for seven years. He did a brief stint on Galileo Station, but his heart was never there. When I accused him of wanting a moon of his own, brand new ground he could sink his feet into, he joked that I always wanted an ocean no one had peed in. He wasn’t entirely wrong.\n“Come on. If you stop slowing me down, we can make the spikes, and that means . . . Thrace is still damn far away . . . ”\nThe sledge seems lighter when I pull it back into motion. When I dreamed of alien oceans, I dreamed of beasts big enough to pull crafts through them. Not our crafts—their own. These beasts were never not industrious, crafting marvelous cities at the edge of every ocean they possessed—and probably peed in.\nBut the beasts here are smaller and according to Bolaji, brighter, glowing green. What had Marius found that could compete with that? We’d found life—goddamn alien life—and he was throwing himself out onto the ice for what. For this?\nI glance back at Bolaji, whose arms are raised, hands reaching for something I cannot see. Something he probably can’t see, either. But what I see turns my stomach; the gloves of his suit are ripped. But more than that maybe, because the fabric looks eaten away. Something in the air, a contaminant we couldn’t detect, something in the ice? The exposure to long, continued cold?\nThe penitentes rise like stalagmites from the ice field ahead. The thin blades of ice, some running dark with trapped minerals, are all turned the same direction, as if something has caught their attention. That something is the far-distant sun. I wonder what it would be like, to stretch under its warmth, to watch it melt this entire ball of ice into a whole, free-flowing ocean. Some worlds, I remind myself, are like that.\nI position the sledge within the shelter of two penitentes, and laugh at myself for doing so. It’s not as if there’s someone out here to find us. It’s not as if anyone else is looking. Tomorrow, I’ll be in radio range of Thrace; tomorrow, they’ll know. I draw on my feeding tube, food first, water second, and watch the sky until sleep claims me. I don’t mean to sleep long—Bolaji can’t be left alone—but four hours have passed by the time I look upon the Jupiter-bright sky again.\n“If you pick up the pace,” I tell Bolaji, “we can cover some good ground here—how’s your water, anyhow?”\nI pick my way to the side of the sledge, reaching for the controls on the arm of Bolaji’s suit. His water level is too high—he hasn’t consumed any in the time we’ve been traveling, and when I look at his helmet, I see why. Bolaji is gone. His suit flutters empty, but for a puddle of what looks like water.\nMARIUS\nAt this point, Europa’s ocean is one hundred and eleven kilometers straight down, and Marius can see forever. The water swarms with life, hydrothermal vents spewing warmth into the ocean cold. Vast columns of bubbles stream upward, into the dark. Salt bursts across his tongue, but something beyond that, something metallic and true.\nHere, life abounds. Small, insistent. Larger, established. A crèche of crabs cling to the hot chimneys, hearts fluttering beneath their transparent exoskeletons. Eels, worms, and Others, so many Others. They have been here a long time, have made nests and smoothed hollows in the Europan rock where the world is forever warm.\nOthers carry Marius over the crater and the crab-crusted remains of anchor points rising from the rocky ground. Marius recognizes the broken frame, the shattered drill. A lost station, the lost station—but this lost station is Thrace Terminal, and the markings on the steel legs confirm it. He does not remember Thrace Terminal being lost, but can see it the way he has seen the past—an explosion, a water-pale nebula, debris hurtling through the black salted sea. These simple things Marius understands.\nMarius and Others glide toward still-standing Thrace Terminal; the water tastes of metal, thermal vents scattering bubbles in their wake, broken petals that will perish before they reach the ice cap.\nBOLAJI\nEuropa followed flowers; I follow water.\nAll thoughts of the suit, of Kotto, of Marius, have gone; these came Before. They are not Now. Now and here, there is only the water, the salt having transformed my body into something Other. I spread through the water, following the currents created by the deep thermal vents—even up here, beneath the ice, my body knows the way the water flows; can sense the warmth and cool entwined.\nIf there is purpose, it is only in growth. Why do we change? How do we endure? Why do we stretch for depths we have no hope of reaching? What happens when we do reach them? I think briefly of a man upon a rock, sweat-stained and aching. I think of how he must have looked at the land below him, at the froth of impossibly green trees, and this is how I survey the waters beneath me now. They are small, but filled with life.\nI travel as the water, pushing up through the ice clefts as I will, flinging myself into the sky which spreads clear and bright, before raining back to the ocean below. Pieces of me freeze on Europa’s porcelain face, but I am more than these; I spread infinite, seven times as big as Earth’s oceans, butting against the ice cap. Tonguing it into deeper water.\nKOTTO\nThrace Terminal stands black and skeletal against the ice. The distant sunlight gleams off the towers, off the ice that wraps her steel legs. She’s still far off, but I breathe easier at seeing her familiar shape. If the extraordinary is supposed to become commonplace, then maybe the commonplace also becomes extraordinary, especially when we are forced from its confines. You don’t dream about sex; you dream about familiar walls, your possessions no matter how meager, everyone you know.\nI flick my comms to life, already itching to get inside the station and take my helmet off. I want to breathe the stale, recycled air. I want to walk barefoot down the chilly corridors in morning. I want to attend my next goddamn mental assessment and show them I did it. I made it.\n“Kotto to Thrace Terminal.”\nBut the sledge, folded back into the emergency pack at my back, weighs heavy. I made it back, but alone. I did it, but couldn’t bring Bolaji with me. Couldn’t pull Marius back from whatever cliff he’d jumped off. Do you believe Bolaji had anything to do with Marius’s condition? With his disappearance? They will ask, won’t they? What will I answer? Bolaji did not make it, and Marius did not make it—what can I say? The cold has frozen me to the core—envy encases my heart and I cannot feel what perhaps I should for them, for the loss of them.\n“Thrace Terminal—Kotto, fucking Christ.”\n“Not quite that.” But I try to smile at the sound of Rey’s voice—something familiar, something warm. “Have you in sight—probably tomorrow, unless you send an icecat.” I relay my coordinates and hear Rey dispatching a crew for me.\nMy steps quicken at the thought; my walk hastens to a run, but when my helmet clouds with breath, I slow. No sense in overdoing it, not if they’re sending people for me.\nWhat did Marius and Bolaji find? What did they know? Why didn’t you find it? Maybe you couldn’t fucking see it, Kotto—the changes in the ice, the changes in the water. Or did you find it and were simply unable to see the way Bolaji and Marius could?\nWhen the ground rumbles, I wonder at the speed at which they’ve come. I strain to hear the icecats clawing their way cross the miles-thick ice, but they’re still too far distant. The vibration through the ice is pervasive, and I track it, as if dancing.\nIf they say that eventually you don’t notice the cold, must it also come to pass that after a while, you grow so accustomed to the world you inhabit, you forget it’s hostile? You forget that a rumble isn’t always a transplanted icecat; sometimes, it’s the native ice-buried ocean you’ve come to study. Sometimes, it’s a plume of water and vapor erupting from a fissure in the ice. A plume of water that seems to enfold you like an arm, like a garland of flowers, drawing you toward the arctic waters.\nI tumble and when I at last come to rest against a gently curved flexus, I’m breathing hard. The world beyond my helmet is hazy, but I can see the tear in my sleeve. Elbow to wrist, my arm gone to Europan ice. Deep blue lineae trace a new map to new lands upon me. Europa swims gray and I think it’s the condensation of breath on my helmet—but it’s something else.\nI have forgotten the cold.\nEverything blurs.", "source": "https://clarkesworldmagazine.com/tobler_01_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Abduction of Europa by E. Catherine Tobler"}