{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert Reed", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "mEtDZQvljjc1jnRhNTcJJJabfXU=", "id": null, "license": null, "comments": "", "raw_text": "4970 words, short story  Obliteration  A lot of people preferred this Mars to all the others.  This was the Mars wearing a cobalt blue sea in the north and towering redwood forests across its wilderness south. Ancient volcanoes had been re-plumbed and reinvigorated, helping maintain a deep warm sweetly-scented atmosphere. This was a tourist destination famous for its open-air cities, for flying naked, and for the billion human-stock citizens leading fascinating lives. And best of all, this Mars was a paradise within an arm’s lazy reach, and always free.  Kleave didn’t know much about the real Red Planet. Just that it was cold and dead on the outside, but infested with bugs underground. Only the Unified Space Agencies had access, and they sent nothing up there but sterile robots. But as a public service, Agency researchers built a faithful model of what was real, using off-the-shelf AIs and a fraction of their annual budget to build a virtual seed planted inside servers somewhere in the depths of the Atlantic. Ten thousand years of inspired terraforming were crossed in a week, and the results were opened for everyone to enjoy: A public playground and an advertisement for scientific inquiry, as well as one of the densest simulations in existence. Only the Disney-Burroughs Mars was as sophisticated, and that park was far too expensive for a man living on investments and a public stipend. Kleave had visited the D-B just once, and that adventure was still being paid off a little more every month.  The public Mars had a famously lovely coastline. Lying inside his in nubibus, Kleave felt as if he was facing the warm surf while lying naked on hot butterscotch-colored sand. Full of peppered shrimp and a vodka Collins, the young man was happy and ignorant. There was absolutely no inkling of disaster. Doobie was in charge of the lunch menu, and his long-term partner had just stepped out of her in nubibus, needing to pee and check on the oatmeal cookies. And that happened to be when a mature jelly-island decided to breach on the horizon. Always interesting, the creature began to spit flares while it inflated and deflated its gigantic body, proving its magnificence while driving waves at the red shoreline below. That was a scene worth watching. But then a pair of native humans approached. Tall, tall people with albatross wings growing from those broad Martians’ backs, they were a gorgeous couple singing with opera voices. Something intriguing was sure to happen. Should he call Doobie back from the apartment? No, Kleave just stared with shameless, re-woven eyes. Every pixel was supposed to be committed to memory. In a world of easy tricks, this was about the easiest. Kleave watched the girl catch her boy in midair, her body curling around his and then pulling both of them into the impossibly warm surf. A romantic embrace ended with the Martians emerging, laughing as they shook those white feathers dry, and then the lad began to chase the girl, first with long, graceful strides, and then both in the air again, musical giggles merging with the soughing of slow magnificent waves.  The lovers vanished and the jelly-island submerged again, but then the promised cookies arrived, warm and moist, familiar hands slipping them inside Kleave’s in nubibus.  Doobie appeared beside him, spectacularly naked. “What did I miss?”  “Quite a lot,” he promised.  Yet the world’s simplest trick refused to cooperate. Kleave first tried to summon the strangers coupling in the water, then tried to bring back the giant cnidaria quivering under the silvery-blue air. Yet neither memory file seemed to exist.  “What are you doing wrong?”  That was Doobie’s first reaction.  “I’m doing nothing wrong,” said Kleave. Then he failed to summon up half a dozen random events. The terror grew until his heart pounded, and that’s when Kleave finally tried to bring back the evening when he first took this glorious woman to bed. An event which he remembered very well on his own. But even that eternal file was gone.  “That’s crazy,” Doobie said.  Kleave wanted to agree with her.  “You’ve done something wrong,” she kept insisting.  Which implied that he could do something right and fix this.  “Fix it,” she said.  That’s what Kleave intended to do, for sure. But where to begin? Eleven years of a thoroughly recorded life had been lost, and the beautiful, disagreeable woman beside him seemed like a stranger.  “Three archives,” said the wizard. “That’s the common standard.”  “And that’s what I did.”  “Two technologies, two languages.”  “Yes, and yes.”  “With one archive kept off-site.”  Kleave couldn’t remember where that “on-site” storage was, but he was confident about his “off-site” archive. “I’ve got a second null-drive at my sister’s apartment.”  “And your sister lives underground?”  “Sure. In an abandoned gold mine, sure.”  The wizard stared at him, humorless as stone.  “Okay, I’m kidding,” Kleave said. “But the drive is sitting safe inside a lockbox, and I should be able to access it now. Right?”  Scorn filled that older face. Was this was a real man running diffusion software, talking to multiple clients, or a single AI designed to make unfortunate souls feel even more miserable than they already were?  “I know what you’re thinking,” Kleave said.  “What? That idiots deserve their fates?”  Only humans could be that dickish. “Yeah, well. Just try and help me figure out my fate. Would you please?”  A shiny probe appeared. Kleave’s face was interesting, then his neck. The hunt ended with a spot behind the right ear.  “Now I remember,” Kleave said. “It was implanted in college, when I upgraded from . . . what? Did I have an Intel archive before this?”  “How the hell would I know?”  Yeah. Definitely a human male.  “Okay, I see the problem,” the wizard said. “Judging by the damage, it looks like a fat daughter hit you.”  “Fat daughter?”  “Born from an ultra-high-energy mother particle. That big gal struck the upper atmosphere, triggering a rain of particles. I’m guessing your sister lives nearby.”  “It’s a long walk.”  “Of course those daughters aren’t as energetic as the original. But one of them definitely found you inside your apartment, and in the same thousandth of a second, one of her sisters struck your precious lockbox too.”  “God, that sounds so unlikely.”  “Disasters are always unlikely. That’s why nobody seems ready for them.”  Except “disasters” were other people’s problems. This was a catastrophe. Struggling for hope, Kleave said, “Maybe something else went wrong.”  The wizard didn’t call him, “Idiot.” Except with those narrowed eyes and that smug, silent mouth. “Well, that’s a thought. But null-drives are extraordinarily reliable, and a ‘failure’ signal in one drive triggers its twin into disaster mode. Fifty milliseconds. That’s all you need for the full library to be replicated and partitioned, then rapidly off-loaded.”  “Off-loaded where?”  “I’ll assume that your sister has neighbors. Well, in this case every adjacent null-drive absorbs a little piece of your library. That’s the standard protocol, years old and proven. You would have heard alarms announcing the event, and I’d see the data begging to be noticed now.”  Kleave was listening, and he wasn’t listening. He was mostly focused on his anger and misery as well as the profound embarrassment. And this very unpleasant wizard and his technology were very impressive. Except Kleave didn’t want to feel impressed just now. Pissed seemed like the perfect state of mind. “Okay, the backup drive failed. Two daughters struck my archives at the same time. But what about my second backup? I’m wearing a DNA chip that’s nearly new.”  A different tool appeared, blunt and dark. It quickly dropped to his hip, settling on the left side.  “I see one Amber Forever Repository, last year’s model.”  “That’s when I bought it.” Kleave didn’t remember the cost, but vivid wet-memories reminded him about the monthly payment. “It’s a state-of-the-art masterpiece. That’s what my research said.”  “The Amber Forever is basically good. But there was an enzyme update three months after it reached the market.”  “I did that update.”  “Did you?”  “Sure.” Kleave was aiming for confidence. He wanted to put an end to this professional disgust. But he was also suffering a faint recollection, something about a little chore going unfinished. “Okay, let’s say the update wasn’t done or done properly. What does that mean for me?”  “When the null-drive in your skull fails, the Amber Forever should prepare for a retrieval of its inventory. But the original enzymatic matrix had a flaw. Without that critical update, there’s a one-in-seventeen chance that the DNA self-wipes itself.”  “And why the hell would it?”  “That’s standard protection for encrypted files. Popular with intelligence agencies and media empires.”  “I’m neither of those things.”  “But that is what the Amber Forever was. Before the commercial models were released, it was the archive that could never be beaten.”  “I feel beaten,” Kleave said.  “‘Obliteration.’ That’s the industry’s term for this business.”  There was no way to calculate this awful luck. A single particle coming from outside the galaxy had burned out two innocent null-drives, and after that happened, an array of DNA washed away everything that it had ever learned. Kleave wanted to hit something. Not the wizard, since he might take offense. But attacking one of the walls seemed reasonable. The virtual office offered fake shelves full of photographs that must mean something to its owner. Kleave could throw every portrait to the floor and then stomp them under his feet. That seemed halfway suitable, pretending to destroy another man’s invincible memories.  And thoroughly stupid too. With a defeated sigh, Kleave asked, “So what do you advise?”  The wizard sat up and offered a suddenly eager smile. “Standard procedure would be for you to remove the null-drive from your neck and grab its mate from its box. With available methods, and patience, I should be able to recover . . . ” There was a pause. Technical aspects were in play, but the client’s pain as well as his bank accounts needed to be weighed too. “Twelve, maybe fourteen percent of your files would be retrieved. But a random sampling, with acceptable degradation of sensory quality.”  “Acceptable degradation” sounded like an eight percent recovery. That’s how techno-juggling worked. Kleave decided to abuse the virtual floor, stomping hard, delivering a much-welcomed dose of pain to the soles of his feet.  “Of course I can borrow from other people’s archives,” the wizard continued. “Friends and family will be easy enough, and sometimes you come across useful strangers. The goal is to harvest enough data and build a convincing likeness of your life experiences. Which will always be other people’s experiences, except for the realigned perspective.”  “That sounds expensive,” Kleave said.  The man didn’t disagree. Better to shrug with resignation, then tell the client, “I’m old. I was alive when memory was weak and people took snapshots to help us remember. But the pictures were simple and aged badly or got tossed out by mistake. So we threw slightly better photographs up on the cloud. But then came the Hacks of ’29 and the advent of cheap, nearly infinite private storage. That’s the history. That’s why memory is weaker now than ever. Nobody remembers shit. We don’t have to. Everything that happens is clean and pressed, eagerly waiting for us, and we don’t know what to do without it.”  “And you think the cost would be worthwhile?”  “To me, recovery would be priceless.”  “Except you won’t ever have my troubles. Will you? I bet you have more than three archives.”  A big smile, a slow nod. “Six of them, and four languages. And three null-drives are secured inside deep vaults, on separate continents.”  Kleave gave the floor another hard kick.  Which the wizard noticed. But Kleave’s misfortune deserved a warm little smile. What mattered now was to make the sale, and that’s why he leaned forward. “But really, you aren’t a careless fool. You’re not like the usual cases that I see. What happened to you . . . well, it’s remarkably rare, and in so many ways.”  “Others suffer like this?”  “The Obliteration of Everything. It happens all the time. Usually when a single old and badly maintained archive fails.”  And that’s when Kleave detected the faint beginnings of something that wasn’t pleasurable, no. But suddenly this situation wasn’t as lonely or quite as horrible as it once seemed.  Doobie was a woman of appetites and ideas and loud, blunt enthusiasms. She could be lovely and she was always physically impressive, but when his partner was sick, she became radiant. Illness was an event worth experiencing. Something about a good fever made Doobie more vivid, and Kleave secretly looked forward to the days when he had to serve as a tireless nurse to this complaining beast.  But Kleave’s illnesses and mishaps were never as well-received.  “You didn’t take care of your archives,” Doobie told him.  “I did what I could, and I thought it was enough,” he said.  “That enzyme update,” she said. “Did you or didn’t you do the mandatory update?”  With nothing but his soggy brain in play, Kleave couldn’t remember anything with certainty. But “I don’t know” seemed dangerous. Instead, I redirected the conversation by saying, “You should have been with me. To ask questions and punch the walls for me.”  “And that would have helped how?” Doobie always found excuses when her roommate visited a physician, AI or otherwise. And apparently it was the same for tech-wizards. “No, I’m too angry to sit. Too furious to ask questions. We’re together all these years, and now, because of all these little catastrophes, you’ve lost everything that we’ve ever shared.”  Doobie used to be flat-chested and then she was a buxom lady, but now she was back to the original shape. And those were just a few of the changes with a topography that was never quite happy with itself. Yet every version of Doobie had lived inside archives that Kleave trusted as much as his next deep breath. An infinitely complex apparition had lived inside his null-drives—a wondrous lady that shared the world with him all the way back to college. For years, they remained stubbornly unaware of each other’s existence. But re-woven eyes meant that every glance was recorded, and auditory sinks meant that every overheard word was real. Doobie was the big and pretty girl on the track-and-field team who threw the shot farther than any other woman. And Kleave? The handsome if rather shy boy who looked at his future partner exactly 156 times before finally noticing her wonders.  They went to the public Mars on their fifth date. They were already lovers, and that particular day didn’t offer any special fun. But worlds were the same as people. Sometimes it took 156 inadequate glances before you noticed what was precious. Or sometimes it took seven visits and staring into the throat of a reborn volcano, and then the two of you emerged ready to stop dating other people, at least for the time being.  That’s the promise Kleave made to Doobie and to himself. Though she was never as enthusiastic towards monogamy. They often shared archives, and sometimes he caught glimpses of other sexual adventures. Of course digital records had another spectacular power: The unwelcome and unseemly could be purged. A jealous-minded lover could make those bad minutes go away. Except Kleave never did make that effort. The way he looked at it, his partner was a world of flesh recorded in staggering detail, and he would never throw away anything that was Doobie. Each touch and the smell of her breath was waiting to be remembered, and even the flavor of his sweat mixed with hers. Kleave always wanted those joys close. Just as he never wanted to stop hearing that strong lady who was never ashamed to speak her mind.  “Well,” said Doobie. “Regardless of blame, you’ll of course get this problem fixed.”  Kleave stared at his roommate. This woman. Her hair was short, the clothes casual, bare toes digging into the stones resting beside a Martian river, cool water charging down a new canyon, making for the cobalt sea.  “It’s expensive,” he began.  “And I know that,” she interrupted. Except her knowledge didn’t push very far into the finances. She didn’t sit in the wizard’s office, and she didn’t show the slightest interest in liability law or Kleave’s financial resources. And she absolutely hadn’t put in the hours that he had spent researching this business of Obliteration. Which was perfectly named, and as he had learned, far more common than he would have guessed yesterday.  “Just pulling what remains from the two null-drives,” he said. “That would cost more than ten days on Disney-Burroughs.”  On that Mars, Doobie played the powerful princess.  But this woman, the one standing before him, wasn’t a princess. And this Doobie wasn’t the splendid force of nature that he loved. That idea arrived suddenly, entirely by surprise, and then it refused to let him go.  “Well, someone should pay for this,” the stranger said.  “Like who?” Kleave asked.  “The companies that built these awful drives. They should be happy to replace everything that failed.”  “The Amber Drive is under warranty,” he mentioned. “I’m entitled to a new, updated model.”  But then Doobie found a larger target. “A government that cares for its citizens, that educates us and treasures us . . . that sort of government should protect our pasts too. With a shared repository, or something else along those lines.”  Kleave didn’t see how any of these words helped.  “You’re awfully quiet,” she said.  He agreed with silence.  Then the original, most urgent question returned. “So how did you let this happen?”  Obviously this woman was a stranger. Kleave’s Doobie was eleven years of vivid existence, while this was just a thin slice of one mostly unknown existence. Her name didn’t matter. Kleave stared at the short hair and brown face and the anger that seemed quite familiar, but without the help of the archives ready to blunt the bad moments, offering up treasured moments and perfect long days.  “Why won’t you answer me?”  Kleave didn’t particularly like this woman.  “What are you thinking?” the stranger asked.  “That I can’t afford to do anything about anything,” he said. “Except outfit myself with new archives. And since your equipment isn’t any better than mine, we need to give you more backups too.”  “But I didn’t lose anything,” she said.  What did that mean?  “My in nubibus and yours are always side-by-side,” she said. “But did any of my archives die?”  “Radioactive daughters are tiny.”  “I know that.”  “This was just stupid bad luck,” he said.  A heavy, doubtful sigh.  “Or did I have a plan? Is that what you’re thinking?”  “No.” That idea sounded spectacularly paranoid, even in her ugly mood. “Where would such an idea even come from?”  “Because this was nothing but an accident,” Kleave said. At least those were the words that came out of him. Except his voice felt wrong, as if he was nothing but the bottle carrying the expected sentence.  She became the silent one now.  “I need to leave,” he said.  This Doobie shifted her weight. “Okay. Sure.” Staring at the pathetic man was painful. Kleave had lost every second that they had ever shared, and it took all of her grace to say a few obvious words. “You’re off to get some new archives. Right?”  That plan was set. He had addresses written on paper, yes. But Kleave said, “No. First I’m going to go to my sister’s and collect the other dead null-drive.”  The old Doobie had always feuded with Kleave’s sister.  This Doobie seemed much the same. “Fine. You do that.”  “Do you want to come with me?”  “No.” Then she thought about it, hard. And again, she said, “No.”  And for the first time in days, Kleave physically left their home. The apartment was no bigger than a space capsule bound for another world. Outdoors, the world turned huge. Pausing on a street corner, Kleave contemplated the idea that he could go anywhere and do almost anything, and no record of his adventures would be baked into some useless slab of Forever Amber.  Full names weren’t offered. That’s what Kleave noticed first. Just a single name and some people shook hands while others didn’t, depending on a lot of factors, including the quality of their in nubibus. Kleave couldn’t grasp anyone’s hand. He was inside an old cheap and very public machine, which meant that he could smell the dozens of strangers who had used it already that day. The experience wasn’t as awful as he would have guessed, but this was an experience that he wouldn’t happily do again either.  “Hello there, Kleave,” an older woman said. “And by the way. You have our permission to smile.”  He smiled at the smiling group.  And in a chorus, they shouted, “Hello, Kleave.”  OBLITERATED BY CHOICE. That was the official name for an organization dedicated to living without the modern burdens. At least that was the stated purpose in the literature that came up high in every search into Obliteration. This meeting was one of eighty currently happening, and he selected it for no reason but the location. This was the well-loved Mars. And in particular, a couple dozen believers had gathered east of Hellas, inside the damp redwood forest where ferns grew taller by the minute and enhanced gibbons rode gigantic tame eagles, hunting for tourists that would throw them baubles, or better, gold coins.  Kleave and Doobie had talked about coming to this district. And now he was here, as without her as he could be.  The gray lady seemed to be the group’s leader. “And what brings you to us today, Kleave?”  Being with strangers meant freedom, and even better, Kleave loved being unable to remember even a few of their names. Honesty. That was a quality that he often avoided with people who recorded everything. In that spirit, the new man surrendered a quick description of his day, centering on the major failures of proven technologies.  Some people were impressed, but most preferred superstition. The leader in particular. “Well, obviously, the gods have steered you to us,” she said. “You should take this wonderful day as a clear, unimpeachable sign.”  All right. That wasn’t the expected response. But again, Kleave felt free to tell them, “There aren’t any gods. The galaxy turns on its own.”  That won giggles from several faces, and from the high branches, laughing gibbons.  “Bad luck is nothing but bad luck,” he told everyone.  Then one man said, “Yet you haven’t replaced your archives. Have you?”  “Not yet, no.”  “Gods or not, you seem ready for a different course.”  Testimonies. Suddenly everyone had to share earnest tales about how good life was without re-woven eyes and terabytes of absorption. Several of these passionate, possibly crazed believers came close enough to grab hold of him, then couldn’t because his in nubibus was that awful. But their faces were pushing too close to his face, and although different people kept talking, all the same words were being said.  “The old, proven memories.”  “So much better than null-sinks.”  “And so much cheaper too.”  Then he posed what seemed like a reasonable, obvious question. “How do others react to your beliefs?”  “Badly.” Everyone said so, in every possible way, and there was no greater pleasure to be found. They boasted about being dismissed as outcasts, deviants, and moderately insane, or much worse than that. But the believers knew better. “We know best,” they sang. Life without archives meant trusting a brain that did spectacular things for millions of years. These ancient neurons were forgetful and lovely because of it. Memory should be just like the brain it inhabited, soft and malleable. Parts of yesterday and most of last year were lost, but that was a very good thing. Ordinary life deserved to be discarded. All that mattered were the impressive and shocking days, and those very pleasurable moments that stood tall and bright inside the dreary gray of normal existence.  Without question, their enthusiasm for ignorance was impressive. They had mastered a logic that arrived with force. Kleave found himself believing everything just long enough to surprise himself. But then the doubter inside him would take charge, and he’d have to squelch a laugh and a hard shake of the head. Ten minutes of passionate noise, and he still didn’t know which side of the line to choose.  Then someone wiggled a fingertip camera, naming the model while bragging about its cheapness and its terribly tiny memory. “So you can’t catch more than a few special scenes,” she said. “Nothing more than that.”  But that was too much. Others became angry enough to curse, while their leader tried to staunch what was plainly an old political fight. “Now we’ve agreed to disagree, and let’s focus back on Kleave.”  But then one fellow stepped forward, and almost everyone else groaned. Which he appreciated. Scorn brought energy, and he couldn’t keep his voice from shouting when he stated his own vision of life without mental aids.  “I don’t accept written words,” he stated.  “What can that mean?” asked Kleave. “You don’t read or write?”  “And I don’t know how to do either.”  How could anyone be illiterate? That seemed too bizarre.  Then the old lady succeeded in touching the new recruit. Just for an instant, Kleave felt the pressure of fingers, and with a threadbare patience, she reported, “Our Lauren had his brain worked with. Supposedly, he can’t do more than recognize letters and some of their sounds.”  “Supposedly” was the most important word in that account.  “We don’t believe him,” a younger woman admitted.  But that only encouraged the true believer. Looking and sounding like everyone else, except for the specific words that he used, Lauren stood tall while he explained, “I live without artificial tricks or aids from any time in the last ten thousand years. And that’s why I’m the only pure one here.”  And that’s when a great fight broke out.  Nobody noticed when the newcomer, whatever his name, managed to slip off into the emerald ferns. Kleave walked until he couldn’t hear any human. A gibbon and her eagle landed on the path before him, both begging for gold, and because nothing was real here, he gave them what they wanted badly—a digital bauble that one swallowed whole, keeping it safe in the belly.  He walked a little farther into the Martian wilderness.  But as happens sometimes when a cheap in nubibus pushes against the limits of any data-drawn world, the ferns grew yellowy pale and the ground softened until every step landed on pillows, and the deep sky beyond the redwoods forgot which blue it should be.  Doobie was sitting on the floor of the tiny apartment, tired of crying but not angry enough to stand when Kleave finally came home.  “You didn’t go to your sister’s,” she began.  They owned two chairs, and he took the nearest one. It was the chair that Doobie preferred, and she didn’t seem to notice.  “I got worried,” she said. “So worried that when you didn’t come home, I called that awful woman. Why does your sister hate me so much?”  “You were rude to her,” he said.  “When?”  “I don’t remember,” he said. “But she does. It was the day when you two met, and you said some unkind words about . . . well, it doesn’t matter what you said. The point is, she’s never let those ten seconds get lost.”  Doobie was sick with misery. How wonderful!  “So you called my sister, but she hadn’t seen me. Is that right?”  “I thought you might be leaving me,” Doobie said.  “I considered it.”  “And maybe you’ve come back for your belongings?”  “Maybe I haven’t decided yet.”  That broad body stiffened, and then hopelessness won. The old athlete seemed to turn to paste, soft and ready to flow. The weakest voice of her life said, “I won’t fight you. If you want to go.”  Kleave abandoned the chair for the grimy floor. The two of them sat with legs crossed, facing not so much each other as the third corner in a tidy triangle. Looking at that empty space, he said, “I went to Mars with strangers and learned a lot.”  “Good for you.”  “Then I finally walked to my sister’s. Which wasn’t long after you called her, by the way.”  Staring at the same bit of air, Doobie said nothing.  “Like I planned, I was going to retrieve the other broken null-drive.”  “I am sorry,” said Doobie.  And then, “I know what I said. When we met, I told your sister she was too pretty to ever ever ever be unhappy about anything.”  “She didn’t like those words.”  “I guess not.”  “Anyway.” A moment passed into another several moments, nothing memorable in the bunch. And then Kleave dropped a little piece of machinery on the dirty rug between them.  “What’s that?”  “An old Intel archive,” he said. “My archive, once. I found it in the lockbox with my irradiated archive. I’d forgotten I put it there, or that it existed anywhere. And do you know what, Doobie?”  “No. What?”  “Because it was so easy to do, I plugged this old model into my new archive. One connection. That’s all it took. And for the last eleven years, it’s been backing up my null-drive, a terabyte at a time.”  “Eleven years?”  “Yes.”  She stared at him, hope buried under all the fear of being too hopeful. “Was there room in the old drive for that much time?”  “Just barely.”  “So now you can get your memories back?” she asked.  To which Kleave said, “I never lost my memories, darling. Just a big world made up of tiny, tiny days.” Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "text": "4970 words, short story\nObliteration\nA lot of people preferred this Mars to all the others.\nThis was the Mars wearing a cobalt blue sea in the north and towering redwood forests across its wilderness south. Ancient volcanoes had been re-plumbed and reinvigorated, helping maintain a deep warm sweetly-scented atmosphere. This was a tourist destination famous for its open-air cities, for flying naked, and for the billion human-stock citizens leading fascinating lives. And best of all, this Mars was a paradise within an arm’s lazy reach, and always free.\nKleave didn’t know much about the real Red Planet. Just that it was cold and dead on the outside, but infested with bugs underground. Only the Unified Space Agencies had access, and they sent nothing up there but sterile robots. But as a public service, Agency researchers built a faithful model of what was real, using off-the-shelf AIs and a fraction of their annual budget to build a virtual seed planted inside servers somewhere in the depths of the Atlantic. Ten thousand years of inspired terraforming were crossed in a week, and the results were opened for everyone to enjoy: A public playground and an advertisement for scientific inquiry, as well as one of the densest simulations in existence. Only the Disney-Burroughs Mars was as sophisticated, and that park was far too expensive for a man living on investments and a public stipend. Kleave had visited the D-B just once, and that adventure was still being paid off a little more every month.\nThe public Mars had a famously lovely coastline. Lying inside his in nubibus, Kleave felt as if he was facing the warm surf while lying naked on hot butterscotch-colored sand. Full of peppered shrimp and a vodka Collins, the young man was happy and ignorant. There was absolutely no inkling of disaster. Doobie was in charge of the lunch menu, and his long-term partner had just stepped out of her in nubibus, needing to pee and check on the oatmeal cookies. And that happened to be when a mature jelly-island decided to breach on the horizon. Always interesting, the creature began to spit flares while it inflated and deflated its gigantic body, proving its magnificence while driving waves at the red shoreline below. That was a scene worth watching. But then a pair of native humans approached. Tall, tall people with albatross wings growing from those broad Martians’ backs, they were a gorgeous couple singing with opera voices. Something intriguing was sure to happen. Should he call Doobie back from the apartment? No, Kleave just stared with shameless, re-woven eyes. Every pixel was supposed to be committed to memory. In a world of easy tricks, this was about the easiest. Kleave watched the girl catch her boy in midair, her body curling around his and then pulling both of them into the impossibly warm surf. A romantic embrace ended with the Martians emerging, laughing as they shook those white feathers dry, and then the lad began to chase the girl, first with long, graceful strides, and then both in the air again, musical giggles merging with the soughing of slow magnificent waves.\nThe lovers vanished and the jelly-island submerged again, but then the promised cookies arrived, warm and moist, familiar hands slipping them inside Kleave’s in nubibus.\nDoobie appeared beside him, spectacularly naked. “What did I miss?”\n“Quite a lot,” he promised.\nYet the world’s simplest trick refused to cooperate. Kleave first tried to summon the strangers coupling in the water, then tried to bring back the giant cnidaria quivering under the silvery-blue air. Yet neither memory file seemed to exist.\n“What are you doing wrong?”\nThat was Doobie’s first reaction.\n“I’m doing nothing wrong,” said Kleave. Then he failed to summon up half a dozen random events. The terror grew until his heart pounded, and that’s when Kleave finally tried to bring back the evening when he first took this glorious woman to bed. An event which he remembered very well on his own. But even that eternal file was gone.\n“That’s crazy,” Doobie said.\nKleave wanted to agree with her.\n“You’ve done something wrong,” she kept insisting.\nWhich implied that he could do something right and fix this.\n“Fix it,” she said.\nThat’s what Kleave intended to do, for sure. But where to begin? Eleven years of a thoroughly recorded life had been lost, and the beautiful, disagreeable woman beside him seemed like a stranger.\n“Three archives,” said the wizard. “That’s the common standard.”\n“And that’s what I did.”\n“Two technologies, two languages.”\n“Yes, and yes.”\n“With one archive kept off-site.”\nKleave couldn’t remember where that “on-site” storage was, but he was confident about his “off-site” archive. “I’ve got a second null-drive at my sister’s apartment.”\n“And your sister lives underground?”\n“Sure. In an abandoned gold mine, sure.”\nThe wizard stared at him, humorless as stone.\n“Okay, I’m kidding,” Kleave said. “But the drive is sitting safe inside a lockbox, and I should be able to access it now. Right?”\nScorn filled that older face. Was this was a real man running diffusion software, talking to multiple clients, or a single AI designed to make unfortunate souls feel even more miserable than they already were?\n“I know what you’re thinking,” Kleave said.\n“What? That idiots deserve their fates?”\nOnly humans could be that dickish. “Yeah, well. Just try and help me figure out my fate. Would you please?”\nA shiny probe appeared. Kleave’s face was interesting, then his neck. The hunt ended with a spot behind the right ear.\n“Now I remember,” Kleave said. “It was implanted in college, when I upgraded from . . . what? Did I have an Intel archive before this?”\n“How the hell would I know?”\nYeah. Definitely a human male.\n“Okay, I see the problem,” the wizard said. “Judging by the damage, it looks like a fat daughter hit you.”\n“Fat daughter?”\n“Born from an ultra-high-energy mother particle. That big gal struck the upper atmosphere, triggering a rain of particles. I’m guessing your sister lives nearby.”\n“It’s a long walk.”\n“Of course those daughters aren’t as energetic as the original. But one of them definitely found you inside your apartment, and in the same thousandth of a second, one of her sisters struck your precious lockbox too.”\n“God, that sounds so unlikely.”\n“Disasters are always unlikely. That’s why nobody seems ready for them.”\nExcept “disasters” were other people’s problems. This was a catastrophe. Struggling for hope, Kleave said, “Maybe something else went wrong.”\nThe wizard didn’t call him, “Idiot.” Except with those narrowed eyes and that smug, silent mouth. “Well, that’s a thought. But null-drives are extraordinarily reliable, and a ‘failure’ signal in one drive triggers its twin into disaster mode. Fifty milliseconds. That’s all you need for the full library to be replicated and partitioned, then rapidly off-loaded.”\n“Off-loaded where?”\n“I’ll assume that your sister has neighbors. Well, in this case every adjacent null-drive absorbs a little piece of your library. That’s the standard protocol, years old and proven. You would have heard alarms announcing the event, and I’d see the data begging to be noticed now.”\nKleave was listening, and he wasn’t listening. He was mostly focused on his anger and misery as well as the profound embarrassment. And this very unpleasant wizard and his technology were very impressive. Except Kleave didn’t want to feel impressed just now. Pissed seemed like the perfect state of mind. “Okay, the backup drive failed. Two daughters struck my archives at the same time. But what about my second backup? I’m wearing a DNA chip that’s nearly new.”\nA different tool appeared, blunt and dark. It quickly dropped to his hip, settling on the left side.\n“I see one Amber Forever Repository, last year’s model.”\n“That’s when I bought it.” Kleave didn’t remember the cost, but vivid wet-memories reminded him about the monthly payment. “It’s a state-of-the-art masterpiece. That’s what my research said.”\n“The Amber Forever is basically good. But there was an enzyme update three months after it reached the market.”\n“I did that update.”\n“Did you?”\n“Sure.” Kleave was aiming for confidence. He wanted to put an end to this professional disgust. But he was also suffering a faint recollection, something about a little chore going unfinished. “Okay, let’s say the update wasn’t done or done properly. What does that mean for me?”\n“When the null-drive in your skull fails, the Amber Forever should prepare for a retrieval of its inventory. But the original enzymatic matrix had a flaw. Without that critical update, there’s a one-in-seventeen chance that the DNA self-wipes itself.”\n“And why the hell would it?”\n“That’s standard protection for encrypted files. Popular with intelligence agencies and media empires.”\n“I’m neither of those things.”\n“But that is what the Amber Forever was. Before the commercial models were released, it was the archive that could never be beaten.”\n“I feel beaten,” Kleave said.\n“‘Obliteration.’ That’s the industry’s term for this business.”\nThere was no way to calculate this awful luck. A single particle coming from outside the galaxy had burned out two innocent null-drives, and after that happened, an array of DNA washed away everything that it had ever learned. Kleave wanted to hit something. Not the wizard, since he might take offense. But attacking one of the walls seemed reasonable. The virtual office offered fake shelves full of photographs that must mean something to its owner. Kleave could throw every portrait to the floor and then stomp them under his feet. That seemed halfway suitable, pretending to destroy another man’s invincible memories.\nAnd thoroughly stupid too. With a defeated sigh, Kleave asked, “So what do you advise?”\nThe wizard sat up and offered a suddenly eager smile. “Standard procedure would be for you to remove the null-drive from your neck and grab its mate from its box. With available methods, and patience, I should be able to recover . . . ” There was a pause. Technical aspects were in play, but the client’s pain as well as his bank accounts needed to be weighed too. “Twelve, maybe fourteen percent of your files would be retrieved. But a random sampling, with acceptable degradation of sensory quality.”\n“Acceptable degradation” sounded like an eight percent recovery. That’s how techno-juggling worked. Kleave decided to abuse the virtual floor, stomping hard, delivering a much-welcomed dose of pain to the soles of his feet.\n“Of course I can borrow from other people’s archives,” the wizard continued. “Friends and family will be easy enough, and sometimes you come across useful strangers. The goal is to harvest enough data and build a convincing likeness of your life experiences. Which will always be other people’s experiences, except for the realigned perspective.”\n“That sounds expensive,” Kleave said.\nThe man didn’t disagree. Better to shrug with resignation, then tell the client, “I’m old. I was alive when memory was weak and people took snapshots to help us remember. But the pictures were simple and aged badly or got tossed out by mistake. So we threw slightly better photographs up on the cloud. But then came the Hacks of ’29 and the advent of cheap, nearly infinite private storage. That’s the history. That’s why memory is weaker now than ever. Nobody remembers shit. We don’t have to. Everything that happens is clean and pressed, eagerly waiting for us, and we don’t know what to do without it.”\n“And you think the cost would be worthwhile?”\n“To me, recovery would be priceless.”\n“Except you won’t ever have my troubles. Will you? I bet you have more than three archives.”\nA big smile, a slow nod. “Six of them, and four languages. And three null-drives are secured inside deep vaults, on separate continents.”\nKleave gave the floor another hard kick.\nWhich the wizard noticed. But Kleave’s misfortune deserved a warm little smile. What mattered now was to make the sale, and that’s why he leaned forward. “But really, you aren’t a careless fool. You’re not like the usual cases that I see. What happened to you . . . well, it’s remarkably rare, and in so many ways.”\n“Others suffer like this?”\n“The Obliteration of Everything. It happens all the time. Usually when a single old and badly maintained archive fails.”\nAnd that’s when Kleave detected the faint beginnings of something that wasn’t pleasurable, no. But suddenly this situation wasn’t as lonely or quite as horrible as it once seemed.\nDoobie was a woman of appetites and ideas and loud, blunt enthusiasms. She could be lovely and she was always physically impressive, but when his partner was sick, she became radiant. Illness was an event worth experiencing. Something about a good fever made Doobie more vivid, and Kleave secretly looked forward to the days when he had to serve as a tireless nurse to this complaining beast.\nBut Kleave’s illnesses and mishaps were never as well-received.\n“You didn’t take care of your archives,” Doobie told him.\n“I did what I could, and I thought it was enough,” he said.\n“That enzyme update,” she said. “Did you or didn’t you do the mandatory update?”\nWith nothing but his soggy brain in play, Kleave couldn’t remember anything with certainty. But “I don’t know” seemed dangerous. Instead, I redirected the conversation by saying, “You should have been with me. To ask questions and punch the walls for me.”\n“And that would have helped how?” Doobie always found excuses when her roommate visited a physician, AI or otherwise. And apparently it was the same for tech-wizards. “No, I’m too angry to sit. Too furious to ask questions. We’re together all these years, and now, because of all these little catastrophes, you’ve lost everything that we’ve ever shared.”\nDoobie used to be flat-chested and then she was a buxom lady, but now she was back to the original shape. And those were just a few of the changes with a topography that was never quite happy with itself. Yet every version of Doobie had lived inside archives that Kleave trusted as much as his next deep breath. An infinitely complex apparition had lived inside his null-drives—a wondrous lady that shared the world with him all the way back to college. For years, they remained stubbornly unaware of each other’s existence. But re-woven eyes meant that every glance was recorded, and auditory sinks meant that every overheard word was real. Doobie was the big and pretty girl on the track-and-field team who threw the shot farther than any other woman. And Kleave? The handsome if rather shy boy who looked at his future partner exactly 156 times before finally noticing her wonders.\nThey went to the public Mars on their fifth date. They were already lovers, and that particular day didn’t offer any special fun. But worlds were the same as people. Sometimes it took 156 inadequate glances before you noticed what was precious. Or sometimes it took seven visits and staring into the throat of a reborn volcano, and then the two of you emerged ready to stop dating other people, at least for the time being.\nThat’s the promise Kleave made to Doobie and to himself. Though she was never as enthusiastic towards monogamy. They often shared archives, and sometimes he caught glimpses of other sexual adventures. Of course digital records had another spectacular power: The unwelcome and unseemly could be purged. A jealous-minded lover could make those bad minutes go away. Except Kleave never did make that effort. The way he looked at it, his partner was a world of flesh recorded in staggering detail, and he would never throw away anything that was Doobie. Each touch and the smell of her breath was waiting to be remembered, and even the flavor of his sweat mixed with hers. Kleave always wanted those joys close. Just as he never wanted to stop hearing that strong lady who was never ashamed to speak her mind.\n“Well,” said Doobie. “Regardless of blame, you’ll of course get this problem fixed.”\nKleave stared at his roommate. This woman. Her hair was short, the clothes casual, bare toes digging into the stones resting beside a Martian river, cool water charging down a new canyon, making for the cobalt sea.\n“It’s expensive,” he began.\n“And I know that,” she interrupted. Except her knowledge didn’t push very far into the finances. She didn’t sit in the wizard’s office, and she didn’t show the slightest interest in liability law or Kleave’s financial resources. And she absolutely hadn’t put in the hours that he had spent researching this business of Obliteration. Which was perfectly named, and as he had learned, far more common than he would have guessed yesterday.\n“Just pulling what remains from the two null-drives,” he said. “That would cost more than ten days on Disney-Burroughs.”\nOn that Mars, Doobie played the powerful princess.\nBut this woman, the one standing before him, wasn’t a princess. And this Doobie wasn’t the splendid force of nature that he loved. That idea arrived suddenly, entirely by surprise, and then it refused to let him go.\n“Well, someone should pay for this,” the stranger said.\n“Like who?” Kleave asked.\n“The companies that built these awful drives. They should be happy to replace everything that failed.”\n“The Amber Drive is under warranty,” he mentioned. “I’m entitled to a new, updated model.”\nBut then Doobie found a larger target. “A government that cares for its citizens, that educates us and treasures us . . . that sort of government should protect our pasts too. With a shared repository, or something else along those lines.”\nKleave didn’t see how any of these words helped.\n“You’re awfully quiet,” she said.\nHe agreed with silence.\nThen the original, most urgent question returned. “So how did you let this happen?”\nObviously this woman was a stranger. Kleave’s Doobie was eleven years of vivid existence, while this was just a thin slice of one mostly unknown existence. Her name didn’t matter. Kleave stared at the short hair and brown face and the anger that seemed quite familiar, but without the help of the archives ready to blunt the bad moments, offering up treasured moments and perfect long days.\n“Why won’t you answer me?”\nKleave didn’t particularly like this woman.\n“What are you thinking?” the stranger asked.\n“That I can’t afford to do anything about anything,” he said. “Except outfit myself with new archives. And since your equipment isn’t any better than mine, we need to give you more backups too.”\n“But I didn’t lose anything,” she said.\nWhat did that mean?\n“My in nubibus and yours are always side-by-side,” she said. “But did any of my archives die?”\n“Radioactive daughters are tiny.”\n“I know that.”\n“This was just stupid bad luck,” he said.\nA heavy, doubtful sigh.\n“Or did I have a plan? Is that what you’re thinking?”\n“No.” That idea sounded spectacularly paranoid, even in her ugly mood. “Where would such an idea even come from?”\n“Because this was nothing but an accident,” Kleave said. At least those were the words that came out of him. Except his voice felt wrong, as if he was nothing but the bottle carrying the expected sentence.\nShe became the silent one now.\n“I need to leave,” he said.\nThis Doobie shifted her weight. “Okay. Sure.” Staring at the pathetic man was painful. Kleave had lost every second that they had ever shared, and it took all of her grace to say a few obvious words. “You’re off to get some new archives. Right?”\nThat plan was set. He had addresses written on paper, yes. But Kleave said, “No. First I’m going to go to my sister’s and collect the other dead null-drive.”\nThe old Doobie had always feuded with Kleave’s sister.\nThis Doobie seemed much the same. “Fine. You do that.”\n“Do you want to come with me?”\n“No.” Then she thought about it, hard. And again, she said, “No.”\nAnd for the first time in days, Kleave physically left their home. The apartment was no bigger than a space capsule bound for another world. Outdoors, the world turned huge. Pausing on a street corner, Kleave contemplated the idea that he could go anywhere and do almost anything, and no record of his adventures would be baked into some useless slab of Forever Amber.\nFull names weren’t offered. That’s what Kleave noticed first. Just a single name and some people shook hands while others didn’t, depending on a lot of factors, including the quality of their in nubibus. Kleave couldn’t grasp anyone’s hand. He was inside an old cheap and very public machine, which meant that he could smell the dozens of strangers who had used it already that day. The experience wasn’t as awful as he would have guessed, but this was an experience that he wouldn’t happily do again either.\n“Hello there, Kleave,” an older woman said. “And by the way. You have our permission to smile.”\nHe smiled at the smiling group.\nAnd in a chorus, they shouted, “Hello, Kleave.”\nOBLITERATED BY CHOICE. That was the official name for an organization dedicated to living without the modern burdens. At least that was the stated purpose in the literature that came up high in every search into Obliteration. This meeting was one of eighty currently happening, and he selected it for no reason but the location. This was the well-loved Mars. And in particular, a couple dozen believers had gathered east of Hellas, inside the damp redwood forest where ferns grew taller by the minute and enhanced gibbons rode gigantic tame eagles, hunting for tourists that would throw them baubles, or better, gold coins.\nKleave and Doobie had talked about coming to this district. And now he was here, as without her as he could be.\nThe gray lady seemed to be the group’s leader. “And what brings you to us today, Kleave?”\nBeing with strangers meant freedom, and even better, Kleave loved being unable to remember even a few of their names. Honesty. That was a quality that he often avoided with people who recorded everything. In that spirit, the new man surrendered a quick description of his day, centering on the major failures of proven technologies.\nSome people were impressed, but most preferred superstition. The leader in particular. “Well, obviously, the gods have steered you to us,” she said. “You should take this wonderful day as a clear, unimpeachable sign.”\nAll right. That wasn’t the expected response. But again, Kleave felt free to tell them, “There aren’t any gods. The galaxy turns on its own.”\nThat won giggles from several faces, and from the high branches, laughing gibbons.\n“Bad luck is nothing but bad luck,” he told everyone.\nThen one man said, “Yet you haven’t replaced your archives. Have you?”\n“Not yet, no.”\n“Gods or not, you seem ready for a different course.”\nTestimonies. Suddenly everyone had to share earnest tales about how good life was without re-woven eyes and terabytes of absorption. Several of these passionate, possibly crazed believers came close enough to grab hold of him, then couldn’t because his in nubibus was that awful. But their faces were pushing too close to his face, and although different people kept talking, all the same words were being said.\n“The old, proven memories.”\n“So much better than null-sinks.”\n“And so much cheaper too.”\nThen he posed what seemed like a reasonable, obvious question. “How do others react to your beliefs?”\n“Badly.” Everyone said so, in every possible way, and there was no greater pleasure to be found. They boasted about being dismissed as outcasts, deviants, and moderately insane, or much worse than that. But the believers knew better. “We know best,” they sang. Life without archives meant trusting a brain that did spectacular things for millions of years. These ancient neurons were forgetful and lovely because of it. Memory should be just like the brain it inhabited, soft and malleable. Parts of yesterday and most of last year were lost, but that was a very good thing. Ordinary life deserved to be discarded. All that mattered were the impressive and shocking days, and those very pleasurable moments that stood tall and bright inside the dreary gray of normal existence.\nWithout question, their enthusiasm for ignorance was impressive. They had mastered a logic that arrived with force. Kleave found himself believing everything just long enough to surprise himself. But then the doubter inside him would take charge, and he’d have to squelch a laugh and a hard shake of the head. Ten minutes of passionate noise, and he still didn’t know which side of the line to choose.\nThen someone wiggled a fingertip camera, naming the model while bragging about its cheapness and its terribly tiny memory. “So you can’t catch more than a few special scenes,” she said. “Nothing more than that.”\nBut that was too much. Others became angry enough to curse, while their leader tried to staunch what was plainly an old political fight. “Now we’ve agreed to disagree, and let’s focus back on Kleave.”\nBut then one fellow stepped forward, and almost everyone else groaned. Which he appreciated. Scorn brought energy, and he couldn’t keep his voice from shouting when he stated his own vision of life without mental aids.\n“I don’t accept written words,” he stated.\n“What can that mean?” asked Kleave. “You don’t read or write?”\n“And I don’t know how to do either.”\nHow could anyone be illiterate? That seemed too bizarre.\nThen the old lady succeeded in touching the new recruit. Just for an instant, Kleave felt the pressure of fingers, and with a threadbare patience, she reported, “Our Lauren had his brain worked with. Supposedly, he can’t do more than recognize letters and some of their sounds.”\n“Supposedly” was the most important word in that account.\n“We don’t believe him,” a younger woman admitted.\nBut that only encouraged the true believer. Looking and sounding like everyone else, except for the specific words that he used, Lauren stood tall while he explained, “I live without artificial tricks or aids from any time in the last ten thousand years. And that’s why I’m the only pure one here.”\nAnd that’s when a great fight broke out.\nNobody noticed when the newcomer, whatever his name, managed to slip off into the emerald ferns. Kleave walked until he couldn’t hear any human. A gibbon and her eagle landed on the path before him, both begging for gold, and because nothing was real here, he gave them what they wanted badly—a digital bauble that one swallowed whole, keeping it safe in the belly.\nHe walked a little farther into the Martian wilderness.\nBut as happens sometimes when a cheap in nubibus pushes against the limits of any data-drawn world, the ferns grew yellowy pale and the ground softened until every step landed on pillows, and the deep sky beyond the redwoods forgot which blue it should be.\nDoobie was sitting on the floor of the tiny apartment, tired of crying but not angry enough to stand when Kleave finally came home.\n“You didn’t go to your sister’s,” she began.\nThey owned two chairs, and he took the nearest one. It was the chair that Doobie preferred, and she didn’t seem to notice.\n“I got worried,” she said. “So worried that when you didn’t come home, I called that awful woman. Why does your sister hate me so much?”\n“You were rude to her,” he said.\n“When?”\n“I don’t remember,” he said. “But she does. It was the day when you two met, and you said some unkind words about . . . well, it doesn’t matter what you said. The point is, she’s never let those ten seconds get lost.”\nDoobie was sick with misery. How wonderful!\n“So you called my sister, but she hadn’t seen me. Is that right?”\n“I thought you might be leaving me,” Doobie said.\n“I considered it.”\n“And maybe you’ve come back for your belongings?”\n“Maybe I haven’t decided yet.”\nThat broad body stiffened, and then hopelessness won. The old athlete seemed to turn to paste, soft and ready to flow. The weakest voice of her life said, “I won’t fight you. If you want to go.”\nKleave abandoned the chair for the grimy floor. The two of them sat with legs crossed, facing not so much each other as the third corner in a tidy triangle. Looking at that empty space, he said, “I went to Mars with strangers and learned a lot.”\n“Good for you.”\n“Then I finally walked to my sister’s. Which wasn’t long after you called her, by the way.”\nStaring at the same bit of air, Doobie said nothing.\n“Like I planned, I was going to retrieve the other broken null-drive.”\n“I am sorry,” said Doobie.\nAnd then, “I know what I said. When we met, I told your sister she was too pretty to ever ever ever be unhappy about anything.”\n“She didn’t like those words.”\n“I guess not.”\n“Anyway.” A moment passed into another several moments, nothing memorable in the bunch. And then Kleave dropped a little piece of machinery on the dirty rug between them.\n“What’s that?”\n“An old Intel archive,” he said. “My archive, once. I found it in the lockbox with my irradiated archive. I’d forgotten I put it there, or that it existed anywhere. And do you know what, Doobie?”\n“No. What?”\n“Because it was so easy to do, I plugged this old model into my new archive. One connection. That’s all it took. And for the last eleven years, it’s been backing up my null-drive, a terabyte at a time.”\n“Eleven years?”\n“Yes.”\nShe stared at him, hope buried under all the fear of being too hopeful. “Was there room in the old drive for that much time?”\n“Just barely.”\n“So now you can get your memories back?” she asked.\nTo which Kleave said, “I never lost my memories, darling. Just a big world made up of tiny, tiny days.”\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "source": "https://clarkesworldmagazine.com/reed_02_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Obliteration by Robert Reed"}