{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rich Larson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "AkKrT3qwuZIwIXgE4oYcp9cOWBg=", "id": null, "license": null, "comments": "", "raw_text": "3330 words, short story  Last Nice Day  It sun-showers while we’re scrubbing the carrots. The sky overhead is robin’s egg blue—all the gray stormy shit is off to the east—but the rain comes down anyways. We’re sitting on the edge of the old wooden porch, facing the garden, and the drops lick our bare feet. That is the setting.  “Again,” says Mom, because it sun-showered yesterday too.  I scrub sideways, working bristles into creases. It feels good to see the water slick the dirt away and leave the skin bright orange. I like cleaning things. I like it when it rains and all the colors punch more. That is a relatable personality trait.  “Weird weather,” says Mom. She goes from scrubbing to cutting, pulling the clean bright carrots out of the bucket and lopping the tops off. “Still warm, though. We have to enjoy it. Might be the last nice day.”  I should be talking. I know I should be talking. Nobody wants to read about a silent and emotionally numb character.  “Yeah,” I say.  Carrots go from tub, dirty, to bucket, clean, to Tupperware, cut. Warm rain splatters walkway, dark blotches on stone laid last summer while I was overseas. My work involves travel. The last trip didn’t go so great. That’s foreshadowing.  “Are you doing that thing again, Ned?” Mom looks uncomfortable. “You know the thing I mean? When you pretend like you’re a fictional character to get mental distance from shit?”  “Nah,” I say. “Nah. I’m not.”  Soon the tub’s got only stragglers, small and pale, hiding in the brown murk, and when those are done Mom dumps the water, refills it, and gets started on scrubbing the beets.  “I know it was a bad one,” she says, and I can tell she wants to ask about the therapy modules, if I’ve finally started them.  “It was okay,” I say.  The beet juice leaches into the water bright red, and my heart goes off like a bomb, and my throat welds shut, but at least I’m reacting to things now, which makes it more interesting, fuck fuck fuck—  This is the last gasp of August.  Here’s a flashback: a man and a woman are standing in a bathroom. She knows about the envelope. He knows that she knows about the envelope. She doesn’t know that he knows that she knows about the envelope, but she is on the verge. Things are in flux.  “Shitty party,” the woman says, trying out a smile. “Sorry. I thought it would be more fun. I needed some fun.”  She looked inside the envelope. He saw the tiny spots of body heat her fingers left on the photos, though she was smart enough to not leave fingerprints. They have been playing the information game for weeks, but now his hand is forced. The risk of exposure is too high.  So his subself emerges, creeping down the pathways micro-lesioned into his corpus callosum. He sees sparks, smells the loamy fall rot on the roads outside his mom’s acreage.  “We both need some fun,” he says, but now he is only a passenger, observing. “This week has been crazy, you know? I’m going to take you out tomorrow. Just the two of us. We’ll go dancing.”  He holds out his hand, wrist aligned for the featherlight salsa clasp. She smiles and puts her hand in his, completing the frame.  “I’m not in my shoes,” she says.  He gives her a clockwork spin, then another, then another. She whirls in place on the shiny bathroom tiles, her reflection a beautiful laughing blur.  “Ned, stop it,” she says. “I’m dizzy.”  “Yeah,” he says. He spins her again. Again.  “Ned!” She stumbles. “Hey!”  He wrenches her sideways and smashes her head into the sink. Once is not enough. His subself knows that incapacitating someone in real life is not like incapacitating someone in a film. He can only count the contacts between porcelain and bone. On three the scalp splits, on seven the skull cracks, on twelve the eyes roll back, and she’s gone, hurt too badly to stay conscious.  She might never wake up. If she does, there will be extensive brain damage.  Knowing this would paralyze Ned, but his subself is already cleaning, sliding the body into the bathtub, running the water. Bright red blood swirls toward the drain.  Our old soccer wall is still up. It’s not really a wall: just a couple square-cut lumber stays stacked together with a flexy sheet of plywood wedged between them. Pass low against the stays and the ball comes back at speed, shoot a bit higher and the plywood takes the edge off the rebound so it doesn’t wallop you in the face.  I built it for my little sister Suz, back when she was playing for Team Alberta, streaking up and down the wing and launching those beautiful looping crosses. I haven’t seen her since I got back. Mom says she doesn’t leave her room anymore, but I hear her moving around the house in the middle of the night sometimes, cooking or showering.  Suz should be more than a supporting character, but I can’t get inside her head anymore, and lately I’m not sure I ever did. She will have to stay on the periphery.  Since she’s not using the soccer wall, I do. I find the blue-and-orange husk of an old Nike ball in the garage and pump it a little too full, then take it out to the wall and start hammering away, left foot, right foot, sometimes popping it up for volleys against the plywood. My feet are automatic, even after years and years of not playing, and it makes me wonder again about the balance of things: how much I do, how much I do without me.  I’m hoping that the familiar sound of the ball hitting wood will bring Suz out of her room how my knocking on her door couldn’t. A big black dog shows up instead. His name is Trotsky. Mom introduced us the day I arrived from the airport. Behaviorists say the coyotes are getting more aggressive around here, more prone to pack-hunting, so she wanted a bodyguard for her morning run. Trotsky is already rib-high on me, and he’s not done growing.  Mom also said some drone caught footage of a pizzly bear, half-starved but still a biological tank with razor-tipped mitts, wandering south. If that thing ever shows up around here, Trotsky better hide.  Of course, now it’s obvious the pizzly bear will find the acreage. It’s Chekhov’s Pizzly Bear now.  Trotsky bum-rushes me and attacks the soccer ball, trying to get his slobbery jaws around it. He’s still a puppy. I pop it out of his mouth with the toe of my shoe and play keep-away with him, dribbling a tight circle while he butts my legs with his shaggy head. I was never as good as Suz; after a few seconds Trotsky manages to dive under my shins and steal it. He skips away and stares at me, ball in mouth.  “Are you puncturing it?” I ask. “Hey. You better not be puncturing it.”  I take a step forward. He retreats. He is so happy. I am so glad he doesn’t know about the trip to Ljubljana, where a dog spotted me climbing a fence and started barking so loudly that my subself did the math, put one parka-wrapped hand into its mouth, and beat it to death with the other.  “You big beautiful idiot,” I say. “Give me that.”  He refuses, so I chase him around the half-dirt half-grass field behind the garden until I’m exhausted, and I have to flop down to breathe. Trotsky taunts me from a distance. It feels like it should feel good. The sun is still shining, limning red and gold leaves in the elm trees, which are insubstantial enough to sway, back and forth, back and forth, in the wind.  “This might be the last nice day,” I tell Trotsky. “Those leaves will start falling soon.”  Trotsky doesn’t care.  Here’s an infodump. The first thing you should know is that field operatives aren’t recruited or trained the way they used to be. Lives are too documented now. Identities are too concrete. Gaits and faces and thumbprints and retinas get stamped into the fabric of cyberspace a hundred times a day. Anonymity is a relic that even the best ghoster algorithms can’t bring back.  In the years it normally takes to be trained as an effective operative, enemy machine intelligence can dredge a dozen red flags out of movement and communication patterns. They make you before you ever set foot in the field. That’s why the whole thing had to be condensed. Candidates are still screened for physical fitness, of course, but the first priority is now mental malleability.  They test for the neural structures that lend themselves to psychosurgery, deep learning, training by dream machine. We’ve come a long way since the lobotomy. Now a decade of study and repetition can be brute forced into instinct and muscle memory in a matter of days, bypassing the higher brain functions, turning a civil servant into a fire-and-forget munition.  You only get three jobs, four maximum, before they pull you out of the field and thank you for your service and tell you the rest of your life will be beautifully boring. But the subself stays, lurking. The memories stay, lurking.  Mom has to go to the capital for a few days, to attend to business she can’t just be a laggy digital face for. She thinks her being gone might lure Suz out of her room, which she says would be an added bonus. The car takes her to the airport early Thursday morning and comes back empty.  I have nothing to do, so I do childhood things. Trotsky comes with me for wanders in the yellow sea of canola, where he can bark at the massive bug-like harvester as it trundles along. Sometimes we go to the woods out back of the house. I find the runoff trench where Suz used to race branches against each other, back when summers weren’t so dry. It’s all crusted mud now.  I crawl under the stairs and come out with a big plastic tub full of books. Protagonists shouldn’t be bookish. It’s cliché. But sometimes people just like books. I unstack a pile of paperbacks, flimsy covers with ancient CGI artwork and painfully shiny lettering, all metallic or holographic. The smell of them makes me forget about my subself.  There’s no sign of Suz until the third day. I come back from a walk and see dishes in the dishwasher. I remember she used to like tortellini with canned tomato soup as the sauce. The pantry has a full flat of canned soups, but when I ask the freezer about tortellini it says no.  I go out to the garage and check the old deepfreeze that used to belong to my grandparents. The top has imbibed saskatoon stains and the rubber seal is yellowing with age, and it doesn’t keep track of its contents. It opens up with a gush of frost. I shuffle through the frozen slabs of ziplocked berries, some moose meat from the neighbor. No tortellini.  There’s another virus going around, so I take my mask with me to get groceries. I put it on in the car while we’re gliding down the range road toward town. This stretch of blacktop, a few kilometers with no lights and no radar traps, used to be my own private adrenaline machine. I remember driving manual on it back in high school, coming home from late summer nights.  Windows down, but no music—no need for it with the wind blistering my eyes and my heart pounding and my foot lurching lower and lower on the gas. It was more personal without music, less like a movie and more like life.  Now I let the car drive, and we stay at the speed limit. The prairie sky is huge. The last sunlight of the day filters through the trees, lights up the canola fields, glints off an old train carcass rusting on the tracks. I try to enjoy it. I have to enjoy it. It’ll be dusk by the time I get back from the superstore.  It’s dusk by the time I get back from the superstore. The sky is dark, and the gravel road is shrouded in white fog. The car slows down for the railroad track, slumping over its rusty teeth. The grass is overgrown on either side, hip high. No trains run through here anymore.  The car’s headlights catch a reflective Adidas stripe. Someone is walking along the edge of the gravel road. They look back over their shoulder. Suz’s face is a patchwork of shadows. I see gaps where her eyes ought to be. She used to remind me of a whippet, but she moves slower now, too stiff for twenty-one.  I put the window down and tell the car to stop beside her. “Do you want a ride?” I ask.  She taps one earbud, gives a tight shrug.  “Do you want a ride?” I repeat.  “I’m good.” Her voice sounds like smoked glass. She stares at me for a second. “You can walk if you want.”  I climb out and tell the car to go home. We’re only ten minutes from the house. The groceries should be alright. Suz eyes me again, then keeps walking. I fall into step beside her. Her knee is clicking. I can just barely hear it.  “Still warm,” I say, because it feels like we’re strangers. “Might be the last nice day.”  “What did you do?” Suz asks.  “I bought groceries.”  “I mean, what did you do.”  Mom knows better than to ever ask this question. I did nothing, according to current law—she wrote some of the legislation herself. But Suz never liked bullshit, even when she was a little kid. I don’t know what to say to her.  “Or, you know, the other you.” She has an ugly rift in her voice. “What did the other you do?”  My subself twitches, like somebody’s eyes fluttering open for a split second before they roll over. “You know I can’t tell you that kind of thing,” I say.  “I got a vested interest,” she says. “I’m home alone with a professional murderer.” She reaches down into the ditch and plucks the head off a cattail. She grinds it up between her fingers, scatters the fragments behind us as we walk. “I got into her files a while back. Not the encrypted shit, obviously. But I saw some stuff about the killswitch.”  The killswitch. Some people call it that; some people call it the backseat. I always call it the subself, because that’s what it’s called in the briefing.  “What’s it like?” Suz asks. “Having someone else take over for the hard parts?”  It’s like watching your hands wash the blood off a woman’s face and then use that face to unlock her phone before rigor mortis sets in, to get the address to what used to be a school.  “It’s like being a fictional character,” I say.  “Oh.” Suz makes a face. “You still do that, huh.” She pauses. “Mom’s trying to set me up for psychosurgery. Since I didn’t like the meds. One little tweak, and all the neurotransmitters get in line. Dopamine for days.”  “Gets you to baseline,” I say. “Sure.”  “Fuck that,” Suz says flatly.  “Why?”  Suz moves her mouth. I think she is tonguing the backs of her teeth. “Same reason you won’t do your therapy modules,” she says. “I should be sad, because the world is a fucked-up place. And I’m fucked up, too.”  My throat swells almost shut. I have just enough air to ruin her perception of me forever. I confess.  “I entered into a relationship with a specific person, then killed them, then used their biometric data to gain access to a specific facility,” I say. “The facility housed children who had been grown in exosomatic wombs and undergone genetic modifications.”  Suz stops walking. This is something she wanted to know, but no longer wants to know, and it’s wrong of me to tell her, but I can’t stop.  “They were grown with the killswitch in them,” I say. “As a permanent part of them. They were zombies, in the philosophical sense. No consciousness.”  “You killed a bunch of kids,” Suz says, because it’s not much of a twist. She looks sick and pale.  I see the red of the beets leeching into the water again. I see the monofil garrote passing through small neck after small neck, down the line of dormitory beds. The dusk air is cool and smells like loam, all the fall-blazed leaves starting to rot.  “The subself did,” I say. “We had to discourage them. Destroying the facility wouldn’t have been enough. So fucked up is relative, Suz.”  “Stay away from me,” she says.  I got closer than I meant to, so the toes of my shoes almost touch her battered runners. The subself knows I shouldn’t be saying this.  In the distance, Trotsky howls alarm. For a moment I imagine the pizzly bear lumbering out of the bush, then I hear other howls, high-pitched, yelping. The coyotes are pack-hunting.  Suz takes off at a sprint, maybe to save Trotsky, or maybe so Trotsky can save her from me, and I sprint after her. I can feel the subself emerging, triggered by the adrenal dump. But that’s not right—it’s not the subself that emerges, it’s me that peels away. I’m a veneer. All my thinking and feeling and agonizing is an overgrown troubleshooting system.  I watch my subself hurtle along the dark road, somehow avoiding every pit and pothole, placing each step on level ground. He overtakes Suz and keeps going, toward the noise that my subself has zeroed in on better than I ever could. He skids, leaps the ditch in a spray of gravel, crunches into the brush. Trotsky is snarling and whimpering up ahead.  I see the hump of his shoulder in the tall grass. He dwarfs the coyotes, makes them seem insubstantial, small skinny shadows darting through the field. But there are eight of them, and they are desperation hungry. The bushes are spackled in blood. My subself takes off his sweater and wraps his fist and forearm in it.  It’s over by the time Suz catches up. Seven coyotes are slinking back into the aspen trees; one is dying with its head cracked open and its hind leg snapped. Trotsky is trying to lick a sticky red gash on his neck. I am sitting with him, unwrapping my dirt and blood-smeared sweater, evaluating what is probably a boxer’s fracture underneath.  Suz looks at me, and instead of looking relieved she looks more like a stranger than ever. “Trotsky,” she mumbles. “Here, boy.”  His ears flutter, but he stays with me. In books, in movies, the dog knows who the bad people are. I want to tell Suz that. I want to tell her that the subself is some implanted alien that has nothing to do with me, but the truth is that he’s more me than I ever was, and that’s why I don’t deserve the therapy modules.  “There’s tortellini,” I say.  I don’t think Suz hears me, and a moment later she leaves, tramping back to the gravel road. I sit there with Trotsky, rubbing gently behind his ear, little circles with my thumb the way I think I would want if I were a dog. I find a veterinarian on my phone.  “It’s going to be okay,” I say. “All of it.”  He believes me, the way Suz never will now. The sky overhead is endless, star-scattered, deep purple turning to black. The air is electric with petrichor.  I know the last nice day was a long time ago. Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "text": "3330 words, short story\nLast Nice Day\nIt sun-showers while we’re scrubbing the carrots. The sky overhead is robin’s egg blue—all the gray stormy shit is off to the east—but the rain comes down anyways. We’re sitting on the edge of the old wooden porch, facing the garden, and the drops lick our bare feet. That is the setting.\n“Again,” says Mom, because it sun-showered yesterday too.\nI scrub sideways, working bristles into creases. It feels good to see the water slick the dirt away and leave the skin bright orange. I like cleaning things. I like it when it rains and all the colors punch more. That is a relatable personality trait.\n“Weird weather,” says Mom. She goes from scrubbing to cutting, pulling the clean bright carrots out of the bucket and lopping the tops off. “Still warm, though. We have to enjoy it. Might be the last nice day.”\nI should be talking. I know I should be talking. Nobody wants to read about a silent and emotionally numb character.\n“Yeah,” I say.\nCarrots go from tub, dirty, to bucket, clean, to Tupperware, cut. Warm rain splatters walkway, dark blotches on stone laid last summer while I was overseas. My work involves travel. The last trip didn’t go so great. That’s foreshadowing.\n“Are you doing that thing again, Ned?” Mom looks uncomfortable. “You know the thing I mean? When you pretend like you’re a fictional character to get mental distance from shit?”\n“Nah,” I say. “Nah. I’m not.”\nSoon the tub’s got only stragglers, small and pale, hiding in the brown murk, and when those are done Mom dumps the water, refills it, and gets started on scrubbing the beets.\n“I know it was a bad one,” she says, and I can tell she wants to ask about the therapy modules, if I’ve finally started them.\n“It was okay,” I say.\nThe beet juice leaches into the water bright red, and my heart goes off like a bomb, and my throat welds shut, but at least I’m reacting to things now, which makes it more interesting, fuck fuck fuck—\nThis is the last gasp of August.\nHere’s a flashback: a man and a woman are standing in a bathroom. She knows about the envelope. He knows that she knows about the envelope. She doesn’t know that he knows that she knows about the envelope, but she is on the verge. Things are in flux.\n“Shitty party,” the woman says, trying out a smile. “Sorry. I thought it would be more fun. I needed some fun.”\nShe looked inside the envelope. He saw the tiny spots of body heat her fingers left on the photos, though she was smart enough to not leave fingerprints. They have been playing the information game for weeks, but now his hand is forced. The risk of exposure is too high.\nSo his subself emerges, creeping down the pathways micro-lesioned into his corpus callosum. He sees sparks, smells the loamy fall rot on the roads outside his mom’s acreage.\n“We both need some fun,” he says, but now he is only a passenger, observing. “This week has been crazy, you know? I’m going to take you out tomorrow. Just the two of us. We’ll go dancing.”\nHe holds out his hand, wrist aligned for the featherlight salsa clasp. She smiles and puts her hand in his, completing the frame.\n“I’m not in my shoes,” she says.\nHe gives her a clockwork spin, then another, then another. She whirls in place on the shiny bathroom tiles, her reflection a beautiful laughing blur.\n“Ned, stop it,” she says. “I’m dizzy.”\n“Yeah,” he says. He spins her again. Again.\n“Ned!” She stumbles. “Hey!”\nHe wrenches her sideways and smashes her head into the sink. Once is not enough. His subself knows that incapacitating someone in real life is not like incapacitating someone in a film. He can only count the contacts between porcelain and bone. On three the scalp splits, on seven the skull cracks, on twelve the eyes roll back, and she’s gone, hurt too badly to stay conscious.\nShe might never wake up. If she does, there will be extensive brain damage.\nKnowing this would paralyze Ned, but his subself is already cleaning, sliding the body into the bathtub, running the water. Bright red blood swirls toward the drain.\nOur old soccer wall is still up. It’s not really a wall: just a couple square-cut lumber stays stacked together with a flexy sheet of plywood wedged between them. Pass low against the stays and the ball comes back at speed, shoot a bit higher and the plywood takes the edge off the rebound so it doesn’t wallop you in the face.\nI built it for my little sister Suz, back when she was playing for Team Alberta, streaking up and down the wing and launching those beautiful looping crosses. I haven’t seen her since I got back. Mom says she doesn’t leave her room anymore, but I hear her moving around the house in the middle of the night sometimes, cooking or showering.\nSuz should be more than a supporting character, but I can’t get inside her head anymore, and lately I’m not sure I ever did. She will have to stay on the periphery.\nSince she’s not using the soccer wall, I do. I find the blue-and-orange husk of an old Nike ball in the garage and pump it a little too full, then take it out to the wall and start hammering away, left foot, right foot, sometimes popping it up for volleys against the plywood. My feet are automatic, even after years and years of not playing, and it makes me wonder again about the balance of things: how much I do, how much I do without me.\nI’m hoping that the familiar sound of the ball hitting wood will bring Suz out of her room how my knocking on her door couldn’t. A big black dog shows up instead. His name is Trotsky. Mom introduced us the day I arrived from the airport. Behaviorists say the coyotes are getting more aggressive around here, more prone to pack-hunting, so she wanted a bodyguard for her morning run. Trotsky is already rib-high on me, and he’s not done growing.\nMom also said some drone caught footage of a pizzly bear, half-starved but still a biological tank with razor-tipped mitts, wandering south. If that thing ever shows up around here, Trotsky better hide.\nOf course, now it’s obvious the pizzly bear will find the acreage. It’s Chekhov’s Pizzly Bear now.\nTrotsky bum-rushes me and attacks the soccer ball, trying to get his slobbery jaws around it. He’s still a puppy. I pop it out of his mouth with the toe of my shoe and play keep-away with him, dribbling a tight circle while he butts my legs with his shaggy head. I was never as good as Suz; after a few seconds Trotsky manages to dive under my shins and steal it. He skips away and stares at me, ball in mouth.\n“Are you puncturing it?” I ask. “Hey. You better not be puncturing it.”\nI take a step forward. He retreats. He is so happy. I am so glad he doesn’t know about the trip to Ljubljana, where a dog spotted me climbing a fence and started barking so loudly that my subself did the math, put one parka-wrapped hand into its mouth, and beat it to death with the other.\n“You big beautiful idiot,” I say. “Give me that.”\nHe refuses, so I chase him around the half-dirt half-grass field behind the garden until I’m exhausted, and I have to flop down to breathe. Trotsky taunts me from a distance. It feels like it should feel good. The sun is still shining, limning red and gold leaves in the elm trees, which are insubstantial enough to sway, back and forth, back and forth, in the wind.\n“This might be the last nice day,” I tell Trotsky. “Those leaves will start falling soon.”\nTrotsky doesn’t care.\nHere’s an infodump. The first thing you should know is that field operatives aren’t recruited or trained the way they used to be. Lives are too documented now. Identities are too concrete. Gaits and faces and thumbprints and retinas get stamped into the fabric of cyberspace a hundred times a day. Anonymity is a relic that even the best ghoster algorithms can’t bring back.\nIn the years it normally takes to be trained as an effective operative, enemy machine intelligence can dredge a dozen red flags out of movement and communication patterns. They make you before you ever set foot in the field. That’s why the whole thing had to be condensed. Candidates are still screened for physical fitness, of course, but the first priority is now mental malleability.\nThey test for the neural structures that lend themselves to psychosurgery, deep learning, training by dream machine. We’ve come a long way since the lobotomy. Now a decade of study and repetition can be brute forced into instinct and muscle memory in a matter of days, bypassing the higher brain functions, turning a civil servant into a fire-and-forget munition.\nYou only get three jobs, four maximum, before they pull you out of the field and thank you for your service and tell you the rest of your life will be beautifully boring. But the subself stays, lurking. The memories stay, lurking.\nMom has to go to the capital for a few days, to attend to business she can’t just be a laggy digital face for. She thinks her being gone might lure Suz out of her room, which she says would be an added bonus. The car takes her to the airport early Thursday morning and comes back empty.\nI have nothing to do, so I do childhood things. Trotsky comes with me for wanders in the yellow sea of canola, where he can bark at the massive bug-like harvester as it trundles along. Sometimes we go to the woods out back of the house. I find the runoff trench where Suz used to race branches against each other, back when summers weren’t so dry. It’s all crusted mud now.\nI crawl under the stairs and come out with a big plastic tub full of books. Protagonists shouldn’t be bookish. It’s cliché. But sometimes people just like books. I unstack a pile of paperbacks, flimsy covers with ancient CGI artwork and painfully shiny lettering, all metallic or holographic. The smell of them makes me forget about my subself.\nThere’s no sign of Suz until the third day. I come back from a walk and see dishes in the dishwasher. I remember she used to like tortellini with canned tomato soup as the sauce. The pantry has a full flat of canned soups, but when I ask the freezer about tortellini it says no.\nI go out to the garage and check the old deepfreeze that used to belong to my grandparents. The top has imbibed saskatoon stains and the rubber seal is yellowing with age, and it doesn’t keep track of its contents. It opens up with a gush of frost. I shuffle through the frozen slabs of ziplocked berries, some moose meat from the neighbor. No tortellini.\nThere’s another virus going around, so I take my mask with me to get groceries. I put it on in the car while we’re gliding down the range road toward town. This stretch of blacktop, a few kilometers with no lights and no radar traps, used to be my own private adrenaline machine. I remember driving manual on it back in high school, coming home from late summer nights.\nWindows down, but no music—no need for it with the wind blistering my eyes and my heart pounding and my foot lurching lower and lower on the gas. It was more personal without music, less like a movie and more like life.\nNow I let the car drive, and we stay at the speed limit. The prairie sky is huge. The last sunlight of the day filters through the trees, lights up the canola fields, glints off an old train carcass rusting on the tracks. I try to enjoy it. I have to enjoy it. It’ll be dusk by the time I get back from the superstore.\nIt’s dusk by the time I get back from the superstore. The sky is dark, and the gravel road is shrouded in white fog. The car slows down for the railroad track, slumping over its rusty teeth. The grass is overgrown on either side, hip high. No trains run through here anymore.\nThe car’s headlights catch a reflective Adidas stripe. Someone is walking along the edge of the gravel road. They look back over their shoulder. Suz’s face is a patchwork of shadows. I see gaps where her eyes ought to be. She used to remind me of a whippet, but she moves slower now, too stiff for twenty-one.\nI put the window down and tell the car to stop beside her. “Do you want a ride?” I ask.\nShe taps one earbud, gives a tight shrug.\n“Do you want a ride?” I repeat.\n“I’m good.” Her voice sounds like smoked glass. She stares at me for a second. “You can walk if you want.”\nI climb out and tell the car to go home. We’re only ten minutes from the house. The groceries should be alright. Suz eyes me again, then keeps walking. I fall into step beside her. Her knee is clicking. I can just barely hear it.\n“Still warm,” I say, because it feels like we’re strangers. “Might be the last nice day.”\n“What did you do?” Suz asks.\n“I bought groceries.”\n“I mean, what did you do.”\nMom knows better than to ever ask this question. I did nothing, according to current law—she wrote some of the legislation herself. But Suz never liked bullshit, even when she was a little kid. I don’t know what to say to her.\n“Or, you know, the other you.” She has an ugly rift in her voice. “What did the other you do?”\nMy subself twitches, like somebody’s eyes fluttering open for a split second before they roll over. “You know I can’t tell you that kind of thing,” I say.\n“I got a vested interest,” she says. “I’m home alone with a professional murderer.” She reaches down into the ditch and plucks the head off a cattail. She grinds it up between her fingers, scatters the fragments behind us as we walk. “I got into her files a while back. Not the encrypted shit, obviously. But I saw some stuff about the killswitch.”\nThe killswitch. Some people call it that; some people call it the backseat. I always call it the subself, because that’s what it’s called in the briefing.\n“What’s it like?” Suz asks. “Having someone else take over for the hard parts?”\nIt’s like watching your hands wash the blood off a woman’s face and then use that face to unlock her phone before rigor mortis sets in, to get the address to what used to be a school.\n“It’s like being a fictional character,” I say.\n“Oh.” Suz makes a face. “You still do that, huh.” She pauses. “Mom’s trying to set me up for psychosurgery. Since I didn’t like the meds. One little tweak, and all the neurotransmitters get in line. Dopamine for days.”\n“Gets you to baseline,” I say. “Sure.”\n“Fuck that,” Suz says flatly.\n“Why?”\nSuz moves her mouth. I think she is tonguing the backs of her teeth. “Same reason you won’t do your therapy modules,” she says. “I should be sad, because the world is a fucked-up place. And I’m fucked up, too.”\nMy throat swells almost shut. I have just enough air to ruin her perception of me forever. I confess.\n“I entered into a relationship with a specific person, then killed them, then used their biometric data to gain access to a specific facility,” I say. “The facility housed children who had been grown in exosomatic wombs and undergone genetic modifications.”\nSuz stops walking. This is something she wanted to know, but no longer wants to know, and it’s wrong of me to tell her, but I can’t stop.\n“They were grown with the killswitch in them,” I say. “As a permanent part of them. They were zombies, in the philosophical sense. No consciousness.”\n“You killed a bunch of kids,” Suz says, because it’s not much of a twist. She looks sick and pale.\nI see the red of the beets leeching into the water again. I see the monofil garrote passing through small neck after small neck, down the line of dormitory beds. The dusk air is cool and smells like loam, all the fall-blazed leaves starting to rot.\n“The subself did,” I say. “We had to discourage them. Destroying the facility wouldn’t have been enough. So fucked up is relative, Suz.”\n“Stay away from me,” she says.\nI got closer than I meant to, so the toes of my shoes almost touch her battered runners. The subself knows I shouldn’t be saying this.\nIn the distance, Trotsky howls alarm. For a moment I imagine the pizzly bear lumbering out of the bush, then I hear other howls, high-pitched, yelping. The coyotes are pack-hunting.\nSuz takes off at a sprint, maybe to save Trotsky, or maybe so Trotsky can save her from me, and I sprint after her. I can feel the subself emerging, triggered by the adrenal dump. But that’s not right—it’s not the subself that emerges, it’s me that peels away. I’m a veneer. All my thinking and feeling and agonizing is an overgrown troubleshooting system.\nI watch my subself hurtle along the dark road, somehow avoiding every pit and pothole, placing each step on level ground. He overtakes Suz and keeps going, toward the noise that my subself has zeroed in on better than I ever could. He skids, leaps the ditch in a spray of gravel, crunches into the brush. Trotsky is snarling and whimpering up ahead.\nI see the hump of his shoulder in the tall grass. He dwarfs the coyotes, makes them seem insubstantial, small skinny shadows darting through the field. But there are eight of them, and they are desperation hungry. The bushes are spackled in blood. My subself takes off his sweater and wraps his fist and forearm in it.\nIt’s over by the time Suz catches up. Seven coyotes are slinking back into the aspen trees; one is dying with its head cracked open and its hind leg snapped. Trotsky is trying to lick a sticky red gash on his neck. I am sitting with him, unwrapping my dirt and blood-smeared sweater, evaluating what is probably a boxer’s fracture underneath.\nSuz looks at me, and instead of looking relieved she looks more like a stranger than ever. “Trotsky,” she mumbles. “Here, boy.”\nHis ears flutter, but he stays with me. In books, in movies, the dog knows who the bad people are. I want to tell Suz that. I want to tell her that the subself is some implanted alien that has nothing to do with me, but the truth is that he’s more me than I ever was, and that’s why I don’t deserve the therapy modules.\n“There’s tortellini,” I say.\nI don’t think Suz hears me, and a moment later she leaves, tramping back to the gravel road. I sit there with Trotsky, rubbing gently behind his ear, little circles with my thumb the way I think I would want if I were a dog. I find a veterinarian on my phone.\n“It’s going to be okay,” I say. “All of it.”\nHe believes me, the way Suz never will now. The sky overhead is endless, star-scattered, deep purple turning to black. The air is electric with petrichor.\nI know the last nice day was a long time ago.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "source": "https://clarkesworldmagazine.com/larson_07_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Last Nice Day by Rich Larson"}