{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "AYOQamIwVngseogYHE6Pbmntmfk=", "id": null, "license": null, "comments": "", "raw_text": "Interview  5,000 Words a Day: A Conversation with Cat Rambo  Getting started in genre in the 2000s, with sales at venues including Strange Horizons, Talebones, Subterranean, and Fantasy Magazine, Cat Rambo now has published more stories than many authors will ever write.  Rambo was born in College Station, TX, and grew up in South Bend, IN, in a house that was full of books, with a family that let them read whatever they wanted. In elementary school, Rambo was reading Heinlein and Norton, hiding science fiction novels inside textbooks. Rambo attended Indiana University for a year, then took a break and worked in a bookshop, ultimately earning an English degree and a certificate in Gender Studies from the University of Notre Dame. They earned a master’s from “the second-oldest creative writing program in the United States”: Writing Seminars at Johns Hopkins University; then they began a PhD program at Indiana University, eventually pursuing a career in computer security. They worked in New York before moving to Seattle, and they worked as a manager for Microsoft.  In 2005 Rambo quit their job and attended the Clarion West Writers Workshop. That was the year they decided to focus on writing. In 2007 they began a four-year term as editor of Fantasy Magazine, and in 2014 became vice president of the Science Fiction and Fantasy Writers of America (SFWA). In 2015 they began their two-term run as SFWA president.  Besides being one of the most recognizable “friendly faces” in the industry, and being a seriously prolific short fiction author with works out in most of the venues SFWA defines as professional, Rambo has also garnered a number of accolades. Rambo’s stories have appeared on Locus Recommended Reading lists since the 2000s, and they received a 2012 World Fantasy Award nomination for editing Fantasy. Other notable nods include collection Eyes Like Sky and Coal and Moonlight as a 2010 Endeavor Award nominee, “Five Ways to Fall in Love on Planet Porcelain” as a 2012 Nebula Award finalist, a 2016 Compton Crook Award nomination for their debut novel, Beasts of Tabat, and a 2020 Nebula Award win for novelette Carpe Glitter/  Rambo has lectured and taught at a variety of respected venues, including Clarion West. For more than a decade Rambo has also run their own series of classes: The Rambo Academy for Wayward Writers. Their latest novels are the third book in the Tabat series, Exiles of Tabat (WordFire Press); and You Sexy Thing (Tor).   ISFDB lists well over a hundred short stories—and is probably incomplete (your website says 200+). How did COVID-19 impact your writing processes or habits, and how did you deal with those disruptions?  I think it’s closer to 300 now, definitely if we’re counting Patreon stuff and/or reprints! It helps that I’ve primarily been a short story writer, which makes the fact that I’ve got not one but two novels coming out in 2021 a little extra weird. There should be another two in 2022 if I stay on target.  COVID’s isolation, paradoxically, ended up keeping me productive by connecting me more deeply to other writers on a day-to-day basis. I used the Discord channel associated with my Patreon to create a community where we set up multiple daily coworking sessions as well as social events, like a group to discuss classic science fiction stories, or a “clean and chat” where we meet and clean our working spaces while talking about our lives. Those sessions kept—and continue to keep—me going, but 2020 was definitely a year where it was often hard to get started.  At those times, I had to remind myself, more than once, that in 2020, just existing was a victory. In this perilous and interesting era, staying buoyant is sometimes hard to achieve. Turning to my online community was a move that kept me from stagnating. I finished a number of stories as well as a novel in 2020—but I couldn’t have done it without my community.  Looking at your years of writing, were there times when you struggled to be productive, when you couldn’t sell work, or when you weren’t sure about writing as a career?  I came to F&SF writing a little later in life than a lot of my fellow writers, which means I’ve had a chance to witness how unpredictable life can be and how much luck can affect one’s existence. I think that gives me a better perspective on what success is—to me if I’m writing and happy about what I’m writing, that’s a successful day. And my superpower is my sense of humor—if you can laugh at a punch, it’s going to affect you a lot less.  As a full-time writer/teacher, I have the luck to be able to focus on writing rather than working at a day job, but it’s also an obligation. When you’re your own boss, it’s easy to be a lot harder on yourself than any boss could be.  But yeah—there’s always those moments where one wakes in the middle of the night, thinking “How did I get here and what the hell am I doing?” But I suspect they’re there no matter what field you’re in. If you can’t sleep at all, maybe you get up and do something. And you always know the next day will come and there will probably be some other moments in it that will be pretty enjoyable. That’s what keeps me going.  For people who haven’t read your short fiction, if they were to look at one or two of your pieces, which would want them to look at, and why?  I have a lot of different flavors of fiction! A few that I am particularly proud of are “Red in Tooth and Cog” (near future SF, appeared in The Magazine of Fantasy and Science Fiction), “Clockwork Fairies” (steampunk), and “Magnificent Pigs” (fantasy, Strange Horizons). I was lucky enough to have LeVar Burton read the last of those on his podcast, which was a huge thrill.  I do keep a page on my website that includes links to everything that’s available. Two favorite stories from this year are “Crazy Beautiful” (near future SF, appeared in The Magazine of Fantasy and Science Fiction) and “Every Breath a Question, Every Heartbeat an Answer” (fantasy novelette, appeared in Beneath Ceaseless Skies).  Your debut novel was Beasts of Tabat, published with WordFire Press in 2015, which saw two sequels: Hearts of Tabat and Exiles of Tabat. What were some of the things you learned, in the process of writing and publishing these books, that went into You Sexy Thing?  One major thing that I’ve had to learn is how to revise. I hate editing my own work and finding out how to grapple with a manuscript despite that feeling of mingled loathing and terror has been invaluable. By now I’ve got a road map in my head of what the stages look like. I know, for example, that the draft of the sequel that I’m working on will be done at the end of the month and enter the next stage, where it gets put aside for a bit before I come back and begin the first edit, and I know what to look for in that first edit in order to do things as efficiently and effectively as possible.  Another thing I’ve learned over time is working with points of view. Beasts of Tabat originally was something like six or seven points of view, which ended up getting pared down to two. You Sexy Thing was my answer to Ann Leckie’s saying she’d love to see a space opera in omniscient point of view, and I am pretty sure that would have been a total nightmare if I hadn’t been used to sorting out plot threads according to which character(s) they’re attached to.  But most importantly, the earlier novels have taught me to trust myself, to know that I can turn ideas into a (sometimes incoherent) draft, and that I’ll be able to take that and make something worthwhile. Writing depends greatly on being able to trust yourself, and by now I’ve done it enough to know that I can face a blank page and fill it in a way that pleases me.  Where the Tabat books are fantasy, You Sexy Thing is marketed as space opera. What, for you, are the hallmarks of excellent space opera?  I love space opera! For me, excellent space opera involves an enthralling, surprising, engaging cast of characters, plenty of action and twists and eyeball kicks, and universe-spanning plotlines.  There’s a Brian Aldiss quote I ran across at one point, talking about space opera and its sense of fun: “What space opera does is take a few lightyears and a pinch of reality and inflate thoroughly with melodrama, dreams, and a seasoning of screwy ideas.” So lots of sense of wonder—but also plenty of people stuff getting enacted in front of that backdrop.  You Sexy Thing also wanders into the realm of hopepunk, and my hope is for more and more hopepunk space operas, because they’re just plain fun.  What was the journey with You Sexy Thing? What was the inspiration, how did it all start, and how did it develop?  Ann Leckie has taught a space opera class a few times for my online school, and in talking about omniscient point of view, she inspired me to try something along that vein, using an ensemble of characters rather than a single point of view.  The book was a bit of an experiment for me with a new writing process, inspired by Chris Fox’s 5,000 Words Per Hour. I am not capable of that word rate, but I found if I got up at 5:30 a.m., went and worked out while thinking about what I was going to write, and then came home and got butt in chair and writing while avoiding the Internet entirely (no email, no social media, no texts, no web browsing), I could put out a solid 5,000 words a day. I wrote the book over the course of a month, thinking that I would self-publish it and make it the first of a series. My agent, Seth Fishman, had different ideas about it, and sold it to Macmillan imprint Tor as the first title in a three-book deal, and it’s been a pretty exciting ride since then.  Did the project change in significant ways from the initial draft?  Seth suggested a major change that broke my heart and also made it a better book, but I can’t tell you what it was because it’s a bit of a spoiler. I will say that change also had a pretty major effect on the sequel and is part of the plot engine driving it.  Overall, the draft didn’t change that much. My theory is that the 5k a day method keeps me so immersed in the story that I track it better and make fewer mistakes, and it’s been my approach to the current book as well.  Back in your 2015 Clarkesworld interview, when asked about editing Fantasy Magazine you spoke about the experience “inspiring an irrational hatred of pirates . . . ” Is there an irony in the antagonist of this novel being a pirate?  That is totally by design, and you have delighted my heart by noticing it.  In the book, Niko and her crew are former military personnel who get pulled into action. What is the appeal of military characters in stories, why do we so often come back to soldiers of various kinds?  Given my surname, the narrative of the former soldier, placed in conflict with the system they’ve worked to protect, has a certain resonance. This is something I’ve spent a lot of time thinking about in the last year or so because how do we achieve peace while valorizing violence in the way that our media really seems to? This discussion is so timely—police narratives sure don’t read the same once one understands how complicit American police have been in brutalizing many groups.  Military heroes please us because one version of the stories about them is that they are often people who place the collective good over their own to the point where they are willing to give their bodies, and possibly their lives, in its service. Viewed through another lens, we can see these stories as redemption narratives, where swords are beaten into ploughshares, and those who have destroyed, now protect. Old soldiers don’t just have skills—they have the experience to know how and when and why to use them, and they know that violence may sometimes be unavoidable, but it’s usually not the best solution.  Military characters are also a great place for the story of found family, of finding a place among people who understand and value you. That’s a timely story, but also one that will never get old.  What are your favorite things about Niko and Atlanta?  They are two sides of the same coin; Atlanta is Niko at a younger age, trying to find out her place in the world. At the same time, her inexperience and naïveté let me explain things to the reader; the universe outside Pax is wide and full of new things for her. Both, though, are trying to do their best in an often-bewildering world, which is one of the most endearing things any character can do.  What was the hardest or most challenging aspect of writing this book, and how did you deal with the challenge?  The hardest part was ignoring the Internet while I wrote those daily 5k word installments, particularly at first, because I was worried I’d miss an important email. But I did learn that the world would not implode if I didn’t answer an email until the afternoon.  Focus is, I think, one of the most common problems for a writer and it does take being able to envision the end you’re trying to get to. I set a goal of 80k words and rewarded myself with something that I wouldn’t have bought for myself except as a major reward. I collect Breyer horses, and the one that represents having finished the novel is pretty sparkly, both in reality and my perception.  What is important or special about this book for you, what do you want readers to know about it, beyond blurbs and reviews?  This is the first time I’ve written a book where the characters are so alive for me that I can talk to them in my head. (When the book deal came through, they were quite excited.) I know Niko and her crew and they’re part of my life now. Book two introduces another character that I just adore, and I hope that readers love my characters as much as I do.  What else are you working on, what do you have coming up that you’d like folks to know about?  I’m finishing up Devil’s Gun, the sequel, right now and already have a (very) rough outline of the third book as well as an even rougher sketch of the overall series arc, which I tentatively have drawn out as ten books total. I love reading long-running series, and I want to create one where, by the final book, readers are beside themselves to find out how it all ends, particularly the love story.  I’m also drafting the final book of the Tabat Quartet, Gods of Tabat, and thinking that I might collect all the Tabat short stories and novelettes into one book to come out around the same time. After that, I think I’m done with Tabat for a little while, although another idea for a novel set there has been sidling up in recent months. Jenn Brozek and I also have an anthology coming out in 2022, The Reinvented Heart, which I think is the strongest anthology I’ve edited yet.  I’d like to get back and finish up a serial project, Baby Driver, for my Patreon supporters. Another book that’s in the pipeline is a middle-grade novel that I’m about to do a pretty major revision of. I’ve also got a baseball novella that I want to get finished up in the next couple of years, and a literary horror novel that is partially written and would like to be completed. So—lots of projects, all of them highly enjoyable to work on! The only real problem is getting them all done. 🙂 Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\n5,000 Words a Day: A Conversation with Cat Rambo\nGetting started in genre in the 2000s, with sales at venues including Strange Horizons, Talebones, Subterranean, and Fantasy Magazine, Cat Rambo now has published more stories than many authors will ever write.\nRambo was born in College Station, TX, and grew up in South Bend, IN, in a house that was full of books, with a family that let them read whatever they wanted. In elementary school, Rambo was reading Heinlein and Norton, hiding science fiction novels inside textbooks. Rambo attended Indiana University for a year, then took a break and worked in a bookshop, ultimately earning an English degree and a certificate in Gender Studies from the University of Notre Dame. They earned a master’s from “the second-oldest creative writing program in the United States”: Writing Seminars at Johns Hopkins University; then they began a PhD program at Indiana University, eventually pursuing a career in computer security. They worked in New York before moving to Seattle, and they worked as a manager for Microsoft.\nIn 2005 Rambo quit their job and attended the Clarion West Writers Workshop. That was the year they decided to focus on writing. In 2007 they began a four-year term as editor of Fantasy Magazine, and in 2014 became vice president of the Science Fiction and Fantasy Writers of America (SFWA). In 2015 they began their two-term run as SFWA president.\nBesides being one of the most recognizable “friendly faces” in the industry, and being a seriously prolific short fiction author with works out in most of the venues SFWA defines as professional, Rambo has also garnered a number of accolades. Rambo’s stories have appeared on Locus Recommended Reading lists since the 2000s, and they received a 2012 World Fantasy Award nomination for editing Fantasy. Other notable nods include collection Eyes Like Sky and Coal and Moonlight as a 2010 Endeavor Award nominee, “Five Ways to Fall in Love on Planet Porcelain” as a 2012 Nebula Award finalist, a 2016 Compton Crook Award nomination for their debut novel, Beasts of Tabat, and a 2020 Nebula Award win for novelette Carpe Glitter/\nRambo has lectured and taught at a variety of respected venues, including Clarion West. For more than a decade Rambo has also run their own series of classes: The Rambo Academy for Wayward Writers. Their latest novels are the third book in the Tabat series, Exiles of Tabat (WordFire Press); and You Sexy Thing (Tor).\nISFDB lists well over a hundred short stories—and is probably incomplete (your website says 200+). How did COVID-19 impact your writing processes or habits, and how did you deal with those disruptions?\nI think it’s closer to 300 now, definitely if we’re counting Patreon stuff and/or reprints! It helps that I’ve primarily been a short story writer, which makes the fact that I’ve got not one but two novels coming out in 2021 a little extra weird. There should be another two in 2022 if I stay on target.\nCOVID’s isolation, paradoxically, ended up keeping me productive by connecting me more deeply to other writers on a day-to-day basis. I used the Discord channel associated with my Patreon to create a community where we set up multiple daily coworking sessions as well as social events, like a group to discuss classic science fiction stories, or a “clean and chat” where we meet and clean our working spaces while talking about our lives. Those sessions kept—and continue to keep—me going, but 2020 was definitely a year where it was often hard to get started.\nAt those times, I had to remind myself, more than once, that in 2020, just existing was a victory. In this perilous and interesting era, staying buoyant is sometimes hard to achieve. Turning to my online community was a move that kept me from stagnating. I finished a number of stories as well as a novel in 2020—but I couldn’t have done it without my community.\nLooking at your years of writing, were there times when you struggled to be productive, when you couldn’t sell work, or when you weren’t sure about writing as a career?\nI came to F&SF writing a little later in life than a lot of my fellow writers, which means I’ve had a chance to witness how unpredictable life can be and how much luck can affect one’s existence. I think that gives me a better perspective on what success is—to me if I’m writing and happy about what I’m writing, that’s a successful day. And my superpower is my sense of humor—if you can laugh at a punch, it’s going to affect you a lot less.\nAs a full-time writer/teacher, I have the luck to be able to focus on writing rather than working at a day job, but it’s also an obligation. When you’re your own boss, it’s easy to be a lot harder on yourself than any boss could be.\nBut yeah—there’s always those moments where one wakes in the middle of the night, thinking “How did I get here and what the hell am I doing?” But I suspect they’re there no matter what field you’re in. If you can’t sleep at all, maybe you get up and do something. And you always know the next day will come and there will probably be some other moments in it that will be pretty enjoyable. That’s what keeps me going.\nFor people who haven’t read your short fiction, if they were to look at one or two of your pieces, which would want them to look at, and why?\nI have a lot of different flavors of fiction! A few that I am particularly proud of are “Red in Tooth and Cog” (near future SF, appeared in The Magazine of Fantasy and Science Fiction), “Clockwork Fairies” (steampunk), and “Magnificent Pigs” (fantasy, Strange Horizons). I was lucky enough to have LeVar Burton read the last of those on his podcast, which was a huge thrill.\nI do keep a page on my website that includes links to everything that’s available. Two favorite stories from this year are “Crazy Beautiful” (near future SF, appeared in The Magazine of Fantasy and Science Fiction) and “Every Breath a Question, Every Heartbeat an Answer” (fantasy novelette, appeared in Beneath Ceaseless Skies).\nYour debut novel was Beasts of Tabat, published with WordFire Press in 2015, which saw two sequels: Hearts of Tabat and Exiles of Tabat. What were some of the things you learned, in the process of writing and publishing these books, that went into You Sexy Thing?\nOne major thing that I’ve had to learn is how to revise. I hate editing my own work and finding out how to grapple with a manuscript despite that feeling of mingled loathing and terror has been invaluable. By now I’ve got a road map in my head of what the stages look like. I know, for example, that the draft of the sequel that I’m working on will be done at the end of the month and enter the next stage, where it gets put aside for a bit before I come back and begin the first edit, and I know what to look for in that first edit in order to do things as efficiently and effectively as possible.\nAnother thing I’ve learned over time is working with points of view. Beasts of Tabat originally was something like six or seven points of view, which ended up getting pared down to two. You Sexy Thing was my answer to Ann Leckie’s saying she’d love to see a space opera in omniscient point of view, and I am pretty sure that would have been a total nightmare if I hadn’t been used to sorting out plot threads according to which character(s) they’re attached to.\nBut most importantly, the earlier novels have taught me to trust myself, to know that I can turn ideas into a (sometimes incoherent) draft, and that I’ll be able to take that and make something worthwhile. Writing depends greatly on being able to trust yourself, and by now I’ve done it enough to know that I can face a blank page and fill it in a way that pleases me.\nWhere the Tabat books are fantasy, You Sexy Thing is marketed as space opera. What, for you, are the hallmarks of excellent space opera?\nI love space opera! For me, excellent space opera involves an enthralling, surprising, engaging cast of characters, plenty of action and twists and eyeball kicks, and universe-spanning plotlines.\nThere’s a Brian Aldiss quote I ran across at one point, talking about space opera and its sense of fun: “What space opera does is take a few lightyears and a pinch of reality and inflate thoroughly with melodrama, dreams, and a seasoning of screwy ideas.” So lots of sense of wonder—but also plenty of people stuff getting enacted in front of that backdrop.\nYou Sexy Thing also wanders into the realm of hopepunk, and my hope is for more and more hopepunk space operas, because they’re just plain fun.\nWhat was the journey with You Sexy Thing? What was the inspiration, how did it all start, and how did it develop?\nAnn Leckie has taught a space opera class a few times for my online school, and in talking about omniscient point of view, she inspired me to try something along that vein, using an ensemble of characters rather than a single point of view.\nThe book was a bit of an experiment for me with a new writing process, inspired by Chris Fox’s 5,000 Words Per Hour. I am not capable of that word rate, but I found if I got up at 5:30 a.m., went and worked out while thinking about what I was going to write, and then came home and got butt in chair and writing while avoiding the Internet entirely (no email, no social media, no texts, no web browsing), I could put out a solid 5,000 words a day. I wrote the book over the course of a month, thinking that I would self-publish it and make it the first of a series. My agent, Seth Fishman, had different ideas about it, and sold it to Macmillan imprint Tor as the first title in a three-book deal, and it’s been a pretty exciting ride since then.\nDid the project change in significant ways from the initial draft?\nSeth suggested a major change that broke my heart and also made it a better book, but I can’t tell you what it was because it’s a bit of a spoiler. I will say that change also had a pretty major effect on the sequel and is part of the plot engine driving it.\nOverall, the draft didn’t change that much. My theory is that the 5k a day method keeps me so immersed in the story that I track it better and make fewer mistakes, and it’s been my approach to the current book as well.\nBack in your 2015 Clarkesworld interview, when asked about editing Fantasy Magazine you spoke about the experience “inspiring an irrational hatred of pirates . . . ” Is there an irony in the antagonist of this novel being a pirate?\nThat is totally by design, and you have delighted my heart by noticing it.\nIn the book, Niko and her crew are former military personnel who get pulled into action. What is the appeal of military characters in stories, why do we so often come back to soldiers of various kinds?\nGiven my surname, the narrative of the former soldier, placed in conflict with the system they’ve worked to protect, has a certain resonance. This is something I’ve spent a lot of time thinking about in the last year or so because how do we achieve peace while valorizing violence in the way that our media really seems to? This discussion is so timely—police narratives sure don’t read the same once one understands how complicit American police have been in brutalizing many groups.\nMilitary heroes please us because one version of the stories about them is that they are often people who place the collective good over their own to the point where they are willing to give their bodies, and possibly their lives, in its service. Viewed through another lens, we can see these stories as redemption narratives, where swords are beaten into ploughshares, and those who have destroyed, now protect. Old soldiers don’t just have skills—they have the experience to know how and when and why to use them, and they know that violence may sometimes be unavoidable, but it’s usually not the best solution.\nMilitary characters are also a great place for the story of found family, of finding a place among people who understand and value you. That’s a timely story, but also one that will never get old.\nWhat are your favorite things about Niko and Atlanta?\nThey are two sides of the same coin; Atlanta is Niko at a younger age, trying to find out her place in the world. At the same time, her inexperience and naïveté let me explain things to the reader; the universe outside Pax is wide and full of new things for her. Both, though, are trying to do their best in an often-bewildering world, which is one of the most endearing things any character can do.\nWhat was the hardest or most challenging aspect of writing this book, and how did you deal with the challenge?\nThe hardest part was ignoring the Internet while I wrote those daily 5k word installments, particularly at first, because I was worried I’d miss an important email. But I did learn that the world would not implode if I didn’t answer an email until the afternoon.\nFocus is, I think, one of the most common problems for a writer and it does take being able to envision the end you’re trying to get to. I set a goal of 80k words and rewarded myself with something that I wouldn’t have bought for myself except as a major reward. I collect Breyer horses, and the one that represents having finished the novel is pretty sparkly, both in reality and my perception.\nWhat is important or special about this book for you, what do you want readers to know about it, beyond blurbs and reviews?\nThis is the first time I’ve written a book where the characters are so alive for me that I can talk to them in my head. (When the book deal came through, they were quite excited.) I know Niko and her crew and they’re part of my life now. Book two introduces another character that I just adore, and I hope that readers love my characters as much as I do.\nWhat else are you working on, what do you have coming up that you’d like folks to know about?\nI’m finishing up Devil’s Gun, the sequel, right now and already have a (very) rough outline of the third book as well as an even rougher sketch of the overall series arc, which I tentatively have drawn out as ten books total. I love reading long-running series, and I want to create one where, by the final book, readers are beside themselves to find out how it all ends, particularly the love story.\nI’m also drafting the final book of the Tabat Quartet, Gods of Tabat, and thinking that I might collect all the Tabat short stories and novelettes into one book to come out around the same time. After that, I think I’m done with Tabat for a little while, although another idea for a novel set there has been sidling up in recent months. Jenn Brozek and I also have an anthology coming out in 2022, The Reinvented Heart, which I think is the strongest anthology I’ve edited yet.\nI’d like to get back and finish up a serial project, Baby Driver, for my Patreon supporters. Another book that’s in the pipeline is a middle-grade novel that I’m about to do a pretty major revision of. I’ve also got a baseball novella that I want to get finished up in the next couple of years, and a literary horror novel that is partially written and would like to be completed. So—lots of projects, all of them highly enjoyable to work on! The only real problem is getting them all done. 🙂\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/rambo_interview_2021/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: 5,000 Words a Day: A Conversation with Cat Rambo by Arley Sorg"}