{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Karen Heuler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "lRiD/Hbh2Mw5Qnk4PPsEId5LshA=", "id": null, "license": null, "comments": "", "raw_text": "4240 words, short story  Egg Island  Audra Donchell’s right arm was 3D-printed; she’d lost the original in a scooter crash when she was a teenager. That was years ago; she had a number of arms she could take off and put on; she could remodel them and change their color. A different color for every day.  All the parts worked smoothly; all she had to do was think—or not think, simply imagine—and her arm moved and bent, her fingers picked and pinched and tapped. There was a certain distance to it, but she had finally adapted to the slight sensation of objectivity that had been her original experience with it. The other great thing about her 3D arm was that it could hold heavy objects, like her suitcase, for longer times than her other, natural, arm could.  Carrying her case effortlessly, she took the supertube to the heliport, then took the copter to the helipad that used to be an oil platform. There was a party there—teenagers, how tiresome—so she took a glider to Stepoff Point, the last bit of land before the ocean.  Her destination was a small spot on the planet where the natural evolution of plastic was taking place. She was interested in plastics and she was interested in this development; she thought (as many did) that plastics had in many ways shaped the present and would save the future. She was nearing thirty and it was time to think of how she could contribute to life; she might get a clue from this visit.  The skimmer from the Stepoff Point took over four hours to get to Sister Island and on its way passed four other floating islands, reclaimed and now habitable. She saw one that seemed to be connected pieces. “That island over there,” she said to the pilot, pointing. Pilot was, of course, a useless term. The skimmer was on auto, but the unions demanded qualified help in case of emergencies. “Is that a reclaimed island?”  “Not yet,” he said. He was middle-aged and pale (good sunscreen implants), with sinewy arms and a half-smile, half-frown combination that was charming. “It’s still just garbage.”  She studied it with interest. Garbage had been outlawed, of course, but garbage still existed, washing down off mountains, washing out from waste piles disturbed by weather or earthquakes or construction projects, or coming up again after ocean dumping. She saw plastic bags and buoys and fishing nets and plastic cups and bottles and wrappers of various kinds. They floated along together.  The pilot leaned towards her. “I’ve made islands,” he said. “I spent years making islands. The place we’re going to—I worked there. There were a bunch of us, volunteers, young kids, full of the thrill. We wove the plastics together. We caught the bags and cups and straws and toothbrushes, and we made them into the islands.”  “The islands are great,” she said. She wanted to make a good impression, so she was very enthusiastic. “I’ve always been fascinated. I put in a request over a year ago for it—you know, the event. On Egg Island.”  The pilot looked at her for a moment. “I made Egg Island. Not me alone, of course. But the islands—I made the islands.”  She was quiet for a few minutes, out of awe and a sense of embarrassment. The skimmer roared over the water. They passed vast clumps of Sargasso. A few flying fish raced them, then veered off.  “You made Egg Island,” she said finally. She felt close to tears and tapped the back of her hand to give herself just a drop of endorphins. “Tell me about it. I’ve been longing to go to Egg Island ever since I first heard of it.”  He nodded and they introduced themselves. His name was Wen Wickler. The skimmer thrummed, even creating some kind of wind, despite the fact that they were entering the doldrums, that place far out in the ocean where all the winds died and all the garbage gathered.  “I was 30 when I came out here,” Wen said. “I was burning with the need to heal the earth. I had watched my mother’s farm blow away with the drought. You weren’t born yet, but my generation faced it all: too little clean water, soil that had been poisoned by pesticides, animal extinctions. And garbage, garbage everywhere. We had filled in every nook and cranny, it seemed, and it leached out and got into the water tables. Too much of what we lived in was dirty and dangerous. We looked to the seas.  “The first volunteers got some backing by some big polluters who had to do it by law, and we took trawlers to the ocean and began to pick up all the floating plastics. We did that for a few years, but the garbage went on for miles. And where were we supposed to put the plastics? We talked about it and it seemed reasonable, eventually, to go with what was already happening. It was collecting in patches, in islands of its own, all the plastics, the lost stuff, the things from tsunamis and from ocean dumping, the lost things and the forgotten things, just drifting out to the doldrums and bumping into one another.  “We trawled and gathered and sorted. Lots of plastic ropes to tie things together. Nets to tie things together. Cups to be part of the ‘earth’ of the island. We sifted and netted and wove and strung together. It took months, years; we weathered it and built a spongy sort of island and then built shacks on it from boogie boards and construction debris that floated out from the disasters occurring everywhere. We took dolls and toys and made little sceneries; we took buckets and plastic bottles and began to collect rainwater (not much) and began to make evaporation coils to make drinking water from the sea. We set up small farms in plastic bins, and began to tie seaweed to the shores of our islands. We kept weaving into it, pushing down the cups and plastic shoes and child’s shovels and whatever we found, weaving it deeper and deeper and spreading it out. Islands. We made islands.” He stopped and shook his head.  “I’m so impressed,” she said. “We learned about that in school. I always dreamed of being like you someday.” She made a modest sound. “I kind of forgot that, though. I went into industrial plastics, after my accident.” She shrugged, lifting her 3D arm a bit. “I got waylaid. My generation—all we know is plastics. Your generation—you saw things, didn’t you? Surprising things?”  “We saw the changes start,” he said huskily. The boat bobbed forward. Out in the distance, she could see the first of the islands. She wanted it all to slow down; she wanted to hear what he had to say. All of this was magic, was storytime; the first plastic islands, the change. The change over. The first sightings.  “I wanted to see the eggs,” she said finally. Her voice was soft; she didn’t want to seem egotistical, to gather importance from her desire. Because in front of her, here was someone who had probably been one of the ones who figured out what was happening. He was heraldic.  He pushed a button on the dashboard of the boat. She had no doubt it was, strictly speaking, unnecessary. The skimmer could do it all by itself. He was insignificant now. One of the people who had discovered the eggs, now a token pilot on a ship that didn’t need him.  “I took some classes after the farm failed. I thought at first it was just a question of learning what to do. That we could fix it,” he said. “I didn’t realize how much there was to fix. We knew the waters were rising, we saw that the shore was disappearing. But I was inland. I was landlocked. Of course there were water restrictions, even there. But one year snow geese fell from the sky and convinced me that I had to do something. I ended up here. I knew nothing about this.” He shrugged. “But I could listen and I could work. We had discussions all the time, how to proceed, what made most sense.”  “I heard there are eels on Sister Island now,” she said. “Birds come sometimes.”  He nodded. “The jellyfish are the real indicator. They’re easy to catch and study. Microfibers are everywhere, you know, but they’re hard to spot and the earliest teams didn’t have microscopes. But we could see the small plastic beads—Styrofoam and microbeads, breakdowns of the soft plastics—under the hoods of the jellyfish, even along the arms and tentacles. From what we could see, doing no harm.”  She looked at her own arm and flexed it. “I’ve read there are jellyfish bigger than whales.”  He laughed. “Haven’t seen that. Not here, anyway. Things are relatively predictable here.”  “What was the first thing you saw that gave you a clue?” Audra asked.  He squinted slightly. “We caught fish to eat, of course. And we saw the plastic pieces. We couldn’t see the microplastics, as I said. But a piece of plastic line; a plastic wheel off a small toy—things like that. A few of the fish were damaged, but there were others that seemed to incorporate the stuff without harm. Those were interesting.” He grinned.  Audra sighed. “I wish I’d been there. I mean, what an experience! I can’t wait to see the island. I hear there’s a research center. I know it’s just a shack, but it’s still amazing to me that people live there. They made it work.”  “Well, we all made it work,” he agreed.  “Oh yes, of course, sorry.” When he didn’t continue, she said, “Are you here for the laying?”  He nodded.  “I suspect I only got permission because of my arm,” she said and flexed it.  He looked impressed. “That must be handy,” he said. “I suppose you can control it to the nth degree?”  She grinned. “To the nth,” she said.  By now they were close to Sister Island. Brother Island could be seen in the distance, still a few days away, floating with the faint currents or what little wind there was. Egg Island was smaller and therefore harder to observe over distances, but the currents were predictable enough.  She saw a figure waiting by the slip. “That must be Johncy,” she said and waved with her true arm. She caught Wen noticing that. “Emotions seem to go out my natural arm. Always have, always will.”  “Of course. It’s called appropriate use. The organism finds its job. It adapts. We’re thankful for that. It’s what might save us.” He smiled. “And it doesn’t seem to hurt, does it? The plastic?”  “No.”  He watched the shoreline intently. “After all this time, after all the harm, plastics might be a solution. It’s a strange thing for my generation to think about.”  He stood leaning against the controls, tapping one absent-mindedly, slightly weathered and not entirely used to having the world surprise him. Her 3D arm had been an improvement in her life and had been offered to her soon after her accident. It was common enough by then. But she believed she understood what he meant. “Bodies accept almost everything, don’t they?” she said finally.  They landed at what passed for a pier—a projection of plastic gas tanks roped together to make a sort of fork jabbing into the sea. Wen steered in while Audra studied the geography. The main structure on the island was made of a series of cabins or rooms, lightly constructed of all kinds of materials. There was a plastic picnic table outside and molded plastic chairs. Wen handed up their bags and four large black duffel bags. “The gear,” he said to Johncy, who grabbed the bags as Wen handed them up. Then Johncy reached a hand out and grabbed her, and steadied her as she stepped on the island.  She turned to him and saw he had one brown eye and one clear eye.  “My god!” She couldn’t help herself. “I’ve never seen a plastic eye before. I thought my arm was special.” She laughed. “I’m sure it takes a lot more refinement to make an eye.”  Johncy smiled and nodded. “I was only the second to have one; the first was a monkey. One who’d lost her eye from a disease; don’t worry, it wasn’t tortured. It lived for a few more years, till the monkey fungus got it. But I got this eye.” He held a hand out to help Wen up. “Wen, good to see you. It wouldn’t be the same without you.” He turned to Audra. “You know he discovered the turtles, don’t you?”  “He didn’t exactly say.”  “Too modest. Or too secretive?” He laughed. “He always insisted that only plastics get told about the turtles and this island. We’re very protective.”  She turned to consider Wen. “You’re plastic too?”  “My heart,” he said easily. “If you lean in real close you’ll hear a different sound, more like a shush than a normal heart. It’s been running for about five years now. We don’t have a good idea about stress factors on plastic when it’s internal. One of the reasons Egg Island is kind of an obsession with me.”  A young woman came paddling up in a plastic kayak and pulled into the other tine of the fork. “Egg is coming along,” she said, clearly delighted. “I think it will be early this year. It’s right behind Brother and to the east.”  “It’s good you came when you did,” Wen told Audra. “I wasn’t going to come ‘till tomorrow. I might have missed the sight of it. I love watching it arrive.”  The woman’s name was Kit, and she, along with Johncy and Michael, showed Audra around. They walked on the rippling island with absolute assurance, explained how they placed plastic straws and coils to reclaim water, how they dried seaweed in racks and baked it in solar ovens into a kind of bread. A modest vertical garden grew herbs, tomatoes, and beans.  “I brought extra water,” Wen said. “And some groceries. And eggs, of course,” he said, winking. That brought a round of applause and laughs from the staff.  The island was almost a quarter-mile around, so its motion was relatively minor, but it made her dizzy. They promised her she would get her balance by morning.  Water splashed a little during the night, and occasionally a fish would flip out of water, or something would fall off the island. Once she heard voices offshore, so she supposed that the staff went for swims, and that must mean that the oil slicks had moved off for a while. Or they accepted being covered in oil. Or there was another alternative she knew nothing about. She slept.  She did have her sea legs the next morning, rolling a little as she walked over the woven plastics, watching her step, but no longer in any way queasy. They grabbed plates and cups of coffee (also Wen’s gift) and sat staring out to the east.  “I think,” Michael said, and stopped. Everyone seemed to freeze, cups or forks in hand, just looking. They held a collective breath.  “Yes,” Wen said. “Yes. That’s Egg all right.”  They stood up. They stared at the island, watching it slap gently through the waves, pushed by a twist in the current, by the merest suggestion of wind. Audra thought it seemed to be aware of them, to be heading for them deliberately, even though she knew of course that the island itself was passive. Still, she was filled with expectation; they all were tense with anticipation, pulling out cameras and logbooks and charts from previous years.  Audra stayed by Wen’s side. “When will it happen? Is it always at night?”  “So far,” he said. “How long is ‘always’ under these circumstances? It’s been eleven years now, and I was the first to see it. Among the first, technically, I suppose. But I saw it, shook my head to clear it, saw it, and called the others. A wonderful thing.”  “Will the island be here tonight, then?”  He shook his head. “Probably not. But tomorrow, yes, I think so.”  She spent the day doing the chores she’d been assigned, which included watering the garden. The reclamation straws dripped slowly, and she had to be careful to replace any bucket she took with another bucket immediately; not one drop of water could be lost. The plants poked up through plastic tarps, so that the soil would hold the water as long as possible. The tarps were lifted an hour a day to avoid mold or fungus in the soil. This was done by hand; they stood around, tarps lifted, holding corners or centers, chatting about the next things to do or any topic that came up.  “Does your arm ever bother you?” Michael asked her.  She looked down at it; it had become familiar, it had become a part of her. “No,” she said. “Not at all. It’s part of me now.”  He smiled. “I have a leg,” he said. “Works perfectly, too.”  The others nodded. They each had a replacement part. “I sometimes forget about it,” she said. “Though it can do more, lift more, have more force, than my original arm. So I think I’ve been improved.” She grinned.  They told their stories, one by one, what they lost and how they had gained a replacement. “To think,” Wen said, “how much damage we’ve done with plastic; how much we’ve destroyed. And how plastic might turn around and save us, in return.”  “We’ve lost a lot; I won’t deny we’ve lost a lot. It was a hard lesson. The world is changed,” Michael said.  “The world is always changing,” Wen said. “We just have to find a direction for it.”  “Oh, I don’t know,” Audra said, laughing, “it seems to have found its direction on its own.”  They contemplated that for a while, gazing off to Egg Island as the sun set, wishing for the morning.  And in the morning it was there, a few hundred yards away, a faint new slap of water hitting plastics. Egg Island was a looser island than Sister Island, and there would only be a day or so to weave plastic ropes into it, to maintain some kind of integrity to it as they went forward. Some swam over, dragging ropes and nets behind them; some paddled over on foam boards. They pushed aside the plastic eggs, looking like mottled Easter eggs that lay strewn over the surface. They pushed some down into the matted debris, and used the coils of ropes and plastic bags they’d brought over from Sister Island to sew the island together. They walked carefully, but even so they had to rescue each other from patches where their legs went through. It was safer to kneel and inch their way around, patting and tucking, pushing ropes down and through and up again.  They worked quickly and efficiently, patch by patch, tightening the island so it would maintain integrity, aware that the island would only be here briefly. “This part needs help,” someone would call out, and one or two people would nod and kneel their way across to that section, pulling pieces together, working like weavers on a giant, watery loom.  The island landed up against their own island, and they took a break, went home, ate quickly, and went back to work. One particularly bad section required a ladder laid flat on it to hold their weight as they worked to restore it. On the far side, a wide fish net with ballast had been caught and dragged along; they hoisted it up and wove it in. A hairnet, Audra thought briefly and then tied her section into the mass of the island.  They worked for two days that way, barely speaking, pushing in lines and pulling them out, sewing the island, tugging at it, patting it and pushing it.  Egg Island was still moving even as it rested against Sister Island; it had its own volition, its own imperative to move, move, move on.  “Soon,” Johncy said. “I think tomorrow,” and they nodded, exhausted, and slept without further discussion. The constant work had tamped down their sense of anticipation, but now it rose again and even as exhaustion overtook them, they slept fitfully, waiting for dawn.  The island was now just touching on the east end of Sister Island; it had shifted slightly all night long, touching and moving the length of Sister Island. They could feel the tactile way the two islands met, a handshake, a rub on the shoulder, the smallest, most basic communion. Not that anyone believed the islands were alive. They were part of a new order, however. The earth was ingesting the plastics and mixing the plastics and finding a new use for them. The unnatural was becoming the natural. The order was changing and it hardly mattered whether it was for better or for worse.  And in the midst of all the change, strange new beauties occurred.  They worked all day and kept vigil when the dark fell and the moon rose. They sat and murmured on their own moving island, talking of nothing important. Things they’d seen, books they’d read, odd places they’d been. But their conversations only lasted a few minutes and they would pause and listen. Their ears played tricks on them; their eyes saw shapes that turned out to be yet another plastic bag, with trapped air bubbles, a child’s toy, a piece of Styrofoam, all things that they gathered and saved. “If you see a plastic arm wash by,” Audra said, “please save it for me!”  “Or a leg!” Michael cried.  “I think a plastic eye would be hard to spot,” Johncy said.  And then the first sea turtle appeared, breaking out of the water, its reptile head prehistoric and determined. On Sister Island, the people stiffened and pointed and got to their feet and stepped over onto Egg Island, now close to detaching itself from Sister Island. The turtle dragged itself up Egg Island slowly, thick flippers pushing against discarded flashlights and computer keyboards and the tarps and pails of the island, its shell toughened and knobbed with small pieces of plastics. And then another and another, all huge and gnarled, and they moved across the discarded plastics that had been thrown into the sea and had grown into the sea. One by one they inched their way forward, their backs stippled with plastics that had latched onto their animal bodies, seamless and as irreproachable as Audra’s arm, as Wen’s heart. It was a selective turn in the usefulness of flesh, in the utility of plastic. Omnipresent now, polluting what had formerly been pristine, pierced by the shoot, the claw, the plow, plastics had threaded their ways back into life.  The turtles selected their space and shifted, pushing their great bodies back and forth, having found the spot where they would lay their eggs, which had gathered bits of microbeads in the process of forming. The eggshells had once been smooth; they now had a granular quality to them, like sand in paint. Was it an evolutionary device, making them unpalatable to predators? The turtles’ massive heads looked straight ahead, mouths slightly open from their efforts. These mouths ended in sharp beaks, and their infants would only emerge when their own beaks were strong enough to pierce the mix of plastic and calcium housing them.  Audra leaned delicately from where she stood on the edge of Sister Island and patted the head of a turtle that had chosen a spot near her. She patted it with her 3D arm. She felt the turtle’s damp knobby head, then let her hand move down to its carapace. The leatherback’s shell was not as hard as other turtles’. It had bony plates beneath the skin on its back, and Audra could feel irregularities on the plates, a feel of edges and lines that felt, to her delicate 3D fingers, familiar; related. Bits and pieces of plastics had worked through the turtle’s skin to the plates below. The turtles, the eggshells, her arm, Wen’s heart: all connected, all synchronous.  The whole event was over in less than an hour. The eggs were laid, the turtles covered them with any loose debris so that they would remain hidden among the other types of plastic overlaying and underlaying the island. They heaved themselves around and used their massive flippers to drive themselves forward, until finally they slipped back into the ocean. Heads could be seen leaving steadily away from the island, and then the heads dipped silently, one by one, and were gone.  The moon was setting, running a light on the ocean. A few oil slicks picked up muted rainbow colors and the merest movements of the waves broke the colors up like a sophisticated painting. A single turtle head surfaced and disappeared again.  “I want to live here forever,” Audra thought, picking idly at the garbage closest to her. It seemed her arm, the 3D arm, was intent on sifting and sorting.  Egg Island pulled away slowly, like a lumbering train obeying strict laws. It wavered and washed in the setting moon’s last luminous light.  On Sister Island, they joined hands and rejoiced at the beauty of the world.  Karen Heuler's stories appear in literary, fantasy, and science fiction magazines regularly and have won various awards, including an O. Henry. Her 2014 novel, Glorious Plague, was about a strangely beautiful apocalypse, and her second story collection, The Inner City, was chosen as one of the best books of 2013 by Publishers Weekly.", "text": "4240 words, short story\nEgg Island\nAudra Donchell’s right arm was 3D-printed; she’d lost the original in a scooter crash when she was a teenager. That was years ago; she had a number of arms she could take off and put on; she could remodel them and change their color. A different color for every day.\nAll the parts worked smoothly; all she had to do was think—or not think, simply imagine—and her arm moved and bent, her fingers picked and pinched and tapped. There was a certain distance to it, but she had finally adapted to the slight sensation of objectivity that had been her original experience with it. The other great thing about her 3D arm was that it could hold heavy objects, like her suitcase, for longer times than her other, natural, arm could.\nCarrying her case effortlessly, she took the supertube to the heliport, then took the copter to the helipad that used to be an oil platform. There was a party there—teenagers, how tiresome—so she took a glider to Stepoff Point, the last bit of land before the ocean.\nHer destination was a small spot on the planet where the natural evolution of plastic was taking place. She was interested in plastics and she was interested in this development; she thought (as many did) that plastics had in many ways shaped the present and would save the future. She was nearing thirty and it was time to think of how she could contribute to life; she might get a clue from this visit.\nThe skimmer from the Stepoff Point took over four hours to get to Sister Island and on its way passed four other floating islands, reclaimed and now habitable. She saw one that seemed to be connected pieces. “That island over there,” she said to the pilot, pointing. Pilot was, of course, a useless term. The skimmer was on auto, but the unions demanded qualified help in case of emergencies. “Is that a reclaimed island?”\n“Not yet,” he said. He was middle-aged and pale (good sunscreen implants), with sinewy arms and a half-smile, half-frown combination that was charming. “It’s still just garbage.”\nShe studied it with interest. Garbage had been outlawed, of course, but garbage still existed, washing down off mountains, washing out from waste piles disturbed by weather or earthquakes or construction projects, or coming up again after ocean dumping. She saw plastic bags and buoys and fishing nets and plastic cups and bottles and wrappers of various kinds. They floated along together.\nThe pilot leaned towards her. “I’ve made islands,” he said. “I spent years making islands. The place we’re going to—I worked there. There were a bunch of us, volunteers, young kids, full of the thrill. We wove the plastics together. We caught the bags and cups and straws and toothbrushes, and we made them into the islands.”\n“The islands are great,” she said. She wanted to make a good impression, so she was very enthusiastic. “I’ve always been fascinated. I put in a request over a year ago for it—you know, the event. On Egg Island.”\nThe pilot looked at her for a moment. “I made Egg Island. Not me alone, of course. But the islands—I made the islands.”\nShe was quiet for a few minutes, out of awe and a sense of embarrassment. The skimmer roared over the water. They passed vast clumps of Sargasso. A few flying fish raced them, then veered off.\n“You made Egg Island,” she said finally. She felt close to tears and tapped the back of her hand to give herself just a drop of endorphins. “Tell me about it. I’ve been longing to go to Egg Island ever since I first heard of it.”\nHe nodded and they introduced themselves. His name was Wen Wickler. The skimmer thrummed, even creating some kind of wind, despite the fact that they were entering the doldrums, that place far out in the ocean where all the winds died and all the garbage gathered.\n“I was 30 when I came out here,” Wen said. “I was burning with the need to heal the earth. I had watched my mother’s farm blow away with the drought. You weren’t born yet, but my generation faced it all: too little clean water, soil that had been poisoned by pesticides, animal extinctions. And garbage, garbage everywhere. We had filled in every nook and cranny, it seemed, and it leached out and got into the water tables. Too much of what we lived in was dirty and dangerous. We looked to the seas.\n“The first volunteers got some backing by some big polluters who had to do it by law, and we took trawlers to the ocean and began to pick up all the floating plastics. We did that for a few years, but the garbage went on for miles. And where were we supposed to put the plastics? We talked about it and it seemed reasonable, eventually, to go with what was already happening. It was collecting in patches, in islands of its own, all the plastics, the lost stuff, the things from tsunamis and from ocean dumping, the lost things and the forgotten things, just drifting out to the doldrums and bumping into one another.\n“We trawled and gathered and sorted. Lots of plastic ropes to tie things together. Nets to tie things together. Cups to be part of the ‘earth’ of the island. We sifted and netted and wove and strung together. It took months, years; we weathered it and built a spongy sort of island and then built shacks on it from boogie boards and construction debris that floated out from the disasters occurring everywhere. We took dolls and toys and made little sceneries; we took buckets and plastic bottles and began to collect rainwater (not much) and began to make evaporation coils to make drinking water from the sea. We set up small farms in plastic bins, and began to tie seaweed to the shores of our islands. We kept weaving into it, pushing down the cups and plastic shoes and child’s shovels and whatever we found, weaving it deeper and deeper and spreading it out. Islands. We made islands.” He stopped and shook his head.\n“I’m so impressed,” she said. “We learned about that in school. I always dreamed of being like you someday.” She made a modest sound. “I kind of forgot that, though. I went into industrial plastics, after my accident.” She shrugged, lifting her 3D arm a bit. “I got waylaid. My generation—all we know is plastics. Your generation—you saw things, didn’t you? Surprising things?”\n“We saw the changes start,” he said huskily. The boat bobbed forward. Out in the distance, she could see the first of the islands. She wanted it all to slow down; she wanted to hear what he had to say. All of this was magic, was storytime; the first plastic islands, the change. The change over. The first sightings.\n“I wanted to see the eggs,” she said finally. Her voice was soft; she didn’t want to seem egotistical, to gather importance from her desire. Because in front of her, here was someone who had probably been one of the ones who figured out what was happening. He was heraldic.\nHe pushed a button on the dashboard of the boat. She had no doubt it was, strictly speaking, unnecessary. The skimmer could do it all by itself. He was insignificant now. One of the people who had discovered the eggs, now a token pilot on a ship that didn’t need him.\n“I took some classes after the farm failed. I thought at first it was just a question of learning what to do. That we could fix it,” he said. “I didn’t realize how much there was to fix. We knew the waters were rising, we saw that the shore was disappearing. But I was inland. I was landlocked. Of course there were water restrictions, even there. But one year snow geese fell from the sky and convinced me that I had to do something. I ended up here. I knew nothing about this.” He shrugged. “But I could listen and I could work. We had discussions all the time, how to proceed, what made most sense.”\n“I heard there are eels on Sister Island now,” she said. “Birds come sometimes.”\nHe nodded. “The jellyfish are the real indicator. They’re easy to catch and study. Microfibers are everywhere, you know, but they’re hard to spot and the earliest teams didn’t have microscopes. But we could see the small plastic beads—Styrofoam and microbeads, breakdowns of the soft plastics—under the hoods of the jellyfish, even along the arms and tentacles. From what we could see, doing no harm.”\nShe looked at her own arm and flexed it. “I’ve read there are jellyfish bigger than whales.”\nHe laughed. “Haven’t seen that. Not here, anyway. Things are relatively predictable here.”\n“What was the first thing you saw that gave you a clue?” Audra asked.\nHe squinted slightly. “We caught fish to eat, of course. And we saw the plastic pieces. We couldn’t see the microplastics, as I said. But a piece of plastic line; a plastic wheel off a small toy—things like that. A few of the fish were damaged, but there were others that seemed to incorporate the stuff without harm. Those were interesting.” He grinned.\nAudra sighed. “I wish I’d been there. I mean, what an experience! I can’t wait to see the island. I hear there’s a research center. I know it’s just a shack, but it’s still amazing to me that people live there. They made it work.”\n“Well, we all made it work,” he agreed.\n“Oh yes, of course, sorry.” When he didn’t continue, she said, “Are you here for the laying?”\nHe nodded.\n“I suspect I only got permission because of my arm,” she said and flexed it.\nHe looked impressed. “That must be handy,” he said. “I suppose you can control it to the nth degree?”\nShe grinned. “To the nth,” she said.\nBy now they were close to Sister Island. Brother Island could be seen in the distance, still a few days away, floating with the faint currents or what little wind there was. Egg Island was smaller and therefore harder to observe over distances, but the currents were predictable enough.\nShe saw a figure waiting by the slip. “That must be Johncy,” she said and waved with her true arm. She caught Wen noticing that. “Emotions seem to go out my natural arm. Always have, always will.”\n“Of course. It’s called appropriate use. The organism finds its job. It adapts. We’re thankful for that. It’s what might save us.” He smiled. “And it doesn’t seem to hurt, does it? The plastic?”\n“No.”\nHe watched the shoreline intently. “After all this time, after all the harm, plastics might be a solution. It’s a strange thing for my generation to think about.”\nHe stood leaning against the controls, tapping one absent-mindedly, slightly weathered and not entirely used to having the world surprise him. Her 3D arm had been an improvement in her life and had been offered to her soon after her accident. It was common enough by then. But she believed she understood what he meant. “Bodies accept almost everything, don’t they?” she said finally.\nThey landed at what passed for a pier—a projection of plastic gas tanks roped together to make a sort of fork jabbing into the sea. Wen steered in while Audra studied the geography. The main structure on the island was made of a series of cabins or rooms, lightly constructed of all kinds of materials. There was a plastic picnic table outside and molded plastic chairs. Wen handed up their bags and four large black duffel bags. “The gear,” he said to Johncy, who grabbed the bags as Wen handed them up. Then Johncy reached a hand out and grabbed her, and steadied her as she stepped on the island.\nShe turned to him and saw he had one brown eye and one clear eye.\n“My god!” She couldn’t help herself. “I’ve never seen a plastic eye before. I thought my arm was special.” She laughed. “I’m sure it takes a lot more refinement to make an eye.”\nJohncy smiled and nodded. “I was only the second to have one; the first was a monkey. One who’d lost her eye from a disease; don’t worry, it wasn’t tortured. It lived for a few more years, till the monkey fungus got it. But I got this eye.” He held a hand out to help Wen up. “Wen, good to see you. It wouldn’t be the same without you.” He turned to Audra. “You know he discovered the turtles, don’t you?”\n“He didn’t exactly say.”\n“Too modest. Or too secretive?” He laughed. “He always insisted that only plastics get told about the turtles and this island. We’re very protective.”\nShe turned to consider Wen. “You’re plastic too?”\n“My heart,” he said easily. “If you lean in real close you’ll hear a different sound, more like a shush than a normal heart. It’s been running for about five years now. We don’t have a good idea about stress factors on plastic when it’s internal. One of the reasons Egg Island is kind of an obsession with me.”\nA young woman came paddling up in a plastic kayak and pulled into the other tine of the fork. “Egg is coming along,” she said, clearly delighted. “I think it will be early this year. It’s right behind Brother and to the east.”\n“It’s good you came when you did,” Wen told Audra. “I wasn’t going to come ‘till tomorrow. I might have missed the sight of it. I love watching it arrive.”\nThe woman’s name was Kit, and she, along with Johncy and Michael, showed Audra around. They walked on the rippling island with absolute assurance, explained how they placed plastic straws and coils to reclaim water, how they dried seaweed in racks and baked it in solar ovens into a kind of bread. A modest vertical garden grew herbs, tomatoes, and beans.\n“I brought extra water,” Wen said. “And some groceries. And eggs, of course,” he said, winking. That brought a round of applause and laughs from the staff.\nThe island was almost a quarter-mile around, so its motion was relatively minor, but it made her dizzy. They promised her she would get her balance by morning.\nWater splashed a little during the night, and occasionally a fish would flip out of water, or something would fall off the island. Once she heard voices offshore, so she supposed that the staff went for swims, and that must mean that the oil slicks had moved off for a while. Or they accepted being covered in oil. Or there was another alternative she knew nothing about. She slept.\nShe did have her sea legs the next morning, rolling a little as she walked over the woven plastics, watching her step, but no longer in any way queasy. They grabbed plates and cups of coffee (also Wen’s gift) and sat staring out to the east.\n“I think,” Michael said, and stopped. Everyone seemed to freeze, cups or forks in hand, just looking. They held a collective breath.\n“Yes,” Wen said. “Yes. That’s Egg all right.”\nThey stood up. They stared at the island, watching it slap gently through the waves, pushed by a twist in the current, by the merest suggestion of wind. Audra thought it seemed to be aware of them, to be heading for them deliberately, even though she knew of course that the island itself was passive. Still, she was filled with expectation; they all were tense with anticipation, pulling out cameras and logbooks and charts from previous years.\nAudra stayed by Wen’s side. “When will it happen? Is it always at night?”\n“So far,” he said. “How long is ‘always’ under these circumstances? It’s been eleven years now, and I was the first to see it. Among the first, technically, I suppose. But I saw it, shook my head to clear it, saw it, and called the others. A wonderful thing.”\n“Will the island be here tonight, then?”\nHe shook his head. “Probably not. But tomorrow, yes, I think so.”\nShe spent the day doing the chores she’d been assigned, which included watering the garden. The reclamation straws dripped slowly, and she had to be careful to replace any bucket she took with another bucket immediately; not one drop of water could be lost. The plants poked up through plastic tarps, so that the soil would hold the water as long as possible. The tarps were lifted an hour a day to avoid mold or fungus in the soil. This was done by hand; they stood around, tarps lifted, holding corners or centers, chatting about the next things to do or any topic that came up.\n“Does your arm ever bother you?” Michael asked her.\nShe looked down at it; it had become familiar, it had become a part of her. “No,” she said. “Not at all. It’s part of me now.”\nHe smiled. “I have a leg,” he said. “Works perfectly, too.”\nThe others nodded. They each had a replacement part. “I sometimes forget about it,” she said. “Though it can do more, lift more, have more force, than my original arm. So I think I’ve been improved.” She grinned.\nThey told their stories, one by one, what they lost and how they had gained a replacement. “To think,” Wen said, “how much damage we’ve done with plastic; how much we’ve destroyed. And how plastic might turn around and save us, in return.”\n“We’ve lost a lot; I won’t deny we’ve lost a lot. It was a hard lesson. The world is changed,” Michael said.\n“The world is always changing,” Wen said. “We just have to find a direction for it.”\n“Oh, I don’t know,” Audra said, laughing, “it seems to have found its direction on its own.”\nThey contemplated that for a while, gazing off to Egg Island as the sun set, wishing for the morning.\nAnd in the morning it was there, a few hundred yards away, a faint new slap of water hitting plastics. Egg Island was a looser island than Sister Island, and there would only be a day or so to weave plastic ropes into it, to maintain some kind of integrity to it as they went forward. Some swam over, dragging ropes and nets behind them; some paddled over on foam boards. They pushed aside the plastic eggs, looking like mottled Easter eggs that lay strewn over the surface. They pushed some down into the matted debris, and used the coils of ropes and plastic bags they’d brought over from Sister Island to sew the island together. They walked carefully, but even so they had to rescue each other from patches where their legs went through. It was safer to kneel and inch their way around, patting and tucking, pushing ropes down and through and up again.\nThey worked quickly and efficiently, patch by patch, tightening the island so it would maintain integrity, aware that the island would only be here briefly. “This part needs help,” someone would call out, and one or two people would nod and kneel their way across to that section, pulling pieces together, working like weavers on a giant, watery loom.\nThe island landed up against their own island, and they took a break, went home, ate quickly, and went back to work. One particularly bad section required a ladder laid flat on it to hold their weight as they worked to restore it. On the far side, a wide fish net with ballast had been caught and dragged along; they hoisted it up and wove it in. A hairnet, Audra thought briefly and then tied her section into the mass of the island.\nThey worked for two days that way, barely speaking, pushing in lines and pulling them out, sewing the island, tugging at it, patting it and pushing it.\nEgg Island was still moving even as it rested against Sister Island; it had its own volition, its own imperative to move, move, move on.\n“Soon,” Johncy said. “I think tomorrow,” and they nodded, exhausted, and slept without further discussion. The constant work had tamped down their sense of anticipation, but now it rose again and even as exhaustion overtook them, they slept fitfully, waiting for dawn.\nThe island was now just touching on the east end of Sister Island; it had shifted slightly all night long, touching and moving the length of Sister Island. They could feel the tactile way the two islands met, a handshake, a rub on the shoulder, the smallest, most basic communion. Not that anyone believed the islands were alive. They were part of a new order, however. The earth was ingesting the plastics and mixing the plastics and finding a new use for them. The unnatural was becoming the natural. The order was changing and it hardly mattered whether it was for better or for worse.\nAnd in the midst of all the change, strange new beauties occurred.\nThey worked all day and kept vigil when the dark fell and the moon rose. They sat and murmured on their own moving island, talking of nothing important. Things they’d seen, books they’d read, odd places they’d been. But their conversations only lasted a few minutes and they would pause and listen. Their ears played tricks on them; their eyes saw shapes that turned out to be yet another plastic bag, with trapped air bubbles, a child’s toy, a piece of Styrofoam, all things that they gathered and saved. “If you see a plastic arm wash by,” Audra said, “please save it for me!”\n“Or a leg!” Michael cried.\n“I think a plastic eye would be hard to spot,” Johncy said.\nAnd then the first sea turtle appeared, breaking out of the water, its reptile head prehistoric and determined. On Sister Island, the people stiffened and pointed and got to their feet and stepped over onto Egg Island, now close to detaching itself from Sister Island. The turtle dragged itself up Egg Island slowly, thick flippers pushing against discarded flashlights and computer keyboards and the tarps and pails of the island, its shell toughened and knobbed with small pieces of plastics. And then another and another, all huge and gnarled, and they moved across the discarded plastics that had been thrown into the sea and had grown into the sea. One by one they inched their way forward, their backs stippled with plastics that had latched onto their animal bodies, seamless and as irreproachable as Audra’s arm, as Wen’s heart. It was a selective turn in the usefulness of flesh, in the utility of plastic. Omnipresent now, polluting what had formerly been pristine, pierced by the shoot, the claw, the plow, plastics had threaded their ways back into life.\nThe turtles selected their space and shifted, pushing their great bodies back and forth, having found the spot where they would lay their eggs, which had gathered bits of microbeads in the process of forming. The eggshells had once been smooth; they now had a granular quality to them, like sand in paint. Was it an evolutionary device, making them unpalatable to predators? The turtles’ massive heads looked straight ahead, mouths slightly open from their efforts. These mouths ended in sharp beaks, and their infants would only emerge when their own beaks were strong enough to pierce the mix of plastic and calcium housing them.\nAudra leaned delicately from where she stood on the edge of Sister Island and patted the head of a turtle that had chosen a spot near her. She patted it with her 3D arm. She felt the turtle’s damp knobby head, then let her hand move down to its carapace. The leatherback’s shell was not as hard as other turtles’. It had bony plates beneath the skin on its back, and Audra could feel irregularities on the plates, a feel of edges and lines that felt, to her delicate 3D fingers, familiar; related. Bits and pieces of plastics had worked through the turtle’s skin to the plates below. The turtles, the eggshells, her arm, Wen’s heart: all connected, all synchronous.\nThe whole event was over in less than an hour. The eggs were laid, the turtles covered them with any loose debris so that they would remain hidden among the other types of plastic overlaying and underlaying the island. They heaved themselves around and used their massive flippers to drive themselves forward, until finally they slipped back into the ocean. Heads could be seen leaving steadily away from the island, and then the heads dipped silently, one by one, and were gone.\nThe moon was setting, running a light on the ocean. A few oil slicks picked up muted rainbow colors and the merest movements of the waves broke the colors up like a sophisticated painting. A single turtle head surfaced and disappeared again.\n“I want to live here forever,” Audra thought, picking idly at the garbage closest to her. It seemed her arm, the 3D arm, was intent on sifting and sorting.\nEgg Island pulled away slowly, like a lumbering train obeying strict laws. It wavered and washed in the setting moon’s last luminous light.\nOn Sister Island, they joined hands and rejoiced at the beauty of the world.\nKaren Heuler's stories appear in literary, fantasy, and science fiction magazines regularly and have won various awards, including an O. Henry. Her 2014 novel, Glorious Plague, was about a strangely beautiful apocalypse, and her second story collection, The Inner City, was chosen as one of the best books of 2013 by Publishers Weekly.", "source": "https://clarkesworldmagazine.com/heuler_10_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Egg Island by Karen Heuler"}