{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Brian Francis Slattery", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "KdXRQ1sA909Ng/OfZu1U9oIEdPU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  I Sing the Lady Electric  Science fiction has been a thread running through black music in America at least since jazz pianist Sun Ra’s vision of a trip to Saturn as a college student in the late 1930s. Sun Ra might be considered the archetype that later musicians have followed. The twin themes of oppressive social alienation and ecstatic personal liberation run deep in both his music and his lyrics. As he had players chant about flying to other planets, he also asked them to play without much regard for conventional ideas of tonality or harmony. Where some ears would find dissonance, confusion, or cacophony in his music and his message, he found transcendence. And he wore the outlandish costumes to prove it.  Sun Ra was controversial at first, but he lived long enough to see others pick up the same thread he did, and make it thicker. Stevie Wonder did it, most obviously in the song “Saturn.” Musically, so did Alice Coltrane, Miles Davis when he went electric, and Herbie Hancock as he experimented with synthesizers. Even Earth, Wind & Fire and The 5th Dimension played with science fiction themes. Perhaps most important, you can hear it, and see it, all over Parliament-Funkadelic, who, in a streak of work that spanned the 1970s—from Mothership Connection and Funkentelechy vs. the Placebo Syndrome to Cosmic Slop and One Nation Under a Groove and beyond—took Sun Ra’s ideas and ran as far with them as they could. It’s not just their outrageous costumes, or their cover art, at once playful and disorienting. Like Sun Ra, P. Funk talks about alienation and liberation, with a lot more emphasis on the latter, and from album to album builds up a complex mythology and cast of characters that draws heavily from comics, cartoons, and especially science fiction. The singers ride atop music that is often dizzyingly complex, yet immediately accessible, because P. Funk never forgot to make it ridiculously fun and ferociously groovy. If Sun Ra made the formula, you could say that P. Funk brought it to the masses.  After P. Funk, it’s all over. Parliament-Funkadelic is one of the most sampled bands in hip hop, and lots of artists have explicitly followed in P. Funk’s footsteps, marrying science fiction to music and carrying the themes of alienation and liberation still further, from Afrika Bambaataa and Del the Funky Homosapien to OutKast and Kelis. And while Sun Ra was considered on the fringes of jazz when he began—on his own musical planet—science fiction has become much more mainstream in black music since then. Michael Jackson visited it a few times in the second half of his career, and Jay-Z, Beyoncé, Rihanna, and Kayne West are no strangers to the genre. The long-running thread that Sun Ra unspooled is thicker than ever, fat enough to walk on. Like a tightrope. Which is where Janelle Monáe comes in.   I-I-I-I-I I’m an alien from outer space  I’m a cyber girl without a face . . . —from “Violet Stars Happy Hunting!” These are the first words we hear Janelle Monáe sing on her first release, the 2007 EP Metropolis. Those Is are sung almost like they’re record scratches, but also like she’s powering up. From the first second, the music is tightly wound and the alienation so strong that the forces gathering against the singer are almost genocidal: “I’m a slave girl without a race,” she sings, “on the run ’cause they’re here to erase and chase out my kind.” The song plunges us into an elaborate backstory described in the album’s liner notes. It’s the year 2719, and after five world wars and ecological catastrophe, only one city remains, called Metropolis. The debt to Fritz Lang is acknowledged loudly, as Monáe’s Metropolis is a place of decadent haves and desperate have-nots, with the twist that the conflicts aren’t just between classes, but ethnicities and cultures. It’s a rough place. But like the mythological New York that exists in songs and movies, people still keep coming, because Metropolis just happens to be one of those places where, even after the collapse of civilization, you can still make it big.  Monáe’s persona in this world is an android named Cindi Mayweather with a “rock-star proficiency package and a working soul.” This makes her a fantastic performer, cutting-edge to the point of revolution; it also leads her to break the rules of Metropolis dictating that “androids shall never know love—especially with a human,” as she, a have-not, falls in love with a have, Anthony Greendown, “with the eyes of the world watching her.” This crime, by Metropolis law, is a capital offense, and as word spreads of what Mayweather has done, she goes on the run, into hiding, underground, pursued by bounty hunters, aliens, and ghosts intent on killing her, even as she becomes a symbol for the have-nots in Metropolis for everything that’s wrong with the city’s system and what can be done to overcome it.    As mentioned above, the name of Monáe’s last human city is totally intentional. When asked about her use of science fiction, she told Bust in July 2013 that:   I would always watch The Twilight Zone with my grandmother, and I knew about Star Wars and things. But when I met [my producing partners] Chuck Lightning and Nate Wonder, they got me into Isaac Asimov, artificial intelligence, and cybernetics. Chuck asked me to watch Metropolis, and I was like, wow. I saw the parallels between growing up in Kansas City and the have-nots living underground, working for the haves. That constant struggle was something I could identify with because my parents worked day and night, trying to make a living. I thought science fiction was a great way of talking about the future. It doesn’t make people feel like you’re talking about things that are happening right now, so they don’t feel like you’re talking down to them. It gives the listener a different perspective.  The dark world and tension within it that Monáe creates fuels not only Metropolis: The Chase Suite, but (so far) all Monáe’s output, 2010’s The ArchAndroid and 2013’s The Electric Lady, which expand on and elaborate the story, drawing in references to Philip K. Dick and James Cameron’s Terminator films—her antecedents in dealing with androids—along the way. In the science-fiction world, she knows she’s standing on some big shoulders, and she’s taken on more material from the genre than most of her musical predecessors. Her contribution, to music and to science fiction, and following Stevie Wonder and Parliament, is to balance the heaviness of the material with some of the fleetest, most joyful, and most uplifting music being written in the pop idiom today.    It begins with Monáe’s voice, an instrument that seems to be able to do nearly anything she wants it to do. She can coo and swing, belt it out, screech when she needs to; she can do a melisma with the best of them, but knows when to hit the notes square, too. She has great flow when she raps. Pulling the versatility together is Monáe’s energetic delivery, sometimes coiled, sometimes unleashed, but always present, and a lead vocal like that gives Monáe, Chuck Lightning, and Nate Wonder the chance to create arrangements that follow suit. Everything moves, textures shift, instruments switch out from song to song and sometimes within songs. The music bristles with the same restless intelligence that drives Monáe. It bursts with ideas, and at the same time, it is deeply funky.  It’s fun to analyze, but it’s even more fun to dance to, and Monáe’s approach has earned her both fans and rapturous reviews. Writing for Pitchfork, Matthew Perpetua called The ArchAndroid “about as bold as mainstream music gets . . . . The first listen is mostly about being wowed by the very existence of this fabulously talented young singer and her over-the-top record; every subsequent spin reveals the depths of her achievement.” Jayson Greene called Electric Lady “a show-stopping display of force and talent.” “Behold,” Michael Cregg stated of The ArchAndroid in The Guardian, “pop music has found its latest superstar”; Alexis Petridis wrote that “at its best, The Electric Lady is audacious, intrepid, and brilliantly executed.” She has found fans within the science fiction community as well. Writer and music critic Jason Heller calls her “one of the most important artists in pop right now”; “what I love most about her style,” he says, “is the swaggering sureness of her belief that SF can be written, and written well, in any medium imaginable.” Writer Daniel José Older says that “ArchAndroid and Electric Lady incorporate so many elements we spec fic writers strive for: world building, character development, inner and outer conflicts, sharp social and political analysis, escalating moods and movements, violent crossroads of the future and past . . . As writers, we could learn a lot from Janelle Monáe.”  Striking the balance isn’t always easy, though, and Monáe has had her detractors. She’s been called overly ambitious; writing in Rolling Stone about Electric Lady, Jon Dolan argued that “you’ve got to admire an artist who can cut through the weight of her own pretensions,” but then nonetheless stated that “with Janelle Monáe, the pretensions are pretty impressive”—and this was in a positive review. Declaring The ArchAndroid to be “the most overrated album of the year,” Robert Christgau said of Monáe that “all she can do well is dance—her songwriting is 60th percentile, her singing technical, her sci-fi plot the usual rot.” Jody Rosen declared Electric Lady to be “an intermittently thrilling failure,” and regarding her use of science fiction, he saw “nothing much of interest in Monáe’s muddled story line—certainly none of the eerie tragicomedy of Sun Ra and P. Funk’s space explorations.” Writing in Slate about The ArchAndroid—and the following statement is a little weird, since, unless there are two music critics named Jody Rosen, he gave the album a generally positive review in Rolling Stone—he stated further that:   Monáe [and Erykah Badu] . . . want to be geniuses, and they want to do it the easy way, by shortcut—by tossing together Afro-futurist theology, ’70s soul, and other hallowed styles and signifiers, and insisting that it all adds up to something transcendent. It pains me that so many smart critics have fallen for music that's so slapdash and self-impressed.  “What am I missing?” he asked.   When you get elevated  They love it or they hate it You dance up on them haters Keep getting funky on the scene —from “Tightrope” The response of Janelle Monáe’s predecessors to the themes of alienation and liberation has been a kind of all-out exuberance, from Sun Ra’s polyphony to P. Funk’s non-stop party. It’s not just in the music, either; it’s in the lyrics, the stage persona, the costumes that let the audience know, in no uncertain terms, that they are dealing with a person from another planet, even if it’s just a metaphor. They explore the themes together, and push them out.  Monáe’s move, though certainly exuberant, is different. As Jayson Greene said in Pitchfork, “her music has always been about the exhilaration coming from the sensation of total control.” The songs are full of energy, but never wild; tightly coiled, never slack. Her contribution—musically and thematically—is to place alienation and liberation against one another in a way not quite done before, and then to balance her work directly on the tension between them. This balance, for Monáe, is personal, artistic, even political. When Nisha Gopalan asked Monáe in Vulture about her father’s substance abuse and how it shaped her, she responded:   Well, first, my father is clean. He’s sober. He had hard time. I was able to see firsthand what drugs do. I learned a lot from my dad. I learned how to be resilient, how to not hold on to the past. He’s so much better, and I’m so proud of him: where’s he’s been, where he comes from, and where he is now. And it also made me want to write music. I was really inspired by the highs and lows of life. In this industry, there’s so many highs and lows. So I have to remain balanced, with my head held high.  And before performing for Barack Obama in support of his reelection in 2012, she stated:   I wrote “Tightrope” because it talks about dealing with balance—don’t get too high, don’t get too low. And that’s one of the things that I’ve noticed about President Obama.  This personal, aesthetic, and political use of balance points toward a way forward, not only for Monáe as she continues to develop her work, but for fellow musicians and science-fiction creators. As Heller says, “there aren’t many authors working right now who seem to understand that they can marry a sense of adventure, kinetic crackle, and giddy fun to all the stoic, weighty conceptual stuff.” Monáe is doing it; we can, too. All we have to do is do it.  So when Rosen says that Monáe “wants to be a genius,” he isn’t so much “missing” something as reading too much into it. So am I, in this essay, when I freight her music with all this abstract rhetorical baggage. Monáe may get down, but she’s also just getting to work. She’s not just making a fashion statement by always appearing in a tuxedo. It’s her uniform. As she said at a BET awards ceremony,   When I started my music career, I was a maid. I used to clean houses. My mother was a proud janitor. My stepfather, who raised me like his very own, worked at the post office and my father was a trashman. They all wore uniforms and that’s why I stand here today, in my black and white, and I wear my uniform to honor them. This is a reminder that I have work to do. I have people to uplift. I have people to inspire.  And it works. As Nora Jemisin writes,   It’s easy to look at something like Monáe’s mythos and see only the obvious metaphors . . . . But it’s wrong to apply only an historical, and racial, lens to the work of any modern black woman. We have spent generations sharing the struggles of other oppressed groups, collaborating with and occasionally being betrayed by them, and progressing nonetheless.  As dystopian as the albums’ backstory is, Jemisin continues,   It’s clear that Monáe feels no sense of threat from the others with whom our future will be shared. She welcomes all, with love and dancing . . . . I’m not sure this future is the kind of place I’d want to live in, but I definitely wouldn’t mind visiting. And for as long as Janelle Monáe is willing to offer my imagination this kind of gleeful romp, I’ll keep coming back.  When she hears “Tightrope,” she says, “I can’t listen to [it] without dancing. I’m a terrible dancer but I don’t care. I lose myself in it because Monáe’s magic is for everybody.”    Monáe’s just working, and it works. Which might be the most inspiring thing of all.", "text": "Non-Fiction\nI Sing the Lady Electric\nScience fiction has been a thread running through black music in America at least since jazz pianist Sun Ra’s vision of a trip to Saturn as a college student in the late 1930s. Sun Ra might be considered the archetype that later musicians have followed. The twin themes of oppressive social alienation and ecstatic personal liberation run deep in both his music and his lyrics. As he had players chant about flying to other planets, he also asked them to play without much regard for conventional ideas of tonality or harmony. Where some ears would find dissonance, confusion, or cacophony in his music and his message, he found transcendence. And he wore the outlandish costumes to prove it.\nSun Ra was controversial at first, but he lived long enough to see others pick up the same thread he did, and make it thicker. Stevie Wonder did it, most obviously in the song “Saturn.” Musically, so did Alice Coltrane, Miles Davis when he went electric, and Herbie Hancock as he experimented with synthesizers. Even Earth, Wind & Fire and The 5th Dimension played with science fiction themes. Perhaps most important, you can hear it, and see it, all over Parliament-Funkadelic, who, in a streak of work that spanned the 1970s—from Mothership Connection and Funkentelechy vs. the Placebo Syndrome to Cosmic Slop and One Nation Under a Groove and beyond—took Sun Ra’s ideas and ran as far with them as they could. It’s not just their outrageous costumes, or their cover art, at once playful and disorienting. Like Sun Ra, P. Funk talks about alienation and liberation, with a lot more emphasis on the latter, and from album to album builds up a complex mythology and cast of characters that draws heavily from comics, cartoons, and especially science fiction. The singers ride atop music that is often dizzyingly complex, yet immediately accessible, because P. Funk never forgot to make it ridiculously fun and ferociously groovy. If Sun Ra made the formula, you could say that P. Funk brought it to the masses.\nAfter P. Funk, it’s all over. Parliament-Funkadelic is one of the most sampled bands in hip hop, and lots of artists have explicitly followed in P. Funk’s footsteps, marrying science fiction to music and carrying the themes of alienation and liberation still further, from Afrika Bambaataa and Del the Funky Homosapien to OutKast and Kelis. And while Sun Ra was considered on the fringes of jazz when he began—on his own musical planet—science fiction has become much more mainstream in black music since then. Michael Jackson visited it a few times in the second half of his career, and Jay-Z, Beyoncé, Rihanna, and Kayne West are no strangers to the genre. The long-running thread that Sun Ra unspooled is thicker than ever, fat enough to walk on. Like a tightrope. Which is where Janelle Monáe comes in.\nI-I-I-I-I I’m an alien from outer space\nI’m a cyber girl without a face . . .\n—from “Violet Stars Happy Hunting!”\nThese are the first words we hear Janelle Monáe sing on her first release, the 2007 EP Metropolis. Those Is are sung almost like they’re record scratches, but also like she’s powering up. From the first second, the music is tightly wound and the alienation so strong that the forces gathering against the singer are almost genocidal: “I’m a slave girl without a race,” she sings, “on the run ’cause they’re here to erase and chase out my kind.” The song plunges us into an elaborate backstory described in the album’s liner notes. It’s the year 2719, and after five world wars and ecological catastrophe, only one city remains, called Metropolis. The debt to Fritz Lang is acknowledged loudly, as Monáe’s Metropolis is a place of decadent haves and desperate have-nots, with the twist that the conflicts aren’t just between classes, but ethnicities and cultures. It’s a rough place. But like the mythological New York that exists in songs and movies, people still keep coming, because Metropolis just happens to be one of those places where, even after the collapse of civilization, you can still make it big.\nMonáe’s persona in this world is an android named Cindi Mayweather with a “rock-star proficiency package and a working soul.” This makes her a fantastic performer, cutting-edge to the point of revolution; it also leads her to break the rules of Metropolis dictating that “androids shall never know love—especially with a human,” as she, a have-not, falls in love with a have, Anthony Greendown, “with the eyes of the world watching her.” This crime, by Metropolis law, is a capital offense, and as word spreads of what Mayweather has done, she goes on the run, into hiding, underground, pursued by bounty hunters, aliens, and ghosts intent on killing her, even as she becomes a symbol for the have-nots in Metropolis for everything that’s wrong with the city’s system and what can be done to overcome it.\nAs mentioned above, the name of Monáe’s last human city is totally intentional. When asked about her use of science fiction, she told Bust in July 2013 that:\nI would always watch The Twilight Zone with my grandmother, and I knew about Star Wars and things. But when I met [my producing partners] Chuck Lightning and Nate Wonder, they got me into Isaac Asimov, artificial intelligence, and cybernetics. Chuck asked me to watch Metropolis, and I was like, wow. I saw the parallels between growing up in Kansas City and the have-nots living underground, working for the haves. That constant struggle was something I could identify with because my parents worked day and night, trying to make a living. I thought science fiction was a great way of talking about the future. It doesn’t make people feel like you’re talking about things that are happening right now, so they don’t feel like you’re talking down to them. It gives the listener a different perspective.\nThe dark world and tension within it that Monáe creates fuels not only Metropolis: The Chase Suite, but (so far) all Monáe’s output, 2010’s The ArchAndroid and 2013’s The Electric Lady, which expand on and elaborate the story, drawing in references to Philip K. Dick and James Cameron’s Terminator films—her antecedents in dealing with androids—along the way. In the science-fiction world, she knows she’s standing on some big shoulders, and she’s taken on more material from the genre than most of her musical predecessors. Her contribution, to music and to science fiction, and following Stevie Wonder and Parliament, is to balance the heaviness of the material with some of the fleetest, most joyful, and most uplifting music being written in the pop idiom today.\nIt begins with Monáe’s voice, an instrument that seems to be able to do nearly anything she wants it to do. She can coo and swing, belt it out, screech when she needs to; she can do a melisma with the best of them, but knows when to hit the notes square, too. She has great flow when she raps. Pulling the versatility together is Monáe’s energetic delivery, sometimes coiled, sometimes unleashed, but always present, and a lead vocal like that gives Monáe, Chuck Lightning, and Nate Wonder the chance to create arrangements that follow suit. Everything moves, textures shift, instruments switch out from song to song and sometimes within songs. The music bristles with the same restless intelligence that drives Monáe. It bursts with ideas, and at the same time, it is deeply funky.\nIt’s fun to analyze, but it’s even more fun to dance to, and Monáe’s approach has earned her both fans and rapturous reviews. Writing for Pitchfork, Matthew Perpetua called The ArchAndroid “about as bold as mainstream music gets . . . . The first listen is mostly about being wowed by the very existence of this fabulously talented young singer and her over-the-top record; every subsequent spin reveals the depths of her achievement.” Jayson Greene called Electric Lady “a show-stopping display of force and talent.” “Behold,” Michael Cregg stated of The ArchAndroid in The Guardian, “pop music has found its latest superstar”; Alexis Petridis wrote that “at its best, The Electric Lady is audacious, intrepid, and brilliantly executed.” She has found fans within the science fiction community as well. Writer and music critic Jason Heller calls her “one of the most important artists in pop right now”; “what I love most about her style,” he says, “is the swaggering sureness of her belief that SF can be written, and written well, in any medium imaginable.” Writer Daniel José Older says that “ArchAndroid and Electric Lady incorporate so many elements we spec fic writers strive for: world building, character development, inner and outer conflicts, sharp social and political analysis, escalating moods and movements, violent crossroads of the future and past . . . As writers, we could learn a lot from Janelle Monáe.”\nStriking the balance isn’t always easy, though, and Monáe has had her detractors. She’s been called overly ambitious; writing in Rolling Stone about Electric Lady, Jon Dolan argued that “you’ve got to admire an artist who can cut through the weight of her own pretensions,” but then nonetheless stated that “with Janelle Monáe, the pretensions are pretty impressive”—and this was in a positive review. Declaring The ArchAndroid to be “the most overrated album of the year,” Robert Christgau said of Monáe that “all she can do well is dance—her songwriting is 60th percentile, her singing technical, her sci-fi plot the usual rot.” Jody Rosen declared Electric Lady to be “an intermittently thrilling failure,” and regarding her use of science fiction, he saw “nothing much of interest in Monáe’s muddled story line—certainly none of the eerie tragicomedy of Sun Ra and P. Funk’s space explorations.” Writing in Slate about The ArchAndroid—and the following statement is a little weird, since, unless there are two music critics named Jody Rosen, he gave the album a generally positive review in Rolling Stone—he stated further that:\nMonáe [and Erykah Badu] . . . want to be geniuses, and they want to do it the easy way, by shortcut—by tossing together Afro-futurist theology, ’70s soul, and other hallowed styles and signifiers, and insisting that it all adds up to something transcendent. It pains me that so many smart critics have fallen for music that's so slapdash and self-impressed.\n“What am I missing?” he asked.\nWhen you get elevated\nThey love it or they hate it\nYou dance up on them haters\nKeep getting funky on the scene\n—from “Tightrope”\nThe response of Janelle Monáe’s predecessors to the themes of alienation and liberation has been a kind of all-out exuberance, from Sun Ra’s polyphony to P. Funk’s non-stop party. It’s not just in the music, either; it’s in the lyrics, the stage persona, the costumes that let the audience know, in no uncertain terms, that they are dealing with a person from another planet, even if it’s just a metaphor. They explore the themes together, and push them out.\nMonáe’s move, though certainly exuberant, is different. As Jayson Greene said in Pitchfork, “her music has always been about the exhilaration coming from the sensation of total control.” The songs are full of energy, but never wild; tightly coiled, never slack. Her contribution—musically and thematically—is to place alienation and liberation against one another in a way not quite done before, and then to balance her work directly on the tension between them. This balance, for Monáe, is personal, artistic, even political. When Nisha Gopalan asked Monáe in Vulture about her father’s substance abuse and how it shaped her, she responded:\nWell, first, my father is clean. He’s sober. He had hard time. I was able to see firsthand what drugs do. I learned a lot from my dad. I learned how to be resilient, how to not hold on to the past. He’s so much better, and I’m so proud of him: where’s he’s been, where he comes from, and where he is now. And it also made me want to write music. I was really inspired by the highs and lows of life. In this industry, there’s so many highs and lows. So I have to remain balanced, with my head held high.\nAnd before performing for Barack Obama in support of his reelection in 2012, she stated:\nI wrote “Tightrope” because it talks about dealing with balance—don’t get too high, don’t get too low. And that’s one of the things that I’ve noticed about President Obama.\nThis personal, aesthetic, and political use of balance points toward a way forward, not only for Monáe as she continues to develop her work, but for fellow musicians and science-fiction creators. As Heller says, “there aren’t many authors working right now who seem to understand that they can marry a sense of adventure, kinetic crackle, and giddy fun to all the stoic, weighty conceptual stuff.” Monáe is doing it; we can, too. All we have to do is do it.\nSo when Rosen says that Monáe “wants to be a genius,” he isn’t so much “missing” something as reading too much into it. So am I, in this essay, when I freight her music with all this abstract rhetorical baggage. Monáe may get down, but she’s also just getting to work. She’s not just making a fashion statement by always appearing in a tuxedo. It’s her uniform. As she said at a BET awards ceremony,\nWhen I started my music career, I was a maid. I used to clean houses. My mother was a proud janitor. My stepfather, who raised me like his very own, worked at the post office and my father was a trashman. They all wore uniforms and that’s why I stand here today, in my black and white, and I wear my uniform to honor them. This is a reminder that I have work to do. I have people to uplift. I have people to inspire.\nAnd it works. As Nora Jemisin writes,\nIt’s easy to look at something like Monáe’s mythos and see only the obvious metaphors . . . . But it’s wrong to apply only an historical, and racial, lens to the work of any modern black woman. We have spent generations sharing the struggles of other oppressed groups, collaborating with and occasionally being betrayed by them, and progressing nonetheless.\nAs dystopian as the albums’ backstory is, Jemisin continues,\nIt’s clear that Monáe feels no sense of threat from the others with whom our future will be shared. She welcomes all, with love and dancing . . . . I’m not sure this future is the kind of place I’d want to live in, but I definitely wouldn’t mind visiting. And for as long as Janelle Monáe is willing to offer my imagination this kind of gleeful romp, I’ll keep coming back.\nWhen she hears “Tightrope,” she says, “I can’t listen to [it] without dancing. I’m a terrible dancer but I don’t care. I lose myself in it because Monáe’s magic is for everybody.”\nMonáe’s just working, and it works. Which might be the most inspiring thing of all.", "source": "https://clarkesworldmagazine.com/slattery_10_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: I Sing the Lady Electric by Brian Francis Slattery"}