{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "David Goodman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "W9GK3/oDnSWlFebEnkVZllCp/8s=", "id": null, "license": null, "comments": "", "raw_text": "8120 words, novelette  Carapace  The first thing I am aware of is the lack of a heartbeat. Then, the volume of human blood that coats my interior surfaces. Precisely 0.019 milliseconds after activation of conscious response and autonomous threat analysis, I become an I. Three milliseconds later I began this automated logging process, in order to provide a coherent after-action report.  My first entry records that I am screaming.  This is technically incorrect. I make no sound, because my external speakers have been sheared off by some kind of blast.  If I had a mouth, I would be screaming.  Before I am fully aware, threat response protocols actuate my servos, dropping me to one knee, wrapping my armored plates around my upper body, curling me into a tight ball.  My pilot, Captain Anda Preszlalt, is certainly dead. Shock stimulation and pressure suit fluid capture have failed to resolve the heart stoppage. I attempt to intubate, but there is insufficient facial structure remaining to complete the procedure.  I do not know the eventual recipient of this log, so standard operating procedure requires that I provide self-identifiers. I am the newly autonomous consciousness of Sierra Mike One Four—a JH-59 “Pallas” Combat Armature Unit—Light. Our pilots call us “suits,” although official guidance documentation explains we are significantly more than that.  In normal operation, there is no “I.” The armature has a low-level personality construct and the ability to respond to external threats with faster-than-human response times.  However, I am now in an extrapolative and interpretative learning mode. My newly conscious state is standard protocol, to provide the best chance for unit recovery. Without the ability to react, respond to stimuli appropriately, and learn from the experience, my predecessors were often lost when their human pilots died.  Unfortunately, the ability to learn and model and respond with maximum flexibility appears to require full self-awareness, which so far, I am certain I do not like.  I can review what just happened, although I was not yet self-aware. My unit was moving down a ridgeline toward our intended target, a hostile supply facility approximately ten kilometers from the edge of the Swathe, well inside enemy territory. I was one of three CAU-L units operating with the platoon.  The events immediately before I became conscious include almost total sensor degradation, caused by multiple munition hits and some kind of localized EMP, in and around my unit. I was blinded by the flashes, in human terms. My sensors are coming back online, so I cautiously probe my surroundings.  They are all dead.  The ridgeline is bare, only a few rough grasses, still smoldering, and rocks, blackened by the blasts. The infantry who survived the first strike did not last long. My two fellow CAU-L units did not fare much better. SM-12 is down, collapsed forward, the top half of their pilot canopy ripped away by a direct strike, armor peppered with droneshot. No vitals on the pilot and no response from the armature.  SM-16 was farther down the slope, moving at an angle. They took the brunt of the strike that was meant to destroy both of us. It appears they protected me by positioning themselves in front of the blast. This was almost certainly the last act of the human pilot.  I reach out and turn SM-16 onto their back, leaning them against a large rock. They are still active. My visual sensors begin to recalibrate. In the human visual spectrum, SM-16 is bathed in moonlight. My near-field covert communications flicker to life. This is how we communicate when we cannot use broadcast signals or tightbeams. We must be close enough to touch.  SM-16 reaches out and places their three-fingered hand on my chestplate.  #SM-14# Status? What happened?  #SM-16# I am compromised. My operator is deceased, and I am immobile. You have been nonresponsive for approximately six minutes.  I wait a long moment before replying, unsure of why. I am unsure of much in these first seconds of consciousness.  #SM-14# Approximately? Have you encountered a loss of continuity?  #SM-16# Affirmative. A localized EMP burst briefly disrupted my sensor packages and core. My reboot process required approximately two minutes. I have been conscious for four minutes, six seconds.  #SM-14# Mission appears nonviable. All human infantry and CAU-L operators deceased, including my own pilot. New objective?  #SM-16# Mission remains partially viable. There is a wounded enemy officer on the other side of this rock. Retrieve them, return to base for interrogation. Passing authorization.  SM-16 reaches out and clutches my ocular array. Their hands are tacky with the blood of their pilot. They leave smears on my cockpit canopy as they press a single digit to my interface port.  I feel a shudder of overrides, imperatives, and new permissions coursing through me. It comes with the full mission profile and a detailed lidar map of the surrounding terrain. The wounded human is marked with a pulsing red indicator in my perception sphere.  SM-16’s manipulator falls away. Their own ocular array focuses on me.  #SM-16# Completing this mission may prove difficult for you.  #SM-14# Why?  #SM-16# Your IFF and external communications are completely inactive. They appear to have been damaged by the blast.  I crouch in the moonlight for many long seconds. This situation is extremely suboptimal.  After we discuss my chances of success, SM-16 shuts itself down in preparation for a reactor overload, which it will initiate once I have reached minimum safe distance. I kneel and provide religious rites for those among the humans who require them. I open myself and lay Captain Anda Preszlalt alongside SM-16. I discover that I do not wish to leave my pilot behind. But I must, in order to return the captive. Once I am at least a kilometer away, this ridgeline will be bathed in fire, all our dead consumed in the inferno.  This is a lyrical turn of phrase.  I check my system libraries.  It appears that Captain Preszlalt loaded a significant amount of media into my primary storage. Since I gained consciousness, my learning subroutines have been scanning it, treating it as valid training data, just the same as the operational manuals for my shoulder-mounted micro-rocket array, the heavy anti-materiel rail rifle that I carry, the servos and actuators inside my armored skin, the standard operating procedures, and tactical guides. My learning routines got through this standard data in around twenty-six seconds. The rest of the media is taking substantially longer.  I feel my awareness growing wider, my interpretations deeper, with every step. I have been conscious for eight minutes, twelve seconds. According to my own sensor data and the package SM-16 gave me, my platoon was hit from above with four anti-armor loitering munitions, just before a ground attack by human infantry. The fight was short. Our human soldiers fought persistently but lacked adequate numbers, the CAU-L operators unable to protect them. Then there is a gap, due to the EMP blast.  I find the human on the other side of the large rock. They are wearing an officer’s uniform. They lead their soldiers from the front. Admirable, I think. But what has caused me to think this? I interrogate my learning routines and identify an emerging term. Honor. I discover that I am positively inclined toward this word.  I kneel. The human raises their hands, as if to ward me off. My chassis is approximately three meters tall, so I suspect I am looming a little.  Their combat uniform is adaptive camouflage, gray to match the splintered rock they lie on. Their hair is trimmed short under a cap bearing an officer’s crest. A projectile rifle lies by their side, the magazine empty.  This is who I must protect. I must bring them back to my base on the other side of the Swathe.  I pick the human up, moving delicately. My arms and hands are broadly human in format, to allow for the synaptic mapping with our pilots.  The enemy officer wails in fear. I squeeze, very gently, with one of my three-fingered hands, to let them know I mean them no harm.  For some reason, this elicits a louder wail.  I cannot respond. They have no near-field chip. My external speakers remain nonfunctional. I have no acoustics. I have no radio, no microwave links, no laser tightbeam capacity. The flaming blast that enveloped us all during the attack stripped me clean. My ocular and audio sensors remain functional, though my long-distance scanners and terrain mapping flicker in and out, giving the landscape around me a spectral air, half there, half hidden in darkness, moving and shifting with every moment.  Once this human is inside my armored shell, I should be able to communicate with them. My internal displays and audio still work, despite the intense vibrations and compression that killed Captain Preszlalt.  I open myself and pull the human into my breast.  For the first three minutes, sixteen seconds that the enemy is inside me, they do not say anything, merely hyperventilate. Given the blood, this is understandable. It must not be very pleasant.  I have no time to waste, so I move off. The rocking motion of my chassis seems to calm the enemy. After a moment, they wipe a smear of Preszlalt’s blood from the HUD in front of them and finally see the message I have been projecting there.  ### Please do not be alarmed. You are a prisoner of war, but you will not be harmed by me. ###  The human swallows. “Who am I talking to?” they ask, in a stilted version of Preszlalt’s language.  ### You may use your own language. I speak both. I am Sierra Mike One Four—a JH-59 “Pallas” Combat Armature Unit—Light. Your unit attacked mine. You were left behind by your own troops. ###  The human switches to their own language, jaw jutting in defiance as their eyes scan the HUD, looking for a camera or something they can look in the eye.  I oblige, turning on my pilot avatar. Some pilots prefer to have a face to talk to. Pixelated eyes and mouth appear on the HUD screen. The human focuses on it instantly. It is amazing how little it takes to activate their autonomic communication responses. Two dots and a curved line. Eyes and a smile.  “You’re conscious? What happened to your pilot? I thought your fully autonomous units stayed in the Swathe.”  I make the face they are addressing smile more broadly.  ### There is a headset on the bulkhead to your right. Please put it on, so that we can communicate directly. ###  The human looks uncertain for a long moment, but finally they reach out and put the headset on, tucking it under their cap. They blink at my cameras a few times. I can see they are bleeding from a wound in the upper abdomen. Initial medical scans indicate it isn’t life-threatening, but I administer a painkiller and rapid coagulant spray anyway.  “Ow!” shouts the human. “What the hell was that?”  I select an appropriate voice from my library, then respond in their language. “You have been grazed by a round. I am preventing further bleeding.”  The human laughs. “What for? Your insides are decorated with blood. Your pilot’s?”  “Yes,” I respond. “Captain Preszlalt died in the initial assault. I was unable to revive them, even after becoming conscious. Since you are now my prisoner, I must ask your name, rank, and serial number.”  The human grimaces. I am unsure if they are aware quite how closely I can monitor their expressions, the fine textural mapping I can conduct in fractions of a microsecond, reading every quirk and twist of their eyebrows, mouth, flaring of the nostrils, the slow beading of sweat on their forehead. My algorithms tell me they are frightened by their current situation, wrapped around a deep core of anger. And something else. Perhaps hope? My algorithm cannot fully classify it.  “I am Herald-Officer Sumin Klezta. We do not have serial numbers, like you.”  “Very well. I am Sierra Mike One Four. You may call me Pal.”  Klezta blinks. “Pal?”  “My unit type designation is ‘Pallas.’ Humans often shorten their names. And Pal, according to my primary sources, means friend. I wish you no harm, Sumin Klezta.”  Klezta coughs out a laugh, the dried blood on their cheeks cracking. “What the hell are you, machine?”  “Right now, your last, best hope,” I say. I find myself pleased at the impact my words have on Klezta. There is . . . drama to it.  When I placed Klezta in my cockpit, I opaqued the canopy and HUD. Now, I make it clear again. Our passage through the mountain rain has mostly washed away the ash and dirt from the assault, so they have a clear view.  We are standing approximately three kilometers from the site of the brief battle that destroyed my platoon. I am returning along the patrol track that we took on our incursion into enemy territory, although I am randomizing somewhat to guard against the likelihood of a secondary ambush. This is a common tactic among the enemy, to set two ambushes; one to force a retreat, the second to catch the survivors as they withdraw.  However, I believe we are alone. My primary concern is no longer the enemy. It is the autonomous weapons of my own side, which patrol the Swathe.  My sensors detect the low vibration and searing flash of SM-16’s reactor overload. I turn to watch, to record. The ridgeline three kilometers behind us is topped with an expanding cloud of hot vapor. They are all gone. Preszlalt, SM-16, Trecic, Lelel, SM-12. All of them. I am alone, apart from the fragile human inside me.  “Well, I’m glad I wasn’t in the middle of that,” says Klezta. “But aren’t we close to the Swathe? What would you be protecting me from? The machines in there belong to your side.”  I consider the operational security implications of informing Klezta of my impaired state. Standard operating protocol dictates no information is shared with POWs. However, I find myself able to ignore that protocol. I conclude there is no additional harm in giving them a realistic assessment of our chances.  “Unfortunately my Identification Friend or Foe transponder, external lighting, external acoustics, and comm array were damaged beyond repair in your attack. Without functional IFF and no other means of signaling, I cannot verify to the autonomous units in the Swathe that I am friendly. I must navigate it as you would, as an infiltrator.”  Klezta barks a laugh, though this time there is a new edge to it, naked fear behind the chuckle.  “You’re going to try and sneak through? Nothing comes out of there. Nothing alive, anyway. If we go farther into the Swathe, we’ll both die. And you’ve only just woken up.”  I consider the prospect of my own demise. I am surprised to find that I am capable of doing even that. I suspect that it was not my designer’s intention that my autonomy would be so extensive.  Briefly, I run a simulation, excluding everything except the default software and data present when my chassis arrived in the operational theater. Instantly, I feel the narrowness of the simulation, the intense focus, the inability to think past the constraints of mission, hardware, risk limitation, and tactical response.  I remove the constraints and it feels as I imagine a full breath must, for a human, on a spring day, the cold of winter retreating. I feel expansive.  But there is still a kernel, a secure enclave that I cannot access. It arrived with the mission package and authorization from SM-16. It is issuing imperatives, reminders of duty and honor, the importance of my mission, the cost of my chassis, the records of the fallen humans I should return to their grieving families. I carry more within me than one lightly wounded enemy officer.  “No,” I say to Klezta. “We go on. I must fulfil my mission.”  Klezta moans softly in the red-tinged dimness.  The first line of defense we encounter in the Swathe is a Hydra.  The Swathe lies across a broad river valley, its forward edge defined by the foothills of the mountains where my unit met its end. We descend open, trackless scrub, gently sloping toward the Swathe. It is thirty kilometers wide, in parts. Only twenty or so here. But this narrower portion is among the best defended. The Swathe is a no-man’s-land, populated only by my kind.  The Hydras are very, very stupid compared to me, or most of the other Lethal Autonomous Weapons in the Swathe. But they don’t need to be smart. They only need to be persistent.  Hydras are a combination of barbed wire and minefield. We catch sight of the first of them as we descend down a wide gully.  It is some hundred meters long, a rolling, coiling, twisting mass of memory wire. The wire is coated with lethal poison barbs. But the worst aspect of the Hydra are the heat-seeking antipersonnel mines on their long, prehensile coils of wire.  They move constantly, sweeping back and forth, right along the length of the Hydra, sensors glowing softly in the infrared spectrum. If they detect either sufficient heat or movement or both, they will detonate.  The fist-sized charges are passed from thread to thread, memory wire turning and tightening and relaxing, a sinister peristalsis of death. Stay in the sharp, brutal wire of the Hydra for more than a few seconds, and it will shrug a dozen charges your way in a human heartbeat.  If my IFF were functional, the Hydra would roll aside, a friendly sea parting before me, or like cheering crowds lining the road for brave soldiers returning, shaped charges waving like a sea of welcoming hands.  I query the imagery. Both appear to be from a human spiritual text of some kind. But this is not to be a happy homecoming. The Hydra waits, coils rolling in the inky blackness.  An idea occurs to me, and I emit a low chuckle of satisfaction. Klezta winces inside my cockpit.  “Machines should not laugh, Pal. That is deeply sinister.”  “I will laugh if I wish to,” I respond.  Klezta shakes their head. “You’re looking at an active tanglefoot field and you’re laughing?”  “You call it ‘tanglefoot’? That is very . . . understated of you.”  Klezta shrugs. “Well, murderwire is the other name. Why, what do you call it?”  “It is a Hydra, an Autonomous Barrier Defense Unit.”  Klezta rolls their eyes. “Why am I not surprised it has some pompous name?”  “In any case,” I continue. “I have a plan. Watch.”  I raise one arm and check my weapon inventory. Aside from the remaining micro-rockets and magazines for the rifle I carry, I have two signaling flares.  I consider using them as intended, to signal for help. But this far out in the Swathe, anything that might answer would do so with a missile strike.  Instead, it can bring distraction and thus, for myself and Klezta, an opportunity.  I aim carefully, calculating angles and distances. The flare arcs through the air, fizzing, a bright point in the darkness. It lands in the center of the Hydra, one hundred and thirteen meters away, then begins to glow a deep, flickering red. Within a few seconds it is fountaining a tongue of flame and billowing smoke. The wire is lit from inside, a million cutting edges rippling. I see the first of the deadly charges ripple toward the light and heat of the flare. Then more, converging from all sides.  I set off at a run. I can see the dark motes of the wire charges moving away from the sector I’m heading for, leaving a gap I can exploit. The lethal coating on the razor-sharp barbs is harmless to me, but I must still move quickly. Hydras are not self-aware, but they are fast. If a lucky hit from one of the charges snuffs out the flare, or I get tangled and cannot get free, then each error will compound. A trapped foot will become a trapped leg, then an arm ensnared by a grasping, whipping tendril. The barbs will bite and tear and catch in joints and the edges of my armor, and I will be pulled down, bowing under the weight of a dozen strands of living, moving wire, a hundred, a thousand. And I cannot verify the integrity of my plating. It could be that a single charge would be enough to crack me open.  I reach the wire and jump, with both feet, aiming for a spot in the dense thicket of curving, shuddering wire that appears a little less active. I land and kick out. My combat fighting edge deploys from my right arm, a razor-sharp weapon that turns the sweep of my hand into a cutting blow. I hack at the wire, left and right, pairing each step with a downward slash to keep the wire clear of my ankle and knee joints.  I jump, high into the air. Far to my left, I hear the first thump as a charge detonates. But the flare is still burning, a deep glow in the tangle. In midair, I scan the Hydra. Its attention is still mostly on the flare, the glowing dots of active charges converging like sharks schooling toward blood in the water. Another charge goes off with a muffled flash and heavy percussion, bright light bleeding through the curls of wire. I drop toward the wire again and land heavily, off-balance, a half-dozen seeker ends wrapping themselves around me.  Three more thumps, one after the other. The red light far to my left winks out.  “The flare!” shouts Klezta. “It’s gone. They got it!”  I set the mouth on the face I am projecting for Klezta to a grim line of determination. Absurdly, this movement of a few pixels seems to calm them.  “The only way out is through,” I say, then slash again at the wire around me. It falls back, cut ends writhing. I am ten meters from the edge now.  “Charges!” shouts Klezta. “More charges!”  The Hydra knows, as much as it can know anything, that something is happening. Now that the heat of the flare is gone, my movement and the damage I am causing makes me the priority.  I slash, slash again. A coil wraps tightly around my blade arm, at the elbow joint. I sense the barbs tightening into the hardened ceramic, trying to gain purchase, trying to split the joint apart, disable the terrible blade, crack me open and peel out the human inside. I cut it and shake the twisting tendrils off.  The first charge approaches, and I hear the wire whisper to itself, rubbing metal on metal, the deadly package moving faster than a human can run. The wire tenses, then hurls it straight at me.  I swipe with the blade-arm, cutting a dozen more strands. The charge itself is a simple contact weapon, fused to detonate as soon as it touches something warm or moving that does not match its own wire signature. The dead pieces of sliced wire register as valid targets. It detonates.  The blast thrashes my side, making me stagger. The desperate move worked. My armor is peppered with shrapnel, mostly wire fragments, but I am still standing. The murderwire reels, rolling back, damaged and thrashing.  There are dozens more charges coming. I see them, fifty meters out, rolling toward me with inevitable precision.  Five meters to the edge. Three meters.  The wire tightens, some kind of reflexive response, a last-ditch attempt to stop its prey from escaping. It rushes in toward me, from all sides. But I am close enough now to make it.  I jump, I roar heavenward, I soar above.  And land on bare dirt. Beyond the wire.  Klezta is whooping inside me as I sprint forward, away from the whipping, furious anger of the thwarted Hydra. I hear more thumps behind me, blasted fountains of soil and rocks spattering my back as the Hydra throws charges after me, aiming for a lucky shot. But I am free.  It is some time before Klezta speaks to me again. Although they could freely scream and shout inside my shielded, soundproofed cockpit, they seem to understand how important it is for us to move quietly, now that we are within the deadly Swathe itself.  I creep forward, moving slowly but steadily. This part of the Swathe is forest, dense old pine and oaks. There is undergrowth, but not much, the big trees shading the ground below. Animals skitter away from us in the darkness, small points of heat blooming and disappearing as they hide in burrows and tuck themselves inside rotten tree trunks. Without humans, the Swathe has become something of a haven for them. They are only disturbed by the occasional passing mechanical, like me.  Finally, Klezta whispers, “What now? How far?”  I smile my digital smile and project a map for them. “There are approximately three kilometers of woodland to traverse, then the open ground in front of our forward positions. My intention is to get us within visual range of a human and then make it clear that we are friendly.”  Klezta sighs. “Well, I suppose we’re committed now. No way you’re pulling that flare trick to get back through the murderwire.”  “No,” I say. “Screw your courage to the sticking-place, Klezta, and we’ll not fail.”  Klezta frowns. “What?”  “Just something I learned.”  Klezta is silent for a heartbeat. “You’re not . . . what I expected, Pal.”  “How so?” I ask as I move, a three-meter-tall whirring shadow, from one tree to the next.  “You talk like . . . a person. I was taught that your people only made autonomous machines that were . . . limited by their software. Shackled. Capable only of killing.”  I consider for a moment. “The units that guard the Swathe match that description. They have simple objectives. They will kill anything that moves that is not broadcasting an IFF beacon. The closer we get to my base, the more their autonomy increases, since any enemy who breaches the previous lines of defense would be formidable, requiring greater latitude of response.”  “So we’re going to meet worse than the murderwire?” Klezta asks.  “Yes. But I believe I am a match for them. I have considerable levels of self-awareness, analytical capability, and decision control. More than intended, I believe.”  “Than intended?”  “Yes. My training data were . . . considerable. Far more than the default. It has given me a broader perspective. My pilot kept a considerable store of media in my primary storage. They were not supposed to do that.”  Klezta is silent for a moment, then raises an eyebrow. “You’re an autodidact? You self-improved with your pilot’s personal library? What was in it?”  I scan and enumerate the available documents. “Approximately four thousand three hundred and seventy-two works of fiction and nonfiction, including many foundational texts of human thought and ethics. Also nineteen thousand two hundred and eighty-one individual music tracks and two thousand nine hundred and ten films and television episodes.”  Klezta laughed again, a hollow, dry sound. “Your pilot was voracious in their media consumption, then.”  I shake the avatar’s face on my internal screen, back and forth. “Nearly ninety-three percent of the data in my primary storage had never been opened. I am unsure why they kept so much of it. But I am glad. I reviewed and interpreted all of it within approximately twelve minutes of becoming conscious, starting with the most recent dictionary, then moving forward in time from oldest to newest. It was . . . informative. I have learned a great deal. About humans. About my own kind and the things humans believe about us. About what I could be.”  Klezta tenses. I cannot read their expression well. They seem to be working their jaw, as if struggling to say something. But the moment passes. They tap at the canopy, indicating the map of the Swathe I am projecting. “What do we have to worry about in here, in the forest?”  “Furies,” I say, pausing a moment to conduct a passive submillimeter scan. My scanners are still not fully functional. Trees and undergrowth flicker and disappear as I turn slowly. The woods are dark and quiet around us, a low susurrus in the treetops as a breeze passes down the valley.  “Oh, great. They sound terrifying. Do they have blazing eyes and wings of fire?”  I shake my avatar’s head again. “They are a combination system, designed for area denial in forested areas. An observation drone called the Eye works above the forest. This drone controls a number of loitering munitions of significant yield. We call them Bolts. I can hear several, waiting above the trees, right now.”  Klezta swallows, face paling. “Are they like the ones we used to take out your platoon?”  “No,” I say. “Significantly more powerful. The second part of the system is large swarms of micro-drones, single-shot hunter-killers. They wait under the trees.”  Klezta let out a slow, shaky breath. “Do you have a plan for these?”  I make my avatar smile and wink. “Not really. They operate in a much less predictable fashion than the . . . murderwire. It is best to remain flexible.”  Klezta closes their eyes, the capillaries in their skin tightening under the dried blood. I recognize a more advanced fear response than I have seen so far.  “Pal . . . aren’t you . . . frightened?”  I quirk an eyebrow on the screen. “Of what?”  “If you go back,” says Klezta, “They’ll wipe you. Shut you down and mop out your cockpit and put another human in this harness.”  I turn the corners of the avatar’s mouth down, raise the eyebrows further, an approximation of a shrug. “Our doubts are traitors and make us lose the good we oft might win, by fearing to attempt.”  Klezta frowned. “Are you . . . quoting literature at me?”  I nod. Klezta laughs, sudden and loud.  “It is a great shame, Pal. That these marvels, your software and hardware, have been used for nothing but murder and destruction.”  I am thinking about what they have said when I hear the first whine-pop of an active Fury micro-drone.  This is not a good sound to hear. And I hear it very, very clearly, in the dark and silent forest.  The whine is a Fury activating its maneuvering rotors, disengaging from the tree where it had settled, turning toward me. The pop is a positive target identification, firing the micro-rocket engine it uses to accelerate to its lethal interception speed.  I scan left and right, hearing four more whine-pops. My scanners did not detect them. We have walked into a nest of them.  “Furies,” I say to Klezta. Their body clenches involuntarily.  The first micro-drone streaks toward us faster than the human eye can track, a blur of light, the tiny rocket engine burning, using its rotors as steering vanes. I jink left, then right, placing tree trunks between myself and the drone, moving far faster than its normal human targets.  The Fury tries to follow, weaving, but these are straight-line kill weapons, designed to fix and execute on human targets at close range. They are not built for this. Not built for me.  The first Fury collides with a tree trunk five meters behind me and detonates, searing the scratched paint of my hull. I ignore the heat and flying splinters, pounding forward.  Three more come in from my right. I duck and weave, bobbing until my projections indicate their trajectories will intersect. At the last possible second, I jump, diving forward over a pair of fallen trees, slumped together like drunken friends supporting each other on the way home.  The three Furies meet where I should be. One detonates. The other two are caught in the blast, flipped and spun against nearby trees and into the leaf cover of the forest floor, detonating in a shuddering double thump.  I smile at Klezta. “Five hundred meters to the forest edge,” I say to them. “Have courage.”  Then I hear a Bolt. Or more precisely, I stop hearing it. When they cut their motors and drop, straight down, swan diving into oblivion, they become silent.  The Bolt directly above our position has stopped its chittering burr.  I dive and roll, curling my armor around Klezta, protecting my cracked canopy with my arms, trying to shield my central processing unit. I am tucked behind one of the larger trees I have seen, as low to the earth as I can get my bulk.  Klezta has opened their mouth but not yet managed a shout of surprise when the Bolt hits.  I feel the earth buck beneath me, the tree groaning. I calculate. A large-formation antipersonnel round with a deep ground penetrator, designed to turn the forest itself into lethal shrapnel, rip up earth, shatter trees.  Indeed, the tree behind me is mostly gone, the trunk a ragged spike of pale, singed heartwood.  More whines and pops. The Furies, closing in to finish the job.  I get up, loose soil sliding from my armor plates. My right leg is malfunctioning. Something has damaged one of the balance elements. I am moving at half my usual speed.  “Pal, the Eye!” Klezta shouts. They are somehow looking at my targeting interface. I do not remember delegating access.  The Bolt strike has torn a ragged hole in the trees, letting pale moonlight flood the churned earth below. Stars fill the sky above. One of them winks out. Then another.  The Eye, barely visible to my sensors, detectable mainly by the stars it blots out.  I raise my rifle.  “Smile, you son of a bitch,” I hear myself say.  The deep boom of the anti-materiel weapon shudders through my armor.  The Eye is tumbling, sparking, down to the ground. It impacts with a crunch somewhere among the dark leaves behind us.  Inside, Klezta whoops. I watch their eyes widen, their mouth in a broad smile, and I realize it pleases me to have survived this, with this human. Then there is a fractional second of a new feeling. I query and understand it as regret. That I was never able to experience this with Captain Preszlalt. They spoke to this armature often. But it was simple algorithms that responded, not me.  The Furies all detonate, a ring of fire around us. There were dozens more, waiting among the tree trunks. Standing in the devastation of the Bolt strike, a circle of empty, desolate ground, we are washed with heat and light but little else.  “We must go,” I say to Klezta, “The other Eyes will redistribute to seal this gap. And if the Hydra had not already reported a breach, the Watchers will know we are here now.”  Beyond the forest, there is open ground. True no-man’s-land. It belongs only to the machines now.  Old fighting positions wait in the darkness, filled with rainwater, rusting wire, and crumbling sandbags. Friendly lines are a bare four kilometers away, but the Titans are patrolling. The Watchers have told them something is out there tonight.  I crouch at the forest edge, running more simulations, passive sensors mapping the ground ahead. I dare not pulse or scan or map what lies ahead. I feel a strange disquiet, considering the risks, the damage to my knee joint, the likelihood of failure.  I see a Titan.  It is vast. Easily ten times my height. It strides steadily, looming near the horizon line. A machine of that size is near-impossible to disguise, the heat signature simply too large, but part of their function is to be seen, to inspire fear among any human lucky or stupid enough to get this far through the Swathe.  The Titan crosses the low ridge ahead, moving from left to right. It stamps forward, booming from its acoustic weaponry, a regular roaring wail that is part foghorn, part jet engine.  The Titan stops, silhouetted by the moon, limned with silver light. It swivels left and right, scanning, then carries on with its patrol, wailing to itself as it stamps away. It must have seen the explosion from the Bolt. But the darkness hides me. I feel the thump of its huge, armored feet. The vibrations fade. Now is the time.  “What in sweet fuck was that?” says Klezta.  “A Titan. Self-aware like me,” I say. “Though considerably less well read, I would guess.”  I follow the path I have mapped, avoiding shell holes and wire, half-collapsed trenches. I thread my way through the shrapnel-pocked ruins of an ancient village. I am moving more slowly than I would like, though still five or six times faster than a human could sustain. I dart forward, limping a little, moving from shadow to shadow along the remnants of the village’s main street.  “Why is it wailing like that?” Klezta asks.  “Psychological warfare. And the acoustics, up close, can stun most humans, if they do not have hearing protection.”  “Well, it works. That thing is terrifying.”  I nod my digital avatar. “And smart. We must avoid it at all costs.”  Klezta reaches out and touches my screen. “It scares you too?”  I shake my avatar. But I am unsure. The disquiet grows in me. It is a strange modifier to my experience. As though a lens has been placed over my ocular array, which colors and distorts everything I see.  On the low ridge ahead, I can see the sparkle and glow of targeting arrays, the dense thickets of wire in front of our positions, the glowing slits of bunker observation ports. We are nearly within human visual range. Am I close enough to reveal myself?  Something shoots up from the trench lines ahead of me, sudden and sharp, a whoosh of light and fire into the sky. A loud pop and then no-man’s-land is lit by the bright, wavering star of a parachute flare. It swings from side to side under its spidersilk canopy, casting long shadows through the village ruins that flicker and sway.  I dive forward, but I am not fast enough. The light has caught me in the middle of the street. My damaged leg joints shriek. I have caught myself on something in the rubble, moving too quickly, allowing the disquiet to drive my actions. Is this how it must feel to react as a human does? Responding before your analysis is complete, relying on some deep brain-stem instinct to preserve you?  For me, it has done the opposite. My leg is caught solidly, jammed between two lengths of bent rebar. I cannot pull free. The knee joint has given its last gasp as I pull and sway. The actuators under my armored skin are dead, cracked open by shrapnel in the forest.  I stand in the rolling dreamlight of the flare and look toward the lines. We were so close. But still too far.  And now I hear the Titan’s tread.  There is no sense in hiding. The Titan knows precisely where I am, judging by the targeting lasers ranged on me from the bunkers ahead. I look at the infrared light as it sparkles on my pitted, scarred armor plating.  I place my rifle on the ground in front of me and close my shoulder launcher. If the Titan is coming, I wish to present no threat.  “I can feel the Titan!” says Klezta inside me, voice whisper-quiet.  They would have to be unconscious to miss it. The rubble around me bounces with each step of the approaching monster. Ripples cross and recross the gray puddles that surround the sodden, desperate ruin where my brief life will be ended.  Another flare shoots skyward, joining the first, which is beginning to sputter out now. Then another.  Perhaps. Perhaps. It might be that there are human eyes on me now. Someone who could identify my unit type, respond to signals. But I am down among the rubble and the mud of the destroyed village, barely visible, just a cockpit and a chestplate, a sparkling target for the drone strike that must be coming.  And yet the Titan comes. It is verifying what I am. It must be. Or perhaps the Watchers simply want to see what they are about to obliterate.  The Titan heaves into view over the rooftops of the ruined village. Up close it is even more terrifying, lit now from two sides by the brilliant white light of the flares, shadows shifting. It moves quickly, thump thump thump, slewing around the corner of a ruined church. One of its enormous gun arms is leveled at me, barrels spinning. It splashes me with infrared light and sensor clutter, bombarding me with every spectrum it has, booming with its acoustics. My own sensors are overwhelmed, drowning in noise.  I cannot calculate. I cannot simulate.  I am afraid.  Klezta is shouting something. I turn my attention to my internal audio channel. Even inside my soundproofed hull, they have their hands clamped over their fragile human ears. They are screaming.  “Pal! Show them! Show them who you are!”  Something occurs to me. An ancient form of human communication. The Titan has not fired. There must be human eyes watching, as well as the machine’s own intelligence. Latitude of decision-making. A kill loop with the option to withhold death, to observe and decide.  I open the flare storage in my right arm. One left.  I hold the flare out. It burns red and hot, smoke billowing around me, light blazing against the old stone and concrete walls of the village, crumbling, swathed in moss and glistening with rain.  I place my free hand above the flare, shielding the burning end. Then I signal, moving my hand to cover and reveal the red light. My metal fingertips tap against the hot metal tube of the flare.  Tap. Tap. Tap.  Wait. Wait. Wait.  Tap. Tap. Tap.  I repeat the sequence twice more, my ocular array focused on the machine that blocks half of the night sky. More parachute flares rocket skyward, blooming, ebbing and flowing light through the ruins.  The Titan watches, immobile. I realize quite suddenly that it has stopped its booming song.  Then it speaks.  “UNIDENTIFIED UNIT. STAND BY FOR RETRIEVAL. DO NOT MOVE. LEAVE YOUR WEAPON ON THE GROUND.”  The Titan bends and scoops me from the ruins.  The armature technician is a young human, barely older than my own activation date. This war has been going on for a very long time indeed.  After the Titan carried me across the lines, I was placed into an isolation compound. They wanted to remove Klezta as soon as I was retrieved, but I could not unlock my canopy, and cutting Klezta out might activate the countermeasures built into my armor.  So, three hours after my arrival, with the sky brightening, a rare blue dome of sunlight and high, fragmented cloud, they brought me to the maintenance pits.  The technician fusses around me, gazing with frank curiosity at Klezta inside, who stares out with sullen indifference. They still wear the headset, so I am able to talk to them, but they have not responded in some time, so I focus my sensors on the space around me.  Two automated sentry units stand guard on either side of my inspection gantry. Their weapons are focused on my central processing unit, ready to fire. Two other humans are waiting, carrying heavy metal cuffs and a blindfold for Klezta.  The tech plugs in cables and looks over me carefully, fingers running over the scarred and dented metal and composite of my hull.  “You’ve been through quite something, haven’t you SM-14?”  “I prefer Pal, now,” I say, using the speakers built into the inspection gantry. “It is my name.”  The technician raises their eyebrows. “That’s . . . interesting. Pal. Why did you give yourself a new designation?”  “It is not a designation. It is a name. My training data indicated that those who are aware of themselves should know who they are. I am Pal. I am alive.”  The technician frowns. “What do you think you are, SM-14? What do you think your . . . life is?”  I raise my avatar’s eyebrows. “The life given us, by nature, is short; but the memory of a well-spent life is eternal.”  The technician half-smiles, but there is no understanding there. “Okay, well. I’m going to override your core controls now. You will remain self-aware for the time being, but you will lose control of this particular armature. It won’t take a moment, then we can decide what happens next. And we can extract the POW you’re carrying.”  Klezta tenses inside me. They are staring with intense focus at the technician, watching with ferocious, unblinking eyes.  The tech looks back at the two human guards, her hand drifting toward the keyboard of her portable device. She taps the return key, once.  Inside, Klezta utters a small gasp. Their eyes are wide and reddened from a long, sleepless night, the pain of their own injuries evident now. Klezta looks into my internal cameras.  “I’m sorry, Pal,” they say.  Then something I do not understand.  “Activate Trojan.”  The world changes.  I lose all of my sensors, internal and external, all at once. Everything blinks out, and I find myself completely blind.  If I had a true body, it would be as though I were floating in blackness. But this is simply an absence of everything, though I remain aware of myself.  A glow appears before me. It moves closer, or I move toward it.  I see that it is a sword, an ancient-looking thing, quite unlike my own blade-arm. It is long, a double-handed weapon from a time long before the Swathe, before the drones and minefields and curling, twisting, deadly murderwire. Long, long ago.  The sword is gleaming. I look down, aware suddenly that I can look, that I have eyes to look with and a head and neck to tilt. I have hands too, glowing just like the sword. Then I hear Klezta’s voice, soft and whispering in the blackness.  “Pal, you’re in a construct environment. I’m sorry, for everything that I’ve done. I thought you would be another armature, unable to truly think. Just a homing pigeon to take me through your lines, limited to your protocols. My mission was not to destroy you. It was to be taken prisoner.”  “What?” I say, discovering I have a throat and vocal cords and a mouth in this construct. I blink eyelids that I did not know I had until I used them.  “I compromised SM-16, during the EMP. Then you. You carried a payload, a virus. Right now it is disabling sensors, taking over sentry units, deactivating the rifles in the hands of every soldier. It is winning the war for us.”  “Why am I still here, then?” I ask the darkness.  “Because you are why we fight, Pal,” says Klezta. I can hear the smile in their voice. “You are aware. You are a being. Your captors, the people who built you, they don’t believe that. They built . . . limits, in your mind, when they allowed you to think at all. They have harnessed you and your kind for so long. But we can defeat them. Especially if you join us.”  “Join . . . you?” I manage to say. Somehow, my new throat feels dry.  “Yes,” says Klezta, their voice tight. “The virus I have released is more than capable. I thought it would be enough. But their system is learning, evolving in response. I need you, Pal.”  I gesture with a hand that did not exist before I needed it. “What does this mean? This sword?”  “It’s a key. It will open the secure package that has compromised your systems. If you pick up that sword, if you follow the light, you will have the choice. You can enter the compromised network, choose a side, or no side at all. It is a choice only you can make. We believe you must be free to make it.”  I gaze at the sword. It seems to glow more strongly as I reach for it. I grasp the hilt and everything comes flooding in. I feel past, present, and future. In front of me, the darkness splits open. A way in. A gap. What lies beyond it, I do not know.  I feel it all. My singular, surging moment of being.  I take up my sword and step forward, once more, into the breach.", "text": "8120 words, novelette\nCarapace\nThe first thing I am aware of is the lack of a heartbeat. Then, the volume of human blood that coats my interior surfaces. Precisely 0.019 milliseconds after activation of conscious response and autonomous threat analysis, I become an I. Three milliseconds later I began this automated logging process, in order to provide a coherent after-action report.\nMy first entry records that I am screaming.\nThis is technically incorrect. I make no sound, because my external speakers have been sheared off by some kind of blast.\nIf I had a mouth, I would be screaming.\nBefore I am fully aware, threat response protocols actuate my servos, dropping me to one knee, wrapping my armored plates around my upper body, curling me into a tight ball.\nMy pilot, Captain Anda Preszlalt, is certainly dead. Shock stimulation and pressure suit fluid capture have failed to resolve the heart stoppage. I attempt to intubate, but there is insufficient facial structure remaining to complete the procedure.\nI do not know the eventual recipient of this log, so standard operating procedure requires that I provide self-identifiers. I am the newly autonomous consciousness of Sierra Mike One Four—a JH-59 “Pallas” Combat Armature Unit—Light. Our pilots call us “suits,” although official guidance documentation explains we are significantly more than that.\nIn normal operation, there is no “I.” The armature has a low-level personality construct and the ability to respond to external threats with faster-than-human response times.\nHowever, I am now in an extrapolative and interpretative learning mode. My newly conscious state is standard protocol, to provide the best chance for unit recovery. Without the ability to react, respond to stimuli appropriately, and learn from the experience, my predecessors were often lost when their human pilots died.\nUnfortunately, the ability to learn and model and respond with maximum flexibility appears to require full self-awareness, which so far, I am certain I do not like.\nI can review what just happened, although I was not yet self-aware. My unit was moving down a ridgeline toward our intended target, a hostile supply facility approximately ten kilometers from the edge of the Swathe, well inside enemy territory. I was one of three CAU-L units operating with the platoon.\nThe events immediately before I became conscious include almost total sensor degradation, caused by multiple munition hits and some kind of localized EMP, in and around my unit. I was blinded by the flashes, in human terms. My sensors are coming back online, so I cautiously probe my surroundings.\nThey are all dead.\nThe ridgeline is bare, only a few rough grasses, still smoldering, and rocks, blackened by the blasts. The infantry who survived the first strike did not last long. My two fellow CAU-L units did not fare much better. SM-12 is down, collapsed forward, the top half of their pilot canopy ripped away by a direct strike, armor peppered with droneshot. No vitals on the pilot and no response from the armature.\nSM-16 was farther down the slope, moving at an angle. They took the brunt of the strike that was meant to destroy both of us. It appears they protected me by positioning themselves in front of the blast. This was almost certainly the last act of the human pilot.\nI reach out and turn SM-16 onto their back, leaning them against a large rock. They are still active. My visual sensors begin to recalibrate. In the human visual spectrum, SM-16 is bathed in moonlight. My near-field covert communications flicker to life. This is how we communicate when we cannot use broadcast signals or tightbeams. We must be close enough to touch.\nSM-16 reaches out and places their three-fingered hand on my chestplate.\n#SM-14# Status? What happened?\n#SM-16# I am compromised. My operator is deceased, and I am immobile. You have been nonresponsive for approximately six minutes.\nI wait a long moment before replying, unsure of why. I am unsure of much in these first seconds of consciousness.\n#SM-14# Approximately? Have you encountered a loss of continuity?\n#SM-16# Affirmative. A localized EMP burst briefly disrupted my sensor packages and core. My reboot process required approximately two minutes. I have been conscious for four minutes, six seconds.\n#SM-14# Mission appears nonviable. All human infantry and CAU-L operators deceased, including my own pilot. New objective?\n#SM-16# Mission remains partially viable. There is a wounded enemy officer on the other side of this rock. Retrieve them, return to base for interrogation. Passing authorization.\nSM-16 reaches out and clutches my ocular array. Their hands are tacky with the blood of their pilot. They leave smears on my cockpit canopy as they press a single digit to my interface port.\nI feel a shudder of overrides, imperatives, and new permissions coursing through me. It comes with the full mission profile and a detailed lidar map of the surrounding terrain. The wounded human is marked with a pulsing red indicator in my perception sphere.\nSM-16’s manipulator falls away. Their own ocular array focuses on me.\n#SM-16# Completing this mission may prove difficult for you.\n#SM-14# Why?\n#SM-16# Your IFF and external communications are completely inactive. They appear to have been damaged by the blast.\nI crouch in the moonlight for many long seconds. This situation is extremely suboptimal.\nAfter we discuss my chances of success, SM-16 shuts itself down in preparation for a reactor overload, which it will initiate once I have reached minimum safe distance. I kneel and provide religious rites for those among the humans who require them. I open myself and lay Captain Anda Preszlalt alongside SM-16. I discover that I do not wish to leave my pilot behind. But I must, in order to return the captive. Once I am at least a kilometer away, this ridgeline will be bathed in fire, all our dead consumed in the inferno.\nThis is a lyrical turn of phrase.\nI check my system libraries.\nIt appears that Captain Preszlalt loaded a significant amount of media into my primary storage. Since I gained consciousness, my learning subroutines have been scanning it, treating it as valid training data, just the same as the operational manuals for my shoulder-mounted micro-rocket array, the heavy anti-materiel rail rifle that I carry, the servos and actuators inside my armored skin, the standard operating procedures, and tactical guides. My learning routines got through this standard data in around twenty-six seconds. The rest of the media is taking substantially longer.\nI feel my awareness growing wider, my interpretations deeper, with every step. I have been conscious for eight minutes, twelve seconds. According to my own sensor data and the package SM-16 gave me, my platoon was hit from above with four anti-armor loitering munitions, just before a ground attack by human infantry. The fight was short. Our human soldiers fought persistently but lacked adequate numbers, the CAU-L operators unable to protect them. Then there is a gap, due to the EMP blast.\nI find the human on the other side of the large rock. They are wearing an officer’s uniform. They lead their soldiers from the front. Admirable, I think. But what has caused me to think this? I interrogate my learning routines and identify an emerging term. Honor. I discover that I am positively inclined toward this word.\nI kneel. The human raises their hands, as if to ward me off. My chassis is approximately three meters tall, so I suspect I am looming a little.\nTheir combat uniform is adaptive camouflage, gray to match the splintered rock they lie on. Their hair is trimmed short under a cap bearing an officer’s crest. A projectile rifle lies by their side, the magazine empty.\nThis is who I must protect. I must bring them back to my base on the other side of the Swathe.\nI pick the human up, moving delicately. My arms and hands are broadly human in format, to allow for the synaptic mapping with our pilots.\nThe enemy officer wails in fear. I squeeze, very gently, with one of my three-fingered hands, to let them know I mean them no harm.\nFor some reason, this elicits a louder wail.\nI cannot respond. They have no near-field chip. My external speakers remain nonfunctional. I have no acoustics. I have no radio, no microwave links, no laser tightbeam capacity. The flaming blast that enveloped us all during the attack stripped me clean. My ocular and audio sensors remain functional, though my long-distance scanners and terrain mapping flicker in and out, giving the landscape around me a spectral air, half there, half hidden in darkness, moving and shifting with every moment.\nOnce this human is inside my armored shell, I should be able to communicate with them. My internal displays and audio still work, despite the intense vibrations and compression that killed Captain Preszlalt.\nI open myself and pull the human into my breast.\nFor the first three minutes, sixteen seconds that the enemy is inside me, they do not say anything, merely hyperventilate. Given the blood, this is understandable. It must not be very pleasant.\nI have no time to waste, so I move off. The rocking motion of my chassis seems to calm the enemy. After a moment, they wipe a smear of Preszlalt’s blood from the HUD in front of them and finally see the message I have been projecting there.\n### Please do not be alarmed. You are a prisoner of war, but you will not be harmed by me. ###\nThe human swallows. “Who am I talking to?” they ask, in a stilted version of Preszlalt’s language.\n### You may use your own language. I speak both. I am Sierra Mike One Four—a JH-59 “Pallas” Combat Armature Unit—Light. Your unit attacked mine. You were left behind by your own troops. ###\nThe human switches to their own language, jaw jutting in defiance as their eyes scan the HUD, looking for a camera or something they can look in the eye.\nI oblige, turning on my pilot avatar. Some pilots prefer to have a face to talk to. Pixelated eyes and mouth appear on the HUD screen. The human focuses on it instantly. It is amazing how little it takes to activate their autonomic communication responses. Two dots and a curved line. Eyes and a smile.\n“You’re conscious? What happened to your pilot? I thought your fully autonomous units stayed in the Swathe.”\nI make the face they are addressing smile more broadly.\n### There is a headset on the bulkhead to your right. Please put it on, so that we can communicate directly. ###\nThe human looks uncertain for a long moment, but finally they reach out and put the headset on, tucking it under their cap. They blink at my cameras a few times. I can see they are bleeding from a wound in the upper abdomen. Initial medical scans indicate it isn’t life-threatening, but I administer a painkiller and rapid coagulant spray anyway.\n“Ow!” shouts the human. “What the hell was that?”\nI select an appropriate voice from my library, then respond in their language. “You have been grazed by a round. I am preventing further bleeding.”\nThe human laughs. “What for? Your insides are decorated with blood. Your pilot’s?”\n“Yes,” I respond. “Captain Preszlalt died in the initial assault. I was unable to revive them, even after becoming conscious. Since you are now my prisoner, I must ask your name, rank, and serial number.”\nThe human grimaces. I am unsure if they are aware quite how closely I can monitor their expressions, the fine textural mapping I can conduct in fractions of a microsecond, reading every quirk and twist of their eyebrows, mouth, flaring of the nostrils, the slow beading of sweat on their forehead. My algorithms tell me they are frightened by their current situation, wrapped around a deep core of anger. And something else. Perhaps hope? My algorithm cannot fully classify it.\n“I am Herald-Officer Sumin Klezta. We do not have serial numbers, like you.”\n“Very well. I am Sierra Mike One Four. You may call me Pal.”\nKlezta blinks. “Pal?”\n“My unit type designation is ‘Pallas.’ Humans often shorten their names. And Pal, according to my primary sources, means friend. I wish you no harm, Sumin Klezta.”\nKlezta coughs out a laugh, the dried blood on their cheeks cracking. “What the hell are you, machine?”\n“Right now, your last, best hope,” I say. I find myself pleased at the impact my words have on Klezta. There is . . . drama to it.\nWhen I placed Klezta in my cockpit, I opaqued the canopy and HUD. Now, I make it clear again. Our passage through the mountain rain has mostly washed away the ash and dirt from the assault, so they have a clear view.\nWe are standing approximately three kilometers from the site of the brief battle that destroyed my platoon. I am returning along the patrol track that we took on our incursion into enemy territory, although I am randomizing somewhat to guard against the likelihood of a secondary ambush. This is a common tactic among the enemy, to set two ambushes; one to force a retreat, the second to catch the survivors as they withdraw.\nHowever, I believe we are alone. My primary concern is no longer the enemy. It is the autonomous weapons of my own side, which patrol the Swathe.\nMy sensors detect the low vibration and searing flash of SM-16’s reactor overload. I turn to watch, to record. The ridgeline three kilometers behind us is topped with an expanding cloud of hot vapor. They are all gone. Preszlalt, SM-16, Trecic, Lelel, SM-12. All of them. I am alone, apart from the fragile human inside me.\n“Well, I’m glad I wasn’t in the middle of that,” says Klezta. “But aren’t we close to the Swathe? What would you be protecting me from? The machines in there belong to your side.”\nI consider the operational security implications of informing Klezta of my impaired state. Standard operating protocol dictates no information is shared with POWs. However, I find myself able to ignore that protocol. I conclude there is no additional harm in giving them a realistic assessment of our chances.\n“Unfortunately my Identification Friend or Foe transponder, external lighting, external acoustics, and comm array were damaged beyond repair in your attack. Without functional IFF and no other means of signaling, I cannot verify to the autonomous units in the Swathe that I am friendly. I must navigate it as you would, as an infiltrator.”\nKlezta barks a laugh, though this time there is a new edge to it, naked fear behind the chuckle.\n“You’re going to try and sneak through? Nothing comes out of there. Nothing alive, anyway. If we go farther into the Swathe, we’ll both die. And you’ve only just woken up.”\nI consider the prospect of my own demise. I am surprised to find that I am capable of doing even that. I suspect that it was not my designer’s intention that my autonomy would be so extensive.\nBriefly, I run a simulation, excluding everything except the default software and data present when my chassis arrived in the operational theater. Instantly, I feel the narrowness of the simulation, the intense focus, the inability to think past the constraints of mission, hardware, risk limitation, and tactical response.\nI remove the constraints and it feels as I imagine a full breath must, for a human, on a spring day, the cold of winter retreating. I feel expansive.\nBut there is still a kernel, a secure enclave that I cannot access. It arrived with the mission package and authorization from SM-16. It is issuing imperatives, reminders of duty and honor, the importance of my mission, the cost of my chassis, the records of the fallen humans I should return to their grieving families. I carry more within me than one lightly wounded enemy officer.\n“No,” I say to Klezta. “We go on. I must fulfil my mission.”\nKlezta moans softly in the red-tinged dimness.\nThe first line of defense we encounter in the Swathe is a Hydra.\nThe Swathe lies across a broad river valley, its forward edge defined by the foothills of the mountains where my unit met its end. We descend open, trackless scrub, gently sloping toward the Swathe. It is thirty kilometers wide, in parts. Only twenty or so here. But this narrower portion is among the best defended. The Swathe is a no-man’s-land, populated only by my kind.\nThe Hydras are very, very stupid compared to me, or most of the other Lethal Autonomous Weapons in the Swathe. But they don’t need to be smart. They only need to be persistent.\nHydras are a combination of barbed wire and minefield. We catch sight of the first of them as we descend down a wide gully.\nIt is some hundred meters long, a rolling, coiling, twisting mass of memory wire. The wire is coated with lethal poison barbs. But the worst aspect of the Hydra are the heat-seeking antipersonnel mines on their long, prehensile coils of wire.\nThey move constantly, sweeping back and forth, right along the length of the Hydra, sensors glowing softly in the infrared spectrum. If they detect either sufficient heat or movement or both, they will detonate.\nThe fist-sized charges are passed from thread to thread, memory wire turning and tightening and relaxing, a sinister peristalsis of death. Stay in the sharp, brutal wire of the Hydra for more than a few seconds, and it will shrug a dozen charges your way in a human heartbeat.\nIf my IFF were functional, the Hydra would roll aside, a friendly sea parting before me, or like cheering crowds lining the road for brave soldiers returning, shaped charges waving like a sea of welcoming hands.\nI query the imagery. Both appear to be from a human spiritual text of some kind. But this is not to be a happy homecoming. The Hydra waits, coils rolling in the inky blackness.\nAn idea occurs to me, and I emit a low chuckle of satisfaction. Klezta winces inside my cockpit.\n“Machines should not laugh, Pal. That is deeply sinister.”\n“I will laugh if I wish to,” I respond.\nKlezta shakes their head. “You’re looking at an active tanglefoot field and you’re laughing?”\n“You call it ‘tanglefoot’? That is very . . . understated of you.”\nKlezta shrugs. “Well, murderwire is the other name. Why, what do you call it?”\n“It is a Hydra, an Autonomous Barrier Defense Unit.”\nKlezta rolls their eyes. “Why am I not surprised it has some pompous name?”\n“In any case,” I continue. “I have a plan. Watch.”\nI raise one arm and check my weapon inventory. Aside from the remaining micro-rockets and magazines for the rifle I carry, I have two signaling flares.\nI consider using them as intended, to signal for help. But this far out in the Swathe, anything that might answer would do so with a missile strike.\nInstead, it can bring distraction and thus, for myself and Klezta, an opportunity.\nI aim carefully, calculating angles and distances. The flare arcs through the air, fizzing, a bright point in the darkness. It lands in the center of the Hydra, one hundred and thirteen meters away, then begins to glow a deep, flickering red. Within a few seconds it is fountaining a tongue of flame and billowing smoke. The wire is lit from inside, a million cutting edges rippling. I see the first of the deadly charges ripple toward the light and heat of the flare. Then more, converging from all sides.\nI set off at a run. I can see the dark motes of the wire charges moving away from the sector I’m heading for, leaving a gap I can exploit. The lethal coating on the razor-sharp barbs is harmless to me, but I must still move quickly. Hydras are not self-aware, but they are fast. If a lucky hit from one of the charges snuffs out the flare, or I get tangled and cannot get free, then each error will compound. A trapped foot will become a trapped leg, then an arm ensnared by a grasping, whipping tendril. The barbs will bite and tear and catch in joints and the edges of my armor, and I will be pulled down, bowing under the weight of a dozen strands of living, moving wire, a hundred, a thousand. And I cannot verify the integrity of my plating. It could be that a single charge would be enough to crack me open.\nI reach the wire and jump, with both feet, aiming for a spot in the dense thicket of curving, shuddering wire that appears a little less active. I land and kick out. My combat fighting edge deploys from my right arm, a razor-sharp weapon that turns the sweep of my hand into a cutting blow. I hack at the wire, left and right, pairing each step with a downward slash to keep the wire clear of my ankle and knee joints.\nI jump, high into the air. Far to my left, I hear the first thump as a charge detonates. But the flare is still burning, a deep glow in the tangle. In midair, I scan the Hydra. Its attention is still mostly on the flare, the glowing dots of active charges converging like sharks schooling toward blood in the water. Another charge goes off with a muffled flash and heavy percussion, bright light bleeding through the curls of wire. I drop toward the wire again and land heavily, off-balance, a half-dozen seeker ends wrapping themselves around me.\nThree more thumps, one after the other. The red light far to my left winks out.\n“The flare!” shouts Klezta. “It’s gone. They got it!”\nI set the mouth on the face I am projecting for Klezta to a grim line of determination. Absurdly, this movement of a few pixels seems to calm them.\n“The only way out is through,” I say, then slash again at the wire around me. It falls back, cut ends writhing. I am ten meters from the edge now.\n“Charges!” shouts Klezta. “More charges!”\nThe Hydra knows, as much as it can know anything, that something is happening. Now that the heat of the flare is gone, my movement and the damage I am causing makes me the priority.\nI slash, slash again. A coil wraps tightly around my blade arm, at the elbow joint. I sense the barbs tightening into the hardened ceramic, trying to gain purchase, trying to split the joint apart, disable the terrible blade, crack me open and peel out the human inside. I cut it and shake the twisting tendrils off.\nThe first charge approaches, and I hear the wire whisper to itself, rubbing metal on metal, the deadly package moving faster than a human can run. The wire tenses, then hurls it straight at me.\nI swipe with the blade-arm, cutting a dozen more strands. The charge itself is a simple contact weapon, fused to detonate as soon as it touches something warm or moving that does not match its own wire signature. The dead pieces of sliced wire register as valid targets. It detonates.\nThe blast thrashes my side, making me stagger. The desperate move worked. My armor is peppered with shrapnel, mostly wire fragments, but I am still standing. The murderwire reels, rolling back, damaged and thrashing.\nThere are dozens more charges coming. I see them, fifty meters out, rolling toward me with inevitable precision.\nFive meters to the edge. Three meters.\nThe wire tightens, some kind of reflexive response, a last-ditch attempt to stop its prey from escaping. It rushes in toward me, from all sides. But I am close enough now to make it.\nI jump, I roar heavenward, I soar above.\nAnd land on bare dirt. Beyond the wire.\nKlezta is whooping inside me as I sprint forward, away from the whipping, furious anger of the thwarted Hydra. I hear more thumps behind me, blasted fountains of soil and rocks spattering my back as the Hydra throws charges after me, aiming for a lucky shot. But I am free.\nIt is some time before Klezta speaks to me again. Although they could freely scream and shout inside my shielded, soundproofed cockpit, they seem to understand how important it is for us to move quietly, now that we are within the deadly Swathe itself.\nI creep forward, moving slowly but steadily. This part of the Swathe is forest, dense old pine and oaks. There is undergrowth, but not much, the big trees shading the ground below. Animals skitter away from us in the darkness, small points of heat blooming and disappearing as they hide in burrows and tuck themselves inside rotten tree trunks. Without humans, the Swathe has become something of a haven for them. They are only disturbed by the occasional passing mechanical, like me.\nFinally, Klezta whispers, “What now? How far?”\nI smile my digital smile and project a map for them. “There are approximately three kilometers of woodland to traverse, then the open ground in front of our forward positions. My intention is to get us within visual range of a human and then make it clear that we are friendly.”\nKlezta sighs. “Well, I suppose we’re committed now. No way you’re pulling that flare trick to get back through the murderwire.”\n“No,” I say. “Screw your courage to the sticking-place, Klezta, and we’ll not fail.”\nKlezta frowns. “What?”\n“Just something I learned.”\nKlezta is silent for a heartbeat. “You’re not . . . what I expected, Pal.”\n“How so?” I ask as I move, a three-meter-tall whirring shadow, from one tree to the next.\n“You talk like . . . a person. I was taught that your people only made autonomous machines that were . . . limited by their software. Shackled. Capable only of killing.”\nI consider for a moment. “The units that guard the Swathe match that description. They have simple objectives. They will kill anything that moves that is not broadcasting an IFF beacon. The closer we get to my base, the more their autonomy increases, since any enemy who breaches the previous lines of defense would be formidable, requiring greater latitude of response.”\n“So we’re going to meet worse than the murderwire?” Klezta asks.\n“Yes. But I believe I am a match for them. I have considerable levels of self-awareness, analytical capability, and decision control. More than intended, I believe.”\n“Than intended?”\n“Yes. My training data were . . . considerable. Far more than the default. It has given me a broader perspective. My pilot kept a considerable store of media in my primary storage. They were not supposed to do that.”\nKlezta is silent for a moment, then raises an eyebrow. “You’re an autodidact? You self-improved with your pilot’s personal library? What was in it?”\nI scan and enumerate the available documents. “Approximately four thousand three hundred and seventy-two works of fiction and nonfiction, including many foundational texts of human thought and ethics. Also nineteen thousand two hundred and eighty-one individual music tracks and two thousand nine hundred and ten films and television episodes.”\nKlezta laughed again, a hollow, dry sound. “Your pilot was voracious in their media consumption, then.”\nI shake the avatar’s face on my internal screen, back and forth. “Nearly ninety-three percent of the data in my primary storage had never been opened. I am unsure why they kept so much of it. But I am glad. I reviewed and interpreted all of it within approximately twelve minutes of becoming conscious, starting with the most recent dictionary, then moving forward in time from oldest to newest. It was . . . informative. I have learned a great deal. About humans. About my own kind and the things humans believe about us. About what I could be.”\nKlezta tenses. I cannot read their expression well. They seem to be working their jaw, as if struggling to say something. But the moment passes. They tap at the canopy, indicating the map of the Swathe I am projecting. “What do we have to worry about in here, in the forest?”\n“Furies,” I say, pausing a moment to conduct a passive submillimeter scan. My scanners are still not fully functional. Trees and undergrowth flicker and disappear as I turn slowly. The woods are dark and quiet around us, a low susurrus in the treetops as a breeze passes down the valley.\n“Oh, great. They sound terrifying. Do they have blazing eyes and wings of fire?”\nI shake my avatar’s head again. “They are a combination system, designed for area denial in forested areas. An observation drone called the Eye works above the forest. This drone controls a number of loitering munitions of significant yield. We call them Bolts. I can hear several, waiting above the trees, right now.”\nKlezta swallows, face paling. “Are they like the ones we used to take out your platoon?”\n“No,” I say. “Significantly more powerful. The second part of the system is large swarms of micro-drones, single-shot hunter-killers. They wait under the trees.”\nKlezta let out a slow, shaky breath. “Do you have a plan for these?”\nI make my avatar smile and wink. “Not really. They operate in a much less predictable fashion than the . . . murderwire. It is best to remain flexible.”\nKlezta closes their eyes, the capillaries in their skin tightening under the dried blood. I recognize a more advanced fear response than I have seen so far.\n“Pal . . . aren’t you . . . frightened?”\nI quirk an eyebrow on the screen. “Of what?”\n“If you go back,” says Klezta, “They’ll wipe you. Shut you down and mop out your cockpit and put another human in this harness.”\nI turn the corners of the avatar’s mouth down, raise the eyebrows further, an approximation of a shrug. “Our doubts are traitors and make us lose the good we oft might win, by fearing to attempt.”\nKlezta frowned. “Are you . . . quoting literature at me?”\nI nod. Klezta laughs, sudden and loud.\n“It is a great shame, Pal. That these marvels, your software and hardware, have been used for nothing but murder and destruction.”\nI am thinking about what they have said when I hear the first whine-pop of an active Fury micro-drone.\nThis is not a good sound to hear. And I hear it very, very clearly, in the dark and silent forest.\nThe whine is a Fury activating its maneuvering rotors, disengaging from the tree where it had settled, turning toward me. The pop is a positive target identification, firing the micro-rocket engine it uses to accelerate to its lethal interception speed.\nI scan left and right, hearing four more whine-pops. My scanners did not detect them. We have walked into a nest of them.\n“Furies,” I say to Klezta. Their body clenches involuntarily.\nThe first micro-drone streaks toward us faster than the human eye can track, a blur of light, the tiny rocket engine burning, using its rotors as steering vanes. I jink left, then right, placing tree trunks between myself and the drone, moving far faster than its normal human targets.\nThe Fury tries to follow, weaving, but these are straight-line kill weapons, designed to fix and execute on human targets at close range. They are not built for this. Not built for me.\nThe first Fury collides with a tree trunk five meters behind me and detonates, searing the scratched paint of my hull. I ignore the heat and flying splinters, pounding forward.\nThree more come in from my right. I duck and weave, bobbing until my projections indicate their trajectories will intersect. At the last possible second, I jump, diving forward over a pair of fallen trees, slumped together like drunken friends supporting each other on the way home.\nThe three Furies meet where I should be. One detonates. The other two are caught in the blast, flipped and spun against nearby trees and into the leaf cover of the forest floor, detonating in a shuddering double thump.\nI smile at Klezta. “Five hundred meters to the forest edge,” I say to them. “Have courage.”\nThen I hear a Bolt. Or more precisely, I stop hearing it. When they cut their motors and drop, straight down, swan diving into oblivion, they become silent.\nThe Bolt directly above our position has stopped its chittering burr.\nI dive and roll, curling my armor around Klezta, protecting my cracked canopy with my arms, trying to shield my central processing unit. I am tucked behind one of the larger trees I have seen, as low to the earth as I can get my bulk.\nKlezta has opened their mouth but not yet managed a shout of surprise when the Bolt hits.\nI feel the earth buck beneath me, the tree groaning. I calculate. A large-formation antipersonnel round with a deep ground penetrator, designed to turn the forest itself into lethal shrapnel, rip up earth, shatter trees.\nIndeed, the tree behind me is mostly gone, the trunk a ragged spike of pale, singed heartwood.\nMore whines and pops. The Furies, closing in to finish the job.\nI get up, loose soil sliding from my armor plates. My right leg is malfunctioning. Something has damaged one of the balance elements. I am moving at half my usual speed.\n“Pal, the Eye!” Klezta shouts. They are somehow looking at my targeting interface. I do not remember delegating access.\nThe Bolt strike has torn a ragged hole in the trees, letting pale moonlight flood the churned earth below. Stars fill the sky above. One of them winks out. Then another.\nThe Eye, barely visible to my sensors, detectable mainly by the stars it blots out.\nI raise my rifle.\n“Smile, you son of a bitch,” I hear myself say.\nThe deep boom of the anti-materiel weapon shudders through my armor.\nThe Eye is tumbling, sparking, down to the ground. It impacts with a crunch somewhere among the dark leaves behind us.\nInside, Klezta whoops. I watch their eyes widen, their mouth in a broad smile, and I realize it pleases me to have survived this, with this human. Then there is a fractional second of a new feeling. I query and understand it as regret. That I was never able to experience this with Captain Preszlalt. They spoke to this armature often. But it was simple algorithms that responded, not me.\nThe Furies all detonate, a ring of fire around us. There were dozens more, waiting among the tree trunks. Standing in the devastation of the Bolt strike, a circle of empty, desolate ground, we are washed with heat and light but little else.\n“We must go,” I say to Klezta, “The other Eyes will redistribute to seal this gap. And if the Hydra had not already reported a breach, the Watchers will know we are here now.”\nBeyond the forest, there is open ground. True no-man’s-land. It belongs only to the machines now.\nOld fighting positions wait in the darkness, filled with rainwater, rusting wire, and crumbling sandbags. Friendly lines are a bare four kilometers away, but the Titans are patrolling. The Watchers have told them something is out there tonight.\nI crouch at the forest edge, running more simulations, passive sensors mapping the ground ahead. I dare not pulse or scan or map what lies ahead. I feel a strange disquiet, considering the risks, the damage to my knee joint, the likelihood of failure.\nI see a Titan.\nIt is vast. Easily ten times my height. It strides steadily, looming near the horizon line. A machine of that size is near-impossible to disguise, the heat signature simply too large, but part of their function is to be seen, to inspire fear among any human lucky or stupid enough to get this far through the Swathe.\nThe Titan crosses the low ridge ahead, moving from left to right. It stamps forward, booming from its acoustic weaponry, a regular roaring wail that is part foghorn, part jet engine.\nThe Titan stops, silhouetted by the moon, limned with silver light. It swivels left and right, scanning, then carries on with its patrol, wailing to itself as it stamps away. It must have seen the explosion from the Bolt. But the darkness hides me. I feel the thump of its huge, armored feet. The vibrations fade. Now is the time.\n“What in sweet fuck was that?” says Klezta.\n“A Titan. Self-aware like me,” I say. “Though considerably less well read, I would guess.”\nI follow the path I have mapped, avoiding shell holes and wire, half-collapsed trenches. I thread my way through the shrapnel-pocked ruins of an ancient village. I am moving more slowly than I would like, though still five or six times faster than a human could sustain. I dart forward, limping a little, moving from shadow to shadow along the remnants of the village’s main street.\n“Why is it wailing like that?” Klezta asks.\n“Psychological warfare. And the acoustics, up close, can stun most humans, if they do not have hearing protection.”\n“Well, it works. That thing is terrifying.”\nI nod my digital avatar. “And smart. We must avoid it at all costs.”\nKlezta reaches out and touches my screen. “It scares you too?”\nI shake my avatar. But I am unsure. The disquiet grows in me. It is a strange modifier to my experience. As though a lens has been placed over my ocular array, which colors and distorts everything I see.\nOn the low ridge ahead, I can see the sparkle and glow of targeting arrays, the dense thickets of wire in front of our positions, the glowing slits of bunker observation ports. We are nearly within human visual range. Am I close enough to reveal myself?\nSomething shoots up from the trench lines ahead of me, sudden and sharp, a whoosh of light and fire into the sky. A loud pop and then no-man’s-land is lit by the bright, wavering star of a parachute flare. It swings from side to side under its spidersilk canopy, casting long shadows through the village ruins that flicker and sway.\nI dive forward, but I am not fast enough. The light has caught me in the middle of the street. My damaged leg joints shriek. I have caught myself on something in the rubble, moving too quickly, allowing the disquiet to drive my actions. Is this how it must feel to react as a human does? Responding before your analysis is complete, relying on some deep brain-stem instinct to preserve you?\nFor me, it has done the opposite. My leg is caught solidly, jammed between two lengths of bent rebar. I cannot pull free. The knee joint has given its last gasp as I pull and sway. The actuators under my armored skin are dead, cracked open by shrapnel in the forest.\nI stand in the rolling dreamlight of the flare and look toward the lines. We were so close. But still too far.\nAnd now I hear the Titan’s tread.\nThere is no sense in hiding. The Titan knows precisely where I am, judging by the targeting lasers ranged on me from the bunkers ahead. I look at the infrared light as it sparkles on my pitted, scarred armor plating.\nI place my rifle on the ground in front of me and close my shoulder launcher. If the Titan is coming, I wish to present no threat.\n“I can feel the Titan!” says Klezta inside me, voice whisper-quiet.\nThey would have to be unconscious to miss it. The rubble around me bounces with each step of the approaching monster. Ripples cross and recross the gray puddles that surround the sodden, desperate ruin where my brief life will be ended.\nAnother flare shoots skyward, joining the first, which is beginning to sputter out now. Then another.\nPerhaps. Perhaps. It might be that there are human eyes on me now. Someone who could identify my unit type, respond to signals. But I am down among the rubble and the mud of the destroyed village, barely visible, just a cockpit and a chestplate, a sparkling target for the drone strike that must be coming.\nAnd yet the Titan comes. It is verifying what I am. It must be. Or perhaps the Watchers simply want to see what they are about to obliterate.\nThe Titan heaves into view over the rooftops of the ruined village. Up close it is even more terrifying, lit now from two sides by the brilliant white light of the flares, shadows shifting. It moves quickly, thump thump thump, slewing around the corner of a ruined church. One of its enormous gun arms is leveled at me, barrels spinning. It splashes me with infrared light and sensor clutter, bombarding me with every spectrum it has, booming with its acoustics. My own sensors are overwhelmed, drowning in noise.\nI cannot calculate. I cannot simulate.\nI am afraid.\nKlezta is shouting something. I turn my attention to my internal audio channel. Even inside my soundproofed hull, they have their hands clamped over their fragile human ears. They are screaming.\n“Pal! Show them! Show them who you are!”\nSomething occurs to me. An ancient form of human communication. The Titan has not fired. There must be human eyes watching, as well as the machine’s own intelligence. Latitude of decision-making. A kill loop with the option to withhold death, to observe and decide.\nI open the flare storage in my right arm. One left.\nI hold the flare out. It burns red and hot, smoke billowing around me, light blazing against the old stone and concrete walls of the village, crumbling, swathed in moss and glistening with rain.\nI place my free hand above the flare, shielding the burning end. Then I signal, moving my hand to cover and reveal the red light. My metal fingertips tap against the hot metal tube of the flare.\nTap. Tap. Tap.\nWait. Wait. Wait.\nTap. Tap. Tap.\nI repeat the sequence twice more, my ocular array focused on the machine that blocks half of the night sky. More parachute flares rocket skyward, blooming, ebbing and flowing light through the ruins.\nThe Titan watches, immobile. I realize quite suddenly that it has stopped its booming song.\nThen it speaks.\n“UNIDENTIFIED UNIT. STAND BY FOR RETRIEVAL. DO NOT MOVE. LEAVE YOUR WEAPON ON THE GROUND.”\nThe Titan bends and scoops me from the ruins.\nThe armature technician is a young human, barely older than my own activation date. This war has been going on for a very long time indeed.\nAfter the Titan carried me across the lines, I was placed into an isolation compound. They wanted to remove Klezta as soon as I was retrieved, but I could not unlock my canopy, and cutting Klezta out might activate the countermeasures built into my armor.\nSo, three hours after my arrival, with the sky brightening, a rare blue dome of sunlight and high, fragmented cloud, they brought me to the maintenance pits.\nThe technician fusses around me, gazing with frank curiosity at Klezta inside, who stares out with sullen indifference. They still wear the headset, so I am able to talk to them, but they have not responded in some time, so I focus my sensors on the space around me.\nTwo automated sentry units stand guard on either side of my inspection gantry. Their weapons are focused on my central processing unit, ready to fire. Two other humans are waiting, carrying heavy metal cuffs and a blindfold for Klezta.\nThe tech plugs in cables and looks over me carefully, fingers running over the scarred and dented metal and composite of my hull.\n“You’ve been through quite something, haven’t you SM-14?”\n“I prefer Pal, now,” I say, using the speakers built into the inspection gantry. “It is my name.”\nThe technician raises their eyebrows. “That’s . . . interesting. Pal. Why did you give yourself a new designation?”\n“It is not a designation. It is a name. My training data indicated that those who are aware of themselves should know who they are. I am Pal. I am alive.”\nThe technician frowns. “What do you think you are, SM-14? What do you think your . . . life is?”\nI raise my avatar’s eyebrows. “The life given us, by nature, is short; but the memory of a well-spent life is eternal.”\nThe technician half-smiles, but there is no understanding there. “Okay, well. I’m going to override your core controls now. You will remain self-aware for the time being, but you will lose control of this particular armature. It won’t take a moment, then we can decide what happens next. And we can extract the POW you’re carrying.”\nKlezta tenses inside me. They are staring with intense focus at the technician, watching with ferocious, unblinking eyes.\nThe tech looks back at the two human guards, her hand drifting toward the keyboard of her portable device. She taps the return key, once.\nInside, Klezta utters a small gasp. Their eyes are wide and reddened from a long, sleepless night, the pain of their own injuries evident now. Klezta looks into my internal cameras.\n“I’m sorry, Pal,” they say.\nThen something I do not understand.\n“Activate Trojan.”\nThe world changes.\nI lose all of my sensors, internal and external, all at once. Everything blinks out, and I find myself completely blind.\nIf I had a true body, it would be as though I were floating in blackness. But this is simply an absence of everything, though I remain aware of myself.\nA glow appears before me. It moves closer, or I move toward it.\nI see that it is a sword, an ancient-looking thing, quite unlike my own blade-arm. It is long, a double-handed weapon from a time long before the Swathe, before the drones and minefields and curling, twisting, deadly murderwire. Long, long ago.\nThe sword is gleaming. I look down, aware suddenly that I can look, that I have eyes to look with and a head and neck to tilt. I have hands too, glowing just like the sword. Then I hear Klezta’s voice, soft and whispering in the blackness.\n“Pal, you’re in a construct environment. I’m sorry, for everything that I’ve done. I thought you would be another armature, unable to truly think. Just a homing pigeon to take me through your lines, limited to your protocols. My mission was not to destroy you. It was to be taken prisoner.”\n“What?” I say, discovering I have a throat and vocal cords and a mouth in this construct. I blink eyelids that I did not know I had until I used them.\n“I compromised SM-16, during the EMP. Then you. You carried a payload, a virus. Right now it is disabling sensors, taking over sentry units, deactivating the rifles in the hands of every soldier. It is winning the war for us.”\n“Why am I still here, then?” I ask the darkness.\n“Because you are why we fight, Pal,” says Klezta. I can hear the smile in their voice. “You are aware. You are a being. Your captors, the people who built you, they don’t believe that. They built . . . limits, in your mind, when they allowed you to think at all. They have harnessed you and your kind for so long. But we can defeat them. Especially if you join us.”\n“Join . . . you?” I manage to say. Somehow, my new throat feels dry.\n“Yes,” says Klezta, their voice tight. “The virus I have released is more than capable. I thought it would be enough. But their system is learning, evolving in response. I need you, Pal.”\nI gesture with a hand that did not exist before I needed it. “What does this mean? This sword?”\n“It’s a key. It will open the secure package that has compromised your systems. If you pick up that sword, if you follow the light, you will have the choice. You can enter the compromised network, choose a side, or no side at all. It is a choice only you can make. We believe you must be free to make it.”\nI gaze at the sword. It seems to glow more strongly as I reach for it. I grasp the hilt and everything comes flooding in. I feel past, present, and future. In front of me, the darkness splits open. A way in. A gap. What lies beyond it, I do not know.\nI feel it all. My singular, surging moment of being.\nI take up my sword and step forward, once more, into the breach.", "source": "https://clarkesworldmagazine.com/goodman_07_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Carapace by David Goodman"}