{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Naomi Novik", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "2Tp65I+QK9x+l0Hpn4KI6b/YPKo=", "id": null, "license": null, "comments": "", "raw_text": "12760 words, novelette, REPRINT  Seven Years from Home  Preface  Seven days passed for me on my little raft of a ship as I fled Melida; seven years for the rest of the unaccelerated universe. I hoped to be forgotten, a dusty footnote left at the bottom of a page. Instead I came off to trumpets and medals and legal charges, equal doses of acclaim and venom, and I stumbled bewildered through the brassy noise, led first by one and then by another, while my last opportunity to enter any protest against myself escaped.  Now I desire only to correct the worst of the factual inaccuracies bandied about, so far as my imperfect memory will allow, and to make an offering of my own understanding to that smaller and more sophisticate audience who prefer to shape the world’s opinion rather than be shaped by it.  I engage not to tire you with a recitation of dates and events and quotations. I do not recall them with any precision myself. But I must warn you that neither have I succumbed to that pathetic and otiose impulse to sanitize the events of the war, or to excuse sins either my own or belonging to others. To do so would be a lie, and on Melida, to tell a lie was an insult more profound than murder.  I will not see my sisters again, whom I loved. Here we say that one who takes the long midnight voyage has leaped ahead in time, but to me it seems it is they who have traveled on ahead. I can no longer hear their voices when I am awake. I hope this will silence them in the night.  Ruth Patrona Reivaldt, Janvier 32, 4765 The First Adjustment  I disembarked at the port of Landfall in the fifth month of 4753. There is such a port on every world where the Confederacy has set its foot but not yet its flag: crowded and dirty and charmless. It was on the Esperigan continent, as the Melidans would not tolerate the construction of a spaceport in their own territory.  Ambassador Kostas, my superior, was a man of great authority and presence, two meters tall and solidly built, with a jovial handshake, high intelligence, and very little patience for fools; that I was likely to be relegated to this category was evident on our first meeting. He disliked my assignment to begin with. He thought well of the Esperigans; he moved in their society as easily as he did in our own, and would have called one or two of their senior ministers his personal friends, if only such a gesture were not highly unprofessional. He recognized his duty, and on an abstract intellectual level the potential value of the Melidans, but they revolted him, and he would have been glad to find me of like mind, ready to draw a line through their name and give them up as a bad cause.  A few moments’ conversation was sufficient to disabuse him of this hope. I wish to attest that he did not allow the disappointment to in any way alter the performance of his duty, and he could not have objected with more vigor to my project of proceeding at once to the Melidan continent, to his mind a suicidal act.  In the end he chose not to stop me. I am sorry if he later regretted that, as seems likely. I took full advantage of the weight of my arrival. Five years had gone by on my homeworld of Terce since I had embarked, and there is a certain moral force to having sacrificed a former life for the one unknown. I had observed it often with new arrivals on Terce: their first requests were rarely refused even when foolish, as they often were. I was of course quite sure my own were eminently sensible.  “We will find you a guide,” he said finally, yielding, and all the machinery of the Confederacy began to turn to my desire, a heady sensation.  Badea arrived at the embassy not two hours later. She wore a plain gray wrap around her shoulders, draped to the ground, and another wrap around her head. The alterations visible were only small ones: a smattering of green freckles across the bridge of her nose and cheeks, a greenish tinge to her lips and nails. Her wings were folded and hidden under the wrap, adding the bulk roughly of an overnight hiker’s backpack. She smelled a little like the sourdough used on Terce to make roundbread, noticeable but not unpleasant. She might have walked through a spaceport without exciting comment.  She was brought to me in the shambles of my new office, where I had barely begun to lay out my things. I was wearing a conservative black suit, my best, tailored because you could not buy trousers for women ready-made on Terce, and, thankfully, comfortable shoes, because elegant ones on Terce were not meant to be walked in. I remember my clothing particularly because I was in it for the next week without opportunity to change.  “Are you ready to go?” she asked me, as soon as we were introduced and the receptionist had left.  I was quite visibly not ready to go, but this was not a misunderstanding: she did not want to take me. She thought the request stupid, and feared my safety would be a burden on her. If Ambassador Kostas would not mind my failure to return, she could not know that, and to be just, he would certainly have reacted unpleasantly in any case, figuring it as his duty.  But when asked for a favor she does not want to grant, a Melidan will sometimes offer it anyway, only in an unacceptable or awkward way. Another Melidan will recognize this as a refusal, and withdraw the request. Badea did not expect this courtesy from me, she only expected that I would say I could not leave at once. This she could count to her satisfaction as a refusal, and she would not come back to offer again.  I was however informed enough to be dangerous, and I did recognize the custom. I said, “It is inconvenient, but I am prepared to leave immediately.” She turned at once and walked out of my office, and I followed her. It is understood that a favor accepted despite the difficulty and constraints laid down by the giver must be necessary to the recipient, as indeed this was to me; but in such a case, the conditions must then be endured, even if artificial.  I did not risk a pause at all even to tell anyone I was going; we walked out past the embassy secretary and the guards, who did not do more than give us a cursory glance—we were going the wrong way, and my citizen’s button would likely have saved us interruption in any case. Kostas would not know I had gone until my absence was noticed and the security logs examined.  The Second Adjustment  I was not unhappy as I followed Badea through the city. A little discomfort was nothing to me next to the intense satisfaction of, as I felt, having passed a first test: I had gotten past all resistance offered me, both by Kostas and Badea, and soon I would be in the heart of a people I already felt I knew. Though I would be an outsider among them, I had lived all my life to the present day in the self-same state, and I did not fear it, or for the moment anything else.  Badea walked quickly and with a freer stride than I was used to, loose-limbed. I was taller, but had to stretch to match her. Esperigans looked at her as she went by, and then looked at me, and the pressure of their gaze was suddenly hostile. “We might take a taxi,” I offered. Many were passing by empty. “I can pay.”  “No,” she said, with a look of distaste at one of those conveyances, so we continued on foot.  After Melida, during my black-sea journey, my doctoral dissertation on the Canaan movement was published under the escrow clause, against my will. I have never used the funds, which continue to accumulate steadily. I do not like to inflict them on any cause I admire sufficiently to support, so they will go to my family when I have gone; my nephews will be glad of it, and of the passing of an embarrassment, and that is as much good as it can be expected to provide.  There is a great deal within that book which is wrong, and more which is wrongheaded, in particular any expression of opinion or analysis I interjected atop the scant collection of accurate facts I was able to accumulate in six years of over-enthusiastic graduate work. This little is true: the Canaan movement was an offshoot of conservation philosophy. Where the traditionalists of that movement sought to restrict humanity to dead worlds and closed enclaves on others, the Canaan splinter group wished instead to alter themselves while they altered their new worlds, meeting them halfway.  The philosophy had the benefit of a certain practicality, as genetic engineering and body modification was and remains considerably cheaper than terraforming, but we are a squeamish and a violent species, and nothing invites pogrom more surely than the neighbor who is different from us, yet still too close. In consequence, the Melidans were by our present day the last surviving Canaan society.  They had come to Melida and settled the larger of the two continents some eight hundred years before. The Esperigans came two hundred years later, refugees from the plagues on New Victoire, and took the smaller continent. The two had little contact for the first half-millennium; we of the Confederacy are given to think in worlds and solar systems, and to imagine that only a space voyage is long, but a hostile continent is vast enough to occupy a small and struggling band. But both prospered, each according to their lights, and by the time I landed, half the planet glittered in the night from space, and half was yet pristine.  In my dissertation, I described the ensuing conflict as natural, which is fair if slaughter and pillage are granted to be natural to our kind. The Esperigans had exhausted the limited raw resources of their share of the planet, and a short flight away was the untouched expanse of the larger continent, not a tenth as populated as their own. The Melidans controlled their birthrate, used only sustainable quantities, and built nothing which could not be eaten by the wilderness a year after they had abandoned it. Many Esperigan philosophes and politicians trumpeted their admiration of Melidan society, but this was only a sort of pleasant spiritual refreshment, as one admires a saint or a martyr without ever wishing to be one.  The invasion began informally, with adventurers and entrepreneurs, with the desperate, the poor, the violent. They began to land on the shores of the Melidan territory, to survey, to take away samples, to plant their own foreign roots. They soon had a village, then more than one. The Melidans told them to leave, which worked as well as it ever has in the annals of colonialism, and then attacked them. Most of the settlers were killed; enough survived and straggled back across the ocean to make a dramatic story of murder and cruelty out of it.  I expressed the conviction to the Ministry of State, in my pre-assignment report, that the details had been exaggerated, and that the attacks had been provoked more extensively. I was wrong, of course. But at the time I did not know it.  Badea took me to the low quarter of Landfall, so called because it faced on the side of the ocean downcurrent from the spaceport. Iridescent oil and a floating mat of discards glazed the edge of the surf. The houses were mean and crowded tightly upon one another, broken up mostly by liquor stores and bars. Docks stretched out into the ocean, extended long to reach out past the pollution, and just past the end of one of these floated a small boat, little more than a simple coracle: a hull of brown bark, a narrow brown mast, a grey-green sail slack and trembling in the wind.  We began walking out towards it, and those watching—there were some men loitering about the docks, fishing idly, or working on repairs to equipment or nets—began to realize then that I meant to go with her.  The Esperigans had already learned the lesson we like to teach as often as we can, that the Confederacy is a bad enemy and a good friend, and while no one is ever made to join us by force, we cannot be opposed directly. We had given them the spaceport already, an open door to the rest of the settled worlds, and they wanted more, the moth yearning. I relied on this for protection, and did not consider that however much they wanted from our outstretched hand, they still more wished to deny its gifts to their enemy.  Four men rose as we walked the length of the dock, and made a line across it. “You don’t want to go with that one, ma’am,” one of them said to me, a parody of respect. Badea said nothing. She moved a little aside, to see how I would answer them.  “I am on assignment for my government,” I said, neatly offering a red flag to a bull, and moved towards them. It was not an attempt at bluffing: on Terce, even though I was immodestly unveiled, men would have at once moved out of the way to avoid any chance of the insult of physical contact. It was an act so automatic as to be invisible: precisely what we are taught to watch for in ourselves, but that proves infinitely easier in the instruction than in the practice. I did not think they would move; I knew they would.  Perhaps that certainty transmitted itself: the men did move a little, enough to satisfy my unconscious that they were cooperating with my expectations, so that it took me wholly by surprise and horror when one reached out and put his hand on my arm to stop me.  I screamed, in full voice, and struck him. His face is lost to my memory, but I still can see clearly the man behind him, his expression as full of appalled violation as my own. The four of them flinched from my scream, and then drew in around me, protesting and reaching out in turn.  I reacted with more violence. I had confidently considered myself a citizen of no world and of many, trained out of assumptions and unaffected by the parochial attitudes of the one where chance had seen me born, but in that moment I could with actual pleasure have killed all of them. That wish was unlikely to be gratified. I was taller, and the gravity of Terce is slightly higher than of Melida, so I was stronger than they expected me to be, but they were laborers and seamen, built generously and rough-hewn, and the male advantage in muscle mass tells quickly in a hand-to-hand fight.  They tried to immobilize me, which only panicked me further. The mind curls in on itself in such a moment; I remember palpably only the sensation of sweating copiously, and the way this caused the seam of my blouse to rub unpleasantly against my neck as I struggled.  Badea told me later that, at first, she had meant to let them hold me. She could then leave, with the added satisfaction of knowing the Esperigan fishermen and not she had provoked an incident with the Confederacy. It was not sympathy that moved her to action, precisely. The extremity of my distress was as alien to her as to them, but where they thought me mad, she read it in the context of my having accepted her original conditions and somewhat unwillingly decided that I truly did need to go with her, even if she did not know precisely why and saw no use in it herself.  I cannot tell you precisely how the subsequent moments unfolded. I remember the green gauze of her wings overhead perforated by the sun, like a linen curtain, and the blood spattering my face as she neatly lopped off the hands upon me. She used for the purpose a blade I later saw in use for many tasks, among them harvesting fruit off plants where the leaves or the bark may be poisonous. It is shaped like a sickle and strung upon a thick elastic cord, which a skilled wielder can cause to become rigid or to collapse.  I stood myself back on my feet panting, and she landed. The men were on their knees screaming, and others were running towards us down the docks. Badea swept the severed hands into the water with the side of her foot and said calmly, “We must go.”  The little boat had drawn up directly beside us over the course of our encounter, drawn by some signal I had not seen her transmit. I stepped into it behind her. The coracle leapt forward like a springing bird, and left the shouting and the blood behind.  We did not speak over the course of that strange journey. What I had thought a sail did not catch the wind, but opened itself wide and stretched out over our heads, like an awning, and angled itself towards the sun. There were many small filaments upon the surface wriggling when I examined it more closely, and also upon the exterior of the hull. Badea stretched herself out upon the floor of the craft, lying under the low deck, and I joined her in the small space: it was not uncomfortable nor rigid, but had the queer unsettled cushioning of a waterbed.  The ocean crossing took only the rest of the day. How our speed was generated I cannot tell you; we did not seem to sit deeply in the water and our craft threw up no spray. The world blurred as a window running with rain. I asked Badea for water, once, and she put her hands on the floor of the craft and pressed down: in the depression she made, a small clear pool gathered for me to cup out, with a taste like slices of cucumber with the skin still upon them.  This was how I came to Melida.  The Third Adjustment  Badea was vaguely embarrassed to have inflicted me on her fellows, and having deposited me in the center of her village made a point of leaving me there by leaping aloft into the canopy where I could not follow, as a way of saying she was done with me, and anything I did henceforth could not be laid at her door.  I was by now hungry and nearly sick with exhaustion. Those who have not flown between worlds like to imagine the journey a glamorous one, but at least for minor bureaucrats, it is no more pleasant than any form of transport, only elongated. I had spent a week a virtual prisoner in my berth, the bed folding up to give me room to walk four strides back and forth, or to unfold my writing desk, not both at once, with a shared toilet the size of an ungenerous closet down the hall. Landfall had not arrested my forward motion, as that mean port had never been my destination. Now, however, I was arrived, and the dregs of adrenaline were consumed in anticlimax.  Others before me have stood in a Melidan village center and described it for an audience—Esperigans mostly, anthropologists and students of biology and a class of tourists either adventurous or stupid. There is usually a lyrical description of the natives coasting overhead among some sort of vines or tree-branches knitted overhead for shelter, the particulars and adjectives determined by the village latitude, and the obligatory explanation of the typical plan of huts, organized as a spoked wheel around the central plaza.  If I had been less tired, perhaps I too would have looked with so analytical an air, and might now satisfy my readers with a similar report. But to me the village only presented all the confusion of a wholly strange place, and I saw nothing that seemed to me deliberate. To call it a village gives a false air of comforting provinciality. Melidans, at least those with wings, move freely among a wide constellation of small settlements, so that all of these, in the public sphere, partake of the hectic pace of the city. I stood alone, and strangers moved past me with assurance, the confidence of their stride saying, “I care nothing for you or your fate. It is of no concern to me. How might you expect it to be otherwise?” In the end, I lay down on one side of the plaza and went to sleep.  I met Kitia the next morning. She woke me by prodding me with a twig, experimentally, having been selected for this task out of her group of schoolmates by some complicated interworking of personality and chance. They giggled from a few safe paces back as I opened my eyes and sat up.  “Why are you sleeping in the square?” Kitia asked me, to a burst of fresh giggles.  “Where should I sleep?” I asked her.  “In a house!” she said.  When I had explained to them, not without some art, that I had no house here, they offered the censorious suggestion that I should go back to wherever I did have a house. I made a good show of looking analytically up at the sky overhead and asking them what our latitude was, and then I pointed at a random location and said, “My house is five years that way.”  Scorn, puzzlement, and at last delight. I was from the stars! None of their friends had ever met anyone from so far away. One girl who previously had held a point of pride for having once visited the smaller continent, with an Esperigan toy doll to prove it, was instantly dethroned. Kitia possessively took my arm and informed me that as my house was too far away, she would take me to another.  Children of virtually any society are an excellent resource for the diplomatic servant or the anthropologist, if contact with them can be made without giving offense. They enjoy the unfamiliar experience of answering real questions, particularly the stupidly obvious ones that allow them to feel a sense of superiority over the inquiring adult, and they are easily impressed with the unusual. Kitia was a treasure. She led me, at the head of a small pied-piper procession, to an empty house on a convenient lane. It had been lately abandoned, and was already being reclaimed: the walls and floor were swarming with tiny insects with glossy dark blue carapaces, munching so industriously the sound of their jaws hummed like a summer afternoon.  I with difficulty avoided recoiling. Kitia did not hesitate: she walked into the swarm, crushing beetles by the dozens underfoot, and went to a small spigot in the far wall. When she turned this on, a clear viscous liquid issued forth, and the beetles scattered from it. “Here, like this,” she said, showing me how to cup my hands under the liquid and spread it upon the walls and the floor. The disgruntled beetles withdrew, and the brownish surfaces began to bloom back to pale green, repairing the holes.  Over the course of that next week, she also fed me, corrected my manners and my grammar, and eventually brought me a set of clothing, a tunic and leggings, which she proudly informed me she had made herself in class. I thanked her with real sincerity and asked where I might wash my old clothing. She looked very puzzled, and when she had looked more closely at my clothing and touched it, she said, “Your clothing is dead! I thought it was only ugly.”  Her gift was not made of fabric but a thin tough mesh of plant filaments with the feathered surface of a moth’s wings. It gripped my skin eagerly as soon as I had put it on, and I thought myself at first allergic, because it itched and tingled, but this was only the bacteria bred to live in the mesh assiduously eating away the sweat and dirt and dead epidermal cells built up on my skin. It took me several more days to overcome all my instinct and learn to trust the living cloth with the more voluntary eliminations of my body also. (Previously I had been going out back to defecate in the woods, having been unable to find anything resembling a toilet, and meeting too much confusion when I tried to approach the question to dare pursue it further, for fear of encountering a taboo.)  And this was the handiwork of a child, not thirteen years of age! She could not explain to me how she had done it in any way which made sense to me. Imagine if you had to explain how to perform a reference search to someone who had not only never seen a library, but did not understand electricity, and who perhaps knew there was such a thing as written text, but did not himself read more than the alphabet. She took me once to her classroom after hours and showed me her workstation, a large wooden tray full of grayish moss, with a double row of small jars along the back each holding liquids or powders which I could only distinguish by their differing colors. Her only tools were an assortment of syringes and eyedroppers and scoops and brushes.  I went back to my house and in the growing report I would not have a chance to send for another month I wrote, These are a priceless people. We must have them.  The Fourth Adjustment  All these first weeks, I made no contact with any other adult. I saw them go by occasionally, and the houses around mine were occupied, but they never spoke to me or even looked at me directly. None of them objected to my squatting, but that was less implicit endorsement and more an unwillingness even to acknowledge my existence. I talked to Kitia and the other children, and tried to be patient. I hoped an opportunity would offer itself eventually for me to be of some visible use.  In the event, it was rather my lack of use which led to the break in the wall. A commotion arose in the early morning, while Kitia was showing me the plan of her wings, which she was at that age beginning to design. She would grow the parasite over the subsequent year, and was presently practicing with miniature versions, which rose from her worktable surface gossamer-thin and fluttering with an involuntary muscle-twitching. I was trying to conceal my revulsion.  Kitia looked up when the noise erupted. She casually tossed her example out of the window, to be pounced upon with a hasty scramble by several nearby birds, and went out the door. I followed her to the square: the children were gathered at the fringes, silent for once and watching. There were five women laid out on the ground, all bloody, one dead. Two of the others looked mortally wounded. They were all winged.  There were several working already on the injured, packing small brownish-white spongy masses into the open wounds and sewing them up. I would have liked to be of use, less from natural instinct than from the colder thought, which inflicted itself upon my mind, that any crisis opens social barriers. I am sorry to say I did not refrain from any noble self-censorship, but from the practical conviction that it was at once apparent my limited field-medical training could not in any valuable way be applied to the present circumstances.  I drew away, rather, to avoid being in the way as I could not turn the situation to my advantage, and in doing so ran up against Badea, who stood at the very edge of the square, observing.  She stood alone; there were no other adults nearby, and there was blood on her hands. “Are you hurt also?” I asked her.  “No,” she returned, shortly.  I ventured on concern for her friends, and asked her if they had been hurt in fighting. “We have heard rumors,” I added, “that the Esperigans have been encroaching on your territory.” It was the first opportunity I had been given of hinting at even this much of our official sympathy, as the children only shrugged when I asked them if there were fighting going on.  She shrugged, too, with one shoulder, and the folded wing rose and fell with it. But then she said, “They leave their weapons in the forest for us, even where they cannot have gone.”  The Esperigans had several kinds of land-mine technologies, including a clever mobile one which could be programmed with a target either as specific as an individual’s genetic record or as general as a broadly defined body type—humanoid and winged, for instance—and set loose to wander until it found a match, then do the maximum damage it could. Only one side could carry explosive, as the other was devoted to the electronics. “The shrapnel, does it come only in one direction?” I asked, and made a fanned-out shape with my hands to illustrate. Badea looked at me sharply and nodded.  I explained the mine to her, and described their manufacture. “Some scanning devices can detect them,” I added, meaning to continue into an offer, but I had not finished the litany of materials before she was striding away from the square, without another word.  I was not dissatisfied with the reaction, in which I correctly read intention to put my information to immediate use, and two days later my patience was rewarded. Badea came to my house in the mid-morning and said, “We have found one of them. Can you show us how to disarm them?”  “I am not sure,” I told her, honestly. “The safest option would be to trigger it deliberately, from afar.”  “The plastics they use poison the ground.”  “Can you take me to its location?” I asked. She considered the question with enough seriousness that I realized there was either taboo or danger involved.  “Yes,” she said finally, and took me with her to a house near the center of the village. It had steps up to the roof, and from there we could climb to that of the neighboring house, and so on until we were high enough to reach a large basket, woven not of ropes but of a kind of vine, sitting in a crook of a tree. We climbed into this, and she kicked us off from the tree.  The movement was not smooth. The nearest I can describe is the sensation of being on a child’s swing, except at that highest point of weightlessness you do not go backwards, but instead go falling into another arc, but at tremendous speed, and with a pungent smell like rotten pineapple all around from the shattering of the leaves of the trees through which we were propelled. I was violently sick after some five minutes. To the comfort of my pride if not my stomach, Badea was also sick, though more efficiently and over the side, before our journey ended.  There were two other women waiting for us in the tree where we came to rest, both of them also winged: Renata and Paudi. “It’s gone another three hundred meters, towards Ighlan,” Renata told us—another nearby Melidan village, as they explained to me.  “If it comes near enough to pick up traces of organized habitation, it will not trigger until it is inside the settlement, among as many people as possible,” I said. “It may also have a burrowing mode, if it is the more expensive kind.”  They took me down through the canopy, carefully, and walked before and behind me when we came to the ground. Their wings were spread wide enough to brush against the hanging vines to either side, and they regularly leapt aloft for a brief survey. Several times they moved me with friendly hands into a slightly different path, although my untrained eyes could make no difference among the choices.  A narrow trail of large ants—the reader will forgive me for calling them ants, they were nearly indistinguishable from those efficient creatures—paced us over the forest floor, which I did not recognize as significant until we came near the mine, and I saw it covered with the ants, who did not impede its movement but milled around and over it with intense interest.  “We have adjusted them so they smell the plastic,” Badea said, when I asked. “We can make them eat it,” she added, “but we worried it would set off the device.”  The word adjusted scratches at the back of my mind again as I write this, that unpleasant tinny sensation of a term that does not allow of real translation and which has been inadequately replaced. I cannot improve upon the work of the official Confederacy translators, however; to encompass the true concept would require three dry, dusty chapters more suited to a textbook on the subject of biological engineering, which I am ill-qualified to produce. I do hope that I have successfully captured the wholly casual way she spoke of this feat. Our own scientists might replicate this act of genetic sculpting in any of two dozen excellent laboratories across the Confederacy—given several years, and a suitably impressive grant. They had done it in less than two days, as a matter of course.  I did not at the time indulge in admiration. The mine was ignoring the inquisitive ants and scuttling along at a good pace, the head with its glassy eye occasionally rotating upon its spindly spider-legs, and we had half a day in which to divert it from the village ahead.  Renata followed the mine as it continued on, while I sketched what I knew of the internals in the dirt for Badea and Paudi. Any sensible mine-maker will design the device to simply explode at any interference with its working other than the disable code, so our options were not particularly satisfying. “The most likely choice,” I suggested, “would be the transmitter. If it becomes unable to receive the disable code, there may be a failsafe which would deactivate it on a subsequent malfunction.”  Paudi had on her back a case which, unfolded, looked very like a more elegant and compact version of little Kitia’s worktable. She sat crosslegged with it on her lap and worked on it for some two hours’ time, occasionally reaching down to pick up a handful of ants, which dropped into the green matrix of her table mostly curled up and died, save for a few survivors, which she herded carefully into an empty jar before taking up another sample.  I sat on the forest floor beside her, or walked with Badea, who was pacing a small circle out around us, watchfully. Occasionally she would unsling her scythe-blade, and then put it away again, and once she brought down a mottie, a small lemur-like creature. I say lemur because there is nothing closer in my experience, but it had none of the charm of an Earth-native mammal; I rather felt an instinctive disgust looking at it, even before she showed me the tiny sucker-mouths full of hooked teeth with which it latched upon a victim.  She had grown a little more loquacious, and asked me about my own homeworld. I told her about Terce, and about the seclusion of women, which she found extremely funny, as we can only laugh at the follies of those far from us which threaten us not at all. The Melidans by design maintain a five-to-one ratio of women to men, as adequate to maintain a healthy gene pool while minimizing the overall resource consumption of their population. “They cannot take the wings, so it is more difficult for them to travel,” she added, with one sentence dismissing the lingering mystery which had perplexed earlier visitors, of the relative rarity of seeing their men.  She had two children, which she described to me proudly, living presently with their father and half-siblings in a village half a day’s travel away, and she was considering a third. She had trained as a forest ranger, another inadequately translated term which was at the time beginning to take on a military significance among them under the pressure of the Esperigan incursions.  “I’m done,” Paudi said, and we went to catch up Renata and find a nearby ant-nest, which looked like a mound of white cotton batting, rising several inches off the forest floor. Paudi introduced her small group of infected survivors into this colony, and after a little confusion and milling about, they accepted their transplantation and marched inside. The flow of departures slowed a little momentarily, then resumed, and a file split off from the main channel of workers to march in the direction of the mine.  These joined the lingering crowd still upon the mine, but the new arrivals did not stop at inspection and promptly began to struggle to insinuate themselves into the casing. We withdrew to a safe distance, watching. The mine continued on without any slackening in its pace for ten minutes, as more ants began to squeeze themselves inside, and then it hesitated, one spindly metal leg held aloft uncertainly. It went a few more slightly drunken paces, and then abruptly the legs all retracted and left it a smooth round lump on the forest floor.  The Fifth Adjustment  They showed me how to use their communications technology and grew me an interface to my own small handheld, so my report was at last able to go. Kostas began angry, of course, having been forced to defend the manner of my departure to the Esperigans without the benefit of any understanding of the circumstances, but I sent the report an hour before I messaged, and by the time we spoke he had read enough to be in reluctant agreement with my conclusions if not my methods.  I was of course full of self-satisfaction. Freed at long last from the academy and the walled gardens of Terce, armed with false confidence in my research and my training, I had so far achieved all that my design had stretched to encompass. The Esperigan blood had washed easily from my hands, and though I answered Kostas meekly when he upbraided me, privately I felt only impatience, and even he did not linger long on the topic: I had been too successful, and he had more important news.  The Esperigans had launched a small army two days before, under the more pleasant-sounding name of expeditionary defensive force. Their purpose was to establish a permanent settlement on the Melidan shore, some nine hundred miles from my present location, and begin the standard process of terraforming. The native life would be eradicated in spheres of a hundred miles across at a time: first the broad strokes of clear-cutting and the electrified nets, then the irradiation of the soil and the air, and after that the seeding of Earth-native microbes and plants. So had a thousand worlds been made over anew, and though the Esperigans had fully conquered their own continent five centuries before, they still knew the way.  He asked doubtfully if I thought some immediate resistance could be offered. Disabling a few mines scattered into the jungle seemed to him a small task. Confronting a large and organized military force was on a different order of magnitude. “I think we can do something,” I said, maintaining a veneer of caution for his benefit, and took the catalog of equipment to Badea as soon as we had disengaged.  She was occupied in organizing the retrieval of the deactivated mines, which the ants were now leaving scattered in the forests and jungles. A bird-of-paradise variant had been adjusted to make a meal out of the ants and take the glittery mines back to their tree-top nests, where an observer might easily see them from above. She and the other collectors had so far found nearly a thousand of them. The mines made a neat pyramid, as of the harvested skulls of small cyclopean creatures with their dull eyes staring out lifelessly.  The Esperigans needed a week to cross the ocean in their numbers, and I spent it with the Melidans, developing our response. There was a heady delight in this collaboration. The work was easy and pleasant in their wide-open laboratories full of plants, roofed only with the fluttering sailcloth eating sunlight to give us energy, and the best of them coming from many miles distant to participate in the effort. The Confederacy spy-satellites had gone into orbit perhaps a year after our first contact: I likely knew more about the actual force than the senior administrators of Melida. I was in much demand, consulted not only for my information but my opinion.  In the ferment of our labors, I withheld nothing. This was not yet deliberate, but neither was it innocent. I had been sent to further a war, and if in the political calculus which had arrived at this solution the lives of soldiers were only variables, yet there was still a balance I was expected to preserve. It was not my duty to give the Melidans an easy victory, any more than it had been Kostas’s to give one to the Esperigans.  A short and victorious war, opening a new and tantalizing frontier for restless spirits, would at once drive up that inconvenient nationalism which is the Confederacy’s worst obstacle, and render less compelling the temptations we could offer to lure them into fully joining galactic society. On the other hand, to descend into squalor, a more equal kind of civil war has often proven extremely useful, and the more lingering and bitter the better. I was sent to the Melidans in hope that, given some guidance and what material assistance we could quietly provide without taking any official position, they might be an adequate opponent for the Esperigans to produce this situation.  There has been some criticism of the officials who selected me for this mission, but in their defense, it must be pointed out it was not in fact my assignment to actually provide military assistance, nor could anyone, even myself, have envisioned my proving remotely useful in such a role. I was only meant to be an early scout. My duty was to acquire cultural information enough to open a door for a party of military experts from Voca Libre, who would not reach Melida for another two years. Ambition and opportunity promoted me, and no official hand.  I think these experts arrived sometime during the third Esperigan offensive. I cannot pinpoint the date with any accuracy, I had by then ceased to track the days, and I never met them. I hope they can forgive my theft of their war; I paid for my greed.  The Esperigans used a typical carbonized steel in most of their equipment, as bolts and hexagonal nuts and screws with star-shaped heads, and woven into the tough mesh of their body armor. This was the target of our efforts. It was a new field of endeavor for the Melidans, who used metal as they used meat, sparingly and with a sense of righteousness in its avoidance. To them it was either a trace element needed in minute amounts, or an undesirable by-product of the more complicated biological processes they occasionally needed to invoke.  However, they had developed some strains of bacteria to deal with this latter waste, and the speed with which they could manipulate these organisms was extraordinary. Another quantity of the ants—a convenient delivery mechanism used by the Melidans routinely, as I learned—were adjusted to render them deficient in iron and to provide a home in their bellies for the bacteria, transforming them into shockingly efficient engines of destruction. Set loose upon several of the mines as a trial, they devoured the carapaces and left behind only smudgy black heaps of carbon dust, carefully harvested for fertilizer, and the plastic explosives from within, nestled in their bed of copper wire and silicon.  The Esperigans landed, and at once carved themselves out a neat half-moon of wasteland from the virgin shore, leaving no branches which might stretch above their encampment to offer a platform for attack. They established an electrified fence around the perimeter, with guns and patrols, and all this I observed with Badea, from a small platform in a vine-choked tree not far away: we wore the green-gray cloaks, and our faces were stained with leaf juice.  I had very little justification for inserting myself into such a role but the flimsy excuse of pointing out to Badea the most crucial section of their camp, when we had broken in. I cannot entirely say why I wished to go along on so dangerous an expedition. I am not particularly courageous. Several of my more unkind biographers have accused me of bloodlust, and pointed to this as a sequel to the disaster of my first departure. I cannot refute the accusation on the evidence, however I will point out that I chose that portion of the expedition which we hoped would encounter no violence.  But it is true I had learned already to seethe at the violent piggish blindness of the Esperigans, who would have wrecked all the wonders around me only to propagate yet another bland copy of Earth and suck dry the carcass of their own world. They were my enemy both by duty and by inclination, and I permitted myself the convenience of hating them. At the time, it made matters easier.  The wind was running from the east, and several of the Melidans attacked the camp from that side. The mines had yielded a quantity of explosive large enough to pierce the Esperigans’ fence and shake the trees even as far as our lofty perch. The wind carried the smoke and dust and flames towards us, obscuring the ground and rendering the soldiers in their own camp only vague ghostlike suggestions of human shape. The fighting was hand-to-hand, and the stutter of gunfire came only tentatively through the chaos of the smoke.  Badea had been holding a narrow cord, one end weighted with a heavy seed-pod. She now poured a measure of water onto the pod, from her canteen, then flung it out into the air. It sailed over the fence and landed inside the encampment, behind one of the neat rows of storage tents. The seed pod struck the ground and immediately burst like a ripe fruit, an anemone tangle of waving roots creeping out over the ground and anchoring the cord, which she had secured at this end around one thick branch.  We let ourselves down it, hand over hand. There was none of that typical abrasion or friction which I might have expected from rope; my hands felt as cool and comfortable when we descended as when we began. We ran into the narrow space between the tents. I was experiencing that strange elongation of time which crisis can occasionally produce: I was conscious of each footfall, and of the seeming-long moments it took to place each one.  There were wary soldiers at many of the tent entrances, likely those which held either the more valuable munitions or the more valuable men. Their discipline had not faltered, even while the majority of the force was already orchestrating a response to the Melidan assault on the other side of the encampment. But we did not need to penetrate into the tents. The guards were rather useful markers for us, showing me which of the tents were the more significant. I pointed out to Badea the cluster of four tents, each guarded at either side by a pair, near the farthest end of the encampment.  Badea looked here and there over the ground as we darted under cover of smoke from one alleyway to another, the walls of waxed canvas muffling the distant shouts and the sound of gunfire. The dirt still had the yellowish tinge of Melidan soil—the Esperigans had not yet irradiated it—but it was crumbly and dry, the fine fragile native moss crushed and much torn by heavy boots and equipment, and the wind raised little dervishes of dust around our ankles.  “This ground will take years to recover fully,” she said to me, soft and bitterly, as she stopped us and knelt, behind a deserted tent not far from our target. She gave me a small ceramic implement which looked much like the hair-picks sometimes worn on Terce by women with hair which never knew a blade’s edge: a raised comb with three teeth, though on the tool these were much longer and sharpened at the end. I picked the ground vigorously, stabbing deep to aerate the wounded soil, while she judiciously poured out a mixture of water and certain organic extracts, and sowed a packet of seeds.  This may sound a complicated operation to be carrying out in an enemy camp, in the midst of battle, but we had practiced the maneuver, and indeed had we been glimpsed, anyone would have been hard-pressed to recognize a threat in the two gray-wrapped lumps crouched low as we pawed at the dirt. Twice while we worked, wounded soldiers were carried in a rush past either end of our alleyway, towards shelter. We were not seen.  The seeds she carried, though tiny, burst readily, and began to thrust out spiderweb-fine rootlets at such a speed they looked like nothing more than squirming maggots. Badea without concern moved her hands around them, encouraging them into the ground. When they were established, she motioned me to stop my work, and she took out the prepared ants: a much greater number of them, with a dozen of the fat yellow wasp-sized brood-mothers. Tipped out into the prepared and welcoming soil, they immediately began to burrow their way down, with the anxious harrying of their subjects and spawn.  Badea watched for a long while, crouched over, even after the ants had vanished nearly all beneath the surface. The few who emerged and darted back inside, the faint trembling of the rootlets, the shifting grains of dirt, all carried information to her. At length satisfied, she straightened saying, “Now—”  The young soldier was I think only looking for somewhere to piss, rather than investigating some noise. He came around the corner already fumbling at his belt, and seeing us did not immediately shout, likely from plain surprise, but grabbed for Badea’s shoulder first. He was clean-shaven, and the name on his lapel badge was Ridang. I drove the soil-pick into his eye. I was taller, so the stroke went downwards, and he fell backwards to his knees away from me, clutching at his face.  He did not die at once. There must be very few deaths which come immediately, though we often like to comfort ourselves by the pretense that this failure of the body, or that injury, must at once eradicate consciousness and life and pain all together. Here sentience lasted several moments which seemed to me long: his other eye was open, and looked at me while his hands clawed for the handle of the pick. When this had faded, and he had fallen supine to the ground, there was yet a convulsive movement of all the limbs and a trickling of blood from mouth and nose and eye before the final stiffening jerk left the body emptied and inanimate.  I watched him die in a strange parody of serenity, all feeling hollowed out of me, and then turning away vomited upon the ground. Behind me, Badea cut open his belly and his thighs and turned him face down onto the dirt, so the blood and the effluvia leaked out of him. “That will do a little good for the ground at least, before they carry him away to waste him,” she said. “Come.” She touched my shoulder, not unkindly, but I flinched from the touch as from a blow.  It was not that Badea or her fellows were indifferent to death, or casual towards murder. But there is a price to be paid for living in a world whose native hostilities have been cherished rather than crushed. Melidan life expectancy is some ten years beneath that of Confederacy citizens, though they are on average healthier and more fit both genetically and physically. In their philosophy a human life is not inherently superior and to be valued over any other kind. Accident and predation claim many, and living intimately with the daily cruelties of nature dulls the facility for sentiment. Badea enjoyed none of that comforting distance which allows us to think ourselves assured of the full potential span of life, and therefore suffered none of the pangs when confronted with evidence to the contrary. I looked at my victim and saw my own face; so too did she, but she had lived all her life so aware, and it did not bow her shoulders.  Five days passed before the Esperigan equipment began to come apart. Another day halted all their work, and in confusion they retreated to their encampment. I did not go with the Melidan company that destroyed them to the last man.  Contrary to many accusations, I did not lie to Kostas in my report and pretend surprise. I freely confessed to him I had expected the result, and truthfully explained I had not wished to make claims of which I was unsure. I never deliberately sought to deceive any of my superiors or conceal information from them, save in such small ways. At first I was not Melidan enough to wish to do so, and later I was too Melidan to feel anything but revulsion at the concept.  He and I discussed our next steps in the tiger-dance. I described as best I could the Melidan technology, and after consultation with various Confederacy experts, it was agreed he would quietly mention to the Esperigan minister of defense, at their weekly luncheon, a particular Confederacy technology: ceramic coatings, which could be ordered at vast expense and two years’ delay from Bel Rios. Or, he would suggest, if the Esperigans wished to deed some land to the Confederacy, a private entrepreneurial concern might fund the construction of a local fabrication plant, and produce them at much less cost, in six months’ time.  The Esperigans took the bait, and saw only private greed behind this apparent breach of neutrality: imagining Kostas an investor in this private concern, they winked at his veniality, and eagerly helped us to their own exploitation. Meanwhile, they continued occasional and tentative incursions into the Melidan continent, probing the coastline, but the disruption they created betrayed their attempts, and whichever settlement was nearest would at once deliver them a present of the industrious ants, so these met with no greater success than the first.  Through these months of brief and grudging detente, I traveled extensively throughout the continent. My journals are widely available, being the domain of our government, but they are shamefully sparse, and I apologize to my colleagues for it. I would have been more diligent in my work if I had imagined I would be the last and not the first such chronicler. At the time, giddy with success, I went with more the spirit of a holidaymaker than a researcher, and I sent only those images and notes which it was pleasant to me to record, with the excuse of limited capacity to send my reports.  For what cold comfort it may be, I must tell you photography and description are inadequate to convey the experience of standing in the living heart of a world, alien yet not hostile, and when I walked hand in hand with Badea along the crest of a great canyon wall and looked down over the ridges of purple and grey and ochre at the gently waving tendrils of an elacca forest, which in my notorious video recordings can provoke nausea in nearly every observer, I felt the first real stir of an unfamiliar sensation of beauty-in-strangeness, and I laughed in delight and surprise, while she looked at me and smiled.  We returned to her village three days later and saw the bombing as we came, the new Esperigan long-range fighter planes like narrow silver knife-blades making low passes overhead, the smoke rising black and oily against the sky. Our basket-journey could not be accelerated, so we could only cling to the sides and wait as we were carried onward. The planes and the smoke were gone before we arrived; the wreckage was not.  I was angry at Kostas afterwards, unfairly. He was no more truly the Esperigans’ confidant than they were his, but I felt at the time that it was his business to know what they were about, and he had failed to warn me. I accused him of deliberate concealment; he told me, censoriously, that I had known the risk when I had gone to the continent, and he could hardly be responsible for preserving my safety while I slept in the very war zone. This silenced my tirade, as I realized how near I had come to betraying myself. Of course he would not have wanted me to warn the Melidans; it had not yet occurred to him I would have wished to, myself. I ought not have wanted to.  Forty-three people were killed in the attack. Kitia was yet lingering when I came to her small bedside. She was in no pain, her eyes cloudy and distant, already withdrawing; her family had been and gone again. “I knew you were coming back, so I asked them to let me stay a little longer,” she told me. “I wanted to say goodbye.” She paused and added uncertainly, “And I was afraid, a little. Don’t tell.”  I promised her I would not. She sighed and said, “I shouldn’t wait any longer. Will you call them over?”  The attendant came when I raised my hand, and he asked Kitia, “Are you ready?”  “Yes,” she said, a little doubtful. “It won’t hurt?”  “No, not at all,” he said, already taking out with a gloved hand a small flat strip from a pouch, filmy green and smelling of raspberries. Kitia opened her mouth, and he laid it on her tongue. It dissolved almost at once, and she blinked twice and was asleep. Her hand went cold a few minutes later, still lying between my own.  I stood with her family when we laid her to rest, the next morning. The attendants put her carefully down in a clearing, and sprayed her from a distance, the smell of cut roses just going to rot, and stepped back. Her parents wept noisily; I stayed dry-eyed as any seemly Terce matron, displaying my assurance of the ascension of the dead. The birds came first, and the motties, to pluck at her eyes and her lips, and the beetles hurrying with a hum of eager jaws to deconstruct her into raw parts. They did not have long to feast: the forest itself was devouring her from below in a green tide rising, climbing in small creepers up her cheeks and displacing them all.  When she was covered over, the mourners turned away and went to join the shared wake behind us in the village square. They threw uncertain and puzzled looks at my remaining as they went past, and at my tearless face. But she was not yet gone: there was a suggestion of a girl lingering there, a collapsing scaffold draped in an unhurried carpet of living things. I did not leave, though behind me there rose a murmur of noise as the families of the dead spoke reminiscences of their lost ones.  Near dawn, the green carpeting slipped briefly. In the dim watery light I glimpsed for one moment an emptied socket full of beetles, and I wept.  The Sixth Adjustment  I will not claim, after this, that I took the wings only from duty, but I refute the accusation I took them in treason. There was no other choice. Men and children and the elderly or the sick, all the wingless, were fleeing from the continuing hail of Esperigan attacks. They were retreating deep into the heart of the continent, beyond the refueling range for the Esperigan warcraft, to shelters hidden so far in caves and in overgrowth that even my spy satellites knew nothing of them. My connection to Kostas would have been severed, and if I could provide neither intelligence nor direct assistance, I might as well have slunk back to the embassy, and saved myself the discomfort of being a refugee. Neither alternative was palatable.  They laid me upon the altar like a sacrifice, or so I felt, though they gave me something to drink which calmed my body, the nervous and involuntary twitching of my limbs and skin. Badea sat at my head and held the heavy long braid of my hair out of the way, while the others depilated my back and wiped it with alcohol. They bound me down then, and slit my skin open in two lines mostly parallel to the spine. Then Paudi gently set the wings upon me.  I lacked the skill to grow my own, in the time we had; Badea and Paudi helped me to mine so that I might stay. But even with the little assistance I had been able to contribute, I had seen more than I wished to of the parasites, and despite my closed eyes, my face turned downwards, I knew to my horror that the faint curious feather-brush sensation was the intrusion of the fine spiderweb filaments, each fifteen feet long, which now wriggled into the hospitable environment of my exposed inner flesh and began to sew themselves into me.  Pain came and went as the filaments worked their way through muscle and bone, finding one bundle of nerves and then another. After the first half hour, Badea told me gently, “It’s coming to the spine,” and gave me another drink. The drug kept my body from movement, but could do nothing to numb the agony. I cannot describe it adequately. If you have ever managed to inflict food poisoning upon yourself, despite all the Confederacy’s safeguards, you may conceive of the kind if not the degree of suffering, an experience which envelops the whole body, every muscle and joint, and alters not only your physical self but your thoughts: all vanishes but pain, and the question, is the worst over? which is answered no and no again.  But at some point the pain began indeed to ebb. The filaments had entered the brain, and it is a measure of the experience that what I had feared the most was now blessed relief; I lay inert and closed my eyes gratefully while sensation spread outward from my back, and my new-borrowed limbs became gradually indeed my own, flinching from the currents of the air, and the touch of my friends’ hands upon me. Eventually I slept.  The Seventh Adjustment  The details of the war, which unfolded now in earnest, I do not need to recount again. Kostas kept excellent records, better by far than my own, and students enough have memorized the dates and geographic coordinates, bounding death and ruin in small numbers. Instead I will tell you that from aloft, the Esperigans’ poisoned-ground encampments made half-starbursts of ochre brown and withered yellow, outlines like tentacles crawling into the healthy growth around them. Their supply-ships anchored out to sea glazed the water with a slick of oil and refuse, while the soldiers practiced their shooting on the vast schools of slow-swimming kraken young, whose bloated white bodies floated to the surface and drifted away along the coast, so many they defied even the appetite of the sharks.  I will tell you that when we painted their hulls with algaes and small crustacean-like borers, our work was camouflaged by great blooms of sea day-lilies around the ships, their masses throwing up reflected red color on the steel to hide the quietly creeping rust until the first winter storms struck and the grown kraken came to the surface to feed. I will tell you we watched from shore while the ships broke and foundered, and the teeth of the kraken shone like fire opals in the explosions, and if we wept, we wept only for the soiled ocean.  Still more ships came, and more planes; the ceramic coatings arrived, and more soldiers with protected guns and bombs and sprayed poisons, to fend off the altered motties and the little hybrid sparrowlike birds, their sharp cognizant eyes chemically retrained to see the Esperigan uniform colors as enemy markings. We planted acids and more aggressive species of plants along their supply lines, so their communications remained hopeful rather than reliable, and ambushed them at night; they carved into the forest with axes and power-saws and vast strip-miners, which ground to a halt and fell to pieces, choking on vines which hardened to the tensile strength of steel as they matured.  Contrary to claims which were raised at my trial in absentia and disproven with communication logs, throughout this time I spoke to Kostas regularly. I confused him, I think; I gave him all the intelligence which he needed to convey to the Esperigans, that they might respond to the next Melidan foray, but I did not conceal my feelings or the increasing complication of my loyalties, objecting to him bitterly and with personal anger about Esperigan attacks. I misled him with honesty: he thought, I believe, that I was only spilling a natural frustration to him, and through that airing clearing out my own doubts. But I had only lost the art of lying.  There is a general increase of perception which comes with the wings, the nerves teased to a higher pitch of awareness. All the little fidgets and twitches of lying betray themselves more readily, so only the more twisted forms can evade detection—where the speaker first deceives herself, or the wholly casual deceit of the sociopath who feels no remorse. This was the root of the Melidan disgust of the act, and I had acquired it.  If Kostas had known, he would at once have removed me: a diplomat is not much use if she cannot lie at need, much less an agent. But I did not volunteer the information, and indeed I did not realize, at first, how fully I had absorbed the stricture. I did not realize at all, until Badea came to me, three years into the war. I was sitting alone and in the dark by the communications console, the phosphorescent after-image of Kostas’s face fading into the surface.  She sat down beside me and said, “The Esperigans answer us too quickly. Their technology advances in these great leaps, and every time we press them back, they return in less than a month to very nearly the same position.”  I thought, at first, that this was the moment: that she meant to ask me about membership in the Confederacy. I felt no sense of satisfaction, only a weary kind of resignation. The war would end, the Esperigans would follow, and in a few generations they would both be eaten up by bureaucracy and standards and immigration.  Instead Badea looked at me and said, “Are your people helping them, also?”  My denial ought to have come without thought, leapt easily off the tongue with all the conviction duty could give it, and been followed by invitation. Instead I said nothing, my throat closed involuntarily. We sat silently in the darkness, and at last she said, “Will you tell me why?”  I felt at the time I could do no more harm, and perhaps some good, by honesty. I told her all the rationale, and expressed all our willingness to receive them into our union as equals. I went so far as to offer her the platitudes with which we convince ourselves we are justified in our slow gentle imperialism: that unification is necessary and advances all together, bringing peace.  She only shook her head and looked away from me. After a moment, she said, “Your people will never stop. Whatever we devise, they will help the Esperigans to a counter, and if the Esperigans devise some weapon we cannot defend ourselves against, they will help us, and we will batter each other into limp exhaustion, until in the end we all fall.”  “Yes,” I said, because it was true. I am not sure I was still able to lie, but in any case I did not know, and I did not lie.  I was not permitted to communicate with Kostas again until they were ready. Thirty-six of the Melidans’ greatest designers and scientists died in the effort. I learned of their deaths in bits and pieces. They worked in isolated and quarantined spaces, their every action recorded even as the viruses and bacteria they were developing killed them. It was a little more than three months before Badea came to me again.  We had not spoken since the night she had learned the duplicity of the Confederacy’s support and my own. I could not ask her forgiveness, and she could not give it. She did not come for reconciliation but to send a message to the Esperigans and to the Confederacy through me.  I did not comprehend at first. But when I did, I knew enough to be sure she was neither lying nor mistaken, and to be sure the threat was very real. The same was not true of Kostas, and still less of the Esperigans. My frantic attempts to persuade them worked instead to the contrary end. The long gap since my last communique made Kostas suspicious: he thought me a convert, or generously a manipulated tool.  “If they had the capability, they would have used it already,” he said, and if I could not convince him, the Esperigans would never believe.  I asked Badea to make a demonstration. There was a large island broken off the southern coast of the Esperigan continent, thoroughly settled and industrialized, with two substantial port cities. Sixty miles separated it from the mainland. I proposed the Melidans should begin there, where the attack might be contained.  “No,” Badea said. “So your scientists can develop a counter? No. We are done with exchanges.”  The rest you know. A thousand coracles left Melidan shores the next morning, and by sundown on the third following day, the Esperigan cities were crumbling. Refugees fled the groaning skyscrapers as they slowly bowed under their own weight. The trees died; the crops also, and the cattle, all the life and vegetation that had been imported from Earth and square-peg forced into the new world stripped bare for their convenience.  Meanwhile in the crowded shelters the viruses leapt easily from one victim to another, rewriting their genetic lines. Where the changes took hold, the altered survived. The others fell to the same deadly plagues that consumed all Earth-native life. The native Melidan moss crept in a swift green carpet over the corpses, and the beetle-hordes with it.  I can give you no first-hand account of those days. I too lay fevered and sick while the alteration ran its course in me, though I was tended better, and with more care, by my sisters. When I was strong enough to rise, the waves of death were over. My wings curled limply over my shoulders as I walked through the empty streets of Landfall, pavement stones pierced and broken by hungry vines, like bones cracked open for marrow. The moss covered the dead, who filled the shattered streets.  The squat embassy building had mostly crumpled down on one corner, smashed windows gaping hollow and black. A large pavilion of simple cotton fabric had been raised in the courtyard, to serve as both hospital and headquarters. A young undersecretary of state was the senior diplomat remaining. Kostas had died early, he told me. Others were still in the process of dying, their bodies waging an internal war that left them twisted by hideous deformities.  Less than one in thirty, was his estimate of the survivors. Imagine yourself on an air-train in a crush, and then imagine yourself suddenly alone but for one other passenger across the room, a stranger staring at you. Badea called it a sustainable population.  The Melidans cleared the spaceport of vegetation, though little now was left but the black-scorched landing pad, Confederacy manufacture, all of woven carbon and titanium.  “Those who wish may leave,” Badea said. “We will help the rest.”  Most of the survivors chose to remain. They looked at their faces in the mirror, flecked with green, and feared the Melidans less than their welcome on another world.  I left by the first small ship that dared come down to take off refugees, with no attention to the destination or the duration of the voyage. I wished only to be away. The wings were easily removed. A quick and painful amputation of the gossamer and fretwork which protruded from the flesh, and the rest might be left for the body to absorb slowly. The strange muffled quality of the world, the sensation of numbness, passed eventually. The two scars upon my back, parallel lines, I will keep the rest of my days.  Afterword  I spoke with Badea once more before I left. She came to ask me why I was going, to what end I thought I went. She would be perplexed, I think, to see me in my little cottage here on Reivaldt, some hundred miles from the nearest city, although she would have liked the small flowerlike lieden which live on the rocks of my garden wall, one of the few remnants of the lost native fauna which have survived the terraforming outside the preserves of the university system.  I left because I could not remain. Every step I took on Melida, I felt dead bones cracking beneath my feet. The Melidans did not kill lightly, an individual or an ecosystem, nor any more effectually than do we. If the Melidans had not let the plague loose upon the Esperigans, we would have destroyed them soon enough ourselves, and the Melidans with them. But we distance ourselves better from our murders, and so are not prepared to confront them. My wings whispered to me gently when I passed Melidans in the green-swathed cemetary streets, that they were not sickened, were not miserable. There was sorrow and regret but no self-loathing, where I had nothing else. I was alone.  When I came off my small vessel here, I came fully expecting punishment, even longing for it, a judgment which would at least be an end. Blame had wandered through the halls of state like an unwanted child, but when I proved willing to adopt whatever share anyone cared to mete out to me, to confess any crime which was convenient and to proffer no defense, it turned contrary, and fled.  Time enough has passed that I can be grateful now to the politicians who spared my life and gave me what passes for my freedom. In the moment, I could scarcely feel enough even to be happy that my report contributed some little to the abandonment of any reprisal against Melida: as though we ought hold them responsible for defying our expectations not of their willingness to kill one another, but only of the extent of their ability.  But time does not heal all wounds. I am often asked by visitors whether I would ever return to Melida. I will not. I am done with politics and the great concerns of the universe of human settlement. I am content to sit in my small garden, and watch the ants at work.  Ruth Patrona    Originally published in Warriors 2, edited by Gardner Dozois and George R. R. Martin, 2010. Born in New York City, where she still lives with her mystery-editor husband and six computers, Naomi Novik is a first-generation American who was raised on Polish fairy tales, Baba Yaga, and Tolkien. After doing graduate work in Computer Science at Columbia University, she participated in the development of the computer game Neverwinter Nights: Shadows of Undrentide, and then decided to try her hand at novels. A good decision! The resultant Temeraire series—consisting of Temeraire, His Majesty's Dragon, Black Powder War, The Throne of Jade, Tongue of Serpents, Victory of Eagles, Empire of Ivory, Crucible of Gold, and Blood of Tyrants—describing an alternate version of the Napoleonic Wars where dragons are used as living weapons, has been phenomenally popular and successful. Coming up is a new non-Temeraire fantasy novel, Uprooted.", "text": "12760 words, novelette, REPRINT\nSeven Years from Home\nPreface\nSeven days passed for me on my little raft of a ship as I fled Melida; seven years for the rest of the unaccelerated universe. I hoped to be forgotten, a dusty footnote left at the bottom of a page. Instead I came off to trumpets and medals and legal charges, equal doses of acclaim and venom, and I stumbled bewildered through the brassy noise, led first by one and then by another, while my last opportunity to enter any protest against myself escaped.\nNow I desire only to correct the worst of the factual inaccuracies bandied about, so far as my imperfect memory will allow, and to make an offering of my own understanding to that smaller and more sophisticate audience who prefer to shape the world’s opinion rather than be shaped by it.\nI engage not to tire you with a recitation of dates and events and quotations. I do not recall them with any precision myself. But I must warn you that neither have I succumbed to that pathetic and otiose impulse to sanitize the events of the war, or to excuse sins either my own or belonging to others. To do so would be a lie, and on Melida, to tell a lie was an insult more profound than murder.\nI will not see my sisters again, whom I loved. Here we say that one who takes the long midnight voyage has leaped ahead in time, but to me it seems it is they who have traveled on ahead. I can no longer hear their voices when I am awake. I hope this will silence them in the night.\nRuth Patrona\nReivaldt, Janvier 32, 4765\nThe First Adjustment\nI disembarked at the port of Landfall in the fifth month of 4753. There is such a port on every world where the Confederacy has set its foot but not yet its flag: crowded and dirty and charmless. It was on the Esperigan continent, as the Melidans would not tolerate the construction of a spaceport in their own territory.\nAmbassador Kostas, my superior, was a man of great authority and presence, two meters tall and solidly built, with a jovial handshake, high intelligence, and very little patience for fools; that I was likely to be relegated to this category was evident on our first meeting. He disliked my assignment to begin with. He thought well of the Esperigans; he moved in their society as easily as he did in our own, and would have called one or two of their senior ministers his personal friends, if only such a gesture were not highly unprofessional. He recognized his duty, and on an abstract intellectual level the potential value of the Melidans, but they revolted him, and he would have been glad to find me of like mind, ready to draw a line through their name and give them up as a bad cause.\nA few moments’ conversation was sufficient to disabuse him of this hope. I wish to attest that he did not allow the disappointment to in any way alter the performance of his duty, and he could not have objected with more vigor to my project of proceeding at once to the Melidan continent, to his mind a suicidal act.\nIn the end he chose not to stop me. I am sorry if he later regretted that, as seems likely. I took full advantage of the weight of my arrival. Five years had gone by on my homeworld of Terce since I had embarked, and there is a certain moral force to having sacrificed a former life for the one unknown. I had observed it often with new arrivals on Terce: their first requests were rarely refused even when foolish, as they often were. I was of course quite sure my own were eminently sensible.\n“We will find you a guide,” he said finally, yielding, and all the machinery of the Confederacy began to turn to my desire, a heady sensation.\nBadea arrived at the embassy not two hours later. She wore a plain gray wrap around her shoulders, draped to the ground, and another wrap around her head. The alterations visible were only small ones: a smattering of green freckles across the bridge of her nose and cheeks, a greenish tinge to her lips and nails. Her wings were folded and hidden under the wrap, adding the bulk roughly of an overnight hiker’s backpack. She smelled a little like the sourdough used on Terce to make roundbread, noticeable but not unpleasant. She might have walked through a spaceport without exciting comment.\nShe was brought to me in the shambles of my new office, where I had barely begun to lay out my things. I was wearing a conservative black suit, my best, tailored because you could not buy trousers for women ready-made on Terce, and, thankfully, comfortable shoes, because elegant ones on Terce were not meant to be walked in. I remember my clothing particularly because I was in it for the next week without opportunity to change.\n“Are you ready to go?” she asked me, as soon as we were introduced and the receptionist had left.\nI was quite visibly not ready to go, but this was not a misunderstanding: she did not want to take me. She thought the request stupid, and feared my safety would be a burden on her. If Ambassador Kostas would not mind my failure to return, she could not know that, and to be just, he would certainly have reacted unpleasantly in any case, figuring it as his duty.\nBut when asked for a favor she does not want to grant, a Melidan will sometimes offer it anyway, only in an unacceptable or awkward way. Another Melidan will recognize this as a refusal, and withdraw the request. Badea did not expect this courtesy from me, she only expected that I would say I could not leave at once. This she could count to her satisfaction as a refusal, and she would not come back to offer again.\nI was however informed enough to be dangerous, and I did recognize the custom. I said, “It is inconvenient, but I am prepared to leave immediately.” She turned at once and walked out of my office, and I followed her. It is understood that a favor accepted despite the difficulty and constraints laid down by the giver must be necessary to the recipient, as indeed this was to me; but in such a case, the conditions must then be endured, even if artificial.\nI did not risk a pause at all even to tell anyone I was going; we walked out past the embassy secretary and the guards, who did not do more than give us a cursory glance—we were going the wrong way, and my citizen’s button would likely have saved us interruption in any case. Kostas would not know I had gone until my absence was noticed and the security logs examined.\nThe Second Adjustment\nI was not unhappy as I followed Badea through the city. A little discomfort was nothing to me next to the intense satisfaction of, as I felt, having passed a first test: I had gotten past all resistance offered me, both by Kostas and Badea, and soon I would be in the heart of a people I already felt I knew. Though I would be an outsider among them, I had lived all my life to the present day in the self-same state, and I did not fear it, or for the moment anything else.\nBadea walked quickly and with a freer stride than I was used to, loose-limbed. I was taller, but had to stretch to match her. Esperigans looked at her as she went by, and then looked at me, and the pressure of their gaze was suddenly hostile. “We might take a taxi,” I offered. Many were passing by empty. “I can pay.”\n“No,” she said, with a look of distaste at one of those conveyances, so we continued on foot.\nAfter Melida, during my black-sea journey, my doctoral dissertation on the Canaan movement was published under the escrow clause, against my will. I have never used the funds, which continue to accumulate steadily. I do not like to inflict them on any cause I admire sufficiently to support, so they will go to my family when I have gone; my nephews will be glad of it, and of the passing of an embarrassment, and that is as much good as it can be expected to provide.\nThere is a great deal within that book which is wrong, and more which is wrongheaded, in particular any expression of opinion or analysis I interjected atop the scant collection of accurate facts I was able to accumulate in six years of over-enthusiastic graduate work. This little is true: the Canaan movement was an offshoot of conservation philosophy. Where the traditionalists of that movement sought to restrict humanity to dead worlds and closed enclaves on others, the Canaan splinter group wished instead to alter themselves while they altered their new worlds, meeting them halfway.\nThe philosophy had the benefit of a certain practicality, as genetic engineering and body modification was and remains considerably cheaper than terraforming, but we are a squeamish and a violent species, and nothing invites pogrom more surely than the neighbor who is different from us, yet still too close. In consequence, the Melidans were by our present day the last surviving Canaan society.\nThey had come to Melida and settled the larger of the two continents some eight hundred years before. The Esperigans came two hundred years later, refugees from the plagues on New Victoire, and took the smaller continent. The two had little contact for the first half-millennium; we of the Confederacy are given to think in worlds and solar systems, and to imagine that only a space voyage is long, but a hostile continent is vast enough to occupy a small and struggling band. But both prospered, each according to their lights, and by the time I landed, half the planet glittered in the night from space, and half was yet pristine.\nIn my dissertation, I described the ensuing conflict as natural, which is fair if slaughter and pillage are granted to be natural to our kind. The Esperigans had exhausted the limited raw resources of their share of the planet, and a short flight away was the untouched expanse of the larger continent, not a tenth as populated as their own. The Melidans controlled their birthrate, used only sustainable quantities, and built nothing which could not be eaten by the wilderness a year after they had abandoned it. Many Esperigan philosophes and politicians trumpeted their admiration of Melidan society, but this was only a sort of pleasant spiritual refreshment, as one admires a saint or a martyr without ever wishing to be one.\nThe invasion began informally, with adventurers and entrepreneurs, with the desperate, the poor, the violent. They began to land on the shores of the Melidan territory, to survey, to take away samples, to plant their own foreign roots. They soon had a village, then more than one. The Melidans told them to leave, which worked as well as it ever has in the annals of colonialism, and then attacked them. Most of the settlers were killed; enough survived and straggled back across the ocean to make a dramatic story of murder and cruelty out of it.\nI expressed the conviction to the Ministry of State, in my pre-assignment report, that the details had been exaggerated, and that the attacks had been provoked more extensively. I was wrong, of course. But at the time I did not know it.\nBadea took me to the low quarter of Landfall, so called because it faced on the side of the ocean downcurrent from the spaceport. Iridescent oil and a floating mat of discards glazed the edge of the surf. The houses were mean and crowded tightly upon one another, broken up mostly by liquor stores and bars. Docks stretched out into the ocean, extended long to reach out past the pollution, and just past the end of one of these floated a small boat, little more than a simple coracle: a hull of brown bark, a narrow brown mast, a grey-green sail slack and trembling in the wind.\nWe began walking out towards it, and those watching—there were some men loitering about the docks, fishing idly, or working on repairs to equipment or nets—began to realize then that I meant to go with her.\nThe Esperigans had already learned the lesson we like to teach as often as we can, that the Confederacy is a bad enemy and a good friend, and while no one is ever made to join us by force, we cannot be opposed directly. We had given them the spaceport already, an open door to the rest of the settled worlds, and they wanted more, the moth yearning. I relied on this for protection, and did not consider that however much they wanted from our outstretched hand, they still more wished to deny its gifts to their enemy.\nFour men rose as we walked the length of the dock, and made a line across it. “You don’t want to go with that one, ma’am,” one of them said to me, a parody of respect. Badea said nothing. She moved a little aside, to see how I would answer them.\n“I am on assignment for my government,” I said, neatly offering a red flag to a bull, and moved towards them. It was not an attempt at bluffing: on Terce, even though I was immodestly unveiled, men would have at once moved out of the way to avoid any chance of the insult of physical contact. It was an act so automatic as to be invisible: precisely what we are taught to watch for in ourselves, but that proves infinitely easier in the instruction than in the practice. I did not think they would move; I knew they would.\nPerhaps that certainty transmitted itself: the men did move a little, enough to satisfy my unconscious that they were cooperating with my expectations, so that it took me wholly by surprise and horror when one reached out and put his hand on my arm to stop me.\nI screamed, in full voice, and struck him. His face is lost to my memory, but I still can see clearly the man behind him, his expression as full of appalled violation as my own. The four of them flinched from my scream, and then drew in around me, protesting and reaching out in turn.\nI reacted with more violence. I had confidently considered myself a citizen of no world and of many, trained out of assumptions and unaffected by the parochial attitudes of the one where chance had seen me born, but in that moment I could with actual pleasure have killed all of them. That wish was unlikely to be gratified. I was taller, and the gravity of Terce is slightly higher than of Melida, so I was stronger than they expected me to be, but they were laborers and seamen, built generously and rough-hewn, and the male advantage in muscle mass tells quickly in a hand-to-hand fight.\nThey tried to immobilize me, which only panicked me further. The mind curls in on itself in such a moment; I remember palpably only the sensation of sweating copiously, and the way this caused the seam of my blouse to rub unpleasantly against my neck as I struggled.\nBadea told me later that, at first, she had meant to let them hold me. She could then leave, with the added satisfaction of knowing the Esperigan fishermen and not she had provoked an incident with the Confederacy. It was not sympathy that moved her to action, precisely. The extremity of my distress was as alien to her as to them, but where they thought me mad, she read it in the context of my having accepted her original conditions and somewhat unwillingly decided that I truly did need to go with her, even if she did not know precisely why and saw no use in it herself.\nI cannot tell you precisely how the subsequent moments unfolded. I remember the green gauze of her wings overhead perforated by the sun, like a linen curtain, and the blood spattering my face as she neatly lopped off the hands upon me. She used for the purpose a blade I later saw in use for many tasks, among them harvesting fruit off plants where the leaves or the bark may be poisonous. It is shaped like a sickle and strung upon a thick elastic cord, which a skilled wielder can cause to become rigid or to collapse.\nI stood myself back on my feet panting, and she landed. The men were on their knees screaming, and others were running towards us down the docks. Badea swept the severed hands into the water with the side of her foot and said calmly, “We must go.”\nThe little boat had drawn up directly beside us over the course of our encounter, drawn by some signal I had not seen her transmit. I stepped into it behind her. The coracle leapt forward like a springing bird, and left the shouting and the blood behind.\nWe did not speak over the course of that strange journey. What I had thought a sail did not catch the wind, but opened itself wide and stretched out over our heads, like an awning, and angled itself towards the sun. There were many small filaments upon the surface wriggling when I examined it more closely, and also upon the exterior of the hull. Badea stretched herself out upon the floor of the craft, lying under the low deck, and I joined her in the small space: it was not uncomfortable nor rigid, but had the queer unsettled cushioning of a waterbed.\nThe ocean crossing took only the rest of the day. How our speed was generated I cannot tell you; we did not seem to sit deeply in the water and our craft threw up no spray. The world blurred as a window running with rain. I asked Badea for water, once, and she put her hands on the floor of the craft and pressed down: in the depression she made, a small clear pool gathered for me to cup out, with a taste like slices of cucumber with the skin still upon them.\nThis was how I came to Melida.\nThe Third Adjustment\nBadea was vaguely embarrassed to have inflicted me on her fellows, and having deposited me in the center of her village made a point of leaving me there by leaping aloft into the canopy where I could not follow, as a way of saying she was done with me, and anything I did henceforth could not be laid at her door.\nI was by now hungry and nearly sick with exhaustion. Those who have not flown between worlds like to imagine the journey a glamorous one, but at least for minor bureaucrats, it is no more pleasant than any form of transport, only elongated. I had spent a week a virtual prisoner in my berth, the bed folding up to give me room to walk four strides back and forth, or to unfold my writing desk, not both at once, with a shared toilet the size of an ungenerous closet down the hall. Landfall had not arrested my forward motion, as that mean port had never been my destination. Now, however, I was arrived, and the dregs of adrenaline were consumed in anticlimax.\nOthers before me have stood in a Melidan village center and described it for an audience—Esperigans mostly, anthropologists and students of biology and a class of tourists either adventurous or stupid. There is usually a lyrical description of the natives coasting overhead among some sort of vines or tree-branches knitted overhead for shelter, the particulars and adjectives determined by the village latitude, and the obligatory explanation of the typical plan of huts, organized as a spoked wheel around the central plaza.\nIf I had been less tired, perhaps I too would have looked with so analytical an air, and might now satisfy my readers with a similar report. But to me the village only presented all the confusion of a wholly strange place, and I saw nothing that seemed to me deliberate. To call it a village gives a false air of comforting provinciality. Melidans, at least those with wings, move freely among a wide constellation of small settlements, so that all of these, in the public sphere, partake of the hectic pace of the city. I stood alone, and strangers moved past me with assurance, the confidence of their stride saying, “I care nothing for you or your fate. It is of no concern to me. How might you expect it to be otherwise?” In the end, I lay down on one side of the plaza and went to sleep.\nI met Kitia the next morning. She woke me by prodding me with a twig, experimentally, having been selected for this task out of her group of schoolmates by some complicated interworking of personality and chance. They giggled from a few safe paces back as I opened my eyes and sat up.\n“Why are you sleeping in the square?” Kitia asked me, to a burst of fresh giggles.\n“Where should I sleep?” I asked her.\n“In a house!” she said.\nWhen I had explained to them, not without some art, that I had no house here, they offered the censorious suggestion that I should go back to wherever I did have a house. I made a good show of looking analytically up at the sky overhead and asking them what our latitude was, and then I pointed at a random location and said, “My house is five years that way.”\nScorn, puzzlement, and at last delight. I was from the stars! None of their friends had ever met anyone from so far away. One girl who previously had held a point of pride for having once visited the smaller continent, with an Esperigan toy doll to prove it, was instantly dethroned. Kitia possessively took my arm and informed me that as my house was too far away, she would take me to another.\nChildren of virtually any society are an excellent resource for the diplomatic servant or the anthropologist, if contact with them can be made without giving offense. They enjoy the unfamiliar experience of answering real questions, particularly the stupidly obvious ones that allow them to feel a sense of superiority over the inquiring adult, and they are easily impressed with the unusual. Kitia was a treasure. She led me, at the head of a small pied-piper procession, to an empty house on a convenient lane. It had been lately abandoned, and was already being reclaimed: the walls and floor were swarming with tiny insects with glossy dark blue carapaces, munching so industriously the sound of their jaws hummed like a summer afternoon.\nI with difficulty avoided recoiling. Kitia did not hesitate: she walked into the swarm, crushing beetles by the dozens underfoot, and went to a small spigot in the far wall. When she turned this on, a clear viscous liquid issued forth, and the beetles scattered from it. “Here, like this,” she said, showing me how to cup my hands under the liquid and spread it upon the walls and the floor. The disgruntled beetles withdrew, and the brownish surfaces began to bloom back to pale green, repairing the holes.\nOver the course of that next week, she also fed me, corrected my manners and my grammar, and eventually brought me a set of clothing, a tunic and leggings, which she proudly informed me she had made herself in class. I thanked her with real sincerity and asked where I might wash my old clothing. She looked very puzzled, and when she had looked more closely at my clothing and touched it, she said, “Your clothing is dead! I thought it was only ugly.”\nHer gift was not made of fabric but a thin tough mesh of plant filaments with the feathered surface of a moth’s wings. It gripped my skin eagerly as soon as I had put it on, and I thought myself at first allergic, because it itched and tingled, but this was only the bacteria bred to live in the mesh assiduously eating away the sweat and dirt and dead epidermal cells built up on my skin. It took me several more days to overcome all my instinct and learn to trust the living cloth with the more voluntary eliminations of my body also. (Previously I had been going out back to defecate in the woods, having been unable to find anything resembling a toilet, and meeting too much confusion when I tried to approach the question to dare pursue it further, for fear of encountering a taboo.)\nAnd this was the handiwork of a child, not thirteen years of age! She could not explain to me how she had done it in any way which made sense to me. Imagine if you had to explain how to perform a reference search to someone who had not only never seen a library, but did not understand electricity, and who perhaps knew there was such a thing as written text, but did not himself read more than the alphabet. She took me once to her classroom after hours and showed me her workstation, a large wooden tray full of grayish moss, with a double row of small jars along the back each holding liquids or powders which I could only distinguish by their differing colors. Her only tools were an assortment of syringes and eyedroppers and scoops and brushes.\nI went back to my house and in the growing report I would not have a chance to send for another month I wrote, These are a priceless people. We must have them.\nThe Fourth Adjustment\nAll these first weeks, I made no contact with any other adult. I saw them go by occasionally, and the houses around mine were occupied, but they never spoke to me or even looked at me directly. None of them objected to my squatting, but that was less implicit endorsement and more an unwillingness even to acknowledge my existence. I talked to Kitia and the other children, and tried to be patient. I hoped an opportunity would offer itself eventually for me to be of some visible use.\nIn the event, it was rather my lack of use which led to the break in the wall. A commotion arose in the early morning, while Kitia was showing me the plan of her wings, which she was at that age beginning to design. She would grow the parasite over the subsequent year, and was presently practicing with miniature versions, which rose from her worktable surface gossamer-thin and fluttering with an involuntary muscle-twitching. I was trying to conceal my revulsion.\nKitia looked up when the noise erupted. She casually tossed her example out of the window, to be pounced upon with a hasty scramble by several nearby birds, and went out the door. I followed her to the square: the children were gathered at the fringes, silent for once and watching. There were five women laid out on the ground, all bloody, one dead. Two of the others looked mortally wounded. They were all winged.\nThere were several working already on the injured, packing small brownish-white spongy masses into the open wounds and sewing them up. I would have liked to be of use, less from natural instinct than from the colder thought, which inflicted itself upon my mind, that any crisis opens social barriers. I am sorry to say I did not refrain from any noble self-censorship, but from the practical conviction that it was at once apparent my limited field-medical training could not in any valuable way be applied to the present circumstances.\nI drew away, rather, to avoid being in the way as I could not turn the situation to my advantage, and in doing so ran up against Badea, who stood at the very edge of the square, observing.\nShe stood alone; there were no other adults nearby, and there was blood on her hands. “Are you hurt also?” I asked her.\n“No,” she returned, shortly.\nI ventured on concern for her friends, and asked her if they had been hurt in fighting. “We have heard rumors,” I added, “that the Esperigans have been encroaching on your territory.” It was the first opportunity I had been given of hinting at even this much of our official sympathy, as the children only shrugged when I asked them if there were fighting going on.\nShe shrugged, too, with one shoulder, and the folded wing rose and fell with it. But then she said, “They leave their weapons in the forest for us, even where they cannot have gone.”\nThe Esperigans had several kinds of land-mine technologies, including a clever mobile one which could be programmed with a target either as specific as an individual’s genetic record or as general as a broadly defined body type—humanoid and winged, for instance—and set loose to wander until it found a match, then do the maximum damage it could. Only one side could carry explosive, as the other was devoted to the electronics. “The shrapnel, does it come only in one direction?” I asked, and made a fanned-out shape with my hands to illustrate. Badea looked at me sharply and nodded.\nI explained the mine to her, and described their manufacture. “Some scanning devices can detect them,” I added, meaning to continue into an offer, but I had not finished the litany of materials before she was striding away from the square, without another word.\nI was not dissatisfied with the reaction, in which I correctly read intention to put my information to immediate use, and two days later my patience was rewarded. Badea came to my house in the mid-morning and said, “We have found one of them. Can you show us how to disarm them?”\n“I am not sure,” I told her, honestly. “The safest option would be to trigger it deliberately, from afar.”\n“The plastics they use poison the ground.”\n“Can you take me to its location?” I asked. She considered the question with enough seriousness that I realized there was either taboo or danger involved.\n“Yes,” she said finally, and took me with her to a house near the center of the village. It had steps up to the roof, and from there we could climb to that of the neighboring house, and so on until we were high enough to reach a large basket, woven not of ropes but of a kind of vine, sitting in a crook of a tree. We climbed into this, and she kicked us off from the tree.\nThe movement was not smooth. The nearest I can describe is the sensation of being on a child’s swing, except at that highest point of weightlessness you do not go backwards, but instead go falling into another arc, but at tremendous speed, and with a pungent smell like rotten pineapple all around from the shattering of the leaves of the trees through which we were propelled. I was violently sick after some five minutes. To the comfort of my pride if not my stomach, Badea was also sick, though more efficiently and over the side, before our journey ended.\nThere were two other women waiting for us in the tree where we came to rest, both of them also winged: Renata and Paudi. “It’s gone another three hundred meters, towards Ighlan,” Renata told us—another nearby Melidan village, as they explained to me.\n“If it comes near enough to pick up traces of organized habitation, it will not trigger until it is inside the settlement, among as many people as possible,” I said. “It may also have a burrowing mode, if it is the more expensive kind.”\nThey took me down through the canopy, carefully, and walked before and behind me when we came to the ground. Their wings were spread wide enough to brush against the hanging vines to either side, and they regularly leapt aloft for a brief survey. Several times they moved me with friendly hands into a slightly different path, although my untrained eyes could make no difference among the choices.\nA narrow trail of large ants—the reader will forgive me for calling them ants, they were nearly indistinguishable from those efficient creatures—paced us over the forest floor, which I did not recognize as significant until we came near the mine, and I saw it covered with the ants, who did not impede its movement but milled around and over it with intense interest.\n“We have adjusted them so they smell the plastic,” Badea said, when I asked. “We can make them eat it,” she added, “but we worried it would set off the device.”\nThe word adjusted scratches at the back of my mind again as I write this, that unpleasant tinny sensation of a term that does not allow of real translation and which has been inadequately replaced. I cannot improve upon the work of the official Confederacy translators, however; to encompass the true concept would require three dry, dusty chapters more suited to a textbook on the subject of biological engineering, which I am ill-qualified to produce. I do hope that I have successfully captured the wholly casual way she spoke of this feat. Our own scientists might replicate this act of genetic sculpting in any of two dozen excellent laboratories across the Confederacy—given several years, and a suitably impressive grant. They had done it in less than two days, as a matter of course.\nI did not at the time indulge in admiration. The mine was ignoring the inquisitive ants and scuttling along at a good pace, the head with its glassy eye occasionally rotating upon its spindly spider-legs, and we had half a day in which to divert it from the village ahead.\nRenata followed the mine as it continued on, while I sketched what I knew of the internals in the dirt for Badea and Paudi. Any sensible mine-maker will design the device to simply explode at any interference with its working other than the disable code, so our options were not particularly satisfying. “The most likely choice,” I suggested, “would be the transmitter. If it becomes unable to receive the disable code, there may be a failsafe which would deactivate it on a subsequent malfunction.”\nPaudi had on her back a case which, unfolded, looked very like a more elegant and compact version of little Kitia’s worktable. She sat crosslegged with it on her lap and worked on it for some two hours’ time, occasionally reaching down to pick up a handful of ants, which dropped into the green matrix of her table mostly curled up and died, save for a few survivors, which she herded carefully into an empty jar before taking up another sample.\nI sat on the forest floor beside her, or walked with Badea, who was pacing a small circle out around us, watchfully. Occasionally she would unsling her scythe-blade, and then put it away again, and once she brought down a mottie, a small lemur-like creature. I say lemur because there is nothing closer in my experience, but it had none of the charm of an Earth-native mammal; I rather felt an instinctive disgust looking at it, even before she showed me the tiny sucker-mouths full of hooked teeth with which it latched upon a victim.\nShe had grown a little more loquacious, and asked me about my own homeworld. I told her about Terce, and about the seclusion of women, which she found extremely funny, as we can only laugh at the follies of those far from us which threaten us not at all. The Melidans by design maintain a five-to-one ratio of women to men, as adequate to maintain a healthy gene pool while minimizing the overall resource consumption of their population. “They cannot take the wings, so it is more difficult for them to travel,” she added, with one sentence dismissing the lingering mystery which had perplexed earlier visitors, of the relative rarity of seeing their men.\nShe had two children, which she described to me proudly, living presently with their father and half-siblings in a village half a day’s travel away, and she was considering a third. She had trained as a forest ranger, another inadequately translated term which was at the time beginning to take on a military significance among them under the pressure of the Esperigan incursions.\n“I’m done,” Paudi said, and we went to catch up Renata and find a nearby ant-nest, which looked like a mound of white cotton batting, rising several inches off the forest floor. Paudi introduced her small group of infected survivors into this colony, and after a little confusion and milling about, they accepted their transplantation and marched inside. The flow of departures slowed a little momentarily, then resumed, and a file split off from the main channel of workers to march in the direction of the mine.\nThese joined the lingering crowd still upon the mine, but the new arrivals did not stop at inspection and promptly began to struggle to insinuate themselves into the casing. We withdrew to a safe distance, watching. The mine continued on without any slackening in its pace for ten minutes, as more ants began to squeeze themselves inside, and then it hesitated, one spindly metal leg held aloft uncertainly. It went a few more slightly drunken paces, and then abruptly the legs all retracted and left it a smooth round lump on the forest floor.\nThe Fifth Adjustment\nThey showed me how to use their communications technology and grew me an interface to my own small handheld, so my report was at last able to go. Kostas began angry, of course, having been forced to defend the manner of my departure to the Esperigans without the benefit of any understanding of the circumstances, but I sent the report an hour before I messaged, and by the time we spoke he had read enough to be in reluctant agreement with my conclusions if not my methods.\nI was of course full of self-satisfaction. Freed at long last from the academy and the walled gardens of Terce, armed with false confidence in my research and my training, I had so far achieved all that my design had stretched to encompass. The Esperigan blood had washed easily from my hands, and though I answered Kostas meekly when he upbraided me, privately I felt only impatience, and even he did not linger long on the topic: I had been too successful, and he had more important news.\nThe Esperigans had launched a small army two days before, under the more pleasant-sounding name of expeditionary defensive force. Their purpose was to establish a permanent settlement on the Melidan shore, some nine hundred miles from my present location, and begin the standard process of terraforming. The native life would be eradicated in spheres of a hundred miles across at a time: first the broad strokes of clear-cutting and the electrified nets, then the irradiation of the soil and the air, and after that the seeding of Earth-native microbes and plants. So had a thousand worlds been made over anew, and though the Esperigans had fully conquered their own continent five centuries before, they still knew the way.\nHe asked doubtfully if I thought some immediate resistance could be offered. Disabling a few mines scattered into the jungle seemed to him a small task. Confronting a large and organized military force was on a different order of magnitude. “I think we can do something,” I said, maintaining a veneer of caution for his benefit, and took the catalog of equipment to Badea as soon as we had disengaged.\nShe was occupied in organizing the retrieval of the deactivated mines, which the ants were now leaving scattered in the forests and jungles. A bird-of-paradise variant had been adjusted to make a meal out of the ants and take the glittery mines back to their tree-top nests, where an observer might easily see them from above. She and the other collectors had so far found nearly a thousand of them. The mines made a neat pyramid, as of the harvested skulls of small cyclopean creatures with their dull eyes staring out lifelessly.\nThe Esperigans needed a week to cross the ocean in their numbers, and I spent it with the Melidans, developing our response. There was a heady delight in this collaboration. The work was easy and pleasant in their wide-open laboratories full of plants, roofed only with the fluttering sailcloth eating sunlight to give us energy, and the best of them coming from many miles distant to participate in the effort. The Confederacy spy-satellites had gone into orbit perhaps a year after our first contact: I likely knew more about the actual force than the senior administrators of Melida. I was in much demand, consulted not only for my information but my opinion.\nIn the ferment of our labors, I withheld nothing. This was not yet deliberate, but neither was it innocent. I had been sent to further a war, and if in the political calculus which had arrived at this solution the lives of soldiers were only variables, yet there was still a balance I was expected to preserve. It was not my duty to give the Melidans an easy victory, any more than it had been Kostas’s to give one to the Esperigans.\nA short and victorious war, opening a new and tantalizing frontier for restless spirits, would at once drive up that inconvenient nationalism which is the Confederacy’s worst obstacle, and render less compelling the temptations we could offer to lure them into fully joining galactic society. On the other hand, to descend into squalor, a more equal kind of civil war has often proven extremely useful, and the more lingering and bitter the better. I was sent to the Melidans in hope that, given some guidance and what material assistance we could quietly provide without taking any official position, they might be an adequate opponent for the Esperigans to produce this situation.\nThere has been some criticism of the officials who selected me for this mission, but in their defense, it must be pointed out it was not in fact my assignment to actually provide military assistance, nor could anyone, even myself, have envisioned my proving remotely useful in such a role. I was only meant to be an early scout. My duty was to acquire cultural information enough to open a door for a party of military experts from Voca Libre, who would not reach Melida for another two years. Ambition and opportunity promoted me, and no official hand.\nI think these experts arrived sometime during the third Esperigan offensive. I cannot pinpoint the date with any accuracy, I had by then ceased to track the days, and I never met them. I hope they can forgive my theft of their war; I paid for my greed.\nThe Esperigans used a typical carbonized steel in most of their equipment, as bolts and hexagonal nuts and screws with star-shaped heads, and woven into the tough mesh of their body armor. This was the target of our efforts. It was a new field of endeavor for the Melidans, who used metal as they used meat, sparingly and with a sense of righteousness in its avoidance. To them it was either a trace element needed in minute amounts, or an undesirable by-product of the more complicated biological processes they occasionally needed to invoke.\nHowever, they had developed some strains of bacteria to deal with this latter waste, and the speed with which they could manipulate these organisms was extraordinary. Another quantity of the ants—a convenient delivery mechanism used by the Melidans routinely, as I learned—were adjusted to render them deficient in iron and to provide a home in their bellies for the bacteria, transforming them into shockingly efficient engines of destruction. Set loose upon several of the mines as a trial, they devoured the carapaces and left behind only smudgy black heaps of carbon dust, carefully harvested for fertilizer, and the plastic explosives from within, nestled in their bed of copper wire and silicon.\nThe Esperigans landed, and at once carved themselves out a neat half-moon of wasteland from the virgin shore, leaving no branches which might stretch above their encampment to offer a platform for attack. They established an electrified fence around the perimeter, with guns and patrols, and all this I observed with Badea, from a small platform in a vine-choked tree not far away: we wore the green-gray cloaks, and our faces were stained with leaf juice.\nI had very little justification for inserting myself into such a role but the flimsy excuse of pointing out to Badea the most crucial section of their camp, when we had broken in. I cannot entirely say why I wished to go along on so dangerous an expedition. I am not particularly courageous. Several of my more unkind biographers have accused me of bloodlust, and pointed to this as a sequel to the disaster of my first departure. I cannot refute the accusation on the evidence, however I will point out that I chose that portion of the expedition which we hoped would encounter no violence.\nBut it is true I had learned already to seethe at the violent piggish blindness of the Esperigans, who would have wrecked all the wonders around me only to propagate yet another bland copy of Earth and suck dry the carcass of their own world. They were my enemy both by duty and by inclination, and I permitted myself the convenience of hating them. At the time, it made matters easier.\nThe wind was running from the east, and several of the Melidans attacked the camp from that side. The mines had yielded a quantity of explosive large enough to pierce the Esperigans’ fence and shake the trees even as far as our lofty perch. The wind carried the smoke and dust and flames towards us, obscuring the ground and rendering the soldiers in their own camp only vague ghostlike suggestions of human shape. The fighting was hand-to-hand, and the stutter of gunfire came only tentatively through the chaos of the smoke.\nBadea had been holding a narrow cord, one end weighted with a heavy seed-pod. She now poured a measure of water onto the pod, from her canteen, then flung it out into the air. It sailed over the fence and landed inside the encampment, behind one of the neat rows of storage tents. The seed pod struck the ground and immediately burst like a ripe fruit, an anemone tangle of waving roots creeping out over the ground and anchoring the cord, which she had secured at this end around one thick branch.\nWe let ourselves down it, hand over hand. There was none of that typical abrasion or friction which I might have expected from rope; my hands felt as cool and comfortable when we descended as when we began. We ran into the narrow space between the tents. I was experiencing that strange elongation of time which crisis can occasionally produce: I was conscious of each footfall, and of the seeming-long moments it took to place each one.\nThere were wary soldiers at many of the tent entrances, likely those which held either the more valuable munitions or the more valuable men. Their discipline had not faltered, even while the majority of the force was already orchestrating a response to the Melidan assault on the other side of the encampment. But we did not need to penetrate into the tents. The guards were rather useful markers for us, showing me which of the tents were the more significant. I pointed out to Badea the cluster of four tents, each guarded at either side by a pair, near the farthest end of the encampment.\nBadea looked here and there over the ground as we darted under cover of smoke from one alleyway to another, the walls of waxed canvas muffling the distant shouts and the sound of gunfire. The dirt still had the yellowish tinge of Melidan soil—the Esperigans had not yet irradiated it—but it was crumbly and dry, the fine fragile native moss crushed and much torn by heavy boots and equipment, and the wind raised little dervishes of dust around our ankles.\n“This ground will take years to recover fully,” she said to me, soft and bitterly, as she stopped us and knelt, behind a deserted tent not far from our target. She gave me a small ceramic implement which looked much like the hair-picks sometimes worn on Terce by women with hair which never knew a blade’s edge: a raised comb with three teeth, though on the tool these were much longer and sharpened at the end. I picked the ground vigorously, stabbing deep to aerate the wounded soil, while she judiciously poured out a mixture of water and certain organic extracts, and sowed a packet of seeds.\nThis may sound a complicated operation to be carrying out in an enemy camp, in the midst of battle, but we had practiced the maneuver, and indeed had we been glimpsed, anyone would have been hard-pressed to recognize a threat in the two gray-wrapped lumps crouched low as we pawed at the dirt. Twice while we worked, wounded soldiers were carried in a rush past either end of our alleyway, towards shelter. We were not seen.\nThe seeds she carried, though tiny, burst readily, and began to thrust out spiderweb-fine rootlets at such a speed they looked like nothing more than squirming maggots. Badea without concern moved her hands around them, encouraging them into the ground. When they were established, she motioned me to stop my work, and she took out the prepared ants: a much greater number of them, with a dozen of the fat yellow wasp-sized brood-mothers. Tipped out into the prepared and welcoming soil, they immediately began to burrow their way down, with the anxious harrying of their subjects and spawn.\nBadea watched for a long while, crouched over, even after the ants had vanished nearly all beneath the surface. The few who emerged and darted back inside, the faint trembling of the rootlets, the shifting grains of dirt, all carried information to her. At length satisfied, she straightened saying, “Now—”\nThe young soldier was I think only looking for somewhere to piss, rather than investigating some noise. He came around the corner already fumbling at his belt, and seeing us did not immediately shout, likely from plain surprise, but grabbed for Badea’s shoulder first. He was clean-shaven, and the name on his lapel badge was Ridang. I drove the soil-pick into his eye. I was taller, so the stroke went downwards, and he fell backwards to his knees away from me, clutching at his face.\nHe did not die at once. There must be very few deaths which come immediately, though we often like to comfort ourselves by the pretense that this failure of the body, or that injury, must at once eradicate consciousness and life and pain all together. Here sentience lasted several moments which seemed to me long: his other eye was open, and looked at me while his hands clawed for the handle of the pick. When this had faded, and he had fallen supine to the ground, there was yet a convulsive movement of all the limbs and a trickling of blood from mouth and nose and eye before the final stiffening jerk left the body emptied and inanimate.\nI watched him die in a strange parody of serenity, all feeling hollowed out of me, and then turning away vomited upon the ground. Behind me, Badea cut open his belly and his thighs and turned him face down onto the dirt, so the blood and the effluvia leaked out of him. “That will do a little good for the ground at least, before they carry him away to waste him,” she said. “Come.” She touched my shoulder, not unkindly, but I flinched from the touch as from a blow.\nIt was not that Badea or her fellows were indifferent to death, or casual towards murder. But there is a price to be paid for living in a world whose native hostilities have been cherished rather than crushed. Melidan life expectancy is some ten years beneath that of Confederacy citizens, though they are on average healthier and more fit both genetically and physically. In their philosophy a human life is not inherently superior and to be valued over any other kind. Accident and predation claim many, and living intimately with the daily cruelties of nature dulls the facility for sentiment. Badea enjoyed none of that comforting distance which allows us to think ourselves assured of the full potential span of life, and therefore suffered none of the pangs when confronted with evidence to the contrary. I looked at my victim and saw my own face; so too did she, but she had lived all her life so aware, and it did not bow her shoulders.\nFive days passed before the Esperigan equipment began to come apart. Another day halted all their work, and in confusion they retreated to their encampment. I did not go with the Melidan company that destroyed them to the last man.\nContrary to many accusations, I did not lie to Kostas in my report and pretend surprise. I freely confessed to him I had expected the result, and truthfully explained I had not wished to make claims of which I was unsure. I never deliberately sought to deceive any of my superiors or conceal information from them, save in such small ways. At first I was not Melidan enough to wish to do so, and later I was too Melidan to feel anything but revulsion at the concept.\nHe and I discussed our next steps in the tiger-dance. I described as best I could the Melidan technology, and after consultation with various Confederacy experts, it was agreed he would quietly mention to the Esperigan minister of defense, at their weekly luncheon, a particular Confederacy technology: ceramic coatings, which could be ordered at vast expense and two years’ delay from Bel Rios. Or, he would suggest, if the Esperigans wished to deed some land to the Confederacy, a private entrepreneurial concern might fund the construction of a local fabrication plant, and produce them at much less cost, in six months’ time.\nThe Esperigans took the bait, and saw only private greed behind this apparent breach of neutrality: imagining Kostas an investor in this private concern, they winked at his veniality, and eagerly helped us to their own exploitation. Meanwhile, they continued occasional and tentative incursions into the Melidan continent, probing the coastline, but the disruption they created betrayed their attempts, and whichever settlement was nearest would at once deliver them a present of the industrious ants, so these met with no greater success than the first.\nThrough these months of brief and grudging detente, I traveled extensively throughout the continent. My journals are widely available, being the domain of our government, but they are shamefully sparse, and I apologize to my colleagues for it. I would have been more diligent in my work if I had imagined I would be the last and not the first such chronicler. At the time, giddy with success, I went with more the spirit of a holidaymaker than a researcher, and I sent only those images and notes which it was pleasant to me to record, with the excuse of limited capacity to send my reports.\nFor what cold comfort it may be, I must tell you photography and description are inadequate to convey the experience of standing in the living heart of a world, alien yet not hostile, and when I walked hand in hand with Badea along the crest of a great canyon wall and looked down over the ridges of purple and grey and ochre at the gently waving tendrils of an elacca forest, which in my notorious video recordings can provoke nausea in nearly every observer, I felt the first real stir of an unfamiliar sensation of beauty-in-strangeness, and I laughed in delight and surprise, while she looked at me and smiled.\nWe returned to her village three days later and saw the bombing as we came, the new Esperigan long-range fighter planes like narrow silver knife-blades making low passes overhead, the smoke rising black and oily against the sky. Our basket-journey could not be accelerated, so we could only cling to the sides and wait as we were carried onward. The planes and the smoke were gone before we arrived; the wreckage was not.\nI was angry at Kostas afterwards, unfairly. He was no more truly the Esperigans’ confidant than they were his, but I felt at the time that it was his business to know what they were about, and he had failed to warn me. I accused him of deliberate concealment; he told me, censoriously, that I had known the risk when I had gone to the continent, and he could hardly be responsible for preserving my safety while I slept in the very war zone. This silenced my tirade, as I realized how near I had come to betraying myself. Of course he would not have wanted me to warn the Melidans; it had not yet occurred to him I would have wished to, myself. I ought not have wanted to.\nForty-three people were killed in the attack. Kitia was yet lingering when I came to her small bedside. She was in no pain, her eyes cloudy and distant, already withdrawing; her family had been and gone again. “I knew you were coming back, so I asked them to let me stay a little longer,” she told me. “I wanted to say goodbye.” She paused and added uncertainly, “And I was afraid, a little. Don’t tell.”\nI promised her I would not. She sighed and said, “I shouldn’t wait any longer. Will you call them over?”\nThe attendant came when I raised my hand, and he asked Kitia, “Are you ready?”\n“Yes,” she said, a little doubtful. “It won’t hurt?”\n“No, not at all,” he said, already taking out with a gloved hand a small flat strip from a pouch, filmy green and smelling of raspberries. Kitia opened her mouth, and he laid it on her tongue. It dissolved almost at once, and she blinked twice and was asleep. Her hand went cold a few minutes later, still lying between my own.\nI stood with her family when we laid her to rest, the next morning. The attendants put her carefully down in a clearing, and sprayed her from a distance, the smell of cut roses just going to rot, and stepped back. Her parents wept noisily; I stayed dry-eyed as any seemly Terce matron, displaying my assurance of the ascension of the dead. The birds came first, and the motties, to pluck at her eyes and her lips, and the beetles hurrying with a hum of eager jaws to deconstruct her into raw parts. They did not have long to feast: the forest itself was devouring her from below in a green tide rising, climbing in small creepers up her cheeks and displacing them all.\nWhen she was covered over, the mourners turned away and went to join the shared wake behind us in the village square. They threw uncertain and puzzled looks at my remaining as they went past, and at my tearless face. But she was not yet gone: there was a suggestion of a girl lingering there, a collapsing scaffold draped in an unhurried carpet of living things. I did not leave, though behind me there rose a murmur of noise as the families of the dead spoke reminiscences of their lost ones.\nNear dawn, the green carpeting slipped briefly. In the dim watery light I glimpsed for one moment an emptied socket full of beetles, and I wept.\nThe Sixth Adjustment\nI will not claim, after this, that I took the wings only from duty, but I refute the accusation I took them in treason. There was no other choice. Men and children and the elderly or the sick, all the wingless, were fleeing from the continuing hail of Esperigan attacks. They were retreating deep into the heart of the continent, beyond the refueling range for the Esperigan warcraft, to shelters hidden so far in caves and in overgrowth that even my spy satellites knew nothing of them. My connection to Kostas would have been severed, and if I could provide neither intelligence nor direct assistance, I might as well have slunk back to the embassy, and saved myself the discomfort of being a refugee. Neither alternative was palatable.\nThey laid me upon the altar like a sacrifice, or so I felt, though they gave me something to drink which calmed my body, the nervous and involuntary twitching of my limbs and skin. Badea sat at my head and held the heavy long braid of my hair out of the way, while the others depilated my back and wiped it with alcohol. They bound me down then, and slit my skin open in two lines mostly parallel to the spine. Then Paudi gently set the wings upon me.\nI lacked the skill to grow my own, in the time we had; Badea and Paudi helped me to mine so that I might stay. But even with the little assistance I had been able to contribute, I had seen more than I wished to of the parasites, and despite my closed eyes, my face turned downwards, I knew to my horror that the faint curious feather-brush sensation was the intrusion of the fine spiderweb filaments, each fifteen feet long, which now wriggled into the hospitable environment of my exposed inner flesh and began to sew themselves into me.\nPain came and went as the filaments worked their way through muscle and bone, finding one bundle of nerves and then another. After the first half hour, Badea told me gently, “It’s coming to the spine,” and gave me another drink. The drug kept my body from movement, but could do nothing to numb the agony. I cannot describe it adequately. If you have ever managed to inflict food poisoning upon yourself, despite all the Confederacy’s safeguards, you may conceive of the kind if not the degree of suffering, an experience which envelops the whole body, every muscle and joint, and alters not only your physical self but your thoughts: all vanishes but pain, and the question, is the worst over? which is answered no and no again.\nBut at some point the pain began indeed to ebb. The filaments had entered the brain, and it is a measure of the experience that what I had feared the most was now blessed relief; I lay inert and closed my eyes gratefully while sensation spread outward from my back, and my new-borrowed limbs became gradually indeed my own, flinching from the currents of the air, and the touch of my friends’ hands upon me. Eventually I slept.\nThe Seventh Adjustment\nThe details of the war, which unfolded now in earnest, I do not need to recount again. Kostas kept excellent records, better by far than my own, and students enough have memorized the dates and geographic coordinates, bounding death and ruin in small numbers. Instead I will tell you that from aloft, the Esperigans’ poisoned-ground encampments made half-starbursts of ochre brown and withered yellow, outlines like tentacles crawling into the healthy growth around them. Their supply-ships anchored out to sea glazed the water with a slick of oil and refuse, while the soldiers practiced their shooting on the vast schools of slow-swimming kraken young, whose bloated white bodies floated to the surface and drifted away along the coast, so many they defied even the appetite of the sharks.\nI will tell you that when we painted their hulls with algaes and small crustacean-like borers, our work was camouflaged by great blooms of sea day-lilies around the ships, their masses throwing up reflected red color on the steel to hide the quietly creeping rust until the first winter storms struck and the grown kraken came to the surface to feed. I will tell you we watched from shore while the ships broke and foundered, and the teeth of the kraken shone like fire opals in the explosions, and if we wept, we wept only for the soiled ocean.\nStill more ships came, and more planes; the ceramic coatings arrived, and more soldiers with protected guns and bombs and sprayed poisons, to fend off the altered motties and the little hybrid sparrowlike birds, their sharp cognizant eyes chemically retrained to see the Esperigan uniform colors as enemy markings. We planted acids and more aggressive species of plants along their supply lines, so their communications remained hopeful rather than reliable, and ambushed them at night; they carved into the forest with axes and power-saws and vast strip-miners, which ground to a halt and fell to pieces, choking on vines which hardened to the tensile strength of steel as they matured.\nContrary to claims which were raised at my trial in absentia and disproven with communication logs, throughout this time I spoke to Kostas regularly. I confused him, I think; I gave him all the intelligence which he needed to convey to the Esperigans, that they might respond to the next Melidan foray, but I did not conceal my feelings or the increasing complication of my loyalties, objecting to him bitterly and with personal anger about Esperigan attacks. I misled him with honesty: he thought, I believe, that I was only spilling a natural frustration to him, and through that airing clearing out my own doubts. But I had only lost the art of lying.\nThere is a general increase of perception which comes with the wings, the nerves teased to a higher pitch of awareness. All the little fidgets and twitches of lying betray themselves more readily, so only the more twisted forms can evade detection—where the speaker first deceives herself, or the wholly casual deceit of the sociopath who feels no remorse. This was the root of the Melidan disgust of the act, and I had acquired it.\nIf Kostas had known, he would at once have removed me: a diplomat is not much use if she cannot lie at need, much less an agent. But I did not volunteer the information, and indeed I did not realize, at first, how fully I had absorbed the stricture. I did not realize at all, until Badea came to me, three years into the war. I was sitting alone and in the dark by the communications console, the phosphorescent after-image of Kostas’s face fading into the surface.\nShe sat down beside me and said, “The Esperigans answer us too quickly. Their technology advances in these great leaps, and every time we press them back, they return in less than a month to very nearly the same position.”\nI thought, at first, that this was the moment: that she meant to ask me about membership in the Confederacy. I felt no sense of satisfaction, only a weary kind of resignation. The war would end, the Esperigans would follow, and in a few generations they would both be eaten up by bureaucracy and standards and immigration.\nInstead Badea looked at me and said, “Are your people helping them, also?”\nMy denial ought to have come without thought, leapt easily off the tongue with all the conviction duty could give it, and been followed by invitation. Instead I said nothing, my throat closed involuntarily. We sat silently in the darkness, and at last she said, “Will you tell me why?”\nI felt at the time I could do no more harm, and perhaps some good, by honesty. I told her all the rationale, and expressed all our willingness to receive them into our union as equals. I went so far as to offer her the platitudes with which we convince ourselves we are justified in our slow gentle imperialism: that unification is necessary and advances all together, bringing peace.\nShe only shook her head and looked away from me. After a moment, she said, “Your people will never stop. Whatever we devise, they will help the Esperigans to a counter, and if the Esperigans devise some weapon we cannot defend ourselves against, they will help us, and we will batter each other into limp exhaustion, until in the end we all fall.”\n“Yes,” I said, because it was true. I am not sure I was still able to lie, but in any case I did not know, and I did not lie.\nI was not permitted to communicate with Kostas again until they were ready. Thirty-six of the Melidans’ greatest designers and scientists died in the effort. I learned of their deaths in bits and pieces. They worked in isolated and quarantined spaces, their every action recorded even as the viruses and bacteria they were developing killed them. It was a little more than three months before Badea came to me again.\nWe had not spoken since the night she had learned the duplicity of the Confederacy’s support and my own. I could not ask her forgiveness, and she could not give it. She did not come for reconciliation but to send a message to the Esperigans and to the Confederacy through me.\nI did not comprehend at first. But when I did, I knew enough to be sure she was neither lying nor mistaken, and to be sure the threat was very real. The same was not true of Kostas, and still less of the Esperigans. My frantic attempts to persuade them worked instead to the contrary end. The long gap since my last communique made Kostas suspicious: he thought me a convert, or generously a manipulated tool.\n“If they had the capability, they would have used it already,” he said, and if I could not convince him, the Esperigans would never believe.\nI asked Badea to make a demonstration. There was a large island broken off the southern coast of the Esperigan continent, thoroughly settled and industrialized, with two substantial port cities. Sixty miles separated it from the mainland. I proposed the Melidans should begin there, where the attack might be contained.\n“No,” Badea said. “So your scientists can develop a counter? No. We are done with exchanges.”\nThe rest you know. A thousand coracles left Melidan shores the next morning, and by sundown on the third following day, the Esperigan cities were crumbling. Refugees fled the groaning skyscrapers as they slowly bowed under their own weight. The trees died; the crops also, and the cattle, all the life and vegetation that had been imported from Earth and square-peg forced into the new world stripped bare for their convenience.\nMeanwhile in the crowded shelters the viruses leapt easily from one victim to another, rewriting their genetic lines. Where the changes took hold, the altered survived. The others fell to the same deadly plagues that consumed all Earth-native life. The native Melidan moss crept in a swift green carpet over the corpses, and the beetle-hordes with it.\nI can give you no first-hand account of those days. I too lay fevered and sick while the alteration ran its course in me, though I was tended better, and with more care, by my sisters. When I was strong enough to rise, the waves of death were over. My wings curled limply over my shoulders as I walked through the empty streets of Landfall, pavement stones pierced and broken by hungry vines, like bones cracked open for marrow. The moss covered the dead, who filled the shattered streets.\nThe squat embassy building had mostly crumpled down on one corner, smashed windows gaping hollow and black. A large pavilion of simple cotton fabric had been raised in the courtyard, to serve as both hospital and headquarters. A young undersecretary of state was the senior diplomat remaining. Kostas had died early, he told me. Others were still in the process of dying, their bodies waging an internal war that left them twisted by hideous deformities.\nLess than one in thirty, was his estimate of the survivors. Imagine yourself on an air-train in a crush, and then imagine yourself suddenly alone but for one other passenger across the room, a stranger staring at you. Badea called it a sustainable population.\nThe Melidans cleared the spaceport of vegetation, though little now was left but the black-scorched landing pad, Confederacy manufacture, all of woven carbon and titanium.\n“Those who wish may leave,” Badea said. “We will help the rest.”\nMost of the survivors chose to remain. They looked at their faces in the mirror, flecked with green, and feared the Melidans less than their welcome on another world.\nI left by the first small ship that dared come down to take off refugees, with no attention to the destination or the duration of the voyage. I wished only to be away. The wings were easily removed. A quick and painful amputation of the gossamer and fretwork which protruded from the flesh, and the rest might be left for the body to absorb slowly. The strange muffled quality of the world, the sensation of numbness, passed eventually. The two scars upon my back, parallel lines, I will keep the rest of my days.\nAfterword\nI spoke with Badea once more before I left. She came to ask me why I was going, to what end I thought I went. She would be perplexed, I think, to see me in my little cottage here on Reivaldt, some hundred miles from the nearest city, although she would have liked the small flowerlike lieden which live on the rocks of my garden wall, one of the few remnants of the lost native fauna which have survived the terraforming outside the preserves of the university system.\nI left because I could not remain. Every step I took on Melida, I felt dead bones cracking beneath my feet. The Melidans did not kill lightly, an individual or an ecosystem, nor any more effectually than do we. If the Melidans had not let the plague loose upon the Esperigans, we would have destroyed them soon enough ourselves, and the Melidans with them. But we distance ourselves better from our murders, and so are not prepared to confront them. My wings whispered to me gently when I passed Melidans in the green-swathed cemetary streets, that they were not sickened, were not miserable. There was sorrow and regret but no self-loathing, where I had nothing else. I was alone.\nWhen I came off my small vessel here, I came fully expecting punishment, even longing for it, a judgment which would at least be an end. Blame had wandered through the halls of state like an unwanted child, but when I proved willing to adopt whatever share anyone cared to mete out to me, to confess any crime which was convenient and to proffer no defense, it turned contrary, and fled.\nTime enough has passed that I can be grateful now to the politicians who spared my life and gave me what passes for my freedom. In the moment, I could scarcely feel enough even to be happy that my report contributed some little to the abandonment of any reprisal against Melida: as though we ought hold them responsible for defying our expectations not of their willingness to kill one another, but only of the extent of their ability.\nBut time does not heal all wounds. I am often asked by visitors whether I would ever return to Melida. I will not. I am done with politics and the great concerns of the universe of human settlement. I am content to sit in my small garden, and watch the ants at work.\nRuth Patrona\nOriginally published in Warriors 2, edited by Gardner Dozois and George R. R. Martin, 2010.\nBorn in New York City, where she still lives with her mystery-editor husband and six computers, Naomi Novik is a first-generation American who was raised on Polish fairy tales, Baba Yaga, and Tolkien. After doing graduate work in Computer Science at Columbia University, she participated in the development of the computer game Neverwinter Nights: Shadows of Undrentide, and then decided to try her hand at novels. A good decision! The resultant Temeraire series—consisting of Temeraire, His Majesty's Dragon, Black Powder War, The Throne of Jade, Tongue of Serpents, Victory of Eagles, Empire of Ivory, Crucible of Gold, and Blood of Tyrants—describing an alternate version of the Napoleonic Wars where dragons are used as living weapons, has been phenomenally popular and successful. Coming up is a new non-Temeraire fantasy novel, Uprooted.", "source": "https://clarkesworldmagazine.com/novik_08_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Seven Years from Home by Naomi Novik"}