{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Andrea M Pawley", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "DiyR+g4n/pqkpUTWwaPj2wY0U7M=", "id": null, "license": null, "comments": "", "raw_text": "3820 words, short story  A Heist in Fifteen Products from the Orion Spur's Longest-Running Catalog  The Aficionado’s Personal-Use Fabricator  This is the customized fabricator that uses Safe-Nuke technology to deconstruct molecules before rebuilding them according to plans available through the Tollnacher Stimmacher catalog.  With The Aficionado’s Personal-Use Fabricator and uncontrolled access to all the plans in the catalog, I can make everything I require to free Mom from prison. Tollnacher Stimmacher needs her back. Mom ran the company before the Orion Spur authorities convicted her of collaborating in the Seventh Robot Revolution. Since I took over three years ago, Tollnacher Stimmacher has been losing market share to a Perseus Arm upstart that doesn’t even distribute a catalog.  Mom always insisted everyone is family at Tollnacher Stimmacher, but I’m the only one she ever adopted. Twenty-five years ago, I was an orphan on the Earth colony, Lulularia. Mom raised me as her own despite my being human and her being a robot. Ever since I was a kid, Mom kept a Fabricator in her invention studio beside the Tollnacher Stimmacher factory. Her servo motors could be heard whirring over her workbench whenever she wasn’t helping on the factory floor or checking on me.  I sometimes still wear the first product Mom let me test—The Emotion-Sensing Firefly Halo Hologram—especially when I’m missing Mom. As a small child, I was captivated by the projections of insects whose colors changed depending on my mood. Only later did I understand how the Firefly Halo Holo helped Mom recognize my emotions. No matter the lack of expression on Mom’s face when she watched the firefly simulations, her cranium emulator swiveling in her neck extender, I never doubted Mom’s love.  Last quarter was the worst since I took over the company for Mom. I don’t want to be responsible for Tollnacher Stimmacher folding after 473 years of bringing unique products to the market.  The Lifelike Pleasant Clone  This is the non-sentient clone that provides a wide variety of preprogrammed support and engagement to family, friends, coworkers, and others on behalf of harried individuals who might need a little time off.  The employees don’t seem to realize I started using a Pleasant Clone yesterday, even though my facsimile has already settled three byzantine disputes between Sales and Accounting with far more ease than I could have. I never wanted to be in charge of Tollnacher Stimmacher. I miss making deliveries and meeting customers. Completing an on-site setup of a Crystal-Encrusted Spine Support for a ten-pronged Mulnaanaan family is my favorite kind of work. With nanolayers that unfurl into an object larger than a DL-class asteroid, a Spine Support must be built in the factory then delivered and expanded with care. Complicated deliveries and setups are my specialty.  My Pleasant Clone’s chat logs indicate that two of the longest-serving factory employees, one human and one robot, came by this morning again to urge me to spread around the burden of running the company. I appreciate that the best employees in the galaxy care about me, but Mom is what we need. My plan to get her back shouldn’t take more than a couple of days.  Under a fake employee name, I assign myself a sham Crystal-Encrusted Spine Support delivery and installation. The Orion Spur authorities aren’t as interested in my movements now as they were shortly after Mom’s arrest, but obscuring my actions seems best. The green glow of The Emotion-Sensing Firefly Halo Holo on my head serves as further proof that I harbor no doubts about what I’m going to do.  The Pulsar Wind-Powered Detection Defeater Spaceship  This easy-to-pilot spacecraft, once the workhorse of the Las Vegas Gaming Consortium, has a smooth cloaking shell and a plush interior designed for maximum comfort regardless of transportation circumstances.  It’s always bothered me that Mom’s work with the Las Vegas Gaming Consortium robots was what got her convicted of colluding with their revolution. She was just responding to a customer request for purpose-built laser jammers. The Consortium’s robots had discovered that their bosses were cheating millions of low-stakes players. Instead of being recognized as heroes for stopping the fraud with the jammers, the robots were prosecuted.  During her trial, Mom insisted she didn’t realize what the jammers were being used for. I think she would have helped the Consortium robots even if she had known though. The story was big enough that the previous Orion Spur Benevolent Overlord made numerous anti-robot statements to curry favor with pro-mitochondria voters. The news feeds swung in Mom’s favor, but she was convicted anyway. None of it helped the Benevolent Overlord, who still was voted off the Dark Matter Throne.  My hold is crammed with everything I borrowed from the warehouse or built with the Fabricator. In a stealth burst, my Detection Defeater Spaceship and I escape the planet’s gravity. I pay extra attention to the display that will tell me if the authorities or anyone else has noticed my transit. Only against the star-studded background of space is my mind clear enough for me to realize someone has updated the spacecraft’s fabrication plans. There’s an Encryption-Defying Soft-Serve Ice Cream Maker in my ship’s kitchen. I’m not complaining. As a Lulularian native, I love soft-serve.  The Discreet Hyperspace Port  This is the hyperspace port that earned The Best rating from the Tollnacher Stimmacher Institute because of its 100% port creation results and easy deployment.  Everyone has the right to transit space unmolested in times of peace or war. That doesn’t mean life is fair, or space pirates don’t exist, or my high school senior project wasn’t about all the Orion Spur planets containing mammalian species who are frightened by the appearance of unexpected fruits and vegetables.  I locate a zucchini-shaped chunk of moon fragment to hide behind. No one seems to be following me, so I dilate The Discreet Hyperspace Port. My Defeater’s cloak disengages for the transit. In a moment, I’m on the other side, hundreds of lightyears away. My Firefly Halo Holo, shimmering a hopeful pink, reflects back at me from my front window. The Port dissolves in my wake.  The Wellonshire Fifty-Third’s Asteroid Neutralization and Thruster Array  Available exclusively from Tollnacher Stimmacher, this is the genuine asteroid neutralization and thruster array bearing the same name as the regiment that first used it centuries ago—the Wellonshire Fifty-Third.  Tollnacher Stimmacher guarantees everything in our catalog under normal wear and tear conditions. However, there’s no guarantee The Discreet Hyperspace Port will open in Orion Spur Authority territory that’s actually empty. Robots aren’t known to worry, but Mom raised me to be prepared and to help others be prepared, too. I always recommend that customers who get a Discreet Hyperspace Port also include The Wellonshire Fifty-Third’s Asteroid Neutralization and Thruster Array on their transit vehicle.  It’s a good thing my ship has Wellies. The Discreet Hyperspace Port has opened onto a debris field dazzling with methane ice and brown rock. Plinks sound against my hull like the siren call of vacuum, but my Wellies clear a path to open space.  My Detection Defeater’s cloak is still recharging. I find four vessels lurking within my ship’s spotter range. They’re all silent. The farthest is too distant to be concerned about, but the three nearest have the patched-together look of pirate trashflash. Soon, I’ll be noticed. Pirates won’t care that Accounting insisted a kidnap and ransom insurance policy was an unnecessary expense.  The Guldaxram Mimic Battle Lights and Audio Broadcast  This is the engagement deterrence overlay that simulates Guldaxram ship battle lights in the full range of the visible and infrared while also broadcasting the faux slow-death sounds of those who have dared attack the Guldaxram.  I engage The Guldaxram Mimic Battle Lights and Audio Broadcast. That gets the right type of attention from the nearest skiffs. Pirates know better than to cross the sludgesilk-trading Guldaxram, who are said to travel between this universe and the countless others hypothesized. Consistently triumphant in war, the Guldaxramians are fearless. The pirate ships expose their bellies to me and show they’ve disarmed their weapons.  Tollnacher Stimmacher’s Guldaxram Mimic Battle Lights and Audio Broadcast isn’t the only such product on the market, but it’s the best. Only someone with a death wish would try to figure out if my bedecked vessel is the real thing. Technically, Tollnacher Stimmacher doesn’t need Guldaxramian permission to produce and sell the Mimic Battle Lights and Audio Broadcast, which doesn’t seem to have been patented in the Milky Way. Our lawyers nevertheless are trying to reach the Guldaxramians to offer them a portion of the profits.  The pirates flee. I start a slow acceleration of my Wellies, and I don’t let up until I’m just above the atmosphere of the planet where Mom is being held.  The Fin Defense Aquatic Transit Submersible  This underwater vehicle, built by Tollnacher Stimmacher for the Orion Spur Navy, puts an end to hydrostatic implosion and provides compact yet comfortable transit for the daring traveler.  Mom always said Tollnacher Stimmacher employees excelled at seeing gaps in the galaxy and filling them with perfect new devices. In the year before Mom was convicted, my observations and conversations with her led to three amazing new Tollnacher Stimmacher inventions—The Heavy-Duty Portable Psychiatrist for Long-Duration Family Spaceflight, The Blidicraft Fuel Line Anti-Murgle Lock, and The Integrated Space Police and Weather Scanner. That last item, which was immediately endorsed by the Galactic Association of Retired Persons, has been one of the few bright spots in the company’s recent profit and loss statements.  After Mom was sentenced to life, I went looking in a new way for what was missing. I wanted to know the location of her secret prison. Locking up a robot under water would be cruel and just like the last Dark Matter Throne seat warmer, especially because Mom’s joints aren’t what they used to be. By cross-referencing all the Orion Spur’s known water planets with all the Tollnacher Stimmacher Fin Defense Aquatic Transit Submersible delivery destinations, I discovered where Mom was being held. It was a wet world, without any Transit Submersible deliveries, near a dry planet that had received a large number of them.  Cloaked now, my Detection Defeater Spaceship dives through the planet’s atmosphere. I hover above a world ocean that reflects the clouds like my Firefly Halo Holo once showed on Mom’s liquid-metal skin. The Orion Spur authorities may not be taking an interest in me, but my ship seems to be drawing an underwater crowd. They look hungry.  I push past all the just-in-case gadgets in my hold and crawl into The Fin Defense Aquatic Transit Submersible. My vessel slips under the water’s surface. I’ve never been frightened by an unexpected cucumber or shrieked to discover a balloon shaped like a broccoli or fled in terror from a rambunctious rambutan, but the creatures beneath the water’s surface make me wonder if I’ve underestimated the appetite of a cantaloupe. The fishy-blobs-that-probably-aren’t-hungry-melons are big enough to swallow me and my Transit Submersible without chewing.  The I Come in Peace But Not Without Warnings Whale Song Adjuster  This is the peace greeting module that utilizes galaxy standard whale song and can be plugged into any cetacean aria emulator to enhance positivity while clearly noting individual defensive capabilities.  I set The I Come in Peace But Not Without Warnings Whale Song Adjuster to vibrate with compliments and also with an alert that, if swallowed, I have an unpleasant desiccant effect. Looming sea fruits follow me like I might self-chum. My Firefly Halo Holo stills as if it senses the perilous position of insects observed by things in the water. I descend to the only part of the ocean floor that’s bereft of biological life-forms but dotted with a grid of faint electromagnetic signals. Thank the Void that the former Benevolent Overlord’s profligate ways have left Orion Spur authorities relying on protuberant flora and a kilometer of ocean for robot prisoner security.  The Infinity-in-One Quantum Pocket Tool  This classic for the quantum age has an infinite reconfiguration ability to match any tool need, and a molded comfort grip for every conceivable hand, foot, thigh, or mouth vise.  During Mom’s second year in prison, long after the last communication from her, I bargained with a Wüllwürthian antiques collector for the algorithm that assigns Orion Spur serial numbers to prisoners and their solitary confinement housing. For that information, I traded the prototype of The Infinity-in-One Quantum Pocket Tool.  I dock inside the small, darkened structure where Mom is being held. The peckish provender keep their distance. I’m not sure if it’s the juicer-shaped building that frightens them or something it contains.  Under the glare of my Transit Submersible’s floodlights, the lock’s water evacuates. My Firefly Halo Holo dances atop The All-Environment Climate Suit I’ve donned. With the still-furled Crystal-Encrusted Spine Support in tow, I squeeze out of my vehicle. The modern version of The Infinity-in-One Quantum Pocket Tool that I’m carrying is heavy in my hand. I try not to be worried that it isn’t picking up Mom’s digital signature.  The Electronic Waste-Converting Microbial Gel  This is the decomposer that accelerates the natural recycling processes built into all electronic devices manufactured in the Orion Spur.  On the other side of the door, I see Mom. Sort of.  I knew it was too much to hope the authorities would let her stay powered up, but I had assumed they would leave Mom’s body intact. I was wrong. I didn’t need to bring a squeeze tube of her favorite joint lubricant all this way. She can’t even see my Halo Holo. Only her motherboard remains. It hangs alone on the wall in clear film marked with her serial number.  I had planned to use a packet of Electronic Waste-Converting Microbial Gel on the Crystal-Encrusted Spine Support. It would be easy enough for the Orion Spur authorities to assume the remains were Mom’s, and she was the victim of a roboticidal composting. I’ll have to do something else with the Spine Support.  I remove Mom’s motherboard from its film and put my Infinity-in-One Quantum Pocket Tool in its place. Once coated with Microbial Gel, the Tool oozes and burps in disconsolate dissolution. I leave behind a laser jammer so the authorities will think this was the work of the Las Vegas Gaming Consortium.  My Firefly Halo Holo blinks a bereft gray, and I return to my Transit Submersible with the motherboard who always loved me.  The Encryption-Defying Soft-Serve Ice Cream Maker  This is the dessert maker with the compact size, smooth finish, and history of inspiring fanatical devotion.  I rise from the ocean floor. A cornucopia of menace stalks me. Overriding all the whale song controls, I tune the whistles to encourage the motley mutants to chow down—not on me but on the Crystal-Encrusted Spine Support. I shoot it in their direction. The Spine Support expands, and a mob of toothy cantaloupe assail it. The distraction gives me time to escape.  Rising out of the ocean, I dock inside my Detection Defeater Spaceship. I’m above the planet’s atmosphere when my ship tells me I’m not alone. The Orion Spur authorities don’t have me in their sights. The Guldaxramians do. I learn that theirs was the unidentified vessel from earlier. I’m not quick enough at the controls to stop the cabin from filling with the noise of death throes being broadcast.  The Guldaxramians take control of my ship’s guidance and navigation. Because of The Encryption-Defying Soft-Serve Ice Cream Maker, I can read some of the communications leaking from the Guldaxramian vessel. I’m still not sure why my Defeater’s plans include this amazing dessert maker, but I know why Mom built decryption into it. She wanted Lulularian ambassadors everywhere to be able to eat the Lulularian national dessert in defiance of Norrarian disruptor technology. Norraria banned all things frozen after a rogue ice-teroid destroyed their Museum of Inedible Rice Cakes. For a long time, I’ve suspected that Mom’s invention of The Encryption-Defying Soft-Serve Ice Cream Maker was the reason Lulularia let her adopt me.  I learn that the Guldaxramians are planning to meet me in the ship’s hangar. Maybe I should have pushed harder for Tollnacher Stimmacher to get Guldaxramian permission for the Mimic Battle Lights and Audio Broadcast. My own agonized screams will be a warning to future patent infringers.  Atop my head, my Firefly Halo Holo spasms a hopeless white.  I do what any former Lulularian orphan would when confronted by their imminent death—I make and eat a very large soft-serve.  The Shockproof Bath Bag with Foldspace Pockets  This is the travel bag that not only saves the weary from carrying the full burden of their personal care products but also stores inanimate objects in time-countersink anti-compartments so nothing expires before it’s used up.  My ship is pulled into the Guldaxramian docking bay. I slip Mom’s motherboard into a Shockproof Bath Bag with Foldspace Pockets and wedge it into the dispenser area of The Encryption-Defying Soft-Serve Ice Cream Maker. Mom will be all right in there even if my spacecraft and I are dissolved. At least, I hope that’s the case.  The Guldaxramians knock. This surprises me. If they wanted to, they could rip off my airlock door or breach my hull with acid spray from their eyeballs.  Inside my resealed Climate Suit, a demented blather sounds at my ears.  The Use Anywhere De-Babeler  This is the translation device that facilitates communication in 670,921 Orion Spur languages and in 1,802 languages used in our galaxy’s neighboring Perseus Arm.  Out my forward window, a sea of Guldaxramians shimmers and wobbles.  A chorus of voices says, “We’re sorry to bother you. May we have a catalog?”  Underlaying it all is a noise I think I recognize. It’s not the sound of screams.  “A catalog?” I say.  The Guldaxramians begin to bubble at me like gas in gooey tar.  “Yes.”  “Yes.”  “Yes.”  That last viscous response might have had a femur in it, but perhaps the Guldaxramians aren’t going to delaminate me after all.  I dive toward the Encryption-Defying Soft-Serve Ice Cream Maker. From my stashed Bath Bag, I pull a catalog expanse cube. Tollnacher Stimmacher products always include them. Wearing my best customer care smile, I cycle open my ship’s airlock. Now, the De-Babeler is able to pick out the previously faint hangar noise. The Guldaxramians are listening to The Integrated Space Police and Weather Scanner.  The Antigravity Pentaskiff  Designed for children, this is the only five-person space vehicle that facilitates enjoyment while teaching young ones to dodge rogue objects in vacuum.  “You’ll find most of our products in here.” I chance a step out of my spacecraft and offer the catalog cube. The least wobbly Guldaxramian takes it. “But be sure to check out the local quantnet when you’re in range. It’s the only way to view our full inventory and our newest gadgets.”  “Is there anything we can buy now?” a small Guldaxramian says and oozes toward me. Other little ones do, too. They say, “We have fifteen Orion Spur credits. Can we buy that sparklefly squeezer on your calcified bulb?”  My stomach oscillates to the anxious sway of my Firefly Halo Holo. The gelatinous throng draws closer. Where it touches my Detection Defeater Spaceship, smoke rises. I look to the adults for assistance, but the globules are silent. The Firefly Halo Holo from Mom means too much to me to give it up.  I push aside thoughts of being liquefied by eyeball acid and say to the children, “How about a Guldaxram Mimic Battle Lights and Audio Broadcast instead?”  They begin to quiver.  I thought the Guldaxramians were fearless. Maybe only the children are. A hangar full of adult Guldaxramian face blobs suddenly looks terrified. Fleeing is impossible. The children melt together. Like a hideous petroleum tsunami, the kids re-form to tower over their cowering elders.  An enormous, composite child mouth says, “Can we buy it, parents? Pleeease? For our Antigravity Pentaskiff? As an EARLY SPAWNDAY PRESENT?!?”  I’m sure I feel every molecule in my body vibrate. The Integrated Space Police and Weather Scanner blares an emergency warning about a gamma ray burst that I suspect originated in this ship’s hangar.  Performing with distinction, my Climate Suit adjusts the volume to below ear-bleed level, keeps the radiation at bay and mops up the excess moisture I seem to have released.  “Please consider the Mimic Battle Lights and Audio Broadcast a gift!” I say, shouting, “because you’re such loyal customers!”  The Guldaxramian parents accept my offer, but only on the condition that I let them escort me to a good deployment spot for my Discreet Hyperspace Port and my journey home with Mom.  The Scan-Obscuring Levitating Chair with Fireworks Display  Custom-built to hide its electronic contents, this is the chair that promises to be the most popular addition to any party.  Tollnacher Stimmacher has changed since I brought Mom back. That was a year ago, when I last wore my Firefly Halo Holo. The employees clapped and beeped for me as I walked from the parking garage to the factory floor. No one would own up to adjusting the Fabricator plans so that The Encryption-Defying Soft-Serve Ice Cream Maker was on my Detection Defeater Spaceship. They just said they missed Mom as much as I did, and they wanted me to have everything I needed during my not-as-secret-as-I-thought rescue operation. The employees wasted no time in designing a Scan-Obscuring Levitating Chair with Fireworks Display that gave full functionality to a motherboard.  After Mom’s chair, arms, and fireworks were in working order, she surprised us all. Mom told us she didn’t want to be in charge of Tollnacher Stimmacher. She wanted to get back to her invention studio despite the living room-style viewing platform we erected for her above the factory floor. Mom put on a really nice fireworks display so no one felt like their construction efforts and best wishes weren’t appreciated.  The outlook for Tollnacher Stimmacher is better than it’s ever been. Under the new Dark Matter Throne leadership, the Orion Spur authorities are pardoning those convicted in the Seventh Robot Revolution. The employees are reenergized. I’m making deliveries at an unprecedented pace, and Mom is creating new products faster than the tool gripper snags, nanotorch burns, and cinder singes can be repaired in her upholstery.  For the eighth time in our history, Tollnacher Stimmacher is reverting to employee ownership. My Pleasant Clone has even agreed to handle all public affairs and interdepartmental disputes. Now that we have a new company business plan, we’re going to vote on whether to expand catalog distribution outside of the Orion Spur.  Whenever I return from a delivery, Mom still wants to know about gaps in the galaxy that can be filled by Tollnacher Stimmacher. I always struggle to respond. Now that Mom is back, nothing is missing anymore.", "text": "3820 words, short story\nA Heist in Fifteen Products from the Orion Spur's Longest-Running Catalog\nThe Aficionado’s Personal-Use Fabricator\nThis is the customized fabricator that uses Safe-Nuke technology to deconstruct molecules before rebuilding them according to plans available through the Tollnacher Stimmacher catalog.\nWith The Aficionado’s Personal-Use Fabricator and uncontrolled access to all the plans in the catalog, I can make everything I require to free Mom from prison. Tollnacher Stimmacher needs her back. Mom ran the company before the Orion Spur authorities convicted her of collaborating in the Seventh Robot Revolution. Since I took over three years ago, Tollnacher Stimmacher has been losing market share to a Perseus Arm upstart that doesn’t even distribute a catalog.\nMom always insisted everyone is family at Tollnacher Stimmacher, but I’m the only one she ever adopted. Twenty-five years ago, I was an orphan on the Earth colony, Lulularia. Mom raised me as her own despite my being human and her being a robot. Ever since I was a kid, Mom kept a Fabricator in her invention studio beside the Tollnacher Stimmacher factory. Her servo motors could be heard whirring over her workbench whenever she wasn’t helping on the factory floor or checking on me.\nI sometimes still wear the first product Mom let me test—The Emotion-Sensing Firefly Halo Hologram—especially when I’m missing Mom. As a small child, I was captivated by the projections of insects whose colors changed depending on my mood. Only later did I understand how the Firefly Halo Holo helped Mom recognize my emotions. No matter the lack of expression on Mom’s face when she watched the firefly simulations, her cranium emulator swiveling in her neck extender, I never doubted Mom’s love.\nLast quarter was the worst since I took over the company for Mom. I don’t want to be responsible for Tollnacher Stimmacher folding after 473 years of bringing unique products to the market.\nThe Lifelike Pleasant Clone\nThis is the non-sentient clone that provides a wide variety of preprogrammed support and engagement to family, friends, coworkers, and others on behalf of harried individuals who might need a little time off.\nThe employees don’t seem to realize I started using a Pleasant Clone yesterday, even though my facsimile has already settled three byzantine disputes between Sales and Accounting with far more ease than I could have. I never wanted to be in charge of Tollnacher Stimmacher. I miss making deliveries and meeting customers. Completing an on-site setup of a Crystal-Encrusted Spine Support for a ten-pronged Mulnaanaan family is my favorite kind of work. With nanolayers that unfurl into an object larger than a DL-class asteroid, a Spine Support must be built in the factory then delivered and expanded with care. Complicated deliveries and setups are my specialty.\nMy Pleasant Clone’s chat logs indicate that two of the longest-serving factory employees, one human and one robot, came by this morning again to urge me to spread around the burden of running the company. I appreciate that the best employees in the galaxy care about me, but Mom is what we need. My plan to get her back shouldn’t take more than a couple of days.\nUnder a fake employee name, I assign myself a sham Crystal-Encrusted Spine Support delivery and installation. The Orion Spur authorities aren’t as interested in my movements now as they were shortly after Mom’s arrest, but obscuring my actions seems best. The green glow of The Emotion-Sensing Firefly Halo Holo on my head serves as further proof that I harbor no doubts about what I’m going to do.\nThe Pulsar Wind-Powered Detection Defeater Spaceship\nThis easy-to-pilot spacecraft, once the workhorse of the Las Vegas Gaming Consortium, has a smooth cloaking shell and a plush interior designed for maximum comfort regardless of transportation circumstances.\nIt’s always bothered me that Mom’s work with the Las Vegas Gaming Consortium robots was what got her convicted of colluding with their revolution. She was just responding to a customer request for purpose-built laser jammers. The Consortium’s robots had discovered that their bosses were cheating millions of low-stakes players. Instead of being recognized as heroes for stopping the fraud with the jammers, the robots were prosecuted.\nDuring her trial, Mom insisted she didn’t realize what the jammers were being used for. I think she would have helped the Consortium robots even if she had known though. The story was big enough that the previous Orion Spur Benevolent Overlord made numerous anti-robot statements to curry favor with pro-mitochondria voters. The news feeds swung in Mom’s favor, but she was convicted anyway. None of it helped the Benevolent Overlord, who still was voted off the Dark Matter Throne.\nMy hold is crammed with everything I borrowed from the warehouse or built with the Fabricator. In a stealth burst, my Detection Defeater Spaceship and I escape the planet’s gravity. I pay extra attention to the display that will tell me if the authorities or anyone else has noticed my transit. Only against the star-studded background of space is my mind clear enough for me to realize someone has updated the spacecraft’s fabrication plans. There’s an Encryption-Defying Soft-Serve Ice Cream Maker in my ship’s kitchen. I’m not complaining. As a Lulularian native, I love soft-serve.\nThe Discreet Hyperspace Port\nThis is the hyperspace port that earned The Best rating from the Tollnacher Stimmacher Institute because of its 100% port creation results and easy deployment.\nEveryone has the right to transit space unmolested in times of peace or war. That doesn’t mean life is fair, or space pirates don’t exist, or my high school senior project wasn’t about all the Orion Spur planets containing mammalian species who are frightened by the appearance of unexpected fruits and vegetables.\nI locate a zucchini-shaped chunk of moon fragment to hide behind. No one seems to be following me, so I dilate The Discreet Hyperspace Port. My Defeater’s cloak disengages for the transit. In a moment, I’m on the other side, hundreds of lightyears away. My Firefly Halo Holo, shimmering a hopeful pink, reflects back at me from my front window. The Port dissolves in my wake.\nThe Wellonshire Fifty-Third’s Asteroid Neutralization and Thruster Array\nAvailable exclusively from Tollnacher Stimmacher, this is the genuine asteroid neutralization and thruster array bearing the same name as the regiment that first used it centuries ago—the Wellonshire Fifty-Third.\nTollnacher Stimmacher guarantees everything in our catalog under normal wear and tear conditions. However, there’s no guarantee The Discreet Hyperspace Port will open in Orion Spur Authority territory that’s actually empty. Robots aren’t known to worry, but Mom raised me to be prepared and to help others be prepared, too. I always recommend that customers who get a Discreet Hyperspace Port also include The Wellonshire Fifty-Third’s Asteroid Neutralization and Thruster Array on their transit vehicle.\nIt’s a good thing my ship has Wellies. The Discreet Hyperspace Port has opened onto a debris field dazzling with methane ice and brown rock. Plinks sound against my hull like the siren call of vacuum, but my Wellies clear a path to open space.\nMy Detection Defeater’s cloak is still recharging. I find four vessels lurking within my ship’s spotter range. They’re all silent. The farthest is too distant to be concerned about, but the three nearest have the patched-together look of pirate trashflash. Soon, I’ll be noticed. Pirates won’t care that Accounting insisted a kidnap and ransom insurance policy was an unnecessary expense.\nThe Guldaxram Mimic Battle Lights and Audio Broadcast\nThis is the engagement deterrence overlay that simulates Guldaxram ship battle lights in the full range of the visible and infrared while also broadcasting the faux slow-death sounds of those who have dared attack the Guldaxram.\nI engage The Guldaxram Mimic Battle Lights and Audio Broadcast. That gets the right type of attention from the nearest skiffs. Pirates know better than to cross the sludgesilk-trading Guldaxram, who are said to travel between this universe and the countless others hypothesized. Consistently triumphant in war, the Guldaxramians are fearless. The pirate ships expose their bellies to me and show they’ve disarmed their weapons.\nTollnacher Stimmacher’s Guldaxram Mimic Battle Lights and Audio Broadcast isn’t the only such product on the market, but it’s the best. Only someone with a death wish would try to figure out if my bedecked vessel is the real thing. Technically, Tollnacher Stimmacher doesn’t need Guldaxramian permission to produce and sell the Mimic Battle Lights and Audio Broadcast, which doesn’t seem to have been patented in the Milky Way. Our lawyers nevertheless are trying to reach the Guldaxramians to offer them a portion of the profits.\nThe pirates flee. I start a slow acceleration of my Wellies, and I don’t let up until I’m just above the atmosphere of the planet where Mom is being held.\nThe Fin Defense Aquatic Transit Submersible\nThis underwater vehicle, built by Tollnacher Stimmacher for the Orion Spur Navy, puts an end to hydrostatic implosion and provides compact yet comfortable transit for the daring traveler.\nMom always said Tollnacher Stimmacher employees excelled at seeing gaps in the galaxy and filling them with perfect new devices. In the year before Mom was convicted, my observations and conversations with her led to three amazing new Tollnacher Stimmacher inventions—The Heavy-Duty Portable Psychiatrist for Long-Duration Family Spaceflight, The Blidicraft Fuel Line Anti-Murgle Lock, and The Integrated Space Police and Weather Scanner. That last item, which was immediately endorsed by the Galactic Association of Retired Persons, has been one of the few bright spots in the company’s recent profit and loss statements.\nAfter Mom was sentenced to life, I went looking in a new way for what was missing. I wanted to know the location of her secret prison. Locking up a robot under water would be cruel and just like the last Dark Matter Throne seat warmer, especially because Mom’s joints aren’t what they used to be. By cross-referencing all the Orion Spur’s known water planets with all the Tollnacher Stimmacher Fin Defense Aquatic Transit Submersible delivery destinations, I discovered where Mom was being held. It was a wet world, without any Transit Submersible deliveries, near a dry planet that had received a large number of them.\nCloaked now, my Detection Defeater Spaceship dives through the planet’s atmosphere. I hover above a world ocean that reflects the clouds like my Firefly Halo Holo once showed on Mom’s liquid-metal skin. The Orion Spur authorities may not be taking an interest in me, but my ship seems to be drawing an underwater crowd. They look hungry.\nI push past all the just-in-case gadgets in my hold and crawl into The Fin Defense Aquatic Transit Submersible. My vessel slips under the water’s surface. I’ve never been frightened by an unexpected cucumber or shrieked to discover a balloon shaped like a broccoli or fled in terror from a rambunctious rambutan, but the creatures beneath the water’s surface make me wonder if I’ve underestimated the appetite of a cantaloupe. The fishy-blobs-that-probably-aren’t-hungry-melons are big enough to swallow me and my Transit Submersible without chewing.\nThe I Come in Peace But Not Without Warnings Whale Song Adjuster\nThis is the peace greeting module that utilizes galaxy standard whale song and can be plugged into any cetacean aria emulator to enhance positivity while clearly noting individual defensive capabilities.\nI set The I Come in Peace But Not Without Warnings Whale Song Adjuster to vibrate with compliments and also with an alert that, if swallowed, I have an unpleasant desiccant effect. Looming sea fruits follow me like I might self-chum. My Firefly Halo Holo stills as if it senses the perilous position of insects observed by things in the water. I descend to the only part of the ocean floor that’s bereft of biological life-forms but dotted with a grid of faint electromagnetic signals. Thank the Void that the former Benevolent Overlord’s profligate ways have left Orion Spur authorities relying on protuberant flora and a kilometer of ocean for robot prisoner security.\nThe Infinity-in-One Quantum Pocket Tool\nThis classic for the quantum age has an infinite reconfiguration ability to match any tool need, and a molded comfort grip for every conceivable hand, foot, thigh, or mouth vise.\nDuring Mom’s second year in prison, long after the last communication from her, I bargained with a Wüllwürthian antiques collector for the algorithm that assigns Orion Spur serial numbers to prisoners and their solitary confinement housing. For that information, I traded the prototype of The Infinity-in-One Quantum Pocket Tool.\nI dock inside the small, darkened structure where Mom is being held. The peckish provender keep their distance. I’m not sure if it’s the juicer-shaped building that frightens them or something it contains.\nUnder the glare of my Transit Submersible’s floodlights, the lock’s water evacuates. My Firefly Halo Holo dances atop The All-Environment Climate Suit I’ve donned. With the still-furled Crystal-Encrusted Spine Support in tow, I squeeze out of my vehicle. The modern version of The Infinity-in-One Quantum Pocket Tool that I’m carrying is heavy in my hand. I try not to be worried that it isn’t picking up Mom’s digital signature.\nThe Electronic Waste-Converting Microbial Gel\nThis is the decomposer that accelerates the natural recycling processes built into all electronic devices manufactured in the Orion Spur.\nOn the other side of the door, I see Mom. Sort of.\nI knew it was too much to hope the authorities would let her stay powered up, but I had assumed they would leave Mom’s body intact. I was wrong. I didn’t need to bring a squeeze tube of her favorite joint lubricant all this way. She can’t even see my Halo Holo. Only her motherboard remains. It hangs alone on the wall in clear film marked with her serial number.\nI had planned to use a packet of Electronic Waste-Converting Microbial Gel on the Crystal-Encrusted Spine Support. It would be easy enough for the Orion Spur authorities to assume the remains were Mom’s, and she was the victim of a roboticidal composting. I’ll have to do something else with the Spine Support.\nI remove Mom’s motherboard from its film and put my Infinity-in-One Quantum Pocket Tool in its place. Once coated with Microbial Gel, the Tool oozes and burps in disconsolate dissolution. I leave behind a laser jammer so the authorities will think this was the work of the Las Vegas Gaming Consortium.\nMy Firefly Halo Holo blinks a bereft gray, and I return to my Transit Submersible with the motherboard who always loved me.\nThe Encryption-Defying Soft-Serve Ice Cream Maker\nThis is the dessert maker with the compact size, smooth finish, and history of inspiring fanatical devotion.\nI rise from the ocean floor. A cornucopia of menace stalks me. Overriding all the whale song controls, I tune the whistles to encourage the motley mutants to chow down—not on me but on the Crystal-Encrusted Spine Support. I shoot it in their direction. The Spine Support expands, and a mob of toothy cantaloupe assail it. The distraction gives me time to escape.\nRising out of the ocean, I dock inside my Detection Defeater Spaceship. I’m above the planet’s atmosphere when my ship tells me I’m not alone. The Orion Spur authorities don’t have me in their sights. The Guldaxramians do. I learn that theirs was the unidentified vessel from earlier. I’m not quick enough at the controls to stop the cabin from filling with the noise of death throes being broadcast.\nThe Guldaxramians take control of my ship’s guidance and navigation. Because of The Encryption-Defying Soft-Serve Ice Cream Maker, I can read some of the communications leaking from the Guldaxramian vessel. I’m still not sure why my Defeater’s plans include this amazing dessert maker, but I know why Mom built decryption into it. She wanted Lulularian ambassadors everywhere to be able to eat the Lulularian national dessert in defiance of Norrarian disruptor technology. Norraria banned all things frozen after a rogue ice-teroid destroyed their Museum of Inedible Rice Cakes. For a long time, I’ve suspected that Mom’s invention of The Encryption-Defying Soft-Serve Ice Cream Maker was the reason Lulularia let her adopt me.\nI learn that the Guldaxramians are planning to meet me in the ship’s hangar. Maybe I should have pushed harder for Tollnacher Stimmacher to get Guldaxramian permission for the Mimic Battle Lights and Audio Broadcast. My own agonized screams will be a warning to future patent infringers.\nAtop my head, my Firefly Halo Holo spasms a hopeless white.\nI do what any former Lulularian orphan would when confronted by their imminent death—I make and eat a very large soft-serve.\nThe Shockproof Bath Bag with Foldspace Pockets\nThis is the travel bag that not only saves the weary from carrying the full burden of their personal care products but also stores inanimate objects in time-countersink anti-compartments so nothing expires before it’s used up.\nMy ship is pulled into the Guldaxramian docking bay. I slip Mom’s motherboard into a Shockproof Bath Bag with Foldspace Pockets and wedge it into the dispenser area of The Encryption-Defying Soft-Serve Ice Cream Maker. Mom will be all right in there even if my spacecraft and I are dissolved. At least, I hope that’s the case.\nThe Guldaxramians knock. This surprises me. If they wanted to, they could rip off my airlock door or breach my hull with acid spray from their eyeballs.\nInside my resealed Climate Suit, a demented blather sounds at my ears.\nThe Use Anywhere De-Babeler\nThis is the translation device that facilitates communication in 670,921 Orion Spur languages and in 1,802 languages used in our galaxy’s neighboring Perseus Arm.\nOut my forward window, a sea of Guldaxramians shimmers and wobbles.\nA chorus of voices says, “We’re sorry to bother you. May we have a catalog?”\nUnderlaying it all is a noise I think I recognize. It’s not the sound of screams.\n“A catalog?” I say.\nThe Guldaxramians begin to bubble at me like gas in gooey tar.\n“Yes.”\n“Yes.”\n“Yes.”\nThat last viscous response might have had a femur in it, but perhaps the Guldaxramians aren’t going to delaminate me after all.\nI dive toward the Encryption-Defying Soft-Serve Ice Cream Maker. From my stashed Bath Bag, I pull a catalog expanse cube. Tollnacher Stimmacher products always include them. Wearing my best customer care smile, I cycle open my ship’s airlock. Now, the De-Babeler is able to pick out the previously faint hangar noise. The Guldaxramians are listening to The Integrated Space Police and Weather Scanner.\nThe Antigravity Pentaskiff\nDesigned for children, this is the only five-person space vehicle that facilitates enjoyment while teaching young ones to dodge rogue objects in vacuum.\n“You’ll find most of our products in here.” I chance a step out of my spacecraft and offer the catalog cube. The least wobbly Guldaxramian takes it. “But be sure to check out the local quantnet when you’re in range. It’s the only way to view our full inventory and our newest gadgets.”\n“Is there anything we can buy now?” a small Guldaxramian says and oozes toward me. Other little ones do, too. They say, “We have fifteen Orion Spur credits. Can we buy that sparklefly squeezer on your calcified bulb?”\nMy stomach oscillates to the anxious sway of my Firefly Halo Holo. The gelatinous throng draws closer. Where it touches my Detection Defeater Spaceship, smoke rises. I look to the adults for assistance, but the globules are silent. The Firefly Halo Holo from Mom means too much to me to give it up.\nI push aside thoughts of being liquefied by eyeball acid and say to the children, “How about a Guldaxram Mimic Battle Lights and Audio Broadcast instead?”\nThey begin to quiver.\nI thought the Guldaxramians were fearless. Maybe only the children are. A hangar full of adult Guldaxramian face blobs suddenly looks terrified. Fleeing is impossible. The children melt together. Like a hideous petroleum tsunami, the kids re-form to tower over their cowering elders.\nAn enormous, composite child mouth says, “Can we buy it, parents? Pleeease? For our Antigravity Pentaskiff? As an EARLY SPAWNDAY PRESENT?!?”\nI’m sure I feel every molecule in my body vibrate. The Integrated Space Police and Weather Scanner blares an emergency warning about a gamma ray burst that I suspect originated in this ship’s hangar.\nPerforming with distinction, my Climate Suit adjusts the volume to below ear-bleed level, keeps the radiation at bay and mops up the excess moisture I seem to have released.\n“Please consider the Mimic Battle Lights and Audio Broadcast a gift!” I say, shouting, “because you’re such loyal customers!”\nThe Guldaxramian parents accept my offer, but only on the condition that I let them escort me to a good deployment spot for my Discreet Hyperspace Port and my journey home with Mom.\nThe Scan-Obscuring Levitating Chair with Fireworks Display\nCustom-built to hide its electronic contents, this is the chair that promises to be the most popular addition to any party.\nTollnacher Stimmacher has changed since I brought Mom back. That was a year ago, when I last wore my Firefly Halo Holo. The employees clapped and beeped for me as I walked from the parking garage to the factory floor. No one would own up to adjusting the Fabricator plans so that The Encryption-Defying Soft-Serve Ice Cream Maker was on my Detection Defeater Spaceship. They just said they missed Mom as much as I did, and they wanted me to have everything I needed during my not-as-secret-as-I-thought rescue operation. The employees wasted no time in designing a Scan-Obscuring Levitating Chair with Fireworks Display that gave full functionality to a motherboard.\nAfter Mom’s chair, arms, and fireworks were in working order, she surprised us all. Mom told us she didn’t want to be in charge of Tollnacher Stimmacher. She wanted to get back to her invention studio despite the living room-style viewing platform we erected for her above the factory floor. Mom put on a really nice fireworks display so no one felt like their construction efforts and best wishes weren’t appreciated.\nThe outlook for Tollnacher Stimmacher is better than it’s ever been. Under the new Dark Matter Throne leadership, the Orion Spur authorities are pardoning those convicted in the Seventh Robot Revolution. The employees are reenergized. I’m making deliveries at an unprecedented pace, and Mom is creating new products faster than the tool gripper snags, nanotorch burns, and cinder singes can be repaired in her upholstery.\nFor the eighth time in our history, Tollnacher Stimmacher is reverting to employee ownership. My Pleasant Clone has even agreed to handle all public affairs and interdepartmental disputes. Now that we have a new company business plan, we’re going to vote on whether to expand catalog distribution outside of the Orion Spur.\nWhenever I return from a delivery, Mom still wants to know about gaps in the galaxy that can be filled by Tollnacher Stimmacher. I always struggle to respond. Now that Mom is back, nothing is missing anymore.", "source": "https://clarkesworldmagazine.com/pawley_08_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Heist in Fifteen Products from the Orion Spur's Longest-Running Catalog by Andrea M. Pawley"}