{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "J1UrAZThb9bXrLSbMPIKUX+oI4A=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor’s Desk: Stomp Stomp Stomp  Sometimes catching up with an old friend can set your mind running on an unexpected course. In this case, it was some passing thoughts on kaiju movies and how strong they appeal to people like us. Those giant monsters and robots have a special place in our hearts and for people our age, getting a chance to scratch that itch wasn’t as easy as it is today. For me, I know it was pretty much restricted to monster week, which would happen once or twice a year as after school movies on TV.  In recent years, it’s become so much easier. The kids and I used to regularly watch Godzilla, Gamera, Ultraman, and various other movies and shows on the internet, Netflix, or DVD. Now that they are older, it doesn’t happen as much, but it’s still something amusing we can share. In some ways, part of the charm is how clunky they can be. Yeah, it’s a guy in a rubber suit, so what? This is pure mindless escapism and being amused is an important part of the equation. I think I need more of that in my life at the moment.  2016 was like a seriously mean and unfunny kaiju that stomped all over things in my life: family members in and out of the hospital; the senseless death of my wife’s friend; six months of seriously unpleasant times at the day job; and a series of other unhappy distractions. It’s time to hop in my giant mech, stand up, and take back my little world and I’ve have to admit that I was greatly amused this morning when the video game I was playing, Gears of War 4, put me in a giant mech to save someone’s mom. SF escapism to the rescue!  I took some much needed time off from the day job before the holiday break. In the midst of all the chaos, I had fallen behind schedule on a bunch of things. It was time to escape and refocus on things I wanted and needed to do so I could start off 2017 back on track. Not exactly the glamourous sort of thing that people want to do on their vacation, but I’ve enjoyed the opportunity. Each task has been a rubber-suited kaiju, something I know I can eventually defeat.  In between, I’ve tried to make sure it wasn’t all about work. There’s been fires in the fireplace; time with family; wrapping and unwrapping presents; and playing with new toys. I even had the opportunity to incorporate another childhood dream, this one of robots/AI, in the form of the Amazon Echo Dot. I’ve been playing with home automation, which is probably the closest I’ll come to having a robot friend in the near future—though maybe I can find a way to embed one of these in a robot body it can control. So in addition to battling my to-do list, I’ve been asking my imaginary robot friend to control the lights, play music, and do a few other less interesting tasks.  I’ve decided that I need to make 2017 a science-fictional year for me. Time to bring a little bit of Clarkesworld to Earth . . . or maybe just move there for a little while. In 2016, I forgot the value of escaping and now it’s time to go home. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor’s Desk: Stomp Stomp Stomp\nSometimes catching up with an old friend can set your mind running on an unexpected course. In this case, it was some passing thoughts on kaiju movies and how strong they appeal to people like us. Those giant monsters and robots have a special place in our hearts and for people our age, getting a chance to scratch that itch wasn’t as easy as it is today. For me, I know it was pretty much restricted to monster week, which would happen once or twice a year as after school movies on TV.\nIn recent years, it’s become so much easier. The kids and I used to regularly watch Godzilla, Gamera, Ultraman, and various other movies and shows on the internet, Netflix, or DVD. Now that they are older, it doesn’t happen as much, but it’s still something amusing we can share. In some ways, part of the charm is how clunky they can be. Yeah, it’s a guy in a rubber suit, so what? This is pure mindless escapism and being amused is an important part of the equation. I think I need more of that in my life at the moment.\n2016 was like a seriously mean and unfunny kaiju that stomped all over things in my life: family members in and out of the hospital; the senseless death of my wife’s friend; six months of seriously unpleasant times at the day job; and a series of other unhappy distractions. It’s time to hop in my giant mech, stand up, and take back my little world and I’ve have to admit that I was greatly amused this morning when the video game I was playing, Gears of War 4, put me in a giant mech to save someone’s mom. SF escapism to the rescue!\nI took some much needed time off from the day job before the holiday break. In the midst of all the chaos, I had fallen behind schedule on a bunch of things. It was time to escape and refocus on things I wanted and needed to do so I could start off 2017 back on track. Not exactly the glamourous sort of thing that people want to do on their vacation, but I’ve enjoyed the opportunity. Each task has been a rubber-suited kaiju, something I know I can eventually defeat.\nIn between, I’ve tried to make sure it wasn’t all about work. There’s been fires in the fireplace; time with family; wrapping and unwrapping presents; and playing with new toys. I even had the opportunity to incorporate another childhood dream, this one of robots/AI, in the form of the Amazon Echo Dot. I’ve been playing with home automation, which is probably the closest I’ll come to having a robot friend in the near future—though maybe I can find a way to embed one of these in a robot body it can control. So in addition to battling my to-do list, I’ve been asking my imaginary robot friend to control the lights, play music, and do a few other less interesting tasks.\nI’ve decided that I need to make 2017 a science-fictional year for me. Time to bring a little bit of Clarkesworld to Earth . . . or maybe just move there for a little while. In 2016, I forgot the value of escaping and now it’s time to go home.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_01_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Stomp Stomp Stomp by Neil Clarke"}