{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bogi Takács", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "4nPhwWE8jtjCvq6NmEH3h80YGYA=", "id": null, "license": null, "comments": "", "raw_text": "3900 words, short story  Toward the Luminous Towers  Liicha is singing an old song, his wheedly tenor not a match for the lush contralto of the original recording. And we shall soar, hand in hand, through the night sky . . . His voice grinds against the walls of the transporter, creates unwelcome resonances and echoes. Invisible fingernails scratching steel.  Liicha is a kind person, the best I could hope for in a comrade-in-arms, but I can’t bear to listen to this. “Would you cut it out already?” I am snappy, aggravated, out of my element. He is a soldier—but I am a conscript.  “Awww.” He stands up, stretches his pale, thick arms. “Is it time for the GS-10?”  He is right, and I am resentful. Was it my behavior? Something in my tone of voice?  He throws me the ampoule and I pull up the sleeve of my uniform, feed the ampoule into the port at the bend of my elbow. So many drugs—but this one is just to keep me awake, push me through the utter exhaustion brought on by sleepless days after sleepless nights.  The mechanism hisses softly. I remove the ampoule, lean back in my chair, close my eyes. Soon it will be time to log in again, my turn again, because the war machine will never come to a halt. But first, the prescheduled meeting with Doctor Darankau. Where is she already?  A tapping outside, unsteady hands fussing with the door. Liicha unlocks the latch, lets the doctor in. She grimaces and brushes hands against her face—her dark skin is stained with something lighter that looks like ash, underlining the folds and wrinkles of age.  Liicha makes a drink, something sweet-smelling produced by his fungal container. Doctor Darankau accepts it, drains the small cup in a single gulp. We murmur greetings, make small talk.  “Your schedule will be bumped up,” she says. “They will probably only tell you at the very last minute, but I thought you would want to know.”  I lean forward. The muscles in my abdomen clench. How could I have an even tighter schedule? I am living on GS-10 and Liicha’s concoctions.  “What’s going on?” I whisper. I don’t expect her to divulge classified information, but I know she probably will, otherwise she wouldn’t have brought up the topic. Liicha also leans closer.  Doctor Darankau does not lower her voice. “The Graycoats are using some kind of targeted bioweapon, likely retroviral. Biotech is trying to reverse-engineer it, but so far without success. It targets combat controllers. People are dropping out at an alarming rate, incapacitated, dead. Soon we will have no one left to guide the army.”  I feel deflated. If I die, then I won’t have to live in this endless, paradoxical tension-boredom-exhaustion state any longer. But my purpose here . . .  Doctor Darankau interrupts my thoughts. “Frankly, you are the only controller in my service area who’s not showing symptoms already.”  I didn’t know that, but it makes perfect sense: I’ve noticed people slow down, respond sluggishly, ping decreasing all over the network. I frown. “You think I might be immune? Because of my custom setup?”  She rolls the empty cup around between her palms. “Probably yes. I have been wondering if it’s because you’re neuroatypical in just the right way for the targeting to pass you by. You don’t trigger the pattern matching.”  “So they want me to work even harder, until my brain turns into mush anyway.” I shrug. “For the people, for victory.” It comes out even more cynical than intended. I genuinely want to serve. I genuinely want to protect. But I also deeply, desperately want to get out of this place, just one step behind the front lines, within tactical control range for every single piece of crap passing as military equipment.  Doctor Darankau mutters something that can be interpreted as affirmative or as noncommittal, then cautiously says goodbye. The hatch clanks shut after her, and I put my back against a bulkhead, slide slowly to the floor. This war, I hate it all, and for a moment, I just let myself feel that rage before I push it down, below conscious awareness. If I were to give in, my own magic might teleport me out of harm’s way; an uncontrolled, spontaneous action, but one that would qualify as desertion nonetheless. I know someone who vanished one day, only to reappear in the hinterlands, and I don’t want to end up like her; she’d escaped only to be executed. If I can’t control my fury, it needs to go. And no one can control teleportation jumps, really. Our wars would look very different if we could. My muscles tighten with all the suppressed anger.  I struggle to stand, while Liicha looks on with an expression halfway between weariness and pity. The night will be long still, and I will need to log in again.  This is so different from my previous line of work. The public nets were infinitely more vast—the tactical systems feel constricted by comparison, walls closing in around me just like the steel and reinforced plastic of the transporter encases me. I am captive, mind and body. And we shall soar, hand in hand . . .  Liicha straps me into my berth, his motions quick, firm, precise. He genuinely likes me. He feels sorry for me, and he shows it just as much as necessary; it is his job to take care of me and make sure I am a smoothly functioning component in the machine.  Combat control is mostly just computation and awareness, not raw magical power. Unchallenging, uninteresting. I’m also not particularly good at it, but not bad either, and that’s all that counts when the other controllers’ minds are slowly winking out.  Is the virus already in my bloodstream? Has Doctor Darankau passed it on, unknowingly, unwillingly? I fight a wave of paranoia.  I must have grimaced, because Liicha whispers to me softly, puts a hand on my forehead. He is not magical in any sense, and we do not share our thoughts using technological means either. He is just attuned to me, after weeks upon months upon years in this rolling coffin.  He connects cables and tubes, clicks clasps, tightens straps. Everything holds. I start the log-in process, and the power rushing through me is more like an unwelcome jolt rather than the sweeping tidal force of the public nets. I always wanted to be a librarian, I think, but then I am dropped in the middle of a combat situation and all extraneous thought is swept away.  Drones, turrets, automated, semi-autonomous, if-it-were-autonomous-it-wouldn’t-need-me-really. The enemy is a mass of statistics, an algebra of flesh and blood. They have humans too, not in large measure, but someone needs to control the process. And as my neighbors in the net waver and fade, we are losing, and the Graycoats are winning.  I run projections in the back of my mind, extrapolate the losses, and I know we will keep on fighting until just a few of our cells can hang on to dear life, but I also know there is no hope against this slow but steady attrition.  Enfilade—defilade—I weave drones through enemy formations, twist and turn. Murder and kill, though I struggle not to think of it that way, and I will only think of it that way later, back safely in my own sensorium, staring at the inside of the armor plating and the assorted medico-technological clutter Liicha leaves around the transporter, ties down into place in the oddest locations.  “This is not what magic is supposed to be for,” I mutter to him, feeling hollowed out by the logout process, alone in my mind again.  “Magic is for protecting your people,” he whispers back, and I notice he doesn’t say the people.  “Who are my people?” I ask him. I am a librarian. Who are my people?  “I am your people,” he says, and this gets me, this merciless feeling that hooks into all my drives to do what needs to be done, to do what I’ve been built to do, a machine of ragged and worn-down flesh.  I am a librarian, but some of the skills necessary to manage the public nets translate all too readily to control combat, and for the first time in my life, I find myself wondering about my training. Wondering about Aman Thien, first and foremost; their voice that accompanies me wherever I go.  Aman Thien was always calm and collected, their gaze sharp, their voice level. They trained me, back when we were all telling ourselves we were civilians. I loved the public nets, the giant swirls and eddies of information and consciousness. I knew that far off, beyond the far reaches, there were even greater nets, planetary nets, vast systems merging magic and technology—but I also knew I would never go there. The Old Empire had scattered the galaxy with humanoid creatures, but then it collapsed, and our ancestors were stranded on our planet without a convenient jump point back to Imperial space. I could feel those towering structures of light in the far, far distance—but they were beyond our reach. Too far, in regions too different. Solar radiation sometimes influences magic in the most inconvenient ways.  When I told Aman Thien about the luminous towers, they nodded, looked away, into the distance—and for the first time, I saw something other than the crisp clarity of focused action on their angular face. They were also neuroatypical, but in a different way, even more bound to their place by duty and obligation. At this point, what bound me had been mostly invisible, and I could still tell myself I was acting of my own volition.  Thinking of Aman Thien held me together even at miserable times like this, when I was chewing inedible rations and hiding in the giant rolling coffin of the transporter, huddled together with Liicha in the cold.  I shake my head to clear it out of the reverie of sleeplessness, micro-sleep segments breaking up overlong stretches of the wakeful state. I swallow, reach for my canteen filled with stale water.  “What do you think,” I begin, beyond caring for surveillance, speaking straight at Liicha, “how could I have joined to maintain the public nets of my own free will, when there was so little else I could’ve done?”  He peers sideways at me, too tired to be scandalized. “What do you mean?” he finally offers, and I’m not sure he’s understood a word of what I’ve just said.  I grimace and look away, avoiding his gaze. There is little else to look at. “I have such an excess of magic, always had. What could I have done with it? It was burning me up alive.”  I actually remember little of what happened before I walked into the center to sign up. Life fades into dream fades into incoherence. But Liicha doesn’t need to know that, he pities me enough as it is.  He murmurs something about choices and sacrifice, the people and solidarity. Not “your people,” not this time. Then he swears, his neck craning abruptly, looking at an invisible readout. I jump up—did they catch us out? Did someone hear?  But the disruption does not come from an overeager censor; it comes from an incoming missile, hitting the transporter, filling my field of view with white-hot pain, and for a moment, all I can feel is the finality of relief.  “ . . . waste of effort.”  Words floating past.  My chest feels crushed. My legs—I don’t feel my legs. There is a wall of pain, edging into something the nervous system can’t quite assimilate. I don’t know what I’m feeling.  “Orders, orders. They say you scrape, you scrape.”  “ . . . think there is anything left here to scrape?”  I try to open my eyes, can’t quite see. I shouldn’t be as calm as I am.  “They say if we find the head, we bring the head . . . they only need the head.”  My right arm is pinned under something. I try to move my left arm, try to reconstruct the contours of my body. I touch sharp objects.  Then there is a giant wrenching, as steel is bent further out of shape, away from me. There is light, and an abrupt stream of cussing. Then nothing, at all.  The hospital is all too bright, all too white, too well-lit. But it is silent, and calm.  I am resting. It is, by all means and measures, over. My part in the war is done.  They are fitting me with new legs, my original ones severed cleanly by a bulkhead that fell on me, which also kept me from bleeding out. They have already fit me with a right arm, and I practice, try to get the nerves to adjust. I raise my arm, point with my index finger at a target, point, point, point again. The hard plastic of the target makes a tock-tock-tocking sound as the soft plastic of my index finger hits it. My arm isn’t covered with skin replica yet, but I have full sensation, and my brain readily accepts the arm as its own, robotic as it looks in slate-gray, its forms airbrushed to softness. I am better and better at pointing, and at a variety of other fine-motor tasks.  I wish I could see Aman Thien or Liicha. I periodically ask for them, but the hospital people know nothing; aren’t allowed to pass on anything.  I would like new legs, but it is taking long. I don’t know if it’s the narcotics or the fact that I escaped from hell, but I am not impatient. Tock-tock-tock; I work my way through the most mind-numbing physical therapy exercises with a divine tranquility.  It doesn’t last.  My visitor, a tall, broad-chested, dark-skinned man, is wearing a spotless dress uniform showing high rank; all too high to have anything to do with me.  “We are taking the patient,” he informs the bedside nurse, who starts to protest before he is quickly overruled. The two men glare at each other. The military always wins. Our military always wins. As if.  “For the war effort,” my visitor says, ignoring me. I drop my right hand into my lap, and it hits harder than I would’ve liked it to; I wince.  The nurse starts another round of protest. He is a tall, brusque man not used to resistance. My visitor yanks the sheet covering my lower body, then steps back, stricken by the sight of my unfinished legs, not fully attached, tubes of various materials snaking in and out of them. When the nurse refuses to disconnect the tubes, the military man sets to the task himself, working step by step with practiced expertise; then he lifts me up and cradles me in his arms, the unfinished legs dangling at an impossible angle, not quite part of my body—and he carries me outside, into the bitterly cold nighttime air.  I don’t know if I can call her a nurse. The person on duty is a young woman in angry combat fatigues. She hooks my port up to a line, administers more GS-10, and an extra dose of VPR-56, designed to enhance neuroplasticity, allow the brain to more readily rewire itself. I never got this much of it, not even in the hospital where they were trying to get me to adjust to my new limbs.  I point it out. She outright ignores me at first, then grudgingly says, “Orders from higher up. We will need you online most of your waking hours. You’ll need to adjust.”  Waking hours blur into more waking hours. Do I sleep? I order troops around, larger and larger clusters of them, command entire armies on the behest of the chiefs of staff conveying their wishes to me.  My body is outside somewhere, in some kind of bed that seems specially designed for the purpose. I don’t know if I’m supposed to be aware of it. My orders arrive electronically, from my first-time visitor, and it is up to me how I implement them in detail. Outside, my body is handled with precision, but in an entirely inhuman fashion, like an imperfect, fragile object. Never a simple caring gesture, never an empathic touch. I deduce that I’m probably not supposed to be aware of my body.  My visitor is the only one who seems to understand this.  Sometimes he disconnects me before sleep, heaves me into a wheelchair, rolls me outside. He whispers a song between his teeth. And we shall soar, to the stars above, to the space beyond . . .  He never talks to me.  Eventually I am the only one left. There are no replacements.  I am in a room with the chiefs of staff. There’s five of them, I think, and my visitor, who seems to be in charge of me.  There is a pale-skinned, thin woman, one of the five, who makes remarks about my appearance. My visitor doesn’t stand up to her; he says nothing, but he grips the handles on my wheelchair with renewed force, and I can feel the sudden jerky motion throughout my body.  I know I am not supposed to hear these remarks. I know nothing about my appearance. Through her comments, I understand my mouth is slightly open, drool snaking out. I can’t close my mouth; I have no command of my body. Only the armies outside. And eventually, not even that, for there are no more armies, no more combat drones, there is nothing left.  After a while, I am back in a hospital; a different hospital, far beyond the front lines.  I understand the nation has capitulated. Unconditional surrender.  I cannot cry; I have no control of my face.  They stop giving me the drugs, and I don’t miss the GS-10. But without the VPR-56, my brain is stuck in this new configuration, unable to readjust to the new set of sensory input, unable to compensate for the lack of information from the tactical and strategic systems. I can’t find my way back to my body, and I can’t explain—I can’t explain that if only they continued giving me the VPR-56, my nervous system would eventually find a new balance. Without the additional plasticity, the hurdle is simply too high for my body to jump.  So I cannot speak, can barely move, while obedient nurses and orderlies drag me around, civilians everywhere. They know nothing about what they did to us in the military, and the people who know seem to have forgotten about me. These civilians are sad, pitying even. They make remarks I am not supposed to hear. They feel sorry for me.  What little resources I have, inside my head, are dedicated to finding a way out. Building tactical maps from scraps of information: conversations between the staff, the way sound echoes in corridors, the way people give directions to visitors. Preparing for the day when I can escape—wheel my way to the roof, unprotected, no forcefield. Preparing for the day when I can gather all my remaining strength and jump.  There is another continuity, another set of memories, and I don’t know which is more correct.  In this one I am in a military hospital again; that much never changes. They scrape me together again. But in this one, they gave up on the command network, they gave up on everything beyond raw power, a long time ago.  In this continuity, I am a supernova.  Barely moving, unable to stand, I am loaded into small, nimble transporters darting through battlefields. Transporters that open to the night sky above. We shall reach beyond the veil of night, to our final destination . . .  I hear Liicha’s voice, his singing, but I can’t see him. I am chained to my berth. The world expresses itself only in the passive voice.  I am dragged to my feet; I waver, but I am held in a firm grip. It is not Liicha; he is not here, except in my thoughts. I am sure he died in the explosion. Or was that a different continuity? What happened to my legs?  Most regulatory processes of my body can be overridden externally. I was being trained to—the public networks—I was a civilian, or was I? It all seems so impossible. They installed those systems in me to help me manage my power, to impose an external balance when an internal one couldn’t suffice—but now they impose an altogether different pattern.  Why can’t they let me talk to Aman Thien? Someone snarls Aman Thien was a traitor, then the override kicks in, and the same raw power that was supposed to undergird the networks rushes through my spine, exits the cabin in a giant burst of magic tearing up the skies.  And again. And again. This is the extent of my usefulness to the military, this is my service, my contribution. I explode, I explode, I explode.  Aman Thien explained the process of connecting to the public networks. They said, we need constant high throughput—the power can go on the upswing of an exponential, but eventually a limiting factor will be hit; and the goal is to approximate the logistic curve, asymptoting at a high level, approaching a horizontal line.  I lose vocabulary even in my thoughts. I can only imagine the graphs, hold on to them.  Here I am all exponential, and after I hit the limiting factor, I crash hard, body sagging against restraints, mind spinning away into unconsciousness.  The two continuities are exclusionary; both cannot be true at the same time, and yet they are. I am drained dry, of resources, of life, just in different aspects. Back in civilian life, I could do both—process data, provide power. What is needed this time is always something different. Technology versus magic.  After months—years?—of painstaking effort, I can get into my wheelchair unassisted. And after all that time, I roll myself toward the elevator, outside to the roof: flat and pebble-grained and only encircled by a slight, low railing.  I try to lever myself across it, fail and slump against the bottom of the railing on my first try.  I remain there for a long time, too exhausted to weep. But then I sense the approach, the commotion below. People looking for me. Visitors? The new-formed, reformed military?  Some things never change.  With renewed strength, I pull myself up with my arms, my useless legs flopping. I hoist myself over the fence, then tumble down on the other side.  I fall, fall for what seems like millennia.  I reconceptualize my direction: not falling downward, but falling upward, skyward, to the eternal darkness that is not death, but liberation. Toward the luminous towers thought to be forever beyond reach. Against the grain of the universe, the inevitable law that human must strike against human, bodies must grind each other down until only the tiniest specks of pain are all that is left. Against the notion that ever more advanced forms of magic and technology can only be used to wage war.  Against existence, my existence, my lack of place in this reality; toward a reality assumed to be unreachable simply because there wasn’t thought to be enough desperation in our world to fuel a jump.  I am streaming skyward while people scatter and rush looking for me below, and I know that once I am gone, I will be—like the luminous towers—forever beyond their reach. Bogi Takács is a Hungarian Jewish agender trans person (e/em/eir/emself or they pronouns) and a resident alien in the US. E is a winner of the Lambda award for editing Transcendent 2: The Year's Best Transgender Speculative Fiction, and a finalist for the Hugo and Locus awards. Eir debut poetry collection Algorithmic Shapeshifting is out now from Aqueduct, and eir debut short story collection The Trans Space Octopus Congregation was published in Fall 2019 by Lethe Press. You can find Bogi on various social media as bogiperson.", "text": "3900 words, short story\nToward the Luminous Towers\nLiicha is singing an old song, his wheedly tenor not a match for the lush contralto of the original recording. And we shall soar, hand in hand, through the night sky . . . His voice grinds against the walls of the transporter, creates unwelcome resonances and echoes. Invisible fingernails scratching steel.\nLiicha is a kind person, the best I could hope for in a comrade-in-arms, but I can’t bear to listen to this. “Would you cut it out already?” I am snappy, aggravated, out of my element. He is a soldier—but I am a conscript.\n“Awww.” He stands up, stretches his pale, thick arms. “Is it time for the GS-10?”\nHe is right, and I am resentful. Was it my behavior? Something in my tone of voice?\nHe throws me the ampoule and I pull up the sleeve of my uniform, feed the ampoule into the port at the bend of my elbow. So many drugs—but this one is just to keep me awake, push me through the utter exhaustion brought on by sleepless days after sleepless nights.\nThe mechanism hisses softly. I remove the ampoule, lean back in my chair, close my eyes. Soon it will be time to log in again, my turn again, because the war machine will never come to a halt. But first, the prescheduled meeting with Doctor Darankau. Where is she already?\nA tapping outside, unsteady hands fussing with the door. Liicha unlocks the latch, lets the doctor in. She grimaces and brushes hands against her face—her dark skin is stained with something lighter that looks like ash, underlining the folds and wrinkles of age.\nLiicha makes a drink, something sweet-smelling produced by his fungal container. Doctor Darankau accepts it, drains the small cup in a single gulp. We murmur greetings, make small talk.\n“Your schedule will be bumped up,” she says. “They will probably only tell you at the very last minute, but I thought you would want to know.”\nI lean forward. The muscles in my abdomen clench. How could I have an even tighter schedule? I am living on GS-10 and Liicha’s concoctions.\n“What’s going on?” I whisper. I don’t expect her to divulge classified information, but I know she probably will, otherwise she wouldn’t have brought up the topic. Liicha also leans closer.\nDoctor Darankau does not lower her voice. “The Graycoats are using some kind of targeted bioweapon, likely retroviral. Biotech is trying to reverse-engineer it, but so far without success. It targets combat controllers. People are dropping out at an alarming rate, incapacitated, dead. Soon we will have no one left to guide the army.”\nI feel deflated. If I die, then I won’t have to live in this endless, paradoxical tension-boredom-exhaustion state any longer. But my purpose here . . .\nDoctor Darankau interrupts my thoughts. “Frankly, you are the only controller in my service area who’s not showing symptoms already.”\nI didn’t know that, but it makes perfect sense: I’ve noticed people slow down, respond sluggishly, ping decreasing all over the network. I frown. “You think I might be immune? Because of my custom setup?”\nShe rolls the empty cup around between her palms. “Probably yes. I have been wondering if it’s because you’re neuroatypical in just the right way for the targeting to pass you by. You don’t trigger the pattern matching.”\n“So they want me to work even harder, until my brain turns into mush anyway.” I shrug. “For the people, for victory.” It comes out even more cynical than intended. I genuinely want to serve. I genuinely want to protect. But I also deeply, desperately want to get out of this place, just one step behind the front lines, within tactical control range for every single piece of crap passing as military equipment.\nDoctor Darankau mutters something that can be interpreted as affirmative or as noncommittal, then cautiously says goodbye. The hatch clanks shut after her, and I put my back against a bulkhead, slide slowly to the floor. This war, I hate it all, and for a moment, I just let myself feel that rage before I push it down, below conscious awareness. If I were to give in, my own magic might teleport me out of harm’s way; an uncontrolled, spontaneous action, but one that would qualify as desertion nonetheless. I know someone who vanished one day, only to reappear in the hinterlands, and I don’t want to end up like her; she’d escaped only to be executed. If I can’t control my fury, it needs to go. And no one can control teleportation jumps, really. Our wars would look very different if we could. My muscles tighten with all the suppressed anger.\nI struggle to stand, while Liicha looks on with an expression halfway between weariness and pity. The night will be long still, and I will need to log in again.\nThis is so different from my previous line of work. The public nets were infinitely more vast—the tactical systems feel constricted by comparison, walls closing in around me just like the steel and reinforced plastic of the transporter encases me. I am captive, mind and body. And we shall soar, hand in hand . . .\nLiicha straps me into my berth, his motions quick, firm, precise. He genuinely likes me. He feels sorry for me, and he shows it just as much as necessary; it is his job to take care of me and make sure I am a smoothly functioning component in the machine.\nCombat control is mostly just computation and awareness, not raw magical power. Unchallenging, uninteresting. I’m also not particularly good at it, but not bad either, and that’s all that counts when the other controllers’ minds are slowly winking out.\nIs the virus already in my bloodstream? Has Doctor Darankau passed it on, unknowingly, unwillingly? I fight a wave of paranoia.\nI must have grimaced, because Liicha whispers to me softly, puts a hand on my forehead. He is not magical in any sense, and we do not share our thoughts using technological means either. He is just attuned to me, after weeks upon months upon years in this rolling coffin.\nHe connects cables and tubes, clicks clasps, tightens straps. Everything holds. I start the log-in process, and the power rushing through me is more like an unwelcome jolt rather than the sweeping tidal force of the public nets. I always wanted to be a librarian, I think, but then I am dropped in the middle of a combat situation and all extraneous thought is swept away.\nDrones, turrets, automated, semi-autonomous, if-it-were-autonomous-it-wouldn’t-need-me-really. The enemy is a mass of statistics, an algebra of flesh and blood. They have humans too, not in large measure, but someone needs to control the process. And as my neighbors in the net waver and fade, we are losing, and the Graycoats are winning.\nI run projections in the back of my mind, extrapolate the losses, and I know we will keep on fighting until just a few of our cells can hang on to dear life, but I also know there is no hope against this slow but steady attrition.\nEnfilade—defilade—I weave drones through enemy formations, twist and turn. Murder and kill, though I struggle not to think of it that way, and I will only think of it that way later, back safely in my own sensorium, staring at the inside of the armor plating and the assorted medico-technological clutter Liicha leaves around the transporter, ties down into place in the oddest locations.\n“This is not what magic is supposed to be for,” I mutter to him, feeling hollowed out by the logout process, alone in my mind again.\n“Magic is for protecting your people,” he whispers back, and I notice he doesn’t say the people.\n“Who are my people?” I ask him. I am a librarian. Who are my people?\n“I am your people,” he says, and this gets me, this merciless feeling that hooks into all my drives to do what needs to be done, to do what I’ve been built to do, a machine of ragged and worn-down flesh.\nI am a librarian, but some of the skills necessary to manage the public nets translate all too readily to control combat, and for the first time in my life, I find myself wondering about my training. Wondering about Aman Thien, first and foremost; their voice that accompanies me wherever I go.\nAman Thien was always calm and collected, their gaze sharp, their voice level. They trained me, back when we were all telling ourselves we were civilians. I loved the public nets, the giant swirls and eddies of information and consciousness. I knew that far off, beyond the far reaches, there were even greater nets, planetary nets, vast systems merging magic and technology—but I also knew I would never go there. The Old Empire had scattered the galaxy with humanoid creatures, but then it collapsed, and our ancestors were stranded on our planet without a convenient jump point back to Imperial space. I could feel those towering structures of light in the far, far distance—but they were beyond our reach. Too far, in regions too different. Solar radiation sometimes influences magic in the most inconvenient ways.\nWhen I told Aman Thien about the luminous towers, they nodded, looked away, into the distance—and for the first time, I saw something other than the crisp clarity of focused action on their angular face. They were also neuroatypical, but in a different way, even more bound to their place by duty and obligation. At this point, what bound me had been mostly invisible, and I could still tell myself I was acting of my own volition.\nThinking of Aman Thien held me together even at miserable times like this, when I was chewing inedible rations and hiding in the giant rolling coffin of the transporter, huddled together with Liicha in the cold.\nI shake my head to clear it out of the reverie of sleeplessness, micro-sleep segments breaking up overlong stretches of the wakeful state. I swallow, reach for my canteen filled with stale water.\n“What do you think,” I begin, beyond caring for surveillance, speaking straight at Liicha, “how could I have joined to maintain the public nets of my own free will, when there was so little else I could’ve done?”\nHe peers sideways at me, too tired to be scandalized. “What do you mean?” he finally offers, and I’m not sure he’s understood a word of what I’ve just said.\nI grimace and look away, avoiding his gaze. There is little else to look at. “I have such an excess of magic, always had. What could I have done with it? It was burning me up alive.”\nI actually remember little of what happened before I walked into the center to sign up. Life fades into dream fades into incoherence. But Liicha doesn’t need to know that, he pities me enough as it is.\nHe murmurs something about choices and sacrifice, the people and solidarity. Not “your people,” not this time. Then he swears, his neck craning abruptly, looking at an invisible readout. I jump up—did they catch us out? Did someone hear?\nBut the disruption does not come from an overeager censor; it comes from an incoming missile, hitting the transporter, filling my field of view with white-hot pain, and for a moment, all I can feel is the finality of relief.\n“ . . . waste of effort.”\nWords floating past.\nMy chest feels crushed. My legs—I don’t feel my legs. There is a wall of pain, edging into something the nervous system can’t quite assimilate. I don’t know what I’m feeling.\n“Orders, orders. They say you scrape, you scrape.”\n“ . . . think there is anything left here to scrape?”\nI try to open my eyes, can’t quite see. I shouldn’t be as calm as I am.\n“They say if we find the head, we bring the head . . . they only need the head.”\nMy right arm is pinned under something. I try to move my left arm, try to reconstruct the contours of my body. I touch sharp objects.\nThen there is a giant wrenching, as steel is bent further out of shape, away from me. There is light, and an abrupt stream of cussing. Then nothing, at all.\nThe hospital is all too bright, all too white, too well-lit. But it is silent, and calm.\nI am resting. It is, by all means and measures, over. My part in the war is done.\nThey are fitting me with new legs, my original ones severed cleanly by a bulkhead that fell on me, which also kept me from bleeding out. They have already fit me with a right arm, and I practice, try to get the nerves to adjust. I raise my arm, point with my index finger at a target, point, point, point again. The hard plastic of the target makes a tock-tock-tocking sound as the soft plastic of my index finger hits it. My arm isn’t covered with skin replica yet, but I have full sensation, and my brain readily accepts the arm as its own, robotic as it looks in slate-gray, its forms airbrushed to softness. I am better and better at pointing, and at a variety of other fine-motor tasks.\nI wish I could see Aman Thien or Liicha. I periodically ask for them, but the hospital people know nothing; aren’t allowed to pass on anything.\nI would like new legs, but it is taking long. I don’t know if it’s the narcotics or the fact that I escaped from hell, but I am not impatient. Tock-tock-tock; I work my way through the most mind-numbing physical therapy exercises with a divine tranquility.\nIt doesn’t last.\nMy visitor, a tall, broad-chested, dark-skinned man, is wearing a spotless dress uniform showing high rank; all too high to have anything to do with me.\n“We are taking the patient,” he informs the bedside nurse, who starts to protest before he is quickly overruled. The two men glare at each other. The military always wins. Our military always wins. As if.\n“For the war effort,” my visitor says, ignoring me. I drop my right hand into my lap, and it hits harder than I would’ve liked it to; I wince.\nThe nurse starts another round of protest. He is a tall, brusque man not used to resistance. My visitor yanks the sheet covering my lower body, then steps back, stricken by the sight of my unfinished legs, not fully attached, tubes of various materials snaking in and out of them. When the nurse refuses to disconnect the tubes, the military man sets to the task himself, working step by step with practiced expertise; then he lifts me up and cradles me in his arms, the unfinished legs dangling at an impossible angle, not quite part of my body—and he carries me outside, into the bitterly cold nighttime air.\nI don’t know if I can call her a nurse. The person on duty is a young woman in angry combat fatigues. She hooks my port up to a line, administers more GS-10, and an extra dose of VPR-56, designed to enhance neuroplasticity, allow the brain to more readily rewire itself. I never got this much of it, not even in the hospital where they were trying to get me to adjust to my new limbs.\nI point it out. She outright ignores me at first, then grudgingly says, “Orders from higher up. We will need you online most of your waking hours. You’ll need to adjust.”\nWaking hours blur into more waking hours. Do I sleep? I order troops around, larger and larger clusters of them, command entire armies on the behest of the chiefs of staff conveying their wishes to me.\nMy body is outside somewhere, in some kind of bed that seems specially designed for the purpose. I don’t know if I’m supposed to be aware of it. My orders arrive electronically, from my first-time visitor, and it is up to me how I implement them in detail. Outside, my body is handled with precision, but in an entirely inhuman fashion, like an imperfect, fragile object. Never a simple caring gesture, never an empathic touch. I deduce that I’m probably not supposed to be aware of my body.\nMy visitor is the only one who seems to understand this.\nSometimes he disconnects me before sleep, heaves me into a wheelchair, rolls me outside. He whispers a song between his teeth. And we shall soar, to the stars above, to the space beyond . . .\nHe never talks to me.\nEventually I am the only one left. There are no replacements.\nI am in a room with the chiefs of staff. There’s five of them, I think, and my visitor, who seems to be in charge of me.\nThere is a pale-skinned, thin woman, one of the five, who makes remarks about my appearance. My visitor doesn’t stand up to her; he says nothing, but he grips the handles on my wheelchair with renewed force, and I can feel the sudden jerky motion throughout my body.\nI know I am not supposed to hear these remarks. I know nothing about my appearance. Through her comments, I understand my mouth is slightly open, drool snaking out. I can’t close my mouth; I have no command of my body. Only the armies outside. And eventually, not even that, for there are no more armies, no more combat drones, there is nothing left.\nAfter a while, I am back in a hospital; a different hospital, far beyond the front lines.\nI understand the nation has capitulated. Unconditional surrender.\nI cannot cry; I have no control of my face.\nThey stop giving me the drugs, and I don’t miss the GS-10. But without the VPR-56, my brain is stuck in this new configuration, unable to readjust to the new set of sensory input, unable to compensate for the lack of information from the tactical and strategic systems. I can’t find my way back to my body, and I can’t explain—I can’t explain that if only they continued giving me the VPR-56, my nervous system would eventually find a new balance. Without the additional plasticity, the hurdle is simply too high for my body to jump.\nSo I cannot speak, can barely move, while obedient nurses and orderlies drag me around, civilians everywhere. They know nothing about what they did to us in the military, and the people who know seem to have forgotten about me. These civilians are sad, pitying even. They make remarks I am not supposed to hear. They feel sorry for me.\nWhat little resources I have, inside my head, are dedicated to finding a way out. Building tactical maps from scraps of information: conversations between the staff, the way sound echoes in corridors, the way people give directions to visitors. Preparing for the day when I can escape—wheel my way to the roof, unprotected, no forcefield. Preparing for the day when I can gather all my remaining strength and jump.\nThere is another continuity, another set of memories, and I don’t know which is more correct.\nIn this one I am in a military hospital again; that much never changes. They scrape me together again. But in this one, they gave up on the command network, they gave up on everything beyond raw power, a long time ago.\nIn this continuity, I am a supernova.\nBarely moving, unable to stand, I am loaded into small, nimble transporters darting through battlefields. Transporters that open to the night sky above. We shall reach beyond the veil of night, to our final destination . . .\nI hear Liicha’s voice, his singing, but I can’t see him. I am chained to my berth. The world expresses itself only in the passive voice.\nI am dragged to my feet; I waver, but I am held in a firm grip. It is not Liicha; he is not here, except in my thoughts. I am sure he died in the explosion. Or was that a different continuity? What happened to my legs?\nMost regulatory processes of my body can be overridden externally. I was being trained to—the public networks—I was a civilian, or was I? It all seems so impossible. They installed those systems in me to help me manage my power, to impose an external balance when an internal one couldn’t suffice—but now they impose an altogether different pattern.\nWhy can’t they let me talk to Aman Thien? Someone snarls Aman Thien was a traitor, then the override kicks in, and the same raw power that was supposed to undergird the networks rushes through my spine, exits the cabin in a giant burst of magic tearing up the skies.\nAnd again. And again. This is the extent of my usefulness to the military, this is my service, my contribution. I explode, I explode, I explode.\nAman Thien explained the process of connecting to the public networks. They said, we need constant high throughput—the power can go on the upswing of an exponential, but eventually a limiting factor will be hit; and the goal is to approximate the logistic curve, asymptoting at a high level, approaching a horizontal line.\nI lose vocabulary even in my thoughts. I can only imagine the graphs, hold on to them.\nHere I am all exponential, and after I hit the limiting factor, I crash hard, body sagging against restraints, mind spinning away into unconsciousness.\nThe two continuities are exclusionary; both cannot be true at the same time, and yet they are. I am drained dry, of resources, of life, just in different aspects. Back in civilian life, I could do both—process data, provide power. What is needed this time is always something different. Technology versus magic.\nAfter months—years?—of painstaking effort, I can get into my wheelchair unassisted. And after all that time, I roll myself toward the elevator, outside to the roof: flat and pebble-grained and only encircled by a slight, low railing.\nI try to lever myself across it, fail and slump against the bottom of the railing on my first try.\nI remain there for a long time, too exhausted to weep. But then I sense the approach, the commotion below. People looking for me. Visitors? The new-formed, reformed military?\nSome things never change.\nWith renewed strength, I pull myself up with my arms, my useless legs flopping. I hoist myself over the fence, then tumble down on the other side.\nI fall, fall for what seems like millennia.\nI reconceptualize my direction: not falling downward, but falling upward, skyward, to the eternal darkness that is not death, but liberation. Toward the luminous towers thought to be forever beyond reach. Against the grain of the universe, the inevitable law that human must strike against human, bodies must grind each other down until only the tiniest specks of pain are all that is left. Against the notion that ever more advanced forms of magic and technology can only be used to wage war.\nAgainst existence, my existence, my lack of place in this reality; toward a reality assumed to be unreachable simply because there wasn’t thought to be enough desperation in our world to fuel a jump.\nI am streaming skyward while people scatter and rush looking for me below, and I know that once I am gone, I will be—like the luminous towers—forever beyond their reach.\nBogi Takács is a Hungarian Jewish agender trans person (e/em/eir/emself or they pronouns) and a resident alien in the US. E is a winner of the Lambda award for editing Transcendent 2: The Year's Best Transgender Speculative Fiction, and a finalist for the Hugo and Locus awards. Eir debut poetry collection Algorithmic Shapeshifting is out now from Aqueduct, and eir debut short story collection The Trans Space Octopus Congregation was published in Fall 2019 by Lethe Press. You can find Bogi on various social media as bogiperson.", "source": "https://clarkesworldmagazine.com/takacs_09_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Toward the Luminous Towers by Bogi Takács"}