{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert N Lee", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "hL4FhI/rpx8gGWCVwnMpmMebotI=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  The Most Important Genre Novel You'll Never Read  Focus on the Family released a science fiction propaganda story the week before the recent elections, the ersatz letter from “A Christian from 2012” predicting dire consequences from four years of President Barack Obama. The story became one of those pieces of conservative political kitsch progressives like to gab about, so I saw it written up a few times in email and blogs, on boards, in a few articles. I did not see any reflection of my own first response: “Is Focus on the Family aware that this reads an awful lot like The Turner Diaries?”   “When did this all start? Christians share a lot of the blame. In 2008, many evangelicals thought Senator Obama was an opportunity for a “change,” and they voted for him . . . the record was all there for anyone to see. The agenda of the ACLU, the agenda of liberal activist judges in their dissenting opinions, the agenda of the homosexual activists, the agenda of the environmental activists, the agenda of the National Education Association, the agenda of the global-warming activists, the agenda of the abortion-rights activists, the agenda of the gun-control activists, the agenda of the euthanasia supporters, the agenda of the one-world government pacifists, the agenda of far-Left groups in Canada and Europe—all of these agendas were there in plain sight, and all of these groups provided huge support for Senator Obama . . . but too many people just didn’t want to see it.”  —“Letter from 2012 in Obama’s America,” Focus on the Family, 2008  “All in all, it has been depressingly easy for the System to deceive and manipulate the American people-whether the relatively naïve “conservatives” or the spoiled and pseudo-sophisticated “liberals” . . . we have allowed a diabolically clever, alien minority to put chains on our souls and our minds . . . why didn’t we rebel 35 years ago, when they took our schools away from us and began converting them into racially mixed jungles? Why didn’t we throw them all out of the country 50 years ago, instead of letting them use us as cannon fodder in their war to subjugate Europe?  “More to the point, why didn’t we rise up three years ago, when they started taking our guns away? Why didn’t we rise up in righteous fury and drag these arrogant aliens into the streets and cut their throats then?”  —The Turner Diaries, William Pierce (as “Andrew Macdonald”), 1978  I didn’t expect to see the comparison; effective juxtaposition wants knowledge of both items, after all. I know geeks who read extreme social material—political or religious—geeks who read idiosyncratic outsider work, lots and lots of geeks who read genre fiction. I know only a small handful aside from myself willing to brave Turner’s nexus of all three. Most people do not respond to the notoriously racist novel that inspired the Oklahoma City bombing with “I have to read that.”  The novel has a certain late utility as cultural shorthand, but reading the thing is apparently regarded as a path best left unexplored for those of sound mind and moral compass. For those leftward, especially, the map will suffice. This is a shame, as a depressingly high number of racists around the world do buy and read the book regularly. The late author, William Pierce, moved two hundred thousand copies of his self-published book through gun show hand sales and mail order before mass murder finally landed him a publisher, and sales have more than doubled in the decade or so since. The book is banned by nearly every nation on the planet that bans books, but still read by all the wrong people.  A confession: I am a flaming left-leaning liberal, myself, but I will read or see anything apocalyptic with a conservative social bent, the crazier the better. I have read every single American Christian novel ever published following the apocalyptic script lately given popular expression in the Left Behind series. I had to read The Turner Diaries.  Some might take offense at my categorizing Christian apocalyptic fiction and Turner together. The comparison is not made lightly, is all I can say, and there are obvious connections between the base narratives that only emerge in reading both. There is one key distinction: William Pierce was not a Christian. Whether he consciously patterned the novel after the late Christian apocalyptic script is debatable, but he spent much of his time and energy arguing with other prominent white racists about Christian identity issues. He certainly had access to that storyline, which had its greatest success prior to the nineties Left Behind boom in Christian fiction and pulpits during the seventies, when he wrote and first published Turner.  Intentional or not, parallels between Pierce’s novel and modern Christian apocalyptic fiction are striking. Turner, like all “rapture” fiction, begins with the recasting of a real-world privileged majority (white people in Turner Diaries, Christians in rapture fiction) as an oppressed minority persecuted under a progressive-left dictatorship, and the similarities just pile on up from there. The liberal regime in both wears an egalitarian face to disguise its only real purpose: destroying the fictional minority. To this end, the regime institutes a mandatory identification scheme that excludes the minority. Society worldwide collapses into cannibalism, Satanism and variety of alarming sexual practices. (Yes, “Satanism.” Pierce wasn’t a Christian, but he was religious. Try and guess his favorite neo-pagan pantheon.) A long period of underground action follows a series of opening tragedies, ending implausibly with a victory for the minority—the greatest military victory in history, as a matter of fact. The planet is purged in blood and fire of anybody standing in the way of paradise and the persecuted minority inherits the Earth.  The Christian version leaves the means of its final solution to supernatural agency, leaving its post-rapture believer characters with little to do but hide and avoid martyrdom. Christ will be along presently to wipe every tear and scour the planet of anybody who isn’t the right sort of religious with a series of natural disasters capped by a final global bloodbath. Pierce’s persecuted white racists spend their time under the liberal lash making ready to unleash Armageddon themselves. Lacking power to wield plagues and storms, they must be content in the end with “sterilizing” all of Asia and Africa using too-real nightmare weaponry.  The Turner Diaries is the only book of this sort I encourage others to read, a recommendation nearly as regularly declined, which is frustrating. I revel in the obscurity of my fascinations like any other nerd, and don’t mind being the guy who knows more than anybody else in the room about Jack Chick or Salem Kirban. Really, nobody needs to read all the Left Behind novels. They’re the Christian equivalent of something like Goosebumps, at best.  This is something else, though, a book whose dark pleasures you can’t experience vicariously. Second and third hand accounts and abstracts are not enough. It’s even essential reading in the sense of that word genre fans use to describe more obvious works of significance. It’s essential, too, in a manner none of those books can match: Turner is literally capable of ending worlds.  And yes, I said “pleasures.” I don’t spend time reading and energy on books like this because I take no joy from the experience. Horror being my lifelong favorite genre poison of choice, I am well acquainted with chasing terror as leisure activity. As in any other enthusiasm, the longtime horror fan tends to build up a tolerance. The more familiar genre conventions become, the more demanding you become. In the long gaps between the odd story or novel or film these days with any haunting effect on me, I take in a ton of right wing apocalyptic fiction. I do so for one reason: it scares me the way nothing has since I was seven and first discovered the ghost story books in the school library.  “Transgression” has been a buzzword in horror for a while, now, with the predictable result that the buzzword has become a subgenre with its own tiresome conventions. As a result, circa 2009, the average “transgressive” horror fiction presents roughly the same threat level as a random hour of any American teen’s unmonitored web surfing. When it’s nigh-universally-offensive horror I want, I prefer fiction expressing the fervent and real desire that the world die screaming, written by and for the people who plan to take over after all our bloody murders.  I recommend Turner because it’s poisonous. I don’t envy anyone who reads it without building up tolerance to the darker ends of genre fiction and to work written by people who hate you personally and want you dead. This book should hurt going down—if it doesn’t, you shouldn’t read it. It’s worth the pain, though, and more to the point, provides an opportunity that should hit us all hard in the center of our eternal eleven-year-olds: saving the world from evil, no shit.  This book is the Necronomicon. The Turner Diaries is bound in human skin, written in blood and contains demons—real ones, not Biblical bogeys. We’ve all witnessed the power of these monsters. This is the real deal from all those horror stories: the book of secret dark knowledge, access restricted to its devoted worshippers yet hidden in plain sight, awaiting the one who can best harness or defeat its pure evil.  SPOILERS: This real life hero’s trial ends with another genre cliché. The emperor has no clothes, the curtain drops and a desperate carnie is working the wizard with levers. You finally open The King in Yellow and discover it’s a high school freshman Satanist’s journal, complete with spelling errors and ballpoint scribbling of Slipknot’s logo. If you’ve read enough fan or vanity fiction, or a pile of fiction submissions, you’ve read Turner before. No consistency of tone, description flops back and forth between lifeless infodumps and breathless fountains of banalities, punctuated by moments of grotesque action, dialogue misses chances to reflect reality and create poetry, both, and tends toward the preachy. Etc.  And yet Turner still has a compelling dramatic power difficult to communicate to the uninitiated. We are talking, after all, about a science fiction novel full of notes to future readers like this one:   “Note to the reader: Uganda was a political subdivision of the continent of Africa during the Old Era, when that continent was inhabited by the Negro race. Puerto Rico was the Old Era name of the island of New Carolina. It is occupied now by the descendants of White refugees from radioactive areas of the southeastern United States, but before the race purges in the final days of the Great Revolution it was inhabited by a mongrel race of especially unsavory character.”  An entire awful world is drawn in that one footnote, and if the details of Turner’s worldbuilding are inept in execution, this is more than made up for by sheer passion. This is a novel whose narrator constantly soul-searches on the question “When is it right to brutalize or murder a white girl?” It revels in loving passages given to a mortar attack on the US Capitol and the intentional destruction of a nuclear plant to burn Chicago off the map. It finally finds its truest voice in a long midsection concerning the ethnic cleansing of southern California. Turner, in other words, is a direct window into madness. I don’t know about you, but that’s why I read and watch horror.  Here is the pleasure I take from this kind of reading: it’s profoundly disturbing in consumption, easily shaken off after and yet builds mental and emotional muscles in the long run. These are books decrying the death of civilization and culture, written by people who don’t know how to write for audiences that can barely read. You can laugh at Turner once you’ve read it, and hard, and this part of fantasy stories is also true: demons are prideful, and shrivel up and die in the face of laughter. Reading renders the mystery pathetic and silly, and the more good people read, understand and mock, the harder the legend gets owned.  You are far too good for the likes of The Turner Diaries, but you can’t know that for sure until you know it for sure. Don’t take my word for it, please. I’m tired of being the only geek I know who makes good Turner Diaries jokes.  NOTE: Buying a copy of The Turner Diaries may raise practical concerns: curiosity about the book is one thing, giving funds to a racist publisher and the estate of a racist author is another. Further, many readers likely live in countries banning the novel. Luckily, the devoted proselytizing efforts of racists provide a solution: the full text of the novel is available online in multiple languages. Robert N. Lee spent the beginning of his life in Vietnam, grew up all over the US, and now lives in Florida with the love of his life in a house full of pets named after Beverly Cleary characters. He works in technology design and marketing as well as publishing occasional fiction and non-fiction, and can be found online at his blog.", "text": "Non-Fiction\nThe Most Important Genre Novel You'll Never Read\nFocus on the Family released a science fiction propaganda story the week before the recent elections, the ersatz letter from “A Christian from 2012” predicting dire consequences from four years of President Barack Obama. The story became one of those pieces of conservative political kitsch progressives like to gab about, so I saw it written up a few times in email and blogs, on boards, in a few articles. I did not see any reflection of my own first response: “Is Focus on the Family aware that this reads an awful lot like The Turner Diaries?”\n“When did this all start? Christians share a lot of the blame. In 2008, many evangelicals thought Senator Obama was an opportunity for a “change,” and they voted for him . . . the record was all there for anyone to see. The agenda of the ACLU, the agenda of liberal activist judges in their dissenting opinions, the agenda of the homosexual activists, the agenda of the environmental activists, the agenda of the National Education Association, the agenda of the global-warming activists, the agenda of the abortion-rights activists, the agenda of the gun-control activists, the agenda of the euthanasia supporters, the agenda of the one-world government pacifists, the agenda of far-Left groups in Canada and Europe—all of these agendas were there in plain sight, and all of these groups provided huge support for Senator Obama . . . but too many people just didn’t want to see it.”\n—“Letter from 2012 in Obama’s America,” Focus on the Family, 2008\n“All in all, it has been depressingly easy for the System to deceive and manipulate the American people-whether the relatively naïve “conservatives” or the spoiled and pseudo-sophisticated “liberals” . . . we have allowed a diabolically clever, alien minority to put chains on our souls and our minds . . . why didn’t we rebel 35 years ago, when they took our schools away from us and began converting them into racially mixed jungles? Why didn’t we throw them all out of the country 50 years ago, instead of letting them use us as cannon fodder in their war to subjugate Europe?\n“More to the point, why didn’t we rise up three years ago, when they started taking our guns away? Why didn’t we rise up in righteous fury and drag these arrogant aliens into the streets and cut their throats then?”\n—The Turner Diaries, William Pierce (as “Andrew Macdonald”), 1978\nI didn’t expect to see the comparison; effective juxtaposition wants knowledge of both items, after all. I know geeks who read extreme social material—political or religious—geeks who read idiosyncratic outsider work, lots and lots of geeks who read genre fiction. I know only a small handful aside from myself willing to brave Turner’s nexus of all three. Most people do not respond to the notoriously racist novel that inspired the Oklahoma City bombing with “I have to read that.”\nThe novel has a certain late utility as cultural shorthand, but reading the thing is apparently regarded as a path best left unexplored for those of sound mind and moral compass. For those leftward, especially, the map will suffice. This is a shame, as a depressingly high number of racists around the world do buy and read the book regularly. The late author, William Pierce, moved two hundred thousand copies of his self-published book through gun show hand sales and mail order before mass murder finally landed him a publisher, and sales have more than doubled in the decade or so since. The book is banned by nearly every nation on the planet that bans books, but still read by all the wrong people.\nA confession: I am a flaming left-leaning liberal, myself, but I will read or see anything apocalyptic with a conservative social bent, the crazier the better. I have read every single American Christian novel ever published following the apocalyptic script lately given popular expression in the Left Behind series. I had to read The Turner Diaries.\nSome might take offense at my categorizing Christian apocalyptic fiction and Turner together. The comparison is not made lightly, is all I can say, and there are obvious connections between the base narratives that only emerge in reading both. There is one key distinction: William Pierce was not a Christian. Whether he consciously patterned the novel after the late Christian apocalyptic script is debatable, but he spent much of his time and energy arguing with other prominent white racists about Christian identity issues. He certainly had access to that storyline, which had its greatest success prior to the nineties Left Behind boom in Christian fiction and pulpits during the seventies, when he wrote and first published Turner.\nIntentional or not, parallels between Pierce’s novel and modern Christian apocalyptic fiction are striking. Turner, like all “rapture” fiction, begins with the recasting of a real-world privileged majority (white people in Turner Diaries, Christians in rapture fiction) as an oppressed minority persecuted under a progressive-left dictatorship, and the similarities just pile on up from there. The liberal regime in both wears an egalitarian face to disguise its only real purpose: destroying the fictional minority. To this end, the regime institutes a mandatory identification scheme that excludes the minority. Society worldwide collapses into cannibalism, Satanism and variety of alarming sexual practices. (Yes, “Satanism.” Pierce wasn’t a Christian, but he was religious. Try and guess his favorite neo-pagan pantheon.) A long period of underground action follows a series of opening tragedies, ending implausibly with a victory for the minority—the greatest military victory in history, as a matter of fact. The planet is purged in blood and fire of anybody standing in the way of paradise and the persecuted minority inherits the Earth.\nThe Christian version leaves the means of its final solution to supernatural agency, leaving its post-rapture believer characters with little to do but hide and avoid martyrdom. Christ will be along presently to wipe every tear and scour the planet of anybody who isn’t the right sort of religious with a series of natural disasters capped by a final global bloodbath. Pierce’s persecuted white racists spend their time under the liberal lash making ready to unleash Armageddon themselves. Lacking power to wield plagues and storms, they must be content in the end with “sterilizing” all of Asia and Africa using too-real nightmare weaponry.\nThe Turner Diaries is the only book of this sort I encourage others to read, a recommendation nearly as regularly declined, which is frustrating. I revel in the obscurity of my fascinations like any other nerd, and don’t mind being the guy who knows more than anybody else in the room about Jack Chick or Salem Kirban. Really, nobody needs to read all the Left Behind novels. They’re the Christian equivalent of something like Goosebumps, at best.\nThis is something else, though, a book whose dark pleasures you can’t experience vicariously. Second and third hand accounts and abstracts are not enough. It’s even essential reading in the sense of that word genre fans use to describe more obvious works of significance. It’s essential, too, in a manner none of those books can match: Turner is literally capable of ending worlds.\nAnd yes, I said “pleasures.” I don’t spend time reading and energy on books like this because I take no joy from the experience. Horror being my lifelong favorite genre poison of choice, I am well acquainted with chasing terror as leisure activity. As in any other enthusiasm, the longtime horror fan tends to build up a tolerance. The more familiar genre conventions become, the more demanding you become. In the long gaps between the odd story or novel or film these days with any haunting effect on me, I take in a ton of right wing apocalyptic fiction. I do so for one reason: it scares me the way nothing has since I was seven and first discovered the ghost story books in the school library.\n“Transgression” has been a buzzword in horror for a while, now, with the predictable result that the buzzword has become a subgenre with its own tiresome conventions. As a result, circa 2009, the average “transgressive” horror fiction presents roughly the same threat level as a random hour of any American teen’s unmonitored web surfing. When it’s nigh-universally-offensive horror I want, I prefer fiction expressing the fervent and real desire that the world die screaming, written by and for the people who plan to take over after all our bloody murders.\nI recommend Turner because it’s poisonous. I don’t envy anyone who reads it without building up tolerance to the darker ends of genre fiction and to work written by people who hate you personally and want you dead. This book should hurt going down—if it doesn’t, you shouldn’t read it. It’s worth the pain, though, and more to the point, provides an opportunity that should hit us all hard in the center of our eternal eleven-year-olds: saving the world from evil, no shit.\nThis book is the Necronomicon. The Turner Diaries is bound in human skin, written in blood and contains demons—real ones, not Biblical bogeys. We’ve all witnessed the power of these monsters. This is the real deal from all those horror stories: the book of secret dark knowledge, access restricted to its devoted worshippers yet hidden in plain sight, awaiting the one who can best harness or defeat its pure evil.\nSPOILERS: This real life hero’s trial ends with another genre cliché. The emperor has no clothes, the curtain drops and a desperate carnie is working the wizard with levers. You finally open The King in Yellow and discover it’s a high school freshman Satanist’s journal, complete with spelling errors and ballpoint scribbling of Slipknot’s logo. If you’ve read enough fan or vanity fiction, or a pile of fiction submissions, you’ve read Turner before. No consistency of tone, description flops back and forth between lifeless infodumps and breathless fountains of banalities, punctuated by moments of grotesque action, dialogue misses chances to reflect reality and create poetry, both, and tends toward the preachy. Etc.\nAnd yet Turner still has a compelling dramatic power difficult to communicate to the uninitiated. We are talking, after all, about a science fiction novel full of notes to future readers like this one:\n“Note to the reader: Uganda was a political subdivision of the continent of Africa during the Old Era, when that continent was inhabited by the Negro race. Puerto Rico was the Old Era name of the island of New Carolina. It is occupied now by the descendants of White refugees from radioactive areas of the southeastern United States, but before the race purges in the final days of the Great Revolution it was inhabited by a mongrel race of especially unsavory character.”\nAn entire awful world is drawn in that one footnote, and if the details of Turner’s worldbuilding are inept in execution, this is more than made up for by sheer passion. This is a novel whose narrator constantly soul-searches on the question “When is it right to brutalize or murder a white girl?” It revels in loving passages given to a mortar attack on the US Capitol and the intentional destruction of a nuclear plant to burn Chicago off the map. It finally finds its truest voice in a long midsection concerning the ethnic cleansing of southern California. Turner, in other words, is a direct window into madness. I don’t know about you, but that’s why I read and watch horror.\nHere is the pleasure I take from this kind of reading: it’s profoundly disturbing in consumption, easily shaken off after and yet builds mental and emotional muscles in the long run. These are books decrying the death of civilization and culture, written by people who don’t know how to write for audiences that can barely read. You can laugh at Turner once you’ve read it, and hard, and this part of fantasy stories is also true: demons are prideful, and shrivel up and die in the face of laughter. Reading renders the mystery pathetic and silly, and the more good people read, understand and mock, the harder the legend gets owned.\nYou are far too good for the likes of The Turner Diaries, but you can’t know that for sure until you know it for sure. Don’t take my word for it, please. I’m tired of being the only geek I know who makes good Turner Diaries jokes.\nNOTE: Buying a copy of The Turner Diaries may raise practical concerns: curiosity about the book is one thing, giving funds to a racist publisher and the estate of a racist author is another. Further, many readers likely live in countries banning the novel. Luckily, the devoted proselytizing efforts of racists provide a solution: the full text of the novel is available online in multiple languages.\nRobert N. Lee spent the beginning of his life in Vietnam, grew up all over the US, and now lives in Florida with the love of his life in a house full of pets named after Beverly Cleary characters. He works in technology design and marketing as well as publishing occasional fiction and non-fiction, and can be found online at his blog.", "source": "https://clarkesworldmagazine.com/lee_02_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Most Important Genre Novel You'll Never Read by Robert N. Lee"}