{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "PLaOpNfa73lpTaV7A3YxcttPZpY=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Culture Beyond Flair: A Conversation with S. Qiouyi Lu  S. Qiouyi Lu was born and grew up in the San Gabriel Valley. Æ went to college at the University of North Carolina at Chapel Hill, majoring in linguistics with a minor in Chinese. Æ did a few years of grad school, studying linguistics at Ohio State University, but ultimately returned to the San Gabriel Valley. “I’m fairly close to Pasadena, hometown of Octavia E. Butler. It’s humbling to overlap with her energy.”  S. received the Octavia E. Butler Memorial Scholarship and attended the Clarion West Writers Workshop in 2016. That same year, S. saw ær first fiction publications come out, two of them appearing in professional markets. S. also has poems out at notable venues, including “肉骨茶 (Meat Bone Tea)” in Uncanny Magazine. Several of these early pieces garnered attention, including earning the notice of the Rhysling Awards’ voters, as well as landing honorary mentions for the Otherwise Award. Among ær many notable shorts is 2018’s “Mother Tongues” (Asimov’s January/February issue), which was on the Locus Recommended Reading List, was a finalist in the Asimov’s Readers’ Poll, and was long listed for the Hugo Awards; it was also widely reprinted, including appearing in Neil Clarke’s The Best Science Fiction of the Year: Volume 4. Ær work continues to find homes at a variety of markets, from respected semipro publications and anthologies to major outlets, such as Tor.com, and continues to earn the regard of respected reviewers and critics.  S. Qiouyi Lu writes speculative fiction on a part-time, freelance basis: “I’ve worked a number of jobs; my favorite would probably be the time I was a content developer for a language- and culture-teaching software company.” Besides writing, æ enjoys various arts and crafts, including drawing, painting, collage, sewing, and cross-stitch. Æ has been the recipient of a number of fellowships and grants, such as the Emerging Artists Grant from the Columbus Arts Festival. “I’ve always been a creative person overall—I’ve also studied music, been part of musical groups (choirs and a gamelan ensemble), and dabbled in photography.”  Ær novella, In the Watchful City, will be released by Tordotcom Publishing in print and digital at the end of August.   What were some of the most important genre works for you when you were younger, and has your view of those works changed over time?  I’ve been revisiting Terry Pratchett’s work, which was quite formative for me, especially Going Postal and Men at Arms. I still love Pratchett’s humor and his use of footnotes. His characters, too, are vivid and distinct; he has great mastery over voice and gives life to even the most minor of characters. The expanse of his worldbuilding, and the way he integrates science into fantasy, inspires me to do the same.  As I’ve gotten older, though, I’ve found myself disappointed with Pratchett’s treatment of fat characters. Over the entire span of his œuvre, he describes fat characters with a disdainful and gleeful tone, equating their fatness with grotesqueness, laziness, and gluttony. For an author who writes such complex and varied characters, his treatment of fat characters is both repetitive and shallow.  You run magazine Arsenika and were guest poetry editor for Uncanny’s “Disabled People Destroy Science Fiction” special issue. Has editing fiction and poetry had any impact on the way you write?  I don’t think editing has really had an impact on my writing in terms of craft. Instead, it’s mostly changed the way I view publishing. I’ve never had much issue with receiving rejections for my work but being on the other side has shown me how much the editing process isn’t about quality. Quality is certainly a factor, but editor taste is even more of a factor. I’ve received plenty of submissions that were fantastic, but that didn’t quite match the theme or mood of what I was editing, so I rejected them. There are also things that I have a soft spot for that other editors might not tolerate as much, such as experimental structures. I’m more likely to gravitate toward those works; I’ve accepted and published several of them. I tell people now that finding a home for their work is really about finding the right editor for a piece, so keep submitting until you find that match.  Besides editing and writing original fiction and poetry, you’ve also done a number of translations, including stories appearing in Clarkesworld. What are the trickiest or most challenging aspects of translating short fiction?  I would say that the adaptation and localization aspects of translation are the ones that require the most thought for me. Translation isn’t just about getting a meaning across from one language to another, but also understanding the expectations of the target audience and tailoring the work to meet those expectations.  That doesn’t mean changing the story itself, though. Instead, that tailoring comes through in the choices I make about language use. For example, readers of short fiction in English tend to have very low tolerance of adverb use and see frequent use of adverbs as amateur. However, adverbs are extremely common in Chinese writing, and in fact the lack of them can make writing feel less vivid. So, when I’m translating from Chinese to English, I don’t translate things word-for-word like how some people might expect. Instead, I’m constantly making edits, like translating “jumped energetically” as “bounced.”  Additionally, because of differences in linguistic histories, scientific terms in Chinese are much more straightforward than equivalent terms in English, whose meanings are obscured by frequent use of Latin and Greek roots. For example, “diabetes mellitus” comes from the Greek word “diabetes” for “passing through,” associated with frequent urination, and the Latin term “mellitus,” meaning “sweet.” Your average English speaker wouldn’t be able to parse that without consulting an etymology dictionary. Meanwhile, in Chinese, the term is 糖尿病, which literally translates to “sugar urine illness” and is immediately legible as such to Chinese speakers.  When it comes to science fiction, then, this means I have to be familiar with what anglophone readers expect for something to sound like proper scientific jargon. In “Möbius Continuum” by Gu Shi, I puzzled a lot over how to translate 副体. 副 can mean “assistant,” “secondary,” “accessory” . . . I ended up going with “auxiliary body,” as the term “auxiliary” evokes technology like auxiliary cables and created a more high-tech feel to me. I do a lot of Googling and looking through both Chinese and English Wikipedia to ensure that I’m understanding the concepts enough to create passable jargon, which can be a challenge when the concepts and technology themselves are invented.  “Her Sacred Spirit Soars” came out in Strange Horizons in 2016, followed closely by “Th Fifth Lttr” in Daily Science Fiction. Looking at your short fiction pieces to date, do you feel like there are themes or concerns your work often addresses?  I would say that my work often addresses themes of identity, power, mental illness, and queerness. I’ve incorporated my Chinese-American heritage into several pieces, and pretty much all of my stories have drawn from personal experience in some way.  What is your process like for writing poetry, as compared to writing short fiction?  When I write short fiction, I tend to envision some kind of narrative trajectory. With poetry, however, narrative isn’t a priority, except for my longer pieces that aim to tell a story. The function of my poetry is to evoke a mood or emotion. It’s a lot more free-form and relies more on juxtaposition to create an effect than my short fiction, which is less stream-of-consciousness and more deliberate with how I render things.  Who are some of your favorite poets or favorite poems?  Margaret Atwood is one of my favorite poets. I actually haven’t read any of her prose, but I’ve read a good amount of her poetry. There’s just something about her voice that captivates me—her language is plain but incredibly evocative. “Backdrop addresses cowboy” is one of my favorites. I also love to show people the poem “[you fit into me]” because of how tiny it is, and yet how much it sits with you and invites you to imagine context.  In the Watchful City is coming out this month from Tordotcom Publishing. What was the journey to getting this book published?  The journey to getting the book published began with my short story “As Dark As Hunger.” I’d worked with Jonathan Strahan at Tordotcom Publishing previously to reprint my story “Mother Tongues” in The Best Science Fiction & Fantasy of the Year, Volume 13, also reprinted in Clarkesworld, and to publish my short story “Anything Resembling Love” at Tor.com. Jonathan asked me if I had any novella ideas; I told him about my concept for a mosaic novella, which would include “As Dark As Hunger.” He took the story to the Tordotcom Publishing team, who liked it enough to request the novella from me. I’m still pretty stunned that that happened, as I’d thought I’d go through the more traditional route of finishing the novella first before anyone showed interest.  The writing process for the stories within the novella all started at different points. Some of them have been percolating since as far back as 2009. The percolation process is a huge challenge for me. I’m not a write-every-day kind of writer, and diligent outlining usually leads to frustration for me, rather than a clarification of my ideas. I’ve come to learn—and am still learning—that I need to allow my ideas to coalesce over time. I really can’t rush that process, much as I’d like to. But I discovered through writing In the Watchful City that research can assist that process. When I research for fiction, my priority isn’t to create realism or to portray something accurately per se. Instead, research serves as inspiration, providing fascinating detail that networks together with other ideas to help me distill a narrative.  My writing process is pretty haphazard, and I often describe my creation process as a fugue state—I never remember much about the experience of writing a story; I finish it and promptly forget how I wrote it, and even what I experienced before and after writing it. So, I often have the sense that I’ll never write again, since each time feels like a miracle, and each story feels like relearning how to write. I’ve been in a fallow period for most of 2021, but I’m learning to trust those fallow periods and my process, bewildering as it is to me.  The book features exchanges between two characters, Anima and Vessel, as well as short stories told in association with objects Vessel has brought in a trunk. What is the advantage of writing a book with shorter stories interlaced through the main narrative?  Well, the main advantage is that I’m really a short story writer at my core, and putting short stories together is a great way for me to reach a novella word count without having to write a single, long narrative, something that I struggle with a lot.  On a more serious note, though, I wrote In the Watchful City partly to explore creating a secondary world, and having short stories set in different parts of it helped me envision what the world looks like and how different regions interact with each other. I’ve always loved secondary worlds like Discworld that feel lived-in, with multiple cultures and locations that are in contact with each other; I have little patience for the Star Wars one planet, one biome, one city approach. So, rather than follow the Terry Pratchett method of writing entire novels in different locales, I wrote short stories.  I think the frame story technique works well to tie together shorter stories, otherwise they read more like a collection than a narrative. The short stories in In the Watchful City also cross-reference each other in subtle ways—for example, the epistolary story “The Sky and Everything Under” mentions a sports tournament that takes place during a period of political turmoil; that sports tournament itself is the subject of the story “This Form I Hold Now,” which in turn makes explicit some of the politics discussed in “The Sky and Everything Under.” The cross-referencing was mostly for my sake to create a sense of cohesion in my worldbuilding, but I hope it works for readers, too.  Anima is a character who has, in some ways, been absorbed into ær role. What was the inspiration for Anima, what do you like most about ær, and what was the hardest thing about writing ær?  Anima and I are really one and the same, in many ways. I grew up in a sheltered suburban bubble and believed I had only one path to achieve success; Anima has spent ær entire life in one isolated city and knows only one role. It’s difficult, then, for me to say what I like most about ær, as I feel we’re so similar that it’s hard for me to view the character objectively. Trying to describe my perception of Anima is like trying to look at myself without a mirror. In that same vein, I wasn’t sure while writing the story whether Anima had enough of a personality, as I felt like I was simply replicating myself and not working toward creating a persona. I’m still not sure whether æ is as distinctive as some of the other characters.  Can you talk a bit about ideas of culture in your book?  I studied sociolinguistics in college, and one thing that’s always fascinated me—and that is fundamental to sociolinguistics—is cultural contact. Big ideas about culture and identity manifest in the tiniest features of individuals’ speech. Vessel alludes to this duality when se says, “Everything in the world is made up of smaller parts. Every big problem stems from something we can trace back to our day-to-day lives.”  In creating a secondary world, it was vital for me to shape the cultural attitudes of each region to inform what would happen when people came into contact. Each character, like every person in our own world, comes from a certain context and background; no character is the default or “unmarked state.” And “culture” isn’t just the superficial flair like dress and food, though I do love incorporating those details. “Culture” goes deeper. It’s the repository of experience that informs people’s values, ethics, thoughts, norms, and behaviors.  I illustrate culture and cultural differences in many ways throughout the book. Sometimes, cultural attitudes align closely with politics, like how the Skylands, a colonizer, targets the practice of foot-binding in one of its colonies: “‘By imperial decree from Tiānkyo, all girls must unbind their feet,’ the officer says, sparking murmurs of dissent. ‘The foot is the vessel through which the Bǐyìniǎo makes their presence known. It is to be respected and left in its natural state—not modified according to earthly whims.’”  Other times, cultural norms manifest in far more subtle ways. In “A Death Made Manifold,” Hàokōng is a foreigner to Agua Oscuro. There’s heavy queer subtext in the story that never makes it to text, in part because Hàokōng holds back based on uncertainty about cultural norms around showing romantic interest: “Hàokōng glances at Ansel’s face. He seems to be going for cordial, but Hàokōng’s never sure, and he doesn’t dare to ask for fear of the other man misunderstanding. He keeps his interest to himself as he chuckles.”  Meanwhile, the overt depictions of language loss in “As Dark As Hunger” are another tangible expression of culture. That story illustrates how cultural destruction ties with dehumanization to enable genocide.  So, there’s a lot of big ideas about culture and cultural contact in In the Watchful City. I could probably write an entire book of annotations on it!  What is the heart of this story for you, what do you really want readers to know about In the Watchful City?  As much as I discuss cultural contact above, the true heart of the story isn’t so much about others as it is about yourself—that is, as much as other people have stories, cultures, and backgrounds, so do you. Your story has value and is worth claiming: “‘You might not have a great quantity of stories,’ Vessel says, ‘but you will always have at least one: the story of your life.’”  What do you have coming up that readers should know about?  I’m writing a second novella for Tordotcom Publishing that’s shaping up to be an even deeper dive on language and cultural contact than In the Watchful City, and that will draw more specifically from my background in sociolinguistics. The timeline on that novella hasn’t been set yet, though. I also have a story, “Your Luminous Heart, Bound in Red,” forthcoming from Asimov’s in the September/October 2021 issue. That one’s about deconstructing toxic masculinity through a retelling of “Little Red Riding Hood” steeped in traditional Chinese medicine. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nCulture Beyond Flair: A Conversation with S. Qiouyi Lu\nS. Qiouyi Lu was born and grew up in the San Gabriel Valley. Æ went to college at the University of North Carolina at Chapel Hill, majoring in linguistics with a minor in Chinese. Æ did a few years of grad school, studying linguistics at Ohio State University, but ultimately returned to the San Gabriel Valley. “I’m fairly close to Pasadena, hometown of Octavia E. Butler. It’s humbling to overlap with her energy.”\nS. received the Octavia E. Butler Memorial Scholarship and attended the Clarion West Writers Workshop in 2016. That same year, S. saw ær first fiction publications come out, two of them appearing in professional markets. S. also has poems out at notable venues, including “肉骨茶 (Meat Bone Tea)” in Uncanny Magazine. Several of these early pieces garnered attention, including earning the notice of the Rhysling Awards’ voters, as well as landing honorary mentions for the Otherwise Award. Among ær many notable shorts is 2018’s “Mother Tongues” (Asimov’s January/February issue), which was on the Locus Recommended Reading List, was a finalist in the Asimov’s Readers’ Poll, and was long listed for the Hugo Awards; it was also widely reprinted, including appearing in Neil Clarke’s The Best Science Fiction of the Year: Volume 4. Ær work continues to find homes at a variety of markets, from respected semipro publications and anthologies to major outlets, such as Tor.com, and continues to earn the regard of respected reviewers and critics.\nS. Qiouyi Lu writes speculative fiction on a part-time, freelance basis: “I’ve worked a number of jobs; my favorite would probably be the time I was a content developer for a language- and culture-teaching software company.” Besides writing, æ enjoys various arts and crafts, including drawing, painting, collage, sewing, and cross-stitch. Æ has been the recipient of a number of fellowships and grants, such as the Emerging Artists Grant from the Columbus Arts Festival. “I’ve always been a creative person overall—I’ve also studied music, been part of musical groups (choirs and a gamelan ensemble), and dabbled in photography.”\nÆr novella, In the Watchful City, will be released by Tordotcom Publishing in print and digital at the end of August.\nWhat were some of the most important genre works for you when you were younger, and has your view of those works changed over time?\nI’ve been revisiting Terry Pratchett’s work, which was quite formative for me, especially Going Postal and Men at Arms. I still love Pratchett’s humor and his use of footnotes. His characters, too, are vivid and distinct; he has great mastery over voice and gives life to even the most minor of characters. The expanse of his worldbuilding, and the way he integrates science into fantasy, inspires me to do the same.\nAs I’ve gotten older, though, I’ve found myself disappointed with Pratchett’s treatment of fat characters. Over the entire span of his œuvre, he describes fat characters with a disdainful and gleeful tone, equating their fatness with grotesqueness, laziness, and gluttony. For an author who writes such complex and varied characters, his treatment of fat characters is both repetitive and shallow.\nYou run magazine Arsenika and were guest poetry editor for Uncanny’s “Disabled People Destroy Science Fiction” special issue. Has editing fiction and poetry had any impact on the way you write?\nI don’t think editing has really had an impact on my writing in terms of craft. Instead, it’s mostly changed the way I view publishing. I’ve never had much issue with receiving rejections for my work but being on the other side has shown me how much the editing process isn’t about quality. Quality is certainly a factor, but editor taste is even more of a factor. I’ve received plenty of submissions that were fantastic, but that didn’t quite match the theme or mood of what I was editing, so I rejected them. There are also things that I have a soft spot for that other editors might not tolerate as much, such as experimental structures. I’m more likely to gravitate toward those works; I’ve accepted and published several of them. I tell people now that finding a home for their work is really about finding the right editor for a piece, so keep submitting until you find that match.\nBesides editing and writing original fiction and poetry, you’ve also done a number of translations, including stories appearing in Clarkesworld. What are the trickiest or most challenging aspects of translating short fiction?\nI would say that the adaptation and localization aspects of translation are the ones that require the most thought for me. Translation isn’t just about getting a meaning across from one language to another, but also understanding the expectations of the target audience and tailoring the work to meet those expectations.\nThat doesn’t mean changing the story itself, though. Instead, that tailoring comes through in the choices I make about language use. For example, readers of short fiction in English tend to have very low tolerance of adverb use and see frequent use of adverbs as amateur. However, adverbs are extremely common in Chinese writing, and in fact the lack of them can make writing feel less vivid. So, when I’m translating from Chinese to English, I don’t translate things word-for-word like how some people might expect. Instead, I’m constantly making edits, like translating “jumped energetically” as “bounced.”\nAdditionally, because of differences in linguistic histories, scientific terms in Chinese are much more straightforward than equivalent terms in English, whose meanings are obscured by frequent use of Latin and Greek roots. For example, “diabetes mellitus” comes from the Greek word “diabetes” for “passing through,” associated with frequent urination, and the Latin term “mellitus,” meaning “sweet.” Your average English speaker wouldn’t be able to parse that without consulting an etymology dictionary. Meanwhile, in Chinese, the term is 糖尿病, which literally translates to “sugar urine illness” and is immediately legible as such to Chinese speakers.\nWhen it comes to science fiction, then, this means I have to be familiar with what anglophone readers expect for something to sound like proper scientific jargon. In “Möbius Continuum” by Gu Shi, I puzzled a lot over how to translate 副体. 副 can mean “assistant,” “secondary,” “accessory” . . . I ended up going with “auxiliary body,” as the term “auxiliary” evokes technology like auxiliary cables and created a more high-tech feel to me. I do a lot of Googling and looking through both Chinese and English Wikipedia to ensure that I’m understanding the concepts enough to create passable jargon, which can be a challenge when the concepts and technology themselves are invented.\n“Her Sacred Spirit Soars” came out in Strange Horizons in 2016, followed closely by “Th Fifth Lttr” in Daily Science Fiction. Looking at your short fiction pieces to date, do you feel like there are themes or concerns your work often addresses?\nI would say that my work often addresses themes of identity, power, mental illness, and queerness. I’ve incorporated my Chinese-American heritage into several pieces, and pretty much all of my stories have drawn from personal experience in some way.\nWhat is your process like for writing poetry, as compared to writing short fiction?\nWhen I write short fiction, I tend to envision some kind of narrative trajectory. With poetry, however, narrative isn’t a priority, except for my longer pieces that aim to tell a story. The function of my poetry is to evoke a mood or emotion. It’s a lot more free-form and relies more on juxtaposition to create an effect than my short fiction, which is less stream-of-consciousness and more deliberate with how I render things.\nWho are some of your favorite poets or favorite poems?\nMargaret Atwood is one of my favorite poets. I actually haven’t read any of her prose, but I’ve read a good amount of her poetry. There’s just something about her voice that captivates me—her language is plain but incredibly evocative. “Backdrop addresses cowboy” is one of my favorites. I also love to show people the poem “[you fit into me]” because of how tiny it is, and yet how much it sits with you and invites you to imagine context.\nIn the Watchful City is coming out this month from Tordotcom Publishing. What was the journey to getting this book published?\nThe journey to getting the book published began with my short story “As Dark As Hunger.” I’d worked with Jonathan Strahan at Tordotcom Publishing previously to reprint my story “Mother Tongues” in The Best Science Fiction & Fantasy of the Year, Volume 13, also reprinted in Clarkesworld, and to publish my short story “Anything Resembling Love” at Tor.com. Jonathan asked me if I had any novella ideas; I told him about my concept for a mosaic novella, which would include “As Dark As Hunger.” He took the story to the Tordotcom Publishing team, who liked it enough to request the novella from me. I’m still pretty stunned that that happened, as I’d thought I’d go through the more traditional route of finishing the novella first before anyone showed interest.\nThe writing process for the stories within the novella all started at different points. Some of them have been percolating since as far back as 2009. The percolation process is a huge challenge for me. I’m not a write-every-day kind of writer, and diligent outlining usually leads to frustration for me, rather than a clarification of my ideas. I’ve come to learn—and am still learning—that I need to allow my ideas to coalesce over time. I really can’t rush that process, much as I’d like to. But I discovered through writing In the Watchful City that research can assist that process. When I research for fiction, my priority isn’t to create realism or to portray something accurately per se. Instead, research serves as inspiration, providing fascinating detail that networks together with other ideas to help me distill a narrative.\nMy writing process is pretty haphazard, and I often describe my creation process as a fugue state—I never remember much about the experience of writing a story; I finish it and promptly forget how I wrote it, and even what I experienced before and after writing it. So, I often have the sense that I’ll never write again, since each time feels like a miracle, and each story feels like relearning how to write. I’ve been in a fallow period for most of 2021, but I’m learning to trust those fallow periods and my process, bewildering as it is to me.\nThe book features exchanges between two characters, Anima and Vessel, as well as short stories told in association with objects Vessel has brought in a trunk. What is the advantage of writing a book with shorter stories interlaced through the main narrative?\nWell, the main advantage is that I’m really a short story writer at my core, and putting short stories together is a great way for me to reach a novella word count without having to write a single, long narrative, something that I struggle with a lot.\nOn a more serious note, though, I wrote In the Watchful City partly to explore creating a secondary world, and having short stories set in different parts of it helped me envision what the world looks like and how different regions interact with each other. I’ve always loved secondary worlds like Discworld that feel lived-in, with multiple cultures and locations that are in contact with each other; I have little patience for the Star Wars one planet, one biome, one city approach. So, rather than follow the Terry Pratchett method of writing entire novels in different locales, I wrote short stories.\nI think the frame story technique works well to tie together shorter stories, otherwise they read more like a collection than a narrative. The short stories in In the Watchful City also cross-reference each other in subtle ways—for example, the epistolary story “The Sky and Everything Under” mentions a sports tournament that takes place during a period of political turmoil; that sports tournament itself is the subject of the story “This Form I Hold Now,” which in turn makes explicit some of the politics discussed in “The Sky and Everything Under.” The cross-referencing was mostly for my sake to create a sense of cohesion in my worldbuilding, but I hope it works for readers, too.\nAnima is a character who has, in some ways, been absorbed into ær role. What was the inspiration for Anima, what do you like most about ær, and what was the hardest thing about writing ær?\nAnima and I are really one and the same, in many ways. I grew up in a sheltered suburban bubble and believed I had only one path to achieve success; Anima has spent ær entire life in one isolated city and knows only one role. It’s difficult, then, for me to say what I like most about ær, as I feel we’re so similar that it’s hard for me to view the character objectively. Trying to describe my perception of Anima is like trying to look at myself without a mirror. In that same vein, I wasn’t sure while writing the story whether Anima had enough of a personality, as I felt like I was simply replicating myself and not working toward creating a persona. I’m still not sure whether æ is as distinctive as some of the other characters.\nCan you talk a bit about ideas of culture in your book?\nI studied sociolinguistics in college, and one thing that’s always fascinated me—and that is fundamental to sociolinguistics—is cultural contact. Big ideas about culture and identity manifest in the tiniest features of individuals’ speech. Vessel alludes to this duality when se says, “Everything in the world is made up of smaller parts. Every big problem stems from something we can trace back to our day-to-day lives.”\nIn creating a secondary world, it was vital for me to shape the cultural attitudes of each region to inform what would happen when people came into contact. Each character, like every person in our own world, comes from a certain context and background; no character is the default or “unmarked state.” And “culture” isn’t just the superficial flair like dress and food, though I do love incorporating those details. “Culture” goes deeper. It’s the repository of experience that informs people’s values, ethics, thoughts, norms, and behaviors.\nI illustrate culture and cultural differences in many ways throughout the book. Sometimes, cultural attitudes align closely with politics, like how the Skylands, a colonizer, targets the practice of foot-binding in one of its colonies: “‘By imperial decree from Tiānkyo, all girls must unbind their feet,’ the officer says, sparking murmurs of dissent. ‘The foot is the vessel through which the Bǐyìniǎo makes their presence known. It is to be respected and left in its natural state—not modified according to earthly whims.’”\nOther times, cultural norms manifest in far more subtle ways. In “A Death Made Manifold,” Hàokōng is a foreigner to Agua Oscuro. There’s heavy queer subtext in the story that never makes it to text, in part because Hàokōng holds back based on uncertainty about cultural norms around showing romantic interest: “Hàokōng glances at Ansel’s face. He seems to be going for cordial, but Hàokōng’s never sure, and he doesn’t dare to ask for fear of the other man misunderstanding. He keeps his interest to himself as he chuckles.”\nMeanwhile, the overt depictions of language loss in “As Dark As Hunger” are another tangible expression of culture. That story illustrates how cultural destruction ties with dehumanization to enable genocide.\nSo, there’s a lot of big ideas about culture and cultural contact in In the Watchful City. I could probably write an entire book of annotations on it!\nWhat is the heart of this story for you, what do you really want readers to know about In the Watchful City?\nAs much as I discuss cultural contact above, the true heart of the story isn’t so much about others as it is about yourself—that is, as much as other people have stories, cultures, and backgrounds, so do you. Your story has value and is worth claiming: “‘You might not have a great quantity of stories,’ Vessel says, ‘but you will always have at least one: the story of your life.’”\nWhat do you have coming up that readers should know about?\nI’m writing a second novella for Tordotcom Publishing that’s shaping up to be an even deeper dive on language and cultural contact than In the Watchful City, and that will draw more specifically from my background in sociolinguistics. The timeline on that novella hasn’t been set yet, though. I also have a story, “Your Luminous Heart, Bound in Red,” forthcoming from Asimov’s in the September/October 2021 issue. That one’s about deconstructing toxic masculinity through a retelling of “Little Red Riding Hood” steeped in traditional Chinese medicine.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/lu_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Culture Beyond Flair: A Conversation with S. Qiouyi Lu by Arley Sorg"}