{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert Reed", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Kw7vKhozskxF+Hqm9Fym5zrAEb0=", "id": null, "license": null, "comments": "", "raw_text": "4900 words, short story  Prayer  Fashion matters. In my soul of souls, I know that the dead things you carry on your body are real, real important. Grandma likes to call me a clotheshorse, which sounds like a good thing. For example, I’ve always known that a quality sweater means the world. I prefer soft organic wools woven around Class-C nanofibers—a nice high collar with sleeves riding a little big but with enough stopping power to absorb back-to-back kinetic charges. I want pants that won’t slice when the shrapnel is thick, and since I won’t live past nineteen, probably, I let the world see that this body’s young and fit. (Morbid maybe, but that’s why I think about death only in little doses.) I adore elegant black boots that ignore rain and wandering electrical currents, and everything under my boots and sweater and pants has to feel silky-good against the most important skin in my world. But essential beyond all else is what I wear on my face, which is more makeup than Grandma likes, and tattooed scripture on the forehead, and sparkle-eyes that look nothing but ordinary. In other words, I want people to see an average Christian girl instead of what I am, which is part of the insurgency’s heart inside Occupied Toronto.  To me, guns are just another layer of clothes, and the best day ever lived was the day I got my hands on a barely used, cognitively damaged Mormon railgun. They don’t make that model anymore, what with its willingness to change sides. And I doubt that there’s ever been a more dangerous gun made by the human species. Shit, the boy grows his own ammo, and he can kill anything for hundreds of miles, and left alone he will invent ways to hide and charge himself on the sly, and all that time he waits waits waits for his master to come back around and hold him again.  I am his master now.  I am Ophelia Hanna Hanks, except within my local cell, where I wear the randomly generated, perfectly suitable name:  Ridiculous.  The gun’s name is Prophet, and until ten seconds ago, he looked like scrap conduit and junk wiring. And while he might be cognitively impaired, Prophet is wickedly loyal to me. Ten days might pass without the two of us being in each other’s reach, but that’s the beauty of our dynamic: I can live normal and look normal, and while the enemy is busy watching everything else, a solitary fourteen-year-old girl slips into an alleyway that’s already been swept fifty times today.  “Good day, Ridiculous.”  “Good day to you, Prophet.”  “And who are we going to drop into Hell today?”  “All of America,” I say, which is what I always say.  Reliable as can be, he warns me, “That’s a rather substantial target, my dear. Perhaps we should reduce our parameters.”  “Okay. New Fucking York.”  Our attack has a timetable, and I have eleven minutes to get into position.  “And the specific target?” he asks.  I have coordinates that are updated every half-second. I could feed one or two important faces into his menu, but I never kill faces. These are the enemy, but if I don’t define things too closely, then I won’t miss any sleep tonight.  Prophet eats the numbers, saying, “As you wish, my dear.”  I’m carrying him, walking fast towards a fire door that will stay unlocked for the next ten seconds. Alarmed by my presence, a skinny rat jumps out of one dumpster, little legs running before it hits the oily bricks.  “Do you know it?” I ask.  The enemy likes to use rats as spies.  Prophet says, “I recognize her, yes. She has a nest and pups inside the wall.”  “Okay,” I say, feeling nervous and good.  The fire door opens when I tug and locks forever once I step into the darkness.  “You made it,” says my gun.  “I was praying,” I report.  He laughs, and I laugh too. But I keep my voice down, stairs needing to be climbed and only one of us doing the work.  She found me after a battle. She believes that I am a little bit stupid. I was damaged in the fight and she imprinted my devotions to her, and then using proxy tools and stolen wetware, she gave me the cognitive functions to be a loyal agent to the insurgency.  I am an astonishing instrument of mayhem, and naturally her superiors thought about claiming me for themselves.  But they didn’t.  If I had the freedom to speak, I would mention this oddity to my Ridiculous. “Why would they leave such a prize with little you?”  “Because I found you first,” she would say.  “War isn’t a schoolyard game,” I’d remind her.  “But I made you mine,” she might reply. “And my bosses know that I’m a good soldier, and you like me, and stop being a turd.”  No, we have one another because her bosses are adults. They are grown souls who have survived seven years of occupation, and that kind of achievement doesn’t bless the dumb or the lucky. Looking at me, they see too much of a blessing, and nobody else dares to trust me well enough to hold me.  I know all of this, which seems curious.  I might say all of this, except I never do.  And even though my mind was supposedly mangled, I still remember being crafted and calibrated in Utah, hence my surname. But I am no Mormon. Indeed, I’m a rather agnostic soul when it comes to my interpretations of Jesus and His influence in the New World. And while there are all-Mormon units in the US military, I began my service with Protestants—Baptists and Missouri Synods mostly. They were bright clean happy believers who had recently arrived at Fort Joshua out on Lake Ontario. Half of that unit had already served a tour in Alberta, guarding the tar pits from little acts of sabotage. Keeping the Keystones safe is a critical but relatively simple duty. There aren’t many people to watch, just robots and one another. The prairie was depopulated ten years ago, which wasn’t an easy or cheap process; American farmers still haven’t brought the ground back to full production, and that’s one reason why the Toronto rations are staying small.  But patrolling the corn was easy work compared to sitting inside Fort Joshua, millions of displaced and hungry people staring at your walls.  Americans call this Missionary Work.  Inside their own quarters, alone except for their weapons and the Almighty, soldiers try to convince one another that the natives are beginning to love them. Despite a thousand lessons to the contrary, Canada is still that baby brother to the north, big and foolish but congenial in his heart, or at least capable of learning manners after the loving sibling delivers enough beat-downs.  What I know today—what every one of my memories tells me—is that the American soldiers were grossly unprepared. Compared to other units and other duties, I would even go so far as to propose that the distant generals were aware of their limitations yet sent the troops across the lake regardless, full of religion and love for each other and the fervent conviction that the United States was the empire that the world had always deserved.  Canada is luckier than most. That can’t be debated without being deeply, madly stupid. Heat waves are killing the tropics. Acid has tortured the seas. The wealth of the previous centuries has been erased by disasters of weather and war and other inevitable surprises. But the worst of these sorrows haven’t occurred in the Greater United States, and if they had half a mind, Canadians would be thrilled with the mild winters and long brilliant summers and the supportive grip of their big wise master.  My soldiers’ first recon duty was simple: Walk past the shops along Queen.  Like scared warriors everywhere, they put on every piece of armor and every sensor and wired back-ups that would pierce the insurgent’s jamming. And that should have been good enough. But by plan or by accident, some native let loose a few molecules of VX gas—just enough to trigger one of the biohazard alarms. Then one of my brother-guns was leveled at a crowd of innocents, two dozen dead before the bloody rain stopped flying.  That’s when the firefight really began.  Kinetic guns and homemade bombs struck the missionaries from every side. I was held tight by my owner—a sergeant with commendations for his successful defense of a leaky pipeline—but he didn’t fire me once. His time was spent yelling for an orderly retreat, pleading with his youngsters to find sure targets before they hit the buildings with hypersonic rounds. But despite those good smart words, the patrol got itself trapped. There was a genuine chance that one of them might die, and that’s when those devout men encased in body armor and faith decided to pray: Clasping hands, they opened channels to the Almighty, begging for thunder to be sent down on the infidels.  The Almighty is what used to be called the Internet—an American child reclaimed totally back in 2027.  A long stretch of shops and old buildings was struck from the sky.  That’s what American soldiers do when the situation gets dicey. They pray, and the locals die by the hundreds, and the biggest oddity of that peculiar day was how the usual precise orbital weaponry lost its way, and half of my young men were wounded or killed in the onslaught while a tiny shaped charge tossed me a hundred meters down the road.  There I was discovered in the rubble by a young girl.  As deeply unlikely as that seems.  I don’t want the roof. I don’t need my eyes to shoot. An abandoned apartment on the top floor is waiting for me, and in particular, its dirty old bathroom. As a rule, I like bathrooms. They’re the strongest part of any building, what with pipes running through the walls and floor. Two weeks ago, somebody I’ll never know sealed the tube’s drain and cracked the faucet just enough for a slow drip, and now the water sits near the brim. Water is essential for long shots. With four minutes to spare, I deploy Prophet’s long legs, tipping him just enough toward the southeast, and then I sink him halfway into the bath, asking, “How’s that feel?”  “Cold,” he jokes.  We have three and a half minutes to talk.  I tell him, “Thank you.”  His barrel stretches to full length, its tip just short of the moldy plaster ceiling. “Thank you for what?” he says.  “I don’t know,” I say.  Then I laugh, and he sort of laughs.  I say, “I’m not religious. At least, I don’t want to be.”  “What are you telling me, Ridiculous?”  “I guess . . . I don’t know. Forget it.”  And he says, “I will do my very best.”  Under the water, down where the breech sits, ammunition is moving. Scrap metal and scrap nano-fibers have been woven into four bullets. Street fights require hundreds and thousands of tiny bullets, but each of these rounds is bigger than most carrots and shaped the same general way. Each one carries a brain and microrockets and eyes. Prophet is programming them with the latest coordinates while running every last-second test. Any little problem with a bullet can mean an ugly shot, or even worse, an explosion that rips away the top couple floors of this building.  At two minutes, I ask, “Are we set?”  “You’re standing too close,” he says.  “If I don’t move, will you fire anyway?”  “Of course.”  “Good,” I say.  At ninety-five seconds, ten assaults are launched across southern Ontario. The biggest and nearest is fixated on Fort Joshua—homemade cruise missiles and lesser railguns aimed at that artificial island squatting in our beautiful lake. The assaults are meant to be loud and unexpected, and because every soldier thinks his story is important, plenty of voices suddenly beg with the Almighty, wanting His godly hand.  The nearby battle sounds like a sudden spring wind.  “I’m backing out of here,” I say.  “Please do,” he says.  At sixty-one seconds, most of the available American resources are glancing at each of these distractions, and a brigade of AIs is studying past tendencies and elaborate models of insurgency capabilities, coming to the conclusion that these events have no credible value toward the war’s successful execution.  Something else is looming, plainly.  “God’s will,” says the nonbeliever.  “What isn’t?” says the Mormon gun.  At seventeen seconds, two kilometers of the Keystone John pipeline erupt in a line of smoky flame, microbombs inside the heated tar doing their best to stop the flow of poisons to the south.  The Almighty doesn’t need prayer to guide His mighty hand. This must be the main attack, and every resource is pulled to the west, making ready to deal with even greater hazards.  I shut the bathroom door and run for the hallway.  Prophet empties his breech, the first carrot already moving many times faster than the speed of sound as it blasts through the roof. Its three buddies are directly behind it, and the enormous release of stored energy turns the bathwater to steam, and with the first shot the iron tub is yanked free of the floor while the second and third shots kick the tub and the last of its water down into the bathroom directly downstairs. The final shot is going into the wrong part of the sky, but that’s also part of the plan. I’m not supposed to be amazed by how many factors can be juggled at once, but they are juggled and I am amazed, running down the stairs to recover my good friend.  The schedule is meant to be secret and followed precisely. The Secretary of Carbon rides her private subway car to the UN, but instead of remaining indoors and safe, she has to come into the sunshine, standing with ministers and potentates who have gathered for this very important conference. Reporters are sitting in rows and cameras will be watching from every vantage point, and both groups are full of those who don’t particularly like the Secretary. Part of her job is being despised, and fuck them. That’s what she thinks whenever she attends these big public dances. Journalists are livestock, and this is a show put on for the meat. Yet even as the scorn builds, she shows a smile that looks warm and caring, and she carries a strong speech that will last for three minutes, provided she gives it. Her words are meant to reassure the world that full recovery is at hand. She will tell everyone that the hands of her government are wise and what the United States wants is happiness for every living breathing wonderful life on this great world—a world that with God’s help will live for another five billion years.  For the camera, for the world, the Secretary of Carbon and her various associates invest a few moments in handshakes and important nods of the head.  Watching from a distance, without knowing anything, it would be easy to recognize that the smiling woman in brown was the one in charge.  The UN president shakes her hand last and then steps up to the podium. He was installed last year after an exhaustive search. Handsome and personable, and half as bright as he is ambitious, the President greets the press and then breaks from the script, shouting a bland “Hello” to the protestors standing outside the blast screens.  Five thousand people are standing in the public plaza, holding up signs and generated holos that have one clear message:  “END THE WARS NOW.”  The Secretary knows the time and the schedule, and she feels a rare ache of nervousness, of doubt.  When they hear themselves mentioned, the self-absorbed protestors join together in one rehearsed shout that carries across the screens. A few reporters look at the throng behind them. The cameras and the real professionals focus on the human subjects. This is routine work. Reflexes are numb, minds lethargic. The Secretary picks out a few familiar faces, and then her assistant pipes a warning into her sparkle-eyes. One of the Keystones has been set on fire.  In reflex, the woman takes one step backward, her hands starting to lift to cover her head.  A mistake.  But she recovers soon enough, turning to her counterpart from Russia, telling him, “And congratulations on that new daughter of yours.”  He is flustered and flattered. With a giddy nod, he says, “Girls are so much better than boys these days. Don’t you think?”  The Secretary has no chance to respond.  A hypersonic round slams through the atmosphere, heated to a point where any impact will make it explode. Then it drops into an environment full of clutter and one valid target that must be acquired and reached before the fabulous energies shake loose from their bridle.  There is no warning sound.  The explosion lifts bodies and pieces of bodies, and while the debris rises, three more rounds plunge into the panicked crowd.  Every person in the area drops flat, hands over their heads.  Cameras turn, recording the violence and loss—more than three hundred dead and maimed in a horrific attack.  The Secretary and new father lie together on the temporary stage.  Is it her imagination, or is the man trying to cop a feel?  She rolls away from him, but she doesn’t stand yet. The attack is finished, but she shouldn’t know that. It’s best to remain down and act scared, looking at the plaza, the air filled with smoke and pulverized concrete while the stubborn holos continue to beg for some impossible gift called Peace.  My grandmother is sharp. She is. Look at her once in the wrong way, and she knows something is wrong. Do it twice and she’ll probably piece together what makes a girl turn quiet and strange.  But not today, she doesn’t.  “What happened at school?” she asks.  I don’t answer.  “What are you watching, Ophelia?”  Nothing. My eyes have been blank for half a minute now.  “Something went wrong at school, didn’t it?”  Nothing is ever a hundred percent right at school, which is why it’s easy to harvest a story that might be believed. Most people would believe it, at least. But after listening to my noise about snippy friends and broken trusts, she says, “I don’t know what’s wrong with you, honey. But that isn’t it.”  I nod, letting my voice die away.  She leaves my little room without closing the door. I sit and do nothing for about three seconds, and then the sparkle eyes take me back to the mess outside the UN. I can’t count the times I’ve watched the impacts, the carnage. Hundreds of cameras were working, government cameras and media cameras and those carried by the protesters. Following at the digitals’ heels are people talking about the tragedy and death tolls and who is responsible and how the war has moved to a new awful level.  “Where did the insurgents get a top-drawer railgun?” faces ask.  But I’ve carried Prophet for a couple years and fired him plenty of times. Just not into a public target like this, and with so many casualties, and all of the dead on my side of the fight.  That’s the difference here: The world suddenly knows about me.  In the middle of the slaughter, one robot camera stays focused on my real targets, including the Secretary of Fuel and Bullshit. It’s halfway nice, watching her hunker down in terror. Except she should have been in pieces, and there shouldn’t be a face staring in my direction, and how Prophet missed our target by more than fifty meters is one big awful mystery that needs solving.  I assume a malfunction.  I’m wondering where I can take him to get his guidance systems recalibrated and ready for retribution.  Unless of course the enemy has figured out how to make railgun rounds fall just a little wide of their goals, maybe even killing some troublemakers in the process.  Whatever is wrong here, at least I know that it isn’t my fault.  Then some little thing taps at my window.  From the next room, my grandmother asks, “What are you doing, Ophelia?”  I’m looking at the bird on my window sill. The enemy uses rats, and we use robins and house sparrows. But this is a red-headed woodpecker, which implies rank and special circumstances.  The bird gives a squawk, which is a coded message that my eyes have to play with for a little while. Then the messenger flies away.  “Ophelia?”  “I’m just thinking about a friend,” I shout.  She comes back into my room, watching my expression all over again.  “A friend, you say?”  “He’s in trouble,” I say.  “Is that what’s wrong?” she asks.  “Isn’t that enough?”  Two rats in this alley don’t convince me. I’m watching them from my new haven, measuring the dangers and possible responses. Then someone approaches the three of us, and in the best tradition of ratdom, my companions scurry into the darkness under a pile of rotting boards.  I am a plastic sack filled with broken machine parts.  I am motionless and harmless, but in my secret reaches, inside my very busy mind, I’m astonished to see my Ridiculous back again so soon, walking toward the rat-rich wood pile.  Five meters behind her walks an unfamiliar man.  To him, I take an immediate dislike.  He looks prosperous, and he looks exceptionally angry, wearing a fine suit made stiff with nano-armor and good leather shoes and a platoon of jamming equipment as well as two guns riding in his pockets, one that shoots poisoned ice as well as the gun that he trusts—a kinetic beast riding close to his dominant hand.  Ridiculous stops at the rot pile.  The man asks, “Is it there?”  “I don’t know,” she says, eyes down.  My girl has blue sparkle eyes, much like her original eyes—the ones left behind in the doctor’s garbage bin.  “It looks like boards now?” he asks.  “He did,” she lies.  “Not he,” the man says, sounding like a google-head. “The machine is an It.”  “Right,” she says, kicking at the planks, pretending to look hard. “It’s just a big gun. I keep forgetting.”  The man is good at being angry. He has a tall frightful face and neck muscles that can’t stop being busy. His right hand thinks about the gun in his pocket. The fingers keep flexing, wanting to grab it.  His gun is an It.  I am not.  “I put it here,” she says.  She put me where I am now, which tells me even more.  “Something scared it,” she says. “And now it’s moved to another hiding place.”  The man says, “Shit.”  Slowly, carefully, he turns in a circle, looking at the rubble and the trash and the occasional normal object that might still work or might be me. Then with a tight slow voice, he says, “Call for it.”  “Prophet,” she says.  I say nothing.  “How far could it move?” he asks.  “Not very,” she says. “The firing drained it down to nothing, nearly. And it hasn’t had time to feed itself, even if it’s found food.”  “Bullshit,” he says, coming my way.  Ridiculous watches me and him, the tattooed Scripture above her blue eyes dripping with sweat. Then the man kneels beside me, and she says, “I put the right guidance codes into him.”  “You said that already.” Then he looks back at her, saying, “You’re not in trouble here. I told you that already.”  His voice says a lot.  I have no power. But when his hands reach into my sack, what resembles an old capacitor cuts two of his fingers, which is worth some cursing and some secret celebration.  Ridiculous’s face is twisted with worry, up until he looks back at her again. Then her expression turns innocent, pure and pretty and easy to believe.  Good girl, I think.  The man rises and pulls out the kinetic gun and shoots Ridiculous in the chest. If not for the wood piled up behind her, she would fly for a long distance. But instead of flying, she crashes and pulls down the wood around her, and one of those very untrustworthy rats comes out running, squeaking as it flees.  Ridiculous sobs and rolls and tries saying something.  He shoots her in the back, twice, and then says, “We never should have left it with you. All that luck dropping into our hands, which was crazy. Why should we have trusted the gun for a minute?”  She isn’t dead, but her ribs are broken. And by the sound of it, the girl is fighting to get one good breath.  “Sure, it killed some bad guys,” he says. “That’s what a good spy does. He sacrifices a few on his side to make him look golden in the enemy’s eyes.”  I have no strength.  “You can’t have gone far,” he tells the alley. “We’ll drop ordinance in here, take you out with the rats.”  I cannot fight.  “Or you can show yourself to me,” he says, the angry face smiling now. “Reveal yourself and we can talk.”  Ridiculous sobs.  What is very easy is remembering the moment when she picked up me out of the bricks and dust and bloodied bits of human meat.  He gives my sack another good kick, seeing something.  And for the first time in my life, I pray. Just like that, as easy as anything, the right words come out of me, and the man bending over me hears nothing coming and senses nothing, his hands playing with my pieces when a fleck of laser light falls out of the sky and turns the angriest parts of his brain into vapor, into a sharp little pop.  I’m still not breathing normally. I’m still a long way from being able to think straight about anything. Gasping and stupid, I’m kneeling in a basement fifty meters from where I nearly died, and Prophet is suckling on an unsecured outlet, endangering both of us. But he needs power and ammunition, and I like the damp dark in here, waiting for my body to come back to me.  “You are blameless,” he says.  I don’t know what that means.  He says, “You fed the proper codes into me. But there were other factors, other hands, and that’s where the blame lies.”  “So you are a trap,” I say.  “Somebody’s trap,” he says.  “The enemy wanted those civilians killed,” I say, and then I break into the worst-hurting set of coughs that I have ever known.  He waits.  “I trusted you,” I say.  “But Ridiculous,” he says.  “Shut up,” I say.  “Ophelia,” he says.  I hold my sides, sipping my breaths.  “You assume that this war has two sides,” he says. “But there could be a third player at large, don’t you see?”  “What should I see?”  “Giving a gun to their enemies is a huge risk. If the Americans wanted to kill their political enemies, it would be ten times easier to pull something out of their armory and set it up in the insurgency’s heart.”  “Somebody else planned all of this, you’re saying.”  “I seem to be proposing that, yes.”  “But that man who came with me today, the one you killed . . . he said the Secretary showed us a lot with her body language. She knew the attack was coming. She knew when it would happen. Which meant that she was part of the planning, which was a hundred percent American.”  “Except whom does the enemy rely on to make their plans?”  “Tell me,” I say.  Talking quietly, making the words even more important, he says, “The Almighty.”  “What are we talking about?” I ask.  He says nothing, starting to change his shape again.  “The Internet?” I ask. “What, you mean it’s conscious now? And it’s working its own side in this war?”  “The possibility is there for the taking,” he says.  But all I can think about are the dead people and those that are hurt and those that right now are sitting at their dinner table, thinking that some fucking Canadian bitch has made their lives miserable for no goddamn reason.  “You want honesty,” Prophet says.  “When don’t I?”  He says, “This story about a third side . . . it could be a contingency buried inside my tainted software. Or it is the absolute truth, and the Almighty is working with both of us, aiming toward some grand, glorious plan.”  I am sort of listening, and sort of not.  Prophet is turning shiny, which happens when his body is in the middle of changing shapes. I can see little bits of myself reflected in the liquid metals and the diamonds floating on top. I see a thousand little-girl faces staring at me, and what occurs to me now—what matters more than anything else today—is the idea that there can be more than two sides in any war.  I don’t know why, but that the biggest revelation of all.  When there are more than two sides, that means that there can be too many sides to count, and one of those sides, standing alone, just happens to be a girl named Ophelia Hanna Hanks. Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "text": "4900 words, short story\nPrayer\nFashion matters. In my soul of souls, I know that the dead things you carry on your body are real, real important. Grandma likes to call me a clotheshorse, which sounds like a good thing. For example, I’ve always known that a quality sweater means the world. I prefer soft organic wools woven around Class-C nanofibers—a nice high collar with sleeves riding a little big but with enough stopping power to absorb back-to-back kinetic charges. I want pants that won’t slice when the shrapnel is thick, and since I won’t live past nineteen, probably, I let the world see that this body’s young and fit. (Morbid maybe, but that’s why I think about death only in little doses.) I adore elegant black boots that ignore rain and wandering electrical currents, and everything under my boots and sweater and pants has to feel silky-good against the most important skin in my world. But essential beyond all else is what I wear on my face, which is more makeup than Grandma likes, and tattooed scripture on the forehead, and sparkle-eyes that look nothing but ordinary. In other words, I want people to see an average Christian girl instead of what I am, which is part of the insurgency’s heart inside Occupied Toronto.\nTo me, guns are just another layer of clothes, and the best day ever lived was the day I got my hands on a barely used, cognitively damaged Mormon railgun. They don’t make that model anymore, what with its willingness to change sides. And I doubt that there’s ever been a more dangerous gun made by the human species. Shit, the boy grows his own ammo, and he can kill anything for hundreds of miles, and left alone he will invent ways to hide and charge himself on the sly, and all that time he waits waits waits for his master to come back around and hold him again.\nI am his master now.\nI am Ophelia Hanna Hanks, except within my local cell, where I wear the randomly generated, perfectly suitable name:\nRidiculous.\nThe gun’s name is Prophet, and until ten seconds ago, he looked like scrap conduit and junk wiring. And while he might be cognitively impaired, Prophet is wickedly loyal to me. Ten days might pass without the two of us being in each other’s reach, but that’s the beauty of our dynamic: I can live normal and look normal, and while the enemy is busy watching everything else, a solitary fourteen-year-old girl slips into an alleyway that’s already been swept fifty times today.\n“Good day, Ridiculous.”\n“Good day to you, Prophet.”\n“And who are we going to drop into Hell today?”\n“All of America,” I say, which is what I always say.\nReliable as can be, he warns me, “That’s a rather substantial target, my dear. Perhaps we should reduce our parameters.”\n“Okay. New Fucking York.”\nOur attack has a timetable, and I have eleven minutes to get into position.\n“And the specific target?” he asks.\nI have coordinates that are updated every half-second. I could feed one or two important faces into his menu, but I never kill faces. These are the enemy, but if I don’t define things too closely, then I won’t miss any sleep tonight.\nProphet eats the numbers, saying, “As you wish, my dear.”\nI’m carrying him, walking fast towards a fire door that will stay unlocked for the next ten seconds. Alarmed by my presence, a skinny rat jumps out of one dumpster, little legs running before it hits the oily bricks.\n“Do you know it?” I ask.\nThe enemy likes to use rats as spies.\nProphet says, “I recognize her, yes. She has a nest and pups inside the wall.”\n“Okay,” I say, feeling nervous and good.\nThe fire door opens when I tug and locks forever once I step into the darkness.\n“You made it,” says my gun.\n“I was praying,” I report.\nHe laughs, and I laugh too. But I keep my voice down, stairs needing to be climbed and only one of us doing the work.\nShe found me after a battle. She believes that I am a little bit stupid. I was damaged in the fight and she imprinted my devotions to her, and then using proxy tools and stolen wetware, she gave me the cognitive functions to be a loyal agent to the insurgency.\nI am an astonishing instrument of mayhem, and naturally her superiors thought about claiming me for themselves.\nBut they didn’t.\nIf I had the freedom to speak, I would mention this oddity to my Ridiculous. “Why would they leave such a prize with little you?”\n“Because I found you first,” she would say.\n“War isn’t a schoolyard game,” I’d remind her.\n“But I made you mine,” she might reply. “And my bosses know that I’m a good soldier, and you like me, and stop being a turd.”\nNo, we have one another because her bosses are adults. They are grown souls who have survived seven years of occupation, and that kind of achievement doesn’t bless the dumb or the lucky. Looking at me, they see too much of a blessing, and nobody else dares to trust me well enough to hold me.\nI know all of this, which seems curious.\nI might say all of this, except I never do.\nAnd even though my mind was supposedly mangled, I still remember being crafted and calibrated in Utah, hence my surname. But I am no Mormon. Indeed, I’m a rather agnostic soul when it comes to my interpretations of Jesus and His influence in the New World. And while there are all-Mormon units in the US military, I began my service with Protestants—Baptists and Missouri Synods mostly. They were bright clean happy believers who had recently arrived at Fort Joshua out on Lake Ontario. Half of that unit had already served a tour in Alberta, guarding the tar pits from little acts of sabotage. Keeping the Keystones safe is a critical but relatively simple duty. There aren’t many people to watch, just robots and one another. The prairie was depopulated ten years ago, which wasn’t an easy or cheap process; American farmers still haven’t brought the ground back to full production, and that’s one reason why the Toronto rations are staying small.\nBut patrolling the corn was easy work compared to sitting inside Fort Joshua, millions of displaced and hungry people staring at your walls.\nAmericans call this Missionary Work.\nInside their own quarters, alone except for their weapons and the Almighty, soldiers try to convince one another that the natives are beginning to love them. Despite a thousand lessons to the contrary, Canada is still that baby brother to the north, big and foolish but congenial in his heart, or at least capable of learning manners after the loving sibling delivers enough beat-downs.\nWhat I know today—what every one of my memories tells me—is that the American soldiers were grossly unprepared. Compared to other units and other duties, I would even go so far as to propose that the distant generals were aware of their limitations yet sent the troops across the lake regardless, full of religion and love for each other and the fervent conviction that the United States was the empire that the world had always deserved.\nCanada is luckier than most. That can’t be debated without being deeply, madly stupid. Heat waves are killing the tropics. Acid has tortured the seas. The wealth of the previous centuries has been erased by disasters of weather and war and other inevitable surprises. But the worst of these sorrows haven’t occurred in the Greater United States, and if they had half a mind, Canadians would be thrilled with the mild winters and long brilliant summers and the supportive grip of their big wise master.\nMy soldiers’ first recon duty was simple: Walk past the shops along Queen.\nLike scared warriors everywhere, they put on every piece of armor and every sensor and wired back-ups that would pierce the insurgent’s jamming. And that should have been good enough. But by plan or by accident, some native let loose a few molecules of VX gas—just enough to trigger one of the biohazard alarms. Then one of my brother-guns was leveled at a crowd of innocents, two dozen dead before the bloody rain stopped flying.\nThat’s when the firefight really began.\nKinetic guns and homemade bombs struck the missionaries from every side. I was held tight by my owner—a sergeant with commendations for his successful defense of a leaky pipeline—but he didn’t fire me once. His time was spent yelling for an orderly retreat, pleading with his youngsters to find sure targets before they hit the buildings with hypersonic rounds. But despite those good smart words, the patrol got itself trapped. There was a genuine chance that one of them might die, and that’s when those devout men encased in body armor and faith decided to pray: Clasping hands, they opened channels to the Almighty, begging for thunder to be sent down on the infidels.\nThe Almighty is what used to be called the Internet—an American child reclaimed totally back in 2027.\nA long stretch of shops and old buildings was struck from the sky.\nThat’s what American soldiers do when the situation gets dicey. They pray, and the locals die by the hundreds, and the biggest oddity of that peculiar day was how the usual precise orbital weaponry lost its way, and half of my young men were wounded or killed in the onslaught while a tiny shaped charge tossed me a hundred meters down the road.\nThere I was discovered in the rubble by a young girl.\nAs deeply unlikely as that seems.\nI don’t want the roof. I don’t need my eyes to shoot. An abandoned apartment on the top floor is waiting for me, and in particular, its dirty old bathroom. As a rule, I like bathrooms. They’re the strongest part of any building, what with pipes running through the walls and floor. Two weeks ago, somebody I’ll never know sealed the tube’s drain and cracked the faucet just enough for a slow drip, and now the water sits near the brim. Water is essential for long shots. With four minutes to spare, I deploy Prophet’s long legs, tipping him just enough toward the southeast, and then I sink him halfway into the bath, asking, “How’s that feel?”\n“Cold,” he jokes.\nWe have three and a half minutes to talk.\nI tell him, “Thank you.”\nHis barrel stretches to full length, its tip just short of the moldy plaster ceiling. “Thank you for what?” he says.\n“I don’t know,” I say.\nThen I laugh, and he sort of laughs.\nI say, “I’m not religious. At least, I don’t want to be.”\n“What are you telling me, Ridiculous?”\n“I guess . . . I don’t know. Forget it.”\nAnd he says, “I will do my very best.”\nUnder the water, down where the breech sits, ammunition is moving. Scrap metal and scrap nano-fibers have been woven into four bullets. Street fights require hundreds and thousands of tiny bullets, but each of these rounds is bigger than most carrots and shaped the same general way. Each one carries a brain and microrockets and eyes. Prophet is programming them with the latest coordinates while running every last-second test. Any little problem with a bullet can mean an ugly shot, or even worse, an explosion that rips away the top couple floors of this building.\nAt two minutes, I ask, “Are we set?”\n“You’re standing too close,” he says.\n“If I don’t move, will you fire anyway?”\n“Of course.”\n“Good,” I say.\nAt ninety-five seconds, ten assaults are launched across southern Ontario. The biggest and nearest is fixated on Fort Joshua—homemade cruise missiles and lesser railguns aimed at that artificial island squatting in our beautiful lake. The assaults are meant to be loud and unexpected, and because every soldier thinks his story is important, plenty of voices suddenly beg with the Almighty, wanting His godly hand.\nThe nearby battle sounds like a sudden spring wind.\n“I’m backing out of here,” I say.\n“Please do,” he says.\nAt sixty-one seconds, most of the available American resources are glancing at each of these distractions, and a brigade of AIs is studying past tendencies and elaborate models of insurgency capabilities, coming to the conclusion that these events have no credible value toward the war’s successful execution.\nSomething else is looming, plainly.\n“God’s will,” says the nonbeliever.\n“What isn’t?” says the Mormon gun.\nAt seventeen seconds, two kilometers of the Keystone John pipeline erupt in a line of smoky flame, microbombs inside the heated tar doing their best to stop the flow of poisons to the south.\nThe Almighty doesn’t need prayer to guide His mighty hand. This must be the main attack, and every resource is pulled to the west, making ready to deal with even greater hazards.\nI shut the bathroom door and run for the hallway.\nProphet empties his breech, the first carrot already moving many times faster than the speed of sound as it blasts through the roof. Its three buddies are directly behind it, and the enormous release of stored energy turns the bathwater to steam, and with the first shot the iron tub is yanked free of the floor while the second and third shots kick the tub and the last of its water down into the bathroom directly downstairs. The final shot is going into the wrong part of the sky, but that’s also part of the plan. I’m not supposed to be amazed by how many factors can be juggled at once, but they are juggled and I am amazed, running down the stairs to recover my good friend.\nThe schedule is meant to be secret and followed precisely. The Secretary of Carbon rides her private subway car to the UN, but instead of remaining indoors and safe, she has to come into the sunshine, standing with ministers and potentates who have gathered for this very important conference. Reporters are sitting in rows and cameras will be watching from every vantage point, and both groups are full of those who don’t particularly like the Secretary. Part of her job is being despised, and fuck them. That’s what she thinks whenever she attends these big public dances. Journalists are livestock, and this is a show put on for the meat. Yet even as the scorn builds, she shows a smile that looks warm and caring, and she carries a strong speech that will last for three minutes, provided she gives it. Her words are meant to reassure the world that full recovery is at hand. She will tell everyone that the hands of her government are wise and what the United States wants is happiness for every living breathing wonderful life on this great world—a world that with God’s help will live for another five billion years.\nFor the camera, for the world, the Secretary of Carbon and her various associates invest a few moments in handshakes and important nods of the head.\nWatching from a distance, without knowing anything, it would be easy to recognize that the smiling woman in brown was the one in charge.\nThe UN president shakes her hand last and then steps up to the podium. He was installed last year after an exhaustive search. Handsome and personable, and half as bright as he is ambitious, the President greets the press and then breaks from the script, shouting a bland “Hello” to the protestors standing outside the blast screens.\nFive thousand people are standing in the public plaza, holding up signs and generated holos that have one clear message:\n“END THE WARS NOW.”\nThe Secretary knows the time and the schedule, and she feels a rare ache of nervousness, of doubt.\nWhen they hear themselves mentioned, the self-absorbed protestors join together in one rehearsed shout that carries across the screens. A few reporters look at the throng behind them. The cameras and the real professionals focus on the human subjects. This is routine work. Reflexes are numb, minds lethargic. The Secretary picks out a few familiar faces, and then her assistant pipes a warning into her sparkle-eyes. One of the Keystones has been set on fire.\nIn reflex, the woman takes one step backward, her hands starting to lift to cover her head.\nA mistake.\nBut she recovers soon enough, turning to her counterpart from Russia, telling him, “And congratulations on that new daughter of yours.”\nHe is flustered and flattered. With a giddy nod, he says, “Girls are so much better than boys these days. Don’t you think?”\nThe Secretary has no chance to respond.\nA hypersonic round slams through the atmosphere, heated to a point where any impact will make it explode. Then it drops into an environment full of clutter and one valid target that must be acquired and reached before the fabulous energies shake loose from their bridle.\nThere is no warning sound.\nThe explosion lifts bodies and pieces of bodies, and while the debris rises, three more rounds plunge into the panicked crowd.\nEvery person in the area drops flat, hands over their heads.\nCameras turn, recording the violence and loss—more than three hundred dead and maimed in a horrific attack.\nThe Secretary and new father lie together on the temporary stage.\nIs it her imagination, or is the man trying to cop a feel?\nShe rolls away from him, but she doesn’t stand yet. The attack is finished, but she shouldn’t know that. It’s best to remain down and act scared, looking at the plaza, the air filled with smoke and pulverized concrete while the stubborn holos continue to beg for some impossible gift called Peace.\nMy grandmother is sharp. She is. Look at her once in the wrong way, and she knows something is wrong. Do it twice and she’ll probably piece together what makes a girl turn quiet and strange.\nBut not today, she doesn’t.\n“What happened at school?” she asks.\nI don’t answer.\n“What are you watching, Ophelia?”\nNothing. My eyes have been blank for half a minute now.\n“Something went wrong at school, didn’t it?”\nNothing is ever a hundred percent right at school, which is why it’s easy to harvest a story that might be believed. Most people would believe it, at least. But after listening to my noise about snippy friends and broken trusts, she says, “I don’t know what’s wrong with you, honey. But that isn’t it.”\nI nod, letting my voice die away.\nShe leaves my little room without closing the door. I sit and do nothing for about three seconds, and then the sparkle eyes take me back to the mess outside the UN. I can’t count the times I’ve watched the impacts, the carnage. Hundreds of cameras were working, government cameras and media cameras and those carried by the protesters. Following at the digitals’ heels are people talking about the tragedy and death tolls and who is responsible and how the war has moved to a new awful level.\n“Where did the insurgents get a top-drawer railgun?” faces ask.\nBut I’ve carried Prophet for a couple years and fired him plenty of times. Just not into a public target like this, and with so many casualties, and all of the dead on my side of the fight.\nThat’s the difference here: The world suddenly knows about me.\nIn the middle of the slaughter, one robot camera stays focused on my real targets, including the Secretary of Fuel and Bullshit. It’s halfway nice, watching her hunker down in terror. Except she should have been in pieces, and there shouldn’t be a face staring in my direction, and how Prophet missed our target by more than fifty meters is one big awful mystery that needs solving.\nI assume a malfunction.\nI’m wondering where I can take him to get his guidance systems recalibrated and ready for retribution.\nUnless of course the enemy has figured out how to make railgun rounds fall just a little wide of their goals, maybe even killing some troublemakers in the process.\nWhatever is wrong here, at least I know that it isn’t my fault.\nThen some little thing taps at my window.\nFrom the next room, my grandmother asks, “What are you doing, Ophelia?”\nI’m looking at the bird on my window sill. The enemy uses rats, and we use robins and house sparrows. But this is a red-headed woodpecker, which implies rank and special circumstances.\nThe bird gives a squawk, which is a coded message that my eyes have to play with for a little while. Then the messenger flies away.\n“Ophelia?”\n“I’m just thinking about a friend,” I shout.\nShe comes back into my room, watching my expression all over again.\n“A friend, you say?”\n“He’s in trouble,” I say.\n“Is that what’s wrong?” she asks.\n“Isn’t that enough?”\nTwo rats in this alley don’t convince me. I’m watching them from my new haven, measuring the dangers and possible responses. Then someone approaches the three of us, and in the best tradition of ratdom, my companions scurry into the darkness under a pile of rotting boards.\nI am a plastic sack filled with broken machine parts.\nI am motionless and harmless, but in my secret reaches, inside my very busy mind, I’m astonished to see my Ridiculous back again so soon, walking toward the rat-rich wood pile.\nFive meters behind her walks an unfamiliar man.\nTo him, I take an immediate dislike.\nHe looks prosperous, and he looks exceptionally angry, wearing a fine suit made stiff with nano-armor and good leather shoes and a platoon of jamming equipment as well as two guns riding in his pockets, one that shoots poisoned ice as well as the gun that he trusts—a kinetic beast riding close to his dominant hand.\nRidiculous stops at the rot pile.\nThe man asks, “Is it there?”\n“I don’t know,” she says, eyes down.\nMy girl has blue sparkle eyes, much like her original eyes—the ones left behind in the doctor’s garbage bin.\n“It looks like boards now?” he asks.\n“He did,” she lies.\n“Not he,” the man says, sounding like a google-head. “The machine is an It.”\n“Right,” she says, kicking at the planks, pretending to look hard. “It’s just a big gun. I keep forgetting.”\nThe man is good at being angry. He has a tall frightful face and neck muscles that can’t stop being busy. His right hand thinks about the gun in his pocket. The fingers keep flexing, wanting to grab it.\nHis gun is an It.\nI am not.\n“I put it here,” she says.\nShe put me where I am now, which tells me even more.\n“Something scared it,” she says. “And now it’s moved to another hiding place.”\nThe man says, “Shit.”\nSlowly, carefully, he turns in a circle, looking at the rubble and the trash and the occasional normal object that might still work or might be me. Then with a tight slow voice, he says, “Call for it.”\n“Prophet,” she says.\nI say nothing.\n“How far could it move?” he asks.\n“Not very,” she says. “The firing drained it down to nothing, nearly. And it hasn’t had time to feed itself, even if it’s found food.”\n“Bullshit,” he says, coming my way.\nRidiculous watches me and him, the tattooed Scripture above her blue eyes dripping with sweat. Then the man kneels beside me, and she says, “I put the right guidance codes into him.”\n“You said that already.” Then he looks back at her, saying, “You’re not in trouble here. I told you that already.”\nHis voice says a lot.\nI have no power. But when his hands reach into my sack, what resembles an old capacitor cuts two of his fingers, which is worth some cursing and some secret celebration.\nRidiculous’s face is twisted with worry, up until he looks back at her again. Then her expression turns innocent, pure and pretty and easy to believe.\nGood girl, I think.\nThe man rises and pulls out the kinetic gun and shoots Ridiculous in the chest. If not for the wood piled up behind her, she would fly for a long distance. But instead of flying, she crashes and pulls down the wood around her, and one of those very untrustworthy rats comes out running, squeaking as it flees.\nRidiculous sobs and rolls and tries saying something.\nHe shoots her in the back, twice, and then says, “We never should have left it with you. All that luck dropping into our hands, which was crazy. Why should we have trusted the gun for a minute?”\nShe isn’t dead, but her ribs are broken. And by the sound of it, the girl is fighting to get one good breath.\n“Sure, it killed some bad guys,” he says. “That’s what a good spy does. He sacrifices a few on his side to make him look golden in the enemy’s eyes.”\nI have no strength.\n“You can’t have gone far,” he tells the alley. “We’ll drop ordinance in here, take you out with the rats.”\nI cannot fight.\n“Or you can show yourself to me,” he says, the angry face smiling now. “Reveal yourself and we can talk.”\nRidiculous sobs.\nWhat is very easy is remembering the moment when she picked up me out of the bricks and dust and bloodied bits of human meat.\nHe gives my sack another good kick, seeing something.\nAnd for the first time in my life, I pray. Just like that, as easy as anything, the right words come out of me, and the man bending over me hears nothing coming and senses nothing, his hands playing with my pieces when a fleck of laser light falls out of the sky and turns the angriest parts of his brain into vapor, into a sharp little pop.\nI’m still not breathing normally. I’m still a long way from being able to think straight about anything. Gasping and stupid, I’m kneeling in a basement fifty meters from where I nearly died, and Prophet is suckling on an unsecured outlet, endangering both of us. But he needs power and ammunition, and I like the damp dark in here, waiting for my body to come back to me.\n“You are blameless,” he says.\nI don’t know what that means.\nHe says, “You fed the proper codes into me. But there were other factors, other hands, and that’s where the blame lies.”\n“So you are a trap,” I say.\n“Somebody’s trap,” he says.\n“The enemy wanted those civilians killed,” I say, and then I break into the worst-hurting set of coughs that I have ever known.\nHe waits.\n“I trusted you,” I say.\n“But Ridiculous,” he says.\n“Shut up,” I say.\n“Ophelia,” he says.\nI hold my sides, sipping my breaths.\n“You assume that this war has two sides,” he says. “But there could be a third player at large, don’t you see?”\n“What should I see?”\n“Giving a gun to their enemies is a huge risk. If the Americans wanted to kill their political enemies, it would be ten times easier to pull something out of their armory and set it up in the insurgency’s heart.”\n“Somebody else planned all of this, you’re saying.”\n“I seem to be proposing that, yes.”\n“But that man who came with me today, the one you killed . . . he said the Secretary showed us a lot with her body language. She knew the attack was coming. She knew when it would happen. Which meant that she was part of the planning, which was a hundred percent American.”\n“Except whom does the enemy rely on to make their plans?”\n“Tell me,” I say.\nTalking quietly, making the words even more important, he says, “The Almighty.”\n“What are we talking about?” I ask.\nHe says nothing, starting to change his shape again.\n“The Internet?” I ask. “What, you mean it’s conscious now? And it’s working its own side in this war?”\n“The possibility is there for the taking,” he says.\nBut all I can think about are the dead people and those that are hurt and those that right now are sitting at their dinner table, thinking that some fucking Canadian bitch has made their lives miserable for no goddamn reason.\n“You want honesty,” Prophet says.\n“When don’t I?”\nHe says, “This story about a third side . . . it could be a contingency buried inside my tainted software. Or it is the absolute truth, and the Almighty is working with both of us, aiming toward some grand, glorious plan.”\nI am sort of listening, and sort of not.\nProphet is turning shiny, which happens when his body is in the middle of changing shapes. I can see little bits of myself reflected in the liquid metals and the diamonds floating on top. I see a thousand little-girl faces staring at me, and what occurs to me now—what matters more than anything else today—is the idea that there can be more than two sides in any war.\nI don’t know why, but that the biggest revelation of all.\nWhen there are more than two sides, that means that there can be too many sides to count, and one of those sides, standing alone, just happens to be a girl named Ophelia Hanna Hanks.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "source": "https://clarkesworldmagazine.com/reed_05_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Prayer by Robert Reed"}