{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "X5WSsDX0zItjHc0tF9KkBbSTU9w=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Meisner Technique, Alien Consciousness, and Bathrobes: A Conversation with Wesley Chu  In an era where every aspect of our online and public lives is being tracked, the last remaining bastion of privacy might only be within our own minds. But what happens when an alien invader takes up residence within your consciousness, hears your thoughts, and can occasionally control your body? That’s something Wesley Chu has thought long and hard about.  The Fall of Io is the newest entry into Chu’s Io series of novels. The world is in disarray, an alien presence is governing large swaths of the Earth, and whole populations of humans are scrounging around simply to live. The Fall of Io follows Ella, a con-woman who inadvertently finds herself with an alien hitchhiker taking up residence within her mind. Io and Ella must work together to survive in an increasingly hostile world. Told with Chu’s unmistakable sense of humor, style, and adventure, The Fall of Io is an excellent edition to Chu’s ever-expanding world.  Wesley Chu is the author of numerous novels. He is the recipient of the John W. Campbell Best New Writer Award and his debut novel The Lives of Tao won him a Young Adult Library Services Association Alex Award. His latest novel is The Fall of Io, available now from Angry Robot.   When did you realize you wanted to be a writer and that you could finish a book?  I realized I wanted to be a writer in second grade when I wrote my first short story about our solar system. It was something along the lines of how all the planets used to collide with each other, thus explaining how they have all those impact craters. The King Sun got annoyed with all of their accidents and imposed gravity upon them to put them in their place.  My English professor father read the story. His reply was, “Son, this doesn’t suck” which is high praise in old-world Asian parenting speak. That’s when I first got the idea to try to become a writer. In hindsight, I wish my parents gave me the idea to try to become rich instead.  You’ve written multiple books. How has your approach to writing changed now that you have a couple of them under your belt?  I often say that every book I’m writing is the hardest book I’ve ever written. That held true for my debut novel The Lives of Tao, and it holds true for my current book, The Walking Dead: Typhoon, which will be my 11th book. (Holy crap I’ve written 11 books!)  Every book has its own challenges, and I guarantee at some point during the drafting process I will think this book sucks. I’ll hate the manuscript and then realize I have no idea what the hell I’m doing. Then I'll panic, eat a shit ton of ice cream, and start updating my resume. This happens with every single damn book. It’s like clockwork.  The difference between wide-eyed-optimistic-debut Wes versus grizzled-jaded-midlist Wes is that I’ve done this song and dance before. Eleven freaking times in fact. I know that the first chapter will be a hard slog that I will end up rewriting anyway. At 15k words, I will think the story is incoherent. At around the 60%-70% mark, I will think the plot is disjointed because that’s the point I need to stop asking questions and start answering them.  The process of writing a book is like the writer’s journey (as opposed to the hero’s), and while the feelings of incompetence, insecurity, and stupidity might never go away, at least I know it’s just part of my process. And that makes all the difference.  One standout of The Fall of Io is the setting. It’s deep and complex. It feels like a thought out extrapolation from the present. How did you go about crafting the world?  There is a type of acting approach called the Meisner technique. This technique trains an actor to react instinctively to their surroundings, which includes the setting as well as other characters. Once the actor gets out of their head and into their environment, it becomes much easier to have more honest and organic reactions.  That’s what I do with worldbuilding. The worst thing you can do is treat your environment like just a space that characters stand in. The world isn’t just a setting, it’s also a character. Each person in this world must have a specific and unique relationship with it. They must have history and opinions and biases, so whatever happens in this world must affect them in a way that only applies to them.  To do this, I spend a lot of time researching and explaining the cause and effects of my settings. Why is this world the way it is, and how has that influenced my characters’ views. Once I can establish that relationship, I just let my characters sandbox it out.  Voice plays an integral role for all of your characters in this book. How did you settle on the particular cadences or vocal signifiers for each character’s dialogue?  The honest answer is every time I come up with a new character, they pop into my head fully formed like Athena from the head of Zeus. I then treat these characters like improv actors and just toss them into the scene.  Characters are generally worthless if they don’t make everyone around them more interesting, so I’m always imagining these crazy personalities that have things to offer the people they interact with. If the character helps build the scene, I keep them in. If they don’t, I snap my fingers and destroy them and then start over from scratch.  Your book features locations around the world. Did you do any traveling to research this book?  On-location research is amazing. No amount of googling can pick up the nuances of what makes a place unique. Sometimes you just have to be there to pick up the scents and noises and interactions. You have to feel the elevation and wade into the details.  Unfortunately, it’s not very practical. These days, googling is mostly sufficient. Since I can’t afford to travel to every location, I approach it the other way around and write into my books places that have inspired me.  I hiked Kilimanjaro a few years back and that place completely blew my mind away. By the time I finished the seven-day trek, I had mentally outlined a complete novel. One of these days, I’m going to dig it out of my head.  You’ve said that Time Salvager started out as a stand-alone novel then developed into a trilogy. Is that the same thing that happened with the first book in the Io series?  The Io books have always been set up as a trilogy. In fact, it’s a planned second trilogy in a three trilogy arc for the Tao/Io universe. Whether I get to tell this nine novel/two novella complete arc is another matter. That’s the thing about publishing. You never know if you will get the chance to finish the entire story. That’s one of the reasons why my Tao/Io trilogies have their own complete arcs.  Humor has always played a part in your novels. How has your sense of writing humor evolved since writing the Tao series?  I admit that I’m a LOT darker now. Part of it is the real world feels a lot grimmer since when I wrote The Lives of Tao. Part of it is that writing careers generally tend to make a person a lot more angsty. Or maybe I’m becoming that crabby old dude wearing his bathrobe swinging my rope dart at kids who get on my lawn.  I’ve read that dreams have inspired a number of your plots. Is that the case with the Io series?  That is not the case. It’s true that several of my new story ideas stem from dreams, especially my Time Salvager books. Existing properties, however, are a whole different beast and require a lot more conscious planning.  I wrote the Tao books with a very specific narrative and tone. I guess I could have turned it episodic and wrote the weekly adventures of Roen & Tao. Instead, I opted to put them in a completely different situation every book, which is why so many years have passed between each Tao book.  I wanted the same for the Io books. Ella and Io’s relationship almost as opposite to Roen and Tao as you can get. That is entirely by design so the readers don’t feel like they’re rehashing the same stories over and over again.  Would you welcome an all-knowing alien consciousness into your own mind?  Um, maybe? Probably? No, definitely. It’s kind of like being offered a chance to go to Mars, knowing it will probably suck and definitely not end well. But . . . how can you say no? It’s a unique and special opportunity that few other people in the world will get to experience. So come at me, alien. I’m ready to get my host on.  Let me take that back. Unless you know the alien is going to eat your brain or turn you into a mindless zombie or something. Then yeah I probably wouldn’t welcome it into my mind.  Do you still wear a bathrobe while you write?  I wore my bathrobe while I mowed my lawn the other day with a manual mower so, yeah. I’m eagerly waiting for the day it’s socially acceptable to leave my property wearing my bathrobe and not get arrested.  I feel like the bathrobe is an often misunderstood and underutilized piece of clothing. It’s soft, it’s warm, and it’s versatile. Why aren’t we as a society wearing it for more occasions? I guarantee there would be a lot less crime if everyone was walking around in a comfortable thick terry cloth bathrobe.  What projects are you working on next?  I’ve been working under book contracts since I debuted in 2013, publishing on average two books a year. Starting in March 2019, I will have officially fulfilled all of my book deals and finally be a free man to write whatever the hell I want.  There’s been a story that’s been simmering in my head for four years. I’ve never had the time or the skill to tell it until now. I plan to spend the next two years working on this project. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nThe Meisner Technique, Alien Consciousness, and Bathrobes: A Conversation with Wesley Chu\nIn an era where every aspect of our online and public lives is being tracked, the last remaining bastion of privacy might only be within our own minds. But what happens when an alien invader takes up residence within your consciousness, hears your thoughts, and can occasionally control your body? That’s something Wesley Chu has thought long and hard about.\nThe Fall of Io is the newest entry into Chu’s Io series of novels. The world is in disarray, an alien presence is governing large swaths of the Earth, and whole populations of humans are scrounging around simply to live. The Fall of Io follows Ella, a con-woman who inadvertently finds herself with an alien hitchhiker taking up residence within her mind. Io and Ella must work together to survive in an increasingly hostile world. Told with Chu’s unmistakable sense of humor, style, and adventure, The Fall of Io is an excellent edition to Chu’s ever-expanding world.\nWesley Chu is the author of numerous novels. He is the recipient of the John W. Campbell Best New Writer Award and his debut novel The Lives of Tao won him a Young Adult Library Services Association Alex Award. His latest novel is The Fall of Io, available now from Angry Robot.\nWhen did you realize you wanted to be a writer and that you could finish a book?\nI realized I wanted to be a writer in second grade when I wrote my first short story about our solar system. It was something along the lines of how all the planets used to collide with each other, thus explaining how they have all those impact craters. The King Sun got annoyed with all of their accidents and imposed gravity upon them to put them in their place.\nMy English professor father read the story. His reply was, “Son, this doesn’t suck” which is high praise in old-world Asian parenting speak. That’s when I first got the idea to try to become a writer. In hindsight, I wish my parents gave me the idea to try to become rich instead.\nYou’ve written multiple books. How has your approach to writing changed now that you have a couple of them under your belt?\nI often say that every book I’m writing is the hardest book I’ve ever written. That held true for my debut novel The Lives of Tao, and it holds true for my current book, The Walking Dead: Typhoon, which will be my 11th book. (Holy crap I’ve written 11 books!)\nEvery book has its own challenges, and I guarantee at some point during the drafting process I will think this book sucks. I’ll hate the manuscript and then realize I have no idea what the hell I’m doing. Then I'll panic, eat a shit ton of ice cream, and start updating my resume. This happens with every single damn book. It’s like clockwork.\nThe difference between wide-eyed-optimistic-debut Wes versus grizzled-jaded-midlist Wes is that I’ve done this song and dance before. Eleven freaking times in fact. I know that the first chapter will be a hard slog that I will end up rewriting anyway. At 15k words, I will think the story is incoherent. At around the 60%-70% mark, I will think the plot is disjointed because that’s the point I need to stop asking questions and start answering them.\nThe process of writing a book is like the writer’s journey (as opposed to the hero’s), and while the feelings of incompetence, insecurity, and stupidity might never go away, at least I know it’s just part of my process. And that makes all the difference.\nOne standout of The Fall of Io is the setting. It’s deep and complex. It feels like a thought out extrapolation from the present. How did you go about crafting the world?\nThere is a type of acting approach called the Meisner technique. This technique trains an actor to react instinctively to their surroundings, which includes the setting as well as other characters. Once the actor gets out of their head and into their environment, it becomes much easier to have more honest and organic reactions.\nThat’s what I do with worldbuilding. The worst thing you can do is treat your environment like just a space that characters stand in. The world isn’t just a setting, it’s also a character. Each person in this world must have a specific and unique relationship with it. They must have history and opinions and biases, so whatever happens in this world must affect them in a way that only applies to them.\nTo do this, I spend a lot of time researching and explaining the cause and effects of my settings. Why is this world the way it is, and how has that influenced my characters’ views. Once I can establish that relationship, I just let my characters sandbox it out.\nVoice plays an integral role for all of your characters in this book. How did you settle on the particular cadences or vocal signifiers for each character’s dialogue?\nThe honest answer is every time I come up with a new character, they pop into my head fully formed like Athena from the head of Zeus. I then treat these characters like improv actors and just toss them into the scene.\nCharacters are generally worthless if they don’t make everyone around them more interesting, so I’m always imagining these crazy personalities that have things to offer the people they interact with. If the character helps build the scene, I keep them in. If they don’t, I snap my fingers and destroy them and then start over from scratch.\nYour book features locations around the world. Did you do any traveling to research this book?\nOn-location research is amazing. No amount of googling can pick up the nuances of what makes a place unique. Sometimes you just have to be there to pick up the scents and noises and interactions. You have to feel the elevation and wade into the details.\nUnfortunately, it’s not very practical. These days, googling is mostly sufficient. Since I can’t afford to travel to every location, I approach it the other way around and write into my books places that have inspired me.\nI hiked Kilimanjaro a few years back and that place completely blew my mind away. By the time I finished the seven-day trek, I had mentally outlined a complete novel. One of these days, I’m going to dig it out of my head.\nYou’ve said that Time Salvager started out as a stand-alone novel then developed into a trilogy. Is that the same thing that happened with the first book in the Io series?\nThe Io books have always been set up as a trilogy. In fact, it’s a planned second trilogy in a three trilogy arc for the Tao/Io universe. Whether I get to tell this nine novel/two novella complete arc is another matter. That’s the thing about publishing. You never know if you will get the chance to finish the entire story. That’s one of the reasons why my Tao/Io trilogies have their own complete arcs.\nHumor has always played a part in your novels. How has your sense of writing humor evolved since writing the Tao series?\nI admit that I’m a LOT darker now. Part of it is the real world feels a lot grimmer since when I wrote The Lives of Tao. Part of it is that writing careers generally tend to make a person a lot more angsty. Or maybe I’m becoming that crabby old dude wearing his bathrobe swinging my rope dart at kids who get on my lawn.\nI’ve read that dreams have inspired a number of your plots. Is that the case with the Io series?\nThat is not the case. It’s true that several of my new story ideas stem from dreams, especially my Time Salvager books. Existing properties, however, are a whole different beast and require a lot more conscious planning.\nI wrote the Tao books with a very specific narrative and tone. I guess I could have turned it episodic and wrote the weekly adventures of Roen & Tao. Instead, I opted to put them in a completely different situation every book, which is why so many years have passed between each Tao book.\nI wanted the same for the Io books. Ella and Io’s relationship almost as opposite to Roen and Tao as you can get. That is entirely by design so the readers don’t feel like they’re rehashing the same stories over and over again.\nWould you welcome an all-knowing alien consciousness into your own mind?\nUm, maybe? Probably? No, definitely. It’s kind of like being offered a chance to go to Mars, knowing it will probably suck and definitely not end well. But . . . how can you say no? It’s a unique and special opportunity that few other people in the world will get to experience. So come at me, alien. I’m ready to get my host on.\nLet me take that back. Unless you know the alien is going to eat your brain or turn you into a mindless zombie or something. Then yeah I probably wouldn’t welcome it into my mind.\nDo you still wear a bathrobe while you write?\nI wore my bathrobe while I mowed my lawn the other day with a manual mower so, yeah. I’m eagerly waiting for the day it’s socially acceptable to leave my property wearing my bathrobe and not get arrested.\nI feel like the bathrobe is an often misunderstood and underutilized piece of clothing. It’s soft, it’s warm, and it’s versatile. Why aren’t we as a society wearing it for more occasions? I guarantee there would be a lot less crime if everyone was walking around in a comfortable thick terry cloth bathrobe.\nWhat projects are you working on next?\nI’ve been working under book contracts since I debuted in 2013, publishing on average two books a year. Starting in March 2019, I will have officially fulfilled all of my book deals and finally be a free man to write whatever the hell I want.\nThere’s been a story that’s been simmering in my head for four years. I’ve never had the time or the skill to tell it until now. I plan to spend the next two years working on this project.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/chu_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Meisner Technique, Alien Consciousness, and Bathrobes: A Conversation with Wesley Chu by Chris Urie"}