{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cat Rambo", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "l2Pl0OyzoOWzDkBoDqG4PgIHtLs=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Peacetalk, Hate Speech  Clarkesworld was kind enough to solicit another essay and so, I’ve been mulling over what to say and letting that reflection guide my reading. A particular reread finally moved me to start jotting things down, prompted by the wealth of empty-headed and hateful rhetoric that’s marked some of the recent dust-ups, certainly in the sphere of SFF readers/writers and sometimes the greater cultural space beyond that.  Here’s something that makes me sad—at a time when there’s so much contention and arguing about fandom, one of the most helpful books is out of print and unavailable electronically. One of the smartest, savviest voices I know was stilled a few years back. Suzette Haden Elgin, who understood how language works, wrote multiple SF works, but also a series on communication that has changed a number of lives, including my own: The Gentle Art of Verbal Self-Defense and the other verbal self-defense books that followed it.  But one of her last books, Peacetalk 101 was a simple little story, with twelve maxims about how to communicate with other people. Before I expand on those maxims, though, and why I think they matter, I want to talk about hate.  The word hateful, or the notion of hating people, in my perception, is mostly seen as a negative, except through the eyes of people who are sadly broken. And yet we all have things we hate, sometimes about ourselves, or something small (peas) or large (a global situation).  When we hate something, at a minimum we reject it and often go further to attack and revile it. Sometimes in the course of that effort we try to get other people to engage with it as well, perhaps in order to change it in some way or to destroy it.  Here is a notable thing about this process, and I want to stress it: Hate is not a state in which critical thought plays a part. Nor is it one that enables communication. Core to my argument is the idea that critical thinking, communication, and empathy are all positives. That it is better to build than to destroy.  This is a wide and wonderful world, and varied are its people. Do you have to love them all? No, but sometimes you have to get along, for the good of us all. That’s a basic lesson we learn early on: there are other people in the world; their right to be here is as strong as ours.  The fact that humans like other humans more if they resemble each other has been proven by studies that also suggest that the degree to which someone doesn’t resemble you affects the dislike’s intensity. Figuring out our points of resemblance is often key to getting along with another person, but just knowing that we’ve got things that are hard-coded in, helps us step beyond that. Asking yourself why you hate someone or something is key to understanding your interactions with them.  Sometimes we normalize hate. We use flippant language about violence and death, because “they’re just words.” But words can and do hurt people. Verbal violence is a real thing, to the point where a child raised in such a traumatic atmosphere can have their physical growth and mental development stunted. An adult can experience chronic pain, migraines and headaches, ulcers, and even heart conditions as a result of repeated verbal stress.  Hurtful words happen all the time. Sometimes the hurt is unintentional on the part of the person doing the hurting, but other times the words have been tweaked to have as much impact as possible, to go to the heart of insecurities with the sureness of a playground taunt. When dealing with writers, that’s often the case. The ability to craft words that touch people is a power; it should be exercised with caution, restraint, and a certain sense of Spiderman-level responsibility.  But some do use hateful words as a mechanism for making friends and influencing people. It’s a strategy that involves sneering or throwing figurative (usually) feces at those not admitted into the inner circle, the outsiders and outcasts, the Sneetches without stars on their bellies. Often those who are the least equipped to fight back. It’s a sad phenomenon, but the allure of belonging to the special tribe or the cool kids’ table is very strong. Add in some of the most addictive drug ever, self-righteousness, and it can get genuinely ugly.  How can you tell when this sort of talk is happening? When it’s the language of cartoon and caricature, identifying people by sticking labels on them, particularly labels those people wouldn’t choose. When it’s dishonest rhetoric, focused on winning an imaginary game rather than building bridges between actual human beings. When it’s full of straw men and labels and sleights of hand rather than significance. When it is the speech of individuals making themselves seem clever, particularly at other peoples’ expense, rather than coherent. The moment a conversation becomes about scoring points at the cost of the other participants, it is no longer a conversation but an accumulation of Internet froth and spittle.  So what is the opposite of hate speech? Communication that builds connections, allows empathy, and increases understanding. Communication that helps people work together to create, rather than to destroy.  Elgin’s book is a slim little thing, a series of incidents in the daily existence of a man named George who’s given up on life. He meets a homeless man. (I am aware that the trope of the magic disadvantaged is problematic. I will simply acknowledge it in passing and otherwise cut Elgin a little slack.) Over the course of a number of days, George learns how to communicate effectively in a way that changes his life and restores his hope. The maxims are simple, and I’m actually going to provide them out of order, because one speaks to the heart of this essay. It’s this:  Choose your communication goals. What do you want out of your part in the great conversation? I want to offer people interested in better communication a set of tools that I’ve found handy and to make people think before typing every once in a while—not so they silence or self-censor, but so they know what their communication goals are and have a reasonable chance of achieving them. Do you want to give information? Persuade the reader? Change their behavior? Help them? That will affect what you say and how you say it.  This is why the tone argument is—at least to my mind—both right and wrong. The truth of an argument is unconnected to the tone in which it’s delivered, and yeah, there are people in the world who will perceive something as hostile no matter what that tone is, but another fact of the matter is that tone affects reception and that’s part of the equation that you have to consider. I will defend to the death the right of someone to sing their truth however they want, to express things and experiences that may otherwise not get sung, but if you want that song to be an act of communication, to be composed of more than one voice, you must consider the key in which the other voices are singing and perhaps bring yours down an octave.  Pay attention. Elgin says, “This is the first thing, the one that has to come before all the others. Nothing else can happen until you honor this First Rule.” Pay attention to what’s going on, not to old grudges or future worries. If you want to practice peace talk, you need to know what the other person is saying. Listen first. Try to understand what’s going on. Then and only then, speak.  So if you’re not listening, if you’re reading this essay in order to react to something entirely different than the words or find fiskable content, you may not get much out of it. I’m writing an essay about how to communicate better, aimed at people who do want to learn how to communicate better, based on Elgin’s theory and my own personal experience and reading. I am well aware other people’s mileage may vary; that’s one reason I’m sharing this particular personal odometer reading.  Reject preconceptions. If there is one thing I have learned, it’s that your expectations of an interaction will shape it. Partly it’s because we perceive what we expect to perceive, sometimes even in the face of evidence to the contrary or perhaps even because of it.  At the same time, the way we behave towards people, even the non-verbal acts—our body language, our posture, our micro expressions—affect the message they’re going to give us, as well as the wrapper that message is packaged in.  Stay in tone is another of Elgin’s precepts. That’s something you can’t do without paying attention. Your communication is more understandable to someone if your tone matches theirs. I’m still not sure I totally grok this in the way that Elgin meant, but I’ll take a stab at it. If you speak to someone using vocabulary and concepts that don’t match theirs, the mismatch will impede understanding. See my starting point about communication goals.  What if their tone is angry or violent? Well, see the next precept.  Take no bait. So hard to do. I know I’ve bitten on an invitingly garnished hook more than once. Not as often as I used to, thank goodness, and it’s usually a situation where polite professionalism and taking everything at face value in order to repel the cannons of sarcasm is the best strategy. See also: flailing around about something over which you have absolutely, totally, indisputably not a gram of control. Because it does absolutely, totally, indisputably not a gram of good and sometimes proves counterproductive.  Preserve face. Let’s start with the concept of face, which is comparable to dignity, perhaps. No one likes to lose face. But here it’s not your face that you’re working to preserve, but the other person’s. Why? Let’s return to that notion of scoring points in the exchange. As soon as you start doing that at someone else’s expense, you have removed the possibility of a win-win communication, one where everyone comes out ahead, which is quite possible when genuine exchanges are taking place.  Choose your metaphors. The metaphors you use speak a great deal about your inner reality. Don’t bring a loaded gun comparison into a peaceful gathering.  The idea that language shapes perception/reality is not a new one. It seems a basic concept, but sometimes the practices that grow from it are the ones that the people who are perfectly happy with how things are right now, thank you very much, find the most mock-worthy. Perhaps because yes, sometimes they do ring oddly or seem a little silly. Perhaps because something at that root level carries a great deal of potential for slow, subtle, strong change.  Trust your inner grammar. This is a precept I’ve had to wrap my head around because I find myself asking—what if your inner grammar is “broken” or at least functions differently than most people’s? But it seems to boil down to this—trust your gut, but make sure it’s your intuition, rather than your insecurities, doing the talking. Your instincts are fine-tuned from decades of exposure to the world around you; you know how communication works, that when you extend a hand towards someone it usually means “friend” rather than “foe.”  Avoid lies. Many absorb this basic precept in childhood (and may or may not live up to it), others pick it up over the course of years, and a few reject it outright as unworthy and unnecessary for their ubermenchy selves. There’s a weird strategy, strengthened and normalized by the Internet, of simply repeating an untruth or gross distortion over and over in order to try to make it true. In my opinion, lying is pretty much the same as hanging a sign around your neck reading “ethically bankrupt to the point of no longer worth dealing with.” I don’t really have anything to say to the folks that see truth as optional.  Anything you feed will grow. If someone is friendly towards you and you are friendly back, that feeling will increase. Conversely, it is possible to not feed stupidity or cruelty. Does that make it go away? Of course not. But it does lessen the growth.  Joy is the skill of skills. In my experience, it is possible to learn to be happier, partially through one’s outlook on and expectations of the Universe. Does joy solve homelessness, sickness, oppression? Well, actually, I do think a more joyful world would pay more attention to social ills.  So—I don’t know, what am I saying about Elgin? That we need more joy and fewer words aimed at cutting people down. That seeing good writers sidetracked or derailed, sometimes made afraid to write their own unique and wonderful experiences, is frustrating, because there should be more genuine communication in the world than less.  Cat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "text": "Non-Fiction\nAnother Word: Peacetalk, Hate Speech\nClarkesworld was kind enough to solicit another essay and so, I’ve been mulling over what to say and letting that reflection guide my reading. A particular reread finally moved me to start jotting things down, prompted by the wealth of empty-headed and hateful rhetoric that’s marked some of the recent dust-ups, certainly in the sphere of SFF readers/writers and sometimes the greater cultural space beyond that.\nHere’s something that makes me sad—at a time when there’s so much contention and arguing about fandom, one of the most helpful books is out of print and unavailable electronically. One of the smartest, savviest voices I know was stilled a few years back. Suzette Haden Elgin, who understood how language works, wrote multiple SF works, but also a series on communication that has changed a number of lives, including my own: The Gentle Art of Verbal Self-Defense and the other verbal self-defense books that followed it.\nBut one of her last books, Peacetalk 101 was a simple little story, with twelve maxims about how to communicate with other people. Before I expand on those maxims, though, and why I think they matter, I want to talk about hate.\nThe word hateful, or the notion of hating people, in my perception, is mostly seen as a negative, except through the eyes of people who are sadly broken. And yet we all have things we hate, sometimes about ourselves, or something small (peas) or large (a global situation).\nWhen we hate something, at a minimum we reject it and often go further to attack and revile it. Sometimes in the course of that effort we try to get other people to engage with it as well, perhaps in order to change it in some way or to destroy it.\nHere is a notable thing about this process, and I want to stress it: Hate is not a state in which critical thought plays a part. Nor is it one that enables communication. Core to my argument is the idea that critical thinking, communication, and empathy are all positives. That it is better to build than to destroy.\nThis is a wide and wonderful world, and varied are its people. Do you have to love them all? No, but sometimes you have to get along, for the good of us all. That’s a basic lesson we learn early on: there are other people in the world; their right to be here is as strong as ours.\nThe fact that humans like other humans more if they resemble each other has been proven by studies that also suggest that the degree to which someone doesn’t resemble you affects the dislike’s intensity. Figuring out our points of resemblance is often key to getting along with another person, but just knowing that we’ve got things that are hard-coded in, helps us step beyond that. Asking yourself why you hate someone or something is key to understanding your interactions with them.\nSometimes we normalize hate. We use flippant language about violence and death, because “they’re just words.” But words can and do hurt people. Verbal violence is a real thing, to the point where a child raised in such a traumatic atmosphere can have their physical growth and mental development stunted. An adult can experience chronic pain, migraines and headaches, ulcers, and even heart conditions as a result of repeated verbal stress.\nHurtful words happen all the time. Sometimes the hurt is unintentional on the part of the person doing the hurting, but other times the words have been tweaked to have as much impact as possible, to go to the heart of insecurities with the sureness of a playground taunt. When dealing with writers, that’s often the case. The ability to craft words that touch people is a power; it should be exercised with caution, restraint, and a certain sense of Spiderman-level responsibility.\nBut some do use hateful words as a mechanism for making friends and influencing people. It’s a strategy that involves sneering or throwing figurative (usually) feces at those not admitted into the inner circle, the outsiders and outcasts, the Sneetches without stars on their bellies. Often those who are the least equipped to fight back. It’s a sad phenomenon, but the allure of belonging to the special tribe or the cool kids’ table is very strong. Add in some of the most addictive drug ever, self-righteousness, and it can get genuinely ugly.\nHow can you tell when this sort of talk is happening? When it’s the language of cartoon and caricature, identifying people by sticking labels on them, particularly labels those people wouldn’t choose. When it’s dishonest rhetoric, focused on winning an imaginary game rather than building bridges between actual human beings. When it’s full of straw men and labels and sleights of hand rather than significance. When it is the speech of individuals making themselves seem clever, particularly at other peoples’ expense, rather than coherent. The moment a conversation becomes about scoring points at the cost of the other participants, it is no longer a conversation but an accumulation of Internet froth and spittle.\nSo what is the opposite of hate speech? Communication that builds connections, allows empathy, and increases understanding. Communication that helps people work together to create, rather than to destroy.\nElgin’s book is a slim little thing, a series of incidents in the daily existence of a man named George who’s given up on life. He meets a homeless man. (I am aware that the trope of the magic disadvantaged is problematic. I will simply acknowledge it in passing and otherwise cut Elgin a little slack.) Over the course of a number of days, George learns how to communicate effectively in a way that changes his life and restores his hope. The maxims are simple, and I’m actually going to provide them out of order, because one speaks to the heart of this essay. It’s this:\nChoose your communication goals. What do you want out of your part in the great conversation? I want to offer people interested in better communication a set of tools that I’ve found handy and to make people think before typing every once in a while—not so they silence or self-censor, but so they know what their communication goals are and have a reasonable chance of achieving them. Do you want to give information? Persuade the reader? Change their behavior? Help them? That will affect what you say and how you say it.\nThis is why the tone argument is—at least to my mind—both right and wrong. The truth of an argument is unconnected to the tone in which it’s delivered, and yeah, there are people in the world who will perceive something as hostile no matter what that tone is, but another fact of the matter is that tone affects reception and that’s part of the equation that you have to consider. I will defend to the death the right of someone to sing their truth however they want, to express things and experiences that may otherwise not get sung, but if you want that song to be an act of communication, to be composed of more than one voice, you must consider the key in which the other voices are singing and perhaps bring yours down an octave.\nPay attention. Elgin says, “This is the first thing, the one that has to come before all the others. Nothing else can happen until you honor this First Rule.” Pay attention to what’s going on, not to old grudges or future worries. If you want to practice peace talk, you need to know what the other person is saying. Listen first. Try to understand what’s going on. Then and only then, speak.\nSo if you’re not listening, if you’re reading this essay in order to react to something entirely different than the words or find fiskable content, you may not get much out of it. I’m writing an essay about how to communicate better, aimed at people who do want to learn how to communicate better, based on Elgin’s theory and my own personal experience and reading. I am well aware other people’s mileage may vary; that’s one reason I’m sharing this particular personal odometer reading.\nReject preconceptions. If there is one thing I have learned, it’s that your expectations of an interaction will shape it. Partly it’s because we perceive what we expect to perceive, sometimes even in the face of evidence to the contrary or perhaps even because of it.\nAt the same time, the way we behave towards people, even the non-verbal acts—our body language, our posture, our micro expressions—affect the message they’re going to give us, as well as the wrapper that message is packaged in.\nStay in tone is another of Elgin’s precepts. That’s something you can’t do without paying attention. Your communication is more understandable to someone if your tone matches theirs. I’m still not sure I totally grok this in the way that Elgin meant, but I’ll take a stab at it. If you speak to someone using vocabulary and concepts that don’t match theirs, the mismatch will impede understanding. See my starting point about communication goals.\nWhat if their tone is angry or violent? Well, see the next precept.\nTake no bait. So hard to do. I know I’ve bitten on an invitingly garnished hook more than once. Not as often as I used to, thank goodness, and it’s usually a situation where polite professionalism and taking everything at face value in order to repel the cannons of sarcasm is the best strategy. See also: flailing around about something over which you have absolutely, totally, indisputably not a gram of control. Because it does absolutely, totally, indisputably not a gram of good and sometimes proves counterproductive.\nPreserve face. Let’s start with the concept of face, which is comparable to dignity, perhaps. No one likes to lose face. But here it’s not your face that you’re working to preserve, but the other person’s. Why? Let’s return to that notion of scoring points in the exchange. As soon as you start doing that at someone else’s expense, you have removed the possibility of a win-win communication, one where everyone comes out ahead, which is quite possible when genuine exchanges are taking place.\nChoose your metaphors. The metaphors you use speak a great deal about your inner reality. Don’t bring a loaded gun comparison into a peaceful gathering.\nThe idea that language shapes perception/reality is not a new one. It seems a basic concept, but sometimes the practices that grow from it are the ones that the people who are perfectly happy with how things are right now, thank you very much, find the most mock-worthy. Perhaps because yes, sometimes they do ring oddly or seem a little silly. Perhaps because something at that root level carries a great deal of potential for slow, subtle, strong change.\nTrust your inner grammar. This is a precept I’ve had to wrap my head around because I find myself asking—what if your inner grammar is “broken” or at least functions differently than most people’s? But it seems to boil down to this—trust your gut, but make sure it’s your intuition, rather than your insecurities, doing the talking. Your instincts are fine-tuned from decades of exposure to the world around you; you know how communication works, that when you extend a hand towards someone it usually means “friend” rather than “foe.”\nAvoid lies. Many absorb this basic precept in childhood (and may or may not live up to it), others pick it up over the course of years, and a few reject it outright as unworthy and unnecessary for their ubermenchy selves. There’s a weird strategy, strengthened and normalized by the Internet, of simply repeating an untruth or gross distortion over and over in order to try to make it true. In my opinion, lying is pretty much the same as hanging a sign around your neck reading “ethically bankrupt to the point of no longer worth dealing with.” I don’t really have anything to say to the folks that see truth as optional.\nAnything you feed will grow. If someone is friendly towards you and you are friendly back, that feeling will increase. Conversely, it is possible to not feed stupidity or cruelty. Does that make it go away? Of course not. But it does lessen the growth.\nJoy is the skill of skills. In my experience, it is possible to learn to be happier, partially through one’s outlook on and expectations of the Universe. Does joy solve homelessness, sickness, oppression? Well, actually, I do think a more joyful world would pay more attention to social ills.\nSo—I don’t know, what am I saying about Elgin? That we need more joy and fewer words aimed at cutting people down. That seeing good writers sidetracked or derailed, sometimes made afraid to write their own unique and wonderful experiences, is frustrating, because there should be more genuine communication in the world than less.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "source": "https://clarkesworldmagazine.com/another_word_08_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Peacetalk, Hate Speech by Cat Rambo"}