{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kelly Robson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "XwOKfP4MZ7FlQ7uEKVti98ktc/Y=", "id": null, "license": null, "comments": "", "raw_text": "4760 words, short story, REPRINT  Two-Year Man  Getting the baby through security was easy. Mikkel had been smuggling food out of the lab for years. He’d long since learned how to trick the guards.  Mikkel had never been smart, but the guards were four-year men and that meant they were lazy. If he put something good at the top of his lunch pail at the end of his shift, the guards would grab it and never dig deeper. Mikkel let them have the half-eaten boxes of sooty chocolate truffles and stale pastries, but always took something home for Anna.  Most days it was only wrinkled apples and hard oranges, soured milk, damp sugar packets and old teabags. But sometimes he would find something good. Once he’d found a working media player at the bottom of the garbage bin in the eight-year man’s office. He had been so sure the guards would find it and accuse him of stealing that he’d almost tossed it in the incinerator. But he’d distracted the guards with some water-stained skin magazines from the six-year men’s shower room and brought that media player home to Anna.  She traded it for a pair of space heaters and ten kilos of good flour. They had dumplings for months.  The baby was the best thing he’d ever found. And she was such a good girl—quiet and still. Mikkel had taken a few minutes to hold her in the warmth beside the incinerator, cuddling her close and listening to the gobble and clack of her strange yellow beak. He swaddled her tightly in clean rags, taking care to wrap her pudgy hands separately so she couldn’t rake her talons across that sweet pink baby belly. Then he put her in the bottom of his plastic lunch pail, layered a clean pair of janitor’s coveralls over her, and topped the pail with a box of day-old pastries he’d found in the six-year men’s lounge.  “Apple strudel,” grunted Hermann, the four-year man in charge of the early morning guard shift. “Those pasty scientists don’t know good eats. Imagine leaving strudel to sit.”  “Cafe Sluka has the best strudel in Vienna, so everyone says,” Mikkel said as he passed through the security gate.  “Like you’d know, moron. Wouldn’t let you through the door.”  Mikkel ducked his head and kept his eyes on the floor. “I heated them in the microwave for you.”  He rushed out into the gray winter light as the guards munched warm strudel.  Mikkel checked the baby as soon as he rounded the corner, and then kept checking her every few minutes on the way home. He was careful to make sure nobody saw. But the streetcars were nearly empty in the early morning, and nobody would find it strange to see a two-year man poking his nose in his lunch pail.  The baby was quiet and good. Anna would be so pleased. The thought kept him warm all the way home.  Anna was not pleased.  When he showed her the baby she sat right down on the floor. She didn’t say anything—just opened and closed her mouth for a minute. Mikkel crouched at her side and waited.  “Did anyone see you take it?” she asked, squeezing his hand hard, like she always did when she wanted him to pay attention.  “No, sweetheart.”  “Good. Now listen hard. We can’t keep it. Do you understand?”  “She needs a mother,” Mikkel said.  “You’re going to take her back to the lab. Then forget this ever happened.”  Anna’s voice carried an edge Mikkel had never heard before. He turned away and gently lifted the baby out of the pail. She was quivering with hunger. He knew how that felt.  “She needs food,” he said. “Is there any milk left, sweetheart?”  “It’s no use, Mikkel. She’s going to die anyway.”  “We can help her.”  “The beak is a bad taint. If she were healthy they would have kept her. Sent her to a crèche.”  “She’s strong.” Mikkel loosened the rags. The baby snuffled and her sharp blue tongue protruded from the pale beak. “See? Fat and healthy.”  “She can’t breathe.”  “She needs us.” Why didn’t Anna see that? It was so simple.  “You can take her back tonight.”  “I can’t. My lunch pail goes through the X-ray machine. The guards would see.”  If Anna could hold the baby, she would understand. Mikkel pressed the baby to Anna’s chest. She scrambled backward so fast she banged her head on the door. Then she stood and straightened her maid’s uniform with shaking hands.  “I have to go. I can’t be late again.” She pulled on her coat and lunged out the door, then turned and reached out. For a moment he thought she was reaching for the baby and he began to smile. But she just squeezed his hand again, hard.  “You have to take care of this, Mikkel,” she said. “It’s not right. She’s not ours. We aren’t keeping her.”  Mikkel nodded. “See you tonight.”  The only thing in the fridge was a bowl of cold stew. They hadn’t had milk for days. But Mikkel’s breakfast sat on the kitchen table covered with a folded towel. The scrambled egg was still steaming.  Mikkel put a bit of egg in the palm of his hand and blew on it. The baby’s eyes widened and she squirmed. She reached for his hand. Talons raked his wrist and her beak yawned wide. A blue frill edged with red and yellow quivered at the back of her throat.  “Does that smell good? I don’t think a little will hurt.”  He fed her the egg bit by bit. She gobbled it down, greedy as a baby bird. Then he watched her fall asleep while he sipped his cold coffee.  Mikkel wet a paper napkin and cleaned the fine film of mucus from the tiny nostrils on either side of her beak. They were too small, but she could breathe just fine through her mouth. She couldn’t cry, though, she just snuffled and panted. And the beak was heavy. It dragged her head to the side.  She was dirty, smeared with blood from the incineration bin. Her fine black hair was pasted down with a hard scum that smelled like glue. She needed a bath, and warm clothes, and diapers. Also something to cover her hands. He would have to trim the points off her talons.  He held her until she woke. Then he brought both space heaters from the bedroom and turned them on high while he bathed her in the kitchen sink. It was awkward and messy and took nearly two hours. She snuffled hard the whole time, but once he’d dried her and wrapped her in towels she quieted. He propped her up on the kitchen table. She watched him mop the kitchen floor, her bright brown eyes following his every move.  When the kitchen was clean he fetched a half-empty bottle of French soap he’d scavenged from the lab, wrapped the baby up tightly against the cold, and sat on the back stairs waiting for Hyam to come trotting out of his apartment for a smoke.  “What’s this?” Hyam said. “I didn’t know Anna was expecting.”  “She wasn’t.” Mikkel tugged the towel aside.  “Huh,” said Hyam. “That’s no natural taint. Can it breathe?”  “She’s hungry.” Mikkel gave him the bottle of soap.  “Hungry, huh?” Hyam sniffed the bottle. “What do you need?”  “Eggs and milk. Clothes and diapers. Mittens, if you can spare some.”  “I never seen a taint like that. She’s not a natural creature.” Hyam took a long drag on his cigarette and blew it over his shoulder, away from the baby. “You work in that lab, right?”  “Yes.”  Hyam examined the glowing coal at the end of his cigarette.  “What did Anna say when you brought trouble home?”  Mikkel shrugged.  “Did the neighbors hear anything through the walls?”  “No.”  “Keep it that way.” Hyam spoke slowly. “Keep this quiet, Mikkel, you hear me? Keep it close. If anyone asks, you tell them Anna birthed that baby.”  Mikkel nodded.  Hyam pointed with his cigarette, emphasizing every word. “If the wrong person finds out, the whole neighborhood will talk. Then you’ll see real trouble. Four-year men tromping through the building, breaking things, replaying the good old days in the colonies. They like nothing better. Don’t you bring that down on your neighbors.”  Mikkel nodded.  “My wife will like the soap.” Hyam ground out his cigarette and ran up the stairs.  “There now,” Mikkel said. The baby gazed up at him and clacked her beak. “Who says two-year men are good for nothing?”  Four-year men said it all the time. They were everywhere, flashing their regimental badges and slapping the backs of their old soldier friends. They banded together in loud bragging packs that crowded humble folks off busses and streetcars, out of shops and cafés, forcing everyone to give way or get pushed aside.  Six-year men probably said it too, but Mikkel had never talked to one. He saw them working late at the lab sometimes, but they lived in another world—a world filled with sports cars and private clubs. And who knew what eight-year men said? Mikkel cleaned an eight-year man’s office every night, but he’d only ever seen them in movies.  Nobody made movies about two-year men. They said four-year men had honor, six-year men had responsibility, and eight-year men had glory. Two-year men had nothing but shame. But it wasn’t true. Hyam said so.  Two-year men had families—parents, grandparents, uncles and aunts, brothers and sisters, children and wives who depended on them. They had jobs, humble jobs but important all the same. Without two-year men, who would grub away the garbage, crawl the sewers, lay the carpets, clean the chimneys, fix the roofs? Without two-year men there would be nobody to bring in the harvest—no sweet strawberries or rich wines. And most important, Hyam said, without two-year men there would be nobody parents could point at and say to their sons, “Don’t be like him.”  Hyam was smart. He could have been a four-year man easy, even a six-year man. But he was a Jew and that meant a two-year man, almost always. Gypsies too, and Hutterites, and pacifists. Men who couldn’t walk or talk. Even blind men. All drafted and sent to fight and die in the colonies for two years, and then sent home to live in shame while the four-year men fought on. Fought to survive and come home with honor.  Hyam returned swinging a plastic bag in one hand and a carton of eggs in the other. A bottle of milk was tucked under his arm.  “This is mostly diapers,” he said, brandishing the bag. “You’ll never have too many. We spend more on laundry than we do on food.”  “I can wash them by hand.”  “No you can’t, take my word for it.” Hyam laughed and ran up the stairs. “Welcome to fatherhood, Mikkel. You’re a family man now.”  Mikkel laid the baby on the bed. He diapered and dressed the baby, and then trimmed her talons with Anna’s nail scissors. He fitted a sock over each of the baby’s hands and pinned them to her sleeves. Then he wedged Anna’s pillow between the bed and the wall, tucked the baby in his arms, and fell into sleep.  He woke to the clacking of the baby’s beak. She yawned, showing her colorful throat frill. He cupped his hand over her skull and breathed in the milky scent of her skin.  “Let’s get you fed before Mama comes home,” he said.  He warmed milk in the soup pot. A baby needed a bottle when it didn’t have a breast, he knew, but his baby—his clever little girl—held her beak wide and let him tip the milk into her, teaspoon by teaspoon. She swallowed greedily and then demanded more. She ate so fast he could probably just pour the milk in a steady stream down her throat. But milk was too expensive to risk spitting up all over the kitchen floor.  “Mikkel,” said Anna.  She was standing in the doorway in her scarf and coat. Mikkel gathered the baby in his arms and greeted Anna with a kiss like he always did. Her cheek was cold and red.  “How was your day?” he asked. The baby looked from him to Anna and clacked her beak.  Anna wouldn’t look at the baby. “I was late. I got on the wrong bus at the interchange and had to backtrack. Mrs. Spiven says one more time and that’s it for me.”  “You can get another job. A better one. Closer to home.”  “Maybe. Probably not.”  Anna rinsed the soup pot, scooped cold stew into it, and set it on the stove. She was still in her coat and hat. The baby reached out and hooked Anna’s red mitten out of her pocket with the trimmed talon poking through the thin gray knit sock. The mitten dangled from the baby’s hand. Anna ignored it.  “Sweetheart, take off your coat,” Mikkel said.  “I’m cold,” she said. She struck a match and lit the burner.  Mikkel gently pulled on her elbow. She resisted for a moment and then turned. Her face was flushed.  “Sweetheart, look,” he said. Anna dropped her gaze to the floor. The baby clacked her beak and yawned. “I thought we could name her after your mother.”  Anna turned away and stirred the stew. “That’s crazy. I told you we’re not keeping her.”  “She has your eyes.”  The spoon clattered to the floor. Anna swayed. Her elbow hit the pot handle and it tipped. Mikkel steadied it and shut off the flame.  Anna yanked back her chair and fell into it. She thrust her head in her hands for a moment and then sat back. Her eyes were cold and narrow, her voice tight. “Why would you say that? Don’t say that.”  Why couldn’t Anna see? She was smart. So much smarter than him. And he could see it so easily.  Mikkel searched for the right words. “Your eggs. Where did they go?”  “It doesn’t matter. I needed money so I sold my ovaries. That’s the end of it.”  Mikkel ran his fingers over his wife’s chapped hand, felt the calluses on her palm. He would tell her the awful things, and then she would understand.  “I know where your eggs went. I see them in the tanks every night. And in the labs. In the incinerator. I mop their blood off the floor.”  Anna’s jaw clenched. He could tell she was biting the inside of her cheek. “Mikkel. Lots of women sell their ovaries. Thousands of women. They could be anyone’s eggs.”  Mikkel shook his head. “This is your baby. I know it.”  “You don’t know anything. What proof do you have? None.” She laughed once, a barking sound. “And it doesn’t matter anyway because we’re not keeping her. People will find out and take her away. Arrest you and me both, probably. At the very least, we’d lose our jobs. Do you want us to live in the street?”  “We can tell people you birthed her.”  “With that beak?”  Mikkel shrugged. “It happens.”  Anna’s flushed face turned a brighter shade of red. She was trying not to cry. He ached to squeeze her to his chest. She would just pull away, though. Anna would never let him hold her when she cried.  They ate in silence. Mikkel watched the baby sleep on the table between them. Her soft cheek was chubby as any child’s, but it broadened and dimpled as it met the beak, the skin thinning and hardening like a fingernail. The baby snuffled and snot bubbled from one of her tiny nostrils. Mikkel wiped it away with the tip of his finger.  Mikkel checked the clock as Anna gathered the dishes and filled the sink. Only a few minutes before he had to leave for the lab. He snuggled the baby close. Her eyelids fluttered. The delicate eyelash fringes were glued together with mucus.  “You have to go,” said Anna. She put his lunch pail on the table.  “In a minute,” he said. Mikkel dipped his napkin in his water glass and wiped the baby’s eyes.  Anna leaned on the edge of the sink. “Do you know why I married you, Mikkel?”  He sat back, startled. Anna didn’t usually talk like this. He had wondered, often. Anna could have done better. Married a smart man, a four-year man, even.  “Will you tell me, sweetheart?”  “I married you because you said it didn’t matter. I explained I could never have babies and you still wanted me—”  “Of course I want you.”  “I told you why I was barren. Why I sold my ovaries. Do you remember?”  “Your mother was sick. You needed the money.”  “Yes. But I also said it was easy because I never wanted babies. I never wanted to be a mother.” She leaned forward and gripped his shoulders. “I still don’t. Take her back to the lab.”  Mikkel stood. He kissed the baby’s forehead. Then he put the baby in Anna’s arms.  “Her name is Maria,” he said. “After your mother.”  Mikkel was tired walking up the street toward the bus stop. But that was fatherhood. He would get used to it. Anna would get used to being a mother too. He was sure. All women did.  The thought of his wife and child kept him warm all the way to the Josefstadt streetcar station. Then a four-year man shoved an elbow in his ribs and spat on his coat. Mikkel watched the spittle freeze and turn white. He stood shivering at the edge of the curb, taking care to stay out of everyone’s way.  Mikkel relied on Anna’s kindness, sure she would always do the right thing, the generous thing. She was good to him, good to everyone. For ten years she had taken care of him: cooking, cleaning, making their two rooms into a home. In return he did his best to fill those two rooms with love. It was all he could do.  As he stood in the wind at the edge of the station, doubts began to creep in with the cold. Why would Anna say she didn’t want to be a mother? It couldn’t be true. They lived surrounded by families—happy, noisy families—three and four, even five generations all living together. Healthy children, happy mothers, proud fathers. Aunts, uncles, cousins, grandparents. Family everywhere, but he and Anna only had each other.  Anna must regret being barren. Some part of her, buried deep, must long for children. But she said she didn’t, and if it was true, then something in her must be broken.  He had seen broken men during his two years in the colonies, men with whole bodies and broken minds, who said crazy things and hurt themselves, hurt others. Anna could never be like them.  But his doubts grew with every step further from home. By the time he could see the lights of the lab glowing through the falling snow, the doubts were clawing at him. He imagined coming home in the morning to find Anna alone, ready to leave for work, pretending Maria had never been there.  He turned back home, but then one of the four-year men shouted at him through the glass doors.  “You’re late, you stupid ass.”  Mikkel watched his lunch pail slide though the X-ray. The guards ran it back and forth through the machine, just to waste time. Mikkel had to run to the time clock. He stamped his card just as it clicked over to eight.  Normally Mikkel loved the rhythm of work, the scrubbing, mopping, wiping. Even cleaning toilets brought its own reward. He knew the drip of every tap, every scratch on the porcelain and crack in the tiles. He took an inventory of them night by night as he cleaned, taking his time, double-checking every corner for dust, scanning every window and mirror for streaks, even getting down on his knees to swab behind the toilets, scrubbing away any hint of mildew from the grout, finding all the little nooks and crannies.  Tonight he rushed through his work, but each room felt like it took twice as long as usual. He kept checking the time, sure he was falling behind. Thinking about Anna dragged on the clock hands. Worrying made him forgetful, too. He left the four-year men’s bathroom with no memory of cleaning it. He had to go back and check just to be sure.  In the tank room he began to feel better. He loved the noise of the tanks—the bubbling pumps and thumping motors. Here he always took his time, no matter what. It was his favorite place in the whole building. He wasn’t supposed to touch the tanks, but he always took a few extra minutes to polish the steel and glass and check the hose seals. He even tightened the bolts that fixed each heavy tank to the floor and ceiling.  The tinted glass was just transparent enough to show the babies floating inside. Mikkel watched them grow night by night. He kept a special rag just for polishing the tanks, a soft chamois that a six-year man had discarded years ago. It was specially made for precious things—the logo of a sports car company had long since worn off. He always polished the glass with long slow caressing strokes, sure the babies could feel his touch.  Two of the tanks were empty. Mikkel polished them too, in their turn, making them perfect for the next baby. Maria’s tank was in the last row on the far side of the room, two from the end. It was refilled but the baby was still too small to see, just a thin filament dangling from the fleshy organ at the top of the tank.  “Your sister says hello,” Mikkel whispered. “Her mama and papa are proud of her. Maria is going to grow up smart and strong.”  The filament twisted and drifted in the fluid. Mikkel watched it for a few minutes, wondering what Anna and Maria were doing at that moment. He imagined them curled up in bed, skin to skin, the baby’s beak tucked under Anna’s chin. He squeezed his eyes tight and held the image in his mind, as if he could make it real just by wanting it so badly. And for a few minutes it did feel real, an illusion supported by the comforting tank room sounds.  But he couldn’t stay there. As he lugged his bins and pails upstairs to the offices, worry began gnawing at him again.  Women abandoned babies all the time. The mothers and grandmothers in the tenement always had a story to tell about some poor baby left out in the cold by a heartless and unnatural mother. Once, when they were first married, Anna told the woman next door that people did desperate things when they had run out of options. That neighbor still wouldn’t speak to her, years later.  What if Anna bundled Maria up and put her on the steps of some six-year man’s house? Or left her at the train station?  He could see Maria now, tucked into their big kitchen pail and covered with a towel. He could see Anna, her face covered by her red scarf, drop the pail on the edge of the Ostbahnhof express platform and walk away.  No. His Anna would never do that. Never. He wouldn’t think about it anymore. He would pay attention to his work.  On the wide oak table in the eight-year man’s office he found four peach pastries, their brandy jam dried to a crust. The bakery box was crushed in the garbage bin. When he was done cleaning the office he refolded it as best he could and put the pastries back inside. Four was good luck. One for each of the guards. Then he made his way down to the basement.  The incinerator was an iron maw in a brick wall. For years, Mikkel had walked down those concrete steps in the hot red light of its stare to find the sanitary disposal bin bloody but empty, its contents dumped by one of the four-year men who assisted in the labs. Back then, all Mikkel had to do was toss his garbage bags in the incinerator, let them burn down, then switch off the gas, bleach the bin, hose the floor, and mop everything dry.  But now there was a new eight-year man in charge, and Mikkel had to start the incinerator and empty the disposal bin himself.  The light from the overhead bulb was barely bright enough to show the trail of blood snaking from the bin to the drain. Mikkel felt his way to the control panel and began the tricky process of firing up the incinerator. The gas dial was stiff and the pilot light button was loose. He pressed it over and over again, trying to find the right angle on the firing pin. When the incinerator finally blasted to life Mikkel had sweated through his coveralls.  The room lit up with the glow from the incinerator window and he could finally see into the bin. The top layer of bags dripped fluid tinged red and yellow. Most were double- and even triple-bagged, tied with tight knots. But they were torn and leaked. Sharp edges inside the disposal chute hooked and tore on the way down.  Maria had been single-bagged. Her beak had pierced the plastic, ripped it wide enough for her to breathe. And she had landed at the far edge of the bin, mostly upright. If she had been facedown or if another bag had fallen on top of her she could have suffocated.  Mikkel wrenched open the incinerator door and began emptying the bin, carefully picking up each wet bag and throwing it far into the furnace. Some bags were tiny, just a few glass dishes and a smear of wax. One bag was filled with glass plates that spilled through a tear and shattered at his feet. The biggest bags held clear fluid that burst across the back wall of the incinerator with a hot blast that smelled like meat. He set the bloodiest bags aside, put them down safe on the pitted concrete floor, away from the glass.  As the bin emptied, a pit began to form in Mikkel’s stomach. He turned away and kicked through the glass, pacing along the far wall where it was a little cooler.  The tank room had two empty tanks. He’d polished them just a few hours ago, but he hadn’t paid much attention. He’d been thinking about Anna and Maria.  He knew those babies, the ones who had been in the empty tanks. One was a little boy with a thick, stocky body covered in fine hair. The other was a tiny girl with four arms that ended in stubby knobs. Where were they now? Had they been sent away to the crèche or put down the chute? If they’d gone down the chute they would be in the bin, waiting for him to throw them into the fire with the blood and tank fluid. With all of the failed experiments.  Mikkel picked up a bloody bag and hefted it by the seal, feeling the contents with his other hand. The fluid sloshed heavily and clung to the sides of the bag like syrup. There were a few solid pieces inside the bag, but nothing big enough to be a baby, not even a tiny one. He threw it into the incinerator and picked up the other bag.  Maria would probably be gone when he got home; he understood that now. The thought made a hollow in his chest, a Maria-shaped hole where he’d cuddled her to his heart. But if Maria was gone, if Anna had taken her to the train station and abandoned her, that only meant Anna needed time. He would give her time. He would be patient, like she always was with him, and gentle too. What was broken in her would heal and she would love their children. She would be a wonderful mother. Maybe not today, but soon.  He would find more babies. Night after night he’d search for them. Maria had survived, so others would survive, too, and he would find them. Find every baby and bring them all home until Anna healed. He would fill their home with love. It was all he could do.    Originally published in Asimov’s Science Fiction, August 2015. Kelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica.", "text": "4760 words, short story, REPRINT\nTwo-Year Man\nGetting the baby through security was easy. Mikkel had been smuggling food out of the lab for years. He’d long since learned how to trick the guards.\nMikkel had never been smart, but the guards were four-year men and that meant they were lazy. If he put something good at the top of his lunch pail at the end of his shift, the guards would grab it and never dig deeper. Mikkel let them have the half-eaten boxes of sooty chocolate truffles and stale pastries, but always took something home for Anna.\nMost days it was only wrinkled apples and hard oranges, soured milk, damp sugar packets and old teabags. But sometimes he would find something good. Once he’d found a working media player at the bottom of the garbage bin in the eight-year man’s office. He had been so sure the guards would find it and accuse him of stealing that he’d almost tossed it in the incinerator. But he’d distracted the guards with some water-stained skin magazines from the six-year men’s shower room and brought that media player home to Anna.\nShe traded it for a pair of space heaters and ten kilos of good flour. They had dumplings for months.\nThe baby was the best thing he’d ever found. And she was such a good girl—quiet and still. Mikkel had taken a few minutes to hold her in the warmth beside the incinerator, cuddling her close and listening to the gobble and clack of her strange yellow beak. He swaddled her tightly in clean rags, taking care to wrap her pudgy hands separately so she couldn’t rake her talons across that sweet pink baby belly. Then he put her in the bottom of his plastic lunch pail, layered a clean pair of janitor’s coveralls over her, and topped the pail with a box of day-old pastries he’d found in the six-year men’s lounge.\n“Apple strudel,” grunted Hermann, the four-year man in charge of the early morning guard shift. “Those pasty scientists don’t know good eats. Imagine leaving strudel to sit.”\n“Cafe Sluka has the best strudel in Vienna, so everyone says,” Mikkel said as he passed through the security gate.\n“Like you’d know, moron. Wouldn’t let you through the door.”\nMikkel ducked his head and kept his eyes on the floor. “I heated them in the microwave for you.”\nHe rushed out into the gray winter light as the guards munched warm strudel.\nMikkel checked the baby as soon as he rounded the corner, and then kept checking her every few minutes on the way home. He was careful to make sure nobody saw. But the streetcars were nearly empty in the early morning, and nobody would find it strange to see a two-year man poking his nose in his lunch pail.\nThe baby was quiet and good. Anna would be so pleased. The thought kept him warm all the way home.\nAnna was not pleased.\nWhen he showed her the baby she sat right down on the floor. She didn’t say anything—just opened and closed her mouth for a minute. Mikkel crouched at her side and waited.\n“Did anyone see you take it?” she asked, squeezing his hand hard, like she always did when she wanted him to pay attention.\n“No, sweetheart.”\n“Good. Now listen hard. We can’t keep it. Do you understand?”\n“She needs a mother,” Mikkel said.\n“You’re going to take her back to the lab. Then forget this ever happened.”\nAnna’s voice carried an edge Mikkel had never heard before. He turned away and gently lifted the baby out of the pail. She was quivering with hunger. He knew how that felt.\n“She needs food,” he said. “Is there any milk left, sweetheart?”\n“It’s no use, Mikkel. She’s going to die anyway.”\n“We can help her.”\n“The beak is a bad taint. If she were healthy they would have kept her. Sent her to a crèche.”\n“She’s strong.” Mikkel loosened the rags. The baby snuffled and her sharp blue tongue protruded from the pale beak. “See? Fat and healthy.”\n“She can’t breathe.”\n“She needs us.” Why didn’t Anna see that? It was so simple.\n“You can take her back tonight.”\n“I can’t. My lunch pail goes through the X-ray machine. The guards would see.”\nIf Anna could hold the baby, she would understand. Mikkel pressed the baby to Anna’s chest. She scrambled backward so fast she banged her head on the door. Then she stood and straightened her maid’s uniform with shaking hands.\n“I have to go. I can’t be late again.” She pulled on her coat and lunged out the door, then turned and reached out. For a moment he thought she was reaching for the baby and he began to smile. But she just squeezed his hand again, hard.\n“You have to take care of this, Mikkel,” she said. “It’s not right. She’s not ours. We aren’t keeping her.”\nMikkel nodded. “See you tonight.”\nThe only thing in the fridge was a bowl of cold stew. They hadn’t had milk for days. But Mikkel’s breakfast sat on the kitchen table covered with a folded towel. The scrambled egg was still steaming.\nMikkel put a bit of egg in the palm of his hand and blew on it. The baby’s eyes widened and she squirmed. She reached for his hand. Talons raked his wrist and her beak yawned wide. A blue frill edged with red and yellow quivered at the back of her throat.\n“Does that smell good? I don’t think a little will hurt.”\nHe fed her the egg bit by bit. She gobbled it down, greedy as a baby bird. Then he watched her fall asleep while he sipped his cold coffee.\nMikkel wet a paper napkin and cleaned the fine film of mucus from the tiny nostrils on either side of her beak. They were too small, but she could breathe just fine through her mouth. She couldn’t cry, though, she just snuffled and panted. And the beak was heavy. It dragged her head to the side.\nShe was dirty, smeared with blood from the incineration bin. Her fine black hair was pasted down with a hard scum that smelled like glue. She needed a bath, and warm clothes, and diapers. Also something to cover her hands. He would have to trim the points off her talons.\nHe held her until she woke. Then he brought both space heaters from the bedroom and turned them on high while he bathed her in the kitchen sink. It was awkward and messy and took nearly two hours. She snuffled hard the whole time, but once he’d dried her and wrapped her in towels she quieted. He propped her up on the kitchen table. She watched him mop the kitchen floor, her bright brown eyes following his every move.\nWhen the kitchen was clean he fetched a half-empty bottle of French soap he’d scavenged from the lab, wrapped the baby up tightly against the cold, and sat on the back stairs waiting for Hyam to come trotting out of his apartment for a smoke.\n“What’s this?” Hyam said. “I didn’t know Anna was expecting.”\n“She wasn’t.” Mikkel tugged the towel aside.\n“Huh,” said Hyam. “That’s no natural taint. Can it breathe?”\n“She’s hungry.” Mikkel gave him the bottle of soap.\n“Hungry, huh?” Hyam sniffed the bottle. “What do you need?”\n“Eggs and milk. Clothes and diapers. Mittens, if you can spare some.”\n“I never seen a taint like that. She’s not a natural creature.” Hyam took a long drag on his cigarette and blew it over his shoulder, away from the baby. “You work in that lab, right?”\n“Yes.”\nHyam examined the glowing coal at the end of his cigarette.\n“What did Anna say when you brought trouble home?”\nMikkel shrugged.\n“Did the neighbors hear anything through the walls?”\n“No.”\n“Keep it that way.” Hyam spoke slowly. “Keep this quiet, Mikkel, you hear me? Keep it close. If anyone asks, you tell them Anna birthed that baby.”\nMikkel nodded.\nHyam pointed with his cigarette, emphasizing every word. “If the wrong person finds out, the whole neighborhood will talk. Then you’ll see real trouble. Four-year men tromping through the building, breaking things, replaying the good old days in the colonies. They like nothing better. Don’t you bring that down on your neighbors.”\nMikkel nodded.\n“My wife will like the soap.” Hyam ground out his cigarette and ran up the stairs.\n“There now,” Mikkel said. The baby gazed up at him and clacked her beak. “Who says two-year men are good for nothing?”\nFour-year men said it all the time. They were everywhere, flashing their regimental badges and slapping the backs of their old soldier friends. They banded together in loud bragging packs that crowded humble folks off busses and streetcars, out of shops and cafés, forcing everyone to give way or get pushed aside.\nSix-year men probably said it too, but Mikkel had never talked to one. He saw them working late at the lab sometimes, but they lived in another world—a world filled with sports cars and private clubs. And who knew what eight-year men said? Mikkel cleaned an eight-year man’s office every night, but he’d only ever seen them in movies.\nNobody made movies about two-year men. They said four-year men had honor, six-year men had responsibility, and eight-year men had glory. Two-year men had nothing but shame. But it wasn’t true. Hyam said so.\nTwo-year men had families—parents, grandparents, uncles and aunts, brothers and sisters, children and wives who depended on them. They had jobs, humble jobs but important all the same. Without two-year men, who would grub away the garbage, crawl the sewers, lay the carpets, clean the chimneys, fix the roofs? Without two-year men there would be nobody to bring in the harvest—no sweet strawberries or rich wines. And most important, Hyam said, without two-year men there would be nobody parents could point at and say to their sons, “Don’t be like him.”\nHyam was smart. He could have been a four-year man easy, even a six-year man. But he was a Jew and that meant a two-year man, almost always. Gypsies too, and Hutterites, and pacifists. Men who couldn’t walk or talk. Even blind men. All drafted and sent to fight and die in the colonies for two years, and then sent home to live in shame while the four-year men fought on. Fought to survive and come home with honor.\nHyam returned swinging a plastic bag in one hand and a carton of eggs in the other. A bottle of milk was tucked under his arm.\n“This is mostly diapers,” he said, brandishing the bag. “You’ll never have too many. We spend more on laundry than we do on food.”\n“I can wash them by hand.”\n“No you can’t, take my word for it.” Hyam laughed and ran up the stairs. “Welcome to fatherhood, Mikkel. You’re a family man now.”\nMikkel laid the baby on the bed. He diapered and dressed the baby, and then trimmed her talons with Anna’s nail scissors. He fitted a sock over each of the baby’s hands and pinned them to her sleeves. Then he wedged Anna’s pillow between the bed and the wall, tucked the baby in his arms, and fell into sleep.\nHe woke to the clacking of the baby’s beak. She yawned, showing her colorful throat frill. He cupped his hand over her skull and breathed in the milky scent of her skin.\n“Let’s get you fed before Mama comes home,” he said.\nHe warmed milk in the soup pot. A baby needed a bottle when it didn’t have a breast, he knew, but his baby—his clever little girl—held her beak wide and let him tip the milk into her, teaspoon by teaspoon. She swallowed greedily and then demanded more. She ate so fast he could probably just pour the milk in a steady stream down her throat. But milk was too expensive to risk spitting up all over the kitchen floor.\n“Mikkel,” said Anna.\nShe was standing in the doorway in her scarf and coat. Mikkel gathered the baby in his arms and greeted Anna with a kiss like he always did. Her cheek was cold and red.\n“How was your day?” he asked. The baby looked from him to Anna and clacked her beak.\nAnna wouldn’t look at the baby. “I was late. I got on the wrong bus at the interchange and had to backtrack. Mrs. Spiven says one more time and that’s it for me.”\n“You can get another job. A better one. Closer to home.”\n“Maybe. Probably not.”\nAnna rinsed the soup pot, scooped cold stew into it, and set it on the stove. She was still in her coat and hat. The baby reached out and hooked Anna’s red mitten out of her pocket with the trimmed talon poking through the thin gray knit sock. The mitten dangled from the baby’s hand. Anna ignored it.\n“Sweetheart, take off your coat,” Mikkel said.\n“I’m cold,” she said. She struck a match and lit the burner.\nMikkel gently pulled on her elbow. She resisted for a moment and then turned. Her face was flushed.\n“Sweetheart, look,” he said. Anna dropped her gaze to the floor. The baby clacked her beak and yawned. “I thought we could name her after your mother.”\nAnna turned away and stirred the stew. “That’s crazy. I told you we’re not keeping her.”\n“She has your eyes.”\nThe spoon clattered to the floor. Anna swayed. Her elbow hit the pot handle and it tipped. Mikkel steadied it and shut off the flame.\nAnna yanked back her chair and fell into it. She thrust her head in her hands for a moment and then sat back. Her eyes were cold and narrow, her voice tight. “Why would you say that? Don’t say that.”\nWhy couldn’t Anna see? She was smart. So much smarter than him. And he could see it so easily.\nMikkel searched for the right words. “Your eggs. Where did they go?”\n“It doesn’t matter. I needed money so I sold my ovaries. That’s the end of it.”\nMikkel ran his fingers over his wife’s chapped hand, felt the calluses on her palm. He would tell her the awful things, and then she would understand.\n“I know where your eggs went. I see them in the tanks every night. And in the labs. In the incinerator. I mop their blood off the floor.”\nAnna’s jaw clenched. He could tell she was biting the inside of her cheek. “Mikkel. Lots of women sell their ovaries. Thousands of women. They could be anyone’s eggs.”\nMikkel shook his head. “This is your baby. I know it.”\n“You don’t know anything. What proof do you have? None.” She laughed once, a barking sound. “And it doesn’t matter anyway because we’re not keeping her. People will find out and take her away. Arrest you and me both, probably. At the very least, we’d lose our jobs. Do you want us to live in the street?”\n“We can tell people you birthed her.”\n“With that beak?”\nMikkel shrugged. “It happens.”\nAnna’s flushed face turned a brighter shade of red. She was trying not to cry. He ached to squeeze her to his chest. She would just pull away, though. Anna would never let him hold her when she cried.\nThey ate in silence. Mikkel watched the baby sleep on the table between them. Her soft cheek was chubby as any child’s, but it broadened and dimpled as it met the beak, the skin thinning and hardening like a fingernail. The baby snuffled and snot bubbled from one of her tiny nostrils. Mikkel wiped it away with the tip of his finger.\nMikkel checked the clock as Anna gathered the dishes and filled the sink. Only a few minutes before he had to leave for the lab. He snuggled the baby close. Her eyelids fluttered. The delicate eyelash fringes were glued together with mucus.\n“You have to go,” said Anna. She put his lunch pail on the table.\n“In a minute,” he said. Mikkel dipped his napkin in his water glass and wiped the baby’s eyes.\nAnna leaned on the edge of the sink. “Do you know why I married you, Mikkel?”\nHe sat back, startled. Anna didn’t usually talk like this. He had wondered, often. Anna could have done better. Married a smart man, a four-year man, even.\n“Will you tell me, sweetheart?”\n“I married you because you said it didn’t matter. I explained I could never have babies and you still wanted me—”\n“Of course I want you.”\n“I told you why I was barren. Why I sold my ovaries. Do you remember?”\n“Your mother was sick. You needed the money.”\n“Yes. But I also said it was easy because I never wanted babies. I never wanted to be a mother.” She leaned forward and gripped his shoulders. “I still don’t. Take her back to the lab.”\nMikkel stood. He kissed the baby’s forehead. Then he put the baby in Anna’s arms.\n“Her name is Maria,” he said. “After your mother.”\nMikkel was tired walking up the street toward the bus stop. But that was fatherhood. He would get used to it. Anna would get used to being a mother too. He was sure. All women did.\nThe thought of his wife and child kept him warm all the way to the Josefstadt streetcar station. Then a four-year man shoved an elbow in his ribs and spat on his coat. Mikkel watched the spittle freeze and turn white. He stood shivering at the edge of the curb, taking care to stay out of everyone’s way.\nMikkel relied on Anna’s kindness, sure she would always do the right thing, the generous thing. She was good to him, good to everyone. For ten years she had taken care of him: cooking, cleaning, making their two rooms into a home. In return he did his best to fill those two rooms with love. It was all he could do.\nAs he stood in the wind at the edge of the station, doubts began to creep in with the cold. Why would Anna say she didn’t want to be a mother? It couldn’t be true. They lived surrounded by families—happy, noisy families—three and four, even five generations all living together. Healthy children, happy mothers, proud fathers. Aunts, uncles, cousins, grandparents. Family everywhere, but he and Anna only had each other.\nAnna must regret being barren. Some part of her, buried deep, must long for children. But she said she didn’t, and if it was true, then something in her must be broken.\nHe had seen broken men during his two years in the colonies, men with whole bodies and broken minds, who said crazy things and hurt themselves, hurt others. Anna could never be like them.\nBut his doubts grew with every step further from home. By the time he could see the lights of the lab glowing through the falling snow, the doubts were clawing at him. He imagined coming home in the morning to find Anna alone, ready to leave for work, pretending Maria had never been there.\nHe turned back home, but then one of the four-year men shouted at him through the glass doors.\n“You’re late, you stupid ass.”\nMikkel watched his lunch pail slide though the X-ray. The guards ran it back and forth through the machine, just to waste time. Mikkel had to run to the time clock. He stamped his card just as it clicked over to eight.\nNormally Mikkel loved the rhythm of work, the scrubbing, mopping, wiping. Even cleaning toilets brought its own reward. He knew the drip of every tap, every scratch on the porcelain and crack in the tiles. He took an inventory of them night by night as he cleaned, taking his time, double-checking every corner for dust, scanning every window and mirror for streaks, even getting down on his knees to swab behind the toilets, scrubbing away any hint of mildew from the grout, finding all the little nooks and crannies.\nTonight he rushed through his work, but each room felt like it took twice as long as usual. He kept checking the time, sure he was falling behind. Thinking about Anna dragged on the clock hands. Worrying made him forgetful, too. He left the four-year men’s bathroom with no memory of cleaning it. He had to go back and check just to be sure.\nIn the tank room he began to feel better. He loved the noise of the tanks—the bubbling pumps and thumping motors. Here he always took his time, no matter what. It was his favorite place in the whole building. He wasn’t supposed to touch the tanks, but he always took a few extra minutes to polish the steel and glass and check the hose seals. He even tightened the bolts that fixed each heavy tank to the floor and ceiling.\nThe tinted glass was just transparent enough to show the babies floating inside. Mikkel watched them grow night by night. He kept a special rag just for polishing the tanks, a soft chamois that a six-year man had discarded years ago. It was specially made for precious things—the logo of a sports car company had long since worn off. He always polished the glass with long slow caressing strokes, sure the babies could feel his touch.\nTwo of the tanks were empty. Mikkel polished them too, in their turn, making them perfect for the next baby. Maria’s tank was in the last row on the far side of the room, two from the end. It was refilled but the baby was still too small to see, just a thin filament dangling from the fleshy organ at the top of the tank.\n“Your sister says hello,” Mikkel whispered. “Her mama and papa are proud of her. Maria is going to grow up smart and strong.”\nThe filament twisted and drifted in the fluid. Mikkel watched it for a few minutes, wondering what Anna and Maria were doing at that moment. He imagined them curled up in bed, skin to skin, the baby’s beak tucked under Anna’s chin. He squeezed his eyes tight and held the image in his mind, as if he could make it real just by wanting it so badly. And for a few minutes it did feel real, an illusion supported by the comforting tank room sounds.\nBut he couldn’t stay there. As he lugged his bins and pails upstairs to the offices, worry began gnawing at him again.\nWomen abandoned babies all the time. The mothers and grandmothers in the tenement always had a story to tell about some poor baby left out in the cold by a heartless and unnatural mother. Once, when they were first married, Anna told the woman next door that people did desperate things when they had run out of options. That neighbor still wouldn’t speak to her, years later.\nWhat if Anna bundled Maria up and put her on the steps of some six-year man’s house? Or left her at the train station?\nHe could see Maria now, tucked into their big kitchen pail and covered with a towel. He could see Anna, her face covered by her red scarf, drop the pail on the edge of the Ostbahnhof express platform and walk away.\nNo. His Anna would never do that. Never. He wouldn’t think about it anymore. He would pay attention to his work.\nOn the wide oak table in the eight-year man’s office he found four peach pastries, their brandy jam dried to a crust. The bakery box was crushed in the garbage bin. When he was done cleaning the office he refolded it as best he could and put the pastries back inside. Four was good luck. One for each of the guards. Then he made his way down to the basement.\nThe incinerator was an iron maw in a brick wall. For years, Mikkel had walked down those concrete steps in the hot red light of its stare to find the sanitary disposal bin bloody but empty, its contents dumped by one of the four-year men who assisted in the labs. Back then, all Mikkel had to do was toss his garbage bags in the incinerator, let them burn down, then switch off the gas, bleach the bin, hose the floor, and mop everything dry.\nBut now there was a new eight-year man in charge, and Mikkel had to start the incinerator and empty the disposal bin himself.\nThe light from the overhead bulb was barely bright enough to show the trail of blood snaking from the bin to the drain. Mikkel felt his way to the control panel and began the tricky process of firing up the incinerator. The gas dial was stiff and the pilot light button was loose. He pressed it over and over again, trying to find the right angle on the firing pin. When the incinerator finally blasted to life Mikkel had sweated through his coveralls.\nThe room lit up with the glow from the incinerator window and he could finally see into the bin. The top layer of bags dripped fluid tinged red and yellow. Most were double- and even triple-bagged, tied with tight knots. But they were torn and leaked. Sharp edges inside the disposal chute hooked and tore on the way down.\nMaria had been single-bagged. Her beak had pierced the plastic, ripped it wide enough for her to breathe. And she had landed at the far edge of the bin, mostly upright. If she had been facedown or if another bag had fallen on top of her she could have suffocated.\nMikkel wrenched open the incinerator door and began emptying the bin, carefully picking up each wet bag and throwing it far into the furnace. Some bags were tiny, just a few glass dishes and a smear of wax. One bag was filled with glass plates that spilled through a tear and shattered at his feet. The biggest bags held clear fluid that burst across the back wall of the incinerator with a hot blast that smelled like meat. He set the bloodiest bags aside, put them down safe on the pitted concrete floor, away from the glass.\nAs the bin emptied, a pit began to form in Mikkel’s stomach. He turned away and kicked through the glass, pacing along the far wall where it was a little cooler.\nThe tank room had two empty tanks. He’d polished them just a few hours ago, but he hadn’t paid much attention. He’d been thinking about Anna and Maria.\nHe knew those babies, the ones who had been in the empty tanks. One was a little boy with a thick, stocky body covered in fine hair. The other was a tiny girl with four arms that ended in stubby knobs. Where were they now? Had they been sent away to the crèche or put down the chute? If they’d gone down the chute they would be in the bin, waiting for him to throw them into the fire with the blood and tank fluid. With all of the failed experiments.\nMikkel picked up a bloody bag and hefted it by the seal, feeling the contents with his other hand. The fluid sloshed heavily and clung to the sides of the bag like syrup. There were a few solid pieces inside the bag, but nothing big enough to be a baby, not even a tiny one. He threw it into the incinerator and picked up the other bag.\nMaria would probably be gone when he got home; he understood that now. The thought made a hollow in his chest, a Maria-shaped hole where he’d cuddled her to his heart. But if Maria was gone, if Anna had taken her to the train station and abandoned her, that only meant Anna needed time. He would give her time. He would be patient, like she always was with him, and gentle too. What was broken in her would heal and she would love their children. She would be a wonderful mother. Maybe not today, but soon.\nHe would find more babies. Night after night he’d search for them. Maria had survived, so others would survive, too, and he would find them. Find every baby and bring them all home until Anna healed. He would fill their home with love. It was all he could do.\nOriginally published in Asimov’s Science Fiction, August 2015.\nKelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica.", "source": "https://clarkesworldmagazine.com/robson_12_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Two-Year Man by Kelly Robson"}