{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Daniel Abraham", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Dc4li5U7n97s61unLnYg+/tyG3Y=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Reading as Performance  My main complaint, and reason my interest flagged, was that both the characters and setting seemed flat.—SF Reader on A Shadow in Summer  . . . an imagined world of this quality: for a city as graceful and fascinating as Saraykhet, and for such persuasively human characters.—Strange Horizons on A Shadow in Summer  One of the things that my wiser friends and acquaintances told me when my first book, A Shadow in Summer, came out was not to read the reviews. The bad ones would hurt my feelings and the good ones would swell my head. Seriously, it’s a dumb thing to do.  So yeah, of course I did it. Still do. Terrible habit.  The thing that confused me then, and for several years since, is how often thoughtful intelligent, committed, professional readers can bring their best critical faculties to a book and come back with totally incompatible reports. The world-building is great, or it’s strictly paint-by-numbers. The characters are fascinating and complex, or they’re cardboard. The plot is full of well-crafted surprises, or it’s all telegraphed from page one.  I came to the same conclusion that all authors reach: the reviewers who liked me are intelligent, deep-souled bastions of wisdom, and the ones who didn’t are a bunch of weak-brained punks. Mystery solved.  But here’s the thing. Once the initial emotional rush plays out and my amygdala calms back down to its natural state, I start to think that maybe something else is going on here. That maybe I’ve misunderstood what reading is.  There are two equally serious reasons why it isn’t worth any adult reader’s attention. The first is that it is dull, dull, dull in a pretentious, florid and archly fatuous fashion. The second is that it is repulsive.—The New York Times on Lolita, 1958  Technically it is brilliant, Peter-De-Vries humor in a major key, combined with an eye for the revealing, clinching detail of social behavior . . . one of the funniest and one of the saddest books that will be published this year.—Also The New York Times, also on Lolita, also in 1958. Seriously. WTF, folks?  On one level, everyone knows this. Every reader brings their own experience to a story. How you read something depends on who you are. I’ve had that experience myself. I tried four times to read Umberto Eco’s The Name of the Rose and couldn’t get into it for love or money. Then the fifth time, I fell into it and read the whole damn thing in three sittings. I’ve had books that I loved at one point in my life, and reread only to discover that the suck fairy had come and left great big piles of ohmigodthisisawful. It’s one of those things that we all tacitly understand, usually without thinking too much about why it’s true or what it means.  So let’s talk about your neocortex for a minute.  There’s this fairly brilliant book called On Intelligence by Jeff Hawkins and Sandra Blakeslee that talks about a model of brain function that gets the shorthand of memory-prediction. I’m not going to dive very deep into it here, but if you get the time, it’s seriously interesting stuff. The one point that I want to borrow is that many times more neurons come into the visual neocortex from deeper in the brain than do from the eyes.  The theory Hawkins puts forward (and I find it fairly persuasive) has it that most of what triggers activity in the visual neocortex is predictive information from other parts of the brain. Or, more loosely translated, most of what we see, we evoke. And that also matches my experience as a reader.  I remember one time in late high school or early college, reading a book that was particularly working for me. I’d been in it for hours, picturing the action, hearing the voices, listening to the narrator’s voice. When I put the book down to go make dinner, it was physically disorienting. I had been chasing the villain through a ruined castle, and now I was halfway to my kitchen. It felt dislocating. It felt like still being halfway in a dream.  I’ve always heard the idea of reading as evoking a “literary dream” attributed to Damon Knight, but I suppose he may have gotten the phrase from someplace else. The thing that it’s taken me decades to figure out is that the phrase isn’t a metaphor. If I’m right, the mechanism that lets me look at a white sheet of paper with black inked letters on it and see the Balrog pulling Gandalf into the pit is the same one that lets me close my eyes at night and see my old elementary school filled up with bats or whatever my brain is handing up to my visual centers. And the same holds true for other aspects of my reading experience. The sounds I hear, the scents I smell, the emotions I feel are all being drawn up from deep inside of me and experienced just the way they would be in a dream.  A really objective review of a book would be about a book as . . . well, as an object. “I find the use of a sans serif font problematic, and the thick bond of the paper gives the book a weight that exaggerates its true word count.” Or, you know. Whatever. Point is, it wouldn’t be useful.  I don’t want an objective review of a book. I want an idea of what kind of subjective experience I’m likely to have when I read it. I’m assuming that’s what most readers of reviews are looking for too. As an extra added bonus, it would be nice if the review added some insight or depth that would help me experience the story in a way that was even more compelling and involving than I would have managed on my own. But hey, no pressure.  In that light, the reason that two reviewers can come to the same text and come back totally dissimilar reports is pretty clear. They aren’t describing the same experience.  I’ve seen three productions of Shakespeare’s The Tempest. The first one was in high school, and as I recall most of the right words were spoken in more or less the right order. The second was at a Shakespeare festival, and it was a much better, much more interesting play. Same words, same order, but a different company and director and just plain all-around better. The third one was on Broadway with Patrick Stewart as Prospero, and a lot of really interesting and deeply non-period production and design decisions that made the play into a comment on race relations and the legacy of American slavery. Each time it was the same script, the same story, but the variations in the performance made it utterly different.  And that’s the thing. When we read, we’re performing. We read a sentence like “Wet cobblestones glittered in the sudden sunlight like a thousand golden coins,” and maybe we see a wide street glowing in pointillist yellow-white. Or maybe we picture a couple dozen cobbles and a picture of goldwork we saw in National Geographic once. Or maybe we just agree that the rain stopped and it got sunny before skip ahead to the sword fight coming up next.  With every story, every book, we are the acting troupe and the director and the props and special effects folks. How well we are able to evoke a dream from the words on the page—what decisions we unconsciously make, what experience and history we have to draw from, how comfortable we are with the style of the writer who gave us the story—is going to vary. Some acting troupes do really great comedy but they’re only so-so for drama. Some have actors who can really embody a tragic character, but seem wrong when doing a song-and-dance bit. When we pick up a book, we’re like that too. Some books we’re ready to read. Some we’re suited for. Others, not so much.  That doesn’t mean that the text doesn’t matter. It does. Some writers are brilliant at guiding us through a dream, evoking sensory detail and drawing out emotions and weaving in philosophical and aesthetic abstractions in ways that make everything in the story seem deeper and more profound. Some write cool sword fights, if that’s the kind of thing you’re into. Some aren’t very good.  When a reviewer sets out to tell us what they thought, the experience they’re talking about is their private—can we call it intimate?—performance. It’s never something we can really share, and it may or may not be decent predictor of the experience we’ll have if we pick up the same book. Every review is like the description of a production of The Tempest put on once, for an audience of one, not repeated and not repeatable. Every story any of us read is the same.  For me, reading reviews of my stuff, this model of what it means to read pulls some of the sting. A bad review is disappointing, but it isn’t an indictment. There isn’t a perfect and certain judge of literature looking down from the bench and condemning me and my little offering now and forever. It’s more like a date that didn’t go well. Still sad. A little heartbreaking sometimes, if it’s someone whose opinion I care about. But it’s always something quiet and personal that happened—or didn’t happen—between the two of us, and that makes the failures a little more humane.  Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "text": "Non-Fiction\nAnother Word: Reading as Performance\nMy main complaint, and reason my interest flagged, was that both the characters and setting seemed flat.—SF Reader on A Shadow in Summer\n. . . an imagined world of this quality: for a city as graceful and fascinating as Saraykhet, and for such persuasively human characters.—Strange Horizons on A Shadow in Summer\nOne of the things that my wiser friends and acquaintances told me when my first book, A Shadow in Summer, came out was not to read the reviews. The bad ones would hurt my feelings and the good ones would swell my head. Seriously, it’s a dumb thing to do.\nSo yeah, of course I did it. Still do. Terrible habit.\nThe thing that confused me then, and for several years since, is how often thoughtful intelligent, committed, professional readers can bring their best critical faculties to a book and come back with totally incompatible reports. The world-building is great, or it’s strictly paint-by-numbers. The characters are fascinating and complex, or they’re cardboard. The plot is full of well-crafted surprises, or it’s all telegraphed from page one.\nI came to the same conclusion that all authors reach: the reviewers who liked me are intelligent, deep-souled bastions of wisdom, and the ones who didn’t are a bunch of weak-brained punks. Mystery solved.\nBut here’s the thing. Once the initial emotional rush plays out and my amygdala calms back down to its natural state, I start to think that maybe something else is going on here. That maybe I’ve misunderstood what reading is.\nThere are two equally serious reasons why it isn’t worth any adult reader’s attention. The first is that it is dull, dull, dull in a pretentious, florid and archly fatuous fashion. The second is that it is repulsive.—The New York Times on Lolita, 1958\nTechnically it is brilliant, Peter-De-Vries humor in a major key, combined with an eye for the revealing, clinching detail of social behavior . . . one of the funniest and one of the saddest books that will be published this year.—Also The New York Times, also on Lolita, also in 1958. Seriously. WTF, folks?\nOn one level, everyone knows this. Every reader brings their own experience to a story. How you read something depends on who you are. I’ve had that experience myself. I tried four times to read Umberto Eco’s The Name of the Rose and couldn’t get into it for love or money. Then the fifth time, I fell into it and read the whole damn thing in three sittings. I’ve had books that I loved at one point in my life, and reread only to discover that the suck fairy had come and left great big piles of ohmigodthisisawful. It’s one of those things that we all tacitly understand, usually without thinking too much about why it’s true or what it means.\nSo let’s talk about your neocortex for a minute.\nThere’s this fairly brilliant book called On Intelligence by Jeff Hawkins and Sandra Blakeslee that talks about a model of brain function that gets the shorthand of memory-prediction. I’m not going to dive very deep into it here, but if you get the time, it’s seriously interesting stuff. The one point that I want to borrow is that many times more neurons come into the visual neocortex from deeper in the brain than do from the eyes.\nThe theory Hawkins puts forward (and I find it fairly persuasive) has it that most of what triggers activity in the visual neocortex is predictive information from other parts of the brain. Or, more loosely translated, most of what we see, we evoke. And that also matches my experience as a reader.\nI remember one time in late high school or early college, reading a book that was particularly working for me. I’d been in it for hours, picturing the action, hearing the voices, listening to the narrator’s voice. When I put the book down to go make dinner, it was physically disorienting. I had been chasing the villain through a ruined castle, and now I was halfway to my kitchen. It felt dislocating. It felt like still being halfway in a dream.\nI’ve always heard the idea of reading as evoking a “literary dream” attributed to Damon Knight, but I suppose he may have gotten the phrase from someplace else. The thing that it’s taken me decades to figure out is that the phrase isn’t a metaphor. If I’m right, the mechanism that lets me look at a white sheet of paper with black inked letters on it and see the Balrog pulling Gandalf into the pit is the same one that lets me close my eyes at night and see my old elementary school filled up with bats or whatever my brain is handing up to my visual centers. And the same holds true for other aspects of my reading experience. The sounds I hear, the scents I smell, the emotions I feel are all being drawn up from deep inside of me and experienced just the way they would be in a dream.\nA really objective review of a book would be about a book as . . . well, as an object. “I find the use of a sans serif font problematic, and the thick bond of the paper gives the book a weight that exaggerates its true word count.” Or, you know. Whatever. Point is, it wouldn’t be useful.\nI don’t want an objective review of a book. I want an idea of what kind of subjective experience I’m likely to have when I read it. I’m assuming that’s what most readers of reviews are looking for too. As an extra added bonus, it would be nice if the review added some insight or depth that would help me experience the story in a way that was even more compelling and involving than I would have managed on my own. But hey, no pressure.\nIn that light, the reason that two reviewers can come to the same text and come back totally dissimilar reports is pretty clear. They aren’t describing the same experience.\nI’ve seen three productions of Shakespeare’s The Tempest. The first one was in high school, and as I recall most of the right words were spoken in more or less the right order. The second was at a Shakespeare festival, and it was a much better, much more interesting play. Same words, same order, but a different company and director and just plain all-around better. The third one was on Broadway with Patrick Stewart as Prospero, and a lot of really interesting and deeply non-period production and design decisions that made the play into a comment on race relations and the legacy of American slavery. Each time it was the same script, the same story, but the variations in the performance made it utterly different.\nAnd that’s the thing. When we read, we’re performing. We read a sentence like “Wet cobblestones glittered in the sudden sunlight like a thousand golden coins,” and maybe we see a wide street glowing in pointillist yellow-white. Or maybe we picture a couple dozen cobbles and a picture of goldwork we saw in National Geographic once. Or maybe we just agree that the rain stopped and it got sunny before skip ahead to the sword fight coming up next.\nWith every story, every book, we are the acting troupe and the director and the props and special effects folks. How well we are able to evoke a dream from the words on the page—what decisions we unconsciously make, what experience and history we have to draw from, how comfortable we are with the style of the writer who gave us the story—is going to vary. Some acting troupes do really great comedy but they’re only so-so for drama. Some have actors who can really embody a tragic character, but seem wrong when doing a song-and-dance bit. When we pick up a book, we’re like that too. Some books we’re ready to read. Some we’re suited for. Others, not so much.\nThat doesn’t mean that the text doesn’t matter. It does. Some writers are brilliant at guiding us through a dream, evoking sensory detail and drawing out emotions and weaving in philosophical and aesthetic abstractions in ways that make everything in the story seem deeper and more profound. Some write cool sword fights, if that’s the kind of thing you’re into. Some aren’t very good.\nWhen a reviewer sets out to tell us what they thought, the experience they’re talking about is their private—can we call it intimate?—performance. It’s never something we can really share, and it may or may not be decent predictor of the experience we’ll have if we pick up the same book. Every review is like the description of a production of The Tempest put on once, for an audience of one, not repeated and not repeatable. Every story any of us read is the same.\nFor me, reading reviews of my stuff, this model of what it means to read pulls some of the sting. A bad review is disappointing, but it isn’t an indictment. There isn’t a perfect and certain judge of literature looking down from the bench and condemning me and my little offering now and forever. It’s more like a date that didn’t go well. Still sad. A little heartbreaking sometimes, if it’s someone whose opinion I care about. But it’s always something quiet and personal that happened—or didn’t happen—between the two of us, and that makes the failures a little more humane.\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "source": "https://clarkesworldmagazine.com/another_word_04_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Reading as Performance by Daniel Abraham"}