{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "u79mzcMgOn21MRwkLpz4h0Jzk7U=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Horror of it All! A Conversation with Tamsyn Muir  Tamsyn Muir landed on many readers’ radars with the release of full-length novel Gideon the Ninth, published by Tor.com publications in September 2019. Beyond blurbs and promises of something utterly unique, readers showed appreciation through Goodreads Choice nominations in two categories, as well as nominations and short listing for an array of other awards such as Brave New Words, BooktubeSFF, the 2020 Reference and User Services Association’s selections, and Audible’s Best of 2019. Gideon made editor’s pick in Amazon’s Best Books of 2019. In more genre focused circles, Gideon received a SFWA Nebula Award nomination, became a 2020 Best Novel Hugo Award finalist, landed on the Locus Recommended Reading List, and won a Crawford Award.  Tamsyn Muir was born in Australia, grew up in New Zealand, and later moved to Oxford, England. She flexed her writerly muscles posting fan fiction and started taking writing seriously in 2010, when she attended the Clarion Workshop in San Diego. Her debut professional publication, “The House That Made the Sixteen Loops of Time,” came out in Fantasy Magazine in 2011, followed by Shirley Jackson Award finalist “The Magician’s Apprentice” in Weird Tales in 2012. In 2015 The Magazine of Fantasy & Science Fiction published Eugie, World Fantasy, and SFWA Nebula award finalist “The Deepwater Bride.” All evidence that even before her big splash with Gideon, her stories were well worth reading.  Harrow the Ninth is due August 2020 and Alecto the Ninth in 2021.   You’ve been nominated twice for Shirley Jackson awards, for “outstanding achievement in the literature of horror, the dark fantastic, and psychological suspense.” What, for you, are the defining characteristics of horror? And what are some examples of your favorite kinds of horror?  I can immediately tell you an example of my LEAST favorite kind of horror, which is the jump scare. It’s not even because I don’t admire the jump scare—a well-crafted literary or visual jump scare is among the finest achievements horror can aspire to. I just hate them. I’m very frightened of my adrenaline being manipulated suddenly. I don’t like it when something jumps out at me and goes BAWWW.  There are moments in Stephen King’s It that are so sudden and so violent and gruesome and terrible that I won’t even describe them here, but they turned me into a whimpering pillar of sweat. It’s much easier to be manipulated with something visual, but the literary jump scare is still bad. And I guess because I view them with such revulsion, and because I’m vaguely mad that someone popped a paper bag really close to my ear, they’re not the moments that live with me—they’re the moments that get to me at 3 AM when I’m trying to sleep and my boiler pipes are making a weird noise.  My favorite kind of horror is the slow reveal. Horror’s horror if it scares you either way—much like erotica, it is looking for the physical response—but I think the defining characteristic of my favorite type of horror is a realization of the uncanny: the slow lifting of a mirror up to your face so you can see the crack. I love it when horror stains backward through an entire text. As a horror reader, I’m always tightening up protectively to guess and to guard against that moment, and I want horror to have been sitting in my blind spot the whole time.  I know Lovecraft can be very tedious, but the end movement of The Shadow Over Innsmouth is wonderful in this way. And because I’m desperate to keep highlighting speculative video games, Kotaro Uchikoshi’s Zero Escape series just keeps on doing this over and over and over. Zero Time Dilemma especially plays with your assumptions like a tiny thumb piano, and the result is some of the finest horror writing I have ever consumed. This all sits with me much longer than the moments where something has jumped out at me and gone BAWWW.  Harrow the Ninth is coming out in August. The Macmillan site calls it “a mind-twisting puzzle box of mystery, murder, magic, and mayhem.” But categorizing your books is somewhat debated. Do you consider them to be horror, or any specific type of horror?  The Locked Tomb trilogy is definitely intended to be horror, but again, what I’m going for is the horror of the slow realization. I want to pull the curtains back very slowly. I mean, that said, Gideon is pocketed with the kind of slasher movie tension where (I hope) one sits in the audience doing the panto LOOK BEHIND YOU!!/DON’T GO DOWNSTAIRS!! routine, and Harrow is my delving straight into gothic. Much of Harrow is about girls in their nightgowns staring down darkened corridors. Isn’t everyone’s favorite bit of The Woman in White the sequence where Marian Halcombe finds herself more and more constrained within Blackwater Park?  Do you have craft techniques you use to make style and voice work?  Only in that I think a lot about different voices and texture. Rhythm helps. I don’t have any specific craft techniques—I never got formally taught to write—but an innate love of horror and comedy and the way in which both those things are peanut butter and chocolate helps. I think it ends up being more surprising for people who have just read straight comedy or straight horror and think I’m doing something clever and accomplished when I slide between the two. I absolutely am not. I have never done anything clever or accomplished in my whole life except the day I worked out you could put KFC fries in the little bread roll they give you and make a potato roll.  I think the best thing you can do to write for style and voice is to do a lot of parody work first. Parody doesn’t necessarily mean satire or takedown; writing to mimic a specific voice or style is parody, and it teaches you a lot about how to evoke different styles and sounds. Every fan fiction author worth their salt knows this, but I think there’s so much anxiety coming out about finding one’s own authentic voice and being original and different that we sit down and start to panic about being the newest most fresh original voice. The secret is that we never can. Just writing the exact way one feels comfortable writing in does a lot to create the effect.  Are there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?  Because I’m so wildly shortsighted, I have trouble with my room descriptions at times. I know this sounds really small and petty but it is a massive problem for me. I have no idea how far away anything is from anything. Because rooms are just blurs, I tend to go nuts on the micro and end up describing somebody’s coffee mug while failing to note anything else about the room. Maybe this is actually just because I spent a long time writing MUD room descriptions in the late nineties. There is a table here! You see an axe.  Are there important differences between the style and voice of your novels and your short fiction?  I think it’s funny that one can pinpoint the exact moment when I relaxed enough to start writing gay themes and jokes. It took me until about 2014. I was still convinced queer wouldn’t sell, or that it would only sell to a niche market, or that it would make people not take me seriously. C.C. Finlay did an enormous amount for my confidence when he bought my novelette “The Deepwater Bride” for F&SF. You can see me doing a lot stylistically when I went on to do in Gideon—constant mixing of low language and high, genuine love of Lovecraftian melodrama but also unable to not take the piss out of it—but it is fundamentally me doing a parody, whereas Gideon is just me. “The Woman in the Hill” is also Lovecraft pastiche, but no jokes. I’ve got quite a broad range of stuff, and I always wanted to move on to the next thing, so it’s quite a Catholic collection of stories and voices and styles. And Harrow, the sequel to Gideon, is different again. I wonder if the main thing on display is my short attention span.  Are there important similarities and differences between the first and second books? Where does Harrow take the narrative?  Harrow is written in a mix of second person and third, a mix that has already sent people screaming to the hills. Very relieved that N.K. Jemisin already softened the audience up for that one, though being a following act to Jemisin is like having the ass of your ego kicked downstairs. Gideon is a slasher detective novel, Harrow’s high gothic puzzle. And if Gideon was Myst, Harrow is that one lateral puzzle about the dead guy hanging over a pool of water in the locked room, only the water’s the protagonist’s entire past. The narrative does shine a torch on more of what I’m doing with the universe I’m working in, as I kept that beam very small in Gideon. It’s a novel meant to disorient. Indulgently, it is also a novel about psychosis. Even more indulgently, it is a novel about poetry.  There’s lots and lots of stuff in there for close readers of Gideon who have been diligently collecting bread crumbs. This is a novel for people who use Post-its. I don’t have a brand ambassadorship with the Post-it guys but maybe they should give me one? I’m right here. Post-its! When you’re too good for the back of an envelope.  Are you already working on Alecto the Ninth? Have the plans for the overall series story changed in any ways since book one’s first few drafts?  As I write, Alecto ought to be finished quite soon, given a prevailing wind. Quarantine isn’t helping; you’d think it would. What is helping is that the overall series story has not changed from day one, which I am devoutly grateful for. I’ve been seeding so much stuff that a massive change would make nonsense of the whole series. I knew the narrative arc before I started Gideon, and the only things that have been cut have been scenes where I realized before I wrote them that they wouldn’t work—very minor scenes like “Tea party here,” not big-ticket items. I mean, very often the novel looks quite different than how it did in my head, but this is the usual author’s lament—this seemed cooler in my brain! A few jokes have gone because my editor looked at them and said no. Sometimes I have been the one who looked at them and said no. But the big stuff, the plot throughline, that’s been the same since day one, and that’s been a lot of the pleasure of writing the books.  What is important or special to you about the series overall?  Oh, what isn’t! Naturally I love it; I wrote it for the edification of my seventeen-year-old self. Because I do not have a landline to her I also wrote it for the edification of my loved ones. Each time they laughed at a joke I was given godlike power. I think my very favorite thing about it is that it is about a lot of very gruesome queer women dealing with trauma and love and having terrible ugly bonds with each other.  I do love stories about how the unflinching love of women for other women is a unifying force for good, and stories that uplift queer strength, but also: What if you made the bun of a burger fried chicken, instead of bread? KFC did that. They called it the Double Down. It is only just now that I realize how funny Double Down is, as a moniker. The Double Down is neither sophisticated nor good and may even worsen conditions you already have. Certainly it is a symbol of excess, and may even be a symbol for the evils of capitalism. But—the buns are also fried chicken!  I have attempted to write the science-fantasy gay Double Down. No women in these books who look at each other should look at each other. They should go practice radical self-acceptance, get therapy, then marry those wonderful girls who take care of the elephants at the zoo. But they’re not. They’re wielding swords, raising the dead, and having affairs with each other. The buns are also fried chicken.  You went to Clarion in San Diego in 2010. Did the program have a measurable impact on your writing?  I’d never written a short story before Clarion, so unambiguously yes!I had to write two in a hurry just in order to audition. I always thought that short stories were beyond me. After Clarion I saw them as a perfection of the form. I wish I was as good at short fiction as I want to be; a really fantastic piece of short fiction brings tears to the eye. In many ways I think it is much harder than writing a novel. You have so much less room to move and fewer tricks to deploy. Getting familiar with short story definitely made me a better writer, and in any case Clarion gave me a toolbox to examine my own writing in a way I hadn’t before—not because Clarion somehow holds the secret keys to the box of self-critique, but because it forced me to take myself seriously. That is worth infinity money. My brother scrounged the funds for me to go, because what a saint, and that was also helpful in its own way because I couldn’t not let it have an impact—I had to absorb everything or else what was the point. It was especially good for me as a fanfiction writer because I could not indulge. I had to condense. It was wonderful training.  You sold your first short story right after Clarion. What was the road to selling the novel series like?  I intended to follow a very traditional route. I wanted to sell short fiction until I got really good at it, and then I thought possibly someone might notice me and I would never have to do the soul-crushing thing of looking for an agent and I’d move on to novel work. This sounds sensible, but I wasn’t. I sold a story out the gate, then I sold another story right out the gate, and then my brain shut down because I felt I had to get a perfect record. I sold like six stories without a rejection. Then I got a rejection, and my brain was all, “Oh! It’s over.” I can’t believe how wasteful and stupid that was and is. I loved writing short fiction, I’d had a handful of good years and some nominations, and I hung up my hat because I submitted and got the soft touch “not a good fit” letter? I should be in jail. Anyway, an agent came knocking but then I still had to go looking for agents anyway because it turned out I was writing in a different genre, and then I had a spate of agents who never bothered to look at the manuscript because I can’t pitch for toffee, and then I found an editor before I found the agent. So I didn’t go a traditional route at all. But I wanted to.  I quit my day job to become a games writer just before finishing Harrow. I loved every moment of it, but I did not realize that although it is apocalyptic for a writer if your publisher/studio shuts down, for game writers it is Tuesday.  Do you feel like coming from New Zealand and living in Oxford is a barrier to publishing in US markets in any particular ways?  This question’s really interesting and so much has changed in a really short period of time. There are a lot of very intelligent and interesting conversations going on about publishing in New Zealand as an SFF author. I think Melanie Harding-Shaw is writing really interesting stuff about it that resonates with me. For me, back in 2010, I just assumed nobody would want what I was selling in NZ. I wasn’t writing what I felt at the time was the NZ story, which would have been a contemporary about drowning at your bach. There’s a huge and very nice population in the UK where SFF fandom is concerned, but I never took advantage of them because I didn’t know where they were and never went looking. I was too busy getting the sweats and trying to pay off my student loan. I think the biggest barrier in being a Kiwi publishing in a US market is in your work, i.e. writing how you’d normally write. My story “Union” for Clarkesworld, which is probably the story I’m the most proud of, I copped flak for because the dialogue was “impenetrable.” I hadn’t realized I was doing anything weird. And I’m always arguing with my poor copyeditors because I want to keep the Kiwi voice and they’re quite reasonably “no American would ever understand what you’re saying here.” I make that my hill to die on quite a lot. I just think American audiences would rather read me as me rather than doing a Sorcerer’s Stone and rewriting jumper to be sweater. Also, anyone having problems parsing my work because of the Kiwi writing is probably having a lot of other problems simultaneously and will inevitably decide that I’m not their type of thing.  It is always difficult to not be in America and take part in the American publishing and fandom get-togethers. Everyone seems to know each other. I went to the Nebulas back in 2015 and everyone was super friendly, very generous with an outsider, but it DID feel as though everyone else had attended SFWA meetings in the womb. It’s rough if you’re trying to make a name for yourself and you don’t get to go to the bar cons or the parties. I imagine this is also rough for anyone who is simply shy. I am international and shy, so I felt tragic. It’s not the end of the world, especially because I was lucky enough to network at Clarion and I would also go on to find out that I had been teenage Internet friends with like half of the up-and-comings in SFF short fiction today. Hanging out in Final Fantasy chat rooms turned out to be its own network.  Which short story in your body of work so far was the hardest or most challenging for you to write and why? And which is your favorite and why?  It was really hard to write “The Woman in the Hill” for Lynne Jamneck in the Dreams from the Witch House collection because I was writing a story very close to home. There’s a weird embarrassment one gets when you are writing about your homeland. It feels as though it isn’t the correct landscape for media. It’s a bit cringe. It feels like school writing. You’re sitting with a view of Maungakiekie, writing tortured metaphors about the volcano or whatever. At the same time, though, it’s so exciting—it feels suddenly so real, you feel so connected to yourself.  I was a seven year old in Whitford again going to check on which chicken had been pecked to death by the other chickens. It’s a story very connected to what I perceived of the land and early fear of the bush. We constantly got told in primary school that the bush would kill you. You couldn’t move for sad stories in School Journal about people who had gone out into the bush for five seconds then died of exposure. It was suddenly about writing fears that were personal to me, scaring myself, and when I sent in the story I was very much like “This is taking the piss out of Lovecraft, but not in a good way. This is just a story for me, this blows.” But I love that one. It was my first Kiwi piece.  As I’ve said, writing “The Deepwater Bride” was scary in a different way because it was writing queer. Boy, do you ever feel indulgent writing queer. You feel like people are going to roll their eyes, but this is a feeling that definitely comes from inside the house, because people were delightful. It also was about teenage girls and I really thought I would get patronized from outer space but I was doing the community a disservice there, I got taken very seriously. By the time I got to “Union” I pretended I didn’t care so much. Union I wrote while living in the United Kingdom so it was extra strange writing a New Zealand story, I felt very vulnerable. I didn’t feel as vulnerable writing “The Deepwater Bride” because although it was queer, it was an American story. Also, I had such bad glandular fever at the time that I felt high as a kite. I was so sick that I was confident. I remember being so ill that I brashly emailed Ellen Datlow to ask if she needed help checking for typos in an anthology she was doing that I was in. I have never been so bold since. She was so kind, and I was so obviously deranged.  “Union” is my favorite story because it has the least easy moral of any horror story I have ever written. It is the story about how a devastated community does not end up banding together in an easy-to-absorb YouTube montage clip. Fear hollows you out over time.  Six stories and two novels since 2011, and your writing career has gained significant traction, including Gideon being a 2020 Hugo Award for Best Novel finalist, landing on the Locus Recommended Reading List, earning a SFWA Nebula Award nomination, and winning the Crawford. Does this mean you have more short fiction and more series planned/in the works? Or do the accolades create a stifling sense of pressure?  Oh, you have my number. It’s the stifling sense of pressure, though I’d apply that to myself without being nominated for anything. I find it hard to really accept that I have ever been nominated for anything. My brain, which has betrayed me in a variety of ways but has helped me out with this one, often forgets I have been nominated or recognized. If I wasn’t currently writing the last in the series I would probably have blissful moments where I forgot I wrote Gideon. I have a condition that involves serious psychosis and memory oddities—I don’t mean to get heavy, but my brain does hilarious stuff when I get nominated.  Joy can often feel very painful instead of nice, and whenever I am nominated for anything I either immediately forget about it or I assume it is a trick letter from deep plants who wish to put me away. I constantly check emails for hidden clues. (My Nebula nomination turned out to have been from official SFWA members, which was almost a disappointment.) Thankfully I was a lot more uncomplicatedly delighted to win the Crawford because Gary Wolfe called me up to tell me and I was 90% sure that Gary Wolfe was not a plant. I don’t mean to imply I live a life of tragedy, because it is often genuinely funny to be me. (We had people clapping outside my house last week to celebrate the NHS and I got a fright and had to be talked down that they were not celebrating my incipient murder, like blackhearted Animal Crossing villagers.)  But at the end of the day getting nominated is a huge honor, and worth any amount of panic or paranoia. I’m both bewildered and grateful for the SFF community’s critical reception and accolades. If anyone wants to nominate me for anything please do so, I can’t imagine how tragic it would be if people were like “Well, I enjoyed the extremely oblique Ezra Pound reference in Gideon the Ninth, but I can’t nominate it because Tamsyn Muir will freak out at the email.” Please nominate me! It’s so nice for everyone who works on my books, and at the VERY least when I got my Nebula nomination Tor.com sent me a chocolate dog. That was wonderful. I was eating its head for weeks.  In the realm of future projects: I’m getting back on that horse and writing a piece of short fiction, I have a novella that Subterranean Press hasn’t announced yet but please look out for it, and I also have other mystery projects in the works.  What have you read lately (short or long) that really excited you, that you want everyone to read?  I was trying to see if I could cope with reading apocalyptic fiction during the pandemic and went back to Storm of Locusts, Rebecca Roanhorse’s sequel to the incredible Trail of Lightning. The answer is that anyone who wants to cope with a counterirritant during the pandemic ought to read the whole Sixth World series. I’ve made it my recommendation before but it’s doing very particular things right now, in an age where I’m only reading comfort food and detective novels.  Roanhorse is so snappy and so tight and her tension is so good—she’s the rare author where her BAWWW jump scares are so finely crafted that you want them to come just so you can feel release—and although the tough-as-hell Maggie and her crew make me go in my cozy quarantine nest “Ah, yes, I will not survive Big Water,” there is something very soothing about imagining the people who do. As I am fairly sure Philip Larkin said in “An Arundel Tomb,” what will remain of us is guns. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nThe Horror of it All! A Conversation with Tamsyn Muir\nTamsyn Muir landed on many readers’ radars with the release of full-length novel Gideon the Ninth, published by Tor.com publications in September 2019. Beyond blurbs and promises of something utterly unique, readers showed appreciation through Goodreads Choice nominations in two categories, as well as nominations and short listing for an array of other awards such as Brave New Words, BooktubeSFF, the 2020 Reference and User Services Association’s selections, and Audible’s Best of 2019. Gideon made editor’s pick in Amazon’s Best Books of 2019. In more genre focused circles, Gideon received a SFWA Nebula Award nomination, became a 2020 Best Novel Hugo Award finalist, landed on the Locus Recommended Reading List, and won a Crawford Award.\nTamsyn Muir was born in Australia, grew up in New Zealand, and later moved to Oxford, England. She flexed her writerly muscles posting fan fiction and started taking writing seriously in 2010, when she attended the Clarion Workshop in San Diego. Her debut professional publication, “The House That Made the Sixteen Loops of Time,” came out in Fantasy Magazine in 2011, followed by Shirley Jackson Award finalist “The Magician’s Apprentice” in Weird Tales in 2012. In 2015 The Magazine of Fantasy & Science Fiction published Eugie, World Fantasy, and SFWA Nebula award finalist “The Deepwater Bride.” All evidence that even before her big splash with Gideon, her stories were well worth reading.\nHarrow the Ninth is due August 2020 and Alecto the Ninth in 2021.\nYou’ve been nominated twice for Shirley Jackson awards, for “outstanding achievement in the literature of horror, the dark fantastic, and psychological suspense.” What, for you, are the defining characteristics of horror? And what are some examples of your favorite kinds of horror?\nI can immediately tell you an example of my LEAST favorite kind of horror, which is the jump scare. It’s not even because I don’t admire the jump scare—a well-crafted literary or visual jump scare is among the finest achievements horror can aspire to. I just hate them. I’m very frightened of my adrenaline being manipulated suddenly. I don’t like it when something jumps out at me and goes BAWWW.\nThere are moments in Stephen King’s It that are so sudden and so violent and gruesome and terrible that I won’t even describe them here, but they turned me into a whimpering pillar of sweat. It’s much easier to be manipulated with something visual, but the literary jump scare is still bad. And I guess because I view them with such revulsion, and because I’m vaguely mad that someone popped a paper bag really close to my ear, they’re not the moments that live with me—they’re the moments that get to me at 3 AM when I’m trying to sleep and my boiler pipes are making a weird noise.\nMy favorite kind of horror is the slow reveal. Horror’s horror if it scares you either way—much like erotica, it is looking for the physical response—but I think the defining characteristic of my favorite type of horror is a realization of the uncanny: the slow lifting of a mirror up to your face so you can see the crack. I love it when horror stains backward through an entire text. As a horror reader, I’m always tightening up protectively to guess and to guard against that moment, and I want horror to have been sitting in my blind spot the whole time.\nI know Lovecraft can be very tedious, but the end movement of The Shadow Over Innsmouth is wonderful in this way. And because I’m desperate to keep highlighting speculative video games, Kotaro Uchikoshi’s Zero Escape series just keeps on doing this over and over and over. Zero Time Dilemma especially plays with your assumptions like a tiny thumb piano, and the result is some of the finest horror writing I have ever consumed. This all sits with me much longer than the moments where something has jumped out at me and gone BAWWW.\nHarrow the Ninth is coming out in August. The Macmillan site calls it “a mind-twisting puzzle box of mystery, murder, magic, and mayhem.” But categorizing your books is somewhat debated. Do you consider them to be horror, or any specific type of horror?\nThe Locked Tomb trilogy is definitely intended to be horror, but again, what I’m going for is the horror of the slow realization. I want to pull the curtains back very slowly. I mean, that said, Gideon is pocketed with the kind of slasher movie tension where (I hope) one sits in the audience doing the panto LOOK BEHIND YOU!!/DON’T GO DOWNSTAIRS!! routine, and Harrow is my delving straight into gothic. Much of Harrow is about girls in their nightgowns staring down darkened corridors. Isn’t everyone’s favorite bit of The Woman in White the sequence where Marian Halcombe finds herself more and more constrained within Blackwater Park?\nDo you have craft techniques you use to make style and voice work?\nOnly in that I think a lot about different voices and texture. Rhythm helps. I don’t have any specific craft techniques—I never got formally taught to write—but an innate love of horror and comedy and the way in which both those things are peanut butter and chocolate helps. I think it ends up being more surprising for people who have just read straight comedy or straight horror and think I’m doing something clever and accomplished when I slide between the two. I absolutely am not. I have never done anything clever or accomplished in my whole life except the day I worked out you could put KFC fries in the little bread roll they give you and make a potato roll.\nI think the best thing you can do to write for style and voice is to do a lot of parody work first. Parody doesn’t necessarily mean satire or takedown; writing to mimic a specific voice or style is parody, and it teaches you a lot about how to evoke different styles and sounds. Every fan fiction author worth their salt knows this, but I think there’s so much anxiety coming out about finding one’s own authentic voice and being original and different that we sit down and start to panic about being the newest most fresh original voice. The secret is that we never can. Just writing the exact way one feels comfortable writing in does a lot to create the effect.\nAre there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?\nBecause I’m so wildly shortsighted, I have trouble with my room descriptions at times. I know this sounds really small and petty but it is a massive problem for me. I have no idea how far away anything is from anything. Because rooms are just blurs, I tend to go nuts on the micro and end up describing somebody’s coffee mug while failing to note anything else about the room. Maybe this is actually just because I spent a long time writing MUD room descriptions in the late nineties. There is a table here! You see an axe.\nAre there important differences between the style and voice of your novels and your short fiction?\nI think it’s funny that one can pinpoint the exact moment when I relaxed enough to start writing gay themes and jokes. It took me until about 2014. I was still convinced queer wouldn’t sell, or that it would only sell to a niche market, or that it would make people not take me seriously. C.C. Finlay did an enormous amount for my confidence when he bought my novelette “The Deepwater Bride” for F&SF. You can see me doing a lot stylistically when I went on to do in Gideon—constant mixing of low language and high, genuine love of Lovecraftian melodrama but also unable to not take the piss out of it—but it is fundamentally me doing a parody, whereas Gideon is just me. “The Woman in the Hill” is also Lovecraft pastiche, but no jokes. I’ve got quite a broad range of stuff, and I always wanted to move on to the next thing, so it’s quite a Catholic collection of stories and voices and styles. And Harrow, the sequel to Gideon, is different again. I wonder if the main thing on display is my short attention span.\nAre there important similarities and differences between the first and second books? Where does Harrow take the narrative?\nHarrow is written in a mix of second person and third, a mix that has already sent people screaming to the hills. Very relieved that N.K. Jemisin already softened the audience up for that one, though being a following act to Jemisin is like having the ass of your ego kicked downstairs. Gideon is a slasher detective novel, Harrow’s high gothic puzzle. And if Gideon was Myst, Harrow is that one lateral puzzle about the dead guy hanging over a pool of water in the locked room, only the water’s the protagonist’s entire past. The narrative does shine a torch on more of what I’m doing with the universe I’m working in, as I kept that beam very small in Gideon. It’s a novel meant to disorient. Indulgently, it is also a novel about psychosis. Even more indulgently, it is a novel about poetry.\nThere’s lots and lots of stuff in there for close readers of Gideon who have been diligently collecting bread crumbs. This is a novel for people who use Post-its. I don’t have a brand ambassadorship with the Post-it guys but maybe they should give me one? I’m right here. Post-its! When you’re too good for the back of an envelope.\nAre you already working on Alecto the Ninth? Have the plans for the overall series story changed in any ways since book one’s first few drafts?\nAs I write, Alecto ought to be finished quite soon, given a prevailing wind. Quarantine isn’t helping; you’d think it would. What is helping is that the overall series story has not changed from day one, which I am devoutly grateful for. I’ve been seeding so much stuff that a massive change would make nonsense of the whole series. I knew the narrative arc before I started Gideon, and the only things that have been cut have been scenes where I realized before I wrote them that they wouldn’t work—very minor scenes like “Tea party here,” not big-ticket items. I mean, very often the novel looks quite different than how it did in my head, but this is the usual author’s lament—this seemed cooler in my brain! A few jokes have gone because my editor looked at them and said no. Sometimes I have been the one who looked at them and said no. But the big stuff, the plot throughline, that’s been the same since day one, and that’s been a lot of the pleasure of writing the books.\nWhat is important or special to you about the series overall?\nOh, what isn’t! Naturally I love it; I wrote it for the edification of my seventeen-year-old self. Because I do not have a landline to her I also wrote it for the edification of my loved ones. Each time they laughed at a joke I was given godlike power. I think my very favorite thing about it is that it is about a lot of very gruesome queer women dealing with trauma and love and having terrible ugly bonds with each other.\nI do love stories about how the unflinching love of women for other women is a unifying force for good, and stories that uplift queer strength, but also: What if you made the bun of a burger fried chicken, instead of bread? KFC did that. They called it the Double Down. It is only just now that I realize how funny Double Down is, as a moniker. The Double Down is neither sophisticated nor good and may even worsen conditions you already have. Certainly it is a symbol of excess, and may even be a symbol for the evils of capitalism. But—the buns are also fried chicken!\nI have attempted to write the science-fantasy gay Double Down. No women in these books who look at each other should look at each other. They should go practice radical self-acceptance, get therapy, then marry those wonderful girls who take care of the elephants at the zoo. But they’re not. They’re wielding swords, raising the dead, and having affairs with each other. The buns are also fried chicken.\nYou went to Clarion in San Diego in 2010. Did the program have a measurable impact on your writing?\nI’d never written a short story before Clarion, so unambiguously yes!I had to write two in a hurry just in order to audition. I always thought that short stories were beyond me. After Clarion I saw them as a perfection of the form. I wish I was as good at short fiction as I want to be; a really fantastic piece of short fiction brings tears to the eye. In many ways I think it is much harder than writing a novel. You have so much less room to move and fewer tricks to deploy. Getting familiar with short story definitely made me a better writer, and in any case Clarion gave me a toolbox to examine my own writing in a way I hadn’t before—not because Clarion somehow holds the secret keys to the box of self-critique, but because it forced me to take myself seriously. That is worth infinity money. My brother scrounged the funds for me to go, because what a saint, and that was also helpful in its own way because I couldn’t not let it have an impact—I had to absorb everything or else what was the point. It was especially good for me as a fanfiction writer because I could not indulge. I had to condense. It was wonderful training.\nYou sold your first short story right after Clarion. What was the road to selling the novel series like?\nI intended to follow a very traditional route. I wanted to sell short fiction until I got really good at it, and then I thought possibly someone might notice me and I would never have to do the soul-crushing thing of looking for an agent and I’d move on to novel work. This sounds sensible, but I wasn’t. I sold a story out the gate, then I sold another story right out the gate, and then my brain shut down because I felt I had to get a perfect record. I sold like six stories without a rejection. Then I got a rejection, and my brain was all, “Oh! It’s over.” I can’t believe how wasteful and stupid that was and is. I loved writing short fiction, I’d had a handful of good years and some nominations, and I hung up my hat because I submitted and got the soft touch “not a good fit” letter? I should be in jail. Anyway, an agent came knocking but then I still had to go looking for agents anyway because it turned out I was writing in a different genre, and then I had a spate of agents who never bothered to look at the manuscript because I can’t pitch for toffee, and then I found an editor before I found the agent. So I didn’t go a traditional route at all. But I wanted to.\nI quit my day job to become a games writer just before finishing Harrow. I loved every moment of it, but I did not realize that although it is apocalyptic for a writer if your publisher/studio shuts down, for game writers it is Tuesday.\nDo you feel like coming from New Zealand and living in Oxford is a barrier to publishing in US markets in any particular ways?\nThis question’s really interesting and so much has changed in a really short period of time. There are a lot of very intelligent and interesting conversations going on about publishing in New Zealand as an SFF author. I think Melanie Harding-Shaw is writing really interesting stuff about it that resonates with me. For me, back in 2010, I just assumed nobody would want what I was selling in NZ. I wasn’t writing what I felt at the time was the NZ story, which would have been a contemporary about drowning at your bach. There’s a huge and very nice population in the UK where SFF fandom is concerned, but I never took advantage of them because I didn’t know where they were and never went looking. I was too busy getting the sweats and trying to pay off my student loan. I think the biggest barrier in being a Kiwi publishing in a US market is in your work, i.e. writing how you’d normally write. My story “Union” for Clarkesworld, which is probably the story I’m the most proud of, I copped flak for because the dialogue was “impenetrable.” I hadn’t realized I was doing anything weird. And I’m always arguing with my poor copyeditors because I want to keep the Kiwi voice and they’re quite reasonably “no American would ever understand what you’re saying here.” I make that my hill to die on quite a lot. I just think American audiences would rather read me as me rather than doing a Sorcerer’s Stone and rewriting jumper to be sweater. Also, anyone having problems parsing my work because of the Kiwi writing is probably having a lot of other problems simultaneously and will inevitably decide that I’m not their type of thing.\nIt is always difficult to not be in America and take part in the American publishing and fandom get-togethers. Everyone seems to know each other. I went to the Nebulas back in 2015 and everyone was super friendly, very generous with an outsider, but it DID feel as though everyone else had attended SFWA meetings in the womb. It’s rough if you’re trying to make a name for yourself and you don’t get to go to the bar cons or the parties. I imagine this is also rough for anyone who is simply shy. I am international and shy, so I felt tragic. It’s not the end of the world, especially because I was lucky enough to network at Clarion and I would also go on to find out that I had been teenage Internet friends with like half of the up-and-comings in SFF short fiction today. Hanging out in Final Fantasy chat rooms turned out to be its own network.\nWhich short story in your body of work so far was the hardest or most challenging for you to write and why? And which is your favorite and why?\nIt was really hard to write “The Woman in the Hill” for Lynne Jamneck in the Dreams from the Witch House collection because I was writing a story very close to home. There’s a weird embarrassment one gets when you are writing about your homeland. It feels as though it isn’t the correct landscape for media. It’s a bit cringe. It feels like school writing. You’re sitting with a view of Maungakiekie, writing tortured metaphors about the volcano or whatever. At the same time, though, it’s so exciting—it feels suddenly so real, you feel so connected to yourself.\nI was a seven year old in Whitford again going to check on which chicken had been pecked to death by the other chickens. It’s a story very connected to what I perceived of the land and early fear of the bush. We constantly got told in primary school that the bush would kill you. You couldn’t move for sad stories in School Journal about people who had gone out into the bush for five seconds then died of exposure. It was suddenly about writing fears that were personal to me, scaring myself, and when I sent in the story I was very much like “This is taking the piss out of Lovecraft, but not in a good way. This is just a story for me, this blows.” But I love that one. It was my first Kiwi piece.\nAs I’ve said, writing “The Deepwater Bride” was scary in a different way because it was writing queer. Boy, do you ever feel indulgent writing queer. You feel like people are going to roll their eyes, but this is a feeling that definitely comes from inside the house, because people were delightful. It also was about teenage girls and I really thought I would get patronized from outer space but I was doing the community a disservice there, I got taken very seriously. By the time I got to “Union” I pretended I didn’t care so much. Union I wrote while living in the United Kingdom so it was extra strange writing a New Zealand story, I felt very vulnerable. I didn’t feel as vulnerable writing “The Deepwater Bride” because although it was queer, it was an American story. Also, I had such bad glandular fever at the time that I felt high as a kite. I was so sick that I was confident. I remember being so ill that I brashly emailed Ellen Datlow to ask if she needed help checking for typos in an anthology she was doing that I was in. I have never been so bold since. She was so kind, and I was so obviously deranged.\n“Union” is my favorite story because it has the least easy moral of any horror story I have ever written. It is the story about how a devastated community does not end up banding together in an easy-to-absorb YouTube montage clip. Fear hollows you out over time.\nSix stories and two novels since 2011, and your writing career has gained significant traction, including Gideon being a 2020 Hugo Award for Best Novel finalist, landing on the Locus Recommended Reading List, earning a SFWA Nebula Award nomination, and winning the Crawford. Does this mean you have more short fiction and more series planned/in the works? Or do the accolades create a stifling sense of pressure?\nOh, you have my number. It’s the stifling sense of pressure, though I’d apply that to myself without being nominated for anything. I find it hard to really accept that I have ever been nominated for anything. My brain, which has betrayed me in a variety of ways but has helped me out with this one, often forgets I have been nominated or recognized. If I wasn’t currently writing the last in the series I would probably have blissful moments where I forgot I wrote Gideon. I have a condition that involves serious psychosis and memory oddities—I don’t mean to get heavy, but my brain does hilarious stuff when I get nominated.\nJoy can often feel very painful instead of nice, and whenever I am nominated for anything I either immediately forget about it or I assume it is a trick letter from deep plants who wish to put me away. I constantly check emails for hidden clues. (My Nebula nomination turned out to have been from official SFWA members, which was almost a disappointment.) Thankfully I was a lot more uncomplicatedly delighted to win the Crawford because Gary Wolfe called me up to tell me and I was 90% sure that Gary Wolfe was not a plant. I don’t mean to imply I live a life of tragedy, because it is often genuinely funny to be me. (We had people clapping outside my house last week to celebrate the NHS and I got a fright and had to be talked down that they were not celebrating my incipient murder, like blackhearted Animal Crossing villagers.)\nBut at the end of the day getting nominated is a huge honor, and worth any amount of panic or paranoia. I’m both bewildered and grateful for the SFF community’s critical reception and accolades. If anyone wants to nominate me for anything please do so, I can’t imagine how tragic it would be if people were like “Well, I enjoyed the extremely oblique Ezra Pound reference in Gideon the Ninth, but I can’t nominate it because Tamsyn Muir will freak out at the email.” Please nominate me! It’s so nice for everyone who works on my books, and at the VERY least when I got my Nebula nomination Tor.com sent me a chocolate dog. That was wonderful. I was eating its head for weeks.\nIn the realm of future projects: I’m getting back on that horse and writing a piece of short fiction, I have a novella that Subterranean Press hasn’t announced yet but please look out for it, and I also have other mystery projects in the works.\nWhat have you read lately (short or long) that really excited you, that you want everyone to read?\nI was trying to see if I could cope with reading apocalyptic fiction during the pandemic and went back to Storm of Locusts, Rebecca Roanhorse’s sequel to the incredible Trail of Lightning. The answer is that anyone who wants to cope with a counterirritant during the pandemic ought to read the whole Sixth World series. I’ve made it my recommendation before but it’s doing very particular things right now, in an age where I’m only reading comfort food and detective novels.\nRoanhorse is so snappy and so tight and her tension is so good—she’s the rare author where her BAWWW jump scares are so finely crafted that you want them to come just so you can feel release—and although the tough-as-hell Maggie and her crew make me go in my cozy quarantine nest “Ah, yes, I will not survive Big Water,” there is something very soothing about imagining the people who do. As I am fairly sure Philip Larkin said in “An Arundel Tomb,” what will remain of us is guns.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/muir_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Horror of it All! A Conversation with Tamsyn Muir by Arley Sorg"}