{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nick Wolven", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "11SpflK5AkahJq7yXhYhqJr4iJk=", "id": null, "license": null, "comments": "", "raw_text": "8060 words, novelette  When the Sheaves Are Gathered  1  It’s 3 a.m., and Kip’s been at it all night, to the point where Johnny has had enough. Coming into the kitchen, he can’t believe what he’s seeing. Bottles all over, spills of sugar, a fifth of tequila lying tipped in the sink. And shards, too, literal pieces of glass, because the stupid kid, in his coked-up excitement, has jumped and smashed his head into the kitchen fixture, raining wreckage into the room.  The bulb’s intact, so Johnny can see Kip’s face, see he has no idea what’s happened. “Johnny?” Kip holds up wounded palms. “What’d I do?”  “Come on, kid.” Johnny stabs hands into Kip’s armpits, forklifts him up. “On your feet.”  “Did I hit my head?” Kip looks into his palms, where blood and glass mix in peppermint-colored swirls. He’s an idiot, but a beautiful idiot.  “You hit the light.” Johnny points. “You’re high. This is what comes of mixing coke and Kraftwerk at 3 a.m.” For a second, they’re angled together, hip to hip, and of course that’s when Armin comes into the room, stands a beat with his tongue in his cheek, and says:  “My, my, my, what have I been missing?”  “All right, Joan Rivers. Help me with this guy.”  They get Kip across the hall into the bathroom, where he lolls on the toilet humming “Angel of the Morning” while Johnny holds him steady, and Armin cleans his hands. It’s not bad, not like it could’ve been, though God knows what eight shots of Cuervo will do to a poor young queen’s insides. The other guests cluster in the hall, gossiping, gawping at the grooves of muscle showing through Kip’s tight shirt.  “Poor boy,” someone says, “it’s past his bedtime.” That’s their cue to get Kip across the hall, flump him on the foldout, pour water between his teeth.  “What’s that?” Johnny whispers. Because Kip is muttering, words coming out slobbery and unclear.  Armin says from the door, “Just let him sleep.”  “I think he’s trying to tell us something.”  Kip sits up, gaping, then falls back, passes out. His eyelids droop, but his lips are still moving. Johnny has the idea if he parted Kip’s jaws, looked in the boy’s mouth, he’d see words in there, trapped, trying to fly free.  “He’s fucked up,” Armin says. “He needs to convalesce.”  It feels wrong to leave Kip lying in the dark, but Johnny backs out and shuts the door.  “You always do this,” Armin clucks. “You fuss.”  Lowering his voice, Johnny says, “What’s the count?”  Armin jerks a thumb. “Two on the patio. Roy and his friends are still at it in the living room. Chuck and the Slab . . . ”  The way he trails off, eyebrows jumping, sends a trail of ice down Johnny’s spine.  “Shit. Really?”  “’Fraid so.”  “In our bed?”  Armin holds up his hands, presenting the world in all its luxuriant absurdity.  They clear the living room first. Johnny scratches the record, making Chaka Khan choke off mid-wail. Then hall, kitchen, bathroom. Whoever was on the patio has already vanished, a cigarette left smoking on the bricks.  Johnny tackles the situation in the bedroom. Chuck and the guy they call the Slab haven’t used the bed, but are lying next to it, curled up in postcoital repose. Johnny digs a toe in. “Lovebirds. Up ‘n’ at ’em.”  Chuck rises, stretches, makes a kissy face. The Slab hauls his muscular ass off the floor. “Good party,” Chuck grunts, eyes bright above his Burt Reynolds mustache. He cops a feel of Johnny’s upper arm. Armin once said Chuck rubbed against so many hard bodies, it was a wonder friction hadn’t worn him smooth.  “Stop by sometime. I’ll give you a birthday gift.” Chuck winks, making his mustache wiggle. Johnny groans and shoves him away.  Then it’s out into the shivery dark, goodbye, goodbye, the guests straggling off, while overhead the city glows with all its tipsy towers. Johnny can already feel the dawn coming, a pressure of light beyond the sea. He wishes he could have this moment forever, the sad sweet end of a perfect day. Then hands weight his shoulders. Breath strokes his neck. Johnny pivots into the clutch of Armin’s kiss.  “Happy thirty-fifth, old-timer.”  “Thanks. You know how to make a boy feel special.”  “You’re ancient. A relic. And that means you’re all m-i-i-i-i-ne . . . ”  Armin pirouettes to the bedroom. Johnny still wants to check on Kip. He pads down the hall. The guest room smells of sleep farts and alcohol. On the foldout, Kip is sprawled limbs akimbo, sleeping the knockout slumber of the drunk. Johnny grabs his ankles and straightens him out. In the half-light, Kip looks achingly young, angelic, a vision. The change in position stirs something inside him.  “What’s that?” Johnny puts an ear to Kip’s mouth. In a superstitious way, he feels this could be important, a subliminal missive, a message from beyond. The boy’s voice comes out singsong and sloppy.  When the sheaves are gathered, When the geese have flown, Summer’s ribbons stored away, Fruits and flowers grown . . . Johnny shakes him. No response. He hesitates. Kip’s ditty isn’t the kind of thing you expect a drunk party boy to be humming in the era of MTV. Yet Johnny’s sure he’s heard it before, far back, a tune out of time.  When the sheaves are gathered . . .  Irrational fear tweaks the hairs on Johnny’s neck. Maybe this is what it’s like getting older, this tickle of death breathing down your spine. His last view is of the streetlight through the window, the spectral curve of Kip’s sleeping cheek. Then the door swings shut, the latch clicks, the day is done.  2  “Up ‘n’ at ’em, cowboy.”  Johnny groans in wan dawn light, so exhausted he can barely remember his name. He fumbles for the glass of water by the bed. In the bathroom, Armin is humming Boy George, making the faucets bark and cough. He comes to the bedroom, stands in the door, mimes shooting himself in the head.  “You alive?”  “Ugh,” Johnny groans.  “How’s your head?”  Johnny can only wince and moan.  Armin laughs. “Guess we better get to it, huh?”  They gulp Advil, toast, coffee, eggs, and face the aftermath of the night.  “Looks like we partied even harder than I thought.” Armin sweeps a slipper through piles of shattered glass. “Any idea who broke the light?”  Johnny squints at the heap of shards. It’s curious, the feeling that comes over him now, like he ought to remember, but can’t summon details. It’s there in his mind—a file ready for retrieval—but each time he tries, he comes up blank, a chunk of core knowledge deleted from his head.  Johnny toes the mess. “I feel like I should know. But I can’t—”  “We gotta stop doing this,” Armin laughs. “We’re getting old. Can’t party like we used to.”  “We’re not that old.” Johnny’s getting tired of these quips about their age, as if thirty-five is the leading edge of death.  “In all seriousness, I’d like to know who destroyed our kitchen fixture.” Armin peers at the naked bulb, which appears to have survived the catastrophe intact. “Maybe it’s time to reevaluate the company we keep.”  “Uh-huh.” Johnny checks the sink, the floor. It’s maddening, the feeling he has right now, like there’s something he’s forgotten, a clue to this scene, if only his brain hadn’t misplaced the data. A clue gone AWOL, a wayward detail. He has an urge to check the spare room.  “You think there’s someone in there?” Armin trails him through the hall. “You didn’t have anyone over, did you?”  “That’s the thing, I can’t remember.” Johnny stops at the door. It’s silly, surreal. He’s sure nothing’s wrong. Yet he shudders as he raps the wood.  No answer.  “Well?” Armin says.  Johnny hesitates. Grabs the knob. Gives a twist.  The room’s empty. A sour smell fills the air, as if someone’s been here, but there’s no other sign. The foldout’s open, covered with a sheet. A cairn of cushions teeters on the floor. Armin points his mug.  “Someone fixed up the bed. Doesn’t look like he used it, though.”  “Nope.” Johnny pats the mattress, the pillow. There’s nothing remarkable, no sign of trouble, yet he feels as if someone ought to be here. He peeks behind the couch.  “What exactly are you looking for?” Armin says.  “I feel like we’re missing someone, somehow.”  “Someone? Who? An adopted child? You kidnap somebody last night without telling me?”  “I wish I could remember.”  Armin laughs. “It was that good a party, huh?”  Johnny smiles. He has to force it. What bothers him isn’t the emptiness of the room, but the emptiness inside his own head. A gap in reality, a wound in the world.  “Come on,” Armin turns. “If someone was here, he’s already gone.”  Life settles into its usual groove, a weekly rhythm of chores and chats. There’s plenty to think about, plenty to do. Lunch at the office, Friday night dancing, exercise three days a week. It’s this, Johnny decides, that really shows they’re getting older. Not budding fears or physical wear, but the slow, steady creep of routine.  He can’t quite shake the sense of something missing, a tug of a memory that won’t quite come. Johnny makes Armin sit down one night and list every person who was at the party.  “Let’s see. There was Roy and Roger—”  “And Jim.”  “And Dave and Don. Plus Dave’s friend with the infected piercing.”  “Merv. Merv the Perv. And Tim and Chuck.”  “Yes. And the Slab.”  And Ed and Larry, and Lou and Joe, and Tracy the man and Traci the woman, and Jerry C and Jerry O and Jheri as in Jheri curl, and Logan and the man who came with Logan, whose name they’ve forgotten, but whose sideburns they’ll never forget. Everyone checked-off, accounted for. But Johnny could swear a face has been misplaced.  “I don’t see who could be missing.” Armin caps his pen. “This is everyone we know.”  “Someone with a K, maybe? Katy? Kevin?”  “You mean Kayla? She moved to LA.”  They give up, though Johnny’s still not satisfied. He’s sure someone slept in the guest room that night. He just can’t seem to remember who.  Life goes on, as it always does, and Johnny does his best to move on. There are other incidents, missing details, a feeling that something’s been misplaced: a note, a book, a face, a friend. Johnny finds himself pausing on the street, looking into random apartments, marveling at the number of strangers in this town.  Nothing to worry about, right? Stress. Fatigue. Or just the chaos of city life. Johnny chalks it up to ordinary absentmindedness, mental wear from a harried life.  Meanwhile, life offers new challenges. Business at the gallery, lost youthful dreams, summer crowds that seem wearier than ever. Was the city always like this, Johnny wonders, strange and alien, like a monument to a forgotten past?  A few months later, there’s also this.  Slow morning at the office. A buzz of flies. The phone jangles at Johnny’s elbow, and he grabs the receiver, hoists it to his ear. The voice on the line is weirdly familiar, making Johnny narrow his eyes.  “Chuck?”  “You know it.” A husky laugh blasts into Johnny’s ear, evoking visions of bright teeth, a mustache. “How you been? I’ve been thinking about you, buddy.”  Johnny glances up. The office is silent, filled like a fishbowl with summer heat. There’s no rule against personal calls.  “Didn’t recognize me, huh?” Chuck grates out a laugh. “Guess we’ve never done this before. Talked, I mean. On the phone. You and me.” His voice drops to new depths of intimacy. “Listen, man, you free for lunch?”  “I could be.” Johnny pauses to wipe the receiver. “Why?”  The silence is so long, Johnny jiggles the cord.  “Nothing,” Chuck chirps. “Just been thinking. How you and me need to have a talk.”  “About what?”  “About the stuff we need to talk about.”  Johnny sighs. They make plans to meet in an hour, at Chuck’s club, the Sports Palace, eight blocks south. It’s one of those everything-plus-racquetball affairs, aerobics classes, courts and pools, a carpeted lounge where sexy singles meet and preen. Out front, in a café with juice and sandwiches, Chuck slides his hips into a sixties-style pod chair, shoving over a meal someone’s left on the table. The girl at the stand doesn’t even look up but smacks her gum and gives a rustle of her Vogue. The club seems weirdly empty today, but Johnny figures that’s the Friday lull.  “Guess it’s obvious what this is about.” Chuck’s uncharacteristically fidgety, toying with his laminated membership card. Beefcakes and bombshells strut behind him, white towels draped over taut brown arms.  “It is?” Johnny says.  “Come on, man. Are we gonna talk about this or what?”  Johnny’s stomach fizzes. Behind Chuck, women mill in a glass-walled room, restless in their leotards. A mirrored wall reflects puzzled pouts. Something’s wrong. A rubber mat lies empty. The instructor hasn’t shown, or a classmate’s missing, or a special guest has failed to appear. Who’s running this joint, anyway?  “Johnny? Hello? You with me, man?”  “Sorry.” Johnny drags his eyes to Chuck’s smile. “You were saying?”  “I’m saying, your party. Remember? The bedroom? Something happened in there. Or am I crazy?”  Johnny’s head feels light and airy, scooped out like a pitted fruit. He’s been wanting to discuss this subject for weeks, the strange suspicion that’s dogging his mind. A surge of superstition stops his voice. Like something will be ruptured if he voices his fears, a jinx, a hex, a cosmic balance.  “You mean what happened in the guest room, right?”  “Guest room? I’m talking about the bedroom, man. Your bedroom. Talking about you and me.” Chuck slaps the table. “Come on, you know what’s up. This has been coming for a long, long time.”  In the glass-walled room, the women are arguing, stamping feet, checking pocket planners. Johnny senses a vacancy in the air, as if the universe has gotten slightly larger, too big for the people floating inside.  “I’ll put it like this.” Chuck crosses his arms. “Remember Bobby?”  “Who?”  “Bobby Plotz. Tall guy, brown eyes?”  Johnny squints. He can almost remember. Then the face pops into his mind, a blurred cameo.  “Bobby, right. With the long hair? Kind of homely, but in a hot sort of way?”  “If that’s your type. Listen, here’s what I’m saying. You remember Bobby. But do you remember what happened to him?”  Johnny scrunches his forehead. “Did he move?”  “See, this is what I’m saying, man.” Chuck throws up beefy arms. “People leave, we barely remember. Connections break and no one cares. Me? Bobby? We used to be like that. Now? How long’s it been? I couldn’t even say.”  “Guess that’s what it’s like getting older,” Johnny mumbles.  “Is that what you tell yourself? Come on, man. We were a tribe. A pack, a crew. Now? When’s the last time you called an old friend? Guys like us, we can’t let this happen. We can’t let those connections slip.”  Johnny squints. He sees where this is heading. He knows where Chuck wants it to go. But he needs to discuss what’s on his own mind.  “I hear you.” Johnny nods. “I get it, I do. People drift apart. But those are just the ones we remember, right? You ever think about . . . ” Johnny swallows. “About the ones we don’t remember?”  Chuck nods as if in deep agreement, then freezes. “Huh?”  “You know.” Johnny feels like his head has gone hollow, filled with light, a frail Jack-o-lantern. In the exercise room, the leotarded women are giving up, heading for the door, shaking masses of thickly permed hair. A scheduling error? A glitch in the books?  “The others.” Johnny licks dry lips. “The ones we lost but can’t remember. The people we used to know, at one time, and now we don’t even know they’re gone.”  “What the hell are you talking about, man?”  “I mean, there must be people like that, right?” Johnny leans over, almost tipping a cup of carrot juice that’s sitting on the table, still full. He glances at the clutter Chuck’s pushed aside. A newspaper, open to the wanted ads. A sandwich. A leather case. Who left this stuff here, anyway?  “At school.” Johnny struggles to order his thoughts. “The office. Old coworkers. Classmates, colleagues. People we used to see every day. Acquaintances, relatives, friends of friends. Now they’re gone. And we’ve forgotten them so completely, we can’t even really be sure they were there. Gaps in our memory, vanished ghosts. As if they might as well not have existed.”  Chuck’s looking past him, at the open door. A woman stands with a hand on the glass, holding it open, staring into the street. No one’s there, just empty sidewalk, until a man bolts out of a taxi.  “You’re scaring me, man,” Chuck laughs.  “Don’t you feel it, though?” Johnny insists. “At certain times, on certain days? This nagging feeling, like something’s missing? Like there’s something you can almost remember, but not quite?” Johnny leans forward. “You know I play squash at eighty-sixth?”  “Sure.”  “I was at the courts the other day, ready for the match, and . . . ”  “Yeah?”  “No one’s there.”  “What, at the club?”  “Of course there were people at the club. But not at my court. My partner didn’t show.”  “He do that often?”  “I don’t know,” Johnny says. “I have no idea who my partner is. I have no recollection of ever having a partner. But I must have had one at some time, right? Why would I schedule a match without a partner?”  Chuck’s mouth opens, then shuts, like he knows there must be a reasonable explanation, but can’t quite figure out what it is.  “It’s like déjà vu,” Johnny says. “Like losing your keys. Like that feeling you get when you could swear you own the White Album, but you look and look and it’s not anywhere.”  He scoots closer.  “How about this? Happy hour at Elmo’s. We’re there, the usual crew, saving a seat. People come. Anyone using this chair? Yes, we say, yes, yes, yes. Five times this happens. Then Roger looks up, asks, ‘Who are we saving this chair for, anyway?’ No one could remember. We all laughed, but I’m telling you, it was weird, man. Creepy.”  Chuck shakes his head. “Things like that happen all the time.”  “So why did we all make the same mistake? Why did it happen to all of us at once?”  “Who else was there?”  “Me. Armin. Lou. Roger.”  “See, this is my point,” Chuck says. “Ten years back—”  “There are other things.” Johnny rushes on, aware he’s talking too loudly, but needing now to get it all out. “The gym. Last week. I looked up, no one was spotting my reps. I swear someone had been, a second ago. Where’d they go? The other day, I was looking through my books. A bunch were missing. The Drowning Season. Valley of the Dolls. I lent them to someone, I’m sure, but who? It’s like there are fewer people, somehow. Like something, someone, has been whittling down the numbers.”  Chuck’s head is shaking. “This is what I’m talking about.”  “No,” Johnny insists. “This is different. This isn’t just people moving away. Who left this stuff sitting here, on this table? This sandwich, this juice? Why’s this club so empty? Why aren’t instructors showing up for their classes?”  “Johnny, listen to yourself.”  “You know what I’m saying. You have to know. You have to have noticed.”  Chuck’s leaning back, hands pressed to his chest. “Do I know what you’re saying? Sure. And I know where it’s coming from. Look, man, I’m not a guy to point fingers. But I can’t help but notice, since you moved in with that stiff—”  “Excuse me?”  “Don’t act like you don’t know. Ten years ago? We were animals, man. We’d hit the clubs and know every face. Now? I hardly see you. Ever since you and that mummy started playing house, it’s been—”  “Jesus.” Johnny groans. “This isn’t about me and Armin, Chuck.”  “You don’t think so?” Chuck folds his arms. “Let me tell you something about Armin. Armin was born with a foot in the grave. You and me, Johnny? Guys like us? We need to live while we’re alive.”  “I’m trying to tell you something, Chuck.”  “And I’m trying to tell you something. You’ve always been like this. You fuss. You fret. You worry about stuff you can’t change. If you give me a chance—”  Johnny doesn’t hear the rest of what Chuck’s saying. A sound floats over the café tables, faint, lilting. The girl at the register is bent over her magazine, singing softly between smacks of gum.  When the sheaves are gathered, When the geese have flown, Summer’s ribbons stored away, Fruits and flowers grown, When the frost gleams on the glass Where sun and raindrops shone . . . “Johnny?” Chuck’s standing, hands spread on top of his chair. Johnny realizes he’s standing, too, lured by the tune floating over the tables. He crosses the room.  “Hey. Where’d you hear that?”  The girl’s eyes narrow above her magazine. “Hear what?”  “That song. The one you were singing just now. Where’d you learn it?”  She frowns, tonguing her gum into her cheek.  “Come on, you know, the one you were just—” Johnny groans and wheels away, lurching back to the waiting table, where Chuck holds up baffled hands.  “The hell, man?”  Johnny picks up the uneaten sandwich. The bread is still soft. Fresh. Untasted.  “Was someone sitting here?” Johnny calls over his shoulder. “At this table? Before we came?”  The girl stares.  “Goddamn,” Johnny grunts, letting the sandwich fall.  “Johnny, are you even listening to me?”  Johnny’s already moving, hurrying through the lobby, out into the midtown streets, which he can’t help but notice are ethereally silent, strangely uncrowded for this time of day.  The train ride home is eerily speedy, the seats mostly empty, the platforms bare. The streets of the Lower East Side are serene. Johnny counts cars as he hurries down his block. Three, four. Traffic is light, but maybe that’s the effect of the recession. Were there this many shuttered shops last week?  A man slumps in a doorway. A woman peers from an alley. How many of these people could vanish, Johnny wonders, before someone noticed and raised an alarm? If a day came when the unthinkable happened, if these worn, huddled figures dispersed into mist, would Johnny remember them? Would anyone?  He opens the door. The apartment is hushed. Johnny hurries down the hall. The tick of a typewriter comes from the guest room. Fridays are Armin’s do-not-disturb time. Johnny barges right on in.  “Uh, okay.” Armin swivels from the desk. “Everything all right?”  “You tell me.” Johnny paces the thinning carpet. Sweat tickles his nose. He spins, hands fisted. “Are we all right? You and me? Be honest.”  Armin takes off his glasses. Johnny sees a sheet curling out of the typewriter, speckled with print. Armin points with his glasses. “I’m three hours shy of my deadline here. Is there a chance this can wait?”  “No, I don’t think so. No, I really have to know.” Johnny throws himself onto the sofa, startled by how dazzle-brained he feels, shattered inside, a man of glass. “Listen. If I suddenly disappeared—no, just listen. If I vanished this instant, fell out of your life, would you . . . would you remember me?”  Armin tips his chair. “Where is this coming from?”  “I’m sorry, I just, I have this feeling. Like it’s all slipping away. And we don’t talk about it. No one ever talks about it. But we’re losing people, aren’t we? Losing people from our lives?”  Armin clacks shut his glasses. Frowns. Considers. “We have fewer friends than we used to, that’s true.”  “So you’ve noticed it.”  Armin sighs. “I wish I knew what brings this on.”  Johnny clutches his knees. The room, the world, is pumping like a giant heart, too big one second, too small the next. Johnny feels like he did at sixteen, starting a new school, that world of strange faces.  “I mean, you’re not wrong.” Armin pinches his nose. “Not a week goes by I don’t think about my mother. Or my cousin. Or my grandma. Or . . . well, all the others. But can’t we enjoy what we have while we have it?”  “I know, I know.” Johnny nods with a conviction that surprises him. It feels good to agree with these obvious facts, to have something to share, a basic understanding. “I know, you’re right, I just—”  “We’ve been fortunate.” Armin looks at the floor. “We have a home, a community. Can’t we savor it while it lasts?”  “You’re right.” Johnny gulps, embarrassed. He feels infinitely grateful for these sane, simple words. “Of course you’re right.”  “It’s just that you always do this, dear. You obsess.” Armin waits a beat before smiling. “Can I please finish this bitch of an article, now?”  Johnny laughs. Armin rises, stands over him, reaching down to tickle his neck. “I don’t give a shit about the rest of the world, OK? Whatever’s coming, whatever life has in store, the past can’t be changed. That’s something, right? Nothing can ever undo what we’ve had.” He nudges up Johnny’s head. “You understand?”  The worries of the week seem remote now, ridiculous, but Johnny’s laugh comes out shaky and faint. “Wanna hear something weird?”  “Five minutes.” Armin goes back to his chair.  “I was out with Chuck. Today. At his gym.”  “Uh-huh.”  “No, but listen. And this girl who works there, she was singing this old-timey song. It was odd, you know, hearing a kid today sing something like that. Quaint.”  “I see.”  “But here’s the thing. I was sure, I could swear, I’d heard it before. The tune, the words . . . it was so familiar . . . ”  Johnny snatches empty air, grasping a fact already receding, even as Armin leans back, closes his eyes, and intones with rich solemnity:  When the sheaves are gathered, When the geese have flown, Summer’s ribbons stored away, Fruits and flowers grown, When the frost gleams on the glass Where sun and raindrops shone, And winter’s silver trims the turf— “Stop.” Johnny’s voice comes out faint and slurred, the ghost of a shout. But Armin carries on, finishing the second verse, launching into the third, before Johnny jumps up shouting, “Stop, stop, stop!”  “Jesus. All right. What’s the matter with you?”  “Why did you do that?” Johnny’s shaking.  “Do what?” Armin scoots closer to his desk. “Really, Johnny, sometimes you drive me crazy.”  Armin pokes papers, looking over what he’s written, tapping keys, squinting through his glasses. Johnny stares, openmouthed, as the world fills up with a feeling of wrongness as vivid as a bath of blood. He clenches his hands. “You shouldn’t have done that, Armin. You shouldn’t have sung it.”  “Sung what? Johnny, come here.” Armin’s hand flaps. Johnny drifts over, to be taken by the wrist, drawn toward the desk, Armin’s upturned eyes.  “I love you, Johnny. Honestly I do. But sometimes? Dear? Sometimes you need to let things go.”  3  With one thing and another, it’s three months before Johnny manages to see Chuck again. The meeting almost doesn’t happen. Johnny shows up forty minutes late, and Chuck’s even later. The trains have been awful. Buses, too. It’s a system-wide problem, people are saying, a municipal crisis, bad city management. There are absentee issues, budget shortfalls, a decline in tax revenues. Johnny’s too busy to keep up with the news.  The club is deserted, a glass mausoleum, though Chuck says that’s typical for weekday afternoons. In the café, Johnny rings the bell three times, shouts for service, but no one comes. Chuck shrugs it off. “They’ve been short-staffed.”  They buy coffee from a roach coach and sit on the curb. Chuck’s mustache is gone. His hair’s a mess. He tells the usual tales of dating in the city, a litany of dropped plans, unanswered calls. It’s slim pickings out there, Chuck says. Empty. The old meat market has gone vegetarian. Really, though, when’s it ever been different? That’s the problem with city living, Chuck grumbles. Bad men are so hard to find.  He laughs. It trails off into a sigh. “I’ll go through my wallet,” Chucks says, “find ten numbers, then I call ’em all and don’t get a thing. Zip. I mean, what the hell? Did everyone simultaneously forget how to party?”  Chuck laughs again, but there’s weight to his voice, a load of unnamed anxieties. It’s something everyone feels, these days, though no one’s brave enough to say it. A mysterious mournfulness, a sense of decline. Johnny sees it in faces on the street, sometimes in the bathroom mirror, where his reflection peers back with a lack of expression, eyes uninterested in their own deadness, lips too lazy to sketch a fake smile.  “Anyway.” Chuck sips. “How’s your problem working out?”  “Don’t ask.” Johnny shivers. “I thought I had a buyer, but they bailed. Didn’t give a reason, just stopped returning calls. The realtor says it’s a buyer’s market.”  “You’ve got a great place, anyway. All that space.”  “I know . . . ” Johnny grimaces. Truthfully, he can’t imagine why he needed so much space. A two-person apartment? All to himself? He can hardly stand to live there, sometimes. The empty rooms, the surfeit of area. Even worse are the haunted nights, when he feels like a ghost is sleeping beside him, a chilly specter sharing the bed.  The loneliness can get so intense that little things will set Johnny off: the record collection full of bands he doesn’t like, the shelves of books he’ll never read. How much junk does one bachelor need?  “Must get lonely,” Chuck says, looking hard in Johnny’s eyes. And there’s an air of inevitability to the exchange when he adds, “It’s been a while since I was over . . . ”  Neither man bothers to call into the office. There isn’t much work to be done these days. Employers are lax about monitoring hours. Sometimes employees don’t show up at all. As their taxi jounces down empty streets, Johnny gazes up into rows of blank windows, some curtained, some boarded up. Few people are out. Must be the cold. Heat’s been spotty. Power, too. Johnny secretly loves the night view from his window, the scant golden squares scattered in the deep dusk.  In the vestibule, the two men embrace like mourners, holding each other before they kiss. For all his experience, Chuck’s a hasty lover. That’s fine, Johnny thinks, he’s not looking for excitement, only a little extra warmth in the bed. After finishing, they lie nude under the covers, watching daylight leak down the walls. Johnny says, “Hey, want to hear something funny?”  “Fire away,” Chuck mumbles, half asleep.  “I was talking with Merv today. Merv the Perv?”  “Is that the funny part?”  “Come on, just listen.” Johnny twists under the covers. “We were chatting about the news. The shortages, you know. Suddenly, he breaks out singing. Right in the phone. This folksy tune. Not the kind of thing you expect from a guy like Merv, huh?”  “What was the song?”  “I’m not sure what it’s called. Here’s the thing, though. All the time he was singing, I had this feeling, like I’d heard it before.”  “I hate that feeling.”  “No, but this time I got it. I figured out where I know it from.”  “Yeah?”  “My Aunt Clari.”  “Fascinating,” Chuck says.  Johnny looks out the window, where stars crowd the sky, unobstructed by the waning lights. “She used to sing to me, when I was . . . oh, gosh, this must have been thirty years ago. That was when she came to live with us, when she couldn’t keep looking after herself. I’d go to her room, bring her dinner and things. And she’d sing that song.”  “Old women are the worst,” Chuck says.  “I liked it, though. I don’t think I understood, you know, what it means . . . well, to lose your faculties. I found it soothing. I’d sit by her chair.”  “How’s Merv doing these days, anyway?”  Johnny’s silent. The city has tipped into night, plunging past the indefinite instant when shadows deepen from blue to black. Johnny can’t see Chuck’s face in the dark, not even the eyes, but he can hear the night noises, the hum of the fridge, a distant horn.  “Think about it,” Johnny murmurs. “Losing your mind. Not only your wits, but everything, all of it. Your memories, your past. Lovers. Friends. Jobs and hobbies. Even the names of your own children. And losing them so completely, so deeply, you don’t even know they were there at all. The only things Aunt Clari remembered were things from her own childhood. Her dog, her brother. Like the rest of her life might as well not have happened. Like her whole soul froze at the age of nine.”  “I guess that is as good a time as any,” Chuck says.  With the coming of night, the room has grown cold. Johnny pulls up the blanket. Chuck is talking in a drone, words tumbling out like electric signals, something preprogrammed, a canned announcement.  “ . . . didn’t want to just spring it on you. But it’s happening. Tomorrow. It’s all set up. I just . . . I can’t stay in this place, anymore.”  Johnny listens from far away, like a child listening for a train in the night. He waits for a noise from the street to interrupt, a siren, a shout, a crash of cans. But there’s nothing, the city is holding its breath, and Johnny realizes he’s been expecting this, though his tongue is like cotton and his fingertips are cold.  “Where to?” he says.  “Chicago.” Chuck sighs. “A part of me hates to leave, you know, but . . . I dunno, man. Lately—it’s strange. It’s not like anything has changed. I just, I look around, and I see—”  “Slim pickings,” Johnny says.  “You understand.”  In the neighboring building, a window brightens. A woman strides through the room in sweatpants, holding a phone.  “Johnny? You understand, right?”  It’s impossible, from here, to hear what the woman’s saying, but Johnny can see her lips at the receiver, flexing in a regular rhythm, miming words to a lilting song. He squeezes Chuck’s hand. He can picture the woman’s voice, the lonely tune she’s sending out into the night. The image is so clear, so vivid in his mind, that it doesn’t surprise Johnny when Chuck sings along, his rough voice picking up the tune, tempo, phrasing, every old-fashioned phrase, every solitary word.  4  It’s over, Johnny decides. It’s time.  He takes a last turn through the apartment, a silent tour to say goodbye. He barely notices the objects he passes, the king-size bed, the cooler, the magazines. There’s nothing in this place to hold him, now. The clothes in the closets, the pictures on the walls, are faded mementos of lives never lived, memorials to forgotten souls.  The hard part, Johnny thinks, will be telling Byron. They don’t communicate much, these days. When they do, it’s rote, automatic, a matter of necessity. They have endless arguments about food and fuel. Fights over books and snacks and games. Quarrels over whether to lock the door.  Johnny heads to the bedroom. He raids dressers, working slowly, stuffing a backpack full of socks. He tries to remember if they’ve used this place before. In the old days, they wandered far afield, sleeping in new apartments every night, forcing open doors, whispering like graverobbers. Searching, always searching, for other people like themselves. But the buildings they found were shuttered and brooding, bereft of any sign of life, and now they now stick to the places they know, jumping from one apartment to another, traveling a circuit in the urban core.  Johnny scrounges in a closet for tools. Flashlight, food, disinfectant, nails. There are times, even now, when he lets his mind wander, pondering the mystery of this vast empty town. Surely there were people here, at one time. Hands to raise these looming buildings, voices to crowd the empty cafés. But whoever they were, they’re long gone, leaving no clue to say where they fled. Only solitude, spreading in the streets like shadow, seeping from a million cold stones.  Johnny finishes packing as the front door creaks. From the kitchen comes a rumble of cans, a muffled curse. Johnny finds Byron at the counter, sorting soup, his movements brusque and efficient. Byron sees the backpack.  “Come on, man.” His eyes go dark. He looks beaten, resigned, but he puts out a hand.  Johnny steps past him. Grabs a few cans. There was a time, way back, when they tried to mean something to one another. But their bond now is strictly survival-based. Byron’s built like Stallone, not Johnny’s type, and the sex they had was labored and joyless, both of them working to push aside the weight of half-forgotten feelings. One night, without thinking, Johnny called Byron, “The Slab.” Their laughter faded into chilly silence, a ghost of mirth, waning into regret.  “You’re not pulling this crap again, are you?”  “I have to.” Johnny shoulders the pack. “I have to try.”  “Sure. Then what? You’ll be out there five hours, tops, then you’ll come moping back.”  “No. Not this time.”  Johnny heads for the door. Byron stomps behind him, grabs a shoulder, and spins him around. “You know, I’m getting sick of this human yo-yo crap. Get it through your head, Johnny. There is no one else out there. No one. Never will be, never was. Can’t we be content with what we have?”  Johnny sags. Byron’s right. Johnny knows he’s right. But a spooky sensation, a specter of memory, has slowly built up inside Johnny’s mind. With the wind weeping and sobbing outside, he shrugs off Byron’s hand.  “Sorry, man. This time it’s for real.”  The streets are cluttered with abandoned cars. Johnny hunts for one with keys. By the time he’s ready, the sun’s going down. As darkness settles the unpeopled town, he wonders why he waited to leave. What’s there to hold him in this place, anyway? A friend? A companion? A roommate? A lover? He can’t recall a single face.  Why has he spent his life in this ruin, Johnny wonders, wandering these empty streets? Was there ever someone to hold him here? He can’t remember anything but these sidewalks, the tomb-like towers, the phantom halls.  Johnny gets in the car and turns the key. He follows the highway north over the bridge, into a land of hills and cliffs. Snow powders the earth between the brown trees. There are houses, swimming pools, tidy lawns. Swing sets stand like props on a stage, waiting for actors to enter from the wings. Johnny knows no actors will be coming. The world has always looked this way, a project neglected by a lazy god.  He scoffs. When will he give up these fantasies? When will he accept that this is how things are, an empty world inhabited by one lonely soul? There have never been other human beings, never will be, and he’d better learn to accept that fact. Learn to be content with what he was, to simply give up and let things go.  High in the hills, Johnny turns off the highway. He stops and parks and takes a stroll. The homes here are small, suburban, prim. Johnny dodges tipped garbage cans, scars of ice that mar the sidewalks.  It shocks him, at first, when he finds the old house. But of course he’s been heading here all along, he realizes, drawn to this particular door.  The house is bland, a simple foursquare, rain gutters sagging like demented smiles. Johnny follows the root-heaved path. The porch welcomes him with a crooked grin. It’s like no time has passed since he last stood here, like decades have been compacted into moments. He pushes open the broken door.  The foyer’s dark. A window has smashed. The living room is stiff with cold. Warped furniture crowds a moldy carpet. Johnny eases the door shut behind him. That’s when he hears it.  A voice upstairs.  Johnny freezes. The voice carries on, singing faintly. Johnny heads for the water-warped stairs. On the landing, he pauses, a palm to the stucco. The tune is quaint, simple, soothing. Johnny’s sure he’s heard it before.  He mounts the last stairs. As expected, a door stands ajar at the end of the hall.  Johnny knows what he’ll find in the room beyond. It shocks him, all the same, the sight of her there, those soft gray eyes, the startled merriment of her smile.  “Why, Barry, what a wonderful surprise!”  “It’s Johnny, Aunt Clari,” he says, stepping in. “Your great nephew Johnny.”  She gropes for the handle on the side of the recliner. Her afghan slumps off her knees to the floor. She doesn’t notice, she’s too happy to see him, throwing out her hands, beckoning him forward. “What brings you here, Barry?”  “Johnny, Aunt Clari. You remember, right?”  “Oh, dear, don’t tease me, I know who you are.” She thumps the chair. “Come. Sit with me.”  He kneels on the carpet. Reflections glint in her age-misted eyes as she smiles down, pressing her fingers to his hand. Outside, the sky is tarnished with dusk, houses shrunk to inky cutouts, every alley blotted with dark. Johnny considers how curious it is, that they’ve lived here forever, just the two of them, alone in this enormous world. She strokes his cheek.  “You came back, did you? I knew you wouldn’t forget. Tell me, Barry, did you have fun?”  Johnny swallows the fear in his throat. “How do you do it?” he asks, voice shaking. “How do you face it, Aunt Clari?”  “Oh, child. Come here. Right here.”  He rests his head in her lap. As her fingers smooth his hair, he begins to sob.  “I’m scared, Aunt Clari.”  “Now, now. It’s simple, dear. All you have to do is let go.”  In a shaky soprano, she begins to sing. Her voice falters, at first, but gradually strengthens, spreading through the vanishing sky, over the hills, and the extinguished stars, and all the fading folds of the Earth, until at last, in the darkness, he sings along with her.  When the sheaves are gathered, When the geese have flown, Summer’s ribbons stored away, Fruits and flowers grown, When the frost gleams on the glass Where sun and raindrops shone, And winter’s silver trims the turf, Where spring’s new seeds were sown, Slumber, then, as night takes in, The forests, fields, and stones, And follow those who went before To face the dark alo— 5  “Johnny? Johnny?”  “I think he’s waking.”  Awareness spears through Johnny’s mind. He can feel his thoughts stirring, stretching, collecting, scraps of consciousness struggling to cohere.  “Johnny?”  “Let him take his time.”  Sun breaks in. Johnny opens his eyes. Residues of sleep still blur his sight, but he sees that the room is small and bright, and that two vague faces hang over the bed.  “There he is. There’s my guy.”  “His numbers look good.”  “Johnny? Right here. Why does he look like that?”  “He’s probably confused. It takes time for the networks to self-organize.”  “He seems upset.”  “Give it a sec.”  A hand presses Johnny’s shoulder. The faces bend down. Johnny understands that something is required, a special effort, a mental feat. His mind is like honey, rich and thick.  “Armin.” The name comes from somewhere deep inside, a bubble of memory bursting on his lips.  “There we go!” The faces draw back. Hands clap. “Bravo, Johnny!”  Armin, Armin. Johnny knows him now, dear old Armin, the white hair, the wrinkled hands. In one ecstatic explosion, it all comes back.  “You’re Doctor Natarajan.”  “Now we’re cooking.” The doctor pokes a machine. “His major nodes are lighting up. You’ll see exponential progress now.”  It’s happening in a rush, memories stampeding back, faces, places, names, details. An almost tactile tingle as the facts sock home. Johnny laughs.  “Well, what do you think?” Armin grins. “Should I call ’em in?”  “I don’t think it can hurt.” Doctor Natarajan goes to the door.  A moment later, the room is filled with figures. Johnny sees cardigans, khakis, canes. Familiar faces smile down. Johnny points.  “Byron. Roger. Jheri. Chuck. And you’re Merv. Merv the Perv. Where’s Kip? Is Kip here?”  “Kip couldn’t make it. He’ll see you at the house.” Armin glances at the doctor. “When do you think . . . ?”  “We’ll have to keep an eye on those numbers. Unless something changes, though . . . ” Her eyes skim the screen. “Looking at these trend lines? I’d call this a success.”  It’s a party, that noon, in the clinic cafeteria. There are gallons of coffee, a stale pound cake, heaps of cookies from the gluten-free café. And streams of giddy, endless questions, testing the miracle of Johnny’s new mind.  “How about that time in oh-eight, Johnny, huh? ’Member that? The camping trip?”  “What about eighty-six? That horrible year?”  “Let’s talk about the seventies. You remember the seventies? ’Cause I sure don’t.”  “It’s kind of amazing, isn’t it?” someone says. “I mean, that so many of us made it through?”  The laughter is incessant, excessive, celebratory, commemorating not only Johnny’s recovery, but the power of memory, the depth of the past. Joys and sorrows, lives, and loves, crash over Johnny in a stupefying flood. He’s grateful when Armin guides him to the door.  “All right, guys, I think he could use a break. Till next week, right? Goodbye, goodbye . . . ”  After all the fuss, the recovery room is eerily silent. Light through the window reflects off steel railings, tinting the air the color of leaves.  “Well.” Johnny sits. “That was exhausting.”  Armin grins. “They’ve been waiting for weeks to come by. I wasn’t sure what to tell them.”  Johnny reaches for Armin’s hands. It’s hard to convey everything he’s feeling now, the drowning abundance of moods and impressions that seem to assail him with every new second. “Listen.” He pauses, biting his tongue. “When I was under just now—”  “Oh, the operation was nothing.” Armin waves. “It was the pre-op that did us in.”  “Pre-op. Sure. But while I was out, did I . . . did I do anything, or say anything . . . ?”  “You did, actually.” Armin’s mouth quirks up. “You were singing.”  “Singing?”  “Sort of a funny old song. Didn’t catch the words. Why? Does it mean something?”  Johnny’s eyes slide to the window. The spring air is golden, leaves swishing against the glass. “No. I don’t think so. I just . . . did you ever wonder?” Johnny grasps empty air. “All those cells they killed—”  “Replaced,” Armin corrects.  “Replaced, of course. But I mean, they had to kill the old ones first.”  “They were sick.” Armin shrugs. “They were dying, diseased. Anyway, the individual neurons don’t matter, right? It’s the pattern. The network. The structure of the brain.”  “Sure. Networks. I know, I just . . . ” Johnny sits, mouth open, waiting for a thought to surface, a worry he’s forgotten, a doubt he’s misplaced.  “Listen.” Armin points at him, bang, between the eyes. “You’re here. You’re you. You’re alive and handsome and old as shit, and you’re all, all mine. So what do you have to complain about, champ?”  Johnny grins, looking down at their clasped, wrinkled hands. “I just, I wonder about it, I guess. What it was like for him. You know?”  “Him?”  “Sure.” Johnny taps his brow. “The old brain. The old Johnny. The one they replaced.” He pauses, frowning, thinking it over. “The guy who used to be in my head.”  On the ride home, the streets are jammed with traffic, every intersection a riot of cars.  “Don’t do that,” Johnny says.  “Do what?”  “You were singing.”  “I was?”  “Under your breath.”  “What’s wrong with singing?”  Johnny doesn’t answer. He reaches for the radio. It’s a little thing, a very little thing. But right now, he’d like to have some music.  Something light, preferably.  Something new.", "text": "8060 words, novelette\nWhen the Sheaves Are Gathered\n1\nIt’s 3 a.m., and Kip’s been at it all night, to the point where Johnny has had enough. Coming into the kitchen, he can’t believe what he’s seeing. Bottles all over, spills of sugar, a fifth of tequila lying tipped in the sink. And shards, too, literal pieces of glass, because the stupid kid, in his coked-up excitement, has jumped and smashed his head into the kitchen fixture, raining wreckage into the room.\nThe bulb’s intact, so Johnny can see Kip’s face, see he has no idea what’s happened. “Johnny?” Kip holds up wounded palms. “What’d I do?”\n“Come on, kid.” Johnny stabs hands into Kip’s armpits, forklifts him up. “On your feet.”\n“Did I hit my head?” Kip looks into his palms, where blood and glass mix in peppermint-colored swirls. He’s an idiot, but a beautiful idiot.\n“You hit the light.” Johnny points. “You’re high. This is what comes of mixing coke and Kraftwerk at 3 a.m.” For a second, they’re angled together, hip to hip, and of course that’s when Armin comes into the room, stands a beat with his tongue in his cheek, and says:\n“My, my, my, what have I been missing?”\n“All right, Joan Rivers. Help me with this guy.”\nThey get Kip across the hall into the bathroom, where he lolls on the toilet humming “Angel of the Morning” while Johnny holds him steady, and Armin cleans his hands. It’s not bad, not like it could’ve been, though God knows what eight shots of Cuervo will do to a poor young queen’s insides. The other guests cluster in the hall, gossiping, gawping at the grooves of muscle showing through Kip’s tight shirt.\n“Poor boy,” someone says, “it’s past his bedtime.” That’s their cue to get Kip across the hall, flump him on the foldout, pour water between his teeth.\n“What’s that?” Johnny whispers. Because Kip is muttering, words coming out slobbery and unclear.\nArmin says from the door, “Just let him sleep.”\n“I think he’s trying to tell us something.”\nKip sits up, gaping, then falls back, passes out. His eyelids droop, but his lips are still moving. Johnny has the idea if he parted Kip’s jaws, looked in the boy’s mouth, he’d see words in there, trapped, trying to fly free.\n“He’s fucked up,” Armin says. “He needs to convalesce.”\nIt feels wrong to leave Kip lying in the dark, but Johnny backs out and shuts the door.\n“You always do this,” Armin clucks. “You fuss.”\nLowering his voice, Johnny says, “What’s the count?”\nArmin jerks a thumb. “Two on the patio. Roy and his friends are still at it in the living room. Chuck and the Slab . . . ”\nThe way he trails off, eyebrows jumping, sends a trail of ice down Johnny’s spine.\n“Shit. Really?”\n“’Fraid so.”\n“In our bed?”\nArmin holds up his hands, presenting the world in all its luxuriant absurdity.\nThey clear the living room first. Johnny scratches the record, making Chaka Khan choke off mid-wail. Then hall, kitchen, bathroom. Whoever was on the patio has already vanished, a cigarette left smoking on the bricks.\nJohnny tackles the situation in the bedroom. Chuck and the guy they call the Slab haven’t used the bed, but are lying next to it, curled up in postcoital repose. Johnny digs a toe in. “Lovebirds. Up ‘n’ at ’em.”\nChuck rises, stretches, makes a kissy face. The Slab hauls his muscular ass off the floor. “Good party,” Chuck grunts, eyes bright above his Burt Reynolds mustache. He cops a feel of Johnny’s upper arm. Armin once said Chuck rubbed against so many hard bodies, it was a wonder friction hadn’t worn him smooth.\n“Stop by sometime. I’ll give you a birthday gift.” Chuck winks, making his mustache wiggle. Johnny groans and shoves him away.\nThen it’s out into the shivery dark, goodbye, goodbye, the guests straggling off, while overhead the city glows with all its tipsy towers. Johnny can already feel the dawn coming, a pressure of light beyond the sea. He wishes he could have this moment forever, the sad sweet end of a perfect day. Then hands weight his shoulders. Breath strokes his neck. Johnny pivots into the clutch of Armin’s kiss.\n“Happy thirty-fifth, old-timer.”\n“Thanks. You know how to make a boy feel special.”\n“You’re ancient. A relic. And that means you’re all m-i-i-i-i-ne . . . ”\nArmin pirouettes to the bedroom. Johnny still wants to check on Kip. He pads down the hall. The guest room smells of sleep farts and alcohol. On the foldout, Kip is sprawled limbs akimbo, sleeping the knockout slumber of the drunk. Johnny grabs his ankles and straightens him out. In the half-light, Kip looks achingly young, angelic, a vision. The change in position stirs something inside him.\n“What’s that?” Johnny puts an ear to Kip’s mouth. In a superstitious way, he feels this could be important, a subliminal missive, a message from beyond. The boy’s voice comes out singsong and sloppy.\nWhen the sheaves are gathered,\nWhen the geese have flown,\nSummer’s ribbons stored away,\nFruits and flowers grown . . .\nJohnny shakes him. No response. He hesitates. Kip’s ditty isn’t the kind of thing you expect a drunk party boy to be humming in the era of MTV. Yet Johnny’s sure he’s heard it before, far back, a tune out of time.\nWhen the sheaves are gathered . . .\nIrrational fear tweaks the hairs on Johnny’s neck. Maybe this is what it’s like getting older, this tickle of death breathing down your spine. His last view is of the streetlight through the window, the spectral curve of Kip’s sleeping cheek. Then the door swings shut, the latch clicks, the day is done.\n2\n“Up ‘n’ at ’em, cowboy.”\nJohnny groans in wan dawn light, so exhausted he can barely remember his name. He fumbles for the glass of water by the bed. In the bathroom, Armin is humming Boy George, making the faucets bark and cough. He comes to the bedroom, stands in the door, mimes shooting himself in the head.\n“You alive?”\n“Ugh,” Johnny groans.\n“How’s your head?”\nJohnny can only wince and moan.\nArmin laughs. “Guess we better get to it, huh?”\nThey gulp Advil, toast, coffee, eggs, and face the aftermath of the night.\n“Looks like we partied even harder than I thought.” Armin sweeps a slipper through piles of shattered glass. “Any idea who broke the light?”\nJohnny squints at the heap of shards. It’s curious, the feeling that comes over him now, like he ought to remember, but can’t summon details. It’s there in his mind—a file ready for retrieval—but each time he tries, he comes up blank, a chunk of core knowledge deleted from his head.\nJohnny toes the mess. “I feel like I should know. But I can’t—”\n“We gotta stop doing this,” Armin laughs. “We’re getting old. Can’t party like we used to.”\n“We’re not that old.” Johnny’s getting tired of these quips about their age, as if thirty-five is the leading edge of death.\n“In all seriousness, I’d like to know who destroyed our kitchen fixture.” Armin peers at the naked bulb, which appears to have survived the catastrophe intact. “Maybe it’s time to reevaluate the company we keep.”\n“Uh-huh.” Johnny checks the sink, the floor. It’s maddening, the feeling he has right now, like there’s something he’s forgotten, a clue to this scene, if only his brain hadn’t misplaced the data. A clue gone AWOL, a wayward detail. He has an urge to check the spare room.\n“You think there’s someone in there?” Armin trails him through the hall. “You didn’t have anyone over, did you?”\n“That’s the thing, I can’t remember.” Johnny stops at the door. It’s silly, surreal. He’s sure nothing’s wrong. Yet he shudders as he raps the wood.\nNo answer.\n“Well?” Armin says.\nJohnny hesitates. Grabs the knob. Gives a twist.\nThe room’s empty. A sour smell fills the air, as if someone’s been here, but there’s no other sign. The foldout’s open, covered with a sheet. A cairn of cushions teeters on the floor. Armin points his mug.\n“Someone fixed up the bed. Doesn’t look like he used it, though.”\n“Nope.” Johnny pats the mattress, the pillow. There’s nothing remarkable, no sign of trouble, yet he feels as if someone ought to be here. He peeks behind the couch.\n“What exactly are you looking for?” Armin says.\n“I feel like we’re missing someone, somehow.”\n“Someone? Who? An adopted child? You kidnap somebody last night without telling me?”\n“I wish I could remember.”\nArmin laughs. “It was that good a party, huh?”\nJohnny smiles. He has to force it. What bothers him isn’t the emptiness of the room, but the emptiness inside his own head. A gap in reality, a wound in the world.\n“Come on,” Armin turns. “If someone was here, he’s already gone.”\nLife settles into its usual groove, a weekly rhythm of chores and chats. There’s plenty to think about, plenty to do. Lunch at the office, Friday night dancing, exercise three days a week. It’s this, Johnny decides, that really shows they’re getting older. Not budding fears or physical wear, but the slow, steady creep of routine.\nHe can’t quite shake the sense of something missing, a tug of a memory that won’t quite come. Johnny makes Armin sit down one night and list every person who was at the party.\n“Let’s see. There was Roy and Roger—”\n“And Jim.”\n“And Dave and Don. Plus Dave’s friend with the infected piercing.”\n“Merv. Merv the Perv. And Tim and Chuck.”\n“Yes. And the Slab.”\nAnd Ed and Larry, and Lou and Joe, and Tracy the man and Traci the woman, and Jerry C and Jerry O and Jheri as in Jheri curl, and Logan and the man who came with Logan, whose name they’ve forgotten, but whose sideburns they’ll never forget. Everyone checked-off, accounted for. But Johnny could swear a face has been misplaced.\n“I don’t see who could be missing.” Armin caps his pen. “This is everyone we know.”\n“Someone with a K, maybe? Katy? Kevin?”\n“You mean Kayla? She moved to LA.”\nThey give up, though Johnny’s still not satisfied. He’s sure someone slept in the guest room that night. He just can’t seem to remember who.\nLife goes on, as it always does, and Johnny does his best to move on. There are other incidents, missing details, a feeling that something’s been misplaced: a note, a book, a face, a friend. Johnny finds himself pausing on the street, looking into random apartments, marveling at the number of strangers in this town.\nNothing to worry about, right? Stress. Fatigue. Or just the chaos of city life. Johnny chalks it up to ordinary absentmindedness, mental wear from a harried life.\nMeanwhile, life offers new challenges. Business at the gallery, lost youthful dreams, summer crowds that seem wearier than ever. Was the city always like this, Johnny wonders, strange and alien, like a monument to a forgotten past?\nA few months later, there’s also this.\nSlow morning at the office. A buzz of flies. The phone jangles at Johnny’s elbow, and he grabs the receiver, hoists it to his ear. The voice on the line is weirdly familiar, making Johnny narrow his eyes.\n“Chuck?”\n“You know it.” A husky laugh blasts into Johnny’s ear, evoking visions of bright teeth, a mustache. “How you been? I’ve been thinking about you, buddy.”\nJohnny glances up. The office is silent, filled like a fishbowl with summer heat. There’s no rule against personal calls.\n“Didn’t recognize me, huh?” Chuck grates out a laugh. “Guess we’ve never done this before. Talked, I mean. On the phone. You and me.” His voice drops to new depths of intimacy. “Listen, man, you free for lunch?”\n“I could be.” Johnny pauses to wipe the receiver. “Why?”\nThe silence is so long, Johnny jiggles the cord.\n“Nothing,” Chuck chirps. “Just been thinking. How you and me need to have a talk.”\n“About what?”\n“About the stuff we need to talk about.”\nJohnny sighs. They make plans to meet in an hour, at Chuck’s club, the Sports Palace, eight blocks south. It’s one of those everything-plus-racquetball affairs, aerobics classes, courts and pools, a carpeted lounge where sexy singles meet and preen. Out front, in a café with juice and sandwiches, Chuck slides his hips into a sixties-style pod chair, shoving over a meal someone’s left on the table. The girl at the stand doesn’t even look up but smacks her gum and gives a rustle of her Vogue. The club seems weirdly empty today, but Johnny figures that’s the Friday lull.\n“Guess it’s obvious what this is about.” Chuck’s uncharacteristically fidgety, toying with his laminated membership card. Beefcakes and bombshells strut behind him, white towels draped over taut brown arms.\n“It is?” Johnny says.\n“Come on, man. Are we gonna talk about this or what?”\nJohnny’s stomach fizzes. Behind Chuck, women mill in a glass-walled room, restless in their leotards. A mirrored wall reflects puzzled pouts. Something’s wrong. A rubber mat lies empty. The instructor hasn’t shown, or a classmate’s missing, or a special guest has failed to appear. Who’s running this joint, anyway?\n“Johnny? Hello? You with me, man?”\n“Sorry.” Johnny drags his eyes to Chuck’s smile. “You were saying?”\n“I’m saying, your party. Remember? The bedroom? Something happened in there. Or am I crazy?”\nJohnny’s head feels light and airy, scooped out like a pitted fruit. He’s been wanting to discuss this subject for weeks, the strange suspicion that’s dogging his mind. A surge of superstition stops his voice. Like something will be ruptured if he voices his fears, a jinx, a hex, a cosmic balance.\n“You mean what happened in the guest room, right?”\n“Guest room? I’m talking about the bedroom, man. Your bedroom. Talking about you and me.” Chuck slaps the table. “Come on, you know what’s up. This has been coming for a long, long time.”\nIn the glass-walled room, the women are arguing, stamping feet, checking pocket planners. Johnny senses a vacancy in the air, as if the universe has gotten slightly larger, too big for the people floating inside.\n“I’ll put it like this.” Chuck crosses his arms. “Remember Bobby?”\n“Who?”\n“Bobby Plotz. Tall guy, brown eyes?”\nJohnny squints. He can almost remember. Then the face pops into his mind, a blurred cameo.\n“Bobby, right. With the long hair? Kind of homely, but in a hot sort of way?”\n“If that’s your type. Listen, here’s what I’m saying. You remember Bobby. But do you remember what happened to him?”\nJohnny scrunches his forehead. “Did he move?”\n“See, this is what I’m saying, man.” Chuck throws up beefy arms. “People leave, we barely remember. Connections break and no one cares. Me? Bobby? We used to be like that. Now? How long’s it been? I couldn’t even say.”\n“Guess that’s what it’s like getting older,” Johnny mumbles.\n“Is that what you tell yourself? Come on, man. We were a tribe. A pack, a crew. Now? When’s the last time you called an old friend? Guys like us, we can’t let this happen. We can’t let those connections slip.”\nJohnny squints. He sees where this is heading. He knows where Chuck wants it to go. But he needs to discuss what’s on his own mind.\n“I hear you.” Johnny nods. “I get it, I do. People drift apart. But those are just the ones we remember, right? You ever think about . . . ” Johnny swallows. “About the ones we don’t remember?”\nChuck nods as if in deep agreement, then freezes. “Huh?”\n“You know.” Johnny feels like his head has gone hollow, filled with light, a frail Jack-o-lantern. In the exercise room, the leotarded women are giving up, heading for the door, shaking masses of thickly permed hair. A scheduling error? A glitch in the books?\n“The others.” Johnny licks dry lips. “The ones we lost but can’t remember. The people we used to know, at one time, and now we don’t even know they’re gone.”\n“What the hell are you talking about, man?”\n“I mean, there must be people like that, right?” Johnny leans over, almost tipping a cup of carrot juice that’s sitting on the table, still full. He glances at the clutter Chuck’s pushed aside. A newspaper, open to the wanted ads. A sandwich. A leather case. Who left this stuff here, anyway?\n“At school.” Johnny struggles to order his thoughts. “The office. Old coworkers. Classmates, colleagues. People we used to see every day. Acquaintances, relatives, friends of friends. Now they’re gone. And we’ve forgotten them so completely, we can’t even really be sure they were there. Gaps in our memory, vanished ghosts. As if they might as well not have existed.”\nChuck’s looking past him, at the open door. A woman stands with a hand on the glass, holding it open, staring into the street. No one’s there, just empty sidewalk, until a man bolts out of a taxi.\n“You’re scaring me, man,” Chuck laughs.\n“Don’t you feel it, though?” Johnny insists. “At certain times, on certain days? This nagging feeling, like something’s missing? Like there’s something you can almost remember, but not quite?” Johnny leans forward. “You know I play squash at eighty-sixth?”\n“Sure.”\n“I was at the courts the other day, ready for the match, and . . . ”\n“Yeah?”\n“No one’s there.”\n“What, at the club?”\n“Of course there were people at the club. But not at my court. My partner didn’t show.”\n“He do that often?”\n“I don’t know,” Johnny says. “I have no idea who my partner is. I have no recollection of ever having a partner. But I must have had one at some time, right? Why would I schedule a match without a partner?”\nChuck’s mouth opens, then shuts, like he knows there must be a reasonable explanation, but can’t quite figure out what it is.\n“It’s like déjà vu,” Johnny says. “Like losing your keys. Like that feeling you get when you could swear you own the White Album, but you look and look and it’s not anywhere.”\nHe scoots closer.\n“How about this? Happy hour at Elmo’s. We’re there, the usual crew, saving a seat. People come. Anyone using this chair? Yes, we say, yes, yes, yes. Five times this happens. Then Roger looks up, asks, ‘Who are we saving this chair for, anyway?’ No one could remember. We all laughed, but I’m telling you, it was weird, man. Creepy.”\nChuck shakes his head. “Things like that happen all the time.”\n“So why did we all make the same mistake? Why did it happen to all of us at once?”\n“Who else was there?”\n“Me. Armin. Lou. Roger.”\n“See, this is my point,” Chuck says. “Ten years back—”\n“There are other things.” Johnny rushes on, aware he’s talking too loudly, but needing now to get it all out. “The gym. Last week. I looked up, no one was spotting my reps. I swear someone had been, a second ago. Where’d they go? The other day, I was looking through my books. A bunch were missing. The Drowning Season. Valley of the Dolls. I lent them to someone, I’m sure, but who? It’s like there are fewer people, somehow. Like something, someone, has been whittling down the numbers.”\nChuck’s head is shaking. “This is what I’m talking about.”\n“No,” Johnny insists. “This is different. This isn’t just people moving away. Who left this stuff sitting here, on this table? This sandwich, this juice? Why’s this club so empty? Why aren’t instructors showing up for their classes?”\n“Johnny, listen to yourself.”\n“You know what I’m saying. You have to know. You have to have noticed.”\nChuck’s leaning back, hands pressed to his chest. “Do I know what you’re saying? Sure. And I know where it’s coming from. Look, man, I’m not a guy to point fingers. But I can’t help but notice, since you moved in with that stiff—”\n“Excuse me?”\n“Don’t act like you don’t know. Ten years ago? We were animals, man. We’d hit the clubs and know every face. Now? I hardly see you. Ever since you and that mummy started playing house, it’s been—”\n“Jesus.” Johnny groans. “This isn’t about me and Armin, Chuck.”\n“You don’t think so?” Chuck folds his arms. “Let me tell you something about Armin. Armin was born with a foot in the grave. You and me, Johnny? Guys like us? We need to live while we’re alive.”\n“I’m trying to tell you something, Chuck.”\n“And I’m trying to tell you something. You’ve always been like this. You fuss. You fret. You worry about stuff you can’t change. If you give me a chance—”\nJohnny doesn’t hear the rest of what Chuck’s saying. A sound floats over the café tables, faint, lilting. The girl at the register is bent over her magazine, singing softly between smacks of gum.\nWhen the sheaves are gathered,\nWhen the geese have flown,\nSummer’s ribbons stored away,\nFruits and flowers grown,\nWhen the frost gleams on the glass\nWhere sun and raindrops shone . . .\n“Johnny?” Chuck’s standing, hands spread on top of his chair. Johnny realizes he’s standing, too, lured by the tune floating over the tables. He crosses the room.\n“Hey. Where’d you hear that?”\nThe girl’s eyes narrow above her magazine. “Hear what?”\n“That song. The one you were singing just now. Where’d you learn it?”\nShe frowns, tonguing her gum into her cheek.\n“Come on, you know, the one you were just—” Johnny groans and wheels away, lurching back to the waiting table, where Chuck holds up baffled hands.\n“The hell, man?”\nJohnny picks up the uneaten sandwich. The bread is still soft. Fresh. Untasted.\n“Was someone sitting here?” Johnny calls over his shoulder. “At this table? Before we came?”\nThe girl stares.\n“Goddamn,” Johnny grunts, letting the sandwich fall.\n“Johnny, are you even listening to me?”\nJohnny’s already moving, hurrying through the lobby, out into the midtown streets, which he can’t help but notice are ethereally silent, strangely uncrowded for this time of day.\nThe train ride home is eerily speedy, the seats mostly empty, the platforms bare. The streets of the Lower East Side are serene. Johnny counts cars as he hurries down his block. Three, four. Traffic is light, but maybe that’s the effect of the recession. Were there this many shuttered shops last week?\nA man slumps in a doorway. A woman peers from an alley. How many of these people could vanish, Johnny wonders, before someone noticed and raised an alarm? If a day came when the unthinkable happened, if these worn, huddled figures dispersed into mist, would Johnny remember them? Would anyone?\nHe opens the door. The apartment is hushed. Johnny hurries down the hall. The tick of a typewriter comes from the guest room. Fridays are Armin’s do-not-disturb time. Johnny barges right on in.\n“Uh, okay.” Armin swivels from the desk. “Everything all right?”\n“You tell me.” Johnny paces the thinning carpet. Sweat tickles his nose. He spins, hands fisted. “Are we all right? You and me? Be honest.”\nArmin takes off his glasses. Johnny sees a sheet curling out of the typewriter, speckled with print. Armin points with his glasses. “I’m three hours shy of my deadline here. Is there a chance this can wait?”\n“No, I don’t think so. No, I really have to know.” Johnny throws himself onto the sofa, startled by how dazzle-brained he feels, shattered inside, a man of glass. “Listen. If I suddenly disappeared—no, just listen. If I vanished this instant, fell out of your life, would you . . . would you remember me?”\nArmin tips his chair. “Where is this coming from?”\n“I’m sorry, I just, I have this feeling. Like it’s all slipping away. And we don’t talk about it. No one ever talks about it. But we’re losing people, aren’t we? Losing people from our lives?”\nArmin clacks shut his glasses. Frowns. Considers. “We have fewer friends than we used to, that’s true.”\n“So you’ve noticed it.”\nArmin sighs. “I wish I knew what brings this on.”\nJohnny clutches his knees. The room, the world, is pumping like a giant heart, too big one second, too small the next. Johnny feels like he did at sixteen, starting a new school, that world of strange faces.\n“I mean, you’re not wrong.” Armin pinches his nose. “Not a week goes by I don’t think about my mother. Or my cousin. Or my grandma. Or . . . well, all the others. But can’t we enjoy what we have while we have it?”\n“I know, I know.” Johnny nods with a conviction that surprises him. It feels good to agree with these obvious facts, to have something to share, a basic understanding. “I know, you’re right, I just—”\n“We’ve been fortunate.” Armin looks at the floor. “We have a home, a community. Can’t we savor it while it lasts?”\n“You’re right.” Johnny gulps, embarrassed. He feels infinitely grateful for these sane, simple words. “Of course you’re right.”\n“It’s just that you always do this, dear. You obsess.” Armin waits a beat before smiling. “Can I please finish this bitch of an article, now?”\nJohnny laughs. Armin rises, stands over him, reaching down to tickle his neck. “I don’t give a shit about the rest of the world, OK? Whatever’s coming, whatever life has in store, the past can’t be changed. That’s something, right? Nothing can ever undo what we’ve had.” He nudges up Johnny’s head. “You understand?”\nThe worries of the week seem remote now, ridiculous, but Johnny’s laugh comes out shaky and faint. “Wanna hear something weird?”\n“Five minutes.” Armin goes back to his chair.\n“I was out with Chuck. Today. At his gym.”\n“Uh-huh.”\n“No, but listen. And this girl who works there, she was singing this old-timey song. It was odd, you know, hearing a kid today sing something like that. Quaint.”\n“I see.”\n“But here’s the thing. I was sure, I could swear, I’d heard it before. The tune, the words . . . it was so familiar . . . ”\nJohnny snatches empty air, grasping a fact already receding, even as Armin leans back, closes his eyes, and intones with rich solemnity:\nWhen the sheaves are gathered,\nWhen the geese have flown,\nSummer’s ribbons stored away,\nFruits and flowers grown,\nWhen the frost gleams on the glass\nWhere sun and raindrops shone,\nAnd winter’s silver trims the turf—\n“Stop.” Johnny’s voice comes out faint and slurred, the ghost of a shout. But Armin carries on, finishing the second verse, launching into the third, before Johnny jumps up shouting, “Stop, stop, stop!”\n“Jesus. All right. What’s the matter with you?”\n“Why did you do that?” Johnny’s shaking.\n“Do what?” Armin scoots closer to his desk. “Really, Johnny, sometimes you drive me crazy.”\nArmin pokes papers, looking over what he’s written, tapping keys, squinting through his glasses. Johnny stares, openmouthed, as the world fills up with a feeling of wrongness as vivid as a bath of blood. He clenches his hands. “You shouldn’t have done that, Armin. You shouldn’t have sung it.”\n“Sung what? Johnny, come here.” Armin’s hand flaps. Johnny drifts over, to be taken by the wrist, drawn toward the desk, Armin’s upturned eyes.\n“I love you, Johnny. Honestly I do. But sometimes? Dear? Sometimes you need to let things go.”\n3\nWith one thing and another, it’s three months before Johnny manages to see Chuck again. The meeting almost doesn’t happen. Johnny shows up forty minutes late, and Chuck’s even later. The trains have been awful. Buses, too. It’s a system-wide problem, people are saying, a municipal crisis, bad city management. There are absentee issues, budget shortfalls, a decline in tax revenues. Johnny’s too busy to keep up with the news.\nThe club is deserted, a glass mausoleum, though Chuck says that’s typical for weekday afternoons. In the café, Johnny rings the bell three times, shouts for service, but no one comes. Chuck shrugs it off. “They’ve been short-staffed.”\nThey buy coffee from a roach coach and sit on the curb. Chuck’s mustache is gone. His hair’s a mess. He tells the usual tales of dating in the city, a litany of dropped plans, unanswered calls. It’s slim pickings out there, Chuck says. Empty. The old meat market has gone vegetarian. Really, though, when’s it ever been different? That’s the problem with city living, Chuck grumbles. Bad men are so hard to find.\nHe laughs. It trails off into a sigh. “I’ll go through my wallet,” Chucks says, “find ten numbers, then I call ’em all and don’t get a thing. Zip. I mean, what the hell? Did everyone simultaneously forget how to party?”\nChuck laughs again, but there’s weight to his voice, a load of unnamed anxieties. It’s something everyone feels, these days, though no one’s brave enough to say it. A mysterious mournfulness, a sense of decline. Johnny sees it in faces on the street, sometimes in the bathroom mirror, where his reflection peers back with a lack of expression, eyes uninterested in their own deadness, lips too lazy to sketch a fake smile.\n“Anyway.” Chuck sips. “How’s your problem working out?”\n“Don’t ask.” Johnny shivers. “I thought I had a buyer, but they bailed. Didn’t give a reason, just stopped returning calls. The realtor says it’s a buyer’s market.”\n“You’ve got a great place, anyway. All that space.”\n“I know . . . ” Johnny grimaces. Truthfully, he can’t imagine why he needed so much space. A two-person apartment? All to himself? He can hardly stand to live there, sometimes. The empty rooms, the surfeit of area. Even worse are the haunted nights, when he feels like a ghost is sleeping beside him, a chilly specter sharing the bed.\nThe loneliness can get so intense that little things will set Johnny off: the record collection full of bands he doesn’t like, the shelves of books he’ll never read. How much junk does one bachelor need?\n“Must get lonely,” Chuck says, looking hard in Johnny’s eyes. And there’s an air of inevitability to the exchange when he adds, “It’s been a while since I was over . . . ”\nNeither man bothers to call into the office. There isn’t much work to be done these days. Employers are lax about monitoring hours. Sometimes employees don’t show up at all. As their taxi jounces down empty streets, Johnny gazes up into rows of blank windows, some curtained, some boarded up. Few people are out. Must be the cold. Heat’s been spotty. Power, too. Johnny secretly loves the night view from his window, the scant golden squares scattered in the deep dusk.\nIn the vestibule, the two men embrace like mourners, holding each other before they kiss. For all his experience, Chuck’s a hasty lover. That’s fine, Johnny thinks, he’s not looking for excitement, only a little extra warmth in the bed. After finishing, they lie nude under the covers, watching daylight leak down the walls. Johnny says, “Hey, want to hear something funny?”\n“Fire away,” Chuck mumbles, half asleep.\n“I was talking with Merv today. Merv the Perv?”\n“Is that the funny part?”\n“Come on, just listen.” Johnny twists under the covers. “We were chatting about the news. The shortages, you know. Suddenly, he breaks out singing. Right in the phone. This folksy tune. Not the kind of thing you expect from a guy like Merv, huh?”\n“What was the song?”\n“I’m not sure what it’s called. Here’s the thing, though. All the time he was singing, I had this feeling, like I’d heard it before.”\n“I hate that feeling.”\n“No, but this time I got it. I figured out where I know it from.”\n“Yeah?”\n“My Aunt Clari.”\n“Fascinating,” Chuck says.\nJohnny looks out the window, where stars crowd the sky, unobstructed by the waning lights. “She used to sing to me, when I was . . . oh, gosh, this must have been thirty years ago. That was when she came to live with us, when she couldn’t keep looking after herself. I’d go to her room, bring her dinner and things. And she’d sing that song.”\n“Old women are the worst,” Chuck says.\n“I liked it, though. I don’t think I understood, you know, what it means . . . well, to lose your faculties. I found it soothing. I’d sit by her chair.”\n“How’s Merv doing these days, anyway?”\nJohnny’s silent. The city has tipped into night, plunging past the indefinite instant when shadows deepen from blue to black. Johnny can’t see Chuck’s face in the dark, not even the eyes, but he can hear the night noises, the hum of the fridge, a distant horn.\n“Think about it,” Johnny murmurs. “Losing your mind. Not only your wits, but everything, all of it. Your memories, your past. Lovers. Friends. Jobs and hobbies. Even the names of your own children. And losing them so completely, so deeply, you don’t even know they were there at all. The only things Aunt Clari remembered were things from her own childhood. Her dog, her brother. Like the rest of her life might as well not have happened. Like her whole soul froze at the age of nine.”\n“I guess that is as good a time as any,” Chuck says.\nWith the coming of night, the room has grown cold. Johnny pulls up the blanket. Chuck is talking in a drone, words tumbling out like electric signals, something preprogrammed, a canned announcement.\n“ . . . didn’t want to just spring it on you. But it’s happening. Tomorrow. It’s all set up. I just . . . I can’t stay in this place, anymore.”\nJohnny listens from far away, like a child listening for a train in the night. He waits for a noise from the street to interrupt, a siren, a shout, a crash of cans. But there’s nothing, the city is holding its breath, and Johnny realizes he’s been expecting this, though his tongue is like cotton and his fingertips are cold.\n“Where to?” he says.\n“Chicago.” Chuck sighs. “A part of me hates to leave, you know, but . . . I dunno, man. Lately—it’s strange. It’s not like anything has changed. I just, I look around, and I see—”\n“Slim pickings,” Johnny says.\n“You understand.”\nIn the neighboring building, a window brightens. A woman strides through the room in sweatpants, holding a phone.\n“Johnny? You understand, right?”\nIt’s impossible, from here, to hear what the woman’s saying, but Johnny can see her lips at the receiver, flexing in a regular rhythm, miming words to a lilting song. He squeezes Chuck’s hand. He can picture the woman’s voice, the lonely tune she’s sending out into the night. The image is so clear, so vivid in his mind, that it doesn’t surprise Johnny when Chuck sings along, his rough voice picking up the tune, tempo, phrasing, every old-fashioned phrase, every solitary word.\n4\nIt’s over, Johnny decides. It’s time.\nHe takes a last turn through the apartment, a silent tour to say goodbye. He barely notices the objects he passes, the king-size bed, the cooler, the magazines. There’s nothing in this place to hold him, now. The clothes in the closets, the pictures on the walls, are faded mementos of lives never lived, memorials to forgotten souls.\nThe hard part, Johnny thinks, will be telling Byron. They don’t communicate much, these days. When they do, it’s rote, automatic, a matter of necessity. They have endless arguments about food and fuel. Fights over books and snacks and games. Quarrels over whether to lock the door.\nJohnny heads to the bedroom. He raids dressers, working slowly, stuffing a backpack full of socks. He tries to remember if they’ve used this place before. In the old days, they wandered far afield, sleeping in new apartments every night, forcing open doors, whispering like graverobbers. Searching, always searching, for other people like themselves. But the buildings they found were shuttered and brooding, bereft of any sign of life, and now they now stick to the places they know, jumping from one apartment to another, traveling a circuit in the urban core.\nJohnny scrounges in a closet for tools. Flashlight, food, disinfectant, nails. There are times, even now, when he lets his mind wander, pondering the mystery of this vast empty town. Surely there were people here, at one time. Hands to raise these looming buildings, voices to crowd the empty cafés. But whoever they were, they’re long gone, leaving no clue to say where they fled. Only solitude, spreading in the streets like shadow, seeping from a million cold stones.\nJohnny finishes packing as the front door creaks. From the kitchen comes a rumble of cans, a muffled curse. Johnny finds Byron at the counter, sorting soup, his movements brusque and efficient. Byron sees the backpack.\n“Come on, man.” His eyes go dark. He looks beaten, resigned, but he puts out a hand.\nJohnny steps past him. Grabs a few cans. There was a time, way back, when they tried to mean something to one another. But their bond now is strictly survival-based. Byron’s built like Stallone, not Johnny’s type, and the sex they had was labored and joyless, both of them working to push aside the weight of half-forgotten feelings. One night, without thinking, Johnny called Byron, “The Slab.” Their laughter faded into chilly silence, a ghost of mirth, waning into regret.\n“You’re not pulling this crap again, are you?”\n“I have to.” Johnny shoulders the pack. “I have to try.”\n“Sure. Then what? You’ll be out there five hours, tops, then you’ll come moping back.”\n“No. Not this time.”\nJohnny heads for the door. Byron stomps behind him, grabs a shoulder, and spins him around. “You know, I’m getting sick of this human yo-yo crap. Get it through your head, Johnny. There is no one else out there. No one. Never will be, never was. Can’t we be content with what we have?”\nJohnny sags. Byron’s right. Johnny knows he’s right. But a spooky sensation, a specter of memory, has slowly built up inside Johnny’s mind. With the wind weeping and sobbing outside, he shrugs off Byron’s hand.\n“Sorry, man. This time it’s for real.”\nThe streets are cluttered with abandoned cars. Johnny hunts for one with keys. By the time he’s ready, the sun’s going down. As darkness settles the unpeopled town, he wonders why he waited to leave. What’s there to hold him in this place, anyway? A friend? A companion? A roommate? A lover? He can’t recall a single face.\nWhy has he spent his life in this ruin, Johnny wonders, wandering these empty streets? Was there ever someone to hold him here? He can’t remember anything but these sidewalks, the tomb-like towers, the phantom halls.\nJohnny gets in the car and turns the key. He follows the highway north over the bridge, into a land of hills and cliffs. Snow powders the earth between the brown trees. There are houses, swimming pools, tidy lawns. Swing sets stand like props on a stage, waiting for actors to enter from the wings. Johnny knows no actors will be coming. The world has always looked this way, a project neglected by a lazy god.\nHe scoffs. When will he give up these fantasies? When will he accept that this is how things are, an empty world inhabited by one lonely soul? There have never been other human beings, never will be, and he’d better learn to accept that fact. Learn to be content with what he was, to simply give up and let things go.\nHigh in the hills, Johnny turns off the highway. He stops and parks and takes a stroll. The homes here are small, suburban, prim. Johnny dodges tipped garbage cans, scars of ice that mar the sidewalks.\nIt shocks him, at first, when he finds the old house. But of course he’s been heading here all along, he realizes, drawn to this particular door.\nThe house is bland, a simple foursquare, rain gutters sagging like demented smiles. Johnny follows the root-heaved path. The porch welcomes him with a crooked grin. It’s like no time has passed since he last stood here, like decades have been compacted into moments. He pushes open the broken door.\nThe foyer’s dark. A window has smashed. The living room is stiff with cold. Warped furniture crowds a moldy carpet. Johnny eases the door shut behind him. That’s when he hears it.\nA voice upstairs.\nJohnny freezes. The voice carries on, singing faintly. Johnny heads for the water-warped stairs. On the landing, he pauses, a palm to the stucco. The tune is quaint, simple, soothing. Johnny’s sure he’s heard it before.\nHe mounts the last stairs. As expected, a door stands ajar at the end of the hall.\nJohnny knows what he’ll find in the room beyond. It shocks him, all the same, the sight of her there, those soft gray eyes, the startled merriment of her smile.\n“Why, Barry, what a wonderful surprise!”\n“It’s Johnny, Aunt Clari,” he says, stepping in. “Your great nephew Johnny.”\nShe gropes for the handle on the side of the recliner. Her afghan slumps off her knees to the floor. She doesn’t notice, she’s too happy to see him, throwing out her hands, beckoning him forward. “What brings you here, Barry?”\n“Johnny, Aunt Clari. You remember, right?”\n“Oh, dear, don’t tease me, I know who you are.” She thumps the chair. “Come. Sit with me.”\nHe kneels on the carpet. Reflections glint in her age-misted eyes as she smiles down, pressing her fingers to his hand. Outside, the sky is tarnished with dusk, houses shrunk to inky cutouts, every alley blotted with dark. Johnny considers how curious it is, that they’ve lived here forever, just the two of them, alone in this enormous world. She strokes his cheek.\n“You came back, did you? I knew you wouldn’t forget. Tell me, Barry, did you have fun?”\nJohnny swallows the fear in his throat. “How do you do it?” he asks, voice shaking. “How do you face it, Aunt Clari?”\n“Oh, child. Come here. Right here.”\nHe rests his head in her lap. As her fingers smooth his hair, he begins to sob.\n“I’m scared, Aunt Clari.”\n“Now, now. It’s simple, dear. All you have to do is let go.”\nIn a shaky soprano, she begins to sing. Her voice falters, at first, but gradually strengthens, spreading through the vanishing sky, over the hills, and the extinguished stars, and all the fading folds of the Earth, until at last, in the darkness, he sings along with her.\nWhen the sheaves are gathered,\nWhen the geese have flown,\nSummer’s ribbons stored away,\nFruits and flowers grown,\nWhen the frost gleams on the glass\nWhere sun and raindrops shone,\nAnd winter’s silver trims the turf,\nWhere spring’s new seeds were sown,\nSlumber, then, as night takes in,\nThe forests, fields, and stones,\nAnd follow those who went before\nTo face the dark alo—\n5\n“Johnny? Johnny?”\n“I think he’s waking.”\nAwareness spears through Johnny’s mind. He can feel his thoughts stirring, stretching, collecting, scraps of consciousness struggling to cohere.\n“Johnny?”\n“Let him take his time.”\nSun breaks in. Johnny opens his eyes. Residues of sleep still blur his sight, but he sees that the room is small and bright, and that two vague faces hang over the bed.\n“There he is. There’s my guy.”\n“His numbers look good.”\n“Johnny? Right here. Why does he look like that?”\n“He’s probably confused. It takes time for the networks to self-organize.”\n“He seems upset.”\n“Give it a sec.”\nA hand presses Johnny’s shoulder. The faces bend down. Johnny understands that something is required, a special effort, a mental feat. His mind is like honey, rich and thick.\n“Armin.” The name comes from somewhere deep inside, a bubble of memory bursting on his lips.\n“There we go!” The faces draw back. Hands clap. “Bravo, Johnny!”\nArmin, Armin. Johnny knows him now, dear old Armin, the white hair, the wrinkled hands. In one ecstatic explosion, it all comes back.\n“You’re Doctor Natarajan.”\n“Now we’re cooking.” The doctor pokes a machine. “His major nodes are lighting up. You’ll see exponential progress now.”\nIt’s happening in a rush, memories stampeding back, faces, places, names, details. An almost tactile tingle as the facts sock home. Johnny laughs.\n“Well, what do you think?” Armin grins. “Should I call ’em in?”\n“I don’t think it can hurt.” Doctor Natarajan goes to the door.\nA moment later, the room is filled with figures. Johnny sees cardigans, khakis, canes. Familiar faces smile down. Johnny points.\n“Byron. Roger. Jheri. Chuck. And you’re Merv. Merv the Perv. Where’s Kip? Is Kip here?”\n“Kip couldn’t make it. He’ll see you at the house.” Armin glances at the doctor. “When do you think . . . ?”\n“We’ll have to keep an eye on those numbers. Unless something changes, though . . . ” Her eyes skim the screen. “Looking at these trend lines? I’d call this a success.”\nIt’s a party, that noon, in the clinic cafeteria. There are gallons of coffee, a stale pound cake, heaps of cookies from the gluten-free café. And streams of giddy, endless questions, testing the miracle of Johnny’s new mind.\n“How about that time in oh-eight, Johnny, huh? ’Member that? The camping trip?”\n“What about eighty-six? That horrible year?”\n“Let’s talk about the seventies. You remember the seventies? ’Cause I sure don’t.”\n“It’s kind of amazing, isn’t it?” someone says. “I mean, that so many of us made it through?”\nThe laughter is incessant, excessive, celebratory, commemorating not only Johnny’s recovery, but the power of memory, the depth of the past. Joys and sorrows, lives, and loves, crash over Johnny in a stupefying flood. He’s grateful when Armin guides him to the door.\n“All right, guys, I think he could use a break. Till next week, right? Goodbye, goodbye . . . ”\nAfter all the fuss, the recovery room is eerily silent. Light through the window reflects off steel railings, tinting the air the color of leaves.\n“Well.” Johnny sits. “That was exhausting.”\nArmin grins. “They’ve been waiting for weeks to come by. I wasn’t sure what to tell them.”\nJohnny reaches for Armin’s hands. It’s hard to convey everything he’s feeling now, the drowning abundance of moods and impressions that seem to assail him with every new second. “Listen.” He pauses, biting his tongue. “When I was under just now—”\n“Oh, the operation was nothing.” Armin waves. “It was the pre-op that did us in.”\n“Pre-op. Sure. But while I was out, did I . . . did I do anything, or say anything . . . ?”\n“You did, actually.” Armin’s mouth quirks up. “You were singing.”\n“Singing?”\n“Sort of a funny old song. Didn’t catch the words. Why? Does it mean something?”\nJohnny’s eyes slide to the window. The spring air is golden, leaves swishing against the glass. “No. I don’t think so. I just . . . did you ever wonder?” Johnny grasps empty air. “All those cells they killed—”\n“Replaced,” Armin corrects.\n“Replaced, of course. But I mean, they had to kill the old ones first.”\n“They were sick.” Armin shrugs. “They were dying, diseased. Anyway, the individual neurons don’t matter, right? It’s the pattern. The network. The structure of the brain.”\n“Sure. Networks. I know, I just . . . ” Johnny sits, mouth open, waiting for a thought to surface, a worry he’s forgotten, a doubt he’s misplaced.\n“Listen.” Armin points at him, bang, between the eyes. “You’re here. You’re you. You’re alive and handsome and old as shit, and you’re all, all mine. So what do you have to complain about, champ?”\nJohnny grins, looking down at their clasped, wrinkled hands. “I just, I wonder about it, I guess. What it was like for him. You know?”\n“Him?”\n“Sure.” Johnny taps his brow. “The old brain. The old Johnny. The one they replaced.” He pauses, frowning, thinking it over. “The guy who used to be in my head.”\nOn the ride home, the streets are jammed with traffic, every intersection a riot of cars.\n“Don’t do that,” Johnny says.\n“Do what?”\n“You were singing.”\n“I was?”\n“Under your breath.”\n“What’s wrong with singing?”\nJohnny doesn’t answer. He reaches for the radio. It’s a little thing, a very little thing. But right now, he’d like to have some music.\nSomething light, preferably.\nSomething new.", "source": "https://clarkesworldmagazine.com/wolven_07_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: When the Sheaves Are Gathered by Nick Wolven"}