{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ukTOk5SB0LBwJN0sfIuGIOIFa4s=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Science Fiction Heist: A Conversation with Derek Künsken  Science meets space opera meets heist in Derek Künsken’s The Quantum Evolution series. It all starts when con man Belisarius Arjona—a homo quantus (his mind and body have been engineered to be able to see directly into the quantum realm) and his “ensemble-cast” crew have to move a squadron of secret warships across an enemy wormhole. Trouble—and lots of cool science fictional ideas—ensues.  Derek Künsken left science to work with street kids in Honduras before joining the Canadian foreign service. Now, he writes science fiction in Gatineau, Quebec. To his surprise, his first novel, The Quantum Magician was nominated for the Aurora, the Locus, and the Chinese Nebula, and has been or will be published in Japanese, French, and Chinese. Its sequel, The Quantum Garden, will be on sale in mid-October. His latest story, “Tachyon Hearts Cannot Love,” is a Petit Prince-type story of dealing with heartbreak and will run in the Mar/Apr issue of Asimov’s.   Your first short story sale was “Tidal Maneuvers,” published in On Spec in 2006. You recently had “Ghosts of Ganymede” published in the January 2019 Clarkesworld, and had a number of stories between them. Has your writing changed since that first sale? Or your approach to writing/publishing?  After “Tidal Maneuvers,” I sold a story to Asimov’s, but followed it up with a dry period. The next three years netted me a lot of rejection letters. One from Sheila Williams said, “there’s not enough story here.” That feedback was one of four or six important ones in my career that triggered an epiphany. In this case, I looked back on my previous work and realized that the layers, the symbolism and themes in my stories were thin, or worse, not even there. Since then, I’ve tried to attach multiple meanings to story elements, and to link them by multiple connections. Any story can still be read as a series of events, but for readers who want a bit more to ponder, I hope my stories now offer more. This is true, I hope, for “The Ghosts of Ganymede.”  Are there themes or topics that often come up in your short fiction? “The Ghosts of Ganymede” is full of tension; cold, rocky imagery creates a sense of strangeness and bleakness, while adding to the tension. Do you vary things like style, voice, and so on, or is there a consistency to your writing that readers will always recognize?  I feel like I’m not done exploring the cruelties humans inflict on each other. Whether it’s magical street kids in my PodCastle story “Juan Caceres in the Zapatero’s Workshop” or the Puppets in The Quantum Magician or honor killings in my PseudoPod story “The Dog’s Paw” or the refugees in “The Ghosts of Ganymede,” I suspect I’m trying to come to terms with the cruelty.  On style or voice, I think I’m able to vary voice sometimes depending on whose point of view it is, but I think I also have an authorial voice that I default to (to my disappointment; I’m often envious of writers who create captivating, fascinating narrative voices).  For readers who haven’t read “The Ghosts of Ganymede,” what is it about?  In a nutshell, Eritrean and Ethiopian refugees are resettled to Ganymede to found a corporate outpost after their nuclear war left both countries uninhabitable. On Ganymede they find quantum ghosts of a species gone extinct. The ghosts exacerbate tensions between the refugee groups, and also constitute a scientific mystery the refugees have to figure out before they can make a home.  Are there risks or challenges specific to writing characters from other cultures, such as Eritrean and Ethiopian, and how do you manage these challenges?  Of course! I think it’s easy to misrepresent the feelings, concerns, attitudes, and values of people other than you. I did a great deal of research on the cultures, and specifically set the story about 150 years in the future to give me a bit of a buffer for inevitable cultural change. But at the same time, I’ve worked with Canada’s refugee program for almost a decade, one which at times included refugees from Eritrea and Ethiopia. I was very happy to hear that in the last few years, relations between Eritrea and Ethiopia were normalizing, but for this story I needed peoples who were culturally close, and yet had histories of conflict, so I projected some past conflict and tension into a future story. The Sub-Saharan Union, a future federation of large states in Africa, featured prominently in both The Quantum Magician and The Quantum Garden. In the case of the Union, their culture is five hundred years in the future, so I had more latitude to imagine where cultural fault lines might evolve.  You also have a webcomic, Briarworld, that you put together with Argentinian artist Wendy Muldon: “A Flash Gordon-esque world where our jetpack-wearing mercenary Manuela, with the help of her cousin Teresita, would try to rescue a wayward prince Simon from his captor, Sheriff Joaquina on Briarworld.” Can you talk a bit about the ways in which writing the webcomic is different or similar to other work?  Thanks for bringing up Briarworld! It’s been a lot of fun to work on, and is certainly a different creative experience from prose. In a short story, I’m the writer, casting director, director, and set designer. Writing a webcomic or a traditional comic book makes me the writer, but the artist is the director, special effects expert, lighting and sound tech, set designer, and so on. And Wendy Muldon is amazing at all of those things. Her art is light, energetic, emotive. The empathy in her art forced me to rethink the kinds of stories I wanted to tell with her. Wendy is going to have a huge career in comics and illustration.  How does your background in molecular biology or your work for the Canadian Federal Public Service impact your writing?  I spent seven years studying the biology and biochemistry of the really tiny, which I think gives me lots of inroads into making aliens, or genetically-engineered humans! I think it gave me some anxieties too. I’m sure that climate scientists have trouble sleeping at night. Or nuclear physicists find themselves imagining the apocalypse because they know exactly how it would go down. My professional scientific anxieties relate to what the rich and the majority will do to the poor and the minorities with the power of genetic engineering. The scariness of those anxieties found their way whole cloth into The Quantum Magician in the forms of the Homo quantus, the mongrels, and the Puppets.  I worked for fifteen years as a Canadian public service official, about five of those on diplomatic postings to Latin America, and another six of them in refugee policy in Ottawa. Policy analysis is one of those jobs that rewards the clarity of scientific thinking, the boiling of problems down to their essentials and being able to communicate them clearly. It also teaches you how decisions are made, how government serves the public, and sometimes the limits of governmental levers. I think many of the moral and social problems I try to tackle in my novels and short fiction benefit from the kind of clarity I learned in a policy analysis environment.  Does your approach to writing change if you are working on a shorter piece of fiction?  I think all world builders enjoy a big canvas, whether the novel or the novel series, because any exploratory detour is fair game as long as it’s executed well and survives the editor. I write short fiction with the drastically reduced size of canvas in mind, though. My natural short fiction length seems to be about 10,000 words, and going much longer than that risks not getting published. I think I can do a lightly world-built story in 5,000-6,000 words, so I guess about half of any story of mine is setting?  Many writers put all their hopes into one project and will feel like giving up if it doesn’t hit the measures of success that they are looking for. Was there a point at which you considered giving up on writing; or, how did you keep hope alive?  I was raised to think that hard work and practice leads to results, so no rejection letter ever made me think of stopping. I got fifty rejections before my first acceptance and if we don’t count comic books, I’m probably at about 350 rejections and counting in my career to date. Every rejection is disappointing, but I knew if I just kept at it, I would eventually learn.  “It” and “eventually” are probably the most important words in that last sentence, by the way. What should we keep at? It’s not just writing. If I’d only written, I’d still largely be writing the same way I’d been writing when I was 30. I feel I had to keep at the reading, broad reading, deep reading, analytical reading, reading that deconstructs and reverse engineers. I also had to keep at building my community. I don’t mean the kind of networking we all feel is gross. I mean meeting other writers whom I could encourage and who could encourage me, writers whom I could critique and who could critique my writing. So, I could get better. And writers who would introduce me to their friends and writers I could introduce to my writer friends. Because we all need all the support we can get; I’m very much about helping those around me.  How did The Quantum Magician (or perhaps the series, The Quantum Evolution) start for you? What was the inspiration and did the direction change after you went deeper into writing the books?  I subscribe to the idea that one of the best ways to start a new project from scratch is to make a list of all your favorite reading/watching/listening experiences—greatest hits of scenes, characters, climactic moments, etc., and to look for commonalities. I did that in the summer of 2014 while I was camping.  I knew I wanted to try to make a person with quantum perceptions, inspired by a short story of Stephen Baxter’s, and that I would probably call the novel The Quantum Magician. And due to reading collections by Stephen Baxter and Alastair Reynolds, I knew as well that I would like to get to a point where my Asimov’s and Analog stories would be in the same universe.  The possible interactions between the cultures in my short stories were tantalizing. I wondered about how to put together the Sub-Saharan Union from my novella “Pollen From a Future Harvest,” the Homo eridanus from “Beneath Sunlit Shallows” and the skates from “Schools of Clay.” I had a lot of new ideas too. I wanted to expand my Quebecois pan-stellar empire. And I wanted to do a heist, because I really enjoy heist stories. And I wanted to work through some of my worries about the risks of genetically engineering humans, which manifested in their worst form in the Puppets.  I started to get a lot of possible ideas, more than just one novel, and many short stories and novelettes. I spread the most likely character-plot sequence out and found I probably had enough for 3-4 novels, and started shaping The Quantum Magician. The rest of the ideas I left on the side, and some of them became The Quantum Garden. I’m (very, very slowly) writing The Quantum Temple right now, but it isn’t due for a while, so my Act II problems are sort of staring me in the face, telling me to work on other things. But most of the origin conception of the shape of the story was there before I started drafting the first novel.  The Quantum Magician introduced readers to con man extraordinaire Belisarius Arjona, who assembles his crew for a science fictional heist/smuggling job. Book 2, The Quantum Garden, is scheduled for October 2019. Where does the story take Belisarius and the reader?  If The Quantum Magician is structurally an Ocean’s Eleven in space, then The Quantum Garden is a bit of a space opera Back to the Future. It’s not too much of a spoiler to say The Quantum Garden opens with the Congregate nuking the Garret, the home of the Homo quantus. To save his people, Belisarius needs something from forty years in the past, in the history of the Sub-Saharan Union that I created in my novella, “Pollen From a Future Harvest.” To do that, he needs the help of Major Iekanjika, whom he didn’t leave on exactly wonderful terms at the end of the first novel. I’m very happy with the way the second book turned out. I hope readers feel the same way 🙂  What is your favorite thing about The Quantum Evolution? What was the hardest thing about writing it, and what do you really want readers to know about it?  I have a lot of favorites. My writing process is to throw all the favorites together. I’m a sense of wonder junkie, so all the weird space and science and alien places, and all the different ways different subspecies of humanity will experience the world are my jam. While writing and editing, I loved living in Stills’ head. In Marie’s head. I loved trying to balance Belisarius’ conflicting internal worlds. I loved writing parts of the Puppet Bible and the Way of the Mongrel. And who doesn’t like to write a heist?  On the hard side, I really don’t like hurting my characters. That’s probably a professional liability for a writer? In The Quantum Magician, Will Gander got the worst of it, but he knew he was the fall guy. He just hadn’t known how far he would have to fall. In The Quantum Garden I hurt Belisarius and Iekanjika more deeply than I hurt Gander, and that didn’t make me feel good. That’s something I have to get over? Characters are just electrons in a hard drive, but still I find it hard to hurt people or watch them get hurt. That more than anything else is probably why I have a hard time watching TV and movies.  What else are you working on now that readers can look forward to?  I really want to talk about it, but we’re finalizing some details in one of the contracts, so I have to sit on it officially for a bit. We’ll probably be able to announce in late September. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nScience Fiction Heist: A Conversation with Derek Künsken\nScience meets space opera meets heist in Derek Künsken’s The Quantum Evolution series. It all starts when con man Belisarius Arjona—a homo quantus (his mind and body have been engineered to be able to see directly into the quantum realm) and his “ensemble-cast” crew have to move a squadron of secret warships across an enemy wormhole. Trouble—and lots of cool science fictional ideas—ensues.\nDerek Künsken left science to work with street kids in Honduras before joining the Canadian foreign service. Now, he writes science fiction in Gatineau, Quebec. To his surprise, his first novel, The Quantum Magician was nominated for the Aurora, the Locus, and the Chinese Nebula, and has been or will be published in Japanese, French, and Chinese. Its sequel, The Quantum Garden, will be on sale in mid-October. His latest story, “Tachyon Hearts Cannot Love,” is a Petit Prince-type story of dealing with heartbreak and will run in the Mar/Apr issue of Asimov’s.\nYour first short story sale was “Tidal Maneuvers,” published in On Spec in 2006. You recently had “Ghosts of Ganymede” published in the January 2019 Clarkesworld, and had a number of stories between them. Has your writing changed since that first sale? Or your approach to writing/publishing?\nAfter “Tidal Maneuvers,” I sold a story to Asimov’s, but followed it up with a dry period. The next three years netted me a lot of rejection letters. One from Sheila Williams said, “there’s not enough story here.” That feedback was one of four or six important ones in my career that triggered an epiphany. In this case, I looked back on my previous work and realized that the layers, the symbolism and themes in my stories were thin, or worse, not even there. Since then, I’ve tried to attach multiple meanings to story elements, and to link them by multiple connections. Any story can still be read as a series of events, but for readers who want a bit more to ponder, I hope my stories now offer more. This is true, I hope, for “The Ghosts of Ganymede.”\nAre there themes or topics that often come up in your short fiction? “The Ghosts of Ganymede” is full of tension; cold, rocky imagery creates a sense of strangeness and bleakness, while adding to the tension. Do you vary things like style, voice, and so on, or is there a consistency to your writing that readers will always recognize?\nI feel like I’m not done exploring the cruelties humans inflict on each other. Whether it’s magical street kids in my PodCastle story “Juan Caceres in the Zapatero’s Workshop” or the Puppets in The Quantum Magician or honor killings in my PseudoPod story “The Dog’s Paw” or the refugees in “The Ghosts of Ganymede,” I suspect I’m trying to come to terms with the cruelty.\nOn style or voice, I think I’m able to vary voice sometimes depending on whose point of view it is, but I think I also have an authorial voice that I default to (to my disappointment; I’m often envious of writers who create captivating, fascinating narrative voices).\nFor readers who haven’t read “The Ghosts of Ganymede,” what is it about?\nIn a nutshell, Eritrean and Ethiopian refugees are resettled to Ganymede to found a corporate outpost after their nuclear war left both countries uninhabitable. On Ganymede they find quantum ghosts of a species gone extinct. The ghosts exacerbate tensions between the refugee groups, and also constitute a scientific mystery the refugees have to figure out before they can make a home.\nAre there risks or challenges specific to writing characters from other cultures, such as Eritrean and Ethiopian, and how do you manage these challenges?\nOf course! I think it’s easy to misrepresent the feelings, concerns, attitudes, and values of people other than you. I did a great deal of research on the cultures, and specifically set the story about 150 years in the future to give me a bit of a buffer for inevitable cultural change. But at the same time, I’ve worked with Canada’s refugee program for almost a decade, one which at times included refugees from Eritrea and Ethiopia. I was very happy to hear that in the last few years, relations between Eritrea and Ethiopia were normalizing, but for this story I needed peoples who were culturally close, and yet had histories of conflict, so I projected some past conflict and tension into a future story. The Sub-Saharan Union, a future federation of large states in Africa, featured prominently in both The Quantum Magician and The Quantum Garden. In the case of the Union, their culture is five hundred years in the future, so I had more latitude to imagine where cultural fault lines might evolve.\nYou also have a webcomic, Briarworld, that you put together with Argentinian artist Wendy Muldon: “A Flash Gordon-esque world where our jetpack-wearing mercenary Manuela, with the help of her cousin Teresita, would try to rescue a wayward prince Simon from his captor, Sheriff Joaquina on Briarworld.” Can you talk a bit about the ways in which writing the webcomic is different or similar to other work?\nThanks for bringing up Briarworld! It’s been a lot of fun to work on, and is certainly a different creative experience from prose. In a short story, I’m the writer, casting director, director, and set designer. Writing a webcomic or a traditional comic book makes me the writer, but the artist is the director, special effects expert, lighting and sound tech, set designer, and so on. And Wendy Muldon is amazing at all of those things. Her art is light, energetic, emotive. The empathy in her art forced me to rethink the kinds of stories I wanted to tell with her. Wendy is going to have a huge career in comics and illustration.\nHow does your background in molecular biology or your work for the Canadian Federal Public Service impact your writing?\nI spent seven years studying the biology and biochemistry of the really tiny, which I think gives me lots of inroads into making aliens, or genetically-engineered humans! I think it gave me some anxieties too. I’m sure that climate scientists have trouble sleeping at night. Or nuclear physicists find themselves imagining the apocalypse because they know exactly how it would go down. My professional scientific anxieties relate to what the rich and the majority will do to the poor and the minorities with the power of genetic engineering. The scariness of those anxieties found their way whole cloth into The Quantum Magician in the forms of the Homo quantus, the mongrels, and the Puppets.\nI worked for fifteen years as a Canadian public service official, about five of those on diplomatic postings to Latin America, and another six of them in refugee policy in Ottawa. Policy analysis is one of those jobs that rewards the clarity of scientific thinking, the boiling of problems down to their essentials and being able to communicate them clearly. It also teaches you how decisions are made, how government serves the public, and sometimes the limits of governmental levers. I think many of the moral and social problems I try to tackle in my novels and short fiction benefit from the kind of clarity I learned in a policy analysis environment.\nDoes your approach to writing change if you are working on a shorter piece of fiction?\nI think all world builders enjoy a big canvas, whether the novel or the novel series, because any exploratory detour is fair game as long as it’s executed well and survives the editor. I write short fiction with the drastically reduced size of canvas in mind, though. My natural short fiction length seems to be about 10,000 words, and going much longer than that risks not getting published. I think I can do a lightly world-built story in 5,000-6,000 words, so I guess about half of any story of mine is setting?\nMany writers put all their hopes into one project and will feel like giving up if it doesn’t hit the measures of success that they are looking for. Was there a point at which you considered giving up on writing; or, how did you keep hope alive?\nI was raised to think that hard work and practice leads to results, so no rejection letter ever made me think of stopping. I got fifty rejections before my first acceptance and if we don’t count comic books, I’m probably at about 350 rejections and counting in my career to date. Every rejection is disappointing, but I knew if I just kept at it, I would eventually learn.\n“It” and “eventually” are probably the most important words in that last sentence, by the way. What should we keep at? It’s not just writing. If I’d only written, I’d still largely be writing the same way I’d been writing when I was 30. I feel I had to keep at the reading, broad reading, deep reading, analytical reading, reading that deconstructs and reverse engineers. I also had to keep at building my community. I don’t mean the kind of networking we all feel is gross. I mean meeting other writers whom I could encourage and who could encourage me, writers whom I could critique and who could critique my writing. So, I could get better. And writers who would introduce me to their friends and writers I could introduce to my writer friends. Because we all need all the support we can get; I’m very much about helping those around me.\nHow did The Quantum Magician (or perhaps the series, The Quantum Evolution) start for you? What was the inspiration and did the direction change after you went deeper into writing the books?\nI subscribe to the idea that one of the best ways to start a new project from scratch is to make a list of all your favorite reading/watching/listening experiences—greatest hits of scenes, characters, climactic moments, etc., and to look for commonalities. I did that in the summer of 2014 while I was camping.\nI knew I wanted to try to make a person with quantum perceptions, inspired by a short story of Stephen Baxter’s, and that I would probably call the novel The Quantum Magician. And due to reading collections by Stephen Baxter and Alastair Reynolds, I knew as well that I would like to get to a point where my Asimov’s and Analog stories would be in the same universe.\nThe possible interactions between the cultures in my short stories were tantalizing. I wondered about how to put together the Sub-Saharan Union from my novella “Pollen From a Future Harvest,” the Homo eridanus from “Beneath Sunlit Shallows” and the skates from “Schools of Clay.” I had a lot of new ideas too. I wanted to expand my Quebecois pan-stellar empire. And I wanted to do a heist, because I really enjoy heist stories. And I wanted to work through some of my worries about the risks of genetically engineering humans, which manifested in their worst form in the Puppets.\nI started to get a lot of possible ideas, more than just one novel, and many short stories and novelettes. I spread the most likely character-plot sequence out and found I probably had enough for 3-4 novels, and started shaping The Quantum Magician. The rest of the ideas I left on the side, and some of them became The Quantum Garden. I’m (very, very slowly) writing The Quantum Temple right now, but it isn’t due for a while, so my Act II problems are sort of staring me in the face, telling me to work on other things. But most of the origin conception of the shape of the story was there before I started drafting the first novel.\nThe Quantum Magician introduced readers to con man extraordinaire Belisarius Arjona, who assembles his crew for a science fictional heist/smuggling job. Book 2, The Quantum Garden, is scheduled for October 2019. Where does the story take Belisarius and the reader?\nIf The Quantum Magician is structurally an Ocean’s Eleven in space, then The Quantum Garden is a bit of a space opera Back to the Future. It’s not too much of a spoiler to say The Quantum Garden opens with the Congregate nuking the Garret, the home of the Homo quantus. To save his people, Belisarius needs something from forty years in the past, in the history of the Sub-Saharan Union that I created in my novella, “Pollen From a Future Harvest.” To do that, he needs the help of Major Iekanjika, whom he didn’t leave on exactly wonderful terms at the end of the first novel. I’m very happy with the way the second book turned out. I hope readers feel the same way 🙂\nWhat is your favorite thing about The Quantum Evolution? What was the hardest thing about writing it, and what do you really want readers to know about it?\nI have a lot of favorites. My writing process is to throw all the favorites together. I’m a sense of wonder junkie, so all the weird space and science and alien places, and all the different ways different subspecies of humanity will experience the world are my jam. While writing and editing, I loved living in Stills’ head. In Marie’s head. I loved trying to balance Belisarius’ conflicting internal worlds. I loved writing parts of the Puppet Bible and the Way of the Mongrel. And who doesn’t like to write a heist?\nOn the hard side, I really don’t like hurting my characters. That’s probably a professional liability for a writer? In The Quantum Magician, Will Gander got the worst of it, but he knew he was the fall guy. He just hadn’t known how far he would have to fall. In The Quantum Garden I hurt Belisarius and Iekanjika more deeply than I hurt Gander, and that didn’t make me feel good. That’s something I have to get over? Characters are just electrons in a hard drive, but still I find it hard to hurt people or watch them get hurt. That more than anything else is probably why I have a hard time watching TV and movies.\nWhat else are you working on now that readers can look forward to?\nI really want to talk about it, but we’re finalizing some details in one of the contracts, so I have to sit on it officially for a bit. We’ll probably be able to announce in late September.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/kunsken_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Science Fiction Heist: A Conversation with Derek Künsken by Arley Sorg"}