{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Ipjgb57ETB7iGXlcH5/SONA6d3o=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Imaginary Friends: A Conversation with Kameron Hurley  Born in Battle Ground WA, Kameron Hurley received a BA in historical studies at the University of Alaska Fairbanks, and a master’s from the University of KwaZulu-Natal in Durban, South Africa, specializing in the history of South African resistance movements. She lived in Chicago for four years before moving to Dayton, OH. She began writing copy for a financial services company, moved into marketing copy, then became senior copywriter at a software company. She started publishing short fiction in 1998 with “Brutal Women” and attended the Clarion West workshop in 2000. She landed a book deal with Bantam in 2008, which fell through. Her debut novel God’s War finally came out in 2011 with Night Shade. It was nominated for Tiptree, Nebula, Locus, Arthur C. Clarke, and BSFA awards, it won a Kitschy for Best Debut Novel, and it earned her a Sydney J. Bounds Award for Best Newcomer.  Besides the Bel Dame Apocrypha series (beginning with God’s War, plus Infidel and Rapture), the more recent Worldbreaker Saga published by Angry Robot (The Mirror Empire, Empire Ascendant, and January 2020’s The Broken Heavens), as well as Simon & Schuster novels The Stars are Legion and The Light Brigade; besides a short fiction career spanning two decades, and short fiction collection Meet Me in the Future published by Tachyon in 2019; Hurley is well known for smart, insightful, and occasionally seething nonfiction—with far more pieces than could fit into the pages of award-winning essay collection The Geek Feminist Revolution, published by Tor in 2016. She has written commentary for Locus Magazine for several years, and has nonfiction work published in The Atlantic, Writer’s Digest, Entertainment Weekly, The Village Voice, LA Weekly, Bitch Magazine, and Huffington Post, not to mention her own longtime blogging efforts. In fact, ‘‘We Have Always Fought: Challenging the Women, Cattle and Slaves Narrative,” first published on the A Dribble of Ink site in 2013, won her a Hugo Award for Best Related Work. She also won the Best Fan Writer Hugo Award in 2014 for her essays, and the aforementioned essay collection received a Hugo nomination, a BFA Award, and a Locus Award.   Your debut novel, God’s War, originally purchased in 2008, was published in 2011, beginning the Bel Dame Apocrypha series. At least seven novels and a collection later, how has your writing changed since that first book?  I’ve learned a lot more about plot and structure, which I have deliberately focused on since completing that first trilogy. I knew early on—from back when I went to the Clarion West writing workshop twenty years ago—that I had a strong affinity for character and worldbuilding, but plot and structure didn’t come nearly as naturally. I partnered with an agent, Hannah Bowman, who is very good at story structure and actively involved in her clients’ projects from initial pitch all the way through proofs. I really wanted a strategic business partner, and she’s been invaluable in helping me navigate my career after that first series.  I am more deliberate when approaching projects now. My goal is to do most of the planning up front so I don’t have to spend so much time revising. Sometimes that works—as with The Light Brigade—and sometimes it doesn’t, as with the last book in my fantasy trilogy, The Broken Heavens, which I had to rewrite three times.  That said, plotting and structuring short fiction has become much easier. I’m writing a short story every month for subscribers via my Patreon, and on that more compressed structural scale, I feel I’ve really leveled up. In part this is because with short fiction you get experience writing a full beginning/middle/end every time. With novels, the process of doing that is stretched out over a much longer period of time, which means you get less practice in completing that beginning/middle/end cycle. It takes longer to level up.  In your previous Clarkesworld interview you talk about reading SFF classics, beginning in your late teens. In an era where problematic behavior is being brought to light about many of the authors of classic SFF, and given that so much has happened in SFF since the days of Bester, in terms of narratives and discussions and ideas, is it still important for new writers to read classic works?  In the genre spaces I came up in at the time—and to some extent in certain circles today—there’s a type of professional and fan who absolutely will judge the “seriousness” of a new author on whether or not they’ve read Dhalgren, The Stars my Destination, or every book by Heinlein. But lately I’m seeing fewer of those people in the audience at panels, or mingling in the bar. Some of this is simply attrition: older fans and pros who found those works formative and contemporary are passing on, and more new fans and pros are entering these spaces.  The truth is that new fans are going to have different favorites, different formative works. These days I get almost as many gasps when I admit I haven’t read any of the Harry Potter books as I do when I say I haven’t read The Lord of the Rings.  There was a time in the first Golden Age of science fiction in the ’30s-’50s where you really could read every single science fiction book that had come out. You just can’t do that anymore. A recent “science fiction and fantasy books out this month” post listed over 200 titles. In one month!  It’s like the days when all we had was network TV, and we all watched the same dozen shows and talked about them every week. As great as that was for societal bonding, who has access to watch Game of Thrones—or who even has interest, when there are so many other shows available on so many channels and services—isn’t a near-universal. More choice and diversity in media means that we don’t all have to settle for the same six shows or twelve science fiction books. That’s a good thing! And while I can understand the frustration of those who believed you had to read the same twelve books to be a “real” fan, the truth is that writing and fandom today is going mainstream, and becoming less insular, and that means newer writers and fans are more likely to read contemporary authors. We’re entering a period now—70-90 years on from the ’50s Golden Age—that is equivalent to telling a writer in the ’50s that they weren’t a “real” writer unless they had read all the most popular books in the 1860s and 1880s. Those eras are rapidly becoming another country.  It was important to me to read the classics early because I was a young woman writing in a genre that was still very insular, and it proved my “cred” and “seriousness.” These days, it’s far less necessary, and may even turn off a lot of people to science fiction. I remember giving a talk to an audience in Madrid, and afterward a young woman came up to me and said, “I didn’t think I liked science fiction, but after hearing you talk about all of these books, I’m starting to think I might really enjoy it!”  As long as there’s a perception of “science fiction” being the same twelve authors, the only people we’re going to draw to the field as writers and fans are the people who connect with those same twelve books. I’m honestly much more concerned when I speak to writers who haven’t read anything published in the last twenty or thirty years than I am with ones who haven’t read something published seventy years ago. At this point there’s far more merit in keeping up with what your contemporaries are doing so you can keep a pulse on the current genre.  As a reader, what is important to you to see in a story? What have you read lately that you really enjoyed and want everyone to read?  I tend to gravitate toward unique worldbuilding, quirky or busted characters, and prose that’s deeply immersive. And by “deeply immersive,” I mean confident writing that taps into evocative details that pull me into the world. What makes a work of fiction emotionally satisfying is going to vary greatly from person to person. I’ve noticed that there are recurring themes that I’m particularly drawn to: The morality and ethics of war; explorations of humanity’s monstrousness (particularly as it relates to toxic masculinity); the process of revolution; and the psychological weirdness of humanity. This last bit in particular is probably why I connected so much with some of the work that came out of the New Weird movement in the early 2000s, and my interest in wild worldbuilding drove my interest in some of the early Golden Age and psychedelic New Wave work as well.  The last few years, there has been a real surge in new and powerful work in the genre that’s right up my alley. I certainly have an interest in reading more work than I have time to read, and my “need to read immediately” pile is at least fifty books long. I’ve recently blurbed some great books: The Luminous Dead, Salvation Day, and The Wolf of Oren-Yaro. I’ve also really enjoyed Paris Adrift, Trail of Lightning, The Traitor Baru Cormorant, The Warrior Within, the Starfire series, and of course Martha Wells’s super popular Murderbot books.  In that same interview, you also talked about wanting to be an astronaut. You’ve developed a solid career in writing both fiction and nonfiction, not only earning enough to make a living, but also receiving numerous accolades and awards. How did getting into writing happen for you? When did you start writing, and when or how did it become a serious career focus?  I had a vast imaginary life as a kid, and went on all sorts of adventures out in the woods behind my house with my “pretend friends.” At some point when I was ten or eleven, I realized that I could write down the adventures I was having in my head and other people could read them. It was a way to take something imaginary and make it visible and almost tangible to other people. Magic! By the time I was twelve I was writing “novels” of several hundreds of pages, and thought, “Wow, this would be a fun thing to do for a living, just making up stories and sharing them with people!” It was also a good way for an introverted kid to connect with people. I would make kids from my class characters in my books, and they would pass the manuscripts around to each other to see what happened to “their” character.  My writing really picked up in college and grad school, when I had a lot more free time to myself to focus on my work, and college was when I started seriously sending out manuscripts to agents and publishers. It wasn’t until after grad school and starting my first admin job that I finally picked up an agent and that first book deal, though. And it wasn’t exactly for big money, so I’ve been hustling ever since.  My mom told me that it was fine if I wanted to be a writer, but that I would be poor. She wasn’t wrong about that, at least the writing fiction part. I’ve had to grind a lot to make a sustainable living, and until the US sorts out the $20k a year I pay in health insurance and health costs for me and my spouse, I’m going to have a day job or day job freelance work for the rest of my life.  But I’m certainly less poor than I could have been, because I did put that writing work to use in the corporate space. Morally sad, but necessary.  Your fiction has often been described as dystopian, violent, dark, grim. Some have even said your work resembles or borders on horror. Do you also occasionally like to write hopeful or light pieces? Are there specific things that a dark/grim/violent narrative does for you (or for readers in general) that appeals to you as a writer?  I tend to find works of grim humor or tragedy really cathartic. Tragedy is great because you know the ending before you even start. The idea is that you keep going, not because you believe you will win, but because what is happening allows you to safely emote about it instead of just powering through it. I had this experience playing the third Mass Effect game, when I realized within the first fifteen or twenty minutes of game play that there wasn’t going to be any “good guys win and the world goes back to normal” option. Whatever happened was going to be very bad, and I knew most people wouldn’t survive it. I cried though a lot of that game, which seems weird until you consider that it’s this ability to feel feelings of fear and sorrow in a safe environment that drives most of us to watch horror and tragedy. These are important and necessary emotions, but in “real life” we are often focused so much on survival, on “getting through” a tragedy or horror, that we don’t allow ourselves to fully process these situations emotionally.  I’ve done a lot of research into PTSD, which I found I suffered from after a particularly traumatic week in the ER where I nearly died. I found that medical PTSD was absolutely a thing—and that about 25% of folks who had experienced long-term ER or health stays suffered from PTSD symptoms like anxiety, flashbacks, etc. There’s studies that say PTSD is most prevalent in situations where people feel they have no control—war situations, car crashes and other violent events, sexual assaults, and yes, hospital stays where they are weak and vulnerable and at the mercy of medical staff. In these moments, the way we process memories gets short-circuited. Writing about and talking about these events can help, because they encourage the brain to move these events into long-term memory instead of constantly trying to relive them.  I spent a good deal of time in my twenties writing online, in part to process my life up until that point. I’ve always found that creating narrative from the random shit that happens to me deeply comforting. Humans want to find patterns. We want to believe things happen for a reason. Creating a structure to our lives—even if only in writing—can be very soothing.  There’s a sense that I’m drawn to these sorts of stories because I find something deeply cathartic in them. Grim humor in the face of horror and tragedy is how I cope, and this sort of humor is employed often by some of my more memorable and beloved protagonists. Of course, I also use alcohol, which is another recurring theme in many of my books. All those characters who sit down over tea or coffee to chat about the plot tell you a lot about what the writers are doing in that particular moment.  I also think my books are more hopeful than they may be perceived. Certainly, there is brutality; bad things happen. Good and bad people do bad and good things. They are morally complex people and worlds. But importantly—in nearly every book or story I write—life goes on. People are still alive and kicking to help create what’s next. I embrace the grimness of those dark moments of our lives, but I’m certainly not a nihilist.  Much of the body horror simply comes from my experience living in my own messy body. I have a chronic illness, and struggled deeply with body image in my teens and twenties. My brain and body are complex messes that are nigh impossible to control. I’m very much in tune with the fact that we are all just bags of ambulating meat and goo, and that comes out in much of my writing.  The conclusion to your Worldbreaker Saga, The Broken Heavens, just came out in January. Where does book three take the story begun with The Mirror Empire and continued in Empire Ascendant? What do you really want readers to know about the last book and the series as a whole?  I spent several years and many, many drafts working to tie up that series in a satisfying way. I started writing (or rather, rewriting—it was originally a trunk novel) this series back in 2012, and the world around me changed as I wrote. When it came to the final book in the series, I found that I had changed a lot too, and the original ending I had planned just didn’t feel emotionally right to me anymore. Sometimes, as authors, we go on a journey of discovery with our characters, and I was a different person in 2019 than in 2012. My agent and I struggled over that final book and the final choice in the end, and I remain deeply proud of how I resolved the series.  I’ve been pleased with the reception to this final book. The fans have embraced it, and that reception has certainly validated my choice to pull it out of the publishing schedule a few years back and take the time to do it right. Bad books are bad forever. I knew that if I turned in an underwhelming finale, it could sink the series as a whole. Instead, I hope I’ve created a final book that makes the whole series worth talking about.  Defining your work is, itself, a bit controversial. For folks not familiar, looking at your body of work, how do you describe your own fiction? Do you describe your books differently than your short fiction? And where is the best place to start reading?  I realized early in my career that I didn’t want to be known for writing in a particular genre as much as I wanted to be known for writing a particular kind of book or story. I’ve gotten to the point where I just call them “Kameron Hurley” novels. They are books and stories with unique and vibrant worldbuilding, morally complex characters and their relationships, a high ratio of women characters, found families, thoughtful approaches to gender, grim humor, no sexual assault against female characters, and most embrace themes of war, conflict mitigation, and resistance.  As for the best place to start, it depends on the sort of books one enjoys. For those new to science fiction or who may be turned off by complex worldbuilding, I recommend my time-traveling military science fiction novel, The Light Brigade, which has been called a leftist Starship Troopers. If you are an epic fantasy fan, the Worldbreaker Saga follows the stories of five very different people thrust to the center of an ancient recurring event where multiple versions of other worlds try to annihilate each other. Bonus points for sentient plants and star magic and polyamorous matriarchies. If you’re a fan of sword and sorcery books, or Elric and Conan—or, frankly, Firefly—I recommend starting with God’s War, which is about a team of messy mercenaries who bring in bounties on a planet engaged in perpetual war.  What do you have coming up that readers can look forward to? And what can you tell us about it?  I’m currently working on a near-future science fiction thriller that I pitched as “Killing Eve meets Die Hard, in space.” That will be out next spring! I also create a new short story every month for fans who subscribe over on Patreon, so I’m sure there will be more short fiction collections coming up soon as well. After this, I will be working on some entirely new stuff that I’m very excited about—more details as I have them! Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nImaginary Friends: A Conversation with Kameron Hurley\nBorn in Battle Ground WA, Kameron Hurley received a BA in historical studies at the University of Alaska Fairbanks, and a master’s from the University of KwaZulu-Natal in Durban, South Africa, specializing in the history of South African resistance movements. She lived in Chicago for four years before moving to Dayton, OH. She began writing copy for a financial services company, moved into marketing copy, then became senior copywriter at a software company. She started publishing short fiction in 1998 with “Brutal Women” and attended the Clarion West workshop in 2000. She landed a book deal with Bantam in 2008, which fell through. Her debut novel God’s War finally came out in 2011 with Night Shade. It was nominated for Tiptree, Nebula, Locus, Arthur C. Clarke, and BSFA awards, it won a Kitschy for Best Debut Novel, and it earned her a Sydney J. Bounds Award for Best Newcomer.\nBesides the Bel Dame Apocrypha series (beginning with God’s War, plus Infidel and Rapture), the more recent Worldbreaker Saga published by Angry Robot (The Mirror Empire, Empire Ascendant, and January 2020’s The Broken Heavens), as well as Simon & Schuster novels The Stars are Legion and The Light Brigade; besides a short fiction career spanning two decades, and short fiction collection Meet Me in the Future published by Tachyon in 2019; Hurley is well known for smart, insightful, and occasionally seething nonfiction—with far more pieces than could fit into the pages of award-winning essay collection The Geek Feminist Revolution, published by Tor in 2016. She has written commentary for Locus Magazine for several years, and has nonfiction work published in The Atlantic, Writer’s Digest, Entertainment Weekly, The Village Voice, LA Weekly, Bitch Magazine, and Huffington Post, not to mention her own longtime blogging efforts. In fact, ‘‘We Have Always Fought: Challenging the Women, Cattle and Slaves Narrative,” first published on the A Dribble of Ink site in 2013, won her a Hugo Award for Best Related Work. She also won the Best Fan Writer Hugo Award in 2014 for her essays, and the aforementioned essay collection received a Hugo nomination, a BFA Award, and a Locus Award.\nYour debut novel, God’s War, originally purchased in 2008, was published in 2011, beginning the Bel Dame Apocrypha series. At least seven novels and a collection later, how has your writing changed since that first book?\nI’ve learned a lot more about plot and structure, which I have deliberately focused on since completing that first trilogy. I knew early on—from back when I went to the Clarion West writing workshop twenty years ago—that I had a strong affinity for character and worldbuilding, but plot and structure didn’t come nearly as naturally. I partnered with an agent, Hannah Bowman, who is very good at story structure and actively involved in her clients’ projects from initial pitch all the way through proofs. I really wanted a strategic business partner, and she’s been invaluable in helping me navigate my career after that first series.\nI am more deliberate when approaching projects now. My goal is to do most of the planning up front so I don’t have to spend so much time revising. Sometimes that works—as with The Light Brigade—and sometimes it doesn’t, as with the last book in my fantasy trilogy, The Broken Heavens, which I had to rewrite three times.\nThat said, plotting and structuring short fiction has become much easier. I’m writing a short story every month for subscribers via my Patreon, and on that more compressed structural scale, I feel I’ve really leveled up. In part this is because with short fiction you get experience writing a full beginning/middle/end every time. With novels, the process of doing that is stretched out over a much longer period of time, which means you get less practice in completing that beginning/middle/end cycle. It takes longer to level up.\nIn your previous Clarkesworld interview you talk about reading SFF classics, beginning in your late teens. In an era where problematic behavior is being brought to light about many of the authors of classic SFF, and given that so much has happened in SFF since the days of Bester, in terms of narratives and discussions and ideas, is it still important for new writers to read classic works?\nIn the genre spaces I came up in at the time—and to some extent in certain circles today—there’s a type of professional and fan who absolutely will judge the “seriousness” of a new author on whether or not they’ve read Dhalgren, The Stars my Destination, or every book by Heinlein. But lately I’m seeing fewer of those people in the audience at panels, or mingling in the bar. Some of this is simply attrition: older fans and pros who found those works formative and contemporary are passing on, and more new fans and pros are entering these spaces.\nThe truth is that new fans are going to have different favorites, different formative works. These days I get almost as many gasps when I admit I haven’t read any of the Harry Potter books as I do when I say I haven’t read The Lord of the Rings.\nThere was a time in the first Golden Age of science fiction in the ’30s-’50s where you really could read every single science fiction book that had come out. You just can’t do that anymore. A recent “science fiction and fantasy books out this month” post listed over 200 titles. In one month!\nIt’s like the days when all we had was network TV, and we all watched the same dozen shows and talked about them every week. As great as that was for societal bonding, who has access to watch Game of Thrones—or who even has interest, when there are so many other shows available on so many channels and services—isn’t a near-universal. More choice and diversity in media means that we don’t all have to settle for the same six shows or twelve science fiction books. That’s a good thing! And while I can understand the frustration of those who believed you had to read the same twelve books to be a “real” fan, the truth is that writing and fandom today is going mainstream, and becoming less insular, and that means newer writers and fans are more likely to read contemporary authors. We’re entering a period now—70-90 years on from the ’50s Golden Age—that is equivalent to telling a writer in the ’50s that they weren’t a “real” writer unless they had read all the most popular books in the 1860s and 1880s. Those eras are rapidly becoming another country.\nIt was important to me to read the classics early because I was a young woman writing in a genre that was still very insular, and it proved my “cred” and “seriousness.” These days, it’s far less necessary, and may even turn off a lot of people to science fiction. I remember giving a talk to an audience in Madrid, and afterward a young woman came up to me and said, “I didn’t think I liked science fiction, but after hearing you talk about all of these books, I’m starting to think I might really enjoy it!”\nAs long as there’s a perception of “science fiction” being the same twelve authors, the only people we’re going to draw to the field as writers and fans are the people who connect with those same twelve books. I’m honestly much more concerned when I speak to writers who haven’t read anything published in the last twenty or thirty years than I am with ones who haven’t read something published seventy years ago. At this point there’s far more merit in keeping up with what your contemporaries are doing so you can keep a pulse on the current genre.\nAs a reader, what is important to you to see in a story? What have you read lately that you really enjoyed and want everyone to read?\nI tend to gravitate toward unique worldbuilding, quirky or busted characters, and prose that’s deeply immersive. And by “deeply immersive,” I mean confident writing that taps into evocative details that pull me into the world. What makes a work of fiction emotionally satisfying is going to vary greatly from person to person. I’ve noticed that there are recurring themes that I’m particularly drawn to: The morality and ethics of war; explorations of humanity’s monstrousness (particularly as it relates to toxic masculinity); the process of revolution; and the psychological weirdness of humanity. This last bit in particular is probably why I connected so much with some of the work that came out of the New Weird movement in the early 2000s, and my interest in wild worldbuilding drove my interest in some of the early Golden Age and psychedelic New Wave work as well.\nThe last few years, there has been a real surge in new and powerful work in the genre that’s right up my alley. I certainly have an interest in reading more work than I have time to read, and my “need to read immediately” pile is at least fifty books long. I’ve recently blurbed some great books: The Luminous Dead, Salvation Day, and The Wolf of Oren-Yaro. I’ve also really enjoyed Paris Adrift, Trail of Lightning, The Traitor Baru Cormorant, The Warrior Within, the Starfire series, and of course Martha Wells’s super popular Murderbot books.\nIn that same interview, you also talked about wanting to be an astronaut. You’ve developed a solid career in writing both fiction and nonfiction, not only earning enough to make a living, but also receiving numerous accolades and awards. How did getting into writing happen for you? When did you start writing, and when or how did it become a serious career focus?\nI had a vast imaginary life as a kid, and went on all sorts of adventures out in the woods behind my house with my “pretend friends.” At some point when I was ten or eleven, I realized that I could write down the adventures I was having in my head and other people could read them. It was a way to take something imaginary and make it visible and almost tangible to other people. Magic! By the time I was twelve I was writing “novels” of several hundreds of pages, and thought, “Wow, this would be a fun thing to do for a living, just making up stories and sharing them with people!” It was also a good way for an introverted kid to connect with people. I would make kids from my class characters in my books, and they would pass the manuscripts around to each other to see what happened to “their” character.\nMy writing really picked up in college and grad school, when I had a lot more free time to myself to focus on my work, and college was when I started seriously sending out manuscripts to agents and publishers. It wasn’t until after grad school and starting my first admin job that I finally picked up an agent and that first book deal, though. And it wasn’t exactly for big money, so I’ve been hustling ever since.\nMy mom told me that it was fine if I wanted to be a writer, but that I would be poor. She wasn’t wrong about that, at least the writing fiction part. I’ve had to grind a lot to make a sustainable living, and until the US sorts out the $20k a year I pay in health insurance and health costs for me and my spouse, I’m going to have a day job or day job freelance work for the rest of my life.\nBut I’m certainly less poor than I could have been, because I did put that writing work to use in the corporate space. Morally sad, but necessary.\nYour fiction has often been described as dystopian, violent, dark, grim. Some have even said your work resembles or borders on horror. Do you also occasionally like to write hopeful or light pieces? Are there specific things that a dark/grim/violent narrative does for you (or for readers in general) that appeals to you as a writer?\nI tend to find works of grim humor or tragedy really cathartic. Tragedy is great because you know the ending before you even start. The idea is that you keep going, not because you believe you will win, but because what is happening allows you to safely emote about it instead of just powering through it. I had this experience playing the third Mass Effect game, when I realized within the first fifteen or twenty minutes of game play that there wasn’t going to be any “good guys win and the world goes back to normal” option. Whatever happened was going to be very bad, and I knew most people wouldn’t survive it. I cried though a lot of that game, which seems weird until you consider that it’s this ability to feel feelings of fear and sorrow in a safe environment that drives most of us to watch horror and tragedy. These are important and necessary emotions, but in “real life” we are often focused so much on survival, on “getting through” a tragedy or horror, that we don’t allow ourselves to fully process these situations emotionally.\nI’ve done a lot of research into PTSD, which I found I suffered from after a particularly traumatic week in the ER where I nearly died. I found that medical PTSD was absolutely a thing—and that about 25% of folks who had experienced long-term ER or health stays suffered from PTSD symptoms like anxiety, flashbacks, etc. There’s studies that say PTSD is most prevalent in situations where people feel they have no control—war situations, car crashes and other violent events, sexual assaults, and yes, hospital stays where they are weak and vulnerable and at the mercy of medical staff. In these moments, the way we process memories gets short-circuited. Writing about and talking about these events can help, because they encourage the brain to move these events into long-term memory instead of constantly trying to relive them.\nI spent a good deal of time in my twenties writing online, in part to process my life up until that point. I’ve always found that creating narrative from the random shit that happens to me deeply comforting. Humans want to find patterns. We want to believe things happen for a reason. Creating a structure to our lives—even if only in writing—can be very soothing.\nThere’s a sense that I’m drawn to these sorts of stories because I find something deeply cathartic in them. Grim humor in the face of horror and tragedy is how I cope, and this sort of humor is employed often by some of my more memorable and beloved protagonists. Of course, I also use alcohol, which is another recurring theme in many of my books. All those characters who sit down over tea or coffee to chat about the plot tell you a lot about what the writers are doing in that particular moment.\nI also think my books are more hopeful than they may be perceived. Certainly, there is brutality; bad things happen. Good and bad people do bad and good things. They are morally complex people and worlds. But importantly—in nearly every book or story I write—life goes on. People are still alive and kicking to help create what’s next. I embrace the grimness of those dark moments of our lives, but I’m certainly not a nihilist.\nMuch of the body horror simply comes from my experience living in my own messy body. I have a chronic illness, and struggled deeply with body image in my teens and twenties. My brain and body are complex messes that are nigh impossible to control. I’m very much in tune with the fact that we are all just bags of ambulating meat and goo, and that comes out in much of my writing.\nThe conclusion to your Worldbreaker Saga, The Broken Heavens, just came out in January. Where does book three take the story begun with The Mirror Empire and continued in Empire Ascendant? What do you really want readers to know about the last book and the series as a whole?\nI spent several years and many, many drafts working to tie up that series in a satisfying way. I started writing (or rather, rewriting—it was originally a trunk novel) this series back in 2012, and the world around me changed as I wrote. When it came to the final book in the series, I found that I had changed a lot too, and the original ending I had planned just didn’t feel emotionally right to me anymore. Sometimes, as authors, we go on a journey of discovery with our characters, and I was a different person in 2019 than in 2012. My agent and I struggled over that final book and the final choice in the end, and I remain deeply proud of how I resolved the series.\nI’ve been pleased with the reception to this final book. The fans have embraced it, and that reception has certainly validated my choice to pull it out of the publishing schedule a few years back and take the time to do it right. Bad books are bad forever. I knew that if I turned in an underwhelming finale, it could sink the series as a whole. Instead, I hope I’ve created a final book that makes the whole series worth talking about.\nDefining your work is, itself, a bit controversial. For folks not familiar, looking at your body of work, how do you describe your own fiction? Do you describe your books differently than your short fiction? And where is the best place to start reading?\nI realized early in my career that I didn’t want to be known for writing in a particular genre as much as I wanted to be known for writing a particular kind of book or story. I’ve gotten to the point where I just call them “Kameron Hurley” novels. They are books and stories with unique and vibrant worldbuilding, morally complex characters and their relationships, a high ratio of women characters, found families, thoughtful approaches to gender, grim humor, no sexual assault against female characters, and most embrace themes of war, conflict mitigation, and resistance.\nAs for the best place to start, it depends on the sort of books one enjoys. For those new to science fiction or who may be turned off by complex worldbuilding, I recommend my time-traveling military science fiction novel, The Light Brigade, which has been called a leftist Starship Troopers. If you are an epic fantasy fan, the Worldbreaker Saga follows the stories of five very different people thrust to the center of an ancient recurring event where multiple versions of other worlds try to annihilate each other. Bonus points for sentient plants and star magic and polyamorous matriarchies. If you’re a fan of sword and sorcery books, or Elric and Conan—or, frankly, Firefly—I recommend starting with God’s War, which is about a team of messy mercenaries who bring in bounties on a planet engaged in perpetual war.\nWhat do you have coming up that readers can look forward to? And what can you tell us about it?\nI’m currently working on a near-future science fiction thriller that I pitched as “Killing Eve meets Die Hard, in space.” That will be out next spring! I also create a new short story every month for fans who subscribe over on Patreon, so I’m sure there will be more short fiction collections coming up soon as well. After this, I will be working on some entirely new stuff that I’m very excited about—more details as I have them!\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/hurley_interview_2020/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Imaginary Friends: A Conversation with Kameron Hurley by Arley Sorg"}