{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cassandra Khaw", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "zKYtt3d6mhGZbYgomikNWIHf/jQ=", "id": null, "license": null, "comments": "", "raw_text": "1620 words, short story  Landmark  Home is the quality of light in your eyes on a summer night, salt-scent and clean skin, the rasp of your stubble along on the curve of my palm. Home is the diction and rhythm of your conversation, is the bend of your mouth, the slant of your smile. Home is your quiet. Even ten million lightyears away, suspended between seconds, time beading silver-bright on molecules of dark matter, home has always been the silence I’ve held in the chapel of your hands.  I flex my fingers, squeeze the vinyl flesh into a fist. The transmission is slow, syncopated. I experience the sensation in staccato: the bend of my joints, the peculiar texture of my skin, the one you said you never minded. Then again, we’d pick this model together, contoured and coaxed its anatomy into a compromise of shared aesthetics. Why should you mind? I blink and delight, just for a second, in the way the lashes—synthetic hairs, so pliant that they could almost pass for real—feel on my cheeks.  “Where lies your landmark, seamark, or your soul’s star?” asked a poet once and I think to myself: here. Right here.  “Are you sure?” You ask.  I study you through the camera. That feed is closer to real-time, even if the ocular prosthetics are better at imaging colors, richer in saturation. You look more tired than I remember, more battered. I forget we no longer experience time in the same fashion. Not that we ever did, generations between us, but this isn’t about that.  I’ve seen the mouth of the universe open to devour the stars. I’ve seen our Earth reborn seventeen times, mapped the trajectory of its catastrophes, the telemetry of its deaths. Once, existence spasmed and there was nothing, nothing at all, neither estrus nor end, only darkness complete.  Time, the media likes to say, is meaningless to people like me. They’re lying. It means everything instead.  “This is what I want. Promise.”  “I don’t want you to agree to something just because—just because. You know.” The spaces in our sentences are a language onto their own, a dialect born of corrective butchery, edited from something once so much bigger. I can taste it, nonetheless, the vocabulary we’d abandoned, its small and frightening phrases. Trust me. Stay here. Stay. In my mouth, they’re cherry cider and the lights of the city, and how you showed me that with some people, some places, you never stop falling in love, you only come up for air. “Do me a favor? Can you take a few days? Take a few days to think about this? Please?”  You still don’t understand. I’ve had days. I’ve had the lifespan of our solar system, twice and again. Time works differently here. But I nod, anyway. My simulacrum follows, half a second later. “Sure.”  “Where lies your landmark, seamark, or your soul’s star?” murmurs the poet, his bones now a home for mice.  Above the world, falling in love with the city like it was first time all over.  “I might stay here a little longer,” I tell you, straddling your hips with my double. You had joked, the first time we made love, that it was almost like having sex with twins. Except this one was alien, love through the looking glass. I did not correct you. The reality is more pedestrian. I’d chosen this look to express my interiority, its strangeness in relation to you: a fae body for a fae creature, unstuck in time. “Logistical concerns, existing responsibilities. I don’t know. It’s hard.”  Your breath speeds in simpatico as my fingers climb your ribs. In the mirror, I can see how the light sluices along my skin, a faint nacre sheen apparent even in the dimness. Proportions-wise, it is as we agreed: a little taller than I am, a little fuller at hips. I’d eschewed hair, however, dilated the orbital sockets, deepened them. The eyes are an ecosystem of bioluminescent bacteria, the sclera gold, the iris green.  “Okay.” No variation in your expression. “Whatever you need to do to be happy.”  I sigh. It is not what I want to hear. What I want is for you to tell me to come home, come home and curl your body against mine. But we’d elided the syntax that allows for such communication. The framework we’d left behind is insufficient. So, I lean down instead, your hand rising to trace the city-line of my spine, kiss you breathless.  In the void, I pretend that the interface translates temperature with perfect accuracy, that I can feel your jaw warm beneath my lips, that I don’t miss you.  “Where lies your landmark, seamark, or your soul’s star?” calls the poet, alive again, for the ritual of the recital.  In the way your hips slot into mine. In the fit of you, exquisite, as though bodies were built too lonely, and every one of us is waiting, waiting lifetimes to be complete.  “I don’t want you to be unhappy. I don’t want you to resent me. I—”  “You can’t expect me not to mourn.” I tell you evenly, hands over yours, thumb orbiting your knuckles. Two days to the expedition, two nights left to sleep laced in your arms. It hurts, beloved. But how can I tell you? “I’m going to grieve what we’d lost. It’s going to hurt. I can’t pretend it’s not going to hurt.”  A muscle, cording the meridian that runs between the cliff of your cheekbone and your temple, flutters. This conversation upsets you, and suddenly, I am afraid again, terrified you’d flee. I stroke your hair. You kiss the heel of my palm, just above where the wrist grazes your jaw, watch me like a fox with its back to the shore. “I’m not expecting anything from you—”  I wish you were, though. I wish you’d ask. Anything and everything. Something. I wish I had an itinerary of your desires, a roadmap crisscrossed by whim, every ambition numbered, ordered by need. I wish you’d tell me to stay.  But I know, I know that isn’t the way. You can’t build on broken glass, can’t make a home out of a husk. It’s why I’m leaving.  “I know. I’m just telling you that you can’t expect me not to have moments of sadness. But I want this, I do.”  “Are you sure?” On the precipice of your tongue, questions too vulnerable to voice: Why me? Why this? Why, despite everything that’d happened?  Why?  “Yes. Look, we’ve broken much too far from that. If this is going to have a chance, we need to start from scratch again, you know?”  I mean every word, but that doesn’t mean it doesn’t hurt.  “Are you sure?”  “Yes.”  It is the only choice I have left.  “Where lies your landmark, seamark, or your soul’s star?” whispers the poet, stardust now, dead, immortal.  Where love lives, of course.  Where love is.  “Do you know when you are coming back?”  Orientation is always hard when you first surface into static time, like a baptism of mucus. It sticks to the lungs, the tongue, a vernix-like slickness, cloying, clotting in your throat. You drown on the present. It is why I prefer the prosthetic of a proxy, a cleaner option. It supplies opportunity to rehearse, prepare, pretend that this, like everything else, is effortless.  I hesitate. You so rarely call. I barely know what to do with me. In the window, your image stutters in sympathy.  “I . . . still don’t know yet. It’s complicated.” I worry at my hair, the strands still wet, haloed in neon.  “Ah.”  I palm the screen. One of the many things I’d never tell you: it is cold here and the last time I was warm, it was in the coil of your arms. “It doesn’t mean I don’t want to see you. It’s just. It’s hard. It’s a long trip back. And if you’re going to, you know, be with someone else during that time. I don’t understand what’s the point.”  “You don’t have to.”  “I want to. I’m just conflicted.”  “Come back when you’re ready to. There’s no obligation.”  “But—”  The word hangs between us, a dead satellite in the nothing, its belly gravid with stillborn dialogue. I want to ask you what I’d missed, the minutiae of simply existing, each day in sequence, no variegation in their consumption. Already, I’ve forgotten if it’s been a week, a day, a year since we’ve spoken, if this conversation is prior to the last, if it is years after. The cartography of your features remain unchanged. It cannot have been that long.  “I—Don’t. I was afraid of this.”  “Afraid of what?”  “We’re just circling back to the same things. We always are. I knew this was going to happen. I knew.” You empty an old rage, an old fear, as the connection falters, your words received in gasps.  “Stop.”  “What.”  “This was never about that. I wouldn’t be here if it was. I just—I’m still human, you know? This still hurts. You can’t blame me for that.”  You pause.  You break.  You whisper:  “Why are you doing this to yourself?”  “Because if this is the only way I can have you, I’ll take it.”  “How can this half-state be enough?”  It isn’t. It is nowhere near enough. But I have lived epochs without you, and that is so much worse. Home has always been your fingers and mine, the smell of your coat, your hair against my cheek. Home is the start of your laugh and the end of a kiss. Home is this ache, this hurt.  “Because it has to be,” I murmur, voice thick with futures. “Because it needs to be. Cassandra Khaw writes horror, video games, tweets for money, articles about video games, and tabletop RPGs. These are not necessarily unrelated items. Her work can be found in professional short story magazines such as Clarkesworld, Fireside Fiction, Uncanny, and Shimmer. Cassandra's first paranormal rom-com Bearly a Lady released this year. Her recent Lovecraftian Southern Gothic, A Song for Quiet, is a considerably different animal.", "text": "1620 words, short story\nLandmark\nHome is the quality of light in your eyes on a summer night, salt-scent and clean skin, the rasp of your stubble along on the curve of my palm. Home is the diction and rhythm of your conversation, is the bend of your mouth, the slant of your smile. Home is your quiet. Even ten million lightyears away, suspended between seconds, time beading silver-bright on molecules of dark matter, home has always been the silence I’ve held in the chapel of your hands.\nI flex my fingers, squeeze the vinyl flesh into a fist. The transmission is slow, syncopated. I experience the sensation in staccato: the bend of my joints, the peculiar texture of my skin, the one you said you never minded. Then again, we’d pick this model together, contoured and coaxed its anatomy into a compromise of shared aesthetics. Why should you mind? I blink and delight, just for a second, in the way the lashes—synthetic hairs, so pliant that they could almost pass for real—feel on my cheeks.\n“Where lies your landmark, seamark, or your soul’s star?” asked a poet once and I think to myself: here. Right here.\n“Are you sure?” You ask.\nI study you through the camera. That feed is closer to real-time, even if the ocular prosthetics are better at imaging colors, richer in saturation. You look more tired than I remember, more battered. I forget we no longer experience time in the same fashion. Not that we ever did, generations between us, but this isn’t about that.\nI’ve seen the mouth of the universe open to devour the stars. I’ve seen our Earth reborn seventeen times, mapped the trajectory of its catastrophes, the telemetry of its deaths. Once, existence spasmed and there was nothing, nothing at all, neither estrus nor end, only darkness complete.\nTime, the media likes to say, is meaningless to people like me. They’re lying. It means everything instead.\n“This is what I want. Promise.”\n“I don’t want you to agree to something just because—just because. You know.” The spaces in our sentences are a language onto their own, a dialect born of corrective butchery, edited from something once so much bigger. I can taste it, nonetheless, the vocabulary we’d abandoned, its small and frightening phrases. Trust me. Stay here. Stay. In my mouth, they’re cherry cider and the lights of the city, and how you showed me that with some people, some places, you never stop falling in love, you only come up for air. “Do me a favor? Can you take a few days? Take a few days to think about this? Please?”\nYou still don’t understand. I’ve had days. I’ve had the lifespan of our solar system, twice and again. Time works differently here. But I nod, anyway. My simulacrum follows, half a second later. “Sure.”\n“Where lies your landmark, seamark, or your soul’s star?” murmurs the poet, his bones now a home for mice.\nAbove the world, falling in love with the city like it was first time all over.\n“I might stay here a little longer,” I tell you, straddling your hips with my double. You had joked, the first time we made love, that it was almost like having sex with twins. Except this one was alien, love through the looking glass. I did not correct you. The reality is more pedestrian. I’d chosen this look to express my interiority, its strangeness in relation to you: a fae body for a fae creature, unstuck in time. “Logistical concerns, existing responsibilities. I don’t know. It’s hard.”\nYour breath speeds in simpatico as my fingers climb your ribs. In the mirror, I can see how the light sluices along my skin, a faint nacre sheen apparent even in the dimness. Proportions-wise, it is as we agreed: a little taller than I am, a little fuller at hips. I’d eschewed hair, however, dilated the orbital sockets, deepened them. The eyes are an ecosystem of bioluminescent bacteria, the sclera gold, the iris green.\n“Okay.” No variation in your expression. “Whatever you need to do to be happy.”\nI sigh. It is not what I want to hear. What I want is for you to tell me to come home, come home and curl your body against mine. But we’d elided the syntax that allows for such communication. The framework we’d left behind is insufficient. So, I lean down instead, your hand rising to trace the city-line of my spine, kiss you breathless.\nIn the void, I pretend that the interface translates temperature with perfect accuracy, that I can feel your jaw warm beneath my lips, that I don’t miss you.\n“Where lies your landmark, seamark, or your soul’s star?” calls the poet, alive again, for the ritual of the recital.\nIn the way your hips slot into mine. In the fit of you, exquisite, as though bodies were built too lonely, and every one of us is waiting, waiting lifetimes to be complete.\n“I don’t want you to be unhappy. I don’t want you to resent me. I—”\n“You can’t expect me not to mourn.” I tell you evenly, hands over yours, thumb orbiting your knuckles. Two days to the expedition, two nights left to sleep laced in your arms. It hurts, beloved. But how can I tell you? “I’m going to grieve what we’d lost. It’s going to hurt. I can’t pretend it’s not going to hurt.”\nA muscle, cording the meridian that runs between the cliff of your cheekbone and your temple, flutters. This conversation upsets you, and suddenly, I am afraid again, terrified you’d flee. I stroke your hair. You kiss the heel of my palm, just above where the wrist grazes your jaw, watch me like a fox with its back to the shore. “I’m not expecting anything from you—”\nI wish you were, though. I wish you’d ask. Anything and everything. Something. I wish I had an itinerary of your desires, a roadmap crisscrossed by whim, every ambition numbered, ordered by need. I wish you’d tell me to stay.\nBut I know, I know that isn’t the way. You can’t build on broken glass, can’t make a home out of a husk. It’s why I’m leaving.\n“I know. I’m just telling you that you can’t expect me not to have moments of sadness. But I want this, I do.”\n“Are you sure?” On the precipice of your tongue, questions too vulnerable to voice: Why me? Why this? Why, despite everything that’d happened?\nWhy?\n“Yes. Look, we’ve broken much too far from that. If this is going to have a chance, we need to start from scratch again, you know?”\nI mean every word, but that doesn’t mean it doesn’t hurt.\n“Are you sure?”\n“Yes.”\nIt is the only choice I have left.\n“Where lies your landmark, seamark, or your soul’s star?” whispers the poet, stardust now, dead, immortal.\nWhere love lives, of course.\nWhere love is.\n“Do you know when you are coming back?”\nOrientation is always hard when you first surface into static time, like a baptism of mucus. It sticks to the lungs, the tongue, a vernix-like slickness, cloying, clotting in your throat. You drown on the present. It is why I prefer the prosthetic of a proxy, a cleaner option. It supplies opportunity to rehearse, prepare, pretend that this, like everything else, is effortless.\nI hesitate. You so rarely call. I barely know what to do with me. In the window, your image stutters in sympathy.\n“I . . . still don’t know yet. It’s complicated.” I worry at my hair, the strands still wet, haloed in neon.\n“Ah.”\nI palm the screen. One of the many things I’d never tell you: it is cold here and the last time I was warm, it was in the coil of your arms. “It doesn’t mean I don’t want to see you. It’s just. It’s hard. It’s a long trip back. And if you’re going to, you know, be with someone else during that time. I don’t understand what’s the point.”\n“You don’t have to.”\n“I want to. I’m just conflicted.”\n“Come back when you’re ready to. There’s no obligation.”\n“But—”\nThe word hangs between us, a dead satellite in the nothing, its belly gravid with stillborn dialogue. I want to ask you what I’d missed, the minutiae of simply existing, each day in sequence, no variegation in their consumption. Already, I’ve forgotten if it’s been a week, a day, a year since we’ve spoken, if this conversation is prior to the last, if it is years after. The cartography of your features remain unchanged. It cannot have been that long.\n“I—Don’t. I was afraid of this.”\n“Afraid of what?”\n“We’re just circling back to the same things. We always are. I knew this was going to happen. I knew.” You empty an old rage, an old fear, as the connection falters, your words received in gasps.\n“Stop.”\n“What.”\n“This was never about that. I wouldn’t be here if it was. I just—I’m still human, you know? This still hurts. You can’t blame me for that.”\nYou pause.\nYou break.\nYou whisper:\n“Why are you doing this to yourself?”\n“Because if this is the only way I can have you, I’ll take it.”\n“How can this half-state be enough?”\nIt isn’t. It is nowhere near enough. But I have lived epochs without you, and that is so much worse. Home has always been your fingers and mine, the smell of your coat, your hair against my cheek. Home is the start of your laugh and the end of a kiss. Home is this ache, this hurt.\n“Because it has to be,” I murmur, voice thick with futures. “Because it needs to be.\nCassandra Khaw writes horror, video games, tweets for money, articles about video games, and tabletop RPGs. These are not necessarily unrelated items. Her work can be found in professional short story magazines such as Clarkesworld, Fireside Fiction, Uncanny, and Shimmer. Cassandra's first paranormal rom-com Bearly a Lady released this year. Her recent Lovecraftian Southern Gothic, A Song for Quiet, is a considerably different animal.", "source": "https://clarkesworldmagazine.com/khaw_12_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Landmark by Cassandra Khaw"}