{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Benjamin C Kinney", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "YGbr6wy1BZZDLxM8WdgzFW2G0w8=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  The Evolved Brain  In 2014, the psychologist Gary Marcus from New York University gathered a book of essays by the world’s leading neuroscientists, including multiple Nobel prize winners. From this experience, he drew one main lesson: we have no unifying idea about how the brain works.  However, Dr. Marcus and his essayists missed something. We comprehend much more than they think, and a unified understanding of the brain can guide our thinking, and our fiction, about the human brain and mind.  According to Dr. Marcus, biology is a riot of complexity, devoid of the mathematical elegance and simplicity that can arise in physics. Neuroscience is perversely resistant to theory: “No overarching theory of neuroscience could predict, for example, that the cerebellum (which is involved in timing and motor control) would have vastly more neurons than the prefrontal cortex (the part of the brain most associated with our advanced intelligence).”  Our knowledge about the brain dwarfs our understanding of how the brain works. Modern neuroscience began in 1888, when a Spanish artist-turned-physician named Santiago Ramón y Cajal proved that the nervous system was made of cells we now call neurons. In the nearly 130 years since then, scientists have collected a vast trove of data about the brain, culminating in at least 100,000 peer-reviewed scholarly articles in 2015. But data alone cannot explain anything: in any field of science, one of the hardest parts is sifting through messy data to draw conclusions and interpretations. To integrate information into understanding, we need a theory of the brain.  A good theory would not only account for what we observe, but provide some insight into why the brain might be organized this way. To continue with Dr. Marcus’ example, the cerebellum contains half of the brain’s total neurons, devoted to movement timing and refinement. This flies in the face of our natural assumptions about the role and value of humanity itself. What is the brain doing, if not intelligence and planning? If we can’t explain half of the brain’s components, our understanding must be seriously deficient. And, indeed, our old ideas of the brain—both commonsense and scientific—break down in many ways.  Foremost among these old ideas is the information processing (IP) model, which has served as our dominant explanation for brain function since the 1950’s. In its most well-known form, the IP model says the brain is a computer. On the most literal level, this is obviously false: unlike any device we’d recognize as a modern computer, the brain is a massively parallel system of distributed but interconnected components. There is no flow of data from input to processing to output; the brain doesn’t even make clear distinctions between processing and input/output.  The IP model has obvious problems, but it’s not so easily dismissed. According to a classic saying in science, “all models are wrong, but some models are useful.” A newer version makes the distinction clearer: “Models have no truth value, but some models are useful.” Models and theories are like maps: they could be inaccurate or outdated, but they could never be true, because their whole purpose is to represent reality at some level of abstraction and generalization. The test of a good map, or a good theory, is whether it improves our understanding. So, what does the IP model teach us?  The brain isn’t built like a computer, but it could function like a computer: via algorithms (processing) on abstract representations (data/information). This is the secret to the IP model’s persistence and usefulness, across decades of research and popular culture: it’s hardware-independent. If any system can execute algorithms, it can process information—regardless of whether its hardware is silicon, neurons, or Charles Babbage’s clockwork gears. If humans and computers can execute any algorithm (i.e. run any program), the IP model says we’re all functionally equivalent computing devices, no matter our hardware or wetware.  The IP model allows us to describe the brain as a computing device, but that description is still, by far, not the best one. The IP model has brought us decades of progress in neuroscience, and fictional ideas ranging from brain hacking, to humans uploaded to virtual worlds, and artificial intelligences downloaded over human minds. But the more we learn about the brain, the more poorly the IP model fits the evidence. Models have no truth value, so it’s become something worse than wrong: it’s misleading.  The road of “brain as computation” is fraught with peril and blind alleys. If you squint at the brain, study it with just the right amount of abstraction, you can describe it as executing algorithms on data. The brain is hardware, its function is software. But why, then, do we thinking creatures devote so much neural hardware to the motion-timing cerebellum? There’s no good answer, if you think of the brain as algorithms and software.  If we want a better framework, how else can we think about the brain? We can start by dialing down the level of abstraction. The human brain has the potential to accomplish nearly anything, but we rarely sit around executing perfect algorithms. Instead, our everyday lives are riddled with habits, biases, and imperfect decisions. We eat that slice of cake, even though we know we shouldn’t. We read one more article on the Internet, even though we should be going to sleep. Human beings require great training to become adept at logic and mathematics, but even then, our decisions remain riddled with biases and errors. Our supposedly-universal brains aren’t equally good at everything; many of our capabilities come from sloppy and unreliable kludges. What did the brain evolve to accomplish, versus what’s been hacked and bootstrapped atop that core function?  All evidence points toward the brain having one core function, one purpose that drove its evolution: movement.  Sometimes, cognition and movement are inseparable: movement planning and cognitive decision-making are so deeply interconnected, moral uncertainty can introduce movement uncertainty. More often, our often-shoddy “advanced” capabilities are built atop a solid foundation of movement systems. Conscious memory is an unreliable reconstruction, but movement and skill memory can last for years, exactly like riding a bike. Many optical illusions highlight the makeshift pliability of conscious perception because they reveal a division between vision-for-perception and vision-for-action.  The distinction between these two forms of vision is subtle but critical. In the classic Ebbinghaus illusion shown below, the white circles make the blue circle on the right look larger. However, if you picked up those blue circles, your finger movements wouldn’t be fooled by the illusion. Like so many other places across the brain, we find higher-level conscious processes cobbled together atop more reliable sensory and movement systems.  The Ebbinghaus illusion. Movement is where the rubber hits the road of evolutionary fitness, the unavoidable step before the brain can affect survival and reproduction. All of the brain’s other wonderful functions exist to help design and choose the right movements of hand or leg or vocal folds. For any problem a human might encounter in the world, there could be a dozen ways to solve it through consciousness and emotion, memory and social coordination—but the back-end mechanism doesn’t matter unless you implement that solution through action, whether it’s throwing a spear, speaking a loving word, or typing on a keyboard.  This has two consequences for fiction, among those who strive for scientific plausibility. First, while brains and computers can produce similar effects, they work in completely different ways. Therefore, it will never be possible to upload one into the other, no more than you could upload a cheetah into a car just because they both move fast. Second, no artificially-created entity would think, function, or make the same mistakes as a human. The human brain is not a designed brain, and that distinction pervades every facet of our minds and experiences. Optical illusions and cognitive biases are not just random errors, but kludges with purpose, to produce fast and reasonably-accurate behavior under the limits imposed by the competing pressures of evolution.  Once we embrace the brain’s evolutionary context, and understand movement as the brain’s primary purpose, we can easily answer the problem of the cerebellum. Dr. Marcus thought “no overarching theory” could predict that the cerebellum contains half of the brain’s neurons; yet from a movement control perspective, this makes perfect sense. The cerebellum handles movement timing and refinement by predicting the consequences of our own actions before they even begin. This is critical for skillful action, because it lets us identify and correct errors much faster than we could if we had to wait until the errors became visible. However, as you might imagine, predicting the whole body—bones, muscles, spinal cord, and more—is a difficult problem. From a movement control perspective, the brain must commit so many neurons to cerebellar machinery.  This new approach lets us reinterpret the functioning of the entire brain, the role played by every region and system. In 2007, the Canadian neuroscientist Paul Cisek proposed a framework called the “Affordance Competition Hypothesis. According to this theory, the whole brain is involved in planning and selecting movements. Sensory and movement areas of the brain identify action opportunities (“affordances”) provided by the world, and the rest of the brain uses a symphony of knowledge and motivation to select between these possible actions.   Researchers have observed the affordance competition process directly, via electrodes implanted in monkeys’ brains to eavesdrop on their neural activity. If you put the monkey in an ambiguous situation, where it knows “Movement A or Movement B might provide some tasty juice,” action-planning neurons generate patterns to drive both Movement A and Movement B. When you clarify the situation by saying “definitely going to be A,” the Movement B pattern dies out, while the Movement A pattern strengthens until it’s ready to trigger nerves, muscles, and action. In other words, before any movement occurs, the brain prepares multiple actions, and holds them in tension until it can settle the choice.  If the whole brain is best understood as a machine to plan and select movements, what does that imply for those of us who spend our waking hours thinking, writing, and storytelling? A movement machine has plenty of room for higher-level functions. Cognition, logic, empathy, language; these all help us identify and choose the right action, in ever more sophisticated ways. But these aren’t algorithms manipulating information; they’re extensions of movement planning mechanisms that arose across countless generations of evolution.  The IP model abstracted the brain to a vision of algorithms and software. But the brain is so much more than an abstraction, even if it can sometimes fake a universal computational device. Despite common knowledge and outdated science, we do have an integrative theory of neuroscience, one that explains our data and deepens our understanding. The human brain is a purposed machine, the product of our evolutionary history as creatures who have thrived by acting swiftly, intelligently, and together.  Benjamin C. Kinney is a SFF writer and neuroscientist whose short stories have appeared in Strange Horizons, PodCastle, Flash Fiction Online, and more. Under the threadbare cloak of his legal name, he's on faculty at Washington University in St. Louis, where he teaches neuroscience and performs research with peripheral nerve injury patients. He tries to live the most science fictional life possible, which has thus far led him to build cyborg monkeys, zap human brains with high-power magnetic fields, and send his wife to Mars. You can follow him on twitter at @BenCKinney.", "text": "Non-Fiction\nThe Evolved Brain\nIn 2014, the psychologist Gary Marcus from New York University gathered a book of essays by the world’s leading neuroscientists, including multiple Nobel prize winners. From this experience, he drew one main lesson: we have no unifying idea about how the brain works.\nHowever, Dr. Marcus and his essayists missed something. We comprehend much more than they think, and a unified understanding of the brain can guide our thinking, and our fiction, about the human brain and mind.\nAccording to Dr. Marcus, biology is a riot of complexity, devoid of the mathematical elegance and simplicity that can arise in physics. Neuroscience is perversely resistant to theory: “No overarching theory of neuroscience could predict, for example, that the cerebellum (which is involved in timing and motor control) would have vastly more neurons than the prefrontal cortex (the part of the brain most associated with our advanced intelligence).”\nOur knowledge about the brain dwarfs our understanding of how the brain works. Modern neuroscience began in 1888, when a Spanish artist-turned-physician named Santiago Ramón y Cajal proved that the nervous system was made of cells we now call neurons. In the nearly 130 years since then, scientists have collected a vast trove of data about the brain, culminating in at least 100,000 peer-reviewed scholarly articles in 2015. But data alone cannot explain anything: in any field of science, one of the hardest parts is sifting through messy data to draw conclusions and interpretations. To integrate information into understanding, we need a theory of the brain.\nA good theory would not only account for what we observe, but provide some insight into why the brain might be organized this way. To continue with Dr. Marcus’ example, the cerebellum contains half of the brain’s total neurons, devoted to movement timing and refinement. This flies in the face of our natural assumptions about the role and value of humanity itself. What is the brain doing, if not intelligence and planning? If we can’t explain half of the brain’s components, our understanding must be seriously deficient. And, indeed, our old ideas of the brain—both commonsense and scientific—break down in many ways.\nForemost among these old ideas is the information processing (IP) model, which has served as our dominant explanation for brain function since the 1950’s. In its most well-known form, the IP model says the brain is a computer. On the most literal level, this is obviously false: unlike any device we’d recognize as a modern computer, the brain is a massively parallel system of distributed but interconnected components. There is no flow of data from input to processing to output; the brain doesn’t even make clear distinctions between processing and input/output.\nThe IP model has obvious problems, but it’s not so easily dismissed. According to a classic saying in science, “all models are wrong, but some models are useful.” A newer version makes the distinction clearer: “Models have no truth value, but some models are useful.” Models and theories are like maps: they could be inaccurate or outdated, but they could never be true, because their whole purpose is to represent reality at some level of abstraction and generalization. The test of a good map, or a good theory, is whether it improves our understanding. So, what does the IP model teach us?\nThe brain isn’t built like a computer, but it could function like a computer: via algorithms (processing) on abstract representations (data/information). This is the secret to the IP model’s persistence and usefulness, across decades of research and popular culture: it’s hardware-independent. If any system can execute algorithms, it can process information—regardless of whether its hardware is silicon, neurons, or Charles Babbage’s clockwork gears. If humans and computers can execute any algorithm (i.e. run any program), the IP model says we’re all functionally equivalent computing devices, no matter our hardware or wetware.\nThe IP model allows us to describe the brain as a computing device, but that description is still, by far, not the best one. The IP model has brought us decades of progress in neuroscience, and fictional ideas ranging from brain hacking, to humans uploaded to virtual worlds, and artificial intelligences downloaded over human minds. But the more we learn about the brain, the more poorly the IP model fits the evidence. Models have no truth value, so it’s become something worse than wrong: it’s misleading.\nThe road of “brain as computation” is fraught with peril and blind alleys. If you squint at the brain, study it with just the right amount of abstraction, you can describe it as executing algorithms on data. The brain is hardware, its function is software. But why, then, do we thinking creatures devote so much neural hardware to the motion-timing cerebellum? There’s no good answer, if you think of the brain as algorithms and software.\nIf we want a better framework, how else can we think about the brain? We can start by dialing down the level of abstraction. The human brain has the potential to accomplish nearly anything, but we rarely sit around executing perfect algorithms. Instead, our everyday lives are riddled with habits, biases, and imperfect decisions. We eat that slice of cake, even though we know we shouldn’t. We read one more article on the Internet, even though we should be going to sleep. Human beings require great training to become adept at logic and mathematics, but even then, our decisions remain riddled with biases and errors. Our supposedly-universal brains aren’t equally good at everything; many of our capabilities come from sloppy and unreliable kludges. What did the brain evolve to accomplish, versus what’s been hacked and bootstrapped atop that core function?\nAll evidence points toward the brain having one core function, one purpose that drove its evolution: movement.\nSometimes, cognition and movement are inseparable: movement planning and cognitive decision-making are so deeply interconnected, moral uncertainty can introduce movement uncertainty. More often, our often-shoddy “advanced” capabilities are built atop a solid foundation of movement systems. Conscious memory is an unreliable reconstruction, but movement and skill memory can last for years, exactly like riding a bike. Many optical illusions highlight the makeshift pliability of conscious perception because they reveal a division between vision-for-perception and vision-for-action.\nThe distinction between these two forms of vision is subtle but critical. In the classic Ebbinghaus illusion shown below, the white circles make the blue circle on the right look larger. However, if you picked up those blue circles, your finger movements wouldn’t be fooled by the illusion. Like so many other places across the brain, we find higher-level conscious processes cobbled together atop more reliable sensory and movement systems.\nThe Ebbinghaus illusion.\nMovement is where the rubber hits the road of evolutionary fitness, the unavoidable step before the brain can affect survival and reproduction. All of the brain’s other wonderful functions exist to help design and choose the right movements of hand or leg or vocal folds. For any problem a human might encounter in the world, there could be a dozen ways to solve it through consciousness and emotion, memory and social coordination—but the back-end mechanism doesn’t matter unless you implement that solution through action, whether it’s throwing a spear, speaking a loving word, or typing on a keyboard.\nThis has two consequences for fiction, among those who strive for scientific plausibility. First, while brains and computers can produce similar effects, they work in completely different ways. Therefore, it will never be possible to upload one into the other, no more than you could upload a cheetah into a car just because they both move fast. Second, no artificially-created entity would think, function, or make the same mistakes as a human. The human brain is not a designed brain, and that distinction pervades every facet of our minds and experiences. Optical illusions and cognitive biases are not just random errors, but kludges with purpose, to produce fast and reasonably-accurate behavior under the limits imposed by the competing pressures of evolution.\nOnce we embrace the brain’s evolutionary context, and understand movement as the brain’s primary purpose, we can easily answer the problem of the cerebellum. Dr. Marcus thought “no overarching theory” could predict that the cerebellum contains half of the brain’s neurons; yet from a movement control perspective, this makes perfect sense. The cerebellum handles movement timing and refinement by predicting the consequences of our own actions before they even begin. This is critical for skillful action, because it lets us identify and correct errors much faster than we could if we had to wait until the errors became visible. However, as you might imagine, predicting the whole body—bones, muscles, spinal cord, and more—is a difficult problem. From a movement control perspective, the brain must commit so many neurons to cerebellar machinery.\nThis new approach lets us reinterpret the functioning of the entire brain, the role played by every region and system. In 2007, the Canadian neuroscientist Paul Cisek proposed a framework called the “Affordance Competition Hypothesis. According to this theory, the whole brain is involved in planning and selecting movements. Sensory and movement areas of the brain identify action opportunities (“affordances”) provided by the world, and the rest of the brain uses a symphony of knowledge and motivation to select between these possible actions.\nResearchers have observed the affordance competition process directly, via electrodes implanted in monkeys’ brains to eavesdrop on their neural activity. If you put the monkey in an ambiguous situation, where it knows “Movement A or Movement B might provide some tasty juice,” action-planning neurons generate patterns to drive both Movement A and Movement B. When you clarify the situation by saying “definitely going to be A,” the Movement B pattern dies out, while the Movement A pattern strengthens until it’s ready to trigger nerves, muscles, and action. In other words, before any movement occurs, the brain prepares multiple actions, and holds them in tension until it can settle the choice.\nIf the whole brain is best understood as a machine to plan and select movements, what does that imply for those of us who spend our waking hours thinking, writing, and storytelling? A movement machine has plenty of room for higher-level functions. Cognition, logic, empathy, language; these all help us identify and choose the right action, in ever more sophisticated ways. But these aren’t algorithms manipulating information; they’re extensions of movement planning mechanisms that arose across countless generations of evolution.\nThe IP model abstracted the brain to a vision of algorithms and software. But the brain is so much more than an abstraction, even if it can sometimes fake a universal computational device. Despite common knowledge and outdated science, we do have an integrative theory of neuroscience, one that explains our data and deepens our understanding. The human brain is a purposed machine, the product of our evolutionary history as creatures who have thrived by acting swiftly, intelligently, and together.\nBenjamin C. Kinney is a SFF writer and neuroscientist whose short stories have appeared in Strange Horizons, PodCastle, Flash Fiction Online, and more. Under the threadbare cloak of his legal name, he's on faculty at Washington University in St. Louis, where he teaches neuroscience and performs research with peripheral nerve injury patients. He tries to live the most science fictional life possible, which has thus far led him to build cyborg monkeys, zap human brains with high-power magnetic fields, and send his wife to Mars. You can follow him on twitter at @BenCKinney.", "source": "https://clarkesworldmagazine.com/kinney_01_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Evolved Brain by Benjamin C. Kinney"}