{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "X/tnQImaqOhrHo/xnPJyIhc+s54=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Your Mission  What put you on the path to being science fiction reader? For me, it was the gift of a few books from my cousin at age twelve. Up until then, my experience with science fiction was exclusively TV and movies. I had no idea what lay ahead or where that path would take me. Even through my thirties, the thought of being an active part of this field was a foreign concept.  I discovered just how much of a pay-it-forward mindset was ingrained into the editors and publishers with whom I talked. Everyone was more than happy to give their advice, fine with it being ignored, and a bit “oh you poor soul, welcome to the club.” I’ve tried to do the same with the hundreds of editors and authors that have approached me via email or at cons. It just seemed like a tradition worth keeping.  I don’t often talk about it, but my day job—for now—is in academia. I’ve worked in technology there for over twenty-seven years and for the bulk of that time, I’ve been on the front lines of integrating technology into the curriculum. In that role, I’ve worked closely with teachers and professors across a wide range of disciplines and at every grade level from pre-K on up. When you think about it, that community is also very much pay-it-forward. If you’ve ever returned to your old school or alma mater and thanked one of them for something they did that had an impact on you, you know that’s true. In that respect, they also take a very long-term view. Some of that has certainly rubbed off on me.  When my cousin gave me those books, I doubt he had any clue the impact it would have on my life. He thought I’d like them and that was enough. The end result is simply icing on the cake, a cake that wouldn’t exist without that initial effort. Now how about that person who put you on your SF path?  Okay, Neil, where are you going with this?  It’s November, which means Thanksgiving is almost upon us here in the U.S. As a means of giving thanks to those that put us on our course, I suggest that we all pay-it-forward. Last year, I came across donorschoose.org. Think of it like Kickstarter for the classroom. A teacher posts what they would like to do in their classroom and people like us donate money to help make it happen.  When I’m there, I like to support projects that include science fiction literature in middle school—the age I started at—in high poverty areas. If it has the long term result of bringing some of these kids into the field, that would be that aforementioned icing. I’m hoping they’ll enjoy reading these books with a teacher that clearly cares about them. I’m hoping it makes them happy.  So, this Thanksgiving, join me and go to donorschoose.org. Find some kids to make happy in honor of the person who did the same for you. You’re mission, should you choose to accept it, is to pay-it-forward. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Your Mission\nWhat put you on the path to being science fiction reader? For me, it was the gift of a few books from my cousin at age twelve. Up until then, my experience with science fiction was exclusively TV and movies. I had no idea what lay ahead or where that path would take me. Even through my thirties, the thought of being an active part of this field was a foreign concept.\nI discovered just how much of a pay-it-forward mindset was ingrained into the editors and publishers with whom I talked. Everyone was more than happy to give their advice, fine with it being ignored, and a bit “oh you poor soul, welcome to the club.” I’ve tried to do the same with the hundreds of editors and authors that have approached me via email or at cons. It just seemed like a tradition worth keeping.\nI don’t often talk about it, but my day job—for now—is in academia. I’ve worked in technology there for over twenty-seven years and for the bulk of that time, I’ve been on the front lines of integrating technology into the curriculum. In that role, I’ve worked closely with teachers and professors across a wide range of disciplines and at every grade level from pre-K on up. When you think about it, that community is also very much pay-it-forward. If you’ve ever returned to your old school or alma mater and thanked one of them for something they did that had an impact on you, you know that’s true. In that respect, they also take a very long-term view. Some of that has certainly rubbed off on me.\nWhen my cousin gave me those books, I doubt he had any clue the impact it would have on my life. He thought I’d like them and that was enough. The end result is simply icing on the cake, a cake that wouldn’t exist without that initial effort. Now how about that person who put you on your SF path?\nOkay, Neil, where are you going with this?\nIt’s November, which means Thanksgiving is almost upon us here in the U.S. As a means of giving thanks to those that put us on our course, I suggest that we all pay-it-forward. Last year, I came across donorschoose.org. Think of it like Kickstarter for the classroom. A teacher posts what they would like to do in their classroom and people like us donate money to help make it happen.\nWhen I’m there, I like to support projects that include science fiction literature in middle school—the age I started at—in high poverty areas. If it has the long term result of bringing some of these kids into the field, that would be that aforementioned icing. I’m hoping they’ll enjoy reading these books with a teacher that clearly cares about them. I’m hoping it makes them happy.\nSo, this Thanksgiving, join me and go to donorschoose.org. Find some kids to make happy in honor of the person who did the same for you. You’re mission, should you choose to accept it, is to pay-it-forward.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_11_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Your Mission by Neil Clarke"}