{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Julie Nováková", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VayAq9wouD2J2peYYGe/4Y/QbDw=", "id": null, "license": null, "comments": "", "raw_text": "4920 words, short story  Deep Down in the Cloud  “What is there more sublime than the trackless, desert, all-surrounding, unfathomable sea? What is there more peacefully sublime than the calm, gently-heaving, silent sea? What is there more terribly sublime than the angry, dashing, foaming sea?” Floating freely in the dark cold water, Mariana had lost her sense of direction. Suddenly a flash from somewhere (above? where was above?) illuminated the whole ocean, and in that instant, she could see a school of grunions swimming past: hundreds of silvery gleaming bodies together in a mass so alien and intimidating. So beautiful. Light reflecting off their sleek bodies and silver-lined black eyes.  The darkness returned, but it didn’t feel the same. She could feel the hundreds of eyes watching her. Irrational, yes. But this moment was beyond rationality.  Another lightning strike somewhere far away revealed a peculiar sight.  Chubs? she thought with an unnatural calm. How strange. Must be the storm . . .  However, still no sign of other people.  When the next lightning bolt lit up the murky waters a moment later, she glimpsed something else. She knew she ought to feel dread, fear, panic.  But she was far beyond that too.  “Ready?”  “Ready.”  “Ready,” echoed a second voice, and the three divers submerged together.  As soon as she entered water, Mariana Aguayro ceased feeling anxious. She was in her element. No matter what happens next, she’s where she belongs; and she had trained for what happens next.  It was difficult to tell whether the same applied to Hector Hodges beside her. Even though the full-face mask offered a better view of his face than usual diving masks, she could only imagine how he was feeling. In her imagination, however, he was still as nervous as on their way here.  Iku was already ahead of them, holding his sea scooter like it was a part of his own body. If she felt in her element here, he seemed born in the ocean.  They continued in silence. No need to speak, even if the transceivers would allow them to. They could view speaking as a security risk even here, still far from their destination. The fish-like scooters carried them forward. They could take a moment’s rest for now. Mariana knew they’d need it.  Even though they were not descending yet and it was early, light faded quickly around them. Mariana thought of the darkening skies above. No sane person would go for recreational diving today. They remained alone but for a few by-the-wind sailors above, and some moon jellyfish. The storm was coming. For them, it was ideal.  Iku turned and signaled “down.” She and Hector copied.  The waters grew murkier as they descended slowly. Usually, the visibility would be good. But today, the currents were disturbed by the approaching storm. The water was considerably colder than usual at this time of the year. Mariana could still see Iku’s silhouette beneath, but visibility was dropping quickly.  Finally, she glimpsed the bottom, or at least she thought so. On the sandy shelf, there was no reef to look for, nothing to use as a beacon. Her dive computer showed the depth of 110 feet, same as the analog depth gauge she had refused to leave home.  Upon reaching the bottom, Iku signaled for them to stop. Mariana’s heart skipped a beat.  It’s here. We’re really doing it. Just as we practiced.  It was time to leave the scooters and anchor them here, where they could find them on their return trip. If there is one. Even in the murky shade, Mariana saw the fear in Hector’s eyes. In contrast, Iku’s face was almost serene. She imagined hers full of anticipation.  We’re going to free freedom itself.  “Let’s go,” Iku gestured.  Hug the bottom. Kick ever so slowly. The rhythm we finally got right last week.  A week ago, at the same depth, but in clear water on a sunlit day tens of miles away from here, Mariana was trying to pass as a fish. She could see Hector swimming some ten feet from her. Iku floated somewhere overhead, monitoring them as always.  Hug the bottom. Go slowly. Use the add-ons on the suit to simulate fish movement, she recited in her mind. She should probably feel nervous. But being underwater always had a strangely calming effect on her. Hearing your breath, the pounding of your heart, and the ocean surrounding you, while you moved freely in its soothing cold embrace . . . Sometimes she wished she could stay.  “There wouldn’t be any motion detectors on the bottom,” Iku had said to them earlier. “Too many things would set them off. They would rather rely on autonomous guard bots, a few ROVs and aquamesh around the site.”  Hugging the bottom therefore seemed to be a good approach strategy, and Iku provided the rest.  Now they reached the improvised aquamesh: just a fishing net in this case, no fiber-optics. When Iku gave the signal, Mariana and Hector started cutting through it.  He was faster than she this time, having improved a lot. Mariana got used to the full-face mask and closed cycle rebreather already in their first test dive. Hector had a little trouble adjusting to the mask, but he too was an experienced diver and now he seemed just as accustomed to the equipment.  Going through, she signaled and went first.  She saw the outline of their target in the silty waters. Suddenly, a shock wave hurled her onto the bottom and made her earbuds ache. She was scared and disoriented . . . for a few seconds. Then she kicked fast toward where she thought the target was. She couldn’t see a thing through the upraised mud. We should have thermal, occurred to her. She wasn’t sure any thermovision mask even existed, but Iku apparently had access to a lot of gear she hadn’t known about.  Hector was beside her in another second. They reached the target, pulled the waterproof Taus and cords and got to work in perfect sync. The screens shone bright in this dim bottom world.  “Incoming,” Iku’s voice sounded suddenly in their ears. Mariana turned around to intercept the danger and readied her underwater gun. But nothing happened. Then Hector announced: “Got it.”  The timer showed eighteen minutes, ten seconds. Best result so far.  A diver silhouette approached.  Ready, Iku signaled. Up.  When they were ashore and stripping from the diving gear, Mariana felt oddly elevated. We did it. We’re well under the limit. It really can be done!  But the greatest news was yet to come.  “There could be severe storms coming next week,” Iku announced as he closed the trunk with all the gear and stood by his car, an inconspicuous older wagon. “The timing is ideal. Augur will be conducting some site reliability tests elsewhere. Their guard will be high, but it always is, and they would be more vulnerable at the same time. Be prepared. The next time, we go live.”  It was exhilarating to hear that. Next time, it’s real. They’re gonna rob and sabotage an Augur datacenter.  In the wake of their successful dive and Iku’s announcement, they had made a mistake. Mariana would usually take a bus back to LA; after all, Iku had all the diving gear, she didn’t need to carry anything. But Hector had offered to drive her home.  “He’s being too paranoid,” he waved off Iku’s earlier advice. (Do not ride together. Do not call each other. Do not let your paths cross any more than they would before you had met.). “And he’s not here. Are you going to wait an hour for your bus, or be back in LA at that time?”  It wouldn’t hurt to get home earlier . . .  They spent the whole ride talking. It seemed like a mere moment when he stopped before her home.  “Wanna come upstairs for a drink?” she said on an impulse. Hector wasn’t her usual type. She wasn’t into older guys and typically avoided anyone from IT, if mostly for professional reasons, but the excitement of their dive and the upcoming op must have clouded her judgment. The fact that they had shared a secret from the rest of the world may have played a role.  He stayed for several hours. But when she said “you should go,” he just nodded and left. They didn’t see each other again up until this morning, after Iku had called them. It was time.  She couldn’t quite shake off the disturbing sensation that Iku somehow knew.  Hector was the first to notice the bots. Above, he gestured.  The AUVs were circling the perimeter in quasi-random patterns. They patrolled for unusual motion, light, heat signatures, sound, or transmissions. Though Mariana knew about them, her heart still skipped a beat when she saw that one was nearing her position.  Calm down and swim. This was to be expected.  The AUVs continued on their way.  The style they’d practiced seemed to pay off. They had passed as fish.  Then she saw what they were looking for. The mesh.  The real danger would only lie beyond that—if they managed to get through.  Mariana glanced at Iku, or rather tried to, but she couldn’t see him. The silt whirled beneath them and decreased visibility even further.  But something changed. She glimpsed movement. Silvery glint. Eyes. So many . . .  Pacific mackerel, she thought.  It didn’t stop with them.  So he did it; Iku released a batch of pheromones to lure the fish. The schools would provide more cover for them while they try to get through the mesh.  Iku went first, followed by the fish like some strange pied piper.  A sudden if feeble flash of light illuminated even these murky depths for a fraction. The storm above had started.  It would disturb the fish. It would also disturb the AUVs and sensor nets. Motion, thermals, sonar echo—all would be obscured. A lot of unusual activity just might pass unnoticed in a storm . . .  Iku approached the mesh. Mariana waited while he began attaching long stretches of optical fiber to the mesh. Then she saw the signal. She swam toward him and began cutting through the fiber-optic mesh, while Hector approached from another side. Another lightning struck somewhere above.  The final cut. Nothing visibly changed. No dazzler blinded them; no sound weapon thrust them away; no AUVs approached.  They swam through. Shapes began emerging from the mist-like whirling silt. Their ghostly glow felt otherworldly. There was something surreal about the server boxes and glowing displays down here: a true snippet of another world.  How did I ever end up here? Mariana wondered.  Mariana Aguayro sometimes wondered how their lives would turn out if the Sun didn’t misbehave. Just one peculiar cycle of increased solar activity. It was enough to first render billions of investments in satellite communications lost, and to make other such ventures too risky for another decade; and they could count themselves lucky that the storms only caused occasional blackouts.  Cables always held most traffic, but Internet giants promised free worldwide web connection for anyone on the planet. High-speed satellite connection in the furthermost, poorest village on Earth; it was too good to last. It almost hadn’t even started before the unprecedented solar storms fried most satellites, high-altitude balloons, and many land facilities too. Solely dependent on cable connections, with the corporations shaken badly and world politics already in disarray, it was a recipe for a slow plunge into unobtrusive dystopia.  If it didn’t happen, I may have gone to college.  If it didn’t happen, we wouldn’t have access outages for days.  If it didn’t happen, we might not have lost our freedoms so easily.  She remembered net neutrality, constant quick access to information, and reliable communication from her childhood. Chatting with friends online without worrying about the price or whether the messages would get through at all. Browsing encyclopedias and magazines without end. No outages lasting over an hour. Sometimes it made her feel old, despite not being even in her thirties.  She also remembered a semblance of privacy. Yes, people willingly, if unwittingly granted access to highly personal information to any stupid app, but there was at least a pretense of legal protection, at least some hope that individuals could persist against governments and corporations . . .  This, too, had been taken away, with the help of Augur.  Maybe that’s why Mariana liked diving so much. The fish, corals, and crustaceans didn’t care for human skirmishes. She could escape into their world, but even there, she would see the discomforting signs of human presence above. Little had been done to keep the oceans clean. Even down there, in her dream world, Mariana could not avoid getting angry.  So she’d started rebelling. Tiny steps, at first. Then she’d gotten more daring.  Being a hacker was nothing like in the movies she’d watched—and downloaded, impossible now—as a kid. But it was exhilarating nonetheless when she and the fission-fusion crews sometimes succeeded after weeks or months of dull work. Her life became a series of mood swings, and at times she also wondered whether it would have been so, had she been let to live a normal life.  She didn’t know how Iku found her.  He sat next to her one day on the beach, an inconspicuous black man of slender build and indeterminate age, and told her without any fuss that he wanted to hire her for a special job. One that involved both her computer hacking and diving expertise.  She could have said no. She didn’t know the stranger at all, nor did he mention having any contacts in common.  But it sounded like the kind of offer you cannot refuse.  She was just a few kicks away from the first server when the world broke.  First, there was light.  A bright flash blinded her for a moment, and a staccato of bright beams followed. No time to think about that. No time to prepare for the sound.  It threw her away like a punch in the chest. Her limbs flailed around her. She felt as if air was knocked out of her lungs. Her chest and stomach hurt badly. She couldn’t breathe. And the lights were still there, burying themselves into her skull . . .  Dazzlers and an ultrasonic pulse, some calculating part of her mind said. Shouldn’t cause permanent damage, only stun or injure. Get it together.  She kicked away before another cavitation could hit her. Only then she turned and looked back, grasping the underwater gun on her belt, though wary of using it.  But it was no longer necessary.  “Disabled it,” Iku’s voice sounded in her ears for the first time during the dive. Stealth didn’t matter anymore, and they would need to use the transceivers soon anyway.  She looked around. “Hector?”  She didn’t see him. Nor did she hear any reply. She was about to call him again, when Iku spoke: “He’s alive.”  Something in his tone made her shiver inwardly.  Iku moved smoothly, shark-like, toward a dark silhouette barely visible in the silt. She glimpsed him link his suit’s computer to Hector’s. As she swam nearer, she could see him activate the adrenaline pump in Hector’s suit.  The dark silhouette moved, and Mariana heard a sharp intake of breath in the comms. “W-what happened?”  “Dazzler and cavitation,” Iku said. “You’ll come to. Let’s do it.”  Mariana would have liked to see whether Hector was okay, but Iku was right; there was little time. They had to get in, and Hector Hodges, a disgruntled former Augur employee wishing to take revenge accompanied ideally by large sums of money, was necessary to manage it quickly.  The servers were just two dozen feet away. This near, AUVs wouldn’t use sonic pulses to knock them out; too much risk for the equipment.  Hector and Mariana got to work on one rack, Iku moved to another.  “You all right?” she asked Hector quietly, mask to mask; no need for Iku to overhear.  “Think so,” he spoke. Even in these conditions, she could hear his strained breath.  Broken ribs? Internal bleeding? she thought of the risks of cavitation. It was by no means a non-life-threatening weapon. Down here, every injury counted more.  The firewall held fast, but Mariana tried a few new exploits, while Hector worked his angle.  Still nothing . . . Would they have to use plan B and just DDoS Augur without making use of any of the data stored here?  Mariana glanced at her computer. At this rate, she had an hour of resurfacing to look for. An hour within which anything could go wrong.  “We’re there,” Hector said.  Mariana’s heart skipped a beat.  We’re really there. Inside Augur’s heart . . . about to seize it and tear it out.  She just sent an invite to a feast on the company’s internal files to a dozen informal hacker groups; most of them hopelessly idealistic anarchists, some strategically chosen groups that were in for money or mainstream politics, which translated to money anyway.  Her head almost spun.  For a second, she was tempted to look up Iku, regardless of whether the alias had any ties to his real self. Who, or what . . . But no—there was no time to waste.  Now to erasing the user metadata, and all the surveillance we can . . . To watch the watchmen for once. To free ourselves before they load the backups—but others will be ready for that. Let it run another half an hour, please, and then we can have a DDoS as a cherry atop the cake.  There was still a chance that Augur noticed only now what they were doing and couldn’t get in touch with its AUVs here because of the storm.  But the storm would also complicate their ascent. They’d all realized the possibility they’d become martyrs, but none wanted to reconcile with that. Not without a fight.  “Iku?” she spoke.  No answer.  “Can’t resurface now,” Hector pointed above. Even at this depth, they could see the lightning flashes. Even through the transceiver connection, Mariana heard the strain in his voice. Hold on. We’ll help you ascend, she thought. But where was Iku? She decided to find out and kicked slowly. Even moving this carefully, she almost caused a silt out. That’s why she didn’t see what happened next.  She was already at the further rack, and only heard the gasp and ragged, muffled breaths. She turned back, but another shape shot forward alongside her: Iku. She’d never think a diver could move so fast and smoothly, truly like a fish.  Hector’s body was jerking as if electrocuted. Mariana glimpsed some strange, ghostlike shape around him in the light of her LED torch, and realized that he was being electrocuted.  But Iku was already there, grasping the thing she could barely see, and pulling it away from Hector.  The battle resembled a surreal ballet: a diver against a barely visible translucent shape, swirling and writhing amidst silt. It was entrancing. The Finnish Kalevala myth came to Mariana’s mind, because Iku Turso in this instant truly resembled some kind of ancient sea monster like his namesake in the epic: sometimes depicted as a horned creature, sometimes a sea serpent, sometimes octopus-like, but always, always deadly.  The translucent robot sank to the bottom gently.  Iku turned to Mariana. “What are you waiting for?”  She wasn’t checking her Tau; she was checking Hector.  He was alive.  But even without glancing at his computer, Mariana knew he wasn’t going to make it. His suit was inflating visibly, and he started ascending. His face was constricted with pain. He was still conscious, and very much aware that this was just a brief period before certain death.  I’m so sorry, she thought.  “He was electroshocked,” Iku said on the transceiver. “Invisible robot creeps near you, pierces your skin with electrodes, shocks you, and doesn’t threaten nearby devices. Didn’t know they were in use already.”  Sizzling rage got ahold of Mariana. Hector was dying, and Iku was reciting his knowledge of the damn robot that killed him!  “What do we do?” she somehow made her voice sound measured.  “We continue our work.”  “No!”  “Yesss,” Hector hissed through the pain. His gaze met with Mariana’s. They were almost mask to mask. The eerie glow of the underwater servers made his face appear ghostlike. She was looking at it, and so didn’t see him pull a knife from his belt and cut at his own drysuit.  The inflation stopped, and then reversed. Mariana took a split-second to realize what he’d done. The stupid fool! He flooded his own suit to stop it from inflating. He’d never be able to ascend, even if he got rid of all the weights at once, and he’d get hypothermic in the matter of minutes.  “I’ll take care of it,” he managed to say. “You get out. They . . . seem to know.”  “Continue data transfer while you can,” Iku instructed him, and signaled to Mariana to follow him. She lingered for a second, put her mask to Hector’s and turned off her transceiver for a moment. Only then did she realize she had absolutely no idea what to say.  He solved it for her. “Goodbye, sweet girl,” he struggled to speak, but somehow he managed for the words to sound soft. “Go.”  Iku was circling the center, and Mariana noticed he was planting something in semi-regular intervals. She swam to it.  Charges.  Iku waited for her at the far end of the datacenter and signaled to leave.  “Explain first!” she spoke regardless of knowing that Hector will likely hear it. He had the right to know.  “Destroying the center will set Augur back many months, if not years. Time for us to act.”  It made sense, she knew it. Just . . . leaving Hector behind, even if the best he could hope in otherwise would be surviving the hypoxia or a stroke after rapid ascent, if they could somehow get him out of his suit and share their air with him . . . No. Hector Hodges was gone and knew it very well.  “What did you really want to gain from this?!” she said.  Iku’s lips moved as if in silent prayer. His face, illuminated by the datacenter’s glow, looked inhuman, almost demonic.  “What anyone wants,” he whispered. “Freedom.”  “Who do you think our Iku really is?” Hector had said back during their ride home.  “What do you mean?”  “The equipment he got us, his knowledge of the facility . . . I think he’s a frogman.”  “Ours, or someone else’s?”  Hector laughed quietly. “That’s what I’m wondering too.”  “He could just be Augur’s. Don’t they have their own frogmen? Military-grade stuff?”  “I guess so. I even heard some rumors about . . . enhanced soldiers. But I’d think they watch theirs more carefully.”  “Like they watch you?” Mariana raised a brow.  Hector seemed unperturbed. “That’s different. I’m unimportant.”  Mariana didn’t question that; they both were. Was Iku too?  “Someone has to clean the facility,” she spoke finally. “Biofouling can be a problem after less than a year down below. Not speaking of tech maintenance.”  “Iku isn’t an IT crowd guy.”  “I never said he was. He could have posed as one.”  “I dunno.” Hector shrugged. “Something seems . . . off about him to me. Can’t explain it.”  Mariana snorted, but it was just a facade; in fact, she felt the same about Iku.  “There must be a lot of people outside our scope of abilities,” Hector continued. “Not just the H+ nerds who implant magnets into their fingers and bloody Fitbits under the skin. I mean gene-modded people, or laced, or fitted with optogenetic circuits, enhanced senses, strength . . . Don’t you think someone must have tried that already?”  “Perhaps,” she said evasively. She didn’t like to think of how she only saw the surface layer of the world, and how much might be going on underneath, concealed by Augur and others like them. It led to paranoid thinking, and she saw enough of that in her mother to know that she wanted to avoid that at any cost.  She was glad when Hector changed the topic and resumed flirting with her.  “Freedom?” she said once they were nearing the aquamesh. “From what?”  Iku didn’t answer. She could think of a thousand options, but recalled her conversation with Hector back in the car all too vividly. But maybe she just felt guilty about Hector.  They began making another hole in the mesh; the first site was likely compromised.  “From my creators and controllers,” Iku spoke suddenly. “Everyone will know now.”  She wanted to ask more, but then there was light.  Something pushed her aside—no, someone, it was Iku—and after that she was pushed into the bottom with considerable force.  “Go—” she heard Iku, but his voice was cut out.  Silt was everywhere.  And then all was darkness.  “Where are the bones, the relics, of the brave and the timid, the good and the bad, the parent, the child, the wife, the husband, the brother, the sister, the lover, which have been tossed and scattered and buried by the washing, wasting, wandering sea?”  . . .and they dug tunnels in the silt and mud, bore into the bottom like worms. Blind, constrained, deaf but for the sound of their breath.  She soothed herself with this image from the past.  As a child, Mariana had loved stories of her underwater heroes. Cousteau and his diving saucer sub. Franzén and his men, excavating the Vasa from her infamous grave in the Stockholm harbor. In the decades after she sank in 1628, pioneer divers submerged into the 32-m depth in bells filled with air to excavate some of the treasures the ship had carried. Then, she lay forgotten and silt buried her, until amateur marine archeologist Franzén found her again. To un-sink the ship, they had to dig tunnels beneath her to secure her, and tow her into the harbor.  Mariana remembered the story now, as she clawed her way desperately through the silty bottom. She didn’t know how long she’d been out, since she had no way to look at her dive computer, but hopefully she only lost consciousness for a few seconds. She couldn’t have been buried deep, nothing could do that; but was she trying in the right direction? Fear almost got ahold of her.  Finally, she felt little resistance.  She emerged from a silt grave into pitch dark waters.  “Iku?” she tried.  Only silence answered her.  She assessed the damage. Her torch was lost, her rebreather got damaged, her trimix would soon run out, and she was still lucid enough to realize she was hypothermic. Her computer was broken, and she lost track of time.  So she did the only thing she could: started ascending as fast as she dared.  Another bright flash of lightning somewhere above. The lone chub, normally a river fish, was swimming desperately in this unwelcoming strange place. Mariana just floated with current. She started feeling strangely elated. Hypoxia? Or just cold? she could still guess.  A flash revealed a school of sardines gazing at her with a thousand little eyes.  Big brother watches you, she mused. Even here. Did we change anything?  Lightning—and the briefest of glimpses of a dreadful shape. The strange mask and suit . . .  Frogman. Augur’s. Who else?  They were fast, or perhaps there were more secrets she knew nothing about . . . She realized she ought to feel dread, fear, panic. But she was just cold and tired.  Maybe they didn’t win. But they didn’t exactly lose, either.  A series of lightning bolts. The ominous figure, strobing toward her like in a stop-motion movie. And behind it—  Iku-Turso, son of Old-age, ocean monster, Mariana recalled dreamily the verses she’d looked up in the library.  In the murky ocean, illuminated only by lightnings further away now, she watched the strange battle unfold like a magic lantern projection. How beautiful, her mind marveled. Years ago, she’d seen the black jellyfish. It was huge, unearthly, menacing, infinitely elegant. Mariana had almost forgotten to breathe. Dread had seized her. She had only been wearing a spring suit, and the thought of the giant jellyfish stinging her had almost paralyzed her. But her sense of wonder had eventually won. She’d been captivated by the alien motion of the creature and its colors—a whole palette of purple, green, black, scarlet, and more colors as the light changed. It didn’t look like an animal at all.  Neither did those two struggling monsters look human.  Who are you, Iku? Mariana mused.  Suddenly, the dark waters turned even darker, as if ink had spilled in the sea. She realized it was blood.  The remaining figure swam closer to her.  “Thank you,” she heard in her transceiver, and that was it. “Now we’re even.”  Later, hard to say how much, she suddenly felt sand beneath her fins, and the next wave threw her ashore. There was no one else.  Mariana gasped and tore off her mask. She hungrily took in a breath of fresh cold air. Then she looked at the raging skies and around the shore, where she saw no artificial lights. She had no idea where she was.  She’d get rid of the suit. She would start walking. She’d try to make it somewhere dry without collapsing. If anyone asked, she’d make some excuse of getting lost in the storm, and give a fake name. Only then would she go online, if possible, and try to find out what they did.  Perhaps, just perhaps, she just emerged on the shore of a different world.  Author’s note: The quotations come from “Poetry and Mystery of The Sea,” as referred to by Edward Howland in “Ocean’s Story; or Triumphs of Thirty Centuries” (1873). Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "text": "4920 words, short story\nDeep Down in the Cloud\n“What is there more sublime than the trackless,\ndesert, all-surrounding, unfathomable sea?\nWhat is there more peacefully sublime than the calm,\ngently-heaving, silent sea?\nWhat is there more terribly sublime than the angry,\ndashing, foaming sea?”\nFloating freely in the dark cold water, Mariana had lost her sense of direction. Suddenly a flash from somewhere (above? where was above?) illuminated the whole ocean, and in that instant, she could see a school of grunions swimming past: hundreds of silvery gleaming bodies together in a mass so alien and intimidating. So beautiful. Light reflecting off their sleek bodies and silver-lined black eyes.\nThe darkness returned, but it didn’t feel the same. She could feel the hundreds of eyes watching her. Irrational, yes. But this moment was beyond rationality.\nAnother lightning strike somewhere far away revealed a peculiar sight.\nChubs? she thought with an unnatural calm. How strange. Must be the storm . . .\nHowever, still no sign of other people.\nWhen the next lightning bolt lit up the murky waters a moment later, she glimpsed something else. She knew she ought to feel dread, fear, panic.\nBut she was far beyond that too.\n“Ready?”\n“Ready.”\n“Ready,” echoed a second voice, and the three divers submerged together.\nAs soon as she entered water, Mariana Aguayro ceased feeling anxious. She was in her element. No matter what happens next, she’s where she belongs; and she had trained for what happens next.\nIt was difficult to tell whether the same applied to Hector Hodges beside her. Even though the full-face mask offered a better view of his face than usual diving masks, she could only imagine how he was feeling. In her imagination, however, he was still as nervous as on their way here.\nIku was already ahead of them, holding his sea scooter like it was a part of his own body. If she felt in her element here, he seemed born in the ocean.\nThey continued in silence. No need to speak, even if the transceivers would allow them to. They could view speaking as a security risk even here, still far from their destination. The fish-like scooters carried them forward. They could take a moment’s rest for now. Mariana knew they’d need it.\nEven though they were not descending yet and it was early, light faded quickly around them. Mariana thought of the darkening skies above. No sane person would go for recreational diving today. They remained alone but for a few by-the-wind sailors above, and some moon jellyfish. The storm was coming. For them, it was ideal.\nIku turned and signaled “down.” She and Hector copied.\nThe waters grew murkier as they descended slowly. Usually, the visibility would be good. But today, the currents were disturbed by the approaching storm. The water was considerably colder than usual at this time of the year. Mariana could still see Iku’s silhouette beneath, but visibility was dropping quickly.\nFinally, she glimpsed the bottom, or at least she thought so. On the sandy shelf, there was no reef to look for, nothing to use as a beacon. Her dive computer showed the depth of 110 feet, same as the analog depth gauge she had refused to leave home.\nUpon reaching the bottom, Iku signaled for them to stop. Mariana’s heart skipped a beat.\nIt’s here. We’re really doing it. Just as we practiced.\nIt was time to leave the scooters and anchor them here, where they could find them on their return trip. If there is one. Even in the murky shade, Mariana saw the fear in Hector’s eyes. In contrast, Iku’s face was almost serene. She imagined hers full of anticipation.\nWe’re going to free freedom itself.\n“Let’s go,” Iku gestured.\nHug the bottom. Kick ever so slowly. The rhythm we finally got right last week.\nA week ago, at the same depth, but in clear water on a sunlit day tens of miles away from here, Mariana was trying to pass as a fish. She could see Hector swimming some ten feet from her. Iku floated somewhere overhead, monitoring them as always.\nHug the bottom. Go slowly. Use the add-ons on the suit to simulate fish movement, she recited in her mind. She should probably feel nervous. But being underwater always had a strangely calming effect on her. Hearing your breath, the pounding of your heart, and the ocean surrounding you, while you moved freely in its soothing cold embrace . . . Sometimes she wished she could stay.\n“There wouldn’t be any motion detectors on the bottom,” Iku had said to them earlier. “Too many things would set them off. They would rather rely on autonomous guard bots, a few ROVs and aquamesh around the site.”\nHugging the bottom therefore seemed to be a good approach strategy, and Iku provided the rest.\nNow they reached the improvised aquamesh: just a fishing net in this case, no fiber-optics. When Iku gave the signal, Mariana and Hector started cutting through it.\nHe was faster than she this time, having improved a lot. Mariana got used to the full-face mask and closed cycle rebreather already in their first test dive. Hector had a little trouble adjusting to the mask, but he too was an experienced diver and now he seemed just as accustomed to the equipment.\nGoing through, she signaled and went first.\nShe saw the outline of their target in the silty waters. Suddenly, a shock wave hurled her onto the bottom and made her earbuds ache. She was scared and disoriented . . . for a few seconds. Then she kicked fast toward where she thought the target was. She couldn’t see a thing through the upraised mud. We should have thermal, occurred to her. She wasn’t sure any thermovision mask even existed, but Iku apparently had access to a lot of gear she hadn’t known about.\nHector was beside her in another second. They reached the target, pulled the waterproof Taus and cords and got to work in perfect sync. The screens shone bright in this dim bottom world.\n“Incoming,” Iku’s voice sounded suddenly in their ears. Mariana turned around to intercept the danger and readied her underwater gun. But nothing happened. Then Hector announced: “Got it.”\nThe timer showed eighteen minutes, ten seconds. Best result so far.\nA diver silhouette approached.\nReady, Iku signaled. Up.\nWhen they were ashore and stripping from the diving gear, Mariana felt oddly elevated. We did it. We’re well under the limit. It really can be done!\nBut the greatest news was yet to come.\n“There could be severe storms coming next week,” Iku announced as he closed the trunk with all the gear and stood by his car, an inconspicuous older wagon. “The timing is ideal. Augur will be conducting some site reliability tests elsewhere. Their guard will be high, but it always is, and they would be more vulnerable at the same time. Be prepared. The next time, we go live.”\nIt was exhilarating to hear that. Next time, it’s real. They’re gonna rob and sabotage an Augur datacenter.\nIn the wake of their successful dive and Iku’s announcement, they had made a mistake. Mariana would usually take a bus back to LA; after all, Iku had all the diving gear, she didn’t need to carry anything. But Hector had offered to drive her home.\n“He’s being too paranoid,” he waved off Iku’s earlier advice. (Do not ride together. Do not call each other. Do not let your paths cross any more than they would before you had met.). “And he’s not here. Are you going to wait an hour for your bus, or be back in LA at that time?”\nIt wouldn’t hurt to get home earlier . . .\nThey spent the whole ride talking. It seemed like a mere moment when he stopped before her home.\n“Wanna come upstairs for a drink?” she said on an impulse. Hector wasn’t her usual type. She wasn’t into older guys and typically avoided anyone from IT, if mostly for professional reasons, but the excitement of their dive and the upcoming op must have clouded her judgment. The fact that they had shared a secret from the rest of the world may have played a role.\nHe stayed for several hours. But when she said “you should go,” he just nodded and left. They didn’t see each other again up until this morning, after Iku had called them. It was time.\nShe couldn’t quite shake off the disturbing sensation that Iku somehow knew.\nHector was the first to notice the bots. Above, he gestured.\nThe AUVs were circling the perimeter in quasi-random patterns. They patrolled for unusual motion, light, heat signatures, sound, or transmissions. Though Mariana knew about them, her heart still skipped a beat when she saw that one was nearing her position.\nCalm down and swim. This was to be expected.\nThe AUVs continued on their way.\nThe style they’d practiced seemed to pay off. They had passed as fish.\nThen she saw what they were looking for. The mesh.\nThe real danger would only lie beyond that—if they managed to get through.\nMariana glanced at Iku, or rather tried to, but she couldn’t see him. The silt whirled beneath them and decreased visibility even further.\nBut something changed. She glimpsed movement. Silvery glint. Eyes. So many . . .\nPacific mackerel, she thought.\nIt didn’t stop with them.\nSo he did it; Iku released a batch of pheromones to lure the fish. The schools would provide more cover for them while they try to get through the mesh.\nIku went first, followed by the fish like some strange pied piper.\nA sudden if feeble flash of light illuminated even these murky depths for a fraction. The storm above had started.\nIt would disturb the fish. It would also disturb the AUVs and sensor nets. Motion, thermals, sonar echo—all would be obscured. A lot of unusual activity just might pass unnoticed in a storm . . .\nIku approached the mesh. Mariana waited while he began attaching long stretches of optical fiber to the mesh. Then she saw the signal. She swam toward him and began cutting through the fiber-optic mesh, while Hector approached from another side. Another lightning struck somewhere above.\nThe final cut. Nothing visibly changed. No dazzler blinded them; no sound weapon thrust them away; no AUVs approached.\nThey swam through. Shapes began emerging from the mist-like whirling silt. Their ghostly glow felt otherworldly. There was something surreal about the server boxes and glowing displays down here: a true snippet of another world.\nHow did I ever end up here? Mariana wondered.\nMariana Aguayro sometimes wondered how their lives would turn out if the Sun didn’t misbehave. Just one peculiar cycle of increased solar activity. It was enough to first render billions of investments in satellite communications lost, and to make other such ventures too risky for another decade; and they could count themselves lucky that the storms only caused occasional blackouts.\nCables always held most traffic, but Internet giants promised free worldwide web connection for anyone on the planet. High-speed satellite connection in the furthermost, poorest village on Earth; it was too good to last. It almost hadn’t even started before the unprecedented solar storms fried most satellites, high-altitude balloons, and many land facilities too. Solely dependent on cable connections, with the corporations shaken badly and world politics already in disarray, it was a recipe for a slow plunge into unobtrusive dystopia.\nIf it didn’t happen, I may have gone to college.\nIf it didn’t happen, we wouldn’t have access outages for days.\nIf it didn’t happen, we might not have lost our freedoms so easily.\nShe remembered net neutrality, constant quick access to information, and reliable communication from her childhood. Chatting with friends online without worrying about the price or whether the messages would get through at all. Browsing encyclopedias and magazines without end. No outages lasting over an hour. Sometimes it made her feel old, despite not being even in her thirties.\nShe also remembered a semblance of privacy. Yes, people willingly, if unwittingly granted access to highly personal information to any stupid app, but there was at least a pretense of legal protection, at least some hope that individuals could persist against governments and corporations . . .\nThis, too, had been taken away, with the help of Augur.\nMaybe that’s why Mariana liked diving so much. The fish, corals, and crustaceans didn’t care for human skirmishes. She could escape into their world, but even there, she would see the discomforting signs of human presence above. Little had been done to keep the oceans clean. Even down there, in her dream world, Mariana could not avoid getting angry.\nSo she’d started rebelling. Tiny steps, at first. Then she’d gotten more daring.\nBeing a hacker was nothing like in the movies she’d watched—and downloaded, impossible now—as a kid. But it was exhilarating nonetheless when she and the fission-fusion crews sometimes succeeded after weeks or months of dull work. Her life became a series of mood swings, and at times she also wondered whether it would have been so, had she been let to live a normal life.\nShe didn’t know how Iku found her.\nHe sat next to her one day on the beach, an inconspicuous black man of slender build and indeterminate age, and told her without any fuss that he wanted to hire her for a special job. One that involved both her computer hacking and diving expertise.\nShe could have said no. She didn’t know the stranger at all, nor did he mention having any contacts in common.\nBut it sounded like the kind of offer you cannot refuse.\nShe was just a few kicks away from the first server when the world broke.\nFirst, there was light.\nA bright flash blinded her for a moment, and a staccato of bright beams followed. No time to think about that. No time to prepare for the sound.\nIt threw her away like a punch in the chest. Her limbs flailed around her. She felt as if air was knocked out of her lungs. Her chest and stomach hurt badly. She couldn’t breathe. And the lights were still there, burying themselves into her skull . . .\nDazzlers and an ultrasonic pulse, some calculating part of her mind said. Shouldn’t cause permanent damage, only stun or injure. Get it together.\nShe kicked away before another cavitation could hit her. Only then she turned and looked back, grasping the underwater gun on her belt, though wary of using it.\nBut it was no longer necessary.\n“Disabled it,” Iku’s voice sounded in her ears for the first time during the dive. Stealth didn’t matter anymore, and they would need to use the transceivers soon anyway.\nShe looked around. “Hector?”\nShe didn’t see him. Nor did she hear any reply. She was about to call him again, when Iku spoke: “He’s alive.”\nSomething in his tone made her shiver inwardly.\nIku moved smoothly, shark-like, toward a dark silhouette barely visible in the silt. She glimpsed him link his suit’s computer to Hector’s. As she swam nearer, she could see him activate the adrenaline pump in Hector’s suit.\nThe dark silhouette moved, and Mariana heard a sharp intake of breath in the comms. “W-what happened?”\n“Dazzler and cavitation,” Iku said. “You’ll come to. Let’s do it.”\nMariana would have liked to see whether Hector was okay, but Iku was right; there was little time. They had to get in, and Hector Hodges, a disgruntled former Augur employee wishing to take revenge accompanied ideally by large sums of money, was necessary to manage it quickly.\nThe servers were just two dozen feet away. This near, AUVs wouldn’t use sonic pulses to knock them out; too much risk for the equipment.\nHector and Mariana got to work on one rack, Iku moved to another.\n“You all right?” she asked Hector quietly, mask to mask; no need for Iku to overhear.\n“Think so,” he spoke. Even in these conditions, she could hear his strained breath.\nBroken ribs? Internal bleeding? she thought of the risks of cavitation. It was by no means a non-life-threatening weapon. Down here, every injury counted more.\nThe firewall held fast, but Mariana tried a few new exploits, while Hector worked his angle.\nStill nothing . . . Would they have to use plan B and just DDoS Augur without making use of any of the data stored here?\nMariana glanced at her computer. At this rate, she had an hour of resurfacing to look for. An hour within which anything could go wrong.\n“We’re there,” Hector said.\nMariana’s heart skipped a beat.\nWe’re really there. Inside Augur’s heart . . . about to seize it and tear it out.\nShe just sent an invite to a feast on the company’s internal files to a dozen informal hacker groups; most of them hopelessly idealistic anarchists, some strategically chosen groups that were in for money or mainstream politics, which translated to money anyway.\nHer head almost spun.\nFor a second, she was tempted to look up Iku, regardless of whether the alias had any ties to his real self. Who, or what . . . But no—there was no time to waste.\nNow to erasing the user metadata, and all the surveillance we can . . . To watch the watchmen for once. To free ourselves before they load the backups—but others will be ready for that. Let it run another half an hour, please, and then we can have a DDoS as a cherry atop the cake.\nThere was still a chance that Augur noticed only now what they were doing and couldn’t get in touch with its AUVs here because of the storm.\nBut the storm would also complicate their ascent. They’d all realized the possibility they’d become martyrs, but none wanted to reconcile with that. Not without a fight.\n“Iku?” she spoke.\nNo answer.\n“Can’t resurface now,” Hector pointed above. Even at this depth, they could see the lightning flashes. Even through the transceiver connection, Mariana heard the strain in his voice. Hold on. We’ll help you ascend, she thought. But where was Iku? She decided to find out and kicked slowly. Even moving this carefully, she almost caused a silt out. That’s why she didn’t see what happened next.\nShe was already at the further rack, and only heard the gasp and ragged, muffled breaths. She turned back, but another shape shot forward alongside her: Iku. She’d never think a diver could move so fast and smoothly, truly like a fish.\nHector’s body was jerking as if electrocuted. Mariana glimpsed some strange, ghostlike shape around him in the light of her LED torch, and realized that he was being electrocuted.\nBut Iku was already there, grasping the thing she could barely see, and pulling it away from Hector.\nThe battle resembled a surreal ballet: a diver against a barely visible translucent shape, swirling and writhing amidst silt. It was entrancing. The Finnish Kalevala myth came to Mariana’s mind, because Iku Turso in this instant truly resembled some kind of ancient sea monster like his namesake in the epic: sometimes depicted as a horned creature, sometimes a sea serpent, sometimes octopus-like, but always, always deadly.\nThe translucent robot sank to the bottom gently.\nIku turned to Mariana. “What are you waiting for?”\nShe wasn’t checking her Tau; she was checking Hector.\nHe was alive.\nBut even without glancing at his computer, Mariana knew he wasn’t going to make it. His suit was inflating visibly, and he started ascending. His face was constricted with pain. He was still conscious, and very much aware that this was just a brief period before certain death.\nI’m so sorry, she thought.\n“He was electroshocked,” Iku said on the transceiver. “Invisible robot creeps near you, pierces your skin with electrodes, shocks you, and doesn’t threaten nearby devices. Didn’t know they were in use already.”\nSizzling rage got ahold of Mariana. Hector was dying, and Iku was reciting his knowledge of the damn robot that killed him!\n“What do we do?” she somehow made her voice sound measured.\n“We continue our work.”\n“No!”\n“Yesss,” Hector hissed through the pain. His gaze met with Mariana’s. They were almost mask to mask. The eerie glow of the underwater servers made his face appear ghostlike. She was looking at it, and so didn’t see him pull a knife from his belt and cut at his own drysuit.\nThe inflation stopped, and then reversed. Mariana took a split-second to realize what he’d done. The stupid fool! He flooded his own suit to stop it from inflating. He’d never be able to ascend, even if he got rid of all the weights at once, and he’d get hypothermic in the matter of minutes.\n“I’ll take care of it,” he managed to say. “You get out. They . . . seem to know.”\n“Continue data transfer while you can,” Iku instructed him, and signaled to Mariana to follow him. She lingered for a second, put her mask to Hector’s and turned off her transceiver for a moment. Only then did she realize she had absolutely no idea what to say.\nHe solved it for her. “Goodbye, sweet girl,” he struggled to speak, but somehow he managed for the words to sound soft. “Go.”\nIku was circling the center, and Mariana noticed he was planting something in semi-regular intervals. She swam to it.\nCharges.\nIku waited for her at the far end of the datacenter and signaled to leave.\n“Explain first!” she spoke regardless of knowing that Hector will likely hear it. He had the right to know.\n“Destroying the center will set Augur back many months, if not years. Time for us to act.”\nIt made sense, she knew it. Just . . . leaving Hector behind, even if the best he could hope in otherwise would be surviving the hypoxia or a stroke after rapid ascent, if they could somehow get him out of his suit and share their air with him . . . No. Hector Hodges was gone and knew it very well.\n“What did you really want to gain from this?!” she said.\nIku’s lips moved as if in silent prayer. His face, illuminated by the datacenter’s glow, looked inhuman, almost demonic.\n“What anyone wants,” he whispered. “Freedom.”\n“Who do you think our Iku really is?” Hector had said back during their ride home.\n“What do you mean?”\n“The equipment he got us, his knowledge of the facility . . . I think he’s a frogman.”\n“Ours, or someone else’s?”\nHector laughed quietly. “That’s what I’m wondering too.”\n“He could just be Augur’s. Don’t they have their own frogmen? Military-grade stuff?”\n“I guess so. I even heard some rumors about . . . enhanced soldiers. But I’d think they watch theirs more carefully.”\n“Like they watch you?” Mariana raised a brow.\nHector seemed unperturbed. “That’s different. I’m unimportant.”\nMariana didn’t question that; they both were. Was Iku too?\n“Someone has to clean the facility,” she spoke finally. “Biofouling can be a problem after less than a year down below. Not speaking of tech maintenance.”\n“Iku isn’t an IT crowd guy.”\n“I never said he was. He could have posed as one.”\n“I dunno.” Hector shrugged. “Something seems . . . off about him to me. Can’t explain it.”\nMariana snorted, but it was just a facade; in fact, she felt the same about Iku.\n“There must be a lot of people outside our scope of abilities,” Hector continued. “Not just the H+ nerds who implant magnets into their fingers and bloody Fitbits under the skin. I mean gene-modded people, or laced, or fitted with optogenetic circuits, enhanced senses, strength . . . Don’t you think someone must have tried that already?”\n“Perhaps,” she said evasively. She didn’t like to think of how she only saw the surface layer of the world, and how much might be going on underneath, concealed by Augur and others like them. It led to paranoid thinking, and she saw enough of that in her mother to know that she wanted to avoid that at any cost.\nShe was glad when Hector changed the topic and resumed flirting with her.\n“Freedom?” she said once they were nearing the aquamesh. “From what?”\nIku didn’t answer. She could think of a thousand options, but recalled her conversation with Hector back in the car all too vividly. But maybe she just felt guilty about Hector.\nThey began making another hole in the mesh; the first site was likely compromised.\n“From my creators and controllers,” Iku spoke suddenly. “Everyone will know now.”\nShe wanted to ask more, but then there was light.\nSomething pushed her aside—no, someone, it was Iku—and after that she was pushed into the bottom with considerable force.\n“Go—” she heard Iku, but his voice was cut out.\nSilt was everywhere.\nAnd then all was darkness.\n“Where are the bones, the relics, of the brave and the timid, the good and the bad, the parent, the child, the wife, the husband, the brother, the sister, the lover, which have been tossed and scattered and buried by the washing, wasting, wandering sea?”\n. . .and they dug tunnels in the silt and mud, bore into the bottom like worms. Blind, constrained, deaf but for the sound of their breath.\nShe soothed herself with this image from the past.\nAs a child, Mariana had loved stories of her underwater heroes. Cousteau and his diving saucer sub. Franzén and his men, excavating the Vasa from her infamous grave in the Stockholm harbor. In the decades after she sank in 1628, pioneer divers submerged into the 32-m depth in bells filled with air to excavate some of the treasures the ship had carried. Then, she lay forgotten and silt buried her, until amateur marine archeologist Franzén found her again. To un-sink the ship, they had to dig tunnels beneath her to secure her, and tow her into the harbor.\nMariana remembered the story now, as she clawed her way desperately through the silty bottom. She didn’t know how long she’d been out, since she had no way to look at her dive computer, but hopefully she only lost consciousness for a few seconds. She couldn’t have been buried deep, nothing could do that; but was she trying in the right direction? Fear almost got ahold of her.\nFinally, she felt little resistance.\nShe emerged from a silt grave into pitch dark waters.\n“Iku?” she tried.\nOnly silence answered her.\nShe assessed the damage. Her torch was lost, her rebreather got damaged, her trimix would soon run out, and she was still lucid enough to realize she was hypothermic. Her computer was broken, and she lost track of time.\nSo she did the only thing she could: started ascending as fast as she dared.\nAnother bright flash of lightning somewhere above. The lone chub, normally a river fish, was swimming desperately in this unwelcoming strange place. Mariana just floated with current. She started feeling strangely elated. Hypoxia? Or just cold? she could still guess.\nA flash revealed a school of sardines gazing at her with a thousand little eyes.\nBig brother watches you, she mused. Even here. Did we change anything?\nLightning—and the briefest of glimpses of a dreadful shape. The strange mask and suit . . .\nFrogman. Augur’s. Who else?\nThey were fast, or perhaps there were more secrets she knew nothing about . . . She realized she ought to feel dread, fear, panic. But she was just cold and tired.\nMaybe they didn’t win. But they didn’t exactly lose, either.\nA series of lightning bolts. The ominous figure, strobing toward her like in a stop-motion movie. And behind it—\nIku-Turso, son of Old-age, ocean monster, Mariana recalled dreamily the verses she’d looked up in the library.\nIn the murky ocean, illuminated only by lightnings further away now, she watched the strange battle unfold like a magic lantern projection. How beautiful, her mind marveled. Years ago, she’d seen the black jellyfish. It was huge, unearthly, menacing, infinitely elegant. Mariana had almost forgotten to breathe. Dread had seized her. She had only been wearing a spring suit, and the thought of the giant jellyfish stinging her had almost paralyzed her. But her sense of wonder had eventually won. She’d been captivated by the alien motion of the creature and its colors—a whole palette of purple, green, black, scarlet, and more colors as the light changed. It didn’t look like an animal at all.\nNeither did those two struggling monsters look human.\nWho are you, Iku? Mariana mused.\nSuddenly, the dark waters turned even darker, as if ink had spilled in the sea. She realized it was blood.\nThe remaining figure swam closer to her.\n“Thank you,” she heard in her transceiver, and that was it. “Now we’re even.”\nLater, hard to say how much, she suddenly felt sand beneath her fins, and the next wave threw her ashore. There was no one else.\nMariana gasped and tore off her mask. She hungrily took in a breath of fresh cold air. Then she looked at the raging skies and around the shore, where she saw no artificial lights. She had no idea where she was.\nShe’d get rid of the suit. She would start walking. She’d try to make it somewhere dry without collapsing. If anyone asked, she’d make some excuse of getting lost in the storm, and give a fake name. Only then would she go online, if possible, and try to find out what they did.\nPerhaps, just perhaps, she just emerged on the shore of a different world.\nAuthor’s note: The quotations come from “Poetry and Mystery of The Sea,” as referred to by Edward Howland in “Ocean’s Story; or Triumphs of Thirty Centuries” (1873).\nJulie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "source": "https://clarkesworldmagazine.com/novakova_02_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Deep Down in the Cloud by Julie Nováková"}