{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cameron Van Sant", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "nJ3+nT473vw5NDVNFOu5fM94l6E=", "id": null, "license": null, "comments": "", "raw_text": "2300 words, short story  The Whale Fall at the End of the Universe  Tristar drifts close enough to a star, close enough that it stands out slightly more than the others, and they wake. The sail on their back unfurls and they feed on the light; their skin and tail scales glow green with photosynthesis. The light is faint and absorbing it only makes them more aware of their hunger, like a handful of water in a drought. They run their tongue over their unused teeth, still sharp in the vacuum of space. They flex their claw hands, wave their long tail.  Tristar doesn’t remember their home star, their parents, or what happened before they entered hibernation. They haven’t seen another person in a long time. They wonder if the home star they can’t remember has extinguished. They think about it for a few years, slowly passing through the star’s light, sleeping and waking.  They don’t remember exactly what a year is, or even a day. To them, a day is the period of being awake before they sleep again. The days are very short so far out from the star with so little energy. They vaguely remember years are related to orbiting, but that isn’t a useful concept while they drift in the expanse between stars. They imagine a year was “several hundred days,” but they weren’t exactly counting. They use the term to mean “a long time.”  Tristar cannot remember looking another person in the eyes. They wonder what that was like as they fall into hibernation again.  Light hits their face and Tristar’s sail unfurls. They wait for the starlight, for the photosynthesis, for the energy. There’s nothing. They turn their head to the light.  It’s not coming from a star. It’s coming from a whale.  The whale is enormous, the size of a city, and each of its four eyes are Tristar’s size and are still in death. It’s a whale fall: a carcass turned home for scavengers living on its body.  Tristar is a scavenger too.  The light that woke Tristar is from the bioluminescent scavengers living on the whale. Tristar peers at the colors in the darkness, mentally plotting their course. They blow from the mouth in the back of their head, the breath they’ve held for many years warm on their lips. With the brief propulsion behind them, they twist their body, and their trajectory turns, gently curves toward the whale fall. They squint against the darkness and against exhaustion.  Tristar sails impotently over the whale’s nose. They shut their eyes. They tried.  They are slapped from their trajectory by a long tail that stretched meters up to them and throws them against the whale fall, tiny bioluminescent creatures scattering in their wake.  The beast that pulled them is mostly one long jutting mouth that is twice Tristar’s size; its smaller body crawling on four squat legs. Its white eyes dimly reflect the bioluminescent glow; the teeth popping from its lips are small but too many, clinking in five orderly rows.  As Tristar backs away, they know why it brought them here. Both the Beast and Tristar will eat at the whale, and after there is no whale left, the Beast will eat Tristar—a healthier and bigger meal than they are now.  Tristar doesn’t have to stay. Gravity is weak here—they could push off, drift back into space, hibernate until they reach another star. Sleeping for years is better than being eaten.  But as they set their teeth into the meat of the whale’s nose, yanking against the gray skin, their jaws remember the lift and fall of chewing, and the buds on their tongue awaken to taste.  Then they remember everything.  Tristar remembers bouncing along in a pocket under a parent’s sail when they were a young hatchling, shielded from radiation until they developed enough immunity themself. The family flew to the Tucanae cluster, Tristar’s skin glowing green from the bombardment of starlight from all directions, munching on the smaller photosynthesizing creatures that lived there. They remember their parents holding their hands, forming them into signs—words that could be seen under light or felt in darkness.  That was many years ago. The stars are parting now, the universe darkening.  The whales dying.  They try not to think about it. Nothing can be done for this one. Tristar eats.  The whale’s fins are peninsulas, its sides great plains, its mouth a cavern. It’s a feast, and it will stay that way for a long time. There is no need to fight for territory. Not yet.  Tristar sleeps peacefully against the whale’s nose, and when they wake, they remember the Beast. They spot it up on the whale’s forehead, shaking its body back and forth to tear meat free.  Tristar pulls themself by their arms, slowly wags their tail in empty space, and they laboriously climb down the whale’s face. Chemicals disintegrated in Tristar’s stomach puff up in a breath in their back mouth, so they have the option to push off and float where they want on the whale fall, orienting themselves with a breath. They don’t dare. They’re afraid they’ll make a mistake and never return.  They take their time. They eat, they sleep. They examine the little bioluminescent creatures, scuttling with little claws, cheerfully glowing rainbow colors.  Tristar thinks about eating them and leaves them be. They’ll reconsider when the feast is nearing the end. They realize the bioluminescent creatures feel Tristar’s shadow the same way Tristar looks over their shoulder for the Beast, but everyone is content with the whale meat. The feast brings a tenuous peace.  Under the whale’s chin, they crawl lower and lower, toward the belly. Down below, they can no longer see the whale’s forehead or the Beast. Their arm muscles throb and they consider sleeping. But when they scan the new distant horizon of the belly, they see the sail.  Suddenly energized, they crawl on and raise their own sail, flashing it up and down like a signal. Eventually, the other person notices Tristar. They flash their own sail back and crawl toward Tristar. Tristar stops on the hill of the jawbone, the stranger stopped below them on the neck.  Tristar then doubts they are the same species. The creature below them is larger, and instead of one large sail, they have four sails organized into two pairs with a top and bottom one, like a butterfly’s wings. Their eyes are slightly closer together, their ears taller. Their skin is red and rough, not like Tristar’s, which is green, growing dim without starlight.  The other signs to Tristar, and Tristar doesn’t understand.  But goddamnit, if that red sail isn’t the most beautiful thing they’ve seen in a long time. Tristar climbs down the hill.  The other teaches Tristar their name, a sign Tristar can repeat but doesn’t understand. They decide to think of the other as “Hunter” because Hunter eats the bioluminescent creatures.  Hunter points away from the whale as if asking a question. Tristar doesn’t understand. Hunter then gestures an egg hatching and growing up into Tristar, and then they point back out into space. Tristar takes it to mean, “Where did you come from?” They look at the stars but don’t recognize them. They wonder how long they slept, where those familiar old stars went. It’s so dark out.  Hunter gestures an egg growing up into themself, and points to a little path of faint stars in the direction of the tail. Tristar peers that way, attempts tease some familiarity from them, but they can’t. They think Hunter is younger, young enough to have traveled from not so far away. Only a few thousand years.  Maybe Hunter’s entire species is younger—newly evolved from a school of Tristar’s species, separating wings and hardening skin for whatever dangers lurked in that cluster of stars.  Hunter shows Tristar their cave—a hole in the whale’s side, barely big enough for the both of them. Shoulder to shoulder, they peer out the hole, conserving warmth and eating morsels of the cave walls.  The feast vanishes into bellies as the years pass, helped by a slightly growing population—some scavengers stumble onto the whale fall, and some give birth here. Tristar and Hunter slowly build a pidgin language, creating vocabulary from their original languages. They exchange stories about people they used to know, stars they’ve seen, delicacies they’ve enjoyed. Tristar learns Hunter is not green because they don’t photosynthesize. Tristar worries how Hunter will eat when the whale ends.  The bioluminescent creatures learned to be wary of them, and the days grow darker. Tristar and Hunter descend to the end of a whale rib, eat meat from the bone, and break the tip off to make a spike. They repeat the process with a second rib, the spikes as long as their arms. They fence and prepare to fight off anything that wants to eat them.  Tristar hasn’t seen the Beast again and doesn’t let Hunter go near the top of the whale’s head.  Hunter dismisses their concerns. “I will kill the Beast,” Hunter says. “We will eat it together.”  Soon the whale fall is mostly bones, and the little meat left means its surface area is smaller, more compact, clinging to bones. The inside of the whale, formerly packed with meat and organs, is now a colossal space, and stars shine through the bones. Tailbones break off, drift away.  One day Tristar wakes up in the curve of a rib, and Hunter is gone.  They scramble in circles, craning their neck. Hunter is nowhere. They look up into the whale bones, up through the empty whale to the topside. They can see something happening in the distance, near the spine, but it’s too dark to tell what. Something thrashes.  Clutching their rib spike, Tristar pushes off the rib bone with their tail, spits out their breath from their back mouth, and they sail through the enormous cavern from the bottom to the top.  Tristar collides into the far side of a rib and hits it so hard the whole whale tilts. Their head appears under something’s feet—the Beast’s—and they see a red flash—Hunter’s sails in the Beast’s mouth. Tristar stabs the spike into the underside of the Beast’s chin. Hunter pulls free, red droplets of blood floating slowly down to the whale, two of their sails ripped and mangled. Hunter punches the Beast in its face with their tail. Tristar slips back beneath the rib and pulls the Beast’s foreleg with them. Bracing themself against the rib with one hand, they pull on the huge leg again and again, slamming the Beast against the rib.  The Beast lies still.  Tristar clambers up the rib and scrambles to Hunter. They put their arms around Hunter and press their hand to the sputtering sail. Hunter cries in their arms, precious water droplets floating up and slowly down.  Out of the corner of their eye, Hunter sees a glow. Hunter and Tristar are surrounded by a circle of little scavengers, ready for new meat.  Tristar waves the rib spike over their head and bares their teeth. The creatures scatter.  Tristar takes Hunter under one arm and Hunter drags the Beast—a simple task in the slight gravity. Tristar hauls them up to the whale skull, and the little creatures who previously hid there scatter in their wake. Tristar peeks down the neck, out the four eyeholes. Once the creatures evacuate, it’s dark except for a soft glow from up the neckhole.  Tristar holds Hunter’s blood in with their own hands. They eat the Beast and feed some to Hunter, who mostly sleeps. When the wound finally clots over, Hunter smiles at Tristar again and strokes their face.  Hunter talks of love, of red and green children growing into a school, of finding fire somewhere, steering the whale to a star.  Tristar doesn’t know if it’s possible for the two of them to have children, even if they were the same species. Regardless, they don’t think it’s a good idea to make any more mouths to feed. Then they realize the real reason this idea makes them uncomfortable.  Tristar looks Hunter in the eye and signs, “I won’t leave you hurt. You don’t have to say anything to keep me here.”  Hunter agrees and looks away, ashamed. Tristar curls up around them and they both fall asleep.  The Beast was large but no whale fall. Tristar and Hunter finish it in about thirty days, eating increasingly smaller portions. When it’s gone, Hunter is strong again and has only two sail segments.  Strange specialized scavengers appear in the skull, who suck any remaining nutrients from the bones. When Tristar looks down the neckhole, most of the other scavengers are gone.  Tristar worries about getting hungry, about forgetting again.  “I will leave,” Tristar tells Hunter.  “No,” Hunter signs.  “It’s been a good few years,” Tristar says, “but this place can barely support one of us. I’ll leave, hibernate, find light to eat, and you can eat the bone eaters.”  “I wasn’t lying when I told you I love you,” Hunter says. “I didn’t say it to keep you taking care of me.”  Tristar thinks it’s easy to fall in love at the end of the universe. But they love Hunter too and can’t deny it.  Hunter kills an armload of the bone-sucking creatures in the skull. Then they take Tristar’s hand, and the two push off with their tails from the whale fall, out toward the brightest star in the sky.  The two fly through space. Tristar corrected the trajectory with an exhale, and Hunter ate half the creatures one day, and the rest the next. Then Hunter’s arms were empty and they fell into hibernation.  Tristar clutched Hunter’s hand. Even if they both forgot, they would help each other; they would remember again. Tristar fell asleep and did not let go. Cameron Van Sant is a transgender writer of speculative fiction. His short stories can be found in Lightspeed Magazine, Queerly Loving Volume Two, and Capricious Magazine: The Gender Diverse Pronouns Issue which was selected for the 2018 James Tiptree Jr. Honor List. He has also written non-fiction for INTO Magazine and You&Me Magazine. He lives in Sacramento, California with his partner. You can find him on Twitter at @cameronvansant.", "text": "2300 words, short story\nThe Whale Fall at the End of the Universe\nTristar drifts close enough to a star, close enough that it stands out slightly more than the others, and they wake. The sail on their back unfurls and they feed on the light; their skin and tail scales glow green with photosynthesis. The light is faint and absorbing it only makes them more aware of their hunger, like a handful of water in a drought. They run their tongue over their unused teeth, still sharp in the vacuum of space. They flex their claw hands, wave their long tail.\nTristar doesn’t remember their home star, their parents, or what happened before they entered hibernation. They haven’t seen another person in a long time. They wonder if the home star they can’t remember has extinguished. They think about it for a few years, slowly passing through the star’s light, sleeping and waking.\nThey don’t remember exactly what a year is, or even a day. To them, a day is the period of being awake before they sleep again. The days are very short so far out from the star with so little energy. They vaguely remember years are related to orbiting, but that isn’t a useful concept while they drift in the expanse between stars. They imagine a year was “several hundred days,” but they weren’t exactly counting. They use the term to mean “a long time.”\nTristar cannot remember looking another person in the eyes. They wonder what that was like as they fall into hibernation again.\nLight hits their face and Tristar’s sail unfurls. They wait for the starlight, for the photosynthesis, for the energy. There’s nothing. They turn their head to the light.\nIt’s not coming from a star. It’s coming from a whale.\nThe whale is enormous, the size of a city, and each of its four eyes are Tristar’s size and are still in death. It’s a whale fall: a carcass turned home for scavengers living on its body.\nTristar is a scavenger too.\nThe light that woke Tristar is from the bioluminescent scavengers living on the whale. Tristar peers at the colors in the darkness, mentally plotting their course. They blow from the mouth in the back of their head, the breath they’ve held for many years warm on their lips. With the brief propulsion behind them, they twist their body, and their trajectory turns, gently curves toward the whale fall. They squint against the darkness and against exhaustion.\nTristar sails impotently over the whale’s nose. They shut their eyes. They tried.\nThey are slapped from their trajectory by a long tail that stretched meters up to them and throws them against the whale fall, tiny bioluminescent creatures scattering in their wake.\nThe beast that pulled them is mostly one long jutting mouth that is twice Tristar’s size; its smaller body crawling on four squat legs. Its white eyes dimly reflect the bioluminescent glow; the teeth popping from its lips are small but too many, clinking in five orderly rows.\nAs Tristar backs away, they know why it brought them here. Both the Beast and Tristar will eat at the whale, and after there is no whale left, the Beast will eat Tristar—a healthier and bigger meal than they are now.\nTristar doesn’t have to stay. Gravity is weak here—they could push off, drift back into space, hibernate until they reach another star. Sleeping for years is better than being eaten.\nBut as they set their teeth into the meat of the whale’s nose, yanking against the gray skin, their jaws remember the lift and fall of chewing, and the buds on their tongue awaken to taste.\nThen they remember everything.\nTristar remembers bouncing along in a pocket under a parent’s sail when they were a young hatchling, shielded from radiation until they developed enough immunity themself. The family flew to the Tucanae cluster, Tristar’s skin glowing green from the bombardment of starlight from all directions, munching on the smaller photosynthesizing creatures that lived there. They remember their parents holding their hands, forming them into signs—words that could be seen under light or felt in darkness.\nThat was many years ago. The stars are parting now, the universe darkening.\nThe whales dying.\nThey try not to think about it. Nothing can be done for this one. Tristar eats.\nThe whale’s fins are peninsulas, its sides great plains, its mouth a cavern. It’s a feast, and it will stay that way for a long time. There is no need to fight for territory. Not yet.\nTristar sleeps peacefully against the whale’s nose, and when they wake, they remember the Beast. They spot it up on the whale’s forehead, shaking its body back and forth to tear meat free.\nTristar pulls themself by their arms, slowly wags their tail in empty space, and they laboriously climb down the whale’s face. Chemicals disintegrated in Tristar’s stomach puff up in a breath in their back mouth, so they have the option to push off and float where they want on the whale fall, orienting themselves with a breath. They don’t dare. They’re afraid they’ll make a mistake and never return.\nThey take their time. They eat, they sleep. They examine the little bioluminescent creatures, scuttling with little claws, cheerfully glowing rainbow colors.\nTristar thinks about eating them and leaves them be. They’ll reconsider when the feast is nearing the end. They realize the bioluminescent creatures feel Tristar’s shadow the same way Tristar looks over their shoulder for the Beast, but everyone is content with the whale meat. The feast brings a tenuous peace.\nUnder the whale’s chin, they crawl lower and lower, toward the belly. Down below, they can no longer see the whale’s forehead or the Beast. Their arm muscles throb and they consider sleeping. But when they scan the new distant horizon of the belly, they see the sail.\nSuddenly energized, they crawl on and raise their own sail, flashing it up and down like a signal. Eventually, the other person notices Tristar. They flash their own sail back and crawl toward Tristar. Tristar stops on the hill of the jawbone, the stranger stopped below them on the neck.\nTristar then doubts they are the same species. The creature below them is larger, and instead of one large sail, they have four sails organized into two pairs with a top and bottom one, like a butterfly’s wings. Their eyes are slightly closer together, their ears taller. Their skin is red and rough, not like Tristar’s, which is green, growing dim without starlight.\nThe other signs to Tristar, and Tristar doesn’t understand.\nBut goddamnit, if that red sail isn’t the most beautiful thing they’ve seen in a long time. Tristar climbs down the hill.\nThe other teaches Tristar their name, a sign Tristar can repeat but doesn’t understand. They decide to think of the other as “Hunter” because Hunter eats the bioluminescent creatures.\nHunter points away from the whale as if asking a question. Tristar doesn’t understand. Hunter then gestures an egg hatching and growing up into Tristar, and then they point back out into space. Tristar takes it to mean, “Where did you come from?” They look at the stars but don’t recognize them. They wonder how long they slept, where those familiar old stars went. It’s so dark out.\nHunter gestures an egg growing up into themself, and points to a little path of faint stars in the direction of the tail. Tristar peers that way, attempts tease some familiarity from them, but they can’t. They think Hunter is younger, young enough to have traveled from not so far away. Only a few thousand years.\nMaybe Hunter’s entire species is younger—newly evolved from a school of Tristar’s species, separating wings and hardening skin for whatever dangers lurked in that cluster of stars.\nHunter shows Tristar their cave—a hole in the whale’s side, barely big enough for the both of them. Shoulder to shoulder, they peer out the hole, conserving warmth and eating morsels of the cave walls.\nThe feast vanishes into bellies as the years pass, helped by a slightly growing population—some scavengers stumble onto the whale fall, and some give birth here. Tristar and Hunter slowly build a pidgin language, creating vocabulary from their original languages. They exchange stories about people they used to know, stars they’ve seen, delicacies they’ve enjoyed. Tristar learns Hunter is not green because they don’t photosynthesize. Tristar worries how Hunter will eat when the whale ends.\nThe bioluminescent creatures learned to be wary of them, and the days grow darker. Tristar and Hunter descend to the end of a whale rib, eat meat from the bone, and break the tip off to make a spike. They repeat the process with a second rib, the spikes as long as their arms. They fence and prepare to fight off anything that wants to eat them.\nTristar hasn’t seen the Beast again and doesn’t let Hunter go near the top of the whale’s head.\nHunter dismisses their concerns. “I will kill the Beast,” Hunter says. “We will eat it together.”\nSoon the whale fall is mostly bones, and the little meat left means its surface area is smaller, more compact, clinging to bones. The inside of the whale, formerly packed with meat and organs, is now a colossal space, and stars shine through the bones. Tailbones break off, drift away.\nOne day Tristar wakes up in the curve of a rib, and Hunter is gone.\nThey scramble in circles, craning their neck. Hunter is nowhere. They look up into the whale bones, up through the empty whale to the topside. They can see something happening in the distance, near the spine, but it’s too dark to tell what. Something thrashes.\nClutching their rib spike, Tristar pushes off the rib bone with their tail, spits out their breath from their back mouth, and they sail through the enormous cavern from the bottom to the top.\nTristar collides into the far side of a rib and hits it so hard the whole whale tilts. Their head appears under something’s feet—the Beast’s—and they see a red flash—Hunter’s sails in the Beast’s mouth. Tristar stabs the spike into the underside of the Beast’s chin. Hunter pulls free, red droplets of blood floating slowly down to the whale, two of their sails ripped and mangled. Hunter punches the Beast in its face with their tail. Tristar slips back beneath the rib and pulls the Beast’s foreleg with them. Bracing themself against the rib with one hand, they pull on the huge leg again and again, slamming the Beast against the rib.\nThe Beast lies still.\nTristar clambers up the rib and scrambles to Hunter. They put their arms around Hunter and press their hand to the sputtering sail. Hunter cries in their arms, precious water droplets floating up and slowly down.\nOut of the corner of their eye, Hunter sees a glow. Hunter and Tristar are surrounded by a circle of little scavengers, ready for new meat.\nTristar waves the rib spike over their head and bares their teeth. The creatures scatter.\nTristar takes Hunter under one arm and Hunter drags the Beast—a simple task in the slight gravity. Tristar hauls them up to the whale skull, and the little creatures who previously hid there scatter in their wake. Tristar peeks down the neck, out the four eyeholes. Once the creatures evacuate, it’s dark except for a soft glow from up the neckhole.\nTristar holds Hunter’s blood in with their own hands. They eat the Beast and feed some to Hunter, who mostly sleeps. When the wound finally clots over, Hunter smiles at Tristar again and strokes their face.\nHunter talks of love, of red and green children growing into a school, of finding fire somewhere, steering the whale to a star.\nTristar doesn’t know if it’s possible for the two of them to have children, even if they were the same species. Regardless, they don’t think it’s a good idea to make any more mouths to feed. Then they realize the real reason this idea makes them uncomfortable.\nTristar looks Hunter in the eye and signs, “I won’t leave you hurt. You don’t have to say anything to keep me here.”\nHunter agrees and looks away, ashamed. Tristar curls up around them and they both fall asleep.\nThe Beast was large but no whale fall. Tristar and Hunter finish it in about thirty days, eating increasingly smaller portions. When it’s gone, Hunter is strong again and has only two sail segments.\nStrange specialized scavengers appear in the skull, who suck any remaining nutrients from the bones. When Tristar looks down the neckhole, most of the other scavengers are gone.\nTristar worries about getting hungry, about forgetting again.\n“I will leave,” Tristar tells Hunter.\n“No,” Hunter signs.\n“It’s been a good few years,” Tristar says, “but this place can barely support one of us. I’ll leave, hibernate, find light to eat, and you can eat the bone eaters.”\n“I wasn’t lying when I told you I love you,” Hunter says. “I didn’t say it to keep you taking care of me.”\nTristar thinks it’s easy to fall in love at the end of the universe. But they love Hunter too and can’t deny it.\nHunter kills an armload of the bone-sucking creatures in the skull. Then they take Tristar’s hand, and the two push off with their tails from the whale fall, out toward the brightest star in the sky.\nThe two fly through space. Tristar corrected the trajectory with an exhale, and Hunter ate half the creatures one day, and the rest the next. Then Hunter’s arms were empty and they fell into hibernation.\nTristar clutched Hunter’s hand. Even if they both forgot, they would help each other; they would remember again. Tristar fell asleep and did not let go.\nCameron Van Sant is a transgender writer of speculative fiction. His short stories can be found in Lightspeed Magazine, Queerly Loving Volume Two, and Capricious Magazine: The Gender Diverse Pronouns Issue which was selected for the 2018 James Tiptree Jr. Honor List. He has also written non-fiction for INTO Magazine and You&Me Magazine. He lives in Sacramento, California with his partner. You can find him on Twitter at @cameronvansant.", "source": "https://clarkesworldmagazine.com/vansant_03_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Whale Fall at the End of the Universe by Cameron Van Sant"}