{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nnedi Okorafor", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "hT3jq7hFBKB8N5+1b0kUn37QpcI=", "id": null, "license": null, "comments": "", "raw_text": "1620 words, short story  Africanfuturist 419  Nigerian Astronaut Really is Lost in Space \r\n and He’s in Trouble and He’s in Trouble \r\n   It turns out the scam letter was not all a scam. There actually is a Nigerian man stuck out there on a space station, he’s been stuck there for fourteen years and after recent events, he’s probably not ok.  Though Spaceflight Services Inc. (the private spaceflight company he was working for) knew he was alive, it’s only with the exposure brought by this letter that plans are being made to bring him back. Quite a different reaction compared to the one in the science fiction blockbuster novel and film The Martian.  Last year, an online publication received a most peculiar 419 Nigerian scam letter. A man named Bakare Tunde was claiming to be the cousin of Air Force Major Abacha Tunde, a Nigerian astronaut abandoned in space. Bakare was offering the letter’s recipient three million dollars if the recipient would allow him to transfer a large sum of money that would be used to bring his cousin back. It’s assumed that in order to do this, the recipient would have to front some money first. Thinking this was just a typical (albeit more creative) scam letter, the publication posted it on its website and it quickly went viral.  Here is the letter:   Subject: Nigerian Astronaut Wants To Come Home  Dr. Bakare Tunde, Astronautics Project Manager National Space Research and Development Agency (NASRDA) Dear Mr. Sir, REQUEST FOR ASSISTANCE-STRICTLY CONFIDENTIAL I am Dr. Bakare Tunde, the cousin of Nigerian Astronaut, Air Force Major Abacha Tunde. He was the first African in space when he made a secret flight to the Salyut 6 space station in 1979. He was on a later Soviet spaceflight, Soyuz T-16Z to the secret Soviet military space station Salyut 8T in 1989. He was stranded there in 1990 when the Soviet Union was dissolved. His other Soviet crewmembers returned to Earth on the Soyuz T-16Z, but his place was taken up by return cargo. There have been occasional Progrez supply flights to keep him going since that time. He is in good humor, but wants to come home.  In the 14 years since he has been on the station, he has accumulated flight pay and interest amounting to almost $15,000,000 American dollars. This is held in a trust at the Lagos National Savings and Trust Association. If we can obtain access to this money, we can place a down payment with the Russian Space Authorities for a Soyuz return flight to bring him back to Earth. I am told this will cost $3,000,000 American dollars. In order to access his trust fund we need your assistance.  Consequently, my colleagues and I are willing to transfer the total amount to your account or subsequent disbursement, since we as civil servants are prohibited by the Code of Conduct Bureau (Civil Service Laws) from opening and/or operating foreign accounts in our names.  Needless to say, the trust reposed on you at this juncture is enormous. In return, we have agreed to offer you 20 percent of the transferred sum, while 10 percent shall be set aside for incidental expenses (internal and external) between the parties in the course of the transaction. You will be mandated to remit the balance 70 percent to other accounts in due course.  Kindly expedite action as we are behind schedule to enable us include down payment in this financial quarter.  Please acknowledge the receipt of this message via my direct number [number removed].  Yours Sincerely, Dr. Bakare Tunde  Astronautics Project Manager http://www.nasrda.gov.ng/ This was indeed a scam letter put out by Abacha’s cousin in an attempt to make some fast money, but the letter wasn’t typical. There was truth in it, too. Abacha did make flights to the Soyuz 6 Space Station in 1980 and subsequent Soviet secret flights. However, it was after a flight coordinated and funded by a private spaceflight company to its space station that he was somehow left behind and thus stranded. Company officials said the space station had been inundated with a shower of strange stones and the crew had had to abandon it. It is currently unclear why the company did not send anyone to retrieve Abacha.  “He is an African, that’s why,” his father Olaide Tunde said. “If he were a white man, he’d be here today rich from the book he wrote about his time stranded there.”  When shocked and irate relatives of Abacha learned of this letter, they immediately came forth and threatened to expose Spaceflight Services Inc. if they didn’t do something. A rescue mission was quickly planned and the family was allowed to hear his log entries. Nonetheless, when they heard this last log entry, the need to speed things along became urgent. This last log entry made by Abacha two weeks ago was just released to the public by Abacha’s family and we are pleased to share it for the first time on the Internet here:  AUDIO  TRANSCRIPT   AUTOMATED VOICE: Log Entry 212: Africanfuturist 419  ABACHA: I cannot believe this, o. Finally, those cheap idiots are coming to carry me back to Naija. All it took were some events. First, my cousin Bakare in Nigeria finds out about me. Then, instead of trying to get me rescued, he puts out a 419 scam. Then the damn thing goes viral, letting the world know I’m stranded in space. [Scoffs] I saw the letter; they sent it to me.  SCAM LETTER: In the 14 years since he has been on the station, he has accumulated flight pay and interest amounting to almost fifteen million American dollars… [Abacha groans with exasperation] ABACHA: Hai! Olorun, o!! As if anybody will pay me that kind of money.  SCAM LETTER: This is held in a trust at the Lagos National Savings and Trust Association. If we can obtain access to this money, we can place a down payment with the Russian Space Authorities for a Soyuz return flight to bring him back to Earth. This will cost three million American Dollars. In order to access his trust fund we need your assistance . . .  ABACHA: Using me for scams, while I’m stuck here! And the letter sounds like something written by a selfish constipated robot. Now people will think I am so rich. And this space station isn’t even Russian. Oh cousin Bakare, you will see me when I get home.  Africanfuturism. I learned this word just before I left. Blacks who love space and the future—like Sun Ra, P-Funk, black-rooted scifi. I am true African Africanfuturism. Unlike any of those guys, I actually left the Earth to see what was out there. Did I know that I will be seeing it for 14 goddamn years? [A creepy chittering (rat-like) sound and then the sound of scraping (like claws on paper) from the left] ABACHA: Ugh, I hope that noise is getting recorded. [PAUSE] The rest of the crew said they mistook cargo for me and that’s how they left me behind. Really? Even when I sit very still, I do not look like luggage! The truth? The crew thought I was dead and left; then, when they realized I wasn’t, it was cheaper to forget about the African they left in space. I won’t say more until I’m back on Earth in my country.  My mother warned me. “Better to stay home and eat gari and egusi soup than to look into the home of gods,” she said. You know what I miss most? Real food. Jollof rice. Isi ewu. Pepper soup. Suya. And the babes; Oh my goodness, Nigerian babes! [SAD] I feel like a dead man out here. [Chittering sound then the sound of something breathing heavily, this time closer] ABACHA: Oh my God, whatever you are, do not carry yourself and manifest now. Soon, I’ll leave here; you can have the place to yourself, o! [PAUSE] I went out and collected many rocks. I’ll bring back and sell on the roadside. [LAUGHS] Which kind stones be dis? Na space stone. Space stone get value pass gold and diamond! Na so I go talk . . . Buy space stone! It is good in making powerful charms! [PAUSE] Ah ah . . . this noise again . . . Maybe this thing got in when I went out to collect the stones, o. [Chittering, then heavy breathing, very close] ABACHA: Shut up! Let me finish this log entry, nah. [He speaks more urgently, now. The thing is right behind him] These people better come get me soon. And if this damn thing that’s been here with me the last ten days kills me, kindly tell my cousin I still love him. I still love you, Bakare. [WHIMPERS] But hold on. [He’s out of breath with fear and speaking quickly] I am coming home. Then we will talk. You and your goddamn Africanfuturist 419. Why didn’t you try to get me home sooner! Instead you just want to use me to chop people’s money. [DING] AOL AUTOMATED VOICE: You’ve got mail.  ABACHA: Ah, they’ve sent me another message. I will read it now. They’d better really be coming. And quick, quick, too! [Chittering. Something falls over] ABACHA: Dammit!  Whether the release of this entry will be viewed as the family breaching the contract signed with Spaceflight Services Inc. and cause the rescue mission to be scrapped is unknown. However, the world needs to know what happened to Abacha and the hope in publishing this here is that it’ll expose this situation to the world.  Let’s not have Abacha become yet another hashtag. Let’s all help to pressure Spaceflight Services Inc. to bring Abacha home alive and well.  --End Story-- --Reported by Nnedi Okorafor-- --Audio by Tchidi Chikere-- --Engineered by Robin Warren-- Nnedi's novels include Lagoon (finalist for Best Novel in the British Science Fiction Association Award), Who Fears Death (winner of the World Fantasy Award for Best Novel and Le Prix Imaginales for Best Translated Novel), Akata Witch (an Amazon.com Best Book of the Year), Zahrah the Windseeker (winner of the Wole Soyinka Prize for African Literature), and The Shadow Speaker (winner of the CBS Parallax Award).  Her short story collection Kabu Kabu was a Publisher's Weekly Best Book for Fall 2013. Her adult novel The Book of Phoenix (a prequel to Who Fears Death) was released in May and received rave reviews from The New York Times, The Chicago Tribune and more. Nnedi's novella, Binti her first story set in outer space recently won both the 2016 Nebula Award and the 2016 Hugo Award for Best novella. Lastly, her much anticipated young adult novel Akata Witch 2: Breaking Kola will be released in 2016.", "text": "1620 words, short story\nAfricanfuturist 419\nNigerian Astronaut Really is Lost in Space\nand He’s in Trouble\nIt turns out the scam letter was not all a scam. There actually is a Nigerian man stuck out there on a space station, he’s been stuck there for fourteen years and after recent events, he’s probably not ok.\nThough Spaceflight Services Inc. (the private spaceflight company he was working for) knew he was alive, it’s only with the exposure brought by this letter that plans are being made to bring him back. Quite a different reaction compared to the one in the science fiction blockbuster novel and film The Martian.\nLast year, an online publication received a most peculiar 419 Nigerian scam letter. A man named Bakare Tunde was claiming to be the cousin of Air Force Major Abacha Tunde, a Nigerian astronaut abandoned in space. Bakare was offering the letter’s recipient three million dollars if the recipient would allow him to transfer a large sum of money that would be used to bring his cousin back. It’s assumed that in order to do this, the recipient would have to front some money first. Thinking this was just a typical (albeit more creative) scam letter, the publication posted it on its website and it quickly went viral.\nHere is the letter:\nSubject: Nigerian Astronaut Wants To Come Home\nDr. Bakare Tunde, Astronautics Project Manager\nNational Space Research and Development Agency (NASRDA)\nDear Mr. Sir,\nREQUEST FOR ASSISTANCE-STRICTLY CONFIDENTIAL\nI am Dr. Bakare Tunde, the cousin of Nigerian Astronaut, Air Force Major Abacha Tunde. He was the first African in space when he made a secret flight to the Salyut 6 space station in 1979. He was on a later Soviet spaceflight, Soyuz T-16Z to the secret Soviet military space station Salyut 8T in 1989. He was stranded there in 1990 when the Soviet Union was dissolved. His other Soviet crewmembers returned to Earth on the Soyuz T-16Z, but his place was taken up by return cargo. There have been occasional Progrez supply flights to keep him going since that time. He is in good humor, but wants to come home.\nIn the 14 years since he has been on the station, he has accumulated flight pay and interest amounting to almost $15,000,000 American dollars. This is held in a trust at the Lagos National Savings and Trust Association. If we can obtain access to this money, we can place a down payment with the Russian Space Authorities for a Soyuz return flight to bring him back to Earth. I am told this will cost $3,000,000 American dollars. In order to access his trust fund we need your assistance.\nConsequently, my colleagues and I are willing to transfer the total amount to your account or subsequent disbursement, since we as civil servants are prohibited by the Code of Conduct Bureau (Civil Service Laws) from opening and/or operating foreign accounts in our names.\nNeedless to say, the trust reposed on you at this juncture is enormous. In return, we have agreed to offer you 20 percent of the transferred sum, while 10 percent shall be set aside for incidental expenses (internal and external) between the parties in the course of the transaction. You will be mandated to remit the balance 70 percent to other accounts in due course.\nKindly expedite action as we are behind schedule to enable us include down payment in this financial quarter.\nPlease acknowledge the receipt of this message via my direct number [number removed].\nYours Sincerely, Dr. Bakare Tunde\nAstronautics Project Manager\nhttp://www.nasrda.gov.ng/\nThis was indeed a scam letter put out by Abacha’s cousin in an attempt to make some fast money, but the letter wasn’t typical. There was truth in it, too. Abacha did make flights to the Soyuz 6 Space Station in 1980 and subsequent Soviet secret flights. However, it was after a flight coordinated and funded by a private spaceflight company to its space station that he was somehow left behind and thus stranded. Company officials said the space station had been inundated with a shower of strange stones and the crew had had to abandon it. It is currently unclear why the company did not send anyone to retrieve Abacha.\n“He is an African, that’s why,” his father Olaide Tunde said. “If he were a white man, he’d be here today rich from the book he wrote about his time stranded there.”\nWhen shocked and irate relatives of Abacha learned of this letter, they immediately came forth and threatened to expose Spaceflight Services Inc. if they didn’t do something. A rescue mission was quickly planned and the family was allowed to hear his log entries. Nonetheless, when they heard this last log entry, the need to speed things along became urgent. This last log entry made by Abacha two weeks ago was just released to the public by Abacha’s family and we are pleased to share it for the first time on the Internet here:\nAUDIO\nTRANSCRIPT\nAUTOMATED VOICE: Log Entry 212: Africanfuturist 419\nABACHA: I cannot believe this, o. Finally, those cheap idiots are coming to carry me back to Naija. All it took were some events. First, my cousin Bakare in Nigeria finds out about me. Then, instead of trying to get me rescued, he puts out a 419 scam. Then the damn thing goes viral, letting the world know I’m stranded in space. [Scoffs] I saw the letter; they sent it to me.\nSCAM LETTER: In the 14 years since he has been on the station, he has accumulated flight pay and interest amounting to almost fifteen million American dollars…[Abacha groans with exasperation]\nABACHA: Hai! Olorun, o!! As if anybody will pay me that kind of money.\nSCAM LETTER: This is held in a trust at the Lagos National Savings and Trust Association. If we can obtain access to this money, we can place a down payment with the Russian Space Authorities for a Soyuz return flight to bring him back to Earth. This will cost three million American Dollars. In order to access his trust fund we need your assistance . . .\nABACHA: Using me for scams, while I’m stuck here! And the letter sounds like something written by a selfish constipated robot. Now people will think I am so rich. And this space station isn’t even Russian. Oh cousin Bakare, you will see me when I get home.\nAfricanfuturism. I learned this word just before I left. Blacks who love space and the future—like Sun Ra, P-Funk, black-rooted scifi. I am true African Africanfuturism. Unlike any of those guys, I actually left the Earth to see what was out there. Did I know that I will be seeing it for 14 goddamn years?[A creepy chittering (rat-like) sound and then the sound of scraping (like claws on paper) from the left]\nABACHA: Ugh, I hope that noise is getting recorded. [PAUSE] The rest of the crew said they mistook cargo for me and that’s how they left me behind. Really? Even when I sit very still, I do not look like luggage! The truth? The crew thought I was dead and left; then, when they realized I wasn’t, it was cheaper to forget about the African they left in space. I won’t say more until I’m back on Earth in my country.\nMy mother warned me. “Better to stay home and eat gari and egusi soup than to look into the home of gods,” she said. You know what I miss most? Real food. Jollof rice. Isi ewu. Pepper soup. Suya. And the babes; Oh my goodness, Nigerian babes! [SAD] I feel like a dead man out here.[Chittering sound then the sound of something breathing heavily, this time closer]\nABACHA: Oh my God, whatever you are, do not carry yourself and manifest now. Soon, I’ll leave here; you can have the place to yourself, o! [PAUSE] I went out and collected many rocks. I’ll bring back and sell on the roadside. [LAUGHS] Which kind stones be dis? Na space stone. Space stone get value pass gold and diamond! Na so I go talk . . . Buy space stone! It is good in making powerful charms! [PAUSE] Ah ah . . . this noise again . . . Maybe this thing got in when I went out to collect the stones, o.[Chittering, then heavy breathing, very close]\nABACHA: Shut up! Let me finish this log entry, nah. [He speaks more urgently, now. The thing is right behind him] These people better come get me soon. And if this damn thing that’s been here with me the last ten days kills me, kindly tell my cousin I still love him. I still love you, Bakare. [WHIMPERS] But hold on. [He’s out of breath with fear and speaking quickly] I am coming home. Then we will talk. You and your goddamn Africanfuturist 419. Why didn’t you try to get me home sooner! Instead you just want to use me to chop people’s money.[DING]\nAOL AUTOMATED VOICE: You’ve got mail.\nABACHA: Ah, they’ve sent me another message. I will read it now. They’d better really be coming. And quick, quick, too![Chittering. Something falls over]\nABACHA: Dammit!\nWhether the release of this entry will be viewed as the family breaching the contract signed with Spaceflight Services Inc. and cause the rescue mission to be scrapped is unknown. However, the world needs to know what happened to Abacha and the hope in publishing this here is that it’ll expose this situation to the world.\nLet’s not have Abacha become yet another hashtag. Let’s all help to pressure Spaceflight Services Inc. to bring Abacha home alive and well.\n--End Story--\n--Reported by Nnedi Okorafor--\n--Audio by Tchidi Chikere--\n--Engineered by Robin Warren--\nNnedi's novels include Lagoon (finalist for Best Novel in the British Science Fiction Association Award), Who Fears Death (winner of the World Fantasy Award for Best Novel and Le Prix Imaginales for Best Translated Novel), Akata Witch (an Amazon.com Best Book of the Year), Zahrah the Windseeker (winner of the Wole Soyinka Prize for African Literature), and The Shadow Speaker (winner of the CBS Parallax Award).\nHer short story collection Kabu Kabu was a Publisher's Weekly Best Book for Fall 2013. Her adult novel The Book of Phoenix (a prequel to Who Fears Death) was released in May and received rave reviews from The New York Times, The Chicago Tribune and more. Nnedi's novella, Binti her first story set in outer space recently won both the 2016 Nebula Award and the 2016 Hugo Award for Best novella. Lastly, her much anticipated young adult novel Akata Witch 2: Breaking Kola will be released in 2016.", "source": "https://clarkesworldmagazine.com/okorafor_11_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Africanfuturist 419 by Nnedi Okorafor"}