{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kali Wallace", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "O8tktMgqDptLc6Ki4C4LlVAltPY=", "id": null, "license": null, "comments": "", "raw_text": "6840 words, short story  First Light at Mistaken Point  A low mist clung to the river and laced through the trees, thinning as dawn washed the forest from gray to gold to green. The road dipped into a hollow, lifted again into sunlight. Charlie was reaching for her sunglasses when her phone rang. She started, fumbled through her purse, but by the time she unearthed the phone it was quiet. She glanced at the screen. Sandeep. 6:53 AM.  A call before seven meant something was happening in Houston, something important enough to disturb her on the weekend of her mother’s funeral. She spent too long staring at the phone, not watching the road, until a flash of motion caught her eye. She jerked the wheel to the right as a slow-moving pickup passed in the opposite lane. The truck was gone as quickly as it had appeared, the rumble of its diesel engine fading.  Charlie rubbed her eyes and willed her heart to slow. It was fine. She hadn’t been in the wrong lane. Mom would have called it an inches-seconds moment, and she would have laughed. Inches one way, seconds another, and everything would have been different. Nothing had happened.  The road curved along the river. She rubbed her eyes again. She was so tired of her throbbing head, the sickly roil of too much coffee and too little food in her stomach, the iron tension in her shoulders and back. On the left she saw the red Pennsylvania Dutch barn where Mom had dragged her to a community yard sale a few years ago. The farm was abandoned now; the barn door hung open, a black slice in the red. She had missed the turn. Her own mother’s house and she had driven right by.  She pulled over, checked for nonexistent traffic, backtracked a few hundred yards to the bright purple mailbox at the end of Mom’s driveway. Long grass whipped the underside of the car, and the little blue house emerged from the wall of green. The door was red, the shutters blinding yellow. Mom had, in her last few years, surrounded herself with color and light, rainbows and flowers, any hue or pigment that caught her eye. There was a line of pinwheels marching through the flower beds beneath the front windows, unmoving in the morning air.  Charlie’s phone beeped as she parked beside Cath’s car. A text from Sandeep: new transmission 6:29 am. 47 seconds.  Forty-seven seconds. Something squeezed in Charlie’s chest. The first message had been four seconds, and no matter what they told the press and the public, that wasn’t long enough for them to learn anything useful.  A month ago, three weeks before Intrepid was due to settle into orbit around Mars, mission control had lost contact with the ship. Telescopes confirmed it was right where it was supposed to be, but they received no telemetry, couldn’t make audio contact, and had no response when they queried the ship’s computers. All communication with Intrepid had stopped, and nobody could figure out why. Fingers of blame had pointed in every direction, but mostly at Charlie and her team. For Intrepid to fall silent, there had to be a problem with the shipboard radios—her system, her design—as well as the backups, the secondary backups, the spare parts, anything and everything that might be scavenged or repurposed for a replacement.  However unlikely it was, that cascade of failures is well beyond the scope of bad luck or coincidence, it was better to believe there was something wrong with all of Intrepid’s communication systems than to consider the possibility that there might not be anybody alive to use them.  Then, six days ago, Intrepid had finally called home. But exclamations of relief had quickly given way to bewilderment: the transmission was brief and unintelligible. Four seconds of noise. Nobody was even sure whose voice it was, much less what they were saying. They had been waiting for a second message ever since.  Forty-seven seconds. Long enough for words. Long enough for answers.  She snapped out of her seatbelt and called Sandeep back.  He picked up at once. “I’m sending you a file right now.”  “What can you hear?” Charlie asked. In the twenty minutes since the message had arrived, everybody at MCC would have listened to it twenty times. They would be clustered around workstations with mugs in hand, bleary-eyed but talking nonstop. The arguments wouldn’t have erupted yet. Give it another half an hour, another pot of coffee, time for the commuters to arrive and the office cot-sleepers to wake. Everybody was on edge. All week there had been shouting, tears, blame, and that was with only four seconds.  “It’s clearer than the other,” Sandeep said, “but not by much. We can identify a voice this time.”  The hair on the back of Charlie’s neck rose. “Who?”  “Harris, we think,” Sandeep said. “We’re pretty sure it’s him. Definitely a man, but Hattendorf says—well. It doesn’t matter what he says.”  “What? What does he say?”  “Hatt says it sounds like Dr. Rivers.”  Charlie blinked. “Rivers?”  “That’s what he says.”  Dr. Rivers had been the original mission doctor, but he had been replaced before launch. His heart, the doctors said, was cause for concern. A single medical test had grounded him, and Lisa Huerta had taken his place. Nobody was supposed to be thrilled that Rivers was off the mission, least of all Lisa, who was his friend. But after the decision, Charlie and Lisa had retreated to Charlie’s apartment with a bottle of champagne. Their relationship had been new, their future uncertain, and now they would spend years separated by millions of miles. It didn’t matter. Rivers’ bad luck was Lisa’s chance of a lifetime. It was her dream come true, and Charlie had been thrilled for her, happier than she’d had words to convey.  “Rivers is with his family in Atlanta,” Charlie said slowly. “On Earth. He was on MSNBC yesterday. Hatt knows that, right?”  Sandeep laughed uneasily. “He knows. He’s just—he needs sleep. We all need sleep.”  “But that’s—” She couldn’t handle Hatt’s nonsense right now. “Tell him to stop wasting everybody’s time. You think it’s Harris.”  “Yeah. Yeah, it’s definitely Harris.” A pause, and Sandeep added, his tone soft, “A man for sure, anyway.”  The gentle apology in his tone made Charlie’s skin crawl. Sandeep didn’t need to coddle her, even so obliquely. Brian Harris was mission commander; it was protocol for him to make the report, if possible, when something went wrong. His was the voice they were all expecting to hear. Charlie’s own dark fears and aching hopes had nothing to do with it.  “Anything else?” she asked.  Sandeep exhaled. “Maybe. I don’t want to bias you before you listen.”  “Talk to Inez about tweaking her noise algorithm using the first—”  “She’s on it,” Sandeep said.  “Good.” There was a sour taste at the back of Charlie’s throat. She couldn’t do anything from Virginia. “I’ll give it a listen and—”  The red door opened, and Cath stepped onto the porch. Her hair was pulled back from her face, and in one hand she held rubber gloves the same bright yellow as the shutters. Yesterday at the funeral, standing there alone in her black dress and pearls, Cath had looked so much like their mother that Charlie had stumbled in surprise, and a wild impossibility had skittered through her mind: I knew it was a mistake, I knew she wasn’t gone. Before that moment it had been three years since Charlie and Cath had seen each other in person. They communicated by sporadic text, brief email, and most of all through their mother, who had accepted her position as nexus between daughters with a sigh and a sad smile.  “Charlie?” Sandeep said. “How are you doing? How was the funeral?”  “It was fine. It was good.” Charlie winced. “I don’t mean good. I mean . . . . Everybody loved Mom. Half the university was there. They’re even talking about making a Helen Rush scholarship for paleontology students.”  “That’s nice. That’s really nice.”  “It is. Look, my sister is waiting, I have to—”  “Oh, sure, definitely.” Sandeep cleared his throat. “Don’t worry about it.”  “Send me the audio now, just so I can hear it.”  “Will do. Just to warn you, it sounds pretty bad, but it’s—”  “Better than silence. I know.”  “It is, Charlie,” he said earnestly. “They’re alive.”  “I know.”  “See you tomorrow?”  “Tonight. Talk to you later.” Charlie hung up.  It was what they had been saying all week, in the anxious chaos of MCC, in the public spectacle of press conferences and interviews: It’s better than silence. At least we know they’re alive. It’s better than silence. Charlie couldn’t remember anymore if the words were supposed to be a comfort.  She stepped out of the car, and a symphony of morning birdsong surrounded her.  “I thought you had to go back to Houston,” Cath said.  “My flight’s this afternoon. I can help for a little bit.”  “It’s going to take a while to get all this stuff sorted out. I forgot she had so much shit.”  Cath held the screen door open, and Charlie paused before stepping in, wondering if her sister’s outstretched arm was offering a hug, wondering still when Cath dropped her arm. When Cath had called from the hospital earlier that week, Charlie had been at work, listening to four seconds of gibberish over and over again until it became a steady hum beneath every moment, and her first thought upon hearing that Mom had died in her sleep was: It’s too soon.  Her second thought, more shameful: I don’t have time for this.  Charlie wanted to ask why Cath was here by herself, but she knew the answer, and Cath wouldn’t welcome the question. Cath’s husband Walter was not the sort of man who would consider the funeral of a mother-in-law he had never liked reason to interrupt his weekend, and he would certainly never lower himself to scrubbing floors or packing boxes. When they were still speaking regularly, Cath used to complain to Charlie—laughing, like it was a charming quirk—that Walter couldn’t find a dishwasher or laundry hamper if his life depended on it.  The inside of the house was cool, a little humid; the windows were open and the mist had invited itself in. Charlie brushed her fingers over a flat stone on the table inside the door: a single trilobite in dense gray shale, as long as her hand from head to tail. Ever since she was a child she had been fitting her palm to that fossil, pressing into the ripples of the creature’s carapace and spines. When she was little she had imagined she could feel it moving beneath her fingers, a lightning-fast twitch nobody could see.  “The news was saying you heard from the crew again. Any truth to that?” Cath asked.  “I’m surprised it’s on the news already,” Charlie said. “It just came in.”  Cath lifted a single eyebrow. At fifteen she had practiced that expression in the mirror until she mastered it; Charlie had stood beside her, four inches shorter and two steps behind, trying just as hard, never succeeding. “It’s all they talk about anymore. Nobody can decide if it’s a hoax or a conspiracy or aliens or whatever. What’s the new message say?”  “I haven’t listened to it yet. Apparently it’s hard to make out.” A glance at her phone: the file had nearly finished downloading.  “But it’s a good sign, isn’t it?” Cath asked. “At least you know they’re still alive.”  “It’s better than silence,” Charlie said.  Cath started to say something, changed her mind, and gestured to the house around them. Her wedding ring glinted in a shaft of sunlight. “I started in the kitchen. I was going to get to work in here, but this . . . . The department said they’d take all this for the museum, so I guess we just put it in boxes. Same with the books.”  The front room of their mother’s house was lined with bookshelves, and crammed in with the books, slotted into every spare space, were the fossils. They spilled over to cover the end tables and fireplace mantle, into shoe boxes on the floor and bowls on the window sill. Shells in spirals and fans, flattened fish with needle-thin bones and delicate impressions of fins, one massive flat chunk of stromatolite lumps like cobblestones. Nautiluses and trilobites and spidery sea stars and mashed jumbles of insects smothered in ancient clay, eaten away by water and time until nothing remained but the stone ghosts of their exoskeletons. Charlie recalled the names like she remembered grade school friends, old words unused but not forgotten: Aspidella, Spriggina, Cloudina.  Nothing rare or valuable, Mom had always said with a self-conscious laugh. Nothing anybody would begrudge an old woman for hoarding like a dragon on a pile of gold. Some were smeared with a brand of white and Mom’s handwriting in neat block letters; some had names, locations, dates, or only a letter and a number. Somewhere in the room, maybe beneath the sloping stack of field notebooks on the desk, there might be a catalog. Many had no labels at all. This had always been their mother’s landscape: history as a jumble of soft tissue turned to stone, evolutionary happenstance preserved for accidental eons, names and places and ages only occasional anchors, more forgotten in dusty corners than remembered in the open.  The cluttered room made Charlie’s hands itch. Cath gave her a pitying look and a cardboard box.  “You can do the bedroom,” she said. “All the clothes are going to Goodwill, unless you find anything you want.”  Charlie glanced into the guest room as she passed. Cath’s overnight bag was open on the bed, her funeral dress hanging on the closet door. She hadn’t known Cath was staying here. She hadn’t thought to ask.  In their mother’s room Charlie sat on the edge of the bed with her phone in hand. She opened the audio file. The initial burst of sound was so loud she jumped, thumbed the volume down, paused the playback. There were no footsteps in the hall, no sign Cath had heard. Her heart was racing. Seconds had never seemed so precious to Charlie until they became her only measure of the teetering balance between hope and despair. She hit play again.  The message began with a deep hum that lasted an uncomfortable five seconds.  That’s Brian, Charlie thought. Her throat hurt. It was really him.  That low hmm was a drawn-out version of the same sound Brian Harris made every time he cleared his throat before speaking. At countless press conferences before launch, at the start of every audio message he sent back to Earth, he always made the same noise. One of the fussy PR men had complained about it once, said, “Can’t we get him to stop doing that? It makes him sound slow.” The young man had been so disapproving behind his horn-rimmed glasses, and there had been glances around the room, across the table, until finally somebody—Charlie couldn’t remember who—had said, “The man’s a NASA astronaut going to Mars. He’s a fucking genius. He can talk however the hell he wants.” Laughter, real from the scientists, feigned from the PR guy, and the subject was dropped.  Six seconds of silence followed the opening hmm. Charlie nudged the volume back up. In the background she heard faint murmurs that might be conversation just beyond the edge of comprehensibility, or it might be mechanical noise, or nothing at all. Her phone speaker was no good. Everything useful was stripped out of this file. She needed the data. She needed her equipment. She needed to be at work.  Then Brian’s voice returned, but his words were broken, unintelligible, rising and falling in a singsong rhythm. There was a waver that might have been someone or everyone. A quiver that could be time or fine. Charlie passed her phone from one hand to the other, held it closer to her ear.  Another noise whispered in the background, half a beat behind. Instrument feedback. An echo.  No. It was a woman’s voice.  Charlie closed her eyes. It felt like sandpaper scraping over her corneas.  Intrepid had left Earth eight months ago. A small fraction of a single life, less than a blink in the history of humankind, nothing at all to the incomprehensible span of the universe. But it was time enough for the sound of a voice over a radio to replace the memory of a whisper in her ear, for the sight of a face framed by a camera to grow more familiar than a smile in morning sunlight. For the memory of hands clasped, the tickle of soft hair on a bare shoulder, warm bodies curled together, companionable silences beneath the night sky to fade, fade, fade.  Lisa had said, “We’ll figure us out when I get back.” And Charlie had agreed, and they had both laughed, mapping the geologic slowness of Charlie’s emotions, the epochs and eras it took for her to understand what she was feeling. Space and time contracted with a kiss, expanded with a goodbye, and two years and a hundred million miles were supposed to be enough.  The recording ended. Forty-seven seconds. Such a small snippet, and alone, to have made its way through the vacuum to Earth. These garbled noises made no more sense than the previous four seconds. When Charlie had let her mind wander these past few days, exhaustion nudging her from reason to fantasy, she found herself imagining something in the space between Earth and Mars—some thing, a curtain vast and dark, rippling in the solar wind, beyond sight, beyond sense, knowable only by the distortion it caused, by the wavelengths it absorbed and the cruel, tantalizing fragments it let pass.  She lowered the phone. Her thumb tapped play again, and she allowed a few seconds of the solemn hmm before she stopped it. She could listen a dozen times and she wouldn’t hear anything her team at mission control hadn’t already picked out and analyzed. She couldn’t do anything here, with the walls of her mother’s bedroom pressing around her, breathing with the silence of a house that had been abandoned for months. There were books on the nightstand and a sweater draped over the foot of the bed, as though Mom had stepped out moments ago, but she had been in the hospital since January.  Charlie stalked to the closet to strip clothes from hangers. With every garment a familiar scent drifted on the air, danced, and faded: the stuffy university library in cardigans with holes in the sleeves, pine trees and campfires in colorful scarves, fertilizer and garden soil in soft elastic-waist jeans. Never the most dedicated housekeeper, Mom had grown even more neglectful after retirement; piles of laundry expanded, stacks of dishes grew. Cath lived only an hour away, compared to Charlie’s half a continent, and she made the drive once a week to fret and scold, to coax Mom from the house for brunch, check her medications, shop for groceries.  “Your sister thinks I’m going to turn into one of those hoarders who gets buried beneath her own junk,” Mom had said cheerfully, one afternoon in the fall. She had been planting bulbs all morning and had called Charlie to tell her what flowers she would have in the spring. Daffodils, crocuses, hyacinths, and tulips, of course, although she had overdone tulips the previous year and could barely abide their smug sturdy posture and gaping mouths anymore. “But it just doesn’t seem so important anymore, fussing over clothes and cleaning and all those boring things. I’d rather be outside in the sun. Housework can wait.”  “She’s just worried,” Charlie had replied. She had been at work on a Saturday, and her attention was on Intrepid. That was before they lost contact, when the Mars mission had still been a string of unprecedented successes.  “You’d think an old lady taking up gardening wouldn’t make anybody worry, but that’s your sister for you,” Mom had said. “It’s funny, isn’t it? I spent my whole life digging up dead things, but now all I want is something alive all around me. You know, I never really understood why you were so obsessed with everything out there.” She always referred to space as out there. “Not when there are so many problems here. But then I remind myself that all those cold, dead places won’t be so cold and dead after you’ve sent your people there.”  And Charlie had said, “I guess that’s one way of thinking about it. Look, I have to go.”  She had spent half her life telling her mother she had to go: back to school, back to work, back to Houston, back to the people and projects that needed her. Mom had teased her about working too hard. She had never objected.  When the clothes were packed away, Charlie stood on her toes to pull boxes from the shelf. Jammed in with old shoes with the soles worn flat, apartment lease paperwork from twenty years ago, student theses in flimsy bindings, the collected detritus of a lifetime, she found a framed photograph of Mom’s parents. Grandma in a gold gown, Grandpa in a tux, standing before a flower-draped railing with glasses of wine, the ocean a deep twilight blue behind them.  Charlie barely remembered her grandparents. She had impressions of perfume-scented hugs, bleach-bright afternoons on the beach, sandwiches with too much mayonnaise, and listening from another room as they scolded Mom for not visiting more often, for not having a husband, for treating her daughters like friends rather than children, for dragging them all over the world like nomads.  They had died in a car accident the summer Charlie was nine, Cath eleven. At the funeral home, a woman Charlie didn’t know had pressed that photograph into Mom’s hands and said, “Take it. You may not think so now, but you’ll want to remember them someday.” It was the first time Charlie had glimpsed what her mother looked like to the family she had left behind.  Later, after the service and the cemetery, they had gone to the beach, Mom and Charlie and Cath. Charlie had pulled off her pinching new shoes and lace-cuffed socks to run barefoot at the edge of the water. A wave caught her by surprise and soaked the hem of her dress. She had walked up the sand, wringing out the fabric, to where her mother was watching with a handful of seashells in her palm.  “I want to go home,” Charlie said. Her nose was sunburned, the part of her hair hot to the touch.  “Not yet,” said Mom. “We’re going to Avalon.”  Charlie hadn’t thought about that summer in years, but the salt smell of the ocean came back to her now. She remembered how Mom had tossed the photograph of her parents into the back seat, where it slid to the floor between sleeping bags and backpacks. Mom had been planning the long drive to Newfoundland before they even left home. She was always planning another trip, another expedition, another escape. Her brittle silence hadn’t softened until they were heading north, crossing the border, heading north again through a long day and a long night. They had finally arrived at Mistaken Point just before dawn. Cath had stayed in the car while Charlie scuffed after their mother on the gray rocks beneath a vast dawn sky, shivering in the whipping sea wind.  She dropped the photograph and picked up her phone.  Hum, silence, words that were not words. She had no doubt now: it was Brian’s voice in the foreground, Lisa’s in the background.  She played it a third time. It didn’t sound like they were alarmed or panicking, but that was as frustrating as it was reassuring. A plea for help would tell her something new.  A fourth. Again she heard what might be everyone, might be everything. Again the sounds that followed rose to the edge of comprehensibility before swerving into musical gibberish like a child’s song run through a vocal distorter. Maybe it was a song. Rivers was always singing, he was known for it, they had come to expect it, and when she got home Lisa would be so relieved to hear from him—  A jumbling discordance filled Charlie’s mind, halting that thought with car-crash suddenness.  She started the message over before it reached the end.  She was letting Sandeep’s fussing and Hatt’s stupidity get to her. It didn’t even sound like Rivers. Who was with his family in Atlanta. She played the message to the end and missed Lisa so much it was a physical thing, a clinging vine of spines and thorns, tightening.  Her thumb hovered over the screen for another repetition, but the sound of footsteps in the hall stopped her.  Cath appeared in the doorway. “I’m making coffee. Want some?”  It took a moment for the words to penetrate the shimmering echo of the Intrepid’s message. “Yeah. Sure.”  “You okay?”  Charlie rubbed her mouth with the back of her hand. “I’m fine.”  Cath gave her a level look, unconvinced, but only asked, “Was all of this junk in the closet?”  “There was a lot jammed back there.” Charlie passed the photograph to her. “Remember this?”  “Hey, that’s Grandpa when he still had hair.”  Charlie’s most vivid memory of the man was of a waxy-pale husk in a coffin lined with blue silk, but Cath was looking at the picture with a fond smile, and as her words quivered through the air between them Charlie remembered: Alice. The woman who had given the photograph to Mom was named Alice, and she had been Grandma’s best friend since childhood. She had taken Charlie and Cath to the aquarium in Baltimore once when they were children. Charlie didn’t know how she could have forgotten. They had watched the jellyfish together for a long time, quiet in a dark room as the creatures drifted in restful blue.  “Do you remember after the funeral?” Charlie asked.  Cath glanced up. “Was that when Mom dragged us up to Canada and spent the entire drive lecturing us about those frond things she liked so much?”  “Yes. Same trip.”  Charlie didn’t remember Mom talking much during the drive, only long hours of tense silence. She remembered Cath saying, “God, Mom, I don’t care,” when they reached their destination, putting her headphones on and refusing to get out of the car. She remembered Mom taking her hand and leading her toward the shore in the cold bright morning, her professorial instinct taking over: half a billion years ago, the oldest complex lifeforms on Earth, before the beginning, before, before. The memory of her mother’s words melted into the singsong meter of the ship’s message.  She looked down, half expecting to find it playing again, but her phone was silent.  “Is that from Intrepid?” Cath asked. “Can I listen?”  Charlie clicked the screen off, feeling like she had been caught playing when there were chores to be done. “It’ll be released to the public later.”  “So play it for me. What are they saying?” Cath didn’t wait for an answer before turning away. “Come on. Coffee first, then you can tell me.”  Charlie hesitated only a moment before following her to the kitchen. She sat at the table while Cath plucked mugs from a half-packed box.  “So what do they have to say?” Cath asked.  “We’re not sure yet. It’s hard to hear anything clearly.”  “Now I’ve really got to hear it. I’m good at figuring out gibberish. Lots of practice.”  “It’s gibberish because it’s been sent across fifty million miles of space by damaged equipment, not because it’s a secret coded love poem in medieval Polish. Not exactly your area of expertise.”  Cath stilled, hand on the faucet, and Charlie regretted her words. She didn’t mean to needle. It was a mean-spirited reflex, the same thoughtless instinct that had put years of barbed wire separation between them. Three years ago she had accused Cath of abandoning her dreams for an unfaithful man, and Cath had accused Charlie of never sacrificing anything for anyone. It should have passed, would have passed any other day, but that day years of disagreements and choices had exploded into a fight, and the fight, when it ended, whimpered meekly into a long uneasy holding pattern, the space between them littered with traps and pitfalls they both chose to avoid rather than navigate. It was true that Cath had quit graduate school when she had married, insisting it was exactly what she wanted. She had never welcomed Charlie’s observation that what Cath wanted was always precisely what Walter had wanted first, no more than she had welcomed Mom’s jokes about cosmic balance requiring their family to have at least one useless humanities scholar amongst the scientists. Charlie had known these things. She had known when they were first finding their way, and when they grew through their twenties and thirties, Cath married and Charlie more solitary than not, the choices they made as young women fading into acceptance or regret, the future ossifying into routine. She had known when Cath told her about Walter’s latest indiscretion three years ago. She had taunted Cath about it anyway.  But this time, Cath let it pass unremarked. She set the mugs on the counter; she had taken off her wedding ring.  “Maybe not,” she said, “but I want to hear it anyway.”  Charlie played the recording. She tensed through the initial rumble of noise, clenched her teeth through the seconds of silence that followed. Cath opened her mouth, but Charlie quieted her with gesture. The wordless chatter started again, high tones and low, a singsong back and forth. Brian’s voice, Lisa’s voice. She was growing more confident that Brian was saying, “Everyone’s fine.” It would be clear when the raw audio was processed.  When the recording ended, a flicker passed over Cath’s face, more shadow than flinch. “That’s . . . odd. Play it again?”  Charlie obliged.  “Are they really going to make that public?” Cath asked. She pulled out a chair to sit across from Charlie.  “Nobody will believe how hard it is to understand if we don’t,” Charlie pointed out. “You know how people are. They’ll say we’re—”  “It sounds like they’re saying, ‘Everybody’s dying.’ ”  “What?” Charlie looked at her sharply. “That’s not what they’re saying.”  “That’s what it sounds like.”  “It’s not. He’s saying they’re fine. ‘Everything’s fine.’ You have to listen closely.”  “I am listening closely. Play it again,” Cath said.  “I’ve listened to it five times. I know what they’re saying.”  “Then let me hear it again.”  Charlie shook her head. “No. This is low-quality audio on a crappy speaker. If I was at my lab I could—I could—”  She stared at the phone and the scarred table beneath it. For several seconds she heard nothing but the splutter of the coffee pot and drip of the kitchen faucet. It had dripped for years. Mom had always said she was going to fix it.  “We’re cleaning it up,” Charlie said, her voice hoarse. “You can’t draw conclusions from this.”  Brian’s voice, Lisa’s voice. The conclusions were already barbed in her throat.  “Okay,” Cath said.  “We should get back to work.”  “Charlie.”  “The bedroom’s almost finished. I can—”  “I know you’d rather be there. I don’t blame you.” Cath reached across the table, hesitated before touching the back of Charlie’s hand. Charlie twitched but didn’t pull away. “I know it’s not just your job. They’re your friends, aren’t they? I can’t even imagine how scared you must be for them.”  Cath rose to pour the coffee for both of them—black, bitter, their mother’s preference passed down. A different Charlie, a sister who could meet Cath halfway, would say, “Not only friends.” She would say Lisa’s name and let the fear in her voice invite Cath’s questions. A different Charlie would have already said the words, sometime over the past three years. She would have already opened the door.  “Mom would want you to be there,” Cath said. “She always told everybody you were changing the fate of the human race. Somebody’s got to do it, she said, and she knew it was going to be you. She had them all trained to turn on the news for mission updates.”  “I didn’t mean,” Charlie began, but she stopped, unsure where that sentence led.  “She’d say, ‘Let’s hear about Charlie’s astronauts. Let’s see what they’re up to today.’ The nurses got sick of it, but she never got tired of bragging about you. And when the ship lost contact . . . . ” Cath was looking at the table, her eyes unfocused. “That’s what she told them to explain why you didn’t visit much. She never wanted me to tell you to come.”  “I would have said I was too busy anyway,” Charlie said. Her guilt was a bright stinging thing, sunlight on a mirror.  “You should see if you can get an earlier flight. They need you, don’t they?” Cath gestured toward the window with her coffee mug, as though all of time and space were waiting in the trees outside. “It’s important. I understand.”  Cath’s voice was even, but Charlie still felt she was prodding at her with the question, looking for her soft fleshy underside. She remembered, in a flash like light through a prism, Mom once saying, “Funerals aren’t for the dead, honey. They’re for the living.” The same could be said of fossils, or starlight, remnants of a dead past rippling through the present.  “They can manage for a few hours,” Charlie said.  “But they need you. Go. I can handle this. Jeff will be over soon to help anyway.”  “Jeff? Who’s Jeff?” Charlie asked, confused.  “You met him at the funeral yesterday, remember? After you’ve been pestering me about him for months.”  Cath had been alone at the funeral. Head held high, black dress and pearls making her look so much like Mom, and alone. There had been nobody at her side. Charlie pressed her lips together, swallowing back an acid churn of nausea. Cath wasn’t wearing her wedding ring. They hadn’t spoken about anything so intimate as friends or lovers in three years, but she wouldn’t have missed a separation or divorce. She wouldn’t have missed a whole person standing beside her sister at their mother’s funeral.  “You talked to him for at least twenty minutes?” Cath went on, voice lifting uncertainly. “And you told me afterward that you approved? Because he didn’t try to play the conspiracy theory guessing game with you, he just said that hearing from Intrepid after so long must be—”  “Better than silence,” Charlie said.  Cath’s smile was watery, relieved. “Yeah. I guess I didn’t tell you how serious it was, but I don’t think I really knew, not until—well. He showed up. He stayed. He’s coming over to help, which is something that asshole we don’t talk about anymore never would have done.”  Three years ago, before their conversation had devolved into an argument, when Cath’s voice was still wet with hurt and Charlie had not yet loosed the careless words she would later regret, she had asked, “Are you going to leave him?” Cath had hesitated—knowing silence vibrated between them—and Charlie had held her breath, thought, say yes, and finally, and please, hopes formed with the strength of commands but never spoken, waiting for the second it took for Cath to answer one way, or the other.  “Yeah. Yeah. That’s—good. That’s.” Charlie gulped her coffee and pushed back her chair. “I’ll finish the bedroom. I can—I’ll do that before I go.”  She fled down the hall again. The guest room door was still open, but there was no sign of Cath’s bag or funeral dress. The bed had been stripped, the closet cleared. Charlie took a few slow breaths. Dust motes danced in sunlight. There was a pressure building behind her eyes, a dull pain reminding her how little she had slept all week. She didn’t need to ask. She had only glanced through the door before. There was no reason for Cath to stay here anyway.  In her mother’s room she played the message again. She breathed through the hum and the silence, and when the voices picked up—two of them, entwined—she closed her eyes. Thought about Cath at the funeral, black dress, pearls, alone. The space beside her wavered, like lake water disturbed from below, and by the time the message rolled through everything, stuttered over fine, there was a man where there had been emptiness. He had always been there. She had forgotten. She had only forgotten.  With unsteady hands Charlie disgorged the rest of the closet into cardboard boxes, taped them up and labeled the sides, and she did not listen to the message again. She dumped piles of old paperwork into a trash bag, and she made a mental list of what she could do when she returned to mission control. She folded the sheets and blankets, and she kept her phone in her pocket. She layered trinkets and books in a box with the photograph of their grandparents, and she remembered the beach, the wet slap of waves on her legs. She swept the floor, and Intrepid’s message sang beneath her thoughts.  When Charlie returned to the kitchen, purse over her shoulder and keys in hand, Cath was looking through the window over the sink. All around her the kitchen cupboards were open and empty. The air smelled of bleach.  “What was the name of that place?” Cath asked without turning. “In Canada, where we went after Grandma and Grandpa’s funeral?”  “Mistaken Point,” Charlie said. As she said it, uncertainty clouded her words. That was the name she remembered, but what was a place name but noise attached to a landscape, a whipping flag clinging to an ageless continent. She added, softly, “Mom called it Avalon.”  “Right. She dragged us along those rocks all morning. It was foggy, right? Almost raining. We didn’t have the right clothes. She was so excited.”  Charlie didn’t remember Cath walking with them on the seashore. She remembered that it had been her and Mom alone, Cath left in a sulk in the car. She remembered sunlight when dawn broke, a painters’ sky so perfect the possibility it might not have been real filled her with a dread so powerful it tasted like despair.  “I have to go,” she said.  “You know she was never mad at you for being obsessed with your work,” Cath said. “She understood. She liked that you took after her.”  On her way out the door, Charlie stopped to touch the trilobite fossils as she always did. Hand to stone, fingertips to head, palm to thorax, wrist to the long spiny fan of a tail. There were two creatures preserved in the sample, crossed like clasped hands, dead together for five hundred million years. A slide of seafloor mud inches away, a silent underwater scurry seconds later, and they might have been buried alone.  “You should take them,” Cath said. She was watching from the kitchen doorway. “Those little guys were always your favorites.”  Charlie wrapped the slab of stone in a plastic bag before she said goodbye.  She was a mile from the house and slowing for a bend in the road when a tremble passed through her, sudden as a summer storm. Her hands began to shake; her breath grew short. She pulled onto the grass-choked shoulder and rolled down the window, gasping at the warm fresh air. She closed her eyes. Carefully, mindful of the horn, she rested her head against the steering wheel. The taste of coffee lingered on her tongue.  She sat there for five minutes, ten, foot on the brake, engine running. Through the window she heard birds, a breeze in the trees, a single car passing. The gentle sounds Mom had sought after decades of students and department meetings and field expeditions. A different daughter would have admired the comfort she found in that peace. It was the rooted calm Mom had craved after a lifetime of wandering, a slowness she had never admitted she needed, and she’d had only a few years to enjoy it. A different daughter would have helped plant the garden.  Charlie picked up her phone from the passenger seat. She dug through her purse for the power cable, plugged it in. She set the audio file to repeat and tapped play. A burst of sound, a breath of silence. A voice she did or did not recognize. Another she did or did not love. Forty-seven seconds beginning to end. Everybody’s dying, everybody’s fine. The mist was gone from the river, the water glinting in sunlight, the trees a mottled canvas of deepening green. She checked her mirror, checked both directions, and pulled onto the road again. The recording started over.", "text": "6840 words, short story\nFirst Light at Mistaken Point\nA low mist clung to the river and laced through the trees, thinning as dawn washed the forest from gray to gold to green. The road dipped into a hollow, lifted again into sunlight. Charlie was reaching for her sunglasses when her phone rang. She started, fumbled through her purse, but by the time she unearthed the phone it was quiet. She glanced at the screen. Sandeep. 6:53 AM.\nA call before seven meant something was happening in Houston, something important enough to disturb her on the weekend of her mother’s funeral. She spent too long staring at the phone, not watching the road, until a flash of motion caught her eye. She jerked the wheel to the right as a slow-moving pickup passed in the opposite lane. The truck was gone as quickly as it had appeared, the rumble of its diesel engine fading.\nCharlie rubbed her eyes and willed her heart to slow. It was fine. She hadn’t been in the wrong lane. Mom would have called it an inches-seconds moment, and she would have laughed. Inches one way, seconds another, and everything would have been different. Nothing had happened.\nThe road curved along the river. She rubbed her eyes again. She was so tired of her throbbing head, the sickly roil of too much coffee and too little food in her stomach, the iron tension in her shoulders and back. On the left she saw the red Pennsylvania Dutch barn where Mom had dragged her to a community yard sale a few years ago. The farm was abandoned now; the barn door hung open, a black slice in the red. She had missed the turn. Her own mother’s house and she had driven right by.\nShe pulled over, checked for nonexistent traffic, backtracked a few hundred yards to the bright purple mailbox at the end of Mom’s driveway. Long grass whipped the underside of the car, and the little blue house emerged from the wall of green. The door was red, the shutters blinding yellow. Mom had, in her last few years, surrounded herself with color and light, rainbows and flowers, any hue or pigment that caught her eye. There was a line of pinwheels marching through the flower beds beneath the front windows, unmoving in the morning air.\nCharlie’s phone beeped as she parked beside Cath’s car. A text from Sandeep: new transmission 6:29 am. 47 seconds.\nForty-seven seconds. Something squeezed in Charlie’s chest. The first message had been four seconds, and no matter what they told the press and the public, that wasn’t long enough for them to learn anything useful.\nA month ago, three weeks before Intrepid was due to settle into orbit around Mars, mission control had lost contact with the ship. Telescopes confirmed it was right where it was supposed to be, but they received no telemetry, couldn’t make audio contact, and had no response when they queried the ship’s computers. All communication with Intrepid had stopped, and nobody could figure out why. Fingers of blame had pointed in every direction, but mostly at Charlie and her team. For Intrepid to fall silent, there had to be a problem with the shipboard radios—her system, her design—as well as the backups, the secondary backups, the spare parts, anything and everything that might be scavenged or repurposed for a replacement.\nHowever unlikely it was, that cascade of failures is well beyond the scope of bad luck or coincidence, it was better to believe there was something wrong with all of Intrepid’s communication systems than to consider the possibility that there might not be anybody alive to use them.\nThen, six days ago, Intrepid had finally called home. But exclamations of relief had quickly given way to bewilderment: the transmission was brief and unintelligible. Four seconds of noise. Nobody was even sure whose voice it was, much less what they were saying. They had been waiting for a second message ever since.\nForty-seven seconds. Long enough for words. Long enough for answers.\nShe snapped out of her seatbelt and called Sandeep back.\nHe picked up at once. “I’m sending you a file right now.”\n“What can you hear?” Charlie asked. In the twenty minutes since the message had arrived, everybody at MCC would have listened to it twenty times. They would be clustered around workstations with mugs in hand, bleary-eyed but talking nonstop. The arguments wouldn’t have erupted yet. Give it another half an hour, another pot of coffee, time for the commuters to arrive and the office cot-sleepers to wake. Everybody was on edge. All week there had been shouting, tears, blame, and that was with only four seconds.\n“It’s clearer than the other,” Sandeep said, “but not by much. We can identify a voice this time.”\nThe hair on the back of Charlie’s neck rose. “Who?”\n“Harris, we think,” Sandeep said. “We’re pretty sure it’s him. Definitely a man, but Hattendorf says—well. It doesn’t matter what he says.”\n“What? What does he say?”\n“Hatt says it sounds like Dr. Rivers.”\nCharlie blinked. “Rivers?”\n“That’s what he says.”\nDr. Rivers had been the original mission doctor, but he had been replaced before launch. His heart, the doctors said, was cause for concern. A single medical test had grounded him, and Lisa Huerta had taken his place. Nobody was supposed to be thrilled that Rivers was off the mission, least of all Lisa, who was his friend. But after the decision, Charlie and Lisa had retreated to Charlie’s apartment with a bottle of champagne. Their relationship had been new, their future uncertain, and now they would spend years separated by millions of miles. It didn’t matter. Rivers’ bad luck was Lisa’s chance of a lifetime. It was her dream come true, and Charlie had been thrilled for her, happier than she’d had words to convey.\n“Rivers is with his family in Atlanta,” Charlie said slowly. “On Earth. He was on MSNBC yesterday. Hatt knows that, right?”\nSandeep laughed uneasily. “He knows. He’s just—he needs sleep. We all need sleep.”\n“But that’s—” She couldn’t handle Hatt’s nonsense right now. “Tell him to stop wasting everybody’s time. You think it’s Harris.”\n“Yeah. Yeah, it’s definitely Harris.” A pause, and Sandeep added, his tone soft, “A man for sure, anyway.”\nThe gentle apology in his tone made Charlie’s skin crawl. Sandeep didn’t need to coddle her, even so obliquely. Brian Harris was mission commander; it was protocol for him to make the report, if possible, when something went wrong. His was the voice they were all expecting to hear. Charlie’s own dark fears and aching hopes had nothing to do with it.\n“Anything else?” she asked.\nSandeep exhaled. “Maybe. I don’t want to bias you before you listen.”\n“Talk to Inez about tweaking her noise algorithm using the first—”\n“She’s on it,” Sandeep said.\n“Good.” There was a sour taste at the back of Charlie’s throat. She couldn’t do anything from Virginia. “I’ll give it a listen and—”\nThe red door opened, and Cath stepped onto the porch. Her hair was pulled back from her face, and in one hand she held rubber gloves the same bright yellow as the shutters. Yesterday at the funeral, standing there alone in her black dress and pearls, Cath had looked so much like their mother that Charlie had stumbled in surprise, and a wild impossibility had skittered through her mind: I knew it was a mistake, I knew she wasn’t gone. Before that moment it had been three years since Charlie and Cath had seen each other in person. They communicated by sporadic text, brief email, and most of all through their mother, who had accepted her position as nexus between daughters with a sigh and a sad smile.\n“Charlie?” Sandeep said. “How are you doing? How was the funeral?”\n“It was fine. It was good.” Charlie winced. “I don’t mean good. I mean . . . . Everybody loved Mom. Half the university was there. They’re even talking about making a Helen Rush scholarship for paleontology students.”\n“That’s nice. That’s really nice.”\n“It is. Look, my sister is waiting, I have to—”\n“Oh, sure, definitely.” Sandeep cleared his throat. “Don’t worry about it.”\n“Send me the audio now, just so I can hear it.”\n“Will do. Just to warn you, it sounds pretty bad, but it’s—”\n“Better than silence. I know.”\n“It is, Charlie,” he said earnestly. “They’re alive.”\n“I know.”\n“See you tomorrow?”\n“Tonight. Talk to you later.” Charlie hung up.\nIt was what they had been saying all week, in the anxious chaos of MCC, in the public spectacle of press conferences and interviews: It’s better than silence. At least we know they’re alive. It’s better than silence. Charlie couldn’t remember anymore if the words were supposed to be a comfort.\nShe stepped out of the car, and a symphony of morning birdsong surrounded her.\n“I thought you had to go back to Houston,” Cath said.\n“My flight’s this afternoon. I can help for a little bit.”\n“It’s going to take a while to get all this stuff sorted out. I forgot she had so much shit.”\nCath held the screen door open, and Charlie paused before stepping in, wondering if her sister’s outstretched arm was offering a hug, wondering still when Cath dropped her arm. When Cath had called from the hospital earlier that week, Charlie had been at work, listening to four seconds of gibberish over and over again until it became a steady hum beneath every moment, and her first thought upon hearing that Mom had died in her sleep was: It’s too soon.\nHer second thought, more shameful: I don’t have time for this.\nCharlie wanted to ask why Cath was here by herself, but she knew the answer, and Cath wouldn’t welcome the question. Cath’s husband Walter was not the sort of man who would consider the funeral of a mother-in-law he had never liked reason to interrupt his weekend, and he would certainly never lower himself to scrubbing floors or packing boxes. When they were still speaking regularly, Cath used to complain to Charlie—laughing, like it was a charming quirk—that Walter couldn’t find a dishwasher or laundry hamper if his life depended on it.\nThe inside of the house was cool, a little humid; the windows were open and the mist had invited itself in. Charlie brushed her fingers over a flat stone on the table inside the door: a single trilobite in dense gray shale, as long as her hand from head to tail. Ever since she was a child she had been fitting her palm to that fossil, pressing into the ripples of the creature’s carapace and spines. When she was little she had imagined she could feel it moving beneath her fingers, a lightning-fast twitch nobody could see.\n“The news was saying you heard from the crew again. Any truth to that?” Cath asked.\n“I’m surprised it’s on the news already,” Charlie said. “It just came in.”\nCath lifted a single eyebrow. At fifteen she had practiced that expression in the mirror until she mastered it; Charlie had stood beside her, four inches shorter and two steps behind, trying just as hard, never succeeding. “It’s all they talk about anymore. Nobody can decide if it’s a hoax or a conspiracy or aliens or whatever. What’s the new message say?”\n“I haven’t listened to it yet. Apparently it’s hard to make out.” A glance at her phone: the file had nearly finished downloading.\n“But it’s a good sign, isn’t it?” Cath asked. “At least you know they’re still alive.”\n“It’s better than silence,” Charlie said.\nCath started to say something, changed her mind, and gestured to the house around them. Her wedding ring glinted in a shaft of sunlight. “I started in the kitchen. I was going to get to work in here, but this . . . . The department said they’d take all this for the museum, so I guess we just put it in boxes. Same with the books.”\nThe front room of their mother’s house was lined with bookshelves, and crammed in with the books, slotted into every spare space, were the fossils. They spilled over to cover the end tables and fireplace mantle, into shoe boxes on the floor and bowls on the window sill. Shells in spirals and fans, flattened fish with needle-thin bones and delicate impressions of fins, one massive flat chunk of stromatolite lumps like cobblestones. Nautiluses and trilobites and spidery sea stars and mashed jumbles of insects smothered in ancient clay, eaten away by water and time until nothing remained but the stone ghosts of their exoskeletons. Charlie recalled the names like she remembered grade school friends, old words unused but not forgotten: Aspidella, Spriggina, Cloudina.\nNothing rare or valuable, Mom had always said with a self-conscious laugh. Nothing anybody would begrudge an old woman for hoarding like a dragon on a pile of gold. Some were smeared with a brand of white and Mom’s handwriting in neat block letters; some had names, locations, dates, or only a letter and a number. Somewhere in the room, maybe beneath the sloping stack of field notebooks on the desk, there might be a catalog. Many had no labels at all. This had always been their mother’s landscape: history as a jumble of soft tissue turned to stone, evolutionary happenstance preserved for accidental eons, names and places and ages only occasional anchors, more forgotten in dusty corners than remembered in the open.\nThe cluttered room made Charlie’s hands itch. Cath gave her a pitying look and a cardboard box.\n“You can do the bedroom,” she said. “All the clothes are going to Goodwill, unless you find anything you want.”\nCharlie glanced into the guest room as she passed. Cath’s overnight bag was open on the bed, her funeral dress hanging on the closet door. She hadn’t known Cath was staying here. She hadn’t thought to ask.\nIn their mother’s room Charlie sat on the edge of the bed with her phone in hand. She opened the audio file. The initial burst of sound was so loud she jumped, thumbed the volume down, paused the playback. There were no footsteps in the hall, no sign Cath had heard. Her heart was racing. Seconds had never seemed so precious to Charlie until they became her only measure of the teetering balance between hope and despair. She hit play again.\nThe message began with a deep hum that lasted an uncomfortable five seconds.\nThat’s Brian, Charlie thought. Her throat hurt. It was really him.\nThat low hmm was a drawn-out version of the same sound Brian Harris made every time he cleared his throat before speaking. At countless press conferences before launch, at the start of every audio message he sent back to Earth, he always made the same noise. One of the fussy PR men had complained about it once, said, “Can’t we get him to stop doing that? It makes him sound slow.” The young man had been so disapproving behind his horn-rimmed glasses, and there had been glances around the room, across the table, until finally somebody—Charlie couldn’t remember who—had said, “The man’s a NASA astronaut going to Mars. He’s a fucking genius. He can talk however the hell he wants.” Laughter, real from the scientists, feigned from the PR guy, and the subject was dropped.\nSix seconds of silence followed the opening hmm. Charlie nudged the volume back up. In the background she heard faint murmurs that might be conversation just beyond the edge of comprehensibility, or it might be mechanical noise, or nothing at all. Her phone speaker was no good. Everything useful was stripped out of this file. She needed the data. She needed her equipment. She needed to be at work.\nThen Brian’s voice returned, but his words were broken, unintelligible, rising and falling in a singsong rhythm. There was a waver that might have been someone or everyone. A quiver that could be time or fine. Charlie passed her phone from one hand to the other, held it closer to her ear.\nAnother noise whispered in the background, half a beat behind. Instrument feedback. An echo.\nNo. It was a woman’s voice.\nCharlie closed her eyes. It felt like sandpaper scraping over her corneas.\nIntrepid had left Earth eight months ago. A small fraction of a single life, less than a blink in the history of humankind, nothing at all to the incomprehensible span of the universe. But it was time enough for the sound of a voice over a radio to replace the memory of a whisper in her ear, for the sight of a face framed by a camera to grow more familiar than a smile in morning sunlight. For the memory of hands clasped, the tickle of soft hair on a bare shoulder, warm bodies curled together, companionable silences beneath the night sky to fade, fade, fade.\nLisa had said, “We’ll figure us out when I get back.” And Charlie had agreed, and they had both laughed, mapping the geologic slowness of Charlie’s emotions, the epochs and eras it took for her to understand what she was feeling. Space and time contracted with a kiss, expanded with a goodbye, and two years and a hundred million miles were supposed to be enough.\nThe recording ended. Forty-seven seconds. Such a small snippet, and alone, to have made its way through the vacuum to Earth. These garbled noises made no more sense than the previous four seconds. When Charlie had let her mind wander these past few days, exhaustion nudging her from reason to fantasy, she found herself imagining something in the space between Earth and Mars—some thing, a curtain vast and dark, rippling in the solar wind, beyond sight, beyond sense, knowable only by the distortion it caused, by the wavelengths it absorbed and the cruel, tantalizing fragments it let pass.\nShe lowered the phone. Her thumb tapped play again, and she allowed a few seconds of the solemn hmm before she stopped it. She could listen a dozen times and she wouldn’t hear anything her team at mission control hadn’t already picked out and analyzed. She couldn’t do anything here, with the walls of her mother’s bedroom pressing around her, breathing with the silence of a house that had been abandoned for months. There were books on the nightstand and a sweater draped over the foot of the bed, as though Mom had stepped out moments ago, but she had been in the hospital since January.\nCharlie stalked to the closet to strip clothes from hangers. With every garment a familiar scent drifted on the air, danced, and faded: the stuffy university library in cardigans with holes in the sleeves, pine trees and campfires in colorful scarves, fertilizer and garden soil in soft elastic-waist jeans. Never the most dedicated housekeeper, Mom had grown even more neglectful after retirement; piles of laundry expanded, stacks of dishes grew. Cath lived only an hour away, compared to Charlie’s half a continent, and she made the drive once a week to fret and scold, to coax Mom from the house for brunch, check her medications, shop for groceries.\n“Your sister thinks I’m going to turn into one of those hoarders who gets buried beneath her own junk,” Mom had said cheerfully, one afternoon in the fall. She had been planting bulbs all morning and had called Charlie to tell her what flowers she would have in the spring. Daffodils, crocuses, hyacinths, and tulips, of course, although she had overdone tulips the previous year and could barely abide their smug sturdy posture and gaping mouths anymore. “But it just doesn’t seem so important anymore, fussing over clothes and cleaning and all those boring things. I’d rather be outside in the sun. Housework can wait.”\n“She’s just worried,” Charlie had replied. She had been at work on a Saturday, and her attention was on Intrepid. That was before they lost contact, when the Mars mission had still been a string of unprecedented successes.\n“You’d think an old lady taking up gardening wouldn’t make anybody worry, but that’s your sister for you,” Mom had said. “It’s funny, isn’t it? I spent my whole life digging up dead things, but now all I want is something alive all around me. You know, I never really understood why you were so obsessed with everything out there.” She always referred to space as out there. “Not when there are so many problems here. But then I remind myself that all those cold, dead places won’t be so cold and dead after you’ve sent your people there.”\nAnd Charlie had said, “I guess that’s one way of thinking about it. Look, I have to go.”\nShe had spent half her life telling her mother she had to go: back to school, back to work, back to Houston, back to the people and projects that needed her. Mom had teased her about working too hard. She had never objected.\nWhen the clothes were packed away, Charlie stood on her toes to pull boxes from the shelf. Jammed in with old shoes with the soles worn flat, apartment lease paperwork from twenty years ago, student theses in flimsy bindings, the collected detritus of a lifetime, she found a framed photograph of Mom’s parents. Grandma in a gold gown, Grandpa in a tux, standing before a flower-draped railing with glasses of wine, the ocean a deep twilight blue behind them.\nCharlie barely remembered her grandparents. She had impressions of perfume-scented hugs, bleach-bright afternoons on the beach, sandwiches with too much mayonnaise, and listening from another room as they scolded Mom for not visiting more often, for not having a husband, for treating her daughters like friends rather than children, for dragging them all over the world like nomads.\nThey had died in a car accident the summer Charlie was nine, Cath eleven. At the funeral home, a woman Charlie didn’t know had pressed that photograph into Mom’s hands and said, “Take it. You may not think so now, but you’ll want to remember them someday.” It was the first time Charlie had glimpsed what her mother looked like to the family she had left behind.\nLater, after the service and the cemetery, they had gone to the beach, Mom and Charlie and Cath. Charlie had pulled off her pinching new shoes and lace-cuffed socks to run barefoot at the edge of the water. A wave caught her by surprise and soaked the hem of her dress. She had walked up the sand, wringing out the fabric, to where her mother was watching with a handful of seashells in her palm.\n“I want to go home,” Charlie said. Her nose was sunburned, the part of her hair hot to the touch.\n“Not yet,” said Mom. “We’re going to Avalon.”\nCharlie hadn’t thought about that summer in years, but the salt smell of the ocean came back to her now. She remembered how Mom had tossed the photograph of her parents into the back seat, where it slid to the floor between sleeping bags and backpacks. Mom had been planning the long drive to Newfoundland before they even left home. She was always planning another trip, another expedition, another escape. Her brittle silence hadn’t softened until they were heading north, crossing the border, heading north again through a long day and a long night. They had finally arrived at Mistaken Point just before dawn. Cath had stayed in the car while Charlie scuffed after their mother on the gray rocks beneath a vast dawn sky, shivering in the whipping sea wind.\nShe dropped the photograph and picked up her phone.\nHum, silence, words that were not words. She had no doubt now: it was Brian’s voice in the foreground, Lisa’s in the background.\nShe played it a third time. It didn’t sound like they were alarmed or panicking, but that was as frustrating as it was reassuring. A plea for help would tell her something new.\nA fourth. Again she heard what might be everyone, might be everything. Again the sounds that followed rose to the edge of comprehensibility before swerving into musical gibberish like a child’s song run through a vocal distorter. Maybe it was a song. Rivers was always singing, he was known for it, they had come to expect it, and when she got home Lisa would be so relieved to hear from him—\nA jumbling discordance filled Charlie’s mind, halting that thought with car-crash suddenness.\nShe started the message over before it reached the end.\nShe was letting Sandeep’s fussing and Hatt’s stupidity get to her. It didn’t even sound like Rivers. Who was with his family in Atlanta. She played the message to the end and missed Lisa so much it was a physical thing, a clinging vine of spines and thorns, tightening.\nHer thumb hovered over the screen for another repetition, but the sound of footsteps in the hall stopped her.\nCath appeared in the doorway. “I’m making coffee. Want some?”\nIt took a moment for the words to penetrate the shimmering echo of the Intrepid’s message. “Yeah. Sure.”\n“You okay?”\nCharlie rubbed her mouth with the back of her hand. “I’m fine.”\nCath gave her a level look, unconvinced, but only asked, “Was all of this junk in the closet?”\n“There was a lot jammed back there.” Charlie passed the photograph to her. “Remember this?”\n“Hey, that’s Grandpa when he still had hair.”\nCharlie’s most vivid memory of the man was of a waxy-pale husk in a coffin lined with blue silk, but Cath was looking at the picture with a fond smile, and as her words quivered through the air between them Charlie remembered: Alice. The woman who had given the photograph to Mom was named Alice, and she had been Grandma’s best friend since childhood. She had taken Charlie and Cath to the aquarium in Baltimore once when they were children. Charlie didn’t know how she could have forgotten. They had watched the jellyfish together for a long time, quiet in a dark room as the creatures drifted in restful blue.\n“Do you remember after the funeral?” Charlie asked.\nCath glanced up. “Was that when Mom dragged us up to Canada and spent the entire drive lecturing us about those frond things she liked so much?”\n“Yes. Same trip.”\nCharlie didn’t remember Mom talking much during the drive, only long hours of tense silence. She remembered Cath saying, “God, Mom, I don’t care,” when they reached their destination, putting her headphones on and refusing to get out of the car. She remembered Mom taking her hand and leading her toward the shore in the cold bright morning, her professorial instinct taking over: half a billion years ago, the oldest complex lifeforms on Earth, before the beginning, before, before. The memory of her mother’s words melted into the singsong meter of the ship’s message.\nShe looked down, half expecting to find it playing again, but her phone was silent.\n“Is that from Intrepid?” Cath asked. “Can I listen?”\nCharlie clicked the screen off, feeling like she had been caught playing when there were chores to be done. “It’ll be released to the public later.”\n“So play it for me. What are they saying?” Cath didn’t wait for an answer before turning away. “Come on. Coffee first, then you can tell me.”\nCharlie hesitated only a moment before following her to the kitchen. She sat at the table while Cath plucked mugs from a half-packed box.\n“So what do they have to say?” Cath asked.\n“We’re not sure yet. It’s hard to hear anything clearly.”\n“Now I’ve really got to hear it. I’m good at figuring out gibberish. Lots of practice.”\n“It’s gibberish because it’s been sent across fifty million miles of space by damaged equipment, not because it’s a secret coded love poem in medieval Polish. Not exactly your area of expertise.”\nCath stilled, hand on the faucet, and Charlie regretted her words. She didn’t mean to needle. It was a mean-spirited reflex, the same thoughtless instinct that had put years of barbed wire separation between them. Three years ago she had accused Cath of abandoning her dreams for an unfaithful man, and Cath had accused Charlie of never sacrificing anything for anyone. It should have passed, would have passed any other day, but that day years of disagreements and choices had exploded into a fight, and the fight, when it ended, whimpered meekly into a long uneasy holding pattern, the space between them littered with traps and pitfalls they both chose to avoid rather than navigate. It was true that Cath had quit graduate school when she had married, insisting it was exactly what she wanted. She had never welcomed Charlie’s observation that what Cath wanted was always precisely what Walter had wanted first, no more than she had welcomed Mom’s jokes about cosmic balance requiring their family to have at least one useless humanities scholar amongst the scientists. Charlie had known these things. She had known when they were first finding their way, and when they grew through their twenties and thirties, Cath married and Charlie more solitary than not, the choices they made as young women fading into acceptance or regret, the future ossifying into routine. She had known when Cath told her about Walter’s latest indiscretion three years ago. She had taunted Cath about it anyway.\nBut this time, Cath let it pass unremarked. She set the mugs on the counter; she had taken off her wedding ring.\n“Maybe not,” she said, “but I want to hear it anyway.”\nCharlie played the recording. She tensed through the initial rumble of noise, clenched her teeth through the seconds of silence that followed. Cath opened her mouth, but Charlie quieted her with gesture. The wordless chatter started again, high tones and low, a singsong back and forth. Brian’s voice, Lisa’s voice. She was growing more confident that Brian was saying, “Everyone’s fine.” It would be clear when the raw audio was processed.\nWhen the recording ended, a flicker passed over Cath’s face, more shadow than flinch. “That’s . . . odd. Play it again?”\nCharlie obliged.\n“Are they really going to make that public?” Cath asked. She pulled out a chair to sit across from Charlie.\n“Nobody will believe how hard it is to understand if we don’t,” Charlie pointed out. “You know how people are. They’ll say we’re—”\n“It sounds like they’re saying, ‘Everybody’s dying.’ ”\n“What?” Charlie looked at her sharply. “That’s not what they’re saying.”\n“That’s what it sounds like.”\n“It’s not. He’s saying they’re fine. ‘Everything’s fine.’ You have to listen closely.”\n“I am listening closely. Play it again,” Cath said.\n“I’ve listened to it five times. I know what they’re saying.”\n“Then let me hear it again.”\nCharlie shook her head. “No. This is low-quality audio on a crappy speaker. If I was at my lab I could—I could—”\nShe stared at the phone and the scarred table beneath it. For several seconds she heard nothing but the splutter of the coffee pot and drip of the kitchen faucet. It had dripped for years. Mom had always said she was going to fix it.\n“We’re cleaning it up,” Charlie said, her voice hoarse. “You can’t draw conclusions from this.”\nBrian’s voice, Lisa’s voice. The conclusions were already barbed in her throat.\n“Okay,” Cath said.\n“We should get back to work.”\n“Charlie.”\n“The bedroom’s almost finished. I can—”\n“I know you’d rather be there. I don’t blame you.” Cath reached across the table, hesitated before touching the back of Charlie’s hand. Charlie twitched but didn’t pull away. “I know it’s not just your job. They’re your friends, aren’t they? I can’t even imagine how scared you must be for them.”\nCath rose to pour the coffee for both of them—black, bitter, their mother’s preference passed down. A different Charlie, a sister who could meet Cath halfway, would say, “Not only friends.” She would say Lisa’s name and let the fear in her voice invite Cath’s questions. A different Charlie would have already said the words, sometime over the past three years. She would have already opened the door.\n“Mom would want you to be there,” Cath said. “She always told everybody you were changing the fate of the human race. Somebody’s got to do it, she said, and she knew it was going to be you. She had them all trained to turn on the news for mission updates.”\n“I didn’t mean,” Charlie began, but she stopped, unsure where that sentence led.\n“She’d say, ‘Let’s hear about Charlie’s astronauts. Let’s see what they’re up to today.’ The nurses got sick of it, but she never got tired of bragging about you. And when the ship lost contact . . . . ” Cath was looking at the table, her eyes unfocused. “That’s what she told them to explain why you didn’t visit much. She never wanted me to tell you to come.”\n“I would have said I was too busy anyway,” Charlie said. Her guilt was a bright stinging thing, sunlight on a mirror.\n“You should see if you can get an earlier flight. They need you, don’t they?” Cath gestured toward the window with her coffee mug, as though all of time and space were waiting in the trees outside. “It’s important. I understand.”\nCath’s voice was even, but Charlie still felt she was prodding at her with the question, looking for her soft fleshy underside. She remembered, in a flash like light through a prism, Mom once saying, “Funerals aren’t for the dead, honey. They’re for the living.” The same could be said of fossils, or starlight, remnants of a dead past rippling through the present.\n“They can manage for a few hours,” Charlie said.\n“But they need you. Go. I can handle this. Jeff will be over soon to help anyway.”\n“Jeff? Who’s Jeff?” Charlie asked, confused.\n“You met him at the funeral yesterday, remember? After you’ve been pestering me about him for months.”\nCath had been alone at the funeral. Head held high, black dress and pearls making her look so much like Mom, and alone. There had been nobody at her side. Charlie pressed her lips together, swallowing back an acid churn of nausea. Cath wasn’t wearing her wedding ring. They hadn’t spoken about anything so intimate as friends or lovers in three years, but she wouldn’t have missed a separation or divorce. She wouldn’t have missed a whole person standing beside her sister at their mother’s funeral.\n“You talked to him for at least twenty minutes?” Cath went on, voice lifting uncertainly. “And you told me afterward that you approved? Because he didn’t try to play the conspiracy theory guessing game with you, he just said that hearing from Intrepid after so long must be—”\n“Better than silence,” Charlie said.\nCath’s smile was watery, relieved. “Yeah. I guess I didn’t tell you how serious it was, but I don’t think I really knew, not until—well. He showed up. He stayed. He’s coming over to help, which is something that asshole we don’t talk about anymore never would have done.”\nThree years ago, before their conversation had devolved into an argument, when Cath’s voice was still wet with hurt and Charlie had not yet loosed the careless words she would later regret, she had asked, “Are you going to leave him?” Cath had hesitated—knowing silence vibrated between them—and Charlie had held her breath, thought, say yes, and finally, and please, hopes formed with the strength of commands but never spoken, waiting for the second it took for Cath to answer one way, or the other.\n“Yeah. Yeah. That’s—good. That’s.” Charlie gulped her coffee and pushed back her chair. “I’ll finish the bedroom. I can—I’ll do that before I go.”\nShe fled down the hall again. The guest room door was still open, but there was no sign of Cath’s bag or funeral dress. The bed had been stripped, the closet cleared. Charlie took a few slow breaths. Dust motes danced in sunlight. There was a pressure building behind her eyes, a dull pain reminding her how little she had slept all week. She didn’t need to ask. She had only glanced through the door before. There was no reason for Cath to stay here anyway.\nIn her mother’s room she played the message again. She breathed through the hum and the silence, and when the voices picked up—two of them, entwined—she closed her eyes. Thought about Cath at the funeral, black dress, pearls, alone. The space beside her wavered, like lake water disturbed from below, and by the time the message rolled through everything, stuttered over fine, there was a man where there had been emptiness. He had always been there. She had forgotten. She had only forgotten.\nWith unsteady hands Charlie disgorged the rest of the closet into cardboard boxes, taped them up and labeled the sides, and she did not listen to the message again. She dumped piles of old paperwork into a trash bag, and she made a mental list of what she could do when she returned to mission control. She folded the sheets and blankets, and she kept her phone in her pocket. She layered trinkets and books in a box with the photograph of their grandparents, and she remembered the beach, the wet slap of waves on her legs. She swept the floor, and Intrepid’s message sang beneath her thoughts.\nWhen Charlie returned to the kitchen, purse over her shoulder and keys in hand, Cath was looking through the window over the sink. All around her the kitchen cupboards were open and empty. The air smelled of bleach.\n“What was the name of that place?” Cath asked without turning. “In Canada, where we went after Grandma and Grandpa’s funeral?”\n“Mistaken Point,” Charlie said. As she said it, uncertainty clouded her words. That was the name she remembered, but what was a place name but noise attached to a landscape, a whipping flag clinging to an ageless continent. She added, softly, “Mom called it Avalon.”\n“Right. She dragged us along those rocks all morning. It was foggy, right? Almost raining. We didn’t have the right clothes. She was so excited.”\nCharlie didn’t remember Cath walking with them on the seashore. She remembered that it had been her and Mom alone, Cath left in a sulk in the car. She remembered sunlight when dawn broke, a painters’ sky so perfect the possibility it might not have been real filled her with a dread so powerful it tasted like despair.\n“I have to go,” she said.\n“You know she was never mad at you for being obsessed with your work,” Cath said. “She understood. She liked that you took after her.”\nOn her way out the door, Charlie stopped to touch the trilobite fossils as she always did. Hand to stone, fingertips to head, palm to thorax, wrist to the long spiny fan of a tail. There were two creatures preserved in the sample, crossed like clasped hands, dead together for five hundred million years. A slide of seafloor mud inches away, a silent underwater scurry seconds later, and they might have been buried alone.\n“You should take them,” Cath said. She was watching from the kitchen doorway. “Those little guys were always your favorites.”\nCharlie wrapped the slab of stone in a plastic bag before she said goodbye.\nShe was a mile from the house and slowing for a bend in the road when a tremble passed through her, sudden as a summer storm. Her hands began to shake; her breath grew short. She pulled onto the grass-choked shoulder and rolled down the window, gasping at the warm fresh air. She closed her eyes. Carefully, mindful of the horn, she rested her head against the steering wheel. The taste of coffee lingered on her tongue.\nShe sat there for five minutes, ten, foot on the brake, engine running. Through the window she heard birds, a breeze in the trees, a single car passing. The gentle sounds Mom had sought after decades of students and department meetings and field expeditions. A different daughter would have admired the comfort she found in that peace. It was the rooted calm Mom had craved after a lifetime of wandering, a slowness she had never admitted she needed, and she’d had only a few years to enjoy it. A different daughter would have helped plant the garden.\nCharlie picked up her phone from the passenger seat. She dug through her purse for the power cable, plugged it in. She set the audio file to repeat and tapped play. A burst of sound, a breath of silence. A voice she did or did not recognize. Another she did or did not love. Forty-seven seconds beginning to end. Everybody’s dying, everybody’s fine. The mist was gone from the river, the water glinting in sunlight, the trees a mottled canvas of deepening green. She checked her mirror, checked both directions, and pulled onto the road again. The recording started over.", "source": "https://clarkesworldmagazine.com/wallace_08_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: First Light at Mistaken Point by Kali Wallace"}