{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kij Johnson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "03+dBRfjrfS/4bFztsvEEE+hDqg=", "id": null, "license": null, "comments": "", "raw_text": "2160 words, short story  Tool-Using Mimics  The simplest explanation: Here is a picture. It is a girl, six? Seven? The 1930s, to guess by the pattern on the smocked dress she is wearing, the background of the dark studio. She is smiling and holding her hands above her head. She has short chestnut curls.  She also has a translucent membrane that cascades behind her head like a wedding veil, or a cuttlefish’s stabilizing fins. At the waist, she breaks into tentacles. Or is it her smock that ends like this? Two of the tentacles are playing an F chord on the ukulele at her waist. Two of them look like human legs, and wear Mary Jane shoes and mismatched socks. Or are they human legs? Pictures are so unreliable.  She smiles and smiles.  Here is a possibility.  The octopus raises her young; as with every species, the goal is to bring at least some of one’s offspring to viability and the age at which they will in their own turn bear young. Her genes will move forward through time, like a soccer ball passed down the field toward the net.  This is her tried-and-true strategy, honed over millennia: She lays her teardrop eggs in jeweling clusters, tucked into a crack formed of coral and her own purling flesh. They look like quivering tender pearls, but they are edible, and there are many predators and opportunists in the world. She cannot leave them for even a moment, though this means she must starve herself. As she waits to repel such devourers and destroyers of the young as they come too close, she tendrils her arms through the eggs, to keep them clean and oxygenated. They tremble in her delicate currents.  Her skin shreds from her before she dies, but by this time the infants have grown strong. They press through the eggs’ thin ripping walls and scatter spiraling away, each pretty as a primrose, pretty as a star.  Many of the young die, but some live, grow, find concealments and craveries, develop strategies of their own. This, then, is her boldest daughter.  They are tool-using mimics, each with her own agenda. This is my way. This is mine. They hide them from you. They change colors to blend, to startle, to convey information. They contort their bodies and legs to feign the shapes of other creatures, fiercer or less edible. They hide in beer cans. They carry coconut shells—they can move at speed, even burdened like this—and when they are threatened, they curl tight and pull the shells close, like a clam.  Tool-using mimics. It is no surprise that some might become women.  Or perhaps this.  A woman who has always wanted a child walks along the beach. It is Florence, Oregon. It is 1932. She has been told by her brother-in-law that it is dangerous for a woman to walk alone, but who would attack her? She is of no account: awkward, unmoneyed, unyoung. The men in town know her family too well to assault her. If someone else does? She spent her youth ignoring the violate touch of secret enemies, and now her brother-in-law . . . This is why she walks alone.  There has been a storm so she is looking for the glass floats that appear sometimes from the strange and lovely Orient. Instead she finds an egg the size of her fingertip, with the teardrop shape and unsettling color-shift of the pearl earrings her sister wears for evening parties; but it is soft, as though an artisan with puzzling goals has fashioned a tiny bag from the tanned skin of a mouse and filled it with—something. Through the egg’s translucent skin, the lidless eyes are startling black.  She carries it cupped in her hands back to her brother-in-law’s home, which froths with dark brocade and carved walnut ornamentation, like a coral reef shadowed by clouds, or sharks. In her high-ceilinged bedroom she places it in a washbasin that she fills with cold water and table salt. A hundred times a day, she runs the single egg through her fingers. She does not know how to describe the stubborn resilience of this tender flesh. At night when she is not alone, she takes her mind away to the single egg: its delicacy; its softness. You beauty, she whispers. You clever beautiful little thing. I will protect you.  The eyes watch everything: patient, already learning, already uncannily knowing. When intelligence is inhuman, there is no need for neonate time.  What is eventually born has her chestnut hair and her smile, which her sister has not seen since the wedding, and her brother-in-law has never seen, for all his secret visits to her room. When she is cast out (for an illegitimate cephalopod daughter is beyond the pale) she and her child emigrate to Australia. Perth. No one knows her there. She takes a widow’s name and wears a ring she purchased from a pawn shop near the wharf in San Francisco.  No many-limbed father will claim this girl; no cold-fingered kinsman will touch her.  Or.  When the blue-and-gold damselfish come hunting, she has learned a trick. She conceals herself (Just mud, she whispers to the water; there is nothing inside this hole in the ocean’s floor) and unfurls two tentacles, bands them yellow and black. They side-wind like a swimming sea snake, the venomous natural predator of damselfish. Such fish are bright as a Fabergé trinket; and when they flee, the ocean is for a moment engemmed, bejeweled.  She folds in her serpenting arms, turns them back to the color of holes, but it is not finished. It will never be finished. They will return—and if not them, then others. Eventually her eggs, or her young, or herself, will be killed. The ocean is cold in so many senses.  I cannot raise my daughters like this, she thinks.  It must be better above the water. How can it be worse?  Or.  Her husband has always been a fisherman, owner and captain of a small trawler called The Sea Snake. He will die in the ocean, sucked low by a storm he will not have predicted, ignoring the warning she gives each time he leaves: you will walk out that door and you will fail to return. They all do, eventually. His death-notice has been written in rime on his skin since before they met. How can she invest in such a man?  During his absences, she dreams. But not of him—nor (as another might) of his clean-limbed brother, who has his own boat and eyes brown as chestnuts; nor even of the baker who took over the ovens when his father died, who will never die shipwrecked, castaway, dragged down or drowning. Not even he, though she would not be the first to heat her hands at his oast in her husband’s absence.  Her longings are secret, more complicated. When she wades into the cool water to collect kelp for salt-burning, she feels something envine her legs. Seaweed, she assumes: meristems and stipes given an illusion of intent, air-bladders plump as phalluses importuning her thighs. She cannot stop thinking of this. At night, she throws aside her quilt and shivers in darkness as she imagines tendrilling, trialing arms, a nibbling beak orgasm-sharp. But of course it was kelp. And the salt on her tongue when she wakes in the night? Tears or night-sweat. Dreams.  So how does she explain this when he returns—the swelling belly, after her husband has been gone so long, when the only hands that have touched her are her own and the sea’s? He will never believe her, nor forgive her.  If he returns. She wades into the ocean and calls to the father, unsure he exists. When he spreads himself across the waves and looks up at her with one vast eye (the tip of a tentacle wrapping her ankle, an embrace as delicate as a finger-brush), she makes a deal. Her husband will fail to come home, and her daughter will not grow up trying to guess the difference between the tastes of tears, and sweat, and the sea.  And they pretend to be lionfish. To be venomous soles. To be fat, flat unfoundering flounder. Jellyfish. Yellow-banded sea snakes. Anemones. Brittle stars, mantis shrimp, nudibranchs, scallops, ambulant shells. Rays. What can’t they do? They pass, and pass, and pass.  Touch them and at first they recoil then coil, enwrap and enrapture you. Their curious and unsettling overwise eyes are too close to their pursing sharp mouths.  Take them home to your three-bedroom ranch in Hopkinsville, and they unscrew all the lids, open the boxes, break the ornamental seashells. They climb into transparent boxes, into resin grottos shaped like fairyland castles and ceramic skulls with bubbling eyes. They wait until they hear the garage-door opener and your car backing out, then slip through your filters and cross your carpeted floors to eat secretly your tropical fish. Sometimes they return to their salted tanks. Sometimes they vanish entirely.  They survive, and suffer. And thrive, until they don’t. They pass, and pass through, pass by and pass on. You will never understand them.  Once upon a time there was a little girl that no one called Pearl. She did all things well: laughed, danced, thought, dreamt, played.  Someone took that photograph. The laughing little girl: someone said to her, Don’t you want to look nice for the picture? Then hold still while I comb your hair, and, Not that dress, darling; pick the pink one, and Okay, young lady, can you open your eyes a little wider?, and Stop squirming! You’re ruining the pictures.  Guess which variety of octopus she is based on. Guess which girl. Guess what she thinks, why the ukulele, why the smile. Whose daughter was she? Was she your grandmother? The picture is old enough, anyway. She will grow up outside your ken to be everything you love and fear.  Between 1933 and 1935, she was billed on the marquees of small-town theaters across the Dust Bowl as “Pearl: The Gem of the Ocean,” but was known more informally as that little freak-girl, with the tentacles. Can you imagine? Her performance included singing and dancing, and a comedy routine with a immense black woman pretending to be her despairing Mammy, billed as Mississippi Beulah but in fact named Enid Johnson, from New York.  It always ended with a balletic swimming exhibition in a heavy-glassed tank filled with water: this, in towns where there had been no rain for a thousand days, where the youngest children had not known so much water existed in the world, except in photographs. And photographs lie.  The day after a show, the water was drained off and sold by the cup, but Pearl did not know this, already crossing the inland dust sea to the next dry town, drowsing against Enid’s shoulder.  In time, her skin seamed, grew lines. How did they like her at fifteen? At thirty? The records do not tell us.  In the oceans, there is a population bloom. Climate change, overfishing: the water grows warmer, and being stripped of certain (highly edible) predators by seines and traps and rising temperatures, the cephalopods step up, filling the gaps. They start to live longer, remember more. They make plans, think through how to optimize their happiness and success as a species.  Pearl was the first Cephalopod Ambassador to the Dry Lands. They did not realize that no one would listen to her. Eight is a very great age for a squid, though, as it happens, not for a human. Plus, she’s a girl, and who knew that would make a difference?  But we do what they want, anyway. The warming oceans are filling with tentacles. We will be gone and for a time they will remain.  In one version of the world, Pearl goes back to the ocean. She started happy—wore flowers, danced, played ukulele—but that ends, as it always does. Sober adulthood is a hood she will not wear, so she shucks its tight folds, slides off the pier’s end into the foaming coastal waters. The photo is all that is left.  Does she find a male who overlooks the deformities of feet and hair? Does she live to run her fingers through her own tear-shaped eggs? Does she die surrounded by the soft ripped shells of her sea-spangling daughters? Does she fit here any better than anywhere else?  The simplest explanation: The picture is a fake. Can you trust it? Emulsion, itself an unreliable material, carefully painted over with acrylics. The colors are a tap dance that conceals the underlying sepia tone lie. This tentacle-girl has never existed, but she is as real as anything else you have not seen with your own eyes, touched with your questioning fingers.  And even that. What do you know of your own daughter? Only what you think you know. She does her best playing when you are not there. Kij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "text": "2160 words, short story\nTool-Using Mimics\nThe simplest explanation: Here is a picture. It is a girl, six? Seven? The 1930s, to guess by the pattern on the smocked dress she is wearing, the background of the dark studio. She is smiling and holding her hands above her head. She has short chestnut curls.\nShe also has a translucent membrane that cascades behind her head like a wedding veil, or a cuttlefish’s stabilizing fins. At the waist, she breaks into tentacles. Or is it her smock that ends like this? Two of the tentacles are playing an F chord on the ukulele at her waist. Two of them look like human legs, and wear Mary Jane shoes and mismatched socks. Or are they human legs? Pictures are so unreliable.\nShe smiles and smiles.\nHere is a possibility.\nThe octopus raises her young; as with every species, the goal is to bring at least some of one’s offspring to viability and the age at which they will in their own turn bear young. Her genes will move forward through time, like a soccer ball passed down the field toward the net.\nThis is her tried-and-true strategy, honed over millennia: She lays her teardrop eggs in jeweling clusters, tucked into a crack formed of coral and her own purling flesh. They look like quivering tender pearls, but they are edible, and there are many predators and opportunists in the world. She cannot leave them for even a moment, though this means she must starve herself. As she waits to repel such devourers and destroyers of the young as they come too close, she tendrils her arms through the eggs, to keep them clean and oxygenated. They tremble in her delicate currents.\nHer skin shreds from her before she dies, but by this time the infants have grown strong. They press through the eggs’ thin ripping walls and scatter spiraling away, each pretty as a primrose, pretty as a star.\nMany of the young die, but some live, grow, find concealments and craveries, develop strategies of their own. This, then, is her boldest daughter.\nThey are tool-using mimics, each with her own agenda. This is my way. This is mine. They hide them from you. They change colors to blend, to startle, to convey information. They contort their bodies and legs to feign the shapes of other creatures, fiercer or less edible. They hide in beer cans. They carry coconut shells—they can move at speed, even burdened like this—and when they are threatened, they curl tight and pull the shells close, like a clam.\nTool-using mimics. It is no surprise that some might become women.\nOr perhaps this.\nA woman who has always wanted a child walks along the beach. It is Florence, Oregon. It is 1932. She has been told by her brother-in-law that it is dangerous for a woman to walk alone, but who would attack her? She is of no account: awkward, unmoneyed, unyoung. The men in town know her family too well to assault her. If someone else does? She spent her youth ignoring the violate touch of secret enemies, and now her brother-in-law . . . This is why she walks alone.\nThere has been a storm so she is looking for the glass floats that appear sometimes from the strange and lovely Orient. Instead she finds an egg the size of her fingertip, with the teardrop shape and unsettling color-shift of the pearl earrings her sister wears for evening parties; but it is soft, as though an artisan with puzzling goals has fashioned a tiny bag from the tanned skin of a mouse and filled it with—something. Through the egg’s translucent skin, the lidless eyes are startling black.\nShe carries it cupped in her hands back to her brother-in-law’s home, which froths with dark brocade and carved walnut ornamentation, like a coral reef shadowed by clouds, or sharks. In her high-ceilinged bedroom she places it in a washbasin that she fills with cold water and table salt. A hundred times a day, she runs the single egg through her fingers. She does not know how to describe the stubborn resilience of this tender flesh. At night when she is not alone, she takes her mind away to the single egg: its delicacy; its softness. You beauty, she whispers. You clever beautiful little thing. I will protect you.\nThe eyes watch everything: patient, already learning, already uncannily knowing. When intelligence is inhuman, there is no need for neonate time.\nWhat is eventually born has her chestnut hair and her smile, which her sister has not seen since the wedding, and her brother-in-law has never seen, for all his secret visits to her room. When she is cast out (for an illegitimate cephalopod daughter is beyond the pale) she and her child emigrate to Australia. Perth. No one knows her there. She takes a widow’s name and wears a ring she purchased from a pawn shop near the wharf in San Francisco.\nNo many-limbed father will claim this girl; no cold-fingered kinsman will touch her.\nOr.\nWhen the blue-and-gold damselfish come hunting, she has learned a trick. She conceals herself (Just mud, she whispers to the water; there is nothing inside this hole in the ocean’s floor) and unfurls two tentacles, bands them yellow and black. They side-wind like a swimming sea snake, the venomous natural predator of damselfish. Such fish are bright as a Fabergé trinket; and when they flee, the ocean is for a moment engemmed, bejeweled.\nShe folds in her serpenting arms, turns them back to the color of holes, but it is not finished. It will never be finished. They will return—and if not them, then others. Eventually her eggs, or her young, or herself, will be killed. The ocean is cold in so many senses.\nI cannot raise my daughters like this, she thinks.\nIt must be better above the water. How can it be worse?\nOr.\nHer husband has always been a fisherman, owner and captain of a small trawler called The Sea Snake. He will die in the ocean, sucked low by a storm he will not have predicted, ignoring the warning she gives each time he leaves: you will walk out that door and you will fail to return. They all do, eventually. His death-notice has been written in rime on his skin since before they met. How can she invest in such a man?\nDuring his absences, she dreams. But not of him—nor (as another might) of his clean-limbed brother, who has his own boat and eyes brown as chestnuts; nor even of the baker who took over the ovens when his father died, who will never die shipwrecked, castaway, dragged down or drowning. Not even he, though she would not be the first to heat her hands at his oast in her husband’s absence.\nHer longings are secret, more complicated. When she wades into the cool water to collect kelp for salt-burning, she feels something envine her legs. Seaweed, she assumes: meristems and stipes given an illusion of intent, air-bladders plump as phalluses importuning her thighs. She cannot stop thinking of this. At night, she throws aside her quilt and shivers in darkness as she imagines tendrilling, trialing arms, a nibbling beak orgasm-sharp. But of course it was kelp. And the salt on her tongue when she wakes in the night? Tears or night-sweat. Dreams.\nSo how does she explain this when he returns—the swelling belly, after her husband has been gone so long, when the only hands that have touched her are her own and the sea’s? He will never believe her, nor forgive her.\nIf he returns. She wades into the ocean and calls to the father, unsure he exists. When he spreads himself across the waves and looks up at her with one vast eye (the tip of a tentacle wrapping her ankle, an embrace as delicate as a finger-brush), she makes a deal. Her husband will fail to come home, and her daughter will not grow up trying to guess the difference between the tastes of tears, and sweat, and the sea.\nAnd they pretend to be lionfish. To be venomous soles. To be fat, flat unfoundering flounder. Jellyfish. Yellow-banded sea snakes. Anemones. Brittle stars, mantis shrimp, nudibranchs, scallops, ambulant shells. Rays. What can’t they do? They pass, and pass, and pass.\nTouch them and at first they recoil then coil, enwrap and enrapture you. Their curious and unsettling overwise eyes are too close to their pursing sharp mouths.\nTake them home to your three-bedroom ranch in Hopkinsville, and they unscrew all the lids, open the boxes, break the ornamental seashells. They climb into transparent boxes, into resin grottos shaped like fairyland castles and ceramic skulls with bubbling eyes. They wait until they hear the garage-door opener and your car backing out, then slip through your filters and cross your carpeted floors to eat secretly your tropical fish. Sometimes they return to their salted tanks. Sometimes they vanish entirely.\nThey survive, and suffer. And thrive, until they don’t. They pass, and pass through, pass by and pass on. You will never understand them.\nOnce upon a time there was a little girl that no one called Pearl. She did all things well: laughed, danced, thought, dreamt, played.\nSomeone took that photograph. The laughing little girl: someone said to her, Don’t you want to look nice for the picture? Then hold still while I comb your hair, and, Not that dress, darling; pick the pink one, and Okay, young lady, can you open your eyes a little wider?, and Stop squirming! You’re ruining the pictures.\nGuess which variety of octopus she is based on. Guess which girl. Guess what she thinks, why the ukulele, why the smile. Whose daughter was she? Was she your grandmother? The picture is old enough, anyway. She will grow up outside your ken to be everything you love and fear.\nBetween 1933 and 1935, she was billed on the marquees of small-town theaters across the Dust Bowl as “Pearl: The Gem of the Ocean,” but was known more informally as that little freak-girl, with the tentacles. Can you imagine? Her performance included singing and dancing, and a comedy routine with a immense black woman pretending to be her despairing Mammy, billed as Mississippi Beulah but in fact named Enid Johnson, from New York.\nIt always ended with a balletic swimming exhibition in a heavy-glassed tank filled with water: this, in towns where there had been no rain for a thousand days, where the youngest children had not known so much water existed in the world, except in photographs. And photographs lie.\nThe day after a show, the water was drained off and sold by the cup, but Pearl did not know this, already crossing the inland dust sea to the next dry town, drowsing against Enid’s shoulder.\nIn time, her skin seamed, grew lines. How did they like her at fifteen? At thirty? The records do not tell us.\nIn the oceans, there is a population bloom. Climate change, overfishing: the water grows warmer, and being stripped of certain (highly edible) predators by seines and traps and rising temperatures, the cephalopods step up, filling the gaps. They start to live longer, remember more. They make plans, think through how to optimize their happiness and success as a species.\nPearl was the first Cephalopod Ambassador to the Dry Lands. They did not realize that no one would listen to her. Eight is a very great age for a squid, though, as it happens, not for a human. Plus, she’s a girl, and who knew that would make a difference?\nBut we do what they want, anyway. The warming oceans are filling with tentacles. We will be gone and for a time they will remain.\nIn one version of the world, Pearl goes back to the ocean. She started happy—wore flowers, danced, played ukulele—but that ends, as it always does. Sober adulthood is a hood she will not wear, so she shucks its tight folds, slides off the pier’s end into the foaming coastal waters. The photo is all that is left.\nDoes she find a male who overlooks the deformities of feet and hair? Does she live to run her fingers through her own tear-shaped eggs? Does she die surrounded by the soft ripped shells of her sea-spangling daughters? Does she fit here any better than anywhere else?\nThe simplest explanation: The picture is a fake. Can you trust it? Emulsion, itself an unreliable material, carefully painted over with acrylics. The colors are a tap dance that conceals the underlying sepia tone lie. This tentacle-girl has never existed, but she is as real as anything else you have not seen with your own eyes, touched with your questioning fingers.\nAnd even that. What do you know of your own daughter? Only what you think you know. She does her best playing when you are not there.\nKij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "source": "https://clarkesworldmagazine.com/johnson_03_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tool-Using Mimics by Kij Johnson"}