{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "James Tiptree Jr", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xlnunCQr1Z6cQLzoihVW3cCWPHM=", "id": null, "license": null, "comments": "", "raw_text": "6240 words, short story, REPRINT  The Man Who Walked Home  Transgression! Terror! And he thrust and lost there—punched into impossibility, abandoned never to be known how, the wrong man in the most wrong of all wrong places in that unimaginable collapse of never-to-be-reimagined mechanism—he stranded, undone, his lifeline severed, he in that nanosecond knowing his only tether parting, going away, the longest line to life withdrawing, winking out, disappearing forever beyond his grasp—telescoping away from him into the closing vortex beyond which lay his home, his life, his only possibility of being; seeing it sucked back into the deepest maw, melting, leaving him orphaned on what never-to-be-known shore of total wrongness—of beauty beyond joy, perhaps? Of horror? Of nothingness? Of profound otherness only, certainly—whatever it was, that place into which he transgressed, it could not support his life there, his violent and violating aberrance; and he, fierce, brave, crazy—clenched into total protest, one body-fist of utter repudiation of himself there in that place, forsaken there—what did he do? Rejected, exiled, hungering homeward more desperate than any lost beast driving for its unreachable home, his home, his HOME—and no way, no transport, no vehicle, means, machinery, no force but his intolerable resolve aimed homeward along that vanishing vector, that last and only lifeline—he did, what?  He walked.  Home.  Precisely what hashed up in the work of the major industrial lessee of the Bonneville Particle Acceleration Facility in Idaho was never known. Or rather, all those who might have been able to diagnose the original malfunction were themselves obliterated almost at once in the greater catastrophe which followed.  The nature of this second cataclysm was not at first understood either. All that was ever certain was that at 1153.6 of May 2, 1989 Old Style, the Bonneville laboratories and all their personnel were transformed into an intimately disrupted form of matter resembling a high-energy plasma, which became rapidly airborne to the accompaniment of radiating seismic and atmospheric events.  The disturbed area unfortunately included an operational MIRV Watchdog bomb.  In the confusion of the next hours the Earth’s population was substantially reduced, the biosphere was altered, and the Earth itself was marked with numbers of more conventional craters. For some years thereafter, the survivors were existentially preoccupied and the peculiar dust bowl at Bonneville was left to weather by itself in the changing climatic cycles.  It was not a large crater; just over a kilometer in width and lacking the usual displacement lip. Its surface was covered with a finely divided substance which dried into dust. Before the rains began it was almost perfectly flat. Only in certain lights, had anyone been there to inspect it, a small surface-marking or abraded place could be detected almost exactly at the center.  Two decades after the disaster a party of short brown people appeared from the south, together with a flock of somewhat atypical sheep. The crater at this time appeared as a wide shallow basin in which the grass did not grow well, doubtless from the almost complete lack of soil microorganisms. Neither this nor the surrounding vigorous grass was found to harm the sheep. A few crude hogans went up at the southern edge and a faint path began to be traced across the crater itself, passing by the central bare spot.  One spring morning two children who had been driving sheep cross the crater came screaming back to camp. A monster had burst out of the ground before them, a huge flat animal making dreadful roar. It vanished in a flash and a shaking of the earth, leaving an evil smell. The sheep had run away.  Since this last was visibly true, some elders investigated. Finding no sign of the monster and no place in which it could hide, they settled for beating the children, who settled for making a detour around the monster-spot, and nothing more occurred for a while.  The following spring the episode was repeated. This time an older girl was present, but she could add only that the monster seemed to be rushing flat out along the ground without moving at all. And there was a scraped place in the dirt. Again nothing was found; an evil-ward in a cleft stick was placed at the spot.  When the same thing happened for the third time a year later, the detour was extended and other charm-wands were added. But since no harm seemed to come of it and the brown people had seen far worse, sheep-tending resumed as before. A few more instantaneous apparitions of the monster were noted, each time in the spring.  At the end of the third decade of the new era a tall old man limped down the hills from the south, pushing his pack upon a bicycle wheel. He camped on the far side of the crater, and soon found the monster-site. He attempted to question people about it, but no one understood him, so he traded a knife for some meat. Although he was obviously feeble, something about him dissuaded them from killing him, and this proved wise because he later assisted the women in treating several sick children.  He spent much time around the place of the apparition and was nearby when it made its next appearance. This excited him very much and he did several inexplicable but apparently harmless things, including moving his camp into the crater by the trail. He stayed on for a full year watching the site and was close by for its next manifestation. After this he spent a few days making a charm-stone for the spot and left northward, hobbling as he had come.  More decades passed. The crater eroded, and a rain-gully became an intermittent streamlet across the edge of the basin. The brown people and their sheep were attacked by a band of grizzled men, after which the survivors went away eastward. The winters of what had been Idaho were now frost-free; aspen and eucalyptus sprouted in the moist plain. Still the crater remained treeless, visible as a flat bowl of grass; and the bare place at the center remained. The skies cleared somewhat.  After another three decades a larger band of black people with ox-drawn carts appeared and stayed for a time, but left again when they too saw the thunderclap-monster. A few other vagrants straggled by.  Five decades later a small permanent settlement had grown up on the nearest range of hills, from which men riding on small ponies with dark stripes down their spines herded humped cattle near the crater. A herdsman’s hut was built by the streamlet, which in time became the habitation of an olive-skinned, red-haired family. In due course one of this clan again observed the monster-flash, but these people did not depart. The stone the tall man had placed was noted and left undisturbed.  The homestead at the crater’s edge grew into a group of three and was joined by others, and the trail across it became a cart road with a log bridge over the stream. At the center of the still faintly discernible crater the cart road made a bend, leaving a grassy place which bore in its center about a square meter of curiously impacted bare earth and a deeply etched sandstone rock.  The apparition of the monster was now known to occur regularly each spring on a certain morning in this place, and the children of the community dared each other to approach the spot. It was referred to in a phrase that could be translated as “the Old Dragon.” The Old Dragon’s appearance was always the same: a brief violent thunder-burst which began and cut off abruptly, in the midst of which a dragonlike creature was seen apparently in furious motion on the earth, although it never actually moved. Afterward there was a bad smell and the earth smoked. People who saw it from close by spoke of a shivering sensation.  Early in the second century two young men rode into town from the north. Their ponies were shaggier than the local breed, and the equipment they carried included two boxlike objects, which the young men set up at the monster-site. They stayed in the area a full year, observing two materializations of the Old Dragon, and they provided much news and maps of roads and trading towns in the cooler regions to the north. They built a windmill, which was accepted by the community, and offered to build a lighting machine, which was refused. Then they departed with their boxes after unsuccessfully attempting to persuade a local boy to learn to operate one.  In the course of the next decades other travelers stopped by and marveled at the monster, and there was sporadic fighting over the mountains to the south. One of the armed bands made a cattle raid into the crater hamlet. It was repulsed, but the raiders left a spotted sickness, which killed many. For all this time the bare place at the crater’s center remained, and the monster made his regular appearances, observed or not.  The hill-town grew and changed, and the crater hamlet grew to be a town. Roads widened and linked into networks. There were gray-green conifers in the hills now, spreading down into the plain, and chirruping lizards lived in their branches.  At century’s end a shabby band of skin-clad squatters with stunted milk-beasts erupted out of the west and were eventually killed or driven away, but not before the local herds had contracted a vicious parasite. Veterinaries were fetched from the market city up north, but little could be done. The families near the crater left, and for some decades the area was empty. Finally cattle of a new strain reappeared in the plain and the crater hamlet was reoccupied. Still the bare center continued annually to manifest the monster, and he became an accepted phenomenon of the area. On several occasions parties came from the distant Northwest Authority to observe it.  The crater hamlet flourished and grew into the fields where cattle had grazed, and part of the old crater became the town park. A small seasonal tourist industry based on the monster-site developed. The townspeople rented rooms for the appearances, and many more-or-less authentic monster-relics were on display in the local taverns.  Several cults now grew up around the monster. One persistent belief held that it was a devil or damned soul forced to appear on Earth in torment to expiate the catastrophe of three centuries back. Others believed that it, or he, was some kind of messenger whose roar portended either doom or hope according to the believer. One very vocal sect taught that the apparition registered the moral conduct of the townspeople over the past year, and scrutinized the annual apparition for changes which could be interpreted for good or ill. It was considered lucky, or dangerous, to be touched by some of the dust raised by the monster. In every generation at least one small boy would try to hit the monster with a stick, usually acquiring a broken arm and a lifelong tavern tale. Pelting the monster with stones or other objects was a popular sport, and for some years people systematically flung prayers and flowers at it. Once a party tried to net it and were left with strings and vapor. The area itself had long since been fenced off at the center of the park.  Through all this the monster made his violently enigmatic annual appearance, sprawled furiously motionless, unreachably roaring.  Only as the fourth century of the new era went by was it apparent that the monster had been changing slightly. He was now no longer on the earth but had an arm and a leg thrust upward in a kicking or flailing gesture. As the years passed he began to change more quickly until at the end of the century he had risen to a contorted crouching pose, arms outflung as if frozen in gyration. His roar, too, seemed somewhat differently pitched, and the earth after him smoked more and more.  It was then widely felt that the man-monster was about to do something, to make some definitive manifestation, and a series of natural disasters and marvels gave support to a vigorous cult teaching this doctrine. Several religious leaders journeyed to the town to observe the apparitions.  However, the decades passed and the man-monster did nothing more than turn slowly in place, so that he now appeared to be in the act of sliding or staggering while pushing himself backward like a creature blown before a gale. No wind, of course, could be felt, and presently the general climate quieted and nothing came of it all.  Early in the fifth century New Calendar three survey parties from the North Central Authority came through the area and stopped to observe the monster. A permanent recording device was set up at the site, after assurances to the townsfolk that no hardscience was involved. A local boy was trained to operate it; he quit when his girl left him but another volunteered. At this time nearly everyone believed that the apparition was a man, or the ghost of one. The record-machine boy and a few others including the school mechanics teacher referred to him as The Man John. In the next decades the roads were greatly improved; all forms of travel increased, and there was talk of building a canal to what had been the Snake River.  One May morning at the end of Century Five a young couple in a smart green mule-trap came jogging up the highroad from the Sandreas Rift Range to the southwest. The girl was golden-skinned and chatted with her young husband in a language unlike that ever heard by The Man John either at the end or the beginning of his life. What she said to him has, however, been heard in every age and tongue.  “Oh, Serli, I’m so glad we’re taking this trip now! Next summer I’ll be busy with baby.”  To which Serli replied as young husbands often have, and so they trotted up to the town’s inn. Here they left trap and bags and went in search of her uncle, who was expecting them there. The morrow was the day of The Man John’s annual appearance, and her Uncle Laban had come from the MacKenzie History Museum to observe it and to make certain arrangements.  They found him with the town school instructor of mechanics, who was also the recorder at the monster-site. Presently Uncle Laban took them all with him to the town mayor’s office to meet with various religious personages. The mayor was not unaware of tourist values, but he took Uncle Laban’s part in securing the cultists’ grudging assent to the MacKenzie authorities’ secular interpretation of the monster, which was made easier by the fact that the cults disagreed among themselves. Then, seeing how pretty the niece was, the mayor took them all home to dinner.  When they returned to the inn for the night it was abrawl with holidaymakers.  “Whew,” said Uncle Laban. “I’ve talked myself dry, sister’s daughter. What a weight of holy nonsense is that Moksha female! Serli, my lad, I know you have questions. Let me hand you this to read, it’s the guidebook we’re giving them to sell. Tomorrow I’ll answer for it all.” And he disappeared into the crowded tavern.  So Serli and his bride took the pamphlet upstairs to bed with them, but it was not until the next morning at breakfast that they found time to read it.  “‘All that is known of John Delgano,’” read Serli with his mouth full, “‘comes from two documents left by his brother Carl Delgano in the archives of the MacKenzie Group in the early years after the holocaust.’ Put some honey on this cake, Mira my dove. Verbatim transcript follows, this is Carl Delgano speaking:  “‘I’m not an engineer or an astronaut like John, I ran an electronics repair shop in Salt Lake City. John was only trained as a spaceman, he never got to space; the slump wiped all that out. So he tied up with this commercial group who were leasing part of Bonneville. They wanted a man for some kind of hard vacuum tests, that’s all I knew about it. John and his wife moved to Bonneville, but we all got together several times a year, our wives were like sisters. John had two kids, Clara and Paul.  “‘The tests were supposed to be secret, but John told me confidentially they were trying for an antigravity chamber. I don’t know if it ever worked. That was the year before.  “‘Then that winter they came down for Christmas and John said they had something far out. He was excited. A temporal displacement, he called it; some kind of time effect. He said their chief honcho was like a real mad scientist. Big ideas. He kept adding more angles every time some other project would quit and leave equipment he could lease. No, I don’t know who the top company was—maybe an insurance conglomerate, they had all the cash, didn’t they? I guess they’d pay to catch a look at the future, that figures. Anyway, John was go, go, go. Katharine was scared, that’s natural. She pictured him like, you know, H. G. Wells—walking around in some future world. John told her it wasn’t like that at all. All they’d get would be this flicker, like a second or two. All kinds of complications.’—Yes, yes, my greedy piglet, some brew for me too. This is thirsty work!  “So. ‘I remember I asked him, what about Earth moving? I mean, you could come back in a different place, right? He said they had that all figured. A spatial trajectory. Katharine was so scared we dropped it. John told her, don’t worry. I’ll come home. But he didn’t. Not that it makes any difference, of course, everything was wiped out. Salt Lake too. The only reason I’m here is that I went up by Calgary to see Mom, April twenty-ninth. May second it all blew. I didn’t find you folks at MacKenzie until July. I guess I may as well stay. That’s all I know about John, except that he was a solid guy. If that accident started all this it wasn’t his fault.  “‘The second document’—in the name of love, little mother, do I have to read all this? Oh, very well, but you will kiss me first, madam. Must you look so delicious? ‘The second document. Dated in the year eighteen, New Style, written by Carl’—see the old handwriting, my plump plump pigeon? Oh, very well, very well.  “‘Written at Bonneville Crater: I have seen my brother John Delgano. When I knew I had the rad sickness I came down here to look around. Salt Lake’s still hot. So I hiked up here by Bonneville. You can see the crater where the labs were, it’s grassed over. It’s different, not radioactive; my film’s okay. There’s a bare place in the middle. Some Indios here told me a monster shows up here every year in the spring. I saw it myself a couple of days after I got here, but I was too far away to see much, except I was sure it’s a man. In a vacuum suit. There was a lot of noise and dust, took me by surprise. It was all over in a second. I figured it’s pretty close to the day, I mean, May second, old.  “‘So I hung around a year and he showed up again yesterday. I was on the face side, and I could see his face through the visor. It’s John, all right. He’s hurt. I saw blood on his mouth and his suit is frayed some. He’s lying on the ground. He didn’t move while I could see him but the dust boiled up, like a man sliding onto base without moving. His eyes are open like he was looking. I don’t understand it anyway, but I know it’s John, not a ghost. He was in exactly the same position each time and there’s a loud crack like thunder and another sound like a siren, very fast. And an ozone smell, and smoke. I felt a kind of shudder.  “‘I know it’s John there and I think he’s alive. I have to leave here now to take this back while I can still walk. I think somebody should come here and see. Maybe you can help John. Signed, Carl Delgano.  “‘These records were kept by the MacKenzie Group, but it was not for several years’—etcetera, first light-print, etcetera, archives, analysts, etcetera—very good! Now it is time to meet your uncle, my edible one, after we go upstairs for just a moment.”  “No, Serli, I will wait for you downstairs,” said Mira prudently.  When they came into the town park Uncle Laban was directing the installation of a large durite slab in front of the enclosure around The Man John’s appearance-spot. The slab was wrapped in a curtain to await the official unveiling. Townspeople and tourists and children thronged the walks, and a Ride-for-God choir was singing in the band shell. The morning was warming up fast. Vendors hawked ices and straw toys of the monster and flowers and good-luck confetti to throw at him. Another religious group stood by in dark robes; they belonged to the Repentance church beyond the park. Their pastor was directing somber glares at the crowd in general and Mira’s uncle in particular.  Three official-looking strangers who had been at the inn came up and introduced themselves to Uncle Laban as observers from Alberta Central. They went on into the tent, which had been erected over the closure, carrying with them several pieces of equipment which the townsfolk eyed suspiciously.  The mechanics teacher finished organizing a squad of students to protect the slab’s curtain, and Mira and Serli and Laban went on into the tent. It was much hotter inside. Benches were set in rings around a railed enclosure about twenty feet in diameter. Inside the railing the earth was bare and scuffed. Several bunches of flowers and blooming poinciana branches leaned against the rail. The only thing inside the rail was a rough sandstone rock with markings etched on it.  Just as they came in, a small girl raced across the open center and was yelled at by everybody. The officials from Alberta were busy at one side of the rail, where the light-print box was mounted.  “Oh, no,” muttered Mira’s uncle, as one of the officials leaned over to set up a tripod stand inside the rails. He adjusted it, and a huge horsetail of fine feathery filaments blossomed out and eddied through the center of the space.  “Oh, no,” Laban said again. “Why can’t they let it be?”  “They’re trying to pick up dust from his suit, is that right?” Serli asked.  “Yes, insane. Did you get time to read?”  “Oh, yes,” said Serli.  “Sort of,” added Mira.  “Then you know. He’s falling. Trying to check his—well, call it velocity. Trying to slow down. He must have slipped or stumbled. We’re getting pretty close to when he lost his footing and started to fall. What did it? Did somebody trip him?” Laban looked from Mira to Serli, dead serious now. “How would you like to be the one who made John Delgano fall?”  “Ooh,” said Mira in quick sympathy. Then she said, “Oh.”  “You mean,” asked Serli, “whoever made him fall caused all the, caused—”  “Possible,” said Laban.  “Wait a minute.” Serli frowned. “He did fall. So somebody had to do it—I mean, he has to trip or whatever. If he doesn’t fall the past would all be changed, wouldn’t it? No war, no—”  “Possible,” Laban repeated. “God knows. All I know is that John Delgano and the space around him is the most unstable, improbable, highly charged area ever known on Earth, and I’m damned if I think anybody should go poking sticks in it.”  “Oh, come now, Laban!” One of the Alberta men joined them, smiling. “Our dust mop couldn’t trip a gnat. It’s just vitreous monofilaments.”  “Dust from the future,” grumbled Laban. “What’s it going to tell you? That the future has dust in it?”  “If we could only get a trace from that thing in his hand.”  “In his hand?” asked Mira. Serli started leafing hurriedly through the pamphlet.  “We’ve had a recording analyzer aimed at it,” the Albertan lowered his voice, glancing around. “A spectroscope. We know there’s something there, or was. Can’t get a decent reading. It’s severely deteriorated.”  “People poking at him, grabbing at him,” Laban muttered. “You—”  “TEN MINUTES!” shouted a man with a megaphone. “Take your places, friends and strangers.”  The Repentance people were filing in at one side, intoning an ancient incantation, “Mi-seri-cordia, Ora pro nobis!”  The atmosphere suddenly became tense. It was now very close and hot in the big tent. A boy from the mayor’s office wiggled through the crowd, beckoning Laban’s party to come and sit in the guest chairs on the second level on the “face” side. In front of them at the rail one of the Repentance ministers was arguing with an Albertan official over his right to occupy the space taken by a recorder, it being his special duty to look into The Man John’s eyes.  “Can he really see us?” Mira asked her uncle.  “Blink your eyes,” Laban told her. “A new scene every blink, that’s what he sees. Phantasmagoria. Blink-blink-blink—for god knows how long.”  “Mi-sere-re, pec-cavi,” chanted the penitentials. A soprano neighed. “May the red of sin pa-aa-ass from us!”  “They believe his oxygen tab went red because of the state of their souls,” Laban chuckled. “Their souls are going to have to stay damned awhile; John Delgano has been on oxygen reserve for five centuries—or rather, he will be low for five centuries more. At a half-second per year his time, that’s fifteen minutes. We know from the audio trace he’s still breathing more or less normally, and the reserve was good for twenty minutes. So they should have their salvation about the year seven hundred, if they last that long.”  “FIVE MINUTES! Take your seats, folks. Please sit down so everyone can see. Sit down, folks.”  “It says we’ll hear his voice through his suit speaker,” Serli whispered. “Do you know what he’s saying?”  “You get mostly a twenty-cycle howl,” Laban whispered back. “The recorders have spliced up something like ayt, part of an old word. Take centuries to get enough to translate.”  “Is it a message?”  “Who knows? Could be his word for ‘date’ or ‘hate.’ ‘Too late,’ maybe. Anything.”  The tent was quieting. A fat child by the railing started to cry and was pulled back onto a lap. There was a subdued mumble of praying. The Holy Joy faction on the far side rustled their flowers.  “Why don’t we set our clocks by him?”  “It’s changing. He’s on sidereal time.”  “ONE MINUTE.”  In the hush the praying voices rose slightly. From outside a chicken cackled. The bare center space looked absolutely ordinary. Over it the recorder’s silvery filaments eddied gently in the breath from a hundred lungs. Another recorder could be heard ticking faintly.  For long seconds nothing happened.  The air developed a tiny hum. At the same moment Mira caught a movement at the railing on her left.  The hum developed a beat and vanished into a peculiar silence and suddenly everything happened at once.  Sound burst on them, raced shockingly up the audible scale. The air cracked as something rolled and tumbled in the space. There was a grinding, wailing roar and—  He was there.  Solid, huge—a huge man in a monster-suit, his head was a dull bronze transparent globe, holding a human face, a dark smear of open mouth. His position was impossible, legs strained forward thrusting himself back, his arms frozen in a whirlwind swing. Although he seemed to be in frantic forward motion nothing moved, only one of his legs buckled or sagged slightly—  —And then he was gone, utterly and completely gone in a thunderclap, leaving only the incredible afterimage in their staring eyes. Air boomed, shuddering; dust rolled out mixed with smoke.  “Oh! Oh, my god,” gasped Mira, unheard, clinging to Serli. Voices were crying out, choking. “He saw me, he saw me!” a woman shrieked. A few people dazedly threw their confetti into the empty dust-cloud, most had failed to throw at all. Children began to howl. “He saw me!” the woman screamed hysterically. “Red, oh, Lord have mercy!” a deep male voice intoned.  Mira heard Laban swearing furiously and looked again into the space. As the dust settled she could see that the recorder’s tripod had tipped over into the center. There was a dusty mound lying against it—flowers. Most of the end of the stand seemed to have disappeared or been melted. Of the filaments nothing could be seen.  “Some damn fool pitched flowers into it. Come on, let’s get out.”  “Was it under, did it trip him?” asked Mira, squeezed in the crowd.  “It was still red, his oxygen thing,” Serli said over her head. “No mercy this trip, eh, Laban?”  “Shsh!” Mira caught the Repentance pastor’s dark glance. They jostled through the enclosure gate and were out in the sunlit park, voices exclaiming, chattering loudly in excitement and relief.  “It was terrible,” Mira cried softly. “Oh, I never thought it was a real live man. There he is, he’s there. Why can’t we help him? Did we trip him?”  “I don’t know, I don’t think so,” her uncle grunted. They sat down near the new monument, fanning themselves. The curtain was still in place.  “Did we change the past?” Serli laughed, looked lovingly at his little wife. For a moment he wondered why she was wearing such odd earrings; then he remembered he had given them to her at that Indian pueblo they’d passed.  “But it wasn’t just those Alberta people,” said Mira. She seemed obsessed with the idea. “It was the flowers really.” She wiped at her forehead.  “Mechanics or superstition,” chuckled Serli. “Which is the culprit, love or science?”  “Shsh.” Mira looked about nervously. “The flowers were love, I guess . . . . I feel so strange. It’s hot. Oh, thank you.” Uncle Laban had succeeded in attracting the attention of the iced-drink vendor.  People were chatting normally now, and the choir struck into a cheerful song. At one side of the park a line of people were waiting to sign their names in the visitors’ book. The mayor appeared at the park gate, leading a party up the bougainvillea alley for the unveiling of the monument.  “What did it say on that stone by his foot?” Mira asked. Serli showed her the guidebook picture of Carl’s rock with the inscription translated below: WELCOME HOME JOHN.  “I wonder if he can see it.”  The mayor was about to begin his speech.  Much later when the crowd had gone away the monument stood alone in the dark, displaying to the moon the inscription in the language of that time and place:   On this spot there appears annually the form of Major John Delgano, the first and only man to travel in time.  Major Delgano was sent into the future some hours before the holocaust of Day Zero. All knowledge of the means by which he was sent is lost, perhaps forever. It is believed that an accident occurred which sent him much farther than was intended. Some analysts speculate that he may have gone as far as fifty thousand years ahead. Having reached this unknown point Major Delgano apparently was recalled, or attempted to return, along the course in space and time through which he was sent. His trajectory is thought to start at the point which our solar system will occupy at a future time and is tangent to the complex helix which our earth describes around the sun.  He appears on this spot in the annual instants in which his course intersects our planet’s orbit, and he is apparently able to touch the ground in those instants. Since no trace of his passage into the future has been manifested, it is believed that he is returning by a different means than he went forward. He is alive in our present. Our past is his future and our future is his past. The time of his appearances is shifting gradually in solar time to converge on the moment of 1153.6, on may 2, 1989 old style, or Day Zero.  The explosion which accompanied his return to his own time and place may have occurred when some elements of the past instants of his course were carried with him into their own prior existence. It is certain that this explosion precipitated the worldwide holocaust which ended forever the Age of Hardscience.  —He was falling, losing control, failing in his fight against the terrible momentum he had gained, fighting with his human legs shaking in the inhuman stiffness of his armor, his soles charred, not gripping well now, not enough traction to break, battling, thrusting as the flashes came, the punishing alternation of light, dark, light, dark, which he had borne so long, the claps of air thickening and thinning against his armor as he skidded through space which was time, desperately braking as the flickers of Earth hammered against his feet—only his feet mattered now, only to slow and stay on course—and the pull, the beacon was getting slacker; as he came near home it was fanning out, hard to stay centered; he was becoming, he supposed, more probable; the wound he had punched in time was healing itself. In the beginning it had been so tight—a single ray of light in a closing tunnel—he had hurled himself after it like an electron flying to the anode, aimed surely along that exquisitely complex single vector of possibility of life, shot and been shot like a squeezed pip into the last chink in that rejecting and rejected nowhere through which he, John Delgano, could conceivably continue to exist, the hole leading to home—had pounded down it across time, across space, pumping with desperate legs as the real Earth of that unreal time came under him, his course as certain as the twisting dash of an animal down its burrow, he a cosmic mouse on an interstellar, intertemporal race for his nest with the wrongness of everything closing round the rightness of that one course, the atoms of his heart, his blood, his every cell crying Home—HOME!—as he drove himself after that fading breath-hole, each step faster, surer, stronger, until he raced with invincible momentum upon the rolling flickers of Earth as a man might race a rolling log in a torrent. Only the stars stayed constant around him from flash to flash, he looking down past his feet at a million strobes of Crux, of Triangulum; once at the height of his stride he had risked, a century’s glance upward and seen the Bears weirdly strung out from Polaris—but a Polaris not the Pole Star now, he realized, jerking his eyes back to his racing feet, thinking, I am walking home to Polaris, home! to the strobing beat. He had ceased to remember where he had been, the beings, people or aliens or things, he had glimpsed in the impossible moment of being where he could not be; had ceased to see the flashes of worlds around him, each flash different, the jumble of bodies, shapes, walls, colors, landscapes—some lasting a breath, some changing pell-mell—the faces, limbs, things poking at him; the nights he had pounded through, dark or lit by strange lamps, roofed or unroofed, the days flashing sunlight, gales, dust, snow, interiors innumerable, strobe after strobe into night again; he was in daylight now, a hall of some kind; I am getting closer at last, he thought, the feel is changing—but he had to slow down, to check; and that stone near his feet, it had stayed there some time now, he wanted to risk a look but he did not dare, he was so tired, and he was sliding, was going out of control, fighting to kill the merciless velocity that would not let him slow down; he was hurt, too, something had hit him back there, they had done something, he didn’t know what, back somewhere in the kaleidoscope of faces, arms, hooks, beams, centuries of creatures grabbing at him—and his oxygen was going, never mind, it would last—it had to last, he was going home, home! And he had forgotten now the message he had tried to shout, hoping it could be picked up somehow, the important thing he had repeated; and the thing he had carried, it was gone now, his camera was gone too, something had torn it away—but he was coming home! Home! If only he could kill this momentum, could stay on the failing course, could slip, scramble, slide, somehow ride this avalanche down to home, to home—and his throat said Home!—called Kate, Kate! And his heart shouted, his lungs almost gone now, as his legs fought, fought and failed, as his feet gripped and skidded and held and slid, as he pitched, flailed, pushed, strove in the gale of timerush across space, across time, at the end of the longest path ever: the path of John Delgano, coming home.    Originally published in Amazing Science Fiction, May 1972. Multiple Hugo and Nebula Award-winning author James Tiptree, Jr. was the pseudonym of the late Dr. Alice Sheldon, a semi-retired experimental psychologist and former member of the American intelligence community who also wrote occasionally under the name of Raccoona Sheldon. Dr. Sheldon's tragic death in 1987 put an end to \"both\" careers, but not before she had won two Nebula and two Hugo Awards as Tiptree, won another Nebula Award as Raccoona Sheldon, and established herself, under whatever name, as one of the very best science fiction writers of our times. As Tiptree, Dr. Sheldon published two novels, Up the Walls of the World and Brightness Falls From the Air, and nine short-story collections: Ten Thousand Light Years From Home, Warm Worlds and Otherwise, Starsongs of an Old Primate, Out of the Everywhere, Tales of the Quintana Roo, Byte Beautiful, The Starry Rift, the posthumously published Crown of Stars, and the definitive posthumous retrospective collection, Her Smoke Rose Up Forever.", "text": "6240 words, short story, REPRINT\nThe Man Who Walked Home\nTransgression! Terror! And he thrust and lost there—punched into impossibility, abandoned never to be known how, the wrong man in the most wrong of all wrong places in that unimaginable collapse of never-to-be-reimagined mechanism—he stranded, undone, his lifeline severed, he in that nanosecond knowing his only tether parting, going away, the longest line to life withdrawing, winking out, disappearing forever beyond his grasp—telescoping away from him into the closing vortex beyond which lay his home, his life, his only possibility of being; seeing it sucked back into the deepest maw, melting, leaving him orphaned on what never-to-be-known shore of total wrongness—of beauty beyond joy, perhaps? Of horror? Of nothingness? Of profound otherness only, certainly—whatever it was, that place into which he transgressed, it could not support his life there, his violent and violating aberrance; and he, fierce, brave, crazy—clenched into total protest, one body-fist of utter repudiation of himself there in that place, forsaken there—what did he do? Rejected, exiled, hungering homeward more desperate than any lost beast driving for its unreachable home, his home, his HOME—and no way, no transport, no vehicle, means, machinery, no force but his intolerable resolve aimed homeward along that vanishing vector, that last and only lifeline—he did, what?\nHe walked.\nHome.\nPrecisely what hashed up in the work of the major industrial lessee of the Bonneville Particle Acceleration Facility in Idaho was never known. Or rather, all those who might have been able to diagnose the original malfunction were themselves obliterated almost at once in the greater catastrophe which followed.\nThe nature of this second cataclysm was not at first understood either. All that was ever certain was that at 1153.6 of May 2, 1989 Old Style, the Bonneville laboratories and all their personnel were transformed into an intimately disrupted form of matter resembling a high-energy plasma, which became rapidly airborne to the accompaniment of radiating seismic and atmospheric events.\nThe disturbed area unfortunately included an operational MIRV Watchdog bomb.\nIn the confusion of the next hours the Earth’s population was substantially reduced, the biosphere was altered, and the Earth itself was marked with numbers of more conventional craters. For some years thereafter, the survivors were existentially preoccupied and the peculiar dust bowl at Bonneville was left to weather by itself in the changing climatic cycles.\nIt was not a large crater; just over a kilometer in width and lacking the usual displacement lip. Its surface was covered with a finely divided substance which dried into dust. Before the rains began it was almost perfectly flat. Only in certain lights, had anyone been there to inspect it, a small surface-marking or abraded place could be detected almost exactly at the center.\nTwo decades after the disaster a party of short brown people appeared from the south, together with a flock of somewhat atypical sheep. The crater at this time appeared as a wide shallow basin in which the grass did not grow well, doubtless from the almost complete lack of soil microorganisms. Neither this nor the surrounding vigorous grass was found to harm the sheep. A few crude hogans went up at the southern edge and a faint path began to be traced across the crater itself, passing by the central bare spot.\nOne spring morning two children who had been driving sheep cross the crater came screaming back to camp. A monster had burst out of the ground before them, a huge flat animal making dreadful roar. It vanished in a flash and a shaking of the earth, leaving an evil smell. The sheep had run away.\nSince this last was visibly true, some elders investigated. Finding no sign of the monster and no place in which it could hide, they settled for beating the children, who settled for making a detour around the monster-spot, and nothing more occurred for a while.\nThe following spring the episode was repeated. This time an older girl was present, but she could add only that the monster seemed to be rushing flat out along the ground without moving at all. And there was a scraped place in the dirt. Again nothing was found; an evil-ward in a cleft stick was placed at the spot.\nWhen the same thing happened for the third time a year later, the detour was extended and other charm-wands were added. But since no harm seemed to come of it and the brown people had seen far worse, sheep-tending resumed as before. A few more instantaneous apparitions of the monster were noted, each time in the spring.\nAt the end of the third decade of the new era a tall old man limped down the hills from the south, pushing his pack upon a bicycle wheel. He camped on the far side of the crater, and soon found the monster-site. He attempted to question people about it, but no one understood him, so he traded a knife for some meat. Although he was obviously feeble, something about him dissuaded them from killing him, and this proved wise because he later assisted the women in treating several sick children.\nHe spent much time around the place of the apparition and was nearby when it made its next appearance. This excited him very much and he did several inexplicable but apparently harmless things, including moving his camp into the crater by the trail. He stayed on for a full year watching the site and was close by for its next manifestation. After this he spent a few days making a charm-stone for the spot and left northward, hobbling as he had come.\nMore decades passed. The crater eroded, and a rain-gully became an intermittent streamlet across the edge of the basin. The brown people and their sheep were attacked by a band of grizzled men, after which the survivors went away eastward. The winters of what had been Idaho were now frost-free; aspen and eucalyptus sprouted in the moist plain. Still the crater remained treeless, visible as a flat bowl of grass; and the bare place at the center remained. The skies cleared somewhat.\nAfter another three decades a larger band of black people with ox-drawn carts appeared and stayed for a time, but left again when they too saw the thunderclap-monster. A few other vagrants straggled by.\nFive decades later a small permanent settlement had grown up on the nearest range of hills, from which men riding on small ponies with dark stripes down their spines herded humped cattle near the crater. A herdsman’s hut was built by the streamlet, which in time became the habitation of an olive-skinned, red-haired family. In due course one of this clan again observed the monster-flash, but these people did not depart. The stone the tall man had placed was noted and left undisturbed.\nThe homestead at the crater’s edge grew into a group of three and was joined by others, and the trail across it became a cart road with a log bridge over the stream. At the center of the still faintly discernible crater the cart road made a bend, leaving a grassy place which bore in its center about a square meter of curiously impacted bare earth and a deeply etched sandstone rock.\nThe apparition of the monster was now known to occur regularly each spring on a certain morning in this place, and the children of the community dared each other to approach the spot. It was referred to in a phrase that could be translated as “the Old Dragon.” The Old Dragon’s appearance was always the same: a brief violent thunder-burst which began and cut off abruptly, in the midst of which a dragonlike creature was seen apparently in furious motion on the earth, although it never actually moved. Afterward there was a bad smell and the earth smoked. People who saw it from close by spoke of a shivering sensation.\nEarly in the second century two young men rode into town from the north. Their ponies were shaggier than the local breed, and the equipment they carried included two boxlike objects, which the young men set up at the monster-site. They stayed in the area a full year, observing two materializations of the Old Dragon, and they provided much news and maps of roads and trading towns in the cooler regions to the north. They built a windmill, which was accepted by the community, and offered to build a lighting machine, which was refused. Then they departed with their boxes after unsuccessfully attempting to persuade a local boy to learn to operate one.\nIn the course of the next decades other travelers stopped by and marveled at the monster, and there was sporadic fighting over the mountains to the south. One of the armed bands made a cattle raid into the crater hamlet. It was repulsed, but the raiders left a spotted sickness, which killed many. For all this time the bare place at the crater’s center remained, and the monster made his regular appearances, observed or not.\nThe hill-town grew and changed, and the crater hamlet grew to be a town. Roads widened and linked into networks. There were gray-green conifers in the hills now, spreading down into the plain, and chirruping lizards lived in their branches.\nAt century’s end a shabby band of skin-clad squatters with stunted milk-beasts erupted out of the west and were eventually killed or driven away, but not before the local herds had contracted a vicious parasite. Veterinaries were fetched from the market city up north, but little could be done. The families near the crater left, and for some decades the area was empty. Finally cattle of a new strain reappeared in the plain and the crater hamlet was reoccupied. Still the bare center continued annually to manifest the monster, and he became an accepted phenomenon of the area. On several occasions parties came from the distant Northwest Authority to observe it.\nThe crater hamlet flourished and grew into the fields where cattle had grazed, and part of the old crater became the town park. A small seasonal tourist industry based on the monster-site developed. The townspeople rented rooms for the appearances, and many more-or-less authentic monster-relics were on display in the local taverns.\nSeveral cults now grew up around the monster. One persistent belief held that it was a devil or damned soul forced to appear on Earth in torment to expiate the catastrophe of three centuries back. Others believed that it, or he, was some kind of messenger whose roar portended either doom or hope according to the believer. One very vocal sect taught that the apparition registered the moral conduct of the townspeople over the past year, and scrutinized the annual apparition for changes which could be interpreted for good or ill. It was considered lucky, or dangerous, to be touched by some of the dust raised by the monster. In every generation at least one small boy would try to hit the monster with a stick, usually acquiring a broken arm and a lifelong tavern tale. Pelting the monster with stones or other objects was a popular sport, and for some years people systematically flung prayers and flowers at it. Once a party tried to net it and were left with strings and vapor. The area itself had long since been fenced off at the center of the park.\nThrough all this the monster made his violently enigmatic annual appearance, sprawled furiously motionless, unreachably roaring.\nOnly as the fourth century of the new era went by was it apparent that the monster had been changing slightly. He was now no longer on the earth but had an arm and a leg thrust upward in a kicking or flailing gesture. As the years passed he began to change more quickly until at the end of the century he had risen to a contorted crouching pose, arms outflung as if frozen in gyration. His roar, too, seemed somewhat differently pitched, and the earth after him smoked more and more.\nIt was then widely felt that the man-monster was about to do something, to make some definitive manifestation, and a series of natural disasters and marvels gave support to a vigorous cult teaching this doctrine. Several religious leaders journeyed to the town to observe the apparitions.\nHowever, the decades passed and the man-monster did nothing more than turn slowly in place, so that he now appeared to be in the act of sliding or staggering while pushing himself backward like a creature blown before a gale. No wind, of course, could be felt, and presently the general climate quieted and nothing came of it all.\nEarly in the fifth century New Calendar three survey parties from the North Central Authority came through the area and stopped to observe the monster. A permanent recording device was set up at the site, after assurances to the townsfolk that no hardscience was involved. A local boy was trained to operate it; he quit when his girl left him but another volunteered. At this time nearly everyone believed that the apparition was a man, or the ghost of one. The record-machine boy and a few others including the school mechanics teacher referred to him as The Man John. In the next decades the roads were greatly improved; all forms of travel increased, and there was talk of building a canal to what had been the Snake River.\nOne May morning at the end of Century Five a young couple in a smart green mule-trap came jogging up the highroad from the Sandreas Rift Range to the southwest. The girl was golden-skinned and chatted with her young husband in a language unlike that ever heard by The Man John either at the end or the beginning of his life. What she said to him has, however, been heard in every age and tongue.\n“Oh, Serli, I’m so glad we’re taking this trip now! Next summer I’ll be busy with baby.”\nTo which Serli replied as young husbands often have, and so they trotted up to the town’s inn. Here they left trap and bags and went in search of her uncle, who was expecting them there. The morrow was the day of The Man John’s annual appearance, and her Uncle Laban had come from the MacKenzie History Museum to observe it and to make certain arrangements.\nThey found him with the town school instructor of mechanics, who was also the recorder at the monster-site. Presently Uncle Laban took them all with him to the town mayor’s office to meet with various religious personages. The mayor was not unaware of tourist values, but he took Uncle Laban’s part in securing the cultists’ grudging assent to the MacKenzie authorities’ secular interpretation of the monster, which was made easier by the fact that the cults disagreed among themselves. Then, seeing how pretty the niece was, the mayor took them all home to dinner.\nWhen they returned to the inn for the night it was abrawl with holidaymakers.\n“Whew,” said Uncle Laban. “I’ve talked myself dry, sister’s daughter. What a weight of holy nonsense is that Moksha female! Serli, my lad, I know you have questions. Let me hand you this to read, it’s the guidebook we’re giving them to sell. Tomorrow I’ll answer for it all.” And he disappeared into the crowded tavern.\nSo Serli and his bride took the pamphlet upstairs to bed with them, but it was not until the next morning at breakfast that they found time to read it.\n“‘All that is known of John Delgano,’” read Serli with his mouth full, “‘comes from two documents left by his brother Carl Delgano in the archives of the MacKenzie Group in the early years after the holocaust.’ Put some honey on this cake, Mira my dove. Verbatim transcript follows, this is Carl Delgano speaking:\n“‘I’m not an engineer or an astronaut like John, I ran an electronics repair shop in Salt Lake City. John was only trained as a spaceman, he never got to space; the slump wiped all that out. So he tied up with this commercial group who were leasing part of Bonneville. They wanted a man for some kind of hard vacuum tests, that’s all I knew about it. John and his wife moved to Bonneville, but we all got together several times a year, our wives were like sisters. John had two kids, Clara and Paul.\n“‘The tests were supposed to be secret, but John told me confidentially they were trying for an antigravity chamber. I don’t know if it ever worked. That was the year before.\n“‘Then that winter they came down for Christmas and John said they had something far out. He was excited. A temporal displacement, he called it; some kind of time effect. He said their chief honcho was like a real mad scientist. Big ideas. He kept adding more angles every time some other project would quit and leave equipment he could lease. No, I don’t know who the top company was—maybe an insurance conglomerate, they had all the cash, didn’t they? I guess they’d pay to catch a look at the future, that figures. Anyway, John was go, go, go. Katharine was scared, that’s natural. She pictured him like, you know, H. G. Wells—walking around in some future world. John told her it wasn’t like that at all. All they’d get would be this flicker, like a second or two. All kinds of complications.’—Yes, yes, my greedy piglet, some brew for me too. This is thirsty work!\n“So. ‘I remember I asked him, what about Earth moving? I mean, you could come back in a different place, right? He said they had that all figured. A spatial trajectory. Katharine was so scared we dropped it. John told her, don’t worry. I’ll come home. But he didn’t. Not that it makes any difference, of course, everything was wiped out. Salt Lake too. The only reason I’m here is that I went up by Calgary to see Mom, April twenty-ninth. May second it all blew. I didn’t find you folks at MacKenzie until July. I guess I may as well stay. That’s all I know about John, except that he was a solid guy. If that accident started all this it wasn’t his fault.\n“‘The second document’—in the name of love, little mother, do I have to read all this? Oh, very well, but you will kiss me first, madam. Must you look so delicious? ‘The second document. Dated in the year eighteen, New Style, written by Carl’—see the old handwriting, my plump plump pigeon? Oh, very well, very well.\n“‘Written at Bonneville Crater: I have seen my brother John Delgano. When I knew I had the rad sickness I came down here to look around. Salt Lake’s still hot. So I hiked up here by Bonneville. You can see the crater where the labs were, it’s grassed over. It’s different, not radioactive; my film’s okay. There’s a bare place in the middle. Some Indios here told me a monster shows up here every year in the spring. I saw it myself a couple of days after I got here, but I was too far away to see much, except I was sure it’s a man. In a vacuum suit. There was a lot of noise and dust, took me by surprise. It was all over in a second. I figured it’s pretty close to the day, I mean, May second, old.\n“‘So I hung around a year and he showed up again yesterday. I was on the face side, and I could see his face through the visor. It’s John, all right. He’s hurt. I saw blood on his mouth and his suit is frayed some. He’s lying on the ground. He didn’t move while I could see him but the dust boiled up, like a man sliding onto base without moving. His eyes are open like he was looking. I don’t understand it anyway, but I know it’s John, not a ghost. He was in exactly the same position each time and there’s a loud crack like thunder and another sound like a siren, very fast. And an ozone smell, and smoke. I felt a kind of shudder.\n“‘I know it’s John there and I think he’s alive. I have to leave here now to take this back while I can still walk. I think somebody should come here and see. Maybe you can help John. Signed, Carl Delgano.\n“‘These records were kept by the MacKenzie Group, but it was not for several years’—etcetera, first light-print, etcetera, archives, analysts, etcetera—very good! Now it is time to meet your uncle, my edible one, after we go upstairs for just a moment.”\n“No, Serli, I will wait for you downstairs,” said Mira prudently.\nWhen they came into the town park Uncle Laban was directing the installation of a large durite slab in front of the enclosure around The Man John’s appearance-spot. The slab was wrapped in a curtain to await the official unveiling. Townspeople and tourists and children thronged the walks, and a Ride-for-God choir was singing in the band shell. The morning was warming up fast. Vendors hawked ices and straw toys of the monster and flowers and good-luck confetti to throw at him. Another religious group stood by in dark robes; they belonged to the Repentance church beyond the park. Their pastor was directing somber glares at the crowd in general and Mira’s uncle in particular.\nThree official-looking strangers who had been at the inn came up and introduced themselves to Uncle Laban as observers from Alberta Central. They went on into the tent, which had been erected over the closure, carrying with them several pieces of equipment which the townsfolk eyed suspiciously.\nThe mechanics teacher finished organizing a squad of students to protect the slab’s curtain, and Mira and Serli and Laban went on into the tent. It was much hotter inside. Benches were set in rings around a railed enclosure about twenty feet in diameter. Inside the railing the earth was bare and scuffed. Several bunches of flowers and blooming poinciana branches leaned against the rail. The only thing inside the rail was a rough sandstone rock with markings etched on it.\nJust as they came in, a small girl raced across the open center and was yelled at by everybody. The officials from Alberta were busy at one side of the rail, where the light-print box was mounted.\n“Oh, no,” muttered Mira’s uncle, as one of the officials leaned over to set up a tripod stand inside the rails. He adjusted it, and a huge horsetail of fine feathery filaments blossomed out and eddied through the center of the space.\n“Oh, no,” Laban said again. “Why can’t they let it be?”\n“They’re trying to pick up dust from his suit, is that right?” Serli asked.\n“Yes, insane. Did you get time to read?”\n“Oh, yes,” said Serli.\n“Sort of,” added Mira.\n“Then you know. He’s falling. Trying to check his—well, call it velocity. Trying to slow down. He must have slipped or stumbled. We’re getting pretty close to when he lost his footing and started to fall. What did it? Did somebody trip him?” Laban looked from Mira to Serli, dead serious now. “How would you like to be the one who made John Delgano fall?”\n“Ooh,” said Mira in quick sympathy. Then she said, “Oh.”\n“You mean,” asked Serli, “whoever made him fall caused all the, caused—”\n“Possible,” said Laban.\n“Wait a minute.” Serli frowned. “He did fall. So somebody had to do it—I mean, he has to trip or whatever. If he doesn’t fall the past would all be changed, wouldn’t it? No war, no—”\n“Possible,” Laban repeated. “God knows. All I know is that John Delgano and the space around him is the most unstable, improbable, highly charged area ever known on Earth, and I’m damned if I think anybody should go poking sticks in it.”\n“Oh, come now, Laban!” One of the Alberta men joined them, smiling. “Our dust mop couldn’t trip a gnat. It’s just vitreous monofilaments.”\n“Dust from the future,” grumbled Laban. “What’s it going to tell you? That the future has dust in it?”\n“If we could only get a trace from that thing in his hand.”\n“In his hand?” asked Mira. Serli started leafing hurriedly through the pamphlet.\n“We’ve had a recording analyzer aimed at it,” the Albertan lowered his voice, glancing around. “A spectroscope. We know there’s something there, or was. Can’t get a decent reading. It’s severely deteriorated.”\n“People poking at him, grabbing at him,” Laban muttered. “You—”\n“TEN MINUTES!” shouted a man with a megaphone. “Take your places, friends and strangers.”\nThe Repentance people were filing in at one side, intoning an ancient incantation, “Mi-seri-cordia, Ora pro nobis!”\nThe atmosphere suddenly became tense. It was now very close and hot in the big tent. A boy from the mayor’s office wiggled through the crowd, beckoning Laban’s party to come and sit in the guest chairs on the second level on the “face” side. In front of them at the rail one of the Repentance ministers was arguing with an Albertan official over his right to occupy the space taken by a recorder, it being his special duty to look into The Man John’s eyes.\n“Can he really see us?” Mira asked her uncle.\n“Blink your eyes,” Laban told her. “A new scene every blink, that’s what he sees. Phantasmagoria. Blink-blink-blink—for god knows how long.”\n“Mi-sere-re, pec-cavi,” chanted the penitentials. A soprano neighed. “May the red of sin pa-aa-ass from us!”\n“They believe his oxygen tab went red because of the state of their souls,” Laban chuckled. “Their souls are going to have to stay damned awhile; John Delgano has been on oxygen reserve for five centuries—or rather, he will be low for five centuries more. At a half-second per year his time, that’s fifteen minutes. We know from the audio trace he’s still breathing more or less normally, and the reserve was good for twenty minutes. So they should have their salvation about the year seven hundred, if they last that long.”\n“FIVE MINUTES! Take your seats, folks. Please sit down so everyone can see. Sit down, folks.”\n“It says we’ll hear his voice through his suit speaker,” Serli whispered. “Do you know what he’s saying?”\n“You get mostly a twenty-cycle howl,” Laban whispered back. “The recorders have spliced up something like ayt, part of an old word. Take centuries to get enough to translate.”\n“Is it a message?”\n“Who knows? Could be his word for ‘date’ or ‘hate.’ ‘Too late,’ maybe. Anything.”\nThe tent was quieting. A fat child by the railing started to cry and was pulled back onto a lap. There was a subdued mumble of praying. The Holy Joy faction on the far side rustled their flowers.\n“Why don’t we set our clocks by him?”\n“It’s changing. He’s on sidereal time.”\n“ONE MINUTE.”\nIn the hush the praying voices rose slightly. From outside a chicken cackled. The bare center space looked absolutely ordinary. Over it the recorder’s silvery filaments eddied gently in the breath from a hundred lungs. Another recorder could be heard ticking faintly.\nFor long seconds nothing happened.\nThe air developed a tiny hum. At the same moment Mira caught a movement at the railing on her left.\nThe hum developed a beat and vanished into a peculiar silence and suddenly everything happened at once.\nSound burst on them, raced shockingly up the audible scale. The air cracked as something rolled and tumbled in the space. There was a grinding, wailing roar and—\nHe was there.\nSolid, huge—a huge man in a monster-suit, his head was a dull bronze transparent globe, holding a human face, a dark smear of open mouth. His position was impossible, legs strained forward thrusting himself back, his arms frozen in a whirlwind swing. Although he seemed to be in frantic forward motion nothing moved, only one of his legs buckled or sagged slightly—\n—And then he was gone, utterly and completely gone in a thunderclap, leaving only the incredible afterimage in their staring eyes. Air boomed, shuddering; dust rolled out mixed with smoke.\n“Oh! Oh, my god,” gasped Mira, unheard, clinging to Serli. Voices were crying out, choking. “He saw me, he saw me!” a woman shrieked. A few people dazedly threw their confetti into the empty dust-cloud, most had failed to throw at all. Children began to howl. “He saw me!” the woman screamed hysterically. “Red, oh, Lord have mercy!” a deep male voice intoned.\nMira heard Laban swearing furiously and looked again into the space. As the dust settled she could see that the recorder’s tripod had tipped over into the center. There was a dusty mound lying against it—flowers. Most of the end of the stand seemed to have disappeared or been melted. Of the filaments nothing could be seen.\n“Some damn fool pitched flowers into it. Come on, let’s get out.”\n“Was it under, did it trip him?” asked Mira, squeezed in the crowd.\n“It was still red, his oxygen thing,” Serli said over her head. “No mercy this trip, eh, Laban?”\n“Shsh!” Mira caught the Repentance pastor’s dark glance. They jostled through the enclosure gate and were out in the sunlit park, voices exclaiming, chattering loudly in excitement and relief.\n“It was terrible,” Mira cried softly. “Oh, I never thought it was a real live man. There he is, he’s there. Why can’t we help him? Did we trip him?”\n“I don’t know, I don’t think so,” her uncle grunted. They sat down near the new monument, fanning themselves. The curtain was still in place.\n“Did we change the past?” Serli laughed, looked lovingly at his little wife. For a moment he wondered why she was wearing such odd earrings; then he remembered he had given them to her at that Indian pueblo they’d passed.\n“But it wasn’t just those Alberta people,” said Mira. She seemed obsessed with the idea. “It was the flowers really.” She wiped at her forehead.\n“Mechanics or superstition,” chuckled Serli. “Which is the culprit, love or science?”\n“Shsh.” Mira looked about nervously. “The flowers were love, I guess . . . . I feel so strange. It’s hot. Oh, thank you.” Uncle Laban had succeeded in attracting the attention of the iced-drink vendor.\nPeople were chatting normally now, and the choir struck into a cheerful song. At one side of the park a line of people were waiting to sign their names in the visitors’ book. The mayor appeared at the park gate, leading a party up the bougainvillea alley for the unveiling of the monument.\n“What did it say on that stone by his foot?” Mira asked. Serli showed her the guidebook picture of Carl’s rock with the inscription translated below: WELCOME HOME JOHN.\n“I wonder if he can see it.”\nThe mayor was about to begin his speech.\nMuch later when the crowd had gone away the monument stood alone in the dark, displaying to the moon the inscription in the language of that time and place:\nOn this spot there appears annually the form of Major John Delgano, the first and only man to travel in time.\nMajor Delgano was sent into the future some hours before the holocaust of Day Zero. All knowledge of the means by which he was sent is lost, perhaps forever. It is believed that an accident occurred which sent him much farther than was intended. Some analysts speculate that he may have gone as far as fifty thousand years ahead. Having reached this unknown point Major Delgano apparently was recalled, or attempted to return, along the course in space and time through which he was sent. His trajectory is thought to start at the point which our solar system will occupy at a future time and is tangent to the complex helix which our earth describes around the sun.\nHe appears on this spot in the annual instants in which his course intersects our planet’s orbit, and he is apparently able to touch the ground in those instants. Since no trace of his passage into the future has been manifested, it is believed that he is returning by a different means than he went forward. He is alive in our present. Our past is his future and our future is his past. The time of his appearances is shifting gradually in solar time to converge on the moment of 1153.6, on may 2, 1989 old style, or Day Zero.\nThe explosion which accompanied his return to his own time and place may have occurred when some elements of the past instants of his course were carried with him into their own prior existence. It is certain that this explosion precipitated the worldwide holocaust which ended forever the Age of Hardscience.\n—He was falling, losing control, failing in his fight against the terrible momentum he had gained, fighting with his human legs shaking in the inhuman stiffness of his armor, his soles charred, not gripping well now, not enough traction to break, battling, thrusting as the flashes came, the punishing alternation of light, dark, light, dark, which he had borne so long, the claps of air thickening and thinning against his armor as he skidded through space which was time, desperately braking as the flickers of Earth hammered against his feet—only his feet mattered now, only to slow and stay on course—and the pull, the beacon was getting slacker; as he came near home it was fanning out, hard to stay centered; he was becoming, he supposed, more probable; the wound he had punched in time was healing itself. In the beginning it had been so tight—a single ray of light in a closing tunnel—he had hurled himself after it like an electron flying to the anode, aimed surely along that exquisitely complex single vector of possibility of life, shot and been shot like a squeezed pip into the last chink in that rejecting and rejected nowhere through which he, John Delgano, could conceivably continue to exist, the hole leading to home—had pounded down it across time, across space, pumping with desperate legs as the real Earth of that unreal time came under him, his course as certain as the twisting dash of an animal down its burrow, he a cosmic mouse on an interstellar, intertemporal race for his nest with the wrongness of everything closing round the rightness of that one course, the atoms of his heart, his blood, his every cell crying Home—HOME!—as he drove himself after that fading breath-hole, each step faster, surer, stronger, until he raced with invincible momentum upon the rolling flickers of Earth as a man might race a rolling log in a torrent. Only the stars stayed constant around him from flash to flash, he looking down past his feet at a million strobes of Crux, of Triangulum; once at the height of his stride he had risked, a century’s glance upward and seen the Bears weirdly strung out from Polaris—but a Polaris not the Pole Star now, he realized, jerking his eyes back to his racing feet, thinking, I am walking home to Polaris, home! to the strobing beat. He had ceased to remember where he had been, the beings, people or aliens or things, he had glimpsed in the impossible moment of being where he could not be; had ceased to see the flashes of worlds around him, each flash different, the jumble of bodies, shapes, walls, colors, landscapes—some lasting a breath, some changing pell-mell—the faces, limbs, things poking at him; the nights he had pounded through, dark or lit by strange lamps, roofed or unroofed, the days flashing sunlight, gales, dust, snow, interiors innumerable, strobe after strobe into night again; he was in daylight now, a hall of some kind; I am getting closer at last, he thought, the feel is changing—but he had to slow down, to check; and that stone near his feet, it had stayed there some time now, he wanted to risk a look but he did not dare, he was so tired, and he was sliding, was going out of control, fighting to kill the merciless velocity that would not let him slow down; he was hurt, too, something had hit him back there, they had done something, he didn’t know what, back somewhere in the kaleidoscope of faces, arms, hooks, beams, centuries of creatures grabbing at him—and his oxygen was going, never mind, it would last—it had to last, he was going home, home! And he had forgotten now the message he had tried to shout, hoping it could be picked up somehow, the important thing he had repeated; and the thing he had carried, it was gone now, his camera was gone too, something had torn it away—but he was coming home! Home! If only he could kill this momentum, could stay on the failing course, could slip, scramble, slide, somehow ride this avalanche down to home, to home—and his throat said Home!—called Kate, Kate! And his heart shouted, his lungs almost gone now, as his legs fought, fought and failed, as his feet gripped and skidded and held and slid, as he pitched, flailed, pushed, strove in the gale of timerush across space, across time, at the end of the longest path ever: the path of John Delgano, coming home.\nOriginally published in Amazing Science Fiction, May 1972.\nMultiple Hugo and Nebula Award-winning author James Tiptree, Jr. was the pseudonym of the late Dr. Alice Sheldon, a semi-retired experimental psychologist and former member of the American intelligence community who also wrote occasionally under the name of Raccoona Sheldon. Dr. Sheldon's tragic death in 1987 put an end to \"both\" careers, but not before she had won two Nebula and two Hugo Awards as Tiptree, won another Nebula Award as Raccoona Sheldon, and established herself, under whatever name, as one of the very best science fiction writers of our times. As Tiptree, Dr. Sheldon published two novels, Up the Walls of the World and Brightness Falls From the Air, and nine short-story collections: Ten Thousand Light Years From Home, Warm Worlds and Otherwise, Starsongs of an Old Primate, Out of the Everywhere, Tales of the Quintana Roo, Byte Beautiful, The Starry Rift, the posthumously published Crown of Stars, and the definitive posthumous retrospective collection, Her Smoke Rose Up Forever.", "source": "https://clarkesworldmagazine.com/tiptree_05_17_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Man Who Walked Home by James Tiptree Jr."}