{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Marissa Lingen", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "fBlaNfToDfm0YyKQsL8Db/qWTRw=", "id": null, "license": null, "comments": "", "raw_text": "11420 words, novelette, REPRINT  Left to Take the Lead  The day I found out my Uncle Will was still alive, I had been out spraying the crops in a full crinkly hazmat suit. The Earthers I was working for were nice people, but they always whined about the suits. To me they seemed light and airy, hardly even an annoyance compared to a vacuum suit, so I was the one who would get sent out first with the sprayer when the blight warnings came in from the provincial capital in Edmonton.  I didn’t mind. It was the tenth month of my indenture on Earth, and I had almost gotten used to the smell, but even so a little overlay of antifungal didn’t change it much. Earthers always want to know where I was working so they can figure out what smell, because Earthers think it matters—oh, the salt sea smell, they say, nodding wisely, or the grassy prairie smell, or the other Earther things they think they know.  But among us we don’t have to hear where, because we know the stink of dirt and concrete and mixed musk that is Earth, whether it’s got salt sea and juniper on top or snow melt and alpine flowers or growing corn. It’s all Earth.  In my case, though, it was the Canadian prairie, the bit in Alberta right before it buckles up and becomes mountains, the bit nobody settled much until the climate shifted, and now they were keen to have anyone they could get to work on it. Offworlders would do, because they thought the cold of space would get us used to it. They never seemed to understand that we didn’t spend any time up close and personal with the cold of space. The cold of space means something has gone badly wrong, back at home.  Not that I’d gotten to be back at home since the collapse.  It took me just ages to figure out that they don’t think they’re lying when they say, “You’ll get used to the weather.” Apparently when you’ve always had weather, you can get used to different weather. But when you’ve never had weather at all, it’s very hard to get used to blizzards, and tornadoes are just not on the list. Apparently they only used to have them once a year or less. This seemed still unbearable but much closer to civilized to me.  On our ships out in the Oort Cloud we had tornadoes not at all, and solar storms were points of interest, not terror. Nearly everyone I met on Earth made some comment about being in a tiny ball surrounded by vacuum, as if that didn’t describe their circumstances also. Earthers are weird.  But the Pavelkas were a good assignment for an indenture on Earth: warm-hearted, truly willing to treat their indentured servants as temporary family members. The daughter of the family, Anna-Reese, took the same number of work shifts as we did, and we all ate together, three times a day around the big applewood table in the kitchen. When we were hip-deep in antifungals from yet another blight or exhausted from extra shifts with pregnant bison, so was Anna-Reese. So were her parents. And they gave us time to ourselves in the evening, to read or watch vids or go out or read the boards or message our families.  I didn’t expect much in the way of messages from my family. Most of them had died in the collapse. My little brother and sister would write to me from Mars every Sunday, dutifully, on their foster mother’s urging. I had two uncles remaining, and I didn’t know where either of them might be, or even if Uncle Will was still alive. Uncle Wys was the one I depended on. He messaged me, but I never knew where mining would take him next. He worked the high-risk jobs to try to strike it big enough to buy a ship so Hans and Cora and I could be with him as a family again.  But there was a message waiting in my queue that night when I got the worst of the grime showered off me. The time stamp on the message itself was from my work shift, but internal to the message there was a different date, four years ago. “Dear Monkey,” it started out, “If you’re reading this, I’ve failed.”  It took me another half hour to stop crying enough to read the rest of the message. No one had called me Monkey in four years. Not since the collapse. But I had to see what else he had to say, whether he was coming for me, and whether it might mean I could be with the rest of my family again. Even though he said he’d failed—there are different kinds of failure. There’s the kind that’s frustrating and you try again, and there’s the kind that leaves your family scattered on two or three different planets and who knew where in the outer system habitats.  I was just getting myself braced to read it when Tessa came in. “My God, what happened to you?”  “My uncle—” I managed.  “Oh, honey, I’m so sorry!” Tessa sat down next to me on my bed and hugged me fiercely.  “He’s not dead,” I managed around the hard press of her bony shoulder. “At least I don’t think. I couldn’t—I haven’t—”  She held me out at arm’s length, gripping my shoulders, and waited.  “I haven’t heard from him for years, really years. This isn’t the one I—the one I talk to. I kept not hearing. I’ve asked on every Oort board there is, and nobody can find him.”  Tessa turned me to Uncle Will’s letter and waited while I read it, then read it again. I think she knew that I would go back and reread it over and over if left to my own devices. She softly touched my shoulder to get my attention back, murmuring, “And?”  “He was trying—” I took a shuddering, jagged breath. “He was trying to get to a place where he could have me and my brother and sister again. He was trying to get court decisions reversed on our old property so that we could have our actual home back. He spent every dime he earned on court costs, and he lost. And he doesn’t have a way to get back the guardianship of the little ones now that he’s lost.”  Tessa glanced at the picture I keep of them. The cube could easily be programmed to show video loops or a series of still pictures, and I have them stored on there. But I just leave it on one picture, me and Hans and Cora and our cousin Xiang-Ming before she died. We all look really happy. When I can make it to Mars, I’ll get another one with just me and Hans and Cora. The picture was six years ago, and Cora has grown so much. Hans too, but—Cora was just tiny then.  We change so fast.  “I’m sorry your uncle doesn’t have a way to get them back,” said Tessa gently. She’s a very gentle person. “I know that’s important to you. Do you think your uncle hopes to help with your education debts, or—?”  “He can’t do it,” I said. “He feels terrible, he’s blaming himself, but—he can’t. And honestly I don’t know that he understands how in-system education and indenture work.”  “Couldn’t he and your other uncle figure it out together?” said Tessa.  “I don’t know. After the collapse, they—they didn’t agree on what to do next, and there was a big fight, and—I don’t know what will happen. Whether they’re even speaking to each other. Of course if one got a ship, the other would be welcome, but . . . that’s all on Uncle Wys now.”  “Ah,” said Tess, who very clearly had no experience with uncles gallivanting about the outer reaches of the solar system. I’m not even sure she would know her uncles on the street. She never talked about family beyond parents and siblings. Earthers are weird, they’re all little islands with no connections to speak of. That’s how they ended up with all this mess of debt and indenture, because nobody knows who anybody’s cousin is.  Out in the Oort Cloud, we don’t have indentured servants. Didn’t. We didn’t have indentured servants, before the Chornohora Disaster and everything that followed. I don’t know what the corporations have exported out there now. But in-system, perhaps a third of the people are indentured servants at one point in their lives, mostly due to debts. There’s personal debt and educational debt and family debt and—these people could not have made such a mess of my home if they didn’t think about debt all the damn time.  But I didn’t really have any choice—I got thrust into the middle of their system as a barely-emancipated minor. They let me go to university. That’s what they know how to do with the young in-system: educate them, let them rack up debt. I knew that Uncle Wys would send for me as soon as he had the place for us, so I made sure that when I went to that university on Callisto, it was in deep-field astrophysics, something that could be useful to the family ship when we had a family ship again.  Something an Oort girl could properly do.  But Callisto, while it wasn’t anywhere near as in-system crazy as Earth, worked on the same plan: if you didn’t have a family to pay for you, you racked up the debt, and then you worked an indenture in one of the undesirable jobs to pay it off. If I’d taken a degree in something they wanted, something they thought was useful in-system, I could have wiped my indenture clean in a year. Climatologists did that, and research mycologists. Now that I was on Earth, I could see why they wanted so many mycologists. But if I’d chosen either of those fields, I’d be stuck in-system for good when my family needed me. Better to work the Pavelkas’ farm and wait for Uncle Wys.  It made the in-system dramas make a lot more sense, because not only do they have people avoiding indentured servitude at the very last minute, but almost every story has indentured servants in it. Or they’ll have people meeting at the indentured service assignment office and trying to arrange indentures together if it’s a happy story, being haunted by the lost connection if it’s a melancholy one.  When I was little and we were watching one as a family, I asked my mother what that place was, and she said it was like the equivalent of the pilot licensing bureau for in-system people. She was dead wrong and didn’t even know it. She just had no idea how much debt is on these people’s minds, like a malfunctioning beacon every moment: “debt debt debt debt d’debt debt . . . .” They’re not like us, they never say, “It wouldn’t be any use to the family,” when they’ve decided not to do something. They say, “I can’t afford it.”  I’d been spending the last five years living like one of them, hardly ever saying anything about my family out loud. Now there was this message from Uncle Will. And what it was saying was no. No, we can’t be together. No, I’ve failed. No, you have to keep on spraying for rusts and fungus without any idea when you’ll see Hans and Cora again. No.  I didn’t know what to say. I didn’t even know what to think. Except that, oh, I was so glad he was alive. I checked to see if there was any way to track a return message. There wasn’t. I could send one, of course—just replying to the sender—but I wouldn’t know if he saw it that day or the next or never. And I wouldn’t know where he was.  That was nothing new.  But the return message could wait, since I couldn’t find him with it and he wasn’t coming for me any time soon. It could wait, and supper couldn’t. I threw a warm flannel shirt on over my clean trousers and undershirt and tried a smile out on Tess.  “That’s pathetic,” she said. “No one would believe that was a happy face. But you’re in luck: the news feed was all bad, so they won’t notice you’re upset. They’ll be too busy with their own problems.”  “Oh,” I said. “Good?”  “Yeah, it’s fabulous. We’ll be out in the suits all week. It’ll be a miracle if the wheat grows at all, with the cocktails of antifungals they’ll have us put on it. Who knows if any of them will work.”  I winced. Hard to tell whether it would be a hard week or a hard year, if the reports were that bad. I propped up my fake smile.  “Better,” said Tessa.  The Pavelkas around the supper table that night reminded me of my family when the mining was poor: tight-lipped, ready for the children to talk about anything that would distract them. Tess and I, since we weren’t family, were the “children,” but we didn’t have that much to talk about since we’d spent the day in the fields with them and I was dodging bringing up my uncle.  Catie tried all the same. “What do you hear from your brother and sister, Holly?”  “They seem to have picked up hockey,” I said, smiling ruefully at the way their faces lit up. For me, all Earthers are more or less the same, their little differences over language and religion and politics amounting to family squabbles. They can’t keep our clans straight either. But to them, it matters, and one of the things that makes Canadians happy is hockey. They have a special bond with Martians that way.  “Oh, great!” said Anna-Reese. “They can send you feeds of their games—not in real time with the lag, obviously, and the cost would be too much anyway, but the delayed feed will be almost as satisfying.”  I had not even thought of watching entire games of my little siblings darting about Martian ice with little Martians, chasing awkwardly after a puck, but I could see from the way Anna-Reese said it that it was what I had to do. I could see that Hans and Cora would be expecting it. I might have to ask the Pavelkas what to say to them so that it sounded like I was paying attention. I would pay attention, but I wouldn’t have the faintest idea what to say. You looked very fast. How well you almost hit the net with the tiny object. Well done, crashing into the other child at the correct time.  Asking the Pavelkas seemed a much better idea than trying to make a go of that sort of conversation myself.  We made short work of the dishes, but the whole time I was thinking of what to write back to my uncle. I thought I knew what I would say to him if I could see him again—I had thought of it hundreds, thousands of times over the last six years—but this was . . . not quite that. For one thing, if I saw him again, I’d know where he was. It turned out that made quite a difference.  “Never mind success or failure,” I wrote, pausing to put “Dear Uncle Will” at the top like a civilized person. “Where are you?” There was no way the messaging software would let me emphasize it enough, but I didn’t want to pay for voice transmission when I didn’t even know the message wouldn’t just drop into the void forever. I could save that credit for Hans and Cora, who would appreciate it.  “Where are you where are you where are you?” I wrote. I sounded more like the girl he’d left than the woman I’d become, but that was all right. It was what I actually wanted to say.  Then I couldn’t think what else. I sat and stared at the message.  “I am well,” I finally wrote, sounding like an etiquette manual, but there was at least room to go on from there. “My indenture here on Earth is on a farm. You wouldn’t believe the weather, far more than just solar storms. And trees! I thought I understood trees, but the little fruit things we have are nothing compared to the trees here.”  I realized that I had no idea whether Uncle Will had been to Earth. Maybe he knew about storms and trees and Earth things. Maybe he’d toured the Earth monuments. Maybe he was on Earth at that very moment, if not as close as Edmonton, somewhere else just like it, with rain and pollen and history. Without knowing, I didn’t know how to tell him the stories of my indenture, what it had been like to begin with, how Tessa had taught me a lot, how I’d adjusted and how I hadn’t.  I had never lived anywhere with trees before. You’d think it would be the same as having high walls or hills or a dome—it’s a high-up thing that’s mostly in your peripheral vision, but it’s really not. The fact that they’re alive turns out to matter a lot. The branches move around, and you can really tell they’re alive. It’s more like living with a herd of giant elephants or something than a dome.  Earth people do not think of it this way. But they should, because that’s what it’s like.  When I first got here, I was wary of the trees. I knew—I’m not stupid—that they didn’t pick up and wander around. I knew that Macbeth was being metaphorical, or mystical, or something. But they were still such large, moving, living things, all right there. I wasn’t used to it. I gave them wide berth when I walked out to do my chores.  Finally Tessa grabbed me by the wrist as we were coming in from our chores. “But look,” she said, dragging me into the back garden. “Here’s you!”  Her people were from New Orleans when there was one, and they kept moving up the mouth of the Mississippi, so now they live in Greater Memphis State. So her accent confused me. Anna-Reese said, “No, the yews are over there.”  Tess giggled and said, “No, it’s holly. Holly.” She put my hand on one of the smooth spiky leaves. I flinched back and then reached out again, more slowly, of my own accord.  “I forgot Dad had this back here,” said Anna-Reese. “Holly tree. You’re right, that’s you, Holly.”  “Hello, me-tree,” I said softly. The glossy dark leaf felt right, it felt just how it looked. We had no excuse to grow holly trees in our ships. Apple trees, pear trees, they earned their keep. Holly trees, no. I had never felt a leaf quite like that, thick and firm and unyielding.  And yet that was not the tree I bonded with. My tree was a little sturdy bigtoothed maple, its leaves thin and jagged and yielding, utterly unlike the holly in every way. You could lean on a maple. You could tell a maple your troubles, but I didn’t. I just leaned and breathed.  Thinking about those early days while trying to write to my Uncle Will, I realized how much distance had formed between us. He hadn’t heard from me when I was in college on Callisto, so writing, “I have a serious relationship with a maple tree,” would probably make no sense. I wrote it down anyway and then added, “but I will be okay leaving it when we get our ship figured out. My friend Tessa who teaches me about Earth and trees will be harder to leave. Maybe she will visit. Have you written to Uncle Wys? He’s going crazy missing you. We all miss you. Don’t wait so long to write again, even if you aren’t writing to say we have our ship back yet. It’s okay. We can work together on it. Love, Holly.”  Then I went to sleep. I’m not usually a great sleeper, but that night I slept fine. I dreamed I was back out in our ship in the void. Waking to the smell of Tessa’s cheap rose shampoo should have been jarring, but instead it was familiar now, homelike in a way I didn’t expect when I first came to Earth.  There was soya bean rust in the next riding to add to the anxiety of the previous day’s announcement, so we spent the day out in the back fields spraying with fungicide and then carefully washing down so we didn’t bring either rust or fungicide into the house. One of Wendell’s friends, a big hearty man from over by Swan Hills, got burns on his hands and almost up to his elbows from where he didn’t get the fungicide washed off. It wasn’t the same kind. Still, it’s a reminder to be careful every time we see him, the long reddish patches that stay on the skin like birthmarks.  The next day was more of the same before we could get back to the usual farm chores. The day after, we were out in the fields as usual, doing the work we knew. I never asked Anna-Reese and Tess what they thought about in the long hours running the farm machinery, but I think everyone knew I thought about my family, about my ship, the ship Uncle Wys would get us.  I heard the ramping up of noise that started the sirens, and I had that tractor backed around and headed for the barn before their wail was full. I fumbled my mask on while I went, in case it was a spore wind, but with the sky the color it was, I was pretty sure it was precipitation instead. Inclement weather. Rain. Rain. Weird, weird stuff, rain. Tessa had managed to convince me to go out in it, and it was nice when it was warm, like a water park or a shower.  But you couldn’t trust it. You could bet that the water park management wasn’t suddenly going to turn the heat all the way down so that you got ice pellets in your face. You could feel sure that your shower wasn’t going to pick you up and dash you against the wall. Rain is not so reliable.  I was always, always the first one into the shelter when the sirens blared. Did not matter how far away I was or whether the others were right there next to it. They took their time. They ambled. They stopped to peer at the sky and speculate, and if there were two of them, they would stand there and talk to each other about it, like they were the audience in the intermission of a concert, wondering what the musician would play in the second set.  Earthers are so weird.  So I got myself settled in the shelter. Eventually the others came in, Tessa and Anna-Reese together, then Wendell, and finally Catie, still wiping her hands on her shirt. She’d been making supper and smelled of fresh basil. I hoped the tornado wouldn’t take the herb patch. I hoped the tornado wouldn’t take any of it, but at the time all I could think of was the herb patch.  I couldn’t do anything during a storm. They all knew it and didn’t bother me, because it wouldn’t do any good. I paced. The rest of them settled right down and played a round of Sheephead, Catie’s favorite, and then a round of 500, Tess’ choice, and then the radio sounded the all-clear.  The tornado was a good eighty kilometers away. Which in space terms is next door, but it’s far enough not to destroy your herb patch. If you had an asteroid pass that close to your hab, you would say how close it was. Everyone would rush to the view windows to gape at it and say how close it was. But on Earth, eighty kilometers means your farm is fine and the neighbors’ farm is not, there, done.  It’s hard to even explain the kind of people you get when they live like this. They watch local news like they were going to have a cousin on it any day, but “local news” usually includes millions of people, none of whom they have any relation to or business deals with.  It’s also hard to get a sense of what to expect from the natural world. Farmers like the Pavelkas don’t routinely keep the gene sequence of their crops on hand. They just don’t. They figure they can get stuff sequenced if they need to. The seed companies try to tell them what’s resistant to different diseases, but the seed companies have lied about that so many times that no one on Earth believes them. Despite that the farmers still don’t keep their own gene database.  I had started to have the feeling that there were more rusts, more blights—generally just more fungus—than would be natural. I was starting to feel like someone was doing this to us—to them, really, but to me, too, as long as I was there. But was that true? Was that a reasonable feeling to have? Or was it just the result of an Oort girl living on an unsequenced planet?  I knew that Anna-Reese and Tess had not sequenced the people they were dating, so I could not fathom how they had any idea what possibilities the future might hold for them. How do you find out what a reasonable number of fungi would look like, from people who behave like that? Even if they’re your friends?  The next day I was walking down the main road, out to the back fields, when I saw an outcropping of mushrooms on the trees. Each one was bigger than my hand, broad and flat with a dappled brown pattern on the top. I took out my handheld and took a snapshot of them, then broke off a sample piece for good measure. Mycology is hard, even the rough-and-ready farm kind. Probably this was an ordinary fungus, but if I didn’t check and it turned out to be virulent, I would regret it bitterly.  I hoped it wasn’t. The bit I took had a smooth, spongy texture. It felt nice. Not like the holly leaf, not like the maple bark, its own thing. I hoped it fit. I was so tired of fighting off the things that didn’t fit.  My handheld said it was probably dryad’s saddle, perfectly fine for a maple tree, quite normal for the region. Quite normal for all of Earth, it looked like. I went on to my normal work, feeling a little foolish but keeping the sample for sequencing, just in case, just in case it wasn’t dryad’s saddle, just in case it had mutated into some new killer dryad’s saddle.  It’s hard to understand dryads when you live in a habitat. How could people make up tree spirits? When your only trees are little heavy-bearing fruit trees, it makes no sense; they’re just about the least spirited thing on a habitat. But then you meet trees, and you think, well, killer dryads, all right, sure, on a dark night without the scientific method, why not.  I spent the morning thinking so much about dryads that I didn’t contemplate my future ship at all. In the afternoon I moved on to trying to figure out how much of our lichen cultivation could coexist with mycoculture or whether that would just bring the problems of Earth out to the Oort. If Wendell and Catie had a bad blight year, they might lose a lot of money—enough of them, and they might lose the farm—but a bad blight year on a habitat doing a far-swing could kill off the crew. I spent long enough pondering the pros and cons that I was late coming in from the field, and quiet, and thoughtful. I put the fungus sample in the barn and then went in for my shower. Catie was sitting in the living room, her hair in a strange updo with tendrils, her pantsuit unusually shiny.  She glanced at me, then put down her handheld. “Lordy, child, if you don’t hurry, you’re not going to be ready nearly in time.”  “Ready?” I said stupidly.  “Don’t tell me you don’t want to go to my nephew’s wedding dance,” she said.  I did not tell her that. But honestly, I hadn’t bothered to remember when it was. I didn’t expect that Tessa and I would be invited. In the Oort, if you marry into a family, of course that family comes, and their friends, but there isn’t such a thing as a neighborhood to invite, much less servants.  We don’t really have the concept of servants at all, now that I think about it. I mean, there are people who do that kind of work in the larger families, but you can’t treat them differently or they’ll go join another family and then there’s you, changing your own fancy-pants bedding because you were too stupid to treat the person who did it for you as an equal. And I had been pretty clear that as an indentured servant, I had not been invited to join the Pavelka family, and that they’d be pretty offended if I assumed I had.  Tessa, though, had apparently assumed that we were invited. Maybe it’s an Earth thing? Tess wouldn’t have been mean enough to keep it from me if it was something she thought people had to be told. Anyway, she was in her underwear, wrapping a fancy sparkly band around her twists of hair when I got to our room.  “We’re going to the wedding dance, apparently,” I said.  She laughed. “What, did you think we were Cinderella? Come on, hurry up. You’ve only got one decent dress, so that’s what you’ll have to wear. Good thing you’ve got short hair, you wouldn’t have time to do it anyway.”  “You have a sister, don’t you, Tessie?” I said, digging into my drawer for stockings so that I didn’t have to look at her. When I turned back, she was standing hipshot, looking at me curiously. Her underwear was so green it almost glowed against her dark skin. Like she was a tree off the far slopes.  “You have a sister too,” she said.  “Cora was four when the catastrophe hit. I never had a chance to get ready for parties together. And—she might have chosen to move on, if it didn’t suit her to stay with us. Might have married into another family.”  “Oh, so family isn’t everything out in the Oort after all?” I must have looked angrier than intended, because Tessa said, “I’m sorry, Holly, I was just teasing. The way you talk it sounds like families always stay together forever. It’s nice to hear yours is . . . human like mine.”  She never talked about her family. “What do you mean, like yours?”  “My mom needs me,” she said. “My dad was killed in an accident at work, but he didn’t go quick. And Mom’s health has never been good. That’s what I’m doing this indenture for. My brother takes care of her, and I take care of the money. At least I do the best I can.”  “I didn’t know that,” I said softly. “Sorry to make the scary face.”  “Probably I’m just seeing the scary face around every corner,” she said. “I’m going to see Denis tonight, and I’m very nervous.”  Denis was an indentured hand on one of the neighboring farms, and I had sat through his corny jokes and bad dancing at more nights out than I could count. But he made Tessa smile. “I know he likes you,” I said around the smooth blue modal of my dress going over my head.  “That’s just it: I like him a lot. Like, really a lot. Holly, I think I want to ask him to marry me.”  I plopped down on her bed. “Wow. Oh, Tessie, oh, wow.”  “If you don’t do your makeup, you won’t be ready in time.”  “You know it takes me five seconds to do. Come on. Here, I’ll do it now if you’ll tell me more.”  “Zip me.” She turned around, so I obligingly pulled the long gray zipper up the back of her shining silver dress. “I’ve been thinking about it and thinking about it, and . . . I think he’s the one. Or at least a one.”  “Do you want me to see if his family’s in the Space Chicken Database?”  I waited for her to stop laughing. For some reason, Earthers—actually all in-system people—find the Space Chicken Database hilarious. She said what they always say—“Spaaaaace chicken! Ahahaha that’s awesome!”—and I waited some more. I’m so glad I’m not living on this planet permanently, because Earth people have a weird sense of humor.  Finally Tess got herself together and said, “Thank you, Holly, but we don’t sequence our partners behind their back. It’s not considered polite. There’s . . . a bad history there, for people like me.”  That didn’t make much sense to me—what was behind his back about it? Everyone in the outer system is in the SCD. It only started for breeding chickens ship to ship. Now it’s all life-forms. I knew it wasn’t expected on Earth, but I couldn’t see why not. They would have to do far too many scans to do in utero treatments for problems if they didn’t know what was in their genes already. I quickly brushed powder onto my cheeks, looking in the mirror so I didn’t have to cover my confusion for Tess.  “Well, he’d be a fool not to say yes,” I said when I had managed lipstick. “If not the database, let me know what friends are supposed to do here, and I’ll do it.”  She leaned down and hugged me around the shoulders from behind. “You’re sweet, Holly. Thank you.”  They told me that a lot. I had begun to take it to mean that they didn’t understand me but were sure of my goodwill. I resolved to start using it that way myself, since I felt that way about them all the time.  The wedding was short and the reception crowded. I had seen many of the guests in town, at the library or the movies or in the shops, walking along the streets. Some of them had come over to spend an evening with Anna-Reese, or with Catie and Wendell. But I always took half a second too long to recognize them in their celebratory finery, so almost all of them thought I didn’t remember them and introduced themselves to me again, with a faint air of offense.  I would have been most comfortable talking to Tess and Denis, but they were at a table in a corner with their heads together, and I knew I needed to give them space for their happy moment. The problem was, neither of them looked happy. I tried not to watch, but it was like a docking accident. Nothing was going where it should, it was impossible to look away, and the odds that something was about to be bent and damaged seemed to go up by the moment.  And in fact it was. Tess tossed her head and pushed her chair away from the table. Denis stood up half a moment after her, but I didn’t need to overhear them to know what had happened: that would be a no.  He was a fool after all, then.  I watched Tess all the way to the door. I doubted she was leaving—no way home without the rest of us, and it would be a long walk—and after a moment I decided to follow her out there. She was standing in the cooling evening, clutching her arms where her silvery dress left them bare.  “You okay?” I asked.  “Sure, yes, of course.” Her laugh was brittle. “I misread the situation. He said it was just an indenture fling. Lots of people have them, but you can’t mistake them for something they’re not.”  That last sentence had the sound of a quote. “He was boring anyway,” I said. “And he couldn’t dance, and he smelled like beans.”  She laughed again, and it had not gotten more genuine. I had no practice at this. It was not a thing anyone had ever asked of me at home, or in the Jovian system either. “What do you do about breakups in the Oort Cloud?” she asked.  “It depends,” I said. The trees near the hall were making loud tree noises, much louder than usual. I tried to ignore it, since Tessa was. “Ice cream, loud music, alcohol, making your cousins handle all trades with the other person’s ship. Unless your cousins are madder at them than you are.”  “The first three are traditional on Earth as well,” she said in a hollow, distant voice.  I felt the first few drops of water on my head and still, still, had the reaction that the plumbing must have sprung a leak. No. Rain. “Maybe they’ll have ice cream inside?” I said hopefully.  Tessa laughed. “I know they’ll have loud music and alcohol. But I’ll try to be moderate enough that you don’t have to handle trades for me. You’re right, we’d better go in.”  She had implied I was her cousin. I tried not to put any weight on that, but my feelings were completely treacherous. I flung my arm around her as we went into the hall, and she leaned in a moment, sighing. I had not had a cousin for so long.  “Come on, if we dance we don’t have to talk to people!” Tessa shouted over the music that was just starting. I tried that, but Tessa wanted to dance with everyone, all at once or trading off quickly, and I didn’t know how to make that work. I retreated to the wall and waited for the fun to end.  People who were not the hosts kept checking to see that I had a glass of champagne, which I did, very obviously held in front of me like a shield. Outsider: yes, and thanks for noticing.  One city auntie of the bride felt that it was her job to cordially engage the young people in conversation. I quickly discovered that this meant lecturing me about how badly her other niece was running her farm. Auntie had never farmed herself, of course, but if she did, she was sure that she would just douse the whole thing with every fungicide there was and be set for the season. “These young people, trying to cut costs,” she clucked.  “That’s not how it works,” I said aloud. The minute it was past my lips I wanted to take it back, but there it was, I might as well go with it.  “Excuse me?”  “The antifungals, they don’t work like that. There’s a cost to them.”  “Well, I’m sure I don’t know what they charge, but my niece—”  “Not what they charge,” I said. “What they cost. What they do to the crops, what they do to the rest of the plants in the area. Less crop yield, more dead plants.”  She looked at me over suddenly narrowed nostrils. “How pleasantly educational,” she said, and I flinched. I had no idea how to answer that, and her mouth was open to follow it with something probably equally scornful, when I was saved.  Or something.  I did not feel saved.  The blare of the sirens felt like it should have become familiar, but it hadn’t. It scared me every time. It was worse at the wedding, with the flashing lights of the wedding dance on the guests’ sparkling finery. The person I had been arguing with, the friend of the bride’s who had drunk too much and was talking too loudly, the ass who had just left my friend—they were all suddenly fellow human beings in peril, just when we should have been celebrating. Even though it wasn’t my celebration, even I could feel that.  The bride’s drunk friend tried to start the dancing again in the tornado shelter, but no one’s heart was in it. Instead we talked quietly, or huddled in silence, while people checked their handhelds: whose farm would it be, who was bearing the brunt of it now.  The tornadoes stayed high in the atmosphere. Atmosphere is one of the least confusing things about living on a planet, as long as you don’t start thinking like a planet-dweller. Things are three-dimensional in atmosphere. Gravity is enough to pull some of them down and others not. This is just like on a ship. It is safe and makes sense. Well. It makes sense, anyway.  We all filed out together to go back to our farms, damp and subdued. Tessa did not want to talk on the way home, nor when we got there. I was taking out my earrings and washing off the remains of my makeup when I saw that the message light was flashing again. It wasn’t quite Sunday yet, so I didn’t expect to hear from Hans and Cora. Unless there was something wrong. Something wrong was always a possibility. There had been that message from Uncle Will, and—it was a preset message, and maybe he’d been found dead. Or maybe something had happened to Uncle Wys, or—  I opened the message. It was type only, Uncle Wys on the identifier. “Kiddo, I am so sorry,” it began. “Truly I am. I have been saving and saving, and you said that Hans and Cora seemed okay, you said that their foster parents were not like you read about in old stories, so I thought I would get you home first and then see about them.  “But there was an accident. I don’t want you to worry. They were able to deal with it. I was just evaing—” The program had corrected when he was trying to say EVAing. It didn’t know any better. Probably written on one of the Jovian moons, where they try to go extravehicular as little as possible. Stupid Jovian programs.  I realized that I was trying not to read what he had written. I steeled myself to go on.  “—and my teammate slipped up, so all my money has gone to my medical bills. I’m fine, don’t worry! It’s just . . . I had saved, and it’s all gone now.”  I swayed. He was going to be okay. But the ship I had been counting on, my uncle’s ship, my family’s ship, had just evaporated. I would finish my indenture with nothing and nowhere, instead of a family, to go home to.  No one had broken up with me, not ever, but I glanced over at Tessa. “Ice cream?” I managed. She nodded. We went down and raided the Pavelkas’ kitchen in silence. I curled up around my handheld in bed after, reading, rereading. Tess put her pillow over her head and went to sleep.  It was hard to know what to do with a Sunday off after that. Often Tess would want to go into town together, but in the wake of Denis’ departure she had no interest in it, and I preferred the time to myself after the crowds of the wedding reception and the storm shelter. The trees were quieter than the night before, more subdued, safer. Tamer.  When I checked after my walk, my account had my Sunday letters. “Dear Holly,” Hans began. “Cora will probably tell you that she came to my hockey match and that we beat the Robinson Dome Bears 4-2. What she will not say is that Marti told her she didn’t have to come, she could stay home and work on her genetics project if she wanted, and Cora just looked at her and said, ‘He has a family. People should know he has a family. He should know.’ And she came and I got a goal and an assist.”  I squinched my eyes together so Tessie wouldn’t find me crying over another family letter. Explaining seemed like too much.  Hans would have known he had a family. Hans was old enough to know. But he was letting me know that Cora was old enough too. That he was doing what he could for our sister, to raise her an Oorter even outside the Oort. I wondered if they ever met up with any other refugee kids there on Mars, so I actually went ahead and asked.  I also asked him if Uncle Will had written to him. I hoped he had. I told him a little about the soya rust and the storm near us, but I kept it simple. He’d never lived in thick atmosphere like this, so he wouldn’t be able to relate. Mars storms were sparser, dustier. I thought about bringing them down sometime, but I knew I wouldn’t do it. The experience would be fascinating for them, but it wasn’t worth postponing paying off my indentures just so that they could meet trees. Almost worth it. But not quite.  I went to help Tess get ready for supper. She was humming and draining the beans she had steamed, getting ready to combine everything. They often asked Tess to cook. Me almost never. When I first got there, they asked if I cooked, and I said yes, so Catie asked me to cook a real Oort Cloud meal one night to be nice.  It turns out that they don’t eat a lot of lichen on Earth. They made very polite faces. But where Tess is from, down at the mouth of the Mississippi, they are famous for their cooking. Everyone on Earth, nearly, thinks it’s a treat to get their cooking. They just keep edging up the continent as the Mississippi eats it, cooking whatever’s left and humming as they do it, or so I hear. They tell me that’s not just Tess, the cooking and humming.  “You ever think of becoming a chef, Tessie?” I said.  She smiled. “Oh no, hon. This way I cook what I want for people I love, not the same thing over and over again for strangers.”  Again the sweetness: she had not used the word cousin this time, but love was close enough. I wondered if her mom and brother were making the same beans or if they were missing Tessa’s.  The sequencing came back on the dryad’s saddle I’d sampled. It was regular dryad’s saddle, not any danger to the farm or the trees or me. But it had another fungi growing on it, a new one the sequencer in Edmonton didn’t recognize. They thanked me for sending it in, for being careful.  I didn’t feel careful. I just felt foolish. I tried to imagine staying on Earth long enough to know which fungus were okay, which were dangerous, and I couldn’t imagine any of it. I could imagine eating ice cream with Tessa late at night, but my imagination shifted that to a hab or a ship.  I sleepwalked through my week and nearly spilled some of the latest antifungal on my feet before I had my protective gear on. Nobody yelled at me, they just gave me space to breathe.  The trees and I needed a lot of space to breathe.  I discovered I was less numb than I thought when the sirens sounded again, jolting me into noticing the sickly green of the sky. My stomach still lurched. I still hurried for the shelter.  Strangely, Tessa was there before me.  When Anna-Reese and Wendell finally came in, they were soaked and gray-faced. They locked the shelter door above them. Wendell didn’t say a word, and Anna-Reese just shook her head at her mother. Catie stuffed her fist in her mouth and let out a jagged whimper.  No one played cards. Soon the noise was too deafening above us. I wanted to pace as usual, but Tess was sitting in the corner, huddled up into a ball. I went and sat next to her, and then the Pavelkas, all in the corner, even though I knew they trusted the shelter more than I did.  The noise was like standing behind FTL ship engines, like the mother of all docking accidents. For all that the previous storms had scared me, the difference was so clear. I had a fleeting flash of relief: I had nearly nothing to my name, so there was nothing I could lose in the tornado. I had already lost what was mine to lose. There was nothing worse it could do to me.  Then, of course, it all came in on me, like a giant weight on my head: I had lived with the Pavelkas long enough to feel at home in my little room with Tessa, long enough that it was wrenching to imagine the windows smashed or the ceiling fallen in. And even though the Pavelkas were Earthers, they weren’t corporate, not like the people who had taken my home. No one else should have to live through what we had—but it was harder, somehow, knowing their names and faces.  The storm continued to howl outside the storm cellar. Instinctively I crouched down even further, although of course there was no need. I had to flinch from the noise, though; it was unimaginably loud. The howling and wailing of the storm was impossible to keep at a distance. My conscious mind could totally understand that the storm was not in the shelter with me, but my bones felt only that it was loud and scary and had to be right there.  I couldn’t hear Tessa whimpering next to me, but I could feel it through bone conduction. I put my arms around her like she was my little sister, like she was Cora’s age and needed comforting. Her shoulders were round and solid, shaking and shaking. I looked around, feeling the noise like it ought to be something visible. Anna-Reese saw me looking for help and scooted around. She came over and put her arms around Tessa from the other side. We held her like that until the worst of the shrieking had passed outside and we could hear her say, “I’m all right. I’m all right.”  Anna-Reese said briskly, “Of course you are. We’re all safe down here. It’ll be all right.”  “There’s often an eye in the middle of the storm,” said her mother from her place huddled on the floor by the wall. “You’re all staying down here until we get an all-clear from the weather service.”  “No one’s going anywhere,” said Anna-Reese in her best calm voice. It must have cost her more energy than I had at the time to maintain that calm. Tessa whimpered again, and this time we could all hear her.  “Tessie, are you . . . ?” asked Catie.  “I’m just overwhelmed,” Tessa managed. “I mean—I’m scared, not hurt.” And then, so quietly only I could hear her, “They need me.”  “I know,” I whispered back, even more quietly. But I couldn’t do anything for Tessa’s mom and brother, any more than I could for my own family. I could only do something for Tessa. I rummaged through the supplies. “There’s a thermos of something hot. No time like the present.”  “It’s soup,” said Catie. “I heated some chicken soup from the freezer to put in there, when I heard the storm was coming.” It had lemons and garlic and slightly too much salt in it. But it was still warm, and we needed something warm, something shared. We needed something to do other than worrying.  We all drank from the same little thermos cup, and waited.  The second wave of the storm was at least as bad as the first. But we were braced for it, we held each other, we waited, and the second silence was more sure, more lasting.  The all-clear was far less comfort than it should have been. Catie hustled us into the car, not looking at the wreck that had been her house. I thought we would stay with one of their friends or relations for the night—perhaps in the beds vacated by the honeymooning couple—but the storm was bigger than that. “F5,” said Wendell glumly. “Maybe 6 or 7.” So we tripped and slogged our way through the green, wet-smelling night into the school gym. Tess fell asleep on my shoulder before they could get cots. I was sure I wouldn’t be able to sleep like that. I was wrong.  I woke up in the middle of the night with Tess gone and an ache in my back. I made my way to one of the cots and dove into more sleep. I dreamed of my uncles being pulled away from me, out into the storm.  The morning was incongruously bright, full of volunteers and cheap flapjacks. My work clothes felt gritty from storm and sleep, but I needed to see the farm before I did anything else. Not the town or random locals, but the farm where I had lived. I hitched a ride out there with others who were itchy to help.  I knew, without saying, that the Pavelkas would desperately need our labor, but they wouldn’t be able to keep paying for it with this much damage. No one had to tell me I would have to find a new indenture. It was finally, at last, something that I knew without having to be told.  The lane was strewn with corpses. The tornado had left almost nothing of the groves of trees that lined the lane, nothing of the windbreak—the wind had broken them instead, I kept thinking, but I couldn’t speak it aloud in case someone thought I meant to be clever and laughed. They were splintered open, the bark peeled back and their insides fractured into hundreds of sharp fragments, branches cracked and tangled with each other. Trees from one grove had been flung into another, into the remnants of the barn, driven into the ground by their branches.  The Earthers were not treating them like corpses. The Earthers were treating them like furniture. The smell of their sap and leaves, their life spilling out, was in everything, and the Earthers were treating it just the same as the spilled trash bag from the bins, another thing to pick up.  And they took my brother and sister to grow up on a planet like this, where they would try to teach them to treat living things like this, worse than we treated outgrown clothes on my ship, worse than a bad prize at the county fair on Chornohora Station before Chornohora Station became a synonym for death.  I could not let Hans and Cora grow up planet people, I could not, I could not.  I turned and saw that Catie was there, weeping for her trees. It broke in me then. I almost reached for her, but she was not my auntie. So we stood crying separately, among the bodies of those trees, not making sounds.  “You’ll replant,” I said.  “Oh yes.”  “From seeds?”  “From seeds in most places,” she agreed. “The provincial government funds some saplings, a few larger trees for windbreak.” She saw that I didn’t know why they would pay for it. “To keep the soil anchored, to keep the winds from going on unimpeded and just getting worse as they go . . . you’ve never been on a prairie without lots of windbreaks, child. Believe me, you don’t want to.”  “Like Titan,” I said. And then I saw that the dunes of Titan meant nothing to her, and I didn’t want to take up her time with explaining. Instead I said, “You’ll get there. It’ll be how it’s supposed to be again.”  “I hope so. Someday. For Anna-Reese, maybe.”  “When Kevin gets home,” I said, and Catie frowned.  “Who said Kevin was coming home?”  I floundered. “I mean, with the farm—”  “He’ll be home for Christmas, like always.”  “But—if Tessie and I have to—”  “We’ll get by, don’t you worry,” said Catie, but her mouth was tight, and her tone was flat. Kevin was not coming home. Kevin, the golden boy, the pride of the family, would not come home when his family farm was devastated by a tornado.  I will never, ever understand Earthers.  I said a few more words to comfort Catie, or at least they were meant to. I was no more sure than I was with Tess after Denis disappointed her. Then I found my way back to the school shelter, where there was a group of volunteers from the east showing up to help us out in our time of need. I hoped Catie didn’t have to deal with them much unless they had a better idea of what would help her feel better than I did.  They gave us each a bag with some things in it: a flannel shirt and some stretchy cotton trousers, several changes of socks and underwear and T-shirts, a printed book apiece. They asked if we had shoes and at least one bra each, because they were short on shoes and bras. My book was The Great Gatsby, and my underwear was that color of beige that they pretend will blend in with a lot of Euro and Asian people’s skin but actually matches nobody’s. It was two shades lighter than mine. It rode up in the back. I don’t understand why Earthers can’t make decent underwear without charging an entire asteroid for it.  You absolutely cannot complain about your creeping underpants to people who have just lost their entire livelihood. And yet there they are as you try to wash muck off things and dig them out of the mud and generally clean up the whole place: creep, creep, creep.  I gave The Great Gatsby to Tessa. I wasn’t going to take it back up into space with me, not with the weight limits, not with perfectly serviceable electronic copies. It was a good gift for a shelter where electricity to charge your devices might go out tonight and not come back until tomorrow or next week, where you might not have planned with backup power like a sensible person, because Earthers think that power is like everything else, infinitely flowing.  She looked at it and looked at me. “You’re going back up,” she said.  “We’ll see what they give me.”  “But you’re going back up.”  “I think so. Tess, you are my cousin.”  “That’s sweet, Holly,” she said, but I could tell it didn’t mean anything to her.  “No, but—you are. When I have a ship—”  She was making a face, pushing it aside. For her it was like saying when I am the Queen of Mars, when I reengineer fungus to be heat-intolerant again. I would have to figure out how to explain it to her. I stood there for a moment, wanting to figure out something, anything, that would make her feel better, but I couldn’t think what that would be, and I had an appointment to make with the indenture coordinators.  The indenture office made an effort to be warm and welcoming by Earth standards. The furniture was not bolted down, but other than that it was really trying, with soft blues and greens and flowing hangings, to be relaxing.  I was not in a frame of mind to be relaxed. But at least I had some clarity.  The indenture coordinator was a soft, pleasant-looking woman with very large red earrings and mid-brown skin between Tessa’s and mine in color. She had my file on her device and greeted me cheerfully. “Holly Vermuelen-Wing,” she said. “Do you want to stay with farmwork, Holly? The Pavelkas give you high ratings.”  “I’d rather go offworld,” I said. “I’m not from here, and—” I stopped. I couldn’t explain to her about the lane full of tree corpses, the way that weather came upon you without warning, the underwear that was even now creeping. Everything that was wrong with Earth was normal to her, her entire life. “I have minor siblings. I’d like to pay off my debt sooner so that I can regain custody.”  She frowned. “Most off-Earth jobs don’t pay as well, so you actually would make a faster job of it planetside.”  “I can mine,” I said.  The woman’s frown deepened. “There’s nothing about that in your college transcripts.”  “Look farther back.”  She blinked, and her face softened into pity. I saw that sometimes, from people who actually knew what had happened to families like mine. “Oort background. Well, that does change things. Are you sure you want to mine in the Belt? It’s not like what you’re used to.”  “Rough company ships, low-status labor,” I said. “I know. But it pays well.”  “Oh yes. Pays better than anything else people do for their indenture. Any better pay than that and you’re having your indenture bought out right away.”  “I’ll take it, then.” I didn’t care if Martians looked down on me when I was visiting their towns on leave. The only Martians I really cared about were the ones taking care of Hans and Cora.  The important thing was that I needed to get my home back. I needed to make a place where my family could be together again. I had been waiting around for that to happen—for Uncle Wystan to come through, or Uncle Will if he was still alive, or somebody. But a home isn’t the sort of thing you can rely on other people to make for you. Sometimes you get some people who can help. But you have to do it yourself. I had finally learned that.  The nice indenture board woman was still looking at me, her broad, soft face still creased into the lines of pity. “Are you sure, honey?” she said. “The tornado was bad, I know, but we’ve gotten pretty good at bouncing back from tornadoes. We can place you with another farm pretty similar to the one you were working on. You can even visit your old host family while they get back on their feet—meet up in Edmonton if you don’t want to spend all the time and credits to come back to the farm. Or if it’s too hard to see it like this.”  She understood a lot. There was a lot she didn’t understand, too.  “I don’t belong on Earth,” I said gently. “You’re right, my host family has been great, and I’m upset by all this. But more than anything, this has taught me that I don’t belong on Earth long-term. I need to get back into space.”  She nodded, pressing her lips back in a sympathetic grimace. “I guess I understand. If they tried to stick me up there in one of those tin cans—”  I winced, but she went on.  “I bet I’d want to come back down here to Earth as fast as I could, too. You’re sure you don’t want to try to find a safer assignment, though? One of the care facilities on the moon, maybe? You could wheel old people around into the low-grav sections and back. They’d probably like you.”  I had forgotten that Earthers think the moon is space. I didn’t laugh in her face. “I just want to get my indenture over with. I’ve got experience with mining, and I—” I let my voice crack so that she’d let me get this over with. “I miss my grandparents too much when I’m around old people. They were at Chornohora Station.”  “I see.” I could tell she still wanted to talk me out of it, but she was pretty much done with objections, given that her job was to sign people up for indentures—and Chornohora was always a conversation stopper. “Well, remember that your specific contract is renewable every six months. If you really hate it, you can always switch back to farmwork after half a year. Or try something else.”  “I’ll remember,” I said. I signed and thumb-printed and eye-scanned and signed again and all the other things that they make you do to verify that yes, it’s you, and yes, you really want this, no, really, you want this. And it was done. I was heading back to space again the day after tomorrow, a transport up to “the” moon and then out from there.  I stopped to rest my hand on the corpses of several trees on my way out, picking out a large splinter from the last one with my nails. I wanted to apologize, but they’re trees. Even if you like them, you know they don’t listen to you.  I waited for Tessa to come back from her own indenture appointment. She didn’t take long. She was hardly picking up her feet, and if I didn’t know her voice well enough to pick it out of background murmur, I wouldn’t have heard her quiet, “Hey, Holly.”  “Hey. I got my mining reposting.”  “That’s . . . good, I guess. Sounds awful to me, but . . . I’m glad you got what you wanted.”  I looked at her defeated shoulders, and I remembered how Anna-Reese and I had held her during the storm. Something changes in you, when you treat a friend like your baby sister. Something changes in the friendship. Tessa was not sensible, not levelheaded, not any of the things I was supposed to value in bringing people into the family. But she had introduced me to trees, and I had been there for the worst week of her life. We were cousins now.  “What I said earlier—I’ll make a place for you,” I told her. “You and your mom and your brother. You’ll have a place with my family.”  She looked up, interested. “What if the rest of your family doesn’t—”  “That’s not how it works,” I said. “If I say we have a place for you, then we do. I’m the one who’s—” I took a deep breath. I hadn’t thought of it this way before, not really. But Uncle Wystan’s message was clear enough, the way I saw it. “I’m the one who’s the head of the family now. I’m the one who’s got to make a place for Hans and Cora and everybody. So if I say you’re in, you’re in. Just try not to make anybody too crazy, and I’ll tell them to try the same for you.”  Her smile didn’t reach her eyes. “It’s a nice dream, Holly. It really is.”  “I mean it.”  “I know you do.” And I suppose Tessa was more sensible and thinking further ahead than I’d thought. She brightened up a little. “Hey, what if I make a place for you?”  “Are you going to buy a ship?”  She laughed. “Oh, Holly. I don’t know. But—we’ll both try the hardest we can, all right? To make a decent place?”  “That’s what cousins do,” I said. “And we’ll talk to each other before we buy a ship or a farm or—or whatever else.”  “Yes. Yes.” She laughed, shaking her head. “This family of yours is going to weird me out. But I bet when I explain your Oort stuff to my family, they’ll be pretty weirded out too.”  “Will they try to stop you?”  “Honey, they might take you up on that offer to come live in space.”  I hugged her hard. Then I couldn’t put it off any longer. I grabbed the bag the disaster relief people had given me, complete with ugly socks and underwear. And that was it. We didn’t say goodbye, we didn’t say that we loved each other, although you don’t make someone your cousin if you don’t love them. We didn’t say anything about when we’d see each other again, because we didn’t know. I just went, and she stayed.  But we knew we had each other.  I pulled up a message to my brother and sister; I owed it to them. “Dear Hans and Cora,” I wrote. “You may not like the risk I’m taking, but I hope it will give us a chance to be together as a family sooner.” It felt familiar, but from the other side. After a moment’s thought, I copied Uncle Wys on the message, then Uncle Will.  I couldn’t rely on them to give me a home anymore. I was going to have to make sure they could rely on me.    Originally published in Analog Science Fiction, July/August 2018.", "text": "11420 words, novelette, REPRINT\nLeft to Take the Lead\nThe day I found out my Uncle Will was still alive, I had been out spraying the crops in a full crinkly hazmat suit. The Earthers I was working for were nice people, but they always whined about the suits. To me they seemed light and airy, hardly even an annoyance compared to a vacuum suit, so I was the one who would get sent out first with the sprayer when the blight warnings came in from the provincial capital in Edmonton.\nI didn’t mind. It was the tenth month of my indenture on Earth, and I had almost gotten used to the smell, but even so a little overlay of antifungal didn’t change it much. Earthers always want to know where I was working so they can figure out what smell, because Earthers think it matters—oh, the salt sea smell, they say, nodding wisely, or the grassy prairie smell, or the other Earther things they think they know.\nBut among us we don’t have to hear where, because we know the stink of dirt and concrete and mixed musk that is Earth, whether it’s got salt sea and juniper on top or snow melt and alpine flowers or growing corn. It’s all Earth.\nIn my case, though, it was the Canadian prairie, the bit in Alberta right before it buckles up and becomes mountains, the bit nobody settled much until the climate shifted, and now they were keen to have anyone they could get to work on it. Offworlders would do, because they thought the cold of space would get us used to it. They never seemed to understand that we didn’t spend any time up close and personal with the cold of space. The cold of space means something has gone badly wrong, back at home.\nNot that I’d gotten to be back at home since the collapse.\nIt took me just ages to figure out that they don’t think they’re lying when they say, “You’ll get used to the weather.” Apparently when you’ve always had weather, you can get used to different weather. But when you’ve never had weather at all, it’s very hard to get used to blizzards, and tornadoes are just not on the list. Apparently they only used to have them once a year or less. This seemed still unbearable but much closer to civilized to me.\nOn our ships out in the Oort Cloud we had tornadoes not at all, and solar storms were points of interest, not terror. Nearly everyone I met on Earth made some comment about being in a tiny ball surrounded by vacuum, as if that didn’t describe their circumstances also. Earthers are weird.\nBut the Pavelkas were a good assignment for an indenture on Earth: warm-hearted, truly willing to treat their indentured servants as temporary family members. The daughter of the family, Anna-Reese, took the same number of work shifts as we did, and we all ate together, three times a day around the big applewood table in the kitchen. When we were hip-deep in antifungals from yet another blight or exhausted from extra shifts with pregnant bison, so was Anna-Reese. So were her parents. And they gave us time to ourselves in the evening, to read or watch vids or go out or read the boards or message our families.\nI didn’t expect much in the way of messages from my family. Most of them had died in the collapse. My little brother and sister would write to me from Mars every Sunday, dutifully, on their foster mother’s urging. I had two uncles remaining, and I didn’t know where either of them might be, or even if Uncle Will was still alive. Uncle Wys was the one I depended on. He messaged me, but I never knew where mining would take him next. He worked the high-risk jobs to try to strike it big enough to buy a ship so Hans and Cora and I could be with him as a family again.\nBut there was a message waiting in my queue that night when I got the worst of the grime showered off me. The time stamp on the message itself was from my work shift, but internal to the message there was a different date, four years ago. “Dear Monkey,” it started out, “If you’re reading this, I’ve failed.”\nIt took me another half hour to stop crying enough to read the rest of the message. No one had called me Monkey in four years. Not since the collapse. But I had to see what else he had to say, whether he was coming for me, and whether it might mean I could be with the rest of my family again. Even though he said he’d failed—there are different kinds of failure. There’s the kind that’s frustrating and you try again, and there’s the kind that leaves your family scattered on two or three different planets and who knew where in the outer system habitats.\nI was just getting myself braced to read it when Tessa came in. “My God, what happened to you?”\n“My uncle—” I managed.\n“Oh, honey, I’m so sorry!” Tessa sat down next to me on my bed and hugged me fiercely.\n“He’s not dead,” I managed around the hard press of her bony shoulder. “At least I don’t think. I couldn’t—I haven’t—”\nShe held me out at arm’s length, gripping my shoulders, and waited.\n“I haven’t heard from him for years, really years. This isn’t the one I—the one I talk to. I kept not hearing. I’ve asked on every Oort board there is, and nobody can find him.”\nTessa turned me to Uncle Will’s letter and waited while I read it, then read it again. I think she knew that I would go back and reread it over and over if left to my own devices. She softly touched my shoulder to get my attention back, murmuring, “And?”\n“He was trying—” I took a shuddering, jagged breath. “He was trying to get to a place where he could have me and my brother and sister again. He was trying to get court decisions reversed on our old property so that we could have our actual home back. He spent every dime he earned on court costs, and he lost. And he doesn’t have a way to get back the guardianship of the little ones now that he’s lost.”\nTessa glanced at the picture I keep of them. The cube could easily be programmed to show video loops or a series of still pictures, and I have them stored on there. But I just leave it on one picture, me and Hans and Cora and our cousin Xiang-Ming before she died. We all look really happy. When I can make it to Mars, I’ll get another one with just me and Hans and Cora. The picture was six years ago, and Cora has grown so much. Hans too, but—Cora was just tiny then.\nWe change so fast.\n“I’m sorry your uncle doesn’t have a way to get them back,” said Tessa gently. She’s a very gentle person. “I know that’s important to you. Do you think your uncle hopes to help with your education debts, or—?”\n“He can’t do it,” I said. “He feels terrible, he’s blaming himself, but—he can’t. And honestly I don’t know that he understands how in-system education and indenture work.”\n“Couldn’t he and your other uncle figure it out together?” said Tessa.\n“I don’t know. After the collapse, they—they didn’t agree on what to do next, and there was a big fight, and—I don’t know what will happen. Whether they’re even speaking to each other. Of course if one got a ship, the other would be welcome, but . . . that’s all on Uncle Wys now.”\n“Ah,” said Tess, who very clearly had no experience with uncles gallivanting about the outer reaches of the solar system. I’m not even sure she would know her uncles on the street. She never talked about family beyond parents and siblings. Earthers are weird, they’re all little islands with no connections to speak of. That’s how they ended up with all this mess of debt and indenture, because nobody knows who anybody’s cousin is.\nOut in the Oort Cloud, we don’t have indentured servants. Didn’t. We didn’t have indentured servants, before the Chornohora Disaster and everything that followed. I don’t know what the corporations have exported out there now. But in-system, perhaps a third of the people are indentured servants at one point in their lives, mostly due to debts. There’s personal debt and educational debt and family debt and—these people could not have made such a mess of my home if they didn’t think about debt all the damn time.\nBut I didn’t really have any choice—I got thrust into the middle of their system as a barely-emancipated minor. They let me go to university. That’s what they know how to do with the young in-system: educate them, let them rack up debt. I knew that Uncle Wys would send for me as soon as he had the place for us, so I made sure that when I went to that university on Callisto, it was in deep-field astrophysics, something that could be useful to the family ship when we had a family ship again.\nSomething an Oort girl could properly do.\nBut Callisto, while it wasn’t anywhere near as in-system crazy as Earth, worked on the same plan: if you didn’t have a family to pay for you, you racked up the debt, and then you worked an indenture in one of the undesirable jobs to pay it off. If I’d taken a degree in something they wanted, something they thought was useful in-system, I could have wiped my indenture clean in a year. Climatologists did that, and research mycologists. Now that I was on Earth, I could see why they wanted so many mycologists. But if I’d chosen either of those fields, I’d be stuck in-system for good when my family needed me. Better to work the Pavelkas’ farm and wait for Uncle Wys.\nIt made the in-system dramas make a lot more sense, because not only do they have people avoiding indentured servitude at the very last minute, but almost every story has indentured servants in it. Or they’ll have people meeting at the indentured service assignment office and trying to arrange indentures together if it’s a happy story, being haunted by the lost connection if it’s a melancholy one.\nWhen I was little and we were watching one as a family, I asked my mother what that place was, and she said it was like the equivalent of the pilot licensing bureau for in-system people. She was dead wrong and didn’t even know it. She just had no idea how much debt is on these people’s minds, like a malfunctioning beacon every moment: “debt debt debt debt d’debt debt . . . .” They’re not like us, they never say, “It wouldn’t be any use to the family,” when they’ve decided not to do something. They say, “I can’t afford it.”\nI’d been spending the last five years living like one of them, hardly ever saying anything about my family out loud. Now there was this message from Uncle Will. And what it was saying was no. No, we can’t be together. No, I’ve failed. No, you have to keep on spraying for rusts and fungus without any idea when you’ll see Hans and Cora again. No.\nI didn’t know what to say. I didn’t even know what to think. Except that, oh, I was so glad he was alive. I checked to see if there was any way to track a return message. There wasn’t. I could send one, of course—just replying to the sender—but I wouldn’t know if he saw it that day or the next or never. And I wouldn’t know where he was.\nThat was nothing new.\nBut the return message could wait, since I couldn’t find him with it and he wasn’t coming for me any time soon. It could wait, and supper couldn’t. I threw a warm flannel shirt on over my clean trousers and undershirt and tried a smile out on Tess.\n“That’s pathetic,” she said. “No one would believe that was a happy face. But you’re in luck: the news feed was all bad, so they won’t notice you’re upset. They’ll be too busy with their own problems.”\n“Oh,” I said. “Good?”\n“Yeah, it’s fabulous. We’ll be out in the suits all week. It’ll be a miracle if the wheat grows at all, with the cocktails of antifungals they’ll have us put on it. Who knows if any of them will work.”\nI winced. Hard to tell whether it would be a hard week or a hard year, if the reports were that bad. I propped up my fake smile.\n“Better,” said Tessa.\nThe Pavelkas around the supper table that night reminded me of my family when the mining was poor: tight-lipped, ready for the children to talk about anything that would distract them. Tess and I, since we weren’t family, were the “children,” but we didn’t have that much to talk about since we’d spent the day in the fields with them and I was dodging bringing up my uncle.\nCatie tried all the same. “What do you hear from your brother and sister, Holly?”\n“They seem to have picked up hockey,” I said, smiling ruefully at the way their faces lit up. For me, all Earthers are more or less the same, their little differences over language and religion and politics amounting to family squabbles. They can’t keep our clans straight either. But to them, it matters, and one of the things that makes Canadians happy is hockey. They have a special bond with Martians that way.\n“Oh, great!” said Anna-Reese. “They can send you feeds of their games—not in real time with the lag, obviously, and the cost would be too much anyway, but the delayed feed will be almost as satisfying.”\nI had not even thought of watching entire games of my little siblings darting about Martian ice with little Martians, chasing awkwardly after a puck, but I could see from the way Anna-Reese said it that it was what I had to do. I could see that Hans and Cora would be expecting it. I might have to ask the Pavelkas what to say to them so that it sounded like I was paying attention. I would pay attention, but I wouldn’t have the faintest idea what to say. You looked very fast. How well you almost hit the net with the tiny object. Well done, crashing into the other child at the correct time.\nAsking the Pavelkas seemed a much better idea than trying to make a go of that sort of conversation myself.\nWe made short work of the dishes, but the whole time I was thinking of what to write back to my uncle. I thought I knew what I would say to him if I could see him again—I had thought of it hundreds, thousands of times over the last six years—but this was . . . not quite that. For one thing, if I saw him again, I’d know where he was. It turned out that made quite a difference.\n“Never mind success or failure,” I wrote, pausing to put “Dear Uncle Will” at the top like a civilized person. “Where are you?” There was no way the messaging software would let me emphasize it enough, but I didn’t want to pay for voice transmission when I didn’t even know the message wouldn’t just drop into the void forever. I could save that credit for Hans and Cora, who would appreciate it.\n“Where are you where are you where are you?” I wrote. I sounded more like the girl he’d left than the woman I’d become, but that was all right. It was what I actually wanted to say.\nThen I couldn’t think what else. I sat and stared at the message.\n“I am well,” I finally wrote, sounding like an etiquette manual, but there was at least room to go on from there. “My indenture here on Earth is on a farm. You wouldn’t believe the weather, far more than just solar storms. And trees! I thought I understood trees, but the little fruit things we have are nothing compared to the trees here.”\nI realized that I had no idea whether Uncle Will had been to Earth. Maybe he knew about storms and trees and Earth things. Maybe he’d toured the Earth monuments. Maybe he was on Earth at that very moment, if not as close as Edmonton, somewhere else just like it, with rain and pollen and history. Without knowing, I didn’t know how to tell him the stories of my indenture, what it had been like to begin with, how Tessa had taught me a lot, how I’d adjusted and how I hadn’t.\nI had never lived anywhere with trees before. You’d think it would be the same as having high walls or hills or a dome—it’s a high-up thing that’s mostly in your peripheral vision, but it’s really not. The fact that they’re alive turns out to matter a lot. The branches move around, and you can really tell they’re alive. It’s more like living with a herd of giant elephants or something than a dome.\nEarth people do not think of it this way. But they should, because that’s what it’s like.\nWhen I first got here, I was wary of the trees. I knew—I’m not stupid—that they didn’t pick up and wander around. I knew that Macbeth was being metaphorical, or mystical, or something. But they were still such large, moving, living things, all right there. I wasn’t used to it. I gave them wide berth when I walked out to do my chores.\nFinally Tessa grabbed me by the wrist as we were coming in from our chores. “But look,” she said, dragging me into the back garden. “Here’s you!”\nHer people were from New Orleans when there was one, and they kept moving up the mouth of the Mississippi, so now they live in Greater Memphis State. So her accent confused me. Anna-Reese said, “No, the yews are over there.”\nTess giggled and said, “No, it’s holly. Holly.” She put my hand on one of the smooth spiky leaves. I flinched back and then reached out again, more slowly, of my own accord.\n“I forgot Dad had this back here,” said Anna-Reese. “Holly tree. You’re right, that’s you, Holly.”\n“Hello, me-tree,” I said softly. The glossy dark leaf felt right, it felt just how it looked. We had no excuse to grow holly trees in our ships. Apple trees, pear trees, they earned their keep. Holly trees, no. I had never felt a leaf quite like that, thick and firm and unyielding.\nAnd yet that was not the tree I bonded with. My tree was a little sturdy bigtoothed maple, its leaves thin and jagged and yielding, utterly unlike the holly in every way. You could lean on a maple. You could tell a maple your troubles, but I didn’t. I just leaned and breathed.\nThinking about those early days while trying to write to my Uncle Will, I realized how much distance had formed between us. He hadn’t heard from me when I was in college on Callisto, so writing, “I have a serious relationship with a maple tree,” would probably make no sense. I wrote it down anyway and then added, “but I will be okay leaving it when we get our ship figured out. My friend Tessa who teaches me about Earth and trees will be harder to leave. Maybe she will visit. Have you written to Uncle Wys? He’s going crazy missing you. We all miss you. Don’t wait so long to write again, even if you aren’t writing to say we have our ship back yet. It’s okay. We can work together on it. Love, Holly.”\nThen I went to sleep. I’m not usually a great sleeper, but that night I slept fine. I dreamed I was back out in our ship in the void. Waking to the smell of Tessa’s cheap rose shampoo should have been jarring, but instead it was familiar now, homelike in a way I didn’t expect when I first came to Earth.\nThere was soya bean rust in the next riding to add to the anxiety of the previous day’s announcement, so we spent the day out in the back fields spraying with fungicide and then carefully washing down so we didn’t bring either rust or fungicide into the house. One of Wendell’s friends, a big hearty man from over by Swan Hills, got burns on his hands and almost up to his elbows from where he didn’t get the fungicide washed off. It wasn’t the same kind. Still, it’s a reminder to be careful every time we see him, the long reddish patches that stay on the skin like birthmarks.\nThe next day was more of the same before we could get back to the usual farm chores. The day after, we were out in the fields as usual, doing the work we knew. I never asked Anna-Reese and Tess what they thought about in the long hours running the farm machinery, but I think everyone knew I thought about my family, about my ship, the ship Uncle Wys would get us.\nI heard the ramping up of noise that started the sirens, and I had that tractor backed around and headed for the barn before their wail was full. I fumbled my mask on while I went, in case it was a spore wind, but with the sky the color it was, I was pretty sure it was precipitation instead. Inclement weather. Rain. Rain. Weird, weird stuff, rain. Tessa had managed to convince me to go out in it, and it was nice when it was warm, like a water park or a shower.\nBut you couldn’t trust it. You could bet that the water park management wasn’t suddenly going to turn the heat all the way down so that you got ice pellets in your face. You could feel sure that your shower wasn’t going to pick you up and dash you against the wall. Rain is not so reliable.\nI was always, always the first one into the shelter when the sirens blared. Did not matter how far away I was or whether the others were right there next to it. They took their time. They ambled. They stopped to peer at the sky and speculate, and if there were two of them, they would stand there and talk to each other about it, like they were the audience in the intermission of a concert, wondering what the musician would play in the second set.\nEarthers are so weird.\nSo I got myself settled in the shelter. Eventually the others came in, Tessa and Anna-Reese together, then Wendell, and finally Catie, still wiping her hands on her shirt. She’d been making supper and smelled of fresh basil. I hoped the tornado wouldn’t take the herb patch. I hoped the tornado wouldn’t take any of it, but at the time all I could think of was the herb patch.\nI couldn’t do anything during a storm. They all knew it and didn’t bother me, because it wouldn’t do any good. I paced. The rest of them settled right down and played a round of Sheephead, Catie’s favorite, and then a round of 500, Tess’ choice, and then the radio sounded the all-clear.\nThe tornado was a good eighty kilometers away. Which in space terms is next door, but it’s far enough not to destroy your herb patch. If you had an asteroid pass that close to your hab, you would say how close it was. Everyone would rush to the view windows to gape at it and say how close it was. But on Earth, eighty kilometers means your farm is fine and the neighbors’ farm is not, there, done.\nIt’s hard to even explain the kind of people you get when they live like this. They watch local news like they were going to have a cousin on it any day, but “local news” usually includes millions of people, none of whom they have any relation to or business deals with.\nIt’s also hard to get a sense of what to expect from the natural world. Farmers like the Pavelkas don’t routinely keep the gene sequence of their crops on hand. They just don’t. They figure they can get stuff sequenced if they need to. The seed companies try to tell them what’s resistant to different diseases, but the seed companies have lied about that so many times that no one on Earth believes them. Despite that the farmers still don’t keep their own gene database.\nI had started to have the feeling that there were more rusts, more blights—generally just more fungus—than would be natural. I was starting to feel like someone was doing this to us—to them, really, but to me, too, as long as I was there. But was that true? Was that a reasonable feeling to have? Or was it just the result of an Oort girl living on an unsequenced planet?\nI knew that Anna-Reese and Tess had not sequenced the people they were dating, so I could not fathom how they had any idea what possibilities the future might hold for them. How do you find out what a reasonable number of fungi would look like, from people who behave like that? Even if they’re your friends?\nThe next day I was walking down the main road, out to the back fields, when I saw an outcropping of mushrooms on the trees. Each one was bigger than my hand, broad and flat with a dappled brown pattern on the top. I took out my handheld and took a snapshot of them, then broke off a sample piece for good measure. Mycology is hard, even the rough-and-ready farm kind. Probably this was an ordinary fungus, but if I didn’t check and it turned out to be virulent, I would regret it bitterly.\nI hoped it wasn’t. The bit I took had a smooth, spongy texture. It felt nice. Not like the holly leaf, not like the maple bark, its own thing. I hoped it fit. I was so tired of fighting off the things that didn’t fit.\nMy handheld said it was probably dryad’s saddle, perfectly fine for a maple tree, quite normal for the region. Quite normal for all of Earth, it looked like. I went on to my normal work, feeling a little foolish but keeping the sample for sequencing, just in case, just in case it wasn’t dryad’s saddle, just in case it had mutated into some new killer dryad’s saddle.\nIt’s hard to understand dryads when you live in a habitat. How could people make up tree spirits? When your only trees are little heavy-bearing fruit trees, it makes no sense; they’re just about the least spirited thing on a habitat. But then you meet trees, and you think, well, killer dryads, all right, sure, on a dark night without the scientific method, why not.\nI spent the morning thinking so much about dryads that I didn’t contemplate my future ship at all. In the afternoon I moved on to trying to figure out how much of our lichen cultivation could coexist with mycoculture or whether that would just bring the problems of Earth out to the Oort. If Wendell and Catie had a bad blight year, they might lose a lot of money—enough of them, and they might lose the farm—but a bad blight year on a habitat doing a far-swing could kill off the crew. I spent long enough pondering the pros and cons that I was late coming in from the field, and quiet, and thoughtful. I put the fungus sample in the barn and then went in for my shower. Catie was sitting in the living room, her hair in a strange updo with tendrils, her pantsuit unusually shiny.\nShe glanced at me, then put down her handheld. “Lordy, child, if you don’t hurry, you’re not going to be ready nearly in time.”\n“Ready?” I said stupidly.\n“Don’t tell me you don’t want to go to my nephew’s wedding dance,” she said.\nI did not tell her that. But honestly, I hadn’t bothered to remember when it was. I didn’t expect that Tessa and I would be invited. In the Oort, if you marry into a family, of course that family comes, and their friends, but there isn’t such a thing as a neighborhood to invite, much less servants.\nWe don’t really have the concept of servants at all, now that I think about it. I mean, there are people who do that kind of work in the larger families, but you can’t treat them differently or they’ll go join another family and then there’s you, changing your own fancy-pants bedding because you were too stupid to treat the person who did it for you as an equal. And I had been pretty clear that as an indentured servant, I had not been invited to join the Pavelka family, and that they’d be pretty offended if I assumed I had.\nTessa, though, had apparently assumed that we were invited. Maybe it’s an Earth thing? Tess wouldn’t have been mean enough to keep it from me if it was something she thought people had to be told. Anyway, she was in her underwear, wrapping a fancy sparkly band around her twists of hair when I got to our room.\n“We’re going to the wedding dance, apparently,” I said.\nShe laughed. “What, did you think we were Cinderella? Come on, hurry up. You’ve only got one decent dress, so that’s what you’ll have to wear. Good thing you’ve got short hair, you wouldn’t have time to do it anyway.”\n“You have a sister, don’t you, Tessie?” I said, digging into my drawer for stockings so that I didn’t have to look at her. When I turned back, she was standing hipshot, looking at me curiously. Her underwear was so green it almost glowed against her dark skin. Like she was a tree off the far slopes.\n“You have a sister too,” she said.\n“Cora was four when the catastrophe hit. I never had a chance to get ready for parties together. And—she might have chosen to move on, if it didn’t suit her to stay with us. Might have married into another family.”\n“Oh, so family isn’t everything out in the Oort after all?” I must have looked angrier than intended, because Tessa said, “I’m sorry, Holly, I was just teasing. The way you talk it sounds like families always stay together forever. It’s nice to hear yours is . . . human like mine.”\nShe never talked about her family. “What do you mean, like yours?”\n“My mom needs me,” she said. “My dad was killed in an accident at work, but he didn’t go quick. And Mom’s health has never been good. That’s what I’m doing this indenture for. My brother takes care of her, and I take care of the money. At least I do the best I can.”\n“I didn’t know that,” I said softly. “Sorry to make the scary face.”\n“Probably I’m just seeing the scary face around every corner,” she said. “I’m going to see Denis tonight, and I’m very nervous.”\nDenis was an indentured hand on one of the neighboring farms, and I had sat through his corny jokes and bad dancing at more nights out than I could count. But he made Tessa smile. “I know he likes you,” I said around the smooth blue modal of my dress going over my head.\n“That’s just it: I like him a lot. Like, really a lot. Holly, I think I want to ask him to marry me.”\nI plopped down on her bed. “Wow. Oh, Tessie, oh, wow.”\n“If you don’t do your makeup, you won’t be ready in time.”\n“You know it takes me five seconds to do. Come on. Here, I’ll do it now if you’ll tell me more.”\n“Zip me.” She turned around, so I obligingly pulled the long gray zipper up the back of her shining silver dress. “I’ve been thinking about it and thinking about it, and . . . I think he’s the one. Or at least a one.”\n“Do you want me to see if his family’s in the Space Chicken Database?”\nI waited for her to stop laughing. For some reason, Earthers—actually all in-system people—find the Space Chicken Database hilarious. She said what they always say—“Spaaaaace chicken! Ahahaha that’s awesome!”—and I waited some more. I’m so glad I’m not living on this planet permanently, because Earth people have a weird sense of humor.\nFinally Tess got herself together and said, “Thank you, Holly, but we don’t sequence our partners behind their back. It’s not considered polite. There’s . . . a bad history there, for people like me.”\nThat didn’t make much sense to me—what was behind his back about it? Everyone in the outer system is in the SCD. It only started for breeding chickens ship to ship. Now it’s all life-forms. I knew it wasn’t expected on Earth, but I couldn’t see why not. They would have to do far too many scans to do in utero treatments for problems if they didn’t know what was in their genes already. I quickly brushed powder onto my cheeks, looking in the mirror so I didn’t have to cover my confusion for Tess.\n“Well, he’d be a fool not to say yes,” I said when I had managed lipstick. “If not the database, let me know what friends are supposed to do here, and I’ll do it.”\nShe leaned down and hugged me around the shoulders from behind. “You’re sweet, Holly. Thank you.”\nThey told me that a lot. I had begun to take it to mean that they didn’t understand me but were sure of my goodwill. I resolved to start using it that way myself, since I felt that way about them all the time.\nThe wedding was short and the reception crowded. I had seen many of the guests in town, at the library or the movies or in the shops, walking along the streets. Some of them had come over to spend an evening with Anna-Reese, or with Catie and Wendell. But I always took half a second too long to recognize them in their celebratory finery, so almost all of them thought I didn’t remember them and introduced themselves to me again, with a faint air of offense.\nI would have been most comfortable talking to Tess and Denis, but they were at a table in a corner with their heads together, and I knew I needed to give them space for their happy moment. The problem was, neither of them looked happy. I tried not to watch, but it was like a docking accident. Nothing was going where it should, it was impossible to look away, and the odds that something was about to be bent and damaged seemed to go up by the moment.\nAnd in fact it was. Tess tossed her head and pushed her chair away from the table. Denis stood up half a moment after her, but I didn’t need to overhear them to know what had happened: that would be a no.\nHe was a fool after all, then.\nI watched Tess all the way to the door. I doubted she was leaving—no way home without the rest of us, and it would be a long walk—and after a moment I decided to follow her out there. She was standing in the cooling evening, clutching her arms where her silvery dress left them bare.\n“You okay?” I asked.\n“Sure, yes, of course.” Her laugh was brittle. “I misread the situation. He said it was just an indenture fling. Lots of people have them, but you can’t mistake them for something they’re not.”\nThat last sentence had the sound of a quote. “He was boring anyway,” I said. “And he couldn’t dance, and he smelled like beans.”\nShe laughed again, and it had not gotten more genuine. I had no practice at this. It was not a thing anyone had ever asked of me at home, or in the Jovian system either. “What do you do about breakups in the Oort Cloud?” she asked.\n“It depends,” I said. The trees near the hall were making loud tree noises, much louder than usual. I tried to ignore it, since Tessa was. “Ice cream, loud music, alcohol, making your cousins handle all trades with the other person’s ship. Unless your cousins are madder at them than you are.”\n“The first three are traditional on Earth as well,” she said in a hollow, distant voice.\nI felt the first few drops of water on my head and still, still, had the reaction that the plumbing must have sprung a leak. No. Rain. “Maybe they’ll have ice cream inside?” I said hopefully.\nTessa laughed. “I know they’ll have loud music and alcohol. But I’ll try to be moderate enough that you don’t have to handle trades for me. You’re right, we’d better go in.”\nShe had implied I was her cousin. I tried not to put any weight on that, but my feelings were completely treacherous. I flung my arm around her as we went into the hall, and she leaned in a moment, sighing. I had not had a cousin for so long.\n“Come on, if we dance we don’t have to talk to people!” Tessa shouted over the music that was just starting. I tried that, but Tessa wanted to dance with everyone, all at once or trading off quickly, and I didn’t know how to make that work. I retreated to the wall and waited for the fun to end.\nPeople who were not the hosts kept checking to see that I had a glass of champagne, which I did, very obviously held in front of me like a shield. Outsider: yes, and thanks for noticing.\nOne city auntie of the bride felt that it was her job to cordially engage the young people in conversation. I quickly discovered that this meant lecturing me about how badly her other niece was running her farm. Auntie had never farmed herself, of course, but if she did, she was sure that she would just douse the whole thing with every fungicide there was and be set for the season. “These young people, trying to cut costs,” she clucked.\n“That’s not how it works,” I said aloud. The minute it was past my lips I wanted to take it back, but there it was, I might as well go with it.\n“Excuse me?”\n“The antifungals, they don’t work like that. There’s a cost to them.”\n“Well, I’m sure I don’t know what they charge, but my niece—”\n“Not what they charge,” I said. “What they cost. What they do to the crops, what they do to the rest of the plants in the area. Less crop yield, more dead plants.”\nShe looked at me over suddenly narrowed nostrils. “How pleasantly educational,” she said, and I flinched. I had no idea how to answer that, and her mouth was open to follow it with something probably equally scornful, when I was saved.\nOr something.\nI did not feel saved.\nThe blare of the sirens felt like it should have become familiar, but it hadn’t. It scared me every time. It was worse at the wedding, with the flashing lights of the wedding dance on the guests’ sparkling finery. The person I had been arguing with, the friend of the bride’s who had drunk too much and was talking too loudly, the ass who had just left my friend—they were all suddenly fellow human beings in peril, just when we should have been celebrating. Even though it wasn’t my celebration, even I could feel that.\nThe bride’s drunk friend tried to start the dancing again in the tornado shelter, but no one’s heart was in it. Instead we talked quietly, or huddled in silence, while people checked their handhelds: whose farm would it be, who was bearing the brunt of it now.\nThe tornadoes stayed high in the atmosphere. Atmosphere is one of the least confusing things about living on a planet, as long as you don’t start thinking like a planet-dweller. Things are three-dimensional in atmosphere. Gravity is enough to pull some of them down and others not. This is just like on a ship. It is safe and makes sense. Well. It makes sense, anyway.\nWe all filed out together to go back to our farms, damp and subdued. Tessa did not want to talk on the way home, nor when we got there. I was taking out my earrings and washing off the remains of my makeup when I saw that the message light was flashing again. It wasn’t quite Sunday yet, so I didn’t expect to hear from Hans and Cora. Unless there was something wrong. Something wrong was always a possibility. There had been that message from Uncle Will, and—it was a preset message, and maybe he’d been found dead. Or maybe something had happened to Uncle Wys, or—\nI opened the message. It was type only, Uncle Wys on the identifier. “Kiddo, I am so sorry,” it began. “Truly I am. I have been saving and saving, and you said that Hans and Cora seemed okay, you said that their foster parents were not like you read about in old stories, so I thought I would get you home first and then see about them.\n“But there was an accident. I don’t want you to worry. They were able to deal with it. I was just evaing—” The program had corrected when he was trying to say EVAing. It didn’t know any better. Probably written on one of the Jovian moons, where they try to go extravehicular as little as possible. Stupid Jovian programs.\nI realized that I was trying not to read what he had written. I steeled myself to go on.\n“—and my teammate slipped up, so all my money has gone to my medical bills. I’m fine, don’t worry! It’s just . . . I had saved, and it’s all gone now.”\nI swayed. He was going to be okay. But the ship I had been counting on, my uncle’s ship, my family’s ship, had just evaporated. I would finish my indenture with nothing and nowhere, instead of a family, to go home to.\nNo one had broken up with me, not ever, but I glanced over at Tessa. “Ice cream?” I managed. She nodded. We went down and raided the Pavelkas’ kitchen in silence. I curled up around my handheld in bed after, reading, rereading. Tess put her pillow over her head and went to sleep.\nIt was hard to know what to do with a Sunday off after that. Often Tess would want to go into town together, but in the wake of Denis’ departure she had no interest in it, and I preferred the time to myself after the crowds of the wedding reception and the storm shelter. The trees were quieter than the night before, more subdued, safer. Tamer.\nWhen I checked after my walk, my account had my Sunday letters. “Dear Holly,” Hans began. “Cora will probably tell you that she came to my hockey match and that we beat the Robinson Dome Bears 4-2. What she will not say is that Marti told her she didn’t have to come, she could stay home and work on her genetics project if she wanted, and Cora just looked at her and said, ‘He has a family. People should know he has a family. He should know.’ And she came and I got a goal and an assist.”\nI squinched my eyes together so Tessie wouldn’t find me crying over another family letter. Explaining seemed like too much.\nHans would have known he had a family. Hans was old enough to know. But he was letting me know that Cora was old enough too. That he was doing what he could for our sister, to raise her an Oorter even outside the Oort. I wondered if they ever met up with any other refugee kids there on Mars, so I actually went ahead and asked.\nI also asked him if Uncle Will had written to him. I hoped he had. I told him a little about the soya rust and the storm near us, but I kept it simple. He’d never lived in thick atmosphere like this, so he wouldn’t be able to relate. Mars storms were sparser, dustier. I thought about bringing them down sometime, but I knew I wouldn’t do it. The experience would be fascinating for them, but it wasn’t worth postponing paying off my indentures just so that they could meet trees. Almost worth it. But not quite.\nI went to help Tess get ready for supper. She was humming and draining the beans she had steamed, getting ready to combine everything. They often asked Tess to cook. Me almost never. When I first got there, they asked if I cooked, and I said yes, so Catie asked me to cook a real Oort Cloud meal one night to be nice.\nIt turns out that they don’t eat a lot of lichen on Earth. They made very polite faces. But where Tess is from, down at the mouth of the Mississippi, they are famous for their cooking. Everyone on Earth, nearly, thinks it’s a treat to get their cooking. They just keep edging up the continent as the Mississippi eats it, cooking whatever’s left and humming as they do it, or so I hear. They tell me that’s not just Tess, the cooking and humming.\n“You ever think of becoming a chef, Tessie?” I said.\nShe smiled. “Oh no, hon. This way I cook what I want for people I love, not the same thing over and over again for strangers.”\nAgain the sweetness: she had not used the word cousin this time, but love was close enough. I wondered if her mom and brother were making the same beans or if they were missing Tessa’s.\nThe sequencing came back on the dryad’s saddle I’d sampled. It was regular dryad’s saddle, not any danger to the farm or the trees or me. But it had another fungi growing on it, a new one the sequencer in Edmonton didn’t recognize. They thanked me for sending it in, for being careful.\nI didn’t feel careful. I just felt foolish. I tried to imagine staying on Earth long enough to know which fungus were okay, which were dangerous, and I couldn’t imagine any of it. I could imagine eating ice cream with Tessa late at night, but my imagination shifted that to a hab or a ship.\nI sleepwalked through my week and nearly spilled some of the latest antifungal on my feet before I had my protective gear on. Nobody yelled at me, they just gave me space to breathe.\nThe trees and I needed a lot of space to breathe.\nI discovered I was less numb than I thought when the sirens sounded again, jolting me into noticing the sickly green of the sky. My stomach still lurched. I still hurried for the shelter.\nStrangely, Tessa was there before me.\nWhen Anna-Reese and Wendell finally came in, they were soaked and gray-faced. They locked the shelter door above them. Wendell didn’t say a word, and Anna-Reese just shook her head at her mother. Catie stuffed her fist in her mouth and let out a jagged whimper.\nNo one played cards. Soon the noise was too deafening above us. I wanted to pace as usual, but Tess was sitting in the corner, huddled up into a ball. I went and sat next to her, and then the Pavelkas, all in the corner, even though I knew they trusted the shelter more than I did.\nThe noise was like standing behind FTL ship engines, like the mother of all docking accidents. For all that the previous storms had scared me, the difference was so clear. I had a fleeting flash of relief: I had nearly nothing to my name, so there was nothing I could lose in the tornado. I had already lost what was mine to lose. There was nothing worse it could do to me.\nThen, of course, it all came in on me, like a giant weight on my head: I had lived with the Pavelkas long enough to feel at home in my little room with Tessa, long enough that it was wrenching to imagine the windows smashed or the ceiling fallen in. And even though the Pavelkas were Earthers, they weren’t corporate, not like the people who had taken my home. No one else should have to live through what we had—but it was harder, somehow, knowing their names and faces.\nThe storm continued to howl outside the storm cellar. Instinctively I crouched down even further, although of course there was no need. I had to flinch from the noise, though; it was unimaginably loud. The howling and wailing of the storm was impossible to keep at a distance. My conscious mind could totally understand that the storm was not in the shelter with me, but my bones felt only that it was loud and scary and had to be right there.\nI couldn’t hear Tessa whimpering next to me, but I could feel it through bone conduction. I put my arms around her like she was my little sister, like she was Cora’s age and needed comforting. Her shoulders were round and solid, shaking and shaking. I looked around, feeling the noise like it ought to be something visible. Anna-Reese saw me looking for help and scooted around. She came over and put her arms around Tessa from the other side. We held her like that until the worst of the shrieking had passed outside and we could hear her say, “I’m all right. I’m all right.”\nAnna-Reese said briskly, “Of course you are. We’re all safe down here. It’ll be all right.”\n“There’s often an eye in the middle of the storm,” said her mother from her place huddled on the floor by the wall. “You’re all staying down here until we get an all-clear from the weather service.”\n“No one’s going anywhere,” said Anna-Reese in her best calm voice. It must have cost her more energy than I had at the time to maintain that calm. Tessa whimpered again, and this time we could all hear her.\n“Tessie, are you . . . ?” asked Catie.\n“I’m just overwhelmed,” Tessa managed. “I mean—I’m scared, not hurt.” And then, so quietly only I could hear her, “They need me.”\n“I know,” I whispered back, even more quietly. But I couldn’t do anything for Tessa’s mom and brother, any more than I could for my own family. I could only do something for Tessa. I rummaged through the supplies. “There’s a thermos of something hot. No time like the present.”\n“It’s soup,” said Catie. “I heated some chicken soup from the freezer to put in there, when I heard the storm was coming.” It had lemons and garlic and slightly too much salt in it. But it was still warm, and we needed something warm, something shared. We needed something to do other than worrying.\nWe all drank from the same little thermos cup, and waited.\nThe second wave of the storm was at least as bad as the first. But we were braced for it, we held each other, we waited, and the second silence was more sure, more lasting.\nThe all-clear was far less comfort than it should have been. Catie hustled us into the car, not looking at the wreck that had been her house. I thought we would stay with one of their friends or relations for the night—perhaps in the beds vacated by the honeymooning couple—but the storm was bigger than that. “F5,” said Wendell glumly. “Maybe 6 or 7.” So we tripped and slogged our way through the green, wet-smelling night into the school gym. Tess fell asleep on my shoulder before they could get cots. I was sure I wouldn’t be able to sleep like that. I was wrong.\nI woke up in the middle of the night with Tess gone and an ache in my back. I made my way to one of the cots and dove into more sleep. I dreamed of my uncles being pulled away from me, out into the storm.\nThe morning was incongruously bright, full of volunteers and cheap flapjacks. My work clothes felt gritty from storm and sleep, but I needed to see the farm before I did anything else. Not the town or random locals, but the farm where I had lived. I hitched a ride out there with others who were itchy to help.\nI knew, without saying, that the Pavelkas would desperately need our labor, but they wouldn’t be able to keep paying for it with this much damage. No one had to tell me I would have to find a new indenture. It was finally, at last, something that I knew without having to be told.\nThe lane was strewn with corpses. The tornado had left almost nothing of the groves of trees that lined the lane, nothing of the windbreak—the wind had broken them instead, I kept thinking, but I couldn’t speak it aloud in case someone thought I meant to be clever and laughed. They were splintered open, the bark peeled back and their insides fractured into hundreds of sharp fragments, branches cracked and tangled with each other. Trees from one grove had been flung into another, into the remnants of the barn, driven into the ground by their branches.\nThe Earthers were not treating them like corpses. The Earthers were treating them like furniture. The smell of their sap and leaves, their life spilling out, was in everything, and the Earthers were treating it just the same as the spilled trash bag from the bins, another thing to pick up.\nAnd they took my brother and sister to grow up on a planet like this, where they would try to teach them to treat living things like this, worse than we treated outgrown clothes on my ship, worse than a bad prize at the county fair on Chornohora Station before Chornohora Station became a synonym for death.\nI could not let Hans and Cora grow up planet people, I could not, I could not.\nI turned and saw that Catie was there, weeping for her trees. It broke in me then. I almost reached for her, but she was not my auntie. So we stood crying separately, among the bodies of those trees, not making sounds.\n“You’ll replant,” I said.\n“Oh yes.”\n“From seeds?”\n“From seeds in most places,” she agreed. “The provincial government funds some saplings, a few larger trees for windbreak.” She saw that I didn’t know why they would pay for it. “To keep the soil anchored, to keep the winds from going on unimpeded and just getting worse as they go . . . you’ve never been on a prairie without lots of windbreaks, child. Believe me, you don’t want to.”\n“Like Titan,” I said. And then I saw that the dunes of Titan meant nothing to her, and I didn’t want to take up her time with explaining. Instead I said, “You’ll get there. It’ll be how it’s supposed to be again.”\n“I hope so. Someday. For Anna-Reese, maybe.”\n“When Kevin gets home,” I said, and Catie frowned.\n“Who said Kevin was coming home?”\nI floundered. “I mean, with the farm—”\n“He’ll be home for Christmas, like always.”\n“But—if Tessie and I have to—”\n“We’ll get by, don’t you worry,” said Catie, but her mouth was tight, and her tone was flat. Kevin was not coming home. Kevin, the golden boy, the pride of the family, would not come home when his family farm was devastated by a tornado.\nI will never, ever understand Earthers.\nI said a few more words to comfort Catie, or at least they were meant to. I was no more sure than I was with Tess after Denis disappointed her. Then I found my way back to the school shelter, where there was a group of volunteers from the east showing up to help us out in our time of need. I hoped Catie didn’t have to deal with them much unless they had a better idea of what would help her feel better than I did.\nThey gave us each a bag with some things in it: a flannel shirt and some stretchy cotton trousers, several changes of socks and underwear and T-shirts, a printed book apiece. They asked if we had shoes and at least one bra each, because they were short on shoes and bras. My book was The Great Gatsby, and my underwear was that color of beige that they pretend will blend in with a lot of Euro and Asian people’s skin but actually matches nobody’s. It was two shades lighter than mine. It rode up in the back. I don’t understand why Earthers can’t make decent underwear without charging an entire asteroid for it.\nYou absolutely cannot complain about your creeping underpants to people who have just lost their entire livelihood. And yet there they are as you try to wash muck off things and dig them out of the mud and generally clean up the whole place: creep, creep, creep.\nI gave The Great Gatsby to Tessa. I wasn’t going to take it back up into space with me, not with the weight limits, not with perfectly serviceable electronic copies. It was a good gift for a shelter where electricity to charge your devices might go out tonight and not come back until tomorrow or next week, where you might not have planned with backup power like a sensible person, because Earthers think that power is like everything else, infinitely flowing.\nShe looked at it and looked at me. “You’re going back up,” she said.\n“We’ll see what they give me.”\n“But you’re going back up.”\n“I think so. Tess, you are my cousin.”\n“That’s sweet, Holly,” she said, but I could tell it didn’t mean anything to her.\n“No, but—you are. When I have a ship—”\nShe was making a face, pushing it aside. For her it was like saying when I am the Queen of Mars, when I reengineer fungus to be heat-intolerant again. I would have to figure out how to explain it to her. I stood there for a moment, wanting to figure out something, anything, that would make her feel better, but I couldn’t think what that would be, and I had an appointment to make with the indenture coordinators.\nThe indenture office made an effort to be warm and welcoming by Earth standards. The furniture was not bolted down, but other than that it was really trying, with soft blues and greens and flowing hangings, to be relaxing.\nI was not in a frame of mind to be relaxed. But at least I had some clarity.\nThe indenture coordinator was a soft, pleasant-looking woman with very large red earrings and mid-brown skin between Tessa’s and mine in color. She had my file on her device and greeted me cheerfully. “Holly Vermuelen-Wing,” she said. “Do you want to stay with farmwork, Holly? The Pavelkas give you high ratings.”\n“I’d rather go offworld,” I said. “I’m not from here, and—” I stopped. I couldn’t explain to her about the lane full of tree corpses, the way that weather came upon you without warning, the underwear that was even now creeping. Everything that was wrong with Earth was normal to her, her entire life. “I have minor siblings. I’d like to pay off my debt sooner so that I can regain custody.”\nShe frowned. “Most off-Earth jobs don’t pay as well, so you actually would make a faster job of it planetside.”\n“I can mine,” I said.\nThe woman’s frown deepened. “There’s nothing about that in your college transcripts.”\n“Look farther back.”\nShe blinked, and her face softened into pity. I saw that sometimes, from people who actually knew what had happened to families like mine. “Oort background. Well, that does change things. Are you sure you want to mine in the Belt? It’s not like what you’re used to.”\n“Rough company ships, low-status labor,” I said. “I know. But it pays well.”\n“Oh yes. Pays better than anything else people do for their indenture. Any better pay than that and you’re having your indenture bought out right away.”\n“I’ll take it, then.” I didn’t care if Martians looked down on me when I was visiting their towns on leave. The only Martians I really cared about were the ones taking care of Hans and Cora.\nThe important thing was that I needed to get my home back. I needed to make a place where my family could be together again. I had been waiting around for that to happen—for Uncle Wystan to come through, or Uncle Will if he was still alive, or somebody. But a home isn’t the sort of thing you can rely on other people to make for you. Sometimes you get some people who can help. But you have to do it yourself. I had finally learned that.\nThe nice indenture board woman was still looking at me, her broad, soft face still creased into the lines of pity. “Are you sure, honey?” she said. “The tornado was bad, I know, but we’ve gotten pretty good at bouncing back from tornadoes. We can place you with another farm pretty similar to the one you were working on. You can even visit your old host family while they get back on their feet—meet up in Edmonton if you don’t want to spend all the time and credits to come back to the farm. Or if it’s too hard to see it like this.”\nShe understood a lot. There was a lot she didn’t understand, too.\n“I don’t belong on Earth,” I said gently. “You’re right, my host family has been great, and I’m upset by all this. But more than anything, this has taught me that I don’t belong on Earth long-term. I need to get back into space.”\nShe nodded, pressing her lips back in a sympathetic grimace. “I guess I understand. If they tried to stick me up there in one of those tin cans—”\nI winced, but she went on.\n“I bet I’d want to come back down here to Earth as fast as I could, too. You’re sure you don’t want to try to find a safer assignment, though? One of the care facilities on the moon, maybe? You could wheel old people around into the low-grav sections and back. They’d probably like you.”\nI had forgotten that Earthers think the moon is space. I didn’t laugh in her face. “I just want to get my indenture over with. I’ve got experience with mining, and I—” I let my voice crack so that she’d let me get this over with. “I miss my grandparents too much when I’m around old people. They were at Chornohora Station.”\n“I see.” I could tell she still wanted to talk me out of it, but she was pretty much done with objections, given that her job was to sign people up for indentures—and Chornohora was always a conversation stopper. “Well, remember that your specific contract is renewable every six months. If you really hate it, you can always switch back to farmwork after half a year. Or try something else.”\n“I’ll remember,” I said. I signed and thumb-printed and eye-scanned and signed again and all the other things that they make you do to verify that yes, it’s you, and yes, you really want this, no, really, you want this. And it was done. I was heading back to space again the day after tomorrow, a transport up to “the” moon and then out from there.\nI stopped to rest my hand on the corpses of several trees on my way out, picking out a large splinter from the last one with my nails. I wanted to apologize, but they’re trees. Even if you like them, you know they don’t listen to you.\nI waited for Tessa to come back from her own indenture appointment. She didn’t take long. She was hardly picking up her feet, and if I didn’t know her voice well enough to pick it out of background murmur, I wouldn’t have heard her quiet, “Hey, Holly.”\n“Hey. I got my mining reposting.”\n“That’s . . . good, I guess. Sounds awful to me, but . . . I’m glad you got what you wanted.”\nI looked at her defeated shoulders, and I remembered how Anna-Reese and I had held her during the storm. Something changes in you, when you treat a friend like your baby sister. Something changes in the friendship. Tessa was not sensible, not levelheaded, not any of the things I was supposed to value in bringing people into the family. But she had introduced me to trees, and I had been there for the worst week of her life. We were cousins now.\n“What I said earlier—I’ll make a place for you,” I told her. “You and your mom and your brother. You’ll have a place with my family.”\nShe looked up, interested. “What if the rest of your family doesn’t—”\n“That’s not how it works,” I said. “If I say we have a place for you, then we do. I’m the one who’s—” I took a deep breath. I hadn’t thought of it this way before, not really. But Uncle Wystan’s message was clear enough, the way I saw it. “I’m the one who’s the head of the family now. I’m the one who’s got to make a place for Hans and Cora and everybody. So if I say you’re in, you’re in. Just try not to make anybody too crazy, and I’ll tell them to try the same for you.”\nHer smile didn’t reach her eyes. “It’s a nice dream, Holly. It really is.”\n“I mean it.”\n“I know you do.” And I suppose Tessa was more sensible and thinking further ahead than I’d thought. She brightened up a little. “Hey, what if I make a place for you?”\n“Are you going to buy a ship?”\nShe laughed. “Oh, Holly. I don’t know. But—we’ll both try the hardest we can, all right? To make a decent place?”\n“That’s what cousins do,” I said. “And we’ll talk to each other before we buy a ship or a farm or—or whatever else.”\n“Yes. Yes.” She laughed, shaking her head. “This family of yours is going to weird me out. But I bet when I explain your Oort stuff to my family, they’ll be pretty weirded out too.”\n“Will they try to stop you?”\n“Honey, they might take you up on that offer to come live in space.”\nI hugged her hard. Then I couldn’t put it off any longer. I grabbed the bag the disaster relief people had given me, complete with ugly socks and underwear. And that was it. We didn’t say goodbye, we didn’t say that we loved each other, although you don’t make someone your cousin if you don’t love them. We didn’t say anything about when we’d see each other again, because we didn’t know. I just went, and she stayed.\nBut we knew we had each other.\nI pulled up a message to my brother and sister; I owed it to them. “Dear Hans and Cora,” I wrote. “You may not like the risk I’m taking, but I hope it will give us a chance to be together as a family sooner.” It felt familiar, but from the other side. After a moment’s thought, I copied Uncle Wys on the message, then Uncle Will.\nI couldn’t rely on them to give me a home anymore. I was going to have to make sure they could rely on me.\nOriginally published in Analog Science Fiction, July/August 2018.", "source": "https://clarkesworldmagazine.com/lingen_01_19_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Left to Take the Lead by Marissa Lingen"}