{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alethea Kontis", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "y1lhO1EST6AKjjmhB4t93E1yEEM=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Precious Five-Star and the Reviewers of Mount Doom  Book reviewers fascinate me.  My first official publishing gig was as a book reviewer for the local free press in Murfreesboro, TN. Every two weeks, I turned in five to eight hundred words about my favorite author or tome du jour. Not that it mattered; I didn’t get paid either way. But I got published! (And, eventually, this led to bigger and better gigs . . . including ghost writing book reviews for the New York Times.)  I suspect my history as a professional reviewer is one of the reasons I’m unafraid of reviews for my books. I’m intrigued by both the terrible and the gushing. Bloggers have had epiphanies about my writing that never would have occurred to me. Conversely, one review encouraged a re-listen of my audiobook with an ear for every nuanced mention of sex, alcohol, and lascivious intention. (If you are truly horrified by such things, you probably just shouldn’t read Enchanted. Or AlphaOops.)  The chemist in me can’t help but look at all this business scientifically. Reviews are by their nature subjective and often tell us more about the reader than the book in question. Similarly, reviews reveal trends in the 21st century reading public. Do they crave more back story, or are they impatient to get to the end? Are they tired of dystopia? Are they looking for more “realism” in their fantasy? (This last one still baffles me as much as the young people who refuse to believe in love at first sight.)  With my latest book release this February, the trend I spotted was something I affectionately call “The Precious Five-Star.” Most of my books (happily) have lots of five-star reviews, some four stars, a few three stars, and proportionately fewer two and one stars.  This release, however, seemed to be racking up the four-star reviews in spades. My first thought was, “Mom is going to be furious.” (Dearest is her favorite and she’ll argue passionately with anyone who says otherwise.) My second thought was, “Did my writing suddenly take a nosedive?” And then I started reading all those four-star reviews.  They were glowing.  Reviewers finished the book and immediately started reading it again from page one. New fans were eager to pick up the first two volumes of the series. Old fans loved it as much as book one. All of them said they couldn’t wait to get their hands on every other future book in the series. And every one was a four-star review.  Like other authors who are amused by a trend, I went on Twitter to have a bit of fun. (THIS BOOK CHANGED MY OIL & MADE ME BREAKFAST IN BED! #4stars) Wackiness ensued . . . as did a discussion that surprised me. An author, a reader, and a professional blogger all responded, telling me that they saved their five-stars for “Books That Changed Their Lives.”  Now, I’ll be honest with you. I have never sat down at my computer, cracked my knuckles over the keyboard, and announced, “Today I am going to change someone’s life.” Moreover, I don’t really want you to change. I happen to like you just the way you are. I’ve been telling stories since I was a kid. My purpose now is pretty much the same as it was then: to entertain myself and my friends. If it’s not your cup of tea, there are always other choices on the menu.  But come on . . . change your life?! That’s a lot of pressure to put on an author before even cracking the spine. Nevermind the fact that it is ultimately you who changes your life. If our words inspire you to do so, that’s an honor you give us. We just sit here giggling and weeping over keyboards. You are the amazing, life-changing person in this equation. (In case you forgot.)  It seems that the majority of people reserving space for the Precious Five-Star are intelligent folks who are very serious about their reading. It follows that those of us who are writing for that demographic would have book reviews on the Intrawebs at large with fewer stars than those more unprofessional folks who have shamelessly filled Amazon and Goodreads with a glut of five-star reviews from street teams and random passersby.  My current writer-in-residence, K. Tempest Bradford, is one of those professional reviewers who uses five stars sparingly. She is suspicious when a product has too many five-star reviews. To her, four stars are more believable. But is this what every reader thinks? Does every reader see “three-and-three-quarters stars” and go read the reviews—or even reviews at other sites—before purchasing?  In time, will the Precious Five-Star hurt sales? In the New York publishing world, sales are everything. Slipping sales lead to contracts not being renewed and dropped series and soon the authors that didn’t change your life are no longer publishing. (You may think this an extreme case, but I’m afraid it happens far more often than you’d like to believe.)  One of my romance writer friends discovered another side effect of this Precious Five-Star culture: a blogger said to my friend at a social gathering that she should not expect a five-star review of her work because those are reserved. Really? Is this appropriate author small talk now?  The more I delve into this dilemma, the more uncertain I am about where I stand on the issue. As a child actress, I was taught never to boo someone on stage, no matter how bad the performance, because that person was brave enough to be on stage. As an optimist, I believe that love should be declared loudly and as often as possible. It costs us nothing, and there’s not enough of it in the world, so what’s to lose?  Everyone is entitled to their own opinion, and their own score system. As long as people continue to be unique, diverse individuals, reviews will never be standardized (and thank goodness!). But will Precious Five-Stars ultimately become a matter of pride or a source of punishment for authors today?  In 2009, the FTC required that blogs mention they “received a free review copy of [Book] in exchange for a fair and honest review.” Does the book industry need to initiate a Precious Five-Star disclaimer? “Your book might buy me a ticket to Hawaii and drive me to the airport, but unless it flies the plane, it’s not getting five-stars from this review site.”  Now I’m curious. How do you review?  Alethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie.", "text": "Non-Fiction\nAnother Word: The Precious Five-Star and the Reviewers of Mount Doom\nBook reviewers fascinate me.\nMy first official publishing gig was as a book reviewer for the local free press in Murfreesboro, TN. Every two weeks, I turned in five to eight hundred words about my favorite author or tome du jour. Not that it mattered; I didn’t get paid either way. But I got published! (And, eventually, this led to bigger and better gigs . . . including ghost writing book reviews for the New York Times.)\nI suspect my history as a professional reviewer is one of the reasons I’m unafraid of reviews for my books. I’m intrigued by both the terrible and the gushing. Bloggers have had epiphanies about my writing that never would have occurred to me. Conversely, one review encouraged a re-listen of my audiobook with an ear for every nuanced mention of sex, alcohol, and lascivious intention. (If you are truly horrified by such things, you probably just shouldn’t read Enchanted. Or AlphaOops.)\nThe chemist in me can’t help but look at all this business scientifically. Reviews are by their nature subjective and often tell us more about the reader than the book in question. Similarly, reviews reveal trends in the 21st century reading public. Do they crave more back story, or are they impatient to get to the end? Are they tired of dystopia? Are they looking for more “realism” in their fantasy? (This last one still baffles me as much as the young people who refuse to believe in love at first sight.)\nWith my latest book release this February, the trend I spotted was something I affectionately call “The Precious Five-Star.” Most of my books (happily) have lots of five-star reviews, some four stars, a few three stars, and proportionately fewer two and one stars.\nThis release, however, seemed to be racking up the four-star reviews in spades. My first thought was, “Mom is going to be furious.” (Dearest is her favorite and she’ll argue passionately with anyone who says otherwise.) My second thought was, “Did my writing suddenly take a nosedive?” And then I started reading all those four-star reviews.\nThey were glowing.\nReviewers finished the book and immediately started reading it again from page one. New fans were eager to pick up the first two volumes of the series. Old fans loved it as much as book one. All of them said they couldn’t wait to get their hands on every other future book in the series. And every one was a four-star review.\nLike other authors who are amused by a trend, I went on Twitter to have a bit of fun. (THIS BOOK CHANGED MY OIL & MADE ME BREAKFAST IN BED! #4stars) Wackiness ensued . . . as did a discussion that surprised me. An author, a reader, and a professional blogger all responded, telling me that they saved their five-stars for “Books That Changed Their Lives.”\nNow, I’ll be honest with you. I have never sat down at my computer, cracked my knuckles over the keyboard, and announced, “Today I am going to change someone’s life.” Moreover, I don’t really want you to change. I happen to like you just the way you are. I’ve been telling stories since I was a kid. My purpose now is pretty much the same as it was then: to entertain myself and my friends. If it’s not your cup of tea, there are always other choices on the menu.\nBut come on . . . change your life?! That’s a lot of pressure to put on an author before even cracking the spine. Nevermind the fact that it is ultimately you who changes your life. If our words inspire you to do so, that’s an honor you give us. We just sit here giggling and weeping over keyboards. You are the amazing, life-changing person in this equation. (In case you forgot.)\nIt seems that the majority of people reserving space for the Precious Five-Star are intelligent folks who are very serious about their reading. It follows that those of us who are writing for that demographic would have book reviews on the Intrawebs at large with fewer stars than those more unprofessional folks who have shamelessly filled Amazon and Goodreads with a glut of five-star reviews from street teams and random passersby.\nMy current writer-in-residence, K. Tempest Bradford, is one of those professional reviewers who uses five stars sparingly. She is suspicious when a product has too many five-star reviews. To her, four stars are more believable. But is this what every reader thinks? Does every reader see “three-and-three-quarters stars” and go read the reviews—or even reviews at other sites—before purchasing?\nIn time, will the Precious Five-Star hurt sales? In the New York publishing world, sales are everything. Slipping sales lead to contracts not being renewed and dropped series and soon the authors that didn’t change your life are no longer publishing. (You may think this an extreme case, but I’m afraid it happens far more often than you’d like to believe.)\nOne of my romance writer friends discovered another side effect of this Precious Five-Star culture: a blogger said to my friend at a social gathering that she should not expect a five-star review of her work because those are reserved. Really? Is this appropriate author small talk now?\nThe more I delve into this dilemma, the more uncertain I am about where I stand on the issue. As a child actress, I was taught never to boo someone on stage, no matter how bad the performance, because that person was brave enough to be on stage. As an optimist, I believe that love should be declared loudly and as often as possible. It costs us nothing, and there’s not enough of it in the world, so what’s to lose?\nEveryone is entitled to their own opinion, and their own score system. As long as people continue to be unique, diverse individuals, reviews will never be standardized (and thank goodness!). But will Precious Five-Stars ultimately become a matter of pride or a source of punishment for authors today?\nIn 2009, the FTC required that blogs mention they “received a free review copy of [Book] in exchange for a fair and honest review.” Does the book industry need to initiate a Precious Five-Star disclaimer? “Your book might buy me a ticket to Hawaii and drive me to the airport, but unless it flies the plane, it’s not getting five-stars from this review site.”\nNow I’m curious. How do you review?\nAlethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie.", "source": "https://clarkesworldmagazine.com/another_word_04_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Precious Five-Star and the Reviewers of Mount Doom by Alethea Kontis"}