{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kelly Robson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Q+o/h7MS2O5+XBsgLXkfLHC6OEg=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Dream of Writing Full Time  I love my job. No, really. I love my job. Not writing (which I adore), but my other job. The eight-to-four, five-days-a-week office job. You might call it my day job, but really, it’s just my job. And I love it. Have I made that clear?  It’s not a glamourous job. It’s not exciting or prestigious. It’s comfortable. My colleagues are nice and the work suits my temperament. After years of experience, I’m good at it. And I love it because it supports my life. I work so I can live. I work so I can write.  Most writers dream of being able to quit their day jobs and write full time. The reasons are too obvious to list, but the biggest reason is time. Humans have a finite amount. Pursuing a writing career in spare time can feel constrained—like paddling in a kiddie pool when you could be crossing the ocean. What could I achieve if I focused on writing full time?  Writing full time remains a dream for most writers because we’re realistic about our finances. An average middle class individual income is difficult to achieve writing fiction. The lavish lifestyles of writers on TV are highly fictionalized. Most writers count themselves lucky if they can float the mortgage on a modest suburban bungalow.  Let’s keep that quiet, though. Writing classes are filled with people nursing unrealistic dreams of superstardom on the order of Rowling and King, and those classes are taught by writers with more typical careers. The bestselling-author dream puts butts in classroom seats and pays a lot of writers’ bills. The fact that this kind of success is near-mythical doesn’t matter. So is winning the lottery. People have to dream.  So, when I dream about being a full-time writer, what does that look like, realistically?  On the most basic level, I would simply have the freedom to write at full capacity. For me, that would be either three to four hours of drafting or six to eight hours of revision, five or six days a week. In this dream, I would live a creative life, thinking about nothing but story. I’d read more, staying current in the field. I’d think deeply about what I know and what I believe, and delve into the truths behind what makes me angry and what I passionately value, expressing my insights about the world, and illustrating what I wish were true.  Except for the capacity and single-mindedness, this is exactly what I do now. Alyx and I have organized our lives to maximize our creative time. We live downtown in a small apartment. I walk to work. We don’t have kids. In a typical week, I can eke out ten to fifteen hours of writing, and when I really need to make consistent progress—which is essential for revising—I can get as many as twenty-five hours.  I’d love to see what I could do if I had more time. Clearly, the longer I spend on a story, the better it is. I’d definitely be a better writer if I were working at it full time.  For many writers, the road to full-time writing is paved by a partner with a regular paycheck. I know the pros and cons of this route intimately: Alyx has been a full-time writer for twenty years. She does most of the housework and cooking (and all of the family finances) and I bring in that regular slab of bacon. This arrangement works, but it has drawbacks.  Inequality can put a lot of pressure on the partnership. I earn a good salary; she doesn’t. I get paid sick days; not her. My schedule is carved in stone; hers is fungible. My vacation days are limited; she can work on the other side of the world if she wants to.  Alyx and I have been able to tolerate this inequality for two decades because we have identical values and goals: Stories are the most important things in the world and SF/F/H is the highest form of art. We believe in each other’s writing implicitly. Still, it’s been difficult on occasion. Money has been tight. We’ve made sacrifices that wouldn’t have been necessary if we had two paychecks instead of one. Every so often I work myself into a lather worrying about being poor when we’re old. But overwhelmingly, we’re happy with our choices.  If Alyx and I weren’t on exactly the same page, this situation would be unsustainable and possibly tragic. Years ago, a good friend who’d been writing full time landed on our doorstep staggering from the sudden collapse of his relationship. In addition to feeling shell-shocked and betrayed by the loss of love, he simply didn’t know how he was going to live without his partner’s support—how he’d feed his cats, much less write. In the end, he salvaged his life and is writing full time now in a home filled with love. The wreckage wasn’t pretty, though, and I wouldn’t wish the situation on anyone.  To make a living, successful full-time writers have to hustle. They write multiple books every year. They sculpt hybrid careers with traditionally-published books, short fiction, serials, and indie titles. They write popular blogs and groom vibrant social media presences. They claw back copyright on their out-of-print backlist and self-publish. They survey the market, developing expertise on all the publishing models and platforms. They put a lot of time and effort into PR, with appearances, newsletters, Patreon rewards, and guest blogging.  Other successful full-time writers edit magazines and anthologies, teach writing, or consult on other writers’ manuscripts. They work as journalists and book reviewers. Some write media tie-ins or consult to video game companies. Many teach writing in classrooms or online. They run workshops and master classes. Our writerly ecosystem is supported by full-time writers carving time out of their work days to supplement their writing income with peripheral jobs.  This isn’t full time-writing—it’s a lot more than full time. In comparison, working in an office forty hours a week seems pretty relaxing.  Even aside from the financial considerations, writing full time isn’t necessarily beneficial or desirable for everyone. Being a full-time writer comes with some hidden drawbacks.  Writing is a solitary pursuit, and it can be lonely. Many writers work in cafes to fill the social gap, but cafe writing doesn’t work for everyone. Many writers need to be alone to do their best work, but being alone all day doesn’t work for everyone.  Writing full time, we also risk burnout. Everyone has a different sustainable per-word volume that bears absolutely no relation to anyone else’s. Plenty of writers will tell you they aim for 500 words a day. After nearly two years writing full time, Jeffe Kennedy has just settled on 3000 words as a sustainable and fruitful per-day rate. In contrast, while working a day job, Kameron Hurley experimented until she hit upon a way to write 10,000 words a day, two days a week. We can’t expect ourselves to start writing full time and instantly become the most productive version of ourselves. Humans aren’t that simple or predictable, and what nourishes one writer might be poison for another.  Pressure to produce doesn’t work for everyone, either, and not everyone has the same tolerance for risk and uncertainty. Unless I had a healthy cushion, I’m pretty sure I’d hate wondering whether my dream project will earn-out its advance so I could work on my next dream project. It’d be exciting, certainly. But I think I prefer getting a paycheck twice a month.  When I dream about writing full time, what I’m actually yearning for is a life with no problems—living in a magical land where I can do what I love and not have to worry about anything. That’s a really good dream, but writing full time is no way to get it.  After a lifetime of effort, I’m finally beginning to become the writer I’ve wanted to be—yearned to be—my entire life, and this fills me with joy from top to toes. That joy would suffocate if I tried to make it support my entire life. If I had to make writing pay the bills, writing would become a stressful job. And jobs are tedious, frustrating, and occasionally odious things. Writing is difficult enough without making it a full-time job.  So, for now, until I can find a way to a life with no problems, I’ll joyfully write in my spare time. I’m still living my dream. Kelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica.", "text": "Non-Fiction\nAnother Word: The Dream of Writing Full Time\nI love my job. No, really. I love my job. Not writing (which I adore), but my other job. The eight-to-four, five-days-a-week office job. You might call it my day job, but really, it’s just my job. And I love it. Have I made that clear?\nIt’s not a glamourous job. It’s not exciting or prestigious. It’s comfortable. My colleagues are nice and the work suits my temperament. After years of experience, I’m good at it. And I love it because it supports my life. I work so I can live. I work so I can write.\nMost writers dream of being able to quit their day jobs and write full time. The reasons are too obvious to list, but the biggest reason is time. Humans have a finite amount. Pursuing a writing career in spare time can feel constrained—like paddling in a kiddie pool when you could be crossing the ocean. What could I achieve if I focused on writing full time?\nWriting full time remains a dream for most writers because we’re realistic about our finances. An average middle class individual income is difficult to achieve writing fiction. The lavish lifestyles of writers on TV are highly fictionalized. Most writers count themselves lucky if they can float the mortgage on a modest suburban bungalow.\nLet’s keep that quiet, though. Writing classes are filled with people nursing unrealistic dreams of superstardom on the order of Rowling and King, and those classes are taught by writers with more typical careers. The bestselling-author dream puts butts in classroom seats and pays a lot of writers’ bills. The fact that this kind of success is near-mythical doesn’t matter. So is winning the lottery. People have to dream.\nSo, when I dream about being a full-time writer, what does that look like, realistically?\nOn the most basic level, I would simply have the freedom to write at full capacity. For me, that would be either three to four hours of drafting or six to eight hours of revision, five or six days a week. In this dream, I would live a creative life, thinking about nothing but story. I’d read more, staying current in the field. I’d think deeply about what I know and what I believe, and delve into the truths behind what makes me angry and what I passionately value, expressing my insights about the world, and illustrating what I wish were true.\nExcept for the capacity and single-mindedness, this is exactly what I do now. Alyx and I have organized our lives to maximize our creative time. We live downtown in a small apartment. I walk to work. We don’t have kids. In a typical week, I can eke out ten to fifteen hours of writing, and when I really need to make consistent progress—which is essential for revising—I can get as many as twenty-five hours.\nI’d love to see what I could do if I had more time. Clearly, the longer I spend on a story, the better it is. I’d definitely be a better writer if I were working at it full time.\nFor many writers, the road to full-time writing is paved by a partner with a regular paycheck. I know the pros and cons of this route intimately: Alyx has been a full-time writer for twenty years. She does most of the housework and cooking (and all of the family finances) and I bring in that regular slab of bacon. This arrangement works, but it has drawbacks.\nInequality can put a lot of pressure on the partnership. I earn a good salary; she doesn’t. I get paid sick days; not her. My schedule is carved in stone; hers is fungible. My vacation days are limited; she can work on the other side of the world if she wants to.\nAlyx and I have been able to tolerate this inequality for two decades because we have identical values and goals: Stories are the most important things in the world and SF/F/H is the highest form of art. We believe in each other’s writing implicitly. Still, it’s been difficult on occasion. Money has been tight. We’ve made sacrifices that wouldn’t have been necessary if we had two paychecks instead of one. Every so often I work myself into a lather worrying about being poor when we’re old. But overwhelmingly, we’re happy with our choices.\nIf Alyx and I weren’t on exactly the same page, this situation would be unsustainable and possibly tragic. Years ago, a good friend who’d been writing full time landed on our doorstep staggering from the sudden collapse of his relationship. In addition to feeling shell-shocked and betrayed by the loss of love, he simply didn’t know how he was going to live without his partner’s support—how he’d feed his cats, much less write. In the end, he salvaged his life and is writing full time now in a home filled with love. The wreckage wasn’t pretty, though, and I wouldn’t wish the situation on anyone.\nTo make a living, successful full-time writers have to hustle. They write multiple books every year. They sculpt hybrid careers with traditionally-published books, short fiction, serials, and indie titles. They write popular blogs and groom vibrant social media presences. They claw back copyright on their out-of-print backlist and self-publish. They survey the market, developing expertise on all the publishing models and platforms. They put a lot of time and effort into PR, with appearances, newsletters, Patreon rewards, and guest blogging.\nOther successful full-time writers edit magazines and anthologies, teach writing, or consult on other writers’ manuscripts. They work as journalists and book reviewers. Some write media tie-ins or consult to video game companies. Many teach writing in classrooms or online. They run workshops and master classes. Our writerly ecosystem is supported by full-time writers carving time out of their work days to supplement their writing income with peripheral jobs.\nThis isn’t full time-writing—it’s a lot more than full time. In comparison, working in an office forty hours a week seems pretty relaxing.\nEven aside from the financial considerations, writing full time isn’t necessarily beneficial or desirable for everyone. Being a full-time writer comes with some hidden drawbacks.\nWriting is a solitary pursuit, and it can be lonely. Many writers work in cafes to fill the social gap, but cafe writing doesn’t work for everyone. Many writers need to be alone to do their best work, but being alone all day doesn’t work for everyone.\nWriting full time, we also risk burnout. Everyone has a different sustainable per-word volume that bears absolutely no relation to anyone else’s. Plenty of writers will tell you they aim for 500 words a day. After nearly two years writing full time, Jeffe Kennedy has just settled on 3000 words as a sustainable and fruitful per-day rate. In contrast, while working a day job, Kameron Hurley experimented until she hit upon a way to write 10,000 words a day, two days a week. We can’t expect ourselves to start writing full time and instantly become the most productive version of ourselves. Humans aren’t that simple or predictable, and what nourishes one writer might be poison for another.\nPressure to produce doesn’t work for everyone, either, and not everyone has the same tolerance for risk and uncertainty. Unless I had a healthy cushion, I’m pretty sure I’d hate wondering whether my dream project will earn-out its advance so I could work on my next dream project. It’d be exciting, certainly. But I think I prefer getting a paycheck twice a month.\nWhen I dream about writing full time, what I’m actually yearning for is a life with no problems—living in a magical land where I can do what I love and not have to worry about anything. That’s a really good dream, but writing full time is no way to get it.\nAfter a lifetime of effort, I’m finally beginning to become the writer I’ve wanted to be—yearned to be—my entire life, and this fills me with joy from top to toes. That joy would suffocate if I tried to make it support my entire life. If I had to make writing pay the bills, writing would become a stressful job. And jobs are tedious, frustrating, and occasionally odious things. Writing is difficult enough without making it a full-time job.\nSo, for now, until I can find a way to a life with no problems, I’ll joyfully write in my spare time. I’m still living my dream.\nKelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica.", "source": "https://clarkesworldmagazine.com/another_word_09_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Dream of Writing Full Time by Kelly Robson"}