{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Luc Reid", "hostname": "clarkesworldmagazine.com", "date": "2010-02-04", "categories": "", "tags": "", "fingerprint": "U2WnvaTzaGiKkvEy5yQWb371Bzw=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Future Brains: Neuroscience Fiction versus Neuroscience Fantasy  Science fiction has had brains on the brain at least since Dr. Frankenstein installed one in his monster. Over the years science fiction has depicted technologies like mind control (in Star Trek, for example), instant learning (The Matrix), telepathy (Robert Heinlein’s Time for the Stars), and transferring memories and skills (The Dollhouse). While some of these technologies may eventually prove to be possible, others are extremely unlikely to ever work based on what we now know about the brain—because our own minds are much stranger territory than we ever used to imagine they were.  Downloading Memories, Viewing Memories and Total Recall  The common assumption about how memory works is that it’s like a video camera. This shows up in science fiction accounts of retrieved memories as well as in our legal system (“tell the court exactly what happened. Was the man you saw wearing a green tie?”). According to the video camera analogy, we store every detail of everything we perceive, and when we want to use the memories, we replay them on a mental screen. If this idea is accurate, it seems reasonable that someday we might be able to transfer memories from people’s heads onto digital media. We could also access any detail of anything that has ever happened to someone just by looking at the right spot in the person’s memory.  However, as research has revealed in recent years, our memories don’t work like video cameras at all. Instead, our brains identify the most novel or important elements of what we perceive and store those elements in locations scattered throughout the brain, while everything else is discarded. Even a momentary image we retain isn’t stored as one piece. In his book Brain Rules, developmental molecular biologist John Medina says: “If you look at a complex picture, for example, your brain immediately extracts the diagonal lines from the vertical lines and stores them in separate areas. Same with color. If the picture is moving, the fact of its motion will be extracted and stored in a place separate than if the picture were static.”  If that’s the case, you might well wonder why you can vividly remember every detail of playing Monopoly with your cousin when you were twelve, or a toast at a wedding you went to last week. The answer, disturbingly, is that our brains make up details to complete the picture. Harvard psychology professor Daniel Gilbert puts it this way in his book Stumbling on Happiness: “ . . . information acquired after an event alters memory of the event . . . First, the act of remembering involves ‘filling in’ details that were not actually stored; and second, we generally cannot tell when we are doing this because filling in happens quickly and unconsciously.”  Understanding these things about memory—that we extract details instead of making recordings, that memories are stored in fragments all across our brains, and that a lot of what seems to be memory is really our brains filling in the blanks—it becomes clear that we’ll never be able to download or view memories per se: that would be like trying to show a film when all you have is a capsule review. However, it might be possible eventually to view someone’s imperfect recollection of a memory, along with other thoughts they have. We’ll talk about the neuroscience of that a little further on.  Erasing and Altering Memories  While viewing memories may be a long shot, erasing and altering memories is already a reality, at least in lab animals. By blocking the brain’s ability to create proteins, scientists have prevented memories from forming and erased existing memories in a number of experiments over the last few decades. The reason a memory can be so easily erased even long after it’s made is that—bizarrely—every time we remember something, the memory gets rewritten. Anything that interferes with the rewriting turns recollection into erasure.  Memories can also be altered this way. McGill University behavioral neuroscientist Karim Nader explains: “imagine you were at a scene of a crime. Someone asks you if you remember a person with a red jacket there (in reality there was no one with a red jacket there). When you call up the memory of the crime scene, it becomes labile, creating an opportunity for suggested or created images of a person with a red jacket to become stored with the original memory undergoing reconsolidation. Therefore, the next time you think of a crime scene there may be someone wearing a red jacket at the scene of the crime and, to the subject, it’s completely accurate.”  Mind Control  What about mind control? Well, if someone found a way to stimulate parts of the brain remotely and with very fine control, there would be a possibility that real mind control could be developed. But those are big “ifs”—you probably don’t need a protective tin foil hat just yet.  Some kinds of body control, though, are already happening. A process called Functional Electrical Stimulation (FES) is used to trigger muscle contraction in paralysis victims: it can make a limb move through a sequence resembling natural motion by applying electrical current that bypasses the brain altogether.  Similarly, it’s also been known for years that stimulating specific parts of the brain with electricity can cause thoughts, feelings, memory recall, physical sensations, and even hallucinations. How or if any of this could be accomplished indirectly, without putting some kind of electrical equipment right on or into a person, is an open question; but, at least in theory, a great many physical and mental functions are ready to go off with just a little jolt of electricity.  Then there is subliminal suggestion, which may sound like an urban legend but has a solid basis in fact. Gilbert points out how susceptible our brains are even to information we don’t realize we’ve received. “ . . . when volunteers watch a computer screen on which words appear for just a few milliseconds,” he writes, “they are unaware of seeing the words and are unable to guess which words they saw. But they are influenced by them. When the word hostile is flashed, volunteers judge others negatively, When the word elderly is flashed, volunteers walk slowly. When the word stupid is flashed, volunteers perform poorly on tests.”  Copying Minds  In the August 2009 issue of Clarkesworld, Brian Trent’s article “Eternal Lives on Hard Drives?” looks into some present-day technologies that could in theory lead to the ability to upload minds—like Project Blue Brain, a supercomputer system that has successfully modeled a system of about 10,000 neurons. As Trent points out, our brains are far more complex than this. Each of us commands a vast neuroelectrical network of about a hundred billion neurons, each one making synaptic connections to, on average, 7,000 other neurons.  Until very recently—1998, in fact—the accepted wisdom was that the adult brain doesn’t change connections, only strengthens or weakens them. But studies since that time have demonstrated that our brains are not just capable of changing: they’re changing all the time. Medina writes, “The brain is constantly learning things, so the brain is constantly rewiring itself.”  So while it’s widely recognized that our brains are much more complex than today’s computers, it’s not immediately obvious how much more complex they are, or that they work in a completely different way. In the brain, for instance, neural connections are both the structure and the means of storing information, so that our hardware and software are one and the same. Still, even though Project Blue Brain is many millions of times less complex than the neural network of a real human brain, it’s arguably a start to modeling that kind of network.  Physiologically speaking, the neural network is only one of two major systems that make us think and feel the way we do. Science fiction stories about uploading minds generally focus only on these neural connections, and as important as they are, they aren’t the whole story. Any true representation of a brain also needs to model a set of chemical systems our brains and bodies use to convey information and incite action: neurotransmitters and hormones. This cast of characters is large, varied, and extremely colorful, including dopamine (associated with pleasure and addiction), cortisol (associated with stress), testosterone (associated with aggression and arousal in both men and women), oxytocin (associated with love, affection, and attachment), and many more. These chemicals are both manufactured and consumed by our bodies, not all of them in the brain—so in a very real sense, our mind is much larger than our brain, encompassing a wide variety of sensations and emotions that, while they trigger neural activity, are at least as chemical as they are electrical.  This problem could be sidestepped if a brain could somehow be copied or transferred to a new body. Unless we were able to physically transplant the brain (as in Shelley’s Frankenstein or Heinlein’s I Will Fear No Evil), this would require physically growing the structure of the new brain. To do that, we would have to learn the trick not just of reading an entire brain’s worth of neural connections, but also of causing billions of neurons to grow and of creating the 100 to 500 trillion synaptic connections that make up a human mind, because in the brain, information and structure are the same thing. If we could do that, though (and so far we can’t do anything like it), and if the destination were a new human body with a normal endocrine system, the resulting person might more or less think and feel like the original, because the same kinds of chemical systems would be present.  However, if we’re talking about copying a mind to somewhere other than a human body, we have both the problem of needing to duplicate (or translate) the whole neural map to a new brain and the problem of simulating the neurotransmitter system in the brain, as well as a goodly portion of the endocrine system. Whether it’s even conceptually possible to reproduce the wide array of chemical influences that can affect the human brain using a strictly electronic device is debatable at the least.  Instant Learning  In The Matrix, Neo (the main character) learns kung fu and many other martial arts with uploads to the brain that take a few minutes at most. For comparison, around the time you read this I’m testing for my black belt in Taekwondo after applying myself energetically for three and a half years . . . and earning a first dan black belt is far from “mastering” Taekwondo.  Let’s tackle one of the obvious problems with instant learning first: in real life, physical skills often require body development. Taekwondo involves conditioning that over months and years builds up fast-twitch muscles, and no amount of brain-changing will give a person skill in Taekwondo without the conditioning to support it. (Fortunately, of course, we’ll have nanotechnology to build the muscle for us . . . won’t we?)  However, if we consider just the mental side, which would be more than sufficient for chess or political strategy or speaking fluent Swedish, is instant learning possible? Again we’re faced with the question of changing the synaptic connections of many, many neurons, but the problem here is even more complex than the problem of transferring a mind, because every human brain has different neural connections, and you can’t just impose a generalized neural map on an existing brain: that would be like trying to drive across New York using a map of Florida. Instant learning would have to make connections with existing parts of the neural map, leveraging existing knowledge, connections, and skills. So just planning the neural changes to make would require three steps: mapping out the skill in neural terms, mapping out the entire existing brain, and figuring out a way to merge the skill map with the existing brain map without causing serious harm. This may mean the feat is impossible—or just that it’s epically complex.  Accelerating learning methods through neuroscience, however, may already have started. For instance, Medina’s book Brain Rules offers some very specific, neurology-based advice for improving learning through use of more visual material, charging information with emotion, and repeating at specific intervals to lock knowledge into memory.  Mental Telepathy, Reading Thoughts and Watching Dreams  Is it conceivable that we might someday communicate telepathically or be able to view someone else’s thoughts? We know that actual memories aren’t like video recordings, but interestingly, thoughts are a little closer. When we imagine an image or a scene, it turns out that this activates many of the same parts of the brain that really witnessing such an image or scene would.  For example, in a recent study published in the New England Journal of Medicine and described in the LA Times and the Times’ accompanying blog, doctors were able to communicate in a very rudimentary way with patients who were thought to be vegetative, by monitoring their brains and asking them to imagine—of all things—playing tennis.  If we developed a much, much more sophisticated means of monitoring neural activity, in theory it might be possible to decode signals from the visual cortex and view what someone was visualizing in their mind’s eye. The same might apply, in theory, to imagined sounds. So if we had a currently nonexistent, super-efficient scanning tool, and if we completely understood how imagined sights, sounds, and speech were depicted in the human brain, and if we could apply this general knowledge to the variable individual brain, then in theory maybe we could view or transmit thoughts, dreams, visualizations—or even “mental speech.”  This isn’t quite the same thing as being able to read minds, though. For one thing, while we’re used to thinking of thoughts as being framed in language, in fact a lot of our thinking occurs at a level below language, and a lot of our mental experience occurs at a level below thinking.  So while we can at least envision how we might listen to mental speech (and if we could precisely stimulate the auditory cortex, even make it heard inside another brain), communicating emotion and other subtle sensations may pose much trickier problems. Detecting chemicals that are affecting the human brain is hard enough, but reproducing those effects in another human brain means having to control all of the neurons and organs producing those chemicals. What’s more, the chemical parts of the brain act much more slowly than the electrical parts, so that the chemical releases would have to be sent out in advance of when they’re meant to impact.  All of which tells us something that Mr. Spock has been trying to say for a long time: that conscious thought and logic are simply very complex, but emotional systems are messy as hell.  Bibliography  Alberini, Cristina M. “The role of protein synthesis during the labile phases of memory: revisiting the skepticism” Neurobiology of Learning and Memory volume 89, issue 3, March 2008  Gilbert, Daniel. Stumbling on Happiness New York: Alfred A. Knopf, 2006  Healy, Melissa. “Breaking Through the Silence of the Seemingly Unconscious: Researchers Read Minds of the Vegetative” Los Angeles Times Web site, 4 Feb 2010  Johnson, Steven. Mind Wide Open: Your Brain and the Neuroscience of Everyday Life. New York: Scribner, 2004.  Le Bihan, D., et al. “Activation of human primary visual cortex during visual recall: A magnetic resonance imaging study” Proceedings of the National Academy of Sciences, Vol. 90, pp. 11802-11805, December 1993  Medina, John. Brain Rules: 12 Principles for Surviving and Thriving at Work, Home, and School. Seattle: Pear Press, 2008. (Supporting materials available online at http://www.brainrules.net)  “Memories Become Labile Whenever They Are Retrieved.” Human Frontier Science Program Web site  Luc Reid writes extensively on the psychology and neuroscience of self-motivation at www.willpowerengine.com. He is a Writers of the Future winner and author of Talk the Talk: The Slang of 65 American Subcultures (Writer's Digest Books, 2006). His fiction appears regularly on The Daily Cabal and has also seen print in Abyss & Apex, Brain Harvest, and elsewhere. He runs the online, spec-fic neopro writers' group Codex and is a former radio commentator for Jacksonville, Florida NPR affiliate WJCT. Luc lives on a hillside in Vermont with his son and a menagerie of musical instruments.", "text": "Non-Fiction\nFuture Brains: Neuroscience Fiction versus Neuroscience Fantasy\nScience fiction has had brains on the brain at least since Dr. Frankenstein installed one in his monster. Over the years science fiction has depicted technologies like mind control (in Star Trek, for example), instant learning (The Matrix), telepathy (Robert Heinlein’s Time for the Stars), and transferring memories and skills (The Dollhouse). While some of these technologies may eventually prove to be possible, others are extremely unlikely to ever work based on what we now know about the brain—because our own minds are much stranger territory than we ever used to imagine they were.\nDownloading Memories, Viewing Memories and Total Recall\nThe common assumption about how memory works is that it’s like a video camera. This shows up in science fiction accounts of retrieved memories as well as in our legal system (“tell the court exactly what happened. Was the man you saw wearing a green tie?”). According to the video camera analogy, we store every detail of everything we perceive, and when we want to use the memories, we replay them on a mental screen. If this idea is accurate, it seems reasonable that someday we might be able to transfer memories from people’s heads onto digital media. We could also access any detail of anything that has ever happened to someone just by looking at the right spot in the person’s memory.\nHowever, as research has revealed in recent years, our memories don’t work like video cameras at all. Instead, our brains identify the most novel or important elements of what we perceive and store those elements in locations scattered throughout the brain, while everything else is discarded. Even a momentary image we retain isn’t stored as one piece. In his book Brain Rules, developmental molecular biologist John Medina says: “If you look at a complex picture, for example, your brain immediately extracts the diagonal lines from the vertical lines and stores them in separate areas. Same with color. If the picture is moving, the fact of its motion will be extracted and stored in a place separate than if the picture were static.”\nIf that’s the case, you might well wonder why you can vividly remember every detail of playing Monopoly with your cousin when you were twelve, or a toast at a wedding you went to last week. The answer, disturbingly, is that our brains make up details to complete the picture. Harvard psychology professor Daniel Gilbert puts it this way in his book Stumbling on Happiness: “ . . . information acquired after an event alters memory of the event . . . First, the act of remembering involves ‘filling in’ details that were not actually stored; and second, we generally cannot tell when we are doing this because filling in happens quickly and unconsciously.”\nUnderstanding these things about memory—that we extract details instead of making recordings, that memories are stored in fragments all across our brains, and that a lot of what seems to be memory is really our brains filling in the blanks—it becomes clear that we’ll never be able to download or view memories per se: that would be like trying to show a film when all you have is a capsule review. However, it might be possible eventually to view someone’s imperfect recollection of a memory, along with other thoughts they have. We’ll talk about the neuroscience of that a little further on.\nErasing and Altering Memories\nWhile viewing memories may be a long shot, erasing and altering memories is already a reality, at least in lab animals. By blocking the brain’s ability to create proteins, scientists have prevented memories from forming and erased existing memories in a number of experiments over the last few decades. The reason a memory can be so easily erased even long after it’s made is that—bizarrely—every time we remember something, the memory gets rewritten. Anything that interferes with the rewriting turns recollection into erasure.\nMemories can also be altered this way. McGill University behavioral neuroscientist Karim Nader explains: “imagine you were at a scene of a crime. Someone asks you if you remember a person with a red jacket there (in reality there was no one with a red jacket there). When you call up the memory of the crime scene, it becomes labile, creating an opportunity for suggested or created images of a person with a red jacket to become stored with the original memory undergoing reconsolidation. Therefore, the next time you think of a crime scene there may be someone wearing a red jacket at the scene of the crime and, to the subject, it’s completely accurate.”\nMind Control\nWhat about mind control? Well, if someone found a way to stimulate parts of the brain remotely and with very fine control, there would be a possibility that real mind control could be developed. But those are big “ifs”—you probably don’t need a protective tin foil hat just yet.\nSome kinds of body control, though, are already happening. A process called Functional Electrical Stimulation (FES) is used to trigger muscle contraction in paralysis victims: it can make a limb move through a sequence resembling natural motion by applying electrical current that bypasses the brain altogether.\nSimilarly, it’s also been known for years that stimulating specific parts of the brain with electricity can cause thoughts, feelings, memory recall, physical sensations, and even hallucinations. How or if any of this could be accomplished indirectly, without putting some kind of electrical equipment right on or into a person, is an open question; but, at least in theory, a great many physical and mental functions are ready to go off with just a little jolt of electricity.\nThen there is subliminal suggestion, which may sound like an urban legend but has a solid basis in fact. Gilbert points out how susceptible our brains are even to information we don’t realize we’ve received. “ . . . when volunteers watch a computer screen on which words appear for just a few milliseconds,” he writes, “they are unaware of seeing the words and are unable to guess which words they saw. But they are influenced by them. When the word hostile is flashed, volunteers judge others negatively, When the word elderly is flashed, volunteers walk slowly. When the word stupid is flashed, volunteers perform poorly on tests.”\nCopying Minds\nIn the August 2009 issue of Clarkesworld, Brian Trent’s article “Eternal Lives on Hard Drives?” looks into some present-day technologies that could in theory lead to the ability to upload minds—like Project Blue Brain, a supercomputer system that has successfully modeled a system of about 10,000 neurons. As Trent points out, our brains are far more complex than this. Each of us commands a vast neuroelectrical network of about a hundred billion neurons, each one making synaptic connections to, on average, 7,000 other neurons.\nUntil very recently—1998, in fact—the accepted wisdom was that the adult brain doesn’t change connections, only strengthens or weakens them. But studies since that time have demonstrated that our brains are not just capable of changing: they’re changing all the time. Medina writes, “The brain is constantly learning things, so the brain is constantly rewiring itself.”\nSo while it’s widely recognized that our brains are much more complex than today’s computers, it’s not immediately obvious how much more complex they are, or that they work in a completely different way. In the brain, for instance, neural connections are both the structure and the means of storing information, so that our hardware and software are one and the same. Still, even though Project Blue Brain is many millions of times less complex than the neural network of a real human brain, it’s arguably a start to modeling that kind of network.\nPhysiologically speaking, the neural network is only one of two major systems that make us think and feel the way we do. Science fiction stories about uploading minds generally focus only on these neural connections, and as important as they are, they aren’t the whole story. Any true representation of a brain also needs to model a set of chemical systems our brains and bodies use to convey information and incite action: neurotransmitters and hormones. This cast of characters is large, varied, and extremely colorful, including dopamine (associated with pleasure and addiction), cortisol (associated with stress), testosterone (associated with aggression and arousal in both men and women), oxytocin (associated with love, affection, and attachment), and many more. These chemicals are both manufactured and consumed by our bodies, not all of them in the brain—so in a very real sense, our mind is much larger than our brain, encompassing a wide variety of sensations and emotions that, while they trigger neural activity, are at least as chemical as they are electrical.\nThis problem could be sidestepped if a brain could somehow be copied or transferred to a new body. Unless we were able to physically transplant the brain (as in Shelley’s Frankenstein or Heinlein’s I Will Fear No Evil), this would require physically growing the structure of the new brain. To do that, we would have to learn the trick not just of reading an entire brain’s worth of neural connections, but also of causing billions of neurons to grow and of creating the 100 to 500 trillion synaptic connections that make up a human mind, because in the brain, information and structure are the same thing. If we could do that, though (and so far we can’t do anything like it), and if the destination were a new human body with a normal endocrine system, the resulting person might more or less think and feel like the original, because the same kinds of chemical systems would be present.\nHowever, if we’re talking about copying a mind to somewhere other than a human body, we have both the problem of needing to duplicate (or translate) the whole neural map to a new brain and the problem of simulating the neurotransmitter system in the brain, as well as a goodly portion of the endocrine system. Whether it’s even conceptually possible to reproduce the wide array of chemical influences that can affect the human brain using a strictly electronic device is debatable at the least.\nInstant Learning\nIn The Matrix, Neo (the main character) learns kung fu and many other martial arts with uploads to the brain that take a few minutes at most. For comparison, around the time you read this I’m testing for my black belt in Taekwondo after applying myself energetically for three and a half years . . . and earning a first dan black belt is far from “mastering” Taekwondo.\nLet’s tackle one of the obvious problems with instant learning first: in real life, physical skills often require body development. Taekwondo involves conditioning that over months and years builds up fast-twitch muscles, and no amount of brain-changing will give a person skill in Taekwondo without the conditioning to support it. (Fortunately, of course, we’ll have nanotechnology to build the muscle for us . . . won’t we?)\nHowever, if we consider just the mental side, which would be more than sufficient for chess or political strategy or speaking fluent Swedish, is instant learning possible? Again we’re faced with the question of changing the synaptic connections of many, many neurons, but the problem here is even more complex than the problem of transferring a mind, because every human brain has different neural connections, and you can’t just impose a generalized neural map on an existing brain: that would be like trying to drive across New York using a map of Florida. Instant learning would have to make connections with existing parts of the neural map, leveraging existing knowledge, connections, and skills. So just planning the neural changes to make would require three steps: mapping out the skill in neural terms, mapping out the entire existing brain, and figuring out a way to merge the skill map with the existing brain map without causing serious harm. This may mean the feat is impossible—or just that it’s epically complex.\nAccelerating learning methods through neuroscience, however, may already have started. For instance, Medina’s book Brain Rules offers some very specific, neurology-based advice for improving learning through use of more visual material, charging information with emotion, and repeating at specific intervals to lock knowledge into memory.\nMental Telepathy, Reading Thoughts and Watching Dreams\nIs it conceivable that we might someday communicate telepathically or be able to view someone else’s thoughts? We know that actual memories aren’t like video recordings, but interestingly, thoughts are a little closer. When we imagine an image or a scene, it turns out that this activates many of the same parts of the brain that really witnessing such an image or scene would.\nFor example, in a recent study published in the New England Journal of Medicine and described in the LA Times and the Times’ accompanying blog, doctors were able to communicate in a very rudimentary way with patients who were thought to be vegetative, by monitoring their brains and asking them to imagine—of all things—playing tennis.\nIf we developed a much, much more sophisticated means of monitoring neural activity, in theory it might be possible to decode signals from the visual cortex and view what someone was visualizing in their mind’s eye. The same might apply, in theory, to imagined sounds. So if we had a currently nonexistent, super-efficient scanning tool, and if we completely understood how imagined sights, sounds, and speech were depicted in the human brain, and if we could apply this general knowledge to the variable individual brain, then in theory maybe we could view or transmit thoughts, dreams, visualizations—or even “mental speech.”\nThis isn’t quite the same thing as being able to read minds, though. For one thing, while we’re used to thinking of thoughts as being framed in language, in fact a lot of our thinking occurs at a level below language, and a lot of our mental experience occurs at a level below thinking.\nSo while we can at least envision how we might listen to mental speech (and if we could precisely stimulate the auditory cortex, even make it heard inside another brain), communicating emotion and other subtle sensations may pose much trickier problems. Detecting chemicals that are affecting the human brain is hard enough, but reproducing those effects in another human brain means having to control all of the neurons and organs producing those chemicals. What’s more, the chemical parts of the brain act much more slowly than the electrical parts, so that the chemical releases would have to be sent out in advance of when they’re meant to impact.\nAll of which tells us something that Mr. Spock has been trying to say for a long time: that conscious thought and logic are simply very complex, but emotional systems are messy as hell.\nBibliography\nAlberini, Cristina M. “The role of protein synthesis during the labile phases of memory: revisiting the skepticism” Neurobiology of Learning and Memory volume 89, issue 3, March 2008\nGilbert, Daniel. Stumbling on Happiness New York: Alfred A. Knopf, 2006\nHealy, Melissa. “Breaking Through the Silence of the Seemingly Unconscious: Researchers Read Minds of the Vegetative” Los Angeles Times Web site, 4 Feb 2010\nJohnson, Steven. Mind Wide Open: Your Brain and the Neuroscience of Everyday Life. New York: Scribner, 2004.\nLe Bihan, D., et al. “Activation of human primary visual cortex during visual recall: A magnetic resonance imaging study” Proceedings of the National Academy of Sciences, Vol. 90, pp. 11802-11805, December 1993\nMedina, John. Brain Rules: 12 Principles for Surviving and Thriving at Work, Home, and School. Seattle: Pear Press, 2008. (Supporting materials available online at http://www.brainrules.net)\n“Memories Become Labile Whenever They Are Retrieved.” Human Frontier Science Program Web site\nLuc Reid writes extensively on the psychology and neuroscience of self-motivation at www.willpowerengine.com. He is a Writers of the Future winner and author of Talk the Talk: The Slang of 65 American Subcultures (Writer's Digest Books, 2006). His fiction appears regularly on The Daily Cabal and has also seen print in Abyss & Apex, Brain Harvest, and elsewhere. He runs the online, spec-fic neopro writers' group Codex and is a former radio commentator for Jacksonville, Florida NPR affiliate WJCT. Luc lives on a hillside in Vermont with his son and a menagerie of musical instruments.", "source": "https://clarkesworldmagazine.com/reid_03_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Future Brains: Neuroscience Fiction versus Neuroscience Fantasy by Luc Reid"}