{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Berrien C Henderson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "T+/972JZ1M4EZ/vTXKQyOufe768=", "id": null, "license": null, "comments": "", "raw_text": "1660 words, short story  The Jisei of Mark VIII  Sss-uuunnn. Cha-kit. Sss-uuunnn. Cha-kit.  These were the most consistent sounds Mark Edward VIII had heard each day for the past thirteen years and five months of Sophia Loggia’s declining days. The dampened noises of his own servos provided counterpoint to the deliberate tedium of each day.  Sss-uuunnn. Cha-kit. Sss-uuunnn. Cha-kit.  They might come to him through the wireless pings of the house’s com-system or via the audiBELL embedded in his synthetic cortex or in the stale yet otherwise antiseptic air of Madame’s upstairs bedroom. Companions, though quite unwelcome.  6:40 p.m.  He read the blinking notice on a free-floating screen, some phantom display ghosting through the air.  Mark VIII, upon expiration of primary employer, return to Clockwork Corp. home office for de-servicing, upgrade, and re-assignment per Section 912.579, Directive 31518.  He pressed the air and disrupted the holographic waves, and the notice dissipated. He shook his gleaming mimetic alloy head. All Mark VIII models came with loyalty A-Life programming, just the thing for a proper butler (or botler in the argot of the consumer) or an eldercare bot, yet that same programming had to be de-commissioned for that selfsame model to be perpetually useful. So, loyalty was for terms of service, and those ended.  Marcus went to a bookshelf. Madame Sophia had always insisted, even when her arms wouldn’t work right, that a good dead-tree book, dense though it was with information, was worth all the digitization in the world. He even admired the precision grandfather clock in the foyer; he had to wind it ever so often, and its Old English script on that old analogue face reminded him of the clockwork mechanical past—the golden age of the nineteenth century. Halcyon years, some might say. Madame Sophia even had the most antique of entertainment systems—an old-style stereophonic system complete with record turntable, fully serviceable for the collection of vinyl records she had amassed before her waning years caught up to her. The machine even contained a transistor radio, but that only crackled in obtuse protest of its own impotence.  But, again, they always had the bookshelves.  “There will always be time for books and music and such,” came her words. “Do understand and humor an old woman, won’t you, Marcus?” His mimetics conformed to his A-Life mood—a silvered smile, though bittersweet, cut itself in the alloy.  Marcus. Not Mark. Not VIII.  Just Marcus.  The first book she’d asked him to read her was Meditations of Marcus Aurelius.  6:58 p.m.  He found the book he needed to read to her, that he thought she might have enjoyed.  He dreaded the idea of leaving; there had been thirteen good years with Sophia Loggia. These last several months, though, had challenged his programming to say the least. All his memories would be wiped in a trice. All combinations of 0’s and 1’s that became them—became him—would drizzle to naught.  A soft, whining alarm went off, and Marcus hurried into the bedroom. His pistons and actuators whispered urgency with his strides. The alarm faded. He surveyed the computer array keeping Sophia Loggia alive: nothing but flat lines and any of a dozen redundant warning chimes.  He placed a gloved titanium hand on her shoulder, then smoothed back her hair (all original, even at 129 years old).  7:12 p.m.  In eighteen minutes, the paramedics would arrive to confirm her death. Around that same time, a pair of human Clockwork Corp. handlers would come.  Damn them, thought the robot.  “I am sorry I do not have anything witty or sentimental to say,” said Marcus, indulging himself an extrapolation. Do humans experience beyond death as suggested by many of the religious tomes he‘d read and researched? Like another operating system upgrade? An opportunity for a patch?  “Thank you for this opportunity to serve.” He had been serving her and reading to her for these past months even when she was too far gone to know another presence other than the shadowy one slithering closer each passing day.  He went to the entertainment holo-grid and reached out to begin a spot of music, then shook his head. He instead went to the stereophonic system and fwip-fwip-fwipped through the record albums until he found the one he desired and shucked it ever-so-gently from its sleeve. Record to hub. Needle to record. Flip ON. The turntable spun and noise scritchle-scratchled from the speakers for a few seconds until the strains of Moonlight Sonata began playing as he went to the bathroom and studied his smooth alloy face, the mimetics making him appear appropriately sad although that wasn’t quite right, was it? There was sad, yet there was a sense of no longer.  Off came the gloves. He wiggled the cleanly articulated fingers, ran them over the antique marble lavatory countertop. His tactile input stream coded “smooth” and “imported” and then metalinked through associative content tags “Italy” and “custom-ordered” and “dense.” Mark VIII went out, came back in, and placed a thin, clothbound hardcover book on the edge of the countertop. He traced his fingerpads over the cover and whispered, “Tsunetomo Yamamoto.”  7:22 p.m.  He entered a code in the blue-lit strip on the wall near the linen closet. Now water poured into the tub, just in time for one last bath. He methodically unplugged all wires and removed all tubes from the Sophia’s corpse back in the master bedroom. There were tugs and wet sounds as though the body refused to surrender these accoutrements of medically assisted living and hospice—of the once-living.  Marcus picked up Sophia’s body.  Promptly at 7:30 p.m., Ms. Sophia always had a bath up until her frailty made it no longer feasible.  It was 7:24 p.m.  He still had time before the paramedics came. And the handlers.  He disabled the auto-assist medi-tentacles in their wall sockets. Gleaming cool fluorescent light belayed a soft halo effect to the crown of his head. His servos whined and sssshhhhed under the added weight. Already the Madame’s clothes, robes, slippers, towel, washcloth, and soap stood watch by a platter-sized goferit bot. It looked up at Marcus with its dumb, ovoid, blank face as it skittered forward on thin, insectile legs, then back-crawled like a crab and scuttled into a far corner to observe.  7:26 p.m.  The fount of hot water, steaming as it rippled halfway up the inside of the tub, turned off automatically. He had never actually washed her; he could and couldn’t. His model came specific for inside purposes, basic service functions sans limited exposure to water. That’s what the goferit bots and medi-tentacles were for, not botler models. Surely not a Model Mark VIII.  Sophia had never felt heavy until now the life was gone.  They would come, yes. Come for him after the paramedics came to confirm death. They would arrive and take all good things she had shown him, and within seconds his synthetic cortex ripped through entire libraries and museums and theaters—linking and associating and superimposing. Hyperimposing beyond anything he’d ever allowed himself to do. A fugue state. Wanderlust knowledge for Clockwork Corp. Model Mark VIII Eldercare Robot.  Tennyson . . . In Memoriam  Manet . . . Olympia  Monet . . . Argenteuil  Moonlight Sonata . . . Beethoven  Homer . . . “Sing in me, O Muse, the anger of Achilles . . . ”  Upanishads . . . OM  Musashi Miyamoto . . . Book of Five Rings  Rembrandt . . . contrast  Vitruvian Man . . . da Vinci notebook hidden away upon Bill Gates’s death  Rosetta Stone . . . Linear A  Analects of Confucius  Gilgamesh  The Renaissance canon  The Old Man and the Sea  Mayan calendar  Hagakure  All. All. All in that meta-Alexandrian library of his memory. Thousands of years in seconds down quantum hallways and Heisenberg shelves.  He got in the tub. He lowered himself and her waif-like corpse. Although he had no tactile sense of temperature per se, his shell knew it was a pleasing 44 C, just as Madame Sophia always had requested.  7:28 p.m.  He switched off A-Life schema warning him of his circuits’ being inundated. He reached over and took the washcloth, dipped it, daubed Sophia’s forehead, cheeks, chin.  The goferit bot tic-tic-ticked to the edge of the tub and twittered.  “Yes. I am well aware. Thank you for reminding me,” said Marcus.  7:30 p.m.  His decentralized servos and actuators began a cascade of failures up to his waist. He did not remember any of the other contracts he’d helped fulfill; not after a handful of services’ worth of decommissions. He would never know. That bothered him. He would never remember, but Sophia Loggia had shown him more of humanity with her arts and conversation (while she still could) than thousands upon thousands of downloads could have accomplished. It was her lifetime. Her life. A life.  And they would not take it from him.  A door opened. Startled human faces. “What in the world are you doing? Stand down!”  Marcus said, “Just read it.” He pointed to the book perched on the edge of the marble lavatory and forced a plasticene smile.  With Madame Sophia arched across his legs, he simply took his arms and eased himself down the slope of the tub, helped his own dense body succumb to the water. Ozone crackles and wisps of electric smoke found Marcus.  “Model Mark VIII, stop! You’re ruining your—”  Yes, he thought, the ruin of it all, as basic input programming stalled and faltered, then the internal imaging, until at last he saw only a thin line of 0’s and 1’s and began composing it before utter system decay ate him like technorganic cancer.  Such a thin . . .  . . . ruin . . .  FOCUS—Just this last . . .   The westering sun  My eyes blinded Only this tiny shadow of bird or angel Yet only this: hidden by the leaves That seesaw earthward— Stray thoughts in the caress Of autumn’s whisper. 01000101 01010010 01010010 01001111 01010010 Berrien C. Henderson lives in the deepest, darkest wilds of southeast Georgia. He teaches high school Literature and Composition with a Southern accent. Berrien's writing has appeared in such diverse venues as The Journal of Asian Martial Arts, The Doctor T.J. Eckleburg Review, The Dead Mule School of Southern literature, Abyss & Apex, Kaleidotrope, and Bloody Knuckles: The MMAnthology. His mini-collection of Southern magical realism, Old Souls and the Grammar of Their Wanderings, is available from Papaveria Press. He is a fiction editor at Farrago's Wainscot. In his not-so-copious free time, Berrien practices martial arts.", "text": "1660 words, short story\nThe Jisei of Mark VIII\nSss-uuunnn. Cha-kit. Sss-uuunnn. Cha-kit.\nThese were the most consistent sounds Mark Edward VIII had heard each day for the past thirteen years and five months of Sophia Loggia’s declining days. The dampened noises of his own servos provided counterpoint to the deliberate tedium of each day.\nSss-uuunnn. Cha-kit. Sss-uuunnn. Cha-kit.\nThey might come to him through the wireless pings of the house’s com-system or via the audiBELL embedded in his synthetic cortex or in the stale yet otherwise antiseptic air of Madame’s upstairs bedroom. Companions, though quite unwelcome.\n6:40 p.m.\nHe read the blinking notice on a free-floating screen, some phantom display ghosting through the air.\nMark VIII, upon expiration of primary employer, return to Clockwork Corp. home office for de-servicing, upgrade, and re-assignment per Section 912.579, Directive 31518.\nHe pressed the air and disrupted the holographic waves, and the notice dissipated. He shook his gleaming mimetic alloy head. All Mark VIII models came with loyalty A-Life programming, just the thing for a proper butler (or botler in the argot of the consumer) or an eldercare bot, yet that same programming had to be de-commissioned for that selfsame model to be perpetually useful. So, loyalty was for terms of service, and those ended.\nMarcus went to a bookshelf. Madame Sophia had always insisted, even when her arms wouldn’t work right, that a good dead-tree book, dense though it was with information, was worth all the digitization in the world. He even admired the precision grandfather clock in the foyer; he had to wind it ever so often, and its Old English script on that old analogue face reminded him of the clockwork mechanical past—the golden age of the nineteenth century. Halcyon years, some might say. Madame Sophia even had the most antique of entertainment systems—an old-style stereophonic system complete with record turntable, fully serviceable for the collection of vinyl records she had amassed before her waning years caught up to her. The machine even contained a transistor radio, but that only crackled in obtuse protest of its own impotence.\nBut, again, they always had the bookshelves.\n“There will always be time for books and music and such,” came her words. “Do understand and humor an old woman, won’t you, Marcus?” His mimetics conformed to his A-Life mood—a silvered smile, though bittersweet, cut itself in the alloy.\nMarcus. Not Mark. Not VIII.\nJust Marcus.\nThe first book she’d asked him to read her was Meditations of Marcus Aurelius.\n6:58 p.m.\nHe found the book he needed to read to her, that he thought she might have enjoyed.\nHe dreaded the idea of leaving; there had been thirteen good years with Sophia Loggia. These last several months, though, had challenged his programming to say the least. All his memories would be wiped in a trice. All combinations of 0’s and 1’s that became them—became him—would drizzle to naught.\nA soft, whining alarm went off, and Marcus hurried into the bedroom. His pistons and actuators whispered urgency with his strides. The alarm faded. He surveyed the computer array keeping Sophia Loggia alive: nothing but flat lines and any of a dozen redundant warning chimes.\nHe placed a gloved titanium hand on her shoulder, then smoothed back her hair (all original, even at 129 years old).\n7:12 p.m.\nIn eighteen minutes, the paramedics would arrive to confirm her death. Around that same time, a pair of human Clockwork Corp. handlers would come.\nDamn them, thought the robot.\n“I am sorry I do not have anything witty or sentimental to say,” said Marcus, indulging himself an extrapolation. Do humans experience beyond death as suggested by many of the religious tomes he‘d read and researched? Like another operating system upgrade? An opportunity for a patch?\n“Thank you for this opportunity to serve.” He had been serving her and reading to her for these past months even when she was too far gone to know another presence other than the shadowy one slithering closer each passing day.\nHe went to the entertainment holo-grid and reached out to begin a spot of music, then shook his head. He instead went to the stereophonic system and fwip-fwip-fwipped through the record albums until he found the one he desired and shucked it ever-so-gently from its sleeve. Record to hub. Needle to record. Flip ON. The turntable spun and noise scritchle-scratchled from the speakers for a few seconds until the strains of Moonlight Sonata began playing as he went to the bathroom and studied his smooth alloy face, the mimetics making him appear appropriately sad although that wasn’t quite right, was it? There was sad, yet there was a sense of no longer.\nOff came the gloves. He wiggled the cleanly articulated fingers, ran them over the antique marble lavatory countertop. His tactile input stream coded “smooth” and “imported” and then metalinked through associative content tags “Italy” and “custom-ordered” and “dense.” Mark VIII went out, came back in, and placed a thin, clothbound hardcover book on the edge of the countertop. He traced his fingerpads over the cover and whispered, “Tsunetomo Yamamoto.”\n7:22 p.m.\nHe entered a code in the blue-lit strip on the wall near the linen closet. Now water poured into the tub, just in time for one last bath. He methodically unplugged all wires and removed all tubes from the Sophia’s corpse back in the master bedroom. There were tugs and wet sounds as though the body refused to surrender these accoutrements of medically assisted living and hospice—of the once-living.\nMarcus picked up Sophia’s body.\nPromptly at 7:30 p.m., Ms. Sophia always had a bath up until her frailty made it no longer feasible.\nIt was 7:24 p.m.\nHe still had time before the paramedics came. And the handlers.\nHe disabled the auto-assist medi-tentacles in their wall sockets. Gleaming cool fluorescent light belayed a soft halo effect to the crown of his head. His servos whined and sssshhhhed under the added weight. Already the Madame’s clothes, robes, slippers, towel, washcloth, and soap stood watch by a platter-sized goferit bot. It looked up at Marcus with its dumb, ovoid, blank face as it skittered forward on thin, insectile legs, then back-crawled like a crab and scuttled into a far corner to observe.\n7:26 p.m.\nThe fount of hot water, steaming as it rippled halfway up the inside of the tub, turned off automatically. He had never actually washed her; he could and couldn’t. His model came specific for inside purposes, basic service functions sans limited exposure to water. That’s what the goferit bots and medi-tentacles were for, not botler models. Surely not a Model Mark VIII.\nSophia had never felt heavy until now the life was gone.\nThey would come, yes. Come for him after the paramedics came to confirm death. They would arrive and take all good things she had shown him, and within seconds his synthetic cortex ripped through entire libraries and museums and theaters—linking and associating and superimposing. Hyperimposing beyond anything he’d ever allowed himself to do. A fugue state. Wanderlust knowledge for Clockwork Corp. Model Mark VIII Eldercare Robot.\nTennyson . . . In Memoriam\nManet . . . Olympia\nMonet . . . Argenteuil\nMoonlight Sonata . . . Beethoven\nHomer . . . “Sing in me, O Muse, the anger of Achilles . . . ”\nUpanishads . . . OM\nMusashi Miyamoto . . . Book of Five Rings\nRembrandt . . . contrast\nVitruvian Man . . . da Vinci notebook hidden away upon Bill Gates’s death\nRosetta Stone . . . Linear A\nAnalects of Confucius\nGilgamesh\nThe Renaissance canon\nThe Old Man and the Sea\nMayan calendar\nHagakure\nAll. All. All in that meta-Alexandrian library of his memory. Thousands of years in seconds down quantum hallways and Heisenberg shelves.\nHe got in the tub. He lowered himself and her waif-like corpse. Although he had no tactile sense of temperature per se, his shell knew it was a pleasing 44 C, just as Madame Sophia always had requested.\n7:28 p.m.\nHe switched off A-Life schema warning him of his circuits’ being inundated. He reached over and took the washcloth, dipped it, daubed Sophia’s forehead, cheeks, chin.\nThe goferit bot tic-tic-ticked to the edge of the tub and twittered.\n“Yes. I am well aware. Thank you for reminding me,” said Marcus.\n7:30 p.m.\nHis decentralized servos and actuators began a cascade of failures up to his waist. He did not remember any of the other contracts he’d helped fulfill; not after a handful of services’ worth of decommissions. He would never know. That bothered him. He would never remember, but Sophia Loggia had shown him more of humanity with her arts and conversation (while she still could) than thousands upon thousands of downloads could have accomplished. It was her lifetime. Her life. A life.\nAnd they would not take it from him.\nA door opened. Startled human faces. “What in the world are you doing? Stand down!”\nMarcus said, “Just read it.” He pointed to the book perched on the edge of the marble lavatory and forced a plasticene smile.\nWith Madame Sophia arched across his legs, he simply took his arms and eased himself down the slope of the tub, helped his own dense body succumb to the water. Ozone crackles and wisps of electric smoke found Marcus.\n“Model Mark VIII, stop! You’re ruining your—”\nYes, he thought, the ruin of it all, as basic input programming stalled and faltered, then the internal imaging, until at last he saw only a thin line of 0’s and 1’s and began composing it before utter system decay ate him like technorganic cancer.\nSuch a thin . . .\n. . . ruin . . .\nFOCUS—Just this last . . .\nThe westering sun\nMy eyes blinded\nOnly this tiny shadow of bird or angel\nYet only this: hidden by the leaves\nThat seesaw earthward—\nStray thoughts in the caress\nOf autumn’s whisper.\n01000101 01010010 01010010 01001111 01010010\nBerrien C. Henderson lives in the deepest, darkest wilds of southeast Georgia. He teaches high school Literature and Composition with a Southern accent. Berrien's writing has appeared in such diverse venues as The Journal of Asian Martial Arts, The Doctor T.J. Eckleburg Review, The Dead Mule School of Southern literature, Abyss & Apex, Kaleidotrope, and Bloody Knuckles: The MMAnthology. His mini-collection of Southern magical realism, Old Souls and the Grammar of Their Wanderings, is available from Papaveria Press. He is a fiction editor at Farrago's Wainscot. In his not-so-copious free time, Berrien practices martial arts.", "source": "https://clarkesworldmagazine.com/henderson_02_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Jisei of Mark VIII by Berrien C. Henderson"}