{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeff VanderMeer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "A9Xqg6I+6e9MT6OVkKjrlEdyEDk=", "id": null, "license": null, "comments": "", "raw_text": "6600 words, short story  The Third Bear  2007 Shirley Jackson Award Nominee 2007 WSFA Small Press Award Nominee It made its home in the deep forest near the village of Grommin, and all anyone ever saw of it, before the end, would be hard eyes and the dark barrel of its muzzle. The smell of piss and blood and shit and bubbles of saliva and half-eaten food. The villagers called it the Third Bear because they had killed two bears already that year. But, near the end, no one really thought of it as a bear, even though the name had stuck, changed by repetition and fear and slurring through blood-filled mouths to Theeber. Sometimes it even sounded like “seether” or “seabird.”  The Third Bear came to the forest in mid-summer, and soon most anyone who used the forest trail, day or night, disappeared, carried off to the creature’s lair. By the time even large convoys had traveled through, they would discover two or three of their number missing. A straggling horseman, his mount cantering along, just bloodstains and bits of skin sticking to the saddle. A cobbler gone but for a shredded, bloodied hat. A few of the richest villagers hired mercenaries as guards, but when even the strongest men died, silent and alone, the convoys dried up.  The village elder, a man named Horley, held a meeting to decide what to do. It was the end of summer by then. The meeting house had a chill to it, a stench of thick earth with a trace of blood and sweat curling through it. All five hundred villagers came to the meeting, from the few remaining merchants to the poorest beggar. Grommin had always been hard scrabble and tough winters, but it was also two hundred years old. It had survived the wars of barons and of kings, been razed twice, only to return.  “I can’t bring my goods to market,” one farmer said, rising in shadow from beneath the thatch. “I can’t be sure I want to send my daughter to the pen to milk the goats.”  Horley laughed, said, “It’s worse than that. We can’t bring in food from the other side. Not for sure. Not without losing men.”  Horley had a sudden vision from months ahead, of winter, of ice gravelly with frozen blood. It made him shudder.  “What about those of us who live outside the village?” another farmer asked. “We need the pasture for grazing, but we have no protection.”  Horley understood the problem; he had been one of those farmers, once. The village had a wall of thick logs surrounding it, to a height of ten feet. No real defense against an army, but more than enough to keep the wolves out. Beyond that perimeter lived the farmers and the hunters and the outcasts who could not work among others.  “You may have to pretend it is a time of war and live in the village and go out with a guard,” Horley said. “We have plenty of able-bodied men, still.”  “Is it the witch woman doing this?” Clem the blacksmith asked.  “No,” Horley said. “I don’t think it’s the witch woman.”  What Clem and some of the others thought of as a “witch woman,” Horley thought of as a crazy person who knew some herbal remedies and lived in the woods because the villagers had driven her there, blaming her for an outbreak of sickness the year before.  “Why did it come?” a woman asked. “Why us?”  No one could answer, least of all Horley. As Horley stared at all of those hopeful, scared, troubled faces, he realized that not all of them yet knew they were stuck in a nightmare.  Clem was the village’s strongest man, and after the meeting he volunteered to fight the beast. He had arms like most people’s thighs. His skin was tough from years of being exposed to flame. With his full black beard he almost looked like a bear himself.  “I’ll go, and I’ll go willingly,” he told Horley. “I’ve not met the beast I couldn’t best. I’ll squeeze the ‘a’ out of him.” And he laughed, for he had a passable sense of humor, although most chose to ignore it.  Horley looked into Clem’s eyes and could not see even a speck of fear there. This worried Horley.  “Be careful, Clem,” Horley said. And, in a whisper, as he hugged the man: “Instruct your son in anything he might need to know, before you leave. Make sure your wife has what she needs, too.”  Fitted in chain mail, leathers, and a metal helmet, carrying an old sword some knight had once left in Grommin by mistake, Clem set forth in search of the Third Bear. The entire village came out to see him go. Clem was laughing and raising his sword and this lifted the spirits of those who saw him. Soon, everyone was celebrating as if the Third Bear had already been killed or defeated.  “Fools,” Horley’s wife Rebecca said as they watched the celebration with their two young sons.  Rebecca was younger than Horley by ten years and had come from a village far beyond the forest. Horley’s first wife had died from a sickness that left red marks all over her body.  “Perhaps, but it’s the happiest anyone’s been for a month,” Horley said. “Let them have these moments.”  “All I can think of is that he’s taking one of our best horses out into danger,” Rebecca said.  “Would you rather he took a nag?” Horley said, but absent-mindedly. His thoughts were elsewhere.  The vision of winter would not leave him. Each time, it came back to Horley with greater strength, until he had trouble seeing the summer all around him.  Clem left the path almost immediately, wandered through the underbrush to the heart of the forest, where the trees grew so black and thick that the only glimmer of light came from the reflection of water on leaves. The smell in that place carried a hint of offal.  Clem had spent so much time beating things into shape that he had not developed a sense of fear, for he had never been beaten. But the smell in his nostrils did make him uneasy.  He wandered for some time in the deep growth, where the soft loam of moss muffled the sound of his passage. It became difficult to judge direction and distance. The unease became a knot in his chest as he clutched his sword ever tighter. He had killed many bears in his time, this was true, but he had never had to hunt a man-eater.  Eventually, in his circling, meandering trek, Clem came upon a hill with a cave inside. From within the cave, a green flame flickered. It beckoned like a lithe but crooked finger.  A lesser man might have turned back, but not Clem. He didn’t have the sense to turn back.  Inside the cave, he found the Third Bear. Behind the Third Bear, arranged around the walls of the cave, it had displayed the heads of its victims. The heads had been painstakingly painted and mounted on stands. They were all in v arious stages of rot.  Many bodies lay stacked neatly in the back of the cave. All of them had been defiled in some way. Some of them had been mutilated. The wavery green light came from a candle the Third Bear had placed behind the bodies, to display its handiwork. The smell of blood was so thick that Clem had to put a hand over his mouth.  As Clem took it all in, the methodical nature of it, the fact that the Third Bear had not eaten any of its victims, he found something inside of him te aring and then breaking.  “I . . . ,” he said, and looked into the terrible eyes of the Third Bear. “I . . . ”  Almost sadly, with a kind of ritual grace, the Third Bear pried Clem’s sword from his fist, placed the weapon on a ledge, and then came back to stare at Clem once more.  Clem stood there, frozen, as the Third Bear disemboweled him.  The next day, Clem was found at the edge of the village, blood soaked and shit-spattered, legs gnawed away, but alive enough for awhile to, in shuddering lurches, tell those who found him what he had seen, just not coherent enough to tell them where.  Later, Horley would wish that he hadn’t told them anything.  There was nothing left but fear in Clem’s eyes by the time Horley questioned him. Horley didn’t remember any of Clem’s answers, had to be retold them later. He was trying to reconcile himself to looking down to stare into Clem’s eyes.  “I’m cold, Horley,” Clem said. “I can’t feel anything. Is winter coming?”  “Should we bring his wife and son?” the farmer who had found Clem asked Horley at one point.  Horley just stared at him, aghast.  They buried Clem in the old graveyard, but the next week the Third Bear dug him up and stole his head. Apparently, the Third Bear had no use for heroes, except, possibly, as a pattern of heads.  Horley tried to keep the grave robbery and what Clem had said a secret, but it leaked out anyway. By the time most villagers of Grommin learned about it, the details had become more monstrous than anything in real life. Some said Clem had been kept alive for a week in the bear’s lair, while it ate away at him. Others said Clem had had his spine ripped out of his body while he was still breathing. A few even said Clem had been buried alive by mistake and the Third Bear had heard him writhing in the dirt and come for him.  But one thing Horley knew that trumped every tall tale spreading through Grommin: the Third Bear hadn’t had to keep Clem alive. Theeber hadn’t had to place Clem, still breathing, at the edge of the village.  So Seether wasn’t just a bear.  In the next week, four more people were killed, one on the outskirts of the village. Several villagers had risked leaving, and some of them had even made it through. But fear kept most of them in Grommin, locked into a kind of desperate fatalism or optimism that made their eyes hollow as they stared into some unknowable distance. Horley did his best to keep morale up, but even he experienced a sense of sinking.  “Is there more I can do?” he asked his wife in bed at night.  “Nothing,” she said. “You are doing everything you can do.”  “Should we just leave?”  “Where would we go? What would we do?”  Few who left ever returned with stories of success, it was true. There was war and plague and a thousand more dangers out there beyond the forest. They’d as likely become slaves or servants or simply die, one by one, out in the wider world.  Eventually, though, Horley sent a messenger to that wider world, to a far-distant baron to whom they paid fealty and a yearly amount of goods.  The messenger never came back. Nor did the baron send any men. Horley spent many nights awake, wondering if the messenger had gotten through and the baron just didn’t care, or if Seether had killed the messenger.  “Maybe winter will bring good news,” Rebecca said.  Over time, Grommin sent four or five of its strongest and most clever men and women to fight the Third Bear. Horley objected to this waste, but the villagers insisted that something must be done before winter, and those who went were unable to grasp the terrible velocity of the situation. For Horley, it seemed merely a form of taking one’s own life, but his objections were overruled by the majority.  They never learned what happened to these people, but Horley saw them in his nightmares.  One, before the end, said to the Third Bear, “If you could see the children in the village, you would stop.”  Another said, before fear clotted her windpipe, “We will give you all the food you need.”  A third, even as he watched his intestines slide out of his body, said, “Surely there is something we can do to appease you?”  In Horley’s dreams, the Third Bear said nothing. Its conversation was through its work, and Seether said what it wanted to say very eloquently in that regard.  By now, fall had descended on Grommin. The wind had become unpredictable and the leaves of trees had begun to yellow. A far-off burning smell laced the air. The farmers had begun to prepare for winter, laying in hay and slaughtering and smoking hogs and goats. Horley became more involved in these preparations than usual, driven by his vision of the coming winter. People noted the haste, the urgency, so unnatural in Horley, and to his dismay it sometimes made them panic rather than work harder.  With his wife’s help, Horley convinced the farmers to contribute to a communal smoke house in the village. Ham, sausage, dried vegetables, onions, potatoes—they stored it all in Grommin now. Most of the outlying farmers realized that their future depended on the survival of the village.  Sometimes, when they opened the gates to let in another farmer and his mule-drawn cart of supplies, Horley would walk out a ways and stare into the forest. It seemed more unknowable than ever, gaunt and dark, as if diminished by the change of seasons.  Somewhere out there the Third Bear waited for them.  One day, the crisp cold of coming winter a lingering promise, Horley and several of the men from Grommin went looking for a farmer who had not come to the village for a month. The farmer’s name was John and he had a wife, five children, and three men who worked for him. John’s holdings were the largest outside the village, but he had been suffering because he could not bring his extra goods to market.  The farm was a half-hour’s walk from Grommin. The whole way, Horley could feel a hurt in his chest, a kind of stab of premonition. Those with him held pitchforks and hammers and old spears, much of it as rust-colored as the leaves now strewn across the path.  They could smell the disaster before they saw it. It coated the air like oil.  On the outskirts of John’s farm, they found three mule-pulled carts laden with food and supplies. Horley had never seen so much blood. It had pooled and thickened to cover a spreading area several feet in every direction. The mules had had their throats torn out and then they had been disemboweled. Their organs had been torn out and thrown onto the ground, as if Seether had been searching for something. Their eyes had been plucked from their sockets almost as an afterthought.  John—they thought it was John—sat in the front of the lead cart. The wheels of the cart were greased with blood. The head was missing, as was much of the meat from the body cavity. The hands still held the reins. The same was true for the other two carts. Three dead men holding reins to dead mules. Two dead men in the back of the carts. All five missing their heads. All five eviscerated.  One of Horley’s protectors vomited into the grass. Another began to weep. “Jesus save us,” a third man said, and kept saying it for many hours.  Horley found himself curiously unmoved. His hand and heart were steady.  He noted the brutal humor that had moved the Third Bear to carefully replace the reins in the men’s hands. He noted the wild, savage abandon that had preceded that action. He noted, grimly, that most of the supplies in the carts had been ruined by the wealth of blood that covered them. But, for the most part, the idea of winter had so captured him that whatever came to him moment-by-moment could not compare to the crystalline nightmare of that interior vision.  Horley wondered if his was a form of madness as well.  “This is not the worst,” he said to his men. “Not by far.”  At the farm itself, they found the rest of the men and what was left of John’s wife, but that is not what Horley had meant.  At this point, Horley felt he should go himself to find the Third Bear. It wasn’t bravery that made him put on the leather jerkin and the metal shin guards. It wasn’t from any sense of hope that he picked up the spear and put Clem’s helmet on his head.  His wife found him there, ready to walk out the door of their home.  “You wouldn’t come back,” she told him.  “Better,” he said. “Still.”  “You’re more important to us alive. Stronger men than you have tried to kill it.”  “I must do something,” Horley said. “Winter will be here soon and things will get worse.”  “Then do something,” Rebecca said, taking the spear from his hand. “But do something else.”  The villagers of Grommin met the next day. There was less talking this time. As Horley looked out over them, he thought some of them seemed resigned, almost as if the Third Bear were a plague or some other force that could not be controlled or stopped by the hand of Man. In the days that followed, there would be a frenzy of action: traps set, torches lit, poisoned meat left in the forest, but none of it came to anything.  One old woman kept muttering about fate and the will of God.  “John was a good man,” Horley told them. “He did not deserve his death. But I was there—I saw his wounds. He died from an animal attack. It may be a clever animal. It may be very clever. But it is still an animal. We should not fear it the way we fear it.” Horley said this, even though he did not believe it.  “You should consult with the witch in the woods,” Clem’s son said.  Clem’s son was a huge man of twenty years, and his word held weight, given the bravery of his father. Several people began to nod in agreement.  “Yes,” said one. “Go to the witch. She might know what to do.”  The witch in the woods is just a poor, addled woman, Horley thought, but could not say it.  “Just two months ago,” Horley reminded them, “you were saying she might have made this happen.”  “And if so, what of it? If she caused it, she can undo it. If not, perhaps she can help us.”  This from one of the farmers displaced from outside the walls. Word of John’s fate had spread quickly, and less than a handful of the bravest or most foolhardy had kept to their farms.  Rancor spread amongst the gathered villagers. Some wanted to take a party of men out to the witch, wherever she might live, and kill her. Others thought this folly—what if the Third Bear found them first?  Finally, Horley raised his hands to silence them.  “Enough! If you want me to go to the witch in the woods, I will go to her.”  The relief on their faces, as he looked out at them—the relief that it was he who would take the risk and not them—it was like a balm that cleansed their worries, if only for the moment. Some fools were even smiling.  Later, Horley lay in bed with his wife. He held her tight, taking comfort in the warmth of her body.  “What can I do? What can I do, Rebecca? I’m scared.”  “I know. I know you are. Do you think I’m not scared as well? But neither of us can show it or they will panic, and once they panic, Grommin is lost.”  “But what do I do?”  “Go see the witch woman, my love. If you go to her, it will make them calmer. And you can tell them whatever you like about what she says.”  “If the Third Bear doesn’t kill me before I can find her.”  If she isn’t already dead.  In the deep woods, in a silence so profound that the ringing in his ears had become the roar of a river, Horley looked for the witch woman. He knew that she had been exiled to the southern part of the forest, and so he had started there and worked his way toward the center. What he was looking for, he did not know. A cottage? A tent? What he would do when he found her, Horley didn’t know either. His spear, his incomplete armor—these things would not protect him if she truly was a witch.  He tried to keep the vision of the terrible winter in his head as he walked, because concentrating on that more distant fear removed the current fear.  “If not for me, the Third Bear might not be here,” Horley had said to Rebecca before he left. It was Horley who had stopped them from burning the witch, had insisted only on exile.  “That’s nonsense,” Rebecca had replied. “Remember that she’s just an old woman, living in the woods. Remember that she can do you no real harm.”  It had been as if she’d read his thoughts. But now, breathing in the thick air of the forest, Horley felt less sure about the witch woman. It was true there had been sickness in the village until they had cast her out.  Horley tried to focus on the spring of loam beneath his boots, the clean, dark smell of bark and earth and air. After a time, he crossed a dirt-choked stream. As if this served as a dividing line, the forest became yet darker. The sounds of wrens and finches died away. Above, he could see the distant dark shapes of hawks in the treetops, and patches of light shining down that almost looked more like bog or marsh water, so disoriented had he become.  It was in this deep forest, that he found a door.  Horley had stopped to catch his breath after cresting a slight incline. Hands on his thighs, he looked up and there it stood: a door. In the middle of the forest. It was made of old oak and overgrown with moss and mushrooms, and yet it seemed to flicker like glass. A kind of light or brightness hurtled through the ground, through the dead leaves and worms and beetles, around the door. It was a subtle thing, and Horley half thought he was imagining it at first.  He straightened up, grip tightening on his spear.  The door stood by itself. Nothing human-made surrounded it, not even the slightest ruin of a wall.  Horley walked closer. The knob was made of brass or some other yellowing metal. He walked around the door. It stood firmly wedged into the ground. The back of the door was the same as the front.  Horley knew that if this was the entrance to the old woman’s home, then she was indeed a witch. His hand remained steady, but his heart quickened and he thought furiously of winter, of icicles and bitter cold and snow falling slowly forever.  For several minutes, he circled the door, deciding what to do. For a minute more, he stood in front of the door, pondering.  A door always needs opening, he thought, finally.  He grasped the knob, and pushed—and the door opened.  Some events have their own sense of time and their own logic. Horley knew this just from the change of seasons every year. He knew this from the growing of the crops and the birthing of children. He knew it from the forest itself, and the cycles it went through that often seemed incomprehensible and yet had their own pattern, their own calendar. From the first thawed trickle of stream water in the spring to the last hopping frog in the fall, the world held a thousand mysteries. No man could hope to know the truth of them all.  When the door opened and he stood in a room very much like the room one might find in a woodman’s cottage, with a fireplace and a rug and a shelf and pots and pans on the wood walls, and a rocking chair—when this happened, Horley decided in the time it took him to blink twice that he had no need for the why of it or the how of it, even. And this was, he realized later, the only reason he kept his wits about him.  The witch woman sat in the rocking chair. She looked older than Horley remembered, as if much more than a year had passed since he had last seen her. Seeming made of ash and soot, her black dress lay flat against her sagging skin. She was blind, eye sockets bare, but her wrinkled face strained to look at him anyway.  There was a buzzing sound.  “I remember you,” she said. Her voice was croak and whisper both.  Her arms were mottled with age spots, her hands so thin and cruel-looking that they could have been talons. She gripped the arms of the rocking chair as if holding onto the world.  There was a buzzing sound. It came, Horley finally realized, from a halo of black hornets that circled the old woman’s head, their wings beating so fast they could hardly be seen.  “Are you Hasghat, who used to live in Grommin?” Horley asked.  “I remember you,” the witch woman said again.  “I am the elder of the village of Grommin.”  The woman spat to the side. “Those that threw poor Hasghat out.”  “They would have done much worse if I’d let them.”  “They’d have burned me if they could. And all I knew then were a few charms, a few herbs. Just because I wasn’t one of them. Just because I’d seen a bit of the world.”  Hasghat was staring right at him and Horley knew that, eyes or no eyes, she could see him.  “It was wrong,” Horley said.  “It was wrong,” she said. “I had nothing to do with the sickness. Sickness comes from animals, from people’s clothes. It clings to them and spreads through them.”  “And yet you are a witch?”  Hasghat laughed, although it ended with coughing. “Because I have a hidden room? Because my door stands by itself?”  Horley grew impatient.  “Would you help us if you could? Would you help us if we let you return to the village?”  Hasghat straightened up in the chair and the halo of hornets disintegrated, then reformed. The wood in the fireplace popped and crackled. Horley felt a chill in the air.  “Help you? Return to the village?” She spoke as if chewing, her tongue a fat gray grub.  “A creature is attacking and killing us.”  Hasghat laughed. When she laughed, Horley could see a strange double image in her face, a younger woman beneath the older.  “Is that so? What kind of creature?”  “We call it the Third Bear. I do not believe it is really a bear.”  Hasghat doubled over in mirth. “Not really a bear? A bear that is not a bear?”  “We cannot seem to kill it. We thought that you might know how to defeat it.”  “It stays to the forest,” the witch woman said. “It stays to the forest and it is a bear but not a bear. It kills your people when they use the forest paths. It kills your people in the farms. It even sneaks into your graveyards and takes the heads of your dead. You are full of fear and panic. You cannot kill it, but it keeps murdering you in the most terrible of ways.”  And that was winter, coming from her dry, stained lips.  “Do you know of it then?” Horley asked, his heart fast now from hope not fear.  “Ah yes, I know it,” Hasghat said, nodding. “I know the Third Bear, Theeber, Seether. After all I brought it here.”  The spear moved in Horley’s hand and it would have driven itself deep into the woman’s chest if Horley had let it.  “For revenge?” Horley asked. “Because we drove you out of the village?”  Hasghat nodded. “Unfair. It was unfair. You should not have done it.”  You’re right, Horley thought. I should have let them burn you.  “You’re right,” Horley said. “We should not have done it. But we have learned our lesson.”  “I was once a woman of knowledge and learning,” Hasghat said. “Once I had a real cottage in a village. Now I am old and the forest is cold and uncomfortable. All of this is illusion,” and she gestured at the fireplace, at the walls of the cottage. “There is no cottage. No fireplace. No rocking chair. Right now, we are both dreaming beneath dead leaves among the worms and the beetles and the dirt. My back is sore and patterned by leaves. This is no place for someone as old as me.”  “I’m sorry,” Horley said. “You can come back to the village. You can live among us. We’ll pay for your food. We’ll give you a house to live in.”  Hasghat frowned. “And some logs, I’ll warrant. Some logs and some rope and some fire to go with it, too!”  Horley took off his helmet, stared into Hasghat eye sockets. “I’ll promise you whatever you want. No harm will come to you. If you’ll help us. A man has to realize when he’s beaten, when he’s done wrong. You can have whatever you want. On my honor.”  Hasghat brushed at the hornets ringing her head. “Nothing is that easy.”  “Isn’t it?”  “I brought it from a place far distant. In my anger. I sat in the middle of the forest despairing and I called for it from across the miles, across the years. I never expected it would come to me.”  “So you can send it back?”  Hasghat frowned, spat again, and shook her head. “No. I hardly remember how I called it. And some day it may even be my head it takes. Sometimes it is easier to summon something than to send it away.”  “You cannot help us at all?”  “If I could, I might, but calling it weakened me. It is all I can do to survive. I dig for toads and eat them raw. I wander the woods searching for mushrooms. I talk to the deer and I talk to the squirrels. Sometimes the birds tell me things about where they’ve been. Someday I will die out here. All by myself. Completely mad.”  Horley’s frustration heightened. He could feel the calm he had managed to keep leaving him. The spear twitched and jerked in his hands. What if he killed her? Might that send the Third Bear back where it had come from?  “What can you tell me about the Third Bear? Can you tell me anything that might help me?”  Hasghat shrugged. “It acts as to its nature. And it is far from home, so it clings to ritual even more. Where it is from, it is no more or less bloodthirsty than any other creature. But this far from home, it appears more horrible than it is. It is merely making a pattern. When the pattern is finished, it will leave and go someplace else. Maybe the pattern will even help send it home.”  “A pattern of heads.”  “Yes. A pattern with heads.”  “Do you know when it will be finished?”  “No.”  “Do you know where it lives?”  “Yes. It lives here.”  In his mind, he saw a hill. He saw a cave. He saw the Third Bear.  “Do you know anything else?”  “No.”  Hasghat grinned up at him.  He drove the spear through her dry chest.  There was a sound like twigs breaking.  Horley woke covered in leaves, in the dirt, his body curled up next to the old woman. He jumped to his feet, picking up his spear. The old woman, dressed in a black dress and dirty shawl, was dreaming and mumbling in her sleep. Dead hornets had become entangled in her stringy hair. She clutched a dead toad in her left hand. A smell came from her, of rot, of shit.  There was no sign of the door. The forest was silent and dark.  Horley almost drove the spear into her chest again, but she was tiny, like a bird, and defenseless, and staring down at her he could not do it.  He looked around at the trees, at the fading light. It was time to accept that there was no reason to it, no why. It was time to get out, one way or another.  “A pattern of heads,” he muttered to himself all the way home. “A pattern of heads.”  Horley did not remember much about the meeting with the villagers upon his return. They wanted to hear about a powerful witch who could help or curse them, some force greater than themselves. Some glint of hope through the trees, a light in the dark. He could not give it to them. He told them the truth as much as he dared, but also hinted that the witch had told him how to defeat the Third Bear. Did it do much good? He didn’t know. He could still see winter before them. He could still see blood. And they’d brought it on themselves. That was the part he didn’t tell them. That a poor old woman with the ground for a bed and dead leaves for a blanket thought she had, through her anger, brought the Third Bear down upon them. Theeber. Seether.  “You must leave,” he told Rebecca later. “Take a wagon. Take a mule. Load it with supplies. Don’t let yourself be seen. Take our two sons. Bring that young man who helps chop firewood for us. If you can trust him.”  Rebecca stiffened beside him. She was quiet for a very long time.  “Where will you be?” she asked.  Horley was forty-seven years old. He had lived in Grommin his entire life.  “I have one thing left to do, and then I will join you.”  “I know you will, my love.” Rebecca said, holding onto him tightly, running her hands across his body as if as blind as the old witch woman, remembering, remembering.  They both knew there was only one way Horley could be sure Rebecca and his sons made it out of the forest safely.  Horley started from the south, just up-wind from where Rebecca had set out along an old cart trail, and curled in toward the Third Bear’s home. After a long trek, Horley came to a hill that might have been a cairn made by his ancestors. A stream flowed down it and puddled at his feet. The stream was red and carried with it gristle and bits of marrow. It smelled like black pudding frying. The blood mixed with the deep green of the moss and turned it purple. Horley watched the blood ripple at the edges of his boots for a moment, and then he slowly walked up the hill.  He’d been carelessly loud for a long time as he walked through the leaves. About this time, Rebecca would be more than half-way through the woods, he knew.  In the cave, surrounded by all that Clem had seen and more, Horley disturbed Theeber at his work. Horley’s spear had long since slipped through numb fingers. He’d pulled off his helmet because it itched and because he was sweating so much. He’d had to rip his tunic and hold the cloth against his mouth.  Horley had not meant to have a conversation; he’d meant to try to kill the beast. But now that he was there, now that he saw, all he had left were words.  Horley’s boot crunched against half-soggy bone. Theeber didn’t flinch. Theeber already knew. Theeber kept licking the fluid out of the skull in his hairy hand.  Theeber did look a little like a bear. Horley could see that. But no bear was that tall or that wide or looked as much like a man as a beast.  The ring of heads lined every flat space in the cave, painted blue and green and yellow and red and white and black. Even in the extremity of his situation, Horley could not deny that there was something beautiful about the pattern.  “This painting,” Horley began in a thin, stretched voice. “These heads. How many do you need?”  Theeber turned its bloodshot, carious gaze on Horley, body swiveling as if made of air, not muscle and bone.  “How do you know not to be afraid?” Horley asked. Shaking. Piss running down his leg. “Is it true you come from a long way away? Are you homesick?”  Somehow, not knowing the answers to so many questions made Horley’s heart sore for the many other things he would never know, never understand.  Theeber approached. It stank of mud and offal and rain. It made a continual sound like the rumble of thunder mixed with a cat’s purr. It had paws but it had thumbs.  Horley stared up into its eyes. The two of them stood there, silent, for a long moment. Horley trying with everything he had to read some comprehension, some understanding into that face. Those eyes, oddly gentle. The muzzle wet with carrion.  “We need you to leave. We need you to go somewhere else. Please.”  Horley could see Hasghat’s door in the forest in front of him. It was opening in a swirl of dead leaves. A light was coming from inside of it. A light from very, very far away.  Theeber held Horley against his chest. Horley could hear the beating of its mighty heart, as loud as the world. Rebecca and his sons would be almost past the forest by now.  Seether tore Horley’s head from his body. Let the rest crumple to the dirt floor.  Horley’s body lay there for a good long while.  Winter came—as brutal as it had ever been—and the Third Bear continued in its work. With Horley gone, the villagers became ever more listless. Some few disappeared into the forest and were never heard from again. Others feared the forest so much that they ate berries and branches at the outskirts of their homes and never hunted wild game. Their supplies gave out. Their skin became ever more pale and they stopped washing themselves. They believed the words of madmen and adopted strange customs. They stopped wearing clothes. They would have relations in the street. At some point, they lost sight of reason entirely and sacrificed virgins to the Third Bear, who took them as willingly as anyone else. They took to mutilating their bodies, thinking that this is what the third bear wanted them to do. Some few in whom reason persisted had to be held down and mutilated by others. A few cannibalized those who froze to death, and others who had not died almost wished they had. No relief came. The baron never brought his men.  Spring came, finally, and the streams thawed. The birds came back, the trees regained their leaves, and the frogs began to sing their mating songs. In the deep forest, an old wooden door lay half-buried in moss and dirt, leading nowhere, all light fading from it. And on an overgrown hill, there lay an empty cave with nothing but a few dead leaves and a few bones littering the dirt floor.  The Third Bear had finished its pattern and moved on, but for the remaining villagers he would always be there. Jeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.  Jeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "text": "6600 words, short story\nThe Third Bear\n2007 Shirley Jackson Award Nominee\n2007 WSFA Small Press Award Nominee\nIt made its home in the deep forest near the village of Grommin, and all anyone ever saw of it, before the end, would be hard eyes and the dark barrel of its muzzle. The smell of piss and blood and shit and bubbles of saliva and half-eaten food. The villagers called it the Third Bear because they had killed two bears already that year. But, near the end, no one really thought of it as a bear, even though the name had stuck, changed by repetition and fear and slurring through blood-filled mouths to Theeber. Sometimes it even sounded like “seether” or “seabird.”\nThe Third Bear came to the forest in mid-summer, and soon most anyone who used the forest trail, day or night, disappeared, carried off to the creature’s lair. By the time even large convoys had traveled through, they would discover two or three of their number missing. A straggling horseman, his mount cantering along, just bloodstains and bits of skin sticking to the saddle. A cobbler gone but for a shredded, bloodied hat. A few of the richest villagers hired mercenaries as guards, but when even the strongest men died, silent and alone, the convoys dried up.\nThe village elder, a man named Horley, held a meeting to decide what to do. It was the end of summer by then. The meeting house had a chill to it, a stench of thick earth with a trace of blood and sweat curling through it. All five hundred villagers came to the meeting, from the few remaining merchants to the poorest beggar. Grommin had always been hard scrabble and tough winters, but it was also two hundred years old. It had survived the wars of barons and of kings, been razed twice, only to return.\n“I can’t bring my goods to market,” one farmer said, rising in shadow from beneath the thatch. “I can’t be sure I want to send my daughter to the pen to milk the goats.”\nHorley laughed, said, “It’s worse than that. We can’t bring in food from the other side. Not for sure. Not without losing men.”\nHorley had a sudden vision from months ahead, of winter, of ice gravelly with frozen blood. It made him shudder.\n“What about those of us who live outside the village?” another farmer asked. “We need the pasture for grazing, but we have no protection.”\nHorley understood the problem; he had been one of those farmers, once. The village had a wall of thick logs surrounding it, to a height of ten feet. No real defense against an army, but more than enough to keep the wolves out. Beyond that perimeter lived the farmers and the hunters and the outcasts who could not work among others.\n“You may have to pretend it is a time of war and live in the village and go out with a guard,” Horley said. “We have plenty of able-bodied men, still.”\n“Is it the witch woman doing this?” Clem the blacksmith asked.\n“No,” Horley said. “I don’t think it’s the witch woman.”\nWhat Clem and some of the others thought of as a “witch woman,” Horley thought of as a crazy person who knew some herbal remedies and lived in the woods because the villagers had driven her there, blaming her for an outbreak of sickness the year before.\n“Why did it come?” a woman asked. “Why us?”\nNo one could answer, least of all Horley. As Horley stared at all of those hopeful, scared, troubled faces, he realized that not all of them yet knew they were stuck in a nightmare.\nClem was the village’s strongest man, and after the meeting he volunteered to fight the beast. He had arms like most people’s thighs. His skin was tough from years of being exposed to flame. With his full black beard he almost looked like a bear himself.\n“I’ll go, and I’ll go willingly,” he told Horley. “I’ve not met the beast I couldn’t best. I’ll squeeze the ‘a’ out of him.” And he laughed, for he had a passable sense of humor, although most chose to ignore it.\nHorley looked into Clem’s eyes and could not see even a speck of fear there. This worried Horley.\n“Be careful, Clem,” Horley said. And, in a whisper, as he hugged the man: “Instruct your son in anything he might need to know, before you leave. Make sure your wife has what she needs, too.”\nFitted in chain mail, leathers, and a metal helmet, carrying an old sword some knight had once left in Grommin by mistake, Clem set forth in search of the Third Bear. The entire village came out to see him go. Clem was laughing and raising his sword and this lifted the spirits of those who saw him. Soon, everyone was celebrating as if the Third Bear had already been killed or defeated.\n“Fools,” Horley’s wife Rebecca said as they watched the celebration with their two young sons.\nRebecca was younger than Horley by ten years and had come from a village far beyond the forest. Horley’s first wife had died from a sickness that left red marks all over her body.\n“Perhaps, but it’s the happiest anyone’s been for a month,” Horley said. “Let them have these moments.”\n“All I can think of is that he’s taking one of our best horses out into danger,” Rebecca said.\n“Would you rather he took a nag?” Horley said, but absent-mindedly. His thoughts were elsewhere.\nThe vision of winter would not leave him. Each time, it came back to Horley with greater strength, until he had trouble seeing the summer all around him.\nClem left the path almost immediately, wandered through the underbrush to the heart of the forest, where the trees grew so black and thick that the only glimmer of light came from the reflection of water on leaves. The smell in that place carried a hint of offal.\nClem had spent so much time beating things into shape that he had not developed a sense of fear, for he had never been beaten. But the smell in his nostrils did make him uneasy.\nHe wandered for some time in the deep growth, where the soft loam of moss muffled the sound of his passage. It became difficult to judge direction and distance. The unease became a knot in his chest as he clutched his sword ever tighter. He had killed many bears in his time, this was true, but he had never had to hunt a man-eater.\nEventually, in his circling, meandering trek, Clem came upon a hill with a cave inside. From within the cave, a green flame flickered. It beckoned like a lithe but crooked finger.\nA lesser man might have turned back, but not Clem. He didn’t have the sense to turn back.\nInside the cave, he found the Third Bear. Behind the Third Bear, arranged around the walls of the cave, it had displayed the heads of its victims. The heads had been painstakingly painted and mounted on stands. They were all in v arious stages of rot.\nMany bodies lay stacked neatly in the back of the cave. All of them had been defiled in some way. Some of them had been mutilated. The wavery green light came from a candle the Third Bear had placed behind the bodies, to display its handiwork. The smell of blood was so thick that Clem had to put a hand over his mouth.\nAs Clem took it all in, the methodical nature of it, the fact that the Third Bear had not eaten any of its victims, he found something inside of him te aring and then breaking.\n“I . . . ,” he said, and looked into the terrible eyes of the Third Bear. “I . . . ”\nAlmost sadly, with a kind of ritual grace, the Third Bear pried Clem’s sword from his fist, placed the weapon on a ledge, and then came back to stare at Clem once more.\nClem stood there, frozen, as the Third Bear disemboweled him.\nThe next day, Clem was found at the edge of the village, blood soaked and shit-spattered, legs gnawed away, but alive enough for awhile to, in shuddering lurches, tell those who found him what he had seen, just not coherent enough to tell them where.\nLater, Horley would wish that he hadn’t told them anything.\nThere was nothing left but fear in Clem’s eyes by the time Horley questioned him. Horley didn’t remember any of Clem’s answers, had to be retold them later. He was trying to reconcile himself to looking down to stare into Clem’s eyes.\n“I’m cold, Horley,” Clem said. “I can’t feel anything. Is winter coming?”\n“Should we bring his wife and son?” the farmer who had found Clem asked Horley at one point.\nHorley just stared at him, aghast.\nThey buried Clem in the old graveyard, but the next week the Third Bear dug him up and stole his head. Apparently, the Third Bear had no use for heroes, except, possibly, as a pattern of heads.\nHorley tried to keep the grave robbery and what Clem had said a secret, but it leaked out anyway. By the time most villagers of Grommin learned about it, the details had become more monstrous than anything in real life. Some said Clem had been kept alive for a week in the bear’s lair, while it ate away at him. Others said Clem had had his spine ripped out of his body while he was still breathing. A few even said Clem had been buried alive by mistake and the Third Bear had heard him writhing in the dirt and come for him.\nBut one thing Horley knew that trumped every tall tale spreading through Grommin: the Third Bear hadn’t had to keep Clem alive. Theeber hadn’t had to place Clem, still breathing, at the edge of the village.\nSo Seether wasn’t just a bear.\nIn the next week, four more people were killed, one on the outskirts of the village. Several villagers had risked leaving, and some of them had even made it through. But fear kept most of them in Grommin, locked into a kind of desperate fatalism or optimism that made their eyes hollow as they stared into some unknowable distance. Horley did his best to keep morale up, but even he experienced a sense of sinking.\n“Is there more I can do?” he asked his wife in bed at night.\n“Nothing,” she said. “You are doing everything you can do.”\n“Should we just leave?”\n“Where would we go? What would we do?”\nFew who left ever returned with stories of success, it was true. There was war and plague and a thousand more dangers out there beyond the forest. They’d as likely become slaves or servants or simply die, one by one, out in the wider world.\nEventually, though, Horley sent a messenger to that wider world, to a far-distant baron to whom they paid fealty and a yearly amount of goods.\nThe messenger never came back. Nor did the baron send any men. Horley spent many nights awake, wondering if the messenger had gotten through and the baron just didn’t care, or if Seether had killed the messenger.\n“Maybe winter will bring good news,” Rebecca said.\nOver time, Grommin sent four or five of its strongest and most clever men and women to fight the Third Bear. Horley objected to this waste, but the villagers insisted that something must be done before winter, and those who went were unable to grasp the terrible velocity of the situation. For Horley, it seemed merely a form of taking one’s own life, but his objections were overruled by the majority.\nThey never learned what happened to these people, but Horley saw them in his nightmares.\nOne, before the end, said to the Third Bear, “If you could see the children in the village, you would stop.”\nAnother said, before fear clotted her windpipe, “We will give you all the food you need.”\nA third, even as he watched his intestines slide out of his body, said, “Surely there is something we can do to appease you?”\nIn Horley’s dreams, the Third Bear said nothing. Its conversation was through its work, and Seether said what it wanted to say very eloquently in that regard.\nBy now, fall had descended on Grommin. The wind had become unpredictable and the leaves of trees had begun to yellow. A far-off burning smell laced the air. The farmers had begun to prepare for winter, laying in hay and slaughtering and smoking hogs and goats. Horley became more involved in these preparations than usual, driven by his vision of the coming winter. People noted the haste, the urgency, so unnatural in Horley, and to his dismay it sometimes made them panic rather than work harder.\nWith his wife’s help, Horley convinced the farmers to contribute to a communal smoke house in the village. Ham, sausage, dried vegetables, onions, potatoes—they stored it all in Grommin now. Most of the outlying farmers realized that their future depended on the survival of the village.\nSometimes, when they opened the gates to let in another farmer and his mule-drawn cart of supplies, Horley would walk out a ways and stare into the forest. It seemed more unknowable than ever, gaunt and dark, as if diminished by the change of seasons.\nSomewhere out there the Third Bear waited for them.\nOne day, the crisp cold of coming winter a lingering promise, Horley and several of the men from Grommin went looking for a farmer who had not come to the village for a month. The farmer’s name was John and he had a wife, five children, and three men who worked for him. John’s holdings were the largest outside the village, but he had been suffering because he could not bring his extra goods to market.\nThe farm was a half-hour’s walk from Grommin. The whole way, Horley could feel a hurt in his chest, a kind of stab of premonition. Those with him held pitchforks and hammers and old spears, much of it as rust-colored as the leaves now strewn across the path.\nThey could smell the disaster before they saw it. It coated the air like oil.\nOn the outskirts of John’s farm, they found three mule-pulled carts laden with food and supplies. Horley had never seen so much blood. It had pooled and thickened to cover a spreading area several feet in every direction. The mules had had their throats torn out and then they had been disemboweled. Their organs had been torn out and thrown onto the ground, as if Seether had been searching for something. Their eyes had been plucked from their sockets almost as an afterthought.\nJohn—they thought it was John—sat in the front of the lead cart. The wheels of the cart were greased with blood. The head was missing, as was much of the meat from the body cavity. The hands still held the reins. The same was true for the other two carts. Three dead men holding reins to dead mules. Two dead men in the back of the carts. All five missing their heads. All five eviscerated.\nOne of Horley’s protectors vomited into the grass. Another began to weep. “Jesus save us,” a third man said, and kept saying it for many hours.\nHorley found himself curiously unmoved. His hand and heart were steady.\nHe noted the brutal humor that had moved the Third Bear to carefully replace the reins in the men’s hands. He noted the wild, savage abandon that had preceded that action. He noted, grimly, that most of the supplies in the carts had been ruined by the wealth of blood that covered them. But, for the most part, the idea of winter had so captured him that whatever came to him moment-by-moment could not compare to the crystalline nightmare of that interior vision.\nHorley wondered if his was a form of madness as well.\n“This is not the worst,” he said to his men. “Not by far.”\nAt the farm itself, they found the rest of the men and what was left of John’s wife, but that is not what Horley had meant.\nAt this point, Horley felt he should go himself to find the Third Bear. It wasn’t bravery that made him put on the leather jerkin and the metal shin guards. It wasn’t from any sense of hope that he picked up the spear and put Clem’s helmet on his head.\nHis wife found him there, ready to walk out the door of their home.\n“You wouldn’t come back,” she told him.\n“Better,” he said. “Still.”\n“You’re more important to us alive. Stronger men than you have tried to kill it.”\n“I must do something,” Horley said. “Winter will be here soon and things will get worse.”\n“Then do something,” Rebecca said, taking the spear from his hand. “But do something else.”\nThe villagers of Grommin met the next day. There was less talking this time. As Horley looked out over them, he thought some of them seemed resigned, almost as if the Third Bear were a plague or some other force that could not be controlled or stopped by the hand of Man. In the days that followed, there would be a frenzy of action: traps set, torches lit, poisoned meat left in the forest, but none of it came to anything.\nOne old woman kept muttering about fate and the will of God.\n“John was a good man,” Horley told them. “He did not deserve his death. But I was there—I saw his wounds. He died from an animal attack. It may be a clever animal. It may be very clever. But it is still an animal. We should not fear it the way we fear it.” Horley said this, even though he did not believe it.\n“You should consult with the witch in the woods,” Clem’s son said.\nClem’s son was a huge man of twenty years, and his word held weight, given the bravery of his father. Several people began to nod in agreement.\n“Yes,” said one. “Go to the witch. She might know what to do.”\nThe witch in the woods is just a poor, addled woman, Horley thought, but could not say it.\n“Just two months ago,” Horley reminded them, “you were saying she might have made this happen.”\n“And if so, what of it? If she caused it, she can undo it. If not, perhaps she can help us.”\nThis from one of the farmers displaced from outside the walls. Word of John’s fate had spread quickly, and less than a handful of the bravest or most foolhardy had kept to their farms.\nRancor spread amongst the gathered villagers. Some wanted to take a party of men out to the witch, wherever she might live, and kill her. Others thought this folly—what if the Third Bear found them first?\nFinally, Horley raised his hands to silence them.\n“Enough! If you want me to go to the witch in the woods, I will go to her.”\nThe relief on their faces, as he looked out at them—the relief that it was he who would take the risk and not them—it was like a balm that cleansed their worries, if only for the moment. Some fools were even smiling.\nLater, Horley lay in bed with his wife. He held her tight, taking comfort in the warmth of her body.\n“What can I do? What can I do, Rebecca? I’m scared.”\n“I know. I know you are. Do you think I’m not scared as well? But neither of us can show it or they will panic, and once they panic, Grommin is lost.”\n“But what do I do?”\n“Go see the witch woman, my love. If you go to her, it will make them calmer. And you can tell them whatever you like about what she says.”\n“If the Third Bear doesn’t kill me before I can find her.”\nIf she isn’t already dead.\nIn the deep woods, in a silence so profound that the ringing in his ears had become the roar of a river, Horley looked for the witch woman. He knew that she had been exiled to the southern part of the forest, and so he had started there and worked his way toward the center. What he was looking for, he did not know. A cottage? A tent? What he would do when he found her, Horley didn’t know either. His spear, his incomplete armor—these things would not protect him if she truly was a witch.\nHe tried to keep the vision of the terrible winter in his head as he walked, because concentrating on that more distant fear removed the current fear.\n“If not for me, the Third Bear might not be here,” Horley had said to Rebecca before he left. It was Horley who had stopped them from burning the witch, had insisted only on exile.\n“That’s nonsense,” Rebecca had replied. “Remember that she’s just an old woman, living in the woods. Remember that she can do you no real harm.”\nIt had been as if she’d read his thoughts. But now, breathing in the thick air of the forest, Horley felt less sure about the witch woman. It was true there had been sickness in the village until they had cast her out.\nHorley tried to focus on the spring of loam beneath his boots, the clean, dark smell of bark and earth and air. After a time, he crossed a dirt-choked stream. As if this served as a dividing line, the forest became yet darker. The sounds of wrens and finches died away. Above, he could see the distant dark shapes of hawks in the treetops, and patches of light shining down that almost looked more like bog or marsh water, so disoriented had he become.\nIt was in this deep forest, that he found a door.\nHorley had stopped to catch his breath after cresting a slight incline. Hands on his thighs, he looked up and there it stood: a door. In the middle of the forest. It was made of old oak and overgrown with moss and mushrooms, and yet it seemed to flicker like glass. A kind of light or brightness hurtled through the ground, through the dead leaves and worms and beetles, around the door. It was a subtle thing, and Horley half thought he was imagining it at first.\nHe straightened up, grip tightening on his spear.\nThe door stood by itself. Nothing human-made surrounded it, not even the slightest ruin of a wall.\nHorley walked closer. The knob was made of brass or some other yellowing metal. He walked around the door. It stood firmly wedged into the ground. The back of the door was the same as the front.\nHorley knew that if this was the entrance to the old woman’s home, then she was indeed a witch. His hand remained steady, but his heart quickened and he thought furiously of winter, of icicles and bitter cold and snow falling slowly forever.\nFor several minutes, he circled the door, deciding what to do. For a minute more, he stood in front of the door, pondering.\nA door always needs opening, he thought, finally.\nHe grasped the knob, and pushed—and the door opened.\nSome events have their own sense of time and their own logic. Horley knew this just from the change of seasons every year. He knew this from the growing of the crops and the birthing of children. He knew it from the forest itself, and the cycles it went through that often seemed incomprehensible and yet had their own pattern, their own calendar. From the first thawed trickle of stream water in the spring to the last hopping frog in the fall, the world held a thousand mysteries. No man could hope to know the truth of them all.\nWhen the door opened and he stood in a room very much like the room one might find in a woodman’s cottage, with a fireplace and a rug and a shelf and pots and pans on the wood walls, and a rocking chair—when this happened, Horley decided in the time it took him to blink twice that he had no need for the why of it or the how of it, even. And this was, he realized later, the only reason he kept his wits about him.\nThe witch woman sat in the rocking chair. She looked older than Horley remembered, as if much more than a year had passed since he had last seen her. Seeming made of ash and soot, her black dress lay flat against her sagging skin. She was blind, eye sockets bare, but her wrinkled face strained to look at him anyway.\nThere was a buzzing sound.\n“I remember you,” she said. Her voice was croak and whisper both.\nHer arms were mottled with age spots, her hands so thin and cruel-looking that they could have been talons. She gripped the arms of the rocking chair as if holding onto the world.\nThere was a buzzing sound. It came, Horley finally realized, from a halo of black hornets that circled the old woman’s head, their wings beating so fast they could hardly be seen.\n“Are you Hasghat, who used to live in Grommin?” Horley asked.\n“I remember you,” the witch woman said again.\n“I am the elder of the village of Grommin.”\nThe woman spat to the side. “Those that threw poor Hasghat out.”\n“They would have done much worse if I’d let them.”\n“They’d have burned me if they could. And all I knew then were a few charms, a few herbs. Just because I wasn’t one of them. Just because I’d seen a bit of the world.”\nHasghat was staring right at him and Horley knew that, eyes or no eyes, she could see him.\n“It was wrong,” Horley said.\n“It was wrong,” she said. “I had nothing to do with the sickness. Sickness comes from animals, from people’s clothes. It clings to them and spreads through them.”\n“And yet you are a witch?”\nHasghat laughed, although it ended with coughing. “Because I have a hidden room? Because my door stands by itself?”\nHorley grew impatient.\n“Would you help us if you could? Would you help us if we let you return to the village?”\nHasghat straightened up in the chair and the halo of hornets disintegrated, then reformed. The wood in the fireplace popped and crackled. Horley felt a chill in the air.\n“Help you? Return to the village?” She spoke as if chewing, her tongue a fat gray grub.\n“A creature is attacking and killing us.”\nHasghat laughed. When she laughed, Horley could see a strange double image in her face, a younger woman beneath the older.\n“Is that so? What kind of creature?”\n“We call it the Third Bear. I do not believe it is really a bear.”\nHasghat doubled over in mirth. “Not really a bear? A bear that is not a bear?”\n“We cannot seem to kill it. We thought that you might know how to defeat it.”\n“It stays to the forest,” the witch woman said. “It stays to the forest and it is a bear but not a bear. It kills your people when they use the forest paths. It kills your people in the farms. It even sneaks into your graveyards and takes the heads of your dead. You are full of fear and panic. You cannot kill it, but it keeps murdering you in the most terrible of ways.”\nAnd that was winter, coming from her dry, stained lips.\n“Do you know of it then?” Horley asked, his heart fast now from hope not fear.\n“Ah yes, I know it,” Hasghat said, nodding. “I know the Third Bear, Theeber, Seether. After all I brought it here.”\nThe spear moved in Horley’s hand and it would have driven itself deep into the woman’s chest if Horley had let it.\n“For revenge?” Horley asked. “Because we drove you out of the village?”\nHasghat nodded. “Unfair. It was unfair. You should not have done it.”\nYou’re right, Horley thought. I should have let them burn you.\n“You’re right,” Horley said. “We should not have done it. But we have learned our lesson.”\n“I was once a woman of knowledge and learning,” Hasghat said. “Once I had a real cottage in a village. Now I am old and the forest is cold and uncomfortable. All of this is illusion,” and she gestured at the fireplace, at the walls of the cottage. “There is no cottage. No fireplace. No rocking chair. Right now, we are both dreaming beneath dead leaves among the worms and the beetles and the dirt. My back is sore and patterned by leaves. This is no place for someone as old as me.”\n“I’m sorry,” Horley said. “You can come back to the village. You can live among us. We’ll pay for your food. We’ll give you a house to live in.”\nHasghat frowned. “And some logs, I’ll warrant. Some logs and some rope and some fire to go with it, too!”\nHorley took off his helmet, stared into Hasghat eye sockets. “I’ll promise you whatever you want. No harm will come to you. If you’ll help us. A man has to realize when he’s beaten, when he’s done wrong. You can have whatever you want. On my honor.”\nHasghat brushed at the hornets ringing her head. “Nothing is that easy.”\n“Isn’t it?”\n“I brought it from a place far distant. In my anger. I sat in the middle of the forest despairing and I called for it from across the miles, across the years. I never expected it would come to me.”\n“So you can send it back?”\nHasghat frowned, spat again, and shook her head. “No. I hardly remember how I called it. And some day it may even be my head it takes. Sometimes it is easier to summon something than to send it away.”\n“You cannot help us at all?”\n“If I could, I might, but calling it weakened me. It is all I can do to survive. I dig for toads and eat them raw. I wander the woods searching for mushrooms. I talk to the deer and I talk to the squirrels. Sometimes the birds tell me things about where they’ve been. Someday I will die out here. All by myself. Completely mad.”\nHorley’s frustration heightened. He could feel the calm he had managed to keep leaving him. The spear twitched and jerked in his hands. What if he killed her? Might that send the Third Bear back where it had come from?\n“What can you tell me about the Third Bear? Can you tell me anything that might help me?”\nHasghat shrugged. “It acts as to its nature. And it is far from home, so it clings to ritual even more. Where it is from, it is no more or less bloodthirsty than any other creature. But this far from home, it appears more horrible than it is. It is merely making a pattern. When the pattern is finished, it will leave and go someplace else. Maybe the pattern will even help send it home.”\n“A pattern of heads.”\n“Yes. A pattern with heads.”\n“Do you know when it will be finished?”\n“No.”\n“Do you know where it lives?”\n“Yes. It lives here.”\nIn his mind, he saw a hill. He saw a cave. He saw the Third Bear.\n“Do you know anything else?”\n“No.”\nHasghat grinned up at him.\nHe drove the spear through her dry chest.\nThere was a sound like twigs breaking.\nHorley woke covered in leaves, in the dirt, his body curled up next to the old woman. He jumped to his feet, picking up his spear. The old woman, dressed in a black dress and dirty shawl, was dreaming and mumbling in her sleep. Dead hornets had become entangled in her stringy hair. She clutched a dead toad in her left hand. A smell came from her, of rot, of shit.\nThere was no sign of the door. The forest was silent and dark.\nHorley almost drove the spear into her chest again, but she was tiny, like a bird, and defenseless, and staring down at her he could not do it.\nHe looked around at the trees, at the fading light. It was time to accept that there was no reason to it, no why. It was time to get out, one way or another.\n“A pattern of heads,” he muttered to himself all the way home. “A pattern of heads.”\nHorley did not remember much about the meeting with the villagers upon his return. They wanted to hear about a powerful witch who could help or curse them, some force greater than themselves. Some glint of hope through the trees, a light in the dark. He could not give it to them. He told them the truth as much as he dared, but also hinted that the witch had told him how to defeat the Third Bear. Did it do much good? He didn’t know. He could still see winter before them. He could still see blood. And they’d brought it on themselves. That was the part he didn’t tell them. That a poor old woman with the ground for a bed and dead leaves for a blanket thought she had, through her anger, brought the Third Bear down upon them. Theeber. Seether.\n“You must leave,” he told Rebecca later. “Take a wagon. Take a mule. Load it with supplies. Don’t let yourself be seen. Take our two sons. Bring that young man who helps chop firewood for us. If you can trust him.”\nRebecca stiffened beside him. She was quiet for a very long time.\n“Where will you be?” she asked.\nHorley was forty-seven years old. He had lived in Grommin his entire life.\n“I have one thing left to do, and then I will join you.”\n“I know you will, my love.” Rebecca said, holding onto him tightly, running her hands across his body as if as blind as the old witch woman, remembering, remembering.\nThey both knew there was only one way Horley could be sure Rebecca and his sons made it out of the forest safely.\nHorley started from the south, just up-wind from where Rebecca had set out along an old cart trail, and curled in toward the Third Bear’s home. After a long trek, Horley came to a hill that might have been a cairn made by his ancestors. A stream flowed down it and puddled at his feet. The stream was red and carried with it gristle and bits of marrow. It smelled like black pudding frying. The blood mixed with the deep green of the moss and turned it purple. Horley watched the blood ripple at the edges of his boots for a moment, and then he slowly walked up the hill.\nHe’d been carelessly loud for a long time as he walked through the leaves. About this time, Rebecca would be more than half-way through the woods, he knew.\nIn the cave, surrounded by all that Clem had seen and more, Horley disturbed Theeber at his work. Horley’s spear had long since slipped through numb fingers. He’d pulled off his helmet because it itched and because he was sweating so much. He’d had to rip his tunic and hold the cloth against his mouth.\nHorley had not meant to have a conversation; he’d meant to try to kill the beast. But now that he was there, now that he saw, all he had left were words.\nHorley’s boot crunched against half-soggy bone. Theeber didn’t flinch. Theeber already knew. Theeber kept licking the fluid out of the skull in his hairy hand.\nTheeber did look a little like a bear. Horley could see that. But no bear was that tall or that wide or looked as much like a man as a beast.\nThe ring of heads lined every flat space in the cave, painted blue and green and yellow and red and white and black. Even in the extremity of his situation, Horley could not deny that there was something beautiful about the pattern.\n“This painting,” Horley began in a thin, stretched voice. “These heads. How many do you need?”\nTheeber turned its bloodshot, carious gaze on Horley, body swiveling as if made of air, not muscle and bone.\n“How do you know not to be afraid?” Horley asked. Shaking. Piss running down his leg. “Is it true you come from a long way away? Are you homesick?”\nSomehow, not knowing the answers to so many questions made Horley’s heart sore for the many other things he would never know, never understand.\nTheeber approached. It stank of mud and offal and rain. It made a continual sound like the rumble of thunder mixed with a cat’s purr. It had paws but it had thumbs.\nHorley stared up into its eyes. The two of them stood there, silent, for a long moment. Horley trying with everything he had to read some comprehension, some understanding into that face. Those eyes, oddly gentle. The muzzle wet with carrion.\n“We need you to leave. We need you to go somewhere else. Please.”\nHorley could see Hasghat’s door in the forest in front of him. It was opening in a swirl of dead leaves. A light was coming from inside of it. A light from very, very far away.\nTheeber held Horley against his chest. Horley could hear the beating of its mighty heart, as loud as the world. Rebecca and his sons would be almost past the forest by now.\nSeether tore Horley’s head from his body. Let the rest crumple to the dirt floor.\nHorley’s body lay there for a good long while.\nWinter came—as brutal as it had ever been—and the Third Bear continued in its work. With Horley gone, the villagers became ever more listless. Some few disappeared into the forest and were never heard from again. Others feared the forest so much that they ate berries and branches at the outskirts of their homes and never hunted wild game. Their supplies gave out. Their skin became ever more pale and they stopped washing themselves. They believed the words of madmen and adopted strange customs. They stopped wearing clothes. They would have relations in the street. At some point, they lost sight of reason entirely and sacrificed virgins to the Third Bear, who took them as willingly as anyone else. They took to mutilating their bodies, thinking that this is what the third bear wanted them to do. Some few in whom reason persisted had to be held down and mutilated by others. A few cannibalized those who froze to death, and others who had not died almost wished they had. No relief came. The baron never brought his men.\nSpring came, finally, and the streams thawed. The birds came back, the trees regained their leaves, and the frogs began to sing their mating songs. In the deep forest, an old wooden door lay half-buried in moss and dirt, leading nowhere, all light fading from it. And on an overgrown hill, there lay an empty cave with nothing but a few dead leaves and a few bones littering the dirt floor.\nThe Third Bear had finished its pattern and moved on, but for the remaining villagers he would always be there.\nJeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\nJeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "source": "https://clarkesworldmagazine.com/vandermeer_04_07/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Third Bear by Jeff VanderMeer"}