{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alejandro MGNZ", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "77sddJehL3tP3tqrpkVNObdb1iE=", "id": null, "license": null, "comments": "", "raw_text": "Cover Art  Beckoning Ancient Depths    Since an early age, Alejandro (Magnozz) has been very passionate about anatomy. Parallel to his studies in Arts, he spent countless hours in libraries researching this subject. He started in Digital Art just a few years ago after a friend invited him to open an account at a web-based art community. He began by coloring some old sketches, and was soon hooked. It's hard to believe that just prior to this he didn't even own a computer or even an e-mail address.  His biggest source of inspiration is music, which helps him visualize the atmosphere for a particular artwork. He's currently working for BBDO Colombia, an advertising agency, and on a side project featuring his unpublished artwork.", "text": "Cover Art\nBeckoning Ancient Depths\nSince an early age, Alejandro (Magnozz) has been very passionate about anatomy. Parallel to his studies in Arts, he spent countless hours in libraries researching this subject. He started in Digital Art just a few years ago after a friend invited him to open an account at a web-based art community. He began by coloring some old sketches, and was soon hooked. It's hard to believe that just prior to this he didn't even own a computer or even an e-mail address.\nHis biggest source of inspiration is music, which helps him visualize the atmosphere for a particular artwork. He's currently working for BBDO Colombia, an advertising agency, and on a side project featuring his unpublished artwork.", "source": "https://clarkesworldmagazine.com/artbio_52/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Beckoning Ancient Depths by Alejandro MGNZ"}