{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bud Sparhawk", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "2WyDmy8jQbCITQVrvZyHbHw7FjU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Writer’s Tools  In the good old days, long before everybody had pens and paper, story-tellers would just sit around the fire and spin tales, or repeat one told by others and adding some slight modifications to improve rhyme or meter. The only tools needed back then were a good memory and a lack of shame.  These days, a writer has software, hardware, and the intellectual wealth of the internet at their fingertips from which they can amass all of the background material they think they may need to write their stories. It's also a never-ending source of dangerously distracting amusements that are far more interesting than actually writing.  With the resources available and using some basic tools, anyone can easily craft a tale or repeat—albeit in different words—many-told stories. Whether or not a writer is successful in publishing what they craft depends largely on their ability to tell a compelling story and how well they use their tools.  The tools a writer selects depends a lot on the processes they use to build their tales. The specific tool is a matter of personal choice and temperament. Aside from pen and paper, computers, laptops, and tablets seem to appeal to many.  Writers also vary widely in the way they approach drafting and editing their work. This point was illustrated at the recent CapClave convention where Jamie Todd Rubin and I presented an On Line Writing Tools session.  We found that although we use some similar software, we employ them differently. For example, Jamie blogs frequently regarding his use of Evernote to support his writing process. He favors letting the story develop as it goes. I, on the other hand, prefer a more measured approach by setting the sequence of scenes in advance before writing the scene itself. The comparison of our methods was as illuminating for the audience as our descriptions of the tools themselves.  I started writing with WordPerfect, moved to MS Word, and later to Scrivener—one of the finest writer’s tool ever developed, IMHO. I also use spreadsheets, databases, and the file features available on my operating system, such as categorizing, date sorting, etc.  I previously used a FileMaker Pro database with a home-built scene building application for stories under seven thousand words. This tool was quickly abandoned when I discovered I could build and manipulate scenes with an application called Scrivener. Being able to display scenes in a continuous and easy-to-follow thread was a godsend and reduced the endless cut and paste of word processors.  Scrivener is not the only arrow in my quiver. When I am away from my workstation, I use Internet Writer on my iPad to dash off a page or ten. At readings, I transfer the selection to my Kindle so I don't have to mess with paper, paper, paper or fumble with tiny (or missing) thumb drives.  Each tool that I’ve mentioned required developing a degree of familiarity and learning the skills needed to obtain the best results. Just as a chisel will not turn someone into a sculptor, a paint brush an artist, neither will any writing tool somehow grant a writer the magical powers of story creation. A writer has to keep in mind that their tools are only aids to let them concentrate on the most important aspect, which is to use their imagination and intelligence.  I’ve also designed network diagrams that show how scenes relate to one another, and, at times, created complex spreadsheets to supplement them. I also use Inspiration, a simple and inexpensive mind mapping tool, and a FileMaker Pro database for tracking my work and submissions. For the occasional collaboration I also use DropBox to share files.  I use all of the above on my home machine and usually work with multiple windows open, as illustrated below.   Scrivener’s wonderful corkboard continues to be my primary tool where I can display and manipulate my scene fragments. I can move scenes about, code them with color, and have as many open as I need. Scrivener also permits me to open reference windows containing useful facts—such as the names of the characters, settings, and progress of the work.  Beside the Scrivener features, I also keep my plot diagram open for quick reference and do the same with a spreadsheet. In the illustration above you can also see windows of my tracking database and file system peeking through the cracks.  Obviously this crowded screen did not arrive overnight and ready to use. I had to gradually discover the processes that worked best for me. I tried to devise a way to not lose the tenuous train of thought I had been following by needing to search elsewhere for something I needed. Better, I thought, to have it all there in front of me and instantly available.  But producing a finished manuscript is only a way to sell and/or publish it. To get it published an editor has to buy or reject it. Tracking what happens between you and all the assorted editors requires a type of tool.  To make an intelligent submission, a writer needs to know the publication’s guidelines, their address or URL, the preferred length, and how soon they might expect a reply. Unless you carefully keep track of where your story sits, you might suffer the embarrassment of sending something back to an editor who has already read and rejected it.  Given the review cycles of most markets, there will be the inevitable delay as your precious manuscript gradually works its way to the top of the slush pile, into some editor’s hands, and, if you are extremely lucky or gifted, into the final selection pile and onwards to publication.  This is valuable time, time you should be using to produce more stories, time that should be used in perfecting failed pieces, and time in which you should be sending out any rejected material to another market.  Serious writers keep their work in circulation until it either sells or the virtual ink wears off. As a consequence, any writer who is fairly productive has a number of manuscripts in circulation at any time. Sometimes this number will grow and, without some method of tracking, you might lose a manuscript and not even realize it, or discover that an unsent, completed story has been buried in the disaster of your computer filing system.  Index cards are a low-tech method for tracking but using a spreadsheet is as easy. More advanced yet is a database, which allows you both flexibility and content options not easily done on other methods, such as quickly finding all outstanding stories, or having the history of any piece instantly available. Another alternative is to use one of the many online tracking tools for your submissions list such as Duotrope, Writers, or many more, some of which are free or reasonably priced.  The secret of tracking is to decide in advance everything you might ever want to know about your manuscript. For example, I document when each piece originated, when it achieved its final, releasable form and, if necessary, when it was subsequently revised. I also record each editor and the dates submitted and when each replied. I live with the constant fear that I might lose track of which draft came first, which was the finished piece and how long it has been at a particular editor and an estimated reply date. Editors sometimes lose manuscripts, submissions occasionally go astray, and even fragile memory fades over time.  So don't wait, get your inventory of tools together now and start record keeping as an integral part of your writing schedule. A good set of tools will reward you, and perhaps leave a record of your work that far future biographer may value.  References  \r\n Scrivener is an application that combines the features of a word processor with project management tools. The application allows a writer to outline the story, structure ideas, store and view research notes, and develop successive drafts while making all the above material quickly and easily available. You can find more information available at https://www.literatureandlatte.com/scrivener.php  Inspiration is a relatively inexpensive mind-mapping tool that I use for thinking of how the various scenes tie together. In addition, Inspiration has outline and work processing capabilities. You can find more information at http://www.inspiration.com  FileMaker Pro is moderately priced and has a bit of a learning curve that can be bridged with the Dummy books. It lets you customize default screens, collect whatever data you wish, and even publish to the Internet. You can read more details at http://www.filemaker pro/  Writer, or more properly The Internet Typewriter, is a free, cloud-based utility that does just what the name implies—type. This is no word processor, but it does cut out the need for file transfers, thumb drives, and other sneaker net methods. You can read more at https://writer.bighugelabs.com/  DropBox is another cloud-based tool that is free for the basic setup. It provides what is essentially a spare drive for files. A copy can be downloaded from https://www.dropbox.com/install Bud Sparhawk is a short story writer who has sold numerous science fiction stories to ANALOG, Asimov's, and other widely circulated magazines. He has been a three-time Nebula novella finalist. His work has appeared in several anthologies as well as print, audio, and on-line media both in the United States and overseas. His stories appear most frequently in Analog, less so in Asimov's and annually in the Defending the Future series of anthologies.  He has two print collections (Sam Boone: Front to Back and Dancing with Dragons,) one mass-market paperback (VIXEN), and several eBook collections and novels.  Bud is currently the Treasurer of SFWA and a member of SIGMA. He maintains a weekly blog on the writing life at budsparhawk.blogspot.com. A complete bibliography of stories, articles, and other material can be found at his web site.", "text": "Non-Fiction\nAnother Word: Writer’s Tools\nIn the good old days, long before everybody had pens and paper, story-tellers would just sit around the fire and spin tales, or repeat one told by others and adding some slight modifications to improve rhyme or meter. The only tools needed back then were a good memory and a lack of shame.\nThese days, a writer has software, hardware, and the intellectual wealth of the internet at their fingertips from which they can amass all of the background material they think they may need to write their stories. It's also a never-ending source of dangerously distracting amusements that are far more interesting than actually writing.\nWith the resources available and using some basic tools, anyone can easily craft a tale or repeat—albeit in different words—many-told stories. Whether or not a writer is successful in publishing what they craft depends largely on their ability to tell a compelling story and how well they use their tools.\nThe tools a writer selects depends a lot on the processes they use to build their tales. The specific tool is a matter of personal choice and temperament. Aside from pen and paper, computers, laptops, and tablets seem to appeal to many.\nWriters also vary widely in the way they approach drafting and editing their work. This point was illustrated at the recent CapClave convention where Jamie Todd Rubin and I presented an On Line Writing Tools session.\nWe found that although we use some similar software, we employ them differently. For example, Jamie blogs frequently regarding his use of Evernote to support his writing process. He favors letting the story develop as it goes. I, on the other hand, prefer a more measured approach by setting the sequence of scenes in advance before writing the scene itself. The comparison of our methods was as illuminating for the audience as our descriptions of the tools themselves.\nI started writing with WordPerfect, moved to MS Word, and later to Scrivener—one of the finest writer’s tool ever developed, IMHO. I also use spreadsheets, databases, and the file features available on my operating system, such as categorizing, date sorting, etc.\nI previously used a FileMaker Pro database with a home-built scene building application for stories under seven thousand words. This tool was quickly abandoned when I discovered I could build and manipulate scenes with an application called Scrivener. Being able to display scenes in a continuous and easy-to-follow thread was a godsend and reduced the endless cut and paste of word processors.\nScrivener is not the only arrow in my quiver. When I am away from my workstation, I use Internet Writer on my iPad to dash off a page or ten. At readings, I transfer the selection to my Kindle so I don't have to mess with paper, paper, paper or fumble with tiny (or missing) thumb drives.\nEach tool that I’ve mentioned required developing a degree of familiarity and learning the skills needed to obtain the best results. Just as a chisel will not turn someone into a sculptor, a paint brush an artist, neither will any writing tool somehow grant a writer the magical powers of story creation. A writer has to keep in mind that their tools are only aids to let them concentrate on the most important aspect, which is to use their imagination and intelligence.\nI’ve also designed network diagrams that show how scenes relate to one another, and, at times, created complex spreadsheets to supplement them. I also use Inspiration, a simple and inexpensive mind mapping tool, and a FileMaker Pro database for tracking my work and submissions. For the occasional collaboration I also use DropBox to share files.\nI use all of the above on my home machine and usually work with multiple windows open, as illustrated below.\nScrivener’s wonderful corkboard continues to be my primary tool where I can display and manipulate my scene fragments. I can move scenes about, code them with color, and have as many open as I need. Scrivener also permits me to open reference windows containing useful facts—such as the names of the characters, settings, and progress of the work.\nBeside the Scrivener features, I also keep my plot diagram open for quick reference and do the same with a spreadsheet. In the illustration above you can also see windows of my tracking database and file system peeking through the cracks.\nObviously this crowded screen did not arrive overnight and ready to use. I had to gradually discover the processes that worked best for me. I tried to devise a way to not lose the tenuous train of thought I had been following by needing to search elsewhere for something I needed. Better, I thought, to have it all there in front of me and instantly available.\nBut producing a finished manuscript is only a way to sell and/or publish it. To get it published an editor has to buy or reject it. Tracking what happens between you and all the assorted editors requires a type of tool.\nTo make an intelligent submission, a writer needs to know the publication’s guidelines, their address or URL, the preferred length, and how soon they might expect a reply. Unless you carefully keep track of where your story sits, you might suffer the embarrassment of sending something back to an editor who has already read and rejected it.\nGiven the review cycles of most markets, there will be the inevitable delay as your precious manuscript gradually works its way to the top of the slush pile, into some editor’s hands, and, if you are extremely lucky or gifted, into the final selection pile and onwards to publication.\nThis is valuable time, time you should be using to produce more stories, time that should be used in perfecting failed pieces, and time in which you should be sending out any rejected material to another market.\nSerious writers keep their work in circulation until it either sells or the virtual ink wears off. As a consequence, any writer who is fairly productive has a number of manuscripts in circulation at any time. Sometimes this number will grow and, without some method of tracking, you might lose a manuscript and not even realize it, or discover that an unsent, completed story has been buried in the disaster of your computer filing system.\nIndex cards are a low-tech method for tracking but using a spreadsheet is as easy. More advanced yet is a database, which allows you both flexibility and content options not easily done on other methods, such as quickly finding all outstanding stories, or having the history of any piece instantly available. Another alternative is to use one of the many online tracking tools for your submissions list such as Duotrope, Writers, or many more, some of which are free or reasonably priced.\nThe secret of tracking is to decide in advance everything you might ever want to know about your manuscript. For example, I document when each piece originated, when it achieved its final, releasable form and, if necessary, when it was subsequently revised. I also record each editor and the dates submitted and when each replied. I live with the constant fear that I might lose track of which draft came first, which was the finished piece and how long it has been at a particular editor and an estimated reply date. Editors sometimes lose manuscripts, submissions occasionally go astray, and even fragile memory fades over time.\nSo don't wait, get your inventory of tools together now and start record keeping as an integral part of your writing schedule. A good set of tools will reward you, and perhaps leave a record of your work that far future biographer may value.\nReferences\n- Scrivener is an application that combines the features of a word processor with project management tools. The application allows a writer to outline the story, structure ideas, store and view research notes, and develop successive drafts while making all the above material quickly and easily available. You can find more information available at https://www.literatureandlatte.com/scrivener.php\n- Inspiration is a relatively inexpensive mind-mapping tool that I use for thinking of how the various scenes tie together. In addition, Inspiration has outline and work processing capabilities. You can find more information at http://www.inspiration.com\n- FileMaker Pro is moderately priced and has a bit of a learning curve that can be bridged with the Dummy books. It lets you customize default screens, collect whatever data you wish, and even publish to the Internet. You can read more details at http://www.filemaker pro/\n- Writer, or more properly The Internet Typewriter, is a free, cloud-based utility that does just what the name implies—type. This is no word processor, but it does cut out the need for file transfers, thumb drives, and other sneaker net methods. You can read more at https://writer.bighugelabs.com/\n- DropBox is another cloud-based tool that is free for the basic setup. It provides what is essentially a spare drive for files. A copy can be downloaded from https://www.dropbox.com/install\nBud Sparhawk is a short story writer who has sold numerous science fiction stories to ANALOG, Asimov's, and other widely circulated magazines. He has been a three-time Nebula novella finalist. His work has appeared in several anthologies as well as print, audio, and on-line media both in the United States and overseas. His stories appear most frequently in Analog, less so in Asimov's and annually in the Defending the Future series of anthologies.\nHe has two print collections (Sam Boone: Front to Back and Dancing with Dragons,) one mass-market paperback (VIXEN), and several eBook collections and novels.\nBud is currently the Treasurer of SFWA and a member of SIGMA. He maintains a weekly blog on the writing life at budsparhawk.blogspot.com. A complete bibliography of stories, articles, and other material can be found at his web site.", "source": "https://clarkesworldmagazine.com/another_word_05_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Writer's Tools by Bud Sparhawk"}