{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jim C Hines", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "rY1WCPDaQ8N1eSgI39NMPJkIUH8=", "id": null, "license": null, "comments": "", "raw_text": "4820 words, short story  Gift of the Kites  The first time Jesse saw the black Buka was in the park. He was flying a plastic Superman kite, dueling against his step-father’s rainbow box kite.  Jesse yanked the blue nylon string, swooping his kite toward his step-father’s.  Kentaro dodged easily. “Too broad a strike,” he called, laughing. “A true fighter kite would loop around and cut your line.”  “Get him, Jesse,” cheered Jesse’s mother, sitting in the shade on one of the picnic benches.  At twelve years old, Jesse felt a mix of pride and embarrassment at her enthusiasm. Flushing, he unwrapped a bit more line, sending his kite higher. He dove again, missed, then tugged the kite in a tight turn that nearly clipped Kentaro’s kite. His mother whistled.  “Much better,” Kentaro said, grinning. He pulled his kite through a long ‘J’ in salute. “Amazing control from a plastic store-bought kite. You’re sure you have no Japanese blood?”  A shadow caught Jesse’s attention. A black rectangular kite leapt from the horizon, corkscrewing through the sky. Jesse ran toward the fence, hoping to glimpse the kite’s owner. His Superman kite followed like an obedient blue and red puppy.  “What is it?” his mother called.  Higher and higher the black kite flew. The string was invisible to Jesse’s eyes, but given the angle, the owner had to be by the highway. The wind carried exhaust fumes to Jesse’s nose.  “It’s a Buka kite,” Jesse yelled. The black fighting kite moved like no kite he had ever seen. It flew and bucked like a thing alive.  Kentaro shielded his eyes. “I see nothing.”  Jesse’s bowels grew cold, and sweat beaded his forehead. He felt exposed, a rabbit trapped in the open as a hawk swooped down. He wanted to run away, but his legs trembled, and he could barely stand.  The Buka turned slightly. Jesse’s breath caught. Something within him knew he wasn’t the kite’s target. “Mom, look out!”  Kentaro was still searching for the kite, but the terror in Jesse’s voice brought him sprinting. His box kite crashed, forgotten. “What is it?”  Jesse shook his head. There was no time. The Buka was moving faster. It was so big, a window of darkness the size of a bus. How could anyone control a kite that huge?  “Jesse, I’m here.” Kentaro squeezed his shoulders.  The wind blew harder. Jesse’s kite tugged its line, like an animal struggling to escape its leash. Jesse twisted away from his step-father, circling his kite around to intercept the Buka. He couldn’t see the other kite’s line, but he knew where it had to be. Closer and closer it flew. It began to block the wind, forcing Jesse to shorten his line to keep his own kite aloft.  Jesse backed away from the fence, trying to stay between the black kite and his mother. The Buka paused in its flight, then dove. Jesse yanked his own line, hoping to tangle his kite with the Buka and bring them both down.  The blue line quivered. Ice shot through Jesse’s fingers. He cried out, and then his line was falling, cut cleanly a short length from the kite.  “Mom!” Jesse screamed.  The Buka touched the earth, an enormous sheet of blackness that blotted half the park from view. When it rose, Jesse’s mother was on the ground, shaking uncontrollably.  “Susan!” Kentaro shouted. He reached her side before Jesse, catching her shoulders and moving her away from the steel legs of the picnic table. “Jesse, get her medicine from the car. Quickly!”  Jesse cried as he ran, knowing it was too late. Whatever the black kite had done, no pill would fix it.  Beside the parking lot, his Superman kite sat torn and broken in the branches of a spruce tree.  One year later, Jesse sat in his bedroom, painting broad, garish stripes over the paper of his newest kite. He longed to add tassels to the corners, but such decoration would be too obviously Asian.  After his mother’s death, the courts had given full custody to his biological father Sam, a man Jesse hadn’t seen in years. But Sam had kept current with his child support, and Michigan law said that was enough to tear Jesse away from Kentaro.  Jesse jabbed his brush into the paint, remembering how Sam had thrown out Jesse’s ebony chopsticks, his anime collection, anything with any trace of Kentaro’s Japanese heritage. He hoped this kite would slip past Sam’s radar. Jesse needed a kite, and what better design than the Hata, a diamond-shaped fighter traditionally painted red, white, and blue?  Jesse pushed away from the desk and stretched. The small bedroom still didn’t feel like his room. Faded patches marked the wood-paneled walls of the former den. Several cigarette burns marked the carpet.  He glanced at the picture taped to the window, the one of his mother after one of her bike races. The hospital said her death last year was a reaction to her epilepsy medicine. Jesse knew better.  He returned to the desk and examined the bamboo splints. The wood flexed into a perfect arc. He tested the curve and the balance, then used string to bind the splints together.  By the time Sam’s car door slammed in the driveway, the paint had dried enough for Jesse to begin gluing the paper to the frame. The paper rustled, tasting an unfelt wind.  The bedroom door opened. “You got a card or something,” Sam said. Jesse wondered if anyone else would have heard the slur in his voice.  “Thanks.” Had Sam been drinking to mark the anniversary of Susan’s death? Why such grief for a woman he hadn’t seen in nine years? Jesse shoved the bitterness aside and grabbed the envelope. There was no return address. His pulse quickened, and he casually tossed it onto his desk.  “Aren’t you going to open it?” Sam asked.  “I’m busy.”  Sam grabbed the envelope. “Open it.”  Forcing a smile, Jesse used one of his Exacto knives to slit the envelope. Inside the card, Kentaro’s precise handwriting read:   Jesse,  It’s been a year since Susan left us. I want you to know you are still in my thoughts, and in my heart.  That was as far as Jesse got before Sam snatched it away. “I knew it. Why can’t he leave us alone? You’re my son!”  Jesse grabbed for the card and missed.  “Bad enough he took Susan. You’re my son.” He glanced past Jesse, studying the half-assembled kite. “What’ve you been working on?”  “Nothing much.” Jesse held his breath.  He scowled. “Where’d you learn how to build these?”  “The library,” Jesse said.  Sam’s forehead wrinkled as he stared at the kite, like he was trying to dig up a long-buried memory. “Weren’t you out flying kites the day Susan died?” His face tightened. “You and that Jap were both flying the things.”  “You don’t understand. I have to build this.”  “Why?” Sam snapped.  Jesse bit his lip. He had never told anyone about the black Buka and his own failure. Sometimes he spotted the Buka in the distance as he mowed the lawn or walked back from the bus stop. It was waiting for something. Waiting for him. Jesse didn’t know why. All he knew was that he had to find a way to beat it. “Sam, please.”  “I’m your father. When are you going to start calling me Dad?” He grabbed the kite, breaking the spars and using the jagged ends to tear the paper. He crumpled it into a ball, then forced the whole thing into the garbage. “The sooner you stop living in the past, the better off we’ll be.”  The door slammed. Jesse counted to twenty, first in English, then Japanese. When Sam didn’t return, he went to the trash and pulled out the remains of his kite. One look told him it was unsalvageable.  “Kentaro was my father,” he muttered as he retrieved his Exacto knife and tried to cut the few bits of undamaged paper from the frame. It had been four months since his last letter to Kentaro. Sam had almost caught him sneaking back from the public mailbox down the street. Jesse didn’t dare use their own mailbox. He even had to buy his own stamps from the machine at the grocery store. Sam noticed missing stamps as quickly as he spotted long-distance calls on the phone bill.  Jesse glanced down and found he had cut the paper into a rough hexagon, like a Rokkaku kite. He trimmed tiny sticks of bamboo, fitting them to the lines of the Rokkaku. A strange warmth flowed through his fingers. The glue dried impossibly fast. He grabbed a spool of black thread and tied a small four-point bridle.  As he finished the last knot, the kite leapt from the desk. The spool of thread bounced to the carpet.  Jesse held out his hand in amazement, and the tiny kite returned. The thread tickled his fingers. Abstract shapes of red and blue covered the back, like an exotic butterfly.  “Hold still,” Jesse said. The kite obeyed, hovering on an unfelt wind. Smiling, Jesse cut the thread, leaving a yard or so dangling from the bridle. “Fly around-”  Before he could finish the thought, the kite flew a fast circle around the room.  Fingers shaking, Jesse scrawled a quick note on another scrap of paper. He tied it to the thread.  “Can you find him?”  The kite flew to the window and spun like a top. Jesse slid the pane to one side, then pushed out the bottom corner of the screen. Distance soon swallowed the little Rokkaku, leaving Jesse to wonder how long it would take to traverse the forty miles to Kentaro’s home.  Later that night, Jesse heard a tapping at the window. He climbed out of bed and flipped on his desk lamp. Pushing the window open, he helped the kite inside. A tight tube of paper was knotted to the thread.   Jesse,  I won’t pretend to understand the miracle you’ve created, but I thank God you did. Tonight it was like having you here with me.  You have a gift. I’ve known it ever since you flew your first kite. I’m more proud of you than you can know.  I trust this little Rokkaku will find you again. I wish I could do the same.  I love you.  Kentaro  Grinning like it was Christmas morning, Jesse grabbed pen and paper and began to write.  It took two months to build another Hata fighting kite. He worked on it in the attic and hid it behind the artificial Christmas tree. Whatever power had guided him with the Rokkaku remained, and he could feel the Hata yearning to soar through the clouds. Finding time to fly it was difficult, though.  Jesse grabbed his lunch and his backpack as he headed for the door. “See you tonight, Dad.” The word burnt his mouth, but it kept Sam happy.  Outside, Jesse crouched behind the bushes and waited. He froze as the front door swung open, and barely breathed until Sam’s car disappeared down the street. Only then did he sneak back inside to fetch his kite.  More than an hour later, he was exiting the bus near the park where his mother had died.  Jesse searched the park as he walked. He knew Kentaro wouldn’t be there, but he looked anyway. Jesse had said when and where to meet, but Kentaro refused. He wouldn’t violate Sam’s rules.  “Why do you care what Sam thinks?” Jesse muttered, more hurt than angry. “He’s not my father.”  He was worried about Kentaro. The last few letters had been different, somehow. Longer, almost rambling. And Kentaro’s handwriting had decayed ever so slightly. It still looked like he drew each letter with a ruler, but the spacing was more ragged.  He spotted a black shadow among the clouds. He felt no surprise. He had seen the Buka more and more often lately. It always stayed in the distance, watching.  Jesse tugged on the leather work gloves he had swiped from the garage, then hoisted his diamond Hata kite. Red and blue Kanji characters marked the kite’s center: tanchi, the symbols for heaven and earth.  There was little wind, but it didn’t matter. Jesse could feel the Hata pulling skyward. He held the stiff thirty-pound line. The first hundred feet were the cutting line, coated in glue and ground glass. Holding the line carefully, Jesse allowed the kite to rise, and soon it was flying above the trees.  He ignored the Buka as he practiced. A sharp dive here, followed by a wide loop, then another dive to slash an opponent’s line. He visualized the cutting line as a blade slicing through the air. He couldn’t tell how much of his control was physical and how much was like the little Rokkaku, an extension of himself that obeyed thought alone.  Jesse had spent hours staring out the window at school, watching the birds and memorizing their movements. The small sparrows banding together to drive away the crows . . . the jostling of pigeons as they fought for scraps by the cafeteria . . . the hummingbirds hovering and darting at the feeders by the fence.  Time slowed as he imitated those movements. He stilled the Hata in the midst of a breeze, then darted a short distance. He circled, taunting an imaginary crow. Faster and faster the kite danced through each attack.  The wind changed, bringing the smell of cigarette smoke. Before Jesse could move, a strong hand clamped his shoulder. “I’ve spent two hours trying to find your worthless hide,” Sam thundered.  Jesse kept his grip on the kite string, trying to reel it in without being too obvious. “I’m sorry. I-”  “Kites again.” Sam shook his head in disgust. He flicked the cigarette to the ground and stomped it out. “He told me this was where you’d be.”  “Who?”  “What is it about him?” Sam rubbed his scalp, making his hair stand up in spikes. “How did that little Jap turn you against me?”  “He didn’t.” Jesse caught himself before he could add, You did.  “I figured I’d be nice. Give you a chance to say good-bye. You know what it’s like to walk into that school and have your secretary tell me you were out? To look at me like I’m an incompetent father because I don’t know where my own kid is?”  “What do you mean, say good-bye?” Jesse asked. He could feel the cold in his gut, and his hands began to shake.  Sam sighed, and a bit of his anger seemed to dissipate. “Jesse, Kentaro’s got himself a nasty case of cancer. He’s been in and out of the hospital for months. They didn’t catch it in time, and-”  “You’re lying!”  Sam’s expression hardened. “I wouldn’t lie about this.”  Jesse looked up. The Buka had moved closer, silently confirming Sam’s words. The black kite was like a window into darkness, swallowing the sky itself.  “He can’t be sick,” Jesse said. “He would have told me.”  “So you have been talking to him.” Sam reached into his pocket and pulled out a Swiss Army knife. The blade clicked open, and for a second Jesse thought Sam was going to stab him. Instead, he grabbed the kite line.  “This is the only fighter I have!” Jesse stared at the Buka. “You have to take me to the hospital. You have to let me save him!”  “I’m your father. It’s time to let him go, son.”  Jesse yanked the line hard. This part lacked the cutting glass, but the waxed line still cut deep into Sam’s palm. Sam swore, but didn’t release his grip.  “Dad, please,” Jesse said.  Sam pressed the knife blade against the line. Taut with tension, the line snapped instantly.  “You’re grounded until I say otherwise. And if you take one step out of my house, except for school, I’ll put you in the hospital myself.”  Tears stung Jesse’s eyes as he watched the Hata spin downward. “No,” he whispered. Thinking about his little Rokkaku, he reached toward the Hata, trying to control it. “Don’t fall.”  “Come on,” Sam said, tugging him toward the parking lot. “Behave yourself, and maybe I’ll take you to visit Kentaro next week.”  “Next week will be too late.” Jesse concentrated, imagining he still held the Hata’s line. He could feel the wind beneath the kite. Ever so gently, he shaped the air itself, creating updrafts to lift the kite higher. Slowly, the kite responded, floating on nonexistent winds. “Wait for me.”  “What’s that?”  “Nothing.” To his left, the black Buka dipped in salute and disappeared.  Sneaking out of school that afternoon was absurdly easy. The principal would call Sam, of course, and Jesse would be in even more trouble, but that didn’t matter. All that mattered was getting to the hospital.  As the bus pulled to a halt, Jesse spotted the black kite hovering over the parking garage, drifting slowly closer. He grabbed his backpack and ran to the back of the hospital. At the fire escape, he climbed the dumpsters to reach the bottom rung. Minutes later, he was on the roof, unzipping his backpack to free his little Rokkaku. He doubted it would do much against the Buka, but he planned to fight with any tool he could get.  The Rokkaku began to orbit Jesse’s head, spinning like a top to shed the drizzle that had begun to fall. Jesse clenched his fists, praying the Hata still flew and calling it with all his heart. “Please . . . ”  The Buka drew closer. It was smaller than Jesse remembered. Maybe four feet high and twice as wide. Jesse’s little Rokkaku leapt in response, like an angry kitten.  Where was the Hata? Had it fallen? It had taken Jesse several hours to get out of school and make his way here. Whatever strange magic connected him to the kites, maybe it hadn’t been strong enough to keep the Hata aloft.  And then something tickled his hand. Jesse clamped down, feeling the familiar line tug his fingers. The end was frayed from Sam’s knife, leaving only a few hundred feet. It would have to be enough.  The Rokkaku darted out of the way as Jesse flew the Hata into position, sweeping the red and blue diamond in a wide figure eight.  The Buka streaked toward the hospital, as if it had been waiting for this moment. Jesse ran along the roof, pulling his kite down to intercept. His shorter line was an advantage here, giving him speed. The Hata ducked beneath the bigger kite, then flew upward. The Buka pulled back, barely escaping Jesse’s cutting line.  How long would the line last in the rain? he wondered. At least he hadn’t used the traditional mix of rice paste and broken glass. Wood glue might be too modern for Kentaro, but it should endure the water better.  Jesse moved to intercept another attack, sweeping his kite like an enormous saber. Each time the Buka approached, Jesse was there, using every trick he could think of to drive it back.  His arms began to ache. He pulled in a bit of slack, hoping to lure the black kite closer. If he could just get his cutting line within range, he could try to cut the other kite down. Even though he couldn’t see the Buka’s line, he knew in his blood where it had to be. But the Buka moved impossibly fast, and every one of Jesse’s attacks came up short.  “Jesse! How the hell did you get up here?”  The line dug into his fingers as he turned to see Sam and a security guard stepping on to the roof. Someone must have seen Jesse on the roof.  The Buka took advantage of Jesse’s distraction, swooping down at a sharp angle. Jesse ran to block, but the Buka veered, dragging its invisible line toward Jesse’s own kite. The Buka’s line brushed the edge of Jesse’s Hata. Terrible cold burned Jesse’s hands, and then it was all he could do to keep the Hata aloft.  “Kid, watch out for the edge,” the guard yelled.  It gave Jesse an idea. He hurried toward the corner of the roof and hopped onto the ledge, a low, foot-wide wall of concrete. The cars in the street looked like plastic models. Jesse wavered slightly, yanking his kite to correct his balance.  “Jesse, no! Get down now!”  There was real fear in Sam’s voice. “Stay back,” Jesse yelled. His little Rokkaku buzzed anxiously around his head. He could hear Sam and the guard talking, but at least they weren’t coming any closer. They wouldn’t risk him falling. The next time he spared a glance, the roof was empty.  Jesse pulled the Hata in, trying to assess the damage. The bamboo spar had cracked near the left corner, causing it to flap back and forth.  The Buka attacked again, moving to block Jesse’s wind, then streaking down as the Hata fell. Jesse dragged his kite closer, until he was pulling the cutting line itself. The glass scraped skin from his palms, but he kept pulling, avoiding the Buka’s attack.  He loosed his hands suddenly, allowing the Hata to leap higher. It swung in a broad, flat arc, seeking to decapitate the other kite. The Buka circled away.  Attack and parry, feint and counter. The sparrow and the starling. Every move put more strain on Jesse’s damaged kite. He had waterproofed and layered the kite, but there was only so much it could take.  “Jesse, come down this instant, dammit!”  Sam had returned. Jesse ignored him, but he couldn’t ignore the second voice. Weak and hoarse, Kentaro yelled, “Listen to your father, Jesse.”  Jesse glanced back. Kentaro stood supported by Sam on one side and the guard on the other. A trailing tube connected him to an I.V. stand. The rain-damp hospital gown emphasized the boniness of his shoulders. His bare arms were little more than sticks. Panic clenched Jesse’s chest. The Buka was so close, and now Kentaro stood exposed.  “Get out of here,” Jesse yelled. “Kentaro, please!”  Kentaro reached out. “If you won’t obey your father, obey me. Come down.”  “I’m trying to save you!”  “I know.” Kentaro smiled. “But not like this.”  Sudden fear made Jesse turn. The Buka had already begun its attack. Jesse jerked the line with all his strength, but it was too late. The Buka’s invisible line cut the Hata a second time. Jesse had kept the Buka from cutting his line, but it made little difference.  “No . . . ” The Hata began to fall, little more than a crumple of silk and sticks. He heard footsteps behind him.  “No,” he said again, more firmly this time. His little Rokkaku shot backward, and he heard Sam cry out in surprise.  Jesse tightened his grip, forcing his broken kite higher while the Rokkaku kept Sam back. Jesse battled the wind and the kite’s own weight with for every inch.  “What’s he doing?” Sam demanded.  “Trying to save my life,” Kentaro said.  “I don’t understand.”  “I don’t either,” Kentaro said. “But that is what he’s doing.”  Jesse relaxed his fingers, feeling blood pound through the cramped muscles. His kite bucked harder as the wind tossed it about.  “We are family, Jesse,” Kentaro said. “Nothing can change that. Not the court, not even death. Your little Rokkaku showed me the strength of that bond. You don’t have to do this.”  “He’s not your son,” Sam snapped. “I swear, if you weren’t dying-”  “He’s not going to die,” Jesse said, newfound determination in his voice. The Rokkaku shot past his ear and disappeared into the rain. Jesse didn’t need to see it. He could sense it spinning through the air.  The Rokkaku collided with the black Buka, punching a hole in the blackness.  The black kite bucked, but Jesse had already brought the Rokkaku around, tearing a second hole, then a third. The slender spars of his Rokkaku splintered with each blow, but Jesse forced it to attack again and again until it disintegrated.  Only then did he allow his Hata to fall. His line intersected the Buka’s, and he pulled so hard he fell onto his back, knocking the breath from his lungs. The last thing he saw was the black kite dropping out of sight, followed by his own ruined Hata.  Sam’s fingers dug into Jesse’s arm, hauling him upright. Fear, confusion, and fury all battled across Sam’s features. Jesse wondered which would win.  The guard yelled, forestalling the argument. “Hey, you can’t come up here.”  A young girl stood in the doorway leading down into the hospital. The guard shook his head. “When did we get a revolving door on the rooftop?”  The girl wore a black leather jacket and torn jeans. Her black shoes gleamed wetly, even though the rain seemed not to touch her. In her hands, she held a small black Buka kite. She touched the guard with the corner of the kite. “Leave.”  Blank-faced, the guard retreated back into the hospital. Jesse started to shiver, sensing the power in that kite.  “You know the traditions?” she asked, her eyes never leaving Jesse’s.  Slowly, Jesse nodded. He clasped his bleeding hands together to stop them from trembling.  “What traditions?” Sam snapped.  “When fliers battle,” Kentaro said, “one who cuts down another’s kite often claims and flies that kite as his own.”  “No more kites,” Sam said. “If I catch you with another one of those damn-”  “You won’t catch him,” the girl said, grinning.  Jesse pulled free of Sam’s grasp and walked toward her. “You killed my mother.” He couldn’t feel anything at all. Kentaro’s hand came to rest on Jesse’s shoulder.  “A chemical reaction killed your mother,” she said. “I helped her spirit on the next stage of her journey. It’s what I do.” She frowned. “What you do, now.” She held out the Buka.  Jesse put his hand on Kentaro’s. “What about my father?”  “His body is failing. If it’s any comfort, you’ll be with him at the end. You’ll be the one to ease him on his way.”  “No,” Jesse said. “You can’t make me-”  “I don’t understand,” Sam said, coming around to Jesse’s other side. “It’s just a kite.” He reached toward the girl.  From the center of the kite, a black line snapped out to hit Sam in the chest. He fell back, gasping.  “Stop,” Jesse said. At once the kite obeyed, and the line vanished. “Sam, are you okay?”  Sam nodded, though his face was pale.  “You will have power and responsibility both,” the girl said. “Most importantly, you will have freedom.”  Kentaro started to speak, but a coughing fit took him.  “Leave them alone!” Jesse took a step toward the girl, but she shook her head. This wasn’t her doing. Jesse caught Kentaro and held him until the fit passed.  Jesse’s eyes watered. “I won’t kill Kentaro.”  “I’ll return for him if you don’t,” she said. “Which would bring him greater peace?”  Slowly, Jesse reached for the kite. It was surprisingly light. The black paper was dark as night, with no sign of damage, but he recognized the Buka he had fought. The bamboo spars were yellow with age, and the bridle was simple hemp. A sparkling of light trailed from the bridle to his hands, hands which no longer bled or hurt.  “Jesse, what are you doing?” Sam asked.  Before anyone could react, Jesse pressed the kite into Kentaro’s hands. The girl started to protest, but Jesse cut her off. “It’s my kite now. I choose to give it to him.” Already he saw new strength in Kentaro’s fragile frame. “Give it to me when I’m older, if you want. But at least this way . . . this way you could still visit sometimes? We could fly kites again.” He glanced at Sam, daring him to argue.  But Sam said nothing. More than anything, he looked lost.  Kentaro gave Jesse a quick hug, and Jesse marveled at the strength in those arms, even as the contact sent frigid chills through his body.  “Are you sure, Jesse?”  He nodded.  “I almost forgot.” The girl reached into her jacket and pulled out a small scrap of blue and red. “You’ll want this, I think.” She took Kentaro’s hand, leading him away.  Seconds later, Sam and Jesse stood alone in the rain.  Jesse cleared his throat. “Thank you. For telling me about Kentaro.”  Sam stared for a long time, until Jesse began to fidget. “That was . . . that was pretty impressive,” he said finally. “The way you handled that kite.”  “Thanks.”  “Kentaro-” Sam hesitated. “He did a good job with you, didn’t he?”  Jesse flexed his hands, studying the newly healed pink skin. “He’s family. I had to save him.”  “Yeah.” Sam squeezed Jesse’s shoulder. “You did a good job, son.”  As he followed Sam inside, Jesse stopped to look into the sky, where the black Buka saluted with a broad ‘J’ before disappearing into the clouds. Jim C. Hines has sold six novels, forty short stories, and one bumper sticker at the time this bio was written. His short work has appeared in Realms of Fantasy, Sword & Sorceress, and Turn the Other Chick, among others. His story \"Blade of the Bunny\" earned him a great big trophy from Writers of the Future back in '99. Hines is a known goblin sympathizer, author of the humorous goblin trilogy from DAW Books. His next novel, The Stepsister Scheme, will be out in January of 2009, and is best described as a mash-up of fairy tale princesses and Charlie's Angels. He lives in Michigan with his wife and two children.", "text": "4820 words, short story\nGift of the Kites\nThe first time Jesse saw the black Buka was in the park. He was flying a plastic Superman kite, dueling against his step-father’s rainbow box kite.\nJesse yanked the blue nylon string, swooping his kite toward his step-father’s.\nKentaro dodged easily. “Too broad a strike,” he called, laughing. “A true fighter kite would loop around and cut your line.”\n“Get him, Jesse,” cheered Jesse’s mother, sitting in the shade on one of the picnic benches.\nAt twelve years old, Jesse felt a mix of pride and embarrassment at her enthusiasm. Flushing, he unwrapped a bit more line, sending his kite higher. He dove again, missed, then tugged the kite in a tight turn that nearly clipped Kentaro’s kite. His mother whistled.\n“Much better,” Kentaro said, grinning. He pulled his kite through a long ‘J’ in salute. “Amazing control from a plastic store-bought kite. You’re sure you have no Japanese blood?”\nA shadow caught Jesse’s attention. A black rectangular kite leapt from the horizon, corkscrewing through the sky. Jesse ran toward the fence, hoping to glimpse the kite’s owner. His Superman kite followed like an obedient blue and red puppy.\n“What is it?” his mother called.\nHigher and higher the black kite flew. The string was invisible to Jesse’s eyes, but given the angle, the owner had to be by the highway. The wind carried exhaust fumes to Jesse’s nose.\n“It’s a Buka kite,” Jesse yelled. The black fighting kite moved like no kite he had ever seen. It flew and bucked like a thing alive.\nKentaro shielded his eyes. “I see nothing.”\nJesse’s bowels grew cold, and sweat beaded his forehead. He felt exposed, a rabbit trapped in the open as a hawk swooped down. He wanted to run away, but his legs trembled, and he could barely stand.\nThe Buka turned slightly. Jesse’s breath caught. Something within him knew he wasn’t the kite’s target. “Mom, look out!”\nKentaro was still searching for the kite, but the terror in Jesse’s voice brought him sprinting. His box kite crashed, forgotten. “What is it?”\nJesse shook his head. There was no time. The Buka was moving faster. It was so big, a window of darkness the size of a bus. How could anyone control a kite that huge?\n“Jesse, I’m here.” Kentaro squeezed his shoulders.\nThe wind blew harder. Jesse’s kite tugged its line, like an animal struggling to escape its leash. Jesse twisted away from his step-father, circling his kite around to intercept the Buka. He couldn’t see the other kite’s line, but he knew where it had to be. Closer and closer it flew. It began to block the wind, forcing Jesse to shorten his line to keep his own kite aloft.\nJesse backed away from the fence, trying to stay between the black kite and his mother. The Buka paused in its flight, then dove. Jesse yanked his own line, hoping to tangle his kite with the Buka and bring them both down.\nThe blue line quivered. Ice shot through Jesse’s fingers. He cried out, and then his line was falling, cut cleanly a short length from the kite.\n“Mom!” Jesse screamed.\nThe Buka touched the earth, an enormous sheet of blackness that blotted half the park from view. When it rose, Jesse’s mother was on the ground, shaking uncontrollably.\n“Susan!” Kentaro shouted. He reached her side before Jesse, catching her shoulders and moving her away from the steel legs of the picnic table. “Jesse, get her medicine from the car. Quickly!”\nJesse cried as he ran, knowing it was too late. Whatever the black kite had done, no pill would fix it.\nBeside the parking lot, his Superman kite sat torn and broken in the branches of a spruce tree.\nOne year later, Jesse sat in his bedroom, painting broad, garish stripes over the paper of his newest kite. He longed to add tassels to the corners, but such decoration would be too obviously Asian.\nAfter his mother’s death, the courts had given full custody to his biological father Sam, a man Jesse hadn’t seen in years. But Sam had kept current with his child support, and Michigan law said that was enough to tear Jesse away from Kentaro.\nJesse jabbed his brush into the paint, remembering how Sam had thrown out Jesse’s ebony chopsticks, his anime collection, anything with any trace of Kentaro’s Japanese heritage. He hoped this kite would slip past Sam’s radar. Jesse needed a kite, and what better design than the Hata, a diamond-shaped fighter traditionally painted red, white, and blue?\nJesse pushed away from the desk and stretched. The small bedroom still didn’t feel like his room. Faded patches marked the wood-paneled walls of the former den. Several cigarette burns marked the carpet.\nHe glanced at the picture taped to the window, the one of his mother after one of her bike races. The hospital said her death last year was a reaction to her epilepsy medicine. Jesse knew better.\nHe returned to the desk and examined the bamboo splints. The wood flexed into a perfect arc. He tested the curve and the balance, then used string to bind the splints together.\nBy the time Sam’s car door slammed in the driveway, the paint had dried enough for Jesse to begin gluing the paper to the frame. The paper rustled, tasting an unfelt wind.\nThe bedroom door opened. “You got a card or something,” Sam said. Jesse wondered if anyone else would have heard the slur in his voice.\n“Thanks.” Had Sam been drinking to mark the anniversary of Susan’s death? Why such grief for a woman he hadn’t seen in nine years? Jesse shoved the bitterness aside and grabbed the envelope. There was no return address. His pulse quickened, and he casually tossed it onto his desk.\n“Aren’t you going to open it?” Sam asked.\n“I’m busy.”\nSam grabbed the envelope. “Open it.”\nForcing a smile, Jesse used one of his Exacto knives to slit the envelope. Inside the card, Kentaro’s precise handwriting read:\nJesse,\nIt’s been a year since Susan left us. I want you to know you are still in my thoughts, and in my heart.\nThat was as far as Jesse got before Sam snatched it away. “I knew it. Why can’t he leave us alone? You’re my son!”\nJesse grabbed for the card and missed.\n“Bad enough he took Susan. You’re my son.” He glanced past Jesse, studying the half-assembled kite. “What’ve you been working on?”\n“Nothing much.” Jesse held his breath.\nHe scowled. “Where’d you learn how to build these?”\n“The library,” Jesse said.\nSam’s forehead wrinkled as he stared at the kite, like he was trying to dig up a long-buried memory. “Weren’t you out flying kites the day Susan died?” His face tightened. “You and that Jap were both flying the things.”\n“You don’t understand. I have to build this.”\n“Why?” Sam snapped.\nJesse bit his lip. He had never told anyone about the black Buka and his own failure. Sometimes he spotted the Buka in the distance as he mowed the lawn or walked back from the bus stop. It was waiting for something. Waiting for him. Jesse didn’t know why. All he knew was that he had to find a way to beat it. “Sam, please.”\n“I’m your father. When are you going to start calling me Dad?” He grabbed the kite, breaking the spars and using the jagged ends to tear the paper. He crumpled it into a ball, then forced the whole thing into the garbage. “The sooner you stop living in the past, the better off we’ll be.”\nThe door slammed. Jesse counted to twenty, first in English, then Japanese. When Sam didn’t return, he went to the trash and pulled out the remains of his kite. One look told him it was unsalvageable.\n“Kentaro was my father,” he muttered as he retrieved his Exacto knife and tried to cut the few bits of undamaged paper from the frame. It had been four months since his last letter to Kentaro. Sam had almost caught him sneaking back from the public mailbox down the street. Jesse didn’t dare use their own mailbox. He even had to buy his own stamps from the machine at the grocery store. Sam noticed missing stamps as quickly as he spotted long-distance calls on the phone bill.\nJesse glanced down and found he had cut the paper into a rough hexagon, like a Rokkaku kite. He trimmed tiny sticks of bamboo, fitting them to the lines of the Rokkaku. A strange warmth flowed through his fingers. The glue dried impossibly fast. He grabbed a spool of black thread and tied a small four-point bridle.\nAs he finished the last knot, the kite leapt from the desk. The spool of thread bounced to the carpet.\nJesse held out his hand in amazement, and the tiny kite returned. The thread tickled his fingers. Abstract shapes of red and blue covered the back, like an exotic butterfly.\n“Hold still,” Jesse said. The kite obeyed, hovering on an unfelt wind. Smiling, Jesse cut the thread, leaving a yard or so dangling from the bridle. “Fly around-”\nBefore he could finish the thought, the kite flew a fast circle around the room.\nFingers shaking, Jesse scrawled a quick note on another scrap of paper. He tied it to the thread.\n“Can you find him?”\nThe kite flew to the window and spun like a top. Jesse slid the pane to one side, then pushed out the bottom corner of the screen. Distance soon swallowed the little Rokkaku, leaving Jesse to wonder how long it would take to traverse the forty miles to Kentaro’s home.\nLater that night, Jesse heard a tapping at the window. He climbed out of bed and flipped on his desk lamp. Pushing the window open, he helped the kite inside. A tight tube of paper was knotted to the thread.\nJesse,\nI won’t pretend to understand the miracle you’ve created, but I thank God you did. Tonight it was like having you here with me.\nYou have a gift. I’ve known it ever since you flew your first kite. I’m more proud of you than you can know.\nI trust this little Rokkaku will find you again. I wish I could do the same.\nI love you.\nKentaro\nGrinning like it was Christmas morning, Jesse grabbed pen and paper and began to write.\nIt took two months to build another Hata fighting kite. He worked on it in the attic and hid it behind the artificial Christmas tree. Whatever power had guided him with the Rokkaku remained, and he could feel the Hata yearning to soar through the clouds. Finding time to fly it was difficult, though.\nJesse grabbed his lunch and his backpack as he headed for the door. “See you tonight, Dad.” The word burnt his mouth, but it kept Sam happy.\nOutside, Jesse crouched behind the bushes and waited. He froze as the front door swung open, and barely breathed until Sam’s car disappeared down the street. Only then did he sneak back inside to fetch his kite.\nMore than an hour later, he was exiting the bus near the park where his mother had died.\nJesse searched the park as he walked. He knew Kentaro wouldn’t be there, but he looked anyway. Jesse had said when and where to meet, but Kentaro refused. He wouldn’t violate Sam’s rules.\n“Why do you care what Sam thinks?” Jesse muttered, more hurt than angry. “He’s not my father.”\nHe was worried about Kentaro. The last few letters had been different, somehow. Longer, almost rambling. And Kentaro’s handwriting had decayed ever so slightly. It still looked like he drew each letter with a ruler, but the spacing was more ragged.\nHe spotted a black shadow among the clouds. He felt no surprise. He had seen the Buka more and more often lately. It always stayed in the distance, watching.\nJesse tugged on the leather work gloves he had swiped from the garage, then hoisted his diamond Hata kite. Red and blue Kanji characters marked the kite’s center: tanchi, the symbols for heaven and earth.\nThere was little wind, but it didn’t matter. Jesse could feel the Hata pulling skyward. He held the stiff thirty-pound line. The first hundred feet were the cutting line, coated in glue and ground glass. Holding the line carefully, Jesse allowed the kite to rise, and soon it was flying above the trees.\nHe ignored the Buka as he practiced. A sharp dive here, followed by a wide loop, then another dive to slash an opponent’s line. He visualized the cutting line as a blade slicing through the air. He couldn’t tell how much of his control was physical and how much was like the little Rokkaku, an extension of himself that obeyed thought alone.\nJesse had spent hours staring out the window at school, watching the birds and memorizing their movements. The small sparrows banding together to drive away the crows . . . the jostling of pigeons as they fought for scraps by the cafeteria . . . the hummingbirds hovering and darting at the feeders by the fence.\nTime slowed as he imitated those movements. He stilled the Hata in the midst of a breeze, then darted a short distance. He circled, taunting an imaginary crow. Faster and faster the kite danced through each attack.\nThe wind changed, bringing the smell of cigarette smoke. Before Jesse could move, a strong hand clamped his shoulder. “I’ve spent two hours trying to find your worthless hide,” Sam thundered.\nJesse kept his grip on the kite string, trying to reel it in without being too obvious. “I’m sorry. I-”\n“Kites again.” Sam shook his head in disgust. He flicked the cigarette to the ground and stomped it out. “He told me this was where you’d be.”\n“Who?”\n“What is it about him?” Sam rubbed his scalp, making his hair stand up in spikes. “How did that little Jap turn you against me?”\n“He didn’t.” Jesse caught himself before he could add, You did.\n“I figured I’d be nice. Give you a chance to say good-bye. You know what it’s like to walk into that school and have your secretary tell me you were out? To look at me like I’m an incompetent father because I don’t know where my own kid is?”\n“What do you mean, say good-bye?” Jesse asked. He could feel the cold in his gut, and his hands began to shake.\nSam sighed, and a bit of his anger seemed to dissipate. “Jesse, Kentaro’s got himself a nasty case of cancer. He’s been in and out of the hospital for months. They didn’t catch it in time, and-”\n“You’re lying!”\nSam’s expression hardened. “I wouldn’t lie about this.”\nJesse looked up. The Buka had moved closer, silently confirming Sam’s words. The black kite was like a window into darkness, swallowing the sky itself.\n“He can’t be sick,” Jesse said. “He would have told me.”\n“So you have been talking to him.” Sam reached into his pocket and pulled out a Swiss Army knife. The blade clicked open, and for a second Jesse thought Sam was going to stab him. Instead, he grabbed the kite line.\n“This is the only fighter I have!” Jesse stared at the Buka. “You have to take me to the hospital. You have to let me save him!”\n“I’m your father. It’s time to let him go, son.”\nJesse yanked the line hard. This part lacked the cutting glass, but the waxed line still cut deep into Sam’s palm. Sam swore, but didn’t release his grip.\n“Dad, please,” Jesse said.\nSam pressed the knife blade against the line. Taut with tension, the line snapped instantly.\n“You’re grounded until I say otherwise. And if you take one step out of my house, except for school, I’ll put you in the hospital myself.”\nTears stung Jesse’s eyes as he watched the Hata spin downward. “No,” he whispered. Thinking about his little Rokkaku, he reached toward the Hata, trying to control it. “Don’t fall.”\n“Come on,” Sam said, tugging him toward the parking lot. “Behave yourself, and maybe I’ll take you to visit Kentaro next week.”\n“Next week will be too late.” Jesse concentrated, imagining he still held the Hata’s line. He could feel the wind beneath the kite. Ever so gently, he shaped the air itself, creating updrafts to lift the kite higher. Slowly, the kite responded, floating on nonexistent winds. “Wait for me.”\n“What’s that?”\n“Nothing.” To his left, the black Buka dipped in salute and disappeared.\nSneaking out of school that afternoon was absurdly easy. The principal would call Sam, of course, and Jesse would be in even more trouble, but that didn’t matter. All that mattered was getting to the hospital.\nAs the bus pulled to a halt, Jesse spotted the black kite hovering over the parking garage, drifting slowly closer. He grabbed his backpack and ran to the back of the hospital. At the fire escape, he climbed the dumpsters to reach the bottom rung. Minutes later, he was on the roof, unzipping his backpack to free his little Rokkaku. He doubted it would do much against the Buka, but he planned to fight with any tool he could get.\nThe Rokkaku began to orbit Jesse’s head, spinning like a top to shed the drizzle that had begun to fall. Jesse clenched his fists, praying the Hata still flew and calling it with all his heart. “Please . . . ”\nThe Buka drew closer. It was smaller than Jesse remembered. Maybe four feet high and twice as wide. Jesse’s little Rokkaku leapt in response, like an angry kitten.\nWhere was the Hata? Had it fallen? It had taken Jesse several hours to get out of school and make his way here. Whatever strange magic connected him to the kites, maybe it hadn’t been strong enough to keep the Hata aloft.\nAnd then something tickled his hand. Jesse clamped down, feeling the familiar line tug his fingers. The end was frayed from Sam’s knife, leaving only a few hundred feet. It would have to be enough.\nThe Rokkaku darted out of the way as Jesse flew the Hata into position, sweeping the red and blue diamond in a wide figure eight.\nThe Buka streaked toward the hospital, as if it had been waiting for this moment. Jesse ran along the roof, pulling his kite down to intercept. His shorter line was an advantage here, giving him speed. The Hata ducked beneath the bigger kite, then flew upward. The Buka pulled back, barely escaping Jesse’s cutting line.\nHow long would the line last in the rain? he wondered. At least he hadn’t used the traditional mix of rice paste and broken glass. Wood glue might be too modern for Kentaro, but it should endure the water better.\nJesse moved to intercept another attack, sweeping his kite like an enormous saber. Each time the Buka approached, Jesse was there, using every trick he could think of to drive it back.\nHis arms began to ache. He pulled in a bit of slack, hoping to lure the black kite closer. If he could just get his cutting line within range, he could try to cut the other kite down. Even though he couldn’t see the Buka’s line, he knew in his blood where it had to be. But the Buka moved impossibly fast, and every one of Jesse’s attacks came up short.\n“Jesse! How the hell did you get up here?”\nThe line dug into his fingers as he turned to see Sam and a security guard stepping on to the roof. Someone must have seen Jesse on the roof.\nThe Buka took advantage of Jesse’s distraction, swooping down at a sharp angle. Jesse ran to block, but the Buka veered, dragging its invisible line toward Jesse’s own kite. The Buka’s line brushed the edge of Jesse’s Hata. Terrible cold burned Jesse’s hands, and then it was all he could do to keep the Hata aloft.\n“Kid, watch out for the edge,” the guard yelled.\nIt gave Jesse an idea. He hurried toward the corner of the roof and hopped onto the ledge, a low, foot-wide wall of concrete. The cars in the street looked like plastic models. Jesse wavered slightly, yanking his kite to correct his balance.\n“Jesse, no! Get down now!”\nThere was real fear in Sam’s voice. “Stay back,” Jesse yelled. His little Rokkaku buzzed anxiously around his head. He could hear Sam and the guard talking, but at least they weren’t coming any closer. They wouldn’t risk him falling. The next time he spared a glance, the roof was empty.\nJesse pulled the Hata in, trying to assess the damage. The bamboo spar had cracked near the left corner, causing it to flap back and forth.\nThe Buka attacked again, moving to block Jesse’s wind, then streaking down as the Hata fell. Jesse dragged his kite closer, until he was pulling the cutting line itself. The glass scraped skin from his palms, but he kept pulling, avoiding the Buka’s attack.\nHe loosed his hands suddenly, allowing the Hata to leap higher. It swung in a broad, flat arc, seeking to decapitate the other kite. The Buka circled away.\nAttack and parry, feint and counter. The sparrow and the starling. Every move put more strain on Jesse’s damaged kite. He had waterproofed and layered the kite, but there was only so much it could take.\n“Jesse, come down this instant, dammit!”\nSam had returned. Jesse ignored him, but he couldn’t ignore the second voice. Weak and hoarse, Kentaro yelled, “Listen to your father, Jesse.”\nJesse glanced back. Kentaro stood supported by Sam on one side and the guard on the other. A trailing tube connected him to an I.V. stand. The rain-damp hospital gown emphasized the boniness of his shoulders. His bare arms were little more than sticks. Panic clenched Jesse’s chest. The Buka was so close, and now Kentaro stood exposed.\n“Get out of here,” Jesse yelled. “Kentaro, please!”\nKentaro reached out. “If you won’t obey your father, obey me. Come down.”\n“I’m trying to save you!”\n“I know.” Kentaro smiled. “But not like this.”\nSudden fear made Jesse turn. The Buka had already begun its attack. Jesse jerked the line with all his strength, but it was too late. The Buka’s invisible line cut the Hata a second time. Jesse had kept the Buka from cutting his line, but it made little difference.\n“No . . . ” The Hata began to fall, little more than a crumple of silk and sticks. He heard footsteps behind him.\n“No,” he said again, more firmly this time. His little Rokkaku shot backward, and he heard Sam cry out in surprise.\nJesse tightened his grip, forcing his broken kite higher while the Rokkaku kept Sam back. Jesse battled the wind and the kite’s own weight with for every inch.\n“What’s he doing?” Sam demanded.\n“Trying to save my life,” Kentaro said.\n“I don’t understand.”\n“I don’t either,” Kentaro said. “But that is what he’s doing.”\nJesse relaxed his fingers, feeling blood pound through the cramped muscles. His kite bucked harder as the wind tossed it about.\n“We are family, Jesse,” Kentaro said. “Nothing can change that. Not the court, not even death. Your little Rokkaku showed me the strength of that bond. You don’t have to do this.”\n“He’s not your son,” Sam snapped. “I swear, if you weren’t dying-”\n“He’s not going to die,” Jesse said, newfound determination in his voice. The Rokkaku shot past his ear and disappeared into the rain. Jesse didn’t need to see it. He could sense it spinning through the air.\nThe Rokkaku collided with the black Buka, punching a hole in the blackness.\nThe black kite bucked, but Jesse had already brought the Rokkaku around, tearing a second hole, then a third. The slender spars of his Rokkaku splintered with each blow, but Jesse forced it to attack again and again until it disintegrated.\nOnly then did he allow his Hata to fall. His line intersected the Buka’s, and he pulled so hard he fell onto his back, knocking the breath from his lungs. The last thing he saw was the black kite dropping out of sight, followed by his own ruined Hata.\nSam’s fingers dug into Jesse’s arm, hauling him upright. Fear, confusion, and fury all battled across Sam’s features. Jesse wondered which would win.\nThe guard yelled, forestalling the argument. “Hey, you can’t come up here.”\nA young girl stood in the doorway leading down into the hospital. The guard shook his head. “When did we get a revolving door on the rooftop?”\nThe girl wore a black leather jacket and torn jeans. Her black shoes gleamed wetly, even though the rain seemed not to touch her. In her hands, she held a small black Buka kite. She touched the guard with the corner of the kite. “Leave.”\nBlank-faced, the guard retreated back into the hospital. Jesse started to shiver, sensing the power in that kite.\n“You know the traditions?” she asked, her eyes never leaving Jesse’s.\nSlowly, Jesse nodded. He clasped his bleeding hands together to stop them from trembling.\n“What traditions?” Sam snapped.\n“When fliers battle,” Kentaro said, “one who cuts down another’s kite often claims and flies that kite as his own.”\n“No more kites,” Sam said. “If I catch you with another one of those damn-”\n“You won’t catch him,” the girl said, grinning.\nJesse pulled free of Sam’s grasp and walked toward her. “You killed my mother.” He couldn’t feel anything at all. Kentaro’s hand came to rest on Jesse’s shoulder.\n“A chemical reaction killed your mother,” she said. “I helped her spirit on the next stage of her journey. It’s what I do.” She frowned. “What you do, now.” She held out the Buka.\nJesse put his hand on Kentaro’s. “What about my father?”\n“His body is failing. If it’s any comfort, you’ll be with him at the end. You’ll be the one to ease him on his way.”\n“No,” Jesse said. “You can’t make me-”\n“I don’t understand,” Sam said, coming around to Jesse’s other side. “It’s just a kite.” He reached toward the girl.\nFrom the center of the kite, a black line snapped out to hit Sam in the chest. He fell back, gasping.\n“Stop,” Jesse said. At once the kite obeyed, and the line vanished. “Sam, are you okay?”\nSam nodded, though his face was pale.\n“You will have power and responsibility both,” the girl said. “Most importantly, you will have freedom.”\nKentaro started to speak, but a coughing fit took him.\n“Leave them alone!” Jesse took a step toward the girl, but she shook her head. This wasn’t her doing. Jesse caught Kentaro and held him until the fit passed.\nJesse’s eyes watered. “I won’t kill Kentaro.”\n“I’ll return for him if you don’t,” she said. “Which would bring him greater peace?”\nSlowly, Jesse reached for the kite. It was surprisingly light. The black paper was dark as night, with no sign of damage, but he recognized the Buka he had fought. The bamboo spars were yellow with age, and the bridle was simple hemp. A sparkling of light trailed from the bridle to his hands, hands which no longer bled or hurt.\n“Jesse, what are you doing?” Sam asked.\nBefore anyone could react, Jesse pressed the kite into Kentaro’s hands. The girl started to protest, but Jesse cut her off. “It’s my kite now. I choose to give it to him.” Already he saw new strength in Kentaro’s fragile frame. “Give it to me when I’m older, if you want. But at least this way . . . this way you could still visit sometimes? We could fly kites again.” He glanced at Sam, daring him to argue.\nBut Sam said nothing. More than anything, he looked lost.\nKentaro gave Jesse a quick hug, and Jesse marveled at the strength in those arms, even as the contact sent frigid chills through his body.\n“Are you sure, Jesse?”\nHe nodded.\n“I almost forgot.” The girl reached into her jacket and pulled out a small scrap of blue and red. “You’ll want this, I think.” She took Kentaro’s hand, leading him away.\nSeconds later, Sam and Jesse stood alone in the rain.\nJesse cleared his throat. “Thank you. For telling me about Kentaro.”\nSam stared for a long time, until Jesse began to fidget. “That was . . . that was pretty impressive,” he said finally. “The way you handled that kite.”\n“Thanks.”\n“Kentaro-” Sam hesitated. “He did a good job with you, didn’t he?”\nJesse flexed his hands, studying the newly healed pink skin. “He’s family. I had to save him.”\n“Yeah.” Sam squeezed Jesse’s shoulder. “You did a good job, son.”\nAs he followed Sam inside, Jesse stopped to look into the sky, where the black Buka saluted with a broad ‘J’ before disappearing into the clouds.\nJim C. Hines has sold six novels, forty short stories, and one bumper sticker at the time this bio was written. His short work has appeared in Realms of Fantasy, Sword & Sorceress, and Turn the Other Chick, among others. His story \"Blade of the Bunny\" earned him a great big trophy from Writers of the Future back in '99. Hines is a known goblin sympathizer, author of the humorous goblin trilogy from DAW Books. His next novel, The Stepsister Scheme, will be out in January of 2009, and is best described as a mash-up of fairy tale princesses and Charlie's Angels. He lives in Michigan with his wife and two children.", "source": "https://clarkesworldmagazine.com/hines_10_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Gift of the Kites by Jim C. Hines"}