{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bo Balder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "c7tMeCzCQkAD0o12f8eybTc4h4A=", "id": null, "license": null, "comments": "", "raw_text": "5140 words, short story  The Answer Was Snails  The alien must have been reading up on humidity conditions for its terrarium, because we’d already gotten three mistings today.  I lifted my head above the mud, where I’d lain hidden since dawn. I breathed through my snorkel reed, which was nearing the end of its usefulness. Another obstacle in my already busy day.  It was midmorning. The dawn creatures stopped slithering and screeching, making it marginally safe enough to go get breakfast. The alien provided our food because the terrarium wasn’t big enough for a real ecology. And anyway, it was a hodgepodge of plants and species the alien found pleasing. Or were on sale. The alien didn't seem particularly smart. The terrarium was a mess.  Needless to say, there were no plants or animals here I could eat. The upside was, they couldn’t eat me either, or at least, digest me. Still, the stupider ones kept trying.  I shook off that thought. I needed to focus. This was the only food I’d get today.  To reach the food dispenser, I needed to climb up out of the safety of the undergrowth and cross a stretch of gravel. Hell on the feet, since my shoes had long since died, and I’d be in full view of the flyers for at least half a minute. I hid under a pungent magenta leaf and peered up at the higher reaches of the terrarium. It looked safe for now.  I sprint-stumbled to the dispenser and banged my fist on the button. A variety of foodstuffs spilled out. Somewhere in there was a green stick that I could eat. Once, the alien had changed manufacturers, and I got very sick from the orange bar I used to eat. It took me a week of experimenting to find a new substance that was safe. I tossed out the globs and gross sticky bits that I couldn’t eat. That alone meant predators would be waking up and starting for the dispenser. There was my green bar. I had no clothes, so no pockets anymore, so I had to eat it right away or risk losing it.  The green stuff tasted of nothing, and its sticky, hardened peanut buttery texture made it hard to keep chewing and swallowing. But it kept me alive for another day. I took it one day at a time, as someone once told me, in another life.  I gobbled it down as fast as I could while I started back to the safety of the brightly striped, chittering jungle. Not to the same place as before, since I needed to get to my afternoon rendezvous with Annie as well as find new breathing reeds. I heard the buzz of a flyer approaching and managed to duck under the fronds of a fern tree just in time.  Breakfast: check. Now I had to travel to where this jungle terrarium borders on the desert one. That was tricky because sunlight started hitting the middle of the container just about then, and that woke the snails. Made them frisky. They would head for the terrarium walls, where they cleaned the glass with thousands of little sharp teeth, right across my route to the wall. And they weren't bright enough to just eat algae. Whenever they sensed something moving, they'd ditch the algae and go after it. Maybe they'd lived like that on whatever world they came from. They were victims, just like me. Car-sized victims who would eat me or die trying.  I crept up to a point where I could see the snails. They couldn’t see me because they didn’t have eyes. Excellent movement sensors though. The group of snails moved in the right direction, away from where I wanted to go. I rose slowly. No reaction yet. I sprinted across the little beach, into the shallow stream that I had to follow to reach the other side. Several snails turned after me now. I ran faster. Almost there.  I tripped over a branch and landed flat on my face. No no no. I couldn’t end this way. I had to meet Annie. She’d be so sad if I didn’t show up. I scrambled up, dodged a giant lip of snail meat, and managed to reach the stand of giant ferns the snails always avoided. Safe.  I couldn’t stop or I’d be late. In passing, I grabbed a few reeds that I’d shape into snorkels later.  I arrived just in time to see Annie rise out of the sand and peer in my direction. If I hadn’t watched her deteriorate day by day, I wouldn’t have recognized her now, with her hair gone gray and only one eye left. We'd both become scrawny as hell. But she was my Annie always.  I slammed my hands against the glass. So did she. If I closed my eyes, I could just feel the warmth of her palms. “Annie,” I said.  She mouthed something back. We stared into each other’s faces. It was so hard. She was right there, in the desert hellscape the alien created next door to my jungle, but still completely unreachable. But for now, I took solace from her presence and told her everything about my day, even if she couldn’t hear me. She smiled, her last tooth gone since yesterday, and I smiled back.  We were still in love.  Time flew by as Annie and I pressed our bodies against the glass. After a while the vibration of the air filtration system made my fingertips tingle. Annie flagged sooner than usual.  She pointed upward, indicating it was time for her to find shelter for the dusk predators. I’d seen them. Giant crab-like creatures rose out of the sand as soon as the surface had cooled a little. At the far end of the desert terrarium, she’d found ways to hide from them.  We said goodbye and then I hurried back to my pond. I would lie a few hours submerged with my fresh reed, then I’d climb into the seedpods of a giant pea-like vine, to catch some much-needed sleep until sunrise, when it was back into the pond for me. I was tired. Tired of running around all day, never feeling completely safe, having nothing to look forward to except dozens or hundreds of identical days, until I would one day die of malnutrition, old age, or an attack.  It had to stop. As I lay in my warm, comfy mud, I thought hard. When I’d first gotten here, I’d planned to blow up the glass walls and free myself. As a former chemist, I’d expected to be able to refine the right materials from plants and minerals. But a terrarium isn’t a planet. And worse than that, without inert containers, like glass, or stone, or let’s face it, any container, it’s pretty much impossible to whip up a DIY explosive.  And when I discovered Annie, my Annie, in the desert terrarium next to me, my plans changed utterly. I could never leave her. And the look in Annie’s eyes this afternoon had made it crystal clear to me that something had to happen soon. I had to get to her.  Snails. The answer was snails.  At first, I didn’t know how to turn my daily flight from the snails into snail observation. It’s pretty much impossible, not to mention insane, to look over your shoulder when you’re running for your life. And I couldn’t get up earlier because I would be eaten by dawn creatures. At last I realized how I could create some spare time, but it would come at a cost.  “I won’t be here tomorrow,” I tried to tell Annie with gestures and sad faces. I don’t think she understood. At last, I smeared “Back day after tomorrow” onto the glass with a handful of mud.  It was harder than ever to say goodbye to her that day.  The next day, after escaping the snails, I hid and watched them instead of going to Annie. After their failed attempt to catch me, they slithered on toward the glass walls to eat algae. The suction of their wide sticky feet was so strong they could move up vertically across the glass. Their trajectory was seldom straight. They moved in lazy sine waves, doubling up on their own trails, sometimes bumping into others. Eventually they would wander toward the top of the walls, but not in any coordinated or predictable way.  Even if I could manage to climb aboard, I would have to find a way to direct the snails to the right spot. And how would I keep from falling off if the snails did a vertical climb? That was three unsurmountable problems in one fell swoop. I had no tools, nothing but my weak little nails and teeth, no containers. Mud, water, and leaves.  And alien foodstuffs!  My mind felt clearer than it had in weeks. Months, maybe. I didn’t even know how long I’d been here. I looked around. I was hiding in this spot because the snails didn’t bother me here. They refused to touch the leaves. There had to be something I could use the leaves for. I broke off a stem and sniffed the sap. Vaguely acidic, but not enough to irritate my skin. I crushed the leaves and spit on the pulp. Where the spittle had landed, it discolored from purple to orange and gave off a nasty, sulphury smell.  I wanted to see what the snails made of it. I created more stinky pulp and wrapped it around a pebble. When I tossed it to the closest snail, I missed, but the snail must have either smelled it or spotted the motion, because it turned its featureless head toward the pulp, questing, and then violently recoiled.  Good! I still needed to figure out how to violently repel a snail up the wall, but this was a first step. I imagined a reverse carrot stick contraption. If I could climb on top of a snail, I could hold the stinky pulp behind it on a stick and force it away from the stuff.  I picked out a snail with a dent in its shell. I needed one I could recognize tomorrow. But yeah, how to get on top of it? My human nails were pitiful instruments, as I’d already found out time and again. I fought my way to the jungle to where the alien had stacked some pretty colored stones. I’d tried to use them to build a shelter, but they were too smooth and polished to be stacked, even if you liberally applied mud. I’d tried hard. But as projectiles they might not be completely useless.  The rocks were so damn big and smooth I could only carry two at a time. Pretty colors my ass. I managed to lug a stack of eight to the bushes, and then I had to run to make it to my mud hideaway in time to avoid the dusk predators.  My mind whirled as I breathed through the reed tube. I was dying to continue my preparations, but I had to go to Annie tomorrow, or she would worry. I hoped she hadn’t thought I was dead.  She looked sad. I hesitated to write down my plan in case I gave her false hope. But it would be worse if I died and she didn’t know why I never came back.  “Coming over to you on snail-back.”  She brightened for a moment but then she shook her head and her shoulders slumped. She didn’t think it was possible, or real. I just knew I had to hurry before Annie lost hope and stopped evading her predators.  I crouched in position in the bushes, ready to dent a snail with my shiny decorative rocks. I started with the lightest one, like a gunner testing his range. My first throw landed short. Damn. I used to be a pretty good pitcher in high school. I looked at my skinny arm. Lack of protein, lack of exercise, lack of sleep.  I couldn’t waste too many rocks in practice throws. I didn’t have that many, and I couldn’t retrieve them unless I wanted to skip a meal. Not really an option.  I tried to remember what my father had taught me when I was a skinny kid with no muscle power. Stand just so, visualize the trajectory, use your whole arm, follow the ball.  The sapphire stone hit the chosen snail with a dull thunk. I had missed the existing dent. And I hadn’t made a new one.  A wave of hopelessness rose inside me. What was the point? All this trying and striving and hoping and planning and nothing was going to come of it anyway. I’d never get out of here. I’d never hold Annie in my arms.  I collapsed and cried like a baby. My inner clock woke me only just in time to start my dusk run.  I went back to my normal daily routine for a week or so, but even after five days I sensed my resolve rising up again and dusting itself off. Nothing had changed, but I was willing to give it another go.  I told Annie in my usual way I’d be gone the next day. She shrugged. I guess she understood by now I’d be gone tomorrow, but it didn’t make her happy. I’d tried to explain the snail plan, but she’d just looked horrified.  I waited, in hiding, for the target snail to inch by. Thunk went the ruby stone, thunk went the black and white marble one. Two hits, which was amazing, but no dent. I realized I had no idea how strong the snails’ shells were. I’d never come across shell fragments anywhere. I would have loved to find some, they’d make wonderful tools.  Did I even have a chance of breaking a snail shell?  I needed to regroup. This wasn’t going to be straightforward. I decided to bet on two things: one, practice my throwing, and two, observe the snails. Maybe I could find one with an already damaged shell.  I thought of a third way. Maybe I could glue myself to a shell instead of holding on to it. A fourth. Maybe I could hook into the softer flesh of the snail’s foot. No, that sounded like suicide.  A rumbling sound shook me out of my thoughts. What was going on? I looked up. The terrarium’s lid was being lifted. The alien was opening the lid! What would happen? If only I had a way right now to get up the glass walls. I realized I was a complete idiot. I hadn’t thought further than getting up the walls. But if—when—I did that, I’d have to face the lid on my world. There probably was one on Annie’s as well. I could never get to her. Exactly where were the filtration openings on those lids placed?  A giant tentacle descended into the terrarium. Why was it so close to me? I rolled away and hid under a dense bush. Critters living inside it started to gnaw at my skin with invisible little mouths, but I stayed put and hoped for the best.  Ah. The rocks. The pebbles. The tentacle gathered them up one by one, first the ones I’d thrown to the snails, then slithering perilously close to me, to where my stack of projectiles was. It gathered up all my laboriously lugged rocks, pebbles to it, and lifted them out of the terrarium. It dropped one right on top of the snail I’d tried to hit. The pebbles! My head felt like bursting with rage. The bloody alien cared about its pretty pebbles, and not about the poor snail it had wounded or the poor human it had imprisoned. It seemed almost like a greater injustice than what had happened to me until now.  I calmed myself down. That rage had nowhere to go except into my determination to change my circumstances.  So now what?  The lid was still open. The alien was nowhere to be seen. If only I could fly!  But then I thought of the damaged snail. It moved slowly, viscous liquid seeping out of a large crack in its shell. Now was my moment!  Frantically, I gathered up the leaves that were poisonous to the snail, mashed them, spit on them, tied them to a long stick. I was in such a hurry that I became fumble-fingered and had to do everything at least twice.  Now. I sprinted to the wounded snail, hooked my hands into the cracked shell, and hoisted myself up. The edges were sharp and gouged my palms. No matter. A little pain was nothing, and the wounds never got infected here.  I dangled the foul-smelling stick in front of the snail and it whiplashed away from it.  We were off.  I had the snail spinning around in confused circles at first, until I figured out how to steer it where I wanted to go. It was so slow! At least it seemed to me then, although they’d had me running for my life every day of my stay.  We reached the glass walls, and I directed the snail upward. The lid was still off. I could still make it.  The snail and I crossed the great stretch of wall diagonally to the corner, about two-thirds of the way up. I was sweating from swishing the stick, the anxiety, and blood dripped steadily down from my lacerated palm. The scent was confusing the snail and it was getting harder to keep it on track.  I aimed at a spot where the terraria met, roughly where I’d seen the holes on my lid. I hoped the ones in Annie’s lid would be in the same places. The snail slowed down even further. When I looked back, a trail of pale purple slime indicated our passage. It was hurt. I couldn’t allow myself to care for it. I had to reach the top.  And we did. I forced the snail from the edge of my terrarium to the closed lid on Annie’s. I let the snail rest for a moment while I checked out my options. The closest hole in the lid on Annie’s terrarium was more or less where I’d hoped it would be. I steered the flagging snail toward it. High in the distance, enormous things moved around. I didn’t let myself look in their direction, hoping that I would stay unnoticed. We were moving as fast as we could, but I still felt I was racing against the clock, against the moment the alien would come back and notice us.  We reached the edge of the hole. The snail balked, but I forced it over the edge. Slowly it slimed forward, its mobile foot searching for solid ground that wasn’t there. Almost half of it now hung over the edge, undeterred by the force field that kept the alien atmosphere out. I looked down into Annie’s terrarium. The drop would kill me.  I was paralyzed with fear, my breath wheezing painfully in my throat. I smelled sulfur. The snail kept moving. Maybe it would cushion my fall. Or I could stay here and be discovered.  At the last possible moment I threw myself backward off the snail and watched it lose its hold and then plummet.  A dull thud sounded far away. I leaned into the hole as far as I dared, staying away from the snail’s slimy trail, and found its remains on the orangey soil in the terrarium. It wasn’t moving.  I lay panting on the glass, unable to catch my breath. I was glad I’d just managed to avoid sudden death, but as soon as my panic subsided, the dire truth of my situation sank in. I was on top of a glass box in an alien environment. Not great. I had to get out of here. I started to think I didn’t need to go back into a terrarium. I could just get away from here and live in the alien’s walls until . . . until what exactly escaped me.  My lungs started to burn. I coughed, horribly and prolongedly. It took minutes for me to realize that the alien air lacked oxygen, and it was already having an effect on my clarity of mind.  I stuck my head back over the edge and sucked in the thankfully breathable air from the terrarium below. So any impulse of simply escaping and leaving Annie behind, horribly selfish as it had been, had to be ditched at once.  Now I had a whole new set of problems. The ones I’d refused to think about, before, when part one of the plan seemed barely likely to succeed. I couldn’t get down here in this hole, obviously. I couldn’t fly, I didn’t have the equipment to rappel down, et cetera. I needed to find another way in.  Far in the distance loomed hills, the ones Annie trekked to each day to stay safe. If I had to drop down from a great height, hills were the obvious place. I took a deep breath, lifted my head up and estimated the distance to the next hole. There was no way I could crawl that distance, which I’d hoped to do to stay undetected. I would have to run. Without being able to breathe. The air filters not only took out the sulfur, they added oxygen. The alien atmosphere didn’t have enough of it.  I wished I’d paid more attention to the spacing of the air holes. They hadn’t stood out to me in any way, so I reasoned they had to be spaced in the way a human would do it, in a neat and regular grid. So if I took off from this hole at a ninety-degree angle from the sides, I should hit the next one head-on.  It was hard to leave the good air. What if I didn’t find the next hole? Would I be able to turn back and find this one again in time before I suffocated?  I kept taking deep breaths, telling myself I’d go any moment now. Finally, I tricked my brain by telling myself I would only stand up for a second to scout out my route. Once I was standing, I just took off at a steady lope.  After a minute or so the urge to breathe became very strong. I couldn’t see the next hole yet. If I turned around now, I would still make it. But I didn’t. I think I knew if I turned back, I would never dare leave that hole again.  My lungs burned, I started to stagger and see spots. Where was that fucking hole?  I stumbled over my own feet and fell flat on my face. I hadn’t even managed to catch my fall with my hands. I should get up and crawl. Like now.  My fingers felt an edge. It took an age before my dull brain realized I was lying right by a hole. I pulled myself across by my fingertips. I wanted to crawl, but my legs just didn’t obey.  I came to with my head in the hole, feeling like crap. Every breath scraped sandpaper down my lungs, and I had the foulest taste in my mouth. But I was alive. I’d made it.  I started to scrabble up but lay back down. I had to look back first and mark the direction my body lay in. There would be less landmarks the farther I got across the lid. I spit on the edge, and again a foot away, and crawled around the hole until the two spittle spots lined up with my new direction.  I had to do better this time. One more near-miss like this one would kill me. I just didn’t know how to do better. All I could think of was different. I’d start out much faster, and maybe my muscles would be more efficient when they still had air? I had no idea.  I inhaled deeply three more times and started to run as fast as I could. This time I actually caught sight of the next hole while I was still running. That helped me to refrain from breathing, and I made it to the hole barely stumbling. That was great. I could do this again.  But when I’d rested and started to run again to the next hole, my legs trembled, and I wasn’t making nearly the speed I had last time. I just wasn’t fit enough. But I forced myself to keep going, and I made it to the next hole still conscious. I told myself I would just have to rest a little longer. But I cooled down quickly and started to shiver. I’d stiffen up if I didn’t get up and do it again. How many holes left? I hadn’t allowed myself to look down and estimate the distance still to go, but now I had to. I had to carefully mete out my remaining stamina.  After the fourth run, having barely made it, I blacked out with my head dangling down in the hole. I woke up with a pounding headache. For a moment I didn’t even know where I was and flailed my arms in a panic, searching for my breathing tube. While flailing, I got up, inhaled a lungful of alien atmosphere, and almost fell down the hole coughing. It wasn’t pretty.  The light had changed while I was unconscious. I hadn’t noticed before in my half-awake antics. If I didn’t make it to a hole over the hills before it was dark, I shouldn’t go on in case I missed a hole or fell in one. I looked down one last time before I started the next lap. The ground below me seemed closer. I looked back and wished I hadn’t. The distance I’d made with so much pain and difficulty seemed pitifully short.  I was so tired. And so thirsty. I had already failed in so many ways. I should have found something to carry water in at least. I stopped myself from punishing myself with these thoughts. There was no point. I was here, now, with nothing. I would have to make it work.  I marked my direction, inhaled, and set off. Darkness fell with startling rapidity, and I couldn’t see anything. But I couldn’t stop. I just went on running in the direction I’d set out in, and when I couldn’t run anymore, I would crawl.  That turned out to be tragically accurate. With burning lungs I crawled on, not knowing whether the darkness was so intense or if my eyes had stopped working. My right hand slipped down into the hole, and I’d almost crawled on. I dangled with half my upper body over the rim. Should I just let myself fall? But I couldn’t make myself jump into a dark nothing.  I must have slept because I woke in agony. My calves were spasming so hard it took all my strength to bend my feet back and relax the muscle. Then other pains clamored for my attention. My throat, my stomach, my buttocks. I was paying for my day of running. My head swam and the air seemed syrupy. Every breath hurt.  I blinked to clear my eyes of the thick gunk that had accumulated during my sleep and looked down. Heat from below already beat against my face. The ground seemed about the highest point I could see. And even if there were a higher rise somewhere else, I didn’t have the time to find out. I had to jump down and hope to find water, or I’d be dead soon. The heat in the desert terrarium wouldn’t do me any favors either.  I just couldn’t make myself do it. It was as if my body knew it would smash against the sand and break every bone. It refused to do it. No matter that I’d die up here just as surely if I didn’t jump.  Okay, I told my body, okay, I won’t do it. I just need to sit up for a second, my head is hurting from hanging upside down this long. I sat up. Sitting up didn’t engender the fear that falling did. I rubbed my neck to ease the muscle pain, and my forehead to calm the headache. I relaxed in spite of myself.  And then I just pushed off.  It was like jumping into an oven. And then I hit the floor and tumbled, slapping the floor like I’d seen in videos, trying to lose momentum. I ended up facedown in the sand. I lay still for seconds, trying to realize I was still alive. Everything hurt, but that didn’t mean too much. I moved limb by limb, testing each one before I dared sit up.  The heat was incredible. I could feel every last drop of moisture I had in my body rushing out into the parched air. It was so bright here. I could hardly see; it was all just orange sand. I didn’t know where to go, I couldn’t even tell up from down.  My ankle collapsed under me as I tried to rise. Broken or sprained, it didn’t matter, I had to walk to shade. Not that I could see any. My hip was bruised, but everything else seemed to work. But where to go? I didn’t know where to go.  I stood up gingerly, favoring my good leg, and looked around, trying to make a decision.  “Robin! Robin! Quick, over here!” a voice called out.  A piece of desert lifted up and showed me the face of Annie, lying underneath. I hobbled toward it as quickly as I could.  “Annie! How is it possible?” I croaked. “How did you know I’d be here?”  “Here, drink this, you must be so thirsty! I saw you scaling the walls on that snail, and then running over the lid.”  She was amazing. She’d dug out a shelter for herself in the sand, and it was so much cooler than the sand baking under the sun even this early in the morning. She had a kind of pouch made from animal hide with water in it, and half a green bar, clearly kneaded together from many small savings over weeks.  I drank all the water in the pouch, I couldn’t stop myself, even as I was convinced that I was going to give Annie half.  “You’re still thirsty,” Annie said. “But we can’t go for water until dusk.”  “Oh Annie,” I said.  That was all I had left in me to say. But it seemed to be enough. She snuggled up against me. In spite of all my pains and the terrible state I was in, that was enough. We were together. Bo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "text": "5140 words, short story\nThe Answer Was Snails\nThe alien must have been reading up on humidity conditions for its terrarium, because we’d already gotten three mistings today.\nI lifted my head above the mud, where I’d lain hidden since dawn. I breathed through my snorkel reed, which was nearing the end of its usefulness. Another obstacle in my already busy day.\nIt was midmorning. The dawn creatures stopped slithering and screeching, making it marginally safe enough to go get breakfast. The alien provided our food because the terrarium wasn’t big enough for a real ecology. And anyway, it was a hodgepodge of plants and species the alien found pleasing. Or were on sale. The alien didn't seem particularly smart. The terrarium was a mess.\nNeedless to say, there were no plants or animals here I could eat. The upside was, they couldn’t eat me either, or at least, digest me. Still, the stupider ones kept trying.\nI shook off that thought. I needed to focus. This was the only food I’d get today.\nTo reach the food dispenser, I needed to climb up out of the safety of the undergrowth and cross a stretch of gravel. Hell on the feet, since my shoes had long since died, and I’d be in full view of the flyers for at least half a minute. I hid under a pungent magenta leaf and peered up at the higher reaches of the terrarium. It looked safe for now.\nI sprint-stumbled to the dispenser and banged my fist on the button. A variety of foodstuffs spilled out. Somewhere in there was a green stick that I could eat. Once, the alien had changed manufacturers, and I got very sick from the orange bar I used to eat. It took me a week of experimenting to find a new substance that was safe. I tossed out the globs and gross sticky bits that I couldn’t eat. That alone meant predators would be waking up and starting for the dispenser. There was my green bar. I had no clothes, so no pockets anymore, so I had to eat it right away or risk losing it.\nThe green stuff tasted of nothing, and its sticky, hardened peanut buttery texture made it hard to keep chewing and swallowing. But it kept me alive for another day. I took it one day at a time, as someone once told me, in another life.\nI gobbled it down as fast as I could while I started back to the safety of the brightly striped, chittering jungle. Not to the same place as before, since I needed to get to my afternoon rendezvous with Annie as well as find new breathing reeds. I heard the buzz of a flyer approaching and managed to duck under the fronds of a fern tree just in time.\nBreakfast: check. Now I had to travel to where this jungle terrarium borders on the desert one. That was tricky because sunlight started hitting the middle of the container just about then, and that woke the snails. Made them frisky. They would head for the terrarium walls, where they cleaned the glass with thousands of little sharp teeth, right across my route to the wall. And they weren't bright enough to just eat algae. Whenever they sensed something moving, they'd ditch the algae and go after it. Maybe they'd lived like that on whatever world they came from. They were victims, just like me. Car-sized victims who would eat me or die trying.\nI crept up to a point where I could see the snails. They couldn’t see me because they didn’t have eyes. Excellent movement sensors though. The group of snails moved in the right direction, away from where I wanted to go. I rose slowly. No reaction yet. I sprinted across the little beach, into the shallow stream that I had to follow to reach the other side. Several snails turned after me now. I ran faster. Almost there.\nI tripped over a branch and landed flat on my face. No no no. I couldn’t end this way. I had to meet Annie. She’d be so sad if I didn’t show up. I scrambled up, dodged a giant lip of snail meat, and managed to reach the stand of giant ferns the snails always avoided. Safe.\nI couldn’t stop or I’d be late. In passing, I grabbed a few reeds that I’d shape into snorkels later.\nI arrived just in time to see Annie rise out of the sand and peer in my direction. If I hadn’t watched her deteriorate day by day, I wouldn’t have recognized her now, with her hair gone gray and only one eye left. We'd both become scrawny as hell. But she was my Annie always.\nI slammed my hands against the glass. So did she. If I closed my eyes, I could just feel the warmth of her palms. “Annie,” I said.\nShe mouthed something back. We stared into each other’s faces. It was so hard. She was right there, in the desert hellscape the alien created next door to my jungle, but still completely unreachable. But for now, I took solace from her presence and told her everything about my day, even if she couldn’t hear me. She smiled, her last tooth gone since yesterday, and I smiled back.\nWe were still in love.\nTime flew by as Annie and I pressed our bodies against the glass. After a while the vibration of the air filtration system made my fingertips tingle. Annie flagged sooner than usual.\nShe pointed upward, indicating it was time for her to find shelter for the dusk predators. I’d seen them. Giant crab-like creatures rose out of the sand as soon as the surface had cooled a little. At the far end of the desert terrarium, she’d found ways to hide from them.\nWe said goodbye and then I hurried back to my pond. I would lie a few hours submerged with my fresh reed, then I’d climb into the seedpods of a giant pea-like vine, to catch some much-needed sleep until sunrise, when it was back into the pond for me. I was tired. Tired of running around all day, never feeling completely safe, having nothing to look forward to except dozens or hundreds of identical days, until I would one day die of malnutrition, old age, or an attack.\nIt had to stop. As I lay in my warm, comfy mud, I thought hard. When I’d first gotten here, I’d planned to blow up the glass walls and free myself. As a former chemist, I’d expected to be able to refine the right materials from plants and minerals. But a terrarium isn’t a planet. And worse than that, without inert containers, like glass, or stone, or let’s face it, any container, it’s pretty much impossible to whip up a DIY explosive.\nAnd when I discovered Annie, my Annie, in the desert terrarium next to me, my plans changed utterly. I could never leave her. And the look in Annie’s eyes this afternoon had made it crystal clear to me that something had to happen soon. I had to get to her.\nSnails. The answer was snails.\nAt first, I didn’t know how to turn my daily flight from the snails into snail observation. It’s pretty much impossible, not to mention insane, to look over your shoulder when you’re running for your life. And I couldn’t get up earlier because I would be eaten by dawn creatures. At last I realized how I could create some spare time, but it would come at a cost.\n“I won’t be here tomorrow,” I tried to tell Annie with gestures and sad faces. I don’t think she understood. At last, I smeared “Back day after tomorrow” onto the glass with a handful of mud.\nIt was harder than ever to say goodbye to her that day.\nThe next day, after escaping the snails, I hid and watched them instead of going to Annie. After their failed attempt to catch me, they slithered on toward the glass walls to eat algae. The suction of their wide sticky feet was so strong they could move up vertically across the glass. Their trajectory was seldom straight. They moved in lazy sine waves, doubling up on their own trails, sometimes bumping into others. Eventually they would wander toward the top of the walls, but not in any coordinated or predictable way.\nEven if I could manage to climb aboard, I would have to find a way to direct the snails to the right spot. And how would I keep from falling off if the snails did a vertical climb? That was three unsurmountable problems in one fell swoop. I had no tools, nothing but my weak little nails and teeth, no containers. Mud, water, and leaves.\nAnd alien foodstuffs!\nMy mind felt clearer than it had in weeks. Months, maybe. I didn’t even know how long I’d been here. I looked around. I was hiding in this spot because the snails didn’t bother me here. They refused to touch the leaves. There had to be something I could use the leaves for. I broke off a stem and sniffed the sap. Vaguely acidic, but not enough to irritate my skin. I crushed the leaves and spit on the pulp. Where the spittle had landed, it discolored from purple to orange and gave off a nasty, sulphury smell.\nI wanted to see what the snails made of it. I created more stinky pulp and wrapped it around a pebble. When I tossed it to the closest snail, I missed, but the snail must have either smelled it or spotted the motion, because it turned its featureless head toward the pulp, questing, and then violently recoiled.\nGood! I still needed to figure out how to violently repel a snail up the wall, but this was a first step. I imagined a reverse carrot stick contraption. If I could climb on top of a snail, I could hold the stinky pulp behind it on a stick and force it away from the stuff.\nI picked out a snail with a dent in its shell. I needed one I could recognize tomorrow. But yeah, how to get on top of it? My human nails were pitiful instruments, as I’d already found out time and again. I fought my way to the jungle to where the alien had stacked some pretty colored stones. I’d tried to use them to build a shelter, but they were too smooth and polished to be stacked, even if you liberally applied mud. I’d tried hard. But as projectiles they might not be completely useless.\nThe rocks were so damn big and smooth I could only carry two at a time. Pretty colors my ass. I managed to lug a stack of eight to the bushes, and then I had to run to make it to my mud hideaway in time to avoid the dusk predators.\nMy mind whirled as I breathed through the reed tube. I was dying to continue my preparations, but I had to go to Annie tomorrow, or she would worry. I hoped she hadn’t thought I was dead.\nShe looked sad. I hesitated to write down my plan in case I gave her false hope. But it would be worse if I died and she didn’t know why I never came back.\n“Coming over to you on snail-back.”\nShe brightened for a moment but then she shook her head and her shoulders slumped. She didn’t think it was possible, or real. I just knew I had to hurry before Annie lost hope and stopped evading her predators.\nI crouched in position in the bushes, ready to dent a snail with my shiny decorative rocks. I started with the lightest one, like a gunner testing his range. My first throw landed short. Damn. I used to be a pretty good pitcher in high school. I looked at my skinny arm. Lack of protein, lack of exercise, lack of sleep.\nI couldn’t waste too many rocks in practice throws. I didn’t have that many, and I couldn’t retrieve them unless I wanted to skip a meal. Not really an option.\nI tried to remember what my father had taught me when I was a skinny kid with no muscle power. Stand just so, visualize the trajectory, use your whole arm, follow the ball.\nThe sapphire stone hit the chosen snail with a dull thunk. I had missed the existing dent. And I hadn’t made a new one.\nA wave of hopelessness rose inside me. What was the point? All this trying and striving and hoping and planning and nothing was going to come of it anyway. I’d never get out of here. I’d never hold Annie in my arms.\nI collapsed and cried like a baby. My inner clock woke me only just in time to start my dusk run.\nI went back to my normal daily routine for a week or so, but even after five days I sensed my resolve rising up again and dusting itself off. Nothing had changed, but I was willing to give it another go.\nI told Annie in my usual way I’d be gone the next day. She shrugged. I guess she understood by now I’d be gone tomorrow, but it didn’t make her happy. I’d tried to explain the snail plan, but she’d just looked horrified.\nI waited, in hiding, for the target snail to inch by. Thunk went the ruby stone, thunk went the black and white marble one. Two hits, which was amazing, but no dent. I realized I had no idea how strong the snails’ shells were. I’d never come across shell fragments anywhere. I would have loved to find some, they’d make wonderful tools.\nDid I even have a chance of breaking a snail shell?\nI needed to regroup. This wasn’t going to be straightforward. I decided to bet on two things: one, practice my throwing, and two, observe the snails. Maybe I could find one with an already damaged shell.\nI thought of a third way. Maybe I could glue myself to a shell instead of holding on to it. A fourth. Maybe I could hook into the softer flesh of the snail’s foot. No, that sounded like suicide.\nA rumbling sound shook me out of my thoughts. What was going on? I looked up. The terrarium’s lid was being lifted. The alien was opening the lid! What would happen? If only I had a way right now to get up the glass walls. I realized I was a complete idiot. I hadn’t thought further than getting up the walls. But if—when—I did that, I’d have to face the lid on my world. There probably was one on Annie’s as well. I could never get to her. Exactly where were the filtration openings on those lids placed?\nA giant tentacle descended into the terrarium. Why was it so close to me? I rolled away and hid under a dense bush. Critters living inside it started to gnaw at my skin with invisible little mouths, but I stayed put and hoped for the best.\nAh. The rocks. The pebbles. The tentacle gathered them up one by one, first the ones I’d thrown to the snails, then slithering perilously close to me, to where my stack of projectiles was. It gathered up all my laboriously lugged rocks, pebbles to it, and lifted them out of the terrarium. It dropped one right on top of the snail I’d tried to hit. The pebbles! My head felt like bursting with rage. The bloody alien cared about its pretty pebbles, and not about the poor snail it had wounded or the poor human it had imprisoned. It seemed almost like a greater injustice than what had happened to me until now.\nI calmed myself down. That rage had nowhere to go except into my determination to change my circumstances.\nSo now what?\nThe lid was still open. The alien was nowhere to be seen. If only I could fly!\nBut then I thought of the damaged snail. It moved slowly, viscous liquid seeping out of a large crack in its shell. Now was my moment!\nFrantically, I gathered up the leaves that were poisonous to the snail, mashed them, spit on them, tied them to a long stick. I was in such a hurry that I became fumble-fingered and had to do everything at least twice.\nNow. I sprinted to the wounded snail, hooked my hands into the cracked shell, and hoisted myself up. The edges were sharp and gouged my palms. No matter. A little pain was nothing, and the wounds never got infected here.\nI dangled the foul-smelling stick in front of the snail and it whiplashed away from it.\nWe were off.\nI had the snail spinning around in confused circles at first, until I figured out how to steer it where I wanted to go. It was so slow! At least it seemed to me then, although they’d had me running for my life every day of my stay.\nWe reached the glass walls, and I directed the snail upward. The lid was still off. I could still make it.\nThe snail and I crossed the great stretch of wall diagonally to the corner, about two-thirds of the way up. I was sweating from swishing the stick, the anxiety, and blood dripped steadily down from my lacerated palm. The scent was confusing the snail and it was getting harder to keep it on track.\nI aimed at a spot where the terraria met, roughly where I’d seen the holes on my lid. I hoped the ones in Annie’s lid would be in the same places. The snail slowed down even further. When I looked back, a trail of pale purple slime indicated our passage. It was hurt. I couldn’t allow myself to care for it. I had to reach the top.\nAnd we did. I forced the snail from the edge of my terrarium to the closed lid on Annie’s. I let the snail rest for a moment while I checked out my options. The closest hole in the lid on Annie’s terrarium was more or less where I’d hoped it would be. I steered the flagging snail toward it. High in the distance, enormous things moved around. I didn’t let myself look in their direction, hoping that I would stay unnoticed. We were moving as fast as we could, but I still felt I was racing against the clock, against the moment the alien would come back and notice us.\nWe reached the edge of the hole. The snail balked, but I forced it over the edge. Slowly it slimed forward, its mobile foot searching for solid ground that wasn’t there. Almost half of it now hung over the edge, undeterred by the force field that kept the alien atmosphere out. I looked down into Annie’s terrarium. The drop would kill me.\nI was paralyzed with fear, my breath wheezing painfully in my throat. I smelled sulfur. The snail kept moving. Maybe it would cushion my fall. Or I could stay here and be discovered.\nAt the last possible moment I threw myself backward off the snail and watched it lose its hold and then plummet.\nA dull thud sounded far away. I leaned into the hole as far as I dared, staying away from the snail’s slimy trail, and found its remains on the orangey soil in the terrarium. It wasn’t moving.\nI lay panting on the glass, unable to catch my breath. I was glad I’d just managed to avoid sudden death, but as soon as my panic subsided, the dire truth of my situation sank in. I was on top of a glass box in an alien environment. Not great. I had to get out of here. I started to think I didn’t need to go back into a terrarium. I could just get away from here and live in the alien’s walls until . . . until what exactly escaped me.\nMy lungs started to burn. I coughed, horribly and prolongedly. It took minutes for me to realize that the alien air lacked oxygen, and it was already having an effect on my clarity of mind.\nI stuck my head back over the edge and sucked in the thankfully breathable air from the terrarium below. So any impulse of simply escaping and leaving Annie behind, horribly selfish as it had been, had to be ditched at once.\nNow I had a whole new set of problems. The ones I’d refused to think about, before, when part one of the plan seemed barely likely to succeed. I couldn’t get down here in this hole, obviously. I couldn’t fly, I didn’t have the equipment to rappel down, et cetera. I needed to find another way in.\nFar in the distance loomed hills, the ones Annie trekked to each day to stay safe. If I had to drop down from a great height, hills were the obvious place. I took a deep breath, lifted my head up and estimated the distance to the next hole. There was no way I could crawl that distance, which I’d hoped to do to stay undetected. I would have to run. Without being able to breathe. The air filters not only took out the sulfur, they added oxygen. The alien atmosphere didn’t have enough of it.\nI wished I’d paid more attention to the spacing of the air holes. They hadn’t stood out to me in any way, so I reasoned they had to be spaced in the way a human would do it, in a neat and regular grid. So if I took off from this hole at a ninety-degree angle from the sides, I should hit the next one head-on.\nIt was hard to leave the good air. What if I didn’t find the next hole? Would I be able to turn back and find this one again in time before I suffocated?\nI kept taking deep breaths, telling myself I’d go any moment now. Finally, I tricked my brain by telling myself I would only stand up for a second to scout out my route. Once I was standing, I just took off at a steady lope.\nAfter a minute or so the urge to breathe became very strong. I couldn’t see the next hole yet. If I turned around now, I would still make it. But I didn’t. I think I knew if I turned back, I would never dare leave that hole again.\nMy lungs burned, I started to stagger and see spots. Where was that fucking hole?\nI stumbled over my own feet and fell flat on my face. I hadn’t even managed to catch my fall with my hands. I should get up and crawl. Like now.\nMy fingers felt an edge. It took an age before my dull brain realized I was lying right by a hole. I pulled myself across by my fingertips. I wanted to crawl, but my legs just didn’t obey.\nI came to with my head in the hole, feeling like crap. Every breath scraped sandpaper down my lungs, and I had the foulest taste in my mouth. But I was alive. I’d made it.\nI started to scrabble up but lay back down. I had to look back first and mark the direction my body lay in. There would be less landmarks the farther I got across the lid. I spit on the edge, and again a foot away, and crawled around the hole until the two spittle spots lined up with my new direction.\nI had to do better this time. One more near-miss like this one would kill me. I just didn’t know how to do better. All I could think of was different. I’d start out much faster, and maybe my muscles would be more efficient when they still had air? I had no idea.\nI inhaled deeply three more times and started to run as fast as I could. This time I actually caught sight of the next hole while I was still running. That helped me to refrain from breathing, and I made it to the hole barely stumbling. That was great. I could do this again.\nBut when I’d rested and started to run again to the next hole, my legs trembled, and I wasn’t making nearly the speed I had last time. I just wasn’t fit enough. But I forced myself to keep going, and I made it to the next hole still conscious. I told myself I would just have to rest a little longer. But I cooled down quickly and started to shiver. I’d stiffen up if I didn’t get up and do it again. How many holes left? I hadn’t allowed myself to look down and estimate the distance still to go, but now I had to. I had to carefully mete out my remaining stamina.\nAfter the fourth run, having barely made it, I blacked out with my head dangling down in the hole. I woke up with a pounding headache. For a moment I didn’t even know where I was and flailed my arms in a panic, searching for my breathing tube. While flailing, I got up, inhaled a lungful of alien atmosphere, and almost fell down the hole coughing. It wasn’t pretty.\nThe light had changed while I was unconscious. I hadn’t noticed before in my half-awake antics. If I didn’t make it to a hole over the hills before it was dark, I shouldn’t go on in case I missed a hole or fell in one. I looked down one last time before I started the next lap. The ground below me seemed closer. I looked back and wished I hadn’t. The distance I’d made with so much pain and difficulty seemed pitifully short.\nI was so tired. And so thirsty. I had already failed in so many ways. I should have found something to carry water in at least. I stopped myself from punishing myself with these thoughts. There was no point. I was here, now, with nothing. I would have to make it work.\nI marked my direction, inhaled, and set off. Darkness fell with startling rapidity, and I couldn’t see anything. But I couldn’t stop. I just went on running in the direction I’d set out in, and when I couldn’t run anymore, I would crawl.\nThat turned out to be tragically accurate. With burning lungs I crawled on, not knowing whether the darkness was so intense or if my eyes had stopped working. My right hand slipped down into the hole, and I’d almost crawled on. I dangled with half my upper body over the rim. Should I just let myself fall? But I couldn’t make myself jump into a dark nothing.\nI must have slept because I woke in agony. My calves were spasming so hard it took all my strength to bend my feet back and relax the muscle. Then other pains clamored for my attention. My throat, my stomach, my buttocks. I was paying for my day of running. My head swam and the air seemed syrupy. Every breath hurt.\nI blinked to clear my eyes of the thick gunk that had accumulated during my sleep and looked down. Heat from below already beat against my face. The ground seemed about the highest point I could see. And even if there were a higher rise somewhere else, I didn’t have the time to find out. I had to jump down and hope to find water, or I’d be dead soon. The heat in the desert terrarium wouldn’t do me any favors either.\nI just couldn’t make myself do it. It was as if my body knew it would smash against the sand and break every bone. It refused to do it. No matter that I’d die up here just as surely if I didn’t jump.\nOkay, I told my body, okay, I won’t do it. I just need to sit up for a second, my head is hurting from hanging upside down this long. I sat up. Sitting up didn’t engender the fear that falling did. I rubbed my neck to ease the muscle pain, and my forehead to calm the headache. I relaxed in spite of myself.\nAnd then I just pushed off.\nIt was like jumping into an oven. And then I hit the floor and tumbled, slapping the floor like I’d seen in videos, trying to lose momentum. I ended up facedown in the sand. I lay still for seconds, trying to realize I was still alive. Everything hurt, but that didn’t mean too much. I moved limb by limb, testing each one before I dared sit up.\nThe heat was incredible. I could feel every last drop of moisture I had in my body rushing out into the parched air. It was so bright here. I could hardly see; it was all just orange sand. I didn’t know where to go, I couldn’t even tell up from down.\nMy ankle collapsed under me as I tried to rise. Broken or sprained, it didn’t matter, I had to walk to shade. Not that I could see any. My hip was bruised, but everything else seemed to work. But where to go? I didn’t know where to go.\nI stood up gingerly, favoring my good leg, and looked around, trying to make a decision.\n“Robin! Robin! Quick, over here!” a voice called out.\nA piece of desert lifted up and showed me the face of Annie, lying underneath. I hobbled toward it as quickly as I could.\n“Annie! How is it possible?” I croaked. “How did you know I’d be here?”\n“Here, drink this, you must be so thirsty! I saw you scaling the walls on that snail, and then running over the lid.”\nShe was amazing. She’d dug out a shelter for herself in the sand, and it was so much cooler than the sand baking under the sun even this early in the morning. She had a kind of pouch made from animal hide with water in it, and half a green bar, clearly kneaded together from many small savings over weeks.\nI drank all the water in the pouch, I couldn’t stop myself, even as I was convinced that I was going to give Annie half.\n“You’re still thirsty,” Annie said. “But we can’t go for water until dusk.”\n“Oh Annie,” I said.\nThat was all I had left in me to say. But it seemed to be enough. She snuggled up against me. In spite of all my pains and the terrible state I was in, that was enough. We were together.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "source": "https://clarkesworldmagazine.com/balder_10_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Answer Was Snails by Bo Balder"}