{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mark Cole", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9DI8jSWJdLxGqRwNmM8gIasQJsE=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Separated at Birth? Occultism, Science Fiction, and Why People Can't Tell Them Apart  Things are not always what they appear to be.  For example, take The Suns of Easter Island (1972), a film by French New Wave director Pierre Kast. The basic premise is familiar. So familiar, in fact, that one has to keep reminding oneself that it was made several years before a certain far better-known film. Aliens contact people with unique talents and tell them to come to a remote place to meet them. Most reviewers called it a science fiction film.  And yet it isn’t. Not even close.  It is ultimately about the occult.  The truly strange thing is that it isn’t the only work that has been so badly misidentified.  And perhaps the two have closer ties than we realize.  The connections between occultism and science fiction go back to the very roots of science fiction, to one of the genre’s seminal novels.  Sir Edward Bulwer-Lytton is best remembered now for his turgid prose, thanks to an annual writing contest named for him. He was, however, one of those curious figures so common in Victorian society: a nobleman who turned down the Greek crown, was busy in parliamentary politics, and unsuccessfully tried to get his wife committed to the asylum after they separated. Despite his writing style he was one of the most popular authors of his age, penning an impressive number of novels, plays, and poems (and coining a number of familiar phrases such as “the great unwashed” and “the pen is mightier than the sword“). His books ranged from historical epics to mystery, romance, horror, the occult, and a work of science fiction (or perhaps proto-SF), The Coming Race (aka Vril: The Power of the Coming Race).  Published just seven years after Jules Verne’s first science fiction novel, Journey to the Center of the Earth, Vril tells the story of a young man who accidentally discovers a lost civilization deep underground, whose human inhabitants are vastly more evolved than us and wield incredible powers through their mastery of a secret force known as Vril.  It was a highly influential work for the early development of science fiction (there are even claims that the Gene Autry serial, The Phantom Empire, is loosely based on the novel), but, curiously, a lot of real-life occultists adopted Bulwer-Lytton’s idea of Vril.  For that matter, they also adopted several of his other occult ideas. The Rosicrucians even claimed him as their “Grand Patron” (although he denied any connection to them). Various other esoteric groups claimed he had been a member (although some of these claims have been disproved). Nor is it clear whether any of his ideas were actual occult beliefs—or whether he just made them up.  When the earliest enthusiasts for what would become science fiction went looking for works like those of Verne and Wells, there were few such stories to be found. They found a few buried among routine tales of supernatural horror, like Bierce’s “Moxon’s Master,” or ended up reading such works as William Hope Hodgson’s The House on the Borderland or Robert W. Chambers’ The King in Yellow.  The first story in Chambers’ collection, “The Repairer of Reputations” is set in the future (1920) and portrays the rise of an American Empire. It is more or less science fiction, although it might all be a delusion. A later story also involves time travel.  However, these stories are all loosely tied together by the supernatural, thanks to the mysterious influence of The King in Yellow, which might be a play that causes insanity in those who read, a strange and decadent person, or a sinister yellow mark.  The House on the Borderland, on the other hand, was set in a lonely mansion with connections to something beyond our limited existence. It offered visions of alternate worlds, a hostile universe full of appalling superhuman intelligences (which would influence Lovecraft’s work) and even a glimpse of the far future and the death of the solar system.  This confusion carried into the early days of the pulp magazine, when science fiction was as likely to appear in magazines featuring weird horror as anywhere else.  The best known of these writers was H. P. Lovecraft, whose stories were filled with the occult, usually involving witchcraft and pagan ceremonies, while these unspeakable and unimaginable cosmic horrors frequently combined immense supernatural powers with incomprehensible alien entities. Ironically, some occultists even claimed that he hadn’t invented his fictional “Elder Gods” and that Cthulhu and the others were all real.  Or one might note influential SF and horror writers like A. Merritt and Fritz Leiber, both of whom were assiduous students of the occult. Both had massive collections of occult books and paraphernalia, and both were as likely to write about the supernatural as science fiction.  Meanwhile, Edgar Rice Burroughs, the creator of Tarzan, borrowed heavily from Helena Blavatsky’s theosophical notions of astral projection for his planetary romances (which is somewhat ironic when you consider that she borrowed heavily from Bulwer-Lytton!).  We tend to forget that the revival of the old classical culture that started during the High Middle Ages gave birth to both modern science and modern occultism.  While most see this revival in a purely positive light, not only did scholars revive the great works of literature and philosophy, but pornography, torture (a major part of the old Roman Law), and, yes, the occult.  In fact, there is even an overlap between the revival of science and the occult as many of the scholars who helped give birth to science, like Albertus Magnus—whose interest in the natural world, which he shared with Aristotle, inspired a lot of the early scientific thinkers like Oresme, Buridan, and Galileo’s “French Scientists”—also explored the occult works of Classical authors like Hermes Trismegistus. In Christopher Marlowe’s play, Doctor Faustus debated the merits of the various disciplines he might study—such as law, philosophy, and theology—before he settled on magic on purely rational grounds. Or consider Giordano Bruno, an occultist who defended heliocentrism because it fit in with his esoteric philosophy, who has somehow become one of the martyrs of science, despite the awkward fact that the transcript of his trial makes no mention of Copernicus!  Adding to the confusion, its practitioners often claimed that they had access to higher levels of reality and frequently called their doctrines the “occult sciences.” Some of these groups, like the Theosophists, actually achieved a strange sort of respectability thanks to such prominent supporters as Thomas Edison, the biologist Alfred Russel Wallace, and the inventor of the vacuum tube, William Crookes.  Nor did it help that a great many scientists threw their enthusiastic support behind spiritualism because it promised an empirical proof for the afterlife and might be able to unlock the mysteries of the universe, if those pesky spirits would ever stop talking about how happy they were.  This led the founder of parapsychology, J. B. Rhine, to attempt a scientific proof of the existence of psychic powers as a first step toward verifying the reality of spiritualism. His work gave a gloss of respectability to psychic powers—at least, until the flaws in his methodology raised too many questions about his conclusions.  However, this didn’t stop editor John W. Campbell from promoting psychic powers within the pages of Astounding Science Fiction. One finds even a dogmatic materialist like Arthur C. Clarke turning out stories about beings evolving into immaterial intelligences in stories like Childhood’s End.  And, as science fiction began to fade at the cinemas and horror and the supernatural became more popular, the supernatural began to play a larger part even in films which made some appeal to science: in 1957 alone, Blood of Dracula featured a scientist trying to perfect her theories of mental powers that would soon bring unlimited power to the world—with the help of an ancient amulet from the Carpathians; Voodoo Woman sent a scientist into the jungle to discover the ancient secret science behind voodoo (which required him to wear a goofy hat during his “research”); From Hell It Came pitted the scientists on a remote island against a tree monster summoned by a curse although our scientists did need to fertilize it a bit to get it to grow and learn that it is radioactive, in the end they merely push it into a swamp (in the most scientific way imaginable, of course), and the islanders decide to pursue science instead of magic; and we get the usual fifties scientific platitudes about everything having a rational explanation before The Disembodied gives us possession and voodoo magic.  Somehow most of these threads seem to have become tangled up in the UFO craze.  After all, it seemed to attract all sorts of reckless speculation, from Chariots of the Gods-style ancient astronauts to Nazis in the hollow Earth.  Curiously, a lot of the stories about alien abduction, fiction or nonfiction (of which Whitley Strieber’s Communion is one of the best examples), resemble nothing so much as the older and darker traditional stories about encounters with fairies and leprechauns. It would take very little to change some of these—The Device (2014), for example—into a purely supernatural tale.  It is often hard to decide how to file some of these films, like the Australian Indiana Jones copy, Sky Pirates (1986), which ties together Easter Island, the Bermuda Triangle, the Philadelphia experiment, and the powerful “magic” slabs left by ancient aliens—who could just as easily be gods.  Or consider the Richard Matheson-penned TV movie about a woman’s strange pregnancy, The Stranger Within (1974). It is essentially his version of the occult thrillers popular at the time, like Rosemary’s Baby or The Omen, and there is very little that makes it “science fiction” other than the minor fact that it’s aliens, and not the Devil, who are responsible. Nor do we ever get much in the way of alien imagery.  Then there are a few strange examples of films that didn’t exactly start out as science fiction, like Rutger Hauer’s battle against a mysterious killer in a dismal future in Split Second (1992). While the beast absorbs DNA from other creatures and might be a laboratory creation or perhaps something alien, it also has apparently supernatural powers, thinks it is (and might even be) the devil, and has a psychic link to the hero. The movie itself really has no idea what to make of this thing, but perhaps it makes sense if you know that Split Second started out as a copy of the supernatural thriller, The First Power.  However, we have to ignore this sort of confusion in Asian films, where the Japanese genre of tokusatsu is really about wild effects and gleefully mixes SF and magic with little regard. While in China, apparently supernatural films, like Chronicles of the Ghostly Tribe [Jiu ceng yao ta] (2015), with its aliens who could just as easily be fairies; or Time Raiders [Wu Xie Xiao Ge] (2016), with a revived snake goddess who might just have been a great scientist, have had materialistic explanations crammed in at the insistence of the Chinese government, which opposes anything supernatural in film, unless it is set in ancient times.  A few so-called science fiction films are so clearly occult that it seems strange that anyone would mistake them for anything else.  The Suns of Easter Island is one of the best examples: It starts out with the main character, who is working on a big solar energy project, explaining about how he is a sorcerer from a long line of sorcerers. He then gives us a demonstration of geomancy before we move on to the other characters who include an archaeologist, a psychologist, an astronomer . . . and a voodoo priest.  We are told that the strange messages they all receive came from aliens from a distant world who occasionally contact people to find out whether our world is ready for them to bring us into their civilization. However, they seem far less like aliens and more like the occultists’ ascended masters, and seem far more interested in bringing us to enlightenment than in sharing their technology or trading with us.  Or consider Code name: Ruby (1997), which was made for TV by one of the iconic directors of the Czech New Wave, Jan Nemec. It may start with the space shuttle colliding with a UFO, but before long it gets embroiled with alchemy, the quest for the philosopher’s stone, and a tourist trip through historic Prague. We are told that what really matters is not who is president, but who runs the Smithsonian Institution that guards all the ancient alchemical secrets—and that a young couple exploring Prague might just be able to finally create the stone.  A very different example is the neo-noir reality bender, Yesterday Was a Lie (2009). A hard-boiled PI finds her latest case raising all sort of strange questions about changing reality with the mind, with plentiful references to quantum mechanics (that staple canned explanation for those who want to have impossible things happen in their films).  However, what is really going on is something rather different: instead, the film revolves around Jungian archetypes and ultimately comes to a very occult answer: the human heart can change reality.  While Carl Jung’s work still enjoys a certain credibility, a lot of psychologists don’t agree that it should be considered science. Richard Noll’s book, The Jung Cult, details Jung’s occult researches and influences—and claims Jungian analysis functions more like a religion than science. Whether he is right or not, in Yesterday Was a Lie, Jung is one of the keys to what amounts to occult power.  A less-obvious example is I Origins, a 2014 film advertised as a science fiction whose official synopses described it as the story of a scientist whose research into the human eye had discovered something that would change the world.  The discovery, however, is that a child had the exact same retinal pattern as someone who died, and that the child is apparently her reincarnation.  What makes this particularly absurd and unscientific is that the retinal pattern is essentially random and does not even repeat exactly between twins (even if it might be similar). Nor would it be identical in a clone. So, obviously, we are talking about a supernatural effect, even if it can be measured empirically.  One suspects that a lot of this confusion is caused not by the filmmakers themselves, but by the critics, press, and yes, the press releases provided by the distributors. Still, this can be enormously frustrating, as with the stylish 2001 French thriller, Vidocq (aka, Dark Portals: The Chronicles of Vidocq), which was heralded as a steampunk movie before it reached the States, only to have its sinister, mirror-masked villain prove to be an alchemist seeking magical power.  But for others, this blurring of the lines between the two seems to reflect a belief that the two are the same—or at least aspects of the same reality. Or that the “occult sciences” are part of a higher reality than our visible one.  Somehow, it seems likely that these confusions will continue—and in all likelihood, get worse.  Because of Hollywood’s love of empty spectacle? Perhaps.  But it seems more likely that indie films will give birth to far more occult “science fiction” films—and not just because that’s where so many of these came from in the first place.  After all, it’s a venue where the unconventional and inexplicable can flourish, where the audiences are likely to applaud any film that keeps them awake and interested.  And where those making them have far fewer people to answer to. Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "text": "Non-Fiction\nSeparated at Birth? Occultism, Science Fiction, and Why People Can't Tell Them Apart\nThings are not always what they appear to be.\nFor example, take The Suns of Easter Island (1972), a film by French New Wave director Pierre Kast. The basic premise is familiar. So familiar, in fact, that one has to keep reminding oneself that it was made several years before a certain far better-known film. Aliens contact people with unique talents and tell them to come to a remote place to meet them. Most reviewers called it a science fiction film.\nAnd yet it isn’t. Not even close.\nIt is ultimately about the occult.\nThe truly strange thing is that it isn’t the only work that has been so badly misidentified.\nAnd perhaps the two have closer ties than we realize.\nThe connections between occultism and science fiction go back to the very roots of science fiction, to one of the genre’s seminal novels.\nSir Edward Bulwer-Lytton is best remembered now for his turgid prose, thanks to an annual writing contest named for him. He was, however, one of those curious figures so common in Victorian society: a nobleman who turned down the Greek crown, was busy in parliamentary politics, and unsuccessfully tried to get his wife committed to the asylum after they separated. Despite his writing style he was one of the most popular authors of his age, penning an impressive number of novels, plays, and poems (and coining a number of familiar phrases such as “the great unwashed” and “the pen is mightier than the sword“). His books ranged from historical epics to mystery, romance, horror, the occult, and a work of science fiction (or perhaps proto-SF), The Coming Race (aka Vril: The Power of the Coming Race).\nPublished just seven years after Jules Verne’s first science fiction novel, Journey to the Center of the Earth, Vril tells the story of a young man who accidentally discovers a lost civilization deep underground, whose human inhabitants are vastly more evolved than us and wield incredible powers through their mastery of a secret force known as Vril.\nIt was a highly influential work for the early development of science fiction (there are even claims that the Gene Autry serial, The Phantom Empire, is loosely based on the novel), but, curiously, a lot of real-life occultists adopted Bulwer-Lytton’s idea of Vril.\nFor that matter, they also adopted several of his other occult ideas. The Rosicrucians even claimed him as their “Grand Patron” (although he denied any connection to them). Various other esoteric groups claimed he had been a member (although some of these claims have been disproved). Nor is it clear whether any of his ideas were actual occult beliefs—or whether he just made them up.\nWhen the earliest enthusiasts for what would become science fiction went looking for works like those of Verne and Wells, there were few such stories to be found. They found a few buried among routine tales of supernatural horror, like Bierce’s “Moxon’s Master,” or ended up reading such works as William Hope Hodgson’s The House on the Borderland or Robert W. Chambers’ The King in Yellow.\nThe first story in Chambers’ collection, “The Repairer of Reputations” is set in the future (1920) and portrays the rise of an American Empire. It is more or less science fiction, although it might all be a delusion. A later story also involves time travel.\nHowever, these stories are all loosely tied together by the supernatural, thanks to the mysterious influence of The King in Yellow, which might be a play that causes insanity in those who read, a strange and decadent person, or a sinister yellow mark.\nThe House on the Borderland, on the other hand, was set in a lonely mansion with connections to something beyond our limited existence. It offered visions of alternate worlds, a hostile universe full of appalling superhuman intelligences (which would influence Lovecraft’s work) and even a glimpse of the far future and the death of the solar system.\nThis confusion carried into the early days of the pulp magazine, when science fiction was as likely to appear in magazines featuring weird horror as anywhere else.\nThe best known of these writers was H. P. Lovecraft, whose stories were filled with the occult, usually involving witchcraft and pagan ceremonies, while these unspeakable and unimaginable cosmic horrors frequently combined immense supernatural powers with incomprehensible alien entities. Ironically, some occultists even claimed that he hadn’t invented his fictional “Elder Gods” and that Cthulhu and the others were all real.\nOr one might note influential SF and horror writers like A. Merritt and Fritz Leiber, both of whom were assiduous students of the occult. Both had massive collections of occult books and paraphernalia, and both were as likely to write about the supernatural as science fiction.\nMeanwhile, Edgar Rice Burroughs, the creator of Tarzan, borrowed heavily from Helena Blavatsky’s theosophical notions of astral projection for his planetary romances (which is somewhat ironic when you consider that she borrowed heavily from Bulwer-Lytton!).\nWe tend to forget that the revival of the old classical culture that started during the High Middle Ages gave birth to both modern science and modern occultism.\nWhile most see this revival in a purely positive light, not only did scholars revive the great works of literature and philosophy, but pornography, torture (a major part of the old Roman Law), and, yes, the occult.\nIn fact, there is even an overlap between the revival of science and the occult as many of the scholars who helped give birth to science, like Albertus Magnus—whose interest in the natural world, which he shared with Aristotle, inspired a lot of the early scientific thinkers like Oresme, Buridan, and Galileo’s “French Scientists”—also explored the occult works of Classical authors like Hermes Trismegistus. In Christopher Marlowe’s play, Doctor Faustus debated the merits of the various disciplines he might study—such as law, philosophy, and theology—before he settled on magic on purely rational grounds. Or consider Giordano Bruno, an occultist who defended heliocentrism because it fit in with his esoteric philosophy, who has somehow become one of the martyrs of science, despite the awkward fact that the transcript of his trial makes no mention of Copernicus!\nAdding to the confusion, its practitioners often claimed that they had access to higher levels of reality and frequently called their doctrines the “occult sciences.” Some of these groups, like the Theosophists, actually achieved a strange sort of respectability thanks to such prominent supporters as Thomas Edison, the biologist Alfred Russel Wallace, and the inventor of the vacuum tube, William Crookes.\nNor did it help that a great many scientists threw their enthusiastic support behind spiritualism because it promised an empirical proof for the afterlife and might be able to unlock the mysteries of the universe, if those pesky spirits would ever stop talking about how happy they were.\nThis led the founder of parapsychology, J. B. Rhine, to attempt a scientific proof of the existence of psychic powers as a first step toward verifying the reality of spiritualism. His work gave a gloss of respectability to psychic powers—at least, until the flaws in his methodology raised too many questions about his conclusions.\nHowever, this didn’t stop editor John W. Campbell from promoting psychic powers within the pages of Astounding Science Fiction. One finds even a dogmatic materialist like Arthur C. Clarke turning out stories about beings evolving into immaterial intelligences in stories like Childhood’s End.\nAnd, as science fiction began to fade at the cinemas and horror and the supernatural became more popular, the supernatural began to play a larger part even in films which made some appeal to science: in 1957 alone, Blood of Dracula featured a scientist trying to perfect her theories of mental powers that would soon bring unlimited power to the world—with the help of an ancient amulet from the Carpathians; Voodoo Woman sent a scientist into the jungle to discover the ancient secret science behind voodoo (which required him to wear a goofy hat during his “research”); From Hell It Came pitted the scientists on a remote island against a tree monster summoned by a curse although our scientists did need to fertilize it a bit to get it to grow and learn that it is radioactive, in the end they merely push it into a swamp (in the most scientific way imaginable, of course), and the islanders decide to pursue science instead of magic; and we get the usual fifties scientific platitudes about everything having a rational explanation before The Disembodied gives us possession and voodoo magic.\nSomehow most of these threads seem to have become tangled up in the UFO craze.\nAfter all, it seemed to attract all sorts of reckless speculation, from Chariots of the Gods-style ancient astronauts to Nazis in the hollow Earth.\nCuriously, a lot of the stories about alien abduction, fiction or nonfiction (of which Whitley Strieber’s Communion is one of the best examples), resemble nothing so much as the older and darker traditional stories about encounters with fairies and leprechauns. It would take very little to change some of these—The Device (2014), for example—into a purely supernatural tale.\nIt is often hard to decide how to file some of these films, like the Australian Indiana Jones copy, Sky Pirates (1986), which ties together Easter Island, the Bermuda Triangle, the Philadelphia experiment, and the powerful “magic” slabs left by ancient aliens—who could just as easily be gods.\nOr consider the Richard Matheson-penned TV movie about a woman’s strange pregnancy, The Stranger Within (1974). It is essentially his version of the occult thrillers popular at the time, like Rosemary’s Baby or The Omen, and there is very little that makes it “science fiction” other than the minor fact that it’s aliens, and not the Devil, who are responsible. Nor do we ever get much in the way of alien imagery.\nThen there are a few strange examples of films that didn’t exactly start out as science fiction, like Rutger Hauer’s battle against a mysterious killer in a dismal future in Split Second (1992). While the beast absorbs DNA from other creatures and might be a laboratory creation or perhaps something alien, it also has apparently supernatural powers, thinks it is (and might even be) the devil, and has a psychic link to the hero. The movie itself really has no idea what to make of this thing, but perhaps it makes sense if you know that Split Second started out as a copy of the supernatural thriller, The First Power.\nHowever, we have to ignore this sort of confusion in Asian films, where the Japanese genre of tokusatsu is really about wild effects and gleefully mixes SF and magic with little regard. While in China, apparently supernatural films, like Chronicles of the Ghostly Tribe [Jiu ceng yao ta] (2015), with its aliens who could just as easily be fairies; or Time Raiders [Wu Xie Xiao Ge] (2016), with a revived snake goddess who might just have been a great scientist, have had materialistic explanations crammed in at the insistence of the Chinese government, which opposes anything supernatural in film, unless it is set in ancient times.\nA few so-called science fiction films are so clearly occult that it seems strange that anyone would mistake them for anything else.\nThe Suns of Easter Island is one of the best examples: It starts out with the main character, who is working on a big solar energy project, explaining about how he is a sorcerer from a long line of sorcerers. He then gives us a demonstration of geomancy before we move on to the other characters who include an archaeologist, a psychologist, an astronomer . . . and a voodoo priest.\nWe are told that the strange messages they all receive came from aliens from a distant world who occasionally contact people to find out whether our world is ready for them to bring us into their civilization. However, they seem far less like aliens and more like the occultists’ ascended masters, and seem far more interested in bringing us to enlightenment than in sharing their technology or trading with us.\nOr consider Code name: Ruby (1997), which was made for TV by one of the iconic directors of the Czech New Wave, Jan Nemec. It may start with the space shuttle colliding with a UFO, but before long it gets embroiled with alchemy, the quest for the philosopher’s stone, and a tourist trip through historic Prague. We are told that what really matters is not who is president, but who runs the Smithsonian Institution that guards all the ancient alchemical secrets—and that a young couple exploring Prague might just be able to finally create the stone.\nA very different example is the neo-noir reality bender, Yesterday Was a Lie (2009). A hard-boiled PI finds her latest case raising all sort of strange questions about changing reality with the mind, with plentiful references to quantum mechanics (that staple canned explanation for those who want to have impossible things happen in their films).\nHowever, what is really going on is something rather different: instead, the film revolves around Jungian archetypes and ultimately comes to a very occult answer: the human heart can change reality.\nWhile Carl Jung’s work still enjoys a certain credibility, a lot of psychologists don’t agree that it should be considered science. Richard Noll’s book, The Jung Cult, details Jung’s occult researches and influences—and claims Jungian analysis functions more like a religion than science. Whether he is right or not, in Yesterday Was a Lie, Jung is one of the keys to what amounts to occult power.\nA less-obvious example is I Origins, a 2014 film advertised as a science fiction whose official synopses described it as the story of a scientist whose research into the human eye had discovered something that would change the world.\nThe discovery, however, is that a child had the exact same retinal pattern as someone who died, and that the child is apparently her reincarnation.\nWhat makes this particularly absurd and unscientific is that the retinal pattern is essentially random and does not even repeat exactly between twins (even if it might be similar). Nor would it be identical in a clone. So, obviously, we are talking about a supernatural effect, even if it can be measured empirically.\nOne suspects that a lot of this confusion is caused not by the filmmakers themselves, but by the critics, press, and yes, the press releases provided by the distributors. Still, this can be enormously frustrating, as with the stylish 2001 French thriller, Vidocq (aka, Dark Portals: The Chronicles of Vidocq), which was heralded as a steampunk movie before it reached the States, only to have its sinister, mirror-masked villain prove to be an alchemist seeking magical power.\nBut for others, this blurring of the lines between the two seems to reflect a belief that the two are the same—or at least aspects of the same reality. Or that the “occult sciences” are part of a higher reality than our visible one.\nSomehow, it seems likely that these confusions will continue—and in all likelihood, get worse.\nBecause of Hollywood’s love of empty spectacle? Perhaps.\nBut it seems more likely that indie films will give birth to far more occult “science fiction” films—and not just because that’s where so many of these came from in the first place.\nAfter all, it’s a venue where the unconventional and inexplicable can flourish, where the audiences are likely to applaud any film that keeps them awake and interested.\nAnd where those making them have far fewer people to answer to.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "source": "https://clarkesworldmagazine.com/cole_03_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Separated at Birth? Occultism, Science Fiction, and Why People Can't Tell Them Apart by Mark Cole"}