{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nian Yu; Andy Dudak", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "UgyLcvHcAkFro6iEb/4u6F4wVqk=", "id": null, "license": null, "comments": "", "raw_text": "3530 words, short story  In Search of Your Memories  Application Number 7529910456  This section of the conversation record is, by default, unavailable to the applicant.  If truly necessary, access is subject to review by two or more administrators.  I see a village.  Low houses, fields, open countryside.  The setting sun through branches of white birch, children with backpacks running along an embankment between paddy fields. The late-autumn birches shed bright leaves. Occasionally, birch bark crackles beneath young trampling feet.  A long procession emerges from the sunset glow, drawing near. An elderly couple steps out of the ranks, each holding on to a tiny hand.  They stand and watch the women in sackcloth pass by. The women keen and wail, the performance so exaggerated I have a hard time believing they mourn relatives or friends. They seem more like the hired wailers of olden times. The suona horn players follow, blowing a funeral dirge, but they don’t seem all that sorrowful. A youngster’s mouth curls in an absentminded grin, his thoughts far away. All of this together is fantastical, a scene composed of disparate elements that could drift apart at any moment.  The subject tells me the scene is from the 1990s, and a little-known corner of the North China Plain.  Small three-story houses of yellow clay and black roof tile, interlocked, clustered together to form the village, make for a sense of dislocation in time and space. Factory chimneys spout pale smoke, which mingles with that of straw fires to form the forever dun-colored sky.  I can’t walk into his memories, but I suppose they must engender some particularly unhappy feelings. Industry brought rapid development to these small, forgotten communities, and left behind scars, scars that can’t be forgotten or washed away.  The memory ceases here, abruptly.  These memories are not problematic in terms of content. Everything is authentic: people, things, events. With a sudden jump out of the situation, real memories are easily distinguishable from dreams and fantasies.  But from our perspective, when a data stream ends so smoothly and plainly, it means it originally didn’t end there.  Something has been deleted.  Not lost or forgotten, but intentionally deleted.  Many sections of memory are like onions cut up by a kitchen knife, memories gutted and torn to pieces. Moments seeming to lead somewhere have been cut short, crudely and violently.  Somewhat angrily, I finish watching the first batch of memory extracts.  In consciousness upload, memories of youth become the foundation for constructing a worldview. Restorationists, responsible for cobbling together an uploaded consciousness when automation fails, should understand this. And yet they cut these memories into senseless fragments, and wantonly deleted so much.  I often come across finely trimmed memories, but I’ve never seen traces of such drastic cuts before. The subject is a common civil servant, no criminal record, no obvious shortcomings morally or in terms of character.  So why this meddling? There’s no sense in it!  The subject seems completely ignorant of his unfortunate situation.  He only knows he lost some memories, some important feeling or attachment.  “I want to search for someone,” he says.  I nod.  “Of course, everyone who comes here wants to retrieve memories, or love, or a part of their personality.”  According to the record, he suffered a data avalanche during upload. Perhaps this was the restorationist’s initial reason for cutting memories.  It’s extraordinary good luck he survived at all.  Generally, when it comes to total transfer, the consciousness stored in the data stream must be completed quickly, otherwise synaptic electrical signals will rapidly vanish, becoming meaningless heat and noise. Thus, we must selectively abandon much data.  In fact, only 0.2% of the data is truly valuable, consisting of personality, mood, language, and memory.  In the instant of transfer from brain to information network, the base, biology-governing infrastructure of the brain, is automatically distinguished and deleted. We no longer need the feedback of hot or cold, hungry or full. All we need is the important stuff: love, memory, personality.  If, during this process, someone’s memory information deviates too much from the standard model, error deletions and processing delays readily arise. We call this an avalanche.  If too much data is lost, or crucial data is lost, it may be impossible to reconstruct a mature personality. Genuine soul-death, in other words. But if the subject’s luck is neither too bad nor too good, they will survive, truncated, a portion of memory or personality lost.  Just like him.  I hastily thumb through his memories, while listening to his simple narration of his experiences.  Liang Sheng, born in 1987 on the North China Plain.  When he’s 9 years old, his father dies in a construction accident. His mother vanishes soon afterward, leaving no message behind, taking with her a small fortune in compensation funds. Liang Sheng ends up living with his paternal grandparents.  The memory gaps begin around here.  Liang Sheng later passes the provincial capital’s middle school entrance exam. He repeats a year, and tests into college at 19, and leaves home. During his undergrad years he begins to suffer serious depression, complicated by a sense that the feelings of two personalities are at odds in his mind—or to use the common parlance, schizophrenia.  Later we find a big memory gap—events unknown.  Finally, he completes his studies, graduates, begins work at a local tax bureau, is steadily promoted, settles down and marries, has a daughter, and lives an ordinary life. Toward the end, with some money saved, he decides to upload his consciousness.  “There is someone missing from my memories,” he says. “I can feel it. Love, warmth, all these feelings . . . I have so many beautiful memories. I’m grateful for my life, but I have this nagging feeling that someone is missing.”  “Are you sure?”  “Very sure. There’s someone there. Every time I think of this person, I feel that warmth. I mean, I have a wife and daughter, but it’s not them. It’s just not the same.”  I nod.  Feelings are always difficult to describe clearly.  I know he yearns for this missing love. Loneliness stalks him like his own shadow.  All those scenes featuring his parents are grand, solemn occasions, usually in winter, bright red New Year decorations contrasting with snow stretching as far as the eye can see.  Soon after comes that first memory I saw. Liang Sheng’s mother vanishes, and the villagers say she’s no longer fit to be called a mother. His grandparents don’t have time to look after him. It’s all they can do to keep him fed and clothed.  I begin to suspect that this missing person of Liang Sheng’s is just a fantasy, or delusion.  The lonely, yearning to be held, need fellow travelers to lick their wounds with. If they can’t find such companions, they comfort themselves.  In any case, all his secrets hide in those blank spaces. Perhaps I can conduct a thorough investigation based entirely on memory, or maybe I’ll have to leap free of memory’s fetters.  “The odds of finding your lost memories are low,” I tell him, “but of course there’s another way. I could go outside the data and seek the memory that way. But you know, that could take a while. Moreover, even if I find what you’re looking for, I’d have to evaluate whether you could safely receive the information. So, I wouldn’t necessarily tell you.”  “I understand,” he says, quite serene. “The last time I applied, I received no answer. All records were classified unreadable.”  “Nothing else? Admins will usually give some comment in the way of feedback.”  “After the protective deletions related to my avalanche,” he says, “there was only the ‘classified unreadable’ message. I asked others about it. Apparently, it’s a pleasantry that means he didn’t find anything.”  “Not uncommon,” I say.  “I know being an administrator is difficult,” he says in a low voice. “Still having a body, and memories of love and warmth, it’s extraordinary that you subject yourself to this sort of work. This matter of mine is perhaps . . . difficult, but to me it’s very important.”  “I will help you,” I say. “For the sake of a human being and his memories, I can stick around.”  In the end, I don’t tell him about the excessive memory deletions. Reason, after a long struggle, prevails over my sense of justice.  Of course, perhaps I’ll consider filing a complaint or appeal with his restorationist. Theoretically, an admin has the right to do so.  “Okay, please confirm again,” I say. “Including all of the foregoing dialogue, this section of memory will be erased. You’re clear on that?”  “This isn’t my first time around,” Liang Sheng replies, calm as ever.  “Alright.”  After this segment of memory has been erased, I’ll tell him to go back and await news.  This is all I can tell him.  Application Number 7529910456  END  I think of this as a special case among many applications.  Plenty of people lose memories during consciousness upload, and quite a few are more serious cases than he. If he’s different, it’s probably because an unqualified restorationist handled him after his data avalanche.  Or perhaps his restorationist was talented and did the best anyone could have.  Who knows? I calm down as time passes. Memory deletion is hard work, and unnecessary deletions are bound to be intentional, with definite motives behind them.  It is not until several days later, with the beginning of the social investigations, that I begin to realize this is no simple matter.  It doesn’t take deep thinking. A primary school student could see how different he is. Under his social contact restrictions, his banned contacts list contains an astonishing 452 people.  How is this possible?  Barring the unforeseen, these records contain his friends and family, kith and kin, all his social relations.  Common sense tells us that, in general, the average person can maintain a social contact network of no more than 150 people.  And this list has gone beyond mere “acquaintances.” The details are classified, above an admin’s clearance level.  Social contact bans don’t happen often.  They’re usually from the subject’s own settings, people the subject doesn’t want to meet or interact with. Or, serious conflicts with others during one’s life can lead to contact bans at the restorationist intervention level.  Creditors, officials, or businessmen with many enemies.  But even in those cases, I’ve never seen a banned contacts list of 452 people, and this list is classified, restorationist level or above . . .  Why?  His social relationships have been wiped clean, leaving no trace.  I have seen a similar memory model, a former Navy R&D Ministry engineer. Many of his colleagues chose to forgo the continued life of upload, but in the end, he couldn’t make that immense sacrifice. Thus, for the price of severe social contact restriction and memory sequestration, he retained his personality, and was even able to maintain contact with his family and share memories with them.  So, what about Liang Sheng?  Did something happen in those four blank years that necessitated thorough memory deletion? What might be concealed behind those fragmented memories of childhood? Did it all start back then?  Curiosity spurs my investigation on, while a voice in my head nags me: perhaps I shouldn’t be meddling in other people’s business.  Indeed, even ten-year-old children ought to know that investigation can be dangerous.  I’m just a common admin.  Fortunately, admins tend to have relatively high adaptability in terms of brain structure and modes of thinking.  I can indeed leave this place, the Second World, which only exists and has form as information. But I only have one short holiday every three months.  Keeping up with our time-consuming and difficult work, we cannot afford more extravagant or frequent rests. But Liang Sheng’s social contacts ban prevents me from doing all my investigating during work hours. I could take the investigation further during my next leave. I could seek his past in the real world, but I wouldn’t be getting paid.  Administration is a hard, petty, low profession. We’re always replaceable.  Perhaps I should be like his last admin, say “no comment” regarding his memories. It would be slightly better than hearing he’s powerless, but it’s even sadder.  However, in addition to reason, there’s another unchanging principle in the world, true since time immemorial. When you begin to weigh the pros and cons of something, doing your utmost to prevent yourself from acting, you’ve already reached your decision, firmly, deep down and beyond any value assessment.  Those big gaps in his memory, laden with grief and loneliness beyond description, finally compel me to set off in search of his memories.  Thus, on the second day of my vacation, I fly north, toward my goal and hopefully the truth.  Time flies, villages become towns, ups and downs follow economic fluctuations. The village of Liang Sheng’s memory has changed. People have moved away one by one. Only the white birches remain, standing quietly in the autumn wind.  Liang Sheng’s contemporaries and friends have passed away, some choosing to upload; but thanks to Liang Sheng’s contact ban, I can’t obtain contact permissions for them.  As the week wears on and I come up empty-handed, my curiosity gives way to frustration.  I decide to leave. My remaining vacation time can be well spent at home, resting. But the night before my flight, I break the case wide open, almost by accident.  A hospital birth record from 1987.  His birth certificate might be an important ID document, but I considered it useless to my investigation. The contact details and address have long since become invalid. What useful information could there be? But when I look at it this time, I see two names on the record.  Liang Sheng, and Liang Xuan.  They were born approximately 25 minutes apart.  Liang Xuan?  The name is like a bolt of lightning streaking through my mind.  All the clues point to one answer. There is a rational explanation for everything.  Liang Sheng has a brother. A brother thoroughly deleted from his memory! I nearly leap out of bed in my excitement.  Liang Sheng was a difficult name to research online, but Liang Xuan is different.  My thinking was trapped by false appearances, in meticulously trimmed memories and the falsehood they’re meant to portray. I believed all along that Liang Sheng was an only child, and he believes the same, but it’s not so!  Maybe he didn’t need the erasure himself. Maybe it was someone else. Maybe Liang Sheng is an innocent who’s been drawn into something bigger.  Liang Xuan. I spent a week investigating, exhausting every means, consuming nearly half of my vacation time, and now I’ve stumbled upon the name in the simplest way.  But it could be worse.  Via online records, and the oral accounts of people still alive, I gradually sketch out the face of the past.  And it’s not at all in line with what I thought.  In autumn of 1996, Liang Sheng and Liang Xuan’s father died. Their mother returned to her hometown, and never showed up again.  Liang Xuan had been going with his migrant worker parents on their trips, while Liang Sheng stayed home. After the accident, both were raised by their paternal grandparents.  Later, due to severe economic pressure, Liang Xuan dropped out of school to do manual labor, working to support Liang Sheng, who had slightly better grades, as he continued on to high school. During the year Liang Sheng repeated a grade, when he became depressed after his college entrance exam, Liang Xuan immediately moved to his brother’s city, and Liang Sheng’s mood gradually stabilized.  Out of fraternal concern, Liang Xuan frequently visited his brother. In 2001, concerned for his own future, Liang Xuan joined the army.  He and Liang Sheng had the same ability and intelligence and aspirations. If things had been different, Liang Xuan might have matched or even outdone his brother’s academic accomplishments.  From age 9 to 19, they were together from morning to night. And they saw each other often during the following four years. Fourteen years altogether.  Liang Xuan’s conduct went above and beyond a big brother’s scope. He did his utmost to support his younger brother, and to love him, utterly devoted. This was love with no thought of reciprocation, or maybe Liang Sheng’s gratitude was reciprocation enough, and all that Liang Xuan prayed for.  The last record ends at 2051. Liang Sheng was seriously ill and chose to upload his consciousness. He suffered a terminal data avalanche. Soon afterward and without hesitation, Liang Xuan chose to jointly upload.  He was Liang Sheng’s twin, so of course he also suffered an avalanche.  The restorationist in charge braved dangerous ethical waters to perform a high-risk procedure, the merging of two personalities. The data from two people was fed into an algorithm for integrating fragmented data. The memories were reviewed, and contradictory or redundant memories were deleted.  Liang Sheng and Liang Xuan. Two lifetimes of memories.  The majority of Liang Xuan’s memories were discarded, leaving Liang Sheng’s to fill those vast spaces. Childhood memories complemented and completed each other, some belonging to Liang Sheng, some to Liang Xuan.  Liang Xuan returned to his hometown at nine years old, after his father passed away, so large-scale memory deletion and revision began from then on. Then there were the times they were together during the university years. Due to differences of identity, status, and perspective, retaining feasible memories of this time was more conspicuously difficult. Later, continuing to visit often, they were just brothers, to the extent that those memories usually bore little trace of revision.  All young people want to leave home, to grow up. But those bygone days never vanish. Instead, as time goes on, they come to seem extremely precious.  They were both children yearning for love and warmth. They both had strong and competitive hearts. In the end, two similar, fragmented minds were successfully merged, and two became one.  In the records of the corporeal world, Liang Xuan is registered as deceased, his upload failed.  The Second World records were altered, Liang Sheng’s family tree revised. In Second World, Liang Xuan never existed.  Liang Xuan’s wife had passed, dead of acute disease, when he decided to upload. She never uploaded herself. His son and daughter are still alive. Their father left them overnight, for the sake of another old man they barely knew.  I will not disturb their lives. I dare not imagine how they would react to the truth.  Love may be very important and have real weight. Not based on proximity in time, space, or blood kinship, and not resting on moral judgement or the will to change a preordained fate. Rather, love is important in the disparity of life and death, in life-and-death choices, which are brutal and cruel as nature.  And Liang Sheng, in the middle of the vortex, cannot understand it all.  When I return to work, I record “no result” on his application.  First and foremost, I must protect him and his restorationist. He exists beyond the realm of ethics, and that brave restorationist has done enough to go to prison. Moreover, a consciousness composed of mishap and experiment might not be up to bearing the truth.  Meanwhile, there is another question. Who actually is he? Liang Xuan or Liang Sheng? Or both?  Of course, a few words sent to him would go a long way, and would certainly be true: “You are loved, and the one who loves you is always at your side.”  I want to tell him this, but I can’t open my mouth.  The truth would do very little for him, in terms of satisfaction or consummation. He yearns for warmth, for an embrace, and was long ago left with nothing but a remote, cherished memory.  Perhaps he will continue to seek these feelings for a long time.  Maybe that’s for the best. Sometimes the unattainable feeling can be the most beautiful.  I meant to use polite formality to end the feedback message. I’m about to send when I hesitate, and I go back and revise.  “Didn’t find your memories. Very sorry. Cherish well what you long for. Those things are also an aspect of memory.”  The memory of our conversation is no longer on record. These words will be all he gets.  And they are all I want to say.  I still remember my youth, vaguely, murkily. The past is like a treasure hoard of text, images, and video files in the wake of a website shutdown—erased. But primordial passions and dreams are still backed up, intact, in the softest places of my heart.  I suppose Liang Sheng feels something like that. It’s easy to imagine.  Years from now I expect I’ll still recall them, their comradery arising from blood. Lonely children shouldering pain together, forging ahead for 14 years. Even with the memories lost, that love and warmth can’t ever be forgotten.  My admin’s instinct tells me he will continue with his search, continue to hesitate, strive, and come up empty-handed.  But I think they pray for the same things for each other: to be able to walk in the world as before, to vaguely recall that warm feeling, to know happiness both tiny and grand.    Translated and published in partnership with Storycom.  Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "text": "3530 words, short story\nIn Search of Your Memories\nApplication Number 7529910456\nThis section of the conversation record is, by default, unavailable to the applicant.\nIf truly necessary, access is subject to review by two or more administrators.\nI see a village.\nLow houses, fields, open countryside.\nThe setting sun through branches of white birch, children with backpacks running along an embankment between paddy fields. The late-autumn birches shed bright leaves. Occasionally, birch bark crackles beneath young trampling feet.\nA long procession emerges from the sunset glow, drawing near. An elderly couple steps out of the ranks, each holding on to a tiny hand.\nThey stand and watch the women in sackcloth pass by. The women keen and wail, the performance so exaggerated I have a hard time believing they mourn relatives or friends. They seem more like the hired wailers of olden times. The suona horn players follow, blowing a funeral dirge, but they don’t seem all that sorrowful. A youngster’s mouth curls in an absentminded grin, his thoughts far away. All of this together is fantastical, a scene composed of disparate elements that could drift apart at any moment.\nThe subject tells me the scene is from the 1990s, and a little-known corner of the North China Plain.\nSmall three-story houses of yellow clay and black roof tile, interlocked, clustered together to form the village, make for a sense of dislocation in time and space. Factory chimneys spout pale smoke, which mingles with that of straw fires to form the forever dun-colored sky.\nI can’t walk into his memories, but I suppose they must engender some particularly unhappy feelings. Industry brought rapid development to these small, forgotten communities, and left behind scars, scars that can’t be forgotten or washed away.\nThe memory ceases here, abruptly.\nThese memories are not problematic in terms of content. Everything is authentic: people, things, events. With a sudden jump out of the situation, real memories are easily distinguishable from dreams and fantasies.\nBut from our perspective, when a data stream ends so smoothly and plainly, it means it originally didn’t end there.\nSomething has been deleted.\nNot lost or forgotten, but intentionally deleted.\nMany sections of memory are like onions cut up by a kitchen knife, memories gutted and torn to pieces. Moments seeming to lead somewhere have been cut short, crudely and violently.\nSomewhat angrily, I finish watching the first batch of memory extracts.\nIn consciousness upload, memories of youth become the foundation for constructing a worldview. Restorationists, responsible for cobbling together an uploaded consciousness when automation fails, should understand this. And yet they cut these memories into senseless fragments, and wantonly deleted so much.\nI often come across finely trimmed memories, but I’ve never seen traces of such drastic cuts before. The subject is a common civil servant, no criminal record, no obvious shortcomings morally or in terms of character.\nSo why this meddling? There’s no sense in it!\nThe subject seems completely ignorant of his unfortunate situation.\nHe only knows he lost some memories, some important feeling or attachment.\n“I want to search for someone,” he says.\nI nod.\n“Of course, everyone who comes here wants to retrieve memories, or love, or a part of their personality.”\nAccording to the record, he suffered a data avalanche during upload. Perhaps this was the restorationist’s initial reason for cutting memories.\nIt’s extraordinary good luck he survived at all.\nGenerally, when it comes to total transfer, the consciousness stored in the data stream must be completed quickly, otherwise synaptic electrical signals will rapidly vanish, becoming meaningless heat and noise. Thus, we must selectively abandon much data.\nIn fact, only 0.2% of the data is truly valuable, consisting of personality, mood, language, and memory.\nIn the instant of transfer from brain to information network, the base, biology-governing infrastructure of the brain, is automatically distinguished and deleted. We no longer need the feedback of hot or cold, hungry or full. All we need is the important stuff: love, memory, personality.\nIf, during this process, someone’s memory information deviates too much from the standard model, error deletions and processing delays readily arise. We call this an avalanche.\nIf too much data is lost, or crucial data is lost, it may be impossible to reconstruct a mature personality. Genuine soul-death, in other words. But if the subject’s luck is neither too bad nor too good, they will survive, truncated, a portion of memory or personality lost.\nJust like him.\nI hastily thumb through his memories, while listening to his simple narration of his experiences.\nLiang Sheng, born in 1987 on the North China Plain.\nWhen he’s 9 years old, his father dies in a construction accident. His mother vanishes soon afterward, leaving no message behind, taking with her a small fortune in compensation funds. Liang Sheng ends up living with his paternal grandparents.\nThe memory gaps begin around here.\nLiang Sheng later passes the provincial capital’s middle school entrance exam. He repeats a year, and tests into college at 19, and leaves home. During his undergrad years he begins to suffer serious depression, complicated by a sense that the feelings of two personalities are at odds in his mind—or to use the common parlance, schizophrenia.\nLater we find a big memory gap—events unknown.\nFinally, he completes his studies, graduates, begins work at a local tax bureau, is steadily promoted, settles down and marries, has a daughter, and lives an ordinary life. Toward the end, with some money saved, he decides to upload his consciousness.\n“There is someone missing from my memories,” he says. “I can feel it. Love, warmth, all these feelings . . . I have so many beautiful memories. I’m grateful for my life, but I have this nagging feeling that someone is missing.”\n“Are you sure?”\n“Very sure. There’s someone there. Every time I think of this person, I feel that warmth. I mean, I have a wife and daughter, but it’s not them. It’s just not the same.”\nI nod.\nFeelings are always difficult to describe clearly.\nI know he yearns for this missing love. Loneliness stalks him like his own shadow.\nAll those scenes featuring his parents are grand, solemn occasions, usually in winter, bright red New Year decorations contrasting with snow stretching as far as the eye can see.\nSoon after comes that first memory I saw. Liang Sheng’s mother vanishes, and the villagers say she’s no longer fit to be called a mother. His grandparents don’t have time to look after him. It’s all they can do to keep him fed and clothed.\nI begin to suspect that this missing person of Liang Sheng’s is just a fantasy, or delusion.\nThe lonely, yearning to be held, need fellow travelers to lick their wounds with. If they can’t find such companions, they comfort themselves.\nIn any case, all his secrets hide in those blank spaces. Perhaps I can conduct a thorough investigation based entirely on memory, or maybe I’ll have to leap free of memory’s fetters.\n“The odds of finding your lost memories are low,” I tell him, “but of course there’s another way. I could go outside the data and seek the memory that way. But you know, that could take a while. Moreover, even if I find what you’re looking for, I’d have to evaluate whether you could safely receive the information. So, I wouldn’t necessarily tell you.”\n“I understand,” he says, quite serene. “The last time I applied, I received no answer. All records were classified unreadable.”\n“Nothing else? Admins will usually give some comment in the way of feedback.”\n“After the protective deletions related to my avalanche,” he says, “there was only the ‘classified unreadable’ message. I asked others about it. Apparently, it’s a pleasantry that means he didn’t find anything.”\n“Not uncommon,” I say.\n“I know being an administrator is difficult,” he says in a low voice. “Still having a body, and memories of love and warmth, it’s extraordinary that you subject yourself to this sort of work. This matter of mine is perhaps . . . difficult, but to me it’s very important.”\n“I will help you,” I say. “For the sake of a human being and his memories, I can stick around.”\nIn the end, I don’t tell him about the excessive memory deletions. Reason, after a long struggle, prevails over my sense of justice.\nOf course, perhaps I’ll consider filing a complaint or appeal with his restorationist. Theoretically, an admin has the right to do so.\n“Okay, please confirm again,” I say. “Including all of the foregoing dialogue, this section of memory will be erased. You’re clear on that?”\n“This isn’t my first time around,” Liang Sheng replies, calm as ever.\n“Alright.”\nAfter this segment of memory has been erased, I’ll tell him to go back and await news.\nThis is all I can tell him.\nApplication Number 7529910456\nEND\nI think of this as a special case among many applications.\nPlenty of people lose memories during consciousness upload, and quite a few are more serious cases than he. If he’s different, it’s probably because an unqualified restorationist handled him after his data avalanche.\nOr perhaps his restorationist was talented and did the best anyone could have.\nWho knows? I calm down as time passes. Memory deletion is hard work, and unnecessary deletions are bound to be intentional, with definite motives behind them.\nIt is not until several days later, with the beginning of the social investigations, that I begin to realize this is no simple matter.\nIt doesn’t take deep thinking. A primary school student could see how different he is. Under his social contact restrictions, his banned contacts list contains an astonishing 452 people.\nHow is this possible?\nBarring the unforeseen, these records contain his friends and family, kith and kin, all his social relations.\nCommon sense tells us that, in general, the average person can maintain a social contact network of no more than 150 people.\nAnd this list has gone beyond mere “acquaintances.” The details are classified, above an admin’s clearance level.\nSocial contact bans don’t happen often.\nThey’re usually from the subject’s own settings, people the subject doesn’t want to meet or interact with. Or, serious conflicts with others during one’s life can lead to contact bans at the restorationist intervention level.\nCreditors, officials, or businessmen with many enemies.\nBut even in those cases, I’ve never seen a banned contacts list of 452 people, and this list is classified, restorationist level or above . . .\nWhy?\nHis social relationships have been wiped clean, leaving no trace.\nI have seen a similar memory model, a former Navy R&D Ministry engineer. Many of his colleagues chose to forgo the continued life of upload, but in the end, he couldn’t make that immense sacrifice. Thus, for the price of severe social contact restriction and memory sequestration, he retained his personality, and was even able to maintain contact with his family and share memories with them.\nSo, what about Liang Sheng?\nDid something happen in those four blank years that necessitated thorough memory deletion? What might be concealed behind those fragmented memories of childhood? Did it all start back then?\nCuriosity spurs my investigation on, while a voice in my head nags me: perhaps I shouldn’t be meddling in other people’s business.\nIndeed, even ten-year-old children ought to know that investigation can be dangerous.\nI’m just a common admin.\nFortunately, admins tend to have relatively high adaptability in terms of brain structure and modes of thinking.\nI can indeed leave this place, the Second World, which only exists and has form as information. But I only have one short holiday every three months.\nKeeping up with our time-consuming and difficult work, we cannot afford more extravagant or frequent rests. But Liang Sheng’s social contacts ban prevents me from doing all my investigating during work hours. I could take the investigation further during my next leave. I could seek his past in the real world, but I wouldn’t be getting paid.\nAdministration is a hard, petty, low profession. We’re always replaceable.\nPerhaps I should be like his last admin, say “no comment” regarding his memories. It would be slightly better than hearing he’s powerless, but it’s even sadder.\nHowever, in addition to reason, there’s another unchanging principle in the world, true since time immemorial. When you begin to weigh the pros and cons of something, doing your utmost to prevent yourself from acting, you’ve already reached your decision, firmly, deep down and beyond any value assessment.\nThose big gaps in his memory, laden with grief and loneliness beyond description, finally compel me to set off in search of his memories.\nThus, on the second day of my vacation, I fly north, toward my goal and hopefully the truth.\nTime flies, villages become towns, ups and downs follow economic fluctuations. The village of Liang Sheng’s memory has changed. People have moved away one by one. Only the white birches remain, standing quietly in the autumn wind.\nLiang Sheng’s contemporaries and friends have passed away, some choosing to upload; but thanks to Liang Sheng’s contact ban, I can’t obtain contact permissions for them.\nAs the week wears on and I come up empty-handed, my curiosity gives way to frustration.\nI decide to leave. My remaining vacation time can be well spent at home, resting. But the night before my flight, I break the case wide open, almost by accident.\nA hospital birth record from 1987.\nHis birth certificate might be an important ID document, but I considered it useless to my investigation. The contact details and address have long since become invalid. What useful information could there be? But when I look at it this time, I see two names on the record.\nLiang Sheng, and Liang Xuan.\nThey were born approximately 25 minutes apart.\nLiang Xuan?\nThe name is like a bolt of lightning streaking through my mind.\nAll the clues point to one answer. There is a rational explanation for everything.\nLiang Sheng has a brother. A brother thoroughly deleted from his memory! I nearly leap out of bed in my excitement.\nLiang Sheng was a difficult name to research online, but Liang Xuan is different.\nMy thinking was trapped by false appearances, in meticulously trimmed memories and the falsehood they’re meant to portray. I believed all along that Liang Sheng was an only child, and he believes the same, but it’s not so!\nMaybe he didn’t need the erasure himself. Maybe it was someone else. Maybe Liang Sheng is an innocent who’s been drawn into something bigger.\nLiang Xuan. I spent a week investigating, exhausting every means, consuming nearly half of my vacation time, and now I’ve stumbled upon the name in the simplest way.\nBut it could be worse.\nVia online records, and the oral accounts of people still alive, I gradually sketch out the face of the past.\nAnd it’s not at all in line with what I thought.\nIn autumn of 1996, Liang Sheng and Liang Xuan’s father died. Their mother returned to her hometown, and never showed up again.\nLiang Xuan had been going with his migrant worker parents on their trips, while Liang Sheng stayed home. After the accident, both were raised by their paternal grandparents.\nLater, due to severe economic pressure, Liang Xuan dropped out of school to do manual labor, working to support Liang Sheng, who had slightly better grades, as he continued on to high school. During the year Liang Sheng repeated a grade, when he became depressed after his college entrance exam, Liang Xuan immediately moved to his brother’s city, and Liang Sheng’s mood gradually stabilized.\nOut of fraternal concern, Liang Xuan frequently visited his brother. In 2001, concerned for his own future, Liang Xuan joined the army.\nHe and Liang Sheng had the same ability and intelligence and aspirations. If things had been different, Liang Xuan might have matched or even outdone his brother’s academic accomplishments.\nFrom age 9 to 19, they were together from morning to night. And they saw each other often during the following four years. Fourteen years altogether.\nLiang Xuan’s conduct went above and beyond a big brother’s scope. He did his utmost to support his younger brother, and to love him, utterly devoted. This was love with no thought of reciprocation, or maybe Liang Sheng’s gratitude was reciprocation enough, and all that Liang Xuan prayed for.\nThe last record ends at 2051. Liang Sheng was seriously ill and chose to upload his consciousness. He suffered a terminal data avalanche. Soon afterward and without hesitation, Liang Xuan chose to jointly upload.\nHe was Liang Sheng’s twin, so of course he also suffered an avalanche.\nThe restorationist in charge braved dangerous ethical waters to perform a high-risk procedure, the merging of two personalities. The data from two people was fed into an algorithm for integrating fragmented data. The memories were reviewed, and contradictory or redundant memories were deleted.\nLiang Sheng and Liang Xuan. Two lifetimes of memories.\nThe majority of Liang Xuan’s memories were discarded, leaving Liang Sheng’s to fill those vast spaces. Childhood memories complemented and completed each other, some belonging to Liang Sheng, some to Liang Xuan.\nLiang Xuan returned to his hometown at nine years old, after his father passed away, so large-scale memory deletion and revision began from then on. Then there were the times they were together during the university years. Due to differences of identity, status, and perspective, retaining feasible memories of this time was more conspicuously difficult. Later, continuing to visit often, they were just brothers, to the extent that those memories usually bore little trace of revision.\nAll young people want to leave home, to grow up. But those bygone days never vanish. Instead, as time goes on, they come to seem extremely precious.\nThey were both children yearning for love and warmth. They both had strong and competitive hearts. In the end, two similar, fragmented minds were successfully merged, and two became one.\nIn the records of the corporeal world, Liang Xuan is registered as deceased, his upload failed.\nThe Second World records were altered, Liang Sheng’s family tree revised. In Second World, Liang Xuan never existed.\nLiang Xuan’s wife had passed, dead of acute disease, when he decided to upload. She never uploaded herself. His son and daughter are still alive. Their father left them overnight, for the sake of another old man they barely knew.\nI will not disturb their lives. I dare not imagine how they would react to the truth.\nLove may be very important and have real weight. Not based on proximity in time, space, or blood kinship, and not resting on moral judgement or the will to change a preordained fate. Rather, love is important in the disparity of life and death, in life-and-death choices, which are brutal and cruel as nature.\nAnd Liang Sheng, in the middle of the vortex, cannot understand it all.\nWhen I return to work, I record “no result” on his application.\nFirst and foremost, I must protect him and his restorationist. He exists beyond the realm of ethics, and that brave restorationist has done enough to go to prison. Moreover, a consciousness composed of mishap and experiment might not be up to bearing the truth.\nMeanwhile, there is another question. Who actually is he? Liang Xuan or Liang Sheng? Or both?\nOf course, a few words sent to him would go a long way, and would certainly be true: “You are loved, and the one who loves you is always at your side.”\nI want to tell him this, but I can’t open my mouth.\nThe truth would do very little for him, in terms of satisfaction or consummation. He yearns for warmth, for an embrace, and was long ago left with nothing but a remote, cherished memory.\nPerhaps he will continue to seek these feelings for a long time.\nMaybe that’s for the best. Sometimes the unattainable feeling can be the most beautiful.\nI meant to use polite formality to end the feedback message. I’m about to send when I hesitate, and I go back and revise.\n“Didn’t find your memories. Very sorry. Cherish well what you long for. Those things are also an aspect of memory.”\nThe memory of our conversation is no longer on record. These words will be all he gets.\nAnd they are all I want to say.\nI still remember my youth, vaguely, murkily. The past is like a treasure hoard of text, images, and video files in the wake of a website shutdown—erased. But primordial passions and dreams are still backed up, intact, in the softest places of my heart.\nI suppose Liang Sheng feels something like that. It’s easy to imagine.\nYears from now I expect I’ll still recall them, their comradery arising from blood. Lonely children shouldering pain together, forging ahead for 14 years. Even with the memories lost, that love and warmth can’t ever be forgotten.\nMy admin’s instinct tells me he will continue with his search, continue to hesitate, strive, and come up empty-handed.\nBut I think they pray for the same things for each other: to be able to walk in the world as before, to vaguely recall that warm feeling, to know happiness both tiny and grand.\nTranslated and published in partnership with Storycom.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "source": "https://clarkesworldmagazine.com/nian_04_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In Search of Your Memories by Nian Yu, translated by Andy Dudak"}