{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yAKZJddqmqu1wAPxoKLIQ8EJtQ0=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Wedging the Door Open: Discussing The Weird  What is The Weird?  \"The Weird speaks with over a hundred voices from more than a hundred years about alien territories of the human mind,\" said Leena Krohn, the Finnish writer best known in the US for her brilliant short novel Tainaron: Mail From Another City. \"Some of these territories are repugnant or terrifying, some fascinating. These stories are entirely personal and for that very reason also universal.\"  Below, ten more writers discuss The Weird, including K.J. Bishop, Ramsey Campbell, Steve Duffy, Jeffrey Ford, Stephen Graham Jones, Garry Kilworth, Kathe Koja, Leena Krohn, Michael Shea, William Browning Spencer, and Gio Clairval. Each of them is a contributor to The Weird: a Compendium of Strange and Dark Stories edited by Ann VanderMeer and Jeff VanderMeer, which was released this month in the UK and will be released sometime in early 2012 in the US.  What is The Weird?  \"The Weird,\" write the VanderMeers in their Introduction to The Weird, \"acknowledges that our search for understanding about worlds beyond our own cannot always be found in science or religion and thus becomes an alternative path for exploration of the numinous.\"  Michael Moorcock in his \"Foreword: Weird Stories\" speaks of The Weird as \"unrationalized fiction, having much in common with surrealism or absurdism.\" China Mieville in his \"Afterweird: The efficacy of a Worm-eaten Dictionary\" speaks of texts that \"infect\" us and \"burrow\" inside us.  The Weird is less concerned with \"fixed tropes of the supernatural,\" the VanderMeers tell us, and is more concerned with strangeness and subversion, the visionary, \"visceral physicality\" and the never-ending search... for what?  And, now... what is The Weird?  Ramsey Campbell: The place only our imagination can take us — the place beyond the gaps reality doesn't fill.  Stephen Graham Jones: I think there's a first principle lending shape to the Weird, and that's the certainty that, when you peel back the surface of the world, what you find underneath is both exactly what your heart of hearts always suspected and the last thing you ever wanted to see. The weird is about facing reality. Or, it's a cautionary tale for those who would dare. And, yeah, it resembles horror fiction, it uses the tropes of science fiction and fantasy, it's often shaped like an adventure or a mystery, it can even touch on bizarro or have a splatterpunk moment or two, and it sometimes has to adopt innovative forms to even get itself told, but the weird's insistence that there's more here than there seems to be, and it's worse than you could have imagined, but in the most wonderful way, that creeping suspicion that infuses every page, that shadow that's even there somehow with all the lights on—because all the lights are on—that's specifically its own thing. When you recognize the weird, it's not a set of conventions or a list of traits or characteristics you're cueing into. The weird isn't a genre like that.  Garry Kilworth: The weird is a place and time, perhaps only a pocket, where something can become something else, something completely and wholly unexpected and against all the laws of logic and reason. A lady walking on a frosty morning might become someone different to each of those she meets and greets on the way, but in the ordinary world she remains a woman in form and speech. If, however, she becomes a fox and races across the winter fields filling the air with the hollow barking of a vixen, we are no longer in the world of the ordinary, but in the weird.  Steve Duffy: What is the Weird? It seems to me to be above all the product of uncertainty. In a world of absolute certainties, there would be no Weird, since there would by definition be no room for doubt or ambiguity. However, in the world we inhabit—our world of crumbling certainties, of anxiety and bewilderment—the Weird can mirror our common experience, give flesh to the vague shapes of daydreams and nightmares, in ways that the categorical, the absolute, simply cannot. On this uncertainty our imaginations thrive. As Robert Aickman, the late twentieth century's master of the Weird, wrote: \"So little is definite.\"  Jeffrey Ford: In fiction the Weird is more about the feeling elicited by a story than the idea of it. The feeling I speak of is a mix of dread and eternity, the absurd, the allegorical stripped of reason and unconcerned with \"Truth,\" synchronicity and mythology, and searing imagery. It has a unique life of its own, eternally eluding classification.  William Browning Spenser: I live in Austin, Texas, and whenever I see an SUV with a bumper sticker that reads Keep Austin Weird, I think, \"Too late.\" Weird is one of the first things to go when a city is inundated with Starbucks, Lexuses, and people whose fierce pursuit of self-actualization requires a generic vocabulary, banal beyond belief, a vapid \"we\" that would have made George Orwell's ears bleed.  K. J. Bishop: \"When I think of 'weird' I think of something unsettling. It might be downright frightening, but it doesn't have to be. I suppose I see it as a territory with many emotional borders. In the darker weird perhaps there's a threat to replace a tolerable view of the world with an intolerable one. The weird can be very funny, because we laugh at incongruities. But still, I think that even in the funniest and gentlest weird, death and dismay are often hanging around somewhere. Maybe the weird is the sense of being reminded that ordinary life floats along on a current of mystery with a gaping question mark at the end. Writing can conjure a sense of the weird turning into the sublime as some kind of realization dawns, or it can stick with the weird and dangle the threat that there's only strangeness, and nothing more, and that discomfort will always defeat and outlast comfort.\"  Gio Clairval: What is the Weird? If I ask my friend Mrs. Brown, who only reads historical novels and memoirs, \"What is 'the Weird'?\", she will probably say something like \"I think you're talking about a story that is weird, strange, bizarre.\" If Mrs. Brown is right, any novel or short story that has a strange subject, stages bizarre clothes, dialogue, characters and any absurd thing could be labeled as weird.  Mrs. Brown's all-comprehensive definition is so large it would include every story with elements of the fantastic and/or the supernatural. So, in general, many of the novels and short stories that are outside the mainstream category could be called weird. But this tag would imply that all fantasy, science fiction and horror is Weird, which strikes me as incorrect. Still, this fallacious definition would appear correct to all strictly mainstream or literary reader. So, maybe the Weird is what appears to be weird to the classic/orthodox/traditional Fantasy/Science Fiction/Horror reader.  William Browning Spenser: For years, when people asked me what I wrote, I would say, \"Weird stories,\" and they would look nonplussed as though I were being evasive or even rude, which wasn't my intention. I now believe it is impossible to describe weird to someone who doesn't already have an appetite for it. It's like trying to explain empathy to a cat or a Republican.  Michael Shea: The word is the past participle (originally spelled with a 'y') of the Old English weorthan which means to occur or happen. Thus its literal sense is \"what's come to pass\". When it's personified, of course, as in MacBeth, it applies to the agencies or seers of what comes to pass.  Garry Kilworth: The word \"weird\" has its roots in the Anglo-Saxon wyrd, 'to become'. However, common usage has turned its meaning into more than just a happening. It has become entwined with the frighteningly strange, the unexpected, the unacceptable. If the village blacksmith's son takes a shortcut home through the woods meets and hears two dead men, a hanged murderer and his victim arguing about the injustice of their violent deaths, as in my novel Winter's Knight, that is the Weird at work. In the ordinary world, such events do not happen, they cannot happen, so when they do happen the experience is terrifyingly weird. The youth knows he has entered into a pocket of place and time outside the real world and wants to get back to the expected and normal.  In the brilliant novel Jonathan Strange & Mr Norrell by Susanna Clarke, a work which is astonishing in its breadth and originality, magic is an accepted part of life. Strange and wonderful things occur, but I maintain we are not in the world of the Weird here because the protagonists expect such unusual things to happen. Compare that to Robert Holdstock's equally fine and original work, Mythago Wood, where the protagonists are shocked and bewildered to come across mythical creatures in what is supposed to be an ordinary woodland, albeit full of ancient trees, and then we are in that place of the Weird.  Gio Clairval: As all F/SF can't be \"Weird\" (or we wouldn't be having this conversation) I will try to find a more specific categorization. The first thing that comes to mind is that the Weird is not a sub-genre, it is an attribute that can be given to a story.  I would say that the Weird is a choice that voluntarily or involuntarily, with an iconoclastic intent, breaks the rules of \"orthodox\" tropes one can find in all speculative fiction. In this case, the weirdness of the story creates a rift between itself—the way in which the story tells itself, through form, sometimes, but mostly through association of contents—and the reader's system of beliefs/perceptions/symbols. In other words, the reality of the story conflicts with how the reader can readily view reality. This makes the concept of Weird highly subjective.  How can I tell that a story belongs to the Weird? What should I look for in a story to be able to affirm with certainty that it is a Weird tale? While one could argue that pigeonholing an artistic production with a definite tag amounts to reducing and limiting the piece, I could try anyway.  The real answer is that there is no ultimate, universal answer to this question.  Even though several stories are widely considered weird—by readers, reviewers, the authors themselves—the real perception of the strangeness is in the eye of the individual reader. How does the story disrupt this reader's system of beliefs, and what the reader believes normal or odd. It is all about our willingness to suspend our disbelief. Embracing the Weird means to take a step further and accept to turn off our left brain's resistance buffer, kick rules and tropes out of the window, and enjoy the oddness.  Garry Kilworth: A shapechanging by a shaman in front of his or her tribe may be terrifying to behold, but it is not weird because the audience is expecting it. Lady into fox in the English countryside is weird, because it should not happen, is not expected to happen, and leaves the witness wondering whether he or she has gone mad and is seeing things that are not there. The emotion, the feeling that something unacceptable is happening, also has to be present in the weird. A conjurer or stage magician produces many amazing scenes that leave us completely mystified, yet we do not feel we are witnessing the weird because we know that somewhere behind it all is chicanery and there is a logical explanation for what we are observing. So we must experience a chill, that trickle down the spine and the nape hairs rising, to find ourselves in the place of the weird, as well as being present at an unbelievable event.  Kathe Koja: The Weird is the face you've never seen before, with eyes you already know.  William Browning Spenser: Here's a question: are vampires weird? The answer is: no, but they used to be. Dracula by Bram Stoker is a great canonical weird novel, a towering achievement in creepiness. It was a bestseller in 1897, and why not? It's got everything: lovely pale young women in thrall to a monstrous creature (seductive and undead), castles and gloomy landscapes, religion—what's creepier than religion?—lunatics (in lunatic asylums), your own true love coming back from the grave, which might seem like a good thing but no, you've got to drive a stake through her heart, cut off her head, and stuff garlic in her mouth; heartbreak mixed with betrayal. There is a suffocating sense of erotic dread throughout Dracula, which, for all its strangeness, has the uncertain ring of truth. Weird tales, I've noticed, often do that: they blindside you with the truth.  And then Anne Rice comes along in 1976 with Interview with the Vampire, and the age of the glamorous, sulking romance vampire has arrived, and we have snarky vampires and chick-lit vampires and pouty-teen vampires and the strict formulas of romance fiction. Where's the weirdness? Soap operas have scrubbed it away.  The only interesting vampires I've encountered in a long time were those in China Miéville's novel, The Scar. But Mr. Miéville's novels (including his amazing debut, Perdido Street Station) are dark fever dreams, great lumbering mad things now imitated by many of his admirers who will, at some point, find the weirdness and murder it.  We have pop fictions like Pride and Prejudice and Zombies, a novel so bereft of genuine imagination that its title is merely a statement of its high concept. This has inspired other pastiches (i.e., thefts) and why hasn't someone transformed Emily Bronte's Heathcliff into a vampire or a werewolf? Yes, it's only a matter of time.  Garry Kilworth: For the Weird to be present there needs to be a connection with something ancient but undated and without an explanation. Once you pin the event to a time and place, or a known custom or religion, then you take \"the weird\" out of the equation. It might indeed be extraordinary, odd, bizarre and out of the ordinary, but that almost indefinable element, the weird, is not there. Once you have a reason for your astonishing experience, then the weird is not there. If a man walking along a street suddenly grows wings and becomes an angel in order to save a woman from being robbed, that is not the weird at work. That is some other agency which has a reason for the shapechange. If a man walking along a street suddenly grows wings and becomes a basilisk which then, allowing no rational explanation for its behavior, begins to turn passersby to stone with its stare: that is the weird at work.  William Browning Spenser: True Weird fiction isn't so much a genre as it is a personality disorder. I certainly don't specialize in Weird stories. I just can't seem to get shed of them. I think it is a matter of temperament. I have always felt that life is a near-death experience, and even as a child I had an unhappy awareness that the dead opossum on the side of the road was made of the same fleshy stuff I was. \"This is not good news!\" I told my peers, who were singularly unimpressed.  Michael Cisco: Weird literature has its doubts about reality, it feels its confidence in ordinary reality giving slightly. It may go about its business more or less normally, as near as it can recall what normal means, and its idea or feeling about reality is only flexed, or still straight but with a notch in it. Or it may confront absolute subsidence of that sense, or any point on the curve between reality with a few scratches on the lens and reality crushed into a million sequins. The adjustment may come about in supernatural ways or phantasmagorical ways; very often the weird is paired with horror, but the weird is more than weak horror. The weird puts its emphasis on eeriness; it's in the atmosphere. The weird is more like the weather, while horror is more like the news.  Horror always says, \"it's not me! it's not me!\" Horror recoils from its object, but sometimes this is a trick it plays on itself so as not to acknowledge its desire for that object, or connection to that object, which is what it really wants to deny. It doesn't want to live in the same world with something it found out about. Staring, desperate, it wants to go back to the way things were before it found out, but it's trapped in the aftermath of its discovery forever.  The weird is often full of horror, and the two really are so much alike that it wouldn't be fair to blame anyone for mistaking one for the other. The difference flickers, appearing and disappearing. When it's there, that one's weird desires come out. Unlike the sudden discovery that drives horror wild, there's a gradual realization. Unlike the horrified rejection of terrible news, there is an infatuation with the new world, and, if there is any sudden discovery after all, it's the realization that the familiar world was horrible all along, perhaps even more so. This prompts a longing to escape into an eerie other world that is frightening more because it is so completely new and strange than because it is threatening or monstrous. Where horror clings to what it was, the weird is at least tempted by the prospect of becoming something else, or by a transit through the utterly different. So horror and the weird are two different curves, one arcing back in a recoil, the other arcing out over the horizon.  William Browning Spenser: Weird knows its own. In 1993, my short story collection The Return of Count Electric & Other Stories came out, and Gardner Dozois reprinted a story from that collection in The Year's Best Science Fiction. The story was \"A Child's Christmas in Florida,\" and it didn't have a bit of science fiction in it. It was a story about an odd family's Christmas rituals, sort of weird Flannery O'Connor—is that redundant?—so why was it in a science fiction anthology? I think it was there because, traditionally, if someone wrote a really strange story in the age of pulp magazines, and that story was homeless by way of eccentricity, science fiction would take it in.  Jeffrey Ford: In the Weird, Aristotle's \"catharsis\" is often a mutation, giving rise to aberrations of Nature and human nature. The characters are floating, searching for a system in chaos. In other words, I haven't got the slightest idea how to define the Weird, except to say, I know it when I read it. For instance, The Other Side of the Mountain by Michel Bernanos. I read this first when I was in my very early teens. When I finished it, all I could think was, \"That's the weirdest thing I ever read.\" What actually happens is not hard to understand. The writing is rather simple and straight forward, but the feeling I took away could only be described as \"a recognition of eternity.\" I never forgot it. When I got older I searched for it again. And then one day I found a copy of it in a garage sale for a dime. Again I read it, and it was still every bit as haunting and more so. I'm sure it's one of the great novels of the 20th century, but it's difficult to pigeon hole. Horror, the fantastic, a surreal sea adventure, all blending in a vivid, threatening and sublime dream. You know, Weird.  William Browning Spenser: So, to sum this up...I just want to urge those of you who write not to be ashamed of writing weird stories. It's not your fault. The best way to write anything is to fail at not writing it.  People will say to me, \"Your last book was just too weird for me,\" and I won't apologize. They might say that they liked an earlier book, were crazy about it, but I've gone too far this time. They seem to suggest that with just a little restraint, a little less weirdness, I'd get my groove back and write something they would enjoy. I get it. I understand them. And I say, \"You're not my audience.\" That's the only worthy answer.  Stephen Graham Jones: [The weird] is a mode. It's a way of telling a story. It's a way of telling the world. It's what we've been doing since we were all sitting around campfires, too. How else to describe that otherworldly creature three valleys over? To even get close to a description, you have to first render the experience, so as to get your audience looking through the right kind of eyes, and then you have to walk them around this tree, that rock, until they see it slobbering over there in the dark, and know in a rush of regret and wonder that the world is so much stranger than they could have ever guessed. But a world being strange, being \"weird,\" that's just another way of saying that, within it, anything's possible. And that's pretty excellent, there. So, sure, the Weird is often bloody, is usually dark, doesn't always have those happy endings. But what the Weird's doing is wedging the door open for us. Allowing the rest in as well. If there's anything better than that, I don't know about it.   Who are The Weird?  K.J. Bishop is an Australian writer and artist. In 2004, her neo-Decadent fantasy novel The Etched City was nominated for a World Fantasy Award and she won the William L. Crawford Award, the Ditmar Award for Best Novel and the Ditmar Award for Best New Talent. Her work has appeared in several publications including Leviathan 4, Fantasy Magazine, and Subterranean.  Ramsey Campbell is an award-winning horror fiction author from Liverpool, England. In his stories, largely evoking working- or middle-class settings, Campbell manages to update the weird tale and, mentored by Lovecraft protégé August Derleth, apply his keen ability to evoke both subtle supernatural horror and portraits of modern life in England.  Michael Cisco is an American writer best known for his first novel, The Divinity Student, which was published by Ann VanderMeer's Buzzcity Press and won the International Horror Guild Award in 1999. Since then, Cisco has published The San Veneficio Canon, The Traitor, The Tyrant, The Narrator, and The Great Lover.  Steve Duffy is a contemporary British writer who has lived in Norfolk and London, but is currently living and working on the North Wales coast. He is a recipient of the International Horror Guild award for the story \"The Rag-and-Bone Men\" and has published two short story collections, Tragic Life Stories and The Moment of Panic.  Jeffrey Ford is an American writer whose fiction combines elements of traditional fantasy or magic realism with surrealism and horror. As a student at Binghamton University, he studied with the novelist John Gardner and he currently teaches at Brookdale Community College in New Jersey. His work has been nominated for and received many awards, including the World Fantasy Award, the International Horror Guild Award, the Edgar Allen Poe Award, the Hugo and the Nebula Award.  Stephen Graham Jones is an American writer who writes both stories and novels. His most recent books are It Came from Del Rio (2010) and The Ones That Got Away (2010). Jones has been a finalist for the Shirley Jackson Award and Black Quill Award, as well as a winner of the Texas Institute of Letters Award and a National Endowment for the Arts fellow in fiction. His short fiction has appeared in Cemetery Dance, Asimov's SF Magazine, Weird Tales, and multiple best-of-the-year compilations.  Garry Kilworth is a highly respected English writer who has published dozens of fantasy, science fiction, and historical novels since the 1970s. A World Fantasy Award winner, Kilworth has also won the Charles Whiting Award for Literature and written a number of books for children, including the Welkin Weasel series. Short story collections include Let's Go to Golgotha (1975), In the Country of Tattooed Men (1993), and Tales from a Fragrant Harbour (2010).  Kathe Koja is an American writer who first emerged as a novelist during the U.S. horror boom of the early 1990s. Kafkaesque, transgressive novels such as The Cipher (1991), Bad Brains (1992), Skin (1993), and Strange Angels (1994) established her as one of weird fiction's most innovative practitioners. Story collaborations with science fiction writer Barry Malzberg broadened her oeuvre, and as Koja moved into the realm of young adult novels her work continued to evade easy categorization. In 2010 her first historical novel, Under the Poppy, was published, with the sequel to follow in 2012.  Leena Krohn is one of the most respected Finnish writers of her generation. In her large body of work for adults and children, Krohn deals with issues related to the boundary between reality and illusion, artificial intelligence, and issues of morality and conscience. Her short novel Tainaron: Mail From Another City, was nominated for a World Fantasy Award and International Horror Guild Award in 2005  Michael Shea is an American writer of horror, dark fantasy, and science fiction who has won the World Fantasy Award several times. Shea's unique work includes novels like Nifft the Lean (1982) that are influenced by Jack Vance but stand on their own for the intensity of their imagery and grotesquery of their situations.  William Browning Spencer is an award-winning American writer living in Austin, Texas. His weird tales often contain an undercurrent of dark humor while novels like 1995's quirky Resume With Monsters and Zod Wallop seem both sui generis and cognizant of the history of strange fiction. In 2005, his short story \"Pep Talk\" was turned into a short film for Project Greenlight and premiered at the Santa Fe Film Festival in December 2006.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nWedging the Door Open: Discussing The Weird\nWhat is The Weird?\n\"The Weird speaks with over a hundred voices from more than a hundred years about alien territories of the human mind,\" said Leena Krohn, the Finnish writer best known in the US for her brilliant short novel Tainaron: Mail From Another City. \"Some of these territories are repugnant or terrifying, some fascinating. These stories are entirely personal and for that very reason also universal.\"\nBelow, ten more writers discuss The Weird, including K.J. Bishop, Ramsey Campbell, Steve Duffy, Jeffrey Ford, Stephen Graham Jones, Garry Kilworth, Kathe Koja, Leena Krohn, Michael Shea, William Browning Spencer, and Gio Clairval. Each of them is a contributor to The Weird: a Compendium of Strange and Dark Stories edited by Ann VanderMeer and Jeff VanderMeer, which was released this month in the UK and will be released sometime in early 2012 in the US.\nWhat is The Weird?\n\"The Weird,\" write the VanderMeers in their Introduction to The Weird, \"acknowledges that our search for understanding about worlds beyond our own cannot always be found in science or religion and thus becomes an alternative path for exploration of the numinous.\"\nMichael Moorcock in his \"Foreword: Weird Stories\" speaks of The Weird as \"unrationalized fiction, having much in common with surrealism or absurdism.\" China Mieville in his \"Afterweird: The efficacy of a Worm-eaten Dictionary\" speaks of texts that \"infect\" us and \"burrow\" inside us.\nThe Weird is less concerned with \"fixed tropes of the supernatural,\" the VanderMeers tell us, and is more concerned with strangeness and subversion, the visionary, \"visceral physicality\" and the never-ending search... for what?\nAnd, now... what is The Weird?\nRamsey Campbell: The place only our imagination can take us — the place beyond the gaps reality doesn't fill.\nStephen Graham Jones: I think there's a first principle lending shape to the Weird, and that's the certainty that, when you peel back the surface of the world, what you find underneath is both exactly what your heart of hearts always suspected and the last thing you ever wanted to see. The weird is about facing reality. Or, it's a cautionary tale for those who would dare. And, yeah, it resembles horror fiction, it uses the tropes of science fiction and fantasy, it's often shaped like an adventure or a mystery, it can even touch on bizarro or have a splatterpunk moment or two, and it sometimes has to adopt innovative forms to even get itself told, but the weird's insistence that there's more here than there seems to be, and it's worse than you could have imagined, but in the most wonderful way, that creeping suspicion that infuses every page, that shadow that's even there somehow with all the lights on—because all the lights are on—that's specifically its own thing. When you recognize the weird, it's not a set of conventions or a list of traits or characteristics you're cueing into. The weird isn't a genre like that.\nGarry Kilworth: The weird is a place and time, perhaps only a pocket, where something can become something else, something completely and wholly unexpected and against all the laws of logic and reason. A lady walking on a frosty morning might become someone different to each of those she meets and greets on the way, but in the ordinary world she remains a woman in form and speech. If, however, she becomes a fox and races across the winter fields filling the air with the hollow barking of a vixen, we are no longer in the world of the ordinary, but in the weird.\nSteve Duffy: What is the Weird? It seems to me to be above all the product of uncertainty. In a world of absolute certainties, there would be no Weird, since there would by definition be no room for doubt or ambiguity. However, in the world we inhabit—our world of crumbling certainties, of anxiety and bewilderment—the Weird can mirror our common experience, give flesh to the vague shapes of daydreams and nightmares, in ways that the categorical, the absolute, simply cannot. On this uncertainty our imaginations thrive. As Robert Aickman, the late twentieth century's master of the Weird, wrote: \"So little is definite.\"\nJeffrey Ford: In fiction the Weird is more about the feeling elicited by a story than the idea of it. The feeling I speak of is a mix of dread and eternity, the absurd, the allegorical stripped of reason and unconcerned with \"Truth,\" synchronicity and mythology, and searing imagery. It has a unique life of its own, eternally eluding classification.\nWilliam Browning Spenser: I live in Austin, Texas, and whenever I see an SUV with a bumper sticker that reads Keep Austin Weird, I think, \"Too late.\" Weird is one of the first things to go when a city is inundated with Starbucks, Lexuses, and people whose fierce pursuit of self-actualization requires a generic vocabulary, banal beyond belief, a vapid \"we\" that would have made George Orwell's ears bleed.\nK. J. Bishop: \"When I think of 'weird' I think of something unsettling. It might be downright frightening, but it doesn't have to be. I suppose I see it as a territory with many emotional borders. In the darker weird perhaps there's a threat to replace a tolerable view of the world with an intolerable one. The weird can be very funny, because we laugh at incongruities. But still, I think that even in the funniest and gentlest weird, death and dismay are often hanging around somewhere. Maybe the weird is the sense of being reminded that ordinary life floats along on a current of mystery with a gaping question mark at the end. Writing can conjure a sense of the weird turning into the sublime as some kind of realization dawns, or it can stick with the weird and dangle the threat that there's only strangeness, and nothing more, and that discomfort will always defeat and outlast comfort.\"\nGio Clairval: What is the Weird? If I ask my friend Mrs. Brown, who only reads historical novels and memoirs, \"What is 'the Weird'?\", she will probably say something like \"I think you're talking about a story that is weird, strange, bizarre.\" If Mrs. Brown is right, any novel or short story that has a strange subject, stages bizarre clothes, dialogue, characters and any absurd thing could be labeled as weird.\nMrs. Brown's all-comprehensive definition is so large it would include every story with elements of the fantastic and/or the supernatural. So, in general, many of the novels and short stories that are outside the mainstream category could be called weird. But this tag would imply that all fantasy, science fiction and horror is Weird, which strikes me as incorrect. Still, this fallacious definition would appear correct to all strictly mainstream or literary reader. So, maybe the Weird is what appears to be weird to the classic/orthodox/traditional Fantasy/Science Fiction/Horror reader.\nWilliam Browning Spenser: For years, when people asked me what I wrote, I would say, \"Weird stories,\" and they would look nonplussed as though I were being evasive or even rude, which wasn't my intention. I now believe it is impossible to describe weird to someone who doesn't already have an appetite for it. It's like trying to explain empathy to a cat or a Republican.\nMichael Shea: The word is the past participle (originally spelled with a 'y') of the Old English weorthan which means to occur or happen. Thus its literal sense is \"what's come to pass\". When it's personified, of course, as in MacBeth, it applies to the agencies or seers of what comes to pass.\nGarry Kilworth: The word \"weird\" has its roots in the Anglo-Saxon wyrd, 'to become'. However, common usage has turned its meaning into more than just a happening. It has become entwined with the frighteningly strange, the unexpected, the unacceptable. If the village blacksmith's son takes a shortcut home through the woods meets and hears two dead men, a hanged murderer and his victim arguing about the injustice of their violent deaths, as in my novel Winter's Knight, that is the Weird at work. In the ordinary world, such events do not happen, they cannot happen, so when they do happen the experience is terrifyingly weird. The youth knows he has entered into a pocket of place and time outside the real world and wants to get back to the expected and normal.\nIn the brilliant novel Jonathan Strange & Mr Norrell by Susanna Clarke, a work which is astonishing in its breadth and originality, magic is an accepted part of life. Strange and wonderful things occur, but I maintain we are not in the world of the Weird here because the protagonists expect such unusual things to happen. Compare that to Robert Holdstock's equally fine and original work, Mythago Wood, where the protagonists are shocked and bewildered to come across mythical creatures in what is supposed to be an ordinary woodland, albeit full of ancient trees, and then we are in that place of the Weird.\nGio Clairval: As all F/SF can't be \"Weird\" (or we wouldn't be having this conversation) I will try to find a more specific categorization. The first thing that comes to mind is that the Weird is not a sub-genre, it is an attribute that can be given to a story.\nI would say that the Weird is a choice that voluntarily or involuntarily, with an iconoclastic intent, breaks the rules of \"orthodox\" tropes one can find in all speculative fiction. In this case, the weirdness of the story creates a rift between itself—the way in which the story tells itself, through form, sometimes, but mostly through association of contents—and the reader's system of beliefs/perceptions/symbols. In other words, the reality of the story conflicts with how the reader can readily view reality. This makes the concept of Weird highly subjective.\nHow can I tell that a story belongs to the Weird? What should I look for in a story to be able to affirm with certainty that it is a Weird tale? While one could argue that pigeonholing an artistic production with a definite tag amounts to reducing and limiting the piece, I could try anyway.\nThe real answer is that there is no ultimate, universal answer to this question.\nEven though several stories are widely considered weird—by readers, reviewers, the authors themselves—the real perception of the strangeness is in the eye of the individual reader. How does the story disrupt this reader's system of beliefs, and what the reader believes normal or odd. It is all about our willingness to suspend our disbelief. Embracing the Weird means to take a step further and accept to turn off our left brain's resistance buffer, kick rules and tropes out of the window, and enjoy the oddness.\nGarry Kilworth: A shapechanging by a shaman in front of his or her tribe may be terrifying to behold, but it is not weird because the audience is expecting it. Lady into fox in the English countryside is weird, because it should not happen, is not expected to happen, and leaves the witness wondering whether he or she has gone mad and is seeing things that are not there. The emotion, the feeling that something unacceptable is happening, also has to be present in the weird. A conjurer or stage magician produces many amazing scenes that leave us completely mystified, yet we do not feel we are witnessing the weird because we know that somewhere behind it all is chicanery and there is a logical explanation for what we are observing. So we must experience a chill, that trickle down the spine and the nape hairs rising, to find ourselves in the place of the weird, as well as being present at an unbelievable event.\nKathe Koja: The Weird is the face you've never seen before, with eyes you already know.\nWilliam Browning Spenser: Here's a question: are vampires weird? The answer is: no, but they used to be. Dracula by Bram Stoker is a great canonical weird novel, a towering achievement in creepiness. It was a bestseller in 1897, and why not? It's got everything: lovely pale young women in thrall to a monstrous creature (seductive and undead), castles and gloomy landscapes, religion—what's creepier than religion?—lunatics (in lunatic asylums), your own true love coming back from the grave, which might seem like a good thing but no, you've got to drive a stake through her heart, cut off her head, and stuff garlic in her mouth; heartbreak mixed with betrayal. There is a suffocating sense of erotic dread throughout Dracula, which, for all its strangeness, has the uncertain ring of truth. Weird tales, I've noticed, often do that: they blindside you with the truth.\nAnd then Anne Rice comes along in 1976 with Interview with the Vampire, and the age of the glamorous, sulking romance vampire has arrived, and we have snarky vampires and chick-lit vampires and pouty-teen vampires and the strict formulas of romance fiction. Where's the weirdness? Soap operas have scrubbed it away.\nThe only interesting vampires I've encountered in a long time were those in China Miéville's novel, The Scar. But Mr. Miéville's novels (including his amazing debut, Perdido Street Station) are dark fever dreams, great lumbering mad things now imitated by many of his admirers who will, at some point, find the weirdness and murder it.\nWe have pop fictions like Pride and Prejudice and Zombies, a novel so bereft of genuine imagination that its title is merely a statement of its high concept. This has inspired other pastiches (i.e., thefts) and why hasn't someone transformed Emily Bronte's Heathcliff into a vampire or a werewolf? Yes, it's only a matter of time.\nGarry Kilworth: For the Weird to be present there needs to be a connection with something ancient but undated and without an explanation. Once you pin the event to a time and place, or a known custom or religion, then you take \"the weird\" out of the equation. It might indeed be extraordinary, odd, bizarre and out of the ordinary, but that almost indefinable element, the weird, is not there. Once you have a reason for your astonishing experience, then the weird is not there. If a man walking along a street suddenly grows wings and becomes an angel in order to save a woman from being robbed, that is not the weird at work. That is some other agency which has a reason for the shapechange. If a man walking along a street suddenly grows wings and becomes a basilisk which then, allowing no rational explanation for its behavior, begins to turn passersby to stone with its stare: that is the weird at work.\nWilliam Browning Spenser: True Weird fiction isn't so much a genre as it is a personality disorder. I certainly don't specialize in Weird stories. I just can't seem to get shed of them. I think it is a matter of temperament. I have always felt that life is a near-death experience, and even as a child I had an unhappy awareness that the dead opossum on the side of the road was made of the same fleshy stuff I was. \"This is not good news!\" I told my peers, who were singularly unimpressed.\nMichael Cisco: Weird literature has its doubts about reality, it feels its confidence in ordinary reality giving slightly. It may go about its business more or less normally, as near as it can recall what normal means, and its idea or feeling about reality is only flexed, or still straight but with a notch in it. Or it may confront absolute subsidence of that sense, or any point on the curve between reality with a few scratches on the lens and reality crushed into a million sequins. The adjustment may come about in supernatural ways or phantasmagorical ways; very often the weird is paired with horror, but the weird is more than weak horror. The weird puts its emphasis on eeriness; it's in the atmosphere. The weird is more like the weather, while horror is more like the news.\nHorror always says, \"it's not me! it's not me!\" Horror recoils from its object, but sometimes this is a trick it plays on itself so as not to acknowledge its desire for that object, or connection to that object, which is what it really wants to deny. It doesn't want to live in the same world with something it found out about. Staring, desperate, it wants to go back to the way things were before it found out, but it's trapped in the aftermath of its discovery forever.\nThe weird is often full of horror, and the two really are so much alike that it wouldn't be fair to blame anyone for mistaking one for the other. The difference flickers, appearing and disappearing. When it's there, that one's weird desires come out. Unlike the sudden discovery that drives horror wild, there's a gradual realization. Unlike the horrified rejection of terrible news, there is an infatuation with the new world, and, if there is any sudden discovery after all, it's the realization that the familiar world was horrible all along, perhaps even more so. This prompts a longing to escape into an eerie other world that is frightening more because it is so completely new and strange than because it is threatening or monstrous. Where horror clings to what it was, the weird is at least tempted by the prospect of becoming something else, or by a transit through the utterly different. So horror and the weird are two different curves, one arcing back in a recoil, the other arcing out over the horizon.\nWilliam Browning Spenser: Weird knows its own. In 1993, my short story collection The Return of Count Electric & Other Stories came out, and Gardner Dozois reprinted a story from that collection in The Year's Best Science Fiction. The story was \"A Child's Christmas in Florida,\" and it didn't have a bit of science fiction in it. It was a story about an odd family's Christmas rituals, sort of weird Flannery O'Connor—is that redundant?—so why was it in a science fiction anthology? I think it was there because, traditionally, if someone wrote a really strange story in the age of pulp magazines, and that story was homeless by way of eccentricity, science fiction would take it in.\nJeffrey Ford: In the Weird, Aristotle's \"catharsis\" is often a mutation, giving rise to aberrations of Nature and human nature. The characters are floating, searching for a system in chaos. In other words, I haven't got the slightest idea how to define the Weird, except to say, I know it when I read it. For instance, The Other Side of the Mountain by Michel Bernanos. I read this first when I was in my very early teens. When I finished it, all I could think was, \"That's the weirdest thing I ever read.\" What actually happens is not hard to understand. The writing is rather simple and straight forward, but the feeling I took away could only be described as \"a recognition of eternity.\" I never forgot it. When I got older I searched for it again. And then one day I found a copy of it in a garage sale for a dime. Again I read it, and it was still every bit as haunting and more so. I'm sure it's one of the great novels of the 20th century, but it's difficult to pigeon hole. Horror, the fantastic, a surreal sea adventure, all blending in a vivid, threatening and sublime dream. You know, Weird.\nWilliam Browning Spenser: So, to sum this up...I just want to urge those of you who write not to be ashamed of writing weird stories. It's not your fault. The best way to write anything is to fail at not writing it.\nPeople will say to me, \"Your last book was just too weird for me,\" and I won't apologize. They might say that they liked an earlier book, were crazy about it, but I've gone too far this time. They seem to suggest that with just a little restraint, a little less weirdness, I'd get my groove back and write something they would enjoy. I get it. I understand them. And I say, \"You're not my audience.\" That's the only worthy answer.\nStephen Graham Jones: [The weird] is a mode. It's a way of telling a story. It's a way of telling the world. It's what we've been doing since we were all sitting around campfires, too. How else to describe that otherworldly creature three valleys over? To even get close to a description, you have to first render the experience, so as to get your audience looking through the right kind of eyes, and then you have to walk them around this tree, that rock, until they see it slobbering over there in the dark, and know in a rush of regret and wonder that the world is so much stranger than they could have ever guessed. But a world being strange, being \"weird,\" that's just another way of saying that, within it, anything's possible. And that's pretty excellent, there. So, sure, the Weird is often bloody, is usually dark, doesn't always have those happy endings. But what the Weird's doing is wedging the door open for us. Allowing the rest in as well. If there's anything better than that, I don't know about it.\nWho are The Weird?\nK.J. Bishop is an Australian writer and artist. In 2004, her neo-Decadent fantasy novel The Etched City was nominated for a World Fantasy Award and she won the William L. Crawford Award, the Ditmar Award for Best Novel and the Ditmar Award for Best New Talent. Her work has appeared in several publications including Leviathan 4, Fantasy Magazine, and Subterranean.\nRamsey Campbell is an award-winning horror fiction author from Liverpool, England. In his stories, largely evoking working- or middle-class settings, Campbell manages to update the weird tale and, mentored by Lovecraft protégé August Derleth, apply his keen ability to evoke both subtle supernatural horror and portraits of modern life in England.\nMichael Cisco is an American writer best known for his first novel, The Divinity Student, which was published by Ann VanderMeer's Buzzcity Press and won the International Horror Guild Award in 1999. Since then, Cisco has published The San Veneficio Canon, The Traitor, The Tyrant, The Narrator, and The Great Lover.\nSteve Duffy is a contemporary British writer who has lived in Norfolk and London, but is currently living and working on the North Wales coast. He is a recipient of the International Horror Guild award for the story \"The Rag-and-Bone Men\" and has published two short story collections, Tragic Life Stories and The Moment of Panic.\nJeffrey Ford is an American writer whose fiction combines elements of traditional fantasy or magic realism with surrealism and horror. As a student at Binghamton University, he studied with the novelist John Gardner and he currently teaches at Brookdale Community College in New Jersey. His work has been nominated for and received many awards, including the World Fantasy Award, the International Horror Guild Award, the Edgar Allen Poe Award, the Hugo and the Nebula Award.\nStephen Graham Jones is an American writer who writes both stories and novels. His most recent books are It Came from Del Rio (2010) and The Ones That Got Away (2010). Jones has been a finalist for the Shirley Jackson Award and Black Quill Award, as well as a winner of the Texas Institute of Letters Award and a National Endowment for the Arts fellow in fiction. His short fiction has appeared in Cemetery Dance, Asimov's SF Magazine, Weird Tales, and multiple best-of-the-year compilations.\nGarry Kilworth is a highly respected English writer who has published dozens of fantasy, science fiction, and historical novels since the 1970s. A World Fantasy Award winner, Kilworth has also won the Charles Whiting Award for Literature and written a number of books for children, including the Welkin Weasel series. Short story collections include Let's Go to Golgotha (1975), In the Country of Tattooed Men (1993), and Tales from a Fragrant Harbour (2010).\nKathe Koja is an American writer who first emerged as a novelist during the U.S. horror boom of the early 1990s. Kafkaesque, transgressive novels such as The Cipher (1991), Bad Brains (1992), Skin (1993), and Strange Angels (1994) established her as one of weird fiction's most innovative practitioners. Story collaborations with science fiction writer Barry Malzberg broadened her oeuvre, and as Koja moved into the realm of young adult novels her work continued to evade easy categorization. In 2010 her first historical novel, Under the Poppy, was published, with the sequel to follow in 2012.\nLeena Krohn is one of the most respected Finnish writers of her generation. In her large body of work for adults and children, Krohn deals with issues related to the boundary between reality and illusion, artificial intelligence, and issues of morality and conscience. Her short novel Tainaron: Mail From Another City, was nominated for a World Fantasy Award and International Horror Guild Award in 2005\nMichael Shea is an American writer of horror, dark fantasy, and science fiction who has won the World Fantasy Award several times. Shea's unique work includes novels like Nifft the Lean (1982) that are influenced by Jack Vance but stand on their own for the intensity of their imagery and grotesquery of their situations.\nWilliam Browning Spencer is an award-winning American writer living in Austin, Texas. His weird tales often contain an undercurrent of dark humor while novels like 1995's quirky Resume With Monsters and Zod Wallop seem both sui generis and cognizant of the history of strange fiction. In 2005, his short story \"Pep Talk\" was turned into a short film for Project Greenlight and premiered at the Santa Fe Film Festival in December 2006.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/weird_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Wedging the Door Open: Discussing The Weird by Jeremy L. C. Jones"}