{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Eliane Boey", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "GiiDyk0dIZy5yXqu1YFzDWT1okk=", "id": null, "license": null, "comments": "", "raw_text": "5460 words, short story  The Forgotten  It was the cockroach from the crack in the bathroom wall, tapping a defiant dance on my haptic suit, that made me pull up Sociable, to post a comment to my Constituency Administrator. I’d killed the damned thing yesterday, watched it kick its hairy legs in the air. Yet somehow, life asserts itself, and accepts all the conditions. As I shook it off my suit, I saw the number under the Admin’s name. Five million. That’s the number of users who support her every decision and utterance. I expanded the list and stopped at a name I knew, Axl Zhuang. By the looks of it, Zhuang wasn’t a passive loyalist. In the last month alone, he’d upvoted three of her new rules, joined a group, and posted positive comments. Only, Zhuang died in the outbreak ten years ago, when I was low enough on the Administration hierarchy to volunteer for processing at a triage center.  A single Admin, of the one hundred and twenty who govern thirteen million citizen-users each packed like roaches into the cracks of a territory half the size of old Hong Kong, cannot possibly have five million loyalists. For one, the dead can’t vote, not even in Lion City.  The yawning jaw of the tunnel ends in a sheer cliff over the pit of fire. In Avici, the air is so hot it expands in your throat and scalds your lungs. Blink, and your eyes feel raw. My face is set in a thin scowl, which helps my purpose, but really comes from economy of movement, when every exertion is like wading in iron slurry. My subject keeps his head down and his lips shut, in Sisyphean acceptance. This time, I’ll break him.  “You call it loyalty, but you’re the one who’s locked out, while your boss is in Lion City, pushing a dangerous amount of brainpower on the streets.”  A wave of heat like a manic dragon nearly pushes me off the cliff and into the blazing crevasse. Beside me, the daemon with long black hair, shirtless in his blue skin and loin cloth, waits slack-faced with folded arms. You have to admire Wei’s sick commitment to accuracy.  The subject groans in the heat. “Not on the streets. It’s just one whale buying it all.”  I hold the chip to his face. “Who’s farming and selling the firmware?”  I could drop the sensitivity on my suit and feel a warm breeze or nothing at all. But a while ago, I decided I wanted skin in. I don’t want to lose the parts of myself that can still feel.  “Choke on your joystick, Maggie.” He gives me the finger.  I grip my knees and sigh behind clenched teeth. Truth is, I ran out of things to say ten cycles ago. And I regret telling this runner my name, even if it isn’t what they call me outside Lion City. I’m trying to cook up something new and more intense, like how the only things you can know to be real are the lies you tell, when the blue light flashes top-right of my vision. A discreet stream of text appears below it. Then, I feel a nudge through my suit. Polite, but none too subtle. Something has to be up for Choy to use the bat signal. I hate being nudged when I’m working. I stand back and motion to the daemon, and it steps forward.  The subject spits. “You’re an errand boy, sent by grocery clerks, to collect a bill.”  Was I really so bored the last time I was here, I started talking film and books, to this goon?  In spite of myself, I smile. “At least I know what I belong to.”  I don’t want to hear his reply. When the daemon throws him into the infernal pit, he’ll land on a round platform, a few feet above the fire. The platform is small, and with each new addition, some will fall into the inferno. On the platform, you’re close enough to feel the water in your body vaporize, and far enough to do whatever you can not to fall in. It doesn’t matter that you’ve fallen in, been fished out, and fallen in, over and over again.  Nobody wants to die, even if it isn’t real. I tap my optical and log out of the module.  Hot rock softened into plush wall-to-wall navy-blue carpeting. It’s 2040, but the Administration maintains their virtual meeting rooms in exact replica of their offices in the Outside, when they existed, at least ten years ago. Wei sits behind her empty black steel desk. When my avatar, Maggie, materialized behind the door, the skin around Wei’s eyes tightened, prepared for conflict. I strode up to her.  “You’re not getting your updates any sooner, porting me out in the middle of a cycle.”  Wei bridged her fingers. “It isn’t bootleg firmware that keeps me up at night.”  Even a luddite like me who only understands spoken languages knows that much disposable brainpower available to the highest bidder on the black-market spells trouble. I let her enjoy the sound of her voice as I slid a finger on the top of the black leather seat across from her. Then I held its corner and spun it.  “Undercover” adds an air of old-world mystery to the dirty work that I do. The upside is that Maggie doesn’t resemble me. She looks like Maggie Q in the Nikita years, tanned in the Southeast Asian sun. Wei, however, as an active Monitor, equivalent in access to a Junior Administrator, has to maintain an avatar of the same name and physical appearance as her real self. With the luxury of perfectly waved silver hair and airbrushing around the sides of her mouth. She looks something like Carina Lau and smiles even less.  We are women on the wrong side of fifty, and that’s being delicate. Our peers have all tapped out, either retired while it still made sense or pushed out for things they said or didn’t. Wei is still here because she built Avici and handling me is now her only connection to it. I am still here because fetching for Wei is my only connection to what I really am.  Wei spoke. “Someone is sniffing around the Administration’s loyalist count. They’re running random tests on user profiles, for verification.”  Five years ago, the Administration dropped the term “follower” in favor of “loyalist,” to denote a citizen-user’s open and absolute endorsement of its Administrators, their acts, and omissions, in return for free housing in the Outside, and unlimited high-speed access to Lion City. Along with free upgrades to the latest immersion tech. In theory, it’s like a rolling subscription to the biggest predictive entertainment pack you can imagine. In practice, you can’t opt out. Some try to make their own way, paying for housing and digital access in hourly wages from the last remaining in-person service jobs, but they’re a shrinking minority.  “I’ll run search history scans, and analyze check-ins of the usual suspects,” I said.  “I don’t give a damn about locking out runners. I want to know why they’re doing it. Dissidents have protested, sabotaged the network, and tried to erase themselves. But they never tried to look under our hood before. Something’s different, Xi. The Renewal is next month, and we don’t need any surprises.”  Her coolness as she said my name, a reminder of our lives in the Outside, made my skin peel off my bones. Something had to be different, when the open tab in everyone’s minds for months suddenly wasn’t a problem anymore. Only, I wasn’t certain we’re looking at the same problem. The Renewal cycle replaces elections of old. Loyalists’ votes are automatically cast for them each cycle, renewing the operating license of their zone Administrator. A large part of Wei’s Security directive is to safeguard this process. When I was in Ethics, my directive would’ve required me to dig deep into the questions that were making Wei squirm. Where this all falls apart is, that I now report to Wei.  The chair was still spinning when I logged out of her office.  When overcrowding and scarcity of resources in the face of cyclical epidemic waves became too much, even for a single-state territory, the Administration demanded solutions to rising crime rates. They turned to Wei, who could build worlds you hadn’t even dreamed of.  Avici is the name of the eighteenth level of Buddhist Hell, where there is no redemption or reincarnation. Wei omitted what religious symbolism she could in its creation, so it’s really a hot, overcrowded pit you can’t hit restart and log out of. Not too different in some ways from the Outside. She put her good years into Avici, and when it was done, the Administration escalated her three access levels to Monitor, far from the back end of Lion City.  Virtual time is zero-cost. In nearly all cases, Avici is more like a holding cell than an actual prison. Most people crack sooner rather than later and spill the beans or accept restrictions or monitored access, just to log back in. With rapid urban degeneration, those who can afford to have long moved away, to less dense and richer territories, abandoning this one to the poor. Lion City offered shelter and dulled their senses with nostalgia. Over the years, rants and manifestos have appeared in threads on fringe group forums, calling for its defunding—even permanent unplugging—and for the budget to be channeled into revitalizing the real territory to make it livable again. But the truth is, Lion City is the last place that most can still live decently, even if they need a haptic suit to experience it. That and copying and pasting code for a new estate with leisure grounds costs next to nothing.  Avici, and Lion City for what it’s worth, are Wei’s pride and obsession, yet lately I get the feeling that at this level, it’s just a distraction. Moving background draped over a secret door. What’s behind the door? A bonus stage, or the real, final boss?  The sky is a glow of apricot, which cools to a near-neon pink and loses its way in the wisps of white clouds, before touching the first stars of an indigo sky. It’s always dusk in Lion City, and you can see slices of the sky between the humble low-rise buildings, at the perfect changing of the guard between day and night. The air is cooled to a mild twenty-five degrees Celsius, which hasn’t naturally returned to this hemisphere in years. The public housing estate I’m in was demolished in 2005, when Wei and I were fresh Administration trainees. I’ve been here, and I remember barbecued stingray and an oyster omelet with my parents, at the tables in the open, by the hawker center. In the Outside, the plot that supported the hawker center alone is now a work-life complex with cells housing twenty thousand users.  The amount of detail in the rendering of the estate is astounding. As a Monitor, I have the latest haptic suit, gloves, mask, and opticals that aren’t readily available to citizen-users. But even a user with a three-year-old kit would be able to feel the grains of sand from the playground between their fingers and see the legs on the red ants marching in a line up a tree. The sounds are accurate too. The hiss of the air brakes in the red and white buses, and the chime of the primary school bell. Groups of avatars sit at the hawker center, with sugarcane juice, to watch children play on the climbing frame. Virtual occupation limits are in place, to maintain the true feel of a small public estate of the noughties. The Administration has taken great care to ensure that experiencing the estate, and others like it in Lion City, is as good as living in it in the Outside, or better.  Today, I’m not here to sightsee. Something tells me the firmware racket, which does brisk business farming and peddling contraband plug and play AI code on the black market, has something to do with the non-user-controlled loyalist. So, I’m looking up Axl Zhuang at his registered Lion City address. It’s possible I was mistaken, and either he didn’t die in the plague ward, or I recalled the wrong name. I want to be mistaken.  Inside, the flat looks like how I might have remembered my Popo’s home, if she hadn’t died when I was nine. The front gate was unlocked, so I let myself in. This historic three-bedroom flat would house four families or core units today. There are things in the flat that I intuitively know to belong, even if I have no memories of them. Like the wooden sideboard painted avocado green, with panels of textured glass. The beige hot water flask with five upturned glasses on an enamel dish painted with roses. The page-a-day horse racing calendar sponsored by Union Gas, in bold red lettering on wafer-thin paper, torn to 27th May 1984. It’s a little further back than the nostalgic sweet spot of the median user age, but it makes sense if it’s designed to invoke a late afternoon at your grandmother’s flat, minutes before dinner.  Except, there is no Popo calling you to dinner, nor sounds of cooking from behind the cloth curtains over the doorway to the kitchen. That’s unusual, given the needle-carved level of detail in the inanimate objects. The living room has the eerie absent presence of desertion. Where are the NPC grandchildren waiting to be fed? Where are the cooking smells? Eyes sweeping the room, my heart jumps when I notice the back of a spiky-haired man at a far corner of the room, in a swivel chair at a control screen near the window. He’s been sitting there all along, in silence. The screen he’s using is from years ago, the sort the elderly hang on to, claiming the lower resolution and image speed gives them fewer headaches.  “Mr. Zhuang?” I approach with caution. “I’m from the Community Befrienders group about a new initiative. I hope you don’t mind I let myself in.”  The avatar doesn’t not move or acknowledge my presence in any way. I’m near enough now, to see that his fingers are typing, so I know he is at least functional. I suddenly find myself wishing I brought more than balls with me. I place a hand on my hip and hope he’ll make his assumptions and not do anything stupid. Then, I grab his chair and spin it around.  Where his face should be is an unresponsive mass of gray pixels.  I graduated from the last philosophy cohort before the National University closed its arts department for good. Lucky for me, the newly restructured Administration was handing out jobs to warm bodies. Wei found her home in systems design, while I tried to stay busy at the charmingly hopeful department of Virtual Ethics and Algorithmic Transparency.  Things got murky when the Administration declared a war on virtual identity fraud. That was about the same time that artificial intelligence became fully regulated, with defined capability types and maximum intelligence in each band, pegged to a fixed weightage of current median human intelligence. Virtual identity misrepresentation becomes fraud when a user wrongfully gains from the appearance of their avatar, relative to their actual appearance and identity in the Outside. In effect, it’s legal to exist in Lion City with a unicorn’s or a fish’s head on your shoulders. But if you want to teach mathematics at virtual school, you can’t do it looking like a middle-aged male with a receding hairline, if you’re a young woman with green hair who’s a hairdresser in the Outside. Even if you knew the math. I’m keeping it simple, but if you can see at least five ways this is problematic, you’re on the right track.  An initial citizen-user “feedback” hotline had lukewarm success. Old-fashioned ratting on your neighbors requires knowing who they are. Yet with each year, fewer people lived active lives in the Outside, where their bodies sat in sanitized cells and were delivered the essentials of corporeal life. No one stayed logged out long enough to connect goings on in Lion City to real-life users. What the Administration needed was a Superuser, who would move between the promise and plenty of Lion City, the bleak emptiness of the Outside, and the looping madness of Avici, and put all the crumbs together to remake the loaf.  First, my file as a low-ranking Administration officer was deleted, then, a new profile was created for me, in Security. With the rank of Monitor, to allow for autonomous transmutability across modules. Wei, as my handler, is the only one with access to my file. Some days, I get the feeling she isn’t just playing along with the cover story that I was discharged in disgrace. Even as she uses my information for the cancellations and lockouts that the Administration deems necessary for collective security. Perhaps I move between zones and states because I am nothing.  Before the number-pad tone and airy whistle of dial-up Internet shot into our lives, and the neighborhood’s first Compaq Deskpro appeared in Wei’s parents’ flat, we spent hours at the VHS rental store. Wei and I picked videos and absorbed 1970s to then-current 1990s American pop culture with a determined hunger, like it was supposed to mean something. Wuxia and Hong Kong cop and gangster films were great. But what our parents understood—and often related to better than we did—had less appeal than American films, with the promise of a secret language and code of behavior, and as a portal to other worlds.  One thing you learn is that there are many crime flicks with buddy stories worked into them. Mostly between men, who limp bloodied to the end credits with renewed understanding that nothing beats being mates. Not for all the gold, guns, girls, and power in the world. Mostly. The only female crime-buddy story from that period that I can think of is Thelma & Louise. But Thelma and Louise had to die. The point I’m trying to make is, we learned that two women who each want something is two too many.  I cross-checked a few more names on my Constituency Administrator’s loyalist list against hospital records of organ donations, and it wasn’t long before I found another zombie avatar. One T. K. Soh, deceased 2030.  Whom I’m deleting from the system. Her avatar resided in a replica of an estate built in the 1920s, which predates even the Territory’s independence. The real plot now hosts a data center. Her flat is window-dressed in the same heritage memorabilia. The painted sideboard, the flask, and glasses, down to the Union Gas horse racing calendar torn to 27th May 1984.  Nothing in Lion City appears the ways it does by chance because none of it is real. Every perfectly captured memory first has to be selected by someone. The date has to mean something. So too should the seeming emptiness of the large flat. That’s when I realize, I’m not asking the right questions. Forcing the runner to name his faceless boss and hunting more runners to throw into Avici, or undead avatars to delete, isn’t going to throw any useful clues. The real question is why might a single buyer need that much high-capability brainpower at all, and how they’ve been using it without detection.  Why am I so worked up over this? To the average user, the reanimated avatar of a dead user will have the same appearance and engagement interest as an NPC—okay, arguably less, with the boxy gray face. Yet Zhuang and Soh did more than just fill seats in a stadium. Social limitations aside, they functioned as citizen-users, but with programable political interests. It’s long been illegal for a user to control more than one avatar, and capability regulations prevented powerful interests from creating voting drones. Until now. The beauty in reanimating dead avatars is that you don’t need to create them and trip alarms in the process. Plus, they already have histories, you just need to erase the final entry that logs their death and pray no one remembers them or looks too hard at insurance archives.  Add the intelligence firmware to the equation and the possibilities are chillingly limitless.  I’m chewing on the date in my mind as I run my hand on the rough concrete wall. In the hallway, I push a Formica-coated pastel pink door. My mum might have had a room like this, with a little pink wooden bed. I blink, and my mind travels to the flat where I found Zhuang’s reanimated avatar. I never thought to search inside the dwelling. Now that my hand is on the door, my throat tightens. There will be no unseeing whatever I encounter in there.  I push on the door. Within the room are rows and columns of school desks, each with an outdated screen and holo-keyboard that’s at least three years old. Behind every screen are blank, gray pixel faces above mechanically moving hands. None of them look up, but I still don’t know the full extent of their capabilities. I don’t know what else they can do.  True fear doesn’t show itself in a scream, or a manic dash for the exit. It presents itself as denial. Like the cockroach kicking its legs while half of its body is crushed matter on my bathroom floor, fear takes its first breath as disbelief. This cannot be true. But it is.  Wei was born in 1984. And on 27th May in that year, Time Pilot ’84 was released.  I’m sixteen years old and Wei is thirteen. Life in the Outside is still the only life we know, and it’s years before the first string of code for Lion City will be typed. We’re racing to the back gate of our secondary school, to scale the fence and disappear, before Ms. Solastri, who is both Head of Discipline and our advanced mathematics teacher, learns we skipped class to play at the arcades. I feel the heat of my muscles and the sweat on my face. A lithe Wei clears the fence. I reach up to her. She lands on her feet on the other side, puts a finger to her lips, and runs away. Jun-Xi, says Solastri when she catches me, you should know better than to mislead Kin-Wei.  Wei was advanced three years in secondary school, and not a day went by that I wasn’t thought of as a bad influence on her. Even our names defined us; Wei for greatness, Xi for happiness. Not that I ever achieved it. It was Wei who wanted one more go at Time Pilot before the comic book shop—which made its rent selling pirated textbooks printed on a Xerox machine—replaced the older games with new claw machines stuffed with bug-eyed plush baby animals, to appease the unsettled parents of the neighborhood. I keep my head down in silence like the other times and accept my punishment of standing two hours in the basketball court while the other kids enjoy a free period before swimming.  To say it’s a hot day is an understatement. Just moving my head hurts the skin on the back of my neck. An hour in, Wei crosses the court with a bottle of water for me on her way to the community center pool with the other kids in our class.  I snatch the bottle. “You could at least admit it was your idea too.”  Wei smiles. “What good would it do, both of us being in Solastri’s bad books?”  The trains screech and grind steel teeth on the weathered rails, pulling to a halt with a sigh of exhaust that smells of bad eggs and a funk like old mushrooms. Their arrival raises a cloud of dust from the tracks, and I turn away. When I look again, the tracks are gone. Torn off the ground nearly thirty years ago and taken for scrap along with the diesel-powered trains to make the best of soaring ferrous prices. When we were university freshmen, not caring if our degrees would be relevant when we graduated, Wei and I shared an overnight sleeper and chugged all the way north, up the continent. Not all the memories I have of us are bad.  I can visit the replica of this station as it was in 2001. Like all the lost or decayed landmarks, it’s rendered in perfect detail in Lion City, down to the vibrant graffiti, the fragrance of the best biryani I ever had coming from the canteen, and the unregulated burger stand that also sells cigarettes by the stick if you ask. Instead, I’ve come to the real site. Gray and black towers of work-life complexes and public estates cast shadows over the gutted station, built at the turn of the twentieth century. Few streetlights are maintained, because hardly anyone ventures out at night. After the trains were scrapped, the station had a brief life as a luxury food court and open-air cinema. Later, the homeless moved in. The Administrators were about to tear it down and rebuild on the plot when it occurred to them that the off-griders were an easy target this way, should the need arise. And so, the station stands.  The person I want is in front of their tent on the platform, sheltered by a wall that once supported the first-class waiting lounge. I approach, reaching in my inventory to pull out what I’ve come to have their eye on. In an instant, they flinch. I raise my hands and wave an old tablet I bought at an antiques store years ago. In the shadows behind them, other figures slink away, preferring the darkness. I had the tablet scrubbed and rebooted for my mum, and I kept it after she died. Now, it’s the only device I own that isn’t Administration-issued.  I hand them the tablet with the firmware chip. Old-fashioned chips are among the last untraceable media. Still, everything constructed has a story to tell. Before long, I’m looking over the off-grid drifter’s shoulder at the name of the private server where the code originated. It can’t be a user’s real name or even their avatar’s name. But no god can resist leaving their mark, and this god is Yama. Yama has numerous names and roles across at least two cultures and religions. But most significant of all, Yama is the Ruler and Arbiter of Hell.  Whoever wrote this thinks there is nothing above—or below—them. Nothing holds them at all, because they have not only kicked free of human expectations but kicked it to pieces. I know who they are.  I have only once seen Wei lose her cool. Three years ago, a dissident group successfully disseminated worms that multiplied through media shares on Sociable. The worms targeted haptic feedback and sensitivity connections, degrading a user’s experience to what it was at the birth of virtual reality. Frustrated, people removed their suits, gloves, and opticals. For one surreal month, Wei, backed by a blank check from the Administration, did whatever was necessary to track the saboteurs down, people lived in the Outside again.  We found the group locked-down in a disused warehouse along what used to be the major river, before it was drained. My tip from a subject in Avici had paid off, and I made myself scarce while the Security team requisitioned equipment and rounded them up. I can’t be seen if I don’t exist. When I returned, the place was ablaze.  “What the actual fuck?”  “I couldn’t stand to see it,” Wei said, her face aglow. “How dare they try to shut down what we built, for them? We built a place that will always be a good home. Why can’t they see that?”  “Guess it’s not so obvious to them as it is for you,” I said. I was looking at a lot of explaining to do about contaminated evidence. “Some days, it isn’t that straight to me either.”  She ran after me. I allowed myself two seconds to enjoy the feeling of being pursued by her, before I shut down the need and kept walking.  Wei shouted at my back. “You’re spending so much time with the roaches; you’ve started to sound like them.”  “What’re we doing here, Xi?” Wei asks.  The fire door shuts behind her, and the sound of it is softer than I expected. In a twisted way, the real world appears low-res in comparison to Lion City and Avici. We’re on the roof of the Administration HQ. The real building, in the Outside, is mostly empty save for the lowest grunts who can’t afford to work remotely, even from within the territory. Wei points at me and smiles at the corner of her mouth. I can’t stop myself lifting a hand to feel my soft jaw and the brittle skin of my neck.  “You should get more sleep, you look like death.”  “Oh, I plan on catching up, as soon as we finish here. I’m done after this,” I say. Even my voice sounds tired. I sound like an old woman. I am not Maggie Q. I am an old woman.  A discarded surgical mask catches on my calf. I shake it off and watch it drift. It doesn’t lose the wind and fall seventy floors to the empty roads below. It floats higher.  Wei’s hands are on her hips. She says, “You’re not done until I am.”  The clouds break, and she squints in the glare of the burning sun. Lucky for me, I’ve spent a lot of time down in Avici with my suit on full sensitivity.  “Do you remember what you said, when you left me to take the hit from Solastri, just like the other times? You said, ‘What good would it do, both of us being in her bad books?’ I gave you the benefit of the doubt, that you meant both of us. But you meant, yourself, didn’t you? All this time . . . what good would I be to you?”  Wei shakes her head and touches the curl of hair by her ear. Her hair is almost as perfect in real life as it is virtually. “Say whatever you have to say now, Xi. Because I guarantee that no one will believe you when you tell them.”  “No, I want to know for me, now. Is this the good you think you’re doing? Is Lion City, or the Territory, a better place when the avatars of dead users can be scrubbed, flashed, reanimated, and put to work for anyone with something to sell?”  The fire door opens, and four large Security personnel join us on the roof, with Choy, the analyst who keeps an eye on Administration movements for me, off the record. I must have been the only boss who was decent to them when they were an intern.  “People have been living dead for years. If we don’t entrench the Administration’s hold, dissidents will keep trying to shut down Lion City, and one day, they will.” Wei takes a step toward me. “This doesn’t end with me. Taking me down is only going to hurt us.”  The wind changes and shuts the clouds over the sun again. Choy’s calling out to me, asking if I need backup. But in my mind, I’m in the comic book and copy shop smelling of cheap printer ink and paper cuts, near our secondary school, watching Wei and Xi play Time Pilot. Maybe I can understand what it’s like for her. Lion City is all she has, and she’s nothing outside of it.  Choy approaches, but I raise my hand to stay them. “Lion City never promised me anything. But you were my friend.”  Wei’s breath is hot on my face. “If you were ever my friend, let me pass now.”  “You’re still my friend, Wei. But I am a Monitor.” Then, I motion to Choy.  When it was done, I filed a request for a long leave of absence from the Administration and returned to my flat to pack, without waiting for approval. I have a seat on the unmanned high-speed rail that will take me up north, to the roof of the world. I’ll figure out my next move at the end of the line. I’ve experienced enough, and I want to feel. I’ve deleted Wei’s avatar and blocked her access to Lion City. She now exists fully in the Outside, and alone, unplugged from the city she loves. Someday, I’ll be ready to return, and let her back in. Eliane Boey is a Singaporean Chinese novelist and short story author. She writes speculative, horror, and contemporary fiction, and has writing published and forthcoming in the Mekong Review, and the Penn Review. Eliane has an MLitt in Philosophy from the University of St Andrews, and is working on her debut novel. She can be found on Twitter @elianeboey, mostly posting GIFs of ’90s films you wish you’d forget. (Preferred pronouns: she/they)", "text": "5460 words, short story\nThe Forgotten\nIt was the cockroach from the crack in the bathroom wall, tapping a defiant dance on my haptic suit, that made me pull up Sociable, to post a comment to my Constituency Administrator. I’d killed the damned thing yesterday, watched it kick its hairy legs in the air. Yet somehow, life asserts itself, and accepts all the conditions. As I shook it off my suit, I saw the number under the Admin’s name. Five million. That’s the number of users who support her every decision and utterance. I expanded the list and stopped at a name I knew, Axl Zhuang. By the looks of it, Zhuang wasn’t a passive loyalist. In the last month alone, he’d upvoted three of her new rules, joined a group, and posted positive comments. Only, Zhuang died in the outbreak ten years ago, when I was low enough on the Administration hierarchy to volunteer for processing at a triage center.\nA single Admin, of the one hundred and twenty who govern thirteen million citizen-users each packed like roaches into the cracks of a territory half the size of old Hong Kong, cannot possibly have five million loyalists. For one, the dead can’t vote, not even in Lion City.\nThe yawning jaw of the tunnel ends in a sheer cliff over the pit of fire. In Avici, the air is so hot it expands in your throat and scalds your lungs. Blink, and your eyes feel raw. My face is set in a thin scowl, which helps my purpose, but really comes from economy of movement, when every exertion is like wading in iron slurry. My subject keeps his head down and his lips shut, in Sisyphean acceptance. This time, I’ll break him.\n“You call it loyalty, but you’re the one who’s locked out, while your boss is in Lion City, pushing a dangerous amount of brainpower on the streets.”\nA wave of heat like a manic dragon nearly pushes me off the cliff and into the blazing crevasse. Beside me, the daemon with long black hair, shirtless in his blue skin and loin cloth, waits slack-faced with folded arms. You have to admire Wei’s sick commitment to accuracy.\nThe subject groans in the heat. “Not on the streets. It’s just one whale buying it all.”\nI hold the chip to his face. “Who’s farming and selling the firmware?”\nI could drop the sensitivity on my suit and feel a warm breeze or nothing at all. But a while ago, I decided I wanted skin in. I don’t want to lose the parts of myself that can still feel.\n“Choke on your joystick, Maggie.” He gives me the finger.\nI grip my knees and sigh behind clenched teeth. Truth is, I ran out of things to say ten cycles ago. And I regret telling this runner my name, even if it isn’t what they call me outside Lion City. I’m trying to cook up something new and more intense, like how the only things you can know to be real are the lies you tell, when the blue light flashes top-right of my vision. A discreet stream of text appears below it. Then, I feel a nudge through my suit. Polite, but none too subtle. Something has to be up for Choy to use the bat signal. I hate being nudged when I’m working. I stand back and motion to the daemon, and it steps forward.\nThe subject spits. “You’re an errand boy, sent by grocery clerks, to collect a bill.”\nWas I really so bored the last time I was here, I started talking film and books, to this goon?\nIn spite of myself, I smile. “At least I know what I belong to.”\nI don’t want to hear his reply. When the daemon throws him into the infernal pit, he’ll land on a round platform, a few feet above the fire. The platform is small, and with each new addition, some will fall into the inferno. On the platform, you’re close enough to feel the water in your body vaporize, and far enough to do whatever you can not to fall in. It doesn’t matter that you’ve fallen in, been fished out, and fallen in, over and over again.\nNobody wants to die, even if it isn’t real. I tap my optical and log out of the module.\nHot rock softened into plush wall-to-wall navy-blue carpeting. It’s 2040, but the Administration maintains their virtual meeting rooms in exact replica of their offices in the Outside, when they existed, at least ten years ago. Wei sits behind her empty black steel desk. When my avatar, Maggie, materialized behind the door, the skin around Wei’s eyes tightened, prepared for conflict. I strode up to her.\n“You’re not getting your updates any sooner, porting me out in the middle of a cycle.”\nWei bridged her fingers. “It isn’t bootleg firmware that keeps me up at night.”\nEven a luddite like me who only understands spoken languages knows that much disposable brainpower available to the highest bidder on the black-market spells trouble. I let her enjoy the sound of her voice as I slid a finger on the top of the black leather seat across from her. Then I held its corner and spun it.\n“Undercover” adds an air of old-world mystery to the dirty work that I do. The upside is that Maggie doesn’t resemble me. She looks like Maggie Q in the Nikita years, tanned in the Southeast Asian sun. Wei, however, as an active Monitor, equivalent in access to a Junior Administrator, has to maintain an avatar of the same name and physical appearance as her real self. With the luxury of perfectly waved silver hair and airbrushing around the sides of her mouth. She looks something like Carina Lau and smiles even less.\nWe are women on the wrong side of fifty, and that’s being delicate. Our peers have all tapped out, either retired while it still made sense or pushed out for things they said or didn’t. Wei is still here because she built Avici and handling me is now her only connection to it. I am still here because fetching for Wei is my only connection to what I really am.\nWei spoke. “Someone is sniffing around the Administration’s loyalist count. They’re running random tests on user profiles, for verification.”\nFive years ago, the Administration dropped the term “follower” in favor of “loyalist,” to denote a citizen-user’s open and absolute endorsement of its Administrators, their acts, and omissions, in return for free housing in the Outside, and unlimited high-speed access to Lion City. Along with free upgrades to the latest immersion tech. In theory, it’s like a rolling subscription to the biggest predictive entertainment pack you can imagine. In practice, you can’t opt out. Some try to make their own way, paying for housing and digital access in hourly wages from the last remaining in-person service jobs, but they’re a shrinking minority.\n“I’ll run search history scans, and analyze check-ins of the usual suspects,” I said.\n“I don’t give a damn about locking out runners. I want to know why they’re doing it. Dissidents have protested, sabotaged the network, and tried to erase themselves. But they never tried to look under our hood before. Something’s different, Xi. The Renewal is next month, and we don’t need any surprises.”\nHer coolness as she said my name, a reminder of our lives in the Outside, made my skin peel off my bones. Something had to be different, when the open tab in everyone’s minds for months suddenly wasn’t a problem anymore. Only, I wasn’t certain we’re looking at the same problem. The Renewal cycle replaces elections of old. Loyalists’ votes are automatically cast for them each cycle, renewing the operating license of their zone Administrator. A large part of Wei’s Security directive is to safeguard this process. When I was in Ethics, my directive would’ve required me to dig deep into the questions that were making Wei squirm. Where this all falls apart is, that I now report to Wei.\nThe chair was still spinning when I logged out of her office.\nWhen overcrowding and scarcity of resources in the face of cyclical epidemic waves became too much, even for a single-state territory, the Administration demanded solutions to rising crime rates. They turned to Wei, who could build worlds you hadn’t even dreamed of.\nAvici is the name of the eighteenth level of Buddhist Hell, where there is no redemption or reincarnation. Wei omitted what religious symbolism she could in its creation, so it’s really a hot, overcrowded pit you can’t hit restart and log out of. Not too different in some ways from the Outside. She put her good years into Avici, and when it was done, the Administration escalated her three access levels to Monitor, far from the back end of Lion City.\nVirtual time is zero-cost. In nearly all cases, Avici is more like a holding cell than an actual prison. Most people crack sooner rather than later and spill the beans or accept restrictions or monitored access, just to log back in. With rapid urban degeneration, those who can afford to have long moved away, to less dense and richer territories, abandoning this one to the poor. Lion City offered shelter and dulled their senses with nostalgia. Over the years, rants and manifestos have appeared in threads on fringe group forums, calling for its defunding—even permanent unplugging—and for the budget to be channeled into revitalizing the real territory to make it livable again. But the truth is, Lion City is the last place that most can still live decently, even if they need a haptic suit to experience it. That and copying and pasting code for a new estate with leisure grounds costs next to nothing.\nAvici, and Lion City for what it’s worth, are Wei’s pride and obsession, yet lately I get the feeling that at this level, it’s just a distraction. Moving background draped over a secret door. What’s behind the door? A bonus stage, or the real, final boss?\nThe sky is a glow of apricot, which cools to a near-neon pink and loses its way in the wisps of white clouds, before touching the first stars of an indigo sky. It’s always dusk in Lion City, and you can see slices of the sky between the humble low-rise buildings, at the perfect changing of the guard between day and night. The air is cooled to a mild twenty-five degrees Celsius, which hasn’t naturally returned to this hemisphere in years. The public housing estate I’m in was demolished in 2005, when Wei and I were fresh Administration trainees. I’ve been here, and I remember barbecued stingray and an oyster omelet with my parents, at the tables in the open, by the hawker center. In the Outside, the plot that supported the hawker center alone is now a work-life complex with cells housing twenty thousand users.\nThe amount of detail in the rendering of the estate is astounding. As a Monitor, I have the latest haptic suit, gloves, mask, and opticals that aren’t readily available to citizen-users. But even a user with a three-year-old kit would be able to feel the grains of sand from the playground between their fingers and see the legs on the red ants marching in a line up a tree. The sounds are accurate too. The hiss of the air brakes in the red and white buses, and the chime of the primary school bell. Groups of avatars sit at the hawker center, with sugarcane juice, to watch children play on the climbing frame. Virtual occupation limits are in place, to maintain the true feel of a small public estate of the noughties. The Administration has taken great care to ensure that experiencing the estate, and others like it in Lion City, is as good as living in it in the Outside, or better.\nToday, I’m not here to sightsee. Something tells me the firmware racket, which does brisk business farming and peddling contraband plug and play AI code on the black market, has something to do with the non-user-controlled loyalist. So, I’m looking up Axl Zhuang at his registered Lion City address. It’s possible I was mistaken, and either he didn’t die in the plague ward, or I recalled the wrong name. I want to be mistaken.\nInside, the flat looks like how I might have remembered my Popo’s home, if she hadn’t died when I was nine. The front gate was unlocked, so I let myself in. This historic three-bedroom flat would house four families or core units today. There are things in the flat that I intuitively know to belong, even if I have no memories of them. Like the wooden sideboard painted avocado green, with panels of textured glass. The beige hot water flask with five upturned glasses on an enamel dish painted with roses. The page-a-day horse racing calendar sponsored by Union Gas, in bold red lettering on wafer-thin paper, torn to 27th May 1984. It’s a little further back than the nostalgic sweet spot of the median user age, but it makes sense if it’s designed to invoke a late afternoon at your grandmother’s flat, minutes before dinner.\nExcept, there is no Popo calling you to dinner, nor sounds of cooking from behind the cloth curtains over the doorway to the kitchen. That’s unusual, given the needle-carved level of detail in the inanimate objects. The living room has the eerie absent presence of desertion. Where are the NPC grandchildren waiting to be fed? Where are the cooking smells? Eyes sweeping the room, my heart jumps when I notice the back of a spiky-haired man at a far corner of the room, in a swivel chair at a control screen near the window. He’s been sitting there all along, in silence. The screen he’s using is from years ago, the sort the elderly hang on to, claiming the lower resolution and image speed gives them fewer headaches.\n“Mr. Zhuang?” I approach with caution. “I’m from the Community Befrienders group about a new initiative. I hope you don’t mind I let myself in.”\nThe avatar doesn’t not move or acknowledge my presence in any way. I’m near enough now, to see that his fingers are typing, so I know he is at least functional. I suddenly find myself wishing I brought more than balls with me. I place a hand on my hip and hope he’ll make his assumptions and not do anything stupid. Then, I grab his chair and spin it around.\nWhere his face should be is an unresponsive mass of gray pixels.\nI graduated from the last philosophy cohort before the National University closed its arts department for good. Lucky for me, the newly restructured Administration was handing out jobs to warm bodies. Wei found her home in systems design, while I tried to stay busy at the charmingly hopeful department of Virtual Ethics and Algorithmic Transparency.\nThings got murky when the Administration declared a war on virtual identity fraud. That was about the same time that artificial intelligence became fully regulated, with defined capability types and maximum intelligence in each band, pegged to a fixed weightage of current median human intelligence. Virtual identity misrepresentation becomes fraud when a user wrongfully gains from the appearance of their avatar, relative to their actual appearance and identity in the Outside. In effect, it’s legal to exist in Lion City with a unicorn’s or a fish’s head on your shoulders. But if you want to teach mathematics at virtual school, you can’t do it looking like a middle-aged male with a receding hairline, if you’re a young woman with green hair who’s a hairdresser in the Outside. Even if you knew the math. I’m keeping it simple, but if you can see at least five ways this is problematic, you’re on the right track.\nAn initial citizen-user “feedback” hotline had lukewarm success. Old-fashioned ratting on your neighbors requires knowing who they are. Yet with each year, fewer people lived active lives in the Outside, where their bodies sat in sanitized cells and were delivered the essentials of corporeal life. No one stayed logged out long enough to connect goings on in Lion City to real-life users. What the Administration needed was a Superuser, who would move between the promise and plenty of Lion City, the bleak emptiness of the Outside, and the looping madness of Avici, and put all the crumbs together to remake the loaf.\nFirst, my file as a low-ranking Administration officer was deleted, then, a new profile was created for me, in Security. With the rank of Monitor, to allow for autonomous transmutability across modules. Wei, as my handler, is the only one with access to my file. Some days, I get the feeling she isn’t just playing along with the cover story that I was discharged in disgrace. Even as she uses my information for the cancellations and lockouts that the Administration deems necessary for collective security. Perhaps I move between zones and states because I am nothing.\nBefore the number-pad tone and airy whistle of dial-up Internet shot into our lives, and the neighborhood’s first Compaq Deskpro appeared in Wei’s parents’ flat, we spent hours at the VHS rental store. Wei and I picked videos and absorbed 1970s to then-current 1990s American pop culture with a determined hunger, like it was supposed to mean something. Wuxia and Hong Kong cop and gangster films were great. But what our parents understood—and often related to better than we did—had less appeal than American films, with the promise of a secret language and code of behavior, and as a portal to other worlds.\nOne thing you learn is that there are many crime flicks with buddy stories worked into them. Mostly between men, who limp bloodied to the end credits with renewed understanding that nothing beats being mates. Not for all the gold, guns, girls, and power in the world. Mostly. The only female crime-buddy story from that period that I can think of is Thelma & Louise. But Thelma and Louise had to die. The point I’m trying to make is, we learned that two women who each want something is two too many.\nI cross-checked a few more names on my Constituency Administrator’s loyalist list against hospital records of organ donations, and it wasn’t long before I found another zombie avatar. One T. K. Soh, deceased 2030.\nWhom I’m deleting from the system. Her avatar resided in a replica of an estate built in the 1920s, which predates even the Territory’s independence. The real plot now hosts a data center. Her flat is window-dressed in the same heritage memorabilia. The painted sideboard, the flask, and glasses, down to the Union Gas horse racing calendar torn to 27th May 1984.\nNothing in Lion City appears the ways it does by chance because none of it is real. Every perfectly captured memory first has to be selected by someone. The date has to mean something. So too should the seeming emptiness of the large flat. That’s when I realize, I’m not asking the right questions. Forcing the runner to name his faceless boss and hunting more runners to throw into Avici, or undead avatars to delete, isn’t going to throw any useful clues. The real question is why might a single buyer need that much high-capability brainpower at all, and how they’ve been using it without detection.\nWhy am I so worked up over this? To the average user, the reanimated avatar of a dead user will have the same appearance and engagement interest as an NPC—okay, arguably less, with the boxy gray face. Yet Zhuang and Soh did more than just fill seats in a stadium. Social limitations aside, they functioned as citizen-users, but with programable political interests. It’s long been illegal for a user to control more than one avatar, and capability regulations prevented powerful interests from creating voting drones. Until now. The beauty in reanimating dead avatars is that you don’t need to create them and trip alarms in the process. Plus, they already have histories, you just need to erase the final entry that logs their death and pray no one remembers them or looks too hard at insurance archives.\nAdd the intelligence firmware to the equation and the possibilities are chillingly limitless.\nI’m chewing on the date in my mind as I run my hand on the rough concrete wall. In the hallway, I push a Formica-coated pastel pink door. My mum might have had a room like this, with a little pink wooden bed. I blink, and my mind travels to the flat where I found Zhuang’s reanimated avatar. I never thought to search inside the dwelling. Now that my hand is on the door, my throat tightens. There will be no unseeing whatever I encounter in there.\nI push on the door. Within the room are rows and columns of school desks, each with an outdated screen and holo-keyboard that’s at least three years old. Behind every screen are blank, gray pixel faces above mechanically moving hands. None of them look up, but I still don’t know the full extent of their capabilities. I don’t know what else they can do.\nTrue fear doesn’t show itself in a scream, or a manic dash for the exit. It presents itself as denial. Like the cockroach kicking its legs while half of its body is crushed matter on my bathroom floor, fear takes its first breath as disbelief. This cannot be true. But it is.\nWei was born in 1984. And on 27th May in that year, Time Pilot ’84 was released.\nI’m sixteen years old and Wei is thirteen. Life in the Outside is still the only life we know, and it’s years before the first string of code for Lion City will be typed. We’re racing to the back gate of our secondary school, to scale the fence and disappear, before Ms. Solastri, who is both Head of Discipline and our advanced mathematics teacher, learns we skipped class to play at the arcades. I feel the heat of my muscles and the sweat on my face. A lithe Wei clears the fence. I reach up to her. She lands on her feet on the other side, puts a finger to her lips, and runs away. Jun-Xi, says Solastri when she catches me, you should know better than to mislead Kin-Wei.\nWei was advanced three years in secondary school, and not a day went by that I wasn’t thought of as a bad influence on her. Even our names defined us; Wei for greatness, Xi for happiness. Not that I ever achieved it. It was Wei who wanted one more go at Time Pilot before the comic book shop—which made its rent selling pirated textbooks printed on a Xerox machine—replaced the older games with new claw machines stuffed with bug-eyed plush baby animals, to appease the unsettled parents of the neighborhood. I keep my head down in silence like the other times and accept my punishment of standing two hours in the basketball court while the other kids enjoy a free period before swimming.\nTo say it’s a hot day is an understatement. Just moving my head hurts the skin on the back of my neck. An hour in, Wei crosses the court with a bottle of water for me on her way to the community center pool with the other kids in our class.\nI snatch the bottle. “You could at least admit it was your idea too.”\nWei smiles. “What good would it do, both of us being in Solastri’s bad books?”\nThe trains screech and grind steel teeth on the weathered rails, pulling to a halt with a sigh of exhaust that smells of bad eggs and a funk like old mushrooms. Their arrival raises a cloud of dust from the tracks, and I turn away. When I look again, the tracks are gone. Torn off the ground nearly thirty years ago and taken for scrap along with the diesel-powered trains to make the best of soaring ferrous prices. When we were university freshmen, not caring if our degrees would be relevant when we graduated, Wei and I shared an overnight sleeper and chugged all the way north, up the continent. Not all the memories I have of us are bad.\nI can visit the replica of this station as it was in 2001. Like all the lost or decayed landmarks, it’s rendered in perfect detail in Lion City, down to the vibrant graffiti, the fragrance of the best biryani I ever had coming from the canteen, and the unregulated burger stand that also sells cigarettes by the stick if you ask. Instead, I’ve come to the real site. Gray and black towers of work-life complexes and public estates cast shadows over the gutted station, built at the turn of the twentieth century. Few streetlights are maintained, because hardly anyone ventures out at night. After the trains were scrapped, the station had a brief life as a luxury food court and open-air cinema. Later, the homeless moved in. The Administrators were about to tear it down and rebuild on the plot when it occurred to them that the off-griders were an easy target this way, should the need arise. And so, the station stands.\nThe person I want is in front of their tent on the platform, sheltered by a wall that once supported the first-class waiting lounge. I approach, reaching in my inventory to pull out what I’ve come to have their eye on. In an instant, they flinch. I raise my hands and wave an old tablet I bought at an antiques store years ago. In the shadows behind them, other figures slink away, preferring the darkness. I had the tablet scrubbed and rebooted for my mum, and I kept it after she died. Now, it’s the only device I own that isn’t Administration-issued.\nI hand them the tablet with the firmware chip. Old-fashioned chips are among the last untraceable media. Still, everything constructed has a story to tell. Before long, I’m looking over the off-grid drifter’s shoulder at the name of the private server where the code originated. It can’t be a user’s real name or even their avatar’s name. But no god can resist leaving their mark, and this god is Yama. Yama has numerous names and roles across at least two cultures and religions. But most significant of all, Yama is the Ruler and Arbiter of Hell.\nWhoever wrote this thinks there is nothing above—or below—them. Nothing holds them at all, because they have not only kicked free of human expectations but kicked it to pieces. I know who they are.\nI have only once seen Wei lose her cool. Three years ago, a dissident group successfully disseminated worms that multiplied through media shares on Sociable. The worms targeted haptic feedback and sensitivity connections, degrading a user’s experience to what it was at the birth of virtual reality. Frustrated, people removed their suits, gloves, and opticals. For one surreal month, Wei, backed by a blank check from the Administration, did whatever was necessary to track the saboteurs down, people lived in the Outside again.\nWe found the group locked-down in a disused warehouse along what used to be the major river, before it was drained. My tip from a subject in Avici had paid off, and I made myself scarce while the Security team requisitioned equipment and rounded them up. I can’t be seen if I don’t exist. When I returned, the place was ablaze.\n“What the actual fuck?”\n“I couldn’t stand to see it,” Wei said, her face aglow. “How dare they try to shut down what we built, for them? We built a place that will always be a good home. Why can’t they see that?”\n“Guess it’s not so obvious to them as it is for you,” I said. I was looking at a lot of explaining to do about contaminated evidence. “Some days, it isn’t that straight to me either.”\nShe ran after me. I allowed myself two seconds to enjoy the feeling of being pursued by her, before I shut down the need and kept walking.\nWei shouted at my back. “You’re spending so much time with the roaches; you’ve started to sound like them.”\n“What’re we doing here, Xi?” Wei asks.\nThe fire door shuts behind her, and the sound of it is softer than I expected. In a twisted way, the real world appears low-res in comparison to Lion City and Avici. We’re on the roof of the Administration HQ. The real building, in the Outside, is mostly empty save for the lowest grunts who can’t afford to work remotely, even from within the territory. Wei points at me and smiles at the corner of her mouth. I can’t stop myself lifting a hand to feel my soft jaw and the brittle skin of my neck.\n“You should get more sleep, you look like death.”\n“Oh, I plan on catching up, as soon as we finish here. I’m done after this,” I say. Even my voice sounds tired. I sound like an old woman. I am not Maggie Q. I am an old woman.\nA discarded surgical mask catches on my calf. I shake it off and watch it drift. It doesn’t lose the wind and fall seventy floors to the empty roads below. It floats higher.\nWei’s hands are on her hips. She says, “You’re not done until I am.”\nThe clouds break, and she squints in the glare of the burning sun. Lucky for me, I’ve spent a lot of time down in Avici with my suit on full sensitivity.\n“Do you remember what you said, when you left me to take the hit from Solastri, just like the other times? You said, ‘What good would it do, both of us being in her bad books?’ I gave you the benefit of the doubt, that you meant both of us. But you meant, yourself, didn’t you? All this time . . . what good would I be to you?”\nWei shakes her head and touches the curl of hair by her ear. Her hair is almost as perfect in real life as it is virtually. “Say whatever you have to say now, Xi. Because I guarantee that no one will believe you when you tell them.”\n“No, I want to know for me, now. Is this the good you think you’re doing? Is Lion City, or the Territory, a better place when the avatars of dead users can be scrubbed, flashed, reanimated, and put to work for anyone with something to sell?”\nThe fire door opens, and four large Security personnel join us on the roof, with Choy, the analyst who keeps an eye on Administration movements for me, off the record. I must have been the only boss who was decent to them when they were an intern.\n“People have been living dead for years. If we don’t entrench the Administration’s hold, dissidents will keep trying to shut down Lion City, and one day, they will.” Wei takes a step toward me. “This doesn’t end with me. Taking me down is only going to hurt us.”\nThe wind changes and shuts the clouds over the sun again. Choy’s calling out to me, asking if I need backup. But in my mind, I’m in the comic book and copy shop smelling of cheap printer ink and paper cuts, near our secondary school, watching Wei and Xi play Time Pilot. Maybe I can understand what it’s like for her. Lion City is all she has, and she’s nothing outside of it.\nChoy approaches, but I raise my hand to stay them. “Lion City never promised me anything. But you were my friend.”\nWei’s breath is hot on my face. “If you were ever my friend, let me pass now.”\n“You’re still my friend, Wei. But I am a Monitor.” Then, I motion to Choy.\nWhen it was done, I filed a request for a long leave of absence from the Administration and returned to my flat to pack, without waiting for approval. I have a seat on the unmanned high-speed rail that will take me up north, to the roof of the world. I’ll figure out my next move at the end of the line. I’ve experienced enough, and I want to feel. I’ve deleted Wei’s avatar and blocked her access to Lion City. She now exists fully in the Outside, and alone, unplugged from the city she loves. Someday, I’ll be ready to return, and let her back in.\nEliane Boey is a Singaporean Chinese novelist and short story author. She writes speculative, horror, and contemporary fiction, and has writing published and forthcoming in the Mekong Review, and the Penn Review. Eliane has an MLitt in Philosophy from the University of St Andrews, and is working on her debut novel. She can be found on Twitter @elianeboey, mostly posting GIFs of ’90s films you wish you’d forget. (Preferred pronouns: she/they)", "source": "https://clarkesworldmagazine.com/boey_07_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Forgotten by Eliane Boey"}