{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CP25VnHz1SZ0YMZNM1gz+UwJgd0=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: I'm Still Here  Ten years ago, I was looking forward to attending Readercon with my family, relaxing with friends, selling some books, and celebrating Clarkesworld’s sixth anniversary. When I arrived on July 12th, I had no idea that it was going to become the luckiest and unluckiest day of my life.  Shortly after dinner, I started feeling unwell. At first, I thought I had eaten some cross-contaminated food. I have some allergies and had experienced milder versions of the same symptoms in the past. This time, the situation deteriorated even further and I eventually agreed with my family that we should call an ambulance.  When the EMTs arrived at our room I was feeling miserable and lying on the bed. They took one look at me and told me I was having a heart attack. The next few moments were a blur. I remember being on a gurney, flying through the lobby, and then I was suddenly in an ambulance. They’d given me something that immediately made me dizzy and nauseous and we arrived at the hospital, Lahey Clinic, in minutes. It was practically next door to the convention hotel.  There was some conversation, but whatever they gave me made it hard to focus. I remember being asked questions and saying that I was deferring all decisions to my wife, who was there with our children. The situation was urgent and they quickly moved me into the operating room so they could get a look at what was happening inside. I don’t remember anything about the procedure, just being aware that I was on a table and groggily asking if they were done. I was then wheeled away to the critical care unit and placed in the room closest to the nurses station. (I’m told there is sometimes correlation in how critical a patient is based on how close they place you to the station.)  Some time later—my sense of time at this point was shattered—the doctors came to explain the gravity of the situation. They’d placed two stents in my body and re-opened two arteries that were 100% blocked. They went on to say that the type of heart attack I had was commonly known as a widowmaker and that I was very lucky to be alive. That last part was repeated many times over the next few days, like that concept of good fortune was essential to my recovery.  I think it may have been.  The staff there was nothing short of wonderful—from the nurses to the staff who cleaned my room—they were all friendly and honestly concerned. The nurses told me I was the subject of conversation at the station. How does someone young and in good health end up with this happening to them? The doctors didn’t know and they still don’t. Just bad luck. In very rare cases, a spontaneous blockage can form in your heart. There’s no discernible pattern to who it happens to. The day before, they could have done the most thorough tests in the world and never found a reason to worry about me. Sensing how that distressed me, they added that they had never heard of it happening twice to anyone. I don’t know if that’s true, but I believed them.  The regular visits from my wife and children were the highlights of my days. When they weren’t around, I used this magazine as a distraction. I worked on the next issue from my hospital bed. When the lights would go out, the world would crash in. I had nearly lost everything and everyone important to me. I really was lucky to be alive and in no small part to the amazing people at Lahey.  After a week, I was allowed to return home and spent the next few months recovering, surrounded by my family. Brushing against your own mortality changes you. It gives you a startling clarity in regards to what’s most important in life. “Life’s too short” has become something of a mantra that helps me weather life’s bullshit and better appreciate the people and things in my life. Every day for the last ten years, the first thought that crosses my mind is “woo-hoo, still here.” To some, that sounds dark, but it’s not really that way. It’s the celebration of another day that I very nearly didn’t have.  I had a lot of time to think during my recovery and my priorities began to adjust as I took an honest look at my life. It was at this time that I realized how unhappy I had become in a career I once loved and how much I loved doing something I had stumbled into six years earlier. This was the moment that I started to take the prospect of an editing career a lot more seriously. I identified what I needed to do, what I needed to change, and slowly set out on that course.  Ten years later, I’m not where I had hoped, but I am still determined to make this work. I have no real reason to believe it isn’t possible, just that it’s difficult. I might have been a bit over-optimistic in my timeline, but I refuse to give up. There’s no way I could have foreseen the obstacles of a pandemic, other medical issues, or some of the lesser troubles that have arisen. Despite the frustrations and industry nonsense, I appreciate every inch we’ve gained in the last decade and still love this job.  When we conceived of this magazine—sixteen years ago this month—I never anticipated it becoming what it means to me or its place in the community. It’s so much more than I dreamed or expected and it’s been a very rewarding experience. So, whether you’ve read Clarkesworld from day one or just started today, from the bottom of my drug-reliant, squishy-sounding, cybernetically-enhanced heart, thank you for being a part of the journey. I hope you’ll continue to stick around! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: I'm Still Here\nTen years ago, I was looking forward to attending Readercon with my family, relaxing with friends, selling some books, and celebrating Clarkesworld’s sixth anniversary. When I arrived on July 12th, I had no idea that it was going to become the luckiest and unluckiest day of my life.\nShortly after dinner, I started feeling unwell. At first, I thought I had eaten some cross-contaminated food. I have some allergies and had experienced milder versions of the same symptoms in the past. This time, the situation deteriorated even further and I eventually agreed with my family that we should call an ambulance.\nWhen the EMTs arrived at our room I was feeling miserable and lying on the bed. They took one look at me and told me I was having a heart attack. The next few moments were a blur. I remember being on a gurney, flying through the lobby, and then I was suddenly in an ambulance. They’d given me something that immediately made me dizzy and nauseous and we arrived at the hospital, Lahey Clinic, in minutes. It was practically next door to the convention hotel.\nThere was some conversation, but whatever they gave me made it hard to focus. I remember being asked questions and saying that I was deferring all decisions to my wife, who was there with our children. The situation was urgent and they quickly moved me into the operating room so they could get a look at what was happening inside. I don’t remember anything about the procedure, just being aware that I was on a table and groggily asking if they were done. I was then wheeled away to the critical care unit and placed in the room closest to the nurses station. (I’m told there is sometimes correlation in how critical a patient is based on how close they place you to the station.)\nSome time later—my sense of time at this point was shattered—the doctors came to explain the gravity of the situation. They’d placed two stents in my body and re-opened two arteries that were 100% blocked. They went on to say that the type of heart attack I had was commonly known as a widowmaker and that I was very lucky to be alive. That last part was repeated many times over the next few days, like that concept of good fortune was essential to my recovery.\nI think it may have been.\nThe staff there was nothing short of wonderful—from the nurses to the staff who cleaned my room—they were all friendly and honestly concerned. The nurses told me I was the subject of conversation at the station. How does someone young and in good health end up with this happening to them? The doctors didn’t know and they still don’t. Just bad luck. In very rare cases, a spontaneous blockage can form in your heart. There’s no discernible pattern to who it happens to. The day before, they could have done the most thorough tests in the world and never found a reason to worry about me. Sensing how that distressed me, they added that they had never heard of it happening twice to anyone. I don’t know if that’s true, but I believed them.\nThe regular visits from my wife and children were the highlights of my days. When they weren’t around, I used this magazine as a distraction. I worked on the next issue from my hospital bed. When the lights would go out, the world would crash in. I had nearly lost everything and everyone important to me. I really was lucky to be alive and in no small part to the amazing people at Lahey.\nAfter a week, I was allowed to return home and spent the next few months recovering, surrounded by my family. Brushing against your own mortality changes you. It gives you a startling clarity in regards to what’s most important in life. “Life’s too short” has become something of a mantra that helps me weather life’s bullshit and better appreciate the people and things in my life. Every day for the last ten years, the first thought that crosses my mind is “woo-hoo, still here.” To some, that sounds dark, but it’s not really that way. It’s the celebration of another day that I very nearly didn’t have.\nI had a lot of time to think during my recovery and my priorities began to adjust as I took an honest look at my life. It was at this time that I realized how unhappy I had become in a career I once loved and how much I loved doing something I had stumbled into six years earlier. This was the moment that I started to take the prospect of an editing career a lot more seriously. I identified what I needed to do, what I needed to change, and slowly set out on that course.\nTen years later, I’m not where I had hoped, but I am still determined to make this work. I have no real reason to believe it isn’t possible, just that it’s difficult. I might have been a bit over-optimistic in my timeline, but I refuse to give up. There’s no way I could have foreseen the obstacles of a pandemic, other medical issues, or some of the lesser troubles that have arisen. Despite the frustrations and industry nonsense, I appreciate every inch we’ve gained in the last decade and still love this job.\nWhen we conceived of this magazine—sixteen years ago this month—I never anticipated it becoming what it means to me or its place in the community. It’s so much more than I dreamed or expected and it’s been a very rewarding experience. So, whether you’ve read Clarkesworld from day one or just started today, from the bottom of my drug-reliant, squishy-sounding, cybernetically-enhanced heart, thank you for being a part of the journey. I hope you’ll continue to stick around!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_07_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: I'm Still Here by Neil Clarke"}