{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bo Balder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "X6olzP/yUOy+Ysdhqwuhc2k+s44=", "id": null, "license": null, "comments": "", "raw_text": "9060 words, novelette  Quantum Fish  When Havi came back, eleven years after having fled five wormhole hops away, Malala wormhole hub didn’t look very different. Maybe a bit shabbier, a bit more crowded.  The coldsleep hangover crashed down on her like a barrel of fish and she changed her plans into sleep first, right now. She headed for the rack of sleep drawers outside the port offices—colloquially known as coffins—and was about to crawl in when The Briny Everything caught her eye.  The restaurant was still there. She’d eaten her final meal in-system there, before she’d embarked on her great adventure. Going to study at the last university on Chong Kong Long. Or running away from home and responsibilities, as her parents had called it. Suddenly food seemed even more important than sleep.  She shoved her luggage into the coffin, ordered her medical app to dispense a pick-me-up, and headed for The Briny Everything. Living on a distant wormhole hub meant she hadn’t tasted real fish for eleven years. Her home planet of Knossos exported thousands of tons of the most famous delicacy in the universe, but lightyears of distance made it too expensive even for a fairly successful journalist like Havi.  But here, it was only a short hop to the planet’s surface, and she could eat the real thing before facing her family. What could be more important than a fish meal?  The Briny Everything was the real deal. If you asked them for fish from the Clan Morotai channel, they wouldn’t serve you the ones from Clan Antjie a few kilometers away. They knew their stuff, and they respected customers who did as well.  Havi was from Clan Skuja, and that was what she was hoping to eat tonight. The taste of home, without actually having to face her family. Of course Havi hadn’t traversed half of known space to not visit her home planet. Of course she missed it and her old friends. But with every wormhole hop the likelihood diminished of the reunion going well. She’d run off from her family, her planned career in fish care, everything she’d ever known, eleven years ago. Why would anyone be glad to see her? Damn that therapist. She should have just written a debriefing letter and left it at that.  She scanned the menu. The Briny had a great selection, and thankfully Skuja fish were on it. She ordered a full Skuja sashimi spread and a local beer. Time to sit back with her hands behind her head and grab a few minutes of doing absolutely nothing while her fish was prepared.  Her platter looked fantastic when it arrived, satiny orange flesh with rainbow glimmers over it, the skin separately roasted and spread around the kernel of flesh like a flower. She looked closer. How had they disguised the cuts where the ring of eyes around the middle had been removed? New technique maybe.  She picked up a morsel with her chopsticks and settled it on her tongue, waiting for it to melt and burst into flavor.  It was more of a whimper than a bang.  Hm. Maybe not enough garum? She dipped the second piece into more sauce, and tried again. No.  No way.  This wasn’t Skuja terroir, nor was it any of the fifty-four terroirs whose taste her parents had drilled into her in endless lessons. Even though she’d made it clear early on that she wasn’t going to be a fish farmer.  She gestured to the server. The woman must have read her face, because she approached, looking worried.  “This isn’t Skuja terroir. Or any of the others. Did you print it? That’s fraud.”  The plate was whisked away at high speed. “Our apologies. The beer will be on the house. Can we offer you anything else to eat?”  Havi raised her brows. “A bowl of plain rice. I can stomach that from the printer.”  She waited for her rice, sipping her beer. Why had she come here? The urge to feel solid ground under her feet, wind in her hair, and sun on her face had been stronger than her career and circle of friends. Yet how was she going to find a job on the planet without running into her parents? She hadn’t made any progress in solving that hurdle.  The server coughed. She and another woman stood at the table. “Mx? The owner would like a word.”  Havi opened her eyes.  “I’m so very sorry, esteemed lady. We are out of stock on Skuja fish. We shouldn’t have served you printed stuff. Please don’t write about it. We’re trying to solve the problem quietly.”  Havi sat up straighter. What problem? The owner bent closer. “There are complications with delivery. We just can’t get any. Something’s going down on Knossos and nobody’s been able to tell us what. ‘Service suspended for the time being.’ So what can we do? We’re a fish restaurant. We serve printed copies of Knossos fish, genetically exact copies, let me tell you, to the people from out-system. But you knew. You tasted the difference. I guess you are from Knossos?”  “Indeed I am. Skuja Clan, in fact.”  The owner reddened.  “Okay, sorry to hear that. I’ll go and visit Fishy, then.”  “Oh, no, no dear lady,” the proprietress hastened to say. “Nobody’s been getting fish deliveries. We’re all in the same boat.”  There was an opportunity here. “What have you done so far to figure out the trouble? Anybody been talking to the fish farms?” Havi asked.  “The Restaurateurs’ Association has tried. But it feels like they’re stalling. Maybe there’s a problem with production? Or they’ve sold all their stock to a new buyer?”  “Have you gone down to investigate?”  “Me, into the gravity well? Oh no, lady, too rich for my blood. Open skies and who knows if you’d ever get back up . . . ”  Havi leaned forward. “What if I go down and investigate for you? I feel that the Restaurateurs’ Association might benefit from having an ear and an eye on the ground, so to speak.”  Her earnings and kudos had been pretty much spent on the trip. She needed work. How could she pass up this opportunity?  She couldn’t.  Maybe Havi had never been the smartest or most diligent of students. But she had moments of great insight, though not always ones she could use. For instance, when she was sixteen, experiencing her first date with handsome jock Dara under the rainbow of summer moons. Dara’s body, glistening with sweat, was poised right above her. Havi lay back, waiting while he took a selfie of his moonlit body, maybe a little bit bemused by the whole thing, but interested and willing. They’d finally managed to ditch Havi’s little sister, swum to one of the few Paal temples above water, and were occupying the altar-like slab in the top room.  Havi waited and stared through the triangular window. She blinked at the three stars shining through, also arranged like a triangle. Like the ones at the wormhole. She had one of her first flashes of insight. Not the first, that had been at twelve, when she realized her parents were human beings just like herself and therefore capable of massive confusion and getting things completely wrong. This one was about herself and what she was doing here down in the gravity well. It was like a prison. One she needed to escape from.  She wriggled out from under Dara and started taking pictures of the star formation.  Dara never forgave her. Knossos was never the same after the starships started arriving and the derelict wormhole hub orbiting the sun got fixed up. Knossos fish became a galactic delicacy. Her parents became rich. Havi ran away from home.  Havi stepped out of the shuttle onto the floating shuttle dock of Continent Five. After haggling with the restaurant owner until they’d reached an agreeable compromise, she’d stumbled to her coffin hotel and slept like a human being. Most aliens, or fish for that matter, never slept. She’d dialed up some random breakfast and made it to the shuttle transfer to Knossos station and down planet just in time.  Continent was a big word. There was no dry land on Knossos. On continents, the sea was from an inch to two meters deep, in oceans up to kilometers. Every bit of its submerged surface was completely covered in Paal labyrinths. And fish. Humans, limping through the galaxy, fleeing the Katabiotic destruction of their home planet, had been delighted to find any intact planet that didn’t outright kill them. They had settled on it in spite of the obvious downsides.  Havi blinked against the bright sun. She’d forgotten how dim everything had seemed when first leaving her home world, but she’d adjusted. She dialed up her cornea protection and resigned herself to a few days of glare headache.  The shuttle port floated on lightly ruffled, turquoise wavelets, small spokes radiating out from its hub for stability and to serve as docks for hovercraft. If you didn’t look too closely, the labyrinth beneath the waves was invisible. Today she was the only person getting off, nobody got on, no hovers were docked. It might be a random lull in traffic, or was she seeing the results of an economic slump?  She was here to find that out. And she might as well head home right away. Get it over with. Face the recriminations.  She stepped off the dock onto the top of the Paal labyrinth wall and started sloshing through the warm sea. The tops of the walls were about ten to fifteen centimeters under water, and thirty centimeters wide. She’d done this barefoot all her life, but mindful of her space-tenderized soles, she’d brought water shoes.  “Mx! Mx!” The shuttle field attendant called out. “It’s not safe. There are currents. Wait for the hover boat!”  Currents? Pfft. She waved her thanks. “I grew up here. I’ll be fine.”  The attendant emailed her a rights waiver, which she signed. Safety first, though it seemed a little over the top. As she splashed through the shallows on top of the labyrinth walls, jumping over the narrow corridors, on the fastest route to Skuja Farm, she set her inphone to access the local webs. It was a three-hour walk; she might as well use the time to update herself on the latest news.  First, she skimmed the feeds. What she didn’t find was news about the fish shortage. Nothing about fish whatsoever. Back in the day, the Continent Five news had shared weekly tidbits about particularly good catches, fish populations, taste changes, currents, and winds. That column seemed to have gone.  Conclusion: something was definitely going on. Well, she’d be home in less than three hours and her parents would update her on the situation.  Her foot slid off the wall and she plunged down into the corridor. The water should have been no more than a meter deep, but the wall went up and up before her surprised eyes and she was at least three meters deep before her feet hit bottom. The whole of Continent Five didn’t have a labyrinth that deep. The Paal labyrinths had always been just under water. So how could the walls be so high here? Had they grown? Or had the sea bottom washed away?  Havi swam up, sputtering seawater, and hoisted herself back up the wall. Hm. Maybe the shuttle port attendant had been right. Maybe she didn’t know the current circumstances well enough to be walking in a vast desert of sea-covered labyrinth walls.  The horizon lay featureless and hazy in the late afternoon light.  Late afternoon? Drat. She’d forgotten to sync to planet time. It might have been morning on Malala hub, but that meant nothing to a planet that twirled through space regardless of human time.  This was not the moment to panic. She knew this place like the taste of her family’s fish, if need be in the middle of a moonless night. She used to, anyway.  Havi flicked a few drops of briny onto her tongue. She was where she thought she was. Every farm in the labyrinth had its own terroir, which gave the fish of Knossos their famous flavor. She was still good at this. She’d just have to follow her gut and ignore the minor changes eleven years had wrought.  She got up, adjusted her backpack, dialed up her shades. Onward.  An hour or so ahead was the old temple where she and Dara had had their failed tryst. If all went wrong, she could sleep there. The altar slab would be hard, but at least dry.  More than an hour went by. No temple in sight. Still not a problem. Havi was sure she was walking slightly slower due to her time in space and different gravities, and maybe she was taking a bit more care after her fall. It wasn’t an issue.  Dusk drizzled down quicker than she remembered. Still no temple. She’d taken a wrong turn, or the temple was gone, or she was only half as fast as she thought she was. If only she hadn’t signed that shuttle port waiver. She was getting tired. A rescue by hover boat would have been pretty nice right now.  Still, she wasn’t in any real danger. She’d only be sore and tired after perching on a wall all night. It was just odd that all the corridors had gotten so much deeper.  She slipped again and hit her chin, hard, on the wall in front of her. She didn’t fall off, but only barely. Checking her jaws for loose teeth, she tasted blood in her mouth. Her skull rang and she had to blink away dizziness. That really hurt.  Time to regroup. She rummaged in her backpack for a salve and filled her purifier with seawater. The UBI ration bars from the coffin hotel that she’d over-cautiously thrown in would now be her dinner. She gnawed on the flat-tasting bars and tried to ignore her stinging chin and bitten tongue. Not to mention her scraped knees from the earlier fall.  She wouldn’t die but it still wasn’t fun. She’d arrive home by morning. Everybody knew the shuttle schedule and would wonder, but still. No harm done. No need to call the people she specifically didn’t want to ask for help.  She could walk for a bit until true night and then wait for the moons to rise. Revived after her dinner, she set off again. The last reflected glow of the sun, to her back on the left, assured her she was still on track. With the darkness growing, a faint scent started to rise from the briny, and a murmur she hadn’t heard before. The surface looked strange as well, in a way she couldn’t put her finger on right away. When Baby Moon rose, it illuminated the sea with its pink glow.  Now the cause of the scents and the murmuring became clear. The water around her had a current. To her left, the water rushed glimmering to the west. Now what? It wasn’t migration season; she’d at least checked up on that. The seas had always been warm, silent, the currents running unnoticed. Funny peculiar, that was for sure.  The warm water lapped her ankles. Maybe it was a little deeper than before?  The next few steps brought the water swirling up until her knees. Havi stopped to consider her options. Within half a minute the water was up to her thighs. What could possibly cause this? The moons’ tides were negligible. The labyrinth itself?  She groaned. If she started swimming, she’d lose contact with the labyrinth and anyway, she couldn’t swim all night. Now she had to call the people she didn’t want to. She turned on her locator beacon and sent out a call to her parents’ fish farm.  The phone was picked up immediately.  “I heard from Alexa down at the port you’d gone walking. Need picking up?” her sister said.  Havi’s cheeks burned. So she had been recognized after all. Her foolishness was all over the fishing community already. Wait. If Ivete knew, and knew about the changed conditions, she could have picked Havi up hours ago. The asshole. Ivete had deliberately let it come to this. Was this payback for Havi’s leaving? Great.  “Thanks sis. Got my location?”  “Yup.”  Lights went on about half a kilometer in the direction of her family’s house and started moving toward her. Oh, the hover boat had been waiting for her with doused lights?  Havi looked down at the water now tugging at her waist. If she hadn’t called, they’d probably have swooped in a minute later anyway. She had no clue what was going on with the labyrinth, but it was clearly unsafe as hell.  She stood waiting as the water rose up to her chest, already starting to float when the boat whispered up and someone threw a lit life buoy over to her. As the boat winched her in, she unclenched her jaws. No need to let them know she was angry. They knew. They wanted it that way.  Her father and sister hauled Havi up to the deck. She stood dripping and just looked at them.  “Guess you didn’t lose your sense of direction,” her father said. “If the eddies hadn’t started up, you would have walked straight home.”  That sounded pretty close to an olive branch. Havi wasn’t sure if she was ready to take it after these childish shenanigans. She held out her hand anyway. Her father shook it, no expression on his face. Still keeping things tightly bottled up. Yeah, she wasn’t going to give him a hug until he started it.  Ivete, her sister, stood at the wheel and barely nodded.  Havi punched Ivete lightly in the shoulder. “Hey.”  Ivete punched Havi back. Unnecessarily hard. “Welcome home, sib,” Ivete said. It sounded way too perky after the mean punch, which would leave a bruise.  “A warning would have been nice,” Havi said.  “You telling us you were visiting would have been nice. Or a Christmas card every other year?”  Havi had stopped sending them after she never got any replies.  So they weren’t fine. She got the message. But why, after all these years? Havi felt a surge of anger. What old beef could possibly be worth nearly letting her drown? Their own daughter and sister? Come on.  The hover took off. Havi relaxed and watched Blue Moon rise. Lilac night was the best time of night. Glarus, the big green moon, wouldn’t be up until early morning.  “I could use a second dinner,” she said. “Anything in the fridge?”  Her dad and Ivete exchanged looks.  “It’s not been a good year. The fish are acting weird. And last year was bad too. The Fish Migration Guard must have let a stranger fish through, and the offspring tasted weird. We had to taste each and every one, so we sold only fillets that year. This year, with the eddies and the labyrinth acting up, we’re just not in control of the fish anymore. Most of them got away.”  Havi opened her mouth to respond, but didn’t.  If it was like that all over the world, that certainly explained why nobody on Knossos was sending their fish up into space. This was going to ruin the planet’s reputation. Her parents’ business would go under. Everybody’s business would go under. It was more serious than the Restaurateurs’ Association had made it sound.  So maybe the reunion with her parents was going to be more worst-case scenario than pink-tinted, but she had to get to the bottom of this mystery. She was still a Knossos girl at heart.  As the boat rushed over the waters, the violent glimmering on the water surface indicated that something a little more powerful than “eddies” was going on. Havi personally would have called them maelstroms or vortices. In hindsight, she felt a thrill of fear over her recent ordeal. That would have ended very badly if her family hadn’t shown up in time. She considered suing dumbass Alexa from the spaceport. Just sending a rights waiver wasn’t really sufficient customer care. If she’d really been an outworlder . . . but no, Alexa, last name unknown, had apparently recognized her as a scion of the Skuja family.  “What’s Alexa spaceport’s last name?”  “Thinking of revenge?” Ivete said. “Don’t. We persuaded her not to send out a rescue.”  What had Havi ever done to deserve a family like this? Leave home to pursue an education and a career away from fish? Big whoop.  Ivete’s face broke into a wide, smug grin, painted lilac by the moons. “And anyway, she’s Dara’s little sister.”  Havi rolled her eyes. “Not him again. Ever.”  The serrated outlines of the family farm popped up on the horizon, the lit contours stark white against the purple sky.  The next morning, Havi squinted against the sun glaring off the solar arrays as the stared down at the family farm. Everything was different. The corridors were at least two meters deep, and the fish didn’t swim their usual figure eight, but something far more complicated. She knelt down on her floater pad and swiped a pink fish from the shoal. She headed, gutted, and filleted it. The first raw bite definitely tasted different. Good, but not the taste of home farm.  When she’d come home last night, her father had cooked a meal entirely without fish or garum, the salty, spicy sauce made from fish remnants.  Mom had also refused to talk shop that late at night. Mom was the boss, so everyone trooped meekly to bed after feeding Havi. Havi had thought it prudent to eat breakfast before talking to Mom.  Yes. Strange tastes, strange swimming patterns, seabed dropping. How was that even possible? Havi went inside and called up tidal stats. They made no sense anymore. The three moons had always exerted a gentle pull on the planet’s shallow oceans, but the last year, tidal movements had splintered into much smaller whirlings and eddies and strange weaves of shallow and deepwater streams. Oceanographers were still exploring the patterns and the cause of the change.  Changes didn’t happen out of nowhere. Havi called up meteorologist reports, astronomers’ blogs, but they reported nothing out of the ordinary.  She enlarged the live tidal display from the satellite network. Zoomed out more. If she looked at the whole hemisphere at once, it almost seemed like there was a pattern. But it wasn’t complete. It seemed broken, interrupted. She zoomed in on one of the pattern breaks. Osaka Barrier. A recent, human-made, barricade to keep the fish from swarming, intermingling, and ruining their famous taste.  Time to talk to the farm manager. Mom.  Her mother was seated, frowning, behind a big screen showing the flow inside the family farm. The shoal swam around and around, as always, but there was a distinct pause at the closed tidal gate.  “It’s as if they want to leave,” Havi said. “But why? They’ve been fine here all their lives.”  Mom looked up at Havi. “Step away from the monitor. Don’t you know it’s rude to look over people’s shoulders? And this farm is not yours anymore, as you made very clear, so none of your business.”  “It’s not random curiosity, Mom! Don’t you realize your livelihood is in danger? As well as everybody else’s, including restaurateurs all over known space?”  “I do. But I only share family secrets with people involved in the family business. Go try the neighbors to see if they want you poking around.”  Jesus.  “They might be more open, not having a baseless grudge against me,” Havi snapped. “Isn’t there a worldwide concern? Aren’t you guys working together to find out the cause for this?”  “Of course we are. We’re negotiating agreements to keep our trade secrets safe. When we’ve got a covenant, we’ll start our own investigation.”  “What trade secrets?” Havi asked. She couldn’t think of any she didn’t already know, having spent her youth as unpaid labor on the farm. “And when are you expecting this covenant to emerge?”  “As I said, not unless you want to join the family business.”  Like hell she was.  “And what do you mean by random grudge? As if you didn’t realize what you were doing to us. As if you don’t know how hard it was to keep Ivete out of jail after that shuttle port business,” her mother said.  “Jail? What shuttle port business?”  “Yes, pretend to be innocent. Good Havi, who ignores everything that’s going on under her nose.”  “Mom, are you even taking this seriously? If things go on like this, you won’t have a business.”  “Don’t be dramatic, dear, you should have outgrown that by now. Things have always been fine. Of course we will find a way to get back to normal. Build another barrier, maybe, or another way to control the swarming and the eddies. They’re only fish.”  Havi got up and went out, before she said things she’d regret. She knelt down by one of the enclosed corridors where the family grew earth produce: seaweed, sea potatoes and limpets, gene engineered to provide human beings with the right nutrients. The Paal fish were the most important ingredients to give this diet variety and flavor.  She took off her shoes, stepped down into the lukewarm water of the basin, sun blazing down on her neck, and inhaled the fragrance that rose up from the water gardens. Seaweed in all colors between pink and dark green waved gently in the current. Limpets and shells pocked the sides.  She put some pinkies, strands of grassy kelp, and a limpet in her mouth and chewed furiously. Why did her parents, and possibly most of their fellow fish keepers, refuse to acknowledge the seriousness of the situation? She couldn’t understand it. It stared them right in the face.  But then again, they’d seen things get worse so slowly they might have failed to notice the enormous gap between how things had been eleven years ago and now.  Would there be any point in talking to other families? Might they have noticed other phenomena that would clarify the situation? She’d better, even if she didn’t think it would yield new info, just to be complete. She needed other points of view. She’d covered weather, water, and fishing. What else? The Paal, their labyrinths, and the fish themselves.  After filling herself up, she clambered out and looked back with a frown. Current, what current? Hadn’t her mom always told her the earth gardens were kept completely separate from the rest of the briny? Sure, the doors kept the fish out. But if there was a current, earth nutrients could get into the ocean. Another strike on the tally of human influence of Knossos’ “natural”, that is, Paal-instigated, processes. Hm. Wouldn’t proliferating bacteria or the kitchen gardens’ waste ruin the terroir?  She ran back over the tops of the labyrinth to the main house. It floated over the shadow gardens, where fungi grew. Fish genetics weren’t her first priority, but her sister who could tell her all about it, was right here. She swallowed. Time to face the music.  The door opened right after knocking. Havi hadn’t expected that. She stepped inside slowly and coughed.  “Hey Ivete. How are you doing?”  “No small talk,” Ivete said. “Just ask your questions.”  No truce then. Fish talk first, then the family questions.  “I’m glad you’re willing to talk to me. Mom just shooed me out. Why are you guys still mad at me? I don’t see choosing a different career path as such a big crime. And what about the shuttle port?”  Ivete took a deep breath. “You can’t let go, can you? Just when I was being the better person, putting business interests over my own feelings. Did you ever think you were making a major impact on my life? That by choosing to leave, you took away my choice?”  Such hot waves of anger came off Ivete that Havi almost took a step backward. “I didn’t force you to do anything. If you wanted another career, Mom and Dad would just have had to sell the business. It’s your life. As it’s mine.”  Ivete slammed her hand on the desk. “So hurray, you’re better at withstanding parental pressure than me.”  “And the shuttle port?”  Ivete shrugged. “I tried to blow up the shuttle port after you left. I was just a kid. Not the port’s fault, I see that now.”  Whoa. Havi didn’t know what to say. That was a little more than youthful high spirits. She’d never thought about the impact her leaving would have had on Ivete. She still didn’t doubt her right to choose her own life, but she wished she’d been able to support Ivete more.  “I’m sorry,” she said.  Ivete only huffed.  Havi took a deep breath. She couldn’t undo this old damage with a single apology. She was going to ask the questions she’d come for. “I’m looking into the mysterious fish behavior and taste. Is there anything interesting about their genetics you can tell me?”  “Nobody ever asks,” Ivete said. “But yes, I can.”  She opened up a tree chart on a large screen. Havi didn’t know what she was looking at until she zoomed in on the top branch. “Skuja” it said.  “This is what humans found when they landed here.” A struggling fleet of mere thousands, the last survivors of the destroyed Earth, fleeing the Katabiotics.  “The Paal had engineered the minimalist but still functioning ecosystem, consisting of no more than the fish, several branches of seaweeds, algae, and slime, no more than twenty-three bacteria. That was all. And so far, impervious to human bacteria, viruses, and fungi.”  Havi thought she understood, even though she didn’t know where this fact was leading.  “Of course we fish farmers are actively trying to maintain that unique genetic signature, for its flavor. So since the advent of humanity, two hundred years ago, the Fish Migration Guard tracks down and destroys stray fish or shoals. That’s why Osaka Barrier was put up. Me and Dad helped build it.  “But we can also track the fishes’ genetic history for far longer, even back to when the Paal created them. They made sixty-five unique species, so far less than we have now.  “Since the origin of these fish, so many hybrids have originated that only a few of the original mixes still exist. The rest is all hybridized. We can tentatively conclude that the Paal intended for hybridization to happen. How they made the fish capable of mating is a fascinating story.”  “For another day,” Havi said quickly.  “Or how they made it so that many types of aliens, among others the humans and the Gukke, could eat and enjoy the fish.”  “Also another day.”  Havi couldn’t tell from Ivete’s neck if she was disappointed in Havi’s curtailing of her digressions.  “So do these facts shed any light on what’s going on with the fish?”  Ivete shrugged. “Not that I know of. I’ve sequenced dozens of wrong-tasting fish. They’re all hybrids from existing strains. It’s odd that they are breeding out of season, but well, who knows why?”  “Isn’t that also biology?”  “It’s observed behavior, ecology. I’m all about the genetics.”  “No insights about the labyrinths rising, or the seabed falling? The eddies?”  Ivete looked unconcerned. Why would she pretend that?  Havi waited. Nothing more was forthcoming from her sister’s averted back.  It didn’t feel as if the past issues had been resolved even a little bit.  Havi sat down at her mother’s desk and fired off messages to universities and researchers. An urgency tugged at her. She couldn’t pinpoint the source of it. After all, the fish scarcity had been going on for months, the gradual rising of the labyrinths for years. There was no rational explanation for her sense of hurry. But her gut was her best guide, so she always took it seriously.  The astronomer and the meteorologist reacted the quickest. Sadly, they lived on the other side of the planet, but she made appointments to face-call them. In her career as a journalist, she’d noticed she got a better rapport and more information if she met people in the flesh. Something about the subliminal scents and body language of an actual human being, maybe. The archeologist, who hadn’t replied, was a short hover boat ride away. Havi decided to visit her first, welcome or not.  She left a note saying she’d borrowed Ivete’s hover and left. The archaeologist’s floating camp was near the Paal temple she knew so well. People knew so little about the Paal, even after living on Knossos for two hundred years.  The platform wobbled as she stepped onto it. A chunky machine sitting on the other edge churbled along quietly. Probably diving equipment. Before long, the tone of the diving monitor changed.  The first divers didn’t even notice her sitting there until they’d taken off their helmets and deactivated their suits.  Havi coughed. “I’d like to speak to Dr. Furuzan?”  The oldest of the women stuck up her hand.  “Hi, I’m Havi Kuja. I’ve been commissioned to look into the past years’ fish troubles. One of the things that stood out was the labyrinth changes. Do you have time to talk to me about that? Is it something you’ve noticed?”  Furuzan laughed. “Writing about it is the only thing that got me sponsors and students, so yeah.”  “Did you realize it also had an effect on the fish farms? The fish have changed behavior and taste different.”  “I heard some rumors, but since we don’t have money for real fish, I didn’t think anything of it. Wow. How interesting. Do you have proof that the two are interrelated?” Furuzan asked.  “Not scientific proof, no. This is just a preliminary investigation. But it seems pretty unlikely that two such events are coincidental, doesn’t it, after millennia of stasis?”  Furuzan waggled her head. “We think millennia of stasis. Those few satellite photos we have from the Gukke don’t really prove nothing happened in between. And don’t forget the arrival of humans as agents of change. But I get your point.”  “So, what can you tell me about the Paal? Why did they build these labyrinths, why they designed this specific ecosystem?”  “I wish! We don’t even know what they looked like, since the Gukke, who actually met living Paal a couple of thousand years ago, never bothered to film them or preserve the memory.”  “I’m investigating for the fishing and restaurant industry. Knossos’ economy is going to collapse if the fish problem continues. Anything you can tell me about the Paal and the labyrinths,” Havi said.  “You probably knew the labyrinths extend several meters down into the soil? So they haven’t been growing. The continents’ seafloor has been slowly sucked out by currents. I have a hunch that the labyrinths have some connection with wind, tides, and currents. The currents in the briny are fueled by massive water vortices in the oceans. Where, as you also were aware, I assume, the labyrinths continue. All over the globe.”  “Has anyone ever completely charted them?” Havi asked.  “Not really.”  “I wonder why the first settlers never bothered to explore further. I would have.”  Furuzan shrugged. “They were refugees from Earth, fleeing the Katabiotics, probably had lived in cramped ship clouds for generations. They were just happy to find a habitable planet, to be free of the Katabiotics.”  “So did the Katabiotic aliens also kill the Paal?”  “We don’t know that the Paal are extinct. We only know they’re gone from this planet. But where they are, all dead, sublimed to another plane of existence, moved to the Magellan Cloud . . . nobody knows.”  Havi felt a stirring of instinct. Something here. “We have found very few intact planets, haven’t we? Almost all destroyed by the Katabiotics. I wonder why this planet is still here.”  “Interesting question, but outside my purview. We’re just cataloging the newly accessible labyrinths walls. “  “Can you show me?” Havi asked. The stirring inside her was fainter now, but it wasn’t gone.  “Sure. For example, the structure the locals call the temple. Let me show you what it looks like now.” Furuzan gestured to the water, where something triangular stuck up about twenty meters away. It was about ten meters wide and three high. Must be the remnant of the temple.  “I can’t dive,” Havi said.  “It’s a short walk and it’s only submerged up to the chest. Well, you’re tall. To the waist.”  They balanced over the labyrinth walls and clambered through the temple’s windows into a triangular space that stretched away to its point about fifteen meters away. The stone floor was completely submerged now.  Havi landed in warm water, slick stone beneath her feet. The slab where she and Dara had not made love was only visible as a disturbance in the water’s gentle eddying.  The pictorials on the wall were fuzzier and less deep than she remembered. She moved closer to the left-hand walls. They’d always been called pictorials, she wasn’t sure why. The shapes she saw were abstract and organic, created by thousands of little triangular stones or bricks.  “Look at the walls, and then at this picture. The reliefs on the wall have moved two millimeters.”  Havi had already seen it. “I used to hang out in this place all the time. They’ve moved a lot more than two millimeters. The design is completely different.”  She waded toward the far wall, where once a beautiful spiraling relief mural had been, and now only faint bumps were visible. The bumps didn’t even make a picture anymore. “Don’t touch it!” Furuzan cried out.  Havi put her hand on it anyway. She was sure she’d touched the temple walls before and nothing had happened.  The wall moved beneath her fingers. The stone sucked at her skin, refusing to let her hand move away.  Havi yelped in surprise and yanked her hand back. A faint whorl of blood showed in the water before it was washed away by a suddenly stronger current.  “What’s going on? What does this mean?”  “I was about to tell you this. The wall moves, it makes patterns. All the labyrinths we’ve seen do. I would guess that all of them are doing that. They react to our presence, and even more so to our touch.”  “Are the walls alive?” Havi asked, loath to touch them again.  “I don’t think so, although since they’re alien, who knows. More like automatons, maybe?”  The whirr of a hover boat became audible. The briny sloshed through the room.  “Another visitor?” Furuzan said.  Light brighter than the day strobed through the narrow window slots of the temple. “This is the police. Come out slowly.”  The police? Havi and Furuzan looked at each other. There wasn’t a lot of crime on Knossos, and if there was, it was usually dealt with in-house or in-family.  Havi clambered out first, squinting against the mega lights.  “Did you arrive on hover boat DG211?” the augmented voice asked, although the police hover was no more than twenty feet away.  “Yep, that’s me.”  “You’re under arrest for theft. Turn your back and hold out your wrists.”  Havi was too surprised not to comply. It was her family’s boat. She’d left a note. What the hell?  A person stepped off the hover onto the temple ridge. He clocked handcuffs onto her wrists.  “Turn.”  Havi turned. His voice sounded familiar.  The lights powered down.  The policeman turned out to be Dara.  “Havi?” he said, sounding a lot less surprised than she felt.  “Yes. Why am I under arrest? Who called in the boat as stolen? That’s my family’s boat.”  Dara looked sheepish. “Ivete called. She didn’t say it was you.”  Havi snorted. She believed him about Ivete’s call, but not so much about him not knowing it was her. And how had Ivete managed to pinpoint Dara as the arresting officer, had she called him out of his bed on the neighboring farm or had he just happened to be on duty? But she’d give Dara the benefit of the doubt. Not so much Ivete. “That little idiot. Okay, are you going to take the cuffs off?”  “I can’t do that. I have to take you to the station now. And process this officially.”  “Jeezus.”  Havi sat on a bench in the floating police station, hands cuffed, in growing annoyance. Dara administrated slower than slow, drinking endless cups of fish tea without offering her any. Processing officially her ass.  The silence was rudely broken by a raucous blare of sound. “What the hell is that? Turn it off!”  “That’s a siren. I think. A warning. Emergency.”  “For what? A storm?”  Dara raked his hands through his hair. “I think we covered this in training. Once. I have to look it up to be sure.”  Havi saw her chance. “If there’s an emergency situation, you can’t guarantee my safety. You have to release me.”  “Just wait, okay? I’m looking it up.”  The siren continued to grate across Havi’s nerves while Dara, increasingly nervous, browsed through his instruction manuals.  Dara gestured her to his terminal. “I found it. Look. It says it’s a warning against Katabiotic invasion!”  News flashes started to scroll across her vision, emergency overrides from her inphone.  “It’s the wormhole hub. It’s under attack. I can’t believe it. That’s millions of people.” Dara was panting, the whites of eyes showing. How had she ever for a moment considered him handsome fifteen years ago?  “Dara, get a grip. Untie me. Tell me what to do.”  Dara unlocked her cuffs with shaking hands. “I’m the officer on duty.”  Havi forced her voice to stay calm. “For this region. Sure. Where is the worldwide headquarters?”  “Here! I told you!”  “That can’t be true. How many of you are there?”  “Seven,” Dara said.  “For the whole planet?”  Dara started calling up his colleagues, his voice horse.  Havi stifled her questions. Dara was a bit slow, but he was doing the job.  After that, Dara showed her the information from the police database. “Katabiotic event. Call up oikotekts. (What is an oikotekt?) While you wait for their help to arrive, remember Katabiotic interference is a quantum event. Observe your surroundings continuously, reinforcing their stability.”  She read the paragraph out loud. “Do you know what this means?”  “There was a training exercise. We were standing in a circle and had to keep looking at each other and the room in a figure eight pattern. Very tiring. I got really dizzy.”  “So how would we do this?”  “Stand in a circle.”  “There’s two of us,” Havi said.  “Um, yes, I guess back-to-back?”  They stood back-to-back. In spite of her annoyance at his slowness and nerves, it was reassuring to feel a warm, living human being against her back. His physical solidness grounded her.  “What’s going on with your colleagues?” she asked.  “They’re organizing Katabiotic resistance. They need to get these instructions out to everyone.”  Seven cops for a whole world. Great. Who else could they call on? Of course. Fish Migration Control!  “Dara, get the same directive to FMC. They have a lot more hovers and warm bodies.”  “Already did that. Look, Havi. Look at the fish.”  She walked to the window. The police station didn’t float over a farm, but the briny was full of glinting fish backs. Thousands of fish, millions of fish, swimming. And not just randomly. Patterns.  Just like the patterns on the temple wall.  “Call up the FMC satellite feeds.”  Dara complied. “Zoom in.”  It was like looking at a different planet. The fish weren’t swimming around placidly in their local farm labyrinths anymore. They were swarming, circling, spiraling in large-scale patterns. Patterns the size of continents. All the fish must have escaped their farms.  There had to be a connection between the incoming Katabiotic attack and the fish behavior. But what?  Havi remembered Ivete telling her that the fish were conscious beings, about as intelligent as Earth fish had once been. Not very, that meant, but they did have awareness and memory, up to a point.  Not there yet.  She called up the astronomer she’d been about to visit. The woman wasn’t answering. She left an urgent message.  Within a minute the astronomer called back.  “Ms. Skuja, this is a bad time. We’re all observing the skies for signs of the Katabiotics,” the woman said.  “I’m at Police Headquarters, assisting in the defense effort.” Wow, that came out slick. “We need help. Just a few moments of your time. Explain to me in simple terms about quantum events and observation?”  “We learned, centuries ago, that if we managed to observe our surroundings intensively enough, or with the right kind of attention, that the Katabiotic changes can’t take place. It’s like Schrödinger’s Cat, once you look in the box, the cat is either dead or not. As long as you don’t look, its state is uncertain. The Katabiotics can only act in the uncertain state.”  “Is it only human beings who can do this quantum observation?”  The astronomer pulled at her chin. “I have no idea. But I don’t see why. A higher animal, like a mammal, would be able to observe whether a cat was dead or not.”  “Thanks!” Havi hung up.  The Paal had built the labyrinths, an unknown but long time ago.  Havi had always thought of the labyrinths as ruins, remnants of a dead species that had left the planet for its own incomprehensible reasons. But what if the labyrinth wasn’t a ruin of something else, but fish and labyrinth together were a machine, built for a purpose? And something had triggered that purpose?  “The fish are defending us,” she told Dara, who was still diligently observing his surroundings in a figure eight pattern.  “What?”  “Don’t stop. The fish observe the planet. That’s why this planet is the only one in the whole region that is still intact. It’s the fish. It’s a fish defense system.”  Dara giggled.  Havi slapped him. “Focus. Dara, focus. Zoom out from that satellite feed. We need to check on the fish. If they’re covering everywhere.”  A quick glance at the other four continents showed that the fish patterns seemed intricate and smoothly flowing. It was a different story on Continent Five. In the middle of the continent a large break showed in the pattern. “What is that?”  “Osaka Barrier,” Dara said. “Completed five years ago.”  Havi knew what to do. “It’s the barrier. It’s ruining the fish flow. We have to blow it up. Come on, Dara.”  “What? No. We can’t. It’s against the law. That’s people’s livelihoods.”  “Those people would complain even more if the planet started breaking up because the physical constants of the universe had changed. Remember what happened to Earth? We all watched the video!”  Dara scratched his head. “But . . . ”  “Whatever. Come.”  “No. I’m not destroying an important structure on your say-so. My duty is here, leading the defense efforts.”  Havi wanted to slap him again.  “Give me the keys to Ivete’s boat then. I have to do this.”  She jumped on board the hover boat and set course toward the barrier It had become night and all three of the moons were out. Baby, Blue Moon, and Glarus, also known as the Big Green Cheese. Their rainbow light glinted off the billions of shiny fish backs coursing through the water. The boat hovered not over the briny, but over a solid carpet of glistening fish spines. Beautiful.  She couldn’t do this alone, though. She didn’t know a thing about explosives or how to destroy large man-made structures. Shit. There was only one person she could call.  Her fucking annoying little sister.  “Hey Ivete, it’s me. I need your help.”  “Yeah right. How’s the police station treating you?”  “That was pretty annoying. I admit that. But now there’s an emergency and I need your help. You know how to blow up stuff,” Havi said.  “What? No.”  “Yes you do. You said you and Dad helped build the barrier. Blew up part of the labyrinths there.”  “Okay, that, yes.”  “Gather up your blowing-up stuff and meet me at the dock. I’m on my way.”  A long silence ensued. Havi imagined Ivete wrestling between a desire to blow stuff up and the one to frustrate her big sister. Maybe there was a smidgen of helpfulness in there too, but Havi wasn’t counting on that.  “Okay. I’ll be there. If you promise to stay.”  “No! Are you crazy? I have a career. I can’t just ditch that and go back to fish farming.”  “Okay, fine, then no help with explosives,” Ivete said.  “I will stay a month.”  “Six.”  “Two. Final offer.”  “Three or it’s no deal.”  Grinding her teeth, Havi promised three. Why did Ivete even want this if she was so angry at Havi?  Havi turned the hover to swing by the family farm.  Ivete was actually there, with several crates and bulging bags. And a girl Havi didn’t know, who was briefly introduced as Ari, the girlfriend.  The supplies were loaded and Havi raced off again, toward the barrier.  “What are we blowing up?” Ivete asked.  Havi grinned at her. “You’re only asking that now? Who are you?”  “Nobody you know anymore.”  That stung. But maybe she was right.  “I’m sorry I stayed away so long, little sis.”  Ivete didn’t react. Too little, too late?  “Okay, it’s Osaka Barrier. It’s obstructing the Paal defense system.” Havi said.  Ari cursed.  Ivete said nothing for a while. “Will it help against the Katabiotics?”  “Yeah.”  “Malala hub is breaking up as well, did you read that?” Ari said. “Who’s gonna buy our fish now? If there’s no hub . . . ”  “We’ll worry about that later.”  The boat skipped over the swarming fish backs in a straight line, illuminated only by the three moons. The fish weren’t swimming in patterns here but teeming and churning chaotically. Havi tried to ride faster, but she was at maximum speed already.  She swung the boat into a neat halt at one the barrier’s floating connectors. “We have to hurry. The Katabiotics’ effect could be here any moment. Do you know the weak points of the barrier?”  The girls shook their heads. Of course not. Why would they?  Havi cracked her knuckles. She was information girl. “You girls get the charges set up while I find out where to put them.”  Apparently, lots of people wanted to blow up stuff. Or no. All the dates on the articles were like hundreds of years old. But it should be relatively easy to blow up the support structure to the deep but lightweight barriers that blocked off Continent Five’s farm outlets.  Havi walked up to where Ivete and her girlfriend were connecting detonators to packs of explosives. Ivete looked suspiciously adept at this. She probably had had a lot more practice than on the construction. Who was Ivete? Did Havi even know her? Why had Ivete blackmailed Havi into staying at the farm? Baffling.  A tremor rocked the structure.  “What was that? Did you start already?”  Ivete looked spooked. “No. That was something else. Is it the aliens?”  What else could it be? Instinctively, Havi looked up at the moon. There was a black stripe across Green Cheese. What the hell? Suddenly it clicked. Not a stripe, but a chasm. Green Cheese was breaking up. Havi was no physicist, but she imagined a chunk of moon falling down would wreak immense havoc. Earthquakes. Tidal waves.  “We have to hurry. This is the vulnerable spot. Even if the rest of the planet is safe, if this part breaks down, we’re all doomed. We have to get those fish in here!”  “You’re talking gibberish. I trusted you so far, but this is weird. What have fish got to do with alien attacks?”  “A lot more than you’d think. I’ll explain later. Let’s get out of here.”  “If we blow up the barriers, won’t we kill a lot of fish?” Ivete asked.  Havi gestured to the millions of shiny fish backs swirling against the barriers. “Maybe some, but these will rush in to take their place.”  The hover took off at speed.  “How far?” Ivete cried.  “I don’t know! A couple of kilometers? Hurry.”  Ivete touched a secret button under the dash and the hover’s speed tripled. Havi was pushed back against the seat, “Far enough?”  The crack in the moon grew wider. Havi didn’t dare wait any longer.  “Go! Set them off! Explode the stuff!” she cried.  Ari pressed the detonator with a big grin on her face.  A series of bright sparks set off. An ear-shattering boom sounded. Seconds later, a big wave slammed them all against the hover’s deck.  “Jeezus,” Havi groaned. “Everybody all right?” Everything hurt. Especially her ribs.  Two separate groans answered her. At least they were alive. She managed to crack open an eye and found herself draped over the hover’s steering wheel. Hadn’t Ivete been driving?  Once she’d unpeeled herself from the dashboard, many of the pains lessened, but not the one in her ribs. She groaned. That made the pain worse.  Had it worked? Had they set the fish free? She crawled to the hover’s side and peered over the railing. Yes! The moonlight, strangely flat for this time of night, glinted off fish scales, orderly swimming in a micro version of the patterns that were only visible from orbit.  Did this mean the planet was safe now? Havi could do nothing about Malala wormhole hub, but down here she’d done all she could. She carefully rolled over on her back, landing on someone’s belly or thigh, and checked out Glarus Moon. The crack was still there, but it hadn’t grown any bigger. Maybe its internal gravity would pull it back together now that the outside influence was neutralized? She’d hate to have her late nights without Green Cheese to complete the rainbow.  She didn’t know what to do about a moon that might still be falling apart. But she bet someone else would, now that it was plainly visible in the sky. No need for investigative reporting anymore.  She moved her sore head to a softer spot on the other person’s body.  “Watch it, sis. I’m bruised there.”  Havi smiled. Sisters. Bo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "text": "9060 words, novelette\nQuantum Fish\nWhen Havi came back, eleven years after having fled five wormhole hops away, Malala wormhole hub didn’t look very different. Maybe a bit shabbier, a bit more crowded.\nThe coldsleep hangover crashed down on her like a barrel of fish and she changed her plans into sleep first, right now. She headed for the rack of sleep drawers outside the port offices—colloquially known as coffins—and was about to crawl in when The Briny Everything caught her eye.\nThe restaurant was still there. She’d eaten her final meal in-system there, before she’d embarked on her great adventure. Going to study at the last university on Chong Kong Long. Or running away from home and responsibilities, as her parents had called it. Suddenly food seemed even more important than sleep.\nShe shoved her luggage into the coffin, ordered her medical app to dispense a pick-me-up, and headed for The Briny Everything. Living on a distant wormhole hub meant she hadn’t tasted real fish for eleven years. Her home planet of Knossos exported thousands of tons of the most famous delicacy in the universe, but lightyears of distance made it too expensive even for a fairly successful journalist like Havi.\nBut here, it was only a short hop to the planet’s surface, and she could eat the real thing before facing her family. What could be more important than a fish meal?\nThe Briny Everything was the real deal. If you asked them for fish from the Clan Morotai channel, they wouldn’t serve you the ones from Clan Antjie a few kilometers away. They knew their stuff, and they respected customers who did as well.\nHavi was from Clan Skuja, and that was what she was hoping to eat tonight. The taste of home, without actually having to face her family. Of course Havi hadn’t traversed half of known space to not visit her home planet. Of course she missed it and her old friends. But with every wormhole hop the likelihood diminished of the reunion going well. She’d run off from her family, her planned career in fish care, everything she’d ever known, eleven years ago. Why would anyone be glad to see her? Damn that therapist. She should have just written a debriefing letter and left it at that.\nShe scanned the menu. The Briny had a great selection, and thankfully Skuja fish were on it. She ordered a full Skuja sashimi spread and a local beer. Time to sit back with her hands behind her head and grab a few minutes of doing absolutely nothing while her fish was prepared.\nHer platter looked fantastic when it arrived, satiny orange flesh with rainbow glimmers over it, the skin separately roasted and spread around the kernel of flesh like a flower. She looked closer. How had they disguised the cuts where the ring of eyes around the middle had been removed? New technique maybe.\nShe picked up a morsel with her chopsticks and settled it on her tongue, waiting for it to melt and burst into flavor.\nIt was more of a whimper than a bang.\nHm. Maybe not enough garum? She dipped the second piece into more sauce, and tried again. No.\nNo way.\nThis wasn’t Skuja terroir, nor was it any of the fifty-four terroirs whose taste her parents had drilled into her in endless lessons. Even though she’d made it clear early on that she wasn’t going to be a fish farmer.\nShe gestured to the server. The woman must have read her face, because she approached, looking worried.\n“This isn’t Skuja terroir. Or any of the others. Did you print it? That’s fraud.”\nThe plate was whisked away at high speed. “Our apologies. The beer will be on the house. Can we offer you anything else to eat?”\nHavi raised her brows. “A bowl of plain rice. I can stomach that from the printer.”\nShe waited for her rice, sipping her beer. Why had she come here? The urge to feel solid ground under her feet, wind in her hair, and sun on her face had been stronger than her career and circle of friends. Yet how was she going to find a job on the planet without running into her parents? She hadn’t made any progress in solving that hurdle.\nThe server coughed. She and another woman stood at the table. “Mx? The owner would like a word.”\nHavi opened her eyes.\n“I’m so very sorry, esteemed lady. We are out of stock on Skuja fish. We shouldn’t have served you printed stuff. Please don’t write about it. We’re trying to solve the problem quietly.”\nHavi sat up straighter. What problem? The owner bent closer. “There are complications with delivery. We just can’t get any. Something’s going down on Knossos and nobody’s been able to tell us what. ‘Service suspended for the time being.’ So what can we do? We’re a fish restaurant. We serve printed copies of Knossos fish, genetically exact copies, let me tell you, to the people from out-system. But you knew. You tasted the difference. I guess you are from Knossos?”\n“Indeed I am. Skuja Clan, in fact.”\nThe owner reddened.\n“Okay, sorry to hear that. I’ll go and visit Fishy, then.”\n“Oh, no, no dear lady,” the proprietress hastened to say. “Nobody’s been getting fish deliveries. We’re all in the same boat.”\nThere was an opportunity here. “What have you done so far to figure out the trouble? Anybody been talking to the fish farms?” Havi asked.\n“The Restaurateurs’ Association has tried. But it feels like they’re stalling. Maybe there’s a problem with production? Or they’ve sold all their stock to a new buyer?”\n“Have you gone down to investigate?”\n“Me, into the gravity well? Oh no, lady, too rich for my blood. Open skies and who knows if you’d ever get back up . . . ”\nHavi leaned forward. “What if I go down and investigate for you? I feel that the Restaurateurs’ Association might benefit from having an ear and an eye on the ground, so to speak.”\nHer earnings and kudos had been pretty much spent on the trip. She needed work. How could she pass up this opportunity?\nShe couldn’t.\nMaybe Havi had never been the smartest or most diligent of students. But she had moments of great insight, though not always ones she could use. For instance, when she was sixteen, experiencing her first date with handsome jock Dara under the rainbow of summer moons. Dara’s body, glistening with sweat, was poised right above her. Havi lay back, waiting while he took a selfie of his moonlit body, maybe a little bit bemused by the whole thing, but interested and willing. They’d finally managed to ditch Havi’s little sister, swum to one of the few Paal temples above water, and were occupying the altar-like slab in the top room.\nHavi waited and stared through the triangular window. She blinked at the three stars shining through, also arranged like a triangle. Like the ones at the wormhole. She had one of her first flashes of insight. Not the first, that had been at twelve, when she realized her parents were human beings just like herself and therefore capable of massive confusion and getting things completely wrong. This one was about herself and what she was doing here down in the gravity well. It was like a prison. One she needed to escape from.\nShe wriggled out from under Dara and started taking pictures of the star formation.\nDara never forgave her. Knossos was never the same after the starships started arriving and the derelict wormhole hub orbiting the sun got fixed up. Knossos fish became a galactic delicacy. Her parents became rich. Havi ran away from home.\nHavi stepped out of the shuttle onto the floating shuttle dock of Continent Five. After haggling with the restaurant owner until they’d reached an agreeable compromise, she’d stumbled to her coffin hotel and slept like a human being. Most aliens, or fish for that matter, never slept. She’d dialed up some random breakfast and made it to the shuttle transfer to Knossos station and down planet just in time.\nContinent was a big word. There was no dry land on Knossos. On continents, the sea was from an inch to two meters deep, in oceans up to kilometers. Every bit of its submerged surface was completely covered in Paal labyrinths. And fish. Humans, limping through the galaxy, fleeing the Katabiotic destruction of their home planet, had been delighted to find any intact planet that didn’t outright kill them. They had settled on it in spite of the obvious downsides.\nHavi blinked against the bright sun. She’d forgotten how dim everything had seemed when first leaving her home world, but she’d adjusted. She dialed up her cornea protection and resigned herself to a few days of glare headache.\nThe shuttle port floated on lightly ruffled, turquoise wavelets, small spokes radiating out from its hub for stability and to serve as docks for hovercraft. If you didn’t look too closely, the labyrinth beneath the waves was invisible. Today she was the only person getting off, nobody got on, no hovers were docked. It might be a random lull in traffic, or was she seeing the results of an economic slump?\nShe was here to find that out. And she might as well head home right away. Get it over with. Face the recriminations.\nShe stepped off the dock onto the top of the Paal labyrinth wall and started sloshing through the warm sea. The tops of the walls were about ten to fifteen centimeters under water, and thirty centimeters wide. She’d done this barefoot all her life, but mindful of her space-tenderized soles, she’d brought water shoes.\n“Mx! Mx!” The shuttle field attendant called out. “It’s not safe. There are currents. Wait for the hover boat!”\nCurrents? Pfft. She waved her thanks. “I grew up here. I’ll be fine.”\nThe attendant emailed her a rights waiver, which she signed. Safety first, though it seemed a little over the top. As she splashed through the shallows on top of the labyrinth walls, jumping over the narrow corridors, on the fastest route to Skuja Farm, she set her inphone to access the local webs. It was a three-hour walk; she might as well use the time to update herself on the latest news.\nFirst, she skimmed the feeds. What she didn’t find was news about the fish shortage. Nothing about fish whatsoever. Back in the day, the Continent Five news had shared weekly tidbits about particularly good catches, fish populations, taste changes, currents, and winds. That column seemed to have gone.\nConclusion: something was definitely going on. Well, she’d be home in less than three hours and her parents would update her on the situation.\nHer foot slid off the wall and she plunged down into the corridor. The water should have been no more than a meter deep, but the wall went up and up before her surprised eyes and she was at least three meters deep before her feet hit bottom. The whole of Continent Five didn’t have a labyrinth that deep. The Paal labyrinths had always been just under water. So how could the walls be so high here? Had they grown? Or had the sea bottom washed away?\nHavi swam up, sputtering seawater, and hoisted herself back up the wall. Hm. Maybe the shuttle port attendant had been right. Maybe she didn’t know the current circumstances well enough to be walking in a vast desert of sea-covered labyrinth walls.\nThe horizon lay featureless and hazy in the late afternoon light.\nLate afternoon? Drat. She’d forgotten to sync to planet time. It might have been morning on Malala hub, but that meant nothing to a planet that twirled through space regardless of human time.\nThis was not the moment to panic. She knew this place like the taste of her family’s fish, if need be in the middle of a moonless night. She used to, anyway.\nHavi flicked a few drops of briny onto her tongue. She was where she thought she was. Every farm in the labyrinth had its own terroir, which gave the fish of Knossos their famous flavor. She was still good at this. She’d just have to follow her gut and ignore the minor changes eleven years had wrought.\nShe got up, adjusted her backpack, dialed up her shades. Onward.\nAn hour or so ahead was the old temple where she and Dara had had their failed tryst. If all went wrong, she could sleep there. The altar slab would be hard, but at least dry.\nMore than an hour went by. No temple in sight. Still not a problem. Havi was sure she was walking slightly slower due to her time in space and different gravities, and maybe she was taking a bit more care after her fall. It wasn’t an issue.\nDusk drizzled down quicker than she remembered. Still no temple. She’d taken a wrong turn, or the temple was gone, or she was only half as fast as she thought she was. If only she hadn’t signed that shuttle port waiver. She was getting tired. A rescue by hover boat would have been pretty nice right now.\nStill, she wasn’t in any real danger. She’d only be sore and tired after perching on a wall all night. It was just odd that all the corridors had gotten so much deeper.\nShe slipped again and hit her chin, hard, on the wall in front of her. She didn’t fall off, but only barely. Checking her jaws for loose teeth, she tasted blood in her mouth. Her skull rang and she had to blink away dizziness. That really hurt.\nTime to regroup. She rummaged in her backpack for a salve and filled her purifier with seawater. The UBI ration bars from the coffin hotel that she’d over-cautiously thrown in would now be her dinner. She gnawed on the flat-tasting bars and tried to ignore her stinging chin and bitten tongue. Not to mention her scraped knees from the earlier fall.\nShe wouldn’t die but it still wasn’t fun. She’d arrive home by morning. Everybody knew the shuttle schedule and would wonder, but still. No harm done. No need to call the people she specifically didn’t want to ask for help.\nShe could walk for a bit until true night and then wait for the moons to rise. Revived after her dinner, she set off again. The last reflected glow of the sun, to her back on the left, assured her she was still on track. With the darkness growing, a faint scent started to rise from the briny, and a murmur she hadn’t heard before. The surface looked strange as well, in a way she couldn’t put her finger on right away. When Baby Moon rose, it illuminated the sea with its pink glow.\nNow the cause of the scents and the murmuring became clear. The water around her had a current. To her left, the water rushed glimmering to the west. Now what? It wasn’t migration season; she’d at least checked up on that. The seas had always been warm, silent, the currents running unnoticed. Funny peculiar, that was for sure.\nThe warm water lapped her ankles. Maybe it was a little deeper than before?\nThe next few steps brought the water swirling up until her knees. Havi stopped to consider her options. Within half a minute the water was up to her thighs. What could possibly cause this? The moons’ tides were negligible. The labyrinth itself?\nShe groaned. If she started swimming, she’d lose contact with the labyrinth and anyway, she couldn’t swim all night. Now she had to call the people she didn’t want to. She turned on her locator beacon and sent out a call to her parents’ fish farm.\nThe phone was picked up immediately.\n“I heard from Alexa down at the port you’d gone walking. Need picking up?” her sister said.\nHavi’s cheeks burned. So she had been recognized after all. Her foolishness was all over the fishing community already. Wait. If Ivete knew, and knew about the changed conditions, she could have picked Havi up hours ago. The asshole. Ivete had deliberately let it come to this. Was this payback for Havi’s leaving? Great.\n“Thanks sis. Got my location?”\n“Yup.”\nLights went on about half a kilometer in the direction of her family’s house and started moving toward her. Oh, the hover boat had been waiting for her with doused lights?\nHavi looked down at the water now tugging at her waist. If she hadn’t called, they’d probably have swooped in a minute later anyway. She had no clue what was going on with the labyrinth, but it was clearly unsafe as hell.\nShe stood waiting as the water rose up to her chest, already starting to float when the boat whispered up and someone threw a lit life buoy over to her. As the boat winched her in, she unclenched her jaws. No need to let them know she was angry. They knew. They wanted it that way.\nHer father and sister hauled Havi up to the deck. She stood dripping and just looked at them.\n“Guess you didn’t lose your sense of direction,” her father said. “If the eddies hadn’t started up, you would have walked straight home.”\nThat sounded pretty close to an olive branch. Havi wasn’t sure if she was ready to take it after these childish shenanigans. She held out her hand anyway. Her father shook it, no expression on his face. Still keeping things tightly bottled up. Yeah, she wasn’t going to give him a hug until he started it.\nIvete, her sister, stood at the wheel and barely nodded.\nHavi punched Ivete lightly in the shoulder. “Hey.”\nIvete punched Havi back. Unnecessarily hard. “Welcome home, sib,” Ivete said. It sounded way too perky after the mean punch, which would leave a bruise.\n“A warning would have been nice,” Havi said.\n“You telling us you were visiting would have been nice. Or a Christmas card every other year?”\nHavi had stopped sending them after she never got any replies.\nSo they weren’t fine. She got the message. But why, after all these years? Havi felt a surge of anger. What old beef could possibly be worth nearly letting her drown? Their own daughter and sister? Come on.\nThe hover took off. Havi relaxed and watched Blue Moon rise. Lilac night was the best time of night. Glarus, the big green moon, wouldn’t be up until early morning.\n“I could use a second dinner,” she said. “Anything in the fridge?”\nHer dad and Ivete exchanged looks.\n“It’s not been a good year. The fish are acting weird. And last year was bad too. The Fish Migration Guard must have let a stranger fish through, and the offspring tasted weird. We had to taste each and every one, so we sold only fillets that year. This year, with the eddies and the labyrinth acting up, we’re just not in control of the fish anymore. Most of them got away.”\nHavi opened her mouth to respond, but didn’t.\nIf it was like that all over the world, that certainly explained why nobody on Knossos was sending their fish up into space. This was going to ruin the planet’s reputation. Her parents’ business would go under. Everybody’s business would go under. It was more serious than the Restaurateurs’ Association had made it sound.\nSo maybe the reunion with her parents was going to be more worst-case scenario than pink-tinted, but she had to get to the bottom of this mystery. She was still a Knossos girl at heart.\nAs the boat rushed over the waters, the violent glimmering on the water surface indicated that something a little more powerful than “eddies” was going on. Havi personally would have called them maelstroms or vortices. In hindsight, she felt a thrill of fear over her recent ordeal. That would have ended very badly if her family hadn’t shown up in time. She considered suing dumbass Alexa from the spaceport. Just sending a rights waiver wasn’t really sufficient customer care. If she’d really been an outworlder . . . but no, Alexa, last name unknown, had apparently recognized her as a scion of the Skuja family.\n“What’s Alexa spaceport’s last name?”\n“Thinking of revenge?” Ivete said. “Don’t. We persuaded her not to send out a rescue.”\nWhat had Havi ever done to deserve a family like this? Leave home to pursue an education and a career away from fish? Big whoop.\nIvete’s face broke into a wide, smug grin, painted lilac by the moons. “And anyway, she’s Dara’s little sister.”\nHavi rolled her eyes. “Not him again. Ever.”\nThe serrated outlines of the family farm popped up on the horizon, the lit contours stark white against the purple sky.\nThe next morning, Havi squinted against the sun glaring off the solar arrays as the stared down at the family farm. Everything was different. The corridors were at least two meters deep, and the fish didn’t swim their usual figure eight, but something far more complicated. She knelt down on her floater pad and swiped a pink fish from the shoal. She headed, gutted, and filleted it. The first raw bite definitely tasted different. Good, but not the taste of home farm.\nWhen she’d come home last night, her father had cooked a meal entirely without fish or garum, the salty, spicy sauce made from fish remnants.\nMom had also refused to talk shop that late at night. Mom was the boss, so everyone trooped meekly to bed after feeding Havi. Havi had thought it prudent to eat breakfast before talking to Mom.\nYes. Strange tastes, strange swimming patterns, seabed dropping. How was that even possible? Havi went inside and called up tidal stats. They made no sense anymore. The three moons had always exerted a gentle pull on the planet’s shallow oceans, but the last year, tidal movements had splintered into much smaller whirlings and eddies and strange weaves of shallow and deepwater streams. Oceanographers were still exploring the patterns and the cause of the change.\nChanges didn’t happen out of nowhere. Havi called up meteorologist reports, astronomers’ blogs, but they reported nothing out of the ordinary.\nShe enlarged the live tidal display from the satellite network. Zoomed out more. If she looked at the whole hemisphere at once, it almost seemed like there was a pattern. But it wasn’t complete. It seemed broken, interrupted. She zoomed in on one of the pattern breaks. Osaka Barrier. A recent, human-made, barricade to keep the fish from swarming, intermingling, and ruining their famous taste.\nTime to talk to the farm manager. Mom.\nHer mother was seated, frowning, behind a big screen showing the flow inside the family farm. The shoal swam around and around, as always, but there was a distinct pause at the closed tidal gate.\n“It’s as if they want to leave,” Havi said. “But why? They’ve been fine here all their lives.”\nMom looked up at Havi. “Step away from the monitor. Don’t you know it’s rude to look over people’s shoulders? And this farm is not yours anymore, as you made very clear, so none of your business.”\n“It’s not random curiosity, Mom! Don’t you realize your livelihood is in danger? As well as everybody else’s, including restaurateurs all over known space?”\n“I do. But I only share family secrets with people involved in the family business. Go try the neighbors to see if they want you poking around.”\nJesus.\n“They might be more open, not having a baseless grudge against me,” Havi snapped. “Isn’t there a worldwide concern? Aren’t you guys working together to find out the cause for this?”\n“Of course we are. We’re negotiating agreements to keep our trade secrets safe. When we’ve got a covenant, we’ll start our own investigation.”\n“What trade secrets?” Havi asked. She couldn’t think of any she didn’t already know, having spent her youth as unpaid labor on the farm. “And when are you expecting this covenant to emerge?”\n“As I said, not unless you want to join the family business.”\nLike hell she was.\n“And what do you mean by random grudge? As if you didn’t realize what you were doing to us. As if you don’t know how hard it was to keep Ivete out of jail after that shuttle port business,” her mother said.\n“Jail? What shuttle port business?”\n“Yes, pretend to be innocent. Good Havi, who ignores everything that’s going on under her nose.”\n“Mom, are you even taking this seriously? If things go on like this, you won’t have a business.”\n“Don’t be dramatic, dear, you should have outgrown that by now. Things have always been fine. Of course we will find a way to get back to normal. Build another barrier, maybe, or another way to control the swarming and the eddies. They’re only fish.”\nHavi got up and went out, before she said things she’d regret. She knelt down by one of the enclosed corridors where the family grew earth produce: seaweed, sea potatoes and limpets, gene engineered to provide human beings with the right nutrients. The Paal fish were the most important ingredients to give this diet variety and flavor.\nShe took off her shoes, stepped down into the lukewarm water of the basin, sun blazing down on her neck, and inhaled the fragrance that rose up from the water gardens. Seaweed in all colors between pink and dark green waved gently in the current. Limpets and shells pocked the sides.\nShe put some pinkies, strands of grassy kelp, and a limpet in her mouth and chewed furiously. Why did her parents, and possibly most of their fellow fish keepers, refuse to acknowledge the seriousness of the situation? She couldn’t understand it. It stared them right in the face.\nBut then again, they’d seen things get worse so slowly they might have failed to notice the enormous gap between how things had been eleven years ago and now.\nWould there be any point in talking to other families? Might they have noticed other phenomena that would clarify the situation? She’d better, even if she didn’t think it would yield new info, just to be complete. She needed other points of view. She’d covered weather, water, and fishing. What else? The Paal, their labyrinths, and the fish themselves.\nAfter filling herself up, she clambered out and looked back with a frown. Current, what current? Hadn’t her mom always told her the earth gardens were kept completely separate from the rest of the briny? Sure, the doors kept the fish out. But if there was a current, earth nutrients could get into the ocean. Another strike on the tally of human influence of Knossos’ “natural”, that is, Paal-instigated, processes. Hm. Wouldn’t proliferating bacteria or the kitchen gardens’ waste ruin the terroir?\nShe ran back over the tops of the labyrinth to the main house. It floated over the shadow gardens, where fungi grew. Fish genetics weren’t her first priority, but her sister who could tell her all about it, was right here. She swallowed. Time to face the music.\nThe door opened right after knocking. Havi hadn’t expected that. She stepped inside slowly and coughed.\n“Hey Ivete. How are you doing?”\n“No small talk,” Ivete said. “Just ask your questions.”\nNo truce then. Fish talk first, then the family questions.\n“I’m glad you’re willing to talk to me. Mom just shooed me out. Why are you guys still mad at me? I don’t see choosing a different career path as such a big crime. And what about the shuttle port?”\nIvete took a deep breath. “You can’t let go, can you? Just when I was being the better person, putting business interests over my own feelings. Did you ever think you were making a major impact on my life? That by choosing to leave, you took away my choice?”\nSuch hot waves of anger came off Ivete that Havi almost took a step backward. “I didn’t force you to do anything. If you wanted another career, Mom and Dad would just have had to sell the business. It’s your life. As it’s mine.”\nIvete slammed her hand on the desk. “So hurray, you’re better at withstanding parental pressure than me.”\n“And the shuttle port?”\nIvete shrugged. “I tried to blow up the shuttle port after you left. I was just a kid. Not the port’s fault, I see that now.”\nWhoa. Havi didn’t know what to say. That was a little more than youthful high spirits. She’d never thought about the impact her leaving would have had on Ivete. She still didn’t doubt her right to choose her own life, but she wished she’d been able to support Ivete more.\n“I’m sorry,” she said.\nIvete only huffed.\nHavi took a deep breath. She couldn’t undo this old damage with a single apology. She was going to ask the questions she’d come for. “I’m looking into the mysterious fish behavior and taste. Is there anything interesting about their genetics you can tell me?”\n“Nobody ever asks,” Ivete said. “But yes, I can.”\nShe opened up a tree chart on a large screen. Havi didn’t know what she was looking at until she zoomed in on the top branch. “Skuja” it said.\n“This is what humans found when they landed here.” A struggling fleet of mere thousands, the last survivors of the destroyed Earth, fleeing the Katabiotics.\n“The Paal had engineered the minimalist but still functioning ecosystem, consisting of no more than the fish, several branches of seaweeds, algae, and slime, no more than twenty-three bacteria. That was all. And so far, impervious to human bacteria, viruses, and fungi.”\nHavi thought she understood, even though she didn’t know where this fact was leading.\n“Of course we fish farmers are actively trying to maintain that unique genetic signature, for its flavor. So since the advent of humanity, two hundred years ago, the Fish Migration Guard tracks down and destroys stray fish or shoals. That’s why Osaka Barrier was put up. Me and Dad helped build it.\n“But we can also track the fishes’ genetic history for far longer, even back to when the Paal created them. They made sixty-five unique species, so far less than we have now.\n“Since the origin of these fish, so many hybrids have originated that only a few of the original mixes still exist. The rest is all hybridized. We can tentatively conclude that the Paal intended for hybridization to happen. How they made the fish capable of mating is a fascinating story.”\n“For another day,” Havi said quickly.\n“Or how they made it so that many types of aliens, among others the humans and the Gukke, could eat and enjoy the fish.”\n“Also another day.”\nHavi couldn’t tell from Ivete’s neck if she was disappointed in Havi’s curtailing of her digressions.\n“So do these facts shed any light on what’s going on with the fish?”\nIvete shrugged. “Not that I know of. I’ve sequenced dozens of wrong-tasting fish. They’re all hybrids from existing strains. It’s odd that they are breeding out of season, but well, who knows why?”\n“Isn’t that also biology?”\n“It’s observed behavior, ecology. I’m all about the genetics.”\n“No insights about the labyrinths rising, or the seabed falling? The eddies?”\nIvete looked unconcerned. Why would she pretend that?\nHavi waited. Nothing more was forthcoming from her sister’s averted back.\nIt didn’t feel as if the past issues had been resolved even a little bit.\nHavi sat down at her mother’s desk and fired off messages to universities and researchers. An urgency tugged at her. She couldn’t pinpoint the source of it. After all, the fish scarcity had been going on for months, the gradual rising of the labyrinths for years. There was no rational explanation for her sense of hurry. But her gut was her best guide, so she always took it seriously.\nThe astronomer and the meteorologist reacted the quickest. Sadly, they lived on the other side of the planet, but she made appointments to face-call them. In her career as a journalist, she’d noticed she got a better rapport and more information if she met people in the flesh. Something about the subliminal scents and body language of an actual human being, maybe. The archeologist, who hadn’t replied, was a short hover boat ride away. Havi decided to visit her first, welcome or not.\nShe left a note saying she’d borrowed Ivete’s hover and left. The archaeologist’s floating camp was near the Paal temple she knew so well. People knew so little about the Paal, even after living on Knossos for two hundred years.\nThe platform wobbled as she stepped onto it. A chunky machine sitting on the other edge churbled along quietly. Probably diving equipment. Before long, the tone of the diving monitor changed.\nThe first divers didn’t even notice her sitting there until they’d taken off their helmets and deactivated their suits.\nHavi coughed. “I’d like to speak to Dr. Furuzan?”\nThe oldest of the women stuck up her hand.\n“Hi, I’m Havi Kuja. I’ve been commissioned to look into the past years’ fish troubles. One of the things that stood out was the labyrinth changes. Do you have time to talk to me about that? Is it something you’ve noticed?”\nFuruzan laughed. “Writing about it is the only thing that got me sponsors and students, so yeah.”\n“Did you realize it also had an effect on the fish farms? The fish have changed behavior and taste different.”\n“I heard some rumors, but since we don’t have money for real fish, I didn’t think anything of it. Wow. How interesting. Do you have proof that the two are interrelated?” Furuzan asked.\n“Not scientific proof, no. This is just a preliminary investigation. But it seems pretty unlikely that two such events are coincidental, doesn’t it, after millennia of stasis?”\nFuruzan waggled her head. “We think millennia of stasis. Those few satellite photos we have from the Gukke don’t really prove nothing happened in between. And don’t forget the arrival of humans as agents of change. But I get your point.”\n“So, what can you tell me about the Paal? Why did they build these labyrinths, why they designed this specific ecosystem?”\n“I wish! We don’t even know what they looked like, since the Gukke, who actually met living Paal a couple of thousand years ago, never bothered to film them or preserve the memory.”\n“I’m investigating for the fishing and restaurant industry. Knossos’ economy is going to collapse if the fish problem continues. Anything you can tell me about the Paal and the labyrinths,” Havi said.\n“You probably knew the labyrinths extend several meters down into the soil? So they haven’t been growing. The continents’ seafloor has been slowly sucked out by currents. I have a hunch that the labyrinths have some connection with wind, tides, and currents. The currents in the briny are fueled by massive water vortices in the oceans. Where, as you also were aware, I assume, the labyrinths continue. All over the globe.”\n“Has anyone ever completely charted them?” Havi asked.\n“Not really.”\n“I wonder why the first settlers never bothered to explore further. I would have.”\nFuruzan shrugged. “They were refugees from Earth, fleeing the Katabiotics, probably had lived in cramped ship clouds for generations. They were just happy to find a habitable planet, to be free of the Katabiotics.”\n“So did the Katabiotic aliens also kill the Paal?”\n“We don’t know that the Paal are extinct. We only know they’re gone from this planet. But where they are, all dead, sublimed to another plane of existence, moved to the Magellan Cloud . . . nobody knows.”\nHavi felt a stirring of instinct. Something here. “We have found very few intact planets, haven’t we? Almost all destroyed by the Katabiotics. I wonder why this planet is still here.”\n“Interesting question, but outside my purview. We’re just cataloging the newly accessible labyrinths walls. “\n“Can you show me?” Havi asked. The stirring inside her was fainter now, but it wasn’t gone.\n“Sure. For example, the structure the locals call the temple. Let me show you what it looks like now.” Furuzan gestured to the water, where something triangular stuck up about twenty meters away. It was about ten meters wide and three high. Must be the remnant of the temple.\n“I can’t dive,” Havi said.\n“It’s a short walk and it’s only submerged up to the chest. Well, you’re tall. To the waist.”\nThey balanced over the labyrinth walls and clambered through the temple’s windows into a triangular space that stretched away to its point about fifteen meters away. The stone floor was completely submerged now.\nHavi landed in warm water, slick stone beneath her feet. The slab where she and Dara had not made love was only visible as a disturbance in the water’s gentle eddying.\nThe pictorials on the wall were fuzzier and less deep than she remembered. She moved closer to the left-hand walls. They’d always been called pictorials, she wasn’t sure why. The shapes she saw were abstract and organic, created by thousands of little triangular stones or bricks.\n“Look at the walls, and then at this picture. The reliefs on the wall have moved two millimeters.”\nHavi had already seen it. “I used to hang out in this place all the time. They’ve moved a lot more than two millimeters. The design is completely different.”\nShe waded toward the far wall, where once a beautiful spiraling relief mural had been, and now only faint bumps were visible. The bumps didn’t even make a picture anymore. “Don’t touch it!” Furuzan cried out.\nHavi put her hand on it anyway. She was sure she’d touched the temple walls before and nothing had happened.\nThe wall moved beneath her fingers. The stone sucked at her skin, refusing to let her hand move away.\nHavi yelped in surprise and yanked her hand back. A faint whorl of blood showed in the water before it was washed away by a suddenly stronger current.\n“What’s going on? What does this mean?”\n“I was about to tell you this. The wall moves, it makes patterns. All the labyrinths we’ve seen do. I would guess that all of them are doing that. They react to our presence, and even more so to our touch.”\n“Are the walls alive?” Havi asked, loath to touch them again.\n“I don’t think so, although since they’re alien, who knows. More like automatons, maybe?”\nThe whirr of a hover boat became audible. The briny sloshed through the room.\n“Another visitor?” Furuzan said.\nLight brighter than the day strobed through the narrow window slots of the temple. “This is the police. Come out slowly.”\nThe police? Havi and Furuzan looked at each other. There wasn’t a lot of crime on Knossos, and if there was, it was usually dealt with in-house or in-family.\nHavi clambered out first, squinting against the mega lights.\n“Did you arrive on hover boat DG211?” the augmented voice asked, although the police hover was no more than twenty feet away.\n“Yep, that’s me.”\n“You’re under arrest for theft. Turn your back and hold out your wrists.”\nHavi was too surprised not to comply. It was her family’s boat. She’d left a note. What the hell?\nA person stepped off the hover onto the temple ridge. He clocked handcuffs onto her wrists.\n“Turn.”\nHavi turned. His voice sounded familiar.\nThe lights powered down.\nThe policeman turned out to be Dara.\n“Havi?” he said, sounding a lot less surprised than she felt.\n“Yes. Why am I under arrest? Who called in the boat as stolen? That’s my family’s boat.”\nDara looked sheepish. “Ivete called. She didn’t say it was you.”\nHavi snorted. She believed him about Ivete’s call, but not so much about him not knowing it was her. And how had Ivete managed to pinpoint Dara as the arresting officer, had she called him out of his bed on the neighboring farm or had he just happened to be on duty? But she’d give Dara the benefit of the doubt. Not so much Ivete. “That little idiot. Okay, are you going to take the cuffs off?”\n“I can’t do that. I have to take you to the station now. And process this officially.”\n“Jeezus.”\nHavi sat on a bench in the floating police station, hands cuffed, in growing annoyance. Dara administrated slower than slow, drinking endless cups of fish tea without offering her any. Processing officially her ass.\nThe silence was rudely broken by a raucous blare of sound. “What the hell is that? Turn it off!”\n“That’s a siren. I think. A warning. Emergency.”\n“For what? A storm?”\nDara raked his hands through his hair. “I think we covered this in training. Once. I have to look it up to be sure.”\nHavi saw her chance. “If there’s an emergency situation, you can’t guarantee my safety. You have to release me.”\n“Just wait, okay? I’m looking it up.”\nThe siren continued to grate across Havi’s nerves while Dara, increasingly nervous, browsed through his instruction manuals.\nDara gestured her to his terminal. “I found it. Look. It says it’s a warning against Katabiotic invasion!”\nNews flashes started to scroll across her vision, emergency overrides from her inphone.\n“It’s the wormhole hub. It’s under attack. I can’t believe it. That’s millions of people.” Dara was panting, the whites of eyes showing. How had she ever for a moment considered him handsome fifteen years ago?\n“Dara, get a grip. Untie me. Tell me what to do.”\nDara unlocked her cuffs with shaking hands. “I’m the officer on duty.”\nHavi forced her voice to stay calm. “For this region. Sure. Where is the worldwide headquarters?”\n“Here! I told you!”\n“That can’t be true. How many of you are there?”\n“Seven,” Dara said.\n“For the whole planet?”\nDara started calling up his colleagues, his voice horse.\nHavi stifled her questions. Dara was a bit slow, but he was doing the job.\nAfter that, Dara showed her the information from the police database. “Katabiotic event. Call up oikotekts. (What is an oikotekt?) While you wait for their help to arrive, remember Katabiotic interference is a quantum event. Observe your surroundings continuously, reinforcing their stability.”\nShe read the paragraph out loud. “Do you know what this means?”\n“There was a training exercise. We were standing in a circle and had to keep looking at each other and the room in a figure eight pattern. Very tiring. I got really dizzy.”\n“So how would we do this?”\n“Stand in a circle.”\n“There’s two of us,” Havi said.\n“Um, yes, I guess back-to-back?”\nThey stood back-to-back. In spite of her annoyance at his slowness and nerves, it was reassuring to feel a warm, living human being against her back. His physical solidness grounded her.\n“What’s going on with your colleagues?” she asked.\n“They’re organizing Katabiotic resistance. They need to get these instructions out to everyone.”\nSeven cops for a whole world. Great. Who else could they call on? Of course. Fish Migration Control!\n“Dara, get the same directive to FMC. They have a lot more hovers and warm bodies.”\n“Already did that. Look, Havi. Look at the fish.”\nShe walked to the window. The police station didn’t float over a farm, but the briny was full of glinting fish backs. Thousands of fish, millions of fish, swimming. And not just randomly. Patterns.\nJust like the patterns on the temple wall.\n“Call up the FMC satellite feeds.”\nDara complied. “Zoom in.”\nIt was like looking at a different planet. The fish weren’t swimming around placidly in their local farm labyrinths anymore. They were swarming, circling, spiraling in large-scale patterns. Patterns the size of continents. All the fish must have escaped their farms.\nThere had to be a connection between the incoming Katabiotic attack and the fish behavior. But what?\nHavi remembered Ivete telling her that the fish were conscious beings, about as intelligent as Earth fish had once been. Not very, that meant, but they did have awareness and memory, up to a point.\nNot there yet.\nShe called up the astronomer she’d been about to visit. The woman wasn’t answering. She left an urgent message.\nWithin a minute the astronomer called back.\n“Ms. Skuja, this is a bad time. We’re all observing the skies for signs of the Katabiotics,” the woman said.\n“I’m at Police Headquarters, assisting in the defense effort.” Wow, that came out slick. “We need help. Just a few moments of your time. Explain to me in simple terms about quantum events and observation?”\n“We learned, centuries ago, that if we managed to observe our surroundings intensively enough, or with the right kind of attention, that the Katabiotic changes can’t take place. It’s like Schrödinger’s Cat, once you look in the box, the cat is either dead or not. As long as you don’t look, its state is uncertain. The Katabiotics can only act in the uncertain state.”\n“Is it only human beings who can do this quantum observation?”\nThe astronomer pulled at her chin. “I have no idea. But I don’t see why. A higher animal, like a mammal, would be able to observe whether a cat was dead or not.”\n“Thanks!” Havi hung up.\nThe Paal had built the labyrinths, an unknown but long time ago.\nHavi had always thought of the labyrinths as ruins, remnants of a dead species that had left the planet for its own incomprehensible reasons. But what if the labyrinth wasn’t a ruin of something else, but fish and labyrinth together were a machine, built for a purpose? And something had triggered that purpose?\n“The fish are defending us,” she told Dara, who was still diligently observing his surroundings in a figure eight pattern.\n“What?”\n“Don’t stop. The fish observe the planet. That’s why this planet is the only one in the whole region that is still intact. It’s the fish. It’s a fish defense system.”\nDara giggled.\nHavi slapped him. “Focus. Dara, focus. Zoom out from that satellite feed. We need to check on the fish. If they’re covering everywhere.”\nA quick glance at the other four continents showed that the fish patterns seemed intricate and smoothly flowing. It was a different story on Continent Five. In the middle of the continent a large break showed in the pattern. “What is that?”\n“Osaka Barrier,” Dara said. “Completed five years ago.”\nHavi knew what to do. “It’s the barrier. It’s ruining the fish flow. We have to blow it up. Come on, Dara.”\n“What? No. We can’t. It’s against the law. That’s people’s livelihoods.”\n“Those people would complain even more if the planet started breaking up because the physical constants of the universe had changed. Remember what happened to Earth? We all watched the video!”\nDara scratched his head. “But . . . ”\n“Whatever. Come.”\n“No. I’m not destroying an important structure on your say-so. My duty is here, leading the defense efforts.”\nHavi wanted to slap him again.\n“Give me the keys to Ivete’s boat then. I have to do this.”\nShe jumped on board the hover boat and set course toward the barrier It had become night and all three of the moons were out. Baby, Blue Moon, and Glarus, also known as the Big Green Cheese. Their rainbow light glinted off the billions of shiny fish backs coursing through the water. The boat hovered not over the briny, but over a solid carpet of glistening fish spines. Beautiful.\nShe couldn’t do this alone, though. She didn’t know a thing about explosives or how to destroy large man-made structures. Shit. There was only one person she could call.\nHer fucking annoying little sister.\n“Hey Ivete, it’s me. I need your help.”\n“Yeah right. How’s the police station treating you?”\n“That was pretty annoying. I admit that. But now there’s an emergency and I need your help. You know how to blow up stuff,” Havi said.\n“What? No.”\n“Yes you do. You said you and Dad helped build the barrier. Blew up part of the labyrinths there.”\n“Okay, that, yes.”\n“Gather up your blowing-up stuff and meet me at the dock. I’m on my way.”\nA long silence ensued. Havi imagined Ivete wrestling between a desire to blow stuff up and the one to frustrate her big sister. Maybe there was a smidgen of helpfulness in there too, but Havi wasn’t counting on that.\n“Okay. I’ll be there. If you promise to stay.”\n“No! Are you crazy? I have a career. I can’t just ditch that and go back to fish farming.”\n“Okay, fine, then no help with explosives,” Ivete said.\n“I will stay a month.”\n“Six.”\n“Two. Final offer.”\n“Three or it’s no deal.”\nGrinding her teeth, Havi promised three. Why did Ivete even want this if she was so angry at Havi?\nHavi turned the hover to swing by the family farm.\nIvete was actually there, with several crates and bulging bags. And a girl Havi didn’t know, who was briefly introduced as Ari, the girlfriend.\nThe supplies were loaded and Havi raced off again, toward the barrier.\n“What are we blowing up?” Ivete asked.\nHavi grinned at her. “You’re only asking that now? Who are you?”\n“Nobody you know anymore.”\nThat stung. But maybe she was right.\n“I’m sorry I stayed away so long, little sis.”\nIvete didn’t react. Too little, too late?\n“Okay, it’s Osaka Barrier. It’s obstructing the Paal defense system.” Havi said.\nAri cursed.\nIvete said nothing for a while. “Will it help against the Katabiotics?”\n“Yeah.”\n“Malala hub is breaking up as well, did you read that?” Ari said. “Who’s gonna buy our fish now? If there’s no hub . . . ”\n“We’ll worry about that later.”\nThe boat skipped over the swarming fish backs in a straight line, illuminated only by the three moons. The fish weren’t swimming in patterns here but teeming and churning chaotically. Havi tried to ride faster, but she was at maximum speed already.\nShe swung the boat into a neat halt at one the barrier’s floating connectors. “We have to hurry. The Katabiotics’ effect could be here any moment. Do you know the weak points of the barrier?”\nThe girls shook their heads. Of course not. Why would they?\nHavi cracked her knuckles. She was information girl. “You girls get the charges set up while I find out where to put them.”\nApparently, lots of people wanted to blow up stuff. Or no. All the dates on the articles were like hundreds of years old. But it should be relatively easy to blow up the support structure to the deep but lightweight barriers that blocked off Continent Five’s farm outlets.\nHavi walked up to where Ivete and her girlfriend were connecting detonators to packs of explosives. Ivete looked suspiciously adept at this. She probably had had a lot more practice than on the construction. Who was Ivete? Did Havi even know her? Why had Ivete blackmailed Havi into staying at the farm? Baffling.\nA tremor rocked the structure.\n“What was that? Did you start already?”\nIvete looked spooked. “No. That was something else. Is it the aliens?”\nWhat else could it be? Instinctively, Havi looked up at the moon. There was a black stripe across Green Cheese. What the hell? Suddenly it clicked. Not a stripe, but a chasm. Green Cheese was breaking up. Havi was no physicist, but she imagined a chunk of moon falling down would wreak immense havoc. Earthquakes. Tidal waves.\n“We have to hurry. This is the vulnerable spot. Even if the rest of the planet is safe, if this part breaks down, we’re all doomed. We have to get those fish in here!”\n“You’re talking gibberish. I trusted you so far, but this is weird. What have fish got to do with alien attacks?”\n“A lot more than you’d think. I’ll explain later. Let’s get out of here.”\n“If we blow up the barriers, won’t we kill a lot of fish?” Ivete asked.\nHavi gestured to the millions of shiny fish backs swirling against the barriers. “Maybe some, but these will rush in to take their place.”\nThe hover took off at speed.\n“How far?” Ivete cried.\n“I don’t know! A couple of kilometers? Hurry.”\nIvete touched a secret button under the dash and the hover’s speed tripled. Havi was pushed back against the seat, “Far enough?”\nThe crack in the moon grew wider. Havi didn’t dare wait any longer.\n“Go! Set them off! Explode the stuff!” she cried.\nAri pressed the detonator with a big grin on her face.\nA series of bright sparks set off. An ear-shattering boom sounded. Seconds later, a big wave slammed them all against the hover’s deck.\n“Jeezus,” Havi groaned. “Everybody all right?” Everything hurt. Especially her ribs.\nTwo separate groans answered her. At least they were alive. She managed to crack open an eye and found herself draped over the hover’s steering wheel. Hadn’t Ivete been driving?\nOnce she’d unpeeled herself from the dashboard, many of the pains lessened, but not the one in her ribs. She groaned. That made the pain worse.\nHad it worked? Had they set the fish free? She crawled to the hover’s side and peered over the railing. Yes! The moonlight, strangely flat for this time of night, glinted off fish scales, orderly swimming in a micro version of the patterns that were only visible from orbit.\nDid this mean the planet was safe now? Havi could do nothing about Malala wormhole hub, but down here she’d done all she could. She carefully rolled over on her back, landing on someone’s belly or thigh, and checked out Glarus Moon. The crack was still there, but it hadn’t grown any bigger. Maybe its internal gravity would pull it back together now that the outside influence was neutralized? She’d hate to have her late nights without Green Cheese to complete the rainbow.\nShe didn’t know what to do about a moon that might still be falling apart. But she bet someone else would, now that it was plainly visible in the sky. No need for investigative reporting anymore.\nShe moved her sore head to a softer spot on the other person’s body.\n“Watch it, sis. I’m bruised there.”\nHavi smiled. Sisters.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "source": "https://clarkesworldmagazine.com/balder_05_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Quantum Fish by Bo Balder"}