{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert Reed", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "alVAJyBugeoQSrd0pYcv04LJ4eI=", "id": null, "license": null, "comments": "", "raw_text": "3830 words, short story  Pack  He was standing in front of my castle, watching windows. When I came out, he bent down low, mouth to the plastic grass, and asked if he could stay.  “I can help you,” he said.  “Except you’re just a dog,” I pointed out.  “That’s not a nice word,” he said.  “Fuck you,” I told him.  He stood up. He watched me. Then again, as if for the first time, he said, “I can help you.”  “Get lost, dog.”  But he retreated only so far. He was afraid of me but very skinny and I couldn’t help but feel for his situation. Fucking dog.  I went inside. Sometimes I watched him lurking. Sometimes I forgot about him. Then I came outside, on a different day, and another dog was standing in the open. This one was bigger, stronger. He had a weapon. Well, I have weapons too. I have a castle and tech, and I wasn’t going to show him that I was scared.  He aimed at me, grumbling under his breath.  A bullet can’t pierce armor, but it takes courage, waiting to be shot. I pulled courage out of my reserves. Then came a soft pop and the new dog fell sideways, and out from a hiding place came the other day’s dog. He was even skinnier than before. His weapon filled one bony hand. He walked up to the shot dog and shot him again, in the skull, and he took up the larger weapon. He was smiling until he looked at me. Then with a hard face and stern voice, he said, “You don’t have to thank me.”  I watched him slowly drag the dead dog into the trees. What he did with the body was none of my business. I didn’t want to waste my courage needlessly.  Indoors again, I finished my day’s work and had some fun, keeping my mind away from the subject of dogs.  But after dinner, I gathered up my extra food. The cultivators always produce too much. So it wasn’t really a gift that I left on the plastic lawn. I was throwing away the mock-beef and noodles, and if beasts and dogs came out from the trees to fight over the trash, it wasn’t my business.  I slept well that night.  I always sleep well.  Three days passed before the dog reappeared. He was heavier. He walked with confidence. Maybe that’s how he always walked, but I found him more appealing now. Success does that.  “You should own me,” he said.  I said, “No.”  “Oh, I’m sorry,” he said, laughing in a dog’s fashion. “Do you think you have any choice in this matter?”  I walked my grounds, and he watched from a distance. I went inside and after five days came out, dragging a sack of scraps. I watched for him but couldn’t find him. I stood at the edge of the forest, looking between the drought-ravaged trees. I didn’t miss the dog. I felt lonely for other reasons. The rest of my day was spent with friends across the world. Sharing time with friends made me feel better. When night came I looked outside. A dog wearing antique camouflage was huddled over the garbage, gulping down the feast.  It is heartening, witnessing any creature’s survival against long odds.  I went to bed and slept hard.  In the morning, there were two dogs. The new dog was a pregnant bitch, which was bothersome. She was small and too young to be pregnant. Understanding her own miserable circumstances, she knelt down before me. “You have tools,” she said. “Please, please cut the seed out of my belly.”  I did nothing of the kind.  For the second day in a row, I left food on the bright blue-green lawn.  But scraps were not a daily occurrence and there were weeks when I didn’t see either of them. The pup was born somewhere in the woods. It had a sorry weepy voice, and it was another mouth, and even then I could have put it past all suffering. Who would stop me? But I didn’t manage that kindness earlier, and this would prove even harder, and besides, the mother seemed to be treating it well enough.  I don’t know exactly when the fourth dog arrived. But he resembled the first other male, only younger. I assumed they were related. I heard them calling each other, “Brother,” but I didn’t care enough to ask. Yet I accepted that new mouth, and because it cost me nothing, I threw out rags and other trash that were accepted without thanks or hesitation.  Winter came. For a time there were as many as eight or nine dogs. My dogs always came out of the forest first, the others trailing behind. I grew accustomed to the different faces and voices and how they quarreled over the rations that I had no intention of increasing any farther.  Generosity always has limits.  When the weather softened, I went outside, sometimes for long periods. Only five dogs remained—the brothers and young mother, her perpetually tiny baby and an old gray bitch.  In that halting, frustrating way you use with dogs, I spoke to my favorite.  “What happened to the others?” I asked.  “We took care of them for you,” he said.  “For me,” I said.  “This is how we help,” he said. “You don’t see half of what we do for you.”  I wasn’t sure what he had accomplished. I certainly didn’t care about the missing dogs. Changing topics, I said, “At least the winter is finished.”  He laughed about something. He said, “Nothing is ever finished.”  There are people who claim to understand dogs. I don’t make those claims.  Bowing toward the ground, he said, “I am yours, master.”  That gesture and those bold words were exceptionally pleasant. “You certainly are mine,” I said.  Then he got up again and said, “But don’t throw curses at me.”  “I would never do that,” I said.  “You have,” he said.  I didn’t remember.  “When we first met,” he said. Then he stepped closer to me, looking at my visor and my eyes. Naming a precise date and time, he said, “Check your security digitals. Jog your memory. And never again use that word against me.”  So much of this moment was worrisome. I did what he wanted while we stood face to face, and I fed myself all types of courage.  The unfortunate incident was waiting to be found.  “No more curses,” I promised.  And once again, he bowed. But not as deeply, and then when his face lifted, he told me, “I am yours, and you have no choice now.”  I have excellent friends as well as highly placed cohorts and acquaintances. A small number keep dogs. A few of those refer to theirs by name, sharing emotional moments where the expense and hazards are paid back in full. But I kept my situation mostly secret. One time I mentioned that I had a pack living nearby and that I rather enjoyed watching them fight over my garbage. Several voices warned about vague dangers. But when I asked for specifics, nobody could piece together a reasonable scenario. I had a castle and tech and armor and courage, my own courage and all the other kinds tailored for specific occasions. But perhaps best of all, I had no illusions about my expertise when it came to murderous wild animals. I knew nothing about them, and I never felt at ease among them.  My dog never asked what I did to earn my property, my station, but I told him anyway. He watched me at the beginning of the story and then watched the horizon, nothing in his face betraying interest. But that attitude was a blessing. I wasn’t trying to impress, which was why I could continue talking for many minutes. My life was large and important, washing up against that ignorant beach. Then at some point he looked back at my visor, my eyes, and he said, “I have three more brothers. They can’t survive in the mountains anymore and they’re coming here.”  “A visit would be fine,” I said.  He said, “No.” His voice was both firm and sorry. When did I begin reading emotions in that voice? “They aren’t good dogs,” he told me. “Brothers or not, they’ve done horrible things, particularly to my wife and me, and I don’t want anything to do with them.”  He had an agenda. It was easy to see what he wanted. I thought for a long while—which was a few moments to him—and then offered what he probably couldn’t do for himself. Not to his own brothers, no.  He looked at the sky above my head. “Have you killed dogs before?” he asked.  “Yes,” I lied.  The toothy smile was very bright. “We’re easy to kill,” he said.  “You are,” I said.  “Except when ghosts are involved,” he added. “Murdering your own siblings is a good way to put a curse on you and yours.”  I had never spoken to a superstitious creature before. This was unexpected fun. “When will your brothers arrive?” I asked.  “How would I know? I’m a dog,” he said.  As it happened, they arrived soon afterwards. I was asleep when the three brothers walked onto my lawn in the moonlight, approaching the two males that I already knew. A terrible fight erupted over the day’s garbage and perhaps older crimes too. The shooting woke me. I looked out a high window to find the young good brother on the ground, his bloody face pressed into the plastic grass. My dog was beside him, on his knees and praying loudly to some fatherly god. Two of the invading brothers had walked into the trees, presumably to find and hurt the two females. The last brother was standing over my dog, slapping at those praying hands with a long polished stick.  I killed him neatly.  Or rather, the castle unleashed one of its talents.  But then my dog rose to his feet, breaking into sobs. And his little brother stood, holding his bloody nose while screaming at me.  “No no no,” said my favorite dog. “Our feud is finished. You don’t need to kill anybody now.”  The littlest brother was even more furious, cursing at me until gasping for breath.  I felt nothing, and then I felt terrible.  “What were you thinking?” asked my favorite dog.  I knew exactly what I was thinking. Would he like to see the record?  “Fuck you,” he said.  Apparently the stricture against cursing ran only one way. I mentioned this, and he cursed me again.  Finally I said, “All right. I’ll feed the living brothers.”  “And their families,” said my dog.  “For one month,” I said.  “And my relatives,” he insisted.  “Yes.”  Counting mates and widows, plus the various-aged pups, there were twenty-nine dogs in my suddenly enormous pack. Watching the menagerie walk across the moonlit grass, my wrenching guilt was transformed into self-scolding disgust. As surely as I knew my castle’s seven rooms, I understood how I looked to these creatures. I was the fool, malleable and too trusting. The fool decided to teach them who was in charge. But I had already killed one dog tonight, and so I set my cultivators to build rough, barely edible rations, and my little revenge lasted until the older pups began crapping foul brown water up and down my poor lawn.  It was summer, very hot and exceptionally dry. The last of the forest trees had died, but the dogs were being careful with their fires. The forest was pale and dusty but lovely in a fashion, and I said as much.  My dog nodded for a moment, his eyes following mine.  “What are you thinking?” I asked.  Sometimes he surprised me with his answers.  “I was thinking about empires,” he said. “Did you know? The greatest empire ever began by drinking wolf’s milk.”  “That’s an interesting perspective,” I said.  “Do you know which empire?” he asked.  “Rome,” I said. “Romulus and Remus.”  I was standing, he was sitting. He turned to look at me and to show me his face. He wore a serious expression. Maybe it was my imagination, but he seemed mildly disappointed with my answer.  The rest of the pack was huddled inside shelters made from dead timber. The shelters were my idea and they mostly followed my designs. The promised month of feedings was passed, but I continued with the gifts. More important, I shared the water condensed from the already desiccated winds. The older pups liked to thank me. My dog said very little on the subject, but his pack was surviving where other dogs couldn’t. He told stories about what was happening in the mountains and elsewhere, naming dogs and then describing their miserable deaths. He seemed nothing but cheerful that he and his own were enduring when the rest of the dog world was mortally wounded.  He looked away again, thinking.  His mind was very slow, but focused.  After a long pause, he turned back to me. He spoke to my boots, asking, “What are you thinking?”  There was no possible answer. A dog would grow old and die before I could perfectly reproduce my thoughts inside any one moment.  But of course he knew that.  “I’m thinking about history,” I said, which was true enough. “Right now, I’m making a study of the Roman centuries.”  He watched the lawn.  I watched him.  Maybe he felt my stare. Maybe he was planning to stand anyway. Whatever the reason, he got to his feet and picked up the gun that fit so naturally into either hand, and looking at my face again, he said, “Half of us are leaving at dusk. We’ll be gone for six or seven nights.”  He never told me news like this.  “Where are you going?” I asked.  “We know some weak dogs,” he said.  I said, “Oh.”  Then he laughed, and not softly. He laughed and with that confident stride began walking away.  “I was raised on wolf blood,” my dog said. “I am a great wolf, and the empire begins right here.”  The males wore camouflage and took their best weapons and most of their ammunition. But they didn’t return in six days, or seven. Or in ten. Eleven nights without their men made the females sick. I listened to the wailing and fighting. They would beat their offspring with little provocation. One of them came up to the castle. She was the very young one, my dog’s favorite mate. She tried to talk to me. I didn’t respond. She squatted and told my walls how scared she was, how sad and lonely she was, and to prove some or all of those feelings, she began doing things with her hands, her grimy little fingers.  I watched because I was curious.  Her sick pleasure meant something to me. I wasn’t certain what, but afterwards, as she walked away from my walls, I felt pity for her, and deeper than that, I discovered worry for the dog that was so deeply missed.  The oldest pups served as guards, day and night. On the fourteenth night, when there was no moon and the stars were obscured by high dust, one of the pups saw strange males approaching. She gave the warning to the camp, and every mother grabbed up the littlest ones and urged the others to run for the castle.  I expected this, which is to say that I considered many scenarios about what might happen and how each playing piece would respond. All of these pieces gathered close to the invincible walls, begging for help. Different voices wanted different kinds of help. The females wanted to be let inside, which was impossible. The immature males wanted my weapons turned on the invaders, which was somewhat more likely. Reaching into the darkness, my senses found five males heavily cloaked inside stolen tech. They were dogs, but the tech was not. This was another scenario that I had imagined, but rarely and never with any sense of urgency.  I put on my armor and absorbed a great share of courage.  My dogs scattered when the outer door opened, and then too slow by a long step, they were blocked from slipping inside when the doors closed and sealed.  I stood among the pack, watching the invaders moving closer.  Each of these creatures had a name. I knew them by sight and by voice. They were strange pitiful and yet lovely, and of course I would protect them now.  I walked across the plastic grass.  A dog emerged from the dead forest.  I could have killed him but hesitated. I don’t know why I hesitated. Then the cloaks fell away and I saw that he was my dog, safe and home again. Such a wave of relief shook me, leaving me weakened. I could have killed him. I nearly did. Maybe that’s why I wept as he started talking to me.  “What a fucking mess,” he said. “There’s a clan living up in the mountains. A bunch of real assholes, which we knew going in. But I didn’t realize they had a friend, and I had no idea how close she was to them.”  “What kind of friend?” I asked.  He stared straight at me.  “Where did you get the tech?” I asked.  “Stole it.” Then with a sorrowful laugh, he said, “That’s our little ray of hope in this disaster. Some new machinery.”  “You stole the tech from their friend,” I said.  “She’s a monster,” he said.  I didn’t say anything.  “We need help,” he said. “You probably know the friend already.”  “Who is she?” I asked.  He gave me specific directions.  “No, I don’t know her,” I said.  “But her castle is so close,” he said.  I tried to explain. There are different measures of proximity.  But he grew bored and interrupted me. “Whatever,” he said. “With your help, we can kill that damned clan. At least the big boys die, and then we can grab up their girls and come back here again.”  Two of his brothers emerged from the forest. But the youngest brother had died or been left behind.  My dog watched me. Then with a slow, careful voice, he said, “You won’t help us, will you?”  “I help you all the time,” I said.  “You won’t go on the fight with us.”  “No.”  “But you don’t even know this other one. So what does it matter?”  I tried to explain why it mattered.  “Listen to yourself,” he said.  I said, “If the bad pack comes here, I’ll defend you. But that is as much as I am willing to do.”  My dog stared at my armored chest.  The rest of the pack did the same.  “Well,” my dog said at last. “At least you’re telling us where you stand.”  I fed them double shares and gave them all of my water while sending a message to my neighbor on the other side of the mountains, saying nothing overt but offering to discuss mutual issues.  She responded by saying that she didn’t know me and to leave her alone.  I left her alone.  For the rest of that evening and two more nights, nothing happened. Nothing changed. I fed my dogs everything they could eat and more, and the second pack didn’t appear, but then the afternoon sun was swallowed by black clouds of dust and even with the best tech it was difficult to see. Peering into the gloom, I suffered glimpses of motion and odd shapes, and then a series of sharp little explosions. Suddenly my dog appeared, running to the door and pounding with both hands.  “Let us in,” he begged.  I wanted to let him inside, but only him.  “We’re dying out here,” he said.  I was already wearing my armor. But I couldn’t see any threat, which was why I stayed indoors.  “Do you hear me?” he asked.  He knew that I did.  “Master,” he said. “They are coming for us.”  I couldn’t see any new faces, but the dead woods began to burn. A dozen little fires consumed the dried underbrush and the trees, joining into one mighty blaze, and the filthy wind blew smoke and ash across the lawn. Pups were running back and forth. Naked, the young mother ran to my door, her little pup screaming in agony. She screamed too. “Forget him and run away,” she said.  “No,” my dog said.  “We’re going,” she said.  “He’ll help us as soon as he puts on his armor,” my dog said.  My armor was ready, but I was scared. My mind was not suited to moments like these. If I used every bit of courage in my inventory, I would still feel scared, and that’s why I did nothing and remained silent.  The mother and her baby left.  My dog sat before the door. I had never seen him weep before. He had been stripped of his dignity. But the fire soon burnt itself out and the dust storm eventually passed, leaving nothing but ruin and my dog.  Armed with several comforting phrases to make both of us feel better, I stepped through the doors.  He looked everywhere but at my face.  I began to talk.  “Shut up,” he said.  “All right,” I said.  Then he began to laugh—quietly yet with rage—and taking relish in the words, he said, “This has all been a test, you know. From the first day we met, even the tiniest event was part of a great plan.”  I asked, “Whose plan?”  “Not yours.” The laugh grew louder. “Stay outside or go run back into your little house. Either way, you lose.”  It was a rare feeling, a strangely wondrous feeling, having no understanding about what was happening.  He finally looked at me, just for a moment. Then he stood and backed away several steps while various kinds of tech were turned off. The blackened lawn was covered with dogs, mature and heavily armed. The big dog that my dog seemingly killed last year was alive again. The missing younger brother had returned, healthy and still angry. It occurred to me that the one that I killed was never a brother, just another fool caught up in this elaborate scheme.  The enormous pack was marching toward me.  I fled inside, secured the doors and consumed every form of courage, but before the illusionary sense of security could take hold, the “monster” neighbor woman walked out from her hiding place.  She wasn’t wearing armor.  Indeed, she wore almost nothing. Boots suitable for long hikes rode the otherwise naked legs, and her exposed chest was burnt scarlet by the sun, and strung around her neck was a steel collar adorned with savage barbs—good steel polished until it shone, but only half as bright as the radiant smile that crushed the last hope in my world. Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "text": "3830 words, short story\nPack\nHe was standing in front of my castle, watching windows. When I came out, he bent down low, mouth to the plastic grass, and asked if he could stay.\n“I can help you,” he said.\n“Except you’re just a dog,” I pointed out.\n“That’s not a nice word,” he said.\n“Fuck you,” I told him.\nHe stood up. He watched me. Then again, as if for the first time, he said, “I can help you.”\n“Get lost, dog.”\nBut he retreated only so far. He was afraid of me but very skinny and I couldn’t help but feel for his situation. Fucking dog.\nI went inside. Sometimes I watched him lurking. Sometimes I forgot about him. Then I came outside, on a different day, and another dog was standing in the open. This one was bigger, stronger. He had a weapon. Well, I have weapons too. I have a castle and tech, and I wasn’t going to show him that I was scared.\nHe aimed at me, grumbling under his breath.\nA bullet can’t pierce armor, but it takes courage, waiting to be shot. I pulled courage out of my reserves. Then came a soft pop and the new dog fell sideways, and out from a hiding place came the other day’s dog. He was even skinnier than before. His weapon filled one bony hand. He walked up to the shot dog and shot him again, in the skull, and he took up the larger weapon. He was smiling until he looked at me. Then with a hard face and stern voice, he said, “You don’t have to thank me.”\nI watched him slowly drag the dead dog into the trees. What he did with the body was none of my business. I didn’t want to waste my courage needlessly.\nIndoors again, I finished my day’s work and had some fun, keeping my mind away from the subject of dogs.\nBut after dinner, I gathered up my extra food. The cultivators always produce too much. So it wasn’t really a gift that I left on the plastic lawn. I was throwing away the mock-beef and noodles, and if beasts and dogs came out from the trees to fight over the trash, it wasn’t my business.\nI slept well that night.\nI always sleep well.\nThree days passed before the dog reappeared. He was heavier. He walked with confidence. Maybe that’s how he always walked, but I found him more appealing now. Success does that.\n“You should own me,” he said.\nI said, “No.”\n“Oh, I’m sorry,” he said, laughing in a dog’s fashion. “Do you think you have any choice in this matter?”\nI walked my grounds, and he watched from a distance. I went inside and after five days came out, dragging a sack of scraps. I watched for him but couldn’t find him. I stood at the edge of the forest, looking between the drought-ravaged trees. I didn’t miss the dog. I felt lonely for other reasons. The rest of my day was spent with friends across the world. Sharing time with friends made me feel better. When night came I looked outside. A dog wearing antique camouflage was huddled over the garbage, gulping down the feast.\nIt is heartening, witnessing any creature’s survival against long odds.\nI went to bed and slept hard.\nIn the morning, there were two dogs. The new dog was a pregnant bitch, which was bothersome. She was small and too young to be pregnant. Understanding her own miserable circumstances, she knelt down before me. “You have tools,” she said. “Please, please cut the seed out of my belly.”\nI did nothing of the kind.\nFor the second day in a row, I left food on the bright blue-green lawn.\nBut scraps were not a daily occurrence and there were weeks when I didn’t see either of them. The pup was born somewhere in the woods. It had a sorry weepy voice, and it was another mouth, and even then I could have put it past all suffering. Who would stop me? But I didn’t manage that kindness earlier, and this would prove even harder, and besides, the mother seemed to be treating it well enough.\nI don’t know exactly when the fourth dog arrived. But he resembled the first other male, only younger. I assumed they were related. I heard them calling each other, “Brother,” but I didn’t care enough to ask. Yet I accepted that new mouth, and because it cost me nothing, I threw out rags and other trash that were accepted without thanks or hesitation.\nWinter came. For a time there were as many as eight or nine dogs. My dogs always came out of the forest first, the others trailing behind. I grew accustomed to the different faces and voices and how they quarreled over the rations that I had no intention of increasing any farther.\nGenerosity always has limits.\nWhen the weather softened, I went outside, sometimes for long periods. Only five dogs remained—the brothers and young mother, her perpetually tiny baby and an old gray bitch.\nIn that halting, frustrating way you use with dogs, I spoke to my favorite.\n“What happened to the others?” I asked.\n“We took care of them for you,” he said.\n“For me,” I said.\n“This is how we help,” he said. “You don’t see half of what we do for you.”\nI wasn’t sure what he had accomplished. I certainly didn’t care about the missing dogs. Changing topics, I said, “At least the winter is finished.”\nHe laughed about something. He said, “Nothing is ever finished.”\nThere are people who claim to understand dogs. I don’t make those claims.\nBowing toward the ground, he said, “I am yours, master.”\nThat gesture and those bold words were exceptionally pleasant. “You certainly are mine,” I said.\nThen he got up again and said, “But don’t throw curses at me.”\n“I would never do that,” I said.\n“You have,” he said.\nI didn’t remember.\n“When we first met,” he said. Then he stepped closer to me, looking at my visor and my eyes. Naming a precise date and time, he said, “Check your security digitals. Jog your memory. And never again use that word against me.”\nSo much of this moment was worrisome. I did what he wanted while we stood face to face, and I fed myself all types of courage.\nThe unfortunate incident was waiting to be found.\n“No more curses,” I promised.\nAnd once again, he bowed. But not as deeply, and then when his face lifted, he told me, “I am yours, and you have no choice now.”\nI have excellent friends as well as highly placed cohorts and acquaintances. A small number keep dogs. A few of those refer to theirs by name, sharing emotional moments where the expense and hazards are paid back in full. But I kept my situation mostly secret. One time I mentioned that I had a pack living nearby and that I rather enjoyed watching them fight over my garbage. Several voices warned about vague dangers. But when I asked for specifics, nobody could piece together a reasonable scenario. I had a castle and tech and armor and courage, my own courage and all the other kinds tailored for specific occasions. But perhaps best of all, I had no illusions about my expertise when it came to murderous wild animals. I knew nothing about them, and I never felt at ease among them.\nMy dog never asked what I did to earn my property, my station, but I told him anyway. He watched me at the beginning of the story and then watched the horizon, nothing in his face betraying interest. But that attitude was a blessing. I wasn’t trying to impress, which was why I could continue talking for many minutes. My life was large and important, washing up against that ignorant beach. Then at some point he looked back at my visor, my eyes, and he said, “I have three more brothers. They can’t survive in the mountains anymore and they’re coming here.”\n“A visit would be fine,” I said.\nHe said, “No.” His voice was both firm and sorry. When did I begin reading emotions in that voice? “They aren’t good dogs,” he told me. “Brothers or not, they’ve done horrible things, particularly to my wife and me, and I don’t want anything to do with them.”\nHe had an agenda. It was easy to see what he wanted. I thought for a long while—which was a few moments to him—and then offered what he probably couldn’t do for himself. Not to his own brothers, no.\nHe looked at the sky above my head. “Have you killed dogs before?” he asked.\n“Yes,” I lied.\nThe toothy smile was very bright. “We’re easy to kill,” he said.\n“You are,” I said.\n“Except when ghosts are involved,” he added. “Murdering your own siblings is a good way to put a curse on you and yours.”\nI had never spoken to a superstitious creature before. This was unexpected fun. “When will your brothers arrive?” I asked.\n“How would I know? I’m a dog,” he said.\nAs it happened, they arrived soon afterwards. I was asleep when the three brothers walked onto my lawn in the moonlight, approaching the two males that I already knew. A terrible fight erupted over the day’s garbage and perhaps older crimes too. The shooting woke me. I looked out a high window to find the young good brother on the ground, his bloody face pressed into the plastic grass. My dog was beside him, on his knees and praying loudly to some fatherly god. Two of the invading brothers had walked into the trees, presumably to find and hurt the two females. The last brother was standing over my dog, slapping at those praying hands with a long polished stick.\nI killed him neatly.\nOr rather, the castle unleashed one of its talents.\nBut then my dog rose to his feet, breaking into sobs. And his little brother stood, holding his bloody nose while screaming at me.\n“No no no,” said my favorite dog. “Our feud is finished. You don’t need to kill anybody now.”\nThe littlest brother was even more furious, cursing at me until gasping for breath.\nI felt nothing, and then I felt terrible.\n“What were you thinking?” asked my favorite dog.\nI knew exactly what I was thinking. Would he like to see the record?\n“Fuck you,” he said.\nApparently the stricture against cursing ran only one way. I mentioned this, and he cursed me again.\nFinally I said, “All right. I’ll feed the living brothers.”\n“And their families,” said my dog.\n“For one month,” I said.\n“And my relatives,” he insisted.\n“Yes.”\nCounting mates and widows, plus the various-aged pups, there were twenty-nine dogs in my suddenly enormous pack. Watching the menagerie walk across the moonlit grass, my wrenching guilt was transformed into self-scolding disgust. As surely as I knew my castle’s seven rooms, I understood how I looked to these creatures. I was the fool, malleable and too trusting. The fool decided to teach them who was in charge. But I had already killed one dog tonight, and so I set my cultivators to build rough, barely edible rations, and my little revenge lasted until the older pups began crapping foul brown water up and down my poor lawn.\nIt was summer, very hot and exceptionally dry. The last of the forest trees had died, but the dogs were being careful with their fires. The forest was pale and dusty but lovely in a fashion, and I said as much.\nMy dog nodded for a moment, his eyes following mine.\n“What are you thinking?” I asked.\nSometimes he surprised me with his answers.\n“I was thinking about empires,” he said. “Did you know? The greatest empire ever began by drinking wolf’s milk.”\n“That’s an interesting perspective,” I said.\n“Do you know which empire?” he asked.\n“Rome,” I said. “Romulus and Remus.”\nI was standing, he was sitting. He turned to look at me and to show me his face. He wore a serious expression. Maybe it was my imagination, but he seemed mildly disappointed with my answer.\nThe rest of the pack was huddled inside shelters made from dead timber. The shelters were my idea and they mostly followed my designs. The promised month of feedings was passed, but I continued with the gifts. More important, I shared the water condensed from the already desiccated winds. The older pups liked to thank me. My dog said very little on the subject, but his pack was surviving where other dogs couldn’t. He told stories about what was happening in the mountains and elsewhere, naming dogs and then describing their miserable deaths. He seemed nothing but cheerful that he and his own were enduring when the rest of the dog world was mortally wounded.\nHe looked away again, thinking.\nHis mind was very slow, but focused.\nAfter a long pause, he turned back to me. He spoke to my boots, asking, “What are you thinking?”\nThere was no possible answer. A dog would grow old and die before I could perfectly reproduce my thoughts inside any one moment.\nBut of course he knew that.\n“I’m thinking about history,” I said, which was true enough. “Right now, I’m making a study of the Roman centuries.”\nHe watched the lawn.\nI watched him.\nMaybe he felt my stare. Maybe he was planning to stand anyway. Whatever the reason, he got to his feet and picked up the gun that fit so naturally into either hand, and looking at my face again, he said, “Half of us are leaving at dusk. We’ll be gone for six or seven nights.”\nHe never told me news like this.\n“Where are you going?” I asked.\n“We know some weak dogs,” he said.\nI said, “Oh.”\nThen he laughed, and not softly. He laughed and with that confident stride began walking away.\n“I was raised on wolf blood,” my dog said. “I am a great wolf, and the empire begins right here.”\nThe males wore camouflage and took their best weapons and most of their ammunition. But they didn’t return in six days, or seven. Or in ten. Eleven nights without their men made the females sick. I listened to the wailing and fighting. They would beat their offspring with little provocation. One of them came up to the castle. She was the very young one, my dog’s favorite mate. She tried to talk to me. I didn’t respond. She squatted and told my walls how scared she was, how sad and lonely she was, and to prove some or all of those feelings, she began doing things with her hands, her grimy little fingers.\nI watched because I was curious.\nHer sick pleasure meant something to me. I wasn’t certain what, but afterwards, as she walked away from my walls, I felt pity for her, and deeper than that, I discovered worry for the dog that was so deeply missed.\nThe oldest pups served as guards, day and night. On the fourteenth night, when there was no moon and the stars were obscured by high dust, one of the pups saw strange males approaching. She gave the warning to the camp, and every mother grabbed up the littlest ones and urged the others to run for the castle.\nI expected this, which is to say that I considered many scenarios about what might happen and how each playing piece would respond. All of these pieces gathered close to the invincible walls, begging for help. Different voices wanted different kinds of help. The females wanted to be let inside, which was impossible. The immature males wanted my weapons turned on the invaders, which was somewhat more likely. Reaching into the darkness, my senses found five males heavily cloaked inside stolen tech. They were dogs, but the tech was not. This was another scenario that I had imagined, but rarely and never with any sense of urgency.\nI put on my armor and absorbed a great share of courage.\nMy dogs scattered when the outer door opened, and then too slow by a long step, they were blocked from slipping inside when the doors closed and sealed.\nI stood among the pack, watching the invaders moving closer.\nEach of these creatures had a name. I knew them by sight and by voice. They were strange pitiful and yet lovely, and of course I would protect them now.\nI walked across the plastic grass.\nA dog emerged from the dead forest.\nI could have killed him but hesitated. I don’t know why I hesitated. Then the cloaks fell away and I saw that he was my dog, safe and home again. Such a wave of relief shook me, leaving me weakened. I could have killed him. I nearly did. Maybe that’s why I wept as he started talking to me.\n“What a fucking mess,” he said. “There’s a clan living up in the mountains. A bunch of real assholes, which we knew going in. But I didn’t realize they had a friend, and I had no idea how close she was to them.”\n“What kind of friend?” I asked.\nHe stared straight at me.\n“Where did you get the tech?” I asked.\n“Stole it.” Then with a sorrowful laugh, he said, “That’s our little ray of hope in this disaster. Some new machinery.”\n“You stole the tech from their friend,” I said.\n“She’s a monster,” he said.\nI didn’t say anything.\n“We need help,” he said. “You probably know the friend already.”\n“Who is she?” I asked.\nHe gave me specific directions.\n“No, I don’t know her,” I said.\n“But her castle is so close,” he said.\nI tried to explain. There are different measures of proximity.\nBut he grew bored and interrupted me. “Whatever,” he said. “With your help, we can kill that damned clan. At least the big boys die, and then we can grab up their girls and come back here again.”\nTwo of his brothers emerged from the forest. But the youngest brother had died or been left behind.\nMy dog watched me. Then with a slow, careful voice, he said, “You won’t help us, will you?”\n“I help you all the time,” I said.\n“You won’t go on the fight with us.”\n“No.”\n“But you don’t even know this other one. So what does it matter?”\nI tried to explain why it mattered.\n“Listen to yourself,” he said.\nI said, “If the bad pack comes here, I’ll defend you. But that is as much as I am willing to do.”\nMy dog stared at my armored chest.\nThe rest of the pack did the same.\n“Well,” my dog said at last. “At least you’re telling us where you stand.”\nI fed them double shares and gave them all of my water while sending a message to my neighbor on the other side of the mountains, saying nothing overt but offering to discuss mutual issues.\nShe responded by saying that she didn’t know me and to leave her alone.\nI left her alone.\nFor the rest of that evening and two more nights, nothing happened. Nothing changed. I fed my dogs everything they could eat and more, and the second pack didn’t appear, but then the afternoon sun was swallowed by black clouds of dust and even with the best tech it was difficult to see. Peering into the gloom, I suffered glimpses of motion and odd shapes, and then a series of sharp little explosions. Suddenly my dog appeared, running to the door and pounding with both hands.\n“Let us in,” he begged.\nI wanted to let him inside, but only him.\n“We’re dying out here,” he said.\nI was already wearing my armor. But I couldn’t see any threat, which was why I stayed indoors.\n“Do you hear me?” he asked.\nHe knew that I did.\n“Master,” he said. “They are coming for us.”\nI couldn’t see any new faces, but the dead woods began to burn. A dozen little fires consumed the dried underbrush and the trees, joining into one mighty blaze, and the filthy wind blew smoke and ash across the lawn. Pups were running back and forth. Naked, the young mother ran to my door, her little pup screaming in agony. She screamed too. “Forget him and run away,” she said.\n“No,” my dog said.\n“We’re going,” she said.\n“He’ll help us as soon as he puts on his armor,” my dog said.\nMy armor was ready, but I was scared. My mind was not suited to moments like these. If I used every bit of courage in my inventory, I would still feel scared, and that’s why I did nothing and remained silent.\nThe mother and her baby left.\nMy dog sat before the door. I had never seen him weep before. He had been stripped of his dignity. But the fire soon burnt itself out and the dust storm eventually passed, leaving nothing but ruin and my dog.\nArmed with several comforting phrases to make both of us feel better, I stepped through the doors.\nHe looked everywhere but at my face.\nI began to talk.\n“Shut up,” he said.\n“All right,” I said.\nThen he began to laugh—quietly yet with rage—and taking relish in the words, he said, “This has all been a test, you know. From the first day we met, even the tiniest event was part of a great plan.”\nI asked, “Whose plan?”\n“Not yours.” The laugh grew louder. “Stay outside or go run back into your little house. Either way, you lose.”\nIt was a rare feeling, a strangely wondrous feeling, having no understanding about what was happening.\nHe finally looked at me, just for a moment. Then he stood and backed away several steps while various kinds of tech were turned off. The blackened lawn was covered with dogs, mature and heavily armed. The big dog that my dog seemingly killed last year was alive again. The missing younger brother had returned, healthy and still angry. It occurred to me that the one that I killed was never a brother, just another fool caught up in this elaborate scheme.\nThe enormous pack was marching toward me.\nI fled inside, secured the doors and consumed every form of courage, but before the illusionary sense of security could take hold, the “monster” neighbor woman walked out from her hiding place.\nShe wasn’t wearing armor.\nIndeed, she wore almost nothing. Boots suitable for long hikes rode the otherwise naked legs, and her exposed chest was burnt scarlet by the sun, and strung around her neck was a steel collar adorned with savage barbs—good steel polished until it shone, but only half as bright as the radiant smile that crushed the last hope in my world.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "source": "https://clarkesworldmagazine.com/reed_09_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pack by Robert Reed"}