{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rita Chang-Eppig", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "A3DVzXUWjXyrBoMsSkqkPyd6SkE=", "id": null, "license": null, "comments": "", "raw_text": "5910 words, short story  The Last to Die  The morning the glass woman arrived on the island, all the security cameras blinked out at the same time. Surveillance drones swooned from the sky, tumbling softly onto genetically modified lawns that smelled like wildflowers grown in beakers of rain and cleaning fluid. Safety bots powered down mid-task in scandalous poses, legs akimbo, rears in the air. The last to die hardly knew what to make of this strange turn of events, having lived the past few decades under the around-the-clock care of these machines. Some of them feared that catastrophe had struck the outside world, from which they dwelled in relative isolation. Others barely noticed, their minds long ago having decomposed into yard waste, the synaptic branches cut, the nuclei withered like week-old rosebuds. Still others detected an opportunity for mischief and photographed themselves in mock conjugation with the safety bots or smeared lipstick into smiles on their sheeny, vacant faces.  The disturbance didn’t last long. One by one, the machines reawakened to the sight of this strange woman, whose carbon endoskeleton and neural circuitry were bare for all to see. She (though there was active debate among the residents who saw her disembarking the ferry whether she was indeed a she, the translucent body minimizing the more traditional markers of gender) marched into the local office of the Bureau of Elder Affairs and up to the check-in console, accompanied by a dark-haired man in his mid- to late-fifties who neither spoke nor made eye contact with anyone. The screen flickered on. In a voice like a fork clinking against a champagne glass, she stated her request.  In her home office on the mainland, Lan-Yun Montez, Regional Director of the Bureau of Elder Affairs, gaped. She had never seen a model like the glass woman’s before: it was as though the factory had assembled her body but forgotten the final steps of affixing the silicone skin and gluing on the wig. “I’m not sure I understand,” she said to the glass woman. “You’re looking for an apartment? On the island?”  “I’m looking for a place where we can stay for the foreseeable future. Ideally with a small yard, but a large patio would be fine as well. Sound about right, Max?”  Max just continued staring at the floor. He fluttered his fingers, perhaps in a show of assent.  “But this isn’t a rental market,” Lan-Yun said. “It’s all government-funded housing for the elderly, Ms. . . . ”  Lights on the glass woman’s circuits twinkled, and suddenly she seemed to Lan-Yun something like a prehistoric god, a Titan who had swallowed a thousand fireflies. Lan-Yun wondered if her own insides looked like that. “Call me Beth,” the glass woman said in a way that struck Lan-Yun distinctly as a lie. “It would mean a lot to me and Max if you could make an exception for us. His health has been deteriorating and he needs the doctors on the island, but I don’t want to just abandon him here.”  Lan-Yun had been about to deny her request—who knew what else this “Beth” was lying about—but at that moment Max tilted his face to the light. Familiarity ghosted through Lan-Yun, and with that familiarity the sense that she’d failed to grasp some eminently important fact. She might have dismissed it as déjà vu, except her mind was beyond such biological inefficiencies as déjà vu. “Give me a moment,” Lan-Yun said.  Lan-Yun snuffed her camera and mic with a hand so she could confer with her housekeeper, a robot programmed to say only “yes,” “indeed,” and “of course, ma’am” whom Lan-Yun had, for pretty much that reason, come to consider a therapist. “I know him from somewhere. Her, too. Something about the way she speaks. I mean, what does appearance mean anyway when you can swap bodies on a whim?”  “Indeed,” the robot said.  “So I should let them stay on the island for now, right? The smart thing to do is to keep them where I can observe them.”  “Yes.”  “I know it’s impulsive, but I’ve done great work for the Bureau and for the people on this island. I’m sure they’ll respect my decision.”  “Of course, ma’am.”  The last to die lived on islands around the world. How the idea to gather them on these islands had come about, no one could say. Perhaps the deathless simply grew weary of being reminded of the dying. After all, some of them still remembered a time when their own mortality hung about them like mosquitoes at a picnic. Then there were those who never knew frailty, who underwent the transfer procedure days after birth and came to consciousness in bodies liberated from hunger, cold, and skinned knees. Perhaps it was these cyborgs, or “neohumans,” as they liked to call themselves, who first proposed moving the last to die to the islands, these new beings connected to the old ones in neither blood nor visage, only idea.  News of the glass woman spread quickly among the island’s inhabitants. Clarissa Polyakov threw a glass against her wall when she heard. It bounced and then rolled along her living room floor because of course real glass was too dangerous to keep around the last to die. She called her friends, a group of people who for spiritual or other reasons had refused cyberization. To comfort her, they brought over bottles of the finest red wines and Tommes of pungent French cheeses, which they’d acquired for a steal because the deathless consumed no food or drink. They sat in a circle, retelling stories from their youth while the cheese stung their tongues and the wine padded their minds.  “They think they can just move in here,” Clarissa said. “The rest of the world is already theirs. Can’t they at least leave us be on our little island?”  One of Clarissa’s friends draped an arm around her. “These cyborgs feel so entitled to everything,” the friend said. “Well, we’re not going to let them ruin this place for us, too.” Hums of agreement crowded the room.  Most of Clarissa’s friends had been relocated to this island, if not forcibly, then at least with great reluctance. The outside world had grown too dangerous too quickly for the human body. There were fewer and fewer doctors (themselves a dying breed), more and more engineers. Companies stopped insuring individuals who either couldn’t or wouldn’t be cyberized. Ambulances, if a particular city had them at all, took hours to arrive. Here were handrails and slip guards, sharp corners throttled with foam.  Matthieu Akiwowo, retired astrophysicist, threw a party. After three rounds of a convoluted, strategy-based board game, he and his friends, most of whom were former scientists themselves, started a betting pool about the identity of the glass woman. “Government spy,” one of them said, nodding knowingly. Another rolled her eyes and took a puff from her vaporizing device, the exhalation trailing from her lips like an unfinished thought: “Artificial intelligence disguised as human . . . ” Matthieu waved his hand impatiently. “You’re all wrong,” he said. “Extra. Terrestrial.”  Willow McNamara Farzad rooted through the boxes her daughter had dumped at her place before running off to research phytoplankton in the Amazon and found a pair of binoculars and a folding camping chair. Wheedling a neighbor into joining her, they set out for the more isolated northern tip of the island, where the Bureau of Elder Affairs had lodged the glass woman. Like whale watchers, the two of them sat with their binoculars a small distance from the farmhouse, passing back and forth baggies of peaches sliced by their robot housekeepers, slurping the tacky nectar from their fingers. They bragged about their children’s accomplishments: world-renowned expert on microalgae, just made partner at top law firm dealing in cyber copyrights.  “Will your daughter come see you soon?” Willow’s friend asked.  “She’s very busy,” Willow said. “Very very busy. I’m glad she’s putting her career first.” Willow was, of course, lying. After a back surgery nine months prior, while still loopy from the anesthesia, she’d confessed to the med bots her fear that she would die without getting another chance to see her daughter, who visited once every five to six years. “I’m trying to stay hopeful,” Willow had said, sobbing, “but maybe we’re all just kidding ourselves.” The med bots, unable to distinguish between emotional and physical pain, gave her a large dose of morphine. She fell asleep immediately, so that kind of solved that.  If a single word existed to describe the state of the last to die, it would mean something akin to “hopeful.” They were on the island because, by the time the technology became available, their brains had atrophied too much for them to survive the transfer procedure. “But how can this be?” Willow had asked her doctor when he told her that she would be ineligible for cyberization. “I eat well, exercise, and do crossword puzzles daily. My mind is as clear as it was when I was in my thirties.” The doctor explained that what mattered was not the subjective experience of clarity but the physical condition of the brain. “The technology is getting better every day,” he added, “so at some point in the future they may figure out a way to cyberize older brains. Don’t give up yet.” People like Willow were hopeful because they had no alternative but to pray for another breakthrough to come along and save them from death. They were hopeful because sadness only further damaged the brain by increasing inflammation, and when an extra day potentially meant extra lifetimes, sadness was an emotion they dared not feel.  After all, who among them didn’t remember that headline from thirty years ago: The First Generation to Live Forever. After decades of beta testing, of dead subjects and subjects doomed to lie awake but immobile in their machine bodies, scientists had finally found a way to consistently digitize human consciousness. Once cyberized, the scientists crowed, you are no longer tied to an aging, fragile body. You can have a new body, one that is stronger and more easily repaired. And should that new body break down, you can simply be downloaded into another body, so long as you have backed up your data. Amidst the celebrations over this next human step, no one wanted to ruin the mood by stating the obvious. If there was to be a first generation to live forever, then it followed that there must be a last generation to die.  Lan-Yun had anticipated the minor upheaval that would result from the glass woman’s arrival. Her job involved monitoring the footage from the many cameras, and after years or doing it, she liked to think she understood the last to die fairly well, though she had set foot on the island herself only a couple of times. From her home office on the mainland, she’d watched them celebrate centennials and mourn passings, break hips and learn to walk again on new steel-and-polyethylene hips. She pitied them their fragility and kept her fingers crossed for the day they would be reborn into deathlessness, like her.  “We were slaves to biology,” Lan-Yun said to her robot one afternoon while gazing out of her downtown apartment. The streets were quiet, as usual. A lone man was crossing the street, his designer titanium arm deflecting bullets of light into her eyes. “The technology came along and freed us. Now we can travel anywhere and talk to anyone without even leaving the house. It’s a world without borders.”  She sat down on the lone couch in her apartment and stood again. Her robot immediately wheeled over and fluffed the cushion to optimal fullness. She leaned in to sniff her white miniature roses, which lost a petal from being rustled. Her robot centered its base over the petal and vacuumed it up as if laying an egg in reverse.  Lan-Yun opened a new window on her mental screen. A little rectangle of pixels behind her eyes brightened and resolved into the footage from the farmhouse. The glass woman and Max were feeding starlings in their yard, Max laughing and laughing as he chased them around. Birdseed clung to his shirt and unkempt beard; grass stains patched his jeans. Nearby, big bags of potting soil sunned together like seals. One had rolled over and disgorged dirt all over the silver birch decking.  The documentation submitted by the glass woman had included her and the mute man’s supposed full names. Neither of the names stood out to Lan-Yun. The glass woman had listed the mute man as her “ward,” not her son. Queries to the government database—the parts of it Lan-Yun could access, at least—turned up little else: He had been born fifty-six years ago to a young couple in a city on the mainland. About two decades ago, the couple had signed over guardianship to this “Beth,” who’d appeared in the database only a few years prior to the signing. Perhaps “Beth” was an assumed identity; perhaps the glass woman had simply emigrated from a place where records were spottier. Whoever she was, the couple had clearly trusted her enough.  Lan-Yun filed a request for a list of the couple’s living relatives and waited.  Matthieu’s betting pool grew: hologram, witness in witness protection program, movie star attempting a publicity stunt. Neighbors reported hearing “old” music, music they’d not heard since they were young. The farmhouse’s attic stayed lit throughout the night. Eccentric composer, evil scientist. And perhaps because of the rumors, the last to die began organizing picnics and evening strolls near the building, hoping to catch a glimpse of the strange pair.  Among the last to die, Willow received the distinction of being the first to speak to the glass woman. On a dare from her friend, Willow stepped up to the porch of the farmhouse and knocked. “I was in the neighborhood for some errands and figured I’d introduce myself,” Willow lied (she had spent the past six hours camped out across the street with her binoculars).  The glass woman invited her in and offered her something to drink. The inside of the house was not all smooth surfaces and clean lines, as many people had speculated, but rife, a bower bird’s nest of expensive-looking art, tattered musical scores, and little anatomical models of the human body that looked as though they had been taken apart and put back together many times. On the floor in a corner of the room, the mute man sat cross-legged, drawing a picture with motion-capture gloves. As he traced his fingers in the air, trees appeared on a screen. He seeded the branches with heavy black acorns.  After a bit of small talk about the weather, the topic turned to family. The glass woman explained her reasons for moving to the island. Max’s lungs, which had always wheezed and trilled as though from interior storms, the bronchial tree in perpetual winter, had only grown weaker with age. “My daughter was born with a heart defect,” Willow said. “Who knows how long she would have lived if she hadn’t undergone the procedure. Do you mind if I ask why you don’t just get Max cyberized?”  The glass woman tilted her head slightly. Carbon fiber joints twisted and bent; tiny lights winked secrets at one another. “Max’s brain is very atypical,” the glass woman said. “His parents tried to find a way. It was hard on them.”  “I guess there are still plenty of problems science can’t solve,” Willow replied. “My husband died only a year after our daughter was born. He’d undergone surgery to repair an aneurysm. ‘Just in case the aneurysm bursts one day,’ the doctors said. He had a stroke from the surgery.” She was sobbing again. “I’m sorry, I’m sorry,” she said, wiping her nose on her sleeves. If a med bot had been present, it would have drawn up a syringe.  The glass woman placed a lone, cold hand on Willow’s. A little hand, its appearance made more diminutive by its colorlessness. An idea of a hand. It felt like she understood me, Willow related to her friend afterward. Like she was no stranger to grief.  After calming down, Willow asked, “Where are Max’s parents now?”  “They’re both gone now. Max and I had always had a good relationship, so they entrusted him to me.”  “How kind of you,” Willow said, “to take on a responsibility like that.” The glass woman didn’t respond.  Emboldened by Willow’s experience, others on the island began paying visits to the glass woman, who opened the door for everyone who knocked. Knowledge about her and Max began to grow, with each successive visitor filling in details that the previous lacked: She had no children of her own. She wore her “glass” body, in reality high-density acrylic, as a memorial to loved ones. Which loved ones? “All of them,” she said.  As the number of visitors to the farmhouse increased, Matthieu started referring to the glass woman as “The Great Attractor,” a gravity anomaly in deep space that draws toward itself a concentration of mass far greater than the Milky Way. Matthieu hypothesized that the glass woman had not chosen the company of the mute man capriciously. She must have wanted or needed someone unaffected by her gravity, with a spin and orbit all his own.  All the new information about the glass woman and the mute man only made Lan-Yun’s task harder. If the glass woman hadn’t been a relative but a friend, Lan-Yun needed a different list, one not available in any official database. Then there were the glass woman’s many belongings, which either held deep significance or would prove to be a complete waste of time. Did the musical scores mean that the glass woman had been some kind of musician? Did the paintings, some of which had been in the private collection of a wealthy family prior to this, mean that she was an art thief? Lan-Yun stayed up late, draining her batteries and cluttering up her cache. She visited websites with worrisome source codes in search of additional information and contracted a few viruses that way. To cope with the stress, she increased the frequency of therapy sessions with her robot, which assured her monotonically that, indeed, she was doing the right thing.  The primary problem was the blackouts. Every few days, at unexpected times, the glass woman’s system seemed to reboot, disabling all the security cameras, safety bots, and surveillance drones in the process. No one could figure out why this was happening—deathless visitors to the island never caused any such issues. A few of Matthieu’s friends proposed that the glass woman was different from the other deathless somehow, a much newer or older model incompatible with the island’s network.  It was during one of these reboots that Alex Kohler-Park climbed onto the roof of his home and jumped. The island had never seen a suicide before, not because others hadn’t contemplated the same thing, but because suicide was near impossible in a place where inhabitants were carefully monitored around the clock and all sharp edges were hidden away. His robot caretakers found a note afterward, and it wasn’t so much a note as a scribbled line drawing of a hand with an erected middle finger that the robots had some difficulty interpreting.  Messages from Clarissa and her friends immediately glutted Lan-Yun’s inbox: When would the Bureau finally acknowledge the dangers posed by the glass woman? How was the Bureau going to take responsibility? The matter was under investigation, Lan-Yun assured them. The happiness of the island’s venerable residents was the Bureau’s top priority, etc. As far as Lan-Yun was concerned, the last to die’s bellyaching could not have come at a worse time. Compiling a list of the couple’s friends from around the time of the guardianship transfer was proving even more difficult than anticipated. What kind of people had people who liked people peopled their lives with back then? Schoolmates, teachers, church leaders. Work colleagues, neighborhood association members, bartenders.  “This is impossible,” she said to her robot. “I’m never going to find out who they are.”  “Indeed.”  “You’re useless!” she yelled, winging at it a purely decorative copy of a book on dinner party etiquette. The tome made a thunk against the robot’s face and then a splat on the floor.  “Of course, ma’am,” the robot said, proceeding to pick it up.  A petition from Clarissa and her group arrived next. Lan-Yun trashed it without looking at it. She answered work messages late or not at all—news about the suicide had apparently reached her colleagues (leaked by Clarissa’s ilk, no doubt), who demanded reports she couldn’t run and updates she didn’t have, so many demands, one after another, that Lan-Yun decided she didn’t even care if she got fired. She barely knew or liked any of her coworkers anyway, the normalization of telecommuting long ago having rendered traditional workspaces obsolete. And it wasn’t as if she’d dreamed of becoming a bureaucrat when she was a child. An internship had turned into an entry-level position which had turned into this. On several occasions, she’d sat herself down with career guidance books, determined to discover her calling, but then she’d convinced herself that she had plenty of time to figure everything out.  Thus preoccupied, Lan-Yun hardly noticed the spate of late-night meetings at Clarissa’s house, the flyers being furtively passed from hand to hand, and the glares between Clarissa and Willow whenever the two women crossed paths. She hardly could have guessed what was coming next.  The protests started a few weeks after. Together, they marched down to the local office of the Bureau of Elder Affairs. “Keep Our Home a Haven,” their signs read. Heated by an uncommonly early spring, zeal, and the press of bodies, they limped on replacement hips or rolled along in motorized chairs, vandalizing the motivational posters that hung everywhere (“Stretch to your fullest potential!” a tree in tree yoga pose exhorted) and batting at drones with their canes. At the prompting of her friends, Clarissa wobbled onto the low stage the Bureau reserved for bingo night.  “It is bad enough that we have become second-class citizens in our own society, constantly surveilled and micromanaged by the deathless,” Clarissa shouted through the initial quaver in her voice. “Now they are moving in and disrupting the lives we have worked hard to build for ourselves. I have been in communication with other islands worldwide, and they have expressed their solidarity. If we must live like goldfish, then we at least deserve a tank of our own, free from their poisons.”  The protesters cheered. Then they tried to set an effigy of the glass woman on fire, but the drones, which were not programmed with a sense of humor or the ability to think figuratively, immediately swooped in to put it out.  Crowds gathered in front of the farmhouse. Somebody threw an artificial leg at a window. The thigh broke through the glass but the calf caught on the windowpane, giving the impression of a disgruntled robot in the course of its great escape. The Bureau of Elder Affairs sent peace officers, who found themselves at a loss what to do with this cadre of octo- and nonagenarians too agitated to be verbally calmed but too brittle to be physically subdued. Yet as Clarissa’s supporters grew in number, so did a counter-contingent comprising individuals like Willow, who had found in the glass woman nothing but a quiet kindness, and others, who had never met the glass woman but who opposed Clarissa on principle because her rhetoric whirled up lees from a time when their own parents or grandparents had been barred from jobs or neighborhoods on the basis of skin color or lifestyle.  Perhaps unsurprisingly, the mute man struggled to acclimate to all the newfound commotion. One afternoon, after a particularly loud bang woke him from his nap (some protesters had tipped a safety bot, which had been unable to defend itself because Asimov), he began to scream. He screamed so loudly that even the people outside heard and tried to peer in the windows. What finally stopped the screaming was the glass woman, who hurried in from potting hydrangeas in the backyard and knelt in front of him. “Hey, Max, hey, buddy,” she said.  The mute man was now crying and hyperventilating. “It’s okay, it’s okay,” she said. “Here, look.” She held up one hand, palm facing him, fingers together. Slowly, he raised his hand and pressed his palm to hers.  And that was all it took for Lan-Yun to finally recognize the pair. Not the late nights poring through records with her hyperefficient mind, not the many bots she’d programmed to search for information, but this simple little moment. Lan-Yun had seen this gesture before when the mute man had been much younger and the glass woman had been in a different body, photographed by every tabloid and news outlet for being one of the first humans to survive cyberization.  “Holy shit!” Lan-Yun cried.  A red light flashed on her robot’s torso: As a courtesy to your neighbors, please be mindful of noise.  Her apartment suddenly felt too small. Lan-Yun hesitated only a second before deciding to leave for the first time in weeks. She kicked her robot in the leg on her way out.  Like the few other people walking, she straddled the middle of the road, edging aside only when the occasional driverless vehicle honked. A cleaning bot sluiced the street on schedule, excavating the top stratum of nothing to reveal the nothing underneath. How things had changed since her youth. Once she’d found a silver dollar on the street, a perfect, shining gift, as though the moon had fallen and lain there waiting for her to pocket it near her heart. Yet she knew better than to wax sentimental about the old days. As a teenager with Marfan syndrome, with a body like a cobweb and a deep, primordial pain in her bones, Lan-Yun had tracked the news on cyberization with impatience. Then the first successful cases appeared. It didn’t matter that the procedure wouldn’t receive approval for mass implementation for years to come. In these new beings she saw her future, a concept that, up until their arrival, had felt as speculative as the concept of running, climbing, or dancing.  There had been only a handful of them, people who somehow survived the earliest procedures and whose neurocybernetic architecture became foundational to future models. In some ways, they came to feel like her spiritual parents, especially after her real parents died. But one by one, over the course of decades, they disappeared. Attempts to ping them timed out.  She called up the footage again. In the few minutes since she’d taken her eyes off the last to die, a drum circle had formed near the farmhouse. A man in a colorful, slouchy knit cap and a woman with a vaporizing device lolling from her mouth were banging loudly and asynchronously on bongos. Hips and shoulders shimmied; arthritic joints spasmed and popped. Someone who had to be in her eighties whipped her shirt off, her breasts knocking back and forth like a Newton’s cradle.  Lan-Yun had thought she would spend all of her time dancing after cyberization. Having spent her high school and college years waiting in sticky booths at clubs while her friends leaped and twirled, she’d wanted more than anything to catch up. But by the time she underwent the procedure, she was already in her late 30s, and dancing didn’t seem particularly dignified for a woman of her age and professional stature. On top of that, dance halls had begun closing down, the younger generation seeing no point in making the effort to dress up and wait in line only to be turned away at the door when they could experience virtually the same thing, virtually. Lan-Yun marveled at the chaos on the island, and a simple, irrefutable conclusion arose.  It was time for her to go.  She arrived late in the evening and instructed the car to take her directly to the farmhouse. It drove her past artificial meadows engineered to smell natural; a school of seniors swimming through their tai chi moves, and nearby, a group arguing angrily over the position of the boule in a game of pétanque; hospitals where at that precise moment patients were taking their last breaths; ponds choking with koi and lily pads and surrounded by tall railings; a safety bot rolling around with a photograph glued onto its back of one of the last to die spanking a disabled safety robot, possibly the same one (“Show ’em who’s boss,” the caption read); and, finally, the stragglers from the day’s protests, who were moseying home arm in arm, swigging grand cru straight from the bottle, idly pitter-pattering on their drums.  “Shit, the crats are here,” Matthieu said, seeing the official vehicle pull up. “Something’s about to go down.”  “You think the Bureau going to kick her out?” his friend asked.  Matthieu shrugged. “Well, they do hate disorder. Not that any of this is really the glass woman’s fault. Attractors can’t control what they attract, the way black holes can’t choose to consume only moons.”  “I don’t understand why these protesters can’t just sit down and talk through it like adults,” the friend said. “All this craziness over a single woman.”  “Come on, you and I have both lived long enough to know that things don’t work that way. Wars are never about the thing being fought over but about the people fighting.” He opened the file on which he’d been keeping track of everyone’s bets. “Now who wants to place a final wager?”  The front door was already open when Lan-Yun arrived. The peace officers stood aside to let her pass. Several members of Clarissa’s group clamored to be included in the conversation, fearing that the government might make yet another decision without their input, but the officers stood their ground. When Clarissa tried to elbow one of the officers out of the way, Willow intervened, wedging herself between them. Somebody started chanting, “Fight, fight, fight,” and the world’s wobbliest slap fight ensued.  Lan-Yun found the glass woman sitting at the kitchen counter. “Thanks for seeing me,” she said. “I hope we can come to a compromise that will make everyone happy.”  “I hope so as well,” the glass woman said. “Max and I have enjoyed this house.”  “It’s one of the oldest structures on the island. These walls have seen a lot. Maybe as much as you.”  The glass woman didn’t respond. In the darkened room, she was a ghost with radial veins of light.  Lan-Yun decided on the direct approach. “I wouldn’t have recognized you if not for Max, and only then because I’d been interested about you and the others in my youth. Why did you come here?”  “I’ve explained why.”  “Some people here don’t believe you.”  The glass woman stood and walked over to a table in the living room, where she picked up a model of the human brain. She held it in her open hand as though it were a snail she had plucked from the trellis.  “I don’t want to kick you off the island,” Lan-Yun continued, “but you have to understand that I’m under a lot of pressure to fix this. What if we told everyone who you are? Imagine the support you would get. Without the experimentation they did on you, widespread cyberization would not have been possible.”  “I need to think about this,” the glass woman said, wandering deeper into the living room. Then, the strangest thing happened. All of the lights in the glass woman blinked out at the same time. For a second, Lan-Yun thought for sure that she had disappeared. There was a thunk on the roof that Lan-Yun realized was a drone falling from the sky. After a few seconds, the lights came on again, even ones that had not been there before, more and more until it seemed the glass woman would burn through the fabric of the universe, as if she were engaged in some internal process so immense that even the deathless, with all their knowledge, would never be able to understand.  The glass woman returned to the kitchen and sat back down. “I was born so long ago that almost everyone I loved is now gone,” she said to Lan-Yun. “Think about how many you have lost. Your grandparents. Your parents. Maybe a few uncles and aunts. But your friends live. So do your siblings, cousins, nieces, nephews, and children, if you have any. That is a privilege those of your generation hold. Those younger than you hold even more. What I share with the people on this island is the language of loss. We are flip sides of the same coin. You might say that I am the last to still be alive.”  “What about the others?” Lan-Yun asked quietly.  “It takes more than an imperishable body to stay alive. We need more than ourselves and our own ambitions, especially as time drags on. People think I saved Max, but really it’s the other way around. With him I’ve found a tether to this world. Not everyone is so lucky.”  If we need more than ourselves, Lan-Yun thought, then maybe we’re all doomed without even realizing it. With no need to leave their homes for work or food, many deathless had tucked themselves away like collectible figurines in glass cases. Lan-Yun couldn’t remember the last time someone had made voluntary eye contact with her on the mainland, nor the last time she had seen more than a couple of people together, just sitting and talking, never mind gathered in protest and counterprotest. Occasionally, people still had children, if one could call beings grown in laboratories from cell lines “children,” but usually not until much later in life. No one was in a hurry to live because no one died.  And yet, for all their freedom and potential, what had neohumanity made of their endlessness? All over the world, there were junkyards where people went to turn themselves off. Sometimes they had loved ones who searched for them; often they did not. Wind and rain ate through their clothing. Wild dogs urinated on their feet.  Not that she saw the same despair in her own future, necessarily. She’d struggled too hard to stay alive while in her old body to give up life this easily. But as she’d started getting on in years—she was now nearing her seventh decade—she’d felt a kind of emotional flimsiness she found hard to describe, like the bonds between her and the world were dissolving instead of the connective tissue in her body. What would become of her in another three decades? Ten? The scientists created the first generation to live forever, but they never thought to ask how humanity was supposed to fill so much time.  “So what do we do?” Lan-Yun asked, unsure if she was asking for the glass woman or for herself. Yet even as she said this, she realized she wanted the glass woman to stay on the island. She imagined meeting up with her every now and then like old friends. All of the things the glass woman must have experienced. All of the stories she could tell.", "text": "5910 words, short story\nThe Last to Die\nThe morning the glass woman arrived on the island, all the security cameras blinked out at the same time. Surveillance drones swooned from the sky, tumbling softly onto genetically modified lawns that smelled like wildflowers grown in beakers of rain and cleaning fluid. Safety bots powered down mid-task in scandalous poses, legs akimbo, rears in the air. The last to die hardly knew what to make of this strange turn of events, having lived the past few decades under the around-the-clock care of these machines. Some of them feared that catastrophe had struck the outside world, from which they dwelled in relative isolation. Others barely noticed, their minds long ago having decomposed into yard waste, the synaptic branches cut, the nuclei withered like week-old rosebuds. Still others detected an opportunity for mischief and photographed themselves in mock conjugation with the safety bots or smeared lipstick into smiles on their sheeny, vacant faces.\nThe disturbance didn’t last long. One by one, the machines reawakened to the sight of this strange woman, whose carbon endoskeleton and neural circuitry were bare for all to see. She (though there was active debate among the residents who saw her disembarking the ferry whether she was indeed a she, the translucent body minimizing the more traditional markers of gender) marched into the local office of the Bureau of Elder Affairs and up to the check-in console, accompanied by a dark-haired man in his mid- to late-fifties who neither spoke nor made eye contact with anyone. The screen flickered on. In a voice like a fork clinking against a champagne glass, she stated her request.\nIn her home office on the mainland, Lan-Yun Montez, Regional Director of the Bureau of Elder Affairs, gaped. She had never seen a model like the glass woman’s before: it was as though the factory had assembled her body but forgotten the final steps of affixing the silicone skin and gluing on the wig. “I’m not sure I understand,” she said to the glass woman. “You’re looking for an apartment? On the island?”\n“I’m looking for a place where we can stay for the foreseeable future. Ideally with a small yard, but a large patio would be fine as well. Sound about right, Max?”\nMax just continued staring at the floor. He fluttered his fingers, perhaps in a show of assent.\n“But this isn’t a rental market,” Lan-Yun said. “It’s all government-funded housing for the elderly, Ms. . . . ”\nLights on the glass woman’s circuits twinkled, and suddenly she seemed to Lan-Yun something like a prehistoric god, a Titan who had swallowed a thousand fireflies. Lan-Yun wondered if her own insides looked like that. “Call me Beth,” the glass woman said in a way that struck Lan-Yun distinctly as a lie. “It would mean a lot to me and Max if you could make an exception for us. His health has been deteriorating and he needs the doctors on the island, but I don’t want to just abandon him here.”\nLan-Yun had been about to deny her request—who knew what else this “Beth” was lying about—but at that moment Max tilted his face to the light. Familiarity ghosted through Lan-Yun, and with that familiarity the sense that she’d failed to grasp some eminently important fact. She might have dismissed it as déjà vu, except her mind was beyond such biological inefficiencies as déjà vu. “Give me a moment,” Lan-Yun said.\nLan-Yun snuffed her camera and mic with a hand so she could confer with her housekeeper, a robot programmed to say only “yes,” “indeed,” and “of course, ma’am” whom Lan-Yun had, for pretty much that reason, come to consider a therapist. “I know him from somewhere. Her, too. Something about the way she speaks. I mean, what does appearance mean anyway when you can swap bodies on a whim?”\n“Indeed,” the robot said.\n“So I should let them stay on the island for now, right? The smart thing to do is to keep them where I can observe them.”\n“Yes.”\n“I know it’s impulsive, but I’ve done great work for the Bureau and for the people on this island. I’m sure they’ll respect my decision.”\n“Of course, ma’am.”\nThe last to die lived on islands around the world. How the idea to gather them on these islands had come about, no one could say. Perhaps the deathless simply grew weary of being reminded of the dying. After all, some of them still remembered a time when their own mortality hung about them like mosquitoes at a picnic. Then there were those who never knew frailty, who underwent the transfer procedure days after birth and came to consciousness in bodies liberated from hunger, cold, and skinned knees. Perhaps it was these cyborgs, or “neohumans,” as they liked to call themselves, who first proposed moving the last to die to the islands, these new beings connected to the old ones in neither blood nor visage, only idea.\nNews of the glass woman spread quickly among the island’s inhabitants. Clarissa Polyakov threw a glass against her wall when she heard. It bounced and then rolled along her living room floor because of course real glass was too dangerous to keep around the last to die. She called her friends, a group of people who for spiritual or other reasons had refused cyberization. To comfort her, they brought over bottles of the finest red wines and Tommes of pungent French cheeses, which they’d acquired for a steal because the deathless consumed no food or drink. They sat in a circle, retelling stories from their youth while the cheese stung their tongues and the wine padded their minds.\n“They think they can just move in here,” Clarissa said. “The rest of the world is already theirs. Can’t they at least leave us be on our little island?”\nOne of Clarissa’s friends draped an arm around her. “These cyborgs feel so entitled to everything,” the friend said. “Well, we’re not going to let them ruin this place for us, too.” Hums of agreement crowded the room.\nMost of Clarissa’s friends had been relocated to this island, if not forcibly, then at least with great reluctance. The outside world had grown too dangerous too quickly for the human body. There were fewer and fewer doctors (themselves a dying breed), more and more engineers. Companies stopped insuring individuals who either couldn’t or wouldn’t be cyberized. Ambulances, if a particular city had them at all, took hours to arrive. Here were handrails and slip guards, sharp corners throttled with foam.\nMatthieu Akiwowo, retired astrophysicist, threw a party. After three rounds of a convoluted, strategy-based board game, he and his friends, most of whom were former scientists themselves, started a betting pool about the identity of the glass woman. “Government spy,” one of them said, nodding knowingly. Another rolled her eyes and took a puff from her vaporizing device, the exhalation trailing from her lips like an unfinished thought: “Artificial intelligence disguised as human . . . ” Matthieu waved his hand impatiently. “You’re all wrong,” he said. “Extra. Terrestrial.”\nWillow McNamara Farzad rooted through the boxes her daughter had dumped at her place before running off to research phytoplankton in the Amazon and found a pair of binoculars and a folding camping chair. Wheedling a neighbor into joining her, they set out for the more isolated northern tip of the island, where the Bureau of Elder Affairs had lodged the glass woman. Like whale watchers, the two of them sat with their binoculars a small distance from the farmhouse, passing back and forth baggies of peaches sliced by their robot housekeepers, slurping the tacky nectar from their fingers. They bragged about their children’s accomplishments: world-renowned expert on microalgae, just made partner at top law firm dealing in cyber copyrights.\n“Will your daughter come see you soon?” Willow’s friend asked.\n“She’s very busy,” Willow said. “Very very busy. I’m glad she’s putting her career first.” Willow was, of course, lying. After a back surgery nine months prior, while still loopy from the anesthesia, she’d confessed to the med bots her fear that she would die without getting another chance to see her daughter, who visited once every five to six years. “I’m trying to stay hopeful,” Willow had said, sobbing, “but maybe we’re all just kidding ourselves.” The med bots, unable to distinguish between emotional and physical pain, gave her a large dose of morphine. She fell asleep immediately, so that kind of solved that.\nIf a single word existed to describe the state of the last to die, it would mean something akin to “hopeful.” They were on the island because, by the time the technology became available, their brains had atrophied too much for them to survive the transfer procedure. “But how can this be?” Willow had asked her doctor when he told her that she would be ineligible for cyberization. “I eat well, exercise, and do crossword puzzles daily. My mind is as clear as it was when I was in my thirties.” The doctor explained that what mattered was not the subjective experience of clarity but the physical condition of the brain. “The technology is getting better every day,” he added, “so at some point in the future they may figure out a way to cyberize older brains. Don’t give up yet.” People like Willow were hopeful because they had no alternative but to pray for another breakthrough to come along and save them from death. They were hopeful because sadness only further damaged the brain by increasing inflammation, and when an extra day potentially meant extra lifetimes, sadness was an emotion they dared not feel.\nAfter all, who among them didn’t remember that headline from thirty years ago: The First Generation to Live Forever. After decades of beta testing, of dead subjects and subjects doomed to lie awake but immobile in their machine bodies, scientists had finally found a way to consistently digitize human consciousness. Once cyberized, the scientists crowed, you are no longer tied to an aging, fragile body. You can have a new body, one that is stronger and more easily repaired. And should that new body break down, you can simply be downloaded into another body, so long as you have backed up your data. Amidst the celebrations over this next human step, no one wanted to ruin the mood by stating the obvious. If there was to be a first generation to live forever, then it followed that there must be a last generation to die.\nLan-Yun had anticipated the minor upheaval that would result from the glass woman’s arrival. Her job involved monitoring the footage from the many cameras, and after years or doing it, she liked to think she understood the last to die fairly well, though she had set foot on the island herself only a couple of times. From her home office on the mainland, she’d watched them celebrate centennials and mourn passings, break hips and learn to walk again on new steel-and-polyethylene hips. She pitied them their fragility and kept her fingers crossed for the day they would be reborn into deathlessness, like her.\n“We were slaves to biology,” Lan-Yun said to her robot one afternoon while gazing out of her downtown apartment. The streets were quiet, as usual. A lone man was crossing the street, his designer titanium arm deflecting bullets of light into her eyes. “The technology came along and freed us. Now we can travel anywhere and talk to anyone without even leaving the house. It’s a world without borders.”\nShe sat down on the lone couch in her apartment and stood again. Her robot immediately wheeled over and fluffed the cushion to optimal fullness. She leaned in to sniff her white miniature roses, which lost a petal from being rustled. Her robot centered its base over the petal and vacuumed it up as if laying an egg in reverse.\nLan-Yun opened a new window on her mental screen. A little rectangle of pixels behind her eyes brightened and resolved into the footage from the farmhouse. The glass woman and Max were feeding starlings in their yard, Max laughing and laughing as he chased them around. Birdseed clung to his shirt and unkempt beard; grass stains patched his jeans. Nearby, big bags of potting soil sunned together like seals. One had rolled over and disgorged dirt all over the silver birch decking.\nThe documentation submitted by the glass woman had included her and the mute man’s supposed full names. Neither of the names stood out to Lan-Yun. The glass woman had listed the mute man as her “ward,” not her son. Queries to the government database—the parts of it Lan-Yun could access, at least—turned up little else: He had been born fifty-six years ago to a young couple in a city on the mainland. About two decades ago, the couple had signed over guardianship to this “Beth,” who’d appeared in the database only a few years prior to the signing. Perhaps “Beth” was an assumed identity; perhaps the glass woman had simply emigrated from a place where records were spottier. Whoever she was, the couple had clearly trusted her enough.\nLan-Yun filed a request for a list of the couple’s living relatives and waited.\nMatthieu’s betting pool grew: hologram, witness in witness protection program, movie star attempting a publicity stunt. Neighbors reported hearing “old” music, music they’d not heard since they were young. The farmhouse’s attic stayed lit throughout the night. Eccentric composer, evil scientist. And perhaps because of the rumors, the last to die began organizing picnics and evening strolls near the building, hoping to catch a glimpse of the strange pair.\nAmong the last to die, Willow received the distinction of being the first to speak to the glass woman. On a dare from her friend, Willow stepped up to the porch of the farmhouse and knocked. “I was in the neighborhood for some errands and figured I’d introduce myself,” Willow lied (she had spent the past six hours camped out across the street with her binoculars).\nThe glass woman invited her in and offered her something to drink. The inside of the house was not all smooth surfaces and clean lines, as many people had speculated, but rife, a bower bird’s nest of expensive-looking art, tattered musical scores, and little anatomical models of the human body that looked as though they had been taken apart and put back together many times. On the floor in a corner of the room, the mute man sat cross-legged, drawing a picture with motion-capture gloves. As he traced his fingers in the air, trees appeared on a screen. He seeded the branches with heavy black acorns.\nAfter a bit of small talk about the weather, the topic turned to family. The glass woman explained her reasons for moving to the island. Max’s lungs, which had always wheezed and trilled as though from interior storms, the bronchial tree in perpetual winter, had only grown weaker with age. “My daughter was born with a heart defect,” Willow said. “Who knows how long she would have lived if she hadn’t undergone the procedure. Do you mind if I ask why you don’t just get Max cyberized?”\nThe glass woman tilted her head slightly. Carbon fiber joints twisted and bent; tiny lights winked secrets at one another. “Max’s brain is very atypical,” the glass woman said. “His parents tried to find a way. It was hard on them.”\n“I guess there are still plenty of problems science can’t solve,” Willow replied. “My husband died only a year after our daughter was born. He’d undergone surgery to repair an aneurysm. ‘Just in case the aneurysm bursts one day,’ the doctors said. He had a stroke from the surgery.” She was sobbing again. “I’m sorry, I’m sorry,” she said, wiping her nose on her sleeves. If a med bot had been present, it would have drawn up a syringe.\nThe glass woman placed a lone, cold hand on Willow’s. A little hand, its appearance made more diminutive by its colorlessness. An idea of a hand. It felt like she understood me, Willow related to her friend afterward. Like she was no stranger to grief.\nAfter calming down, Willow asked, “Where are Max’s parents now?”\n“They’re both gone now. Max and I had always had a good relationship, so they entrusted him to me.”\n“How kind of you,” Willow said, “to take on a responsibility like that.” The glass woman didn’t respond.\nEmboldened by Willow’s experience, others on the island began paying visits to the glass woman, who opened the door for everyone who knocked. Knowledge about her and Max began to grow, with each successive visitor filling in details that the previous lacked: She had no children of her own. She wore her “glass” body, in reality high-density acrylic, as a memorial to loved ones. Which loved ones? “All of them,” she said.\nAs the number of visitors to the farmhouse increased, Matthieu started referring to the glass woman as “The Great Attractor,” a gravity anomaly in deep space that draws toward itself a concentration of mass far greater than the Milky Way. Matthieu hypothesized that the glass woman had not chosen the company of the mute man capriciously. She must have wanted or needed someone unaffected by her gravity, with a spin and orbit all his own.\nAll the new information about the glass woman and the mute man only made Lan-Yun’s task harder. If the glass woman hadn’t been a relative but a friend, Lan-Yun needed a different list, one not available in any official database. Then there were the glass woman’s many belongings, which either held deep significance or would prove to be a complete waste of time. Did the musical scores mean that the glass woman had been some kind of musician? Did the paintings, some of which had been in the private collection of a wealthy family prior to this, mean that she was an art thief? Lan-Yun stayed up late, draining her batteries and cluttering up her cache. She visited websites with worrisome source codes in search of additional information and contracted a few viruses that way. To cope with the stress, she increased the frequency of therapy sessions with her robot, which assured her monotonically that, indeed, she was doing the right thing.\nThe primary problem was the blackouts. Every few days, at unexpected times, the glass woman’s system seemed to reboot, disabling all the security cameras, safety bots, and surveillance drones in the process. No one could figure out why this was happening—deathless visitors to the island never caused any such issues. A few of Matthieu’s friends proposed that the glass woman was different from the other deathless somehow, a much newer or older model incompatible with the island’s network.\nIt was during one of these reboots that Alex Kohler-Park climbed onto the roof of his home and jumped. The island had never seen a suicide before, not because others hadn’t contemplated the same thing, but because suicide was near impossible in a place where inhabitants were carefully monitored around the clock and all sharp edges were hidden away. His robot caretakers found a note afterward, and it wasn’t so much a note as a scribbled line drawing of a hand with an erected middle finger that the robots had some difficulty interpreting.\nMessages from Clarissa and her friends immediately glutted Lan-Yun’s inbox: When would the Bureau finally acknowledge the dangers posed by the glass woman? How was the Bureau going to take responsibility? The matter was under investigation, Lan-Yun assured them. The happiness of the island’s venerable residents was the Bureau’s top priority, etc. As far as Lan-Yun was concerned, the last to die’s bellyaching could not have come at a worse time. Compiling a list of the couple’s friends from around the time of the guardianship transfer was proving even more difficult than anticipated. What kind of people had people who liked people peopled their lives with back then? Schoolmates, teachers, church leaders. Work colleagues, neighborhood association members, bartenders.\n“This is impossible,” she said to her robot. “I’m never going to find out who they are.”\n“Indeed.”\n“You’re useless!” she yelled, winging at it a purely decorative copy of a book on dinner party etiquette. The tome made a thunk against the robot’s face and then a splat on the floor.\n“Of course, ma’am,” the robot said, proceeding to pick it up.\nA petition from Clarissa and her group arrived next. Lan-Yun trashed it without looking at it. She answered work messages late or not at all—news about the suicide had apparently reached her colleagues (leaked by Clarissa’s ilk, no doubt), who demanded reports she couldn’t run and updates she didn’t have, so many demands, one after another, that Lan-Yun decided she didn’t even care if she got fired. She barely knew or liked any of her coworkers anyway, the normalization of telecommuting long ago having rendered traditional workspaces obsolete. And it wasn’t as if she’d dreamed of becoming a bureaucrat when she was a child. An internship had turned into an entry-level position which had turned into this. On several occasions, she’d sat herself down with career guidance books, determined to discover her calling, but then she’d convinced herself that she had plenty of time to figure everything out.\nThus preoccupied, Lan-Yun hardly noticed the spate of late-night meetings at Clarissa’s house, the flyers being furtively passed from hand to hand, and the glares between Clarissa and Willow whenever the two women crossed paths. She hardly could have guessed what was coming next.\nThe protests started a few weeks after. Together, they marched down to the local office of the Bureau of Elder Affairs. “Keep Our Home a Haven,” their signs read. Heated by an uncommonly early spring, zeal, and the press of bodies, they limped on replacement hips or rolled along in motorized chairs, vandalizing the motivational posters that hung everywhere (“Stretch to your fullest potential!” a tree in tree yoga pose exhorted) and batting at drones with their canes. At the prompting of her friends, Clarissa wobbled onto the low stage the Bureau reserved for bingo night.\n“It is bad enough that we have become second-class citizens in our own society, constantly surveilled and micromanaged by the deathless,” Clarissa shouted through the initial quaver in her voice. “Now they are moving in and disrupting the lives we have worked hard to build for ourselves. I have been in communication with other islands worldwide, and they have expressed their solidarity. If we must live like goldfish, then we at least deserve a tank of our own, free from their poisons.”\nThe protesters cheered. Then they tried to set an effigy of the glass woman on fire, but the drones, which were not programmed with a sense of humor or the ability to think figuratively, immediately swooped in to put it out.\nCrowds gathered in front of the farmhouse. Somebody threw an artificial leg at a window. The thigh broke through the glass but the calf caught on the windowpane, giving the impression of a disgruntled robot in the course of its great escape. The Bureau of Elder Affairs sent peace officers, who found themselves at a loss what to do with this cadre of octo- and nonagenarians too agitated to be verbally calmed but too brittle to be physically subdued. Yet as Clarissa’s supporters grew in number, so did a counter-contingent comprising individuals like Willow, who had found in the glass woman nothing but a quiet kindness, and others, who had never met the glass woman but who opposed Clarissa on principle because her rhetoric whirled up lees from a time when their own parents or grandparents had been barred from jobs or neighborhoods on the basis of skin color or lifestyle.\nPerhaps unsurprisingly, the mute man struggled to acclimate to all the newfound commotion. One afternoon, after a particularly loud bang woke him from his nap (some protesters had tipped a safety bot, which had been unable to defend itself because Asimov), he began to scream. He screamed so loudly that even the people outside heard and tried to peer in the windows. What finally stopped the screaming was the glass woman, who hurried in from potting hydrangeas in the backyard and knelt in front of him. “Hey, Max, hey, buddy,” she said.\nThe mute man was now crying and hyperventilating. “It’s okay, it’s okay,” she said. “Here, look.” She held up one hand, palm facing him, fingers together. Slowly, he raised his hand and pressed his palm to hers.\nAnd that was all it took for Lan-Yun to finally recognize the pair. Not the late nights poring through records with her hyperefficient mind, not the many bots she’d programmed to search for information, but this simple little moment. Lan-Yun had seen this gesture before when the mute man had been much younger and the glass woman had been in a different body, photographed by every tabloid and news outlet for being one of the first humans to survive cyberization.\n“Holy shit!” Lan-Yun cried.\nA red light flashed on her robot’s torso: As a courtesy to your neighbors, please be mindful of noise.\nHer apartment suddenly felt too small. Lan-Yun hesitated only a second before deciding to leave for the first time in weeks. She kicked her robot in the leg on her way out.\nLike the few other people walking, she straddled the middle of the road, edging aside only when the occasional driverless vehicle honked. A cleaning bot sluiced the street on schedule, excavating the top stratum of nothing to reveal the nothing underneath. How things had changed since her youth. Once she’d found a silver dollar on the street, a perfect, shining gift, as though the moon had fallen and lain there waiting for her to pocket it near her heart. Yet she knew better than to wax sentimental about the old days. As a teenager with Marfan syndrome, with a body like a cobweb and a deep, primordial pain in her bones, Lan-Yun had tracked the news on cyberization with impatience. Then the first successful cases appeared. It didn’t matter that the procedure wouldn’t receive approval for mass implementation for years to come. In these new beings she saw her future, a concept that, up until their arrival, had felt as speculative as the concept of running, climbing, or dancing.\nThere had been only a handful of them, people who somehow survived the earliest procedures and whose neurocybernetic architecture became foundational to future models. In some ways, they came to feel like her spiritual parents, especially after her real parents died. But one by one, over the course of decades, they disappeared. Attempts to ping them timed out.\nShe called up the footage again. In the few minutes since she’d taken her eyes off the last to die, a drum circle had formed near the farmhouse. A man in a colorful, slouchy knit cap and a woman with a vaporizing device lolling from her mouth were banging loudly and asynchronously on bongos. Hips and shoulders shimmied; arthritic joints spasmed and popped. Someone who had to be in her eighties whipped her shirt off, her breasts knocking back and forth like a Newton’s cradle.\nLan-Yun had thought she would spend all of her time dancing after cyberization. Having spent her high school and college years waiting in sticky booths at clubs while her friends leaped and twirled, she’d wanted more than anything to catch up. But by the time she underwent the procedure, she was already in her late 30s, and dancing didn’t seem particularly dignified for a woman of her age and professional stature. On top of that, dance halls had begun closing down, the younger generation seeing no point in making the effort to dress up and wait in line only to be turned away at the door when they could experience virtually the same thing, virtually. Lan-Yun marveled at the chaos on the island, and a simple, irrefutable conclusion arose.\nIt was time for her to go.\nShe arrived late in the evening and instructed the car to take her directly to the farmhouse. It drove her past artificial meadows engineered to smell natural; a school of seniors swimming through their tai chi moves, and nearby, a group arguing angrily over the position of the boule in a game of pétanque; hospitals where at that precise moment patients were taking their last breaths; ponds choking with koi and lily pads and surrounded by tall railings; a safety bot rolling around with a photograph glued onto its back of one of the last to die spanking a disabled safety robot, possibly the same one (“Show ’em who’s boss,” the caption read); and, finally, the stragglers from the day’s protests, who were moseying home arm in arm, swigging grand cru straight from the bottle, idly pitter-pattering on their drums.\n“Shit, the crats are here,” Matthieu said, seeing the official vehicle pull up. “Something’s about to go down.”\n“You think the Bureau going to kick her out?” his friend asked.\nMatthieu shrugged. “Well, they do hate disorder. Not that any of this is really the glass woman’s fault. Attractors can’t control what they attract, the way black holes can’t choose to consume only moons.”\n“I don’t understand why these protesters can’t just sit down and talk through it like adults,” the friend said. “All this craziness over a single woman.”\n“Come on, you and I have both lived long enough to know that things don’t work that way. Wars are never about the thing being fought over but about the people fighting.” He opened the file on which he’d been keeping track of everyone’s bets. “Now who wants to place a final wager?”\nThe front door was already open when Lan-Yun arrived. The peace officers stood aside to let her pass. Several members of Clarissa’s group clamored to be included in the conversation, fearing that the government might make yet another decision without their input, but the officers stood their ground. When Clarissa tried to elbow one of the officers out of the way, Willow intervened, wedging herself between them. Somebody started chanting, “Fight, fight, fight,” and the world’s wobbliest slap fight ensued.\nLan-Yun found the glass woman sitting at the kitchen counter. “Thanks for seeing me,” she said. “I hope we can come to a compromise that will make everyone happy.”\n“I hope so as well,” the glass woman said. “Max and I have enjoyed this house.”\n“It’s one of the oldest structures on the island. These walls have seen a lot. Maybe as much as you.”\nThe glass woman didn’t respond. In the darkened room, she was a ghost with radial veins of light.\nLan-Yun decided on the direct approach. “I wouldn’t have recognized you if not for Max, and only then because I’d been interested about you and the others in my youth. Why did you come here?”\n“I’ve explained why.”\n“Some people here don’t believe you.”\nThe glass woman stood and walked over to a table in the living room, where she picked up a model of the human brain. She held it in her open hand as though it were a snail she had plucked from the trellis.\n“I don’t want to kick you off the island,” Lan-Yun continued, “but you have to understand that I’m under a lot of pressure to fix this. What if we told everyone who you are? Imagine the support you would get. Without the experimentation they did on you, widespread cyberization would not have been possible.”\n“I need to think about this,” the glass woman said, wandering deeper into the living room. Then, the strangest thing happened. All of the lights in the glass woman blinked out at the same time. For a second, Lan-Yun thought for sure that she had disappeared. There was a thunk on the roof that Lan-Yun realized was a drone falling from the sky. After a few seconds, the lights came on again, even ones that had not been there before, more and more until it seemed the glass woman would burn through the fabric of the universe, as if she were engaged in some internal process so immense that even the deathless, with all their knowledge, would never be able to understand.\nThe glass woman returned to the kitchen and sat back down. “I was born so long ago that almost everyone I loved is now gone,” she said to Lan-Yun. “Think about how many you have lost. Your grandparents. Your parents. Maybe a few uncles and aunts. But your friends live. So do your siblings, cousins, nieces, nephews, and children, if you have any. That is a privilege those of your generation hold. Those younger than you hold even more. What I share with the people on this island is the language of loss. We are flip sides of the same coin. You might say that I am the last to still be alive.”\n“What about the others?” Lan-Yun asked quietly.\n“It takes more than an imperishable body to stay alive. We need more than ourselves and our own ambitions, especially as time drags on. People think I saved Max, but really it’s the other way around. With him I’ve found a tether to this world. Not everyone is so lucky.”\nIf we need more than ourselves, Lan-Yun thought, then maybe we’re all doomed without even realizing it. With no need to leave their homes for work or food, many deathless had tucked themselves away like collectible figurines in glass cases. Lan-Yun couldn’t remember the last time someone had made voluntary eye contact with her on the mainland, nor the last time she had seen more than a couple of people together, just sitting and talking, never mind gathered in protest and counterprotest. Occasionally, people still had children, if one could call beings grown in laboratories from cell lines “children,” but usually not until much later in life. No one was in a hurry to live because no one died.\nAnd yet, for all their freedom and potential, what had neohumanity made of their endlessness? All over the world, there were junkyards where people went to turn themselves off. Sometimes they had loved ones who searched for them; often they did not. Wind and rain ate through their clothing. Wild dogs urinated on their feet.\nNot that she saw the same despair in her own future, necessarily. She’d struggled too hard to stay alive while in her old body to give up life this easily. But as she’d started getting on in years—she was now nearing her seventh decade—she’d felt a kind of emotional flimsiness she found hard to describe, like the bonds between her and the world were dissolving instead of the connective tissue in her body. What would become of her in another three decades? Ten? The scientists created the first generation to live forever, but they never thought to ask how humanity was supposed to fill so much time.\n“So what do we do?” Lan-Yun asked, unsure if she was asking for the glass woman or for herself. Yet even as she said this, she realized she wanted the glass woman to stay on the island. She imagined meeting up with her every now and then like old friends. All of the things the glass woman must have experienced. All of the stories she could tell.", "source": "https://clarkesworldmagazine.com/chang-eppig_01_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last to Die by Rita Chang-Eppig"}