{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rich Larson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "talte4+gl13YUNdPeJ83BYKzK94=", "id": null, "license": null, "comments": "", "raw_text": "12640 words, novelette  The Green Man Cometh  Eris was kicked back doing some work on her glitchy left arm, tweaking the artinerves she didn’t have the cash to replace, when a fist pounded against her cab window. She startled; the hairpin she’d been using slipped into the wrong socket and her spidery metal hand flailed wild. Staticky pain flared through her arm and shoulder and made her hiss.  She yanked the pin out and pinched her arm shut until the polymer resealed. Flexed her fingers, pulled on her black driving gloves. Gritted her teeth as whoever it was kept on hammering at her opaqued window.  Eris switched it transparent and sound porous. The man on the other side was wearing a charcoal gray suit with haute couture slashes through the fabric, and he was running one finger along the wriggling green vines some shitty graffiti artist had sprayed onto her side door earlier that week.  “Cunt, don’t touch my cab,” she said.  He looked up, showing a gaunt symmetrical face with icy blue eyes that glowed a bit, meaning Optiks. He grinned unnervingly white teeth.  “I need a ride,” he said, probably thinking he could jerk her around because she was young and he was handsome. The haircut was the only thing that didn’t match up—buzzed down to stubble all over, instead of the long prehensile locks so in style for well-monied assholes.  “The little orange light means busy,” Eris said. “Try the ones with little green lights. I know it’s confusing if you’ve never used a cab before, or if you’re a shithead.”  In response, the man held up his sleek black tab and a non-refundable five hundred credit transfer marched across his screen onto the cab’s onboard. The digital chime sent dopamine down Eris’s spinal column. About ten times the going rate for even a cross-quadrant ride. Maybe when you were rich enough you lost track of that kind of thing. That much money, she could get some fresh artinerves for her arm and maybe even get the ugly green graffiti scrubbed off her side door.  Eris grudgingly switched her busy light off. “Where to, sir?” she asked, as the man climbed into the back seat.  “Lower streets,” he said, adjusting his lapels. “I’ll direct as we go.”  “I’d prefer a sataddress, sir,” Eris said, slipping her hands into the cab’s modified control sleeves. The engine hummed in response.  “Also, there will be a few people trying to follow us,” the man continued, ignoring her. “I hope that’s not a problem.”  “You clowning?” Eris demanded. She checked her cams. Back along Pier 17, through the file of waiting black-and-yellow cabs, she saw the hulking shape of a silver-colored private upcar drifting towards them. It didn’t have any distinguishing holos.  “They’re not sweepers,” the man in her back seat said. “Just overly curious individuals. Nothing unwholesome is happening here. All I need is for you to drive quickly and skillfully. I assumed from the customized chassis you can do that.”  Eris tongued the gap in her molars. The feedback spikes in her bad arm were getting more painful and coming more often, and turning it off left her clumsy as shit. New artinerves would make things a lot better.  Also she hadn’t done anything stupid in a long time, and it had been building under her skin like an itch.  “Dump another five hundred on me, I can drive better than anyone you’ve ever seen,” she said, shooting for the moon.  “Another five hundred,” the man said, winking one electric blue eye, “when we get there.”  She pulled them up off the pier, climbing into the dull yellow sky. The City stretched around them in all directions. Up, especially. Behemoth technicolored towers, rotating apartment blocks, sky tunnels that scythed and retracted in accordance with traffic patterns. Eris rose leisurely through a swarm of drones. In her underbelly cam, she watched the silver upcar follow suit.  “Lower streets, I said.” The man’s voice had a hint of annoyance now. His eyes were scrolling code. There was a lick of sweat on his hairline.  “I heard,” Eris said, letting the silver upcar close the gap a bit more. “Don’t toss up back there, alright?”  Before the man could reply, she dove.  Down. Eris felt the G-force all the way up her arms, singing through the artinerves, and she felt it in her gut. They plunged past the silver upcar; through the blur she saw a startled silhouette recoiling. The drones and anything with avoidance AI scattered. Eris dealt with the others herself, slaloming between two unwary drivers, swooping under a freighter. She had her own proximity alert silenced, but the other vehicles made angry wails as she hurtled past.  The silver upcar was only caught off-guard for a moment, then it dropped hard after them, a dive so steep Eris knew it had to be manual. She gunned the engine. A sky tunnel was extending below them, flexing into the air like a gigantic worm. A dock slid out from the adjacent building to meet it. There wasn’t going to be much of a gap.  She took it, twisting to fit, feeling the magnets of the dock sizzle through the cab’s onboard, up her arm. The sky tunnel slammed into its dock and sheared the air where her bumper had been a microsecond before, but they were through.  The silver upcar braked, angling to get around the tunnel. But by then Eris was away, spiraling into the traffic again, her heart pounding against her ribs. She checked the mirror. The passenger was flung back in his seat, howling. No—laughing. Somehow it made her like him a little more.  She headed for the lower streets.  “This is it?” Eris squinted down the alleyway.  They’d gone about as low as she ever did, into the City’s underbelly, and now were facing a grimy quickcrete alley splashed with animated graffiti. She couldn’t make out the words, but the lime green color was familiar. She had some countermeasures keyed up and ready to go in case a bunch of hoodlums suddenly spilled out to vivisect her cab.  “This is it,” her passenger confirmed. Once they’d shaken off the upcar, he’d gone back to his Optiks, muttering sub-vocals and blinking owlishly like any other boring businessman. It was sort of comforting, considering their strange destination.  When he unrolled his tab and sent another five hundred across, the money made Eris feel momentarily affectionate.  “Maybe dim those eyes of yours,” she suggested, triggering the door open. “Around here, they’ll take them out with a spoon.”  “Around here, maybe, but not here,” the man said, flashing all his white teeth again. He made to climb out, then paused. His sleeve whirred, and a custom calling card, wafer-thin, spat out into his hand. “You’re a good driver,” he said. “I might need that again.” He set the filigreed black card down delicately on the cushion. “Thanks for the ride.”  Then he was off into the alley, disappearing into the shadows. The graffiti wriggled the other way, startled, and Eris could finally read it. The green man cometh. Whatever the fuck that meant.  She looked at her screen again, at the easiest gee of credit she’d ever made, and grinned. She could take the rest of the day off if she wanted.  She wanted. Eris switched her orange light on, then lifted off and headed for home, which was a low slot in a grease-yellow honeycomb of converted storage units—and not the chic faux-po’ variety. But it had a good dock for her cab, and it was cheap. And compared to how she’d grown up, it was luxury.  Eris did the math in her head as she drove, slicing the Guild fees off the top and figuring out how much she would put away. She only remembered the calling card in her back seat as her cab snicked gently into its moorings. If he overpaid like that every time, it was worth holding onto. She dropped the partition and plucked it off the cushion, careful not to crush it.  She swung herself over the whistling gap in the dock’s metal floor and pushed her thumb to the apartment door. It tasted her genes and shuttered open, but the lights didn’t turn on as she stepped inside. She whistled a low activation note. Still nothing.  Something was wrong. Her heart leapt up her throat. The apartment was small enough that she could tell there were extra bodies inside, she could hear weight shifting, breath in and breath out. She felt an angry buzz through her prosthetics, biofeedback from the adrenaline. The left one spasmed; she had to grab and hold it with her right until it stilled.  Feeling the polymer muscle reminded her she had a little canister of stunspray tucked inside it. Eris moved slowly around the corner of the divider that separated the bathroom out from the rest of the apartment, her heart pounding.  Two people were waiting in the gloom, one of them draped on the side of the couch without laundry all over it, the other perched awkwardly on her orthochair, which was shifting all around trying to accommodate the unfamiliar body.  “What the fuck are you doing in my house?” she demanded.  The lights finally snapped on in response to her voice, and she got a good look at the intruders. The woman on the couch was tall and vaguely leonine, with heavy-lidded eyes and blocky cheekbones. Her black jacket was cut in a way that displayed both her long sinewy arms.  The man on the orthochair was smaller, also wearing black, and he didn’t have a face. Instead, the space above his neck was a rippling wash of pixels that hurt Eris’s eyes to stare at directly.  “We got a scan on your cab before you shook us,” the man said, in a voice stripped electronically of any identifying characteristics. “We’ve been waiting. Agents Ndirangu and Kit of the OCI. Arms out, please, Eris.”  Her first instinct was to call bullshit and feed them the whole canister of stunspray. People told stories about Operative City Intelligence the way they told stories about the bogeyman. But facial blurs weren’t something you could just pick up at the fabshop, and there was something else, too. Something the passenger had said. Not sweepers, just Overly Curious Individuals.  “That asshole,” she breathed, raising her arms.  Eris gritted her teeth while the woman called Kit searched her, first by scan—there was a familiar tingle as it noticed the first prosthetic, a bit of surprise on Kit’s face when it found the second—and then by hand. Eris hadn’t been frisked for a long time. Turned out she still hated it.  Kit slipped the calling card from Eris’s pocket, held it pinched between two sharp-looking fingernails for a closer look, then slid it into a Faraday pouch.  “You can keep the stunner,” she said, in a slightly gravelly voice that was younger than Eris had been expecting. “Just don’t do anything stupid with it.”  She stepped backward with a languid smile, which Eris did not return. The man, Ndirangu, had given up on the orthochair and was standing now as well. Eris knew she was in huge shit. Had to be. She’d probably just abetted an organ smuggler or contract killer or some such.  “First question,” Ndirangu said tonelessly. “What do you know about the Green Man?”  “Fuck all?” she said back. “Look, I just drove him. I didn’t know who he was, didn’t know who you were. He said you weren’t sweepers.”  “Technically correct, although our work does occasionally overlap with City Law Enforcement,” Ndirangu said. “Second question. What do you know about Ferris Carrow?”  He raised one smartgloved hand, and a holo bloomed to life on the wall, showing an image of an unsmiling woman with a surgically-ageless face, her silver-blonde hair sheared to professional spikes. Eris folded her arms, and in her peripheral she noticed Kit mirror the motion.  “Don’t know her,” Eris said. “Should I?”  “Ferris Carrow owned half the filtration plants in the City, and a quarter of its fabbing industry,” Ndirangu said. “Very wealthy, quite influential. She was murdered three days ago.”  Eris felt her knees go weak and watery. “You think I had something to do with a murder?” she demanded.  “We think the man you helped evade us did.” The holo shifted, and now it showed Eris’s mysterious passenger, high-angle, stepping into her cab. “Arno Schorr,” Ndirangu said. “A philanthropist, businessman, and one of the founders of a doomsday cult. The Church of the Green Man.”  “Never heard of it,” Eris said, trying to figure out where his eyes were so she could meet them, so he would know she meant it.  “They’ve been trying to get religion licensing for the past couple months.” Ndirangu gave a stiff shrug that might have been annoyance. “Before her death, Ferris Carrow appeared to have taken an interest. Basic doctrine is rejection of personal technology. Nature worship centered on a singular deity. A mishmash of Pagan and Luddite with ties to the Neoprimitive movement.”  The penultimate word made Eris’s eyes narrow. Her City basic had no trace of colony accent left, and she told anyone who asked that she’d been born in the lower streets. But this was the OCI. The OCI knew things.  “I didn’t pick where I was born,” she said shakily. “They shipped me out of the Neoprim colony when I was a kid. I’ve never gone back. I don’t have any fucking ties to it anymore.”  “I’m aware,” Ndirangu said calmly. “And there’s really only one tenet of the Church of the Green Man we find worrisome. They’re extinctionist.”  “Extinctionist?” Eris tried to make her voice even again. She didn’t like being reminded about the colony. Those were memories she kept in cold storage.  “They think it would be best for the planet if we all died off,” Kit said darkly.  Eris crinkled an eyebrow. “Does anyone not think that?”  “The difference is, they’d like to do something about it,” Ndirangu said. He waved his hand and the holo shifted to a sprawling green graffiti on corroded metal wall. He read it aloud. “Humans are a virus, City is its last bastion. The Calamities were not enough to clean the world. But fear not, the Green Man cometh.” He paused. “At first we didn’t take it particularly seriously. Criminal mischief, nothing more. Then Ferris Carrow was found like this.”  The holo churned and Eris’s stomach churned with it. The same woman, but lying on her back, now, with dark congealed cuts laddered up her legs and her stomach blown open. Someone had packed the exit wound with dirt, and out of the middle a little red flower was blooming.  Eris swallowed back bile. “Fuck,” she said. “Fuck, switch that off. You think I had anything to do with that, you’re insane.”  “We know you didn’t, Eris,” Ndirangu said tonelessly, turning his glove’s holo off. Eris felt a wave of relief that cut short at his next words. “We just want you to have an understanding of the gravity of the situation before you sign this waiver.”  “What kind of waiver?” she asked. Kit was staring at her again, her arms, her legs. She had a bad feeling in her gut.  “Schorr is going to need to transport something soon,” Ndirangu said. “Something we believe he smuggled out of the colonies on his most recent visit. We don’t know what, exactly. But it’s possible he’ll call on your services. You were impressive.”  “I’ve done better,” she said on automatic.  Another snort from Kit. Ndirangu didn’t react. Or maybe he did. Who knew?  “We’re going to use you to get to Schorr. Gain his trust.”  Eris blinked. “What, so I’m a spy now? I drive a cab. I’m not up on espionage. And I don’t want anything to do with a fucking murder cult, anyways, thanks.”  “We wouldn’t dream of using an untrained citizen,” Ndirangu said. “No, you’ll simply be along for the ride. Agent Kit will be doing all the work.” He held up his left hand and the smartglove’s palm turned white, with minute black text scrolling across it. “This is a basic waiver for use of your body in the event of an OCI operation. All it needs is your geneprint.”  Kit moved a thick strand of hair away from her temple and Eris saw the glinting neural link clinging there like a beetle. The way she’d been staring, the way she’d been mimicking, made sense all of a sudden.  “No way,” Eris said. “I don’t do that brainshare shit. I don’t want anyone in my head but me.”  “Brainshare is a bit of a misnomer,” Ndirangu said. “The waiver states clearly that we’ll have control of your central nervous system, but no access to your thoughts or memories. That all remains quite safe, and quite private.”  “I don’t want her in my body, either,” Eris snapped, giving Kit a side-eye. “I don’t want anything to do with this. Just bill me for the traffic violations, okay? Just go.”  “I’m afraid this is more important than what you do or do not want,” Ndirangu said. “If you sign the waiver, you’ll be fully insured for any injuries occurring to your body. And once the OCI operation is deemed complete, you’ll be compensated for your time, as well.” He reached underneath the orthochair and pulled out a sleek black carry-case Eris hadn’t noticed before. “If you don’t sign, we may have to . . . investigate you.”  “For what?” Eris demanded.  “Schorr chose your cab because it had the Green Man tag on it,” Kit said coolly.  “Someone did those vines last week while I was docking,” Eris protested. “I’d never paint up my own cab.”  “Maybe the OCI is willing to chalk that up to coincidence,” Ndirangu said. “But the fact that you were born in a Neoprim colony may be one coincidence too many. It might warrant surveillance. Which might have a negative impact on your livelihood.”  Eris’s mind whirred in circles. She should never have let that asshole into her cab. If she didn’t sign the waiver, she would be trying to drive through a swarm of follow-cams for the rest of her life, or worse. In the stories, people who pissed off the OCI eventually just disappeared. Kit could have definitely disappeared a few people, judging from the stare on her.  And that was who she was supposed to brainshare with. Eris tongued the gap between her molars. The stupid decisions were piling up now, but it wasn’t like she had much of a choice.  “I want to get ghosted on all traffic cams,” she said. “No violation notices for the rest of my life.”  “I think we could arrange something like that,” Ndirangu said. “This is, after all, rather important.” He put out his left hand. Eris figured he was lying about the traffic cams, but she’d mostly said it to save some dignity, which he was letting her have. She could bet Kit wouldn’t have.  Eris spat on her hand to ensure a DNA reading, then shook. The smartglove rasped against her skin like a cat’s tongue, then chimed an affirmative.  “Excellent,” Ndirangu said. “We’ll get right to inserting the implant.”  The sleek black rectangle unfolded on spidery limbs, and Eris realized it wasn’t a carry-case. It was an autosurgeon. A shudder ran all the way through her.  “Wait,” she said, her mouth feeling suddenly thick and warm. “Here?”  “Here, yes,” Ndirangu said, his voice sounding even more distorted than usual. “There’s little time to waste. I gave you a dermal sedative through the glove. That’s mentioned in the waiver as well.”  Eris felt the old hospital panic kicking up through her, dulled only halfway by the drug. She backed away and stumbled. Someone caught her—Kit caught her—and lowered her down onto the floor. She felt a pillow slide under her skull, cushioning it. Her whole body was heavy and she could taste copper in the back of her throat. Familiar.  “It’s fast,” Kit’s voice said. “You won’t remember it. I don’t.”  Then the autosurgeon was spreading overtop of her, reaching with calipers and braces, clicking and sliding. Too familiar, too familiar. Before the prostheses, they’d tried twice to grow her arms, but the surgery always failed. The flesh never took.  She squeezed her eyes shut.  “Didn’t have to spring the sedative on her,” Kit’s voice came faint, accusing. “Could have just told her.”  “Not with her profile,” came Ndirangu’s, but different now, free of the mask. “She’s not as tough as she thinks she is.”  Eris wanted to say yes I am, yes I fucking am, but she wasn’t sure and her mouth was too numb and her whole body was turning rubbery and—  Eris woke up doing calisthenics in her empty apartment. She could see her reflection in the dulled smartglass window across from her, bending and stretching. The display told her it was morning, nearly ten o’clock.  “What the shit?” she demanded, or tried to. What came out was a strange slur through clamped jaws. Then her mouth opened without her and spoke back.  “Sorry. Just getting calibrated.” The voice was hers, she could feel it rumble in her chest, but it wasn’t hers at all. “I’ll be out in a minute.”  It all came back like a tsunami. The man with the shaved head and slashed suit, the one thousand credits, the black-clad OCI agents waiting for her in the dark. Doomsday cults and a dead woman with a flower in her gut. The last thing she remembered was putting her signature on some kind of a waiver.  On a brainshare waiver. That was why she couldn’t move her own muscles—Kit was moving them.  Fuck that. She tried to wrench her right arm down and away, abandoning the stupid yoga pose.  She got nothing. Not even a twitch.  “You can have your mouth back while I finish up,” Kit said.  A weird tremor went through Eris’s tongue. She spat, like she was getting a bad taste out, but somehow managed to slobber it down her chin. Her reflection in the window was drooly and dazed-looking.  “Where’s the implant?” she said.  This time the reply came in Kit’s voice, slightly raspy, thrumming through Eris’s head. Subcutaneous. Some skin-spray to cover the scarring. Should be undetectable.  Eris watched with some measure of revulsion as her reflection started doing jumping jacks. This was so fucked.  “This is so fucked,” she puffed.  I’ve been looking at your augments. Really modded the shit out of your arms, didn’t you. Reflexes way past standard. No wonder the artinerves are nearly burned out. No wonder you can drive like that.  There was some admiration in her voice, but Eris didn’t want to hear it. She felt sick and angry, imagining Kit sitting on the couch testing her arms out like a new toy or some shit. Like all of her was a toy.  “Yeah, that makes it so worth it,” Eris said. “Maybe I should lop a leg off, too, huh?”  Her face in the window twitched, which had to be Kit.  That’s not what I meant. I meant it was good wire work. That’s all.  “I could always drive like that,” Eris said. “So fuck you.”  The jumping jacks stopped.  Done calibrating. Kit, acting like she hadn’t heard the last bit. Not the worst body I’ve had to work with. Just go about your normal routine, if possible, and I’ll be ready to take over when Schorr contacts you.  Suddenly her muscles were all hers again, and she toppled. She caught onto the edge of the orthochair as she went down; the cantilevers whined and propped her back up. Her wobbly legs turned solid again. She straightened, muttering curses.  “Go about your normal routine, Eris,” she said through her teeth. “Ignore the OCI bitch kicking around in your brain.”  But it was a relief to have her body back. And whatever Kit had been doing had actually left her feeling pretty good. Loose, warm. Bit of a sweat on. She put her hands on her hips and surveyed the dull gray cube of her apartment, looking for evidence of the agents’ intrusion, but they’d left everything in its place or not-place.  A tumble of clean underwear and colorful shirts heaped on the end of the couch, which was also her bed. Work bench in the corner strewn with parts and a coil of conductor wire. On the floor beside a vat of sealant, her dad’s old magnetic chess set that she sometimes hooked to the net when she was feeling masochistic. Canary-yellow scarf, jacket with a stubborn oil stain. Two juggling balls rolling and bumping against the heaped jacket where the third was trapped underneath.  Apart from her cab, it was all she had to show for a decade in the City. It seemed messier and shabbier and shittier knowing Kit and the faceless one had been lounging around in it. Nearly made her want to clean up.  Over on the kitchenette counter, she saw the filigreed black calling card waiting. She gave it a wide berth as she slid open the fridge. There was nothing floating in the gel but hot sauce and a tube of yogurt. She felt antsy, and hungry now, too. She picked the calling card gingerly off the counter and slid it into her pocket. Maybe Schorr wouldn’t call anyways. Maybe the OCI had wildly miscalculated.  As if she could be that lucky. Eris left and locked the door behind her.  “Bet you can do all kinds of nasty things with them.”  Eris was nearly home again, halfway through the corridor from the main hub with a biodegradable bag of groceries slung over her shoulder, when the ragged man who’d been sauntering a few steps behind her spoke. She turned over her shoulder.  “Fuck you say?”  “Nothing,” the man replied, but his eyes trailed longingly up Eris’s left arm, which was still twitching sporadically, then the right. His skin was pale, sallow, and his eyes were shot through with pink. Tweaked on something. “Just that you can probably do all kinds of nasty things with those artis of yours, is all.”  She would’ve let it go, because tweakers and technophiles weren’t worth the time to spit on, but she was still antsy. Maybe the OCI were watching through her eyes. Maybe they’d sent this fuck as some kind of test. Or maybe Schorr had sent him.  “All kinds of things,” the man repeated with a placid smile, reaching to run his fingers over the exposed polymer. She batted them away hard; he blew on them and laughed. “Beauties, them.”  That was it. Eris set her groceries down. “They could tear your tiny fucking prong off if you don’t get lost, cunt.”  The man’s smile dissolved. He gave a slow blink, then his face turned angry. “If you can’t take a compliment, wear skin sleeves on them,” he said.  He took a menacing step and Eris stepped back in sync as she checked him over again, trying to guess if what he was on would make him quicker or make him clumsier. The veins in his neck were all taut blue. Could be Taurus, which would be bad news.  Eris wanted smash her knee up into his thickening hard-on and only unload the stunspray if necessary. She didn’t want to give him the satisfaction of touching him with her arms.  But she was frozen. A weird thrum was going through her locked-up muscles and she couldn’t move a millimeter. The man took it for fear and his smile came back. He had a nose for blood in the water; he was glancing up and down the empty corridor.  Eris couldn’t even cuss out whatever dumb fucking glitch in the brainshare implant was seizing her up. Her jaws were clenched too hard.  The man went to grab her arm, and suddenly she moved.  Too fast to understand. She felt contact, displaced air, and displaced cartilage, then she was wiping something warm off her forehead while the man wailed on the dirty floor of the corridor. Blood was gushing from his nose and his kneecap was shifted over from where it ought to have been.  She’d gone through his grip somehow, done his nose in and crunched his knee and come back up like elastic. She wasn’t even breathing hard. She was a fucking ninja.  “Next time you’re dead,” she said, feeling wild, feeling dangerous, even as she picked up her smiley-face-decorated grocery bag. “Got it?”  He only groaned. Eris headed back to her apartment, riding the adrenaline like a riptide. It took her a moment to realize what had happened.  “I don’t need your fucking help,” she said. “Kit? I know that was you, Kit.”  I know you didn’t need help, came Kit’s gravel voice. That was just for my personal satisfaction. If Ndirangu asks, it was all you.  Eris considered it. Kit didn’t sound like she was lying. She sounded kind of pissed off and pleased at the same time. “Alright,” she said, then, grudgingly, “I guess that was pretty slick. How you did the knee like that.”  I’ve done better, Kit said, and for a second Eris liked her.  Then the calling card went off in her pocket.  Kit did the talking, and it surprised Eris how much she managed to sound like her, down to the cursing. Then again, she was a professional and the conversation hadn’t been a long one. Schorr’s distorted voice had requested her for a transport job, vehicle provided, an hour’s work at most, possible pursuers to shake. In exchange, five thousand credits, and none of it going through her cab for the Guild to skim fees off of.  Kit, in Eris’s voice, had agreed, and the calling card had denatured to a handful of gritty black gel that she’d dumped in the nearest recycler. Eris had gone home, eaten and put away groceries, and dipped her arms in sealant to take a shower. She didn’t think Kit would be watching, but she did it without looking down much just in case.  And now, in the growing dusk, she was walking down Pier 24 to the boxy white delivery van that had been left docked exactly as Schorr had described. She’d already stopped at a specific trash receptacle to pull out a smartglove and tiny gun. Eris felt a cold ball of ice in her stomach. She knew that whatever she was transporting was going to be unwholesome. She hoped it wouldn’t be a dead body.  She stopped in front of the unmarked van and grimaced. “That woman, Carrow,” she muttered, picturing her passenger’s icy blue eyes. “Was Schorr the one who killed her?”  For a moment there was no reply, and she imagined Kit out getting a tea or something, but then her voice sounded in her skull. He has an alibi. But Ndirangu’s positive he ordered it. Ndirangu’s usually right.  “Why’d he have a blur mask and you didn’t?” Eris asked, hoping Kit couldn’t tell she was delaying the inevitable. “You forget yours?”  There was a pause. Haven’t earned it yet. Hopefully this op makes it happen.  “Wait, you’re not some kind of fucking rookie, are you?” Eris demanded. “I thought this Schorr guy was a big deal for the OCI.”  I was the best match for the brainshare. Kit’s voice sounded slightly miffed. I’m taking over now.  Eris felt the thrum all through her body again. She’d always hated being a passenger and she hated this even more. At least Kit left her her mouth, tingling and thick-feeling but functional.  “I can drive,” she pointed out.  Liability issues. We’re now on clock for an official OCI operation. Besides. I can drive, too.  Kit peered inside the van. Eris thought about pointing out the non-standard dampers and a drive stick that would take some adjusting, but Kit seemed to be looking in the right places. Maybe she’d been the one driving the silver upcar yesterday, which now seemed like at least a whole week ago.  Kit walked around the outside of the van next. The back was hermetically-sealed and humming refrigerated. Big fancy lock on it, too, with sliding black flanges and glowing red vents.  “So you don’t know what he’s transporting?” Eris asked.  No.  “You going to look?”  Deadman’s lock on there. If I fuck up the whole thing will self-torch. So, no.  “Fair.”  Eris didn’t like not knowing, but there were a lot of things she didn’t like going on.  She felt a little dart of satisfaction when Kit nearly bashed them into a wall undocking, not prepared for the upped sensitivity in her arms. But she smoothed things out after a few minutes and then Eris could tell that she was a pretty decent driver, despite the van handling like a blue whale or something else huge and extinct.  Dusk deepened as they drove, and all the City lights were coming alive. The harsh arcs of artificial sunlight, the soft blue-and-purple bioluminescents like bruises, the swirl of neon and argon. The lights were under them and above them and reminded her of the field of stars she’d always had overhead as a kid but didn’t quite measure up.  The van’s onboard was programmed to feed directions bit by bit, the same way Schorr had done from her back seat, but it didn’t take long for Eris to figure out they were heading to the same place as last time.  “Take the under,” she said. “Quicker.”  Kit stayed the course for a second, thinking it through, then grudgingly dipped into Eris’s recommended traffic vector.  You know your way around like you were born here.  “Been here ten years. Cabbing for five of them.” She paused, then, maybe because of the lights, she spoke again. “Sometimes, it feels like I was born here. Feels like New Tenochtitlan was a dream. It’s different over there.”  Your parents were first-generation emigrants to the colony, it says. Relatively wealthy.  “Yeah,” Eris said. “Wealthy. And they gave it all up to go live in the dirt like the good old days. Gave up their Vaxine and their genetech, too.”  There was a long silence. The lights weren’t as beautiful now.  How did you lose your arms? Kit finally asked.  Eris ground her teeth. She’d hoped Kit would be one of the people who never bothered asking. “You know everything,” she said. “You tell me.”  Your file doesn’t say.  “Because I was born like this.”  A pause. That doesn’t happen anymore.  “Not in the City,” Eris said. “In the colonies it does. No genetech, remember?” She breathed out a bitter laugh. “My mom died having me, and my dad sent me away when I was twelve. Thought it would be better for me here. But he stayed. Haven’t spoken to him in years and years.” Something pulled too close for comfort in her peripheral. “Get some fucking space off that,” she muttered. “We’re wider than you think.”  Has to be close. I called in a scanner to see what’s in the back.  The dull gray upcar pulled even closer to them as they drove, and Eris felt a shivery whine in her teeth as the scan started. She hoped Kit was focused on that and not the old tears building up behind her eyes. She couldn’t move her hands to press them away, but she had enough control of her face for a few hard blinks. She didn’t like thinking about the colony.  “So what do we have?” she asked flatly.  Kit didn’t answer for a second. When she did, her voice had an edge to it. Nothing. There’s nothing in the back.  Eris felt the ball of ice again, this time rolling slow down her spine. They were in the lower streets now, deep City, where the lights were old and yellowed and fought a losing battle with the thickening dark. Eris was trying to think of reasons why someone would pay her to transport nothing at all when they arrived at the alleyway.  Kit swung her out of the van. Her shoe crunched on something in the shadows and she was momentarily glad Kit was running things, because if it had been just her she would’ve jumped at the noise like an idiot.  “Good work.”  It was Schorr’s voice. He was standing at the mouth of the alley, hands in his pockets, his electric blue eyes glowing enough to illuminate the bones of his face. Two tall men with the same close-cropped hair were at his shoulders. Eris remembered what Kit had done to the tweaker in the corridor and it made her feel a little better.  “Let’s have that five thousand now, or I hop back in and drive this shit straight to the sweepers,” Kit said with her mouth. Over the tailored shoulder of Schorr’s suit, Eris saw two more white vans in the alley, identical, and something was being unloaded from the closer of them onto a hoverjack.  Schorr moved just slightly and her view was blocked. “I’m a man of my word,” he said, tapping at his tab. “Drop the van at this sataddress. Enjoy the rest of your night.”  Eris felt her own tab, wrapped around her wrist, rumble at the data transfer. “What, you’re not going to unload it?” Kit demanded.  “Nothing to unload,” Schorr said. “You were driving one of the decoys. I’ll put your mind at ease.” He slid his hand against the deadman’s lock. The doors sprang open. Eris saw a billow of steam and then nothing else, just bare white walls as the scanner had predicted.  “Okay.” Kit made a show of checking the payment on her tab. “Pleasure doing business, I guess.”  Schorr swung the doors shut, and Kit climbed back in the driver’s side. Eris caught a last glimpse of what they were unloading: a big crate, bigger than she was, covered in a black shroud that seemed to eat the light.  As soon as they were around the corner, Kit triggered the autopilot and jumped right out of the van, rolling more gracefully than Eris would’ve managed.  “So what now?” she demanded once they were on their feet.  Sneak in. See what he actually brought down here. Kit unrolled the smartglove and pulled it on, then slid the gun—it was a biogun, calcium spikes instead of traceable bullets—into Eris’s waistband. It was pretty fucking uncomfortable.  But she had to admit she was curious, too. She’d seen only a slice of the crate and now she wanted to know what was inside, the same way she’d always wanted to know what was inside an upcar carapace or engine block.  Kit crept them back around the corner into the alley, which was now deserted. The other vans and drivers had gone on their way. Halfway down, she stopped in front of a rusty metal door in the alley wall. After a few moments of tuning the smartglove, Kit found the lock and popped it.  She swung the door open, and Eris could feel a damp coming from inside. She would have shivered. Even Kit seemed hesitant for a second, but maybe she was only scoping things out. As they stepped inside, retrofitted biolights bloomed to life, providing stark contrast to a grimy cracked corridor. Eris’s eyes stung a bit as Kit did something with the smartglove again.  Not picking up any surveillance cams. Good.  “Great,” Eris echoed. They walked forward. Foam insulation was oozing from the walls, and at the end of the corridor she saw an ancient-looking elevator with actual physical buttons to push. Only the down arrow was still intact.  They were going to go even deeper. Eris felt a whine rising in the back of her throat and tamped it down. Kit thumbed the call button.  Dispatch might have a hard time finding us down here. This is pre-Calamities architecture. The City’s old bones. It has a way of screwing with our scanners.  “What about with the brainshare?” Eris demanded. As much as she disliked having Kit run the show, she didn’t want to find herself suddenly alone down here, either. She’d never fired a biogun, or any kind of gun, and she had a feeling stunspray wouldn’t cut it if Schorr and his thugs suddenly popped out of the dark.  That uses an entanglement drive. I wouldn’t worry.  “I’m not worried,” Eris said. “Hop in the elevator already, chicken shit.”  Kit did, and as the doors slid shut behind them Eris felt like she was going to be sick with fear, and couldn’t help but wonder if some of it was from Kit. The elevator sank and sank. The air felt like it was thickening, squeezing her temples. Maybe just her imagination.  She was relieved when the box came to a stop. Kit jammed her thumb on the close door button to keep it from opening. Eris listened, wondering if Schorr was standing on the other side, waiting for them. But when Kit fed a little hairline cam from her smartglove through the crack in the doors, it showed all clear.  They slipped out into a tunnel. Its ancient concrete was splinted by nanotube resin that glistened wetly, making it feel like the gullet of some animal. The air was definitely thicker down here. Damper. It clung to the back of Eris’s throat. Kit moved them forward slowly and stealthily. The lights flickered, like the power was being rerouted, and it made Eris see things in the shadows that weren’t there.  A T-intersect approached, and as they reached it Eris heard footfalls. Kit scuttled back a step. Crouched. They clung there against the wall as one of Schorr’s men trundled past. Eris wasn’t sure if it was her or Kit holding her breath, but it didn’t get released until he disappeared around the next bend.  They started moving again. Eris wanted to suggest that maybe Kit should have just shot him, to give them one less problem to deal with later, but Kit had her mouth sealed shut. They came to a halt outside a door that made Eris’s heart hammer hard. They had passed plenty of doors, but this one was different. It had been widened to fit the crate.  Kit sent another hairline cam, jiggered another lock, and then they were inside. Lights flicked on unbidden, harsh white, surgical, and Eris saw the crate had been opened.  A glass-and-metal sarcophagus was propped upright facing them. And inside it, she saw a mass of thick green-black ivy and decomposed flesh that she knew had been a human being once.  Eris’s stomach revolted, but she couldn’t avert her eyes, couldn’t keep from tracing the poisonous green roots and tendrils that tangled through cracked bones, the bubbling brown spores clustered at the groin, under the arms. The face was burst open and flowering a bright poisonous red.  “Shit,” she whispered.  Shit, Kit agreed.  “I see you’ve met the Green Man,” Schorr’s voice said from behind them.  Kit whirled; Schorr had something out of his pocket, a spindly metal thing that Eris didn’t recognize. He flung it outward, pointing it right at her face, and instead of somersaulting away or snapping it out of his hand or doing any other kind of ninja thing, Eris found herself frozen again. The thrum was all through her body this time.  Fuck, fuck, fuck, it’s a halo. I’m going to lose you. Look, Eris, just stay calm and—  Kit’s voice cut out. Schorr stepped forward, twisting the thing together, making it into a circle. He set it gently on her head like he was crowning her. It tightened and clung there.  “This should help you feel a little more like yourself,” he said.  Eris realized her muscles were hers again, but when she tried to move her arms they didn’t respond, hanging there heavy as lead. The halo was fucking them up, too. Her chest went tight with panic.  Kit was gone, and now it was only her, stuck somewhere underground with the leader of a doomsday cult and two of his thugs, one of whom had already found the biogun in her waistband, and Schorr knew about the OCI and the brainshare and she was dead dead dead. She felt oddly numb as they stripped her of the weapon and the smart glove and dragged her away from the sarcophagus. Her arms dangled uselessly.  “All this for a fucking corpse?” she asked. She knew she should be using whatever time she had left to make a case for her life, but somehow, even facing imminent death, the Green Man was still the scariest thing in the room.  Schorr didn’t answer for a moment, walking to the sarcophagus instead and placing his hand against the glass. “You’re from the colonies, aren’t you? At first I wasn’t sure. There are so few of you in the City. Only a handful in nearly a billion inhabitants.” He paused. “Do you like it here?”  Eris gave a shrug that she hoped looked contemptuous and unafraid. Whatever Schorr was playing at, he hadn’t killed her yet.  “From a certain perspective, it’s everything our ancestors dreamed of,” Schorr said. “Triple the size of any the old metropolises built before the Calamities. Towers to heaven, cars that fly, one language, no hunger, no . . . disease.”  His face turned hard and angry.  “And all it cost us was seventy percent of the world’s population in a century of mass death,” he said. “But after all that, all the wars, the floods, the famines, we didn’t learn a thing. Not one thing. Forward thinkers did their best in the aftermath. The Neoprim movements, for one, tried to show people a better way.” He gave a smile that reminded Eris of the tweaker Kit had wasted. “The fact that you were born at all is thanks to that better way. You would have been an early termination here in the City. It’s easier to be cruel when people become populations. When they become numbers.”  Eris couldn’t help thinking of the serial numbers on her arms, the license holo on her cab, the figure in her Bank account that seemed to be always eroding and never growing. The City did make her feel like a number. The City was cruel in a lot of ways.  “But the colonies aren’t enough,” Schorr continued. “The mass exodus we envisioned never happened, and now the City is swelling like a tick. Repeating all our old mistakes. The only true solution is a full reset. Acknowledge that everything from agriculture onward was a blip on the radar. That’s where the Green Man comes in.”  Eris shot another look at the sarcophagus and wished she hadn’t.  “The colonies made themselves useful in another way,” Schorr said. “As a breeding ground for disease. One of which was a fast-acting fungal infection, a particularly vicious strain we’ve never seen before. It decimated two separate colonies before it was contained.”  Eris’s heart dropped. “Bullshit,” she said. “I would know.”  But she wouldn’t, she knew she wouldn’t. She avoided anything to do with the colonies because it was easier to slice off that part of her life and cauterize it, and here in the City people didn’t care what happened in the colonies. They didn’t talk about them.  “This was the only body I managed to save from incineration and have smuggled over,” Schorr said. “A lot of lives were lost. More to come. But none in vain.” His eyes were shining. “Humanity’s going to return to its rightful place. Gaia to hers. We’ll be at peace again, like we were for the first hundred thousand years.”  A cold question had assembled itself in the corner of Eris’s mind. She asked it now, hoarsely. “Which colonies? Which colonies were wiped out?”  “Which colony are you from?” Schorr asked.  She could barely force the syllables from her lips. “New Tenochtitlan.”  Schorr’s face twisted. “I’m sorry,” he said. “None in vain.”  Black pushed in the sides of her vision. Eris felt herself sink to one knee. She was back in the colony, sitting in the compound dirt with her dad across from her, the magnetic chessboard between them. He was tall and stern with his white beard stark against lined brown skin. He was saying that it would be better for her in the City, and she was thinking that if she could just manage to win the game, he would let her stay.  But she’d never won against her dad, not ever, and she never practiced with anyone else because she spent all her spare time in the field driving the village’s battered utility upcar or taking apart motors in the garage. She didn’t win that last game, either.  Eris kept her head down as one of his men led her out of the room, back into the tunnel. If she didn’t look up at all, she wouldn’t be able to look for traces of her dad in the overgrown green corpse.  They put her in a storage room, under guard, with a folding chair that sprang upright when she bumped into it. She’d asked, dully, if they were planning to sacrifice her or some culty shit like that. Schorr had laughed before walking out.  She ignored the chair and collapsed down against the wall instead. It felt like she was having a nightmare. She felt hot thick guilt for how she never talked about the colony, how she pretended to herself she’d been born in the City like everyone else. She’d spent so long trying to forget her father who’d sent her away. Trying to focus on her arms, on her cab, on things she could change and repair. Now she could see so many old familiar faces in her head, and they kept bursting apart like the Green Man in the sarcophagus.  She squeezed her eyes shut and tried to make it all just disappear. It didn’t.  She would have to change it.  Eris opened her eyes. No matter how cruel the City was, it was full of innocent people, same as the colonies. Kit and the OCI needed to know about the Green Man, and that meant she needed to get rid of the halo somehow. She turned and dragged her head along the wall, feeling for the halo’s metal edge. It wasn’t loose enough to knock free, but not as tight as she’d feared, either.  Eris kicked off her shoes and pawed off one sock and then the other. Her arms were dead useless weight at her sides, but they hadn’t tied her legs. She scooted back, leaning her shoulders against the wall, and stretched.  She’d lost a lot of flexibility since she’d gotten her artis, but not all of it. Brushing her big toe against the halo, however, resulted in a sharp shock. She swore, yanking her foot back down.  “Alright,” she breathed. “Fuck it.”  She stretched again, muscles straining taut, and wriggled her big toe underneath the edge of the halo. The shock bit hard; she saw a hot blue spark fly in her peripheral. Clenching her teeth, she gripped the halo between her big toe and long toe and pulled.  It clattered to the floor, spinning like a coin. She silenced it with her other foot. Hopefully the man standing outside hadn’t heard it. Eris tipped her head back against the wall, breathing hard, as feeling returned to her arms. The pads of her toes were blistered red, but not blackened. She figured she would be able to walk properly.  What’s happening? Kit’s voice came blurred, indistinct. Are you alright?  “Yeah, I’m fucking great, Kit,” Eris said in a whisper. “Schorr’s got a sample of some kind of plague. Something he brought back from the colonies. He’s going to release it here, and then everyone is fucked.”  There was a pause that nearly made her panic, made her think Kit’s signal was gone again. The Green Man cometh. Shit. That thing was supposed to have been eradicated. Kit’s voice was agitated, but louder now, clearer. There’s a strike team waiting in the alley. But we’re not equipped to contain a bioweapon. I’m coming in.  Eris’s body thrummed and her head started twisting without her volition, making a sweep of the storage room.  Have you seen anyone else down here?  “Still just Schorr and the two big fuckers,” Eris muttered. “He told one of them to watch the door.”  She shut her mouth as Kit pushed her face up against the door, listening. Eris heard the sound of shifting weight, fabric rubbing fabric. Kit nearly lost their balance as the door swung open.  For an instant Schorr’s man was framed in the doorway, and Eris looked up him like a mountain, the hormone-popped muscle and buzzed head and green tattoos creeping out from his cufflinks. His face was unworried, Eris figured because the last time he’d seen her she’d been crying like a little baby and because she didn’t have working arms, besides.  “Schorr wants you at the ceremony,” he said, and then he realized the halo was no longer on Eris’s head and his eyes went wide.  Kit dismantled him. Cartilage cracked, air thumped out of a collapsed lung, dead weight slammed the floor. He was still struggling for breath in the fetal position as Kit retrieved the biogun and used Eris’s arms to lever him into the room. She shut the door neatly behind her and the lock buzzed active. It was a good thing Kit was still using her mouth, because Eris knew she would’ve let out a triumphant whoop right about then.  That’s music, isn’t it?  Eris concentrated. It was. Chanting and drumbeat, faint but audible. The kind of faux-primal shit she remembered hearing as a kid in the Neoprim colony.  “Yeah,” Eris said, finding her mouth was hers again. “Let’s go.”  They followed the sound of the synthesized drums and wailing, quickly and quietly. Normally Eris’s feet slapped a bit when she walked, but not with Kit moving them—she was poised now, all coiled and balanced like a cat. It made her more hopeful Kit could handle whatever they found at the end of the labyrinth.  Rounding a pitted corner, the music grew louder and Eris started to see small bundles lining the walls, shoes on top.  “Clothes?” she demanded in a whisper. “Why the fuck are people taking their clothes off?”  Don’t know. Maybe it’s for some kind of fertility ritual.  “As in, a big fucking orgy.”  Yeah. Some of them do that.  The music reached a fever pitch, then cut out entirely. Eris’s ears felt swamped by the sudden silence. Kit hesitated, then moved ahead even more slowly, creeping towards a pale yellow light leaking from the next corner. She hunkered low and poked Eris’s head around to look.  Their tight corridor was one of several emptying into a much larger room, and the room was full of people. They were all naked, and as much as Eris wanted it to look funny or stupid, it didn’t. It looked eerie, all of them standing there in rows in the ghostly yellow light. Some of them had smartpainted their bodies in twisting green vines that slithered up and down their bare skin. Other than that, they were stock-still, all of their eyes fixed on the makeshift plinth in the center of the room.  The figure standing on top of it wore ragged robes over a long coat. Their face was hidden under some kind of military issue gas mask, vaguely insectoid, daubed green and brown and set with skeletal antlers. Eris felt a shudder that might have been hers, might have been Kit’s. That had to be Schorr. And looming behind him, propped upright in a sort of groove, was the sarcophagus.  “You’ve been called here to receive the Green Man’s blessing.”  Schorr’s voice, dead and amplified, split the air.  “Tonight is the beginning of the end, my friends.”  The naked men and women started to chant something back, raising their hands, then Eris’s view was blocked as Kit pulled her shirt over her head.  “What are we doing?” Eris hissed, muffled by the fabric.  He’s inoculating them, right? These are his followers. Kit peeled her trousers off next, see-sawing them off her hips. We can join in. Get close enough.  “And then?”  Kill Schorr.  “What, with my bare fucking hands?” Eris demanded. Kit kicked off her shoes and shucked off her bra and underwear.  With no hands. I’m going to have to take your arms off, Eris.  Eris blinked. All the naked bodies, some of them scarred, none of them with visible implants or prostheses. She remembered back to what Ndirangu had said all those eons ago. Neo-Luddite. Rejection of technology. She wondered if they knew Schorr had Optiks.  Okay? Kit’s voice sounded almost ashamed.  Eris tongued the gap in her molars. “Okay,” she said. “Let me do it.”  Now she was almost sure it was a nightmare. With Kit directing her steps, Eris felt like she was gliding through the crowd, magnetically drawn to the plinth where Schorr and the Green Man waited. Her bare skin was swathed in goose bumps and the nubbed ends of her arms felt every cold current in the air. When she brushed the left by accident against someone else’s clammy skin, her nerve terminations screamed.  The biogun was tucked into her right armpit, blunt muzzle all but concealed. Schorr was still speaking, but Eris couldn’t hear it. Too absorbed in the rest of it, in the naked bodies pale and dark sliding against hers, in the quickcrete—no, concrete, this stuff was ancient—that spiked cold against the bottom of her feet. The sweat trickling from under her armpits. The blank and fevered faces all around her.  She was sure at any second they would spot the biogun and realize she wasn’t one of them and tear her to shreds. She wanted to turn and run, scoop her arms back from where she’d stashed them in the corridor, make like hell for the elevator. But she couldn’t. Not with Kit propelling her forward, and not with Schorr planning to turn the whole City, the City she sometimes hated so much, into overgrown corpses like had been done to her colony.  Everyone was pressing closer, now, crushing in against the plinth, and Eris looked for an injector or an autosurgeon, something he would use to distribute the Vaxine update that would keep them safe from his plague. But there was nothing up there with him except the casket and a dull metal beaker.  Eris realized what the Green Man’s blessing was the split second before Schorr thumbed the catch. The casket split open with a pneumatic hiss, an innocuous puff of dust. The crowd was clamoring for the Green Man. Pressing in close, climbing up the plinth, trying to touch him. Schorr reached into the casket and plucked one finger from the Green Man’s desiccated hand like picking an overripe fruit. He crumbled it into the beaker. Eris could hear the powder hiss as it hit water, or maybe only imagined it.  She tried to wrest control back from Kit. She needed to scream. She needed to tell them not to fucking drink it, not to even fucking touch it. But Kit was still moving, grim and steady, toward the plinth. Eris watched the beaker pass from hand to hand, dark fluid leaking from pale lips. She knew they were already dead. Schorr wasn’t inoculating his followers; he was using them as his final test subjects.  Someone who wasn’t Eris started to scream. The first devotees to drink from the beaker were writhing now, toppling backward off the plinth into the crowd. She saw the infection moving through their bodies like a time-lapse, their fingers and faces swelling, bubbling, poisonous green and mud brown. She could almost feel it.  Kit accelerated, weaving through bodies. Three figures in hazard suits had detached themselves from the shadows and now were closing the casket again, dragging it backward onto a hoverjack. Schorr was still standing, still watching the chaos. People ran, panicked—if they’d come expecting to die, they hadn’t expected it to be this painful.  Kit had them close, now, close enough to reach out and grab the rough corner of the plinth. Schorr noticed, finally turning his masked head. Eris saw her ghostly reflection in the insectoid eyes. Kit twisted so the biogun was aimed right at him, all she had to do was squeeze and at this range she’d said it would shred right through him and—  One of the fleeing devotees blindsided her, smacking an arm across her chin. Eris would’ve known how to twist, how to compensate, but Kit was unbalanced by it and she staggered. Suddenly they were on the floor, rolling to avoid feet, the biogun gone. Someone tripped on her, stomped by accident on her gut; the wind went out of her hard. By the time Kit had her upright, Schorr was gone, too. She vaulted them up on the plinth, spinning, searching.  There.  The sarcophagus was gliding away through the crowd, back the way they’d come, ushered by Schorr and his men. Back into the crush. Kit kept her eyes fixed on the target, but Eris saw flashes of the infected men and women, all wailing and writhing. Was this how it had been in the colony? Was this how her father had died?  She saw the tail end of the sarcophagus disappearing around the next corner. She was running faster than she’d ever, Kit wringing every last bit of energy from her muscles. They made it to the elevator just as the doors slid shut on Schorr’s turned back.  Shit!  “Aren’t your people waiting for him at the top?” Eris gasped.  He’s already streamed the footage of what just happened back there. Says if there’s any attempt to follow him, he feeds the Green Man through a nebulizer and the spores go airborne. Says he’s open to negotiations.  “Bullshit,” Eris snapped. “He’s lying. He wants to do the whole fucking City.”  I’m being ordered to stand down, Eris. I fucked this up. Bad.  “Then if Ndirangu asks, it was all me,” Eris said.  There was a pause. There’s a civilian upcar that’ll be unlocked and unalarmed just around the block. And from here on in, the brainshare implant is malfunctioning.  The thrumming returned, and an instant later Eris’s body was hers again. The lactic acid in her muscles and aches in her joints made her want to collapse to the floor and rest for a second, just a second. Instead, she staggered back down the hallway. Found her clothes. Her arms. She chinned them back into place. Artinerves snaked up to meet the tender flesh and she flexed her metal fingers.  “Fucking right I drive this time,” she muttered.  Schorr was in one of the white vans, climbing fast, by the time Eris threw herself inside the little blue upcar Kit had picked for her. It wasn’t the absolute last vehicle Eris would’ve snagged for a pursuit, but it was close. She slammed over to manual and hauled it up off the pavement, making a dozen hurried adjustments to the dampers, the updrive, the seat. There was no way she was going to catch the van with the inbuilt speed limits still operational, but if she stopped to do the rewiring, Schorr was good as gone.  Eris jammed the seat back and drove with her feet, how she’d done on the battered old ute in the colony, while she gutted the panel with her metal hands. She’d lost some dexterity over the years. Lost the calluses, too.  But she could still do it. One foot on the pedals and one steering, she split her concentration between navigating the lower streets, mercifully empty of traffic, and finding the right port on her arm. The van was still in sight, bulling through a cloud of camera drones she assumed were OCI, but in another second it would be a speck and then gone entirely.  “Couldn’t have found me a fucking custom?” she breathed, even though she wasn’t sure Kit could hear her anymore. She hunted through a tangle of wires, taking both eyes off the windshield, and was nearly blindsided by a cab. The proximity alert wailed, and she could see the driver mouthing off, too, but it didn’t matter because she’d found the right wire and the right port.  She fed it in, and suddenly she could feel the upcar like an extension of her arms, which were an extension of her brain, and in her brain she decided to go however fucking fast she wanted. She deleted the limits, gunned the engine, and acceleration pinned her to her seat like an invisible hand.  Schorr had a big gap on her, but he was driving carefully. Eris wasn’t. She was driving wild. Her metal hands were barely skimming the steering wheel, plucking it left, down, right, left, up, fast enough to blur. The City was streaming all around her, unfocused, but she knew its architecture like she knew her own body and all she had to do was follow the van and not even brush another upcar or drone. Her tongue was planted firm between her molars.  She was shredding the speed limits to pieces, but Kit had to be blocking the safety signal that would have normally overridden her by now. And if there were sweepers patrolling, she’d like to see them try to catch her. Eris knew she shouldn’t be smiling. Kit wouldn’t have been smiling. But her lips were dragged back off her teeth all the same.  She felt good. Really good. And if there were Green Man spores already inside her, if she was moments from bursting into a viny writhing mess, the instant crash would probably kill her before the infection did. She came level with the white van, then hurtled past it, and she realized where Schorr was heading.  She cut speed, matching Schorr, who tried to shake left. Eris clung to him like a shadow. Up ahead, one of the City’s largest filtration plants approached, a somber giant in gunmetal grays and blues. Pipettes stretched from its towering tanks into the surrounding infrastructure, pumping water through the City like a beating heart, and that was where Schorr wanted to release the Green Man.  Which meant he’d been bluffing about taking it airborne. Eris thought back to the underground communion, the beaker being passed. The spores needed water.  Schorr banked hard and down, and Eris realized something else: he didn’t need to get all the way to the plant entrance. He only needed to get to one of the water tanks, and those were a hell of a lot closer. The white van put on a final burst of speed, angling towards the nearest of them, and Eris could see the top of the tank sliding open via whatever override code Ferris Carrow, owner of half the filtration plants in the City, the woman with the flower in her stomach, had been murdered for.  Eris could already imagine the van puttering to a neat halt, Schorr’s men shoving the open casket out the back so it dropped down into the tank like a pill into a water glass. The Green Man would fizz and dissolve and the City would drink his dead body. Use it in their showers, their hydroponics. If there were safety valves to isolate the tank she figured Schorr had codes for those, too.  They were bare meters away from the tank. She reached for the extra impact webbing and tugged it over herself. Clenched her teeth, then unclenched them, trying to guess what would make them least likely to shatter in her jaw. Breathed deep.  All it took was a twitch to send her smashing into the top of the van. The sound of shearing metal filled her ears and the impact shook her bones. She could feel herself screaming in her chest as they spun. Feedback from her arms rolled over her like a static wave. She yanked them free and covered her head as the upcar and the van, tangled now, hit the lip of the water tower.  The impact webbing wove itself around her like an ammonia-smelling cocoon, wrapping her in darkness, but she still felt the upcar crumple. Her head still snapped forward, back. Her teeth scraped her tongue raw on their way shut. Metal was moving all around her, squealing and crunching, and then suddenly there was stillness.  Eris wanted to flop backward and breathe for a minute, stay in the warm hug of the impact webbing, but she tore her way free instead. The upcar had flipped around, so she had to punch her way out of the back. The whole chassis was shifting, rocking, and when she finally dragged herself out she realized her plan had half-worked.  They’d splintered against the lip of the water tower; her upcar was still riding the top of the van, which was now sheared in two. The front end of it was a mangle of debris falling down, down, down into the City depths. The back end had skidded over the edge more or less intact, and its doors were torn open. Steam was gushing out.  Eris climbed down from the wreckage on wobbly legs. She managed to nick herself a few times, but she could hardly feel the sting, too buzzed with adrenaline still. The top of the water tank hadn’t opened all the way, leaving a few meters of slippery metal floor. She approached the edge with a feeling of dread, wondering if she was going to see the casket bobbing inside, if she’d accidentally dumped the Green Man exactly where Schorr wanted him.  But when she craned over the edge, she saw only gurgling water. Relief hit her all at once. She sank to a crouch, feeling the adrenaline start to ebb. She’d done it. Holy fuck.  “Holy fuck,” she choked. “Did you see that shit, Kit?”  Another creaky groan came from behind her. She turned, expecting to see the remains of the upcar sliding off the van, not expecting to see Schorr emerging from the back like some kind of bogeyman, framed by billowing steam. His long coat was torn and one of the antlers had snapped clean off his gas mask, but apart from that he didn’t look the least bit shook by the crash.  “You fucking bitch.” The words came out dead and flat through the mask, but Eris had the distinct feeling they would have sounded the same without it. Schorr had another halo out, pointing it at her.  Eris didn’t feel a thing. Kit really had severed the brainshare.  “That was all me,” Eris said, forcing a bravado she didn’t feel, not even a little. “OCI’s going to be all over your ass in about two fucking seconds, though.” She could hear the wail of emergency drones approaching and hoped a silver upcar or two were with them.  “Then I’ll be quick,” Schorr said, and he turned back to the van. Going back for the casket. Eris stood frozen for a second, then anger poured through and thawed her. He was ignoring her. Just fucking ignoring her, like with no brainshare she was no threat at all. Eris sprung the stunspray from her arm and lunged.  Schorr swatted her out of the air without even turning around. He had to have back-cams in that mask of his, and maybe he had some kind of skeletal implants, too, because he was stronger than any asshole philanthropist-slash-cultist had a right to be. Eris hit the ground hard with the breath smashed out of her lungs. She saw Schorr’s boot stomp down on her wrist, crushing circuitry, and her fingers spasmed. The stunspray flew out of her grip. She heard it bounce once, twice, then a distant splash as it went into the tank. Shit.  “What do you think you’re doing?” Schorr asked. “Is being a hero now for the blink of an eye worth being a villain for the rest of eternity?” He seized the edge of the casket with both hands and started to pull. The metal screeched, throwing sparks. “It’s that lack of foresight that got us here in the first place,” he grunted.  Eris rolled over. Coughed. “New Tenochtitlan,” she rasped. “Were you telling the truth?”  “Yes.”  Eris threw herself at his back again, making her fists into clubs, battering his head and shoulders. This time Schorr spun and reached. The arm he’d stomped on was slow, jittery, and he managed to grip it now with both hands. He planted one foot on Eris’s shoulder and tore it free. Feedback lanced all the way down Eris’s spine like a plume of lava. She howled.  Another kick took the wind out of her, and she sprawled back on the slick metal. Schorr dragged the casket towards the edge. Towards the swirling water.  “Kit, where the fuck are you?” Eris hollered. She crawled after him on hand and knees, still convulsing. He had the casket poised on the lip. The Green Man, shaken apart by the crash, was barely human-looking at all now, just a viscous, poisonous green mass.  Schorr was leaning down to thumb the catch when his gloved hand blew apart. Eris blinked as a splinter of bloody bone flew past her face. She stared at Schorr, who stared back at her through the lenses of his mask, both of them equally surprised. Then the second shot cracked the air, and his lenses splattered bright red. He crumpled.  As his lifeless body fell, it knocked into the casket and sent it lurching forward. Eris flung out her remaining arm and clamped to it. Feedback seared and she couldn’t reach to switch it off. She gritted her teeth instead as she dug her heels in and pulled. The casket shifted by millimeter increments. Polymer muscles popped and strained in her arm. She pulled. Pulled.  Finally the casket rocked backward, and Eris collapsed on top of it like she could pin it there permanently. She was still lying like that, gasping for breath, when the silver upcar touched down and Kit dropped out wearing a harness with her sniper rifle stowed in back of it.  “Holy shit, Eris.”  Kit squatted down beside her, checking her over with a mediscanner, then moved her off the casket. In Eris’s peripherals she could see people in hazard suits with scanners of their own. Two of them were bagging Schorr’s body.  A blurred out face appeared over her. “Well done, Eris,” Ndirangu’s voice said. “We’ll get you a replacement for the damaged arm. And I’ve just put the request through regarding the traffic cams.”  Eris tipped her head back against the cold metal roof of the water tower. “Fuck that,” she said. “How about you just give me a job?”  Kit gave her gravelly laugh. Eris didn’t mind. She didn’t like wearing black anyways, and had something more important to do, besides. Have the OCI pay her way back across the ocean on the first available vessel. She needed to see New Tenochtitlan, or what was left of it. She needed to see stars again.  She needed to know if her dad was really gone. Eris took a deep breath of the cold night air, and for a moment she could taste the prickling warm breeze that swept through the colony compound at night. Whatever she found over there, she would deal with it. Hopefully the replacement arm would be ready by the time she left, but if it wasn’t, she would deal with that, too.  She was exactly as tough as she thought she was. Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "text": "12640 words, novelette\nThe Green Man Cometh\nEris was kicked back doing some work on her glitchy left arm, tweaking the artinerves she didn’t have the cash to replace, when a fist pounded against her cab window. She startled; the hairpin she’d been using slipped into the wrong socket and her spidery metal hand flailed wild. Staticky pain flared through her arm and shoulder and made her hiss.\nShe yanked the pin out and pinched her arm shut until the polymer resealed. Flexed her fingers, pulled on her black driving gloves. Gritted her teeth as whoever it was kept on hammering at her opaqued window.\nEris switched it transparent and sound porous. The man on the other side was wearing a charcoal gray suit with haute couture slashes through the fabric, and he was running one finger along the wriggling green vines some shitty graffiti artist had sprayed onto her side door earlier that week.\n“Cunt, don’t touch my cab,” she said.\nHe looked up, showing a gaunt symmetrical face with icy blue eyes that glowed a bit, meaning Optiks. He grinned unnervingly white teeth.\n“I need a ride,” he said, probably thinking he could jerk her around because she was young and he was handsome. The haircut was the only thing that didn’t match up—buzzed down to stubble all over, instead of the long prehensile locks so in style for well-monied assholes.\n“The little orange light means busy,” Eris said. “Try the ones with little green lights. I know it’s confusing if you’ve never used a cab before, or if you’re a shithead.”\nIn response, the man held up his sleek black tab and a non-refundable five hundred credit transfer marched across his screen onto the cab’s onboard. The digital chime sent dopamine down Eris’s spinal column. About ten times the going rate for even a cross-quadrant ride. Maybe when you were rich enough you lost track of that kind of thing. That much money, she could get some fresh artinerves for her arm and maybe even get the ugly green graffiti scrubbed off her side door.\nEris grudgingly switched her busy light off. “Where to, sir?” she asked, as the man climbed into the back seat.\n“Lower streets,” he said, adjusting his lapels. “I’ll direct as we go.”\n“I’d prefer a sataddress, sir,” Eris said, slipping her hands into the cab’s modified control sleeves. The engine hummed in response.\n“Also, there will be a few people trying to follow us,” the man continued, ignoring her. “I hope that’s not a problem.”\n“You clowning?” Eris demanded. She checked her cams. Back along Pier 17, through the file of waiting black-and-yellow cabs, she saw the hulking shape of a silver-colored private upcar drifting towards them. It didn’t have any distinguishing holos.\n“They’re not sweepers,” the man in her back seat said. “Just overly curious individuals. Nothing unwholesome is happening here. All I need is for you to drive quickly and skillfully. I assumed from the customized chassis you can do that.”\nEris tongued the gap in her molars. The feedback spikes in her bad arm were getting more painful and coming more often, and turning it off left her clumsy as shit. New artinerves would make things a lot better.\nAlso she hadn’t done anything stupid in a long time, and it had been building under her skin like an itch.\n“Dump another five hundred on me, I can drive better than anyone you’ve ever seen,” she said, shooting for the moon.\n“Another five hundred,” the man said, winking one electric blue eye, “when we get there.”\nShe pulled them up off the pier, climbing into the dull yellow sky. The City stretched around them in all directions. Up, especially. Behemoth technicolored towers, rotating apartment blocks, sky tunnels that scythed and retracted in accordance with traffic patterns. Eris rose leisurely through a swarm of drones. In her underbelly cam, she watched the silver upcar follow suit.\n“Lower streets, I said.” The man’s voice had a hint of annoyance now. His eyes were scrolling code. There was a lick of sweat on his hairline.\n“I heard,” Eris said, letting the silver upcar close the gap a bit more. “Don’t toss up back there, alright?”\nBefore the man could reply, she dove.\nDown. Eris felt the G-force all the way up her arms, singing through the artinerves, and she felt it in her gut. They plunged past the silver upcar; through the blur she saw a startled silhouette recoiling. The drones and anything with avoidance AI scattered. Eris dealt with the others herself, slaloming between two unwary drivers, swooping under a freighter. She had her own proximity alert silenced, but the other vehicles made angry wails as she hurtled past.\nThe silver upcar was only caught off-guard for a moment, then it dropped hard after them, a dive so steep Eris knew it had to be manual. She gunned the engine. A sky tunnel was extending below them, flexing into the air like a gigantic worm. A dock slid out from the adjacent building to meet it. There wasn’t going to be much of a gap.\nShe took it, twisting to fit, feeling the magnets of the dock sizzle through the cab’s onboard, up her arm. The sky tunnel slammed into its dock and sheared the air where her bumper had been a microsecond before, but they were through.\nThe silver upcar braked, angling to get around the tunnel. But by then Eris was away, spiraling into the traffic again, her heart pounding against her ribs. She checked the mirror. The passenger was flung back in his seat, howling. No—laughing. Somehow it made her like him a little more.\nShe headed for the lower streets.\n“This is it?” Eris squinted down the alleyway.\nThey’d gone about as low as she ever did, into the City’s underbelly, and now were facing a grimy quickcrete alley splashed with animated graffiti. She couldn’t make out the words, but the lime green color was familiar. She had some countermeasures keyed up and ready to go in case a bunch of hoodlums suddenly spilled out to vivisect her cab.\n“This is it,” her passenger confirmed. Once they’d shaken off the upcar, he’d gone back to his Optiks, muttering sub-vocals and blinking owlishly like any other boring businessman. It was sort of comforting, considering their strange destination.\nWhen he unrolled his tab and sent another five hundred across, the money made Eris feel momentarily affectionate.\n“Maybe dim those eyes of yours,” she suggested, triggering the door open. “Around here, they’ll take them out with a spoon.”\n“Around here, maybe, but not here,” the man said, flashing all his white teeth again. He made to climb out, then paused. His sleeve whirred, and a custom calling card, wafer-thin, spat out into his hand. “You’re a good driver,” he said. “I might need that again.” He set the filigreed black card down delicately on the cushion. “Thanks for the ride.”\nThen he was off into the alley, disappearing into the shadows. The graffiti wriggled the other way, startled, and Eris could finally read it. The green man cometh. Whatever the fuck that meant.\nShe looked at her screen again, at the easiest gee of credit she’d ever made, and grinned. She could take the rest of the day off if she wanted.\nShe wanted. Eris switched her orange light on, then lifted off and headed for home, which was a low slot in a grease-yellow honeycomb of converted storage units—and not the chic faux-po’ variety. But it had a good dock for her cab, and it was cheap. And compared to how she’d grown up, it was luxury.\nEris did the math in her head as she drove, slicing the Guild fees off the top and figuring out how much she would put away. She only remembered the calling card in her back seat as her cab snicked gently into its moorings. If he overpaid like that every time, it was worth holding onto. She dropped the partition and plucked it off the cushion, careful not to crush it.\nShe swung herself over the whistling gap in the dock’s metal floor and pushed her thumb to the apartment door. It tasted her genes and shuttered open, but the lights didn’t turn on as she stepped inside. She whistled a low activation note. Still nothing.\nSomething was wrong. Her heart leapt up her throat. The apartment was small enough that she could tell there were extra bodies inside, she could hear weight shifting, breath in and breath out. She felt an angry buzz through her prosthetics, biofeedback from the adrenaline. The left one spasmed; she had to grab and hold it with her right until it stilled.\nFeeling the polymer muscle reminded her she had a little canister of stunspray tucked inside it. Eris moved slowly around the corner of the divider that separated the bathroom out from the rest of the apartment, her heart pounding.\nTwo people were waiting in the gloom, one of them draped on the side of the couch without laundry all over it, the other perched awkwardly on her orthochair, which was shifting all around trying to accommodate the unfamiliar body.\n“What the fuck are you doing in my house?” she demanded.\nThe lights finally snapped on in response to her voice, and she got a good look at the intruders. The woman on the couch was tall and vaguely leonine, with heavy-lidded eyes and blocky cheekbones. Her black jacket was cut in a way that displayed both her long sinewy arms.\nThe man on the orthochair was smaller, also wearing black, and he didn’t have a face. Instead, the space above his neck was a rippling wash of pixels that hurt Eris’s eyes to stare at directly.\n“We got a scan on your cab before you shook us,” the man said, in a voice stripped electronically of any identifying characteristics. “We’ve been waiting. Agents Ndirangu and Kit of the OCI. Arms out, please, Eris.”\nHer first instinct was to call bullshit and feed them the whole canister of stunspray. People told stories about Operative City Intelligence the way they told stories about the bogeyman. But facial blurs weren’t something you could just pick up at the fabshop, and there was something else, too. Something the passenger had said. Not sweepers, just Overly Curious Individuals.\n“That asshole,” she breathed, raising her arms.\nEris gritted her teeth while the woman called Kit searched her, first by scan—there was a familiar tingle as it noticed the first prosthetic, a bit of surprise on Kit’s face when it found the second—and then by hand. Eris hadn’t been frisked for a long time. Turned out she still hated it.\nKit slipped the calling card from Eris’s pocket, held it pinched between two sharp-looking fingernails for a closer look, then slid it into a Faraday pouch.\n“You can keep the stunner,” she said, in a slightly gravelly voice that was younger than Eris had been expecting. “Just don’t do anything stupid with it.”\nShe stepped backward with a languid smile, which Eris did not return. The man, Ndirangu, had given up on the orthochair and was standing now as well. Eris knew she was in huge shit. Had to be. She’d probably just abetted an organ smuggler or contract killer or some such.\n“First question,” Ndirangu said tonelessly. “What do you know about the Green Man?”\n“Fuck all?” she said back. “Look, I just drove him. I didn’t know who he was, didn’t know who you were. He said you weren’t sweepers.”\n“Technically correct, although our work does occasionally overlap with City Law Enforcement,” Ndirangu said. “Second question. What do you know about Ferris Carrow?”\nHe raised one smartgloved hand, and a holo bloomed to life on the wall, showing an image of an unsmiling woman with a surgically-ageless face, her silver-blonde hair sheared to professional spikes. Eris folded her arms, and in her peripheral she noticed Kit mirror the motion.\n“Don’t know her,” Eris said. “Should I?”\n“Ferris Carrow owned half the filtration plants in the City, and a quarter of its fabbing industry,” Ndirangu said. “Very wealthy, quite influential. She was murdered three days ago.”\nEris felt her knees go weak and watery. “You think I had something to do with a murder?” she demanded.\n“We think the man you helped evade us did.” The holo shifted, and now it showed Eris’s mysterious passenger, high-angle, stepping into her cab. “Arno Schorr,” Ndirangu said. “A philanthropist, businessman, and one of the founders of a doomsday cult. The Church of the Green Man.”\n“Never heard of it,” Eris said, trying to figure out where his eyes were so she could meet them, so he would know she meant it.\n“They’ve been trying to get religion licensing for the past couple months.” Ndirangu gave a stiff shrug that might have been annoyance. “Before her death, Ferris Carrow appeared to have taken an interest. Basic doctrine is rejection of personal technology. Nature worship centered on a singular deity. A mishmash of Pagan and Luddite with ties to the Neoprimitive movement.”\nThe penultimate word made Eris’s eyes narrow. Her City basic had no trace of colony accent left, and she told anyone who asked that she’d been born in the lower streets. But this was the OCI. The OCI knew things.\n“I didn’t pick where I was born,” she said shakily. “They shipped me out of the Neoprim colony when I was a kid. I’ve never gone back. I don’t have any fucking ties to it anymore.”\n“I’m aware,” Ndirangu said calmly. “And there’s really only one tenet of the Church of the Green Man we find worrisome. They’re extinctionist.”\n“Extinctionist?” Eris tried to make her voice even again. She didn’t like being reminded about the colony. Those were memories she kept in cold storage.\n“They think it would be best for the planet if we all died off,” Kit said darkly.\nEris crinkled an eyebrow. “Does anyone not think that?”\n“The difference is, they’d like to do something about it,” Ndirangu said. He waved his hand and the holo shifted to a sprawling green graffiti on corroded metal wall. He read it aloud. “Humans are a virus, City is its last bastion. The Calamities were not enough to clean the world. But fear not, the Green Man cometh.” He paused. “At first we didn’t take it particularly seriously. Criminal mischief, nothing more. Then Ferris Carrow was found like this.”\nThe holo churned and Eris’s stomach churned with it. The same woman, but lying on her back, now, with dark congealed cuts laddered up her legs and her stomach blown open. Someone had packed the exit wound with dirt, and out of the middle a little red flower was blooming.\nEris swallowed back bile. “Fuck,” she said. “Fuck, switch that off. You think I had anything to do with that, you’re insane.”\n“We know you didn’t, Eris,” Ndirangu said tonelessly, turning his glove’s holo off. Eris felt a wave of relief that cut short at his next words. “We just want you to have an understanding of the gravity of the situation before you sign this waiver.”\n“What kind of waiver?” she asked. Kit was staring at her again, her arms, her legs. She had a bad feeling in her gut.\n“Schorr is going to need to transport something soon,” Ndirangu said. “Something we believe he smuggled out of the colonies on his most recent visit. We don’t know what, exactly. But it’s possible he’ll call on your services. You were impressive.”\n“I’ve done better,” she said on automatic.\nAnother snort from Kit. Ndirangu didn’t react. Or maybe he did. Who knew?\n“We’re going to use you to get to Schorr. Gain his trust.”\nEris blinked. “What, so I’m a spy now? I drive a cab. I’m not up on espionage. And I don’t want anything to do with a fucking murder cult, anyways, thanks.”\n“We wouldn’t dream of using an untrained citizen,” Ndirangu said. “No, you’ll simply be along for the ride. Agent Kit will be doing all the work.” He held up his left hand and the smartglove’s palm turned white, with minute black text scrolling across it. “This is a basic waiver for use of your body in the event of an OCI operation. All it needs is your geneprint.”\nKit moved a thick strand of hair away from her temple and Eris saw the glinting neural link clinging there like a beetle. The way she’d been staring, the way she’d been mimicking, made sense all of a sudden.\n“No way,” Eris said. “I don’t do that brainshare shit. I don’t want anyone in my head but me.”\n“Brainshare is a bit of a misnomer,” Ndirangu said. “The waiver states clearly that we’ll have control of your central nervous system, but no access to your thoughts or memories. That all remains quite safe, and quite private.”\n“I don’t want her in my body, either,” Eris snapped, giving Kit a side-eye. “I don’t want anything to do with this. Just bill me for the traffic violations, okay? Just go.”\n“I’m afraid this is more important than what you do or do not want,” Ndirangu said. “If you sign the waiver, you’ll be fully insured for any injuries occurring to your body. And once the OCI operation is deemed complete, you’ll be compensated for your time, as well.” He reached underneath the orthochair and pulled out a sleek black carry-case Eris hadn’t noticed before. “If you don’t sign, we may have to . . . investigate you.”\n“For what?” Eris demanded.\n“Schorr chose your cab because it had the Green Man tag on it,” Kit said coolly.\n“Someone did those vines last week while I was docking,” Eris protested. “I’d never paint up my own cab.”\n“Maybe the OCI is willing to chalk that up to coincidence,” Ndirangu said. “But the fact that you were born in a Neoprim colony may be one coincidence too many. It might warrant surveillance. Which might have a negative impact on your livelihood.”\nEris’s mind whirred in circles. She should never have let that asshole into her cab. If she didn’t sign the waiver, she would be trying to drive through a swarm of follow-cams for the rest of her life, or worse. In the stories, people who pissed off the OCI eventually just disappeared. Kit could have definitely disappeared a few people, judging from the stare on her.\nAnd that was who she was supposed to brainshare with. Eris tongued the gap between her molars. The stupid decisions were piling up now, but it wasn’t like she had much of a choice.\n“I want to get ghosted on all traffic cams,” she said. “No violation notices for the rest of my life.”\n“I think we could arrange something like that,” Ndirangu said. “This is, after all, rather important.” He put out his left hand. Eris figured he was lying about the traffic cams, but she’d mostly said it to save some dignity, which he was letting her have. She could bet Kit wouldn’t have.\nEris spat on her hand to ensure a DNA reading, then shook. The smartglove rasped against her skin like a cat’s tongue, then chimed an affirmative.\n“Excellent,” Ndirangu said. “We’ll get right to inserting the implant.”\nThe sleek black rectangle unfolded on spidery limbs, and Eris realized it wasn’t a carry-case. It was an autosurgeon. A shudder ran all the way through her.\n“Wait,” she said, her mouth feeling suddenly thick and warm. “Here?”\n“Here, yes,” Ndirangu said, his voice sounding even more distorted than usual. “There’s little time to waste. I gave you a dermal sedative through the glove. That’s mentioned in the waiver as well.”\nEris felt the old hospital panic kicking up through her, dulled only halfway by the drug. She backed away and stumbled. Someone caught her—Kit caught her—and lowered her down onto the floor. She felt a pillow slide under her skull, cushioning it. Her whole body was heavy and she could taste copper in the back of her throat. Familiar.\n“It’s fast,” Kit’s voice said. “You won’t remember it. I don’t.”\nThen the autosurgeon was spreading overtop of her, reaching with calipers and braces, clicking and sliding. Too familiar, too familiar. Before the prostheses, they’d tried twice to grow her arms, but the surgery always failed. The flesh never took.\nShe squeezed her eyes shut.\n“Didn’t have to spring the sedative on her,” Kit’s voice came faint, accusing. “Could have just told her.”\n“Not with her profile,” came Ndirangu’s, but different now, free of the mask. “She’s not as tough as she thinks she is.”\nEris wanted to say yes I am, yes I fucking am, but she wasn’t sure and her mouth was too numb and her whole body was turning rubbery and—\nEris woke up doing calisthenics in her empty apartment. She could see her reflection in the dulled smartglass window across from her, bending and stretching. The display told her it was morning, nearly ten o’clock.\n“What the shit?” she demanded, or tried to. What came out was a strange slur through clamped jaws. Then her mouth opened without her and spoke back.\n“Sorry. Just getting calibrated.” The voice was hers, she could feel it rumble in her chest, but it wasn’t hers at all. “I’ll be out in a minute.”\nIt all came back like a tsunami. The man with the shaved head and slashed suit, the one thousand credits, the black-clad OCI agents waiting for her in the dark. Doomsday cults and a dead woman with a flower in her gut. The last thing she remembered was putting her signature on some kind of a waiver.\nOn a brainshare waiver. That was why she couldn’t move her own muscles—Kit was moving them.\nFuck that. She tried to wrench her right arm down and away, abandoning the stupid yoga pose.\nShe got nothing. Not even a twitch.\n“You can have your mouth back while I finish up,” Kit said.\nA weird tremor went through Eris’s tongue. She spat, like she was getting a bad taste out, but somehow managed to slobber it down her chin. Her reflection in the window was drooly and dazed-looking.\n“Where’s the implant?” she said.\nThis time the reply came in Kit’s voice, slightly raspy, thrumming through Eris’s head. Subcutaneous. Some skin-spray to cover the scarring. Should be undetectable.\nEris watched with some measure of revulsion as her reflection started doing jumping jacks. This was so fucked.\n“This is so fucked,” she puffed.\nI’ve been looking at your augments. Really modded the shit out of your arms, didn’t you. Reflexes way past standard. No wonder the artinerves are nearly burned out. No wonder you can drive like that.\nThere was some admiration in her voice, but Eris didn’t want to hear it. She felt sick and angry, imagining Kit sitting on the couch testing her arms out like a new toy or some shit. Like all of her was a toy.\n“Yeah, that makes it so worth it,” Eris said. “Maybe I should lop a leg off, too, huh?”\nHer face in the window twitched, which had to be Kit.\nThat’s not what I meant. I meant it was good wire work. That’s all.\n“I could always drive like that,” Eris said. “So fuck you.”\nThe jumping jacks stopped.\nDone calibrating. Kit, acting like she hadn’t heard the last bit. Not the worst body I’ve had to work with. Just go about your normal routine, if possible, and I’ll be ready to take over when Schorr contacts you.\nSuddenly her muscles were all hers again, and she toppled. She caught onto the edge of the orthochair as she went down; the cantilevers whined and propped her back up. Her wobbly legs turned solid again. She straightened, muttering curses.\n“Go about your normal routine, Eris,” she said through her teeth. “Ignore the OCI bitch kicking around in your brain.”\nBut it was a relief to have her body back. And whatever Kit had been doing had actually left her feeling pretty good. Loose, warm. Bit of a sweat on. She put her hands on her hips and surveyed the dull gray cube of her apartment, looking for evidence of the agents’ intrusion, but they’d left everything in its place or not-place.\nA tumble of clean underwear and colorful shirts heaped on the end of the couch, which was also her bed. Work bench in the corner strewn with parts and a coil of conductor wire. On the floor beside a vat of sealant, her dad’s old magnetic chess set that she sometimes hooked to the net when she was feeling masochistic. Canary-yellow scarf, jacket with a stubborn oil stain. Two juggling balls rolling and bumping against the heaped jacket where the third was trapped underneath.\nApart from her cab, it was all she had to show for a decade in the City. It seemed messier and shabbier and shittier knowing Kit and the faceless one had been lounging around in it. Nearly made her want to clean up.\nOver on the kitchenette counter, she saw the filigreed black calling card waiting. She gave it a wide berth as she slid open the fridge. There was nothing floating in the gel but hot sauce and a tube of yogurt. She felt antsy, and hungry now, too. She picked the calling card gingerly off the counter and slid it into her pocket. Maybe Schorr wouldn’t call anyways. Maybe the OCI had wildly miscalculated.\nAs if she could be that lucky. Eris left and locked the door behind her.\n“Bet you can do all kinds of nasty things with them.”\nEris was nearly home again, halfway through the corridor from the main hub with a biodegradable bag of groceries slung over her shoulder, when the ragged man who’d been sauntering a few steps behind her spoke. She turned over her shoulder.\n“Fuck you say?”\n“Nothing,” the man replied, but his eyes trailed longingly up Eris’s left arm, which was still twitching sporadically, then the right. His skin was pale, sallow, and his eyes were shot through with pink. Tweaked on something. “Just that you can probably do all kinds of nasty things with those artis of yours, is all.”\nShe would’ve let it go, because tweakers and technophiles weren’t worth the time to spit on, but she was still antsy. Maybe the OCI were watching through her eyes. Maybe they’d sent this fuck as some kind of test. Or maybe Schorr had sent him.\n“All kinds of things,” the man repeated with a placid smile, reaching to run his fingers over the exposed polymer. She batted them away hard; he blew on them and laughed. “Beauties, them.”\nThat was it. Eris set her groceries down. “They could tear your tiny fucking prong off if you don’t get lost, cunt.”\nThe man’s smile dissolved. He gave a slow blink, then his face turned angry. “If you can’t take a compliment, wear skin sleeves on them,” he said.\nHe took a menacing step and Eris stepped back in sync as she checked him over again, trying to guess if what he was on would make him quicker or make him clumsier. The veins in his neck were all taut blue. Could be Taurus, which would be bad news.\nEris wanted smash her knee up into his thickening hard-on and only unload the stunspray if necessary. She didn’t want to give him the satisfaction of touching him with her arms.\nBut she was frozen. A weird thrum was going through her locked-up muscles and she couldn’t move a millimeter. The man took it for fear and his smile came back. He had a nose for blood in the water; he was glancing up and down the empty corridor.\nEris couldn’t even cuss out whatever dumb fucking glitch in the brainshare implant was seizing her up. Her jaws were clenched too hard.\nThe man went to grab her arm, and suddenly she moved.\nToo fast to understand. She felt contact, displaced air, and displaced cartilage, then she was wiping something warm off her forehead while the man wailed on the dirty floor of the corridor. Blood was gushing from his nose and his kneecap was shifted over from where it ought to have been.\nShe’d gone through his grip somehow, done his nose in and crunched his knee and come back up like elastic. She wasn’t even breathing hard. She was a fucking ninja.\n“Next time you’re dead,” she said, feeling wild, feeling dangerous, even as she picked up her smiley-face-decorated grocery bag. “Got it?”\nHe only groaned. Eris headed back to her apartment, riding the adrenaline like a riptide. It took her a moment to realize what had happened.\n“I don’t need your fucking help,” she said. “Kit? I know that was you, Kit.”\nI know you didn’t need help, came Kit’s gravel voice. That was just for my personal satisfaction. If Ndirangu asks, it was all you.\nEris considered it. Kit didn’t sound like she was lying. She sounded kind of pissed off and pleased at the same time. “Alright,” she said, then, grudgingly, “I guess that was pretty slick. How you did the knee like that.”\nI’ve done better, Kit said, and for a second Eris liked her.\nThen the calling card went off in her pocket.\nKit did the talking, and it surprised Eris how much she managed to sound like her, down to the cursing. Then again, she was a professional and the conversation hadn’t been a long one. Schorr’s distorted voice had requested her for a transport job, vehicle provided, an hour’s work at most, possible pursuers to shake. In exchange, five thousand credits, and none of it going through her cab for the Guild to skim fees off of.\nKit, in Eris’s voice, had agreed, and the calling card had denatured to a handful of gritty black gel that she’d dumped in the nearest recycler. Eris had gone home, eaten and put away groceries, and dipped her arms in sealant to take a shower. She didn’t think Kit would be watching, but she did it without looking down much just in case.\nAnd now, in the growing dusk, she was walking down Pier 24 to the boxy white delivery van that had been left docked exactly as Schorr had described. She’d already stopped at a specific trash receptacle to pull out a smartglove and tiny gun. Eris felt a cold ball of ice in her stomach. She knew that whatever she was transporting was going to be unwholesome. She hoped it wouldn’t be a dead body.\nShe stopped in front of the unmarked van and grimaced. “That woman, Carrow,” she muttered, picturing her passenger’s icy blue eyes. “Was Schorr the one who killed her?”\nFor a moment there was no reply, and she imagined Kit out getting a tea or something, but then her voice sounded in her skull. He has an alibi. But Ndirangu’s positive he ordered it. Ndirangu’s usually right.\n“Why’d he have a blur mask and you didn’t?” Eris asked, hoping Kit couldn’t tell she was delaying the inevitable. “You forget yours?”\nThere was a pause. Haven’t earned it yet. Hopefully this op makes it happen.\n“Wait, you’re not some kind of fucking rookie, are you?” Eris demanded. “I thought this Schorr guy was a big deal for the OCI.”\nI was the best match for the brainshare. Kit’s voice sounded slightly miffed. I’m taking over now.\nEris felt the thrum all through her body again. She’d always hated being a passenger and she hated this even more. At least Kit left her her mouth, tingling and thick-feeling but functional.\n“I can drive,” she pointed out.\nLiability issues. We’re now on clock for an official OCI operation. Besides. I can drive, too.\nKit peered inside the van. Eris thought about pointing out the non-standard dampers and a drive stick that would take some adjusting, but Kit seemed to be looking in the right places. Maybe she’d been the one driving the silver upcar yesterday, which now seemed like at least a whole week ago.\nKit walked around the outside of the van next. The back was hermetically-sealed and humming refrigerated. Big fancy lock on it, too, with sliding black flanges and glowing red vents.\n“So you don’t know what he’s transporting?” Eris asked.\nNo.\n“You going to look?”\nDeadman’s lock on there. If I fuck up the whole thing will self-torch. So, no.\n“Fair.”\nEris didn’t like not knowing, but there were a lot of things she didn’t like going on.\nShe felt a little dart of satisfaction when Kit nearly bashed them into a wall undocking, not prepared for the upped sensitivity in her arms. But she smoothed things out after a few minutes and then Eris could tell that she was a pretty decent driver, despite the van handling like a blue whale or something else huge and extinct.\nDusk deepened as they drove, and all the City lights were coming alive. The harsh arcs of artificial sunlight, the soft blue-and-purple bioluminescents like bruises, the swirl of neon and argon. The lights were under them and above them and reminded her of the field of stars she’d always had overhead as a kid but didn’t quite measure up.\nThe van’s onboard was programmed to feed directions bit by bit, the same way Schorr had done from her back seat, but it didn’t take long for Eris to figure out they were heading to the same place as last time.\n“Take the under,” she said. “Quicker.”\nKit stayed the course for a second, thinking it through, then grudgingly dipped into Eris’s recommended traffic vector.\nYou know your way around like you were born here.\n“Been here ten years. Cabbing for five of them.” She paused, then, maybe because of the lights, she spoke again. “Sometimes, it feels like I was born here. Feels like New Tenochtitlan was a dream. It’s different over there.”\nYour parents were first-generation emigrants to the colony, it says. Relatively wealthy.\n“Yeah,” Eris said. “Wealthy. And they gave it all up to go live in the dirt like the good old days. Gave up their Vaxine and their genetech, too.”\nThere was a long silence. The lights weren’t as beautiful now.\nHow did you lose your arms? Kit finally asked.\nEris ground her teeth. She’d hoped Kit would be one of the people who never bothered asking. “You know everything,” she said. “You tell me.”\nYour file doesn’t say.\n“Because I was born like this.”\nA pause. That doesn’t happen anymore.\n“Not in the City,” Eris said. “In the colonies it does. No genetech, remember?” She breathed out a bitter laugh. “My mom died having me, and my dad sent me away when I was twelve. Thought it would be better for me here. But he stayed. Haven’t spoken to him in years and years.” Something pulled too close for comfort in her peripheral. “Get some fucking space off that,” she muttered. “We’re wider than you think.”\nHas to be close. I called in a scanner to see what’s in the back.\nThe dull gray upcar pulled even closer to them as they drove, and Eris felt a shivery whine in her teeth as the scan started. She hoped Kit was focused on that and not the old tears building up behind her eyes. She couldn’t move her hands to press them away, but she had enough control of her face for a few hard blinks. She didn’t like thinking about the colony.\n“So what do we have?” she asked flatly.\nKit didn’t answer for a second. When she did, her voice had an edge to it. Nothing. There’s nothing in the back.\nEris felt the ball of ice again, this time rolling slow down her spine. They were in the lower streets now, deep City, where the lights were old and yellowed and fought a losing battle with the thickening dark. Eris was trying to think of reasons why someone would pay her to transport nothing at all when they arrived at the alleyway.\nKit swung her out of the van. Her shoe crunched on something in the shadows and she was momentarily glad Kit was running things, because if it had been just her she would’ve jumped at the noise like an idiot.\n“Good work.”\nIt was Schorr’s voice. He was standing at the mouth of the alley, hands in his pockets, his electric blue eyes glowing enough to illuminate the bones of his face. Two tall men with the same close-cropped hair were at his shoulders. Eris remembered what Kit had done to the tweaker in the corridor and it made her feel a little better.\n“Let’s have that five thousand now, or I hop back in and drive this shit straight to the sweepers,” Kit said with her mouth. Over the tailored shoulder of Schorr’s suit, Eris saw two more white vans in the alley, identical, and something was being unloaded from the closer of them onto a hoverjack.\nSchorr moved just slightly and her view was blocked. “I’m a man of my word,” he said, tapping at his tab. “Drop the van at this sataddress. Enjoy the rest of your night.”\nEris felt her own tab, wrapped around her wrist, rumble at the data transfer. “What, you’re not going to unload it?” Kit demanded.\n“Nothing to unload,” Schorr said. “You were driving one of the decoys. I’ll put your mind at ease.” He slid his hand against the deadman’s lock. The doors sprang open. Eris saw a billow of steam and then nothing else, just bare white walls as the scanner had predicted.\n“Okay.” Kit made a show of checking the payment on her tab. “Pleasure doing business, I guess.”\nSchorr swung the doors shut, and Kit climbed back in the driver’s side. Eris caught a last glimpse of what they were unloading: a big crate, bigger than she was, covered in a black shroud that seemed to eat the light.\nAs soon as they were around the corner, Kit triggered the autopilot and jumped right out of the van, rolling more gracefully than Eris would’ve managed.\n“So what now?” she demanded once they were on their feet.\nSneak in. See what he actually brought down here. Kit unrolled the smartglove and pulled it on, then slid the gun—it was a biogun, calcium spikes instead of traceable bullets—into Eris’s waistband. It was pretty fucking uncomfortable.\nBut she had to admit she was curious, too. She’d seen only a slice of the crate and now she wanted to know what was inside, the same way she’d always wanted to know what was inside an upcar carapace or engine block.\nKit crept them back around the corner into the alley, which was now deserted. The other vans and drivers had gone on their way. Halfway down, she stopped in front of a rusty metal door in the alley wall. After a few moments of tuning the smartglove, Kit found the lock and popped it.\nShe swung the door open, and Eris could feel a damp coming from inside. She would have shivered. Even Kit seemed hesitant for a second, but maybe she was only scoping things out. As they stepped inside, retrofitted biolights bloomed to life, providing stark contrast to a grimy cracked corridor. Eris’s eyes stung a bit as Kit did something with the smartglove again.\nNot picking up any surveillance cams. Good.\n“Great,” Eris echoed. They walked forward. Foam insulation was oozing from the walls, and at the end of the corridor she saw an ancient-looking elevator with actual physical buttons to push. Only the down arrow was still intact.\nThey were going to go even deeper. Eris felt a whine rising in the back of her throat and tamped it down. Kit thumbed the call button.\nDispatch might have a hard time finding us down here. This is pre-Calamities architecture. The City’s old bones. It has a way of screwing with our scanners.\n“What about with the brainshare?” Eris demanded. As much as she disliked having Kit run the show, she didn’t want to find herself suddenly alone down here, either. She’d never fired a biogun, or any kind of gun, and she had a feeling stunspray wouldn’t cut it if Schorr and his thugs suddenly popped out of the dark.\nThat uses an entanglement drive. I wouldn’t worry.\n“I’m not worried,” Eris said. “Hop in the elevator already, chicken shit.”\nKit did, and as the doors slid shut behind them Eris felt like she was going to be sick with fear, and couldn’t help but wonder if some of it was from Kit. The elevator sank and sank. The air felt like it was thickening, squeezing her temples. Maybe just her imagination.\nShe was relieved when the box came to a stop. Kit jammed her thumb on the close door button to keep it from opening. Eris listened, wondering if Schorr was standing on the other side, waiting for them. But when Kit fed a little hairline cam from her smartglove through the crack in the doors, it showed all clear.\nThey slipped out into a tunnel. Its ancient concrete was splinted by nanotube resin that glistened wetly, making it feel like the gullet of some animal. The air was definitely thicker down here. Damper. It clung to the back of Eris’s throat. Kit moved them forward slowly and stealthily. The lights flickered, like the power was being rerouted, and it made Eris see things in the shadows that weren’t there.\nA T-intersect approached, and as they reached it Eris heard footfalls. Kit scuttled back a step. Crouched. They clung there against the wall as one of Schorr’s men trundled past. Eris wasn’t sure if it was her or Kit holding her breath, but it didn’t get released until he disappeared around the next bend.\nThey started moving again. Eris wanted to suggest that maybe Kit should have just shot him, to give them one less problem to deal with later, but Kit had her mouth sealed shut. They came to a halt outside a door that made Eris’s heart hammer hard. They had passed plenty of doors, but this one was different. It had been widened to fit the crate.\nKit sent another hairline cam, jiggered another lock, and then they were inside. Lights flicked on unbidden, harsh white, surgical, and Eris saw the crate had been opened.\nA glass-and-metal sarcophagus was propped upright facing them. And inside it, she saw a mass of thick green-black ivy and decomposed flesh that she knew had been a human being once.\nEris’s stomach revolted, but she couldn’t avert her eyes, couldn’t keep from tracing the poisonous green roots and tendrils that tangled through cracked bones, the bubbling brown spores clustered at the groin, under the arms. The face was burst open and flowering a bright poisonous red.\n“Shit,” she whispered.\nShit, Kit agreed.\n“I see you’ve met the Green Man,” Schorr’s voice said from behind them.\nKit whirled; Schorr had something out of his pocket, a spindly metal thing that Eris didn’t recognize. He flung it outward, pointing it right at her face, and instead of somersaulting away or snapping it out of his hand or doing any other kind of ninja thing, Eris found herself frozen again. The thrum was all through her body this time.\nFuck, fuck, fuck, it’s a halo. I’m going to lose you. Look, Eris, just stay calm and—\nKit’s voice cut out. Schorr stepped forward, twisting the thing together, making it into a circle. He set it gently on her head like he was crowning her. It tightened and clung there.\n“This should help you feel a little more like yourself,” he said.\nEris realized her muscles were hers again, but when she tried to move her arms they didn’t respond, hanging there heavy as lead. The halo was fucking them up, too. Her chest went tight with panic.\nKit was gone, and now it was only her, stuck somewhere underground with the leader of a doomsday cult and two of his thugs, one of whom had already found the biogun in her waistband, and Schorr knew about the OCI and the brainshare and she was dead dead dead. She felt oddly numb as they stripped her of the weapon and the smart glove and dragged her away from the sarcophagus. Her arms dangled uselessly.\n“All this for a fucking corpse?” she asked. She knew she should be using whatever time she had left to make a case for her life, but somehow, even facing imminent death, the Green Man was still the scariest thing in the room.\nSchorr didn’t answer for a moment, walking to the sarcophagus instead and placing his hand against the glass. “You’re from the colonies, aren’t you? At first I wasn’t sure. There are so few of you in the City. Only a handful in nearly a billion inhabitants.” He paused. “Do you like it here?”\nEris gave a shrug that she hoped looked contemptuous and unafraid. Whatever Schorr was playing at, he hadn’t killed her yet.\n“From a certain perspective, it’s everything our ancestors dreamed of,” Schorr said. “Triple the size of any the old metropolises built before the Calamities. Towers to heaven, cars that fly, one language, no hunger, no . . . disease.”\nHis face turned hard and angry.\n“And all it cost us was seventy percent of the world’s population in a century of mass death,” he said. “But after all that, all the wars, the floods, the famines, we didn’t learn a thing. Not one thing. Forward thinkers did their best in the aftermath. The Neoprim movements, for one, tried to show people a better way.” He gave a smile that reminded Eris of the tweaker Kit had wasted. “The fact that you were born at all is thanks to that better way. You would have been an early termination here in the City. It’s easier to be cruel when people become populations. When they become numbers.”\nEris couldn’t help thinking of the serial numbers on her arms, the license holo on her cab, the figure in her Bank account that seemed to be always eroding and never growing. The City did make her feel like a number. The City was cruel in a lot of ways.\n“But the colonies aren’t enough,” Schorr continued. “The mass exodus we envisioned never happened, and now the City is swelling like a tick. Repeating all our old mistakes. The only true solution is a full reset. Acknowledge that everything from agriculture onward was a blip on the radar. That’s where the Green Man comes in.”\nEris shot another look at the sarcophagus and wished she hadn’t.\n“The colonies made themselves useful in another way,” Schorr said. “As a breeding ground for disease. One of which was a fast-acting fungal infection, a particularly vicious strain we’ve never seen before. It decimated two separate colonies before it was contained.”\nEris’s heart dropped. “Bullshit,” she said. “I would know.”\nBut she wouldn’t, she knew she wouldn’t. She avoided anything to do with the colonies because it was easier to slice off that part of her life and cauterize it, and here in the City people didn’t care what happened in the colonies. They didn’t talk about them.\n“This was the only body I managed to save from incineration and have smuggled over,” Schorr said. “A lot of lives were lost. More to come. But none in vain.” His eyes were shining. “Humanity’s going to return to its rightful place. Gaia to hers. We’ll be at peace again, like we were for the first hundred thousand years.”\nA cold question had assembled itself in the corner of Eris’s mind. She asked it now, hoarsely. “Which colonies? Which colonies were wiped out?”\n“Which colony are you from?” Schorr asked.\nShe could barely force the syllables from her lips. “New Tenochtitlan.”\nSchorr’s face twisted. “I’m sorry,” he said. “None in vain.”\nBlack pushed in the sides of her vision. Eris felt herself sink to one knee. She was back in the colony, sitting in the compound dirt with her dad across from her, the magnetic chessboard between them. He was tall and stern with his white beard stark against lined brown skin. He was saying that it would be better for her in the City, and she was thinking that if she could just manage to win the game, he would let her stay.\nBut she’d never won against her dad, not ever, and she never practiced with anyone else because she spent all her spare time in the field driving the village’s battered utility upcar or taking apart motors in the garage. She didn’t win that last game, either.\nEris kept her head down as one of his men led her out of the room, back into the tunnel. If she didn’t look up at all, she wouldn’t be able to look for traces of her dad in the overgrown green corpse.\nThey put her in a storage room, under guard, with a folding chair that sprang upright when she bumped into it. She’d asked, dully, if they were planning to sacrifice her or some culty shit like that. Schorr had laughed before walking out.\nShe ignored the chair and collapsed down against the wall instead. It felt like she was having a nightmare. She felt hot thick guilt for how she never talked about the colony, how she pretended to herself she’d been born in the City like everyone else. She’d spent so long trying to forget her father who’d sent her away. Trying to focus on her arms, on her cab, on things she could change and repair. Now she could see so many old familiar faces in her head, and they kept bursting apart like the Green Man in the sarcophagus.\nShe squeezed her eyes shut and tried to make it all just disappear. It didn’t.\nShe would have to change it.\nEris opened her eyes. No matter how cruel the City was, it was full of innocent people, same as the colonies. Kit and the OCI needed to know about the Green Man, and that meant she needed to get rid of the halo somehow. She turned and dragged her head along the wall, feeling for the halo’s metal edge. It wasn’t loose enough to knock free, but not as tight as she’d feared, either.\nEris kicked off her shoes and pawed off one sock and then the other. Her arms were dead useless weight at her sides, but they hadn’t tied her legs. She scooted back, leaning her shoulders against the wall, and stretched.\nShe’d lost a lot of flexibility since she’d gotten her artis, but not all of it. Brushing her big toe against the halo, however, resulted in a sharp shock. She swore, yanking her foot back down.\n“Alright,” she breathed. “Fuck it.”\nShe stretched again, muscles straining taut, and wriggled her big toe underneath the edge of the halo. The shock bit hard; she saw a hot blue spark fly in her peripheral. Clenching her teeth, she gripped the halo between her big toe and long toe and pulled.\nIt clattered to the floor, spinning like a coin. She silenced it with her other foot. Hopefully the man standing outside hadn’t heard it. Eris tipped her head back against the wall, breathing hard, as feeling returned to her arms. The pads of her toes were blistered red, but not blackened. She figured she would be able to walk properly.\nWhat’s happening? Kit’s voice came blurred, indistinct. Are you alright?\n“Yeah, I’m fucking great, Kit,” Eris said in a whisper. “Schorr’s got a sample of some kind of plague. Something he brought back from the colonies. He’s going to release it here, and then everyone is fucked.”\nThere was a pause that nearly made her panic, made her think Kit’s signal was gone again. The Green Man cometh. Shit. That thing was supposed to have been eradicated. Kit’s voice was agitated, but louder now, clearer. There’s a strike team waiting in the alley. But we’re not equipped to contain a bioweapon. I’m coming in.\nEris’s body thrummed and her head started twisting without her volition, making a sweep of the storage room.\nHave you seen anyone else down here?\n“Still just Schorr and the two big fuckers,” Eris muttered. “He told one of them to watch the door.”\nShe shut her mouth as Kit pushed her face up against the door, listening. Eris heard the sound of shifting weight, fabric rubbing fabric. Kit nearly lost their balance as the door swung open.\nFor an instant Schorr’s man was framed in the doorway, and Eris looked up him like a mountain, the hormone-popped muscle and buzzed head and green tattoos creeping out from his cufflinks. His face was unworried, Eris figured because the last time he’d seen her she’d been crying like a little baby and because she didn’t have working arms, besides.\n“Schorr wants you at the ceremony,” he said, and then he realized the halo was no longer on Eris’s head and his eyes went wide.\nKit dismantled him. Cartilage cracked, air thumped out of a collapsed lung, dead weight slammed the floor. He was still struggling for breath in the fetal position as Kit retrieved the biogun and used Eris’s arms to lever him into the room. She shut the door neatly behind her and the lock buzzed active. It was a good thing Kit was still using her mouth, because Eris knew she would’ve let out a triumphant whoop right about then.\nThat’s music, isn’t it?\nEris concentrated. It was. Chanting and drumbeat, faint but audible. The kind of faux-primal shit she remembered hearing as a kid in the Neoprim colony.\n“Yeah,” Eris said, finding her mouth was hers again. “Let’s go.”\nThey followed the sound of the synthesized drums and wailing, quickly and quietly. Normally Eris’s feet slapped a bit when she walked, but not with Kit moving them—she was poised now, all coiled and balanced like a cat. It made her more hopeful Kit could handle whatever they found at the end of the labyrinth.\nRounding a pitted corner, the music grew louder and Eris started to see small bundles lining the walls, shoes on top.\n“Clothes?” she demanded in a whisper. “Why the fuck are people taking their clothes off?”\nDon’t know. Maybe it’s for some kind of fertility ritual.\n“As in, a big fucking orgy.”\nYeah. Some of them do that.\nThe music reached a fever pitch, then cut out entirely. Eris’s ears felt swamped by the sudden silence. Kit hesitated, then moved ahead even more slowly, creeping towards a pale yellow light leaking from the next corner. She hunkered low and poked Eris’s head around to look.\nTheir tight corridor was one of several emptying into a much larger room, and the room was full of people. They were all naked, and as much as Eris wanted it to look funny or stupid, it didn’t. It looked eerie, all of them standing there in rows in the ghostly yellow light. Some of them had smartpainted their bodies in twisting green vines that slithered up and down their bare skin. Other than that, they were stock-still, all of their eyes fixed on the makeshift plinth in the center of the room.\nThe figure standing on top of it wore ragged robes over a long coat. Their face was hidden under some kind of military issue gas mask, vaguely insectoid, daubed green and brown and set with skeletal antlers. Eris felt a shudder that might have been hers, might have been Kit’s. That had to be Schorr. And looming behind him, propped upright in a sort of groove, was the sarcophagus.\n“You’ve been called here to receive the Green Man’s blessing.”\nSchorr’s voice, dead and amplified, split the air.\n“Tonight is the beginning of the end, my friends.”\nThe naked men and women started to chant something back, raising their hands, then Eris’s view was blocked as Kit pulled her shirt over her head.\n“What are we doing?” Eris hissed, muffled by the fabric.\nHe’s inoculating them, right? These are his followers. Kit peeled her trousers off next, see-sawing them off her hips. We can join in. Get close enough.\n“And then?”\nKill Schorr.\n“What, with my bare fucking hands?” Eris demanded. Kit kicked off her shoes and shucked off her bra and underwear.\nWith no hands. I’m going to have to take your arms off, Eris.\nEris blinked. All the naked bodies, some of them scarred, none of them with visible implants or prostheses. She remembered back to what Ndirangu had said all those eons ago. Neo-Luddite. Rejection of technology. She wondered if they knew Schorr had Optiks.\nOkay? Kit’s voice sounded almost ashamed.\nEris tongued the gap in her molars. “Okay,” she said. “Let me do it.”\nNow she was almost sure it was a nightmare. With Kit directing her steps, Eris felt like she was gliding through the crowd, magnetically drawn to the plinth where Schorr and the Green Man waited. Her bare skin was swathed in goose bumps and the nubbed ends of her arms felt every cold current in the air. When she brushed the left by accident against someone else’s clammy skin, her nerve terminations screamed.\nThe biogun was tucked into her right armpit, blunt muzzle all but concealed. Schorr was still speaking, but Eris couldn’t hear it. Too absorbed in the rest of it, in the naked bodies pale and dark sliding against hers, in the quickcrete—no, concrete, this stuff was ancient—that spiked cold against the bottom of her feet. The sweat trickling from under her armpits. The blank and fevered faces all around her.\nShe was sure at any second they would spot the biogun and realize she wasn’t one of them and tear her to shreds. She wanted to turn and run, scoop her arms back from where she’d stashed them in the corridor, make like hell for the elevator. But she couldn’t. Not with Kit propelling her forward, and not with Schorr planning to turn the whole City, the City she sometimes hated so much, into overgrown corpses like had been done to her colony.\nEveryone was pressing closer, now, crushing in against the plinth, and Eris looked for an injector or an autosurgeon, something he would use to distribute the Vaxine update that would keep them safe from his plague. But there was nothing up there with him except the casket and a dull metal beaker.\nEris realized what the Green Man’s blessing was the split second before Schorr thumbed the catch. The casket split open with a pneumatic hiss, an innocuous puff of dust. The crowd was clamoring for the Green Man. Pressing in close, climbing up the plinth, trying to touch him. Schorr reached into the casket and plucked one finger from the Green Man’s desiccated hand like picking an overripe fruit. He crumbled it into the beaker. Eris could hear the powder hiss as it hit water, or maybe only imagined it.\nShe tried to wrest control back from Kit. She needed to scream. She needed to tell them not to fucking drink it, not to even fucking touch it. But Kit was still moving, grim and steady, toward the plinth. Eris watched the beaker pass from hand to hand, dark fluid leaking from pale lips. She knew they were already dead. Schorr wasn’t inoculating his followers; he was using them as his final test subjects.\nSomeone who wasn’t Eris started to scream. The first devotees to drink from the beaker were writhing now, toppling backward off the plinth into the crowd. She saw the infection moving through their bodies like a time-lapse, their fingers and faces swelling, bubbling, poisonous green and mud brown. She could almost feel it.\nKit accelerated, weaving through bodies. Three figures in hazard suits had detached themselves from the shadows and now were closing the casket again, dragging it backward onto a hoverjack. Schorr was still standing, still watching the chaos. People ran, panicked—if they’d come expecting to die, they hadn’t expected it to be this painful.\nKit had them close, now, close enough to reach out and grab the rough corner of the plinth. Schorr noticed, finally turning his masked head. Eris saw her ghostly reflection in the insectoid eyes. Kit twisted so the biogun was aimed right at him, all she had to do was squeeze and at this range she’d said it would shred right through him and—\nOne of the fleeing devotees blindsided her, smacking an arm across her chin. Eris would’ve known how to twist, how to compensate, but Kit was unbalanced by it and she staggered. Suddenly they were on the floor, rolling to avoid feet, the biogun gone. Someone tripped on her, stomped by accident on her gut; the wind went out of her hard. By the time Kit had her upright, Schorr was gone, too. She vaulted them up on the plinth, spinning, searching.\nThere.\nThe sarcophagus was gliding away through the crowd, back the way they’d come, ushered by Schorr and his men. Back into the crush. Kit kept her eyes fixed on the target, but Eris saw flashes of the infected men and women, all wailing and writhing. Was this how it had been in the colony? Was this how her father had died?\nShe saw the tail end of the sarcophagus disappearing around the next corner. She was running faster than she’d ever, Kit wringing every last bit of energy from her muscles. They made it to the elevator just as the doors slid shut on Schorr’s turned back.\nShit!\n“Aren’t your people waiting for him at the top?” Eris gasped.\nHe’s already streamed the footage of what just happened back there. Says if there’s any attempt to follow him, he feeds the Green Man through a nebulizer and the spores go airborne. Says he’s open to negotiations.\n“Bullshit,” Eris snapped. “He’s lying. He wants to do the whole fucking City.”\nI’m being ordered to stand down, Eris. I fucked this up. Bad.\n“Then if Ndirangu asks, it was all me,” Eris said.\nThere was a pause. There’s a civilian upcar that’ll be unlocked and unalarmed just around the block. And from here on in, the brainshare implant is malfunctioning.\nThe thrumming returned, and an instant later Eris’s body was hers again. The lactic acid in her muscles and aches in her joints made her want to collapse to the floor and rest for a second, just a second. Instead, she staggered back down the hallway. Found her clothes. Her arms. She chinned them back into place. Artinerves snaked up to meet the tender flesh and she flexed her metal fingers.\n“Fucking right I drive this time,” she muttered.\nSchorr was in one of the white vans, climbing fast, by the time Eris threw herself inside the little blue upcar Kit had picked for her. It wasn’t the absolute last vehicle Eris would’ve snagged for a pursuit, but it was close. She slammed over to manual and hauled it up off the pavement, making a dozen hurried adjustments to the dampers, the updrive, the seat. There was no way she was going to catch the van with the inbuilt speed limits still operational, but if she stopped to do the rewiring, Schorr was good as gone.\nEris jammed the seat back and drove with her feet, how she’d done on the battered old ute in the colony, while she gutted the panel with her metal hands. She’d lost some dexterity over the years. Lost the calluses, too.\nBut she could still do it. One foot on the pedals and one steering, she split her concentration between navigating the lower streets, mercifully empty of traffic, and finding the right port on her arm. The van was still in sight, bulling through a cloud of camera drones she assumed were OCI, but in another second it would be a speck and then gone entirely.\n“Couldn’t have found me a fucking custom?” she breathed, even though she wasn’t sure Kit could hear her anymore. She hunted through a tangle of wires, taking both eyes off the windshield, and was nearly blindsided by a cab. The proximity alert wailed, and she could see the driver mouthing off, too, but it didn’t matter because she’d found the right wire and the right port.\nShe fed it in, and suddenly she could feel the upcar like an extension of her arms, which were an extension of her brain, and in her brain she decided to go however fucking fast she wanted. She deleted the limits, gunned the engine, and acceleration pinned her to her seat like an invisible hand.\nSchorr had a big gap on her, but he was driving carefully. Eris wasn’t. She was driving wild. Her metal hands were barely skimming the steering wheel, plucking it left, down, right, left, up, fast enough to blur. The City was streaming all around her, unfocused, but she knew its architecture like she knew her own body and all she had to do was follow the van and not even brush another upcar or drone. Her tongue was planted firm between her molars.\nShe was shredding the speed limits to pieces, but Kit had to be blocking the safety signal that would have normally overridden her by now. And if there were sweepers patrolling, she’d like to see them try to catch her. Eris knew she shouldn’t be smiling. Kit wouldn’t have been smiling. But her lips were dragged back off her teeth all the same.\nShe felt good. Really good. And if there were Green Man spores already inside her, if she was moments from bursting into a viny writhing mess, the instant crash would probably kill her before the infection did. She came level with the white van, then hurtled past it, and she realized where Schorr was heading.\nShe cut speed, matching Schorr, who tried to shake left. Eris clung to him like a shadow. Up ahead, one of the City’s largest filtration plants approached, a somber giant in gunmetal grays and blues. Pipettes stretched from its towering tanks into the surrounding infrastructure, pumping water through the City like a beating heart, and that was where Schorr wanted to release the Green Man.\nWhich meant he’d been bluffing about taking it airborne. Eris thought back to the underground communion, the beaker being passed. The spores needed water.\nSchorr banked hard and down, and Eris realized something else: he didn’t need to get all the way to the plant entrance. He only needed to get to one of the water tanks, and those were a hell of a lot closer. The white van put on a final burst of speed, angling towards the nearest of them, and Eris could see the top of the tank sliding open via whatever override code Ferris Carrow, owner of half the filtration plants in the City, the woman with the flower in her stomach, had been murdered for.\nEris could already imagine the van puttering to a neat halt, Schorr’s men shoving the open casket out the back so it dropped down into the tank like a pill into a water glass. The Green Man would fizz and dissolve and the City would drink his dead body. Use it in their showers, their hydroponics. If there were safety valves to isolate the tank she figured Schorr had codes for those, too.\nThey were bare meters away from the tank. She reached for the extra impact webbing and tugged it over herself. Clenched her teeth, then unclenched them, trying to guess what would make them least likely to shatter in her jaw. Breathed deep.\nAll it took was a twitch to send her smashing into the top of the van. The sound of shearing metal filled her ears and the impact shook her bones. She could feel herself screaming in her chest as they spun. Feedback from her arms rolled over her like a static wave. She yanked them free and covered her head as the upcar and the van, tangled now, hit the lip of the water tower.\nThe impact webbing wove itself around her like an ammonia-smelling cocoon, wrapping her in darkness, but she still felt the upcar crumple. Her head still snapped forward, back. Her teeth scraped her tongue raw on their way shut. Metal was moving all around her, squealing and crunching, and then suddenly there was stillness.\nEris wanted to flop backward and breathe for a minute, stay in the warm hug of the impact webbing, but she tore her way free instead. The upcar had flipped around, so she had to punch her way out of the back. The whole chassis was shifting, rocking, and when she finally dragged herself out she realized her plan had half-worked.\nThey’d splintered against the lip of the water tower; her upcar was still riding the top of the van, which was now sheared in two. The front end of it was a mangle of debris falling down, down, down into the City depths. The back end had skidded over the edge more or less intact, and its doors were torn open. Steam was gushing out.\nEris climbed down from the wreckage on wobbly legs. She managed to nick herself a few times, but she could hardly feel the sting, too buzzed with adrenaline still. The top of the water tank hadn’t opened all the way, leaving a few meters of slippery metal floor. She approached the edge with a feeling of dread, wondering if she was going to see the casket bobbing inside, if she’d accidentally dumped the Green Man exactly where Schorr wanted him.\nBut when she craned over the edge, she saw only gurgling water. Relief hit her all at once. She sank to a crouch, feeling the adrenaline start to ebb. She’d done it. Holy fuck.\n“Holy fuck,” she choked. “Did you see that shit, Kit?”\nAnother creaky groan came from behind her. She turned, expecting to see the remains of the upcar sliding off the van, not expecting to see Schorr emerging from the back like some kind of bogeyman, framed by billowing steam. His long coat was torn and one of the antlers had snapped clean off his gas mask, but apart from that he didn’t look the least bit shook by the crash.\n“You fucking bitch.” The words came out dead and flat through the mask, but Eris had the distinct feeling they would have sounded the same without it. Schorr had another halo out, pointing it at her.\nEris didn’t feel a thing. Kit really had severed the brainshare.\n“That was all me,” Eris said, forcing a bravado she didn’t feel, not even a little. “OCI’s going to be all over your ass in about two fucking seconds, though.” She could hear the wail of emergency drones approaching and hoped a silver upcar or two were with them.\n“Then I’ll be quick,” Schorr said, and he turned back to the van. Going back for the casket. Eris stood frozen for a second, then anger poured through and thawed her. He was ignoring her. Just fucking ignoring her, like with no brainshare she was no threat at all. Eris sprung the stunspray from her arm and lunged.\nSchorr swatted her out of the air without even turning around. He had to have back-cams in that mask of his, and maybe he had some kind of skeletal implants, too, because he was stronger than any asshole philanthropist-slash-cultist had a right to be. Eris hit the ground hard with the breath smashed out of her lungs. She saw Schorr’s boot stomp down on her wrist, crushing circuitry, and her fingers spasmed. The stunspray flew out of her grip. She heard it bounce once, twice, then a distant splash as it went into the tank. Shit.\n“What do you think you’re doing?” Schorr asked. “Is being a hero now for the blink of an eye worth being a villain for the rest of eternity?” He seized the edge of the casket with both hands and started to pull. The metal screeched, throwing sparks. “It’s that lack of foresight that got us here in the first place,” he grunted.\nEris rolled over. Coughed. “New Tenochtitlan,” she rasped. “Were you telling the truth?”\n“Yes.”\nEris threw herself at his back again, making her fists into clubs, battering his head and shoulders. This time Schorr spun and reached. The arm he’d stomped on was slow, jittery, and he managed to grip it now with both hands. He planted one foot on Eris’s shoulder and tore it free. Feedback lanced all the way down Eris’s spine like a plume of lava. She howled.\nAnother kick took the wind out of her, and she sprawled back on the slick metal. Schorr dragged the casket towards the edge. Towards the swirling water.\n“Kit, where the fuck are you?” Eris hollered. She crawled after him on hand and knees, still convulsing. He had the casket poised on the lip. The Green Man, shaken apart by the crash, was barely human-looking at all now, just a viscous, poisonous green mass.\nSchorr was leaning down to thumb the catch when his gloved hand blew apart. Eris blinked as a splinter of bloody bone flew past her face. She stared at Schorr, who stared back at her through the lenses of his mask, both of them equally surprised. Then the second shot cracked the air, and his lenses splattered bright red. He crumpled.\nAs his lifeless body fell, it knocked into the casket and sent it lurching forward. Eris flung out her remaining arm and clamped to it. Feedback seared and she couldn’t reach to switch it off. She gritted her teeth instead as she dug her heels in and pulled. The casket shifted by millimeter increments. Polymer muscles popped and strained in her arm. She pulled. Pulled.\nFinally the casket rocked backward, and Eris collapsed on top of it like she could pin it there permanently. She was still lying like that, gasping for breath, when the silver upcar touched down and Kit dropped out wearing a harness with her sniper rifle stowed in back of it.\n“Holy shit, Eris.”\nKit squatted down beside her, checking her over with a mediscanner, then moved her off the casket. In Eris’s peripherals she could see people in hazard suits with scanners of their own. Two of them were bagging Schorr’s body.\nA blurred out face appeared over her. “Well done, Eris,” Ndirangu’s voice said. “We’ll get you a replacement for the damaged arm. And I’ve just put the request through regarding the traffic cams.”\nEris tipped her head back against the cold metal roof of the water tower. “Fuck that,” she said. “How about you just give me a job?”\nKit gave her gravelly laugh. Eris didn’t mind. She didn’t like wearing black anyways, and had something more important to do, besides. Have the OCI pay her way back across the ocean on the first available vessel. She needed to see New Tenochtitlan, or what was left of it. She needed to see stars again.\nShe needed to know if her dad was really gone. Eris took a deep breath of the cold night air, and for a moment she could taste the prickling warm breeze that swept through the colony compound at night. Whatever she found over there, she would deal with it. Hopefully the replacement arm would be ready by the time she left, but if it wasn’t, she would deal with that, too.\nShe was exactly as tough as she thought she was.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "source": "https://clarkesworldmagazine.com/larson_09_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Green Man Cometh by Rich Larson"}