{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Vina Jie-Min Prasad", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "UNBd/koBZc8n2w7OzaxP/gu6Tuw=", "id": null, "license": null, "comments": "", "raw_text": "7900 words, novelette  A Series of Steaks  2017 Finalist: Nebula Award for Best Novelette 2018 Finalist: Hugo Award for Best Novelette 2018 Finalist: Theodore A. Sturgeon Memorial Award All known forgeries are tales of failure. The people who get into the newsfeeds for their brilliant attempts to cheat the system with their fraudulent Renaissance masterpieces or their stacks of fake checks, well, they might be successful artists, but they certainly haven’t been successful at forgery.  The best forgeries are the ones that disappear from notice—a second-rate still-life moldering away in gallery storage, a battered old 50-yuan note at the bottom of a cashier drawer—or even a printed strip of Matsusaka beef, sliding between someone’s parted lips.  Forging beef is similar to printmaking—every step of the process has to be done with the final print in mind. A red that’s too dark looks putrid, a white that’s too pure looks artificial. All beef is supposed to come from a cow, so stipple the red with dots, flecks, lines of white to fake variance in muscle fiber regions. Cows are similar, but cows aren’t uniform—use fractals to randomize marbling after defining the basic look. Cut the sheets of beef manually to get an authentic ragged edge, don’t get lazy and depend on the bioprinter for that.  Days of research and calibration and cursing the printer will all vanish into someone’s gullet in seconds, if the job’s done right.  Helena Li Yuanhui of Splendid Beef Enterprises is an expert in doing the job right.  The trick is not to get too ambitious. Most forgers are caught out by the smallest errors—a tiny amount of period-inaccurate pigment, a crack in the oil paint that looks too artificial, or a misplaced watermark on a passport. Printing something large increases the chances of a fatal misstep. Stick with small-scale jobs, stick with a small group of regular clients, and in time, Splendid Beef Enterprises will turn enough of a profit for Helena to get a real name change, leave Nanjing, and forget this whole sorry venture ever happened.  As Helena’s loading the beef into refrigerated boxes for drone delivery, a notification pops up on her iKontakt frames. Helena sighs, turns the volume on her earpiece down, and takes the call.  “Hi, Mr. Chan, could you switch to a secure line? You just need to tap the button with a lock icon, it’s very easy.”  “Nonsense!” Mr. Chan booms. “If the government were going to catch us they’d have done so by now! Anyway, I just called to tell you how pleased I am with the latest batch. Such a shame, though, all that talent and your work just gets gobbled up in seconds—tell you what, girl, for the next beef special, how about I tell everyone that the beef came from one of those fancy vertical farms? I’m sure they’d have nice things to say then!”  “Please don’t,” Helena says, careful not to let her Cantonese accent slip through. It tends to show after long periods without any human interaction, which is an apt summary of the past few months. “It’s best if no one pays attention to it.”  “You know, Helena, you do good work, but I’m very concerned about your self-esteem, I know if I printed something like that I’d want everyone to appreciate it! Let me tell you about this article my daughter sent me, you know research says that people without friends are prone to . . . ” Mr. Chan rambles on as Helena sticks the labels on the boxes—Grilliam Shakespeare, Gyuuzen Sukiyaki, Fatty Chan’s Restaurant—and thankfully hangs up before Helena sinks into further depression. She takes her iKontakt off before heading to the drone delivery office, giving herself some time to recover from Mr. Chan’s relentless cheerfulness.  Helena has five missed calls by the time she gets back. A red phone icon blares at the corner of her vision before blinking out, replaced by the incoming-call notification. It’s secured and anonymized, which is quite a change from usual. She pops the earpiece in.  “Yeah, Mr. Chan?”  “This isn’t Mr. Chan,” someone says. “I have a job for Splendid Beef Enterprises.”  “All right, sir. Could I get your name and what you need? If you could provide me with the deadline, that would help too.”  “I prefer to remain anonymous,” the man says.  “Yes, I understand, secrecy is rather important.” Helena restrains the urge to roll her eyes at how needlessly cryptic this guy is. “Could I know about the deadline and brief?”  “I need two hundred T-bone steaks by the 8th of August. 38.1 to 40.2 millimeter thickness for each one.” A notification to download t-bone_info.KZIP pops up on her lenses. The most ambitious venture Helena’s undertaken in the past few months has been Gyuuzen’s strips of marbled sukiyaki, and even that felt a bit like pushing it. A whole steak? Hell no.  “I’m sorry, sir, but I don’t think my business can handle that. Perhaps you could try—”  “I think you’ll be interested in this job, Helen Lee Jyun Wai.”  Shit.  A Sculpere 9410S only takes thirty minutes to disassemble, if you know the right tricks. Manually eject the cell cartridges, slide the external casing off to expose the inner screws, and detach the print heads before disassembling the power unit. There are a few extra steps in this case—for instance, the stickers that say “Property of Hong Kong Scientific University” and “Bioprinting Lab A5” all need to be removed—but a bit of anti-adhesive spray will ensure that everything’s on schedule. Ideally she’d buy a new printer, but she needs to save her cash for the name change once she hits Nanjing.  It’s not expulsion if you leave before you get kicked out, she tells herself, but even she can tell that’s a lie.  It’s possible to get a sense of a client’s priorities just from the documents they send. For instance, Mr. Chan usually mentions some recipes that he’s considering, and Ms. Huang from Gyuuzen tends to attach examples of the marbling patterns she wants. This new client seems to have attached a whole document dedicated to the recent amendments in the criminal code, with the ones relevant to Helena (“five-year statute of limitations,” “possible death penalty”) conveniently highlighted in neon yellow.  Sadly, this level of detail hasn’t carried over to the spec sheet.  “Hi again, sir,” Helena says. “I’ve read through what you’ve sent, but I really need more details before starting on the job. Could you provide me with the full measurements? I’ll need the expected length and breadth in addition to the thickness.”  “It’s already there. Learn to read.”  “I know you filled that part in, sir,” Helena says, gritting her teeth. “But we’re a printing company, not a farm. I’ll need more detail than ‘16-18 month cow, grain-fed, Hereford breed’ to do the job properly.”  “You went to university, didn’t you? I’m sure you can figure out something as basic as that, even if you didn’t graduate.”  “Ha ha. Of course.” Helena resists the urge to yank her earpiece out. “I’ll get right on that. Also, there is the issue of pay . . . ”  “Ah, yes. I’m quite sure the Yuen family is still itching to prosecute. How about you do the job, and in return, I don’t tell them where you’re hiding?”  “I’m sorry, sir, but even then I’ll need an initial deposit to cover the printing, and of course there’s the matter of the Hereford samples.” Which I already have in the bioreactor, but there is no way I’m letting you know that.  “Fine. I’ll expect detailed daily updates,” Mr. Anonymous says. “I know how you get with deadlines. Don’t fuck it up.”  “Of course not,” Helena says. “Also, about the deadline—would it be possible to push it back? Four weeks is quite short for this job.”  “No,” Mr. Anonymous says curtly, and hangs up.  Helena lets out a very long breath so she doesn’t end up screaming, and takes a moment to curse Mr. Anonymous and his whole family in Cantonese.  It’s physically impossible to complete the renders and finish the print in four weeks, unless she figures out a way to turn her printer into a time machine, and if that were possible she might as well go back and redo the past few years, or maybe her whole life. If she had majored in art, maybe she’d be a designer by now—or hell, while she’s busy dreaming, she could even have been the next Raverat, the next Mantuana—instead of a failed artist living in a shithole concrete box, clinging to the wreckage of all her past mistakes.  She leans against the wall for a while, exhales, then slaps on a proxy and starts drafting a help-wanted ad.  Lily Yonezawa (darknet username: yurisquared) arrives at Nanjing High Tech Industrial Park at 8.58 AM. She’s a short lady with long black hair and circle-framed iKontakts. She’s wearing a loose, floaty dress, smooth lines of white tinged with yellow-green, and there’s a large prismatic bracelet gleaming on her arm. In comparison, Helena is wearing her least holey black blouse and a pair of jeans, which is a step up from her usual attire of myoglobin-stained T-shirt and boxer shorts.  “So,” Lily says in rapid, slightly-accented Mandarin as she bounds into the office. “This place is a beef place, right? I pulled some of the records once I got the address, hope you don’t mind—anyway, what do you want me to help print or render or design or whatever? I know I said I had a background in confections and baking, but I’m totally open to anything!” She pumps her fist in a show of determination. The loose-fitting prismatic bracelet slides up and down.  Helena blinks at Lily with the weariness of someone who’s spent most of their night frantically trying to make their office presentable. She decides to skip most of the briefing, as Lily doesn’t seem like the sort who needs to be eased into anything.  “How much do you know about beef?”  “I used to watch a whole bunch of farming documentaries with my ex, does that count?”  “No. Here at Splendid Beef Enterprises—”  “Oh, by the way, do you have a logo? I searched your company registration but nothing really came up. Need me to design one?”  “Here at Splendid Beef Enterprises, we make fake beef and sell it to restaurants.”  “So, like, soy-lentil stuff?”  “Homegrown cloned cell lines,” Helena says. “Mostly Matsusaka, with some Hereford if clients specify it.” She gestures at the bioreactor humming away in a corner.  “Wait, isn’t fake food like those knockoff eggs made of calcium carbonate? If you’re using cow cells, this seems pretty real to me.” Clearly Lily has a more practical definition of fake than the China Food and Drug Administration.  “It’s more like . . . let’s say you have a painting in a gallery and you say it’s by a famous artist. Lots of people would come look at it because of the name alone and write reviews talking about its exquisite use of chiaroscuro, as expected of the old masters, I can’t believe that it looks so real even though it was painted centuries ago. But if you say, hey, this great painting was by some no-name loser, I was just lying about where it came from . . . well, it’d still be the same painting, but people would want all their money back.”  “Oh, I get it,” Lily says, scrutinizing the bioreactor. She taps its shiny polymer shell with her knuckles, and her bracelet bumps against it. Helena tries not to wince. “Anyway, how legal is this? This meat forgery thing?”  “It’s not illegal yet,” Helena says. “It’s kind of a gray area, really.”  “Great!” Lily smacks her fist into her open palm. “Now, how can I help? I’m totally down for anything! You can even ask me to clean the office if you want—wow, this is really dusty, maybe I should just clean it to make sure—”  Helena reminds herself that having an assistant isn’t entirely bad news. Wolfgang Beltracchi was only able to carry out large-scale forgeries with his assistant’s help, and they even got along well enough to get married and have a kid without killing each other.  Then again, the Beltracchis both got caught, so maybe she shouldn’t be too optimistic.  Cows that undergo extreme stress while waiting for slaughter are known as dark cutters. The stress causes them to deplete all their glycogen reserves, and when butchered, their meat turns a dark blackish-red. The meat of dark cutters is generally considered low-quality.  As a low-quality person waiting for slaughter, Helena understands how those cows feel. Mr. Anonymous, stymied by the industrial park’s regular sweeps for trackers and external cameras, has taken to sending Helena grainy aerial photographs of herself together with exhortations to work harder. This isn’t exactly news—she already knew he had her details, and drones are pretty cheap—but still. When Lily raps on the door in the morning, Helena sometimes jolts awake in a panic before she realizes that it isn’t Mr. Anonymous coming for her. This isn’t helped by the fact that Lily’s gentle knocks seem to be equivalent to other people’s knockout blows.  By now Helena’s introduced Lily to the basics, and she’s a surprisingly quick study. It doesn’t take her long to figure out how to randomize the fat marbling with Fractalgenr8, and she’s been handed the task of printing the beef strips for Gyuuzen and Fatty Chan, then packing them for drone delivery. It’s not ideal, but it lets Helena concentrate on the base model for the T-bone steak, which is the most complicated thing she’s ever tried to render.  A T-bone steak is a combination of two cuts of meat, lean tenderloin and fatty strip steak, separated by a hard ridge of vertebral bone. Simply cutting into one is a near-religious experience, red meat parting under the knife to reveal smooth white bone, with the beef fat dripping down to pool on the plate. At least, that’s what the socialites’ food blogs say. To be accurate, they say something more like “omfg this is sooooooo good,” “this bones giving me a boner lol,” and “haha im so getting this sonic-cleaned for my collection!!!,” but Helena pretends they actually meant to communicate something more coherent.  The problem is a lack of references. Most of the accessible photographs only provide a top-down view, and Helena’s left to extrapolate from blurry videos and password-protected previews of bovine myology databases, which don’t get her much closer to figuring out how the meat adheres to the bone. Helena’s forced to dig through ancient research papers and diagrams that focus on where to cut to maximize meat yield, quantifying the difference between porterhouse and T-bone cuts, and not hey, if you’re reading this decades in the future, here’s how to make a good facsimile of a steak. Helena’s tempted to run outside and scream in frustration, but Lily would probably insist on running outside and screaming with her as a matter of company solidarity, and with their luck, probably Mr. Anonymous would find out about Lily right then, even after all the trouble she’s taken to censor any mention of her new assistant from the files and the reports and argh she needs sleep.  Meanwhile, Lily’s already scheduled everything for print, judging by the way she’s spinning around in Helena’s spare swivel chair.  “Hey, Lily,” Helena says, stifling a yawn. “Why don’t you play around with this for a bit? It’s the base model for a T-bone steak. Just familiarize yourself with the fiber extrusion and mapping, see if you can get it to look like the reference photos. Don’t worry, I’ve saved a copy elsewhere.” Good luck doing the impossible, Helena doesn’t say. You’re bound to have memorized the shortcut for ‘undo’ by the time I wake up.  Helena wakes up to Lily humming a cheerful tune and a mostly-complete T-bone model rotating on her screen. She blinks a few times, but no—it’s still there. Lily’s effortlessly linking the rest of the meat, fat and gristle to the side of the bone, deforming the muscle fibers to account for the bone’s presence.  “What did you do,” Helena blurts out.  Lily turns around to face her, fiddling with her bracelet. “Uh, did I do it wrong?”  “Rotate it a bit, let me see the top view. How did you do it?”  “It’s a little like the human vertebral column, isn’t it? There’s plenty of references for that.” She taps the screen twice, switching focus to an image of a human cross-section. “See how it attaches here and here? I just used that as a reference, and boom.”  Ugh, Helena thinks to herself. She’s been out of university for way too long if she’s forgetting basic homology.  “Wait, is it correct? Did I mess up?”  “No, no,” Helena says. “This is really good. Better than . . . well, better than I did, anyway.”  “Awesome! Can I get a raise?”  “You can get yourself a sesame pancake,” Helena says. “My treat.”  The brief requires two hundred similar-but-unique steaks at randomized thicknesses of 38.1 to 40.2 mm, and the number and density of meat fibers pretty much precludes Helena from rendering it on her own rig. She doesn’t want to pay to outsource computing power, so they’re using spare processing cycles from other personal rigs and staggering the loads. Straightforward bone surfaces get rendered in afternoons, and fiber-dense tissues get rendered at off-peak hours.  It’s three in the morning. Helena’s in her Pokko the Penguin T-shirt and boxer shorts, and Lily’s wearing Yayoi Kusama-ish pajamas that make her look like she’s been obliterated by a mass of polka dots. Both of them are staring at their screens, eating cups of Zhuzhu Brand Artificial Char Siew Noodles. As Lily’s job moves to the front of Render@Home’s Finland queue, the graph updates to show a downtick in Mauritius. Helena’s fingers frantically skim across the touchpad, queuing as many jobs as she can.  Her chopsticks scrape the bottom of the mycefoam cup, and she tilts the container to shovel the remaining fake pork fragments into her mouth. Zhuzhu’s using extruded soy proteins, and they’ve punched up the glutamate percentage since she last bought them. The roasted char siew flavor is lacking, and the texture is crumby since the factory skimped on the extrusion time, but any hot food is practically heaven at this time of the night. Day. Whatever.  The thing about the rendering stage is that there’s a lot of panic-infused downtime. After queuing the requests, they can’t really do anything else—the requests might fail, or the rig might crash, or they might lose their place in the queue through some accident of fate and have to do everything all over again. There’s nothing to do besides pray that the requests get through, stay awake until the server limit resets, and repeat the whole process until everything’s done. Staying awake is easy for Helena, as Mr. Anonymous has recently taken to sending pictures of rotting corpses to her iKontakt address, captioned “Work hard or this could be you.” Lily seems to be halfway off to dreamland, possibly because she isn’t seeing misshapen lumps of flesh every time she closes her eyes.  “So,” Lily says, yawning. “How did you get into this business?”  Helena decides it’s too much trouble to figure out a plausible lie, and settles for a very edited version of the truth. “I took art as an elective in high school. My school had a lot of printmaking and 3D printing equipment, so I used it to make custom merch in my spare time—you know, for people who wanted figurines of obscure anime characters, or whatever. Even designed and printed the packaging for them, just to make it look more official. I wanted to study art in university, but that didn’t really work out. Long story short, I ended up moving here from Hong Kong, and since I had a background in printing and bootlegging . . . yeah. What about you?”  “Before the confectionery I did a whole bunch of odd jobs. I used to sell merch for my girlfriend’s band, and that’s how I got started with the short-order printing stuff. They were called POMEGRENADE—it was really hard to fit the whole name on a T-shirt. The keychains sold really well, though.”  “What sort of band were they?”  “Sort of noise-rocky Cantopunk at first—there was this one really cute song I liked, If Marriage Means The Death Of Love Then We Must Both Be Zombies—but Cantonese music was a hard sell, even in Guangzhou, so they ended up being kind of a cover band.”  “Oh, Guangzhou,” Helena says in an attempt to sound knowledgeable, before realizing that the only thing she knows about Guangzhou is that the Red Triad has a particularly profitable organ-printing business there. “Wait, you understand Cantonese?”  “Yeah,” Lily says in Cantonese, tone-perfect. “No one really speaks it around here, so I haven’t used it much.”  “Oh my god, yes, it’s so hard to find Canto-speaking people here.” Helena immediately switches to Cantonese. “Why didn’t you tell me sooner? I’ve been dying to speak it to someone.”  “Sorry, it never came up so I figured it wasn’t very relevant,” Lily says. “Anyway, POMEGRENADE mostly did covers after that, you know, Kick Out The Jams, Zhongnanhai, Chaos Changan, Lightsabre Cocksucking Blues. Whatever got the crowd pumped up, and when they were moshing the hardest, they’d hit the crowd with the Cantopunk and just blast their faces off. I think it left more of an impression that way—like, start with the familiar, then this weird-ass surprise near the end—the merch table always got swamped after they did that.”  “What happened with the girlfriend?”  “We broke up, but we keep in touch. Do you still do art?”  “Not really. The closest thing I get to art is this,” Helena says, rummaging through the various boxes under the table to dig out her sketchbooks. She flips one open and hands it to Lily—white against red, nothing but full-page studies of marbling patterns, and it must be one of the earlier ones because it’s downright amateurish. The lines are all over the place, that marbling on the Wagyu (is that even meant to be Wagyu?) is completely inaccurate, and, fuck, are those tear stains?  Lily turns the pages, tracing the swashes of color with her finger. The hum of the overworked rig fills the room.  “It’s awful, I know.”  “What are you talking about?” Lily’s gaze lingers on Helena’s attempt at a fractal snowflake. “This is really trippy! If you ever want to do some album art, just let me know and I’ll totally hook you up!”  Helena opens her mouth to say something about how she’s not an artist, and how studies of beef marbling wouldn’t make very good album covers, but faced with Lily’s unbridled enthusiasm, she decides to nod instead.  Lily turns the page and it’s that thing she did way back at the beginning, when she was thinking of using a cute cow as the company logo. It’s derivative, it’s kitsch, the whole thing looks like a degraded copy of someone else’s ripoff drawing of a cow’s head, and the fact that Lily’s seriously scrutinizing it makes Helena want to snatch the sketchbook back, toss it into the composter, and sink straight into the concrete floor.  The next page doesn’t grant Helena a reprieve since there’s a whole series of that stupid cow. Versions upon versions of happy cow faces grin straight at Lily, most of them surrounded by little hearts—what was she thinking? What do hearts even have to do with Splendid Beef Enterprises, anyway? Was it just that they were easy to draw?  “Man, I wish we had a logo because this would be super cute! I love the little hearts! It’s like saying we put our heart and soul into whatever we do! Oh, wait, but was that what you meant?”  “It could be,” Helena says, and thankfully the Colorado server opens before Lily can ask any further questions.  The brief requires status reports at the end of each workday, but this gradually falls by the wayside once they hit the point where workdays don’t technically end, especially since Helena really doesn’t want to look at an inbox full of increasingly creepy threats. They’re at the pre-print stage, and Lily’s given up on going back to her own place at night so they can have more time for calibration. What looks right on the screen might not look right once it’s printed, and their lives for the past few days have devolved into staring at endless trays of 32-millimeter beef cubes and checking them for myoglobin concentration, color match in different lighting conditions, fat striation depth, and a whole host of other factors.  There are so many ways for a forgery to go wrong, and only one way it can go right. Helena contemplates this philosophical quandary, and gently thunks her head against the back of her chair.  “Oh my god,” Lily exclaims, shoving her chair back. “I can’t take this anymore! I’m going out to eat something and then I’m getting some sleep. Do you want anything?” She straps on her bunny-patterned filter mask and her metallic sandals. “I’m gonna eat there, so I might take a while to get back.”  “Sesame pancakes, thanks.”  As Lily slams the door, Helena puts her iKontakt frames back on. The left lens flashes a stream of notifications—fifty-seven missed calls over the past five hours, all from an unknown number. Just then, another call comes in, and she reflexively taps the side of the frame.  “You haven’t been updating me on your progress,” Mr. Anonymous says.  “I’m very sorry, sir,” Helena says flatly, having reached the point of tiredness where she’s ceased to feel anything beyond god I want to sleep. This sets Mr. Anonymous on another rant covering the usual topics—poor work ethic, lack of commitment, informing the Yuen family, prosecution, possible death sentence—and Helena struggles to keep her mouth shut before she says something that she might regret.  “Maybe I should send someone to check on you right now,” Mr. Anonymous snarls, before abruptly hanging up.  Helena blearily types out a draft of the report, and makes a note to send a coherent version later in the day, once she gets some sleep and fixes the calibration so she’s not telling him entirely bad news. Just as she’s about to call Lily and ask her to get some hot soy milk to go with the sesame pancakes, the front door rattles in its frame like someone’s trying to punch it down. Judging by the violence, it’s probably Lily. Helena trudges over to open it.  It isn’t. It’s a bulky guy with a flat-top haircut. She stares at him for a moment, then tries to slam the door in his face. He forces the door open and shoves his way inside, grabbing Helena’s arm, and all Helena can think is I can’t believe Mr. Anonymous spent his money on this.  He shoves her against the wall, gripping her wrist so hard that it’s practically getting dented by his fingertips, and pulls out a switchblade, pressing it against the knuckle of her index finger. “Well, I’m not allowed to kill you, but I can fuck you up real bad. Don’t really need all your fingers, do you, girl?”  She clears her throat, and struggles to keep her voice from shaking. “I need them to type—didn’t your boss tell you that?”  “Shut up,” Flat-Top says, flicking the switchblade once, then twice, thinking. “Don’t need your face to type, do you?”  Just then, Lily steps through the door. Flat-Top can’t see her from his angle, and Helena jerks her head, desperately communicating that she should stay out. Lily promptly moves closer.  Helena contemplates murder.  Lily edges towards both of them, slides her bracelet past her wrist and onto her knuckles, and makes a gesture at Helena which either means ‘move to your left’ or ‘I’m imitating a bird, but only with one hand’.  “Hey,” Lily says loudly. “What’s going on here?”  Flat-Top startles, loosening his grip on Helena’s arm, and Helena dodges to the left. Just as Lily’s fist meets his face in a truly vicious uppercut, Helena seizes the opportunity to kick him soundly in the shins.  His head hits the floor, and it’s clear he won’t be moving for a while, or ever. Considering Lily’s normal level of violence towards the front door, this isn’t surprising.  Lily crouches down to check Flat-Top’s breathing. “Well, he’s still alive. Do you prefer him that way?”  “Do not kill him.”  “Sure.” Lily taps the side of Flat-Top’s iKontakt frames with her bracelet, and information scrolls across her lenses. “Okay, his name’s Nicholas Liu Honghui . . . blah blah blah . . . hired to scare someone at this address, anonymous client . . . I think he’s coming to, how do you feel about joint locks?”  It takes a while for Nicholas to stir fully awake. Lily’s on his chest, pinning him to the ground, and Helena’s holding his switchblade to his throat.  “Okay, Nicholas Liu,” Lily says. “We could kill you right now, but that’d make your wife and your . . . what is that red thing she’s holding . . . a baby? Yeah, that’d make your wife and ugly baby quite sad. Now, you’re just going to tell your boss that everything went as expected—”  “Tell him that I cried,” Helena interrupts. “I was here alone, and I cried because I was so scared.”  “Right, got that, Nick? That lady there wept buckets of tears. I don’t exist. Everything went well, and you think there’s no point in sending anyone else over. If you mess up, we’ll visit 42—god, what is this character—42 Something Road and let you know how displeased we are. Now, if you apologize for ruining our morning, I probably won’t break your arm.”  After seeing a wheezing Nicholas to the exit, Lily closes the door, slides her bracelet back onto her wrist, and shakes her head like a deeply disappointed critic. “What an amateur. Didn’t even use burner frames—how the hell did he get hired? And that haircut, wow . . . ”  Helena opts to remain silent. She leans against the wall and stares at the ceiling, hoping that she can wake up from what seems to be a very long nightmare.  “Also, I’m not gonna push it, but I did take out the trash. Can you explain why that crappy hitter decided to pay us a visit?”  “Yeah. Yeah, okay.” Helena’s stomach growls. “This may take a while. Did you get the food?”  “I got your pancakes, and that soy milk place was open, so I got you some. Nearly threw it at that guy, but I figured we’ve got a lot of electronics, so . . . ”  “Thanks,” Helena says, taking a sip. It’s still hot.  Hong Kong Scientific University’s bioprinting program is a prestigious pioneer program funded by mainland China, and Hong Kong is the test bed before the widespread rollout. The laboratories are full of state-of-the-art medical-grade printers and bioreactors, and the instructors are all researchers cherry-picked from the best universities.  As the star student of the pioneer batch, Lee Jyun Wai Helen (student number A3007082A) is selected for a special project. She will help the head instructor work on the basic model of a heart for a dextrocardial patient, the instructor will handle the detailed render and the final print, and a skilled surgeon will do the transplant. As the term progresses and the instructor gets busier and busier, Helen’s role gradually escalates to doing everything except the final print and the transplant. It’s a particularly tricky render, since dextrocardial hearts face right instead of left, but her practice prints are cell-level perfect.  Helen hands the render files and her notes on the printing process to the instructor, then her practical exams begin and she forgets all about it.  The Yuen family discovers Madam Yuen’s defective heart during their mid-autumn family reunion, halfway through an evening harbor cruise. Madam Yuen doesn’t make it back to shore, and instead of a minor footnote in a scientific paper, Helen rapidly becomes front-and-center in an internal investigation into the patient’s death.  Unofficially, the internal investigation discovers that the head instructor’s improper calibration of the printer during the final print led to a slight misalignment in the left ventricle, which eventually caused severe ventricular dysfunction and acute graft failure.  Officially, the root cause of the misprint is Lee Jyun Wai Helen’s negligence and failure to perform under deadline pressure. Madam Yuen’s family threatens to prosecute, but the criminal code doesn’t cover failed organ printing. Helen is expelled, and the Hong Kong Scientific University quietly negotiates a settlement with the Yuens.  After deciding to steal the bioprinter and flee, Helen realizes that she doesn’t have enough money for a full name change and an overseas flight. She settles for a minor name alteration and a flight to Nanjing.  “Wow,” says Lily. “You know, I’m pretty sure you got ripped off with the name alteration thing, there’s no way it costs that much. Also, you used to have pigtails? Seriously?”  Helena snatches her old student ID away from Lily. “Anyway, under the amendments to Article 335, making or supplying substandard printed organs is now an offence punishable by death. The family’s itching to prosecute. If we don’t do the job right, Mr. Anonymous is going to disclose my whereabouts to them.”  “Okay, but from what you’ve told me, this guy is totally not going to let it go even after you’re done. At my old job, we got blackmailed like that all the time, which was really kind of irritating. They’d always try to bargain, and after the first job, they’d say stuff like ‘if you don’t do me this favor I’m going to call the cops and tell them everything’ just to weasel out of paying for the next one.”  “Wait. Was this at the bakery or the merch stand?”  “Uh.” Lily looks a bit sheepish. This is quite unusual, considering that Lily has spent the past four days regaling Helena with tales of the most impressive blood blobs from her period, complete with comparisons to their failed prints. “Are you familiar with the Red Triad? The one in Guangzhou?”  “You mean the organ printers?”  “Yeah, them. I kind of might have been working there before the bakery . . . ?”  “What?”  Lily fiddles with the lacy hem of her skirt. “Well, I mean, the bakery experience seemed more relevant, plus you don’t have to list every job you’ve ever done when you apply for a new one, right?”  “Okay,” Helena says, trying not to think too hard about how all the staff at Splendid Beef Enterprises are now prime candidates for the death penalty. “Okay. What exactly did you do there?”  “Ears and stuff, bladders, spare fingers . . . you’d be surprised how many people need those. I also did some bone work, but that was mainly for the diehards—most of the people we worked on were pretty okay with titanium substitutes. You know, simple stuff.”  “That’s not simple.”  “Well, it’s not like I was printing fancy reversed hearts or anything, and even with the asshole clients it was way easier than baking. Have you ever tried to extrude a spun-sugar globe so you could put a bunch of powder-printed magpies inside? And don’t get me started on cleaning the nozzles after extrusion, because wow . . . ”  Helena decides not to question Lily’s approach to life, because it seems like a certain path to a migraine. “Maybe we should talk about this later.”  “Right, you need to send the update! Can I help?”  The eventual message contains very little detail and a lot of pleading. Lily insists on adding typos just to make Helena seem more rattled, and Helena’s way too tired to argue. After starting the autoclean cycle for the printheads, they set an alarm and flop on Helena’s mattress for a nap.  As Helena’s drifting off, something occurs to her. “Lily? What happened to those people? The ones who tried to blackmail you?”  “Oh,” Lily says casually. “I crushed them.”  The brief specifies that the completed prints need to be loaded into four separate podcars on the morning of 8 August, and provides the delivery code for each. They haven’t been able to find anything in Helena’s iKontakt archives, so their best bet is finding a darknet user who can do a trace.  Lily’s fingers hover over the touchpad. “If we give him the codes, this guy can check the prebooked delivery routes. He seems pretty reliable, do you want to pay the bounty?”  “Do it,” Helena says.  The resultant map file is a mess of meandering lines. They flow across most of Nanjing, criss-crossing each other, but eventually they all terminate at the cargo entrance of the Grand Domaine Luxury Hotel on Jiangdong Middle Road.  “Well, he’s probably not a guest who’s going to eat two hundred steaks on his own.” Lily taps her screen. “Maybe it’s for a hotel restaurant?”  Helena pulls up the Grand Domaine’s web directory, setting her iKontakt to highlight any mentions of restaurants or food in the descriptions. For some irritating design reason, all the booking details are stored in garish images. She snatches the entire August folder, flipping through them one by one before pausing.  The foreground of the image isn’t anything special, just elaborate cursive English stating that Charlie Zhang and Cherry Cai Si Ping will be celebrating their wedding with a ten-course dinner on August 8th at the Royal Ballroom of the Grand Domaine Luxury Hotel.  What catches her eye is the background. It’s red with swirls and streaks of yellow-gold. Typical auspicious wedding colors, but displayed in a very familiar pattern.  It’s the marbled pattern of T-bone steak.  Cherry Cai Si Ping is the daughter of Dominic Cai Yongjing, a specialist in livestock and a new player in Nanjing’s agri-food arena. According to Lily’s extensive knowledge of farming documentaries, Dominic Cai Yongjing is also “the guy with the eyebrows” and “that really boring guy who keeps talking about nothing.”  “Most people have eyebrows,” Helena says, loading one of Lily’s recommended documentaries. “I don’t see . . . oh. Wow.”  “I told you. I mean, I usually like watching stuff about farming, but last year he just started showing up everywhere with his stupid waggly brows! When I watched this with my ex we just made fun of him non-stop.”  Helena fast-forwards through the introduction of Modern Manufacturing: The Vertical Farmer, which involves the camera panning upwards through hundreds of vertically-stacked wire cages. Dominic Cai talks to the host in English, boasting about how he plans to be a key figure in China’s domestic beef industry. He explains his “patented methods” for a couple of minutes, which involves stating and restating that his farm is extremely clean and filled with only the best cattle.  “But what about bovine parasitic cancer?” the host asks. “Isn’t the risk greater in such a cramped space? If the government orders a quarantine, your whole farm . . . ”  “As I’ve said, our hygiene standards are impeccable, and our stock is purebred Hereford!” Cai slaps the flank of a cow through the cage bars, and it moos irritatedly in response. “There is absolutely no way it could happen here!”  Helena does some mental calculations. Aired last year, when the farm recently opened, and that cow looks around six months old . . . and now a request for steaks from cows that are sixteen to eighteen months old . . .  “So,” Lily says, leaning on the back of Helena’s chair. “Bovine parasitic cancer?”  “Judging by the timing, it probably hit them last month. It’s usually the older cows that get infected first. He’d have killed them to stop the spread . . . but if it’s the internal strain, the tumors would have made their meat unusable after excision. His first batch of cows was probably meant to be for the wedding dinner. What we’re printing is the cover-up.”  “But it’s not like steak’s a standard course in wedding dinners or anything, right? Can’t they just change it to roast duck or abalone or something?” Lily looks fairly puzzled, probably because she hasn’t been subjected to as many weddings as Helena has.  “Mr. Cai’s the one bankrolling it, so it’s a staging ground for the Cai family to show how much better they are than everyone else. You saw the announcement—he’s probably been bragging to all his guests about how they’ll be the first to taste beef from his vertical farm. Changing it now would be a real loss of face.”  “Okay,” Lily says. “I have a bunch of ideas, but first of all, how much do you care about this guy’s face?”  Helena thinks back to her inbox full of corpse pictures, the countless sleepless nights she’s endured, the sheer terror she felt when she saw Lily step through the door. “Not very much at all.”  “All right.” Lily smacks her fist into her palm. “Let’s give him a nice surprise.”  The week before the deadline vanishes in a blur of printing, re-rendering, and darknet job requests. Helena’s been nothing but polite to Mr. Cai ever since the hitter’s visit, and has even taken to video calls lately, turning on the camera on her end so that Mr. Cai can witness her progress. It’s always good to build rapport with clients.  “So, sir,” Helena moves the camera, slowly panning so it captures the piles and piles of cherry-red steaks, zooming in on the beautiful fat strata which took ages to render. “How does this look? I’ll be starting the dry-aging once you approve, and loading it into the podcars first thing tomorrow morning.”  “Fairly adequate. I didn’t expect much from the likes of you, but this seems satisfactory. Go ahead.”  Helena tries her hardest to keep calm. “I’m glad you feel that way, sir. Rest assured you’ll be getting your delivery on schedule . . . by the way, I don’t suppose you could transfer the money on delivery? Printing the bone matter costs a lot more than I thought.”  “Of course, of course, once it’s delivered and I inspect the marbling. Quality checks, you know?”  Helena adjusts the camera, zooming in on the myoglobin dripping from the juicy steaks, and adopts her most sorrowful tone. “Well, I hate to rush you, but I haven’t had much money for food lately . . . ”  Mr. Cai chortles. “Why, that’s got to be hard on you! You’ll receive the fund transfer sometime this month, and in the meantime why don’t you treat yourself and print up something nice to eat?”  Lily gives Helena a thumbs-up, then resumes crouching under the table and messaging her darknet contacts, careful to stay out of Helena’s shot. The call disconnects.  “Let’s assume we won’t get any further payment. Is everything ready?”  “Yeah,” Lily says. “When do we need to drop it off?”  “Let’s try for five AM. Time to start batch-processing.”  Helena sets the enzyme percentages, loads the fluid into the canister, and they both haul the steaks into the dry-ager unit. The machine hums away, spraying fine mists of enzymatic fluid onto the steaks and partially dehydrating them, while Helena and Lily work on assembling the refrigerated delivery boxes. Once everything’s neatly packed, they haul the boxes to the nearest podcar station. As Helena slams box after box into the cargo area of the podcars, Lily types the delivery codes into their front panels. The podcars boot up, sealing themselves shut, and zoom off on their circuitous route to the Grand Domaine Luxury Hotel.  They head back to the industrial park. Most of their things have already been shoved into backpacks, and Helena begins breaking the remaining equipment down for transport.  A Sculpere 9410S takes twenty minutes to disassemble if you’re doing it for the second time. If someone’s there to help you manually eject the cell cartridges, slide the external casing off, and detach the print heads so you can disassemble the power unit, you might be able to get that figure down to ten. They’ll buy a new printer once they figure out where to settle down, but this one will do for now.  It’s not running away if we’re both going somewhere, Helena thinks to herself, and this time it doesn’t feel like a lie.  There aren’t many visitors to Mr. Chan’s restaurant during breakfast hours, and he’s sitting in a corner, reading a book. Helena waves at him.  “Helena!” he booms, surging up to greet her. “Long time no see, and who is this?”  “Oh, we met recently. She’s helped me out a lot,” Helena says, judiciously avoiding any mention of Lily’s name. She holds a finger to her lips, and surprisingly, Mr. Chan seems to catch on. Lily waves at Mr. Chan, then proceeds to wander around the restaurant, examining their collection of porcelain plates.  “Anyway, since you’re my very first client, I thought I’d let you know in person. I’m going traveling with my . . . friend, and I won’t be around for the next few months at least.”  “Oh, that’s certainly a shame! I was planning a black pepper hotplate beef special next month, but I suppose black pepper hotplate extruded protein will do just fine. When do you think you’ll be coming back?”  Helena looks at Mr. Chan’s guileless face, and thinks, well, her first client deserves a bit more honesty. “Actually, I probably won’t be running the business any longer. I haven’t decided yet, but I think I’m going to study art. I’m really, really sorry for the inconvenience, Mr. Chan.”  “No, no, pursuing your dreams, well, that’s not something you should be apologizing for! I’m just glad you finally found a friend!”  Helena glances over at Lily, who’s currently stuffing a container of cellulose toothpicks into the side pocket of her bulging backpack.  “Yeah, I’m glad too,” she says. “I’m sorry, Mr. Chan, but we have a flight to catch in a couple of hours, and the bus is leaving soon . . . ”  “Nonsense! I’ll pay for your taxi fare, and I’ll give you something for the road. Airplane food is awful these days!”  Despite repeatedly declining Mr. Chan’s very generous offers, somehow Helena and Lily end up toting bags and bags of fresh steamed buns to their taxi.  “Oh, did you see the news?” Mr. Chan asks. “That vertical farmer’s daughter is getting married at some fancy hotel tonight. Quite a pretty girl, good thing she didn’t inherit those eyebrows—”  Lily snorts and accidentally chokes on her steamed bun. Helena claps her on the back.  “—and they’re serving steak at the banquet, straight from his farm! Now, don’t get me wrong, Helena, you’re talented at what you do—but a good old-fashioned slab of real meat, now, that’s the ticket!”  “Yes,” Helena says. “It certainly is.”  All known forgeries are failures, but sometimes that’s on purpose. Sometimes a forger decides to get revenge by planting obvious flaws in their work, then waiting for them to be revealed, making a fool of everyone who initially claimed the work was authentic. These flaws can take many forms—deliberate anachronisms, misspelled signatures, rude messages hidden beneath thick coats of paint—or a picture of a happy cow, surrounded by little hearts, etched into the T-bone of two hundred perfectly-printed steaks.  While the known forgers are the famous ones, the best forgers are the ones that don’t get caught—the old woman selling her deceased husband’s collection to an avaricious art collector, the harried-looking mother handing the cashier a battered 50-yuan note, or the two women at the airport, laughing as they collect their luggage, disappearing into the crowd.", "text": "7900 words, novelette\nA Series of Steaks\n2017 Finalist: Nebula Award for Best Novelette\n2018 Finalist: Hugo Award for Best Novelette\n2018 Finalist: Theodore A. Sturgeon Memorial Award\nAll known forgeries are tales of failure. The people who get into the newsfeeds for their brilliant attempts to cheat the system with their fraudulent Renaissance masterpieces or their stacks of fake checks, well, they might be successful artists, but they certainly haven’t been successful at forgery.\nThe best forgeries are the ones that disappear from notice—a second-rate still-life moldering away in gallery storage, a battered old 50-yuan note at the bottom of a cashier drawer—or even a printed strip of Matsusaka beef, sliding between someone’s parted lips.\nForging beef is similar to printmaking—every step of the process has to be done with the final print in mind. A red that’s too dark looks putrid, a white that’s too pure looks artificial. All beef is supposed to come from a cow, so stipple the red with dots, flecks, lines of white to fake variance in muscle fiber regions. Cows are similar, but cows aren’t uniform—use fractals to randomize marbling after defining the basic look. Cut the sheets of beef manually to get an authentic ragged edge, don’t get lazy and depend on the bioprinter for that.\nDays of research and calibration and cursing the printer will all vanish into someone’s gullet in seconds, if the job’s done right.\nHelena Li Yuanhui of Splendid Beef Enterprises is an expert in doing the job right.\nThe trick is not to get too ambitious. Most forgers are caught out by the smallest errors—a tiny amount of period-inaccurate pigment, a crack in the oil paint that looks too artificial, or a misplaced watermark on a passport. Printing something large increases the chances of a fatal misstep. Stick with small-scale jobs, stick with a small group of regular clients, and in time, Splendid Beef Enterprises will turn enough of a profit for Helena to get a real name change, leave Nanjing, and forget this whole sorry venture ever happened.\nAs Helena’s loading the beef into refrigerated boxes for drone delivery, a notification pops up on her iKontakt frames. Helena sighs, turns the volume on her earpiece down, and takes the call.\n“Hi, Mr. Chan, could you switch to a secure line? You just need to tap the button with a lock icon, it’s very easy.”\n“Nonsense!” Mr. Chan booms. “If the government were going to catch us they’d have done so by now! Anyway, I just called to tell you how pleased I am with the latest batch. Such a shame, though, all that talent and your work just gets gobbled up in seconds—tell you what, girl, for the next beef special, how about I tell everyone that the beef came from one of those fancy vertical farms? I’m sure they’d have nice things to say then!”\n“Please don’t,” Helena says, careful not to let her Cantonese accent slip through. It tends to show after long periods without any human interaction, which is an apt summary of the past few months. “It’s best if no one pays attention to it.”\n“You know, Helena, you do good work, but I’m very concerned about your self-esteem, I know if I printed something like that I’d want everyone to appreciate it! Let me tell you about this article my daughter sent me, you know research says that people without friends are prone to . . . ” Mr. Chan rambles on as Helena sticks the labels on the boxes—Grilliam Shakespeare, Gyuuzen Sukiyaki, Fatty Chan’s Restaurant—and thankfully hangs up before Helena sinks into further depression. She takes her iKontakt off before heading to the drone delivery office, giving herself some time to recover from Mr. Chan’s relentless cheerfulness.\nHelena has five missed calls by the time she gets back. A red phone icon blares at the corner of her vision before blinking out, replaced by the incoming-call notification. It’s secured and anonymized, which is quite a change from usual. She pops the earpiece in.\n“Yeah, Mr. Chan?”\n“This isn’t Mr. Chan,” someone says. “I have a job for Splendid Beef Enterprises.”\n“All right, sir. Could I get your name and what you need? If you could provide me with the deadline, that would help too.”\n“I prefer to remain anonymous,” the man says.\n“Yes, I understand, secrecy is rather important.” Helena restrains the urge to roll her eyes at how needlessly cryptic this guy is. “Could I know about the deadline and brief?”\n“I need two hundred T-bone steaks by the 8th of August. 38.1 to 40.2 millimeter thickness for each one.” A notification to download t-bone_info.KZIP pops up on her lenses. The most ambitious venture Helena’s undertaken in the past few months has been Gyuuzen’s strips of marbled sukiyaki, and even that felt a bit like pushing it. A whole steak? Hell no.\n“I’m sorry, sir, but I don’t think my business can handle that. Perhaps you could try—”\n“I think you’ll be interested in this job, Helen Lee Jyun Wai.”\nShit.\nA Sculpere 9410S only takes thirty minutes to disassemble, if you know the right tricks. Manually eject the cell cartridges, slide the external casing off to expose the inner screws, and detach the print heads before disassembling the power unit. There are a few extra steps in this case—for instance, the stickers that say “Property of Hong Kong Scientific University” and “Bioprinting Lab A5” all need to be removed—but a bit of anti-adhesive spray will ensure that everything’s on schedule. Ideally she’d buy a new printer, but she needs to save her cash for the name change once she hits Nanjing.\nIt’s not expulsion if you leave before you get kicked out, she tells herself, but even she can tell that’s a lie.\nIt’s possible to get a sense of a client’s priorities just from the documents they send. For instance, Mr. Chan usually mentions some recipes that he’s considering, and Ms. Huang from Gyuuzen tends to attach examples of the marbling patterns she wants. This new client seems to have attached a whole document dedicated to the recent amendments in the criminal code, with the ones relevant to Helena (“five-year statute of limitations,” “possible death penalty”) conveniently highlighted in neon yellow.\nSadly, this level of detail hasn’t carried over to the spec sheet.\n“Hi again, sir,” Helena says. “I’ve read through what you’ve sent, but I really need more details before starting on the job. Could you provide me with the full measurements? I’ll need the expected length and breadth in addition to the thickness.”\n“It’s already there. Learn to read.”\n“I know you filled that part in, sir,” Helena says, gritting her teeth. “But we’re a printing company, not a farm. I’ll need more detail than ‘16-18 month cow, grain-fed, Hereford breed’ to do the job properly.”\n“You went to university, didn’t you? I’m sure you can figure out something as basic as that, even if you didn’t graduate.”\n“Ha ha. Of course.” Helena resists the urge to yank her earpiece out. “I’ll get right on that. Also, there is the issue of pay . . . ”\n“Ah, yes. I’m quite sure the Yuen family is still itching to prosecute. How about you do the job, and in return, I don’t tell them where you’re hiding?”\n“I’m sorry, sir, but even then I’ll need an initial deposit to cover the printing, and of course there’s the matter of the Hereford samples.” Which I already have in the bioreactor, but there is no way I’m letting you know that.\n“Fine. I’ll expect detailed daily updates,” Mr. Anonymous says. “I know how you get with deadlines. Don’t fuck it up.”\n“Of course not,” Helena says. “Also, about the deadline—would it be possible to push it back? Four weeks is quite short for this job.”\n“No,” Mr. Anonymous says curtly, and hangs up.\nHelena lets out a very long breath so she doesn’t end up screaming, and takes a moment to curse Mr. Anonymous and his whole family in Cantonese.\nIt’s physically impossible to complete the renders and finish the print in four weeks, unless she figures out a way to turn her printer into a time machine, and if that were possible she might as well go back and redo the past few years, or maybe her whole life. If she had majored in art, maybe she’d be a designer by now—or hell, while she’s busy dreaming, she could even have been the next Raverat, the next Mantuana—instead of a failed artist living in a shithole concrete box, clinging to the wreckage of all her past mistakes.\nShe leans against the wall for a while, exhales, then slaps on a proxy and starts drafting a help-wanted ad.\nLily Yonezawa (darknet username: yurisquared) arrives at Nanjing High Tech Industrial Park at 8.58 AM. She’s a short lady with long black hair and circle-framed iKontakts. She’s wearing a loose, floaty dress, smooth lines of white tinged with yellow-green, and there’s a large prismatic bracelet gleaming on her arm. In comparison, Helena is wearing her least holey black blouse and a pair of jeans, which is a step up from her usual attire of myoglobin-stained T-shirt and boxer shorts.\n“So,” Lily says in rapid, slightly-accented Mandarin as she bounds into the office. “This place is a beef place, right? I pulled some of the records once I got the address, hope you don’t mind—anyway, what do you want me to help print or render or design or whatever? I know I said I had a background in confections and baking, but I’m totally open to anything!” She pumps her fist in a show of determination. The loose-fitting prismatic bracelet slides up and down.\nHelena blinks at Lily with the weariness of someone who’s spent most of their night frantically trying to make their office presentable. She decides to skip most of the briefing, as Lily doesn’t seem like the sort who needs to be eased into anything.\n“How much do you know about beef?”\n“I used to watch a whole bunch of farming documentaries with my ex, does that count?”\n“No. Here at Splendid Beef Enterprises—”\n“Oh, by the way, do you have a logo? I searched your company registration but nothing really came up. Need me to design one?”\n“Here at Splendid Beef Enterprises, we make fake beef and sell it to restaurants.”\n“So, like, soy-lentil stuff?”\n“Homegrown cloned cell lines,” Helena says. “Mostly Matsusaka, with some Hereford if clients specify it.” She gestures at the bioreactor humming away in a corner.\n“Wait, isn’t fake food like those knockoff eggs made of calcium carbonate? If you’re using cow cells, this seems pretty real to me.” Clearly Lily has a more practical definition of fake than the China Food and Drug Administration.\n“It’s more like . . . let’s say you have a painting in a gallery and you say it’s by a famous artist. Lots of people would come look at it because of the name alone and write reviews talking about its exquisite use of chiaroscuro, as expected of the old masters, I can’t believe that it looks so real even though it was painted centuries ago. But if you say, hey, this great painting was by some no-name loser, I was just lying about where it came from . . . well, it’d still be the same painting, but people would want all their money back.”\n“Oh, I get it,” Lily says, scrutinizing the bioreactor. She taps its shiny polymer shell with her knuckles, and her bracelet bumps against it. Helena tries not to wince. “Anyway, how legal is this? This meat forgery thing?”\n“It’s not illegal yet,” Helena says. “It’s kind of a gray area, really.”\n“Great!” Lily smacks her fist into her open palm. “Now, how can I help? I’m totally down for anything! You can even ask me to clean the office if you want—wow, this is really dusty, maybe I should just clean it to make sure—”\nHelena reminds herself that having an assistant isn’t entirely bad news. Wolfgang Beltracchi was only able to carry out large-scale forgeries with his assistant’s help, and they even got along well enough to get married and have a kid without killing each other.\nThen again, the Beltracchis both got caught, so maybe she shouldn’t be too optimistic.\nCows that undergo extreme stress while waiting for slaughter are known as dark cutters. The stress causes them to deplete all their glycogen reserves, and when butchered, their meat turns a dark blackish-red. The meat of dark cutters is generally considered low-quality.\nAs a low-quality person waiting for slaughter, Helena understands how those cows feel. Mr. Anonymous, stymied by the industrial park’s regular sweeps for trackers and external cameras, has taken to sending Helena grainy aerial photographs of herself together with exhortations to work harder. This isn’t exactly news—she already knew he had her details, and drones are pretty cheap—but still. When Lily raps on the door in the morning, Helena sometimes jolts awake in a panic before she realizes that it isn’t Mr. Anonymous coming for her. This isn’t helped by the fact that Lily’s gentle knocks seem to be equivalent to other people’s knockout blows.\nBy now Helena’s introduced Lily to the basics, and she’s a surprisingly quick study. It doesn’t take her long to figure out how to randomize the fat marbling with Fractalgenr8, and she’s been handed the task of printing the beef strips for Gyuuzen and Fatty Chan, then packing them for drone delivery. It’s not ideal, but it lets Helena concentrate on the base model for the T-bone steak, which is the most complicated thing she’s ever tried to render.\nA T-bone steak is a combination of two cuts of meat, lean tenderloin and fatty strip steak, separated by a hard ridge of vertebral bone. Simply cutting into one is a near-religious experience, red meat parting under the knife to reveal smooth white bone, with the beef fat dripping down to pool on the plate. At least, that’s what the socialites’ food blogs say. To be accurate, they say something more like “omfg this is sooooooo good,” “this bones giving me a boner lol,” and “haha im so getting this sonic-cleaned for my collection!!!,” but Helena pretends they actually meant to communicate something more coherent.\nThe problem is a lack of references. Most of the accessible photographs only provide a top-down view, and Helena’s left to extrapolate from blurry videos and password-protected previews of bovine myology databases, which don’t get her much closer to figuring out how the meat adheres to the bone. Helena’s forced to dig through ancient research papers and diagrams that focus on where to cut to maximize meat yield, quantifying the difference between porterhouse and T-bone cuts, and not hey, if you’re reading this decades in the future, here’s how to make a good facsimile of a steak. Helena’s tempted to run outside and scream in frustration, but Lily would probably insist on running outside and screaming with her as a matter of company solidarity, and with their luck, probably Mr. Anonymous would find out about Lily right then, even after all the trouble she’s taken to censor any mention of her new assistant from the files and the reports and argh she needs sleep.\nMeanwhile, Lily’s already scheduled everything for print, judging by the way she’s spinning around in Helena’s spare swivel chair.\n“Hey, Lily,” Helena says, stifling a yawn. “Why don’t you play around with this for a bit? It’s the base model for a T-bone steak. Just familiarize yourself with the fiber extrusion and mapping, see if you can get it to look like the reference photos. Don’t worry, I’ve saved a copy elsewhere.” Good luck doing the impossible, Helena doesn’t say. You’re bound to have memorized the shortcut for ‘undo’ by the time I wake up.\nHelena wakes up to Lily humming a cheerful tune and a mostly-complete T-bone model rotating on her screen. She blinks a few times, but no—it’s still there. Lily’s effortlessly linking the rest of the meat, fat and gristle to the side of the bone, deforming the muscle fibers to account for the bone’s presence.\n“What did you do,” Helena blurts out.\nLily turns around to face her, fiddling with her bracelet. “Uh, did I do it wrong?”\n“Rotate it a bit, let me see the top view. How did you do it?”\n“It’s a little like the human vertebral column, isn’t it? There’s plenty of references for that.” She taps the screen twice, switching focus to an image of a human cross-section. “See how it attaches here and here? I just used that as a reference, and boom.”\nUgh, Helena thinks to herself. She’s been out of university for way too long if she’s forgetting basic homology.\n“Wait, is it correct? Did I mess up?”\n“No, no,” Helena says. “This is really good. Better than . . . well, better than I did, anyway.”\n“Awesome! Can I get a raise?”\n“You can get yourself a sesame pancake,” Helena says. “My treat.”\nThe brief requires two hundred similar-but-unique steaks at randomized thicknesses of 38.1 to 40.2 mm, and the number and density of meat fibers pretty much precludes Helena from rendering it on her own rig. She doesn’t want to pay to outsource computing power, so they’re using spare processing cycles from other personal rigs and staggering the loads. Straightforward bone surfaces get rendered in afternoons, and fiber-dense tissues get rendered at off-peak hours.\nIt’s three in the morning. Helena’s in her Pokko the Penguin T-shirt and boxer shorts, and Lily’s wearing Yayoi Kusama-ish pajamas that make her look like she’s been obliterated by a mass of polka dots. Both of them are staring at their screens, eating cups of Zhuzhu Brand Artificial Char Siew Noodles. As Lily’s job moves to the front of Render@Home’s Finland queue, the graph updates to show a downtick in Mauritius. Helena’s fingers frantically skim across the touchpad, queuing as many jobs as she can.\nHer chopsticks scrape the bottom of the mycefoam cup, and she tilts the container to shovel the remaining fake pork fragments into her mouth. Zhuzhu’s using extruded soy proteins, and they’ve punched up the glutamate percentage since she last bought them. The roasted char siew flavor is lacking, and the texture is crumby since the factory skimped on the extrusion time, but any hot food is practically heaven at this time of the night. Day. Whatever.\nThe thing about the rendering stage is that there’s a lot of panic-infused downtime. After queuing the requests, they can’t really do anything else—the requests might fail, or the rig might crash, or they might lose their place in the queue through some accident of fate and have to do everything all over again. There’s nothing to do besides pray that the requests get through, stay awake until the server limit resets, and repeat the whole process until everything’s done. Staying awake is easy for Helena, as Mr. Anonymous has recently taken to sending pictures of rotting corpses to her iKontakt address, captioned “Work hard or this could be you.” Lily seems to be halfway off to dreamland, possibly because she isn’t seeing misshapen lumps of flesh every time she closes her eyes.\n“So,” Lily says, yawning. “How did you get into this business?”\nHelena decides it’s too much trouble to figure out a plausible lie, and settles for a very edited version of the truth. “I took art as an elective in high school. My school had a lot of printmaking and 3D printing equipment, so I used it to make custom merch in my spare time—you know, for people who wanted figurines of obscure anime characters, or whatever. Even designed and printed the packaging for them, just to make it look more official. I wanted to study art in university, but that didn’t really work out. Long story short, I ended up moving here from Hong Kong, and since I had a background in printing and bootlegging . . . yeah. What about you?”\n“Before the confectionery I did a whole bunch of odd jobs. I used to sell merch for my girlfriend’s band, and that’s how I got started with the short-order printing stuff. They were called POMEGRENADE—it was really hard to fit the whole name on a T-shirt. The keychains sold really well, though.”\n“What sort of band were they?”\n“Sort of noise-rocky Cantopunk at first—there was this one really cute song I liked, If Marriage Means The Death Of Love Then We Must Both Be Zombies—but Cantonese music was a hard sell, even in Guangzhou, so they ended up being kind of a cover band.”\n“Oh, Guangzhou,” Helena says in an attempt to sound knowledgeable, before realizing that the only thing she knows about Guangzhou is that the Red Triad has a particularly profitable organ-printing business there. “Wait, you understand Cantonese?”\n“Yeah,” Lily says in Cantonese, tone-perfect. “No one really speaks it around here, so I haven’t used it much.”\n“Oh my god, yes, it’s so hard to find Canto-speaking people here.” Helena immediately switches to Cantonese. “Why didn’t you tell me sooner? I’ve been dying to speak it to someone.”\n“Sorry, it never came up so I figured it wasn’t very relevant,” Lily says. “Anyway, POMEGRENADE mostly did covers after that, you know, Kick Out The Jams, Zhongnanhai, Chaos Changan, Lightsabre Cocksucking Blues. Whatever got the crowd pumped up, and when they were moshing the hardest, they’d hit the crowd with the Cantopunk and just blast their faces off. I think it left more of an impression that way—like, start with the familiar, then this weird-ass surprise near the end—the merch table always got swamped after they did that.”\n“What happened with the girlfriend?”\n“We broke up, but we keep in touch. Do you still do art?”\n“Not really. The closest thing I get to art is this,” Helena says, rummaging through the various boxes under the table to dig out her sketchbooks. She flips one open and hands it to Lily—white against red, nothing but full-page studies of marbling patterns, and it must be one of the earlier ones because it’s downright amateurish. The lines are all over the place, that marbling on the Wagyu (is that even meant to be Wagyu?) is completely inaccurate, and, fuck, are those tear stains?\nLily turns the pages, tracing the swashes of color with her finger. The hum of the overworked rig fills the room.\n“It’s awful, I know.”\n“What are you talking about?” Lily’s gaze lingers on Helena’s attempt at a fractal snowflake. “This is really trippy! If you ever want to do some album art, just let me know and I’ll totally hook you up!”\nHelena opens her mouth to say something about how she’s not an artist, and how studies of beef marbling wouldn’t make very good album covers, but faced with Lily’s unbridled enthusiasm, she decides to nod instead.\nLily turns the page and it’s that thing she did way back at the beginning, when she was thinking of using a cute cow as the company logo. It’s derivative, it’s kitsch, the whole thing looks like a degraded copy of someone else’s ripoff drawing of a cow’s head, and the fact that Lily’s seriously scrutinizing it makes Helena want to snatch the sketchbook back, toss it into the composter, and sink straight into the concrete floor.\nThe next page doesn’t grant Helena a reprieve since there’s a whole series of that stupid cow. Versions upon versions of happy cow faces grin straight at Lily, most of them surrounded by little hearts—what was she thinking? What do hearts even have to do with Splendid Beef Enterprises, anyway? Was it just that they were easy to draw?\n“Man, I wish we had a logo because this would be super cute! I love the little hearts! It’s like saying we put our heart and soul into whatever we do! Oh, wait, but was that what you meant?”\n“It could be,” Helena says, and thankfully the Colorado server opens before Lily can ask any further questions.\nThe brief requires status reports at the end of each workday, but this gradually falls by the wayside once they hit the point where workdays don’t technically end, especially since Helena really doesn’t want to look at an inbox full of increasingly creepy threats. They’re at the pre-print stage, and Lily’s given up on going back to her own place at night so they can have more time for calibration. What looks right on the screen might not look right once it’s printed, and their lives for the past few days have devolved into staring at endless trays of 32-millimeter beef cubes and checking them for myoglobin concentration, color match in different lighting conditions, fat striation depth, and a whole host of other factors.\nThere are so many ways for a forgery to go wrong, and only one way it can go right. Helena contemplates this philosophical quandary, and gently thunks her head against the back of her chair.\n“Oh my god,” Lily exclaims, shoving her chair back. “I can’t take this anymore! I’m going out to eat something and then I’m getting some sleep. Do you want anything?” She straps on her bunny-patterned filter mask and her metallic sandals. “I’m gonna eat there, so I might take a while to get back.”\n“Sesame pancakes, thanks.”\nAs Lily slams the door, Helena puts her iKontakt frames back on. The left lens flashes a stream of notifications—fifty-seven missed calls over the past five hours, all from an unknown number. Just then, another call comes in, and she reflexively taps the side of the frame.\n“You haven’t been updating me on your progress,” Mr. Anonymous says.\n“I’m very sorry, sir,” Helena says flatly, having reached the point of tiredness where she’s ceased to feel anything beyond god I want to sleep. This sets Mr. Anonymous on another rant covering the usual topics—poor work ethic, lack of commitment, informing the Yuen family, prosecution, possible death sentence—and Helena struggles to keep her mouth shut before she says something that she might regret.\n“Maybe I should send someone to check on you right now,” Mr. Anonymous snarls, before abruptly hanging up.\nHelena blearily types out a draft of the report, and makes a note to send a coherent version later in the day, once she gets some sleep and fixes the calibration so she’s not telling him entirely bad news. Just as she’s about to call Lily and ask her to get some hot soy milk to go with the sesame pancakes, the front door rattles in its frame like someone’s trying to punch it down. Judging by the violence, it’s probably Lily. Helena trudges over to open it.\nIt isn’t. It’s a bulky guy with a flat-top haircut. She stares at him for a moment, then tries to slam the door in his face. He forces the door open and shoves his way inside, grabbing Helena’s arm, and all Helena can think is I can’t believe Mr. Anonymous spent his money on this.\nHe shoves her against the wall, gripping her wrist so hard that it’s practically getting dented by his fingertips, and pulls out a switchblade, pressing it against the knuckle of her index finger. “Well, I’m not allowed to kill you, but I can fuck you up real bad. Don’t really need all your fingers, do you, girl?”\nShe clears her throat, and struggles to keep her voice from shaking. “I need them to type—didn’t your boss tell you that?”\n“Shut up,” Flat-Top says, flicking the switchblade once, then twice, thinking. “Don’t need your face to type, do you?”\nJust then, Lily steps through the door. Flat-Top can’t see her from his angle, and Helena jerks her head, desperately communicating that she should stay out. Lily promptly moves closer.\nHelena contemplates murder.\nLily edges towards both of them, slides her bracelet past her wrist and onto her knuckles, and makes a gesture at Helena which either means ‘move to your left’ or ‘I’m imitating a bird, but only with one hand’.\n“Hey,” Lily says loudly. “What’s going on here?”\nFlat-Top startles, loosening his grip on Helena’s arm, and Helena dodges to the left. Just as Lily’s fist meets his face in a truly vicious uppercut, Helena seizes the opportunity to kick him soundly in the shins.\nHis head hits the floor, and it’s clear he won’t be moving for a while, or ever. Considering Lily’s normal level of violence towards the front door, this isn’t surprising.\nLily crouches down to check Flat-Top’s breathing. “Well, he’s still alive. Do you prefer him that way?”\n“Do not kill him.”\n“Sure.” Lily taps the side of Flat-Top’s iKontakt frames with her bracelet, and information scrolls across her lenses. “Okay, his name’s Nicholas Liu Honghui . . . blah blah blah . . . hired to scare someone at this address, anonymous client . . . I think he’s coming to, how do you feel about joint locks?”\nIt takes a while for Nicholas to stir fully awake. Lily’s on his chest, pinning him to the ground, and Helena’s holding his switchblade to his throat.\n“Okay, Nicholas Liu,” Lily says. “We could kill you right now, but that’d make your wife and your . . . what is that red thing she’s holding . . . a baby? Yeah, that’d make your wife and ugly baby quite sad. Now, you’re just going to tell your boss that everything went as expected—”\n“Tell him that I cried,” Helena interrupts. “I was here alone, and I cried because I was so scared.”\n“Right, got that, Nick? That lady there wept buckets of tears. I don’t exist. Everything went well, and you think there’s no point in sending anyone else over. If you mess up, we’ll visit 42—god, what is this character—42 Something Road and let you know how displeased we are. Now, if you apologize for ruining our morning, I probably won’t break your arm.”\nAfter seeing a wheezing Nicholas to the exit, Lily closes the door, slides her bracelet back onto her wrist, and shakes her head like a deeply disappointed critic. “What an amateur. Didn’t even use burner frames—how the hell did he get hired? And that haircut, wow . . . ”\nHelena opts to remain silent. She leans against the wall and stares at the ceiling, hoping that she can wake up from what seems to be a very long nightmare.\n“Also, I’m not gonna push it, but I did take out the trash. Can you explain why that crappy hitter decided to pay us a visit?”\n“Yeah. Yeah, okay.” Helena’s stomach growls. “This may take a while. Did you get the food?”\n“I got your pancakes, and that soy milk place was open, so I got you some. Nearly threw it at that guy, but I figured we’ve got a lot of electronics, so . . . ”\n“Thanks,” Helena says, taking a sip. It’s still hot.\nHong Kong Scientific University’s bioprinting program is a prestigious pioneer program funded by mainland China, and Hong Kong is the test bed before the widespread rollout. The laboratories are full of state-of-the-art medical-grade printers and bioreactors, and the instructors are all researchers cherry-picked from the best universities.\nAs the star student of the pioneer batch, Lee Jyun Wai Helen (student number A3007082A) is selected for a special project. She will help the head instructor work on the basic model of a heart for a dextrocardial patient, the instructor will handle the detailed render and the final print, and a skilled surgeon will do the transplant. As the term progresses and the instructor gets busier and busier, Helen’s role gradually escalates to doing everything except the final print and the transplant. It’s a particularly tricky render, since dextrocardial hearts face right instead of left, but her practice prints are cell-level perfect.\nHelen hands the render files and her notes on the printing process to the instructor, then her practical exams begin and she forgets all about it.\nThe Yuen family discovers Madam Yuen’s defective heart during their mid-autumn family reunion, halfway through an evening harbor cruise. Madam Yuen doesn’t make it back to shore, and instead of a minor footnote in a scientific paper, Helen rapidly becomes front-and-center in an internal investigation into the patient’s death.\nUnofficially, the internal investigation discovers that the head instructor’s improper calibration of the printer during the final print led to a slight misalignment in the left ventricle, which eventually caused severe ventricular dysfunction and acute graft failure.\nOfficially, the root cause of the misprint is Lee Jyun Wai Helen’s negligence and failure to perform under deadline pressure. Madam Yuen’s family threatens to prosecute, but the criminal code doesn’t cover failed organ printing. Helen is expelled, and the Hong Kong Scientific University quietly negotiates a settlement with the Yuens.\nAfter deciding to steal the bioprinter and flee, Helen realizes that she doesn’t have enough money for a full name change and an overseas flight. She settles for a minor name alteration and a flight to Nanjing.\n“Wow,” says Lily. “You know, I’m pretty sure you got ripped off with the name alteration thing, there’s no way it costs that much. Also, you used to have pigtails? Seriously?”\nHelena snatches her old student ID away from Lily. “Anyway, under the amendments to Article 335, making or supplying substandard printed organs is now an offence punishable by death. The family’s itching to prosecute. If we don’t do the job right, Mr. Anonymous is going to disclose my whereabouts to them.”\n“Okay, but from what you’ve told me, this guy is totally not going to let it go even after you’re done. At my old job, we got blackmailed like that all the time, which was really kind of irritating. They’d always try to bargain, and after the first job, they’d say stuff like ‘if you don’t do me this favor I’m going to call the cops and tell them everything’ just to weasel out of paying for the next one.”\n“Wait. Was this at the bakery or the merch stand?”\n“Uh.” Lily looks a bit sheepish. This is quite unusual, considering that Lily has spent the past four days regaling Helena with tales of the most impressive blood blobs from her period, complete with comparisons to their failed prints. “Are you familiar with the Red Triad? The one in Guangzhou?”\n“You mean the organ printers?”\n“Yeah, them. I kind of might have been working there before the bakery . . . ?”\n“What?”\nLily fiddles with the lacy hem of her skirt. “Well, I mean, the bakery experience seemed more relevant, plus you don’t have to list every job you’ve ever done when you apply for a new one, right?”\n“Okay,” Helena says, trying not to think too hard about how all the staff at Splendid Beef Enterprises are now prime candidates for the death penalty. “Okay. What exactly did you do there?”\n“Ears and stuff, bladders, spare fingers . . . you’d be surprised how many people need those. I also did some bone work, but that was mainly for the diehards—most of the people we worked on were pretty okay with titanium substitutes. You know, simple stuff.”\n“That’s not simple.”\n“Well, it’s not like I was printing fancy reversed hearts or anything, and even with the asshole clients it was way easier than baking. Have you ever tried to extrude a spun-sugar globe so you could put a bunch of powder-printed magpies inside? And don’t get me started on cleaning the nozzles after extrusion, because wow . . . ”\nHelena decides not to question Lily’s approach to life, because it seems like a certain path to a migraine. “Maybe we should talk about this later.”\n“Right, you need to send the update! Can I help?”\nThe eventual message contains very little detail and a lot of pleading. Lily insists on adding typos just to make Helena seem more rattled, and Helena’s way too tired to argue. After starting the autoclean cycle for the printheads, they set an alarm and flop on Helena’s mattress for a nap.\nAs Helena’s drifting off, something occurs to her. “Lily? What happened to those people? The ones who tried to blackmail you?”\n“Oh,” Lily says casually. “I crushed them.”\nThe brief specifies that the completed prints need to be loaded into four separate podcars on the morning of 8 August, and provides the delivery code for each. They haven’t been able to find anything in Helena’s iKontakt archives, so their best bet is finding a darknet user who can do a trace.\nLily’s fingers hover over the touchpad. “If we give him the codes, this guy can check the prebooked delivery routes. He seems pretty reliable, do you want to pay the bounty?”\n“Do it,” Helena says.\nThe resultant map file is a mess of meandering lines. They flow across most of Nanjing, criss-crossing each other, but eventually they all terminate at the cargo entrance of the Grand Domaine Luxury Hotel on Jiangdong Middle Road.\n“Well, he’s probably not a guest who’s going to eat two hundred steaks on his own.” Lily taps her screen. “Maybe it’s for a hotel restaurant?”\nHelena pulls up the Grand Domaine’s web directory, setting her iKontakt to highlight any mentions of restaurants or food in the descriptions. For some irritating design reason, all the booking details are stored in garish images. She snatches the entire August folder, flipping through them one by one before pausing.\nThe foreground of the image isn’t anything special, just elaborate cursive English stating that Charlie Zhang and Cherry Cai Si Ping will be celebrating their wedding with a ten-course dinner on August 8th at the Royal Ballroom of the Grand Domaine Luxury Hotel.\nWhat catches her eye is the background. It’s red with swirls and streaks of yellow-gold. Typical auspicious wedding colors, but displayed in a very familiar pattern.\nIt’s the marbled pattern of T-bone steak.\nCherry Cai Si Ping is the daughter of Dominic Cai Yongjing, a specialist in livestock and a new player in Nanjing’s agri-food arena. According to Lily’s extensive knowledge of farming documentaries, Dominic Cai Yongjing is also “the guy with the eyebrows” and “that really boring guy who keeps talking about nothing.”\n“Most people have eyebrows,” Helena says, loading one of Lily’s recommended documentaries. “I don’t see . . . oh. Wow.”\n“I told you. I mean, I usually like watching stuff about farming, but last year he just started showing up everywhere with his stupid waggly brows! When I watched this with my ex we just made fun of him non-stop.”\nHelena fast-forwards through the introduction of Modern Manufacturing: The Vertical Farmer, which involves the camera panning upwards through hundreds of vertically-stacked wire cages. Dominic Cai talks to the host in English, boasting about how he plans to be a key figure in China’s domestic beef industry. He explains his “patented methods” for a couple of minutes, which involves stating and restating that his farm is extremely clean and filled with only the best cattle.\n“But what about bovine parasitic cancer?” the host asks. “Isn’t the risk greater in such a cramped space? If the government orders a quarantine, your whole farm . . . ”\n“As I’ve said, our hygiene standards are impeccable, and our stock is purebred Hereford!” Cai slaps the flank of a cow through the cage bars, and it moos irritatedly in response. “There is absolutely no way it could happen here!”\nHelena does some mental calculations. Aired last year, when the farm recently opened, and that cow looks around six months old . . . and now a request for steaks from cows that are sixteen to eighteen months old . . .\n“So,” Lily says, leaning on the back of Helena’s chair. “Bovine parasitic cancer?”\n“Judging by the timing, it probably hit them last month. It’s usually the older cows that get infected first. He’d have killed them to stop the spread . . . but if it’s the internal strain, the tumors would have made their meat unusable after excision. His first batch of cows was probably meant to be for the wedding dinner. What we’re printing is the cover-up.”\n“But it’s not like steak’s a standard course in wedding dinners or anything, right? Can’t they just change it to roast duck or abalone or something?” Lily looks fairly puzzled, probably because she hasn’t been subjected to as many weddings as Helena has.\n“Mr. Cai’s the one bankrolling it, so it’s a staging ground for the Cai family to show how much better they are than everyone else. You saw the announcement—he’s probably been bragging to all his guests about how they’ll be the first to taste beef from his vertical farm. Changing it now would be a real loss of face.”\n“Okay,” Lily says. “I have a bunch of ideas, but first of all, how much do you care about this guy’s face?”\nHelena thinks back to her inbox full of corpse pictures, the countless sleepless nights she’s endured, the sheer terror she felt when she saw Lily step through the door. “Not very much at all.”\n“All right.” Lily smacks her fist into her palm. “Let’s give him a nice surprise.”\nThe week before the deadline vanishes in a blur of printing, re-rendering, and darknet job requests. Helena’s been nothing but polite to Mr. Cai ever since the hitter’s visit, and has even taken to video calls lately, turning on the camera on her end so that Mr. Cai can witness her progress. It’s always good to build rapport with clients.\n“So, sir,” Helena moves the camera, slowly panning so it captures the piles and piles of cherry-red steaks, zooming in on the beautiful fat strata which took ages to render. “How does this look? I’ll be starting the dry-aging once you approve, and loading it into the podcars first thing tomorrow morning.”\n“Fairly adequate. I didn’t expect much from the likes of you, but this seems satisfactory. Go ahead.”\nHelena tries her hardest to keep calm. “I’m glad you feel that way, sir. Rest assured you’ll be getting your delivery on schedule . . . by the way, I don’t suppose you could transfer the money on delivery? Printing the bone matter costs a lot more than I thought.”\n“Of course, of course, once it’s delivered and I inspect the marbling. Quality checks, you know?”\nHelena adjusts the camera, zooming in on the myoglobin dripping from the juicy steaks, and adopts her most sorrowful tone. “Well, I hate to rush you, but I haven’t had much money for food lately . . . ”\nMr. Cai chortles. “Why, that’s got to be hard on you! You’ll receive the fund transfer sometime this month, and in the meantime why don’t you treat yourself and print up something nice to eat?”\nLily gives Helena a thumbs-up, then resumes crouching under the table and messaging her darknet contacts, careful to stay out of Helena’s shot. The call disconnects.\n“Let’s assume we won’t get any further payment. Is everything ready?”\n“Yeah,” Lily says. “When do we need to drop it off?”\n“Let’s try for five AM. Time to start batch-processing.”\nHelena sets the enzyme percentages, loads the fluid into the canister, and they both haul the steaks into the dry-ager unit. The machine hums away, spraying fine mists of enzymatic fluid onto the steaks and partially dehydrating them, while Helena and Lily work on assembling the refrigerated delivery boxes. Once everything’s neatly packed, they haul the boxes to the nearest podcar station. As Helena slams box after box into the cargo area of the podcars, Lily types the delivery codes into their front panels. The podcars boot up, sealing themselves shut, and zoom off on their circuitous route to the Grand Domaine Luxury Hotel.\nThey head back to the industrial park. Most of their things have already been shoved into backpacks, and Helena begins breaking the remaining equipment down for transport.\nA Sculpere 9410S takes twenty minutes to disassemble if you’re doing it for the second time. If someone’s there to help you manually eject the cell cartridges, slide the external casing off, and detach the print heads so you can disassemble the power unit, you might be able to get that figure down to ten. They’ll buy a new printer once they figure out where to settle down, but this one will do for now.\nIt’s not running away if we’re both going somewhere, Helena thinks to herself, and this time it doesn’t feel like a lie.\nThere aren’t many visitors to Mr. Chan’s restaurant during breakfast hours, and he’s sitting in a corner, reading a book. Helena waves at him.\n“Helena!” he booms, surging up to greet her. “Long time no see, and who is this?”\n“Oh, we met recently. She’s helped me out a lot,” Helena says, judiciously avoiding any mention of Lily’s name. She holds a finger to her lips, and surprisingly, Mr. Chan seems to catch on. Lily waves at Mr. Chan, then proceeds to wander around the restaurant, examining their collection of porcelain plates.\n“Anyway, since you’re my very first client, I thought I’d let you know in person. I’m going traveling with my . . . friend, and I won’t be around for the next few months at least.”\n“Oh, that’s certainly a shame! I was planning a black pepper hotplate beef special next month, but I suppose black pepper hotplate extruded protein will do just fine. When do you think you’ll be coming back?”\nHelena looks at Mr. Chan’s guileless face, and thinks, well, her first client deserves a bit more honesty. “Actually, I probably won’t be running the business any longer. I haven’t decided yet, but I think I’m going to study art. I’m really, really sorry for the inconvenience, Mr. Chan.”\n“No, no, pursuing your dreams, well, that’s not something you should be apologizing for! I’m just glad you finally found a friend!”\nHelena glances over at Lily, who’s currently stuffing a container of cellulose toothpicks into the side pocket of her bulging backpack.\n“Yeah, I’m glad too,” she says. “I’m sorry, Mr. Chan, but we have a flight to catch in a couple of hours, and the bus is leaving soon . . . ”\n“Nonsense! I’ll pay for your taxi fare, and I’ll give you something for the road. Airplane food is awful these days!”\nDespite repeatedly declining Mr. Chan’s very generous offers, somehow Helena and Lily end up toting bags and bags of fresh steamed buns to their taxi.\n“Oh, did you see the news?” Mr. Chan asks. “That vertical farmer’s daughter is getting married at some fancy hotel tonight. Quite a pretty girl, good thing she didn’t inherit those eyebrows—”\nLily snorts and accidentally chokes on her steamed bun. Helena claps her on the back.\n“—and they’re serving steak at the banquet, straight from his farm! Now, don’t get me wrong, Helena, you’re talented at what you do—but a good old-fashioned slab of real meat, now, that’s the ticket!”\n“Yes,” Helena says. “It certainly is.”\nAll known forgeries are failures, but sometimes that’s on purpose. Sometimes a forger decides to get revenge by planting obvious flaws in their work, then waiting for them to be revealed, making a fool of everyone who initially claimed the work was authentic. These flaws can take many forms—deliberate anachronisms, misspelled signatures, rude messages hidden beneath thick coats of paint—or a picture of a happy cow, surrounded by little hearts, etched into the T-bone of two hundred perfectly-printed steaks.\nWhile the known forgers are the famous ones, the best forgers are the ones that don’t get caught—the old woman selling her deceased husband’s collection to an avaricious art collector, the harried-looking mother handing the cashier a battered 50-yuan note, or the two women at the airport, laughing as they collect their luggage, disappearing into the crowd.", "source": "https://clarkesworldmagazine.com/prasad_01_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Series of Steaks by Vina Jie-Min Prasad"}