{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sandra McDonald", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "x0oyXFbwOA2n6YFRGaBhexSbwUI=", "id": null, "license": null, "comments": "", "raw_text": "5950 words, short story, REPRINT  Fleet  When I officially became a girl, I took the new name of Isa. At the time I was nine years old. In the Umatac village records I’m still a male named Magahet Joseph Howard USN. It’s good luck to be given the name of an ancestor from Before Silence. My brother calls me Shithead, because he’s my brother. But most people call me Bridge, because the governors gave me that. Someone in every village is appointed to stand with one dusty foot in the past and the other planted in the Great Future, ready to take action when ships appear on the blue horizon.  Sounds important. Don’t be fooled. We’re not some backwards cargo cult, building mock radio towers in the magical hope of luring back civilization. Civilization will come again regardless. We’re sure of it.  It’s hot today, late afternoon. I’m sitting on the beach and thinking hard about taking a nap. A dozen yards offshore, blue waves roll around Fouha Rock, where the gods created mankind. No kidding: it’s a giant limestone phallus jutting out of the sea.  “What are you staring at, Shithead?” my brother Rai shouts when the canoes return.  “Your tiny shriveled-up balls,” I yell back.  The men laugh. Among them is my husband Pulan Robert, who comes to me at night with reverence and good humor. He has a second wife, Kami Brittany, who bears him our children and hopes that one day I’ll be gored to death by a boonie pig. She can’t say that too loudly, though, for fear I’ll call down upon her a vengeful taotaomo’na. Those are the spirits that slink through the nunu trees under moonlight, and moan during storms as if in great pain, and brush their invisible cold hands over your nape when you least expect it.  She’s right to worry. I know the names of seven thousand taotaomo’na. Seven thousand ancestors who perished here in the After Silence. There’s a man in Yigo who knows twelve thousand. The oldest woman on the island lives in Dededo, and she knows fifteen thousand. The governors gave them to her, just like they gave them to me, through white caps clamped to our skulls.  I try not to think about the white caps too much.  The men beach the canoes and haul out their catches. Pulan Robert smiles at me and waves over to where Kami waits with our youngest daughter bouncing on her hip. A moment later his smile dims. Our visitors have arrived. Four men, tall and lean, with walking sticks wrapped in copper wire and the green ribbons of Agat village.  Rai stops beside me and frowns. “They’re late.”  “They’re on time.”  “Late,” he insists. “They’ll slow us down tomorrow.”  “Two days to get there,” I tell him. “Then you’ll see Angelina again.”  At sunset our entire village dines on roasted fruit bats, fresh rabbit fish, breadfruit, cakes, and tuba. The musicians play nose flutes and drums for the children dancing around the bonfire. Three of the men from Agat know of me, but the fourth keeps sliding glances my way. Beneath my blouse, my bra is stuffed with soft grass. I wear a wig of long hair, dark and straight.  “Babae?” he asks his companions in Tagalog. Many Filipinos clustered in Agat in the After Silence.  “Oo,” his friends say.  He wants to know if I’m a girl. Yes, they say. But he looks at me doubtfully. Wondering what’s under my skirt, maybe wondering if he can put his hands under there to squeeze and rub.  Pulan Robert puts his arm around my shoulder. He smells like salt and fish and Kami.  “You should stay here,” he says that night, in our bed, as we stare up at the tin and thatch ceiling. Kami’s hut is bigger, but mine is closer to the cooling ocean breeze. Mosquitoes nibble on our arms.  “I have to go. Someone has to remember the dead,” I remind him.  “I’ll come along and keep you company.”  “Rai is coming.”  “Rai is too impatient. He won’t pay attention.”  I kiss his nose. “Rai will always pay attention to me.”  Rai’s impatient because it’s been six months since he’s held his wife in his arms. In the morning, he’s awake before anyone else. At breakfast, somber Irao speaks quietly to his crying children. The fourth from our village is Husto, who has spent the last week pleading to our little governor that he should be excused from this duty. She stands firm. The lottery is fair and the gods have picked him to take his turn digging. I wonder if we’re going to have to physically lift Husto in the air and carry him away, but finally he pries himself away from his weeping mother.  “Travel safely,” Pulan Robert says, with a final warm kiss.  “I will,” I promise.  The men from Agat lead the way down the road. We follow, and only Husto looks back.  Despite the solemn occasion, I like these trips. Before Silence, you could drive all over Guahan on asphalt roads, from the turquoise waters of Cocos Lagoon all the way north to the limestone cliffs at Ritidian Point. The shrine for the Japanese soldiers who killed themselves, the international airport for big jets, the army tanks abandoned after the war—you could visit them all in just one day. Now the roads are all rubble, and bandits control the bridges, and some of the white villages up north won’t let you pass over their lands without payment. Rai and I tried rowing around the island once when we were young. We nearly shredded ourselves on the reefs. Ours is the age of footpaths and walking sticks, and many people die without ever having stepped outside the villages they were born in.  The coastal route to Layon is pretty enough, but I’d like to see more of the old military bases. My namesake Joseph Howard USN worked on one of those. The concrete shells of the buildings are all gutted and stripped out, the roofs blown away by typhoons or leveled by earthquakes. Those ruins are less sad, somehow, than the iron skeletons of hotel high-rises in Hagatna, the resorts where the tourists honeymooned and gambled away their fortunes until the Night of Fire.  Imagine it: two hundred thousand people drinking or dreaming or fucking or hunched over military equipment in the middle of the night, in the middle of the endless ocean, and in the gap from one minute to the next, all the technology died. No telephones, radios, satellites, computers. All the power stations erupted into fire. All the transformers and electrical wires sizzled and fried themselves into charred metal. In the skies above, enormous waves of green light shimmered against the moon and stars. The governors gave me just enough science to know what the Northern Lights are, and why they should never be seen this close to the equator.  I rub my head, remember the tight white caps, and keep walking.  Our first step is Fort Nuestra, high on the bluff, to make our offers to the Lady. She’s not the oldest of our gods, but she’s the one Magellan and the Spanish gave to us while they burned our huts and killed our chiefs. When I was very small, I would pray to the Lady to take away my cock. She never did. I don’t hold it against her, though, not much anyways, because Pulan Robert likes it well enough in the dark.  After praying and leaving gifts we continue on to Merizo. Only a few families are left to greet us. Merizo went to war with Inarajan last year and came out on the poorer end. The fight was supposedly over the ownership of a prized carabao, but was probably about skin color or religion. For now Merizo only has one worker to send to the landfill, a teenage boy with a topknot dangling from his otherwise bare skull.  “I’m going to dig up a radio and battery,” he tells me as we drink tuba by the ruins of a church. “I’m going to call Jesus Christ.”  Merizo’s always been known for this kind of talk. I don’t mind it. Husto, though, announces that Jesus Christ died on the Night of Fire, and this makes the boy’s parents angry. While they argue, I walk away to piss. A woman with limestone white hair follows me. Her left leg drags in the dirt.  “You’re the ‘idge,” she says, the words slurred.  Her name is Nena and she should be dead now, or so the story goes. While working at the landfill she was accidentally buried by the shifting, stinking debris. By the time they pulled her out, she’d been breathing bad air for too long. A quick death might have been more merciful, but Nena’s father carried his only child back to Merizo and cared for her until he died in the war.  “I’m Isa,” I tell her, pulling down my skirt.  “I ‘ound the ‘eet,” she says.  I shake my head, not understanding.  She waves her good hand toward the ocean. “The ‘eet.”  Fleet. She found the Fleet. She wouldn’t be the first. Usually, though, there’s a lot of tuba involved, or smoked weeds, or the fanciful imagination of children.  “I don’t see any ships, Nena.”  “‘ailor,” she says, and gestures toward the jungle.  “Show me.”  Chickens scatter before our feet on a narrow path. From the vines and bushes peek out old cement houses on cracked foundations. One hut without doors or a roof is so overgrown you’d miss it if you weren’t looking closely. Inside sits a white man, his face ghastly with pain and his eyes half-lidded. He smells like shit and urine. In his right hand is a sharp curved knife.  “The ‘eet,” Nena repeats.  The rips in his clothing and long scrapes on his arms say he washed in over the reef, but any fool fisherman from the north can fall over the side of a boat. I kneel in the doorway.  “Good day, sir,” I say. “Can you tell me your name? Your village?”  He struggles to focus. Twitches the knife, as if trying to raise his arm. He starts to ramble—short, disconnected words, none of them in English or Chamorro or Tagalog.  But I know these words. The governors gave me nations and languages before they gave me names to carry. This man is speaking Russian.  My throat goes tight.  To Nena, I say, “He comes from Yona. They speak strange up there. Nothing more than that.”  Her expression falls. “Not ‘eet?”  “Not Fleet, no,” I say confidently. “When the Fleet returns, an armada of ships will sail into the bay bearing food and wine. They’ll set off fireworks and play the United States anthem. This is just a lost fisherman who needs our help. Return to the beach and find my brother Rai. He’s the tallest, the most handsome. Bring him here. But don’t let anyone else see you. They’ll claim the reward his village has for him.”  A new light gleams in her eyes at the mention of reward, and she hurries off.  If Nena had bothered to examine the Russian’s clothes, she would have seen that even stiff with sea salt, the fabric is newer and finer than anything we can weave or dig up here. He’s wearing lightweight boots with fresh rubber soles. For a white man he’s pale—a sailor who doesn’t see much sun. Maybe he came from a submarine. The governors showed us pictures of those.  “Who are you?” I ask in Russian.  His rambling stops. A hairy brown spider crawls down his leg. He doesn’t brush it off.  “Did you come alone? Can I call someone for help?”  “Sergei,” he murmurs.  Maybe that’s his name, maybe someone else’s. Before I can ask his head slumps over and the knife tumbles from his lax fingers. I see dark blood on the back of his skull. There’s a swelling there, a stone-like bump. No other major injuries on him, no jewelry or electronics, only the knife and its leather sheath strapped under his left trouser leg.  He may not have much time left, or he could recover enough to cause serious damage.  As always, I am sworn to uphold Rule Number One.  I squeeze his nose shut and clap my hand over his mouth.  Life is a stubborn habit to break. It’s a sacred thing, to watch the spirit struggle to take flight. You can see it in the flopping fish pulled from the sea, or in the panicking pig as the knife pierces its throat. The Russian makes muffled sounds and jerks his head, but has no strength to fight me off. I pray to the gods and governors for him. No one here will mourn his death with a nine day feast. But most living things deserve kindness in their last moments, to hear words ushering them to the arms of their ancestors.  When she returns with Rai, Nena’s eyes turn accusatory.  “He passed quietly, without pain,” I say. “His people from Yona will want to come and retrieve his bones. Rai, bury him in a shallow grave. But don’t tell anyone, or let them help, or they’ll want the reward, too.”  Rai balks. “What reward?”  I squeeze his arm. “The people of Yona will be grateful to know what happened to him.”  He opens his mouth, maybe to say the people of Yona are nothing but swindlers and drunkards. My fingers dig deeper into his skin. He’s not an idiot, my brother, so he goes silent. Nena, bent over the naked corpse, sniffs in grief.  “‘is clothes,” she says.  “I took them for his people,” I tell her. “His last words were to thank you, Nena. His spirit rests in peace because of your kindness. He asked that you seclude yourself and say rosaries for him. If you don’t, his taotaomo’na will be very angry. Will you do it?”  She nods emphatically. “Yes.”  Back at the church, the others want to know where Rai is. “Too much feasting last night,” I lie, and they sympathize. Everyone here has suffered from the squats before.  Husto gestures to the folded fern leaves in my arms. “What’s that?”  “A gift for the taotaomo’na,” I warn him. “Don’t touch.”  We bid farewell to Merizo and detour into the valley to visit both Tinta and Faha Caves. I worry that Nena won’t do as told. Or that Rai will discover something incriminating that I left behind. But the caves require my full concentration. Back in World War II, the Japanese soldiers spent years raping the women, killing old and young alike, forcing people from their homes to concentration camps. Here, as the end of the war drew near, they herded villagers into caves and tossed grenades in after them. Other victims were tied up and beheaded and left in the dirt.  I don’t have their names—no Bridge does—but we know that the Japanese brutality made the people of Merizo rise up in rebellion. We honor them, too, in this sacred place heavy with memory.  “You tell the story well,” Irao comments, afterward.  “I wish I didn’t have to tell it at all,” I reply.  After the ceremonies we trek back to the coast, where dark gray clouds are rolling in from the south. We make it to Achang Bay before the rain starts. The only shelter is an old fueling station with two walls and a sand floor. Irao and Husto sit to one side of me, and on the other sits the man from Agat who doesn’t believe I’m a woman.  “The gods don’t want us to go to Layon,” Husto says as water pelts down.  “You whine like a child,” Irao tells him.  The man from Agat looks like he’s thinking of putting his hand on my thigh. I slide my fingers along the sheath of my knife, and he decides to stare at the rain instead.  By dusk the weather is clear but it’s too late to continue on. The men look for wood dry enough to burn while I worry about Rai. It doesn’t take that long to dig a shallow grave, and the detour to Tinta and Faha cost us time.  Irao knows me well. “He’ll be along soon.”  “Hmm,” I say.  Eventually the men build a fire, and we eat supper quietly, and afterward they smoke and drink more tuba. Rai does not come. We all stretch out under the dark, starry sky and rising full moon. I’m halfway through the first thousand names in my head when from the jungle arises a long, low, awful moan of pain. Someone—or something—in agony, in torment.  We all sit up in fear.  “It’s a pig,” says one of the men from Amat.  “It’s Anufat,” says Husto, naming the ugliest and meanest of the taotaomo’na. Anufat has fangs and claws, and sometimes not even a head.  Irao tosses sand at Husto. “Stop telling stories.”  “He wants his gift,” Husto insists, pointing to the fern leaves I’d forbidden anyone to touch. “You said it was for him.”  “It’s for another,” I protest.  The moan again: drawn out agony that makes my stomach flutter. Not Rai, I tell myself. But that fear grabs me and doesn’t let go, and after the third terrible time, I stand up.  “I’ll come with you,” Irao offers.  “No. I’ll go alone.” I pick up the folded leaves. “Stoke the fire and stay here.”  By the time I reach the edge of the jungle the fire is bright again, the men nothing but silhouettes. A narrow path, mostly overgrown, curves from behind the fueling station into the nunu trees. Brown snakes curl away from my bare feet. The knife in my hand won’t do anything against a spirit, but I have salt, too, and words, and if I have to run I can run, too, faster than anyone can imagine.  The steady sea breeze shifts the trees and leaves, makes shadows flicker, tricks my eyes with movement—and then a hand clamps down over my mouth, yanks me backward. The dead man’s clothes and knife spill from their leafy envelope and scatter on the ground. My knife gets lost in the bushes. Someone speaks low against my ear, a command of some kind. I stop struggling.  “Who are you?” I ask in Russian, muffled, garbled.  He repeats his command. Be quiet, he’s saying. He pulls me backward through brush into a small clearing where Rai is curled up on the ground, his hands and ankles bound, his mouth gagged.  “I’m a friend,” I insist, the words mostly unintelligible. “Friend.”  His free hand gropes my hips and ass. Looking for a weapon. He finds my cock instead and makes a startled noise. A moment later he yanks me down to the ground against Rai and lays a sharp blade against my exposed throat. My skin stings. Rai grunts. The moonlight illuminates the stranger’s pale face but I can’t see his eyes, or what emotion might be in them.  “Who are you?” he demands in Russian.  “Isa.”  He yanks at my wig, rips at my skirt. My cock hangs out, long and soft. He slaps at it and says, “Not a woman.”  If I had my knife, I’d cut his hand off. Instead I keep my chin up and stare straight at him. “Sergei?”  He hesitates. The slightest flick of his wrist and he can end my life. I’m breathing fast and my insides are watery. Some things you can’t control.  “That’s the last thing he said,” I tell him. “Sergei.”  Another long moment. Then, “How did he die?”  “From his head injury. He said you might come, that you’d tell us everything. Not that you’d attack and try to kill us.”  The Russian sits back on his haunches. Rai grunts against his gag. Carefully I put my hand on his leg. He can’t understand what we’re saying. He thinks that we’re only a few moments from death, and I wouldn’t call him wrong.  “You’re Sergei?” I repeat.  “Yes. He was Vasilly.”  “You’re from Russia?”  “There’s no Russia.” His voice is flat.  “You’re the first visitors from the outside world in a hundred years,” I say, and the thrill of it runs through me. No other Bridge has ever found a man from away. The governors will be happy with me. Maybe I can finagle a reward; fewer workers to the dump each season, perhaps, or some other special favor.  Sergei points his finger and says, “Don’t move.”  He retreats to search through Vasilly’s scattered clothing and boots. In the darkness I tug on Rai’s knots, but my fingers are trembling and the cords are wound too well.  Sergei returns with Vasilly’s knife. He unscrews the base of the hollow grip. Inside are blue fireflies. Electric lights. I haven’t seen those in a long time. The weapon is some kind of tracking or communication device, designed for stealth. He slides out a narrow part and wedges free a luminescent strip. Quick, efficient moves.  “We’ve hoped for your return,” I say, trying to sound awed. “Prayed for it.”  Sergei pockets the strip. “Forget prayers. We’re only here for information.”  “Honored visitor, our governors would be happy to share anything we know.”  He snorts, though I’m the one who should laugh. Information. Fishing reports, maybe? Average daily rainfall? No man treks across the Pacific, dares to swim between the reefs, and subsequently avoids the local population without good reason.  “How is it that you speak Russian?” he asks.  I duck my head. “There was a man, many years ago. He washed ashore the way your friend did. He recovered and lived in the jungle by himself. I would visit him, bring him companionship, and he taught me to speak it.”  He looks at my cock and shakes his head. Imaging perversion, maybe. Defending his imaginary countryman from the likes of me. The truth is much worse, of course. Those white caps, burning hot. My hair never grew back.  “Our governors would greet you with open arms,” I insist. “They’ve kept all the records from the Before time. They know everything about the island and what was here when the world went silent.”  Behind me, Rai struggles quietly against his bonds.  “What governors?” Sergei asks. “Where?”  “I’ll take you,” I tell him.  Sergei wants to leave Rai behind. I can’t risk it. Despite Rai’s many fine qualities, he’s terrible at keeping secrets. Sooner or later he’ll tell Irao and Husto what he’s seen. They’ll tell people at the landfill. Those people will go back to their villages and spread word. And the governors will most definitely not be pleased.  So instead I convince Sergei that the governors despise me and consider me crazy, an insult to their masculinity. They’ll only allow us near their village if a local man guides us. Sergei looks doubtful, but it’s not hard for him to believe that here I’m an abomination. Eventually he unties Rai and lets him stand. I try to soothe over their unfortunate introduction to one another.  “He’s Fleet,” Rai says, both angry and amazed.  “No, not Fleet,” I tell him. “Just a fisherman lost in a storm. He come from Hawaii.”  Of course, we haven’t had contact with Hawaii since Before Silence. Any stray fisherman would have to survive four thousand miles of open sea to reach our shore. But no one ever taught Rai geography.  Still, he’s skeptical. “If he’s a fisherman, why did he want to kill us?”  “He thought we killed his brother. He was afraid.”  Sergei watches us. He can’t understand a word of Chamorro, or maybe he’s just pretending not to. Perhaps they don’t have white caps where he comes from.  “Hawaii,” Rai muses. “We could go there. We could trade, maybe, and no one would have to dig at the landfill anymore. My children, your children—Isa, this could change everything for them.”  “The governors will decide,” I say. “I have to take him there.”  Rai hesitates. He’s my big brother. He used to fight bullies for me when we were dusty children. He cried the day our uncles took me away to Talofofo. He came to walk me home when they were finished burning knowledge into my head. But the mother of his children is waiting for him at Layon.  “I’ll take him by myself,” I tell him. “Go get Angelina.”  He frowns. “No. I’ll come.”  “You don’t have to—”  “I’ll come,” he says curtly.  We circle through the jungle to avoid Irao, Husto, and the men from Agat. For hours we walk along the old highway. No sentries or dogs raise an alarm as we ghost through Inarajan. I wish we had water. Sergei’s careful to walk behind us, never letting Rai or me out of his sight.  “Is there an army?” Sergei asks.  “Not anymore,” I tell him. “Most of the military evacuated or died off After Silence.”  “What about an army of your own people?”  I don’t think that he wants an entire history of the militia here, how the local men trained under the Spanish and fought the Japanese and eventually became the Guam National Guard.  “There’s no need. We only fight each other once in awhile. Do they have armies where you come from?”  “No,” he says, but I think he’s lying.  We trudge on. Boonie pigs trample away in the bushes when our feet come too close. To stay awake, I recite the second thousand of the names in my head. In my fatigue, some syllables slip out.  “What are you saying?” Sergei asks tightly.  “I’m praying,” I tell him. “For your friend. You were very close?”  He grunts.  “He said your name before he died. He sounded . . . fond.”  “He was only a man from my—” Sergei says, and stops. From his ship? From his base? Maybe from his bed.  Carefully I say, “If there are others of your people nearby, they are welcome as well.”  Nothing. I glance back. Sergei has stopped to stare at a faint orange glow in the hills. Rai glances, too, but only for a moment. Those are the lights of Layon. The last gift of the old world. There aren’t many options for garbage on an island like this. You have to pile it somewhere, otherwise you dump it into the ocean—all those car batteries and paint cans, light bulbs and lead pipes, the plastic wrap from food, the dirty diapers and soiled cat litter, generations of toxic messes.  “What’s up there?” Sergei asks.  “An old landfill. They burn off the gasses so they can dig.”  He swats at a bug on his neck. “What are they digging for?”  I shrug. “Anything useful.”  The sky is pink-gold by the time we reach the old satellite tracking station above Inarajan. It’s just a bunch of concrete buildings now, long abandoned, but Sergei pokes around in interest.  “What was this place?” he asks.  “Something called NASA,” I tell him. “People used to visit the moon and this place helped them not get lost.”  “A tracking station.”  “Do people still live up there? On the moon?”  He kicks at an old fencepost. “If there are, they don’t answer when we call them.”  For the first time I really think about the world Sergei comes from. Out there they’ve had the raw materials, factory resources, and technical know-how to manufacture new transformers and power stations. By now they’ve rebuilt the radio stations, the telephone systems, and maybe even the Internet. They probably have medicines like aspirin and insulin, and no one dies of illnesses like appendicitis or childbirth.  All of these things would make life on Guahan easier.  But at a cost. Magellan taught us that.  “Do you trust me?” I ask Rai once we’re walking again.  “What’s kind of stupid question is that?” he asks, brushing thick green leaves from the path.  Sergei says, “Stop talking.”  “You must be completely honest with anything the governors ask you,” I tell him. And then, to Sergei, in Russian, “I’m sorry. I asked my brother not to let them beat me when we reach our leaders. I shame them, the men.”  Sergei says, “If they beat you, why do you dress that way?”  He reminds me of the villagers when I was still Magahet Joseph Howard USN. Dress like a boy. Act like a boy. Can you teach a stone to act like a tree, or a bird to act like a dolphin? The governors said many long-ago ancestors were proud to be Fa’afafine, in the manner of male and female alike. Their approval made the criticism go silent, or at least less vocal.  “I follow my heart,” I tell Sergei. “As all men and women should. Don’t your people do that?”  Sergei coughs. “Perhaps.”  “Vasilly was more than your friend, wasn’t he?” And some of this is just guessing, but a name murmured in longing is hard to forget.  His face turns hard. “It doesn’t matter. He’s gone now.”  Several minutes later we reach the outskirts of Talofofo Park. The parking lot has long returned to vegetation, and the gondolas disassembled or left to rust. Here the governors live in the old history museum, flanked by ramshackle huts and old latte stones and the fresh waters of the Ugum River. It’s all small, unimpressive, nothing to look at twice. A sentry yawns when he sees us.  “Who comes?” he asks.  “Rai of Umatuc,” Rai says. “And my sister the Bridge.”  The sentry yawns again and scratches his ass. “What business?”  “This man comes from away,” I say.  Sergei nudges me nervously. “Tell your governors to come out here.”  “The governors are old men who believe in tradition,” I reply. “They’ll give you all the old records here, but we have to do things their way.”  He continues to look skittish. But the sentry shrugs as if unimpressed with our visitor and pushes open the museum door. Inside all is dim and empty. I remember being nine years old and standing here with the children of other villages, waiting for our education from the wise governors. We all thought we’d been picked for a special destiny.  There’s no such thing as destiny. Only inevitability.  The sentry takes us into a courtyard with woven mats circled around a cooking fire. “Wait here.”  Sergei shuffles his feet, undecided, but I plop down and Rai follows.  An old man in a threadbare shirt shuffles from the house a few minutes later. “Isa,” he says, a toothless smile on his face. He shakes Rai’s hand, nods respectfully at Sergei. Behind him, a hunched servant brings out tea. The old man, Kepuha, sits with a creaking of his knees.  I introduce Sergei in Russian and explain that Kepuha, too, knew the mythical old stowaway, learned this strange foreign language.  “We must celebrate your arrival,” Kepuha says, all kindness. “Such a momentous day.”  “They say you can help me with information, sir,” Sergei says.  Kepuha nods. “Yes, much information. All the old missiles. All those other terrible weapons. It’ll be a relief to be rid of them.”  Sergei relaxes. He’s close, now, to what he came for.  Rai can’t follow their words, but he knows some kind of agreement is being discussed. “Honored uncle, will they trade with us?”  “A good question to ask,” Kepuha says.  We all drink our cool, sweetened tea. More servants bring toasted bread, boiled eggs, and strips of bacon. Kepuha turns to Sergei and talks more about weapons. On the roof of the museum, another sentry appears. Some young men carry large baskets through the far end of the courtyard. The skin on my neck prickles.  “Honored Kepuha, my brother and I have family business in Layon,” I say in Chamorro. “We should depart.”  Kepuha waves his gnarled hand. “There’s time to rest. You must be exhausted.”  Even as I watch, Rai’s eyes slide shut. He leans sideways and sprawls into the dust. Sergei realizes at the same time I do that our food is drugged. He leaps up, tries to dart away, but gets no farther than a few feet before a guard knocks him down and kicks him in the ribs.  “My brother—” I say, slurred. “He didn’t—”  “Sleep,” Kepuha says. “You did well, Bridge.”  My ears fill with a rushing noise and the sluggish crawl of my own heart. A sweet cool river, just like the river Ugum, carries me away to darkness.  The next time I see Sergei, he’s screaming. The soldiers have him naked and strapped to a table, a white cap affixed to his head. I know what it’s like to writhe as knowledge is forced into neural connections. Like lightning striking the brain, over and over. But Sergei’s pain is worse because they’re not putting data into his brain. They’re yanking it out.  The back of my throat burns with bile.  Colonel Kepuha of the Guahan Militia stands beside me, watching through the mirrored window. Electric lights illuminate the rooms down here under the museum. Fresh, cool air circulates from pumps. The entire base runs off the power from recycled material dug out of the Layon landfill. Trash converted to fuel. One of the last great technological achievements of the old world. After Silence, our ancestors couldn’t fix the whole island. But they could fix this place.  Sergei screams again.  “Is this . . . necessary?” I ask.  “He wouldn’t answer questions about his homeland,” Kepuha says. “But we’ll find out.”  Take a hump of land in the middle of the Pacific Ocean. Build a fort on it. Build another. Keep building, decade after decade, ports and airfields and depots of concrete and steel. Swap ownership during wartime. Swap it back. Add secret research labs dedicated to memory research. The future looks unlimited. But then civilization collapses, all of it, swallowed up by solar mega-flares, and that hump of land has to fend for itself.  “You did well, bringing him here,” Kepuha says. “We’ll dig up the body of the one you killed and find out what we can from it.”  With effort, I keep my voice steady. “Who says I killed him?”  He turns to me. “Of course you did. You learned your lessons well.”  One foot rooted in the past. One planted in the future. The job of a Bridge isn’t to greet the Fleet, but to stop it.  “What of my brother, sir?” I ask. “He thinks the strangers were fisherman from Hawaii. I’ll make him swear not to tell, and if he does, no one will believe him anyway.”  Kepuha smiles indulgently and starts walking down the hall. “Your brother is a good man?”  I follow. “Yes. Very good and honorable.”  “Even honorable men can have loose tongues.”  “You can trust him as much as you trust me,” I promise.  We’ve reached another window and another memory room. The table inside is empty.  “When you finished your training as a child, how many names did you leave with?” Kepuha asks casually.  I rub the goosebumps on my arms. “Seven thousand.”  “You left with one thousand,” he says. “We give you another thousand more every time you bring us someone from Fleet. A reward for good service. A way to fill the gaps.”  “But that’s not—” I gulp against a new surge of bile. “That’s not possible. I’d remember.”  The doors in the room open and two guards drag Rai inside. He fights them, my brother does, but they’re much stronger. They strap him down and reach for a cap.  Colonel Kepuha says, “No, you won’t remember. You never do.”    Originally published in We See a Different Frontier, edited by Djibril al-Ayad and Fábio Fernandes Sandra McDonald is a former military officer, recovering Hollywood assistant, and perennially patient college instructor who writes across the genres of romance, history, fantasy, science fiction, GLBTQA, and young adult fiction. Her first collection of stories, Diana Comet and Other Improbable Stories, won a Lambda Literary Award for transgender fiction. It was also a Booklist Editor's Choice, ALA Over the Rainbow book, and Rainbow award winner. Her short fiction has been published in several dozen magazines and anthologies, including the Year's Best YA, Year's Best Science Fiction, Year's Best Science Fiction and Fantasy, Tiptree Anthology, Asimov's Science Fiction, the Magazine of Science Fiction and Fantasy, Clarkesworld, Lightspeed, Strange Horizons, and more. She has several novels in print, including the award-winning Fisher Key adventures and asexual-gay thriller City of Soldiers. She currently resides in Florida.", "text": "5950 words, short story, REPRINT\nFleet\nWhen I officially became a girl, I took the new name of Isa. At the time I was nine years old. In the Umatac village records I’m still a male named Magahet Joseph Howard USN. It’s good luck to be given the name of an ancestor from Before Silence. My brother calls me Shithead, because he’s my brother. But most people call me Bridge, because the governors gave me that. Someone in every village is appointed to stand with one dusty foot in the past and the other planted in the Great Future, ready to take action when ships appear on the blue horizon.\nSounds important. Don’t be fooled. We’re not some backwards cargo cult, building mock radio towers in the magical hope of luring back civilization. Civilization will come again regardless. We’re sure of it.\nIt’s hot today, late afternoon. I’m sitting on the beach and thinking hard about taking a nap. A dozen yards offshore, blue waves roll around Fouha Rock, where the gods created mankind. No kidding: it’s a giant limestone phallus jutting out of the sea.\n“What are you staring at, Shithead?” my brother Rai shouts when the canoes return.\n“Your tiny shriveled-up balls,” I yell back.\nThe men laugh. Among them is my husband Pulan Robert, who comes to me at night with reverence and good humor. He has a second wife, Kami Brittany, who bears him our children and hopes that one day I’ll be gored to death by a boonie pig. She can’t say that too loudly, though, for fear I’ll call down upon her a vengeful taotaomo’na. Those are the spirits that slink through the nunu trees under moonlight, and moan during storms as if in great pain, and brush their invisible cold hands over your nape when you least expect it.\nShe’s right to worry. I know the names of seven thousand taotaomo’na. Seven thousand ancestors who perished here in the After Silence. There’s a man in Yigo who knows twelve thousand. The oldest woman on the island lives in Dededo, and she knows fifteen thousand. The governors gave them to her, just like they gave them to me, through white caps clamped to our skulls.\nI try not to think about the white caps too much.\nThe men beach the canoes and haul out their catches. Pulan Robert smiles at me and waves over to where Kami waits with our youngest daughter bouncing on her hip. A moment later his smile dims. Our visitors have arrived. Four men, tall and lean, with walking sticks wrapped in copper wire and the green ribbons of Agat village.\nRai stops beside me and frowns. “They’re late.”\n“They’re on time.”\n“Late,” he insists. “They’ll slow us down tomorrow.”\n“Two days to get there,” I tell him. “Then you’ll see Angelina again.”\nAt sunset our entire village dines on roasted fruit bats, fresh rabbit fish, breadfruit, cakes, and tuba. The musicians play nose flutes and drums for the children dancing around the bonfire. Three of the men from Agat know of me, but the fourth keeps sliding glances my way. Beneath my blouse, my bra is stuffed with soft grass. I wear a wig of long hair, dark and straight.\n“Babae?” he asks his companions in Tagalog. Many Filipinos clustered in Agat in the After Silence.\n“Oo,” his friends say.\nHe wants to know if I’m a girl. Yes, they say. But he looks at me doubtfully. Wondering what’s under my skirt, maybe wondering if he can put his hands under there to squeeze and rub.\nPulan Robert puts his arm around my shoulder. He smells like salt and fish and Kami.\n“You should stay here,” he says that night, in our bed, as we stare up at the tin and thatch ceiling. Kami’s hut is bigger, but mine is closer to the cooling ocean breeze. Mosquitoes nibble on our arms.\n“I have to go. Someone has to remember the dead,” I remind him.\n“I’ll come along and keep you company.”\n“Rai is coming.”\n“Rai is too impatient. He won’t pay attention.”\nI kiss his nose. “Rai will always pay attention to me.”\nRai’s impatient because it’s been six months since he’s held his wife in his arms. In the morning, he’s awake before anyone else. At breakfast, somber Irao speaks quietly to his crying children. The fourth from our village is Husto, who has spent the last week pleading to our little governor that he should be excused from this duty. She stands firm. The lottery is fair and the gods have picked him to take his turn digging. I wonder if we’re going to have to physically lift Husto in the air and carry him away, but finally he pries himself away from his weeping mother.\n“Travel safely,” Pulan Robert says, with a final warm kiss.\n“I will,” I promise.\nThe men from Agat lead the way down the road. We follow, and only Husto looks back.\nDespite the solemn occasion, I like these trips. Before Silence, you could drive all over Guahan on asphalt roads, from the turquoise waters of Cocos Lagoon all the way north to the limestone cliffs at Ritidian Point. The shrine for the Japanese soldiers who killed themselves, the international airport for big jets, the army tanks abandoned after the war—you could visit them all in just one day. Now the roads are all rubble, and bandits control the bridges, and some of the white villages up north won’t let you pass over their lands without payment. Rai and I tried rowing around the island once when we were young. We nearly shredded ourselves on the reefs. Ours is the age of footpaths and walking sticks, and many people die without ever having stepped outside the villages they were born in.\nThe coastal route to Layon is pretty enough, but I’d like to see more of the old military bases. My namesake Joseph Howard USN worked on one of those. The concrete shells of the buildings are all gutted and stripped out, the roofs blown away by typhoons or leveled by earthquakes. Those ruins are less sad, somehow, than the iron skeletons of hotel high-rises in Hagatna, the resorts where the tourists honeymooned and gambled away their fortunes until the Night of Fire.\nImagine it: two hundred thousand people drinking or dreaming or fucking or hunched over military equipment in the middle of the night, in the middle of the endless ocean, and in the gap from one minute to the next, all the technology died. No telephones, radios, satellites, computers. All the power stations erupted into fire. All the transformers and electrical wires sizzled and fried themselves into charred metal. In the skies above, enormous waves of green light shimmered against the moon and stars. The governors gave me just enough science to know what the Northern Lights are, and why they should never be seen this close to the equator.\nI rub my head, remember the tight white caps, and keep walking.\nOur first step is Fort Nuestra, high on the bluff, to make our offers to the Lady. She’s not the oldest of our gods, but she’s the one Magellan and the Spanish gave to us while they burned our huts and killed our chiefs. When I was very small, I would pray to the Lady to take away my cock. She never did. I don’t hold it against her, though, not much anyways, because Pulan Robert likes it well enough in the dark.\nAfter praying and leaving gifts we continue on to Merizo. Only a few families are left to greet us. Merizo went to war with Inarajan last year and came out on the poorer end. The fight was supposedly over the ownership of a prized carabao, but was probably about skin color or religion. For now Merizo only has one worker to send to the landfill, a teenage boy with a topknot dangling from his otherwise bare skull.\n“I’m going to dig up a radio and battery,” he tells me as we drink tuba by the ruins of a church. “I’m going to call Jesus Christ.”\nMerizo’s always been known for this kind of talk. I don’t mind it. Husto, though, announces that Jesus Christ died on the Night of Fire, and this makes the boy’s parents angry. While they argue, I walk away to piss. A woman with limestone white hair follows me. Her left leg drags in the dirt.\n“You’re the ‘idge,” she says, the words slurred.\nHer name is Nena and she should be dead now, or so the story goes. While working at the landfill she was accidentally buried by the shifting, stinking debris. By the time they pulled her out, she’d been breathing bad air for too long. A quick death might have been more merciful, but Nena’s father carried his only child back to Merizo and cared for her until he died in the war.\n“I’m Isa,” I tell her, pulling down my skirt.\n“I ‘ound the ‘eet,” she says.\nI shake my head, not understanding.\nShe waves her good hand toward the ocean. “The ‘eet.”\nFleet. She found the Fleet. She wouldn’t be the first. Usually, though, there’s a lot of tuba involved, or smoked weeds, or the fanciful imagination of children.\n“I don’t see any ships, Nena.”\n“‘ailor,” she says, and gestures toward the jungle.\n“Show me.”\nChickens scatter before our feet on a narrow path. From the vines and bushes peek out old cement houses on cracked foundations. One hut without doors or a roof is so overgrown you’d miss it if you weren’t looking closely. Inside sits a white man, his face ghastly with pain and his eyes half-lidded. He smells like shit and urine. In his right hand is a sharp curved knife.\n“The ‘eet,” Nena repeats.\nThe rips in his clothing and long scrapes on his arms say he washed in over the reef, but any fool fisherman from the north can fall over the side of a boat. I kneel in the doorway.\n“Good day, sir,” I say. “Can you tell me your name? Your village?”\nHe struggles to focus. Twitches the knife, as if trying to raise his arm. He starts to ramble—short, disconnected words, none of them in English or Chamorro or Tagalog.\nBut I know these words. The governors gave me nations and languages before they gave me names to carry. This man is speaking Russian.\nMy throat goes tight.\nTo Nena, I say, “He comes from Yona. They speak strange up there. Nothing more than that.”\nHer expression falls. “Not ‘eet?”\n“Not Fleet, no,” I say confidently. “When the Fleet returns, an armada of ships will sail into the bay bearing food and wine. They’ll set off fireworks and play the United States anthem. This is just a lost fisherman who needs our help. Return to the beach and find my brother Rai. He’s the tallest, the most handsome. Bring him here. But don’t let anyone else see you. They’ll claim the reward his village has for him.”\nA new light gleams in her eyes at the mention of reward, and she hurries off.\nIf Nena had bothered to examine the Russian’s clothes, she would have seen that even stiff with sea salt, the fabric is newer and finer than anything we can weave or dig up here. He’s wearing lightweight boots with fresh rubber soles. For a white man he’s pale—a sailor who doesn’t see much sun. Maybe he came from a submarine. The governors showed us pictures of those.\n“Who are you?” I ask in Russian.\nHis rambling stops. A hairy brown spider crawls down his leg. He doesn’t brush it off.\n“Did you come alone? Can I call someone for help?”\n“Sergei,” he murmurs.\nMaybe that’s his name, maybe someone else’s. Before I can ask his head slumps over and the knife tumbles from his lax fingers. I see dark blood on the back of his skull. There’s a swelling there, a stone-like bump. No other major injuries on him, no jewelry or electronics, only the knife and its leather sheath strapped under his left trouser leg.\nHe may not have much time left, or he could recover enough to cause serious damage.\nAs always, I am sworn to uphold Rule Number One.\nI squeeze his nose shut and clap my hand over his mouth.\nLife is a stubborn habit to break. It’s a sacred thing, to watch the spirit struggle to take flight. You can see it in the flopping fish pulled from the sea, or in the panicking pig as the knife pierces its throat. The Russian makes muffled sounds and jerks his head, but has no strength to fight me off. I pray to the gods and governors for him. No one here will mourn his death with a nine day feast. But most living things deserve kindness in their last moments, to hear words ushering them to the arms of their ancestors.\nWhen she returns with Rai, Nena’s eyes turn accusatory.\n“He passed quietly, without pain,” I say. “His people from Yona will want to come and retrieve his bones. Rai, bury him in a shallow grave. But don’t tell anyone, or let them help, or they’ll want the reward, too.”\nRai balks. “What reward?”\nI squeeze his arm. “The people of Yona will be grateful to know what happened to him.”\nHe opens his mouth, maybe to say the people of Yona are nothing but swindlers and drunkards. My fingers dig deeper into his skin. He’s not an idiot, my brother, so he goes silent. Nena, bent over the naked corpse, sniffs in grief.\n“‘is clothes,” she says.\n“I took them for his people,” I tell her. “His last words were to thank you, Nena. His spirit rests in peace because of your kindness. He asked that you seclude yourself and say rosaries for him. If you don’t, his taotaomo’na will be very angry. Will you do it?”\nShe nods emphatically. “Yes.”\nBack at the church, the others want to know where Rai is. “Too much feasting last night,” I lie, and they sympathize. Everyone here has suffered from the squats before.\nHusto gestures to the folded fern leaves in my arms. “What’s that?”\n“A gift for the taotaomo’na,” I warn him. “Don’t touch.”\nWe bid farewell to Merizo and detour into the valley to visit both Tinta and Faha Caves. I worry that Nena won’t do as told. Or that Rai will discover something incriminating that I left behind. But the caves require my full concentration. Back in World War II, the Japanese soldiers spent years raping the women, killing old and young alike, forcing people from their homes to concentration camps. Here, as the end of the war drew near, they herded villagers into caves and tossed grenades in after them. Other victims were tied up and beheaded and left in the dirt.\nI don’t have their names—no Bridge does—but we know that the Japanese brutality made the people of Merizo rise up in rebellion. We honor them, too, in this sacred place heavy with memory.\n“You tell the story well,” Irao comments, afterward.\n“I wish I didn’t have to tell it at all,” I reply.\nAfter the ceremonies we trek back to the coast, where dark gray clouds are rolling in from the south. We make it to Achang Bay before the rain starts. The only shelter is an old fueling station with two walls and a sand floor. Irao and Husto sit to one side of me, and on the other sits the man from Agat who doesn’t believe I’m a woman.\n“The gods don’t want us to go to Layon,” Husto says as water pelts down.\n“You whine like a child,” Irao tells him.\nThe man from Agat looks like he’s thinking of putting his hand on my thigh. I slide my fingers along the sheath of my knife, and he decides to stare at the rain instead.\nBy dusk the weather is clear but it’s too late to continue on. The men look for wood dry enough to burn while I worry about Rai. It doesn’t take that long to dig a shallow grave, and the detour to Tinta and Faha cost us time.\nIrao knows me well. “He’ll be along soon.”\n“Hmm,” I say.\nEventually the men build a fire, and we eat supper quietly, and afterward they smoke and drink more tuba. Rai does not come. We all stretch out under the dark, starry sky and rising full moon. I’m halfway through the first thousand names in my head when from the jungle arises a long, low, awful moan of pain. Someone—or something—in agony, in torment.\nWe all sit up in fear.\n“It’s a pig,” says one of the men from Amat.\n“It’s Anufat,” says Husto, naming the ugliest and meanest of the taotaomo’na. Anufat has fangs and claws, and sometimes not even a head.\nIrao tosses sand at Husto. “Stop telling stories.”\n“He wants his gift,” Husto insists, pointing to the fern leaves I’d forbidden anyone to touch. “You said it was for him.”\n“It’s for another,” I protest.\nThe moan again: drawn out agony that makes my stomach flutter. Not Rai, I tell myself. But that fear grabs me and doesn’t let go, and after the third terrible time, I stand up.\n“I’ll come with you,” Irao offers.\n“No. I’ll go alone.” I pick up the folded leaves. “Stoke the fire and stay here.”\nBy the time I reach the edge of the jungle the fire is bright again, the men nothing but silhouettes. A narrow path, mostly overgrown, curves from behind the fueling station into the nunu trees. Brown snakes curl away from my bare feet. The knife in my hand won’t do anything against a spirit, but I have salt, too, and words, and if I have to run I can run, too, faster than anyone can imagine.\nThe steady sea breeze shifts the trees and leaves, makes shadows flicker, tricks my eyes with movement—and then a hand clamps down over my mouth, yanks me backward. The dead man’s clothes and knife spill from their leafy envelope and scatter on the ground. My knife gets lost in the bushes. Someone speaks low against my ear, a command of some kind. I stop struggling.\n“Who are you?” I ask in Russian, muffled, garbled.\nHe repeats his command. Be quiet, he’s saying. He pulls me backward through brush into a small clearing where Rai is curled up on the ground, his hands and ankles bound, his mouth gagged.\n“I’m a friend,” I insist, the words mostly unintelligible. “Friend.”\nHis free hand gropes my hips and ass. Looking for a weapon. He finds my cock instead and makes a startled noise. A moment later he yanks me down to the ground against Rai and lays a sharp blade against my exposed throat. My skin stings. Rai grunts. The moonlight illuminates the stranger’s pale face but I can’t see his eyes, or what emotion might be in them.\n“Who are you?” he demands in Russian.\n“Isa.”\nHe yanks at my wig, rips at my skirt. My cock hangs out, long and soft. He slaps at it and says, “Not a woman.”\nIf I had my knife, I’d cut his hand off. Instead I keep my chin up and stare straight at him. “Sergei?”\nHe hesitates. The slightest flick of his wrist and he can end my life. I’m breathing fast and my insides are watery. Some things you can’t control.\n“That’s the last thing he said,” I tell him. “Sergei.”\nAnother long moment. Then, “How did he die?”\n“From his head injury. He said you might come, that you’d tell us everything. Not that you’d attack and try to kill us.”\nThe Russian sits back on his haunches. Rai grunts against his gag. Carefully I put my hand on his leg. He can’t understand what we’re saying. He thinks that we’re only a few moments from death, and I wouldn’t call him wrong.\n“You’re Sergei?” I repeat.\n“Yes. He was Vasilly.”\n“You’re from Russia?”\n“There’s no Russia.” His voice is flat.\n“You’re the first visitors from the outside world in a hundred years,” I say, and the thrill of it runs through me. No other Bridge has ever found a man from away. The governors will be happy with me. Maybe I can finagle a reward; fewer workers to the dump each season, perhaps, or some other special favor.\nSergei points his finger and says, “Don’t move.”\nHe retreats to search through Vasilly’s scattered clothing and boots. In the darkness I tug on Rai’s knots, but my fingers are trembling and the cords are wound too well.\nSergei returns with Vasilly’s knife. He unscrews the base of the hollow grip. Inside are blue fireflies. Electric lights. I haven’t seen those in a long time. The weapon is some kind of tracking or communication device, designed for stealth. He slides out a narrow part and wedges free a luminescent strip. Quick, efficient moves.\n“We’ve hoped for your return,” I say, trying to sound awed. “Prayed for it.”\nSergei pockets the strip. “Forget prayers. We’re only here for information.”\n“Honored visitor, our governors would be happy to share anything we know.”\nHe snorts, though I’m the one who should laugh. Information. Fishing reports, maybe? Average daily rainfall? No man treks across the Pacific, dares to swim between the reefs, and subsequently avoids the local population without good reason.\n“How is it that you speak Russian?” he asks.\nI duck my head. “There was a man, many years ago. He washed ashore the way your friend did. He recovered and lived in the jungle by himself. I would visit him, bring him companionship, and he taught me to speak it.”\nHe looks at my cock and shakes his head. Imaging perversion, maybe. Defending his imaginary countryman from the likes of me. The truth is much worse, of course. Those white caps, burning hot. My hair never grew back.\n“Our governors would greet you with open arms,” I insist. “They’ve kept all the records from the Before time. They know everything about the island and what was here when the world went silent.”\nBehind me, Rai struggles quietly against his bonds.\n“What governors?” Sergei asks. “Where?”\n“I’ll take you,” I tell him.\nSergei wants to leave Rai behind. I can’t risk it. Despite Rai’s many fine qualities, he’s terrible at keeping secrets. Sooner or later he’ll tell Irao and Husto what he’s seen. They’ll tell people at the landfill. Those people will go back to their villages and spread word. And the governors will most definitely not be pleased.\nSo instead I convince Sergei that the governors despise me and consider me crazy, an insult to their masculinity. They’ll only allow us near their village if a local man guides us. Sergei looks doubtful, but it’s not hard for him to believe that here I’m an abomination. Eventually he unties Rai and lets him stand. I try to soothe over their unfortunate introduction to one another.\n“He’s Fleet,” Rai says, both angry and amazed.\n“No, not Fleet,” I tell him. “Just a fisherman lost in a storm. He come from Hawaii.”\nOf course, we haven’t had contact with Hawaii since Before Silence. Any stray fisherman would have to survive four thousand miles of open sea to reach our shore. But no one ever taught Rai geography.\nStill, he’s skeptical. “If he’s a fisherman, why did he want to kill us?”\n“He thought we killed his brother. He was afraid.”\nSergei watches us. He can’t understand a word of Chamorro, or maybe he’s just pretending not to. Perhaps they don’t have white caps where he comes from.\n“Hawaii,” Rai muses. “We could go there. We could trade, maybe, and no one would have to dig at the landfill anymore. My children, your children—Isa, this could change everything for them.”\n“The governors will decide,” I say. “I have to take him there.”\nRai hesitates. He’s my big brother. He used to fight bullies for me when we were dusty children. He cried the day our uncles took me away to Talofofo. He came to walk me home when they were finished burning knowledge into my head. But the mother of his children is waiting for him at Layon.\n“I’ll take him by myself,” I tell him. “Go get Angelina.”\nHe frowns. “No. I’ll come.”\n“You don’t have to—”\n“I’ll come,” he says curtly.\nWe circle through the jungle to avoid Irao, Husto, and the men from Agat. For hours we walk along the old highway. No sentries or dogs raise an alarm as we ghost through Inarajan. I wish we had water. Sergei’s careful to walk behind us, never letting Rai or me out of his sight.\n“Is there an army?” Sergei asks.\n“Not anymore,” I tell him. “Most of the military evacuated or died off After Silence.”\n“What about an army of your own people?”\nI don’t think that he wants an entire history of the militia here, how the local men trained under the Spanish and fought the Japanese and eventually became the Guam National Guard.\n“There’s no need. We only fight each other once in awhile. Do they have armies where you come from?”\n“No,” he says, but I think he’s lying.\nWe trudge on. Boonie pigs trample away in the bushes when our feet come too close. To stay awake, I recite the second thousand of the names in my head. In my fatigue, some syllables slip out.\n“What are you saying?” Sergei asks tightly.\n“I’m praying,” I tell him. “For your friend. You were very close?”\nHe grunts.\n“He said your name before he died. He sounded . . . fond.”\n“He was only a man from my—” Sergei says, and stops. From his ship? From his base? Maybe from his bed.\nCarefully I say, “If there are others of your people nearby, they are welcome as well.”\nNothing. I glance back. Sergei has stopped to stare at a faint orange glow in the hills. Rai glances, too, but only for a moment. Those are the lights of Layon. The last gift of the old world. There aren’t many options for garbage on an island like this. You have to pile it somewhere, otherwise you dump it into the ocean—all those car batteries and paint cans, light bulbs and lead pipes, the plastic wrap from food, the dirty diapers and soiled cat litter, generations of toxic messes.\n“What’s up there?” Sergei asks.\n“An old landfill. They burn off the gasses so they can dig.”\nHe swats at a bug on his neck. “What are they digging for?”\nI shrug. “Anything useful.”\nThe sky is pink-gold by the time we reach the old satellite tracking station above Inarajan. It’s just a bunch of concrete buildings now, long abandoned, but Sergei pokes around in interest.\n“What was this place?” he asks.\n“Something called NASA,” I tell him. “People used to visit the moon and this place helped them not get lost.”\n“A tracking station.”\n“Do people still live up there? On the moon?”\nHe kicks at an old fencepost. “If there are, they don’t answer when we call them.”\nFor the first time I really think about the world Sergei comes from. Out there they’ve had the raw materials, factory resources, and technical know-how to manufacture new transformers and power stations. By now they’ve rebuilt the radio stations, the telephone systems, and maybe even the Internet. They probably have medicines like aspirin and insulin, and no one dies of illnesses like appendicitis or childbirth.\nAll of these things would make life on Guahan easier.\nBut at a cost. Magellan taught us that.\n“Do you trust me?” I ask Rai once we’re walking again.\n“What’s kind of stupid question is that?” he asks, brushing thick green leaves from the path.\nSergei says, “Stop talking.”\n“You must be completely honest with anything the governors ask you,” I tell him. And then, to Sergei, in Russian, “I’m sorry. I asked my brother not to let them beat me when we reach our leaders. I shame them, the men.”\nSergei says, “If they beat you, why do you dress that way?”\nHe reminds me of the villagers when I was still Magahet Joseph Howard USN. Dress like a boy. Act like a boy. Can you teach a stone to act like a tree, or a bird to act like a dolphin? The governors said many long-ago ancestors were proud to be Fa’afafine, in the manner of male and female alike. Their approval made the criticism go silent, or at least less vocal.\n“I follow my heart,” I tell Sergei. “As all men and women should. Don’t your people do that?”\nSergei coughs. “Perhaps.”\n“Vasilly was more than your friend, wasn’t he?” And some of this is just guessing, but a name murmured in longing is hard to forget.\nHis face turns hard. “It doesn’t matter. He’s gone now.”\nSeveral minutes later we reach the outskirts of Talofofo Park. The parking lot has long returned to vegetation, and the gondolas disassembled or left to rust. Here the governors live in the old history museum, flanked by ramshackle huts and old latte stones and the fresh waters of the Ugum River. It’s all small, unimpressive, nothing to look at twice. A sentry yawns when he sees us.\n“Who comes?” he asks.\n“Rai of Umatuc,” Rai says. “And my sister the Bridge.”\nThe sentry yawns again and scratches his ass. “What business?”\n“This man comes from away,” I say.\nSergei nudges me nervously. “Tell your governors to come out here.”\n“The governors are old men who believe in tradition,” I reply. “They’ll give you all the old records here, but we have to do things their way.”\nHe continues to look skittish. But the sentry shrugs as if unimpressed with our visitor and pushes open the museum door. Inside all is dim and empty. I remember being nine years old and standing here with the children of other villages, waiting for our education from the wise governors. We all thought we’d been picked for a special destiny.\nThere’s no such thing as destiny. Only inevitability.\nThe sentry takes us into a courtyard with woven mats circled around a cooking fire. “Wait here.”\nSergei shuffles his feet, undecided, but I plop down and Rai follows.\nAn old man in a threadbare shirt shuffles from the house a few minutes later. “Isa,” he says, a toothless smile on his face. He shakes Rai’s hand, nods respectfully at Sergei. Behind him, a hunched servant brings out tea. The old man, Kepuha, sits with a creaking of his knees.\nI introduce Sergei in Russian and explain that Kepuha, too, knew the mythical old stowaway, learned this strange foreign language.\n“We must celebrate your arrival,” Kepuha says, all kindness. “Such a momentous day.”\n“They say you can help me with information, sir,” Sergei says.\nKepuha nods. “Yes, much information. All the old missiles. All those other terrible weapons. It’ll be a relief to be rid of them.”\nSergei relaxes. He’s close, now, to what he came for.\nRai can’t follow their words, but he knows some kind of agreement is being discussed. “Honored uncle, will they trade with us?”\n“A good question to ask,” Kepuha says.\nWe all drink our cool, sweetened tea. More servants bring toasted bread, boiled eggs, and strips of bacon. Kepuha turns to Sergei and talks more about weapons. On the roof of the museum, another sentry appears. Some young men carry large baskets through the far end of the courtyard. The skin on my neck prickles.\n“Honored Kepuha, my brother and I have family business in Layon,” I say in Chamorro. “We should depart.”\nKepuha waves his gnarled hand. “There’s time to rest. You must be exhausted.”\nEven as I watch, Rai’s eyes slide shut. He leans sideways and sprawls into the dust. Sergei realizes at the same time I do that our food is drugged. He leaps up, tries to dart away, but gets no farther than a few feet before a guard knocks him down and kicks him in the ribs.\n“My brother—” I say, slurred. “He didn’t—”\n“Sleep,” Kepuha says. “You did well, Bridge.”\nMy ears fill with a rushing noise and the sluggish crawl of my own heart. A sweet cool river, just like the river Ugum, carries me away to darkness.\nThe next time I see Sergei, he’s screaming. The soldiers have him naked and strapped to a table, a white cap affixed to his head. I know what it’s like to writhe as knowledge is forced into neural connections. Like lightning striking the brain, over and over. But Sergei’s pain is worse because they’re not putting data into his brain. They’re yanking it out.\nThe back of my throat burns with bile.\nColonel Kepuha of the Guahan Militia stands beside me, watching through the mirrored window. Electric lights illuminate the rooms down here under the museum. Fresh, cool air circulates from pumps. The entire base runs off the power from recycled material dug out of the Layon landfill. Trash converted to fuel. One of the last great technological achievements of the old world. After Silence, our ancestors couldn’t fix the whole island. But they could fix this place.\nSergei screams again.\n“Is this . . . necessary?” I ask.\n“He wouldn’t answer questions about his homeland,” Kepuha says. “But we’ll find out.”\nTake a hump of land in the middle of the Pacific Ocean. Build a fort on it. Build another. Keep building, decade after decade, ports and airfields and depots of concrete and steel. Swap ownership during wartime. Swap it back. Add secret research labs dedicated to memory research. The future looks unlimited. But then civilization collapses, all of it, swallowed up by solar mega-flares, and that hump of land has to fend for itself.\n“You did well, bringing him here,” Kepuha says. “We’ll dig up the body of the one you killed and find out what we can from it.”\nWith effort, I keep my voice steady. “Who says I killed him?”\nHe turns to me. “Of course you did. You learned your lessons well.”\nOne foot rooted in the past. One planted in the future. The job of a Bridge isn’t to greet the Fleet, but to stop it.\n“What of my brother, sir?” I ask. “He thinks the strangers were fisherman from Hawaii. I’ll make him swear not to tell, and if he does, no one will believe him anyway.”\nKepuha smiles indulgently and starts walking down the hall. “Your brother is a good man?”\nI follow. “Yes. Very good and honorable.”\n“Even honorable men can have loose tongues.”\n“You can trust him as much as you trust me,” I promise.\nWe’ve reached another window and another memory room. The table inside is empty.\n“When you finished your training as a child, how many names did you leave with?” Kepuha asks casually.\nI rub the goosebumps on my arms. “Seven thousand.”\n“You left with one thousand,” he says. “We give you another thousand more every time you bring us someone from Fleet. A reward for good service. A way to fill the gaps.”\n“But that’s not—” I gulp against a new surge of bile. “That’s not possible. I’d remember.”\nThe doors in the room open and two guards drag Rai inside. He fights them, my brother does, but they’re much stronger. They strap him down and reach for a cap.\nColonel Kepuha says, “No, you won’t remember. You never do.”\nOriginally published in We See a Different Frontier, edited by Djibril al-Ayad and Fábio Fernandes\nSandra McDonald is a former military officer, recovering Hollywood assistant, and perennially patient college instructor who writes across the genres of romance, history, fantasy, science fiction, GLBTQA, and young adult fiction. Her first collection of stories, Diana Comet and Other Improbable Stories, won a Lambda Literary Award for transgender fiction. It was also a Booklist Editor's Choice, ALA Over the Rainbow book, and Rainbow award winner. Her short fiction has been published in several dozen magazines and anthologies, including the Year's Best YA, Year's Best Science Fiction, Year's Best Science Fiction and Fantasy, Tiptree Anthology, Asimov's Science Fiction, the Magazine of Science Fiction and Fantasy, Clarkesworld, Lightspeed, Strange Horizons, and more. She has several novels in print, including the award-winning Fisher Key adventures and asexual-gay thriller City of Soldiers. She currently resides in Florida.", "source": "https://clarkesworldmagazine.com/mcdonald_08_17_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fleet by Sandra McDonald"}