{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lavie Tidhar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "WzqMU1B1oVHbqBmggiQe3Ur9Cd0=", "id": null, "license": null, "comments": "", "raw_text": "3000 words, short story  The Dying World  1. Bonsai  It’s a beautiful world, easily worth killing for, but what would be the point? The world, encased in vacuum and glass, is blue-white, a miniature Earth, with a marble-sized sun rotating around it. It has a tiny atmosphere, tiny, lovingly-sculpted seas, three continents, numerous tiny islands, tectonic plate activity, miniature volcanoes, and some seriously large creatures for a world so small. It’s a hot, humid place, this world. The glass orb that contains it protects it perfectly. Touching the surface of the orb, the old man magnifies a part of the tiny planet, watching, completely engrossed, as a sea creature the shape of a disc wraps itself around a creature shaped like a ball with many circular mouths full of sharp teeth. The ensuing fight attracts other creatures, and for a moment this particular point under this particular sea is swarming with life.  The man is so engrossed in his creation that he fails to hear the doors of the old church opening behind him. Outside it is dusk, and an enormous red sun is visible on the horizon, setting slowly. The man had always loved this place, with its ancient mausoleum and church spires shaped like ice-cream cones and its wide open square. It has an aura of faded grandeur, of stories having been worn deep into the stones by the passing of countless humans.  When he does hear the light footsteps approach it is already too late. Something cold touches the back of his head; he has only enough time to think he would like to be reborn as a butterfly before the assassin squeezes the trigger and the old man’s head explodes all over the glass orb, covering an entire world in a violent red haze.  2. Black Rain  The assassin checks Mother Russia for the next forty-eight hours. Of the thirty of so humans living in the place one is still unaccounted for, which worries the assassin. He composes a message in Japanese, utilising haiku for its brevity and sincerity of form. It is a quantum haiku, with meanings ranging from Apologies For Disturbing One’s Shape to Notification Had Been Sent in Advance. He sends it to the church on Red Square in the biological form of a moth, the poem encoded into rapid wing movements. The moth fails to return. The assassin knows he can expect a counter-assassination at any moment, which he is quite looking forward to. He is using the ancient codes, Moscow Rules, to guide his behaviour. Meanwhile he waits. The Entity on Everest, having requested he carry out this assignment, has not sent further instructions. By protocol, the assassin would not deliver the world directly. There will be a portal—a drop point.  And so . . . he should wait but, being as he is, he does not like to. It is why he is Assassin, rather than Maker, say, which certainly requires a fastidious kind of patience, or Explorer, which basically means—to the assassin’s way of thinking—a way of further moving away from humanity, not to mention ice-sleeping in space for countless generations. The assassin is a humanist first and foremost, something he shared with his target, but he wonders now, a little uneasily, whether the target might be changing his mind about such things, which are a matter of philosophy, you could say, more than anything.  And so he decides, despite Moscow Rules, despite protocol, to act, to do—which is the human in him, still, the restless ape who doesn’t like to wait. He steps out of the giant black cube of a building that he had been inhabiting on Dzerzhinsky Square—which turns out to save his life. As he turns to look at the building he sees clouds gathering over the roof; they form in mid-air and concentrate into discs that hover lower and lower. Where they finally touch the surface the entire building slowly grows transparent, the black leached out of it into the clouds, then slowly the entire edifice crumbles gently to the ground, the dust swirling lazily in the air. The black clouds above slowly dissipate into water, or perhaps it is ink. Where their rain falls it stains the pavement. The assassin opens an umbrella and walks away, meanwhile lodging a complaint with the Greater Moscow Entity regarding the destruction of a Monument of Historical Significance, not to mention the forbidden use of clouds, banned under a treaty too long ago for anyone to remember it. Inside, though, the assassin is pleased. So the old man wants to play after all.  3. Butterfly  The man does not return as a butterfly, of course. He returns as a cloud of butterflies, which is quite liberating after wearing human form for so long. A part of him watches the assassin walking through the inky rain, his feet leaving soot-marks on the pavement. The assassin is following Moscow Rules, one of which is Always Blend In. He is shifting—becomes a part of old brickwork, becomes shadow in the awning of a store, becomes glass, becomes reflection—a tedious mode of travel, the old man feels, but it does make it harder to follow him. The old man is spread all over the city now, a cloud of bright butterflies that beat their wings lazily in the dying light of the red sun. A part of him acknowledges the Greater Moscow Entity’s complaint, sends back a Russian shrug, and watches as the old KGB building is reconstructed, the dust reassembling itself from the middle, up to the roof and down to the ancient foundations. He wants his world back, but it isn’t there, and he wonders with some irritation where the assassin had hidden it. For a moment he scribbles a message in the sky, rearranging molecules to reflect light in a certain way, so that anyone glancing up can see the words: Worlds Are To Be Given, Not Taken Away.  The man sighs, millions of butterflies beating their wings as one. No one cares much for his worlds. He feels he should be flattered, and wonders what collector had sent the assassin after him. He did in fact receive Notification of Intent but had forgotten to follow it up, being too absorbed in a new ring-world that seemed quite promising. He decides to wait. It is the assassin’s turn, after all, and he is curious to see what he would do.  4. Reflections  The assassin reconfigures himself into human form and for a moment watches his reflection in the air. His reflection stares back and nods in acknowledgement. It’s a good form, he thinks. He shapes a few more reflections out of air and dust and sends them across the city. He knows the man is watching him, but he doesn’t care. Where he is going the old man won’t be able to follow.  He rings the bell.  The building used to be a hotel, a long time before. Its current occupant has had it restored some time in the past before moving in. He is a collector, and each former room is now a museum of sorts. He is another collector—the world is full of collectors—but a useful one, which makes him almost unique.  “Come in.”  The door opens. He steps in and the door closes behind him, trapping a butterfly in the process. The butterfly emits a screech of what might be amusement before turning to dust.  “Second floor.”  He climbs the steps. At the top of the landing on the second floor is a small chamber. The unseen voice says, “Get inside.”  “Is this really necessary?” the assassin says.  “You know where the door is,” the voice says, unhelpfully, and the assassin shrugs and steps through.  The ancient meme-washer starts to life, flooding the chamber with steam. It is like a sauna filled with tiny crawlers, who comb through the assassin’s mind, searching for any meme he may have unwittingly picked up on his way and eradicating them. He feels a song go out of his head, a jingle for a soap that hasn’t been sold in millennia, a religion, perhaps two, a theory of everything, a new concept of beauty and a recurring image of possibly alien origin, he can no longer remember.  “You’re clean.”  The doors open, and he steps through into the corridor, where the collector waits.  5. The Collector  The collector is a fat man with a toupee and a pipe and three very blue eyes. He smokes high-density encoded tobacco, which gives him a glazed look as he assimilates the data with each puff on his pipe. “Life forms on Carthage III,” he says. “Fascinating.” Puff. “The poetry of sentient asteroids.” Puff. “Tasty. Ah, the Great Attractor, her life and cosmological significance for nearby galaxies. Did I ever tell you I met her once?”  The Great Attractor is two-hundred and fifty thousand light years away and the size of several galactic clusters. Apart from gravitationally affecting galaxies around her, she is also nosy, possibly senile, and generally believed to be, if not exactly God, then at least a high-level deity of some sort, in the same family as galactic centre black holes and trans-dimensional sentient manifolds. “You did,” the assassin says.  “Ah.”  “I need a weapon.”  “Indeed.”  “Or at least the idea of a weapon.”  The collector beams. “Then you’ve come to the right place!’ he says jovially, and puts one podgy hand on the assassin’s shoulder. “This place is full of good ideas.”  6. Ideas  For the next several hours, or possibly it is several days, the assassin rifles through the collector’s museum. There are memes preserved on anything from ink and paper to thought-globules, some in actual form, some in such exotic formats that he doubts even the collector can read them. He is looking for a weapons meme, which is the collector’s speciality.  “I heard you made the old man peeved,” the collector says some time into the guided tour. “Never understood it myself, that obsession with worlds. As if there aren’t enough out there already.”  “Contract,” the assassin says shortly.  “Hmm,” the collector says.  “Hmm?”  “If I were to venture a guess, I’d say one of the Entities put you up to it?”  “You know contracts are confidential.”  “Of course, of course. Nevertheless . . . ”  The assassin ignores him as he goes through concepts, blue-prints, essays, pictures, alternate-universe snapshots, snatches of alien music and all the rest of it.  “Pesky things, Entities,” the collector says, undaunted. This time it’s the assassin’s turn to say, “Hmm.”  “Hmm?” the collector says. “Do you know, I often wondered if one could take out an Entity.”  “Don’t let them hear you say that,” the assassin says. The collector nods. “Grouchy, aren’t they.”  The assassin shrugs. He doesn’t care much either way. Entities are like black holes or the common cold—they’re just there. It is possible some were once human—or a conglomeration of millions of joined human lives—just as it is possible they are a machine amalgamation, or a hybrid of both, or some alien intelligence or even something out of a parallel universe that slipped in when no one was looking. At any given moment there are five or six of them on the planet, usually one or two on the moon, a few transient ones in the gas giants and several in the sun, either rebuilding it or hurrying its demise, no one is quite certain. The Everest Entity, his client, has been there forever, never comes down from a certain height, and has a fascination for human-made stuff like bonsai worlds or antique machine guns. Like this collector, the Entity is indiscriminate in its passions and, so the assassin thinks, has no taste besides.  “I’ll leave you to it,” the collector says, knocking the pipe against a wall. “Things to do, people to see.”  “Actually,” the assassin says, “I’m done.”  “Oh? What did you find?”  “An old idea.”  “Always the best ones,” the collector says, then he sighs. “Very well. And my fee?”  The assassin finds the sealed packed, opens it, communicates it across. “An ant culture Eliminator from the Sigma-IV Universe,” he says. “Black matter condenser, string-dimension automatic tuning, used between the hundred and fifth and the two thousand one hundred and second Grey Galaxy Wars.”  The collector claps his hands gleefully. “A genuine ant weapon?” he says. “Where did you get this?”  But the assassin is already gone.  7. Dead Letter Box  There is a post box on Red Square though there hasn’t been a postal service for millennia. It is kept for both historical and aesthetic reasons. It is also a portal, and the assassin’s destination. Half-way there the Everest Entity contacts the assassin. Do you have the item? it says.  “I do.”  You have shared the ant device? It has cost some effort to obtain.  “I’m sorry if you were inconvenienced.”  You are exhibiting sarcasm.  “You think?”  There is a roaring in his head, like a million black flies trapped in a tiny space, all trying to escape at once. Bring the world to the drop point.”  “I think the old man will be following,” the assassin says.  Then do your job. Again.  Then it is gone, and he is alone, flying across the red sky, his reflections joining him so that they appear to be an arrow of birds, flying in formation.  He lands at the square. He knows the old man will be waiting. By the rules of the game, the only way to resolve a contract is for the two sides to face each other in the end. He waits.  A giant, silvery moon rises slowly in the sky. It looks like an alien spaceship, so heavy it might drop down at any moment. The assassin scans the area but sees no opposition. He begins to walk towards the mail box, his reflections following.  A thousand black butterflies rise before him, blocking the way. He spreads his fingers in front of him like a magician and fire spits out. The butterflies melt. Where they fall they ooze, and a wall rises, green and yellow like pus.  The assassin forms his hands into fists and punches the wall, but where he does the wall bends back and becomes butterflies again, and they latch onto his hands and snare them. The assassin curses.  There is the sound of light footsteps behind him.  He tries to turn, and can’t.  “Give me back the world.”  The voice speaks old Russian. It is rusty, almost a whisper. “You didn’t,” the assassin says.  The dead voice laughs behind him. “It seemed appropriate,” it says. “After all, you cannot kill a dead man twice.”  “You’d be surprised,” the assassin says, and his hands become ice, a chill grows out of his body, and the butterflies holding him freeze and fall to the ground, breaking into thousands of tiny shards, the sound like a symphony. He turns.  “Give it back to me,” Lenin says.  8. Wings  The doors of Lenin’s mausoleum stand open. The mummy faces the assassin, a small smile playing at the corners of its lips. “The Greater Moscow Entity will complain,” the assassin says, though privately he appreciates the sentiment.  “It is a true Russian,” the old man says. “It always complains.”  “We seem to be at an impasse,” the assassin says.  “Not at all,” the old man says. “Since you will never reach the drop box. I have sent it back to your client with a little gift of my own devising, alas.”  “Oh?”  “From time to time I find the need for dead worlds,” the Lenin Mummy says. “I sent the Entity a private composition, an anti-matter world which, sadly, had a malfunctioning casing. I’m afraid by now the world—this world, I mean—is short a mountain.”  “I see,” the assassin says, impressed despite himself. “Did it work?”  They both turn momentarily to the Kremlin, converting its walls into a giant display.  “I . . . see,” the assassin says again.  “Unfortunate,” the old man says.  “It will come back,” the assassin says.  “No doubt. But that won’t help you.”  “Nevertheless,” the assassin says. “A contract is a contract.”  “Give me back the world.”  “What do you need with miniature worlds, anyway?” the assassin says.  “They make more sense than the other kind,” the old man says. The Lenin mummy takes a step closer, and another, its hands reaching out. The old man says, “Put it in the mummy’s hands.”  The assassin sighs. The orb materialises in his hands, the miniature world frozen inside it. “I’m sorry,” he says.  “Oh? No harm done,” the old man says.  The assassin coughs. He puts the orb in the outreached hands but, as soon as it leaves his hands, the scene inside it changes. There is the sound of a thousand butterflies buzzing and the old man says, “What have you d—”  “They did it to themselves,” the assassin says. “I admit I helped accelerate the process a little, but . . . ”  Inside the orb, dots of light flash across the world. The lights grow in strength and intensity, consume first one continent, then another, spread out across the oceans, their brightness blinding, the flash of the explosions ebbing out of the orb like bleeding light. A moment later, the tiny red explodes.  “Thermonuclear devices,” the assassin says. “A shame—I became quite fond of them towards the end.”  There is a moment of absolute silence. The assassin tenses, waiting for the old man’s final strike.  It never comes.  The old Lenin body shakes, and it takes the assassin a moment to understand the mummy is crying. When it raises its head at last, its eyes are full of tears.  “It’s beautiful,” the old man says; and for a moment it seems to the assassin as if the voice is the sound of a thousand thousand butterflies, all fluttering their wings at once. Lavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize.", "text": "3000 words, short story\nThe Dying World\n1. Bonsai\nIt’s a beautiful world, easily worth killing for, but what would be the point? The world, encased in vacuum and glass, is blue-white, a miniature Earth, with a marble-sized sun rotating around it. It has a tiny atmosphere, tiny, lovingly-sculpted seas, three continents, numerous tiny islands, tectonic plate activity, miniature volcanoes, and some seriously large creatures for a world so small. It’s a hot, humid place, this world. The glass orb that contains it protects it perfectly. Touching the surface of the orb, the old man magnifies a part of the tiny planet, watching, completely engrossed, as a sea creature the shape of a disc wraps itself around a creature shaped like a ball with many circular mouths full of sharp teeth. The ensuing fight attracts other creatures, and for a moment this particular point under this particular sea is swarming with life.\nThe man is so engrossed in his creation that he fails to hear the doors of the old church opening behind him. Outside it is dusk, and an enormous red sun is visible on the horizon, setting slowly. The man had always loved this place, with its ancient mausoleum and church spires shaped like ice-cream cones and its wide open square. It has an aura of faded grandeur, of stories having been worn deep into the stones by the passing of countless humans.\nWhen he does hear the light footsteps approach it is already too late. Something cold touches the back of his head; he has only enough time to think he would like to be reborn as a butterfly before the assassin squeezes the trigger and the old man’s head explodes all over the glass orb, covering an entire world in a violent red haze.\n2. Black Rain\nThe assassin checks Mother Russia for the next forty-eight hours. Of the thirty of so humans living in the place one is still unaccounted for, which worries the assassin. He composes a message in Japanese, utilising haiku for its brevity and sincerity of form. It is a quantum haiku, with meanings ranging from Apologies For Disturbing One’s Shape to Notification Had Been Sent in Advance. He sends it to the church on Red Square in the biological form of a moth, the poem encoded into rapid wing movements. The moth fails to return. The assassin knows he can expect a counter-assassination at any moment, which he is quite looking forward to. He is using the ancient codes, Moscow Rules, to guide his behaviour. Meanwhile he waits. The Entity on Everest, having requested he carry out this assignment, has not sent further instructions. By protocol, the assassin would not deliver the world directly. There will be a portal—a drop point.\nAnd so . . . he should wait but, being as he is, he does not like to. It is why he is Assassin, rather than Maker, say, which certainly requires a fastidious kind of patience, or Explorer, which basically means—to the assassin’s way of thinking—a way of further moving away from humanity, not to mention ice-sleeping in space for countless generations. The assassin is a humanist first and foremost, something he shared with his target, but he wonders now, a little uneasily, whether the target might be changing his mind about such things, which are a matter of philosophy, you could say, more than anything.\nAnd so he decides, despite Moscow Rules, despite protocol, to act, to do—which is the human in him, still, the restless ape who doesn’t like to wait. He steps out of the giant black cube of a building that he had been inhabiting on Dzerzhinsky Square—which turns out to save his life. As he turns to look at the building he sees clouds gathering over the roof; they form in mid-air and concentrate into discs that hover lower and lower. Where they finally touch the surface the entire building slowly grows transparent, the black leached out of it into the clouds, then slowly the entire edifice crumbles gently to the ground, the dust swirling lazily in the air. The black clouds above slowly dissipate into water, or perhaps it is ink. Where their rain falls it stains the pavement. The assassin opens an umbrella and walks away, meanwhile lodging a complaint with the Greater Moscow Entity regarding the destruction of a Monument of Historical Significance, not to mention the forbidden use of clouds, banned under a treaty too long ago for anyone to remember it. Inside, though, the assassin is pleased. So the old man wants to play after all.\n3. Butterfly\nThe man does not return as a butterfly, of course. He returns as a cloud of butterflies, which is quite liberating after wearing human form for so long. A part of him watches the assassin walking through the inky rain, his feet leaving soot-marks on the pavement. The assassin is following Moscow Rules, one of which is Always Blend In. He is shifting—becomes a part of old brickwork, becomes shadow in the awning of a store, becomes glass, becomes reflection—a tedious mode of travel, the old man feels, but it does make it harder to follow him. The old man is spread all over the city now, a cloud of bright butterflies that beat their wings lazily in the dying light of the red sun. A part of him acknowledges the Greater Moscow Entity’s complaint, sends back a Russian shrug, and watches as the old KGB building is reconstructed, the dust reassembling itself from the middle, up to the roof and down to the ancient foundations. He wants his world back, but it isn’t there, and he wonders with some irritation where the assassin had hidden it. For a moment he scribbles a message in the sky, rearranging molecules to reflect light in a certain way, so that anyone glancing up can see the words: Worlds Are To Be Given, Not Taken Away.\nThe man sighs, millions of butterflies beating their wings as one. No one cares much for his worlds. He feels he should be flattered, and wonders what collector had sent the assassin after him. He did in fact receive Notification of Intent but had forgotten to follow it up, being too absorbed in a new ring-world that seemed quite promising. He decides to wait. It is the assassin’s turn, after all, and he is curious to see what he would do.\n4. Reflections\nThe assassin reconfigures himself into human form and for a moment watches his reflection in the air. His reflection stares back and nods in acknowledgement. It’s a good form, he thinks. He shapes a few more reflections out of air and dust and sends them across the city. He knows the man is watching him, but he doesn’t care. Where he is going the old man won’t be able to follow.\nHe rings the bell.\nThe building used to be a hotel, a long time before. Its current occupant has had it restored some time in the past before moving in. He is a collector, and each former room is now a museum of sorts. He is another collector—the world is full of collectors—but a useful one, which makes him almost unique.\n“Come in.”\nThe door opens. He steps in and the door closes behind him, trapping a butterfly in the process. The butterfly emits a screech of what might be amusement before turning to dust.\n“Second floor.”\nHe climbs the steps. At the top of the landing on the second floor is a small chamber. The unseen voice says, “Get inside.”\n“Is this really necessary?” the assassin says.\n“You know where the door is,” the voice says, unhelpfully, and the assassin shrugs and steps through.\nThe ancient meme-washer starts to life, flooding the chamber with steam. It is like a sauna filled with tiny crawlers, who comb through the assassin’s mind, searching for any meme he may have unwittingly picked up on his way and eradicating them. He feels a song go out of his head, a jingle for a soap that hasn’t been sold in millennia, a religion, perhaps two, a theory of everything, a new concept of beauty and a recurring image of possibly alien origin, he can no longer remember.\n“You’re clean.”\nThe doors open, and he steps through into the corridor, where the collector waits.\n5. The Collector\nThe collector is a fat man with a toupee and a pipe and three very blue eyes. He smokes high-density encoded tobacco, which gives him a glazed look as he assimilates the data with each puff on his pipe. “Life forms on Carthage III,” he says. “Fascinating.” Puff. “The poetry of sentient asteroids.” Puff. “Tasty. Ah, the Great Attractor, her life and cosmological significance for nearby galaxies. Did I ever tell you I met her once?”\nThe Great Attractor is two-hundred and fifty thousand light years away and the size of several galactic clusters. Apart from gravitationally affecting galaxies around her, she is also nosy, possibly senile, and generally believed to be, if not exactly God, then at least a high-level deity of some sort, in the same family as galactic centre black holes and trans-dimensional sentient manifolds. “You did,” the assassin says.\n“Ah.”\n“I need a weapon.”\n“Indeed.”\n“Or at least the idea of a weapon.”\nThe collector beams. “Then you’ve come to the right place!’ he says jovially, and puts one podgy hand on the assassin’s shoulder. “This place is full of good ideas.”\n6. Ideas\nFor the next several hours, or possibly it is several days, the assassin rifles through the collector’s museum. There are memes preserved on anything from ink and paper to thought-globules, some in actual form, some in such exotic formats that he doubts even the collector can read them. He is looking for a weapons meme, which is the collector’s speciality.\n“I heard you made the old man peeved,” the collector says some time into the guided tour. “Never understood it myself, that obsession with worlds. As if there aren’t enough out there already.”\n“Contract,” the assassin says shortly.\n“Hmm,” the collector says.\n“Hmm?”\n“If I were to venture a guess, I’d say one of the Entities put you up to it?”\n“You know contracts are confidential.”\n“Of course, of course. Nevertheless . . . ”\nThe assassin ignores him as he goes through concepts, blue-prints, essays, pictures, alternate-universe snapshots, snatches of alien music and all the rest of it.\n“Pesky things, Entities,” the collector says, undaunted. This time it’s the assassin’s turn to say, “Hmm.”\n“Hmm?” the collector says. “Do you know, I often wondered if one could take out an Entity.”\n“Don’t let them hear you say that,” the assassin says. The collector nods. “Grouchy, aren’t they.”\nThe assassin shrugs. He doesn’t care much either way. Entities are like black holes or the common cold—they’re just there. It is possible some were once human—or a conglomeration of millions of joined human lives—just as it is possible they are a machine amalgamation, or a hybrid of both, or some alien intelligence or even something out of a parallel universe that slipped in when no one was looking. At any given moment there are five or six of them on the planet, usually one or two on the moon, a few transient ones in the gas giants and several in the sun, either rebuilding it or hurrying its demise, no one is quite certain. The Everest Entity, his client, has been there forever, never comes down from a certain height, and has a fascination for human-made stuff like bonsai worlds or antique machine guns. Like this collector, the Entity is indiscriminate in its passions and, so the assassin thinks, has no taste besides.\n“I’ll leave you to it,” the collector says, knocking the pipe against a wall. “Things to do, people to see.”\n“Actually,” the assassin says, “I’m done.”\n“Oh? What did you find?”\n“An old idea.”\n“Always the best ones,” the collector says, then he sighs. “Very well. And my fee?”\nThe assassin finds the sealed packed, opens it, communicates it across. “An ant culture Eliminator from the Sigma-IV Universe,” he says. “Black matter condenser, string-dimension automatic tuning, used between the hundred and fifth and the two thousand one hundred and second Grey Galaxy Wars.”\nThe collector claps his hands gleefully. “A genuine ant weapon?” he says. “Where did you get this?”\nBut the assassin is already gone.\n7. Dead Letter Box\nThere is a post box on Red Square though there hasn’t been a postal service for millennia. It is kept for both historical and aesthetic reasons. It is also a portal, and the assassin’s destination. Half-way there the Everest Entity contacts the assassin. Do you have the item? it says.\n“I do.”\nYou have shared the ant device? It has cost some effort to obtain.\n“I’m sorry if you were inconvenienced.”\nYou are exhibiting sarcasm.\n“You think?”\nThere is a roaring in his head, like a million black flies trapped in a tiny space, all trying to escape at once. Bring the world to the drop point.”\n“I think the old man will be following,” the assassin says.\nThen do your job. Again.\nThen it is gone, and he is alone, flying across the red sky, his reflections joining him so that they appear to be an arrow of birds, flying in formation.\nHe lands at the square. He knows the old man will be waiting. By the rules of the game, the only way to resolve a contract is for the two sides to face each other in the end. He waits.\nA giant, silvery moon rises slowly in the sky. It looks like an alien spaceship, so heavy it might drop down at any moment. The assassin scans the area but sees no opposition. He begins to walk towards the mail box, his reflections following.\nA thousand black butterflies rise before him, blocking the way. He spreads his fingers in front of him like a magician and fire spits out. The butterflies melt. Where they fall they ooze, and a wall rises, green and yellow like pus.\nThe assassin forms his hands into fists and punches the wall, but where he does the wall bends back and becomes butterflies again, and they latch onto his hands and snare them. The assassin curses.\nThere is the sound of light footsteps behind him.\nHe tries to turn, and can’t.\n“Give me back the world.”\nThe voice speaks old Russian. It is rusty, almost a whisper. “You didn’t,” the assassin says.\nThe dead voice laughs behind him. “It seemed appropriate,” it says. “After all, you cannot kill a dead man twice.”\n“You’d be surprised,” the assassin says, and his hands become ice, a chill grows out of his body, and the butterflies holding him freeze and fall to the ground, breaking into thousands of tiny shards, the sound like a symphony. He turns.\n“Give it back to me,” Lenin says.\n8. Wings\nThe doors of Lenin’s mausoleum stand open. The mummy faces the assassin, a small smile playing at the corners of its lips. “The Greater Moscow Entity will complain,” the assassin says, though privately he appreciates the sentiment.\n“It is a true Russian,” the old man says. “It always complains.”\n“We seem to be at an impasse,” the assassin says.\n“Not at all,” the old man says. “Since you will never reach the drop box. I have sent it back to your client with a little gift of my own devising, alas.”\n“Oh?”\n“From time to time I find the need for dead worlds,” the Lenin Mummy says. “I sent the Entity a private composition, an anti-matter world which, sadly, had a malfunctioning casing. I’m afraid by now the world—this world, I mean—is short a mountain.”\n“I see,” the assassin says, impressed despite himself. “Did it work?”\nThey both turn momentarily to the Kremlin, converting its walls into a giant display.\n“I . . . see,” the assassin says again.\n“Unfortunate,” the old man says.\n“It will come back,” the assassin says.\n“No doubt. But that won’t help you.”\n“Nevertheless,” the assassin says. “A contract is a contract.”\n“Give me back the world.”\n“What do you need with miniature worlds, anyway?” the assassin says.\n“They make more sense than the other kind,” the old man says. The Lenin mummy takes a step closer, and another, its hands reaching out. The old man says, “Put it in the mummy’s hands.”\nThe assassin sighs. The orb materialises in his hands, the miniature world frozen inside it. “I’m sorry,” he says.\n“Oh? No harm done,” the old man says.\nThe assassin coughs. He puts the orb in the outreached hands but, as soon as it leaves his hands, the scene inside it changes. There is the sound of a thousand butterflies buzzing and the old man says, “What have you d—”\n“They did it to themselves,” the assassin says. “I admit I helped accelerate the process a little, but . . . ”\nInside the orb, dots of light flash across the world. The lights grow in strength and intensity, consume first one continent, then another, spread out across the oceans, their brightness blinding, the flash of the explosions ebbing out of the orb like bleeding light. A moment later, the tiny red explodes.\n“Thermonuclear devices,” the assassin says. “A shame—I became quite fond of them towards the end.”\nThere is a moment of absolute silence. The assassin tenses, waiting for the old man’s final strike.\nIt never comes.\nThe old Lenin body shakes, and it takes the assassin a moment to understand the mummy is crying. When it raises its head at last, its eyes are full of tears.\n“It’s beautiful,” the old man says; and for a moment it seems to the assassin as if the voice is the sound of a thousand thousand butterflies, all fluttering their wings at once.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize.", "source": "https://clarkesworldmagazine.com/tidhar_04_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Dying World by Lavie Tidhar"}