{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Matthew Kressel", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JkA+r8L215OdsBqEEomn6aqp/t0=", "id": null, "license": null, "comments": "", "raw_text": "5170 words, short story  Your Future is Pending  The dog was in the alley again, sniffing around the empty trash bins for scraps she wasn’t going to find. Martha would be late for work if she fed her again, but she couldn’t bear to let the animal suffer. The mutt huddled behind the bar-coded trash bins as Martha put out a dish of microwave rice and a bowl of water. She’d have to remember to pick up some real dog food on the way home.  “Come on, girl,” Martha said, wiping her brow. It was already ninety-eight degrees and getting hotter. “This is for you.”  The mutt, a scrawny little thing, hesitated. God only knew what troubles she had been through.  Something skittered behind her—a rat—and they both jumped. And when she turned back around, the dog was gone.  “You’d better come eat this,” she said to the empty alley, “before the rats do.”  At forty-one, Martha had never married. At first she told herself it was because she hadn’t met the right person. But as she rapidly approached middle age she told herself it was because she valued her independence. But that reason had grown less persuasive after her father got sick and moved in with her so she could take care of him. So maybe Martha was alone because fate had deemed it that way. And in a battle between mortals and fate, fate always wins.  But, despite her fears of being late, Martha arrived at Mr. Fletcher’s three-story apartment promptly at 8:45 AM, exactly as her wristpad had predicted. She spoke her name and employee number to the door, and it opened wide, then sealed so quickly behind her that her ears popped. It was a brutal 109 outside, and her neatly pressed work uniform was already soaked in sweat. But inside Mr. Fletcher’s climate-controlled apartment it was a cool sixty-eight.  Her wristpad told her Mr. Fletcher’s couch was on the third floor, so she made her way past a dozen empty rooms, while a small army of cleaning bots parted like respectful soldiers to let her pass. According to company records, Mr. Fletcher had moved in six months ago, but you couldn’t tell by the unfurnished rooms and half-opened boxes scattered about the place like bricks from an ancient ruin.  The air smelled of paint and new carpet, but as she ascended the stairs, following the map on her wristpad, a sour smell, something halfway between vinegar and piss, overpowered her. It was worse than sweat but kissing-cousins to it. The smell grew stronger as she got closer, and Martha knew she could have followed her nose instead of the map.  Like the other rooms, this space had many unopened boxes scattered on the floor. But one had been ripped apart like a present on Christmas morning. Pieces lay tossed about the room as if a hungry beast had devoured it. Martha had seen this a hundred times, users madly opening their couches, assembling them in a frenzy, and meshing in before the dust had time to settle.  Mr. Fletcher lay on his couch, eyes rolling behind closed lids, weeks of beard on his sunken cheeks. The couch’s interface couplers softly hummed against his temples, and stroboscopic lights blasted his brain with petabytes of information. Just twenty-two, Mr. Fletcher was a AAA client, a top earner, according to his file. But you wouldn’t know it by his emaciated, pasty-looking body. Though appearance mattered little when it came to MeshLife. And that was actually one of its selling points.  Mr. Fletcher’s service bot, a vaguely human-shaped metallic and plastic thing, stood frozen beside him, its console light flashing alert-red. Martha brought up her work order on her wristpad and reviewed the details.  MeshLife had lost connection with Mr. Fletcher’s service bot two days ago, the file read, and after a sequence of automated repair attempts, the company AIs had chosen Martha as the optimal technician to diagnose the problem. And so here she was.  She plugged her wristpad into the bot’s console and brought up its logs. She suspected the error before the logs confirmed it: Another failed network board, the fifth one this month.  “Fucking cheap-ass Kazak shit!” she said.  The company had begun sourcing hardware from a fifth-rate supplier in Kazakhstan, and their parts failed as often as farmers’ crops these days. When she had asked Olembe, her boss, why MeshLife didn’t use a better supplier, he told her the company’s AIs ran the numbers and calculated that even with the failures it was still cheaper to use the Kazak supplier than sourcing parts elsewhere. So much, Martha thought, for company pride.  The fix was so simple a monkey could do it. She’d swap in a fresh network card and start the diagnostic routines. And, if they checked out, she’d sit and watch the service bot do its caretaker thing for a few minutes: injecting essential fluids and nutrients via IV, removing waste, washing skin and hair, and a dozen other health-related tasks. This last part, watching the bot care for Mr. Fletcher, wasn’t part of her job, but Martha was never comfortable leaving her clients alone until she knew they were safe. These days, some people meshed in for days, even weeks at a time.  Curious as to what Mr. Fletcher was up to, she tapped up the couch’s monitor.  Viewing it on a flat screen and not beamed into her brain at 4.216 THz was like comparing a vid of a rollercoaster to actually riding on one. She had meshed in enough times to complete her training, enough to learn that meshing in wasn’t for her. Not because the experience was scary or uncomfortable, but because mesh was so much better than real life that reality afterward felt like returning to a black and white world after seeing color for the first time.  Mr. Fletcher, or $TopDawg, as he was known in-mesh, stood atop a pedestal in a gargantuan nightclub styled like an Egyptian pyramid. Fantastical creatures swam in the air around him, leaving psychedelic trails of sparkles and rainbows. The real-life Mr. Fletcher resembled the avatar of $TopDawg the way a lump of coal resembled a diamond. In mesh, the man was beautiful, an Adonis of better-than-perfect proportions, every muscle gleaming with sweat, his enormous member barely hidden under silken briefs. He danced to music Martha couldn’t hear, while beneath his pedestal, some four million creatures—avatars from other mesh users—gyrated in the flickering lights. The millions took on weird and grotesque forms, hybrid animals that had not earned their place on the Tree of Life through billions of years of evolution. They thrusted and swayed as $TopDawg led them on. It was an enormous rave-dance-party-fuck-fest-orgy with four million global guests and it wasn’t even nine. Who the hell were these people, Martha wondered, who could afford to do this all day long instead of work? Who could dance and fuck and fritter their lives away while the world slowly withered to nothing?  A row of multicolored spotlights spun around to point at $TopDawg as he paused in a warrior’s pose. Across his chest, a line of text appeared, solid gold letters growing out from his skin.  STAY GUCCI! it read.  Then, as if he were an Olympian athlete tossing a discus, he flung thousands of golden coins into the dancing crowd. The animoid dancers scrambled to pick up the coins like a swarm of hungry pigeons, though there wasn’t nearly enough for all of them.  Martha queried the console to see what the coins were.  Get $25 off select Gucci Mesh Wear™. Use coupon code XG74BH at checkout.  Advertisements in-mesh were scheduled down to the second. At 9:02:14 AM, $TopDawg would promo KillCult IV: Vengeful Blood, a new in-mesh game, by “murdering” a few thousand partygoers with a laser rifle. At 9:06:37 AM, $TopDawg would wrestle and defeat a giant squid in a promo for Deep Hell, an in-mesh movie. At 9:09:15 AM, $TopDawg would give all willing participants a mind-blowing orgasm in an ad for SoftTouch™, the latest teledildonics app. The ad slots for 9:12 and beyond said, “Pending,” which Martha knew meant the company AIs were calculating some complex, multilayered equation that factored in the number of guests, their likes and purchase history, and what today’s advertisers were willing to spend in order to choose an ad that would have the maximum ROI. Martha remembered reading once that the AIs’ method was so opaque that even the company techs admitted they didn’t know quite how it worked.  Martha checked Mr. Fletcher’s biometrics on the console, and they told a familiar tale: Extremely elevated dopamine and endorphin levels; cortisol hormones dangerously high; blood pressure, body temp, and heart rate far below baseline; and more than five markers in his blood that indicated he was severely malnourished.  But she didn’t need a monitor to see this. The young man had the wasted appearance of all the mesh-ins she visited. Bony prominences in hips and shoulders, gaunt faces, and edema swelling of the legs. MeshLife service bots were good, but there was only so much they could do for the human body before entropy took over. And Mr. Fletcher’s bot had been offline for two days.  Outside, a garbage truck rumbled past, while a dozen bots trailed it down the street, emptying trash bins into its carriage almost faster than Martha’s eye could track. The overall effect was like watching spiders unmake a web.  She opened up the code repository on Mr. Fletcher’s bot and switched into a subfolder. The file’s modification time hadn’t changed since the last time she checked, which meant the company AIs hadn’t found and patched the flaw. The software error stared her in the face, a dangerous bug that could lead to a service bot seriously misjudging a client’s health. A bug that, with just a small code tweak, could be made deadly. She’d discovered it a week ago when diagnosing a faulty biometric reading.  Last she’d heard, seventy-five percent of the planet meshed in at least once per week. Billions relied on this piece of software to keep them safe. She could let her superiors know about the flaw and receive a $162.14 finder bonus on her next paycheck. Her boss, Olembe, would give her a smile and a pat on the back. And next week she’d be at another huge and mostly empty house, repairing a faulty network board on a bot made with shitty Kazak parts, just so another overprivileged, spoiled kid could sell pretend shit to millions of their “friends,” while MeshLife would keep making trillions.  Martha stared at the file for a good minute before she closed it and deleted any evidence of having looked at it. Then she began replacing the faulty network board.  Today’s fusillade of ads were for a line of smart diapers. They followed her from street to subway to bus to home, hectoring her from billboards, wall-screens, pads, and even a sleeping girl’s smartwatch.  “Good evening, Martha! Did you know our diapers can alert caregivers when they need to be changed? And with our new AdaptiveWetness™ technology, they can be worn for almost twice as long as the leading diaper brand.”  $PinkFox, or a very good synth of them, modeled the diapers in most of the ads. A few months back, in a lonely moment, Martha had googled $PinkFox without enabling private mode in her browser, and now this nineteen-year-old androgynous sylph followed her everywhere. The fact that they continued to appear meant Martha looked at them more often than she cared to admit.  As she stepped into her apartment, dripping in sweat, a wave of exhaustion swept over her. “Shit!” she said when she spotted the empty box of microwave rice on the table. She’d forgotten to buy dog food.  “Who the fuck is that?” came a voice from the bedroom. “I have a gun!”  “It’s me, Dad,” she said wearily. “It’s Martha.”  “Who?”  “Martha!”  Her father didn’t have a gun, of course. He could barely get out of bed, most days. But that didn’t stop him from threatening her every damn time she got home.  “Why is it so hot in here?” Martha asked. The thermostat said it was eighty-eight degrees inside. “Why’d you shut off the AC, Dad? You can’t do that! It’s dangerous.”  She set the temp at seventy-five, the lowest the software let her go, then made a mental note to remove her father’s voice access to the thermostat. A few weeks ago, when she’d complained to the super about the AC’s lower limit, he’d said the restriction was out of his control, that it had been auto-updated by the manufacturer to comply with state regulations. When Martha protested that she regularly visited clients with lower thermostat settings, the man just shrugged and said it was out of his hands.  She walked down the hall toward her father’s bedroom, and a foul smell grew with the overloud sounds from the TV.  As she stepped through the threshold into the bedroom her father shouted, “Diane? Where the fuck were you? I’m hungry, god dammit!”  “Mom’s dead, Dad,” Martha said flatly. “I’m your daughter, Martha.” She winced and held her nose. “Christ, Dad, did you shit yourself again? It smells like a sewer in here.”  Her father lay in bed, sheets half-covering his sweaty, shirtless body. His gaunt face was covered in a pasty sheen that flickered in the TV light.  “—pollinator bee colonies fell by another 6% in the winter of 2037-38,” said a pixel-perfect beauty from the TV, “according to a new study, down 91% since 2020. Farmers of corn, wheat, rice, soybeans, and sorghum are petitioning the Schiff Administration for more assistance, since their crops are likely to fail again this season without sufficient pollinators.”  “Liars!” her father screamed. “It’s all fucking fake! Goddamned liars!”  The TV cut to President Schiff, drinking a cocktail in a hot tub while three scantily clad women massaged his shoulders. “The farmers dug their own graves by not relying on drone pollinators,” President Schiff said. “I tell you indoor farming is the future, and relying on ‘bugs’ to do the dirty work is just plain stupid!”  “TV, off!” Martha said, and the TV obeyed. A silence filled the room like the absence of a friend she never really liked.  “Hey!” her father said. “I was watching that!”  “All you do is scream at it,” she said.  “TV, on!” her father said, and light and sound exploded back into the room.  Martha stormed around to the back of the dresser and yanked out the power cord.  “You bitch!” her father snapped. “Why’d you do that?”  “Dad,” she said. “You stink.”  His eyes burned with tears and rage as she approached him. She lifted the top sheet and chanced a look, then winced and turned away. The mess was worse than she’d expected.  “Jesus,” she said, “why can’t you go to the bathroom like a human being?”  His voice, softer now, broke with a sob. “I couldn’t help myself.”  Martha shut her eyes, and $PinkFox’s diapered body danced before her closed lids. Sometimes she wondered if the ads knew her better than she knew herself.  After she had bathed and fed her father, changed his sheets, and done her best to remove the lingering smell from the air, she collapsed into a chair beside his bed. Her father softly snored, while the TV played some old scifi movie about a guy who gets abandoned on Mars and has to use his ingenuity to survive.  She’d fallen asleep in the chair when her father’s voice woke her.  “We don’t go to Mars no more,” he said.  “Huh?” she said as she sat up. Her stomach rumbled.  “When I was a boy, that’s all you heard talk. ‘We going to Mars. We gonna start a city there.’ It was all from that Must guy.”  “You mean Elon Musk?” Martha said.  “Yeah, him! He was all gung ho about Mars.”  “They landed there back in ’29,” she said.  “But not to stay,” he said. “We were supposed to start a new world there. What ever happened to that?”  Martha didn’t answer. Mesh happened, she knew. And she worked for the company that sucked away people’s lives like mosquitoes drank blood. It disgusted her. But after months of searching for work, MeshLife was the only job she could find. Without it, she couldn’t afford this apartment or provide for her father. And as much as she loathed him sometimes, she couldn’t bring herself to abandon him to the system.  “Good night, Dad,” she said as she stood.  “Who the fuck are you?” he said. “Where’s Diane?”  On the screen, the hero leaped for joy as one of his inventions worked.  Martha awoke just before dawn on the living room couch, still in her work clothes. Her stomach rumbled loudly. She hadn’t eaten anything last night, but halfway to the kitchen she spotted the box of microwave rice and remembered the dog. “Fuck,” she said.  Ten minutes later she was down in the alley. The bowls she’d left out yesterday were empty, and she placed the new ones beside them. The scrawny mutt eagerly peered out from behind one of the trash bins as if it had been waiting there all night just for her arrival.  “Better eat and drink,” Martha said. “It’s gonna be another scorcher.”  The mutt took a tentative step toward the bowls, and Martha took two steps back to give her some room. The dog gave her a mournful look, and Martha wondered if she would survive another day in this heat. The dog devoured the rice, then looked eager-eyed up at her, waiting for more.  Martha’s chest tightened. She’d definitely need to change a lot of things in her life, and Dad might need more than a little convincing, but Martha made the decision instantly.  “I have more food inside,” she said. “And we can get you out of this awful heat. Do you want to come in with me?”  A brief wag of her tail signaled she was at least open to the idea.  “C’mon,” Martha said, beckoning the dog toward the alley door. “This way.” She propped open the heavy steel door and stood at the threshold, waiting.  The dog nervously approached her and stopped when she reached the door. Martha held out her hand, palm up, toward the dog. She sniffed Martha’s fingers, then gave her palm a single lick that tickled. Martha smiled and reached out to give the dog a friendly pat, when her watch beeped.  “You’ll miss your appointment with City Health Services if you don’t leave now,” it said, and at its sound the dog startled and ran back into the alley.  “It’s just my watch!” Martha shouted, quickly muting it. “Don’t be scared!”  The dog timidly peered out from behind a trash bin, unconvinced.  Martha’s watch vibrated again in silent warning.  “It’s my dad,” Martha said. “I want to stay but . . . ” She swallowed down a growing tightness in her throat. “I have to go do something for him. If I miss this appointment, I have to wait six months for another.” The dog watched her, as if trying to comprehend. “I’m sorry,” Martha said. “But I really have to go. Stay in the shade, will you? I’ll get some real dog food for you today. Promise.”  Martha slowly made her way toward the alley exit, and when she looked back, the dog was still watching her.  A rat darted into the alley, saw the dog, and skittered away.  “I’m sorry Ms. Reston,” the city health clerk said to Martha from behind a thick plexiglass window, “but there’s nothing more I can do.”  Above the clerk’s head, a screen read, “Now serving: D-403.” To their left and right, a dozen other clerks were talking to more people, and behind Martha, a snaking queue of several hundred people waited impatiently inside rope-bordered aisles. Everyone looked as exhausted as Martha felt.  “Please,” Martha said to the woman, “I’ve been waiting for four hours. There has to be something you can do.”  “Like I said,” the clerk said, without a trace of sympathy. “You father doesn’t qualify for full-time care or a visiting nurse.”  “But he has dementia!” Martha snapped, feeling her composure slipping. “And I work a full-time job. I took off today to come here. I’m not getting paid for today.”  “You can call the city’s health service hotline and—”  “I did call the hotline!” Martha said. “They told me to come here!”  “And I’m telling you that my system says your father doesn’t qualify.”  “Your system says that?”  “That’s right.”  “But who actually says that?”  “Excuse me?”  “Who?” Martha said. “Who actually says he doesn’t qualify?”  “The system says that,” the clerk said. “And I’m telling you.”  “But you’re just reading your screen,” Martha said.  “That’s right.”  “So who decides what the system does and doesn’t approve?”  “An algorithm makes the decision.”  “You mean an AI,” Martha said.  “That’s right,” said the clerk. “So there’s no human bias.”  Martha took a long, slow breath. “There’s gotta be someone I can speak to.”  “Yes,” the clerk said, “the city’s health service hotline. The number is—”  “Thanks,” Martha said, stepping away. “Thanks for nothing.”  A bell dinged and the sign above the clerk read, “Now serving: E-609.”  Martha felt faint and really needed to eat something. She let her watch lead her to a bar-restaurant a few blocks from the health office. The place was sparsely filled with older clientele who swiped at their wrists or watched a conservative news feed on the big screen in the back. She sat at the bar and ordered a mock-meat burger, fries, and a beer. As the calories and alcohol entered her body, her rage softened.  The city AIs will deny services the first few times as a weed-out measure, she’d read on a forum for people taking care of sick parents. If you keep trying, eventually you’ll get what you need.  But this was her third time visiting the health office, and she’d called their hotline at least fifty times. How much more begging did she have to do before they decided to help?  She sighed and thought about the dog. She was growing used to Martha, and if her watch hadn’t gone off she would have even let Martha pet her. When she got home, she’d convince the dog to come inside with her. She couldn’t really afford another mouth to feed, but maybe if she reported that dangerous bug and got her $162.14 bonus, it would help some. Dad might need more convincing, but Martha had read that some folks with dementia were soothed by having a dog.  What would she name her? Samantha? No, she once had a friend named Samantha. What about Bella? No, that didn’t fit. The mutt was a survivor and needed a survivor’s name. What about Circe? Circe was a badass goddess who poisoned her enemies and transformed them into beasts, powers Martha wished she had. She imagined bringing the dog to the park with her father, when it wasn’t so hot, and playing fetch with a ball.  “Circe,” she said, trying the name aloud. “Bring it here, Circe.”  “Pardon?” the bartender said.  “Oh, nothing,” Martha said, her cheeks growing hot. “Wait—is there a pet store nearby? I need to pick up some dog food.”  “Yeah, on Seneca,” the bartender said. “Make a right out the door, go two blocks up, then make a left. You’ll see it.”  “Thanks,” Martha said.  She was about to ask for the check when her wrist chirped with a call from home. She tapped the answer button. On the small screen, her father thrashed about his bedroom. “I can’t find it!” he screamed. “I can’t find it!”  He was naked, and a dark stain ran down his leg.  “Where is it?” he screamed. “Where did it go?”  Her father hadn’t called her. Weeks ago, she’d put a medical monitor on him and programmed it to contact her if his vitals reached a certain threshold. Right now his heart rate and blood pressure were through the roof.  “Dad!” she said to her screen. “Dad, I’m coming! I’m coming home!”  “Where is it?” he screamed. “Where is it?”  What should have been a forty minute ride took almost two hours. Her watch told her that because of construction she was better off taking an alternate subway and transferring to a bus. But the alternate subway had signal problems, and the bus route was so crowded she had to wait for three buses to come before there was room enough for her to board.  She tried calling her father a dozen times, but he didn’t pick up. $PinkFox ads followed her the whole way, offering relief from stress with a new strain of soothing vape oil. Martha cursed each time the self-driving bus, ultracautious, stopped at a yellow light it could have easily gone through or to let another vehicle have the right of way. She had bitten her fingernails down to nubs by the time she walked in the door of her apartment.  “Dad?” she shouted. “Dad!”  Inside his bedroom, it looked as if a bomb had gone off. Papers, clothes, picture frames, and books had been tossed around the room. The TV and lamp lay on the floor, both shattered. Every drawer was open, and whatever had lain in them was now somewhere about the room.  She found him on the floor of the closet. The hangar rod had been pulled from the wall and lay across his soiled, naked body.  “Oh my god—Dad!” she said, running to him. “What the hell?”  “I can’t find it!” he said, tears streaming down his face. “It’s not here!”  “What?” she said, crouching beside him. “What are you looking for?”  He looked up at her, his eyes wet and bloodshot, as his lower lip quivered. “I . . . I don’t know . . . ”  “Oh, Dad,” she said, taking him in her arms. He was filthy, but she didn’t care. “Oh, Dad.”  He wept and shivered, and Martha held him, until the sun began to set. Cleaning up the mess took hours, and some things, like the TV and lamp, would need replacing with money she didn’t have.  By the time he had calmed enough to fall asleep, it was after midnight. And it was only now that she remembered Circe. “Fuck!” she said.  She darted out of the apartment and down into the alley.  “Circe?” she called to the blue-tinged shadows. “Circe, are you here?”  The air smelled of soured milk and decades of garbage. The only reply came from the straining air-conditioners above.  “If you come inside,” she said. “I’ll give you real dog food every day. And a soft doggie bed to sleep on. And a bath. You really need a bath.”  She checked the time. She really had to get to bed if she wanted to get up for work tomorrow.  “Please,” she said, slowly heading back to the door. “Please come back. I’m sorry I left today.”  Overhead, a city drone buzzed past. Otherwise, the alley was silent.  As she walked the stairwell back up to her apartment, she had her watch order dog food with expedited delivery. It was obscenely expensive, but she didn’t care.  “Your purchase of dog food for circle has been confirmed,” her watch replied.  “Circe!” she said. “Her name is Circe.”  She was up early and showered quickly, but her stomach was too twisted into knots worrying about Circe to eat much. She prepared two bowls of oatmeal and water and headed downstairs.  It was hot in the alley, and the trash bins were already baking in the sun. Something was different here this morning, but she couldn’t quite place it.  She put down the fresh bowls next to the empty others. “Circe?” she called. “Cir-ce?”  She waited, but the dog didn’t come.  “Circe? C’mon, girl! I have food here!”  She stepped forward, searching behind the bins. Something was rotting in one, and the heat wasn’t helping the smell. The smell grew stronger as she walked. Then she heard the flies.  She spotted a tail, a thin, fuzzy thing, peeking out from under one of the bins. “Circe?”  She crouched down to look. The dog lay still, as if sleeping. Beside her was a pile of vomit. Beside the vomit was a half-eaten rat. Flies swarmed.  Shaking now, Martha stood. This wasn’t real. She and Circe and Dad would go to the park. Dad would grow calmer with Circe around. She would be his best friend.  Martha’s gaze came to rest on a poster applied to the wall. It hadn’t been here yesterday.  The City Health Department has detected a high level of vermin in this area. Rat poison has been automatically applied by aerial drones. Use caution with children or pets when entering this zone.  The same poster had been stuck every fifty feet along the wall.  Circe was hungry, and Martha hadn’t fed her enough. So Circe ate a rat. But the rat had been poisoned. And so Circe had been poisoned too.  Martha crouched down again. The dead dog’s eyes stared at her.  Something chittered down the alley. A dozen sanitation bots were working their way through the bins, carrying off trash almost too fast for her eyes to follow. When they reached Circe, they didn’t pause. One scooped her up and carried her off, while two more scrubbed the ground clean. In seconds, it was as if Circe had never been.  Her watch chirped. “If you don’t leave now,” it said, “you’ll be late for work.”  Mr. Hoffman was nineteen and lived alone in a huge high-rise apartment paid for by the proceeds he earned from doing in-mesh promos, Martha’s work-order said. His couch sat by the window with impressive views of the city. But Mr. Hoffman hadn’t left his couch—hadn’t opened his eyes—in eighteen days. And like the dozens before him, Mr. Hoffman’s service bot had failed. It was the same piece-of-shit Kazak network board, the same five-minute fix.  Martha stood before the window, staring out at the city. How many, she wondered, were meshing-in right this very moment?  Her watch beeped. “Your order of dog food has just been delivered,” it said.  She stared at the message for a moment before swiping it away.  On the service bot’s console, she brought up the code repository. The dangerous software bug she had found a few weeks back stared at her like a dead dog’s eyes. She activated the keyboard and made a small code change, then pushed it upstream. If the company AIs approved the change, at the next software update her code would be sent out to billions of mesh users. She’d get her $162.14 bug-finder’s bonus, and her boss, Olembe, would pat her on the back.  And in a week, maybe two, the first of them would start to die.  She wondered if anyone would notice before then. Matthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow.", "text": "5170 words, short story\nYour Future is Pending\nThe dog was in the alley again, sniffing around the empty trash bins for scraps she wasn’t going to find. Martha would be late for work if she fed her again, but she couldn’t bear to let the animal suffer. The mutt huddled behind the bar-coded trash bins as Martha put out a dish of microwave rice and a bowl of water. She’d have to remember to pick up some real dog food on the way home.\n“Come on, girl,” Martha said, wiping her brow. It was already ninety-eight degrees and getting hotter. “This is for you.”\nThe mutt, a scrawny little thing, hesitated. God only knew what troubles she had been through.\nSomething skittered behind her—a rat—and they both jumped. And when she turned back around, the dog was gone.\n“You’d better come eat this,” she said to the empty alley, “before the rats do.”\nAt forty-one, Martha had never married. At first she told herself it was because she hadn’t met the right person. But as she rapidly approached middle age she told herself it was because she valued her independence. But that reason had grown less persuasive after her father got sick and moved in with her so she could take care of him. So maybe Martha was alone because fate had deemed it that way. And in a battle between mortals and fate, fate always wins.\nBut, despite her fears of being late, Martha arrived at Mr. Fletcher’s three-story apartment promptly at 8:45 AM, exactly as her wristpad had predicted. She spoke her name and employee number to the door, and it opened wide, then sealed so quickly behind her that her ears popped. It was a brutal 109 outside, and her neatly pressed work uniform was already soaked in sweat. But inside Mr. Fletcher’s climate-controlled apartment it was a cool sixty-eight.\nHer wristpad told her Mr. Fletcher’s couch was on the third floor, so she made her way past a dozen empty rooms, while a small army of cleaning bots parted like respectful soldiers to let her pass. According to company records, Mr. Fletcher had moved in six months ago, but you couldn’t tell by the unfurnished rooms and half-opened boxes scattered about the place like bricks from an ancient ruin.\nThe air smelled of paint and new carpet, but as she ascended the stairs, following the map on her wristpad, a sour smell, something halfway between vinegar and piss, overpowered her. It was worse than sweat but kissing-cousins to it. The smell grew stronger as she got closer, and Martha knew she could have followed her nose instead of the map.\nLike the other rooms, this space had many unopened boxes scattered on the floor. But one had been ripped apart like a present on Christmas morning. Pieces lay tossed about the room as if a hungry beast had devoured it. Martha had seen this a hundred times, users madly opening their couches, assembling them in a frenzy, and meshing in before the dust had time to settle.\nMr. Fletcher lay on his couch, eyes rolling behind closed lids, weeks of beard on his sunken cheeks. The couch’s interface couplers softly hummed against his temples, and stroboscopic lights blasted his brain with petabytes of information. Just twenty-two, Mr. Fletcher was a AAA client, a top earner, according to his file. But you wouldn’t know it by his emaciated, pasty-looking body. Though appearance mattered little when it came to MeshLife. And that was actually one of its selling points.\nMr. Fletcher’s service bot, a vaguely human-shaped metallic and plastic thing, stood frozen beside him, its console light flashing alert-red. Martha brought up her work order on her wristpad and reviewed the details.\nMeshLife had lost connection with Mr. Fletcher’s service bot two days ago, the file read, and after a sequence of automated repair attempts, the company AIs had chosen Martha as the optimal technician to diagnose the problem. And so here she was.\nShe plugged her wristpad into the bot’s console and brought up its logs. She suspected the error before the logs confirmed it: Another failed network board, the fifth one this month.\n“Fucking cheap-ass Kazak shit!” she said.\nThe company had begun sourcing hardware from a fifth-rate supplier in Kazakhstan, and their parts failed as often as farmers’ crops these days. When she had asked Olembe, her boss, why MeshLife didn’t use a better supplier, he told her the company’s AIs ran the numbers and calculated that even with the failures it was still cheaper to use the Kazak supplier than sourcing parts elsewhere. So much, Martha thought, for company pride.\nThe fix was so simple a monkey could do it. She’d swap in a fresh network card and start the diagnostic routines. And, if they checked out, she’d sit and watch the service bot do its caretaker thing for a few minutes: injecting essential fluids and nutrients via IV, removing waste, washing skin and hair, and a dozen other health-related tasks. This last part, watching the bot care for Mr. Fletcher, wasn’t part of her job, but Martha was never comfortable leaving her clients alone until she knew they were safe. These days, some people meshed in for days, even weeks at a time.\nCurious as to what Mr. Fletcher was up to, she tapped up the couch’s monitor.\nViewing it on a flat screen and not beamed into her brain at 4.216 THz was like comparing a vid of a rollercoaster to actually riding on one. She had meshed in enough times to complete her training, enough to learn that meshing in wasn’t for her. Not because the experience was scary or uncomfortable, but because mesh was so much better than real life that reality afterward felt like returning to a black and white world after seeing color for the first time.\nMr. Fletcher, or $TopDawg, as he was known in-mesh, stood atop a pedestal in a gargantuan nightclub styled like an Egyptian pyramid. Fantastical creatures swam in the air around him, leaving psychedelic trails of sparkles and rainbows. The real-life Mr. Fletcher resembled the avatar of $TopDawg the way a lump of coal resembled a diamond. In mesh, the man was beautiful, an Adonis of better-than-perfect proportions, every muscle gleaming with sweat, his enormous member barely hidden under silken briefs. He danced to music Martha couldn’t hear, while beneath his pedestal, some four million creatures—avatars from other mesh users—gyrated in the flickering lights. The millions took on weird and grotesque forms, hybrid animals that had not earned their place on the Tree of Life through billions of years of evolution. They thrusted and swayed as $TopDawg led them on. It was an enormous rave-dance-party-fuck-fest-orgy with four million global guests and it wasn’t even nine. Who the hell were these people, Martha wondered, who could afford to do this all day long instead of work? Who could dance and fuck and fritter their lives away while the world slowly withered to nothing?\nA row of multicolored spotlights spun around to point at $TopDawg as he paused in a warrior’s pose. Across his chest, a line of text appeared, solid gold letters growing out from his skin.\nSTAY GUCCI! it read.\nThen, as if he were an Olympian athlete tossing a discus, he flung thousands of golden coins into the dancing crowd. The animoid dancers scrambled to pick up the coins like a swarm of hungry pigeons, though there wasn’t nearly enough for all of them.\nMartha queried the console to see what the coins were.\nGet $25 off select Gucci Mesh Wear™. Use coupon code XG74BH at checkout.\nAdvertisements in-mesh were scheduled down to the second. At 9:02:14 AM, $TopDawg would promo KillCult IV: Vengeful Blood, a new in-mesh game, by “murdering” a few thousand partygoers with a laser rifle. At 9:06:37 AM, $TopDawg would wrestle and defeat a giant squid in a promo for Deep Hell, an in-mesh movie. At 9:09:15 AM, $TopDawg would give all willing participants a mind-blowing orgasm in an ad for SoftTouch™, the latest teledildonics app. The ad slots for 9:12 and beyond said, “Pending,” which Martha knew meant the company AIs were calculating some complex, multilayered equation that factored in the number of guests, their likes and purchase history, and what today’s advertisers were willing to spend in order to choose an ad that would have the maximum ROI. Martha remembered reading once that the AIs’ method was so opaque that even the company techs admitted they didn’t know quite how it worked.\nMartha checked Mr. Fletcher’s biometrics on the console, and they told a familiar tale: Extremely elevated dopamine and endorphin levels; cortisol hormones dangerously high; blood pressure, body temp, and heart rate far below baseline; and more than five markers in his blood that indicated he was severely malnourished.\nBut she didn’t need a monitor to see this. The young man had the wasted appearance of all the mesh-ins she visited. Bony prominences in hips and shoulders, gaunt faces, and edema swelling of the legs. MeshLife service bots were good, but there was only so much they could do for the human body before entropy took over. And Mr. Fletcher’s bot had been offline for two days.\nOutside, a garbage truck rumbled past, while a dozen bots trailed it down the street, emptying trash bins into its carriage almost faster than Martha’s eye could track. The overall effect was like watching spiders unmake a web.\nShe opened up the code repository on Mr. Fletcher’s bot and switched into a subfolder. The file’s modification time hadn’t changed since the last time she checked, which meant the company AIs hadn’t found and patched the flaw. The software error stared her in the face, a dangerous bug that could lead to a service bot seriously misjudging a client’s health. A bug that, with just a small code tweak, could be made deadly. She’d discovered it a week ago when diagnosing a faulty biometric reading.\nLast she’d heard, seventy-five percent of the planet meshed in at least once per week. Billions relied on this piece of software to keep them safe. She could let her superiors know about the flaw and receive a $162.14 finder bonus on her next paycheck. Her boss, Olembe, would give her a smile and a pat on the back. And next week she’d be at another huge and mostly empty house, repairing a faulty network board on a bot made with shitty Kazak parts, just so another overprivileged, spoiled kid could sell pretend shit to millions of their “friends,” while MeshLife would keep making trillions.\nMartha stared at the file for a good minute before she closed it and deleted any evidence of having looked at it. Then she began replacing the faulty network board.\nToday’s fusillade of ads were for a line of smart diapers. They followed her from street to subway to bus to home, hectoring her from billboards, wall-screens, pads, and even a sleeping girl’s smartwatch.\n“Good evening, Martha! Did you know our diapers can alert caregivers when they need to be changed? And with our new AdaptiveWetness™ technology, they can be worn for almost twice as long as the leading diaper brand.”\n$PinkFox, or a very good synth of them, modeled the diapers in most of the ads. A few months back, in a lonely moment, Martha had googled $PinkFox without enabling private mode in her browser, and now this nineteen-year-old androgynous sylph followed her everywhere. The fact that they continued to appear meant Martha looked at them more often than she cared to admit.\nAs she stepped into her apartment, dripping in sweat, a wave of exhaustion swept over her. “Shit!” she said when she spotted the empty box of microwave rice on the table. She’d forgotten to buy dog food.\n“Who the fuck is that?” came a voice from the bedroom. “I have a gun!”\n“It’s me, Dad,” she said wearily. “It’s Martha.”\n“Who?”\n“Martha!”\nHer father didn’t have a gun, of course. He could barely get out of bed, most days. But that didn’t stop him from threatening her every damn time she got home.\n“Why is it so hot in here?” Martha asked. The thermostat said it was eighty-eight degrees inside. “Why’d you shut off the AC, Dad? You can’t do that! It’s dangerous.”\nShe set the temp at seventy-five, the lowest the software let her go, then made a mental note to remove her father’s voice access to the thermostat. A few weeks ago, when she’d complained to the super about the AC’s lower limit, he’d said the restriction was out of his control, that it had been auto-updated by the manufacturer to comply with state regulations. When Martha protested that she regularly visited clients with lower thermostat settings, the man just shrugged and said it was out of his hands.\nShe walked down the hall toward her father’s bedroom, and a foul smell grew with the overloud sounds from the TV.\nAs she stepped through the threshold into the bedroom her father shouted, “Diane? Where the fuck were you? I’m hungry, god dammit!”\n“Mom’s dead, Dad,” Martha said flatly. “I’m your daughter, Martha.” She winced and held her nose. “Christ, Dad, did you shit yourself again? It smells like a sewer in here.”\nHer father lay in bed, sheets half-covering his sweaty, shirtless body. His gaunt face was covered in a pasty sheen that flickered in the TV light.\n“—pollinator bee colonies fell by another 6% in the winter of 2037-38,” said a pixel-perfect beauty from the TV, “according to a new study, down 91% since 2020. Farmers of corn, wheat, rice, soybeans, and sorghum are petitioning the Schiff Administration for more assistance, since their crops are likely to fail again this season without sufficient pollinators.”\n“Liars!” her father screamed. “It’s all fucking fake! Goddamned liars!”\nThe TV cut to President Schiff, drinking a cocktail in a hot tub while three scantily clad women massaged his shoulders. “The farmers dug their own graves by not relying on drone pollinators,” President Schiff said. “I tell you indoor farming is the future, and relying on ‘bugs’ to do the dirty work is just plain stupid!”\n“TV, off!” Martha said, and the TV obeyed. A silence filled the room like the absence of a friend she never really liked.\n“Hey!” her father said. “I was watching that!”\n“All you do is scream at it,” she said.\n“TV, on!” her father said, and light and sound exploded back into the room.\nMartha stormed around to the back of the dresser and yanked out the power cord.\n“You bitch!” her father snapped. “Why’d you do that?”\n“Dad,” she said. “You stink.”\nHis eyes burned with tears and rage as she approached him. She lifted the top sheet and chanced a look, then winced and turned away. The mess was worse than she’d expected.\n“Jesus,” she said, “why can’t you go to the bathroom like a human being?”\nHis voice, softer now, broke with a sob. “I couldn’t help myself.”\nMartha shut her eyes, and $PinkFox’s diapered body danced before her closed lids. Sometimes she wondered if the ads knew her better than she knew herself.\nAfter she had bathed and fed her father, changed his sheets, and done her best to remove the lingering smell from the air, she collapsed into a chair beside his bed. Her father softly snored, while the TV played some old scifi movie about a guy who gets abandoned on Mars and has to use his ingenuity to survive.\nShe’d fallen asleep in the chair when her father’s voice woke her.\n“We don’t go to Mars no more,” he said.\n“Huh?” she said as she sat up. Her stomach rumbled.\n“When I was a boy, that’s all you heard talk. ‘We going to Mars. We gonna start a city there.’ It was all from that Must guy.”\n“You mean Elon Musk?” Martha said.\n“Yeah, him! He was all gung ho about Mars.”\n“They landed there back in ’29,” she said.\n“But not to stay,” he said. “We were supposed to start a new world there. What ever happened to that?”\nMartha didn’t answer. Mesh happened, she knew. And she worked for the company that sucked away people’s lives like mosquitoes drank blood. It disgusted her. But after months of searching for work, MeshLife was the only job she could find. Without it, she couldn’t afford this apartment or provide for her father. And as much as she loathed him sometimes, she couldn’t bring herself to abandon him to the system.\n“Good night, Dad,” she said as she stood.\n“Who the fuck are you?” he said. “Where’s Diane?”\nOn the screen, the hero leaped for joy as one of his inventions worked.\nMartha awoke just before dawn on the living room couch, still in her work clothes. Her stomach rumbled loudly. She hadn’t eaten anything last night, but halfway to the kitchen she spotted the box of microwave rice and remembered the dog. “Fuck,” she said.\nTen minutes later she was down in the alley. The bowls she’d left out yesterday were empty, and she placed the new ones beside them. The scrawny mutt eagerly peered out from behind one of the trash bins as if it had been waiting there all night just for her arrival.\n“Better eat and drink,” Martha said. “It’s gonna be another scorcher.”\nThe mutt took a tentative step toward the bowls, and Martha took two steps back to give her some room. The dog gave her a mournful look, and Martha wondered if she would survive another day in this heat. The dog devoured the rice, then looked eager-eyed up at her, waiting for more.\nMartha’s chest tightened. She’d definitely need to change a lot of things in her life, and Dad might need more than a little convincing, but Martha made the decision instantly.\n“I have more food inside,” she said. “And we can get you out of this awful heat. Do you want to come in with me?”\nA brief wag of her tail signaled she was at least open to the idea.\n“C’mon,” Martha said, beckoning the dog toward the alley door. “This way.” She propped open the heavy steel door and stood at the threshold, waiting.\nThe dog nervously approached her and stopped when she reached the door. Martha held out her hand, palm up, toward the dog. She sniffed Martha’s fingers, then gave her palm a single lick that tickled. Martha smiled and reached out to give the dog a friendly pat, when her watch beeped.\n“You’ll miss your appointment with City Health Services if you don’t leave now,” it said, and at its sound the dog startled and ran back into the alley.\n“It’s just my watch!” Martha shouted, quickly muting it. “Don’t be scared!”\nThe dog timidly peered out from behind a trash bin, unconvinced.\nMartha’s watch vibrated again in silent warning.\n“It’s my dad,” Martha said. “I want to stay but . . . ” She swallowed down a growing tightness in her throat. “I have to go do something for him. If I miss this appointment, I have to wait six months for another.” The dog watched her, as if trying to comprehend. “I’m sorry,” Martha said. “But I really have to go. Stay in the shade, will you? I’ll get some real dog food for you today. Promise.”\nMartha slowly made her way toward the alley exit, and when she looked back, the dog was still watching her.\nA rat darted into the alley, saw the dog, and skittered away.\n“I’m sorry Ms. Reston,” the city health clerk said to Martha from behind a thick plexiglass window, “but there’s nothing more I can do.”\nAbove the clerk’s head, a screen read, “Now serving: D-403.” To their left and right, a dozen other clerks were talking to more people, and behind Martha, a snaking queue of several hundred people waited impatiently inside rope-bordered aisles. Everyone looked as exhausted as Martha felt.\n“Please,” Martha said to the woman, “I’ve been waiting for four hours. There has to be something you can do.”\n“Like I said,” the clerk said, without a trace of sympathy. “You father doesn’t qualify for full-time care or a visiting nurse.”\n“But he has dementia!” Martha snapped, feeling her composure slipping. “And I work a full-time job. I took off today to come here. I’m not getting paid for today.”\n“You can call the city’s health service hotline and—”\n“I did call the hotline!” Martha said. “They told me to come here!”\n“And I’m telling you that my system says your father doesn’t qualify.”\n“Your system says that?”\n“That’s right.”\n“But who actually says that?”\n“Excuse me?”\n“Who?” Martha said. “Who actually says he doesn’t qualify?”\n“The system says that,” the clerk said. “And I’m telling you.”\n“But you’re just reading your screen,” Martha said.\n“That’s right.”\n“So who decides what the system does and doesn’t approve?”\n“An algorithm makes the decision.”\n“You mean an AI,” Martha said.\n“That’s right,” said the clerk. “So there’s no human bias.”\nMartha took a long, slow breath. “There’s gotta be someone I can speak to.”\n“Yes,” the clerk said, “the city’s health service hotline. The number is—”\n“Thanks,” Martha said, stepping away. “Thanks for nothing.”\nA bell dinged and the sign above the clerk read, “Now serving: E-609.”\nMartha felt faint and really needed to eat something. She let her watch lead her to a bar-restaurant a few blocks from the health office. The place was sparsely filled with older clientele who swiped at their wrists or watched a conservative news feed on the big screen in the back. She sat at the bar and ordered a mock-meat burger, fries, and a beer. As the calories and alcohol entered her body, her rage softened.\nThe city AIs will deny services the first few times as a weed-out measure, she’d read on a forum for people taking care of sick parents. If you keep trying, eventually you’ll get what you need.\nBut this was her third time visiting the health office, and she’d called their hotline at least fifty times. How much more begging did she have to do before they decided to help?\nShe sighed and thought about the dog. She was growing used to Martha, and if her watch hadn’t gone off she would have even let Martha pet her. When she got home, she’d convince the dog to come inside with her. She couldn’t really afford another mouth to feed, but maybe if she reported that dangerous bug and got her $162.14 bonus, it would help some. Dad might need more convincing, but Martha had read that some folks with dementia were soothed by having a dog.\nWhat would she name her? Samantha? No, she once had a friend named Samantha. What about Bella? No, that didn’t fit. The mutt was a survivor and needed a survivor’s name. What about Circe? Circe was a badass goddess who poisoned her enemies and transformed them into beasts, powers Martha wished she had. She imagined bringing the dog to the park with her father, when it wasn’t so hot, and playing fetch with a ball.\n“Circe,” she said, trying the name aloud. “Bring it here, Circe.”\n“Pardon?” the bartender said.\n“Oh, nothing,” Martha said, her cheeks growing hot. “Wait—is there a pet store nearby? I need to pick up some dog food.”\n“Yeah, on Seneca,” the bartender said. “Make a right out the door, go two blocks up, then make a left. You’ll see it.”\n“Thanks,” Martha said.\nShe was about to ask for the check when her wrist chirped with a call from home. She tapped the answer button. On the small screen, her father thrashed about his bedroom. “I can’t find it!” he screamed. “I can’t find it!”\nHe was naked, and a dark stain ran down his leg.\n“Where is it?” he screamed. “Where did it go?”\nHer father hadn’t called her. Weeks ago, she’d put a medical monitor on him and programmed it to contact her if his vitals reached a certain threshold. Right now his heart rate and blood pressure were through the roof.\n“Dad!” she said to her screen. “Dad, I’m coming! I’m coming home!”\n“Where is it?” he screamed. “Where is it?”\nWhat should have been a forty minute ride took almost two hours. Her watch told her that because of construction she was better off taking an alternate subway and transferring to a bus. But the alternate subway had signal problems, and the bus route was so crowded she had to wait for three buses to come before there was room enough for her to board.\nShe tried calling her father a dozen times, but he didn’t pick up. $PinkFox ads followed her the whole way, offering relief from stress with a new strain of soothing vape oil. Martha cursed each time the self-driving bus, ultracautious, stopped at a yellow light it could have easily gone through or to let another vehicle have the right of way. She had bitten her fingernails down to nubs by the time she walked in the door of her apartment.\n“Dad?” she shouted. “Dad!”\nInside his bedroom, it looked as if a bomb had gone off. Papers, clothes, picture frames, and books had been tossed around the room. The TV and lamp lay on the floor, both shattered. Every drawer was open, and whatever had lain in them was now somewhere about the room.\nShe found him on the floor of the closet. The hangar rod had been pulled from the wall and lay across his soiled, naked body.\n“Oh my god—Dad!” she said, running to him. “What the hell?”\n“I can’t find it!” he said, tears streaming down his face. “It’s not here!”\n“What?” she said, crouching beside him. “What are you looking for?”\nHe looked up at her, his eyes wet and bloodshot, as his lower lip quivered. “I . . . I don’t know . . . ”\n“Oh, Dad,” she said, taking him in her arms. He was filthy, but she didn’t care. “Oh, Dad.”\nHe wept and shivered, and Martha held him, until the sun began to set. Cleaning up the mess took hours, and some things, like the TV and lamp, would need replacing with money she didn’t have.\nBy the time he had calmed enough to fall asleep, it was after midnight. And it was only now that she remembered Circe. “Fuck!” she said.\nShe darted out of the apartment and down into the alley.\n“Circe?” she called to the blue-tinged shadows. “Circe, are you here?”\nThe air smelled of soured milk and decades of garbage. The only reply came from the straining air-conditioners above.\n“If you come inside,” she said. “I’ll give you real dog food every day. And a soft doggie bed to sleep on. And a bath. You really need a bath.”\nShe checked the time. She really had to get to bed if she wanted to get up for work tomorrow.\n“Please,” she said, slowly heading back to the door. “Please come back. I’m sorry I left today.”\nOverhead, a city drone buzzed past. Otherwise, the alley was silent.\nAs she walked the stairwell back up to her apartment, she had her watch order dog food with expedited delivery. It was obscenely expensive, but she didn’t care.\n“Your purchase of dog food for circle has been confirmed,” her watch replied.\n“Circe!” she said. “Her name is Circe.”\nShe was up early and showered quickly, but her stomach was too twisted into knots worrying about Circe to eat much. She prepared two bowls of oatmeal and water and headed downstairs.\nIt was hot in the alley, and the trash bins were already baking in the sun. Something was different here this morning, but she couldn’t quite place it.\nShe put down the fresh bowls next to the empty others. “Circe?” she called. “Cir-ce?”\nShe waited, but the dog didn’t come.\n“Circe? C’mon, girl! I have food here!”\nShe stepped forward, searching behind the bins. Something was rotting in one, and the heat wasn’t helping the smell. The smell grew stronger as she walked. Then she heard the flies.\nShe spotted a tail, a thin, fuzzy thing, peeking out from under one of the bins. “Circe?”\nShe crouched down to look. The dog lay still, as if sleeping. Beside her was a pile of vomit. Beside the vomit was a half-eaten rat. Flies swarmed.\nShaking now, Martha stood. This wasn’t real. She and Circe and Dad would go to the park. Dad would grow calmer with Circe around. She would be his best friend.\nMartha’s gaze came to rest on a poster applied to the wall. It hadn’t been here yesterday.\nThe City Health Department has detected a high level of vermin in this area. Rat poison has been automatically applied by aerial drones. Use caution with children or pets when entering this zone.\nThe same poster had been stuck every fifty feet along the wall.\nCirce was hungry, and Martha hadn’t fed her enough. So Circe ate a rat. But the rat had been poisoned. And so Circe had been poisoned too.\nMartha crouched down again. The dead dog’s eyes stared at her.\nSomething chittered down the alley. A dozen sanitation bots were working their way through the bins, carrying off trash almost too fast for her eyes to follow. When they reached Circe, they didn’t pause. One scooped her up and carried her off, while two more scrubbed the ground clean. In seconds, it was as if Circe had never been.\nHer watch chirped. “If you don’t leave now,” it said, “you’ll be late for work.”\nMr. Hoffman was nineteen and lived alone in a huge high-rise apartment paid for by the proceeds he earned from doing in-mesh promos, Martha’s work-order said. His couch sat by the window with impressive views of the city. But Mr. Hoffman hadn’t left his couch—hadn’t opened his eyes—in eighteen days. And like the dozens before him, Mr. Hoffman’s service bot had failed. It was the same piece-of-shit Kazak network board, the same five-minute fix.\nMartha stood before the window, staring out at the city. How many, she wondered, were meshing-in right this very moment?\nHer watch beeped. “Your order of dog food has just been delivered,” it said.\nShe stared at the message for a moment before swiping it away.\nOn the service bot’s console, she brought up the code repository. The dangerous software bug she had found a few weeks back stared at her like a dead dog’s eyes. She activated the keyboard and made a small code change, then pushed it upstream. If the company AIs approved the change, at the next software update her code would be sent out to billions of mesh users. She’d get her $162.14 bug-finder’s bonus, and her boss, Olembe, would pat her on the back.\nAnd in a week, maybe two, the first of them would start to die.\nShe wondered if anyone would notice before then.\nMatthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow.", "source": "https://clarkesworldmagazine.com/kressel_11_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Your Future is Pending by Matthew Kressel"}