{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ICRfkwaynM4B3vIsemDbts6i0xI=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: I Don't Want to Bother You  One of my favorite things about working in the science fiction field—even all the way back to my days as a bookseller—is the people I get to work with, be it staff, authors, artists, other editors, or fellow fans. Most days, I’m physically isolated from that world and as an introvert that actually works well for me. I’ve described my genre social life as feast-or-famine. When I go to a convention, writing workshop, or other genre event, I want to soak up every minute of the creative energy it gives, and then I crash. The two pair rather nicely, and upon returning home, it forces me to get back to work.  Despite being this close to the fire and having seen how the sausage is made, I can still get excited about working in this field and attending various events. Over the years, I’ve been both fortunate and unfortunate enough to meet some of my favorite authors and artists. By and large, those encounters have been positive, but sometimes people just aren’t what you expect. Maybe they’re having a bad day. Maybe they’re jetlagged. Maybe they’re just rude. Maybe . . . I’d like to think I’ve become better at handling those situations as I’ve grown older, but I can still be intimidated meeting certain people. It’s not that I expect them to be awful, it’s more that I don’t want to bother them. At least that’s what I tell myself.  The sad thing is that I know it’s not true. Sure, it is possible you could bother someone, but for the most part, if they are attending these events they either want to or expect to meet people. I didn’t actually realize this until a few years after it was happening to me. I’d routinely get emails or messages from fans of the magazine or an authors saying “I saw you at XXX, but I didn’t want to bother you.” I always regret these missed connections and the last thing I want to be taken away here isn’t, “Don’t tell/approach Neil.” In fact, I’ve been doing some things to try to make it easier for people to introduce themselves. Before Worldcon, for example, I’ll post on Twitter that an excellent icebreaker is a simple “Happy Birthday.” Easy. Non-intimidating.  Writers, well, you always have the opportunity to collect a rejection card, that is, assuming you’ve sent me a story I’ve rejected. What is this card? Well, it’s a bit of a novelty item to mark your achievement of submitting a story to the magazine. The front bears the following image (which was one of our early covers):   And the back says, “The bearer of this card has been officially rejected by Clarkesworld. Please be nice to them.” (Some authors send me SASEs to get theirs, but I prefer handing them out in person.) Since it is always asked, if your story is accepted, you can’t get a card for that story. You get paid and have your story in print. Recently I’ve started giving them blue robot head buttons too. There are green ones for everyone else.  So what sent me down this path now? Later this month at the Nebula Awards Conference, I’ll have the opportunity to meet William Gibson for the first time. I read Neuromancer as a young computer science major in college and it had a significant impact on my connection to both of the fields I’ve worked in: technology and science fiction. I know that there’s a high likelihood that I’ll try to talk myself out of bothering him. He hasn’t done anything that should prevent me for thanking him for what that book did for me and even if he should turn out to be someone I might not like, he’s still deserving of that thanks. [This ability was a gift from my heart attack. “Life’s too short” makes it easier to move on.] I’d regret not doing so later . . . there, now that I’ve said it, I have to do it. Well, that or be a poor role model!  Oh, and for the record, if you see me at a convention and I’m not actively heading somewhere or in the bathroom (definitely not in the bathroom), then feel free to say hi, happy birthday, or “do you have some of those cards with you?” Meeting people is one of the reasons I’m there. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: I Don't Want to Bother You\nOne of my favorite things about working in the science fiction field—even all the way back to my days as a bookseller—is the people I get to work with, be it staff, authors, artists, other editors, or fellow fans. Most days, I’m physically isolated from that world and as an introvert that actually works well for me. I’ve described my genre social life as feast-or-famine. When I go to a convention, writing workshop, or other genre event, I want to soak up every minute of the creative energy it gives, and then I crash. The two pair rather nicely, and upon returning home, it forces me to get back to work.\nDespite being this close to the fire and having seen how the sausage is made, I can still get excited about working in this field and attending various events. Over the years, I’ve been both fortunate and unfortunate enough to meet some of my favorite authors and artists. By and large, those encounters have been positive, but sometimes people just aren’t what you expect. Maybe they’re having a bad day. Maybe they’re jetlagged. Maybe they’re just rude. Maybe . . . I’d like to think I’ve become better at handling those situations as I’ve grown older, but I can still be intimidated meeting certain people. It’s not that I expect them to be awful, it’s more that I don’t want to bother them. At least that’s what I tell myself.\nThe sad thing is that I know it’s not true. Sure, it is possible you could bother someone, but for the most part, if they are attending these events they either want to or expect to meet people. I didn’t actually realize this until a few years after it was happening to me. I’d routinely get emails or messages from fans of the magazine or an authors saying “I saw you at XXX, but I didn’t want to bother you.” I always regret these missed connections and the last thing I want to be taken away here isn’t, “Don’t tell/approach Neil.” In fact, I’ve been doing some things to try to make it easier for people to introduce themselves. Before Worldcon, for example, I’ll post on Twitter that an excellent icebreaker is a simple “Happy Birthday.” Easy. Non-intimidating.\nWriters, well, you always have the opportunity to collect a rejection card, that is, assuming you’ve sent me a story I’ve rejected. What is this card? Well, it’s a bit of a novelty item to mark your achievement of submitting a story to the magazine. The front bears the following image (which was one of our early covers):\nAnd the back says, “The bearer of this card has been officially rejected by Clarkesworld. Please be nice to them.” (Some authors send me SASEs to get theirs, but I prefer handing them out in person.) Since it is always asked, if your story is accepted, you can’t get a card for that story. You get paid and have your story in print. Recently I’ve started giving them blue robot head buttons too. There are green ones for everyone else.\nSo what sent me down this path now? Later this month at the Nebula Awards Conference, I’ll have the opportunity to meet William Gibson for the first time. I read Neuromancer as a young computer science major in college and it had a significant impact on my connection to both of the fields I’ve worked in: technology and science fiction. I know that there’s a high likelihood that I’ll try to talk myself out of bothering him. He hasn’t done anything that should prevent me for thanking him for what that book did for me and even if he should turn out to be someone I might not like, he’s still deserving of that thanks. [This ability was a gift from my heart attack. “Life’s too short” makes it easier to move on.] I’d regret not doing so later . . . there, now that I’ve said it, I have to do it. Well, that or be a poor role model!\nOh, and for the record, if you see me at a convention and I’m not actively heading somewhere or in the bathroom (definitely not in the bathroom), then feel free to say hi, happy birthday, or “do you have some of those cards with you?” Meeting people is one of the reasons I’m there.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_05_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: I Don't Want to Bother You by Neil Clarke"}