{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "James Patrick Kelly", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SBINI3S4RYccr66j4sd+rwpNP/g=", "id": null, "license": null, "comments": "", "raw_text": "3820 words, short story  The Promise of Space  Capture 06/15/2051, Kerwin Hospital ICU, 09:12:32  . . . and my writer pals used to tease that I married Captain Kirk.   A clarification, please? Are you referring to William Shatner, who died in 2023? Or is this Chris Pine, who was cast in the early remakes? It appears he has retired. Perhaps you mean the new one? Jools Bear?  No, you. Kirk Anderson. People used to call you that, remember? First man to set foot on Phobos? Pilot on the Mars landing team? Captain Kirk.   I do not understand. Clearly I participated in those missions since they are on the record. But I was never captain of anything.  A joke, Andy. They were teasing you. It’s why you hated your first name.   Noted. Go on.  No, this is impossible. I feel like I’m talking to an intelligent fucking database, not my husband. I don’t know where to begin with you.   Please, Zoe. I cannot do this without you. Go on.  Okay, okay, but do me a favor? Use some contractions, will you? Contractions are your friends.   Noted.  Do you know when we met?   I haven’t yet had the chance to review that capture. We were married in 2043. Presumably we met before that?  Not much before. Where were you on Saturday, May 17, 2042? Check your captures.   The capture shows that I flew from Spaceways headquarters at Spaceport America to the LaGuardia Hub in New York and spent the day in Manhattan at the Metropolitan Museum. That night I gave the keynote address at the Nebula Awards banquet in the Crown Plaza Hotel but my caps were disengaged. The Nebula is awarded each year by the World Science Fiction Writers . . . .  I was nominated that year for best livebook, Shadows on the Sun. You came up to me at the reception, said you were a fan. That you had all five of my Sidewise series in your earstone when you launched for Mars that first time. You joked you had a thing for Nacky Martinez. I was thrilled and flattered. After all, you were top of the main menu, one of the six hero marsnauts. Things I’d only imagined, you’d actually done. And you’d read my work and you were flirting with me and, holy shit, you were Captain Kirk. When people—friends, famous writers—tried to break into our conversation, they just bounced off us. Nobody remembers who won what award that night, but lots of people still talk about how we locked in.   I just looked it up. You lost that Nebula.  Yeah. Thanks for reminding me.   You had on a hat.  A hat? Okay. But I always wore hats back then. It was a way to stand out, part of my brand—for all the good it did me. My hair was a three act tragedy anyway, so I wore a lot of hats.   This one was a bowler hat. It was blue—midnight blue. With a powder blue band. Thin, I remember the hatband was very thin.  Maybe. I don’t remember that one. Nice try, though.   Tell me more. What happened next?  Jesus, this is so wrong . . . No, I’m sorry, Andy. Give me your hand. You always had such delicate hands. Such clever fingers.   I can still remember that my mom had an old Baldwin upright piano that she wanted me to learn to play, but my hands were too small. You’re crying. Are you crying?  I am not. Just shut up and listen. This isn’t easy and I’m only saying it because maybe the best part of you is still trapped in there like they claim and just maybe this augment really can set it free. So, we were sitting at different tables at the banquet but after it was over, you found me again and asked if I wanted to go out for drinks. We escaped the hotel, looking for a place to be alone, and found a night-shifted Indonesian restaurant with a bar a couple of blocks away. It was called Fatty Prawn or Fatty Crab—Fatty Something. We sat at the bar and switched from alcohol to inhalers and talked. A lot. Pretty much the rest of the night, in fact. Considering that you were a man and famous and ex-Air Force, you were a good listener. You wanted to know how hard it was to get published and where I got my plots and who I like to read. I was impressed that you had read a lot of the classic science fiction old-timers like Kress and LeGuin and Bacigalupi. You told me what I got wrong about living in space, and then raved about stuff in my books that you thought nobody but spacers knew. Around four in the morning we got hungry and since you’d never had Indonesian before, we split a gado-gado salad with egg and tofu. I spent too much time deconstructing my divorce and you were polite about yours. You said your ex griped about how you spent too much time in space, and I made a joke about how Kass would have said the same thing about me. I asked if you were ever scared out there and you said sure, and that landings were worse than the launches because you had so much time leading up to them. You used to wake up on the outbound trips in a sweat. To change the subject, I told you about waking up with entire scenes or story outlines in my head and how I had to get up in the middle of the night and write them down or I would lose them. You made a crack about wanting to see that in person. The restaurant was about to close for the morning and, by that time, dessert sex was definitely on the menu, so I asked if you ever got horny on a mission. That’s how I found out that one of the side effects of the anti-radiation drugs was low testosterone levels. We established that you were no longer taking them. I would have invited you back to my room right then only you told me that you had to catch a seven-twenty flight back to El Paso. There still might have been enough time, except that I was rooming with Rachel van der Haak, and, when we had gotten high before the banquet, we had promised each other we’d steer clear of men while our shields were down. And of course, when I thought about it, there was the awkward fact that you were twenty years older than I was. A girl has got to wonder what’s up with her when she wants to take daddy to bed.   I am nineteen years and three months older than you.  And then there was your urgency. I mean, you had me at Mars, Mr. Space Hero, but I had the sense that you wanted way more from me than I had to give. All I had in mind was a test drive, but it seemed as if you were already thinking about making a down payment. When you said you could cancel an appearance on Newsmelt so you could be back in New York in three days, it was a serious turn-on, but I was also worried. Blowing off one of the top news sites? For me? Why? I guessed maybe you were running out of time before your next mission. I didn’t realize that you were . . . .   Go on.  No, I can’t. I just can’t—how do I do this? Turn the augment off.   Zoe, please.  You hear me? That was the deal. They promised whenever I wanted.  Capture 06/15/2051, Kerwin Hospital ICU, 09:37:18, Augment disengaged by request  Andy? Look at me, Andy. Over here. Good. Who am I, Andy?   You are . . . it’s something about science fiction. And a blue hat.  What’s my name?   Come close. Let me look at you . . . oh, it’s on the tip of my tongue. Nacky Martinez? First officer of the Starship Sidewise?  She’s a character, Andy. Made up. Someone I wrote about.   You’re a writer?  Capture 06/17/2051, Kerwin Hospital Assisted Care Facility, 14:47:03  . . . because I was too infatuated to be suspicious about your secret back then. I know you don’t remember this, Andy, but I was stupid in love with you when we were first married. Maybe the augment can’t see that, but anyone who looks at your captures can. On the record, as you would say. So, yeah, the fact that you always wore caps and recorded almost everything that happened to you didn’t bother me back then. I guess I told myself that it was some reputation management scheme that Spaceways had ordered up. And of course, you were writing the sequel to your memoir. What do Mr. and Ms. Space Hero do on their days off? Why look, they sit together on the couch when they write! And she still uses her fingers to type—isn’t that quaint, a science fiction writer still pounding a keyboard in the era of thought recognition!   You never published that book.  No.   Or any other. Why?  You know, people message me about that all the time, like it was some kind of tragedy. I had something to say when I was young and naive. I said it. And pretty damn well: eight livebooks worth. Fifty novas. It’s just that after I met you, I needed to make the most of our time together. And since you launched into the Vincente Event, I’ve been busy being the good wife.   I was the best qualified pilot, Zoe. And I was already compromised, so I had the least to lose. In a crisis like that, there were no easy answers. I consulted with Spaceways and we weighed the tradeoffs and we reached a decision. I had friends on that orbital. Drew Bantry . . .  Drew was already dead. He just hadn’t fallen down yet. And you were not a tradeoff, Andy. You were my fucking husband.   I can see now how hard it must have been for you.  Oh, you saw it then, too. Which is why you never asked my permission, because you knew . . .   Go on.  What the hell were we talking about? How I had no suspicions about what the captures meant. That you were sick. I remember thinking how boring ten thousand hours of unedited recordings were going to be. Even to us, even when we were old. Old and forgetful . . . .   Zoe?  I’m fine. I’m just not feeling very brave today. Anyway, I did have a problem with all the captures of us making love. I mean, the first couple of times, I’ll grant you it was a turn-on. We’d lose ourselves in bed, and then afterwards watch ourselves doing it and sometimes we were so beautifully in sync that we’d get hot and go back for seconds. But what bothered me was that you were capturing us watching the captures. I didn’t get why you would do that. When I realized that recording wasn’t just a once-in-a-while kink, that you wanted to capture us every time we had sex, it wasn’t erotic anymore. It was kind of creepy.   I can’t locate any sex captures after 2045. Did we stop having sex?  No. I just made you check the caps at the bedroom door. So stop looking. You want to know what we were like back then, try scanning some of our private book clubs. We’d both read the same book and then we’d go out to dinner at a nice restaurant and talk about it. I remember being surprised at some of your choices. The Marvelous Land of Oz. Lolita. Wolf Hall. A Visit From the Goon Squad. They didn’t seem like the kinds of reading an Air Force jock would choose. You were a Hemingway and Heinlein kind of guy.   Was I trying to impress you?  I don’t know why. I was already plenty impressed. Maybe you were trying to send me a message with all of those plots about secret pasts and transformations.   Go on. This was where? When?  At first in Brooklyn, where I was living when we met. There’s another reason I should have been suspicious your urgency. You claimed you didn’t care where we lived as long as we spent as much time as possible together. Wasn’t true—you hated cities. But most of my friends were in New York and most of yours had moved to space or Mars. Your folks were dead and your sister had disappeared into some Digitalist coop, waiting for the Singularity. So when my mother died and left me the house in Bedford, we moved up there in the spring of 2045. You had the second installment of your book deal to write and when I switched to your agent, I started seeing celebrity level advances too, so there was plenty of money. By then you were showing early symptoms. You claimed you’d left Spaceways, although you still flew out here to Kerwin five or six times a year for therapy. It seemed to be working, you said we would still have years together. My mom had been into flowers but she had an asparagus patch and some raspberries and you started your first vegetable garden that summer. You were good at it, said you liked it better than space hydroponics. Spinach and lettuce and asparagus in the spring, then beans and corn and summer squash and tomatoes and melons. You were happy, I think. I know I was.  Capture 06/25/2051, Kerwin Hospital Assisted Care Facilty, 16:17:53  . . . you were so skeptical about the Singularity is why.   The Kurzweil augmentation has nothing to do with the Singularity.  Yeah, sure. It’s just a cognitive prosthesis, la-la. A life experience database, la-la-la. An AI mediated memory enhancement that may help restore your loved one’s mental competence la-la-la-dee-da. I’ve browsed all the sites, Andy. Besides, I was writing about this shit before Ray Kurzweil actually uploaded.   Ray Kurzweil is dead. I’m still alive.  Are you, Andy? Are you sure about that?   I don’t know why you are being so cruel, Zoe.  Because you made so many decisions about us without telling me. Maybe you didn’t know just how sick you were when we met, but you could easily have found out. I had a right to know. And maybe you were hoping that you’d never get that call from Spaceways, but you knew exactly what you would do if it did come.   I was an astronaut, Zoe. That was never a secret.  No, what was a secret was all that fucked-up cosmic ray research. Because nobody but crazy people with a death wish would ever have volunteered to go to space if they knew that there was no real protection against getting your telomeres burned off by the radiation. Sure, you can duck and cover from a solar flare, but what about the gajillions of ultra-high energy ions? Theoretically you can generate a magnetic shield. Or maybe you can stuff your astronauts with anti-radiation wonder drugs? But just in case it doesn’t work, better make sure that everyone on the Mars crew is over forty. That way if Captain Kirk falls apart in twenty or thirty years, Spaceways won’t look so bad.   Go on.  I will. Maybe you hadn’t checked out the secret radiation assessments from the first Mars mission when we first met. Maybe you didn’t want to know. But once I was your wife, I did. Let me read the executive summary to you. “Exposure to radiation during the mission has had significant short and long impacts on the central nervous systems of all crew members. Despite best mitigation practices, whole body effective doses ranged from .4 to .7 sieverts. Galactic cosmic radiation in the form of high-mass, energetic ions destroyed an average of 4% of the crew’s cells, while 13% of critical brain regions have likely been compromised. Reports of short term impairments of behavior and cognition were widely noted throughout the three year mission. Longitudinal studies of the astronaut corps point to a significant increase in risk of degenerative brain diseases. In particular, there appears to have been an acceleration of plaque pathology associated with Alzheimer ’s disease.” Let’s do the math, Andy. You get an estimated dose of between .4 to .7 sieverts during your first mission and you go to Mars twice. So call it a sievert and change. Which is why you were one grounded astronaut.   All that’s on the record.  What’s EPA’s maximum yearly dose for a radiation worker here on earth?   I don’t have immediate access to that data. I can look it up.  Yes, you can—it’s on the record. Fifty millisieverts. How about for emergency workers involved in a lifesaving operation?   Zoe, I . . . .  Two hundred and fifty millisieverts.   There are always risks.  For which you make tradeoffs, I get that. So the tradeoff here is X number of years of your life for two tickets to Mars. Which you decided before you met me, so I’ll give you a pass on that. Once you walked me through it, I sort of got how that was the price you paid to become who you wanted to be. Although you waited long enough to let me in on your little secret. But that wasn’t your last tradeoff. Because Spaceways fell down on their project management during the outfitting of Orbital Seven. They didn’t lift enough solar flare shelters to house everybody on the construction crew. So when Professor Vincente predicted an X2 class flare that would cook half the people onboard in a storm of hot protons, management turned to sixty-year old Captain Kirk, even though he’d been grounded. They pointed out that since he didn’t have all that much time before the Alzheimer’s plaques chewed what was left of his memory, maybe he might consider riding the torch one last time to ferry an emergency shelter up to save their corporate asses. Or maybe our Space Hero checked in all on his own and volunteered for their fucking suicide mission.   It wasn’t a suicide mission , Zoe. I came back.  And here you are, Andy. And here I am. But it’s not working.  Capture 06/30/2051, Kerwin Hospital ICU, 11:02:53  . . . or are you too busy with your life review? Ten thousand hours of captures is a lot to digest, even on fast-forward.   The record is eleven thousand two hundred and eighty-four hours long, not including the current capture.  Noted. Find anything worth bookmarking?   It would be a dull movie if it wasn’t all about me.  I heard about your ex yesterday on Newsmelt. I’m sorry. I didn’t realize she’d emigrated to Mars.   Apparently she wanted to get to space as much as I did. I don’t know why I didn’t know that. It’s odd, but none of the pix and vids I have look like her.  You remember her then?   Just flashes, but they’re very vivid. Like she was lit up by a lightning strike.  They’re talking about bringing the rest of the colonists back home.   Maybe. But they’ll have to handcuff them and drag them kicking and screaming onto the relief ships—I know those people. And why bother? Many of them won’t survive the trip back.  Space will kill you any which way it can. You told me that on our third date.   I try not to pay attention. It’s been a long time since there’s been any good news from outer space. I think we need to start over on Mars. The thing to do is capture a comet, hollow it out and use it as a colony ship. The ice shields you from cosmic rays on the outbound. Send the colonists down in landers and then crash the comet. Solves both the water and the radiation problem.  Capture a comet? And how the hell do we do that? With a tractor beam? A magic lasso?   Get your science fiction friends working on it. If it’s crazy enough, the engineers will come sniffing around.  I’ll see what I can do. I met the Zhangs on the way in today. I thought I was your only visitor. We had a nice chat. And the baby was cute. What’s her name again?   Andee. A-N-D double E  That’s what I thought they said. After you.   Kristen was lucky. They pushed her to the front of the line so she was one of the first into the shelter. The last three in got a significant dose. One of them died on the way back down.  Drew Bantry.   They were his people. He waited until they were all safe.  You and he saved a lot of lives that day, Captain Kirk. It’s on the record for all to see.   Enough, Zoe. What do you have for me today?  Apologies.   Go on.  I’m sorry for the way I spoke to you last time. That’s why I missed the last few visits. I don’t trust myself to say the right thing anymore. I can’t filter out my feelings when I see you like this. I just blurt. Spew. It’s not good.   Noted.  But here’s the thing. I don’t think I’ll be accessing your augment after you’re . . . gone. Dead. You know, now I can visit the hospital here, and see you. Your face, your body, arms, hands. But some avatar, no. It’s too hard. There have been times the last few weeks when I felt like you’re here with me, but that’s only because I want you back. But mostly I don’t think this thing that talks to me is you. I’m sorry.   Why not?  There’s still too much missing, even if the augment can review your captures and all that input from before you started wearing the caps. Yes, we can talk about our lives together, but I still have to tell you things you should know. And now you’re cracking jokes, so it’s even harder. How can I tell whether what’s sad or happy or angry is you or clever algorithms? I don’t know, Andy. When are you going to say I love you? How will I know whether you really do, or if it’s just something else you needed to be reminded of?   I do, Zoe. Here, I’ll turn the augment off, so you can hear it from me. From this body, as you say. These lips.  No, honey, you don’t need to . . . .  Capture 06/30/2051, Kerwin Hospital ICU, 11:15:18, Augment disengaged by request   Okay? Here I am. And I know who you are. I do. You’re my famous wife, the writer. Nackey Martinez. You want to go. I don’t want you to go. Give me your hand.  Aye, Captain.   Stay with me. Will you do that?  For a while.   And write more books. You know, about your adventures in space. That’s important. And maybe . . . could get me my snacks? The food here is horrible. You know the ones. Mom always used to make banana slices with a smear of peanut butter when I got home from school. My snacks. Are you crying, Nackey? You’re crying.  Yes. James Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "text": "3820 words, short story\nThe Promise of Space\nCapture 06/15/2051, Kerwin Hospital ICU, 09:12:32\n. . . and my writer pals used to tease that I married Captain Kirk.\nA clarification, please? Are you referring to William Shatner, who died in 2023? Or is this Chris Pine, who was cast in the early remakes? It appears he has retired. Perhaps you mean the new one? Jools Bear?\nNo, you. Kirk Anderson. People used to call you that, remember? First man to set foot on Phobos? Pilot on the Mars landing team? Captain Kirk.\nI do not understand. Clearly I participated in those missions since they are on the record. But I was never captain of anything.\nA joke, Andy. They were teasing you. It’s why you hated your first name.\nNoted. Go on.\nNo, this is impossible. I feel like I’m talking to an intelligent fucking database, not my husband. I don’t know where to begin with you.\nPlease, Zoe. I cannot do this without you. Go on.\nOkay, okay, but do me a favor? Use some contractions, will you? Contractions are your friends.\nNoted.\nDo you know when we met?\nI haven’t yet had the chance to review that capture. We were married in 2043. Presumably we met before that?\nNot much before. Where were you on Saturday, May 17, 2042? Check your captures.\nThe capture shows that I flew from Spaceways headquarters at Spaceport America to the LaGuardia Hub in New York and spent the day in Manhattan at the Metropolitan Museum. That night I gave the keynote address at the Nebula Awards banquet in the Crown Plaza Hotel but my caps were disengaged. The Nebula is awarded each year by the World Science Fiction Writers . . . .\nI was nominated that year for best livebook, Shadows on the Sun. You came up to me at the reception, said you were a fan. That you had all five of my Sidewise series in your earstone when you launched for Mars that first time. You joked you had a thing for Nacky Martinez. I was thrilled and flattered. After all, you were top of the main menu, one of the six hero marsnauts. Things I’d only imagined, you’d actually done. And you’d read my work and you were flirting with me and, holy shit, you were Captain Kirk. When people—friends, famous writers—tried to break into our conversation, they just bounced off us. Nobody remembers who won what award that night, but lots of people still talk about how we locked in.\nI just looked it up. You lost that Nebula.\nYeah. Thanks for reminding me.\nYou had on a hat.\nA hat? Okay. But I always wore hats back then. It was a way to stand out, part of my brand—for all the good it did me. My hair was a three act tragedy anyway, so I wore a lot of hats.\nThis one was a bowler hat. It was blue—midnight blue. With a powder blue band. Thin, I remember the hatband was very thin.\nMaybe. I don’t remember that one. Nice try, though.\nTell me more. What happened next?\nJesus, this is so wrong . . . No, I’m sorry, Andy. Give me your hand. You always had such delicate hands. Such clever fingers.\nI can still remember that my mom had an old Baldwin upright piano that she wanted me to learn to play, but my hands were too small. You’re crying. Are you crying?\nI am not. Just shut up and listen. This isn’t easy and I’m only saying it because maybe the best part of you is still trapped in there like they claim and just maybe this augment really can set it free. So, we were sitting at different tables at the banquet but after it was over, you found me again and asked if I wanted to go out for drinks. We escaped the hotel, looking for a place to be alone, and found a night-shifted Indonesian restaurant with a bar a couple of blocks away. It was called Fatty Prawn or Fatty Crab—Fatty Something. We sat at the bar and switched from alcohol to inhalers and talked. A lot. Pretty much the rest of the night, in fact. Considering that you were a man and famous and ex-Air Force, you were a good listener. You wanted to know how hard it was to get published and where I got my plots and who I like to read. I was impressed that you had read a lot of the classic science fiction old-timers like Kress and LeGuin and Bacigalupi. You told me what I got wrong about living in space, and then raved about stuff in my books that you thought nobody but spacers knew. Around four in the morning we got hungry and since you’d never had Indonesian before, we split a gado-gado salad with egg and tofu. I spent too much time deconstructing my divorce and you were polite about yours. You said your ex griped about how you spent too much time in space, and I made a joke about how Kass would have said the same thing about me. I asked if you were ever scared out there and you said sure, and that landings were worse than the launches because you had so much time leading up to them. You used to wake up on the outbound trips in a sweat. To change the subject, I told you about waking up with entire scenes or story outlines in my head and how I had to get up in the middle of the night and write them down or I would lose them. You made a crack about wanting to see that in person. The restaurant was about to close for the morning and, by that time, dessert sex was definitely on the menu, so I asked if you ever got horny on a mission. That’s how I found out that one of the side effects of the anti-radiation drugs was low testosterone levels. We established that you were no longer taking them. I would have invited you back to my room right then only you told me that you had to catch a seven-twenty flight back to El Paso. There still might have been enough time, except that I was rooming with Rachel van der Haak, and, when we had gotten high before the banquet, we had promised each other we’d steer clear of men while our shields were down. And of course, when I thought about it, there was the awkward fact that you were twenty years older than I was. A girl has got to wonder what’s up with her when she wants to take daddy to bed.\nI am nineteen years and three months older than you.\nAnd then there was your urgency. I mean, you had me at Mars, Mr. Space Hero, but I had the sense that you wanted way more from me than I had to give. All I had in mind was a test drive, but it seemed as if you were already thinking about making a down payment. When you said you could cancel an appearance on Newsmelt so you could be back in New York in three days, it was a serious turn-on, but I was also worried. Blowing off one of the top news sites? For me? Why? I guessed maybe you were running out of time before your next mission. I didn’t realize that you were . . . .\nGo on.\nNo, I can’t. I just can’t—how do I do this? Turn the augment off.\nZoe, please.\nYou hear me? That was the deal. They promised whenever I wanted.\nCapture 06/15/2051, Kerwin Hospital ICU, 09:37:18, Augment disengaged by request\nAndy? Look at me, Andy. Over here. Good. Who am I, Andy?\nYou are . . . it’s something about science fiction. And a blue hat.\nWhat’s my name?\nCome close. Let me look at you . . . oh, it’s on the tip of my tongue. Nacky Martinez? First officer of the Starship Sidewise?\nShe’s a character, Andy. Made up. Someone I wrote about.\nYou’re a writer?\nCapture 06/17/2051, Kerwin Hospital Assisted Care Facility, 14:47:03\n. . . because I was too infatuated to be suspicious about your secret back then. I know you don’t remember this, Andy, but I was stupid in love with you when we were first married. Maybe the augment can’t see that, but anyone who looks at your captures can. On the record, as you would say. So, yeah, the fact that you always wore caps and recorded almost everything that happened to you didn’t bother me back then. I guess I told myself that it was some reputation management scheme that Spaceways had ordered up. And of course, you were writing the sequel to your memoir. What do Mr. and Ms. Space Hero do on their days off? Why look, they sit together on the couch when they write! And she still uses her fingers to type—isn’t that quaint, a science fiction writer still pounding a keyboard in the era of thought recognition!\nYou never published that book.\nNo.\nOr any other. Why?\nYou know, people message me about that all the time, like it was some kind of tragedy. I had something to say when I was young and naive. I said it. And pretty damn well: eight livebooks worth. Fifty novas. It’s just that after I met you, I needed to make the most of our time together. And since you launched into the Vincente Event, I’ve been busy being the good wife.\nI was the best qualified pilot, Zoe. And I was already compromised, so I had the least to lose. In a crisis like that, there were no easy answers. I consulted with Spaceways and we weighed the tradeoffs and we reached a decision. I had friends on that orbital. Drew Bantry . . .\nDrew was already dead. He just hadn’t fallen down yet. And you were not a tradeoff, Andy. You were my fucking husband.\nI can see now how hard it must have been for you.\nOh, you saw it then, too. Which is why you never asked my permission, because you knew . . .\nGo on.\nWhat the hell were we talking about? How I had no suspicions about what the captures meant. That you were sick. I remember thinking how boring ten thousand hours of unedited recordings were going to be. Even to us, even when we were old. Old and forgetful . . . .\nZoe?\nI’m fine. I’m just not feeling very brave today. Anyway, I did have a problem with all the captures of us making love. I mean, the first couple of times, I’ll grant you it was a turn-on. We’d lose ourselves in bed, and then afterwards watch ourselves doing it and sometimes we were so beautifully in sync that we’d get hot and go back for seconds. But what bothered me was that you were capturing us watching the captures. I didn’t get why you would do that. When I realized that recording wasn’t just a once-in-a-while kink, that you wanted to capture us every time we had sex, it wasn’t erotic anymore. It was kind of creepy.\nI can’t locate any sex captures after 2045. Did we stop having sex?\nNo. I just made you check the caps at the bedroom door. So stop looking. You want to know what we were like back then, try scanning some of our private book clubs. We’d both read the same book and then we’d go out to dinner at a nice restaurant and talk about it. I remember being surprised at some of your choices. The Marvelous Land of Oz. Lolita. Wolf Hall. A Visit From the Goon Squad. They didn’t seem like the kinds of reading an Air Force jock would choose. You were a Hemingway and Heinlein kind of guy.\nWas I trying to impress you?\nI don’t know why. I was already plenty impressed. Maybe you were trying to send me a message with all of those plots about secret pasts and transformations.\nGo on. This was where? When?\nAt first in Brooklyn, where I was living when we met. There’s another reason I should have been suspicious your urgency. You claimed you didn’t care where we lived as long as we spent as much time as possible together. Wasn’t true—you hated cities. But most of my friends were in New York and most of yours had moved to space or Mars. Your folks were dead and your sister had disappeared into some Digitalist coop, waiting for the Singularity. So when my mother died and left me the house in Bedford, we moved up there in the spring of 2045. You had the second installment of your book deal to write and when I switched to your agent, I started seeing celebrity level advances too, so there was plenty of money. By then you were showing early symptoms. You claimed you’d left Spaceways, although you still flew out here to Kerwin five or six times a year for therapy. It seemed to be working, you said we would still have years together. My mom had been into flowers but she had an asparagus patch and some raspberries and you started your first vegetable garden that summer. You were good at it, said you liked it better than space hydroponics. Spinach and lettuce and asparagus in the spring, then beans and corn and summer squash and tomatoes and melons. You were happy, I think. I know I was.\nCapture 06/25/2051, Kerwin Hospital Assisted Care Facilty, 16:17:53\n. . . you were so skeptical about the Singularity is why.\nThe Kurzweil augmentation has nothing to do with the Singularity.\nYeah, sure. It’s just a cognitive prosthesis, la-la. A life experience database, la-la-la. An AI mediated memory enhancement that may help restore your loved one’s mental competence la-la-la-dee-da. I’ve browsed all the sites, Andy. Besides, I was writing about this shit before Ray Kurzweil actually uploaded.\nRay Kurzweil is dead. I’m still alive.\nAre you, Andy? Are you sure about that?\nI don’t know why you are being so cruel, Zoe.\nBecause you made so many decisions about us without telling me. Maybe you didn’t know just how sick you were when we met, but you could easily have found out. I had a right to know. And maybe you were hoping that you’d never get that call from Spaceways, but you knew exactly what you would do if it did come.\nI was an astronaut, Zoe. That was never a secret.\nNo, what was a secret was all that fucked-up cosmic ray research. Because nobody but crazy people with a death wish would ever have volunteered to go to space if they knew that there was no real protection against getting your telomeres burned off by the radiation. Sure, you can duck and cover from a solar flare, but what about the gajillions of ultra-high energy ions? Theoretically you can generate a magnetic shield. Or maybe you can stuff your astronauts with anti-radiation wonder drugs? But just in case it doesn’t work, better make sure that everyone on the Mars crew is over forty. That way if Captain Kirk falls apart in twenty or thirty years, Spaceways won’t look so bad.\nGo on.\nI will. Maybe you hadn’t checked out the secret radiation assessments from the first Mars mission when we first met. Maybe you didn’t want to know. But once I was your wife, I did. Let me read the executive summary to you. “Exposure to radiation during the mission has had significant short and long impacts on the central nervous systems of all crew members. Despite best mitigation practices, whole body effective doses ranged from .4 to .7 sieverts. Galactic cosmic radiation in the form of high-mass, energetic ions destroyed an average of 4% of the crew’s cells, while 13% of critical brain regions have likely been compromised. Reports of short term impairments of behavior and cognition were widely noted throughout the three year mission. Longitudinal studies of the astronaut corps point to a significant increase in risk of degenerative brain diseases. In particular, there appears to have been an acceleration of plaque pathology associated with Alzheimer ’s disease.” Let’s do the math, Andy. You get an estimated dose of between .4 to .7 sieverts during your first mission and you go to Mars twice. So call it a sievert and change. Which is why you were one grounded astronaut.\nAll that’s on the record.\nWhat’s EPA’s maximum yearly dose for a radiation worker here on earth?\nI don’t have immediate access to that data. I can look it up.\nYes, you can—it’s on the record. Fifty millisieverts. How about for emergency workers involved in a lifesaving operation?\nZoe, I . . . .\nTwo hundred and fifty millisieverts.\nThere are always risks.\nFor which you make tradeoffs, I get that. So the tradeoff here is X number of years of your life for two tickets to Mars. Which you decided before you met me, so I’ll give you a pass on that. Once you walked me through it, I sort of got how that was the price you paid to become who you wanted to be. Although you waited long enough to let me in on your little secret. But that wasn’t your last tradeoff. Because Spaceways fell down on their project management during the outfitting of Orbital Seven. They didn’t lift enough solar flare shelters to house everybody on the construction crew. So when Professor Vincente predicted an X2 class flare that would cook half the people onboard in a storm of hot protons, management turned to sixty-year old Captain Kirk, even though he’d been grounded. They pointed out that since he didn’t have all that much time before the Alzheimer’s plaques chewed what was left of his memory, maybe he might consider riding the torch one last time to ferry an emergency shelter up to save their corporate asses. Or maybe our Space Hero checked in all on his own and volunteered for their fucking suicide mission.\nIt wasn’t a suicide mission , Zoe. I came back.\nAnd here you are, Andy. And here I am. But it’s not working.\nCapture 06/30/2051, Kerwin Hospital ICU, 11:02:53\n. . . or are you too busy with your life review? Ten thousand hours of captures is a lot to digest, even on fast-forward.\nThe record is eleven thousand two hundred and eighty-four hours long, not including the current capture.\nNoted. Find anything worth bookmarking?\nIt would be a dull movie if it wasn’t all about me.\nI heard about your ex yesterday on Newsmelt. I’m sorry. I didn’t realize she’d emigrated to Mars.\nApparently she wanted to get to space as much as I did. I don’t know why I didn’t know that. It’s odd, but none of the pix and vids I have look like her.\nYou remember her then?\nJust flashes, but they’re very vivid. Like she was lit up by a lightning strike.\nThey’re talking about bringing the rest of the colonists back home.\nMaybe. But they’ll have to handcuff them and drag them kicking and screaming onto the relief ships—I know those people. And why bother? Many of them won’t survive the trip back.\nSpace will kill you any which way it can. You told me that on our third date.\nI try not to pay attention. It’s been a long time since there’s been any good news from outer space. I think we need to start over on Mars. The thing to do is capture a comet, hollow it out and use it as a colony ship. The ice shields you from cosmic rays on the outbound. Send the colonists down in landers and then crash the comet. Solves both the water and the radiation problem.\nCapture a comet? And how the hell do we do that? With a tractor beam? A magic lasso?\nGet your science fiction friends working on it. If it’s crazy enough, the engineers will come sniffing around.\nI’ll see what I can do. I met the Zhangs on the way in today. I thought I was your only visitor. We had a nice chat. And the baby was cute. What’s her name again?\nAndee. A-N-D double E\nThat’s what I thought they said. After you.\nKristen was lucky. They pushed her to the front of the line so she was one of the first into the shelter. The last three in got a significant dose. One of them died on the way back down.\nDrew Bantry.\nThey were his people. He waited until they were all safe.\nYou and he saved a lot of lives that day, Captain Kirk. It’s on the record for all to see.\nEnough, Zoe. What do you have for me today?\nApologies.\nGo on.\nI’m sorry for the way I spoke to you last time. That’s why I missed the last few visits. I don’t trust myself to say the right thing anymore. I can’t filter out my feelings when I see you like this. I just blurt. Spew. It’s not good.\nNoted.\nBut here’s the thing. I don’t think I’ll be accessing your augment after you’re . . . gone. Dead. You know, now I can visit the hospital here, and see you. Your face, your body, arms, hands. But some avatar, no. It’s too hard. There have been times the last few weeks when I felt like you’re here with me, but that’s only because I want you back. But mostly I don’t think this thing that talks to me is you. I’m sorry.\nWhy not?\nThere’s still too much missing, even if the augment can review your captures and all that input from before you started wearing the caps. Yes, we can talk about our lives together, but I still have to tell you things you should know. And now you’re cracking jokes, so it’s even harder. How can I tell whether what’s sad or happy or angry is you or clever algorithms? I don’t know, Andy. When are you going to say I love you? How will I know whether you really do, or if it’s just something else you needed to be reminded of?\nI do, Zoe. Here, I’ll turn the augment off, so you can hear it from me. From this body, as you say. These lips.\nNo, honey, you don’t need to . . . .\nCapture 06/30/2051, Kerwin Hospital ICU, 11:15:18, Augment disengaged by request\nOkay? Here I am. And I know who you are. I do. You’re my famous wife, the writer. Nackey Martinez. You want to go. I don’t want you to go. Give me your hand.\nAye, Captain.\nStay with me. Will you do that?\nFor a while.\nAnd write more books. You know, about your adventures in space. That’s important. And maybe . . . could get me my snacks? The food here is horrible. You know the ones. Mom always used to make banana slices with a smear of peanut butter when I got home from school. My snacks. Are you crying, Nackey? You’re crying.\nYes.\nJames Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "source": "https://clarkesworldmagazine.com/kelly_09_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Promise of Space by James Patrick Kelly"}