{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Carolyn Ives Gilman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VNXHo5/D7ck5P5tE03TgAfKdqTg=", "id": null, "license": null, "comments": "", "raw_text": "18010 words, novella  Umbernight  2019 Finalist: Theodore A. Sturgeon Memorial Award 2019 Finalist: Locus Award for Best Novella There is a note from my great-grandmother in the book on my worktable, they tell me. I haven’t opened it. Up to now I have been too angry at her whole generation, those brave colonists who settled on Dust and left us here to pay the price. But lately, I have begun to feel a little disloyal—not to her, but to my companions on the journey that brought me the book, and gave me the choice whether to read it or not. What, exactly, am I rejecting here—the past or the future?  It was autumn—a long, slow season on Dust. It wasn’t my first autumn, but I’d been too young to appreciate it the first time. I was coming back from a long ramble to the north, with the Make Do Mountains on my right and the great horizon of the Endless Plain to my left. I could not live without the horizon. It puts everything in perspective. It is my soul’s home.  Sorry, I’m not trying to be offensive.  As I said, it was autumn. All of life was seeding, and the air was scented with lost chances and never agains. In our region of Dust, most of the land vegetation is of the dry, bristly sort, with the largest trees barely taller than I am, huddling in the shade of cliffs. But the plants were putting on their party best before Umbernight: big, white blooms on the bad-dog bushes and patches of bitterberries painting the arroyos orange. I knew I was coming home when a black fly bit me. Some of the organisms we brought have managed to survive: insects, weeds, lichen. They spread a little every time I’m gone. It’s not a big victory, but it’s something.  The dogs started barking when I came into the yard in front of Feynman Habitat with my faithful buggy tagging along behind me. The dogs never remember me at first, and always take fright at sight of Bucky. A door opened and Namja looked out. “Michiko’s back!” she shouted, and pretty soon there was a mob of people pouring out of the fortified cave entrance. It seemed as if half of them were shorter than my knees. They stared at me as if I were an apparition, and no wonder: my skin was burned dark from the UV except around my eyes where I wear goggles, and my hair and eyebrows had turned white. I must have looked like Grandmother Winter.  “Quite a crop of children you raised while I was gone,” I said to Namja. I couldn’t match the toddlers to the babies I had left.  “Yes,” she said. “Times are changing.”  I didn’t know what she meant by that, but I would find out.  Everyone wanted to help me unpack the buggy, so I supervised. I let them take most of the sample cases to the labs, but I wouldn’t let anyone touch the topographical information. That would be my winter project. I was looking forward to a good hibernate, snug in a warm cave, while I worked on my map of Dust.  The cargo doors rumbled open and I ordered Bucky to park inside, next to his smaller siblings, the utility vehicles. The children loved seeing him obey, as they always do; Bucky has an alternate career as playground equipment when he’s not with me. I hefted my pack and followed the crowd inside.  There is always a festive atmosphere when I first get back. Everyone crowds around telling me news and asking where I went and what I saw. This time they presented me with the latest project of the food committee: an authentic glass of beer. I think it’s an acquired taste, but I acted impressed.  We had a big, celebratory dinner in the refectory. As a treat, they grilled fillets of chickens and fish, now plentiful enough to eat. The youngsters like it, but I’ve never been able to get used to meat. Afterwards, when the parents had taken the children away, a group of adults gathered around my table to talk. By then, I had noticed a change: my own generation had become the old-timers, and the young adults were taking an interest in what was going on. Members of the governing committee were conspicuously absent.  “Don’t get too comfortable,” Haakon said to me in a low tone.  “What do you mean?” I said.  Everyone exchanged a look. It was Namja who finally explained. “The third cargo capsule from the homeworld is going to land at Newton’s Eye in about 650 hours.”  “But . . . ” I stopped when I saw they didn’t need me to tell them the problem. The timing couldn’t have been worse. Umbernight was just around the corner. Much as we needed that cargo, getting to it would be a gamble with death.  I remember how my mother explained Umbernight to me as a child. “There’s a bad star in the sky, Michiko. We didn’t know it was there at first because there’s a shroud covering it. But sometimes, in winter, the shroud pulls back and we can see its light. Then we have to go inside, or we would die.”  After that, I had nightmares in which I looked up at the sky and there was the face of a corpse hanging there, covered with a shroud. I would watch in terror as the veil would slowly draw aside, revealing rotted flesh and putrid gray jelly eyes, glowing with a deadly unlight that killed everything it touched.  I didn’t know anything then about planetary nebulae or stars that emit in the UV and X-ray spectrum. I didn’t know we lived in a double-star system, circling a perfectly normal G-class star with a very strange, remote companion. I had learned all that by the time I was an adolescent and Umber finally rose in our sky. I never disputed why I had to spend my youth cooped up in the cave habitat trying to make things run. They told me then, “You’ll be all grown up with kids of your own before Umber comes again.” Not true. All grown up, that part was right. No kids.  A dog was nudging my knee under the table, and I kneaded her velvet ears. I was glad the pro-dog faction had won the Great Dog Debate, when the colony had split on whether to reconstitute dogs from frozen embryos. You feel much more human with dogs around. “So what’s the plan?” I asked.  As if in answer, the tall, stooped figure of Anselm Thune came into the refectory and headed toward our table. We all fell silent. “The Committee wants to see you, Mick,” he said.  There are committees for every conceivable thing in Feynman, but when someone says “the Committee,” capital C, it means the governing committee. It’s elected, but the same people have dominated it for years, because no one wants to put up with the drama that would result from voting them out. Just the mention of it put me in a bad mood.  I followed Anselm into the meeting room where the five Committee members were sitting around a table. The only spare seat was opposite Chairman Colby, so I took it. He has the pale skin of a lifelong cave dweller, and thin white hair fringing his bald head.  “Did you find anything useful?” he asked as soon as I sat down. He’s always thought my roving is a waste of time because none of my samples have produced anything useful to the colony. All I ever brought back was more evidence of how unsuited this planet is for human habitation.  I shrugged. “We’ll have to see what the lab says about my biosamples. I found a real pretty geothermal region.”  He grimaced at the word “pretty,” which was why I’d used it. He was an orthodox rationalist, and considered aesthetics to be a gateway drug to superstition. “You’ll fit in well with these gullible young animists we’re raising,” he said. “You and your fairy-tales.”  I was too tired to argue. “You wanted something?” I said.  Anselm said, “Do you know how to get to Newton’s Eye?”  “Of course I do.”  “How long does it take?”  “On foot, about 200 hours. Allow a little more for the buggy, say 220.”  I could see them calculating: there and back, 440 hours, plus some time to unload the cargo capsule and pack, say 450. Was there enough time?  I knew myself how long the nights were getting. Dust is sharply tilted, and at our latitude, its slow days vary from ten hours of dark and ninety hours of light in the summer to the opposite in winter. We were past the equinox; the nights were over sixty hours long, what we call N60. Umber already rose about midnight; you could get a sunburn before dawn. But most of its radiation didn’t reach us yet because of the cloud of dust, gas, and ionized particles surrounding it. At least, that’s our theory about what is concealing the star.  “I don’t suppose the astronomers have any predictions when the shroud will part?” I said.  That set Colby off. “Shroud, my ass. That’s a backsliding anti-rationalist term. Pretty soon you’re going to have people talking about gods and visions, summoning spirits, and rejecting science.”  “It’s just a metaphor, Colby,” I said.  “I’m trying to prevent us from regressing into savagery! Half of these youngsters are already wearing amulets and praying to idols.”  Once again, Anselm intervened. “There is inherent unpredictability about the star’s planetary nebula,” he said. “The first time, the gap appeared at N64.” That is, when night was 64 hours long. “The second time it didn’t come till N70.”  “We’re close to N64 now,” I said.  “Thank you for telling us,” Colby said with bitter sarcasm.  I shrugged and got up to leave. Before I reached the door Anselm said, “You’d better start getting your vehicle in order. If we do this, you’ll be setting out in about 400 hours.”  “Just me?” I said incredulously.  “You and whoever we decide to send.”  “The suicide team?”  “You’ve always been a bad influence on morale,” Colby said.  “I’m just calculating odds like a good rationalist,” I replied. Since I really didn’t want to hear his answer to that, I left. All I wanted then was a hot bath and about twenty hours of sleep.  That was my first mistake. I should have put my foot down right then. They probably wouldn’t have tried it without me.  But the habitat was alive with enthusiasm for fetching the cargo. Already, more people had volunteered than we could send. The main reason was eagerness to find out what our ancestors had sent us. You could barely walk down the hall without someone stopping you to speculate about it. Some wanted seeds and frozen embryos, electronic components, or medical devices. Others wanted rare minerals, smelting equipment, better water filtration. Or something utterly unexpected, some miracle technology to ease our starved existence.  It was the third and last cargo capsule our ancestors had sent by solar sail when they themselves had set out for Dust in a faster ship. Without the first two capsules, the colony would have been wiped out during the first winter, when Umber revealed itself. As it was, only two thirds of them perished. The survivors moved to the cave habitat and set about rebuilding a semblance of civilization. We weathered the second winter better here at Feynman. Now that the third winter was upon us, people were hoping for some actual comfort, some margin between us and annihilation.  But the capsule was preprogrammed to drop at the original landing site, long since abandoned. It might have been possible to reprogram it, but no one wanted to try calculating a different landing trajectory and sending it by our glitch-prone communication system. The other option, the wise and cautious one, was to let the capsule land and just leave it sitting at Newton’s Eye until spring. But we are the descendants of people who set out for a new planet without thoroughly checking it out. Wisdom? Caution? Not in our DNA.  All right, that’s a little harsh. They said they underestimated the danger from Umber because it was hidden behind our sun as well as its shroud when they were making observations from the home planet. And they did pay for their mistake.  I spent the next ten hours unpacking, playing with the dogs, and hanging out in the kitchen. I didn’t see much evidence of pagan drumming in the halls, so I asked Namja what bee had crawled up Colby’s ass. Her eyes rolled eloquently in response. “Come here,” she said.  She led me into the warren of bedrooms where married couples slept and pulled out a bin from under her bed—the only space any of us has for storing private belongings. She dug under a concealing pile of clothes and pulled out a broken tile with a colorful design on the back side—a landscape, I realized as I studied it. A painting of Dust.  “My granddaughter Marigold did it,” Namja said in a whisper.  What the younger generation had discovered was not superstition, but art.  For two generations, all our effort, all our creativity, had gone into improving the odds of survival. Art took materials, energy, and time we didn’t have to spare. But that, I learned, was not why Colby and the governing committee disapproved of it.  “They think it’s a betrayal of our guiding principle,” Namja said.  “Rationalism, you mean?”  She nodded. Rationalism—that universal ethic for which our parents came here, leaving behind a planet that had splintered into a thousand warring sects and belief systems. They were high-minded people, our settler ancestors. When they couldn’t convince the world they were correct, they decided to leave it and found a new one based on science and reason. And it turned out to be Dust.  Now, two generations later, Colby and the governing committee were trying to beat back irrationality.  “They lectured us about wearing jewelry,” Namja said.  “Why?”  “It might inflame sexual instincts,” she said ironically.  “Having a body does that,” I said.  “Not if you’re Colby, I guess. They also passed a resolution against figurines.”  “That was their idea of a problem?”  “They were afraid people would use them as fetishes.”  It got worse. Music and dance were now deemed to have shamanistic origins. Even reciting poetry aloud could start people on the slippery slope to prayer groups and worship.  “No wonder everyone wants to go to Newton’s Eye,” I said.  We held a meeting to decide what to do. We always have meetings, because the essence of rationality is that it needs to be contested. Also because people don’t want responsibility for making a decision.  About 200 people crammed into the refectory—everyone old enough to understand the issue. We no longer had a room big enough for all, a sure sign we were outgrowing our habitat.  From the way the governing committee explained the options, it was clear that they favored the most cautious one—to do nothing at all, and leave the cargo to be fetched by whoever would be around in spring. I could sense disaffection from the left side of the room, where a cohort of young adults stood together. When Colby stopped talking, a lean, intellectual-looking young man named Anatoly spoke up for the youth party.  “What would our ancestors think of us if we let a chance like this slip by?”  Colby gave him a venomous look that told me this was not the first time Anatoly had stood up to authority. “They would think we were behaving rationally,” he said.  “It’s not rational to sit cowering in our cave, afraid of the planet we came to live on,” Anatoly argued. “This cargo could revolutionize our lives. With new resources and technologies, we could expand in the spring, branch out and found satellite communities.”  Watching the Committee, I could tell that this was precisely what they feared. New settlements meant new leaders—perhaps ones like Anatoly, willing to challenge what the old leaders stood for.  “Right now, it’s a waste of our resources,” Anselm said. “We need to focus everything we have on preparing for Umbernight.”  “It’s a waste of resources not to go,” Anatoly countered. “You have a precious resource right here.” He gestured at the group behind him. “People ready and willing to go now. By spring, we’ll all be too old.”  “Believe it or not, we don’t want to waste you either,” said Gwen, a third member of the Committee—although Colby looked like he would have gladly wasted Anatoly without a second thought.  “We’re willing to take the chance,” Anatoly said. “We belong here, on this planet. We need to embrace it, dangers and all. We are more prepared now than ever before. Our scientists have invented X-ray shielding fabric, and coldsuits for temperature extremes. We’ll never be more ready.”  “Well, thank you for your input,” Anselm said. “Anyone else?”  The debate continued, but all the important arguments had been made. I slipped out the back and went to visit Bucky, as if he would have an opinion. “They may end up sending us after all,” I told him in the quiet of his garage. “If only to be rid of the troublemakers.”  The great announcement came about twenty hours later. The Committee had decided to roll the dice and authorize the expedition. They posted the list of six names on bulletin boards all over the habitat. I learned of it when I saw a cluster of people around one, reading. As I came up behind them, D’Sharma exclaimed emotionally, “Oh, this is just plain cruel.” Someone saw me, and D’Sharma turned around. “Mick, you’ve got to bring them all back, you hear?” Then she burst into tears.  I read the list then, but it didn’t explain D’Sharma’s reaction. Anatoly was on it, not surprisingly—but in what seemed like a deliberate snub, he was not to be the leader. That distinction went to a young man named Amal. The rest were all younger generation; I’d known them in passing as kids and adolescents, but I had been gone too much to see them much as adults.  “It’s a mix of expendables and rising stars,” Namja explained to me later in private. “Anatoly, Seabird, and Davern are all people they’re willing to sacrifice, for different reasons. Amal and Edie—well, choosing them shows that the Committee actually wants the expedition to succeed. But we’d all hate to lose them.”  I didn’t need to ask where I fit in. As far as the Committee was concerned, I was in the expendable category.  My first impression of the others came when I was flat on my back underneath Bucky, converting him to run on bottled propane. Brisk footsteps entered the garage and two practical boots came to a halt. “Mick?” a woman’s voice said.  “Under here,” I answered.  She got down on all fours to look under the vehicle. Sideways, I saw a sunny face with close-cropped, dark brown hair. “Hi,” she said, “I’m Edie.”  “I know,” I said.  “I want to talk,” she said.  “We’re talking.”  “I mean face to face.”  We were face to face, more or less, but I supposed she meant upright, so I slid out from under, wiping my oily hands on a rag. We looked at each other across Bucky’s back.  “We’re going to have a meeting to plan out the trip to Newton’s Eye,” she said.  “Okay.” I had already been planning out the trip for a couple work cycles. It’s what I do, plan trips, but normally just for myself.  “Mick, we’re going to be counting on you a lot,” she said seriously. “You’re the only one who’s ever been to Newton’s Eye, and the only one who’s ever seen a winter. The rest of us have lots of enthusiasm, but you’ve got the experience.”  I was impressed by her realism, and—I confess it—a little bit flattered. No one ever credits me with useful knowledge. I had been prepared to cope with a flock of arrogant, ignorant kids. Edie was none of those things.  “Can you bring a map to the meeting? It would help us to know where we’re going.”  My heart warmed. Finally, someone who saw the usefulness of my maps. “Sure,” I said.  “I’ve already been thinking about the food, but camping equipment—we’ll need your help on that.”  “Okay.”  Her face folded pleasantly around her smile. “The rest of us are a talky bunch, so don’t let us drown you out.”  “Okay.”  After she told me the when and where of the meeting, she left, and I realized I hadn’t said more than two syllables at a time. Still, she left me feeling she had understood.  When I arrived at the meeting, the effervescence of enthusiasm triggered my fight or flight reflex. I don’t trust optimism. I stood apart, arms crossed, trying to size up my fellow travelers.  The first thing I realized was that Amal and Edie were an item; they had the kind of companionable, good-natured partnership you see in long-married couples. Amal was a big, relaxed young man who was always ready with a joke to put people at ease, while Edie was a little firecracker of an organizer. I had expected Anatoly to be resentful, challenging Amal for leadership, but he seemed thoroughly committed to the project, and I realized it hadn’t just been a power play—he actually wanted to go. The other two were supposed to be “under-contributors,” as we call them. Seabird—yes, her parents named her that on this planet without either birds or seas—was a plump young woman with unkempt hair who remained silent through most of the meeting. I couldn’t tell if she was sulky, shy, or just scared out of her mind. Davern was clearly unnerved, and made up for it by being as friendly and anxious to ingratiate himself with the others as a lost puppy looking for a master. Neither Seabird nor Davern had volunteered. But then, neither had I, strictly speaking.  Amal called on me to show everyone the route. I had drawn it on a map—a physical map that didn’t require electricity—and I spread it on the table for them to see. Newton’s Eye was an ancient crater basin visible from space. To get to it, we would have to follow the Let’s Go River down to the Mazy Lakes. We would then cross the Damn Right Barrens, climb down the Winding Wall to the Oh Well Valley, and cross it to reach the old landing site. Coming back, it would be uphill all the way.  “Who made up these names?” Anatoly said, studying the map with a frown.  “I did,” I said. “Mostly for my mood on the day I discovered things.”  “I thought the settlers wanted to name everything for famous scientists.”  “Well, the settlers aren’t around anymore,” I said.  Anatoly looked as if he had never heard anything so heretical from one of my generation. He flashed me a sudden smile, then glanced over his shoulder to make sure no one from the governing committee was listening.  “What will it be like, traveling?” Edie asked me.  “Cold,” I said. “Dark.”  She was waiting for more, so I said, “We’ll be traveling in the dark for three shifts to every two in the light. Halfway through night, Umber rises, so we’ll have to wear protective gear. That’s the coldest time, too; it can get cold enough for CO2 to freeze this time of year. There won’t be much temptation to take off your masks.”  “We can do it,” Anatoly said resolutely.  Davern gave a nervous giggle and edged closer to me. “You know how to do this, don’t you, Mick?”  “Well, yes. Unless the shroud parts and Umbernight comes. Then all bets are off. Even I have never traveled through Umbernight.”  “Well, we just won’t let that happen,” Edie said, and for a moment it seemed as if she could actually make the forces of Nature obey.  I stepped back and watched while Edie coaxed them all into making a series of sensible decisions: a normal work schedule of ten hours on, ten hours off; a division of labor; a schedule leading up to departure. Seabird and Davern never volunteered for anything, but Edie cajoled them into accepting assignments without complaint.  When it was over and I was rolling up my map, Edie came over and said to me quietly, “Don’t let Davern latch onto you. He tries to find a protector—someone to adopt him. Don’t fall for it.”  “I don’t have maternal instincts,” I said.  She squeezed my arm. “Good for you.”  If this mission were to succeed, I thought, it would be because of Edie.  Which is not to say that Amal wasn’t a good leader. I got to know him when he came to me for advice on equipment. He didn’t have Edie’s extrovert flair, but his relaxed manner could put a person at ease, and he was methodical about thinking things through. Together, we compiled a daunting list of safety tents, heaters, coldsuits, goggles, face masks, first aid, and other gear; then when we realized that carrying all of it would leave Bucky with no room for the cargo we wanted to haul back, we set about ruthlessly cutting out everything that wasn’t essential for survival.  He challenged me on some things. “Rope?” he said skeptically. “A shovel?”  “Rationality is about exploiting the predictable,” I said. “Loose baggage and a mired-down vehicle are predictable.”  He helped me load up Bucky for the trip out with a mathematical precision, eliminating every wasted centimeter. On the way back, we would have to carry much of it on our backs.  I did demand one commitment from Amal. “If Umbernight comes, we need to turn around and come back instantly, no matter what,” I said.  At first he wouldn’t commit himself.  “Have you ever heard what happened to the people caught outside during the first Umbernight?” I asked him. “The bodies were found in spring, carbonized like statues of charcoal. They say some of them shed tears of gasoline, and burst into flame as soon as a spark hit them.”  He finally agreed.  You see, I wasn’t reckless. I did some things right—as right as anyone could have done in my shoes.  When we set out just before dawn, the whole of Feynman Habitat turned out to see us off. There were hugs and tears, then waves and good wishes as I ordered Bucky to start down the trail. It took only five minutes for Feynman to drop behind us, and for the true immensity of Dust to open up ahead. I led the way down the banks of a frozen rivulet that eventually joined the Let’s Go River; as the morning warmed it would begin to gurgle and splash.  “When are we stopping for lunch?” Seabird asked.  “You’re not hungry already, are you?” Edie said, laughing.  “No, I just want to know what the plan is.”  “The plan is to walk till we’re tired and eat when we’re hungry.”  “I’d rather have a time,” Seabird insisted. “I want to know what to expect.”  No one answered her, so she glowered as she walked.  It did not take long for us to go farther from the habitat than any of them had ever been. At first they were elated at the views of the river valley ahead; but as their packs began to weigh heavier and their feet to hurt, the high spirits faded into dogged determination. After a couple of hours, Amal caught up with me at the front of the line.  “How far do we need to go this tenhour?”  “We need to get to the river valley. There’s no good place to pitch the tent before that.”  “Can we take a break and stay on schedule?”  I had already planned on frequent delays for the first few days, so I said, “There’s a nice spot ahead.”  As soon as we reached it, Amal called a halt, and everyone dropped their packs and kicked off their boots. I warned them not to take off their UV-filtering goggles. “You can’t see it, but Umber hasn’t set yet. You don’t want to come back with crispy corneas.”  I went apart to sit on a rock overlooking the valley, enjoying the isolation. Below me, a grove of lookthrough trees gestured gently in the wind, their leaves like transparent streamers. Like most plants on Dust, they are gray-blue, not green, because life here never evolved chloroplasts for photosynthesis. It is all widdershins life—its DNA twirls the opposite direction from ours. That makes it mostly incompatible with us.  Before long, Anatoly came to join me.  “That valley ahead looks like a good place for a satellite community in the spring,” he said. “What do you think, could we grow maize there?”  The question was about more than agronomy. He wanted to recruit me into his expansion scheme. “You’d need a lot of shit,” I said.  I wasn’t being flippant. Dumping sewage was how we had created the soil for the outdoor gardens and fields around Feynman. Here on Dust, sewage is a precious, limited resource.  He took my remark at face value. “It’s a long-range plan. We can live off hydroponics at first.”  “There’s a long winter ahead,” I said.  “Too long,” he said. “We’re bursting at the seams now, and our leaders can only look backward. That’s why the Committee has never supported your explorations. They think you’re wasting time because you’ve never brought back anything but knowledge. That’s how irrational they are.”  He was a good persuader. “You know why I like being out here?” I said. “You have to forget all about the habitat, and just be part of Dust.”  “That means you’re one of us,” Anatoly said seriously. “The governing committee, they are still fighting the battles of the homeworld. We’re the first truly indigenous generation. We’re part of this planet.”  “Wait until you’ve seen more of it before you decide for sure.”  I thought about Anatoly’s farming scheme as we continued on past his chosen site. It would be hard to pull off, but not impossible. I would probably never live to see it thrive.  The sun was blazing from the southern sky by the time we made camp on the banks of the Let’s Go. Edie recruited Davern to help her cook supper, though he seemed to be intentionally making a mess of things so that he could effusively praise her competence. She was having none of it. Amal and Anatoly worked on setting up the sleeping tent. It was made from a heavy, radiation-blocking material that was one of our lab’s best inventions. I puttered around aiming Bucky’s solar panels while there was light to collect, and Seabird lay on the ground, evidently too exhausted to move.  She sat up suddenly, staring at some nearby bushes. “There’s something moving around over there.”  “I don’t think so,” I said, since we are the only animal life on Dust.  “There is!” she said tensely.  “Well, check it out, then.”  She gave me a resentful look, but heaved to her feet and went to look in the bushes. I heard her voice change to that cooing singsong we use with children and animals. “Come here, girl! What are you doing here? Did you follow us?”  With horror, I saw Sally, one of the dogs from Feynman, emerge from the bushes, wiggling in delight at Seabird’s welcome.  “Oh my God!” I exclaimed. The dire profanity made everyone turn and stare. No one seemed to understand. In fact, Edie called out the dog’s name and it trotted over to her and stuck its nose eagerly in the cooking pot. She laughed and pushed it away.  Amal had figured out the problem. “We can’t take a dog; we don’t have enough food. We’ll have to send her back.”  “How, exactly?” I asked bitterly.  “I can take her,” Seabird volunteered.  If we allowed that, we would not see Seabird again till we got back.  “Don’t feed her,” Anatoly said.  Both Edie and Seabird objected to that. “We can’t starve her!” Edie said.  I was fuming inside. I half suspected Seabird of letting the dog loose to give herself an excuse to go back. It would have been a cunning move. As soon as I caught myself thinking that way, I said loudly, “Stop!”  They all looked at me, since I was not in the habit of giving orders. “Eat first,” I said. “No major decisions on an empty stomach.”  While we ate our lentil stew, Sally demonstrated piteously how hungry she was. In the end, Edie and Seabird put down their bowls for Sally to finish off.  “Is there anything edible out here?” Edie asked me.  “There are things we can eat, but not for the long run,” I said. “We can’t absorb their proteins. And the dog won’t eat them if she knows there is better food.”  Anatoly had rethought the situation. “She might be useful. We may need a threat detector.”  “Or camp cleanup services,” Edie said, stroking Sally’s back.  “And if we get hungry enough, she’s food that won’t spoil,” Anatoly added.  Edie and Seabird objected strenuously.  I felt like I was reliving the Great Dog Debate. They weren’t old enough to remember it. The arguments had been absurdly pseudo-rational, but in the end it had boiled down to sentiment. Pretty soon someone would say, “If the ancestors hadn’t thought dogs would be useful they wouldn’t have given us the embryos.”  Then Seabird said it. I wanted to groan.  Amal was trying to be leaderly, and not take sides. He looked at Davern. “Don’t ask me,” Davern said. “It’s not my responsibility.”  He looked at me then. Of course, I didn’t want to harm the dog; but keeping her alive would take a lot of resources. “You don’t know yet what it will be like,” I said.  Amal seized on my words. “That’s right,” he said, “we don’t have enough information. Let’s take another vote in thirty hours.” It was the perfect compromise: the decision to make no decision.  Of course, the dog ended up in the tent with the rest of us as we slept.  Stupid! Stupid! Yes, I know. But also kind-hearted and humane in a way my hardened pioneer generation could not afford to be. It was as if my companions were recovering a buried memory of what it had once been like to be human.  The next tenhours’ journey was a pleasant stroll down the river valley speckled with groves of lookthrough trees. Umber had set and the sun was still high, so we could safely go without goggles, the breeze blowing like freedom on our faces. Twenty hours of sunlight had warmed the air, and the river ran ice-free at our side. We threw sticks into it for Sally to dive in and fetch.  We slept away another tenhour, and rose as the sun was setting. From atop the hill on which we had camped, we could see far ahead where the Let’s Go flowed into the Mazy Lakes, a labyrinth of convoluted inlets, peninsulas, and islands. In the fading light I carefully reviewed my maps, comparing them to what I could see. There was a way through it, but we would have to be careful not to get trapped.  As night deepened, we began to pick our way by lantern-light across spits of land between lakes. Anatoly kept thinking he saw faster routes, but Amal said, “No, we’re following Mick.” I wasn’t sure I deserved his trust. A couple of times I took a wrong turn and had to lead the way back.  “This water looks strange,” Amal said, shining his lantern on the inky surface. There was a wind blowing, but no waves. It looked like black gelatin.  The dog, thinking she saw something in his light, took a flying leap into the lake. When she broke the surface, it gave a pungent fart that made us groan and gag. Sally floundered around, trying to find her footing in a foul substance that was not quite water, not quite land. I was laughing and trying to hold my breath at the same time. We fled to escape the overpowering stench. Behind us, the dog found her way onto shore again, and got her revenge by shaking putrid water all over us.  “What the hell?” Amal said, covering his nose with his arm.  “Stromatolites,” I explained. They looked at me as if I were speaking ancient Greek—which I was, in a way. “The lakes are full of bacterial colonies that form thick mats, decomposing as they grow.” I looked at Edie. “They’re one of the things on Dust we can actually eat. If you want to try a stromatolite steak, I can cut you one.” She gave me the reaction I deserved.  After ten hours, we camped on a small rise surrounded by water on north and south, and by stars above. The mood was subdued. In the perpetual light, it had been easy to feel we were in command of our surroundings. Now, the opaque ceiling of the sky had dissolved, revealing the true immensity of space. I could tell they were feeling how distant was our refuge. They were dwarfed, small, and very far from home.  To my surprise, Amal reached into his backpack and produced, of all things, a folding aluminum mandolin. After all our efforts to reduce baggage, I could not believe he had wasted the space. But he assembled and tuned it, then proceeded to strum some tunes I had never heard. All the others seemed to know them, since they joined on the choruses. The music defied the darkness as our lantern could not.  “Are there any songs about Umbernight?” I asked when they paused.  Strumming softly, Amal shook his head. “We ought to make one.”  “It would be about the struggle between light and unlight,” Edie said.  “Or apocalypse,” Anatoly said. “When Umber opens its eye and sees us, only the just survive.”  Their minds moved differently than mine, or any of my generation’s. They saw not just mechanisms of cause and effect, but symbolism and meaning. They were generating a literature, an indigenous mythology, before my eyes. It was dark, like Dust, but with threads of startling beauty.  We woke to darkness. The temperature had plummeted, so we pulled on our heavy coldsuits. They were made from the same radiation-blocking material as our tent, but with thermal lining and piezoelectric heating elements so that if we kept moving, we could keep warm. The visored hoods had vents with micro-louvers to let us breathe, hear, and speak without losing too much body heat.  “What about the dog?” Amal asked. “We don’t have a coldsuit for her.”  Edie immediately set to work cutting up some of the extra fabric we had brought for patching things. Amal tried to help her wrap it around Sally and secure it with tape, but the dog thought it was a game, and as their dog-wrestling grew desperate, they ended up collapsing in laughter. I left the tent to look after Bucky, and when I next saw Sally she looked like a dog mummy with only her eyes and nose poking through. “I’ll do something better when we stop next,” Edie pledged.  The next tenhour was a slow, dark trudge through icy stromatolite bogs. When the water froze solid enough to support the buggy, we cut across it to reach the edge of the Mazy Lakes, pushing on past our normal camping time. Once on solid land, we were quick to set up the tent and the propane stove to heat it. Everyone crowded inside, eager to shed their coldsuits. Taking off a coldsuit at the end of the day is like emerging from a stifling womb, ready to breathe free.  After lights out, I was already asleep when Seabird nudged me. “There’s something moving outside,” she whispered.  “No, there’s not,” I muttered. She was always worried that we were deviating from plan, or losing our way, or not keeping to schedule. I turned over to go back to sleep when Sally growled. Something hit the roof of the tent. It sounded like a small branch falling from a tree, but there were no trees where we had camped.  “Did you hear that?” Seabird hissed.  “Okay, I’ll check it out.” It was hard to leave my snug sleep cocoon and pull on the coldsuit again—but better me than her, since she would probably imagine things and wake everyone.  It was the coldest part of night, and there was a slight frost of dry ice on the rocks around us. Everything in the landscape was motionless. Above, the galaxy arched, a frozen cloud of light. I shone my lamp on the tent to see what had hit it, but there was nothing. All was still.  In the eastern sky, a dim, gray smudge of light was rising over the lakes. Umber. I didn’t stare long, not quite trusting the UV shielding on my faceplate, but I didn’t like the look of it. I had never read that the shroud began to glow before it parted, but the observations from the last Umbernight were not detailed, and there were none from the time before that. Still, I crawled back into the safety of the tent feeling troubled.  “What was it?” Seabird whispered.  “Nothing.” She would think that was an evasion, so I added, “If anything was out there, I scared it off.”  When we rose, I left the tent first with the UV detector. The night was still just as dark, but there was no longer a glow in the east, and the increase of radiation was not beyond the usual fluctuations. Nevertheless, I quietly mentioned what I had seen to Amal.  “Are you sure it’s significant?” he said.  I wasn’t sure of anything, so I shook my head.  “I’m not going to call off the mission unless we’re sure.”  I probably would have made the same decision. At the time, there was no telling whether it was wise or foolish.  Bucky was cold after sitting for ten hours, and we had barely started when a spring in his suspension broke. It took me an hour to fix it, working awkwardly in my bulky coldsuit, but we finally set off. We had come to the Damn Right Barrens, a rocky plateau full of the ejecta from the ancient meteor strike that had created Newton’s Eye. The farther we walked, the more rugged it became, and in the dark it was impossible to see ahead and pick out the best course.  Davern gave a piteous howl of pain, and we all came to a stop. He had turned his ankle. There was no way to examine it without setting up the tent, so Amal took some of the load from the buggy and carried it so Davern could ride. After another six hours of struggling through the boulders, I suggested we camp and wait for daybreak. “We’re ahead of schedule,” I said. “It’s wiser to wait than to risk breaking something important.”  “My ankle’s not important?” Davern protested.  “Your ankle will heal. Bucky’s axle won’t.”  Sulkily, he said, “You ought to marry that machine. You care more for it than any person.”  I would have answered, but I saw Edie looking at me in warning, and I knew she would give him a talking-to later on.  When we finally got a look at Davern’s ankle inside the tent, it was barely swollen, and I suspected him of malingering for sympathy. But rather than have him slow us down, we all agreed to let him ride till it got better.  Day came soon after we had slept. We tackled the Damn Right again, moving much faster now that we could see the path. I made them push on till we came to the edge of the Winding Wall.  Coming on the Winding Wall is exhilarating or terrifying, depending on your personality. At the end of an upward slope the world drops suddenly away, leaving you on the edge of sky. Standing on the windy precipice, you have to lean forward to see the cliffs plunging nearly perpendicular to the basin of the crater three hundred meters below. To right and left, the cliff edge undulates in a snaky line that forms a huge arc vanishing into the distance—for the crater circle is far too wide to see across.  “I always wish for wings here,” I said as we lined the edge, awestruck.  “How are we going to get down?” Edie asked.  “There’s a way, but it’s treacherous. Best to do it fresh.”  “We’ve got thirty hours of light left,” Amal said.  “Then let’s rest up.”  It was noon when we rose, and Umber had set. I led the way to the spot where a ravine pierced the wall. Unencumbered by coldsuits, we were far more agile, but Bucky still had only four wheels and no legs. We unloaded him in order to use the cart bed as a ramp, laying it over the rugged path so he could pass, and ferrying the baggage by hand, load after load. Davern was forced to go by foot when it got too precarious, using a tent pole for a cane.  It was hard, sweaty work, but twelve hours later we were at the bottom, feeling triumphant. We piled into the tent and slept until dark.  The next leg of the journey was an easy one over the sandy plain of the crater floor. Through the dark we walked then slept, walked then slept, until we started seeing steam venting from the ground as we reached the geothermically active region at the center of the crater. Here we came on the remains of an old road built by the original settlers when they expected to be staying at Newton’s Eye. It led through the hills of the inner crater ring. When we paused at the top of the rise, I noticed the same smudge of light in the sky I had seen before. This time, I immediately took a UV reading, and the levels had spiked. I showed it to Amal.  “The shroud’s thinning,” I said.  I couldn’t read his expression through the faceplate of his coldsuit, but his body language was all indecision. “Let’s take another reading in a couple hours,” he said.  We did, but there was no change.  We were moving fast by now, through a landscape formed by old eruptions. Misshapen claws of lava reached out of the darkness on either side, frozen in the act of menacing the road. At last, as we were thinking of stopping, we spied ahead the shape of towering ribs against the stars—the remains of the settlers’ original landing craft, or the parts of it too big to cannibalize. With our goal so close, we pushed on till we came to the cleared plain where it lay, the fossil skeleton of a monster that once swam the stars.  We all stood gazing at it, reluctant to approach and shatter its isolation. “Why don’t we camp here?” Edie said.  We had made better time than I had expected. The plan had been to arrive just as the cargo capsule did, pick up the payload, and head back immediately; but we were a full twenty hours early. We could afford to rest.  I woke before the others, pulled on my protective gear, and went outside to see the dawn. The eastern sky glowed a cold pink and azure. The landing site was a basin of black volcanic rock. Steaming pools of water made milky with dissolved silicates dappled the plain, smelling of sodium bicarbonate. As I watched the day come, the pools turned the same startling blue as the sky, set like turquoise in jet.  The towering ribs of the lander now stood out in the strange, desolate landscape. I thought of all the sunrises they had seen—each one a passing fragment of time, a shard of a millennium in which this one was just a nanosecond of nothing.  Behind me, boots crunched on cinders. I turned to see that Amal had joined me. He didn’t greet me, just stood taking in the scene.  At last he said, “It’s uplifting, isn’t it?”  Startled, I said, “What is?”  “That they came all this way for the sake of reason.”  Came all this way to a desolation of rock and erosion stretching to the vanishing point—no, uplifting was not a word I would use. But I didn’t say so.  He went back to the tent to fetch the others, and soon I was surrounded by youthful energy that made me despise my own sclerotic disaffection. They all wanted to go explore the ruins, so I waved them on and returned to the tent to fix my breakfast.  After eating, I went to join them. I found Seabird and Davern bathing in one of the hot pools, shaded by an awning constructed from their coldsuits. “You’re sure of the chemicals in that water, are you?” I asked.  “Oh stop worrying,” Davern said. “You’re just a walking death’s-head, Mick. You see danger everywhere.”  Ahead, the other three were clustered under the shadow of the soaring ship ribs. When I came up, I saw they had found a stone monument, and were standing silently before it, the hoods of their coldsuits thrown back. Sally sat at Edie’s feet.  “It’s a memorial to everyone who died in the first year,” Edie told me in a hushed voice.  “But that’s not the important part,” Anatoly said intently. He pointed to a line of the inscription, a quotation from Theodore Cam, the legendary leader of the exiles. It said:  Gaze into the unknowable from a bridge of evidence.  “You see?” Anatoly said. “He knew there was something unknowable. Reason doesn’t reach all the way. There are other truths. We were right, there is more to the universe than just the established facts.”  I thought back to Feynman Habitat, and how the pursuit of knowledge had contracted into something rigid and dogmatic. No wonder my generation had failed to inspire. I looked up at the skeleton of the spacecraft making its grand, useless gesture to the sky. How could mere reason compete with that?  After satisfying my curiosity, I trudged back to the tent. From a distance I heard a whining sound, and when I drew close I realized it was coming from Bucky. Puzzled, I rummaged through his load to search for the source. When I realized what it was, my heart pulsed in panic. Instantly, I put up the hood on my coldsuit and ran to warn the others.  “Put on your coldsuits and get back to the tent!” I shouted at Seabird and Davern. “Our X-ray detector went off. The shroud has parted.”  Umber was invisible in the bright daylight of the western sky, but a pulse of X-rays could only mean one thing.  When I had rounded them all up and gotten them back to the shielded safety of the tent, we held a council.  “We’ve got to turn around and go back, this instant,” I said.  There was a long silence. I turned to Amal. “You promised.”  “I promised we’d turn back if Umbernight came on our way out,” he said. “We’re not on the way out any longer. We’re here, and it’s only ten hours before the capsule arrives. We’d be giving up in sight of success.”  “Ten hours for the capsule to come, another ten to get it unpacked and reloaded on Bucky,” I pointed out. “If we’re lucky.”  “But Umber sets soon,” Edie pointed out. “We’ll be safe till it rises again.”  I had worked it all out. “By that time, we’ll barely be back to the Winding Wall. We have to go up that path this time, bathed in X-rays.”  “Our coldsuits will shield us,” Anatoly said. “It will be hard, but we can do it.”  The trip up to now had been too easy; it had given them inflated confidence.  Anatoly looked around at the others, his face fierce and romantic with a shadow of black beard accentuating his jawline. “I’ve realized now, what we’re doing really matters. We’re not just fetching baggage. We’re a link to the settlers. We have to live up to their standards, to their . . . heroism.” He said the last word as if it were unfamiliar—as indeed it was, in the crabbed pragmatism of Feynman Habitat.  I could see a contagion of inspiration spreading through them. Only I was immune.  “They died,” I said. “Two thirds of them. Didn’t you read that monument?”  “They didn’t know what we do,” Amal argued. “They weren’t expecting Umbernight.”  Anatoly saw I was going to object, and spoke first. “Maybe some of us will die, too. Maybe that is the risk we need to take. They were willing, and so am I.”  He was noble, committed, and utterly serious.  “No one wants you to die!” I couldn’t keep the frustration from my voice. “Your dying would be totally useless. It would only harm the rest of us. You need to live. Sorry to break it to you.”  They were all caught up in the kind of crazy courage that brought the settlers here. They all felt the same devotion to a cause, and they hadn’t yet learned that the universe doesn’t give a rip.  “Listen,” I said, “you’ve got to ask yourself, what’s a win here? Dying is not a win. Living is a win, even if it means living with failure.”  As soon as I said the last word, I could see it was the wrong one.  “Let’s vote,” said Amal. “Davern, what about you? You haven’t said anything.”  Davern looked around at the others, and I could see he was sizing up who to side with. “I’m with Anatoly,” he said. “He understands us.”  Amal nodded as if this made sense. “How about you, Seabird?”  She looked up at Anatoly with what I first thought was admiration—then I realized it was infatuation. “I’ll follow Anatoly,” she said with feeling.  The followers in our group had chosen Anatoly as their leader.  “I vote with Anatoly, too,” said Amal. “I think we’ve come this far, it would be crazy to give up now. Edie?”  “I respect Mick’s advice,” she said thoughtfully. “But our friends back home are counting on us, and in a way the settlers are counting on us, too. All those people died so we could be here, and to give up would be like letting them down.”  I pulled up the hood of my coldsuit and headed out of the tent. Outside, the day was bright and poisonous. The coldsuit shielded me from the X-rays, but not from the feeling of impending disaster. I looked across to the skeletal shipwreck and wondered: what are we doing here on Dust? The settlers chose this, but none of us asked to be born here, exiled from the rest of humanity, like the scum on the sand left by the highest wave. We aren’t noble pioneers. We’re only different from the bacteria because we are able to ask what the hell this is all about. Not answer, just ask.  Someone came out of the tent behind me, and I looked to see who it was this time. Edie. She came to my side. “Mick, we are so thankful that you’re with us,” she said. “We do listen to you. We just agreed to go to a twelve-hour work shift on the way back, to speed things up. We’ll get back.”  I truly wished she weren’t here. She was the kind of person who ought to be protected, so she could continue to bring cheer to the world. She was too valuable to be thrown away.  “It’s not about me,” I said. “I’ve got less life to lose than the rest of you.”  “No one’s going to lose their lives,” she said. “I promise.”  Why can’t I quit asking what more I could have done? I’m tired of that question. I still don’t know what else there was to do.  Ten hours later, there was no sign of the supply ship. Everyone was restless. We had slept and risen again, and now we scanned the skies every few minutes, hoping to see something.  Edie looked up from fashioning little dog goggles and said, “Do you suppose it’s landed somewhere else?” Once she had voiced the idea, it became our greatest worry. What if our assumption about the landing spot was wrong? We told ourselves it was just that the calculations had been off, or the ship was making an extra orbit. Now that we had made the commitment to stay, no one wanted to give up; but how long were we prepared to wait?  In the end, we could not have missed the lander’s descent. It showed up first as a bright spot in the western sky. Then it became a fiery streak, and we saw the parachutes bloom. Seconds later, landing rockets fired. We cheered as, with a roar that shook the ground, the craft set down in a cloud of dust barely a kilometer from us. As the warm wind buffeted us, even I felt that the sight had been worth the journey.  By the time we had taken down the tent, loaded everything on Bucky, and raced over to the landing site, the dust had settled and the metal cooled. It was almost sunset, so we worked fast in the remaining light. One team unloaded everything from Bucky while another team puzzled out how to open the cargo doors. The inside of the spacecraft was tightly packed with molded plastic cases we couldn’t work out how to open, so we just piled them onto the buggy as they came out. We would leave the thrill of discovery to our friends back home.  Bucky was dangerously overloaded before we had emptied the pod, so we reluctantly secured the doors with some of the crates still inside to stay the winter at Newton’s Eye. We could only hope that we had gotten the most important ones.  There was still a lot of work to do, sorting out our baggage and redistributing it, and we worked by lamplight into the night. By the time all was ready, we were exhausted. Umber had not yet risen, so there was no need to set up the tent, and we slept on the ground in the shadow of the lander. I was so close that I could reach out and touch something that had come all the way from the homeworld.  We set out into the night as soon as we woke. Bucky creaked and groaned, but I said encouraging words to him, and he seemed to get used to his new load. All of us were more heavily laden now, and the going would have been slower even if Bucky could have kept up his usual pace. When we reached the top of the inner crater ring we paused to look back at the plain where two spacecraft now stood. In the silence of our tribute, the X-ray alarm went off. Invisible through our UV-screening faceplates, Umber was rising in the east. Umbernight was ahead.  We walked in silence. Sally hung close to us in her improvised coldsuit, no longer roving and exploring. From time to time she froze in her tracks and gave a low growl. But nothing was there.  “What’s she growling at, X-rays?” Anatoly said.  “She’s just picking up tension from us,” Edie said, reaching down to pat the dog’s back.  Half a mile later, Sally lunged forward, snapping at the air as if to bite it. Through the cloth of her coldsuit, she could not have connected with anything, even if anything had been there.  “Now I’m picking up on her tension,” Davern said.  “Ouch! Who did that?” Seabird cried out, clutching her arm. “Somebody hit me.”  “Everyone calm down,” Edie said. “Look around you. There’s nothing wrong.”  She shone her lamp all around, and she was right; the scene looked exactly as it had when we had traversed it before—a barren, volcanic plain pocked with steaming vents and the occasional grove of everlive trees. The deadly radiation was invisible.  Another mile farther on, Amal swore loudly and slapped his thigh as if bitten by a fly. He bent over to inspect his coldsuit and swore again. “Something pierced my suit,” he said. “There’s three pinholes in it.”  Sally started barking. We shone our lights everywhere, but could see nothing.  It was like being surrounded by malicious poltergeists that had gathered to impede our journey. I quieted the dog and said, “Everyone stop and listen.”  At first I heard nothing but my own heart. Then, as we kept still, it came: a rustling of unseen movement in the dark all around us.  “We’ve got company,” Anatoly said grimly.  I wanted to deny my senses. For years I had been searching for animal life on Dust, and found none—not even an insect, other than the ones we brought. And how could anything be alive in this bath of radiation? It was scientifically impossible.  We continued on more carefully. After a while, I turned off my headlamp and went out in front to see if I could see anything without the glare of the light. At first there was nothing, but as my eyes adjusted, something snagged my attention out of the corner of my eye. It was a faint, gauzy curtain—a net hanging in the air, glowing a dim blue-gray. It was impossible to tell how close it was—just before my face, or over the next hill? I swept my arm out to disturb it, but touched nothing. So either it was far away, or it was inside my head.  Something slapped my faceplate, and I recoiled. There was a smear of goo across my visor. I tried to wipe it off, and an awful smell from my breathing vent nearly gagged me. Behind me, Amal gave an exclamation, and I thought he had smelled it too, but when I turned to see, he was looking at his foot.  “I stepped on something,” he said. “I could feel it crunch.”  “What’s that disgusting smell?” Davern said.  “Something slimed me,” I answered.  “Keep on going, everyone,” Edie said. “We can’t stop to figure it out.”  We plodded on, a slow herd surrounded by invisible tormentors. We had not gotten far before Amal had to stop because his boot was coming apart. We waited while he wrapped mending tape around it, but that lasted only half an hour before the sole of his boot was flapping free again. “I’ve got to stop and fix this, or my foot will freeze,” he said.  We were all a little grateful to have an excuse to set up the tent and stop our struggle to continue. Once inside, we found that all of our coldsuits were pierced with small cuts and pinholes. We spent some time repairing them, then looked at each other to see who wanted to continue.  “What happens if we camp while Umber is in the sky, and only travel by day?” Edie finally asked.  I did a quick calculation. “It would add another 300 hours. We don’t have food to last.”  “If we keep going, our coldsuits will be cut to ribbons,” Davern said.  “If only we could see what’s attacking us!” Edie exclaimed.  Softly, Seabird said, “It’s ghosts.” We all fell silent. I looked at her, expecting it was some sort of joke, but she was deadly serious. “All those people who died,” she said.  At home, everyone would have laughed and mocked her. Out here, no one replied.  I pulled up the hood of my coldsuit and rose.  “Where are you going?” Davern said.  “I want to check out the lookthrough trees.” In reality, I wanted some silence to think.  “What a time to be botanizing!” Davern exclaimed.  “Shut up, Davern,” Amal said.  Outside, in the empty waste, I had a feeling of being watched. I shook it off. When we had camped, I had noticed that a nearby grove of lookthrough trees was glowing in the dark, shades of blue and green. I picked my way across the rocks toward them. I suspected that the fluorescence was an adaptation that allowed them to survive the hostile conditions of Umbernight, and I wanted some samples. When I reached the grove and examined one of the long, flat leaves under lamplight, it looked transparent, as usual. Shutting my lamp off, I held it up and looked through it. With a start, I pressed it to my visor so I could see through the leaf.  What looked like a rocky waste by the dim starlight was suddenly a brightly lit landscape. And everywhere I looked, the land bloomed with organic shapes unlike any I had ever seen. Under a rock by my feet was a low, domed mound pierced with holes like an overturned colander, glowing from within. Beneath the everlives were bread-loaf-shaped growths covered with plates that slid aside as I watched, to expose a hummocked mound inside. There were things with leathery rinds that folded out like petals to collect the unlight, which snapped shut the instant I turned on my lamp. In between the larger life-forms, the ground was crawling with smaller, insect-sized things, and in the distance I could see gauzy curtains held up by gas bladders floating on the wind.  An entire alternate biota had sprung to life in Umberlight. Dust was not just the barren place we saw by day, but a thriving dual ecosystem, half of which had been waiting as spores or seeds in the soil, to be awakened by Umber’s radiation. I knelt down to see why they had been so invisible. By our light, some of them were transparent as glass. Others were so black they blended in with the rock. By Umberlight, they lit up in bright colors, reflecting a spectrum we could not see.  I looked down at the leaf that had given me new sight. It probably had a microstructure that converted high-energy radiation into the visible spectrum so the tree could continue to absorb the milder wavelengths. Quickly, I plucked a handful of the leaves. Holding one to my visor, I turned back toward the tent. The UV-reflecting fabric was a dull gray in our light, but Umberlight made it shine like a beacon, the brightest thing in the landscape. I looked down at my coldsuit, and it also glowed like a torch. The things of Umbernight might be invisible to us, but we were all too visible to them.  When I came back into the tent, my companions were still arguing. Silently, I handed each of them a strip of leaf. Davern threw his away in disgust. “What’s this, some sort of peace offering?” he said.  “Put on your coldsuits and come outside,” I said. “Hold the leaves up to your faceplates and look through them.”  Their reactions, when they saw the reality around us, were as different as they were: astonished, uneasy, disbelieving. Seabird was terrified, and shrank back toward the tent. “It’s like nightmares,” she said.  Edie put an arm around her. “It’s better than ghosts,” she said.  “No, it’s not. It’s the shadow side of all the living beings. That’s why we couldn’t see them.”  “We couldn’t see them because they don’t reflect the spectrum of light our eyes absorb,” Amal said reasonably. Seabird did not look comforted.  I looked ahead, down the road we needed to take. Umber was bright as an anti-sun. In its light, the land was not empty, but full. There was a boil of emerging life in every crack of the landscape: just not our sort of life. We were the strangers here, the fruits that had fallen too far from the tree. We did not belong.  You would think that being able to see the obstacles would speed us up, but not so. We were skittish now. With strips of lookthrough leaves taped to our visors, we could see both worlds, which were the same world; but we could not tell the harmless from the harmful. So we treated it all as a threat—dodging, detouring, clearing the road with a shovel when we could. As we continued, the organisms changed and multiplied fast around us, as if their growth were in overdrive. It was spring for them, and they were sprouting and spawning. What would they look like fully grown? I hoped not to find out.  I can’t describe the life-forms of Umbernight in biological language, because I couldn’t tell if I was looking at a plant, animal, or something in between. We quickly discovered what had been piercing our coldsuits—a plantlike thing shaped like a scorpion with a spring-loaded tail lined with barbs. When triggered by our movement, it would release a shower of pin-sharp projectiles. Perhaps they were poison, and our incompatible proteins protected us.  The road had sprouted all manner of creatures covered with plates and shells—little ziggurats and stepped pyramids, spirals, and domes. In between them floated bulbs like amber, airborne eggplants. They spurted a mucus that ate away any plastic it touched.  We topped a rise to find the valley before us completely crusted over with life, and no trace of a path. No longer could we avoid trampling through it, crushing it underfoot. Ahead, a translucent curtain suspended from floating, gas-filled bladders hung across our path. It shimmered with iridescent unlight.  “It’s rather beautiful, isn’t it?” Edie said.  “Yes, but is it dangerous?” Amal said.  “We’re not prey,” Anatoly argued. “This life can’t get any nutrients from us.”  “I doubt it knows that,” I said. “It might just act on instinct.”  “We could send the dog to find out,” Anatoly suggested.  Sally showed no inclination. Edie had put her on a leash, but it was hardly necessary; she was constantly alert now, on guard.  “Go around it,” I advised.  So we left our path to detour across land where the boulders had become hard to spot amid the riot of life. As Bucky’s wheels crushed the shell of one dome, I saw that inside it was a wriggling mass of larvae. It was not a single organism, but a colony. That would explain how such complex structures came about so fast; they were just hives of smaller organisms.  We cleared a place to camp by trampling down the undergrowth and shoveling it out of the way. Exhausted as we were, it was still hard to sleep through the sounds from outside: buzzing, whooshing, scratching, scrabbling. My brain kept coming back to one thought: at this rate, our return would take twice as long as the journey out.  The tent was cold when we woke; our heater had failed. When Amal unfastened the tent flap he gave an uncharacteristically profane exclamation. The opening was entirely blocked by undergrowth. No longer cautious, we set about hacking and smashing our way out, disturbing hordes of tiny crawling things. When we had cleared a path and turned back to look, we saw that the tent was surrounded by mounds of organisms attracted by its reflected light. The heater had failed because its air intake was blocked. Bucky, parked several yards away, had not attracted the Umberlife.  It was the coldest part of night, but Umber was high in the sky, and the life-forms had speeded up. We marched in formation now, with three fanned out in front to scan for obstructions, one in the center with Bucky, and two bringing up the rear. I was out in front with Seabird and Davern when we reached a hilltop and saw that the way ahead was blocked by a lake that had not been there on the way out. We gathered to survey it. It was white, like an ocean of milk.  “What is it?” Edie asked.  “Not water,” Anatoly said. “It’s too cold for that, too warm for methane.”  I could not see any waves, but there was an ebb and flow around the edges. “Wait here. I want to get closer,” I said.  Amal and Anatoly wouldn’t let me go alone, so the three of us set out. We were nearly on the beach edge before we could see it clearly. Amal came to an abrupt halt. “Spiders!” he said, repulsed. “It’s a sea of spiders.”  They were not spiders, of course, but that is the closest analog: long-legged crawling things, entirely white in the Umberlight. At the edges of the sea they were tiny, but farther out we could see ones the size of Sally, all seemingly competing to get toward the center of the mass. There must have been a hatching while we had slept.  “That is truly disgusting,” Anatoly said.  I gave a humorless laugh. “I’ve read about this on other planets—wildlife covering the land. The accounts always say it is a majestic, inspiring sight.”  “Umber turns everything into its evil twin,” Amal said.  As we stood there, a change was taking place. A wave was gathering far out. The small fry in front of us were scattering to get out of the way as it swept closer.  “They’re coming toward us,” Anatoly said.  We turned to run back toward the hill where we had left our friends. Anatoly and Amal reached the hilltop before I did. Edie shouted a warning, and I turned to see a knee-high spider on my heels, its pale body like a skull on legs. I had no weapon but my flashlight, so I nailed it with a light beam. To my surprise, it recoiled onto its hind legs, waving its front legs in the air. It gave me time to reach the others.  “They’re repelled by light!” I shouted. “Form a line and shine them off.”  The wave of spiders surged up the hill, but we kept them at bay with our lights. They circled us, and we ended up in a ring around Bucky, madly sweeping our flashlights to and fro to keep them off while Sally barked from behind us.  Far across the land, the horizon lit with a silent flash like purple lightning. The spiders paused, then turned mindlessly toward this new light source. As quickly as they had swarmed toward us, they were swarming away. We watched the entire lake of them drain, heading toward some signal we could not see.  “Quick, let’s cross while they’re gone,” I said.  We dashed as fast as we could across the plain where they had gathered. From time to time we saw other flashes of unlight, always far away and never followed by thunder.  In our haste, we let our vigilance lapse, and one of Bucky’s wheels thunked into a pothole. The other wheels spun, throwing up loose dirt and digging themselves in. I called out, “Bucky, stop!”—but he was already stuck fast.  “Let’s push him out,” Amal said, but I held up a hand. The buggy was already dangerously tilted.  “We’re going to have to unload some crates to lighten him up, and dig that wheel out.”  Everyone looked nervously in the direction where the spiders had gone, but Amal said, “Okay. You dig, we’ll unload.”  We all set to work. I was so absorbed in freeing Bucky’s wheel that I did not see the danger approaching until Seabird gave a cry of warning. I looked up to see one of the gauzy curtains bearing down on us from windward. It was yards wide, big enough to envelop us all, and twinkling with a spiderweb of glowing threads.  “Run!” Amal shouted. I dropped my shovel and fled. Behind me, I heard Edie’s voice crying, “Sally!” and Amal’s saying, “No, Edie! Leave her be!”  I whirled around and saw that the dog had taken refuge under the buggy. Edie was running back to get her. Amal was about to head back after Edie, so I dived at his legs and brought him down with a thud. From the ground we both watched as Edie gave up and turned back toward us. Behind her, the curtain that had been sweeping toward Bucky changed direction, veering straight toward Edie.  “Edie!” Amal screamed. She turned, saw her danger, and froze.  The curtain enveloped her, wrapping her tight in an immobilizing net. There was a sudden, blinding flash of combustion. As I blinked the after-spots away, I saw the curtain float on, shredded now, leaving behind a charcoal pillar in the shape of a woman.  Motionless with shock, I gazed at that black statue standing out against the eastern sky. It was several seconds before I realized that the sky was growing bright. Beyond all of us, dawn was coming.  In the early morning light Anatoly and I dug a grave while Seabird and Davern set up the tent. We simply could not go on. Amal was shattered with grief, and could not stop sobbing.  “Why her?” he would say in the moments when he could speak at all. “She was the best person here, the best I’ve ever known. She shouldn’t have been the one to die.”  I couldn’t wash those last few seconds out of my brain. Why had she stopped? How had that brainless, eyeless thing sensed her?  Later, Amal became angry at me for having prevented him from saving her. “Maybe I could have distracted it. It might have taken me instead of her.”  I only shook my head. “We would have been burying both of you.”  “That would have been better,” he said.  Everyone gathered as we laid what was left of her in the ground, but no one had the heart to say anything over the grave. When we had filled it in, Sally crept forward to sniff at the overturned dirt. Amal said, “We need to mark it, so we can find it again.” So we all fanned out to find rocks to heap in a cairn on the grave.  We no longer feared the return of the spiders, or anything else, because the Umberlife had gone dormant in the sun—our light being as toxic to them as theirs was to us. Everything had retreated into their shells and closed their sliding covers. When we viewed them in our own light they still blended in with the stones of the crater floor.  We ate and snatched some hours of sleep while nothing was threatening us. I was as exhausted as the others, but anxious that we were wasting so much daylight. I roused them all before they were ready. “We’ve got to keep moving,” I said.  We resumed the work of freeing Bucky where we had left off. When all was ready, we gathered behind him to push. “Bucky, go!” I ordered. His wheels only spun in the sand. “Stop!” I ordered. Then, to the others, “We’re going to rock him out. Push when I say go, and stop when I say stop.” When we got a rhythm going, he rocked back and forth three times, then finally climbed out of the trench that had trapped him.  Amal helped us reload the buggy, but when it came time to move on, he hung back. “You go ahead,” he said. “I’ll catch up with you.”  “No way,” I said. “We all go or none of us.”  He got angry at me again, but I would not let him pick a fight. We let him have some moments alone at the grave to say goodbye. At last I walked up to him and said, “Come on, Amal. We’ve got to keep moving.”  “What’s the point?” he said. “The future is gone.”  But he followed me back to where the others were waiting.  He was right, in one way: nothing we could achieve now would make up for Edie’s loss. How we were going to carry on without her, I could not guess.  When we camped, there was no music now, and little conversation. The Winding Wall was a blue line ahead in the distance, and as we continued, it rose, ever more impassable, blocking our way. We did not reach the spot where the gully path pierced it until we had been walking for thirteen hours. We were tired, but resting would waste the last of the precious sunlight. We gathered to make a decision.  “Let’s just leave the buggy and the crates, and make a run for home,” Amal said. He looked utterly dispirited.  Davern and Seabird turned to Anatoly. He was the only one of us who was still resolute. “If we do that, we will have wasted our time,” he said. “We can’t give up now.”  “That’s right,” Davern said.  Amal looked at me. There was some sense in his suggestion, but also some impracticality. “If we leave the buggy we’ll have to leave the tent,” I said. “It’s too heavy for us to carry.” We had been spreading it as a tarpaulin over the crates when we were on the move.  “We knew from the beginning that the wall would be an obstacle,” Anatoly said with determination. “We have to make the effort.”  I think even Amal realized then that he was no longer our leader.  We unloaded the buggy, working till we were ready to drop, then ate and fell asleep on the ground. When we woke, the sun was setting. It seemed too soon.  Each crate took two people to carry up the steep path. We decided to do it in stages. Back and forth we shuttled, piling our cargo at a level spot a third of the way up. The path was treacherous in the dark, but at least the work was so strenuous we had no need of coldsuits until Umber should rise.  The life-forms around us started waking as soon as dark came. It was the predawn time for them, when they could open their shells and exhale like someone shedding a coldsuit. They were quiescent enough that we were able to avoid them.  Fifteen hours later, our cargo was three-quarters of the way up, and we gathered at the bottom again to set up the tent and rest before trying to get Bucky up the path. The X-ray alarm went off while we were asleep, but we were so tired we just shut it off and went on sleeping.  When we rose, an inhuman architecture had surrounded our tent on all sides. The Umberlife had self-organized into domes and spires that on close inspection turned out to be crawling hives. There was something deformed and abhorrent about them, and we were eager to escape our transformed campsite—until Seabird gave a whimper and pointed upward.  Three hundred meters above, the top of the Winding Wall was now a battlement of living towers that glowed darkly against the sky. Shapes we couldn’t quite make out moved to and fro between the structures, as if patrolling the edge. One fat tower appeared to have a rotating top that emitted a searchlight beam of far-ultraviolet light. It scanned back and forth—whether for enemies or for prey we didn’t know.  We realized how conspicuous we were in our glowing coldsuits. “I’d give up breakfast for a can of black paint,” I said.  “Maybe we could cover ourselves with mud?” Davern ventured.  “Let’s get out of here first,” Anatoly said.  The feeling that the land was aware of us had become too strong.  Getting Bucky up the steep trail was backbreaking work, but whenever we paused to rest, Umberlife gathered around us. The gully was infested with the plant-creatures that had once launched pins at us; they had grown, and their darts were the size of pencils now. We learned to trigger them with a beam from our flashlights. Every step required a constant, enervating vigilance.  When we had reached the place where we left the crates and stopped to rest, I announced that I was going to scout the trail ahead. No one else volunteered, so I said, “Amal, come with me. Seabird, hold onto the dog.”  Amal and I picked our way up the steep trail, shining away small attackers. I saw no indication that the Umberlife had blocked the path. When we reached the top and emerged onto the plateau, I stood looking around at the transformed landscape. At my side, Amal said, “Oh my God.”  The Damn Right Barrens were now a teeming jungle. Everywhere stood towering, misshapen structures, competing to dominate the landscape. An undergrowth of smaller life clogged the spaces in between. Above, in the Umberlit sky, floated monstrous organisms like glowing jellyfish, trailing tentacles that sparked and sizzled when they touched the ground. Ten or twelve of the lighthouse towers swept their searching beams across the land. There was not a doubt in my mind that this landscape was brutally aware.  I spotted some motion out of the corner of my eye, but when I turned to see, nothing was there. I thought: only predators and prey need to move fast.  “Look,” Amal said, pointing. “Weird.”  It was a ball, perfectly round and perhaps a yard in diameter, rolling along the ground of its own accord. It disappeared behind a hive-mound and I lost track of it.  We had turned to go back down the ravine when one of the searchlight beams swept toward us, and we ducked to conceal ourselves behind a rock. Amal gave an exclamation, and I turned to see that we were surrounded by four of the rolling spheres. They seemed to be waiting for us to make a move, so I pointed my flashlight at one. Instantly, it dissolved into a million tiny crawlers that escaped into the undergrowth. The other spheres withdrew.  “They’re coordinating with the beacons,” I hissed at Amal. “Hunting cooperatively.”  “This place is evil,” he said.  We dashed toward the head of the gully. Too late, I spotted ahead the largest dart-thrower plant I had ever seen. The spring-loaded tail triggered, releasing its projectiles. I dove to one side. Amal was not quick enough, and a spine the size of an arrow caught him in the throat. He clutched at it and fell to his knees. Somehow, I managed to drag him forward till we were concealed in the gully.  The dart had pierced his neck through, and was protruding on the other side. There was no way to give him aid without taking off his coldsuit. He was struggling to breathe. I tried to lift his hood, but the dart was pinning it down. So I said, “Brace yourself,” and yanked the shaft out. He gave a gurgling cry. When I got his hood off, I saw it was hopeless. The dart had pierced a vein, and his coldsuit was filling with dark blood. Still, I ripped at his shirt and tried to bind up the wound until he caught at my hand. His eyes were growing glassy, but his lips moved.  “Leave it,” he said. He was ready to die.  I stayed there, kneeling over him as he stiffened and grew cold. My mind was a blank, until suddenly I began to cry. Not just for him—for Edie as well, and for their unborn children, and all the people who would never be gladdened by their presence. I cried for the fact that we had to bury them in this hostile waste, where love and comfort would never touch them again. And I cried for the rest of us as well, because the prospect of our reaching home now seemed so dim.  When Anatoly and I brought the shovel back to the place where I had left Amal, there was nothing to bury. Only an empty coldsuit and a handful of teeth were left on the ground; all other trace of him was gone. Anatoly nudged the coldsuit with his foot. “Should we bury this?”  Macabre as it sounded, I said, “We might need it.”  So we brought it back to our camp. We let the others think we had buried him.  We convened another strategy session. I said, “Amal had it right. We need to make a run for it. To hell with the cargo and the buggy. Leave the tent here; it only draws attention to us. We need to travel fast and light.”  But Anatoly was still animated by the inspiration of our mission. “We can still succeed,” he said. “We’re close; we don’t need to give up. We just have to outthink this nightmare.”  “Okay, how?”  “We bring everything to the head of the gully and build a fort out of the crates. Then we wait till day comes, and make a dash for it while the Umberlife is sleeping.”  “We can only get as far as the Mazy Lakes before night,” I said.  “We do the same thing over again—wait out Umbernight. Food’s no longer such a problem, with two less people.”  I saw true faith in Seabird’s eyes, and calculated self-interest in Davern’s. Anatoly was so decisive, they were clearly ready to follow him. Perhaps that was all we needed. Perhaps it would work.  “All right,” I said. “Let’s get going.”  We chose a site for our fort in the gully not far from where Amal had died. When it was done, it was a square enclosure of stacked crates with the tent pitched inside. I felt mildly optimistic that it would work. We slept inside it before bringing Bucky up. Then we waited.  There were sounds outside. Sally’s warning growls made us worry that something was surrounding us to make an attack, so we set four of our lanterns on the walls to repel intruders, even though it used up precious battery life.  Hours of uneasiness later, dawn came. We instantly broke down the fort and found that the lamps had done their job, since there was a bare circle all around us. We congratulated ourselves on having found a way to survive.  The daylight hours were a mad dash across the Damn Right. We had to clear the way ahead of Bucky, and we took out our anger on the hibernating Umberlife, leaving a trail of smashed shells and toppled towers. We reached the edge of the lakes at sunset, and instantly saw that our plan would not work.  Around the edge of the wetland stood a dense forest of the tallest spires we had yet seen, easily dominating any fort walls we could build. There would be no hope of staying hidden here.  At the edge of the lake, the blooming abundance of horrors stopped, as if water were as toxic to them as light. “If only we had a boat!” Anatoly exclaimed. But the life around us did not produce anything so durable as wood—even the shells were friable.  The light was fading fast. Soon, this crowded neighborhood would become animate. Ahead, a narrow causeway between two lakes looked invitingly empty. If only we could make it to a campsite far enough from shore, we could build our fort and wait out the night.  “Let me get out my maps and check our route first,” I said.  Davern gave an exclamation of impatience, but Anatoly just said, “Hurry up.”  We were on the side of the Mazy Lakes where my maps were less complete. On the outward journey, we had cut across the ice; but now, after forty hours of daylight, that was not an option. I was certain of only one route, and it seemed to take off from shore about five miles away. I showed it to the others.  Davern still wanted to follow the route ahead of us. “We can just go far enough to camp, then come back next day,” he argued. “We’ve already been walking twelve hours.”  “No. We’re not going to make any stupid mistakes,” I said.  Anatoly hesitated, then said, “It’s only five miles. We can do that.”  But five miles later, it was completely dark and almost impossible to tell the true path from a dozen false ones that took off into the swamp whenever I shone my lamp waterward. I began to think perhaps Davern had been right after all. But rather than risk demoralizing everyone, I chose a path and confidently declared it the right one.  It was a low and swampy route, ankle-deep in water at times. I went out ahead with a tent pole to test the footing and scout the way. The sound of Davern complaining came from behind.  As soon as we came to a relatively dry spot, we set up the tent, intending to continue searching for a fort site after a short rest. But when we rose, Bucky had sunk six inches into the mud, and we had to unload half the crates before we could push him out. By the time we set out again, we were covered with mud and water.  “Now we can try Davern’s plan of covering our coldsuits with mud,” I said.  “We don’t have much choice,” Davern muttered.  Umber rose before we found a place to stop. Then we discovered that the lakes were not lifeless at all. By Umberlight, the stromatolites fluoresced with orange and black stripes. In spots, the water glowed carmine and azure, lit from underneath. We came to a good camping spot by a place where the lake bubbled and steam rose in clouds. But when the wind shifted and blew the steam our way, we nearly choked on the ammonia fumes. We staggered on, dizzy and nauseous.  The fort, I realized, was a solution to yesterday’s problem. Staying put was not a good idea here, where we could be gassed in our sleep. We needed to be ready to move at a moment’s notice.  Geysers of glowing, sulphur-scented spray erupted on either side of our path. We headed for a hummock that looked like a dry spot, but found it covered by a stomach-turning layer of wormlike organisms. We were forced to march through them, slippery and wriggling underfoot. As we crushed them, they made a sound at a pitch we couldn’t hear. We sensed it as an itchy vibration that made us tense and short-tempered, but Sally was tormented till Seabird tied a strip of cloth over the coldsuit around her ears, making her look like an old woman in a scarf.  I didn’t say so, but I was completely lost, and had been for some time. It was deep night and the water was freezing by now, but I didn’t trust ice that glowed, so I stayed on the dwindling, switchback path. We were staggeringly weary by the time we reached the end of the road: on the tip of a peninsula surrounded by water. We had taken a wrong turn.  We stood staring out into the dark. It was several minutes before I could bring myself to say, “We have to go back.”  Seabird broke down in tears, and Davern erupted like a geyser. “You were supposed to be the great guide and tracker, and all you’ve done is lead us to a dead end. You’re totally useless.”  Somehow, Anatoly summoned the energy to keep us from falling on each others’ throats. “Maybe there’s another solution.” He shone his light out onto the lake. The other shore was clearly visible. “See, there’s an ice path across. The whole lake isn’t infested. Where it’s black, the water’s frozen solid.”  “That could be just an island,” I said.  “Tell you what, I’ll go ahead to test the ice and investigate. You follow only if it’s safe.”  I could tell he was going to try it no matter what I said, so I made him tie a long rope around his waist, and anchored it to Bucky. “If you fall through, we’ll pull you out,” I said.  He stepped out onto the ice, testing it first with a tent pole. The weakest spot of lake ice is generally near shore, so I expected it to crack there if it was going to. But he got past the danger zone and kept going. From far out on the ice, he flashed his light back at us. “The ice is holding!” he called. “Give me more rope!”  There wasn’t any more rope. “Hold on!” I called, then untied the tether from Bucky and wrapped it around my waist. Taking a tent pole, I edged out onto the ice where he had already crossed it. I was about thirty meters out onto the lake when he called, “I made it! Wait there.”  He untied his end of the rope to explore the other side. I could not see if he had secured it to anything in case I fell through, so I waited as motionlessly as I could. Before long, he returned. “I’m coming back,” he yelled.  I was a few steps from shore when the rope pulled taut, yanking me off my feet. I scrambled up, but the rope had gone limp. “Anatoly!” I screamed. Seabird and Davern shone their lights out onto the ice, but Anatoly was nowhere to be seen. I pulled in the rope, but it came back with only a frayed end.  “Stay here,” I said to the others, then edged gingerly onto the ice. If he was in the water, there was a short window of time to save him. But as I drew closer to the middle, the lake under me lit up with mesmerizing colors. They emanated from an open pool of water that churned and burped.  The lake under the black ice had not been lacking in life. It had just been hungry.  When I came back to where the others were waiting, I shook my head, and Seabird broke into hysterical sobs. Davern sat down with his head in his hands.  I felt strangely numb, frozen as the land around us. At last I said, “Come on, we’ve got to go back.”  Davern looked at me angrily. “Who elected you leader?”  “The fact that I’m the only one who can save your sorry ass,” I said.  Without Anatoly’s animating force, they were a pitiful sight—demoralized, desperate, and way too young. Whatever their worth as individuals, I felt a strong compulsion to avenge Anatoly’s death by getting them back alive. In this land, survival was defiance.  I ordered Bucky to reverse direction and head back up the path we had come by. Seabird and Davern didn’t argue. They just followed.  We had been retracing our steps for half an hour when I noticed a branching path I hadn’t seen on the way out. “Bucky, stop!” I ordered. “Wait here,” I told the others. Only Sally disobeyed me, and followed.  The track headed uphill onto a ridge between lakes. It had a strangely familiar look. When I saw Sally smelling at a piece of discarded trash, I recognized the site of our campsite on the way out. I stood in silence, as if at a graveyard. Here, Amal had played his mandolin and Anatoly had imagined songs of Umbernight. Edie had made Sally’s coldsuit.  If we had just gone back instead of trying to cross the ice, we would have found our way.  I returned to fetch my companions. When Seabird saw the place, memories overwhelmed her and she couldn’t stop crying. Davern and I set up the tent and heater as best we could, and all of us went inside.  “It’s not fair,” Seabird kept saying between sobs. “Anatoly was trying to save us. He didn’t do anything to deserve to die. None of them did.”  “Right now,” I told her, “your job isn’t to make sense of it. Your job is to survive.”  Inwardly, I seethed at all those who had led us to expect the world to make sense.  We were ten hours away from the edge of the lakes, thirty hours of walking from home. Much as I hated to continue on through Umbernight, I wanted to be able to make a dash for safety when day came. Even after sleeping, Seabird and Davern were still tired and wanted to stay. I went out and shut off the heater, then started dismantling the tent to force them out.  The lakes glowed like a lava field on either side of us. From time to time, billows of glowing, corrosive steam enveloped us, and we had to hold our breaths till the wind shifted. But at least I was sure of our path now.  The other shore of the Mazy Lakes, when we reached it, was not lined with the towers and spires we had left on the other side; but when we pointed our lights ahead, we could see things scattering for cover. I was about to suggest that we camp and wait for day when I felt a low pulse of vibration underfoot. It came again, rhythmic like the footsteps of a faraway giant. The lake organisms suddenly lost their luminescence. When I shone my light on the water, the dark surface shivered with each vibration. Behind us, out over the lake, the horizon glowed.  “I think we ought to run for it,” I said.  The others took off for shore with Sally on their heels. “Bucky, follow!” I ordered, and sprinted after them. The organisms on shore had closed up tight in their shells. When I reached the sloping bank, I turned back to look. Out over the lake, visible against the glowing sky, was a churning, coal-black cloud spreading toward us. I turned to flee.  “Head uphill!” I shouted at Davern when I caught up with him. Seabird was ahead of us; I could see her headlamp bobbing as she ran. I called her name so we wouldn’t get separated, then shoved Davern ahead of me up the steep slope.  We had reached a high bank when the cloud came ashore, a toxic tsunami engulfing the low spots. Bucky had fallen behind, and I watched as he disappeared under the wave of blackness. Then the chemical smell hit, and for a while I couldn’t breathe or see. By the time I could draw a lungful of air down my burning throat, the sludgy wave was already receding below us. Blinking away tears, I saw Bucky emerge again from underneath, all of his metalwork polished bright and clean. The tent that had been stretched over the crates was in shreds, but the crates themselves looked intact.  Beside me, Davern was on his knees, coughing. “Are you okay?” I asked. He shook his head, croaking, “I’m going to be sick.”  I looked around for Seabird. Her light wasn’t visible anymore. “Seabird!” I yelled, desperate at the thought that we had lost her. To my immense relief, I heard her voice calling. “We’re here!” I replied, and flashed my light.  Sounds of someone approaching came through the darkness, but it was only Sally. “Where is she, Sally? Go find her,” I said, but the dog didn’t understand. I swept my light over the landscape, and finally spotted Seabird stumbling toward us without any light. She must have broken hers in the flight. I set out toward her, trying to light her way.  The Umberlife around us was waking again. Half-seen things moved just outside the radius of my light. Ahead, one of the creature-balls Amal and I had seen on the other side was rolling across the ground, growing as it moved. It was heading toward Seabird.  “Seabird, watch out!” I yelled. She saw the danger and started running, slowed by the dark. I shone my light on the ball, but I was too far away to have an effect. The ball speeded up, huge now. It overtook her and dissolved into a wriggling, scrabbling, ravenous mass. She screamed as it covered her, a sound of sheer terror that rose into a higher pitch of pain, then cut off. The mound churned, quivered repulsively, grew smaller, lost its shape. By the time I reached the spot, all that was left was her coldsuit and some bits of bone.  I rolled some rocks on top of it by way of burial.  Davern was staring and trembling when I got back to him. He had seen the whole thing, but didn’t say a word. He stuck close to me as I led the way back to Bucky.  “We’re going to light every lamp we’ve got and wait here for day,” I said.  He helped me set up the lights in a ring, squandering our last batteries. We sat in the buggy’s Umbershadow and waited for dawn with Sally at our feet. We didn’t say much. I knew he couldn’t stand me, and I had only contempt for him; but we still huddled close together.  To my surprise, Bucky was still operable when the dawn light revived his batteries. He followed as we set off up the Let’s Go Valley, once such a pleasant land, now disfigured with warts of Umberlife on its lovely face. We wasted no time on anything but putting the miles behind us.  The sun had just set when we saw the wholesome glow of Feynman Habitat’s yard light ahead. We pounded on the door, then waited. When the door cracked open, Davern pushed past me to get inside first. They welcomed him with incredulous joy, until they saw that he and I were alone. Then the joy turned to shock and grief.  There. That is what happened. But of course, that’s not what everyone wants to know. They want to know why it happened. They want an explanation—what we did wrong, how we could have succeeded.  That was what the governing committee was after when they called me in later. As I answered their questions, I began to see the narrative taking shape in their minds. At last Anselm said, “Clearly, there was no one fatal mistake. There was just a pattern of behavior: naïve, optimistic, impractical. They were simply too young and too confident.”  I realized that I myself had helped create this easy explanation, and my remorse nearly choked me. I stood up and they all looked at me, expecting me to speak, but at first I couldn’t say a word. Then, slowly, I started out, “Yes. They were all those things. Naïve. Impractical. Young.” My voice failed, and I had to concentrate on controlling it. “That’s why we needed them. Without their crazy commitment, we would have conceded defeat. We would have given up, and spent the winter hunkered down in our cave, gnawing our old grudges, never venturing or striving for anything beyond our reach. Nothing would move forward. We needed them, and now they are gone.”  Later, I heard that the young people of Feynman took inspiration from what I said, and started retelling the story as one of doomed heroism. Young people like their heroes doomed.  Myself, I can’t call it anything but failure. It’s not because people blame me. I haven’t had to justify myself to anyone but this voice in my head—always questioning, always nagging me. I can’t convince it: everyone fails.  If I blame anyone, it’s our ancestors, the original settlers. We thought their message to us was that we could always conquer irrationality, if we just stuck to science and reason.  Oh, yes—the settlers. When we finally opened the crates to find out what they had sent us, it turned out that the payload was books. Not data—paper books. Antique ones. Art, philosophy, literature. The books had weathered the interstellar trip remarkably well. Some were lovingly inscribed by the settlers to their unknown descendants. Anatoly would have been pleased to know that the people who sent these books were not really rationalists—they worried about our aspirational well-being. But the message came too late. Anatoly is dead.  I sit on my bed stroking Sally’s head. What do you think, girl? Should I open the book from my great-grandmother? Carolyn Ives Gilman is currently celebrating her decision to quit her job in order to write more science fiction. She has written two novels and five stories in the loosely connected Twenty Planets universe. Her books include Dark Orbit, a space exploration adventure; Isles of the Forsaken and Ison of the Isles, a two-book fantasy about culture clash and revolution; and Halfway Human, a novel about gender and oppression. Her short fiction has appeared in Clarkesworld, Fantasy and Science Fiction, The Year's Best Science Fiction, Lightspeed, Interzone, Universe, Full Spectrum, Realms of Fantasy, and others. She has been nominated for the Nebula Award three times and for the Hugo twice.  Gilman lives in Washington, D.C., and works as a freelance writer and museum consultant. She is also author of several nonfiction books about North American frontier and Native history.", "text": "18010 words, novella\nUmbernight\n2019 Finalist: Theodore A. Sturgeon Memorial Award\n2019 Finalist: Locus Award for Best Novella\nThere is a note from my great-grandmother in the book on my worktable, they tell me. I haven’t opened it. Up to now I have been too angry at her whole generation, those brave colonists who settled on Dust and left us here to pay the price. But lately, I have begun to feel a little disloyal—not to her, but to my companions on the journey that brought me the book, and gave me the choice whether to read it or not. What, exactly, am I rejecting here—the past or the future?\nIt was autumn—a long, slow season on Dust. It wasn’t my first autumn, but I’d been too young to appreciate it the first time. I was coming back from a long ramble to the north, with the Make Do Mountains on my right and the great horizon of the Endless Plain to my left. I could not live without the horizon. It puts everything in perspective. It is my soul’s home.\nSorry, I’m not trying to be offensive.\nAs I said, it was autumn. All of life was seeding, and the air was scented with lost chances and never agains. In our region of Dust, most of the land vegetation is of the dry, bristly sort, with the largest trees barely taller than I am, huddling in the shade of cliffs. But the plants were putting on their party best before Umbernight: big, white blooms on the bad-dog bushes and patches of bitterberries painting the arroyos orange. I knew I was coming home when a black fly bit me. Some of the organisms we brought have managed to survive: insects, weeds, lichen. They spread a little every time I’m gone. It’s not a big victory, but it’s something.\nThe dogs started barking when I came into the yard in front of Feynman Habitat with my faithful buggy tagging along behind me. The dogs never remember me at first, and always take fright at sight of Bucky. A door opened and Namja looked out. “Michiko’s back!” she shouted, and pretty soon there was a mob of people pouring out of the fortified cave entrance. It seemed as if half of them were shorter than my knees. They stared at me as if I were an apparition, and no wonder: my skin was burned dark from the UV except around my eyes where I wear goggles, and my hair and eyebrows had turned white. I must have looked like Grandmother Winter.\n“Quite a crop of children you raised while I was gone,” I said to Namja. I couldn’t match the toddlers to the babies I had left.\n“Yes,” she said. “Times are changing.”\nI didn’t know what she meant by that, but I would find out.\nEveryone wanted to help me unpack the buggy, so I supervised. I let them take most of the sample cases to the labs, but I wouldn’t let anyone touch the topographical information. That would be my winter project. I was looking forward to a good hibernate, snug in a warm cave, while I worked on my map of Dust.\nThe cargo doors rumbled open and I ordered Bucky to park inside, next to his smaller siblings, the utility vehicles. The children loved seeing him obey, as they always do; Bucky has an alternate career as playground equipment when he’s not with me. I hefted my pack and followed the crowd inside.\nThere is always a festive atmosphere when I first get back. Everyone crowds around telling me news and asking where I went and what I saw. This time they presented me with the latest project of the food committee: an authentic glass of beer. I think it’s an acquired taste, but I acted impressed.\nWe had a big, celebratory dinner in the refectory. As a treat, they grilled fillets of chickens and fish, now plentiful enough to eat. The youngsters like it, but I’ve never been able to get used to meat. Afterwards, when the parents had taken the children away, a group of adults gathered around my table to talk. By then, I had noticed a change: my own generation had become the old-timers, and the young adults were taking an interest in what was going on. Members of the governing committee were conspicuously absent.\n“Don’t get too comfortable,” Haakon said to me in a low tone.\n“What do you mean?” I said.\nEveryone exchanged a look. It was Namja who finally explained. “The third cargo capsule from the homeworld is going to land at Newton’s Eye in about 650 hours.”\n“But . . . ” I stopped when I saw they didn’t need me to tell them the problem. The timing couldn’t have been worse. Umbernight was just around the corner. Much as we needed that cargo, getting to it would be a gamble with death.\nI remember how my mother explained Umbernight to me as a child. “There’s a bad star in the sky, Michiko. We didn’t know it was there at first because there’s a shroud covering it. But sometimes, in winter, the shroud pulls back and we can see its light. Then we have to go inside, or we would die.”\nAfter that, I had nightmares in which I looked up at the sky and there was the face of a corpse hanging there, covered with a shroud. I would watch in terror as the veil would slowly draw aside, revealing rotted flesh and putrid gray jelly eyes, glowing with a deadly unlight that killed everything it touched.\nI didn’t know anything then about planetary nebulae or stars that emit in the UV and X-ray spectrum. I didn’t know we lived in a double-star system, circling a perfectly normal G-class star with a very strange, remote companion. I had learned all that by the time I was an adolescent and Umber finally rose in our sky. I never disputed why I had to spend my youth cooped up in the cave habitat trying to make things run. They told me then, “You’ll be all grown up with kids of your own before Umber comes again.” Not true. All grown up, that part was right. No kids.\nA dog was nudging my knee under the table, and I kneaded her velvet ears. I was glad the pro-dog faction had won the Great Dog Debate, when the colony had split on whether to reconstitute dogs from frozen embryos. You feel much more human with dogs around. “So what’s the plan?” I asked.\nAs if in answer, the tall, stooped figure of Anselm Thune came into the refectory and headed toward our table. We all fell silent. “The Committee wants to see you, Mick,” he said.\nThere are committees for every conceivable thing in Feynman, but when someone says “the Committee,” capital C, it means the governing committee. It’s elected, but the same people have dominated it for years, because no one wants to put up with the drama that would result from voting them out. Just the mention of it put me in a bad mood.\nI followed Anselm into the meeting room where the five Committee members were sitting around a table. The only spare seat was opposite Chairman Colby, so I took it. He has the pale skin of a lifelong cave dweller, and thin white hair fringing his bald head.\n“Did you find anything useful?” he asked as soon as I sat down. He’s always thought my roving is a waste of time because none of my samples have produced anything useful to the colony. All I ever brought back was more evidence of how unsuited this planet is for human habitation.\nI shrugged. “We’ll have to see what the lab says about my biosamples. I found a real pretty geothermal region.”\nHe grimaced at the word “pretty,” which was why I’d used it. He was an orthodox rationalist, and considered aesthetics to be a gateway drug to superstition. “You’ll fit in well with these gullible young animists we’re raising,” he said. “You and your fairy-tales.”\nI was too tired to argue. “You wanted something?” I said.\nAnselm said, “Do you know how to get to Newton’s Eye?”\n“Of course I do.”\n“How long does it take?”\n“On foot, about 200 hours. Allow a little more for the buggy, say 220.”\nI could see them calculating: there and back, 440 hours, plus some time to unload the cargo capsule and pack, say 450. Was there enough time?\nI knew myself how long the nights were getting. Dust is sharply tilted, and at our latitude, its slow days vary from ten hours of dark and ninety hours of light in the summer to the opposite in winter. We were past the equinox; the nights were over sixty hours long, what we call N60. Umber already rose about midnight; you could get a sunburn before dawn. But most of its radiation didn’t reach us yet because of the cloud of dust, gas, and ionized particles surrounding it. At least, that’s our theory about what is concealing the star.\n“I don’t suppose the astronomers have any predictions when the shroud will part?” I said.\nThat set Colby off. “Shroud, my ass. That’s a backsliding anti-rationalist term. Pretty soon you’re going to have people talking about gods and visions, summoning spirits, and rejecting science.”\n“It’s just a metaphor, Colby,” I said.\n“I’m trying to prevent us from regressing into savagery! Half of these youngsters are already wearing amulets and praying to idols.”\nOnce again, Anselm intervened. “There is inherent unpredictability about the star’s planetary nebula,” he said. “The first time, the gap appeared at N64.” That is, when night was 64 hours long. “The second time it didn’t come till N70.”\n“We’re close to N64 now,” I said.\n“Thank you for telling us,” Colby said with bitter sarcasm.\nI shrugged and got up to leave. Before I reached the door Anselm said, “You’d better start getting your vehicle in order. If we do this, you’ll be setting out in about 400 hours.”\n“Just me?” I said incredulously.\n“You and whoever we decide to send.”\n“The suicide team?”\n“You’ve always been a bad influence on morale,” Colby said.\n“I’m just calculating odds like a good rationalist,” I replied. Since I really didn’t want to hear his answer to that, I left. All I wanted then was a hot bath and about twenty hours of sleep.\nThat was my first mistake. I should have put my foot down right then. They probably wouldn’t have tried it without me.\nBut the habitat was alive with enthusiasm for fetching the cargo. Already, more people had volunteered than we could send. The main reason was eagerness to find out what our ancestors had sent us. You could barely walk down the hall without someone stopping you to speculate about it. Some wanted seeds and frozen embryos, electronic components, or medical devices. Others wanted rare minerals, smelting equipment, better water filtration. Or something utterly unexpected, some miracle technology to ease our starved existence.\nIt was the third and last cargo capsule our ancestors had sent by solar sail when they themselves had set out for Dust in a faster ship. Without the first two capsules, the colony would have been wiped out during the first winter, when Umber revealed itself. As it was, only two thirds of them perished. The survivors moved to the cave habitat and set about rebuilding a semblance of civilization. We weathered the second winter better here at Feynman. Now that the third winter was upon us, people were hoping for some actual comfort, some margin between us and annihilation.\nBut the capsule was preprogrammed to drop at the original landing site, long since abandoned. It might have been possible to reprogram it, but no one wanted to try calculating a different landing trajectory and sending it by our glitch-prone communication system. The other option, the wise and cautious one, was to let the capsule land and just leave it sitting at Newton’s Eye until spring. But we are the descendants of people who set out for a new planet without thoroughly checking it out. Wisdom? Caution? Not in our DNA.\nAll right, that’s a little harsh. They said they underestimated the danger from Umber because it was hidden behind our sun as well as its shroud when they were making observations from the home planet. And they did pay for their mistake.\nI spent the next ten hours unpacking, playing with the dogs, and hanging out in the kitchen. I didn’t see much evidence of pagan drumming in the halls, so I asked Namja what bee had crawled up Colby’s ass. Her eyes rolled eloquently in response. “Come here,” she said.\nShe led me into the warren of bedrooms where married couples slept and pulled out a bin from under her bed—the only space any of us has for storing private belongings. She dug under a concealing pile of clothes and pulled out a broken tile with a colorful design on the back side—a landscape, I realized as I studied it. A painting of Dust.\n“My granddaughter Marigold did it,” Namja said in a whisper.\nWhat the younger generation had discovered was not superstition, but art.\nFor two generations, all our effort, all our creativity, had gone into improving the odds of survival. Art took materials, energy, and time we didn’t have to spare. But that, I learned, was not why Colby and the governing committee disapproved of it.\n“They think it’s a betrayal of our guiding principle,” Namja said.\n“Rationalism, you mean?”\nShe nodded. Rationalism—that universal ethic for which our parents came here, leaving behind a planet that had splintered into a thousand warring sects and belief systems. They were high-minded people, our settler ancestors. When they couldn’t convince the world they were correct, they decided to leave it and found a new one based on science and reason. And it turned out to be Dust.\nNow, two generations later, Colby and the governing committee were trying to beat back irrationality.\n“They lectured us about wearing jewelry,” Namja said.\n“Why?”\n“It might inflame sexual instincts,” she said ironically.\n“Having a body does that,” I said.\n“Not if you’re Colby, I guess. They also passed a resolution against figurines.”\n“That was their idea of a problem?”\n“They were afraid people would use them as fetishes.”\nIt got worse. Music and dance were now deemed to have shamanistic origins. Even reciting poetry aloud could start people on the slippery slope to prayer groups and worship.\n“No wonder everyone wants to go to Newton’s Eye,” I said.\nWe held a meeting to decide what to do. We always have meetings, because the essence of rationality is that it needs to be contested. Also because people don’t want responsibility for making a decision.\nAbout 200 people crammed into the refectory—everyone old enough to understand the issue. We no longer had a room big enough for all, a sure sign we were outgrowing our habitat.\nFrom the way the governing committee explained the options, it was clear that they favored the most cautious one—to do nothing at all, and leave the cargo to be fetched by whoever would be around in spring. I could sense disaffection from the left side of the room, where a cohort of young adults stood together. When Colby stopped talking, a lean, intellectual-looking young man named Anatoly spoke up for the youth party.\n“What would our ancestors think of us if we let a chance like this slip by?”\nColby gave him a venomous look that told me this was not the first time Anatoly had stood up to authority. “They would think we were behaving rationally,” he said.\n“It’s not rational to sit cowering in our cave, afraid of the planet we came to live on,” Anatoly argued. “This cargo could revolutionize our lives. With new resources and technologies, we could expand in the spring, branch out and found satellite communities.”\nWatching the Committee, I could tell that this was precisely what they feared. New settlements meant new leaders—perhaps ones like Anatoly, willing to challenge what the old leaders stood for.\n“Right now, it’s a waste of our resources,” Anselm said. “We need to focus everything we have on preparing for Umbernight.”\n“It’s a waste of resources not to go,” Anatoly countered. “You have a precious resource right here.” He gestured at the group behind him. “People ready and willing to go now. By spring, we’ll all be too old.”\n“Believe it or not, we don’t want to waste you either,” said Gwen, a third member of the Committee—although Colby looked like he would have gladly wasted Anatoly without a second thought.\n“We’re willing to take the chance,” Anatoly said. “We belong here, on this planet. We need to embrace it, dangers and all. We are more prepared now than ever before. Our scientists have invented X-ray shielding fabric, and coldsuits for temperature extremes. We’ll never be more ready.”\n“Well, thank you for your input,” Anselm said. “Anyone else?”\nThe debate continued, but all the important arguments had been made. I slipped out the back and went to visit Bucky, as if he would have an opinion. “They may end up sending us after all,” I told him in the quiet of his garage. “If only to be rid of the troublemakers.”\nThe great announcement came about twenty hours later. The Committee had decided to roll the dice and authorize the expedition. They posted the list of six names on bulletin boards all over the habitat. I learned of it when I saw a cluster of people around one, reading. As I came up behind them, D’Sharma exclaimed emotionally, “Oh, this is just plain cruel.” Someone saw me, and D’Sharma turned around. “Mick, you’ve got to bring them all back, you hear?” Then she burst into tears.\nI read the list then, but it didn’t explain D’Sharma’s reaction. Anatoly was on it, not surprisingly—but in what seemed like a deliberate snub, he was not to be the leader. That distinction went to a young man named Amal. The rest were all younger generation; I’d known them in passing as kids and adolescents, but I had been gone too much to see them much as adults.\n“It’s a mix of expendables and rising stars,” Namja explained to me later in private. “Anatoly, Seabird, and Davern are all people they’re willing to sacrifice, for different reasons. Amal and Edie—well, choosing them shows that the Committee actually wants the expedition to succeed. But we’d all hate to lose them.”\nI didn’t need to ask where I fit in. As far as the Committee was concerned, I was in the expendable category.\nMy first impression of the others came when I was flat on my back underneath Bucky, converting him to run on bottled propane. Brisk footsteps entered the garage and two practical boots came to a halt. “Mick?” a woman’s voice said.\n“Under here,” I answered.\nShe got down on all fours to look under the vehicle. Sideways, I saw a sunny face with close-cropped, dark brown hair. “Hi,” she said, “I’m Edie.”\n“I know,” I said.\n“I want to talk,” she said.\n“We’re talking.”\n“I mean face to face.”\nWe were face to face, more or less, but I supposed she meant upright, so I slid out from under, wiping my oily hands on a rag. We looked at each other across Bucky’s back.\n“We’re going to have a meeting to plan out the trip to Newton’s Eye,” she said.\n“Okay.” I had already been planning out the trip for a couple work cycles. It’s what I do, plan trips, but normally just for myself.\n“Mick, we’re going to be counting on you a lot,” she said seriously. “You’re the only one who’s ever been to Newton’s Eye, and the only one who’s ever seen a winter. The rest of us have lots of enthusiasm, but you’ve got the experience.”\nI was impressed by her realism, and—I confess it—a little bit flattered. No one ever credits me with useful knowledge. I had been prepared to cope with a flock of arrogant, ignorant kids. Edie was none of those things.\n“Can you bring a map to the meeting? It would help us to know where we’re going.”\nMy heart warmed. Finally, someone who saw the usefulness of my maps. “Sure,” I said.\n“I’ve already been thinking about the food, but camping equipment—we’ll need your help on that.”\n“Okay.”\nHer face folded pleasantly around her smile. “The rest of us are a talky bunch, so don’t let us drown you out.”\n“Okay.”\nAfter she told me the when and where of the meeting, she left, and I realized I hadn’t said more than two syllables at a time. Still, she left me feeling she had understood.\nWhen I arrived at the meeting, the effervescence of enthusiasm triggered my fight or flight reflex. I don’t trust optimism. I stood apart, arms crossed, trying to size up my fellow travelers.\nThe first thing I realized was that Amal and Edie were an item; they had the kind of companionable, good-natured partnership you see in long-married couples. Amal was a big, relaxed young man who was always ready with a joke to put people at ease, while Edie was a little firecracker of an organizer. I had expected Anatoly to be resentful, challenging Amal for leadership, but he seemed thoroughly committed to the project, and I realized it hadn’t just been a power play—he actually wanted to go. The other two were supposed to be “under-contributors,” as we call them. Seabird—yes, her parents named her that on this planet without either birds or seas—was a plump young woman with unkempt hair who remained silent through most of the meeting. I couldn’t tell if she was sulky, shy, or just scared out of her mind. Davern was clearly unnerved, and made up for it by being as friendly and anxious to ingratiate himself with the others as a lost puppy looking for a master. Neither Seabird nor Davern had volunteered. But then, neither had I, strictly speaking.\nAmal called on me to show everyone the route. I had drawn it on a map—a physical map that didn’t require electricity—and I spread it on the table for them to see. Newton’s Eye was an ancient crater basin visible from space. To get to it, we would have to follow the Let’s Go River down to the Mazy Lakes. We would then cross the Damn Right Barrens, climb down the Winding Wall to the Oh Well Valley, and cross it to reach the old landing site. Coming back, it would be uphill all the way.\n“Who made up these names?” Anatoly said, studying the map with a frown.\n“I did,” I said. “Mostly for my mood on the day I discovered things.”\n“I thought the settlers wanted to name everything for famous scientists.”\n“Well, the settlers aren’t around anymore,” I said.\nAnatoly looked as if he had never heard anything so heretical from one of my generation. He flashed me a sudden smile, then glanced over his shoulder to make sure no one from the governing committee was listening.\n“What will it be like, traveling?” Edie asked me.\n“Cold,” I said. “Dark.”\nShe was waiting for more, so I said, “We’ll be traveling in the dark for three shifts to every two in the light. Halfway through night, Umber rises, so we’ll have to wear protective gear. That’s the coldest time, too; it can get cold enough for CO2 to freeze this time of year. There won’t be much temptation to take off your masks.”\n“We can do it,” Anatoly said resolutely.\nDavern gave a nervous giggle and edged closer to me. “You know how to do this, don’t you, Mick?”\n“Well, yes. Unless the shroud parts and Umbernight comes. Then all bets are off. Even I have never traveled through Umbernight.”\n“Well, we just won’t let that happen,” Edie said, and for a moment it seemed as if she could actually make the forces of Nature obey.\nI stepped back and watched while Edie coaxed them all into making a series of sensible decisions: a normal work schedule of ten hours on, ten hours off; a division of labor; a schedule leading up to departure. Seabird and Davern never volunteered for anything, but Edie cajoled them into accepting assignments without complaint.\nWhen it was over and I was rolling up my map, Edie came over and said to me quietly, “Don’t let Davern latch onto you. He tries to find a protector—someone to adopt him. Don’t fall for it.”\n“I don’t have maternal instincts,” I said.\nShe squeezed my arm. “Good for you.”\nIf this mission were to succeed, I thought, it would be because of Edie.\nWhich is not to say that Amal wasn’t a good leader. I got to know him when he came to me for advice on equipment. He didn’t have Edie’s extrovert flair, but his relaxed manner could put a person at ease, and he was methodical about thinking things through. Together, we compiled a daunting list of safety tents, heaters, coldsuits, goggles, face masks, first aid, and other gear; then when we realized that carrying all of it would leave Bucky with no room for the cargo we wanted to haul back, we set about ruthlessly cutting out everything that wasn’t essential for survival.\nHe challenged me on some things. “Rope?” he said skeptically. “A shovel?”\n“Rationality is about exploiting the predictable,” I said. “Loose baggage and a mired-down vehicle are predictable.”\nHe helped me load up Bucky for the trip out with a mathematical precision, eliminating every wasted centimeter. On the way back, we would have to carry much of it on our backs.\nI did demand one commitment from Amal. “If Umbernight comes, we need to turn around and come back instantly, no matter what,” I said.\nAt first he wouldn’t commit himself.\n“Have you ever heard what happened to the people caught outside during the first Umbernight?” I asked him. “The bodies were found in spring, carbonized like statues of charcoal. They say some of them shed tears of gasoline, and burst into flame as soon as a spark hit them.”\nHe finally agreed.\nYou see, I wasn’t reckless. I did some things right—as right as anyone could have done in my shoes.\nWhen we set out just before dawn, the whole of Feynman Habitat turned out to see us off. There were hugs and tears, then waves and good wishes as I ordered Bucky to start down the trail. It took only five minutes for Feynman to drop behind us, and for the true immensity of Dust to open up ahead. I led the way down the banks of a frozen rivulet that eventually joined the Let’s Go River; as the morning warmed it would begin to gurgle and splash.\n“When are we stopping for lunch?” Seabird asked.\n“You’re not hungry already, are you?” Edie said, laughing.\n“No, I just want to know what the plan is.”\n“The plan is to walk till we’re tired and eat when we’re hungry.”\n“I’d rather have a time,” Seabird insisted. “I want to know what to expect.”\nNo one answered her, so she glowered as she walked.\nIt did not take long for us to go farther from the habitat than any of them had ever been. At first they were elated at the views of the river valley ahead; but as their packs began to weigh heavier and their feet to hurt, the high spirits faded into dogged determination. After a couple of hours, Amal caught up with me at the front of the line.\n“How far do we need to go this tenhour?”\n“We need to get to the river valley. There’s no good place to pitch the tent before that.”\n“Can we take a break and stay on schedule?”\nI had already planned on frequent delays for the first few days, so I said, “There’s a nice spot ahead.”\nAs soon as we reached it, Amal called a halt, and everyone dropped their packs and kicked off their boots. I warned them not to take off their UV-filtering goggles. “You can’t see it, but Umber hasn’t set yet. You don’t want to come back with crispy corneas.”\nI went apart to sit on a rock overlooking the valley, enjoying the isolation. Below me, a grove of lookthrough trees gestured gently in the wind, their leaves like transparent streamers. Like most plants on Dust, they are gray-blue, not green, because life here never evolved chloroplasts for photosynthesis. It is all widdershins life—its DNA twirls the opposite direction from ours. That makes it mostly incompatible with us.\nBefore long, Anatoly came to join me.\n“That valley ahead looks like a good place for a satellite community in the spring,” he said. “What do you think, could we grow maize there?”\nThe question was about more than agronomy. He wanted to recruit me into his expansion scheme. “You’d need a lot of shit,” I said.\nI wasn’t being flippant. Dumping sewage was how we had created the soil for the outdoor gardens and fields around Feynman. Here on Dust, sewage is a precious, limited resource.\nHe took my remark at face value. “It’s a long-range plan. We can live off hydroponics at first.”\n“There’s a long winter ahead,” I said.\n“Too long,” he said. “We’re bursting at the seams now, and our leaders can only look backward. That’s why the Committee has never supported your explorations. They think you’re wasting time because you’ve never brought back anything but knowledge. That’s how irrational they are.”\nHe was a good persuader. “You know why I like being out here?” I said. “You have to forget all about the habitat, and just be part of Dust.”\n“That means you’re one of us,” Anatoly said seriously. “The governing committee, they are still fighting the battles of the homeworld. We’re the first truly indigenous generation. We’re part of this planet.”\n“Wait until you’ve seen more of it before you decide for sure.”\nI thought about Anatoly’s farming scheme as we continued on past his chosen site. It would be hard to pull off, but not impossible. I would probably never live to see it thrive.\nThe sun was blazing from the southern sky by the time we made camp on the banks of the Let’s Go. Edie recruited Davern to help her cook supper, though he seemed to be intentionally making a mess of things so that he could effusively praise her competence. She was having none of it. Amal and Anatoly worked on setting up the sleeping tent. It was made from a heavy, radiation-blocking material that was one of our lab’s best inventions. I puttered around aiming Bucky’s solar panels while there was light to collect, and Seabird lay on the ground, evidently too exhausted to move.\nShe sat up suddenly, staring at some nearby bushes. “There’s something moving around over there.”\n“I don’t think so,” I said, since we are the only animal life on Dust.\n“There is!” she said tensely.\n“Well, check it out, then.”\nShe gave me a resentful look, but heaved to her feet and went to look in the bushes. I heard her voice change to that cooing singsong we use with children and animals. “Come here, girl! What are you doing here? Did you follow us?”\nWith horror, I saw Sally, one of the dogs from Feynman, emerge from the bushes, wiggling in delight at Seabird’s welcome.\n“Oh my God!” I exclaimed. The dire profanity made everyone turn and stare. No one seemed to understand. In fact, Edie called out the dog’s name and it trotted over to her and stuck its nose eagerly in the cooking pot. She laughed and pushed it away.\nAmal had figured out the problem. “We can’t take a dog; we don’t have enough food. We’ll have to send her back.”\n“How, exactly?” I asked bitterly.\n“I can take her,” Seabird volunteered.\nIf we allowed that, we would not see Seabird again till we got back.\n“Don’t feed her,” Anatoly said.\nBoth Edie and Seabird objected to that. “We can’t starve her!” Edie said.\nI was fuming inside. I half suspected Seabird of letting the dog loose to give herself an excuse to go back. It would have been a cunning move. As soon as I caught myself thinking that way, I said loudly, “Stop!”\nThey all looked at me, since I was not in the habit of giving orders. “Eat first,” I said. “No major decisions on an empty stomach.”\nWhile we ate our lentil stew, Sally demonstrated piteously how hungry she was. In the end, Edie and Seabird put down their bowls for Sally to finish off.\n“Is there anything edible out here?” Edie asked me.\n“There are things we can eat, but not for the long run,” I said. “We can’t absorb their proteins. And the dog won’t eat them if she knows there is better food.”\nAnatoly had rethought the situation. “She might be useful. We may need a threat detector.”\n“Or camp cleanup services,” Edie said, stroking Sally’s back.\n“And if we get hungry enough, she’s food that won’t spoil,” Anatoly added.\nEdie and Seabird objected strenuously.\nI felt like I was reliving the Great Dog Debate. They weren’t old enough to remember it. The arguments had been absurdly pseudo-rational, but in the end it had boiled down to sentiment. Pretty soon someone would say, “If the ancestors hadn’t thought dogs would be useful they wouldn’t have given us the embryos.”\nThen Seabird said it. I wanted to groan.\nAmal was trying to be leaderly, and not take sides. He looked at Davern. “Don’t ask me,” Davern said. “It’s not my responsibility.”\nHe looked at me then. Of course, I didn’t want to harm the dog; but keeping her alive would take a lot of resources. “You don’t know yet what it will be like,” I said.\nAmal seized on my words. “That’s right,” he said, “we don’t have enough information. Let’s take another vote in thirty hours.” It was the perfect compromise: the decision to make no decision.\nOf course, the dog ended up in the tent with the rest of us as we slept.\nStupid! Stupid! Yes, I know. But also kind-hearted and humane in a way my hardened pioneer generation could not afford to be. It was as if my companions were recovering a buried memory of what it had once been like to be human.\nThe next tenhours’ journey was a pleasant stroll down the river valley speckled with groves of lookthrough trees. Umber had set and the sun was still high, so we could safely go without goggles, the breeze blowing like freedom on our faces. Twenty hours of sunlight had warmed the air, and the river ran ice-free at our side. We threw sticks into it for Sally to dive in and fetch.\nWe slept away another tenhour, and rose as the sun was setting. From atop the hill on which we had camped, we could see far ahead where the Let’s Go flowed into the Mazy Lakes, a labyrinth of convoluted inlets, peninsulas, and islands. In the fading light I carefully reviewed my maps, comparing them to what I could see. There was a way through it, but we would have to be careful not to get trapped.\nAs night deepened, we began to pick our way by lantern-light across spits of land between lakes. Anatoly kept thinking he saw faster routes, but Amal said, “No, we’re following Mick.” I wasn’t sure I deserved his trust. A couple of times I took a wrong turn and had to lead the way back.\n“This water looks strange,” Amal said, shining his lantern on the inky surface. There was a wind blowing, but no waves. It looked like black gelatin.\nThe dog, thinking she saw something in his light, took a flying leap into the lake. When she broke the surface, it gave a pungent fart that made us groan and gag. Sally floundered around, trying to find her footing in a foul substance that was not quite water, not quite land. I was laughing and trying to hold my breath at the same time. We fled to escape the overpowering stench. Behind us, the dog found her way onto shore again, and got her revenge by shaking putrid water all over us.\n“What the hell?” Amal said, covering his nose with his arm.\n“Stromatolites,” I explained. They looked at me as if I were speaking ancient Greek—which I was, in a way. “The lakes are full of bacterial colonies that form thick mats, decomposing as they grow.” I looked at Edie. “They’re one of the things on Dust we can actually eat. If you want to try a stromatolite steak, I can cut you one.” She gave me the reaction I deserved.\nAfter ten hours, we camped on a small rise surrounded by water on north and south, and by stars above. The mood was subdued. In the perpetual light, it had been easy to feel we were in command of our surroundings. Now, the opaque ceiling of the sky had dissolved, revealing the true immensity of space. I could tell they were feeling how distant was our refuge. They were dwarfed, small, and very far from home.\nTo my surprise, Amal reached into his backpack and produced, of all things, a folding aluminum mandolin. After all our efforts to reduce baggage, I could not believe he had wasted the space. But he assembled and tuned it, then proceeded to strum some tunes I had never heard. All the others seemed to know them, since they joined on the choruses. The music defied the darkness as our lantern could not.\n“Are there any songs about Umbernight?” I asked when they paused.\nStrumming softly, Amal shook his head. “We ought to make one.”\n“It would be about the struggle between light and unlight,” Edie said.\n“Or apocalypse,” Anatoly said. “When Umber opens its eye and sees us, only the just survive.”\nTheir minds moved differently than mine, or any of my generation’s. They saw not just mechanisms of cause and effect, but symbolism and meaning. They were generating a literature, an indigenous mythology, before my eyes. It was dark, like Dust, but with threads of startling beauty.\nWe woke to darkness. The temperature had plummeted, so we pulled on our heavy coldsuits. They were made from the same radiation-blocking material as our tent, but with thermal lining and piezoelectric heating elements so that if we kept moving, we could keep warm. The visored hoods had vents with micro-louvers to let us breathe, hear, and speak without losing too much body heat.\n“What about the dog?” Amal asked. “We don’t have a coldsuit for her.”\nEdie immediately set to work cutting up some of the extra fabric we had brought for patching things. Amal tried to help her wrap it around Sally and secure it with tape, but the dog thought it was a game, and as their dog-wrestling grew desperate, they ended up collapsing in laughter. I left the tent to look after Bucky, and when I next saw Sally she looked like a dog mummy with only her eyes and nose poking through. “I’ll do something better when we stop next,” Edie pledged.\nThe next tenhour was a slow, dark trudge through icy stromatolite bogs. When the water froze solid enough to support the buggy, we cut across it to reach the edge of the Mazy Lakes, pushing on past our normal camping time. Once on solid land, we were quick to set up the tent and the propane stove to heat it. Everyone crowded inside, eager to shed their coldsuits. Taking off a coldsuit at the end of the day is like emerging from a stifling womb, ready to breathe free.\nAfter lights out, I was already asleep when Seabird nudged me. “There’s something moving outside,” she whispered.\n“No, there’s not,” I muttered. She was always worried that we were deviating from plan, or losing our way, or not keeping to schedule. I turned over to go back to sleep when Sally growled. Something hit the roof of the tent. It sounded like a small branch falling from a tree, but there were no trees where we had camped.\n“Did you hear that?” Seabird hissed.\n“Okay, I’ll check it out.” It was hard to leave my snug sleep cocoon and pull on the coldsuit again—but better me than her, since she would probably imagine things and wake everyone.\nIt was the coldest part of night, and there was a slight frost of dry ice on the rocks around us. Everything in the landscape was motionless. Above, the galaxy arched, a frozen cloud of light. I shone my lamp on the tent to see what had hit it, but there was nothing. All was still.\nIn the eastern sky, a dim, gray smudge of light was rising over the lakes. Umber. I didn’t stare long, not quite trusting the UV shielding on my faceplate, but I didn’t like the look of it. I had never read that the shroud began to glow before it parted, but the observations from the last Umbernight were not detailed, and there were none from the time before that. Still, I crawled back into the safety of the tent feeling troubled.\n“What was it?” Seabird whispered.\n“Nothing.” She would think that was an evasion, so I added, “If anything was out there, I scared it off.”\nWhen we rose, I left the tent first with the UV detector. The night was still just as dark, but there was no longer a glow in the east, and the increase of radiation was not beyond the usual fluctuations. Nevertheless, I quietly mentioned what I had seen to Amal.\n“Are you sure it’s significant?” he said.\nI wasn’t sure of anything, so I shook my head.\n“I’m not going to call off the mission unless we’re sure.”\nI probably would have made the same decision. At the time, there was no telling whether it was wise or foolish.\nBucky was cold after sitting for ten hours, and we had barely started when a spring in his suspension broke. It took me an hour to fix it, working awkwardly in my bulky coldsuit, but we finally set off. We had come to the Damn Right Barrens, a rocky plateau full of the ejecta from the ancient meteor strike that had created Newton’s Eye. The farther we walked, the more rugged it became, and in the dark it was impossible to see ahead and pick out the best course.\nDavern gave a piteous howl of pain, and we all came to a stop. He had turned his ankle. There was no way to examine it without setting up the tent, so Amal took some of the load from the buggy and carried it so Davern could ride. After another six hours of struggling through the boulders, I suggested we camp and wait for daybreak. “We’re ahead of schedule,” I said. “It’s wiser to wait than to risk breaking something important.”\n“My ankle’s not important?” Davern protested.\n“Your ankle will heal. Bucky’s axle won’t.”\nSulkily, he said, “You ought to marry that machine. You care more for it than any person.”\nI would have answered, but I saw Edie looking at me in warning, and I knew she would give him a talking-to later on.\nWhen we finally got a look at Davern’s ankle inside the tent, it was barely swollen, and I suspected him of malingering for sympathy. But rather than have him slow us down, we all agreed to let him ride till it got better.\nDay came soon after we had slept. We tackled the Damn Right again, moving much faster now that we could see the path. I made them push on till we came to the edge of the Winding Wall.\nComing on the Winding Wall is exhilarating or terrifying, depending on your personality. At the end of an upward slope the world drops suddenly away, leaving you on the edge of sky. Standing on the windy precipice, you have to lean forward to see the cliffs plunging nearly perpendicular to the basin of the crater three hundred meters below. To right and left, the cliff edge undulates in a snaky line that forms a huge arc vanishing into the distance—for the crater circle is far too wide to see across.\n“I always wish for wings here,” I said as we lined the edge, awestruck.\n“How are we going to get down?” Edie asked.\n“There’s a way, but it’s treacherous. Best to do it fresh.”\n“We’ve got thirty hours of light left,” Amal said.\n“Then let’s rest up.”\nIt was noon when we rose, and Umber had set. I led the way to the spot where a ravine pierced the wall. Unencumbered by coldsuits, we were far more agile, but Bucky still had only four wheels and no legs. We unloaded him in order to use the cart bed as a ramp, laying it over the rugged path so he could pass, and ferrying the baggage by hand, load after load. Davern was forced to go by foot when it got too precarious, using a tent pole for a cane.\nIt was hard, sweaty work, but twelve hours later we were at the bottom, feeling triumphant. We piled into the tent and slept until dark.\nThe next leg of the journey was an easy one over the sandy plain of the crater floor. Through the dark we walked then slept, walked then slept, until we started seeing steam venting from the ground as we reached the geothermically active region at the center of the crater. Here we came on the remains of an old road built by the original settlers when they expected to be staying at Newton’s Eye. It led through the hills of the inner crater ring. When we paused at the top of the rise, I noticed the same smudge of light in the sky I had seen before. This time, I immediately took a UV reading, and the levels had spiked. I showed it to Amal.\n“The shroud’s thinning,” I said.\nI couldn’t read his expression through the faceplate of his coldsuit, but his body language was all indecision. “Let’s take another reading in a couple hours,” he said.\nWe did, but there was no change.\nWe were moving fast by now, through a landscape formed by old eruptions. Misshapen claws of lava reached out of the darkness on either side, frozen in the act of menacing the road. At last, as we were thinking of stopping, we spied ahead the shape of towering ribs against the stars—the remains of the settlers’ original landing craft, or the parts of it too big to cannibalize. With our goal so close, we pushed on till we came to the cleared plain where it lay, the fossil skeleton of a monster that once swam the stars.\nWe all stood gazing at it, reluctant to approach and shatter its isolation. “Why don’t we camp here?” Edie said.\nWe had made better time than I had expected. The plan had been to arrive just as the cargo capsule did, pick up the payload, and head back immediately; but we were a full twenty hours early. We could afford to rest.\nI woke before the others, pulled on my protective gear, and went outside to see the dawn. The eastern sky glowed a cold pink and azure. The landing site was a basin of black volcanic rock. Steaming pools of water made milky with dissolved silicates dappled the plain, smelling of sodium bicarbonate. As I watched the day come, the pools turned the same startling blue as the sky, set like turquoise in jet.\nThe towering ribs of the lander now stood out in the strange, desolate landscape. I thought of all the sunrises they had seen—each one a passing fragment of time, a shard of a millennium in which this one was just a nanosecond of nothing.\nBehind me, boots crunched on cinders. I turned to see that Amal had joined me. He didn’t greet me, just stood taking in the scene.\nAt last he said, “It’s uplifting, isn’t it?”\nStartled, I said, “What is?”\n“That they came all this way for the sake of reason.”\nCame all this way to a desolation of rock and erosion stretching to the vanishing point—no, uplifting was not a word I would use. But I didn’t say so.\nHe went back to the tent to fetch the others, and soon I was surrounded by youthful energy that made me despise my own sclerotic disaffection. They all wanted to go explore the ruins, so I waved them on and returned to the tent to fix my breakfast.\nAfter eating, I went to join them. I found Seabird and Davern bathing in one of the hot pools, shaded by an awning constructed from their coldsuits. “You’re sure of the chemicals in that water, are you?” I asked.\n“Oh stop worrying,” Davern said. “You’re just a walking death’s-head, Mick. You see danger everywhere.”\nAhead, the other three were clustered under the shadow of the soaring ship ribs. When I came up, I saw they had found a stone monument, and were standing silently before it, the hoods of their coldsuits thrown back. Sally sat at Edie’s feet.\n“It’s a memorial to everyone who died in the first year,” Edie told me in a hushed voice.\n“But that’s not the important part,” Anatoly said intently. He pointed to a line of the inscription, a quotation from Theodore Cam, the legendary leader of the exiles. It said:\nGaze into the unknowable from a bridge of evidence.\n“You see?” Anatoly said. “He knew there was something unknowable. Reason doesn’t reach all the way. There are other truths. We were right, there is more to the universe than just the established facts.”\nI thought back to Feynman Habitat, and how the pursuit of knowledge had contracted into something rigid and dogmatic. No wonder my generation had failed to inspire. I looked up at the skeleton of the spacecraft making its grand, useless gesture to the sky. How could mere reason compete with that?\nAfter satisfying my curiosity, I trudged back to the tent. From a distance I heard a whining sound, and when I drew close I realized it was coming from Bucky. Puzzled, I rummaged through his load to search for the source. When I realized what it was, my heart pulsed in panic. Instantly, I put up the hood on my coldsuit and ran to warn the others.\n“Put on your coldsuits and get back to the tent!” I shouted at Seabird and Davern. “Our X-ray detector went off. The shroud has parted.”\nUmber was invisible in the bright daylight of the western sky, but a pulse of X-rays could only mean one thing.\nWhen I had rounded them all up and gotten them back to the shielded safety of the tent, we held a council.\n“We’ve got to turn around and go back, this instant,” I said.\nThere was a long silence. I turned to Amal. “You promised.”\n“I promised we’d turn back if Umbernight came on our way out,” he said. “We’re not on the way out any longer. We’re here, and it’s only ten hours before the capsule arrives. We’d be giving up in sight of success.”\n“Ten hours for the capsule to come, another ten to get it unpacked and reloaded on Bucky,” I pointed out. “If we’re lucky.”\n“But Umber sets soon,” Edie pointed out. “We’ll be safe till it rises again.”\nI had worked it all out. “By that time, we’ll barely be back to the Winding Wall. We have to go up that path this time, bathed in X-rays.”\n“Our coldsuits will shield us,” Anatoly said. “It will be hard, but we can do it.”\nThe trip up to now had been too easy; it had given them inflated confidence.\nAnatoly looked around at the others, his face fierce and romantic with a shadow of black beard accentuating his jawline. “I’ve realized now, what we’re doing really matters. We’re not just fetching baggage. We’re a link to the settlers. We have to live up to their standards, to their . . . heroism.” He said the last word as if it were unfamiliar—as indeed it was, in the crabbed pragmatism of Feynman Habitat.\nI could see a contagion of inspiration spreading through them. Only I was immune.\n“They died,” I said. “Two thirds of them. Didn’t you read that monument?”\n“They didn’t know what we do,” Amal argued. “They weren’t expecting Umbernight.”\nAnatoly saw I was going to object, and spoke first. “Maybe some of us will die, too. Maybe that is the risk we need to take. They were willing, and so am I.”\nHe was noble, committed, and utterly serious.\n“No one wants you to die!” I couldn’t keep the frustration from my voice. “Your dying would be totally useless. It would only harm the rest of us. You need to live. Sorry to break it to you.”\nThey were all caught up in the kind of crazy courage that brought the settlers here. They all felt the same devotion to a cause, and they hadn’t yet learned that the universe doesn’t give a rip.\n“Listen,” I said, “you’ve got to ask yourself, what’s a win here? Dying is not a win. Living is a win, even if it means living with failure.”\nAs soon as I said the last word, I could see it was the wrong one.\n“Let’s vote,” said Amal. “Davern, what about you? You haven’t said anything.”\nDavern looked around at the others, and I could see he was sizing up who to side with. “I’m with Anatoly,” he said. “He understands us.”\nAmal nodded as if this made sense. “How about you, Seabird?”\nShe looked up at Anatoly with what I first thought was admiration—then I realized it was infatuation. “I’ll follow Anatoly,” she said with feeling.\nThe followers in our group had chosen Anatoly as their leader.\n“I vote with Anatoly, too,” said Amal. “I think we’ve come this far, it would be crazy to give up now. Edie?”\n“I respect Mick’s advice,” she said thoughtfully. “But our friends back home are counting on us, and in a way the settlers are counting on us, too. All those people died so we could be here, and to give up would be like letting them down.”\nI pulled up the hood of my coldsuit and headed out of the tent. Outside, the day was bright and poisonous. The coldsuit shielded me from the X-rays, but not from the feeling of impending disaster. I looked across to the skeletal shipwreck and wondered: what are we doing here on Dust? The settlers chose this, but none of us asked to be born here, exiled from the rest of humanity, like the scum on the sand left by the highest wave. We aren’t noble pioneers. We’re only different from the bacteria because we are able to ask what the hell this is all about. Not answer, just ask.\nSomeone came out of the tent behind me, and I looked to see who it was this time. Edie. She came to my side. “Mick, we are so thankful that you’re with us,” she said. “We do listen to you. We just agreed to go to a twelve-hour work shift on the way back, to speed things up. We’ll get back.”\nI truly wished she weren’t here. She was the kind of person who ought to be protected, so she could continue to bring cheer to the world. She was too valuable to be thrown away.\n“It’s not about me,” I said. “I’ve got less life to lose than the rest of you.”\n“No one’s going to lose their lives,” she said. “I promise.”\nWhy can’t I quit asking what more I could have done? I’m tired of that question. I still don’t know what else there was to do.\nTen hours later, there was no sign of the supply ship. Everyone was restless. We had slept and risen again, and now we scanned the skies every few minutes, hoping to see something.\nEdie looked up from fashioning little dog goggles and said, “Do you suppose it’s landed somewhere else?” Once she had voiced the idea, it became our greatest worry. What if our assumption about the landing spot was wrong? We told ourselves it was just that the calculations had been off, or the ship was making an extra orbit. Now that we had made the commitment to stay, no one wanted to give up; but how long were we prepared to wait?\nIn the end, we could not have missed the lander’s descent. It showed up first as a bright spot in the western sky. Then it became a fiery streak, and we saw the parachutes bloom. Seconds later, landing rockets fired. We cheered as, with a roar that shook the ground, the craft set down in a cloud of dust barely a kilometer from us. As the warm wind buffeted us, even I felt that the sight had been worth the journey.\nBy the time we had taken down the tent, loaded everything on Bucky, and raced over to the landing site, the dust had settled and the metal cooled. It was almost sunset, so we worked fast in the remaining light. One team unloaded everything from Bucky while another team puzzled out how to open the cargo doors. The inside of the spacecraft was tightly packed with molded plastic cases we couldn’t work out how to open, so we just piled them onto the buggy as they came out. We would leave the thrill of discovery to our friends back home.\nBucky was dangerously overloaded before we had emptied the pod, so we reluctantly secured the doors with some of the crates still inside to stay the winter at Newton’s Eye. We could only hope that we had gotten the most important ones.\nThere was still a lot of work to do, sorting out our baggage and redistributing it, and we worked by lamplight into the night. By the time all was ready, we were exhausted. Umber had not yet risen, so there was no need to set up the tent, and we slept on the ground in the shadow of the lander. I was so close that I could reach out and touch something that had come all the way from the homeworld.\nWe set out into the night as soon as we woke. Bucky creaked and groaned, but I said encouraging words to him, and he seemed to get used to his new load. All of us were more heavily laden now, and the going would have been slower even if Bucky could have kept up his usual pace. When we reached the top of the inner crater ring we paused to look back at the plain where two spacecraft now stood. In the silence of our tribute, the X-ray alarm went off. Invisible through our UV-screening faceplates, Umber was rising in the east. Umbernight was ahead.\nWe walked in silence. Sally hung close to us in her improvised coldsuit, no longer roving and exploring. From time to time she froze in her tracks and gave a low growl. But nothing was there.\n“What’s she growling at, X-rays?” Anatoly said.\n“She’s just picking up tension from us,” Edie said, reaching down to pat the dog’s back.\nHalf a mile later, Sally lunged forward, snapping at the air as if to bite it. Through the cloth of her coldsuit, she could not have connected with anything, even if anything had been there.\n“Now I’m picking up on her tension,” Davern said.\n“Ouch! Who did that?” Seabird cried out, clutching her arm. “Somebody hit me.”\n“Everyone calm down,” Edie said. “Look around you. There’s nothing wrong.”\nShe shone her lamp all around, and she was right; the scene looked exactly as it had when we had traversed it before—a barren, volcanic plain pocked with steaming vents and the occasional grove of everlive trees. The deadly radiation was invisible.\nAnother mile farther on, Amal swore loudly and slapped his thigh as if bitten by a fly. He bent over to inspect his coldsuit and swore again. “Something pierced my suit,” he said. “There’s three pinholes in it.”\nSally started barking. We shone our lights everywhere, but could see nothing.\nIt was like being surrounded by malicious poltergeists that had gathered to impede our journey. I quieted the dog and said, “Everyone stop and listen.”\nAt first I heard nothing but my own heart. Then, as we kept still, it came: a rustling of unseen movement in the dark all around us.\n“We’ve got company,” Anatoly said grimly.\nI wanted to deny my senses. For years I had been searching for animal life on Dust, and found none—not even an insect, other than the ones we brought. And how could anything be alive in this bath of radiation? It was scientifically impossible.\nWe continued on more carefully. After a while, I turned off my headlamp and went out in front to see if I could see anything without the glare of the light. At first there was nothing, but as my eyes adjusted, something snagged my attention out of the corner of my eye. It was a faint, gauzy curtain—a net hanging in the air, glowing a dim blue-gray. It was impossible to tell how close it was—just before my face, or over the next hill? I swept my arm out to disturb it, but touched nothing. So either it was far away, or it was inside my head.\nSomething slapped my faceplate, and I recoiled. There was a smear of goo across my visor. I tried to wipe it off, and an awful smell from my breathing vent nearly gagged me. Behind me, Amal gave an exclamation, and I thought he had smelled it too, but when I turned to see, he was looking at his foot.\n“I stepped on something,” he said. “I could feel it crunch.”\n“What’s that disgusting smell?” Davern said.\n“Something slimed me,” I answered.\n“Keep on going, everyone,” Edie said. “We can’t stop to figure it out.”\nWe plodded on, a slow herd surrounded by invisible tormentors. We had not gotten far before Amal had to stop because his boot was coming apart. We waited while he wrapped mending tape around it, but that lasted only half an hour before the sole of his boot was flapping free again. “I’ve got to stop and fix this, or my foot will freeze,” he said.\nWe were all a little grateful to have an excuse to set up the tent and stop our struggle to continue. Once inside, we found that all of our coldsuits were pierced with small cuts and pinholes. We spent some time repairing them, then looked at each other to see who wanted to continue.\n“What happens if we camp while Umber is in the sky, and only travel by day?” Edie finally asked.\nI did a quick calculation. “It would add another 300 hours. We don’t have food to last.”\n“If we keep going, our coldsuits will be cut to ribbons,” Davern said.\n“If only we could see what’s attacking us!” Edie exclaimed.\nSoftly, Seabird said, “It’s ghosts.” We all fell silent. I looked at her, expecting it was some sort of joke, but she was deadly serious. “All those people who died,” she said.\nAt home, everyone would have laughed and mocked her. Out here, no one replied.\nI pulled up the hood of my coldsuit and rose.\n“Where are you going?” Davern said.\n“I want to check out the lookthrough trees.” In reality, I wanted some silence to think.\n“What a time to be botanizing!” Davern exclaimed.\n“Shut up, Davern,” Amal said.\nOutside, in the empty waste, I had a feeling of being watched. I shook it off. When we had camped, I had noticed that a nearby grove of lookthrough trees was glowing in the dark, shades of blue and green. I picked my way across the rocks toward them. I suspected that the fluorescence was an adaptation that allowed them to survive the hostile conditions of Umbernight, and I wanted some samples. When I reached the grove and examined one of the long, flat leaves under lamplight, it looked transparent, as usual. Shutting my lamp off, I held it up and looked through it. With a start, I pressed it to my visor so I could see through the leaf.\nWhat looked like a rocky waste by the dim starlight was suddenly a brightly lit landscape. And everywhere I looked, the land bloomed with organic shapes unlike any I had ever seen. Under a rock by my feet was a low, domed mound pierced with holes like an overturned colander, glowing from within. Beneath the everlives were bread-loaf-shaped growths covered with plates that slid aside as I watched, to expose a hummocked mound inside. There were things with leathery rinds that folded out like petals to collect the unlight, which snapped shut the instant I turned on my lamp. In between the larger life-forms, the ground was crawling with smaller, insect-sized things, and in the distance I could see gauzy curtains held up by gas bladders floating on the wind.\nAn entire alternate biota had sprung to life in Umberlight. Dust was not just the barren place we saw by day, but a thriving dual ecosystem, half of which had been waiting as spores or seeds in the soil, to be awakened by Umber’s radiation. I knelt down to see why they had been so invisible. By our light, some of them were transparent as glass. Others were so black they blended in with the rock. By Umberlight, they lit up in bright colors, reflecting a spectrum we could not see.\nI looked down at the leaf that had given me new sight. It probably had a microstructure that converted high-energy radiation into the visible spectrum so the tree could continue to absorb the milder wavelengths. Quickly, I plucked a handful of the leaves. Holding one to my visor, I turned back toward the tent. The UV-reflecting fabric was a dull gray in our light, but Umberlight made it shine like a beacon, the brightest thing in the landscape. I looked down at my coldsuit, and it also glowed like a torch. The things of Umbernight might be invisible to us, but we were all too visible to them.\nWhen I came back into the tent, my companions were still arguing. Silently, I handed each of them a strip of leaf. Davern threw his away in disgust. “What’s this, some sort of peace offering?” he said.\n“Put on your coldsuits and come outside,” I said. “Hold the leaves up to your faceplates and look through them.”\nTheir reactions, when they saw the reality around us, were as different as they were: astonished, uneasy, disbelieving. Seabird was terrified, and shrank back toward the tent. “It’s like nightmares,” she said.\nEdie put an arm around her. “It’s better than ghosts,” she said.\n“No, it’s not. It’s the shadow side of all the living beings. That’s why we couldn’t see them.”\n“We couldn’t see them because they don’t reflect the spectrum of light our eyes absorb,” Amal said reasonably. Seabird did not look comforted.\nI looked ahead, down the road we needed to take. Umber was bright as an anti-sun. In its light, the land was not empty, but full. There was a boil of emerging life in every crack of the landscape: just not our sort of life. We were the strangers here, the fruits that had fallen too far from the tree. We did not belong.\nYou would think that being able to see the obstacles would speed us up, but not so. We were skittish now. With strips of lookthrough leaves taped to our visors, we could see both worlds, which were the same world; but we could not tell the harmless from the harmful. So we treated it all as a threat—dodging, detouring, clearing the road with a shovel when we could. As we continued, the organisms changed and multiplied fast around us, as if their growth were in overdrive. It was spring for them, and they were sprouting and spawning. What would they look like fully grown? I hoped not to find out.\nI can’t describe the life-forms of Umbernight in biological language, because I couldn’t tell if I was looking at a plant, animal, or something in between. We quickly discovered what had been piercing our coldsuits—a plantlike thing shaped like a scorpion with a spring-loaded tail lined with barbs. When triggered by our movement, it would release a shower of pin-sharp projectiles. Perhaps they were poison, and our incompatible proteins protected us.\nThe road had sprouted all manner of creatures covered with plates and shells—little ziggurats and stepped pyramids, spirals, and domes. In between them floated bulbs like amber, airborne eggplants. They spurted a mucus that ate away any plastic it touched.\nWe topped a rise to find the valley before us completely crusted over with life, and no trace of a path. No longer could we avoid trampling through it, crushing it underfoot. Ahead, a translucent curtain suspended from floating, gas-filled bladders hung across our path. It shimmered with iridescent unlight.\n“It’s rather beautiful, isn’t it?” Edie said.\n“Yes, but is it dangerous?” Amal said.\n“We’re not prey,” Anatoly argued. “This life can’t get any nutrients from us.”\n“I doubt it knows that,” I said. “It might just act on instinct.”\n“We could send the dog to find out,” Anatoly suggested.\nSally showed no inclination. Edie had put her on a leash, but it was hardly necessary; she was constantly alert now, on guard.\n“Go around it,” I advised.\nSo we left our path to detour across land where the boulders had become hard to spot amid the riot of life. As Bucky’s wheels crushed the shell of one dome, I saw that inside it was a wriggling mass of larvae. It was not a single organism, but a colony. That would explain how such complex structures came about so fast; they were just hives of smaller organisms.\nWe cleared a place to camp by trampling down the undergrowth and shoveling it out of the way. Exhausted as we were, it was still hard to sleep through the sounds from outside: buzzing, whooshing, scratching, scrabbling. My brain kept coming back to one thought: at this rate, our return would take twice as long as the journey out.\nThe tent was cold when we woke; our heater had failed. When Amal unfastened the tent flap he gave an uncharacteristically profane exclamation. The opening was entirely blocked by undergrowth. No longer cautious, we set about hacking and smashing our way out, disturbing hordes of tiny crawling things. When we had cleared a path and turned back to look, we saw that the tent was surrounded by mounds of organisms attracted by its reflected light. The heater had failed because its air intake was blocked. Bucky, parked several yards away, had not attracted the Umberlife.\nIt was the coldest part of night, but Umber was high in the sky, and the life-forms had speeded up. We marched in formation now, with three fanned out in front to scan for obstructions, one in the center with Bucky, and two bringing up the rear. I was out in front with Seabird and Davern when we reached a hilltop and saw that the way ahead was blocked by a lake that had not been there on the way out. We gathered to survey it. It was white, like an ocean of milk.\n“What is it?” Edie asked.\n“Not water,” Anatoly said. “It’s too cold for that, too warm for methane.”\nI could not see any waves, but there was an ebb and flow around the edges. “Wait here. I want to get closer,” I said.\nAmal and Anatoly wouldn’t let me go alone, so the three of us set out. We were nearly on the beach edge before we could see it clearly. Amal came to an abrupt halt. “Spiders!” he said, repulsed. “It’s a sea of spiders.”\nThey were not spiders, of course, but that is the closest analog: long-legged crawling things, entirely white in the Umberlight. At the edges of the sea they were tiny, but farther out we could see ones the size of Sally, all seemingly competing to get toward the center of the mass. There must have been a hatching while we had slept.\n“That is truly disgusting,” Anatoly said.\nI gave a humorless laugh. “I’ve read about this on other planets—wildlife covering the land. The accounts always say it is a majestic, inspiring sight.”\n“Umber turns everything into its evil twin,” Amal said.\nAs we stood there, a change was taking place. A wave was gathering far out. The small fry in front of us were scattering to get out of the way as it swept closer.\n“They’re coming toward us,” Anatoly said.\nWe turned to run back toward the hill where we had left our friends. Anatoly and Amal reached the hilltop before I did. Edie shouted a warning, and I turned to see a knee-high spider on my heels, its pale body like a skull on legs. I had no weapon but my flashlight, so I nailed it with a light beam. To my surprise, it recoiled onto its hind legs, waving its front legs in the air. It gave me time to reach the others.\n“They’re repelled by light!” I shouted. “Form a line and shine them off.”\nThe wave of spiders surged up the hill, but we kept them at bay with our lights. They circled us, and we ended up in a ring around Bucky, madly sweeping our flashlights to and fro to keep them off while Sally barked from behind us.\nFar across the land, the horizon lit with a silent flash like purple lightning. The spiders paused, then turned mindlessly toward this new light source. As quickly as they had swarmed toward us, they were swarming away. We watched the entire lake of them drain, heading toward some signal we could not see.\n“Quick, let’s cross while they’re gone,” I said.\nWe dashed as fast as we could across the plain where they had gathered. From time to time we saw other flashes of unlight, always far away and never followed by thunder.\nIn our haste, we let our vigilance lapse, and one of Bucky’s wheels thunked into a pothole. The other wheels spun, throwing up loose dirt and digging themselves in. I called out, “Bucky, stop!”—but he was already stuck fast.\n“Let’s push him out,” Amal said, but I held up a hand. The buggy was already dangerously tilted.\n“We’re going to have to unload some crates to lighten him up, and dig that wheel out.”\nEveryone looked nervously in the direction where the spiders had gone, but Amal said, “Okay. You dig, we’ll unload.”\nWe all set to work. I was so absorbed in freeing Bucky’s wheel that I did not see the danger approaching until Seabird gave a cry of warning. I looked up to see one of the gauzy curtains bearing down on us from windward. It was yards wide, big enough to envelop us all, and twinkling with a spiderweb of glowing threads.\n“Run!” Amal shouted. I dropped my shovel and fled. Behind me, I heard Edie’s voice crying, “Sally!” and Amal’s saying, “No, Edie! Leave her be!”\nI whirled around and saw that the dog had taken refuge under the buggy. Edie was running back to get her. Amal was about to head back after Edie, so I dived at his legs and brought him down with a thud. From the ground we both watched as Edie gave up and turned back toward us. Behind her, the curtain that had been sweeping toward Bucky changed direction, veering straight toward Edie.\n“Edie!” Amal screamed. She turned, saw her danger, and froze.\nThe curtain enveloped her, wrapping her tight in an immobilizing net. There was a sudden, blinding flash of combustion. As I blinked the after-spots away, I saw the curtain float on, shredded now, leaving behind a charcoal pillar in the shape of a woman.\nMotionless with shock, I gazed at that black statue standing out against the eastern sky. It was several seconds before I realized that the sky was growing bright. Beyond all of us, dawn was coming.\nIn the early morning light Anatoly and I dug a grave while Seabird and Davern set up the tent. We simply could not go on. Amal was shattered with grief, and could not stop sobbing.\n“Why her?” he would say in the moments when he could speak at all. “She was the best person here, the best I’ve ever known. She shouldn’t have been the one to die.”\nI couldn’t wash those last few seconds out of my brain. Why had she stopped? How had that brainless, eyeless thing sensed her?\nLater, Amal became angry at me for having prevented him from saving her. “Maybe I could have distracted it. It might have taken me instead of her.”\nI only shook my head. “We would have been burying both of you.”\n“That would have been better,” he said.\nEveryone gathered as we laid what was left of her in the ground, but no one had the heart to say anything over the grave. When we had filled it in, Sally crept forward to sniff at the overturned dirt. Amal said, “We need to mark it, so we can find it again.” So we all fanned out to find rocks to heap in a cairn on the grave.\nWe no longer feared the return of the spiders, or anything else, because the Umberlife had gone dormant in the sun—our light being as toxic to them as theirs was to us. Everything had retreated into their shells and closed their sliding covers. When we viewed them in our own light they still blended in with the stones of the crater floor.\nWe ate and snatched some hours of sleep while nothing was threatening us. I was as exhausted as the others, but anxious that we were wasting so much daylight. I roused them all before they were ready. “We’ve got to keep moving,” I said.\nWe resumed the work of freeing Bucky where we had left off. When all was ready, we gathered behind him to push. “Bucky, go!” I ordered. His wheels only spun in the sand. “Stop!” I ordered. Then, to the others, “We’re going to rock him out. Push when I say go, and stop when I say stop.” When we got a rhythm going, he rocked back and forth three times, then finally climbed out of the trench that had trapped him.\nAmal helped us reload the buggy, but when it came time to move on, he hung back. “You go ahead,” he said. “I’ll catch up with you.”\n“No way,” I said. “We all go or none of us.”\nHe got angry at me again, but I would not let him pick a fight. We let him have some moments alone at the grave to say goodbye. At last I walked up to him and said, “Come on, Amal. We’ve got to keep moving.”\n“What’s the point?” he said. “The future is gone.”\nBut he followed me back to where the others were waiting.\nHe was right, in one way: nothing we could achieve now would make up for Edie’s loss. How we were going to carry on without her, I could not guess.\nWhen we camped, there was no music now, and little conversation. The Winding Wall was a blue line ahead in the distance, and as we continued, it rose, ever more impassable, blocking our way. We did not reach the spot where the gully path pierced it until we had been walking for thirteen hours. We were tired, but resting would waste the last of the precious sunlight. We gathered to make a decision.\n“Let’s just leave the buggy and the crates, and make a run for home,” Amal said. He looked utterly dispirited.\nDavern and Seabird turned to Anatoly. He was the only one of us who was still resolute. “If we do that, we will have wasted our time,” he said. “We can’t give up now.”\n“That’s right,” Davern said.\nAmal looked at me. There was some sense in his suggestion, but also some impracticality. “If we leave the buggy we’ll have to leave the tent,” I said. “It’s too heavy for us to carry.” We had been spreading it as a tarpaulin over the crates when we were on the move.\n“We knew from the beginning that the wall would be an obstacle,” Anatoly said with determination. “We have to make the effort.”\nI think even Amal realized then that he was no longer our leader.\nWe unloaded the buggy, working till we were ready to drop, then ate and fell asleep on the ground. When we woke, the sun was setting. It seemed too soon.\nEach crate took two people to carry up the steep path. We decided to do it in stages. Back and forth we shuttled, piling our cargo at a level spot a third of the way up. The path was treacherous in the dark, but at least the work was so strenuous we had no need of coldsuits until Umber should rise.\nThe life-forms around us started waking as soon as dark came. It was the predawn time for them, when they could open their shells and exhale like someone shedding a coldsuit. They were quiescent enough that we were able to avoid them.\nFifteen hours later, our cargo was three-quarters of the way up, and we gathered at the bottom again to set up the tent and rest before trying to get Bucky up the path. The X-ray alarm went off while we were asleep, but we were so tired we just shut it off and went on sleeping.\nWhen we rose, an inhuman architecture had surrounded our tent on all sides. The Umberlife had self-organized into domes and spires that on close inspection turned out to be crawling hives. There was something deformed and abhorrent about them, and we were eager to escape our transformed campsite—until Seabird gave a whimper and pointed upward.\nThree hundred meters above, the top of the Winding Wall was now a battlement of living towers that glowed darkly against the sky. Shapes we couldn’t quite make out moved to and fro between the structures, as if patrolling the edge. One fat tower appeared to have a rotating top that emitted a searchlight beam of far-ultraviolet light. It scanned back and forth—whether for enemies or for prey we didn’t know.\nWe realized how conspicuous we were in our glowing coldsuits. “I’d give up breakfast for a can of black paint,” I said.\n“Maybe we could cover ourselves with mud?” Davern ventured.\n“Let’s get out of here first,” Anatoly said.\nThe feeling that the land was aware of us had become too strong.\nGetting Bucky up the steep trail was backbreaking work, but whenever we paused to rest, Umberlife gathered around us. The gully was infested with the plant-creatures that had once launched pins at us; they had grown, and their darts were the size of pencils now. We learned to trigger them with a beam from our flashlights. Every step required a constant, enervating vigilance.\nWhen we had reached the place where we left the crates and stopped to rest, I announced that I was going to scout the trail ahead. No one else volunteered, so I said, “Amal, come with me. Seabird, hold onto the dog.”\nAmal and I picked our way up the steep trail, shining away small attackers. I saw no indication that the Umberlife had blocked the path. When we reached the top and emerged onto the plateau, I stood looking around at the transformed landscape. At my side, Amal said, “Oh my God.”\nThe Damn Right Barrens were now a teeming jungle. Everywhere stood towering, misshapen structures, competing to dominate the landscape. An undergrowth of smaller life clogged the spaces in between. Above, in the Umberlit sky, floated monstrous organisms like glowing jellyfish, trailing tentacles that sparked and sizzled when they touched the ground. Ten or twelve of the lighthouse towers swept their searching beams across the land. There was not a doubt in my mind that this landscape was brutally aware.\nI spotted some motion out of the corner of my eye, but when I turned to see, nothing was there. I thought: only predators and prey need to move fast.\n“Look,” Amal said, pointing. “Weird.”\nIt was a ball, perfectly round and perhaps a yard in diameter, rolling along the ground of its own accord. It disappeared behind a hive-mound and I lost track of it.\nWe had turned to go back down the ravine when one of the searchlight beams swept toward us, and we ducked to conceal ourselves behind a rock. Amal gave an exclamation, and I turned to see that we were surrounded by four of the rolling spheres. They seemed to be waiting for us to make a move, so I pointed my flashlight at one. Instantly, it dissolved into a million tiny crawlers that escaped into the undergrowth. The other spheres withdrew.\n“They’re coordinating with the beacons,” I hissed at Amal. “Hunting cooperatively.”\n“This place is evil,” he said.\nWe dashed toward the head of the gully. Too late, I spotted ahead the largest dart-thrower plant I had ever seen. The spring-loaded tail triggered, releasing its projectiles. I dove to one side. Amal was not quick enough, and a spine the size of an arrow caught him in the throat. He clutched at it and fell to his knees. Somehow, I managed to drag him forward till we were concealed in the gully.\nThe dart had pierced his neck through, and was protruding on the other side. There was no way to give him aid without taking off his coldsuit. He was struggling to breathe. I tried to lift his hood, but the dart was pinning it down. So I said, “Brace yourself,” and yanked the shaft out. He gave a gurgling cry. When I got his hood off, I saw it was hopeless. The dart had pierced a vein, and his coldsuit was filling with dark blood. Still, I ripped at his shirt and tried to bind up the wound until he caught at my hand. His eyes were growing glassy, but his lips moved.\n“Leave it,” he said. He was ready to die.\nI stayed there, kneeling over him as he stiffened and grew cold. My mind was a blank, until suddenly I began to cry. Not just for him—for Edie as well, and for their unborn children, and all the people who would never be gladdened by their presence. I cried for the fact that we had to bury them in this hostile waste, where love and comfort would never touch them again. And I cried for the rest of us as well, because the prospect of our reaching home now seemed so dim.\nWhen Anatoly and I brought the shovel back to the place where I had left Amal, there was nothing to bury. Only an empty coldsuit and a handful of teeth were left on the ground; all other trace of him was gone. Anatoly nudged the coldsuit with his foot. “Should we bury this?”\nMacabre as it sounded, I said, “We might need it.”\nSo we brought it back to our camp. We let the others think we had buried him.\nWe convened another strategy session. I said, “Amal had it right. We need to make a run for it. To hell with the cargo and the buggy. Leave the tent here; it only draws attention to us. We need to travel fast and light.”\nBut Anatoly was still animated by the inspiration of our mission. “We can still succeed,” he said. “We’re close; we don’t need to give up. We just have to outthink this nightmare.”\n“Okay, how?”\n“We bring everything to the head of the gully and build a fort out of the crates. Then we wait till day comes, and make a dash for it while the Umberlife is sleeping.”\n“We can only get as far as the Mazy Lakes before night,” I said.\n“We do the same thing over again—wait out Umbernight. Food’s no longer such a problem, with two less people.”\nI saw true faith in Seabird’s eyes, and calculated self-interest in Davern’s. Anatoly was so decisive, they were clearly ready to follow him. Perhaps that was all we needed. Perhaps it would work.\n“All right,” I said. “Let’s get going.”\nWe chose a site for our fort in the gully not far from where Amal had died. When it was done, it was a square enclosure of stacked crates with the tent pitched inside. I felt mildly optimistic that it would work. We slept inside it before bringing Bucky up. Then we waited.\nThere were sounds outside. Sally’s warning growls made us worry that something was surrounding us to make an attack, so we set four of our lanterns on the walls to repel intruders, even though it used up precious battery life.\nHours of uneasiness later, dawn came. We instantly broke down the fort and found that the lamps had done their job, since there was a bare circle all around us. We congratulated ourselves on having found a way to survive.\nThe daylight hours were a mad dash across the Damn Right. We had to clear the way ahead of Bucky, and we took out our anger on the hibernating Umberlife, leaving a trail of smashed shells and toppled towers. We reached the edge of the lakes at sunset, and instantly saw that our plan would not work.\nAround the edge of the wetland stood a dense forest of the tallest spires we had yet seen, easily dominating any fort walls we could build. There would be no hope of staying hidden here.\nAt the edge of the lake, the blooming abundance of horrors stopped, as if water were as toxic to them as light. “If only we had a boat!” Anatoly exclaimed. But the life around us did not produce anything so durable as wood—even the shells were friable.\nThe light was fading fast. Soon, this crowded neighborhood would become animate. Ahead, a narrow causeway between two lakes looked invitingly empty. If only we could make it to a campsite far enough from shore, we could build our fort and wait out the night.\n“Let me get out my maps and check our route first,” I said.\nDavern gave an exclamation of impatience, but Anatoly just said, “Hurry up.”\nWe were on the side of the Mazy Lakes where my maps were less complete. On the outward journey, we had cut across the ice; but now, after forty hours of daylight, that was not an option. I was certain of only one route, and it seemed to take off from shore about five miles away. I showed it to the others.\nDavern still wanted to follow the route ahead of us. “We can just go far enough to camp, then come back next day,” he argued. “We’ve already been walking twelve hours.”\n“No. We’re not going to make any stupid mistakes,” I said.\nAnatoly hesitated, then said, “It’s only five miles. We can do that.”\nBut five miles later, it was completely dark and almost impossible to tell the true path from a dozen false ones that took off into the swamp whenever I shone my lamp waterward. I began to think perhaps Davern had been right after all. But rather than risk demoralizing everyone, I chose a path and confidently declared it the right one.\nIt was a low and swampy route, ankle-deep in water at times. I went out ahead with a tent pole to test the footing and scout the way. The sound of Davern complaining came from behind.\nAs soon as we came to a relatively dry spot, we set up the tent, intending to continue searching for a fort site after a short rest. But when we rose, Bucky had sunk six inches into the mud, and we had to unload half the crates before we could push him out. By the time we set out again, we were covered with mud and water.\n“Now we can try Davern’s plan of covering our coldsuits with mud,” I said.\n“We don’t have much choice,” Davern muttered.\nUmber rose before we found a place to stop. Then we discovered that the lakes were not lifeless at all. By Umberlight, the stromatolites fluoresced with orange and black stripes. In spots, the water glowed carmine and azure, lit from underneath. We came to a good camping spot by a place where the lake bubbled and steam rose in clouds. But when the wind shifted and blew the steam our way, we nearly choked on the ammonia fumes. We staggered on, dizzy and nauseous.\nThe fort, I realized, was a solution to yesterday’s problem. Staying put was not a good idea here, where we could be gassed in our sleep. We needed to be ready to move at a moment’s notice.\nGeysers of glowing, sulphur-scented spray erupted on either side of our path. We headed for a hummock that looked like a dry spot, but found it covered by a stomach-turning layer of wormlike organisms. We were forced to march through them, slippery and wriggling underfoot. As we crushed them, they made a sound at a pitch we couldn’t hear. We sensed it as an itchy vibration that made us tense and short-tempered, but Sally was tormented till Seabird tied a strip of cloth over the coldsuit around her ears, making her look like an old woman in a scarf.\nI didn’t say so, but I was completely lost, and had been for some time. It was deep night and the water was freezing by now, but I didn’t trust ice that glowed, so I stayed on the dwindling, switchback path. We were staggeringly weary by the time we reached the end of the road: on the tip of a peninsula surrounded by water. We had taken a wrong turn.\nWe stood staring out into the dark. It was several minutes before I could bring myself to say, “We have to go back.”\nSeabird broke down in tears, and Davern erupted like a geyser. “You were supposed to be the great guide and tracker, and all you’ve done is lead us to a dead end. You’re totally useless.”\nSomehow, Anatoly summoned the energy to keep us from falling on each others’ throats. “Maybe there’s another solution.” He shone his light out onto the lake. The other shore was clearly visible. “See, there’s an ice path across. The whole lake isn’t infested. Where it’s black, the water’s frozen solid.”\n“That could be just an island,” I said.\n“Tell you what, I’ll go ahead to test the ice and investigate. You follow only if it’s safe.”\nI could tell he was going to try it no matter what I said, so I made him tie a long rope around his waist, and anchored it to Bucky. “If you fall through, we’ll pull you out,” I said.\nHe stepped out onto the ice, testing it first with a tent pole. The weakest spot of lake ice is generally near shore, so I expected it to crack there if it was going to. But he got past the danger zone and kept going. From far out on the ice, he flashed his light back at us. “The ice is holding!” he called. “Give me more rope!”\nThere wasn’t any more rope. “Hold on!” I called, then untied the tether from Bucky and wrapped it around my waist. Taking a tent pole, I edged out onto the ice where he had already crossed it. I was about thirty meters out onto the lake when he called, “I made it! Wait there.”\nHe untied his end of the rope to explore the other side. I could not see if he had secured it to anything in case I fell through, so I waited as motionlessly as I could. Before long, he returned. “I’m coming back,” he yelled.\nI was a few steps from shore when the rope pulled taut, yanking me off my feet. I scrambled up, but the rope had gone limp. “Anatoly!” I screamed. Seabird and Davern shone their lights out onto the ice, but Anatoly was nowhere to be seen. I pulled in the rope, but it came back with only a frayed end.\n“Stay here,” I said to the others, then edged gingerly onto the ice. If he was in the water, there was a short window of time to save him. But as I drew closer to the middle, the lake under me lit up with mesmerizing colors. They emanated from an open pool of water that churned and burped.\nThe lake under the black ice had not been lacking in life. It had just been hungry.\nWhen I came back to where the others were waiting, I shook my head, and Seabird broke into hysterical sobs. Davern sat down with his head in his hands.\nI felt strangely numb, frozen as the land around us. At last I said, “Come on, we’ve got to go back.”\nDavern looked at me angrily. “Who elected you leader?”\n“The fact that I’m the only one who can save your sorry ass,” I said.\nWithout Anatoly’s animating force, they were a pitiful sight—demoralized, desperate, and way too young. Whatever their worth as individuals, I felt a strong compulsion to avenge Anatoly’s death by getting them back alive. In this land, survival was defiance.\nI ordered Bucky to reverse direction and head back up the path we had come by. Seabird and Davern didn’t argue. They just followed.\nWe had been retracing our steps for half an hour when I noticed a branching path I hadn’t seen on the way out. “Bucky, stop!” I ordered. “Wait here,” I told the others. Only Sally disobeyed me, and followed.\nThe track headed uphill onto a ridge between lakes. It had a strangely familiar look. When I saw Sally smelling at a piece of discarded trash, I recognized the site of our campsite on the way out. I stood in silence, as if at a graveyard. Here, Amal had played his mandolin and Anatoly had imagined songs of Umbernight. Edie had made Sally’s coldsuit.\nIf we had just gone back instead of trying to cross the ice, we would have found our way.\nI returned to fetch my companions. When Seabird saw the place, memories overwhelmed her and she couldn’t stop crying. Davern and I set up the tent and heater as best we could, and all of us went inside.\n“It’s not fair,” Seabird kept saying between sobs. “Anatoly was trying to save us. He didn’t do anything to deserve to die. None of them did.”\n“Right now,” I told her, “your job isn’t to make sense of it. Your job is to survive.”\nInwardly, I seethed at all those who had led us to expect the world to make sense.\nWe were ten hours away from the edge of the lakes, thirty hours of walking from home. Much as I hated to continue on through Umbernight, I wanted to be able to make a dash for safety when day came. Even after sleeping, Seabird and Davern were still tired and wanted to stay. I went out and shut off the heater, then started dismantling the tent to force them out.\nThe lakes glowed like a lava field on either side of us. From time to time, billows of glowing, corrosive steam enveloped us, and we had to hold our breaths till the wind shifted. But at least I was sure of our path now.\nThe other shore of the Mazy Lakes, when we reached it, was not lined with the towers and spires we had left on the other side; but when we pointed our lights ahead, we could see things scattering for cover. I was about to suggest that we camp and wait for day when I felt a low pulse of vibration underfoot. It came again, rhythmic like the footsteps of a faraway giant. The lake organisms suddenly lost their luminescence. When I shone my light on the water, the dark surface shivered with each vibration. Behind us, out over the lake, the horizon glowed.\n“I think we ought to run for it,” I said.\nThe others took off for shore with Sally on their heels. “Bucky, follow!” I ordered, and sprinted after them. The organisms on shore had closed up tight in their shells. When I reached the sloping bank, I turned back to look. Out over the lake, visible against the glowing sky, was a churning, coal-black cloud spreading toward us. I turned to flee.\n“Head uphill!” I shouted at Davern when I caught up with him. Seabird was ahead of us; I could see her headlamp bobbing as she ran. I called her name so we wouldn’t get separated, then shoved Davern ahead of me up the steep slope.\nWe had reached a high bank when the cloud came ashore, a toxic tsunami engulfing the low spots. Bucky had fallen behind, and I watched as he disappeared under the wave of blackness. Then the chemical smell hit, and for a while I couldn’t breathe or see. By the time I could draw a lungful of air down my burning throat, the sludgy wave was already receding below us. Blinking away tears, I saw Bucky emerge again from underneath, all of his metalwork polished bright and clean. The tent that had been stretched over the crates was in shreds, but the crates themselves looked intact.\nBeside me, Davern was on his knees, coughing. “Are you okay?” I asked. He shook his head, croaking, “I’m going to be sick.”\nI looked around for Seabird. Her light wasn’t visible anymore. “Seabird!” I yelled, desperate at the thought that we had lost her. To my immense relief, I heard her voice calling. “We’re here!” I replied, and flashed my light.\nSounds of someone approaching came through the darkness, but it was only Sally. “Where is she, Sally? Go find her,” I said, but the dog didn’t understand. I swept my light over the landscape, and finally spotted Seabird stumbling toward us without any light. She must have broken hers in the flight. I set out toward her, trying to light her way.\nThe Umberlife around us was waking again. Half-seen things moved just outside the radius of my light. Ahead, one of the creature-balls Amal and I had seen on the other side was rolling across the ground, growing as it moved. It was heading toward Seabird.\n“Seabird, watch out!” I yelled. She saw the danger and started running, slowed by the dark. I shone my light on the ball, but I was too far away to have an effect. The ball speeded up, huge now. It overtook her and dissolved into a wriggling, scrabbling, ravenous mass. She screamed as it covered her, a sound of sheer terror that rose into a higher pitch of pain, then cut off. The mound churned, quivered repulsively, grew smaller, lost its shape. By the time I reached the spot, all that was left was her coldsuit and some bits of bone.\nI rolled some rocks on top of it by way of burial.\nDavern was staring and trembling when I got back to him. He had seen the whole thing, but didn’t say a word. He stuck close to me as I led the way back to Bucky.\n“We’re going to light every lamp we’ve got and wait here for day,” I said.\nHe helped me set up the lights in a ring, squandering our last batteries. We sat in the buggy’s Umbershadow and waited for dawn with Sally at our feet. We didn’t say much. I knew he couldn’t stand me, and I had only contempt for him; but we still huddled close together.\nTo my surprise, Bucky was still operable when the dawn light revived his batteries. He followed as we set off up the Let’s Go Valley, once such a pleasant land, now disfigured with warts of Umberlife on its lovely face. We wasted no time on anything but putting the miles behind us.\nThe sun had just set when we saw the wholesome glow of Feynman Habitat’s yard light ahead. We pounded on the door, then waited. When the door cracked open, Davern pushed past me to get inside first. They welcomed him with incredulous joy, until they saw that he and I were alone. Then the joy turned to shock and grief.\nThere. That is what happened. But of course, that’s not what everyone wants to know. They want to know why it happened. They want an explanation—what we did wrong, how we could have succeeded.\nThat was what the governing committee was after when they called me in later. As I answered their questions, I began to see the narrative taking shape in their minds. At last Anselm said, “Clearly, there was no one fatal mistake. There was just a pattern of behavior: naïve, optimistic, impractical. They were simply too young and too confident.”\nI realized that I myself had helped create this easy explanation, and my remorse nearly choked me. I stood up and they all looked at me, expecting me to speak, but at first I couldn’t say a word. Then, slowly, I started out, “Yes. They were all those things. Naïve. Impractical. Young.” My voice failed, and I had to concentrate on controlling it. “That’s why we needed them. Without their crazy commitment, we would have conceded defeat. We would have given up, and spent the winter hunkered down in our cave, gnawing our old grudges, never venturing or striving for anything beyond our reach. Nothing would move forward. We needed them, and now they are gone.”\nLater, I heard that the young people of Feynman took inspiration from what I said, and started retelling the story as one of doomed heroism. Young people like their heroes doomed.\nMyself, I can’t call it anything but failure. It’s not because people blame me. I haven’t had to justify myself to anyone but this voice in my head—always questioning, always nagging me. I can’t convince it: everyone fails.\nIf I blame anyone, it’s our ancestors, the original settlers. We thought their message to us was that we could always conquer irrationality, if we just stuck to science and reason.\nOh, yes—the settlers. When we finally opened the crates to find out what they had sent us, it turned out that the payload was books. Not data—paper books. Antique ones. Art, philosophy, literature. The books had weathered the interstellar trip remarkably well. Some were lovingly inscribed by the settlers to their unknown descendants. Anatoly would have been pleased to know that the people who sent these books were not really rationalists—they worried about our aspirational well-being. But the message came too late. Anatoly is dead.\nI sit on my bed stroking Sally’s head. What do you think, girl? Should I open the book from my great-grandmother?\nCarolyn Ives Gilman is currently celebrating her decision to quit her job in order to write more science fiction. She has written two novels and five stories in the loosely connected Twenty Planets universe. Her books include Dark Orbit, a space exploration adventure; Isles of the Forsaken and Ison of the Isles, a two-book fantasy about culture clash and revolution; and Halfway Human, a novel about gender and oppression. Her short fiction has appeared in Clarkesworld, Fantasy and Science Fiction, The Year's Best Science Fiction, Lightspeed, Interzone, Universe, Full Spectrum, Realms of Fantasy, and others. She has been nominated for the Nebula Award three times and for the Hugo twice.\nGilman lives in Washington, D.C., and works as a freelance writer and museum consultant. She is also author of several nonfiction books about North American frontier and Native history.", "source": "https://clarkesworldmagazine.com/gilman_02_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Umbernight by Carolyn Ives Gilman"}