{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lettie Prell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "kpUGOjPX+5Zl+u7qGUkLtrnUDsQ=", "id": null, "license": null, "comments": "", "raw_text": "5590 words, short story  Crossing LaSalle  Mara inched forward in the line, painfully aware she looked out of place. She didn’t belong here, with old people in wheelchairs and on gurneys, being pushed along by their relatives, who looked at her and frowned. She wasn’t like the younger people in the line, either, bald from chemotherapy treatments, or coughing up dark stains into handkerchiefs, fragile skin yellowed or pocked. Mara was neither bald nor thin. She brushed a long lock of wavy dark hair behind her ear self-consciously. She clutched her paper form in her other hand—why it had to be printed, she didn’t know—worried that by the time she reached the front of the line it would be disintegrating from her sweat, from the creases she was making in it because of her nervousness.  There were only nine people ahead of her, and twelve behind her, some accompanied by relatives, but it felt like hundreds, like an infinite line that stretched in both directions. She was startled when the line parted like a curtain, the people in front moving to the left and right as more officials were added to the counter. She found herself staring at an older woman with stray red hairs escaping her loose updo, who was looking at her expectantly over the top of her rimless eyeglasses.  Mara’s case suddenly and starkly bared, words stuck in her throat. She fumbled with the form and handed it to the official, who opened it, revealing the checked boxes and printed narrative at the bottom, its one-inch margins, double-spaced, containing Mara’s four reasons for her request.  Reason number one. She didn’t want to die.  Reason number two. If she waited till she was older or got sick, she may not have this opportunity. This option may become unavailable due to shifting policies or unforeseen circumstances.  Reason number three. Overpopulation was taxing the earth’s resources. By being allowed to make this choice, she would be doing her part for climate change, greenhouse gasses, and pollution.  Reason number four. Ahead lay an exciting world of opportunity. She wanted to be part of it.  Watching the woman read, wearing a neutral expression, made Mara’s face grow hot. Maybe her writing was too passionate, or too political, or both. Shifting policies and unforeseen circumstances were euphemisms for the possibility that the tables could turn any instant, and slam the door in her face.  The official turned over the page and glanced at the blank side. Then she looked up at Mara. “You don’t have any affidavits attached.”  Mara blinked. “I’m not sick. It said online they’re not required if—”  “I’ll tell you what’s required. We need affidavits from your medical doctor and a mental health professional. Also your birth certificate so we can verify your age.”  Mara didn’t know if she had a copy of her birth certificate. She looked away, toward the group moving out the glass doors and onto an unmarked gray transport bus. Another set of people heading for safety.  She stood straighter, emboldened. “And when I bring all that back, my application will be approved?”  The woman’s expression seemed to harden, become not just judgmental, but contemptuous. “Your application doesn’t demonstrate high need. You’ll be assigned a priority number.”  Mara hadn’t heard of priority numbers. People were supposed to come in, be processed, and get on the bus to the Newbody Zone. She jabbed a finger at the people slowly filing out the door. “Would the priority number allow me onto that bus?”  “Honestly? No. But you’d go on the list. Discussion continues regarding applicants such as yourself.”  “What’s there to discuss? And what do you mean, applicants like me?”  The official flipped the form across the counter at Mara. “This isn’t some video game. This is forever. Next!”  Mara was angry now. This was so typical of older people, to discount Mara’s entire generation. If anything, her age group was more capable of adapting to the future.  Mara could’ve made a stand, given a whole speech, protested. She could’ve tried to jump into the line for the transport bus. Instead, she left and hopped the Pink Line back to Pilsen, to Heart of Italy and the two-bedroom walk-up she shared with her roommates, Enrico and Remmy.  It didn’t take Mara long to find the community of people who’d also pulled the wrong priority number. They used the hashtag #InLimboChicago, and once approved, she was granted access to their secure chat. Just as she’d suspected, they were mainly her age, thirty-somethings who weren’t suffering from some terminal disease. It was an active group, with more than twenty online at the moment.  They don’t know what to do with us, wrote @HarryOakPark. Our lives don’t have a set expiration date yet.  Mara was lying on the couch in the apartment, her left leg slung over the top of the headrest. Her half-drunk Mountain Dew was sweating a circle onto the smudged glass of the cocktail table. The television took up the other side of the room, with barely enough space to inch past into the tiny kitchen or the hallway to the bathroom and bedrooms.  We’re low-wage slaves, replied @MPoweredGrrl. This sparked a deluge of comment from others.  Using our bodies to fuel the meat-based economy.  They’re still not sure about letting a corporation kill us. That’s how they see it. Murder.  If that’s true and I’m not saying it is. But if it is, one has to question their morality. They let the old and sick go. Expendable lives?  They’re in denial. The singularity will not be televised.  The singularity is privatized. It’s happening in different ways.  I heard there’s a computer in Houston, @HarryOakPark wrote. It’s run by a place called PHI. Post-Human Incorporated. Maybe we can get in on their system.  They’re only taking scientists. The brain trust.  Elitists, wrote @MPoweredGrrl. Screw ‘em.  Wait. Is the Newbody place downloading minds? Or giving people newbodies?  Newbodies.  How would we know? They haven’t been letting information out of the Zone.  Mara jumped in, typing swiftly using her four-finger method. The official who bounced my application said this isn’t a video game. It was so offensive being told that!  They could be downloading, then. There’s been talk. It’s getting real.  Don’t be so sure. A remark like that could mean newbodies just as easily.  Or nothing, @MPoweredGrrl wrote. Just a cruel comment.  The door burst open. Seeing it was Enrico, Mara closed the app and pretended to check email. Enrico peeled off his black baseball jacket and dropped it on the cocktail table. The logo on the jacket’s back, a red heart with a green oak tree growing up its middle, stared back at her accusingly. Love Life. It was the sign of the Newbody protestors, the people who’d rather stop the transport vehicles to the Newbody Zone altogether, even for the dying. The group that a year ago were considered terrorists, before they’d negotiated themselves into legitimacy.  Mara could never tell Enrico about her application, and her encounter with the official. They were on opposite sides of the biggest political divide she’d ever known. She looked up at him and made her voice casual. “Hey. What’s up?”  Enrico was already in the tiny galley kitchen, a matter of five steps. His body was hidden by the opened refrigerator door, his head haloed by the round window behind him. They’d frosted the glass with a spray-on product to hide the view of the brick wall beyond.  “Not much. Work-work. Seeing Cecily later on. There’s no hard cider left.”  “Text Remmy. They’re stopping at the store for more ramen, anyway.”  Enrico slouched in the doorway with one of Mara’s pop cans in his hand. “How’s the job hunt coming?”  “Well, you know. Promising.”  “Liar.”  Mara stared down at her blank screen. “I went to a tech company today but they didn’t have any openings. I couldn’t get in.” That was very nearly a true statement.  Enrico nodded and took a swig of pop. “Everyone wants into tech, but the information age runs on top of the industrial age, which runs on top of the agrarian. Jobs are being squeezed at all levels, sure. But widening your scope should turn up something.”  She nodded, humoring him. She’d been fired from her job at the group home for troubled girls two months ago. She wasn’t suited to dealing with people in crisis like that. Drug addiction, broken homes, abuse. She’d rather geek out on a line of code.  He came over, sat down cross-legged on the rug and set his Dew on the cocktail table. “You’re looking really serious all of a sudden. What’re you thinking?”  Her jaw tightened. “Nothing. Just maybe I should be looking at going into something like insurance.” Enrico worked in a cubicle farm at an insurance company.  He took another huge swallow of Dew, wincing it down. “Wrong time to jump in. Not hiring.”  She’d meant her comment to be sarcastic, and his helpful tone only underscored Mara’s recurring resentment. She took comfort that insurance was one of the troubled industries right now. Why buy life insurance when you intend to take advantage of the new options? Enrico was probably in the protest movement because to be otherwise would be against his profession.  She rose. “Here, I’ll let you have the couch.”  “Thanks.” He heaved a big ahh of satisfaction as he took her seat. “Hey, don’t you want to watch our show?”  She paused in the hallway, outside the bathroom door. To the left was the tiny bedroom she shared with Remmy. To the right was Enrico’s. “I might come out in a bit. You go ahead.”  “It’ll cheer you up,” he said, reaching for the remote.  Enrico loved comedy news, but the show he liked had been taking an anti-singularity stance lately. Or was she just becoming sensitized to the criticisms? She shut the door to her room and flicked on the harsh overhead light. Enrico made the most money, so he got the bedroom with the window all to himself. This room was little more than a windowless closet. Remmy had made the best of things by strewing the thin queen-size mattress with a dozen tasseled discount pillows of varying sizes, dubbing it the pit. Mara sank down into its colorful depths, woke up her device, and found Limbo again, where the number online had grown to thirty, and the chat had turned gossipy.  I heard someone got through last week, someone noted. Without the forms and authorization. They made it to the Newbody Zone.  It’s urban legend, wrote @MPoweredGrrl. They got caught.  @HarryOakPark was still online as well. Mara was getting the sense these two were leaders within opposing philosophical camps. I know someone who has a sister who’s a cop in the 18th precinct. She says they can’t stop everyone who tries, at least theoretically. Their main worry is keeping vandals and protestors away from the area. Sometimes they still try to breach the Zone.  @MPoweredGrrl wasn’t having any of it. Oh? Then why are you still here?  I’m working for real change, he replied. Access for everyone who wants it. That’s what this whole discussion thread should be about.  There was a pause in the conversation, during which Mara sensed @HarryOakPark was restraining himself from flaming @MPoweredGrrl, and others were either holding their breaths waiting for a fight, or afraid to type something that could be construed as taking sides. Mara decided to ask the obvious question.  How did they get through (supposedly)?  The gossiper was happy to oblige. At night. On foot. That’s all I know.  Sure, just waltz right past the precinct, @MPoweredGrrl wrote. Not happening.  Despite the sarcasm, others jumped on the idea.  Still, the protesters would’ve thinned out to nothing at that hour.  You could try going at shift change.  I would’ve thought daytime, through the library, would work. Slip out a side door on the other side or something.  And then what? You’re still a couple of blocks too far to the north.  The ideas continued to scroll past. Mara exited the chat. No one knew anything. Despite @HarryOakPark’s comment about the cops, she agreed with @MPoweredGrrl. If there was a way through, Limbo wouldn’t have the numbers of people chatting that it did. Or it would have a FAQ for that. Something.  Offline and alone, the black doom feeling started to creep in. Why she was living in this shitty hellhole of a room, that wasn’t even all her own? Why she was unemployed, fired from the group home for stealing? The trauma in those girls’ eyes haunted her still, but what hurt more was the sympathy they expressed when she’d left that day for good. Like it could have been any one of them in Mara’s place. Since then, she’d been reluctant to apply for anything, afraid if she went for a job interview, they’d know somehow. There might be something in her file.  Remmy burst into the room, all smiles, sporting their unisex bob and a cute bow tie, as pert as their preferred pronoun. They tossed their backpack to the right of the door. “Hey Mara, just throwing my stuff in here.” Remmy’s smile faded at sight of Mara’s face. “Sorry, looks like you want to be alone right now. I’ll see you.” And shut the door before Mara could say anything.  Add to the list being the world’s worst roommate. Mara sighed and swiped at her eyes. She had to pull herself together, get out of this windowless room, go watch TV with the others, scrounge something to eat.  She made herself sit up. Stage one. Got up from the pit. Stage two. Walked to the door. Stage three. She could do this. She rubbed her cheeks, changed her expression, and went out to join the others.  Enrico’s date cancelled, so they all ended up crammed on the couch scarfing down cheese pizza and watching zombie shows on Hulu. Enrico bailed at 10:30 so he’d be functional at work the next day. Mara and Remmy muted the sound, and watched people running and hiding and getting mobbed by the undead for another hour. Remmy chatted about their crush du jour in intricate detail. Remmy always had a crush on someone. Even when they were dating a woman halfway seriously, they were flirting with others. This week, it was the new barista at the coffee shop near Remmy’s work.  “She remembered my drink,” Remmy gushed. “Day three, and she remembered my drink.”  Remmy’s stories never required much participation, which was fine with Mara. She liked listening. It gave her hope that someday she’d run into someone who’d find her interesting. Mara hadn’t had a date since she’d lost her job and gone spiraling downward.  The credits were rolling on the screen, and Remmy stretched and yawned. “Well, I’m turning in. You?”  Mara was usually in the pit, pretending to sleep, when Remmy went to bed. Sometimes, though, she slept on the couch. She shrugged and reached for her device. “Maybe in a bit. I think I’ll do some job searching first.”  Remmy’s brow wrinkled. “Hey, you’ll find something soon. I can feel it. But if you’re crashing on the davenport tonight, I’m totally hogging the pit.” They rose and headed for the bathroom.  Mara listened to the water running. There was a flush, followed by more water running, and then Remmy emerged and paused in the hallway. “Mara, if you got out a little more, I think your mood would improve. Just saying.”  Mara nodded and stared at the blank screen of her device. “Thanks.” She held the pose till she heard the sound of the bedroom door closing. Then she laid her device aside.  All during the zombie shows, she’d had the Limbo chat on her mind. Someone might have made it through to the Newbody Zone in Cabrini-Green.  Yes, maybe Remmy was right: she needed to get out more. Mara flicked open her device and looked up the L schedules. If she hurried, she could make the Pink Line before it shut down for the night. She clicked off the TV and popped up from the couch. This was her window of opportunity. She was wearing her gray sweats and athletic shoes. Perfect. Maybe if she looked like a guy, people wouldn’t be as likely to mess with her. She pulled her long mane of hair back and stuffed it down her collar, then pulled the hoodie up over her head. She caught a glimpse of her image in the darkened TV screen. The mounds of her breasts were still apparent beneath the sweatshirt. Enrico’s baseball jacket was still on the cocktail table, the red heart of Love Life regarding her from within the green tree. She snatched it up and left.  Mara emerged from the Red Line station at Clark, aware of the decreased foot traffic at this hour on a weeknight, and affected what she hoped looked like a casual stroll as she turned west on Division. Enrico’s jacket was a little long in the waist and sleeve, but not terribly so. She tugged the gray hoodie of her sweatshirt a little more forward as she walked, stuffing her hand back in the jacket pocket before anyone could notice she didn’t have a man’s hand.  Just seven minutes walk from the station, through Seward Park, according to her device, and she’d be at the Newbody Zone. The hopeful attitude she’d had back in the apartment eroded as she walked. Stupid, stupid, her steps seemed to say, soft against the pavement.  Lost in her self-recriminations, she was halfway across LaSalle when she noticed the barricade a block ahead, on the far side of Wells. There was no one around her. The empty street—and its absolute flatness—was eerie as the post-apocalyptic urban scene in one of tonight’s zombie flicks. She was suddenly aware of how bright the streetlights were. It would look bad if she turned around now. Anyone watching would wonder about her. She put her head down and moved forward. At last she saw the curb, and stepped up onto it.  As she drew closer to Wells, it became clear to her this barricade hadn’t been erected by police. The low wall was a muddle of boxes and sheets of corrugated metal, strung together in places by scavenged bits of wire. Crossing Wells, her eyes fell on a spray-painted version of the same Love Life logo as on the back of Enrico’s jacket. She’d seen this barricade on the news, but she’d thought it would’ve been torn down by now. The fact that it wasn’t sent a realization through her torso, as chilling as the autumn wind off the lake: city officials had struck a deal with the Love Lifers. By letting them help guard the way to the Newbody Zone, they’d ended the violence against the newbodies. The fire at the Iteration Hospital where the procedures were performed had been the last attack, and the catalyst for forging a workable solution: the creation of the Zone, where newbodies could live free of harassment, and continue development of their technologies.  Mara was braced, waiting for a head to pop up over that barricade and issue a challenge, but she reached the curb without incident. Keeping her hands in her pockets, she turned left and walked along the barricade, looking for a good way around.  “Hey! Hey you there!”  Her shoulders stiffened as she turned. A skinny man in his twenties and wearing a white knit cap with a pompom on top was looking at her from around a piece of metal. His smile glinted in the glow of the lights. His look was friendly. He must have seen the logo on the back of Enrico’s jacket.  She made herself approach the guy, but she kept a ten-foot gap between them, so he wouldn’t be able to grab her suddenly.  “I don’t remember meeting you before,” he said, peering at her face in the shadows of the hoodie.  She hesitated. As soon as he heard her voice, he’d know she was a woman. She tried to imitate Remmy’s voice, aiming for a gravely lower register. “I’m new,” she said. She coughed.  They both stood there, nodding slightly. It gave Mara time to think. “I just wanted to, you know, see the operation here.”  The young man’s eyes narrowed. “Best time for that is during the day.”  Mara shrugged, even as her face grew hot. “Yes, well.” Her mind raced as she grasped for a story. The best lies always contained a bit of truth. “I monitor the hashtag for LimboInChicago. There was discussion tonight that someone may have made it past our barricade and on into the Newbody Zone.”  It worked. Her companion perked up at that. “Intel, huh?” He looked up and down the street, as if her words would make an interloper suddenly appear.  Mara considered what to say next, that would start to take her away from this guy and on her way to Seward Park. “Yeah, so I wanted to go tell my boyfriend’s sister, who works for the 18th—”  “You have a boyfriend?” He was looking her up and down.  Mara realized too late her story had become inconsistent. Still, did wearing sweats qualify someone as a lesbian or something? She pushed her hoodie back, hoping she looked pretty enough in the glare of the streetlights to make him believe she could be someone’s girlfriend. She made herself laugh a little. “Yeah, this is his jacket. Sorry, I have a bit of a sore throat.” She coughed again.  “Anyway, my boyfriend’s sister works for the 18th precinct on the graveyard shift, so I thought I’d pop in and give her the information, too.”  His eyes narrowed as he squared off in front of her, blocking the gap in the barricade from where he’d come. “Who’d you say your boyfriend is? And why again are you out here all by yourself?”  Mara was losing. “Enrico,” she blurted. “Enrico Saldana. He works in insurance. You know, the nine to five. He’s sleeping.”  She tossed her head back, and affected an annoyed attitude. “And why shouldn’t I be out at night? Is there a law against that now?”  Her companion took this in. “Yeah, I think I’ve heard of Enrico.” Still, he didn’t budge. Then he added in a flat tone, “I don’t know any Saldanas at the precinct, though. I know the people over there pretty well.”  Mara swallowed. “She has a different last name, but I don’t know what it is. Maria. Do you know Maria?”  He snorted, and relaxed. “I only know about five of them. Here.” He pointed. “You can go through that way. Just straight on, and you’ll come out at the precinct. Tell Maria that Bob says hi.”  She smiled back at him, letting her relief flood her features. “Thanks. I will.”  “Cool jacket, by the way.”  Her smile deepened, and she twisted her torso back and forth in a mild flirt. “Thanks, Bob. See you around?”  It took all her strength to keep her gait casual as she walked away. Still, she’d passed through the barricade successfully. She no longer stared at the ground, but walked with her chin level. The 18th precinct was three blocks straight ahead at the corner of Division and Larrabee, but she had no intentions of going there. Even if Bob was keeping an eye on where she was going, by the time she angled into Seward Park, she’d have a whole block’s head start. She figured that’s when she’d start running. Mara’s hope regained more of her inner territory.  As she passed under the elevated train track, she glanced furtively about. The temperature seemed to drop several degrees. This was a typical spot for the zombies to come out of hiding, or at least some homeless guy emboldened by desperation to try his hand at a little street robbery. But she encountered no one, and when she came out the other side, she saw the edge of the park. She rushed forward.  And bumped into a police officer.  “Sorry,” Mara yelped. Her heart raced.  The officer was shorter than Mara, and stocky, and with a tip of the cap back, was revealed to be a Latina woman. She regarded Mara with an alert gaze. “The park’s closed. It’s late. Where are you going so fast?”  Mara needed to get inside that park. She used the storyline of the last lie. “I was over at the Love Life barricade, and thought I’d come over and talk to Maria. She’s my boyfriend’s sister. I have some information about people trying to get through to the Zone.”  The woman stared. “Well, I’m Maria. But I don’t have a brother.”  Mara stammered. “No, it’s another Maria. She has a different last name. I don’t know it.”  The officer shifted her weight to her back foot, turning her torso slightly to the side. “Can I see some ID, please?”  Mara pulled her hands from her pockets, slowly. Her left hand was clutching her train pass and device. “Sorry, I kind of came out on the spur of the moment. I don’t have it with me.” She took a step toward the park. “My boyfriend’s name is Enrico.”  “I don’t give one ounce of sweat who your boyfriend is,” the woman said. “I was asking who are you? Because if anyone’s around here trying to get past into the Newbody Zone, I’d have to guess it was you. Wearing a Love Life jacket—yes, I know those baseball jackets without seeing the back—and sneaking around at night like you are. I’d think you intended to cause some trouble over in the Zone.”  Mara was aghast. “No! I’m not one of them!” She peeled off the jacket and flung it at the woman’s feet, and then turned and ran as fast as she could toward the park.  “Stop!”  Mara kept running, visualizing the officer reaching for her weapon. She ran into the trees that bordered the park, and then cursed the large open space that lay between her and the dark hulk of the field house. She ran without cover around her, bracing for the sound of a gun firing, for the bullet that would end her life, or cripple her. But it never came.  She skirted the field house, out of breath, yet she forced her body forward. Surely Bob would’ve heard the officer yell for her to stop. She prayed to no god in particular that the information she had on the location of the newbody’s tower was correct. The Cabrini-Green area spanned several blocks above and below Division. The tower, she’d heard, was on a street called West Hobbie, between Hudson and Cleveland. If she ran across the school grounds at a diagonal, she should be able to find it.  She raised her line of vision, and no longer had any doubt of the tower’s location. There it rose, on the other side of the school’s softball diamonds. It jutted over twenty stories up into the night sky, unilluminated. She’d heard newbodies could see in the dark, could see the infrared spectrum, and other frequencies as well. She picked up her pace and ran with all her might.  Between her and the front door stood a silvery fence, twice her height. The sight of the razor wire at the top, glinting in the moonlight, gave her pause, yet she banged into the fence harder than she intended. She grasped it and interlaced her fingers through the metal weave, afraid the officer or Bob would come and try to pry her off, pull her back into her old life.  “Help!” She needed to get inside, be safe.  A figure emerged from the front of the tower, human in shape, but that is where the similarity ended. She caught her breath as it approached, its metallic muscles luminous in the moonlight. She hadn’t seen a newbody in real life in nearly a year, not since they were rounded up for their own safety, and given their own territory.  The figure stopped at the gate and regarded her with whirling silver orbs set in the sockets where eyes would be if it were a person.  “Please,” she said, jiggling the gate. She wheeled to look behind her, but no one was there. She looked back at the stranger. “I want to join.”  “This is irregular,” the newbody said. “Our agreement with the city does not cover this situation.”  Were there officials on their end as well? She tried to remember what she’d written on her form. “I don’t want to die. I don’t want . . . to use resources . . . ” Her words sounded lame to her own ears. She’d had four reasons, well-executed, on her application. Tears sprang to her eyes. All she could think about were the looks of sympathy on the faces of those girls when they found out Mara had been fired. She paused, caught up in her internal nightmare.  This wasn’t going well. What had she expected? The thought of being denied admittance made her heart race. They’d arrest her, and put her in jail. Enrico would find out what side of the divide she was on, and that would be the end of sharing the apartment with him and Remmy.  The newbody showed no emotion, just like the human official earlier. “You are healthy. Would you renounce the world? Your world?”  “Yes! Please, I can’t go back. I need to get into the Newbody Zone.”  “Why?”  She’d been trying to vocalize her four reasons, the ones on her form. Why couldn’t she remember those? All she could think of now was the other reason, the one she hadn’t put on the form, the painful reason. The really bad reason. The one that was sure to get her application denied.  “I’m suicidal,” she blurted. Her body sagged against the gate as all the lies deserted her. “I’m afraid what I’ll do to myself. I got fired from my last job because I was stealing pills, stockpiling so I could take them all at once. They didn’t know what I was going to do with them, they just thought I was going to sell the pills for extra cash. I’m just a failure. I could never get the job I wanted in the tech industry and I don’t know why, I really don’t. I live with two other people but they’re really not my friends, we just talk about bullshit stuff and . . . The truth is, if I don’t get in to the Newbody Zone I’ll just go kill myself somehow.”  She was sobbing now, aware of how childish she sounded, just like one of the lost girls at the group home. It had been while at the home, that she’d encountered the suicide checklist the psychologists had the clients fill out. Mara had swiped a copy and taken it to the break room one day. She’d scored high. Somehow that knowledge had made her worse, and she’d begun stealing meds—tiny amounts at a time—and hiding them in her locker, where she kept her aide smock.  She almost didn’t hear the soft click of the latch. The gate swung inward, yielding to the weight of her body. At last she let go of it and found her footing. Wiping at her eyes, she saw the face of the other close to hers, uncomfortably close. She took a step back, but then realized how stupid that was. Wasn’t this where she had wanted to be, had crossed town to get here, navigated through obstacles, and run so hard her chest still ached from the effort? She’d ended up here through her own efforts, to this unknown spot that was the singularity.  Yet it was precisely the unknown that made her shrink back. But what fears did the unknown hold for her anymore? If she died, it wouldn’t matter, because she would’ve eventually killed herself, anyway. She was certain of that. What had driven her out of the apartment tonight had been a wild hope that this wasn’t the end of her life, but a new beginning. If everything was true, she would live, in whatever form they’d give her. A newbody? Sure, she could handle that. Or what if they’d developed the technology to download minds into some virtual reality computer-generated world? Why not?  “Is everything okay over here?”  Mara whirled. The police officer stood at the open gate, a tall male officer at her side.  The newbody’s voice was smooth, calming. “Yes, we’re fine. This person is no threat to the Zone.”  “All right.” The officer shifted her weight from one foot to the other. “Are you sending her back out?”  Did the city’s jurisdiction end at the gate? Mara looked back at the newbody. Please, she silently implored.  The newbody moved forward, drawing alongside Mara. “No, she is choosing to stay.”  The officer seemed to consider this. Mara, however, was elated. She had thought the city had forged the Newbody Zone to appease the Love Life protestors. Now it appeared they’d worked with both sides. She was standing in an autonomous territory under the control of the newbodies.  “Well, then,” the officer said. “Have a good evening.”  Mara looked up at her newfound friend. Their hands found each other’s in the dark. Mara felt a surprising vitality in the metallic touch. Together they walked toward the front doors of the tower. She did not look back as the gate eased shut behind them. Lettie Prell is a science fiction writer who often explores the edge where humans and their technology are increasingly merging. Her short fiction has appeared in Analog, Apex Magazine, Clarkesworld, and Tor.com, and was included in anthologies The Best of Apex Magazine: Volume 1, Some of the Best from Tor.Com 2016, and The Best Science Fiction of the Year: Volume Two. She is an active member of SFWA.", "text": "5590 words, short story\nCrossing LaSalle\nMara inched forward in the line, painfully aware she looked out of place. She didn’t belong here, with old people in wheelchairs and on gurneys, being pushed along by their relatives, who looked at her and frowned. She wasn’t like the younger people in the line, either, bald from chemotherapy treatments, or coughing up dark stains into handkerchiefs, fragile skin yellowed or pocked. Mara was neither bald nor thin. She brushed a long lock of wavy dark hair behind her ear self-consciously. She clutched her paper form in her other hand—why it had to be printed, she didn’t know—worried that by the time she reached the front of the line it would be disintegrating from her sweat, from the creases she was making in it because of her nervousness.\nThere were only nine people ahead of her, and twelve behind her, some accompanied by relatives, but it felt like hundreds, like an infinite line that stretched in both directions. She was startled when the line parted like a curtain, the people in front moving to the left and right as more officials were added to the counter. She found herself staring at an older woman with stray red hairs escaping her loose updo, who was looking at her expectantly over the top of her rimless eyeglasses.\nMara’s case suddenly and starkly bared, words stuck in her throat. She fumbled with the form and handed it to the official, who opened it, revealing the checked boxes and printed narrative at the bottom, its one-inch margins, double-spaced, containing Mara’s four reasons for her request.\nReason number one. She didn’t want to die.\nReason number two. If she waited till she was older or got sick, she may not have this opportunity. This option may become unavailable due to shifting policies or unforeseen circumstances.\nReason number three. Overpopulation was taxing the earth’s resources. By being allowed to make this choice, she would be doing her part for climate change, greenhouse gasses, and pollution.\nReason number four. Ahead lay an exciting world of opportunity. She wanted to be part of it.\nWatching the woman read, wearing a neutral expression, made Mara’s face grow hot. Maybe her writing was too passionate, or too political, or both. Shifting policies and unforeseen circumstances were euphemisms for the possibility that the tables could turn any instant, and slam the door in her face.\nThe official turned over the page and glanced at the blank side. Then she looked up at Mara. “You don’t have any affidavits attached.”\nMara blinked. “I’m not sick. It said online they’re not required if—”\n“I’ll tell you what’s required. We need affidavits from your medical doctor and a mental health professional. Also your birth certificate so we can verify your age.”\nMara didn’t know if she had a copy of her birth certificate. She looked away, toward the group moving out the glass doors and onto an unmarked gray transport bus. Another set of people heading for safety.\nShe stood straighter, emboldened. “And when I bring all that back, my application will be approved?”\nThe woman’s expression seemed to harden, become not just judgmental, but contemptuous. “Your application doesn’t demonstrate high need. You’ll be assigned a priority number.”\nMara hadn’t heard of priority numbers. People were supposed to come in, be processed, and get on the bus to the Newbody Zone. She jabbed a finger at the people slowly filing out the door. “Would the priority number allow me onto that bus?”\n“Honestly? No. But you’d go on the list. Discussion continues regarding applicants such as yourself.”\n“What’s there to discuss? And what do you mean, applicants like me?”\nThe official flipped the form across the counter at Mara. “This isn’t some video game. This is forever. Next!”\nMara was angry now. This was so typical of older people, to discount Mara’s entire generation. If anything, her age group was more capable of adapting to the future.\nMara could’ve made a stand, given a whole speech, protested. She could’ve tried to jump into the line for the transport bus. Instead, she left and hopped the Pink Line back to Pilsen, to Heart of Italy and the two-bedroom walk-up she shared with her roommates, Enrico and Remmy.\nIt didn’t take Mara long to find the community of people who’d also pulled the wrong priority number. They used the hashtag #InLimboChicago, and once approved, she was granted access to their secure chat. Just as she’d suspected, they were mainly her age, thirty-somethings who weren’t suffering from some terminal disease. It was an active group, with more than twenty online at the moment.\nThey don’t know what to do with us, wrote @HarryOakPark. Our lives don’t have a set expiration date yet.\nMara was lying on the couch in the apartment, her left leg slung over the top of the headrest. Her half-drunk Mountain Dew was sweating a circle onto the smudged glass of the cocktail table. The television took up the other side of the room, with barely enough space to inch past into the tiny kitchen or the hallway to the bathroom and bedrooms.\nWe’re low-wage slaves, replied @MPoweredGrrl. This sparked a deluge of comment from others.\nUsing our bodies to fuel the meat-based economy.\nThey’re still not sure about letting a corporation kill us. That’s how they see it. Murder.\nIf that’s true and I’m not saying it is. But if it is, one has to question their morality. They let the old and sick go. Expendable lives?\nThey’re in denial. The singularity will not be televised.\nThe singularity is privatized. It’s happening in different ways.\nI heard there’s a computer in Houston, @HarryOakPark wrote. It’s run by a place called PHI. Post-Human Incorporated. Maybe we can get in on their system.\nThey’re only taking scientists. The brain trust.\nElitists, wrote @MPoweredGrrl. Screw ‘em.\nWait. Is the Newbody place downloading minds? Or giving people newbodies?\nNewbodies.\nHow would we know? They haven’t been letting information out of the Zone.\nMara jumped in, typing swiftly using her four-finger method. The official who bounced my application said this isn’t a video game. It was so offensive being told that!\nThey could be downloading, then. There’s been talk. It’s getting real.\nDon’t be so sure. A remark like that could mean newbodies just as easily.\nOr nothing, @MPoweredGrrl wrote. Just a cruel comment.\nThe door burst open. Seeing it was Enrico, Mara closed the app and pretended to check email. Enrico peeled off his black baseball jacket and dropped it on the cocktail table. The logo on the jacket’s back, a red heart with a green oak tree growing up its middle, stared back at her accusingly. Love Life. It was the sign of the Newbody protestors, the people who’d rather stop the transport vehicles to the Newbody Zone altogether, even for the dying. The group that a year ago were considered terrorists, before they’d negotiated themselves into legitimacy.\nMara could never tell Enrico about her application, and her encounter with the official. They were on opposite sides of the biggest political divide she’d ever known. She looked up at him and made her voice casual. “Hey. What’s up?”\nEnrico was already in the tiny galley kitchen, a matter of five steps. His body was hidden by the opened refrigerator door, his head haloed by the round window behind him. They’d frosted the glass with a spray-on product to hide the view of the brick wall beyond.\n“Not much. Work-work. Seeing Cecily later on. There’s no hard cider left.”\n“Text Remmy. They’re stopping at the store for more ramen, anyway.”\nEnrico slouched in the doorway with one of Mara’s pop cans in his hand. “How’s the job hunt coming?”\n“Well, you know. Promising.”\n“Liar.”\nMara stared down at her blank screen. “I went to a tech company today but they didn’t have any openings. I couldn’t get in.” That was very nearly a true statement.\nEnrico nodded and took a swig of pop. “Everyone wants into tech, but the information age runs on top of the industrial age, which runs on top of the agrarian. Jobs are being squeezed at all levels, sure. But widening your scope should turn up something.”\nShe nodded, humoring him. She’d been fired from her job at the group home for troubled girls two months ago. She wasn’t suited to dealing with people in crisis like that. Drug addiction, broken homes, abuse. She’d rather geek out on a line of code.\nHe came over, sat down cross-legged on the rug and set his Dew on the cocktail table. “You’re looking really serious all of a sudden. What’re you thinking?”\nHer jaw tightened. “Nothing. Just maybe I should be looking at going into something like insurance.” Enrico worked in a cubicle farm at an insurance company.\nHe took another huge swallow of Dew, wincing it down. “Wrong time to jump in. Not hiring.”\nShe’d meant her comment to be sarcastic, and his helpful tone only underscored Mara’s recurring resentment. She took comfort that insurance was one of the troubled industries right now. Why buy life insurance when you intend to take advantage of the new options? Enrico was probably in the protest movement because to be otherwise would be against his profession.\nShe rose. “Here, I’ll let you have the couch.”\n“Thanks.” He heaved a big ahh of satisfaction as he took her seat. “Hey, don’t you want to watch our show?”\nShe paused in the hallway, outside the bathroom door. To the left was the tiny bedroom she shared with Remmy. To the right was Enrico’s. “I might come out in a bit. You go ahead.”\n“It’ll cheer you up,” he said, reaching for the remote.\nEnrico loved comedy news, but the show he liked had been taking an anti-singularity stance lately. Or was she just becoming sensitized to the criticisms? She shut the door to her room and flicked on the harsh overhead light. Enrico made the most money, so he got the bedroom with the window all to himself. This room was little more than a windowless closet. Remmy had made the best of things by strewing the thin queen-size mattress with a dozen tasseled discount pillows of varying sizes, dubbing it the pit. Mara sank down into its colorful depths, woke up her device, and found Limbo again, where the number online had grown to thirty, and the chat had turned gossipy.\nI heard someone got through last week, someone noted. Without the forms and authorization. They made it to the Newbody Zone.\nIt’s urban legend, wrote @MPoweredGrrl. They got caught.\n@HarryOakPark was still online as well. Mara was getting the sense these two were leaders within opposing philosophical camps. I know someone who has a sister who’s a cop in the 18th precinct. She says they can’t stop everyone who tries, at least theoretically. Their main worry is keeping vandals and protestors away from the area. Sometimes they still try to breach the Zone.\n@MPoweredGrrl wasn’t having any of it. Oh? Then why are you still here?\nI’m working for real change, he replied. Access for everyone who wants it. That’s what this whole discussion thread should be about.\nThere was a pause in the conversation, during which Mara sensed @HarryOakPark was restraining himself from flaming @MPoweredGrrl, and others were either holding their breaths waiting for a fight, or afraid to type something that could be construed as taking sides. Mara decided to ask the obvious question.\nHow did they get through (supposedly)?\nThe gossiper was happy to oblige. At night. On foot. That’s all I know.\nSure, just waltz right past the precinct, @MPoweredGrrl wrote. Not happening.\nDespite the sarcasm, others jumped on the idea.\nStill, the protesters would’ve thinned out to nothing at that hour.\nYou could try going at shift change.\nI would’ve thought daytime, through the library, would work. Slip out a side door on the other side or something.\nAnd then what? You’re still a couple of blocks too far to the north.\nThe ideas continued to scroll past. Mara exited the chat. No one knew anything. Despite @HarryOakPark’s comment about the cops, she agreed with @MPoweredGrrl. If there was a way through, Limbo wouldn’t have the numbers of people chatting that it did. Or it would have a FAQ for that. Something.\nOffline and alone, the black doom feeling started to creep in. Why she was living in this shitty hellhole of a room, that wasn’t even all her own? Why she was unemployed, fired from the group home for stealing? The trauma in those girls’ eyes haunted her still, but what hurt more was the sympathy they expressed when she’d left that day for good. Like it could have been any one of them in Mara’s place. Since then, she’d been reluctant to apply for anything, afraid if she went for a job interview, they’d know somehow. There might be something in her file.\nRemmy burst into the room, all smiles, sporting their unisex bob and a cute bow tie, as pert as their preferred pronoun. They tossed their backpack to the right of the door. “Hey Mara, just throwing my stuff in here.” Remmy’s smile faded at sight of Mara’s face. “Sorry, looks like you want to be alone right now. I’ll see you.” And shut the door before Mara could say anything.\nAdd to the list being the world’s worst roommate. Mara sighed and swiped at her eyes. She had to pull herself together, get out of this windowless room, go watch TV with the others, scrounge something to eat.\nShe made herself sit up. Stage one. Got up from the pit. Stage two. Walked to the door. Stage three. She could do this. She rubbed her cheeks, changed her expression, and went out to join the others.\nEnrico’s date cancelled, so they all ended up crammed on the couch scarfing down cheese pizza and watching zombie shows on Hulu. Enrico bailed at 10:30 so he’d be functional at work the next day. Mara and Remmy muted the sound, and watched people running and hiding and getting mobbed by the undead for another hour. Remmy chatted about their crush du jour in intricate detail. Remmy always had a crush on someone. Even when they were dating a woman halfway seriously, they were flirting with others. This week, it was the new barista at the coffee shop near Remmy’s work.\n“She remembered my drink,” Remmy gushed. “Day three, and she remembered my drink.”\nRemmy’s stories never required much participation, which was fine with Mara. She liked listening. It gave her hope that someday she’d run into someone who’d find her interesting. Mara hadn’t had a date since she’d lost her job and gone spiraling downward.\nThe credits were rolling on the screen, and Remmy stretched and yawned. “Well, I’m turning in. You?”\nMara was usually in the pit, pretending to sleep, when Remmy went to bed. Sometimes, though, she slept on the couch. She shrugged and reached for her device. “Maybe in a bit. I think I’ll do some job searching first.”\nRemmy’s brow wrinkled. “Hey, you’ll find something soon. I can feel it. But if you’re crashing on the davenport tonight, I’m totally hogging the pit.” They rose and headed for the bathroom.\nMara listened to the water running. There was a flush, followed by more water running, and then Remmy emerged and paused in the hallway. “Mara, if you got out a little more, I think your mood would improve. Just saying.”\nMara nodded and stared at the blank screen of her device. “Thanks.” She held the pose till she heard the sound of the bedroom door closing. Then she laid her device aside.\nAll during the zombie shows, she’d had the Limbo chat on her mind. Someone might have made it through to the Newbody Zone in Cabrini-Green.\nYes, maybe Remmy was right: she needed to get out more. Mara flicked open her device and looked up the L schedules. If she hurried, she could make the Pink Line before it shut down for the night. She clicked off the TV and popped up from the couch. This was her window of opportunity. She was wearing her gray sweats and athletic shoes. Perfect. Maybe if she looked like a guy, people wouldn’t be as likely to mess with her. She pulled her long mane of hair back and stuffed it down her collar, then pulled the hoodie up over her head. She caught a glimpse of her image in the darkened TV screen. The mounds of her breasts were still apparent beneath the sweatshirt. Enrico’s baseball jacket was still on the cocktail table, the red heart of Love Life regarding her from within the green tree. She snatched it up and left.\nMara emerged from the Red Line station at Clark, aware of the decreased foot traffic at this hour on a weeknight, and affected what she hoped looked like a casual stroll as she turned west on Division. Enrico’s jacket was a little long in the waist and sleeve, but not terribly so. She tugged the gray hoodie of her sweatshirt a little more forward as she walked, stuffing her hand back in the jacket pocket before anyone could notice she didn’t have a man’s hand.\nJust seven minutes walk from the station, through Seward Park, according to her device, and she’d be at the Newbody Zone. The hopeful attitude she’d had back in the apartment eroded as she walked. Stupid, stupid, her steps seemed to say, soft against the pavement.\nLost in her self-recriminations, she was halfway across LaSalle when she noticed the barricade a block ahead, on the far side of Wells. There was no one around her. The empty street—and its absolute flatness—was eerie as the post-apocalyptic urban scene in one of tonight’s zombie flicks. She was suddenly aware of how bright the streetlights were. It would look bad if she turned around now. Anyone watching would wonder about her. She put her head down and moved forward. At last she saw the curb, and stepped up onto it.\nAs she drew closer to Wells, it became clear to her this barricade hadn’t been erected by police. The low wall was a muddle of boxes and sheets of corrugated metal, strung together in places by scavenged bits of wire. Crossing Wells, her eyes fell on a spray-painted version of the same Love Life logo as on the back of Enrico’s jacket. She’d seen this barricade on the news, but she’d thought it would’ve been torn down by now. The fact that it wasn’t sent a realization through her torso, as chilling as the autumn wind off the lake: city officials had struck a deal with the Love Lifers. By letting them help guard the way to the Newbody Zone, they’d ended the violence against the newbodies. The fire at the Iteration Hospital where the procedures were performed had been the last attack, and the catalyst for forging a workable solution: the creation of the Zone, where newbodies could live free of harassment, and continue development of their technologies.\nMara was braced, waiting for a head to pop up over that barricade and issue a challenge, but she reached the curb without incident. Keeping her hands in her pockets, she turned left and walked along the barricade, looking for a good way around.\n“Hey! Hey you there!”\nHer shoulders stiffened as she turned. A skinny man in his twenties and wearing a white knit cap with a pompom on top was looking at her from around a piece of metal. His smile glinted in the glow of the lights. His look was friendly. He must have seen the logo on the back of Enrico’s jacket.\nShe made herself approach the guy, but she kept a ten-foot gap between them, so he wouldn’t be able to grab her suddenly.\n“I don’t remember meeting you before,” he said, peering at her face in the shadows of the hoodie.\nShe hesitated. As soon as he heard her voice, he’d know she was a woman. She tried to imitate Remmy’s voice, aiming for a gravely lower register. “I’m new,” she said. She coughed.\nThey both stood there, nodding slightly. It gave Mara time to think. “I just wanted to, you know, see the operation here.”\nThe young man’s eyes narrowed. “Best time for that is during the day.”\nMara shrugged, even as her face grew hot. “Yes, well.” Her mind raced as she grasped for a story. The best lies always contained a bit of truth. “I monitor the hashtag for LimboInChicago. There was discussion tonight that someone may have made it past our barricade and on into the Newbody Zone.”\nIt worked. Her companion perked up at that. “Intel, huh?” He looked up and down the street, as if her words would make an interloper suddenly appear.\nMara considered what to say next, that would start to take her away from this guy and on her way to Seward Park. “Yeah, so I wanted to go tell my boyfriend’s sister, who works for the 18th—”\n“You have a boyfriend?” He was looking her up and down.\nMara realized too late her story had become inconsistent. Still, did wearing sweats qualify someone as a lesbian or something? She pushed her hoodie back, hoping she looked pretty enough in the glare of the streetlights to make him believe she could be someone’s girlfriend. She made herself laugh a little. “Yeah, this is his jacket. Sorry, I have a bit of a sore throat.” She coughed again.\n“Anyway, my boyfriend’s sister works for the 18th precinct on the graveyard shift, so I thought I’d pop in and give her the information, too.”\nHis eyes narrowed as he squared off in front of her, blocking the gap in the barricade from where he’d come. “Who’d you say your boyfriend is? And why again are you out here all by yourself?”\nMara was losing. “Enrico,” she blurted. “Enrico Saldana. He works in insurance. You know, the nine to five. He’s sleeping.”\nShe tossed her head back, and affected an annoyed attitude. “And why shouldn’t I be out at night? Is there a law against that now?”\nHer companion took this in. “Yeah, I think I’ve heard of Enrico.” Still, he didn’t budge. Then he added in a flat tone, “I don’t know any Saldanas at the precinct, though. I know the people over there pretty well.”\nMara swallowed. “She has a different last name, but I don’t know what it is. Maria. Do you know Maria?”\nHe snorted, and relaxed. “I only know about five of them. Here.” He pointed. “You can go through that way. Just straight on, and you’ll come out at the precinct. Tell Maria that Bob says hi.”\nShe smiled back at him, letting her relief flood her features. “Thanks. I will.”\n“Cool jacket, by the way.”\nHer smile deepened, and she twisted her torso back and forth in a mild flirt. “Thanks, Bob. See you around?”\nIt took all her strength to keep her gait casual as she walked away. Still, she’d passed through the barricade successfully. She no longer stared at the ground, but walked with her chin level. The 18th precinct was three blocks straight ahead at the corner of Division and Larrabee, but she had no intentions of going there. Even if Bob was keeping an eye on where she was going, by the time she angled into Seward Park, she’d have a whole block’s head start. She figured that’s when she’d start running. Mara’s hope regained more of her inner territory.\nAs she passed under the elevated train track, she glanced furtively about. The temperature seemed to drop several degrees. This was a typical spot for the zombies to come out of hiding, or at least some homeless guy emboldened by desperation to try his hand at a little street robbery. But she encountered no one, and when she came out the other side, she saw the edge of the park. She rushed forward.\nAnd bumped into a police officer.\n“Sorry,” Mara yelped. Her heart raced.\nThe officer was shorter than Mara, and stocky, and with a tip of the cap back, was revealed to be a Latina woman. She regarded Mara with an alert gaze. “The park’s closed. It’s late. Where are you going so fast?”\nMara needed to get inside that park. She used the storyline of the last lie. “I was over at the Love Life barricade, and thought I’d come over and talk to Maria. She’s my boyfriend’s sister. I have some information about people trying to get through to the Zone.”\nThe woman stared. “Well, I’m Maria. But I don’t have a brother.”\nMara stammered. “No, it’s another Maria. She has a different last name. I don’t know it.”\nThe officer shifted her weight to her back foot, turning her torso slightly to the side. “Can I see some ID, please?”\nMara pulled her hands from her pockets, slowly. Her left hand was clutching her train pass and device. “Sorry, I kind of came out on the spur of the moment. I don’t have it with me.” She took a step toward the park. “My boyfriend’s name is Enrico.”\n“I don’t give one ounce of sweat who your boyfriend is,” the woman said. “I was asking who are you? Because if anyone’s around here trying to get past into the Newbody Zone, I’d have to guess it was you. Wearing a Love Life jacket—yes, I know those baseball jackets without seeing the back—and sneaking around at night like you are. I’d think you intended to cause some trouble over in the Zone.”\nMara was aghast. “No! I’m not one of them!” She peeled off the jacket and flung it at the woman’s feet, and then turned and ran as fast as she could toward the park.\n“Stop!”\nMara kept running, visualizing the officer reaching for her weapon. She ran into the trees that bordered the park, and then cursed the large open space that lay between her and the dark hulk of the field house. She ran without cover around her, bracing for the sound of a gun firing, for the bullet that would end her life, or cripple her. But it never came.\nShe skirted the field house, out of breath, yet she forced her body forward. Surely Bob would’ve heard the officer yell for her to stop. She prayed to no god in particular that the information she had on the location of the newbody’s tower was correct. The Cabrini-Green area spanned several blocks above and below Division. The tower, she’d heard, was on a street called West Hobbie, between Hudson and Cleveland. If she ran across the school grounds at a diagonal, she should be able to find it.\nShe raised her line of vision, and no longer had any doubt of the tower’s location. There it rose, on the other side of the school’s softball diamonds. It jutted over twenty stories up into the night sky, unilluminated. She’d heard newbodies could see in the dark, could see the infrared spectrum, and other frequencies as well. She picked up her pace and ran with all her might.\nBetween her and the front door stood a silvery fence, twice her height. The sight of the razor wire at the top, glinting in the moonlight, gave her pause, yet she banged into the fence harder than she intended. She grasped it and interlaced her fingers through the metal weave, afraid the officer or Bob would come and try to pry her off, pull her back into her old life.\n“Help!” She needed to get inside, be safe.\nA figure emerged from the front of the tower, human in shape, but that is where the similarity ended. She caught her breath as it approached, its metallic muscles luminous in the moonlight. She hadn’t seen a newbody in real life in nearly a year, not since they were rounded up for their own safety, and given their own territory.\nThe figure stopped at the gate and regarded her with whirling silver orbs set in the sockets where eyes would be if it were a person.\n“Please,” she said, jiggling the gate. She wheeled to look behind her, but no one was there. She looked back at the stranger. “I want to join.”\n“This is irregular,” the newbody said. “Our agreement with the city does not cover this situation.”\nWere there officials on their end as well? She tried to remember what she’d written on her form. “I don’t want to die. I don’t want . . . to use resources . . . ” Her words sounded lame to her own ears. She’d had four reasons, well-executed, on her application. Tears sprang to her eyes. All she could think about were the looks of sympathy on the faces of those girls when they found out Mara had been fired. She paused, caught up in her internal nightmare.\nThis wasn’t going well. What had she expected? The thought of being denied admittance made her heart race. They’d arrest her, and put her in jail. Enrico would find out what side of the divide she was on, and that would be the end of sharing the apartment with him and Remmy.\nThe newbody showed no emotion, just like the human official earlier. “You are healthy. Would you renounce the world? Your world?”\n“Yes! Please, I can’t go back. I need to get into the Newbody Zone.”\n“Why?”\nShe’d been trying to vocalize her four reasons, the ones on her form. Why couldn’t she remember those? All she could think of now was the other reason, the one she hadn’t put on the form, the painful reason. The really bad reason. The one that was sure to get her application denied.\n“I’m suicidal,” she blurted. Her body sagged against the gate as all the lies deserted her. “I’m afraid what I’ll do to myself. I got fired from my last job because I was stealing pills, stockpiling so I could take them all at once. They didn’t know what I was going to do with them, they just thought I was going to sell the pills for extra cash. I’m just a failure. I could never get the job I wanted in the tech industry and I don’t know why, I really don’t. I live with two other people but they’re really not my friends, we just talk about bullshit stuff and . . . The truth is, if I don’t get in to the Newbody Zone I’ll just go kill myself somehow.”\nShe was sobbing now, aware of how childish she sounded, just like one of the lost girls at the group home. It had been while at the home, that she’d encountered the suicide checklist the psychologists had the clients fill out. Mara had swiped a copy and taken it to the break room one day. She’d scored high. Somehow that knowledge had made her worse, and she’d begun stealing meds—tiny amounts at a time—and hiding them in her locker, where she kept her aide smock.\nShe almost didn’t hear the soft click of the latch. The gate swung inward, yielding to the weight of her body. At last she let go of it and found her footing. Wiping at her eyes, she saw the face of the other close to hers, uncomfortably close. She took a step back, but then realized how stupid that was. Wasn’t this where she had wanted to be, had crossed town to get here, navigated through obstacles, and run so hard her chest still ached from the effort? She’d ended up here through her own efforts, to this unknown spot that was the singularity.\nYet it was precisely the unknown that made her shrink back. But what fears did the unknown hold for her anymore? If she died, it wouldn’t matter, because she would’ve eventually killed herself, anyway. She was certain of that. What had driven her out of the apartment tonight had been a wild hope that this wasn’t the end of her life, but a new beginning. If everything was true, she would live, in whatever form they’d give her. A newbody? Sure, she could handle that. Or what if they’d developed the technology to download minds into some virtual reality computer-generated world? Why not?\n“Is everything okay over here?”\nMara whirled. The police officer stood at the open gate, a tall male officer at her side.\nThe newbody’s voice was smooth, calming. “Yes, we’re fine. This person is no threat to the Zone.”\n“All right.” The officer shifted her weight from one foot to the other. “Are you sending her back out?”\nDid the city’s jurisdiction end at the gate? Mara looked back at the newbody. Please, she silently implored.\nThe newbody moved forward, drawing alongside Mara. “No, she is choosing to stay.”\nThe officer seemed to consider this. Mara, however, was elated. She had thought the city had forged the Newbody Zone to appease the Love Life protestors. Now it appeared they’d worked with both sides. She was standing in an autonomous territory under the control of the newbodies.\n“Well, then,” the officer said. “Have a good evening.”\nMara looked up at her newfound friend. Their hands found each other’s in the dark. Mara felt a surprising vitality in the metallic touch. Together they walked toward the front doors of the tower. She did not look back as the gate eased shut behind them.\nLettie Prell is a science fiction writer who often explores the edge where humans and their technology are increasingly merging. Her short fiction has appeared in Analog, Apex Magazine, Clarkesworld, and Tor.com, and was included in anthologies The Best of Apex Magazine: Volume 1, Some of the Best from Tor.Com 2016, and The Best Science Fiction of the Year: Volume Two. She is an active member of SFWA.", "source": "https://clarkesworldmagazine.com/prell_12_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Crossing LaSalle by Lettie Prell"}