{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rich Larson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "i/Ol/xk9AaCXuVYM0a/4Z3oVqYs=", "id": null, "license": null, "comments": "", "raw_text": "3970 words, short story, REPRINT  God Decay  There was new biomod ivy on the buildings, a ruddy green designed for long winters, but other than that the campus quad looked the same as it did a decade back. Ostap walked the honeycomb paving with his hands in his pockets, head and shoulders above the scurrying students. They were starting to ping him as he passed, raking after his social profile until he could feel the accumulated electronic gaze like static. Ostap had everything shielded, as was his agent’s policy, but that didn’t stop them from recognizing his pale face, buzzed head, watery blue eyes.  A few North Korean transfers, who’d been in the midst of mocapping a rabbit, started shrieking as they caught sight of him. The game was up. Ostap flashed his crooked grin, the most-recognized smile in athletics and possibly the world, and by the time he was at the Old Sciences building he had a full flock. The students were mostly discreet with their recording, not wanting to seem too eager for celebspotting points, but Ostap could tell they were waiting for something as he walked up the concrete wheelchair ramp.  “Accra 2036,” he said, linking his fingers for the Olympic rings. “We’re taking it all, right?”  Ostap let one massive palm drift along the rail, then flipped himself up and inverted to walk it on his hands. The flock cheered him all the way up the rail and applauded when he stuck the twisting dismount. Ostap gave them a quick bow, then turned through the doors and into the hall. The sudden hushed quiet made him feel like he was in a cathedral.  Bioscientist-now-professor Dr. Alyce Woodard had a new office, but Ostap had expected that. He’d never grown attached to the old one, not when their few visits there were so engulfed by the days and nights in the labs, in temperature-controlled corridors and stark white rooms where the fluorescents scoured away shadows and secrets.  What Ostap hadn’t expected was how old Alyce had become. Her spine had a desk-chair curvature as she got up and crossed the floor, pausing the wallscreen with a wave of her hand. Her body fat sagged, her eyes were bagged. Ostap remembered her beautiful, and awful, an angel’s face floating above him with cold marble eyes and checklist questions. But that was before a long succession of tanned bodies and perfect teeth, and maybe she’d never been at all.  “O,” Alyce said, thin arms around his midsection just briefly. “Thanks for coming short notice.”  “It’s good to see you,” Ostap said. “Good to come back.” But it wasn’t; he felt like he was twenty-three again, stick-thin, draped boneless in a wheelchair.  “Training for Accra, now, huh?” Alyce scratched at her elbow. “And a citizen, this time around. I just saw the new ads, they’re still using that clip from the 2028 Games . . . ” She waved the wallscreen to play, and Ostap saw himself loping out onto the track, blinking in the sunlight, fins of plastic and composite gleaming off his back and shoulders. It was the 7.9 seconds that had put the name Ostap Kerensky into every smartfeed, his events plastered on billboards and replayed ad nauseam on phones and tablets.  “The dash,” Ostap said. “They really don’t get tired of it.”  “Eight years on, you’d think they would,” Alyce said. Her smile was terse, but she watched, too. A cyclopean Pole, six foot five, noded spine, and long muscled limbs. No warm-up, no ritual. On the gunshot he came off the blocks like a Higgs boson.  “The tracking camera fucking lost him,” Alyce quoted, because the commentators had long since been censored out. “It really fucking lost him.”  “That was some year,” Ostap said, trying to read her, but the new lines on her face made it harder, not easier.  She flicked the wallscreen to mute. “I saw the feed of that promotion you did in Peru, too.” Alyce was looking up and down him. “Exhibition match, or something? With that football club?”  “They’re hoping to open up the league to biomods next season, yeah.”  “Oh.” Her face was blank.  “The underground stuff is killing their ratings,” Ostap explained, to be explaining. “Nobody wants to watch pure sport any more. You know how it is. Blood doping, steroids, carbon blades, and now biomods: that’s what gets specs. I was talking to the—”  “O.” Alyce clenched, unclenched her teeth.  “Yeah?” Ostap’s voice was quieter than he wanted it.  “Do you remember when we stopped doing the scans together? It was about five years back.”  Ostap remembered. He’d been on the new suborbital from Dubai to LAX, struggling to fit the scanner membranes over all of his nodes with the seat reclined and Dr. Woodard chatting in his ear. He’d just climbed a high-rise, one of those sponsored publicity stunts, like the company who wanted him to run the Tour de France on foot. That offer was still sitting in the backlog waiting for a green light.  He’d been tired.  “I want to see you,” he’d said. “It’s been too long.”  “I’m sick of the cams, O,” she’d said. “You bring them like fucking flies. Just talk to me.”  So he had, about the dark-haired girls in barely-shirts and tight cigarette jeans, the cosmetically-perfected lips and tits, the girls who’d mobbed him at the airport. They all would have killed for a night of his time.  “You’re welcome,” Alyce had said, when he was finished. “Still.”  “I’m sending the scan,” Ostap had said, because he had nothing else she wanted. He’d sent it before the suborbital peaked and the conversation crackled away, and after that, the conversations stopped.  “I remember,” Ostap said now, unsmiling. “We set it up to automate.”  Alyce moved to sit back against the desk, her hands veiny on the wood. “You look fine,” she said sadly. “You don’t even look thirty-three.” Ostap watched her mouth tightening.  “What’s wrong?” he asked.  “The augs are asking too much, O.” Alyce put a finger to her ribs. “The stress on your central nervous system, your organs. It’s been increasing. They’re all on their way out. Heart first, I’d think.” She was not wincing, not looking away. “Two more years is the projected max.”  Ostap felt the nodes like he hadn’t since the surgeries, felt the pulse of them deep in flesh. He felt the composite wrapping his spine, the membranes skimming under his skin, the fish-scale vents on his back and shoulders and neck. He felt the thrumming power, but now like a venom sack set to burst.  “Shit,” he said. “Shit.”  “I’m sorry,” Alyce said. “Have you experienced anything?”  “Don’t think so.” But it was hard to tell, now, hard to tell when his heart was skipping from blowing doxy rails, from adrenal rush, from a woman with the biomod fetish exploring every micrometer of his visible augs. The Superman was supposed to be invulnerable.  “You don’t think so?”  “I don’t know,” Ostap snapped. “How am I supposed to fucking know, Dr. Woodard?” He hadn’t meant to call her that, but it came out on its own, like she was still the blue fairy in his ear whispering him through operation after operation as they flayed his nerves bare. She didn’t know he still dreamed about the final surgery, the sounds of scraping bone and machine.  “I’m sorry, O.”  Hell, the kind Hieronymus Bosch would have painted, eighteen excruciating hours of laser-guided scalpels and winches and needles. Under for some of it, locally anaesthetized for the rest. Needles in his skin and breathing tubes speared down his throat. He’d thought that had been price enough.  “How long have you known for?” Ostap finally asked.  “That it was a possibility, since the start. That it was happening?” Alyce paused. “A long time.” She folded her arms and it made her look small. “Should I have told you?”  “No,” Ostap said, but he wasn’t sure. The slogan for the 2036 Games was looping endlessly across the wallscreen. Legends are made in America.  “Okay.”  Ostap put his hand up to his skull. “So why now?” he asked. “Why are you telling me now?”  The game in Peru, when he’d struck a volley out of the air for the first time and buried it back-corner, like he’d done it all his life, quick-synch nerves of his leg loaded with new muscle memories. On the bench it had gone numb for just a second, from his knee down.  “This fucking doctorate student got into my web-cache,” Alyce said. “I don’t know how, I thought it was all airtight. She found the records. The story’s going to break in a couple hours.”  “Alright,” Ostap said. “Alright.”  “Sorry, O.”  “What happens now?” Ostap asked.  Alyce gave a helpless shrug. “There are tests,” she said. “There are possibilities. Options. I’ve still got full access to the biolabs.”  Ostap left the office without saying goodbye. Digital maps to expensive hotels were already scrawling over his retinas, reminding him of their impeccable service, their luxury suites. He’d thought he would be here for a few days, maybe, a few days to catch up after so many years. He’d imagined walking with her on the steep, rough river trails and catching her if she slipped.  Outside there was a student who wanted to speak Polish with him, whose shirt scrolled a list of Ostap’s world records down his back. Ostap mumbled a few words, shook his sweat-slick hand. Others were clutching fake memorabilia and raving about things he barely remembered doing. A few girls were fluffing fingers through sun-blonde hair, casually rolling waistbands lower on their hips, pursing their lips, and trying to figure out bedroom eyes.  He went past them all like a zombie, and walked all the way to the university bus station before he remembered he’d ordered an autocab.  Twenty minutes later Ostap pushed into the lobby through a crush of mobbers, the ones who’d used complex algorithms to predict his preferred hotel, and there he had the privilege of watching the story break in real time. The alert blinked yellow onto their retinas, vibrated tablets or phones for the migraine-prone and slow adopters, and small worlds turned upside down one by one. It shuddered through the jerseys and 3D-print face masks and groping hands like a wave. Ostap would have been reading it himself if he hadn’t put up a datablock.  Silence and exclamations of disbelief started flickering back and forth like a light switch.  “Your finger here, sir,” said the shell-shocked concierge, holding out the pad for a signature. He had enough presence of mind to pretend it didn’t work, necessitating a fresh pad and leaving him with a small slice of Ostap Kerensky’s genetic material to slip into his pocket. Ostap knew all about that trick, but he didn’t give a cheerful wink or offer a hangnail. Not this time.  The whisper-silent elevator took him to the very top, and when the wallscreens in his suite flicked on to greet him, the story was everywhere. He told them to mute, but he still watched. Pictures of Alyce skittered around the room, her mouth in a deep frown, and Ostap could tell from the selection that the current spin was villain, deceiver. He saw footage of himself zipping into a custom wet suit, rubbing petroleum jelly over his hands and cheekbones, flashing the cams a thumbs up before he waded into the water to set the new English Channel record.  Back to the 2028 Games again, when Ostap took the world by storm. 100 meter, 200 meter. High-jump. Still enough in the tank for decathlon. Bolt’s records were gone, Sterling’s record was shattered. Ostap watched it all flash by in sound bites, his story condensed for anyone living under a particularly large rock.  An incredibly promising young athlete, all but scouted from the womb, left crippled by a three-car collision when the driving AI in a cab glitched. A brilliant developer, born and bred for MIT, spearheading a team designing the most comprehensively integrated body augmentation the world had ever seen.  They’d found each other across the ocean, and it was so fucking perfect.  The sky was growing dark and the clips were starting to recycle when Alyce buzzed in his ear. He could barely hear her, even with voice ID.  “They were waiting at my fucking house,” she said, and then the next part got swallowed.  “They’re here, too,” Ostap said. He’d seen it on the screen, the termite swarm of reporters and spectators milling the base of the hotel.  “So am I,” she said. “Want to let me up before they crucify me?”  Ostap crossed to the balcony, palmed the glass door open. It looked like a party. People were all slammed up against each other, twisting and turning for better angles, cams flashing pop-pop-pop in the dark, hot white, miniature supernovas. He couldn’t see Alyce struggling through the crowd from her cab, not at this height, but he could tell where she was by the ripples. She’d barely made it five meters.  He called the hotel security detail to go bring her in, and ten minutes later she slumped through the door, hair tendrilled with static across her face. She held up a bottle of Cannonball and sloshed it pointedly with a quarter of a smile.  “Probably safer here than anywhere else,” she said, while Ostap retrieved two glasses from the designer coffee table.  “Probably, yeah. They’re going to be burning cars soon.”  “You left before I could explain everything.” Alyce handed the bottle over. Ostap pushed the cork with his fingertip until it plopped out and splashed down, bobbing in the wine like a buoy. She poured.  “I thought maybe you called me for something else,” Ostap said. He kept his eyes off the bed.  “People only call Superman when there’s trouble, O.” Alyce took a slug of the wine and swished it in her mouth. Swallowed. “They never call him to say everything’s great, you should come visit.”  “They should,” Ostap said. “They used to. We used to just visit.”  “If you want to call it that,” Alyce said, but there was a flush in the tips of her ears that wasn’t from the wine. She handed him the other glass.  “The first time we fucked was one week after I learned to walk. To the day.” Ostap tried to laugh. “Did you know that? I mean, what kind of Oedipal shit is that?”  Twitching his toes in the recovery room had been euphoria, standing on his own two feet, Elysium. As soon as he was cleared, he’d spent every second he could with the harness, tottering on a treadmill as his new nerves carved channels of motion and memory. One night Dr. Woodard had stayed with him, to show him where else his new nerves led.  “It wasn’t on my calendar,” Alyce said. “It just happened.”  And it had been over quickly, a confusion of sweat and heat that had nothing methodical, nothing logical about it. She hadn’t nodded thoughtfully or dashed notes on her tablet afterward.  “Nasty, brutish, and short,” was what she’d said, but smiling, wriggling back into her jeans. She’d put her hands around Ostap’s hips, where scars were still tender.  “I’ve had dreams about you,” Ostap had replied, but in Polish, so she wouldn’t know.  “Maybe I’m just a narcissist,” Alyce said now, to her wine glass. “Maybe Michelangelo wanted Il David.”  “You should have just let me find out on the fucking net,” Ostap said.  “Should I leave?” Alyce asked.  She sat on the hotel bed, rumpling crisp white sheets, and Ostap sat on the floor with his head leaned back against its foot. The wine was clinging in his dry mouth.  The last time he’d been in this city, every day had been stronger and faster and smoother. The augs had been synchronizing, the protein pumps sculpting muscles layer by layer. His new size had had him ducking under doorways and cramming into cars. They’d flown a redeye back to Warsaw for the final stretch of treatments, for last calibrations and probes and to finally see his mother and father. He hadn’t been in Boston since.  “My parents,” Ostap said. “I’m going to have to tell them.”  “Where are they now?” Alyce asked.  “La Rochelle. Moved them there a few years ago.” He tipped his head back. “They always wanted to holiday there. I think they’re happy.”  “That’s good,” Alyce said. “When you’re old you deserve to be happy. You’ve put up with enough shit.”  You’re old, Ostap wanted to say. He wanted to ask her if she was happy.  “Maybe they are, maybe they’re not,” he said instead. “I’m wrong about that. Sometimes. I mean, I thought you and me were happy.”  “We were,” Alyce said. “Because we were riding a whirlwind, O. You know, the parties and the galas and the fashion consultants and booking agents. All those interviews. Hell, I even wore a dress.”  “I remember,” Ostap said. He’d worn a tailored suit, slashed in such a way as to display the nodes along his spine, and in a matter of weeks everyone wore them that way. “Movie stars and moguls,” he said. “That night in Chicago.”  “Rome, Dubai, New York.” Alyce shrugged. “They blend.”  “Chicago, when the Superman thing was just taking off,” Ostap pressed, because it was important somehow, important that she remember that one drunken night in Chicago they’d spent roving through the city in an autocab, searching for a phone booth. There were none left, so they’d ended up tinting the windows instead.  “We had a good run,” Alyce said. “And that year. Well. I’ll always remember that year.”  They were quiet for a moment, listening to what sounded like a full riot outside, hoarse screaming and one looping police siren. Ostap had turned the wallscreens off, but he could guess what was happening. He could guess that his net implant would be overloaded with calls, messages, demands when he lifted the block.  “What are they saying?” he finally asked. “I blocked the feed.”  “All the classics.” Alyce moved the dregs of her glass in a slow circle, tipping it just so. “Neo-reactionists flaring up all over. Abomination. Playing God. Things like that.”  “Playing Frankenstein,” Ostap said, and felt a dull triumph when her face went red.  “Yeah. All those.”  “It won’t change anything,” he said, then, when she looked at him shrewdly: “It won’t stop biomods. Developers will still be going after full integration.” He paused. “Maybe they’ll look at safer designs. Learn from your mistake.”  “Safety isn’t even in the equation when they’ve already killed a dozen candidates under Beijing. But they’re still only seeing success with the partial augs.” She reached for the bottle on the nightstand. “We were lucky with you, O. You might be the first, best. Last.”  “Do you remember the last time we talked face to face?” Ostap asked. “After your symposium.”  “Why are we talking about all this, O?”  “Because I always thought there would be time later.”  “There will be,” Alyce said. “I told you. There are options.”  “I’m grabbing some air,” Ostap said. He got up and walked to the wide window. He thought about two years as his hands found the cool glass, thought about two winging orbits of the planet around its sun. The door slid open and he stepped out onto the balcony, feeling stucco under his bare feet. The night air was cool and flapped at his clothes, slipped over his buzzed skull. The cityscape lights were like fractured stars.  The last time they’d spoken face-to-face, she’d pushed his lips off her neck and tightened her scarf.  “It cheapens our accomplishment,” she’d explained. “People are saying things, O. Finally built a better vibrator. They said that.” Her face had been red and angry in the dark.  “I don’t give a shit,” he’d said.  “Frankenstein didn’t make the monster so he could put his dick in it.”  Ostap had had nothing to say to that, even though every part of Alyce shrank, apologetic and ashamed, a heartbeat after. He still didn’t.  Someone had floated up a cam on a helium sack, drifting level with the balcony, and now it started to whirr and flash. Ostap looked down and saw its laser light playing across his chest, tracking every twitch like a sniper’s scope. He thought of hurling his empty glass with perfect velocity, smashing it against the cam to rain tiny fragments down into the street. They would love that.  The carmine dot skittered across his arm, up his neck. Ostap went back inside, sliding the door shut behind him.  The wine was nearly gone when Ostap came back in. Alyce had left just a sliver in the bottom of the bottle, as she’d always done, to avoid the feeling she was drinking too much. She had her arms crossed, pacing back and forth with just a hint of unsteadiness.  “Like I said, if we shut everything down right now, if we power down your augs and get you to the labs, your chances are good,” she was saying. “We can figure out what can be removed. What can’t. We’ll get you on dialysis, an arti-heart . . . ”  “You came and sat with me in recovery,” Ostap said. “After every surgery. You always smelled like, uh, like hand sanitizer.”  “You said I had coffee breath,” Alyce said, stopping.  “That too, yeah. Black coffee and hand sanitizer.” Ostap paused. “After the last surgery, you showed me those Michelangelo paintings. Hellenic ideals, you talked about. All those trapezoids and abdomens.”  “Anatomically impossible, of course,” Alyce said. “All those opposing muscles groups flexing simultaneously. But beautiful.”  Ostap remembered how she’d dug further through the images, blowing up Grecian statues on the wall. A wasteland of cracked marble, mythological figures missing limbs, noses, genitals. She’d plucked at her throat with one finger, and murmured that it was too bad, how even gods decayed.  “You never asked me about the accident,” Ostap said, taking the wine bottle by the neck. “Not once in all these years.”  Alyce shook her head.  “Why?” Ostap asked, starting to pour, millimeter precise. “You’re a doctor. I know you’ve seen GBS before. You knew the spinal damage wasn’t trauma.”  “I’ve seen it,” Alyce agreed. “Yours looked early. Probably all but from birth, right?”  “Why?” Ostap repeated. “You had other candidates. Plenty of candidates. You had to know those tapes were doctored. That the accident story was bullshit.”  “I guess I wanted to make something from nothing.”  Ostap’s fingers tightened and a crack squealed through the bottle. Two droplets squeezed out and bloomed red on the carpet. He set the wine bottle down, delicate. “How God did it?” he asked.  “How God happened,” Alyce said. “We might have had better results with another candidate. We’ll never know. But you were perfect, O. You wanted it. No matter what happened.”  Ostap realized the wine was blurring her, smoothing the lines in her face, making her look almost how she did before.  “Thank you,” he said, because the only time he’d said it to her he was translating for his silver-haired father, who’d been sobbing too hard for software to understand.  “Whatever you decide.” She put her hand flat against his ribs, where organs ready to crumble did their work under skin so thin, no composite casing. He looked at her lined mouth. Graying hair. He looked at the hand on his flesh, their two bodies contrasted.  “It was anatomically impossible,” he said.  “But beautiful.”  Ostap undid the block and his head was a sudden deluge, blinking messages and interview probes and priority tags. He raked through the backlog of business. Mountain races, a suborbital parachute drop, a biomod boxing league, Accra promotions.  He gave nothing but green lights.    Originally published in Upgraded, edited by Neil Clarke. Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "text": "3970 words, short story, REPRINT\nGod Decay\nThere was new biomod ivy on the buildings, a ruddy green designed for long winters, but other than that the campus quad looked the same as it did a decade back. Ostap walked the honeycomb paving with his hands in his pockets, head and shoulders above the scurrying students. They were starting to ping him as he passed, raking after his social profile until he could feel the accumulated electronic gaze like static. Ostap had everything shielded, as was his agent’s policy, but that didn’t stop them from recognizing his pale face, buzzed head, watery blue eyes.\nA few North Korean transfers, who’d been in the midst of mocapping a rabbit, started shrieking as they caught sight of him. The game was up. Ostap flashed his crooked grin, the most-recognized smile in athletics and possibly the world, and by the time he was at the Old Sciences building he had a full flock. The students were mostly discreet with their recording, not wanting to seem too eager for celebspotting points, but Ostap could tell they were waiting for something as he walked up the concrete wheelchair ramp.\n“Accra 2036,” he said, linking his fingers for the Olympic rings. “We’re taking it all, right?”\nOstap let one massive palm drift along the rail, then flipped himself up and inverted to walk it on his hands. The flock cheered him all the way up the rail and applauded when he stuck the twisting dismount. Ostap gave them a quick bow, then turned through the doors and into the hall. The sudden hushed quiet made him feel like he was in a cathedral.\nBioscientist-now-professor Dr. Alyce Woodard had a new office, but Ostap had expected that. He’d never grown attached to the old one, not when their few visits there were so engulfed by the days and nights in the labs, in temperature-controlled corridors and stark white rooms where the fluorescents scoured away shadows and secrets.\nWhat Ostap hadn’t expected was how old Alyce had become. Her spine had a desk-chair curvature as she got up and crossed the floor, pausing the wallscreen with a wave of her hand. Her body fat sagged, her eyes were bagged. Ostap remembered her beautiful, and awful, an angel’s face floating above him with cold marble eyes and checklist questions. But that was before a long succession of tanned bodies and perfect teeth, and maybe she’d never been at all.\n“O,” Alyce said, thin arms around his midsection just briefly. “Thanks for coming short notice.”\n“It’s good to see you,” Ostap said. “Good to come back.” But it wasn’t; he felt like he was twenty-three again, stick-thin, draped boneless in a wheelchair.\n“Training for Accra, now, huh?” Alyce scratched at her elbow. “And a citizen, this time around. I just saw the new ads, they’re still using that clip from the 2028 Games . . . ” She waved the wallscreen to play, and Ostap saw himself loping out onto the track, blinking in the sunlight, fins of plastic and composite gleaming off his back and shoulders. It was the 7.9 seconds that had put the name Ostap Kerensky into every smartfeed, his events plastered on billboards and replayed ad nauseam on phones and tablets.\n“The dash,” Ostap said. “They really don’t get tired of it.”\n“Eight years on, you’d think they would,” Alyce said. Her smile was terse, but she watched, too. A cyclopean Pole, six foot five, noded spine, and long muscled limbs. No warm-up, no ritual. On the gunshot he came off the blocks like a Higgs boson.\n“The tracking camera fucking lost him,” Alyce quoted, because the commentators had long since been censored out. “It really fucking lost him.”\n“That was some year,” Ostap said, trying to read her, but the new lines on her face made it harder, not easier.\nShe flicked the wallscreen to mute. “I saw the feed of that promotion you did in Peru, too.” Alyce was looking up and down him. “Exhibition match, or something? With that football club?”\n“They’re hoping to open up the league to biomods next season, yeah.”\n“Oh.” Her face was blank.\n“The underground stuff is killing their ratings,” Ostap explained, to be explaining. “Nobody wants to watch pure sport any more. You know how it is. Blood doping, steroids, carbon blades, and now biomods: that’s what gets specs. I was talking to the—”\n“O.” Alyce clenched, unclenched her teeth.\n“Yeah?” Ostap’s voice was quieter than he wanted it.\n“Do you remember when we stopped doing the scans together? It was about five years back.”\nOstap remembered. He’d been on the new suborbital from Dubai to LAX, struggling to fit the scanner membranes over all of his nodes with the seat reclined and Dr. Woodard chatting in his ear. He’d just climbed a high-rise, one of those sponsored publicity stunts, like the company who wanted him to run the Tour de France on foot. That offer was still sitting in the backlog waiting for a green light.\nHe’d been tired.\n“I want to see you,” he’d said. “It’s been too long.”\n“I’m sick of the cams, O,” she’d said. “You bring them like fucking flies. Just talk to me.”\nSo he had, about the dark-haired girls in barely-shirts and tight cigarette jeans, the cosmetically-perfected lips and tits, the girls who’d mobbed him at the airport. They all would have killed for a night of his time.\n“You’re welcome,” Alyce had said, when he was finished. “Still.”\n“I’m sending the scan,” Ostap had said, because he had nothing else she wanted. He’d sent it before the suborbital peaked and the conversation crackled away, and after that, the conversations stopped.\n“I remember,” Ostap said now, unsmiling. “We set it up to automate.”\nAlyce moved to sit back against the desk, her hands veiny on the wood. “You look fine,” she said sadly. “You don’t even look thirty-three.” Ostap watched her mouth tightening.\n“What’s wrong?” he asked.\n“The augs are asking too much, O.” Alyce put a finger to her ribs. “The stress on your central nervous system, your organs. It’s been increasing. They’re all on their way out. Heart first, I’d think.” She was not wincing, not looking away. “Two more years is the projected max.”\nOstap felt the nodes like he hadn’t since the surgeries, felt the pulse of them deep in flesh. He felt the composite wrapping his spine, the membranes skimming under his skin, the fish-scale vents on his back and shoulders and neck. He felt the thrumming power, but now like a venom sack set to burst.\n“Shit,” he said. “Shit.”\n“I’m sorry,” Alyce said. “Have you experienced anything?”\n“Don’t think so.” But it was hard to tell, now, hard to tell when his heart was skipping from blowing doxy rails, from adrenal rush, from a woman with the biomod fetish exploring every micrometer of his visible augs. The Superman was supposed to be invulnerable.\n“You don’t think so?”\n“I don’t know,” Ostap snapped. “How am I supposed to fucking know, Dr. Woodard?” He hadn’t meant to call her that, but it came out on its own, like she was still the blue fairy in his ear whispering him through operation after operation as they flayed his nerves bare. She didn’t know he still dreamed about the final surgery, the sounds of scraping bone and machine.\n“I’m sorry, O.”\nHell, the kind Hieronymus Bosch would have painted, eighteen excruciating hours of laser-guided scalpels and winches and needles. Under for some of it, locally anaesthetized for the rest. Needles in his skin and breathing tubes speared down his throat. He’d thought that had been price enough.\n“How long have you known for?” Ostap finally asked.\n“That it was a possibility, since the start. That it was happening?” Alyce paused. “A long time.” She folded her arms and it made her look small. “Should I have told you?”\n“No,” Ostap said, but he wasn’t sure. The slogan for the 2036 Games was looping endlessly across the wallscreen. Legends are made in America.\n“Okay.”\nOstap put his hand up to his skull. “So why now?” he asked. “Why are you telling me now?”\nThe game in Peru, when he’d struck a volley out of the air for the first time and buried it back-corner, like he’d done it all his life, quick-synch nerves of his leg loaded with new muscle memories. On the bench it had gone numb for just a second, from his knee down.\n“This fucking doctorate student got into my web-cache,” Alyce said. “I don’t know how, I thought it was all airtight. She found the records. The story’s going to break in a couple hours.”\n“Alright,” Ostap said. “Alright.”\n“Sorry, O.”\n“What happens now?” Ostap asked.\nAlyce gave a helpless shrug. “There are tests,” she said. “There are possibilities. Options. I’ve still got full access to the biolabs.”\nOstap left the office without saying goodbye. Digital maps to expensive hotels were already scrawling over his retinas, reminding him of their impeccable service, their luxury suites. He’d thought he would be here for a few days, maybe, a few days to catch up after so many years. He’d imagined walking with her on the steep, rough river trails and catching her if she slipped.\nOutside there was a student who wanted to speak Polish with him, whose shirt scrolled a list of Ostap’s world records down his back. Ostap mumbled a few words, shook his sweat-slick hand. Others were clutching fake memorabilia and raving about things he barely remembered doing. A few girls were fluffing fingers through sun-blonde hair, casually rolling waistbands lower on their hips, pursing their lips, and trying to figure out bedroom eyes.\nHe went past them all like a zombie, and walked all the way to the university bus station before he remembered he’d ordered an autocab.\nTwenty minutes later Ostap pushed into the lobby through a crush of mobbers, the ones who’d used complex algorithms to predict his preferred hotel, and there he had the privilege of watching the story break in real time. The alert blinked yellow onto their retinas, vibrated tablets or phones for the migraine-prone and slow adopters, and small worlds turned upside down one by one. It shuddered through the jerseys and 3D-print face masks and groping hands like a wave. Ostap would have been reading it himself if he hadn’t put up a datablock.\nSilence and exclamations of disbelief started flickering back and forth like a light switch.\n“Your finger here, sir,” said the shell-shocked concierge, holding out the pad for a signature. He had enough presence of mind to pretend it didn’t work, necessitating a fresh pad and leaving him with a small slice of Ostap Kerensky’s genetic material to slip into his pocket. Ostap knew all about that trick, but he didn’t give a cheerful wink or offer a hangnail. Not this time.\nThe whisper-silent elevator took him to the very top, and when the wallscreens in his suite flicked on to greet him, the story was everywhere. He told them to mute, but he still watched. Pictures of Alyce skittered around the room, her mouth in a deep frown, and Ostap could tell from the selection that the current spin was villain, deceiver. He saw footage of himself zipping into a custom wet suit, rubbing petroleum jelly over his hands and cheekbones, flashing the cams a thumbs up before he waded into the water to set the new English Channel record.\nBack to the 2028 Games again, when Ostap took the world by storm. 100 meter, 200 meter. High-jump. Still enough in the tank for decathlon. Bolt’s records were gone, Sterling’s record was shattered. Ostap watched it all flash by in sound bites, his story condensed for anyone living under a particularly large rock.\nAn incredibly promising young athlete, all but scouted from the womb, left crippled by a three-car collision when the driving AI in a cab glitched. A brilliant developer, born and bred for MIT, spearheading a team designing the most comprehensively integrated body augmentation the world had ever seen.\nThey’d found each other across the ocean, and it was so fucking perfect.\nThe sky was growing dark and the clips were starting to recycle when Alyce buzzed in his ear. He could barely hear her, even with voice ID.\n“They were waiting at my fucking house,” she said, and then the next part got swallowed.\n“They’re here, too,” Ostap said. He’d seen it on the screen, the termite swarm of reporters and spectators milling the base of the hotel.\n“So am I,” she said. “Want to let me up before they crucify me?”\nOstap crossed to the balcony, palmed the glass door open. It looked like a party. People were all slammed up against each other, twisting and turning for better angles, cams flashing pop-pop-pop in the dark, hot white, miniature supernovas. He couldn’t see Alyce struggling through the crowd from her cab, not at this height, but he could tell where she was by the ripples. She’d barely made it five meters.\nHe called the hotel security detail to go bring her in, and ten minutes later she slumped through the door, hair tendrilled with static across her face. She held up a bottle of Cannonball and sloshed it pointedly with a quarter of a smile.\n“Probably safer here than anywhere else,” she said, while Ostap retrieved two glasses from the designer coffee table.\n“Probably, yeah. They’re going to be burning cars soon.”\n“You left before I could explain everything.” Alyce handed the bottle over. Ostap pushed the cork with his fingertip until it plopped out and splashed down, bobbing in the wine like a buoy. She poured.\n“I thought maybe you called me for something else,” Ostap said. He kept his eyes off the bed.\n“People only call Superman when there’s trouble, O.” Alyce took a slug of the wine and swished it in her mouth. Swallowed. “They never call him to say everything’s great, you should come visit.”\n“They should,” Ostap said. “They used to. We used to just visit.”\n“If you want to call it that,” Alyce said, but there was a flush in the tips of her ears that wasn’t from the wine. She handed him the other glass.\n“The first time we fucked was one week after I learned to walk. To the day.” Ostap tried to laugh. “Did you know that? I mean, what kind of Oedipal shit is that?”\nTwitching his toes in the recovery room had been euphoria, standing on his own two feet, Elysium. As soon as he was cleared, he’d spent every second he could with the harness, tottering on a treadmill as his new nerves carved channels of motion and memory. One night Dr. Woodard had stayed with him, to show him where else his new nerves led.\n“It wasn’t on my calendar,” Alyce said. “It just happened.”\nAnd it had been over quickly, a confusion of sweat and heat that had nothing methodical, nothing logical about it. She hadn’t nodded thoughtfully or dashed notes on her tablet afterward.\n“Nasty, brutish, and short,” was what she’d said, but smiling, wriggling back into her jeans. She’d put her hands around Ostap’s hips, where scars were still tender.\n“I’ve had dreams about you,” Ostap had replied, but in Polish, so she wouldn’t know.\n“Maybe I’m just a narcissist,” Alyce said now, to her wine glass. “Maybe Michelangelo wanted Il David.”\n“You should have just let me find out on the fucking net,” Ostap said.\n“Should I leave?” Alyce asked.\nShe sat on the hotel bed, rumpling crisp white sheets, and Ostap sat on the floor with his head leaned back against its foot. The wine was clinging in his dry mouth.\nThe last time he’d been in this city, every day had been stronger and faster and smoother. The augs had been synchronizing, the protein pumps sculpting muscles layer by layer. His new size had had him ducking under doorways and cramming into cars. They’d flown a redeye back to Warsaw for the final stretch of treatments, for last calibrations and probes and to finally see his mother and father. He hadn’t been in Boston since.\n“My parents,” Ostap said. “I’m going to have to tell them.”\n“Where are they now?” Alyce asked.\n“La Rochelle. Moved them there a few years ago.” He tipped his head back. “They always wanted to holiday there. I think they’re happy.”\n“That’s good,” Alyce said. “When you’re old you deserve to be happy. You’ve put up with enough shit.”\nYou’re old, Ostap wanted to say. He wanted to ask her if she was happy.\n“Maybe they are, maybe they’re not,” he said instead. “I’m wrong about that. Sometimes. I mean, I thought you and me were happy.”\n“We were,” Alyce said. “Because we were riding a whirlwind, O. You know, the parties and the galas and the fashion consultants and booking agents. All those interviews. Hell, I even wore a dress.”\n“I remember,” Ostap said. He’d worn a tailored suit, slashed in such a way as to display the nodes along his spine, and in a matter of weeks everyone wore them that way. “Movie stars and moguls,” he said. “That night in Chicago.”\n“Rome, Dubai, New York.” Alyce shrugged. “They blend.”\n“Chicago, when the Superman thing was just taking off,” Ostap pressed, because it was important somehow, important that she remember that one drunken night in Chicago they’d spent roving through the city in an autocab, searching for a phone booth. There were none left, so they’d ended up tinting the windows instead.\n“We had a good run,” Alyce said. “And that year. Well. I’ll always remember that year.”\nThey were quiet for a moment, listening to what sounded like a full riot outside, hoarse screaming and one looping police siren. Ostap had turned the wallscreens off, but he could guess what was happening. He could guess that his net implant would be overloaded with calls, messages, demands when he lifted the block.\n“What are they saying?” he finally asked. “I blocked the feed.”\n“All the classics.” Alyce moved the dregs of her glass in a slow circle, tipping it just so. “Neo-reactionists flaring up all over. Abomination. Playing God. Things like that.”\n“Playing Frankenstein,” Ostap said, and felt a dull triumph when her face went red.\n“Yeah. All those.”\n“It won’t change anything,” he said, then, when she looked at him shrewdly: “It won’t stop biomods. Developers will still be going after full integration.” He paused. “Maybe they’ll look at safer designs. Learn from your mistake.”\n“Safety isn’t even in the equation when they’ve already killed a dozen candidates under Beijing. But they’re still only seeing success with the partial augs.” She reached for the bottle on the nightstand. “We were lucky with you, O. You might be the first, best. Last.”\n“Do you remember the last time we talked face to face?” Ostap asked. “After your symposium.”\n“Why are we talking about all this, O?”\n“Because I always thought there would be time later.”\n“There will be,” Alyce said. “I told you. There are options.”\n“I’m grabbing some air,” Ostap said. He got up and walked to the wide window. He thought about two years as his hands found the cool glass, thought about two winging orbits of the planet around its sun. The door slid open and he stepped out onto the balcony, feeling stucco under his bare feet. The night air was cool and flapped at his clothes, slipped over his buzzed skull. The cityscape lights were like fractured stars.\nThe last time they’d spoken face-to-face, she’d pushed his lips off her neck and tightened her scarf.\n“It cheapens our accomplishment,” she’d explained. “People are saying things, O. Finally built a better vibrator. They said that.” Her face had been red and angry in the dark.\n“I don’t give a shit,” he’d said.\n“Frankenstein didn’t make the monster so he could put his dick in it.”\nOstap had had nothing to say to that, even though every part of Alyce shrank, apologetic and ashamed, a heartbeat after. He still didn’t.\nSomeone had floated up a cam on a helium sack, drifting level with the balcony, and now it started to whirr and flash. Ostap looked down and saw its laser light playing across his chest, tracking every twitch like a sniper’s scope. He thought of hurling his empty glass with perfect velocity, smashing it against the cam to rain tiny fragments down into the street. They would love that.\nThe carmine dot skittered across his arm, up his neck. Ostap went back inside, sliding the door shut behind him.\nThe wine was nearly gone when Ostap came back in. Alyce had left just a sliver in the bottom of the bottle, as she’d always done, to avoid the feeling she was drinking too much. She had her arms crossed, pacing back and forth with just a hint of unsteadiness.\n“Like I said, if we shut everything down right now, if we power down your augs and get you to the labs, your chances are good,” she was saying. “We can figure out what can be removed. What can’t. We’ll get you on dialysis, an arti-heart . . . ”\n“You came and sat with me in recovery,” Ostap said. “After every surgery. You always smelled like, uh, like hand sanitizer.”\n“You said I had coffee breath,” Alyce said, stopping.\n“That too, yeah. Black coffee and hand sanitizer.” Ostap paused. “After the last surgery, you showed me those Michelangelo paintings. Hellenic ideals, you talked about. All those trapezoids and abdomens.”\n“Anatomically impossible, of course,” Alyce said. “All those opposing muscles groups flexing simultaneously. But beautiful.”\nOstap remembered how she’d dug further through the images, blowing up Grecian statues on the wall. A wasteland of cracked marble, mythological figures missing limbs, noses, genitals. She’d plucked at her throat with one finger, and murmured that it was too bad, how even gods decayed.\n“You never asked me about the accident,” Ostap said, taking the wine bottle by the neck. “Not once in all these years.”\nAlyce shook her head.\n“Why?” Ostap asked, starting to pour, millimeter precise. “You’re a doctor. I know you’ve seen GBS before. You knew the spinal damage wasn’t trauma.”\n“I’ve seen it,” Alyce agreed. “Yours looked early. Probably all but from birth, right?”\n“Why?” Ostap repeated. “You had other candidates. Plenty of candidates. You had to know those tapes were doctored. That the accident story was bullshit.”\n“I guess I wanted to make something from nothing.”\nOstap’s fingers tightened and a crack squealed through the bottle. Two droplets squeezed out and bloomed red on the carpet. He set the wine bottle down, delicate. “How God did it?” he asked.\n“How God happened,” Alyce said. “We might have had better results with another candidate. We’ll never know. But you were perfect, O. You wanted it. No matter what happened.”\nOstap realized the wine was blurring her, smoothing the lines in her face, making her look almost how she did before.\n“Thank you,” he said, because the only time he’d said it to her he was translating for his silver-haired father, who’d been sobbing too hard for software to understand.\n“Whatever you decide.” She put her hand flat against his ribs, where organs ready to crumble did their work under skin so thin, no composite casing. He looked at her lined mouth. Graying hair. He looked at the hand on his flesh, their two bodies contrasted.\n“It was anatomically impossible,” he said.\n“But beautiful.”\nOstap undid the block and his head was a sudden deluge, blinking messages and interview probes and priority tags. He raked through the backlog of business. Mountain races, a suborbital parachute drop, a biomod boxing league, Accra promotions.\nHe gave nothing but green lights.\nOriginally published in Upgraded, edited by Neil Clarke.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "source": "https://clarkesworldmagazine.com/larson_03_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: God Decay by Rich Larson"}