{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Karen Burnham", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "zFKvS6DLfeSFcVlwdU/tECK05O8=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Difficulties of an Asteroid Capture Mission  2013 is shaping up to be the Year of the Asteroid.  On February 15th a 10,000 ton meteor, undetected until it streaked through the sky, exploded above the Russian city of Chelyabinsk. According to National Geographic, the shock wave from the explosion circled the entire globe twice before dying down.  Coincidentally, it came on the same day that dedicated asteroid watchers were all eyeing the heavens looking at Asteroid 2012 DA14, a 130,000 ton asteroid that passed Earth within about 17,000 miles—closer than our geosynchronous satellites (for comparison, the Moon is more than fifteen times further away, at about 250,000 miles). In the wake of these sobering reminders that there are still asteroid collisions all the time in our Solar System, NASA has proposed an interesting mission: instead of sending astronauts out to meet an asteroid, the intent would be to capture an asteroid and bring it close enough to Earth for the currently planned Orion capsule to send astronauts out to it.  Add to that not one, but two private enterprises that have started up this year to examine the potential for asteroid mining, and this is a good year to be thinking about asteroids. However, extracting information and resources from asteroids may be more difficult than it would seem at first blush.  Why do we care about asteroids? For one, as illustrated above, they can kill us. And of course they can tell us quite a bit about the early days of the Solar System and its formation. But they can also provide us with resources. Shen Ge and Neha Satak of SPACE (Scientific Preparatory Academy for Cosmic Explorers) have an excellent chart in their paper on the economics of asteroid mining. It has two intersecting curves. One shows that inevitably the costs of extracting mineral resources here on Earth will go up. The other shows that (presumably) inevitably, the costs of doing business in space will go down over time. At some point in the future, although no one knows just when, it will be cheaper to mine certain materials in space than on Earth; if the full environmental impact of extractive industries were factored in, that point would probably arrive much sooner.  Science fiction has been imagining asteroid mining and habitation (carving out the interior volume of a chunk of rock to live in) for a very long time. We can go back to Isaac Asimov’s ice capture mission in “The Martian Way” (1952) and up to M. J. Locke (Laura Mixon)’s 2011 novel Up Against It, and those are just a small sample. Asteroid resource utilization is also important for a certain brand of post-human futures. In Greg Egan’s Diaspora, humans send very small spacecraft at very high sub-light speeds to interesting new planetary systems. The digital human consciousness spend their travel time in the VR simulation of their choice or unconscious, ready to be woken up if something interesting happens. When they reach their destination an army of nanomachines locates and reassembles whatever habitat/sensor package/solar power station/etc. that the post-human explorers need based on the resources available in the new system.  But even if we can’t send our digital consciousnesses to a distant star yet, why aren’t we already out there picking apart asteroids for fun and profit? There are a lot of answers to that question: a simple one is politics and the lack of political support for pretty much any single vision for space exploration. At a recent AIAA conference Beth Fischer was asked about her vision for the next 100 years of space exploration and she replied: “My vision is that we pick a vision and stick with it.” The applause was loud and sustained.  Another answer is that space launches, especially out to lunar orbit or beyond, are still difficult and expensive. Still, in 2029 the asteroid 99942 Apophis (a science fictional name if ever there was one) is predicted to pass within 18,000 miles of Earth, and researchers have estimated that it weighs around 30 million tons. Since it is so big and will be passing so close, why not just head on out and hitch a ride?  Let’s look at a few of the challenges facing a prospective asteroid mission. The first question we have to answer is: humans or robots? Humans are infinitely more versatile, but robots are much, much cheaper. So let’s look at what we can do with robots. We’ve had robots exploring the solar system for years: the Russians had a rover touring around the Moon’s surface, and NASA has had four incredibly successful Mars rovers. All of those have engaged in some form of geological research, scraping rocks for samples and analyzing them. Sounds like the perfect groundwork for prospecting an asteroid, right?  Unfortunately, no. It turns out that robots operating on a planet, even one with a very low gravity such as Mars (1/3 that of Earth) or the Moon (1/6 that of Earth) have many advantages that an asteroid robot wouldn’t. The gravity of even a large asteroid is so small that you could achieve escape velocity just by jumping. Without gravity to keep you on the surface, a rover driving around would leave the asteroid for good whenever it hit a bump. If it tried to swing a pick to break up a rock, it would simply push itself off the surface. There are plenty of means of tethering to a surface, but then you’re faced with a trade-off versus mobility and flexibility.  Then there’s the problem of actually extracting the minerals. Almost everything we know about mining was developed in the context of Earth, with its rich oxygen atmosphere, warm temperatures, and sturdy gravitational field. On an asteroid, none of that applies.  Consider platinum. Platinum is rare and valuable on Earth, and it occurs in somewhat higher concentrations on the Moon and in asteroids than it does here (some of the richer platinum sites on Earth are associated with meteor strikes). But like many metals, platinum must be separated from the ore in which it is found. In one typical mine in South Africa, they mined 16 million tons of ore in a year to yield 1.125 million ounces of platinum. That’s 2.2 parts per million, meaning that for every metric ton of ore they mined, they got 2.2 grams of platinum.  So even with a slightly better ratio on an asteroid, you still have to break up a lot of rocks to get what you’re looking for. That poses the first challenge. When you break a rock on Earth, the pieces fall down on the ground and you can pick them up. If you broke up an outcropping on an asteroid, most of the pieces would have enough velocity to go flying off into space, never to be seen again. Explosives, very common in terrestrial mining, would essentially launch everything that you were looking for off into the deep dark sky. So the first problem that has to be solved is breaking up and containing the ore that you’re working with.  Next, how do we separate the platinum from the ore? There are many ways, but almost all of them involve melting. That allows all the materials involved to flow and separate from each other, either by density (the platinum would sink compared to normal rock) or by magnetism (platinum is often found with iron, which can be separated out with a magnet). Again, we start to see the problems: melting things is much more difficult in space because out in the vacuum, everything wants to either freeze solid or boil away completely. And in a microgravity environment, a dense material won’t necessarily sink to the bottom of a processing container. This problem can be solved with centrifuges (spinning the materials instead of letting gravity do the work), but again you’re adding weight and complexity to your mission.  Similar problems would be found with those minerals that are usually extracted using some kind of dissolving solution, like the use of cyanide for gold mining. First ore is extracted, then crushed and mixed with water to form slurry. We’ve already seen some of the problems with liquids in space, but it gets worse. The chemical reaction that allows the gold to bind with the cyanide requires large amounts of dissolved oxygen, which would have to be introduced artificially, since there’s no oxygenated atmosphere available on the asteroid.  Nanotechnology would seem to be the answer to a lot of these problems, but the science fictional view of nanotech as a nigh-unto-magical grey goo is a long way in the future. While that’s worth another article all on its own, for now let’s just say that nanotechnology is far more limited in what it can achieve than the asteroid-stripping solar-panel-building bots of many post-human futures.  None of these problems are insurmountable, and as we travel along the curves that make minerals more expensive here on Earth and cheaper up in space, the economic incentives to solve these problems will increase rapidly. Miners have been enormously clever in devising ways to profit from resource extraction even in very hostile environments. But it is clear that the challenges ahead for asteroid mining are steep.  We won’t derive much benefit from all our experience with space robots or with terrestrial mining; instead a lot of processes will need to be devised from scratch. If we are to start laying the groundwork for this sort of mission, it seems like NASA’s asteroid capture mission would be a good place to start, with the added bonus of learning some lessons about changing an asteroid’s orbit—something we’ll want to be able to do the next time a killer asteroid is headed our way. As much of science fiction has imagined, it seems likely that in the future we will end up working with asteroids one way or another. But we’re just starting the journey of learning how to work with them.  There’s a long way to go yet.  Karen Burnham is an electrical engineer working at NASA's Johnson Space Center (all opinions expressed in this piece are her own, and no reflection of NASA's official policy). She is also a book reviewer writing for Locus, Strange Horizons, SFSignal, and Cascadia Subduction Zone. She writes non-fiction about science when she can, and recently started writing for GeekMom.com.", "text": "Non-Fiction\nDifficulties of an Asteroid Capture Mission\n2013 is shaping up to be the Year of the Asteroid.\nOn February 15th a 10,000 ton meteor, undetected until it streaked through the sky, exploded above the Russian city of Chelyabinsk. According to National Geographic, the shock wave from the explosion circled the entire globe twice before dying down.\nCoincidentally, it came on the same day that dedicated asteroid watchers were all eyeing the heavens looking at Asteroid 2012 DA14, a 130,000 ton asteroid that passed Earth within about 17,000 miles—closer than our geosynchronous satellites (for comparison, the Moon is more than fifteen times further away, at about 250,000 miles). In the wake of these sobering reminders that there are still asteroid collisions all the time in our Solar System, NASA has proposed an interesting mission: instead of sending astronauts out to meet an asteroid, the intent would be to capture an asteroid and bring it close enough to Earth for the currently planned Orion capsule to send astronauts out to it.\nAdd to that not one, but two private enterprises that have started up this year to examine the potential for asteroid mining, and this is a good year to be thinking about asteroids. However, extracting information and resources from asteroids may be more difficult than it would seem at first blush.\nWhy do we care about asteroids? For one, as illustrated above, they can kill us. And of course they can tell us quite a bit about the early days of the Solar System and its formation. But they can also provide us with resources. Shen Ge and Neha Satak of SPACE (Scientific Preparatory Academy for Cosmic Explorers) have an excellent chart in their paper on the economics of asteroid mining. It has two intersecting curves. One shows that inevitably the costs of extracting mineral resources here on Earth will go up. The other shows that (presumably) inevitably, the costs of doing business in space will go down over time. At some point in the future, although no one knows just when, it will be cheaper to mine certain materials in space than on Earth; if the full environmental impact of extractive industries were factored in, that point would probably arrive much sooner.\nScience fiction has been imagining asteroid mining and habitation (carving out the interior volume of a chunk of rock to live in) for a very long time. We can go back to Isaac Asimov’s ice capture mission in “The Martian Way” (1952) and up to M. J. Locke (Laura Mixon)’s 2011 novel Up Against It, and those are just a small sample. Asteroid resource utilization is also important for a certain brand of post-human futures. In Greg Egan’s Diaspora, humans send very small spacecraft at very high sub-light speeds to interesting new planetary systems. The digital human consciousness spend their travel time in the VR simulation of their choice or unconscious, ready to be woken up if something interesting happens. When they reach their destination an army of nanomachines locates and reassembles whatever habitat/sensor package/solar power station/etc. that the post-human explorers need based on the resources available in the new system.\nBut even if we can’t send our digital consciousnesses to a distant star yet, why aren’t we already out there picking apart asteroids for fun and profit? There are a lot of answers to that question: a simple one is politics and the lack of political support for pretty much any single vision for space exploration. At a recent AIAA conference Beth Fischer was asked about her vision for the next 100 years of space exploration and she replied: “My vision is that we pick a vision and stick with it.” The applause was loud and sustained.\nAnother answer is that space launches, especially out to lunar orbit or beyond, are still difficult and expensive. Still, in 2029 the asteroid 99942 Apophis (a science fictional name if ever there was one) is predicted to pass within 18,000 miles of Earth, and researchers have estimated that it weighs around 30 million tons. Since it is so big and will be passing so close, why not just head on out and hitch a ride?\nLet’s look at a few of the challenges facing a prospective asteroid mission. The first question we have to answer is: humans or robots? Humans are infinitely more versatile, but robots are much, much cheaper. So let’s look at what we can do with robots. We’ve had robots exploring the solar system for years: the Russians had a rover touring around the Moon’s surface, and NASA has had four incredibly successful Mars rovers. All of those have engaged in some form of geological research, scraping rocks for samples and analyzing them. Sounds like the perfect groundwork for prospecting an asteroid, right?\nUnfortunately, no. It turns out that robots operating on a planet, even one with a very low gravity such as Mars (1/3 that of Earth) or the Moon (1/6 that of Earth) have many advantages that an asteroid robot wouldn’t. The gravity of even a large asteroid is so small that you could achieve escape velocity just by jumping. Without gravity to keep you on the surface, a rover driving around would leave the asteroid for good whenever it hit a bump. If it tried to swing a pick to break up a rock, it would simply push itself off the surface. There are plenty of means of tethering to a surface, but then you’re faced with a trade-off versus mobility and flexibility.\nThen there’s the problem of actually extracting the minerals. Almost everything we know about mining was developed in the context of Earth, with its rich oxygen atmosphere, warm temperatures, and sturdy gravitational field. On an asteroid, none of that applies.\nConsider platinum. Platinum is rare and valuable on Earth, and it occurs in somewhat higher concentrations on the Moon and in asteroids than it does here (some of the richer platinum sites on Earth are associated with meteor strikes). But like many metals, platinum must be separated from the ore in which it is found. In one typical mine in South Africa, they mined 16 million tons of ore in a year to yield 1.125 million ounces of platinum. That’s 2.2 parts per million, meaning that for every metric ton of ore they mined, they got 2.2 grams of platinum.\nSo even with a slightly better ratio on an asteroid, you still have to break up a lot of rocks to get what you’re looking for. That poses the first challenge. When you break a rock on Earth, the pieces fall down on the ground and you can pick them up. If you broke up an outcropping on an asteroid, most of the pieces would have enough velocity to go flying off into space, never to be seen again. Explosives, very common in terrestrial mining, would essentially launch everything that you were looking for off into the deep dark sky. So the first problem that has to be solved is breaking up and containing the ore that you’re working with.\nNext, how do we separate the platinum from the ore? There are many ways, but almost all of them involve melting. That allows all the materials involved to flow and separate from each other, either by density (the platinum would sink compared to normal rock) or by magnetism (platinum is often found with iron, which can be separated out with a magnet). Again, we start to see the problems: melting things is much more difficult in space because out in the vacuum, everything wants to either freeze solid or boil away completely. And in a microgravity environment, a dense material won’t necessarily sink to the bottom of a processing container. This problem can be solved with centrifuges (spinning the materials instead of letting gravity do the work), but again you’re adding weight and complexity to your mission.\nSimilar problems would be found with those minerals that are usually extracted using some kind of dissolving solution, like the use of cyanide for gold mining. First ore is extracted, then crushed and mixed with water to form slurry. We’ve already seen some of the problems with liquids in space, but it gets worse. The chemical reaction that allows the gold to bind with the cyanide requires large amounts of dissolved oxygen, which would have to be introduced artificially, since there’s no oxygenated atmosphere available on the asteroid.\nNanotechnology would seem to be the answer to a lot of these problems, but the science fictional view of nanotech as a nigh-unto-magical grey goo is a long way in the future. While that’s worth another article all on its own, for now let’s just say that nanotechnology is far more limited in what it can achieve than the asteroid-stripping solar-panel-building bots of many post-human futures.\nNone of these problems are insurmountable, and as we travel along the curves that make minerals more expensive here on Earth and cheaper up in space, the economic incentives to solve these problems will increase rapidly. Miners have been enormously clever in devising ways to profit from resource extraction even in very hostile environments. But it is clear that the challenges ahead for asteroid mining are steep.\nWe won’t derive much benefit from all our experience with space robots or with terrestrial mining; instead a lot of processes will need to be devised from scratch. If we are to start laying the groundwork for this sort of mission, it seems like NASA’s asteroid capture mission would be a good place to start, with the added bonus of learning some lessons about changing an asteroid’s orbit—something we’ll want to be able to do the next time a killer asteroid is headed our way. As much of science fiction has imagined, it seems likely that in the future we will end up working with asteroids one way or another. But we’re just starting the journey of learning how to work with them.\nThere’s a long way to go yet.\nKaren Burnham is an electrical engineer working at NASA's Johnson Space Center (all opinions expressed in this piece are her own, and no reflection of NASA's official policy). She is also a book reviewer writing for Locus, Strange Horizons, SFSignal, and Cascadia Subduction Zone. She writes non-fiction about science when she can, and recently started writing for GeekMom.com.", "source": "https://clarkesworldmagazine.com/burnham_10_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Difficulties of an Asteroid Capture Mission by Karen Burnham"}