{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "HzTJGPuDks3ua1DB0r5dPAmGf1A=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Howling at the Lunar Landscape: A Conversation with Ian McDonald  That luminous sphere hanging over us in the night sky has long been the source of fascination, conspiracy, dreams, and adventure. Stories have been spun on moonbeams and grounded in moon rocks. It sits in the sky as a reminder of both our history and the future. Countless authors have looked up to see bases, rockets, and cities, but this time a singular mind has imagined a lunar society more diverse and dangerous than anything before. Ian McDonald has created a New Moon.  Luna: New Moon sets the stage with family corporate dynasties in precarious detente as they compete for total lunar supremacy. From the early days of rare metal mining and helium-3 production, five families have built up entire cities and a society where everything is negotiable, down to the air you breathe. A botched assassination attempt sows the seeds of doubt that spark smoldering rivalries into all-out war between families and companies. But, there is something else at play. As it seems with everything on the moon, there is something else happening under the surface. Luna: Wolf Moon picks up after the explosive end of the previous novel and keeps the momentum going. The Corta family has been scattered to the lunar wind, but they’re not completely out of the game. Ian McDonald’s second entry into the trilogy engulfs readers in the complex machinations of lunar society and the Corta family’s play for redemption and revenge.  Ian McDonald is the author of numerous novels and short stories. He has won the Hugo, Nebula, Locus, Philip K. Dick, Theodore Sturgeon, and many other awards for his writing. His latest novel is Luna: Wolf Moon, out from Tor Books on March 28th.   What was the initial inspiration for the Luna trilogy?  I’ve always loved Moonbase stories. I like the notion of being able to go outside on a clear night, look up at the moon, and see the lights of human settlement there. Moonbase stories had gone out of fashion—there are cycles in Science Fiction—so it was obvious to me that it was about time to do something new with it. At the same time, my wife was watching the reboot of Dallas (it was terrible, alas) and I did the writerly thing of asking myself, how could you take the format of a family, beset by enemies, at war with itself, and make it so no one can ever escape it? Answer: set it on the Moon. The two ideas crashed and fused.  The society on the moon is a melting pot, or pressure cooker, of cultures, languages, and ethnicities that all blend and interact seamlessly. What kind of research did you do to make each section of the moon so rounded and developed? Have you traveled to Brazil, Ghana, or Australia?  I’ve been to Brazil, which still fascinates me as a nation and culture. I wanted the Moon to be a place where identities and cultures, meet, melt, and form a new society under the immense pressures of living and working in such a hostile world. I didn’t want the usual suspects either—so it’s not a North American dominated moon, though the Chinese, in the form of the Sun family and Russians—the deeply weird Vorontsovs—are represented. I wanted a West African society, so the Asamoahs started off as contract workers in the early days of lunar development and have grown to become one the Five Dragons, the corporations that dominate lunar society. And I liked the idea of having Australians as the bad guys.  There’s a lush and large cast of characters in these books. How do you keep them all organized while writing? Do you have a giant corkboard with pins, index cards, and string?  Scapple—a white-board/mind-map app. Also, fantastic for family trees. Aeon Timeline—still getting to grips with this. Evernote—things get clipped in from online sources. Pinterest for Visual Research. (www.pinterest.com/ianneilmcdonald since you asked.) I don’t carry notebooks to jot things down—I practice a kind of Darwinism of ideas—if an idea is strong or fruitful enough, I’ll remember it. And I can’t actually read my handwriting now, anyway.  I’ve read that the structure of the Luna novels was partially inspired by the Godfather films. Did any films inspire your cast of characters?  Very much. In the relationship between Rafa and Lucas in New Moon it was very much that of the golden son and the smarter younger brother who knows he can run the show better. Sonny and Michael Corleone, or, if you like, Thor and Loki. But I don’t have a Godfather, I have a Godmother—Adriana Corta. Of course, by the end of New Moon, everything is changed. Changed utterly. Changed terribly. Wolf Moon picks up the pieces. This is the one about sheer survival.  Some of your other novels feature developing economies. What is it about developing societies and economies that interest you?  There’s a raw energy and passion to them that makes them great for story. All the human vices are there—greed, envy, ambition, lust. And the human virtues too. It’s about what races ahead and what—and who—gets left behind. Emergent economies undergo incredible changes in short spaces of time—and that’s gold for the writer. Where you have change, you have its opposite, and you have drama. This developing economy just happens to be on the moon. But it’s the same passions, ambitions, loves, and hatreds that ignite the story.  What kind of research went into the hard science aspects of a society living on the moon and how did it shape the worldbuilding?  I started the project back in 2012 and since then, the literature on lunar colonization (and there’s a lot, especially online) and the science of the moon has evolved. My problem is, I’m stuck with the 2012 version. So be it. Some pieces of research were huge drivers to the plot—the slow loss of bone density and muscle condition in lunar gravity, meaning that there is a two-year time limit on returning to Earth, after which it will kill you. That’s such a rich source of story. Likewise, the fact that human skin is pretty gas tight, and you don’t explode in vacuum was the source of the Moonrun scene at the start of New Moon, and some simple sums about terminal velocity under lunar gravity inspired Robson’s free-running accident in Wolf Moon. I’m interested in how constraints drive human behavior and how that behavior turns into culture and, ultimately, a civilization.  Throughout the Luna novels it’s well established that there are a number of ways to die on the moon. What do you think is the worst way to kick the bucket up on the lunar surface?  Anything slow. Anything that involves breathing, and realizing that that breath you took—that’s your last breath. Anything that allows you to know with a sure certainty that you are going to die.  Sexuality is fluid on the moon. Like the people living there, it’s diverse. Is this a product of the future, because of the way a society might develop on the moon, or a combination of the two?  It’s a by-product of the legal system, in some ways. The moon has no criminal or civil law, only contract law. Everything is negotiated, everything is a personal contract. That includes marriage, and sex. We see sexuality in terms of identity groups; no one on the moon would understand that. It’s about who you love—who you want to have sex with (or not have sex with)—not what. Everything is personal. In some ways, it’s a hugely atomized society, in another, it’s a society that has consent—contractually agreed and guaranteed—built right through it.  There are four resources that govern survival on the moon: air, water, carbon, and data. They’re necessities of life, but they’ve also been privatized and can be used to intimidate and control people. Do you think that this is something that could or is happening now on Earth?  I was interested in building a society where no one actually owns anything—everything is rented, in a sense, or licensed. Even the air in your lungs. It’s the ultimate rentier society, and I certainly see our own economic models moving towards rent-seeking rather than innovation and competitive capitalism. Subscription and streaming services—even soft apps are now a monthly subscription rather than buying outright and updating once a year. Certainly, in the UK, insane housing speculation has pushed an entire generation into renting their homes. Rentierism is lazy, controlling and stifling of true innovation, and it looks like it’s only going to get bigger,  Luna: New Moon was optioned by CBS to be made into a TV show. Is this still in the works? Are there any details that you can share?  Things in television either happen very quickly, or very slowly. This is the second kind of happen. But things are moving.  The Luna books were originally conceived as a duology. What happened that made you want to expand it into a trilogy?  The story was too big. To wrap it all up in two books would have made Wolf Moon about eight hundred pages long. Simpler to cut it in two—make it Wolf Moon and Rising Moon. The break between the two feels natural and a suitable conclusion to Wolf Moon: it’s not like a narrative guillotine falls on page four hundred and that’s it. Trilogising also means that readers wouldn’t have to wait an unconscionable amount of time for the story to finish.  Can you give us a little teaser of what may be coming up in the third book?  The structure is inspired by Gladiator. Like the movie, it starts with a battle, ends hand-to-hand, face-to-face, up close and personal. If you’ve read Wolfie you’ll know what that conflict has to be.  If you had a 3D printer that could print out any clothes on demand, what decade’s fashion would you choose to fill your closet?  For men, the 1920s, if we’re going 20th century. Any era, Europe circa 1798. Impossible for a guy to look bad in that stuff.  Besides the final book, what other projects do you have in the works?  Always thinking a few more books ahead. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nHowling at the Lunar Landscape: A Conversation with Ian McDonald\nThat luminous sphere hanging over us in the night sky has long been the source of fascination, conspiracy, dreams, and adventure. Stories have been spun on moonbeams and grounded in moon rocks. It sits in the sky as a reminder of both our history and the future. Countless authors have looked up to see bases, rockets, and cities, but this time a singular mind has imagined a lunar society more diverse and dangerous than anything before. Ian McDonald has created a New Moon.\nLuna: New Moon sets the stage with family corporate dynasties in precarious detente as they compete for total lunar supremacy. From the early days of rare metal mining and helium-3 production, five families have built up entire cities and a society where everything is negotiable, down to the air you breathe. A botched assassination attempt sows the seeds of doubt that spark smoldering rivalries into all-out war between families and companies. But, there is something else at play. As it seems with everything on the moon, there is something else happening under the surface. Luna: Wolf Moon picks up after the explosive end of the previous novel and keeps the momentum going. The Corta family has been scattered to the lunar wind, but they’re not completely out of the game. Ian McDonald’s second entry into the trilogy engulfs readers in the complex machinations of lunar society and the Corta family’s play for redemption and revenge.\nIan McDonald is the author of numerous novels and short stories. He has won the Hugo, Nebula, Locus, Philip K. Dick, Theodore Sturgeon, and many other awards for his writing. His latest novel is Luna: Wolf Moon, out from Tor Books on March 28th.\nWhat was the initial inspiration for the Luna trilogy?\nI’ve always loved Moonbase stories. I like the notion of being able to go outside on a clear night, look up at the moon, and see the lights of human settlement there. Moonbase stories had gone out of fashion—there are cycles in Science Fiction—so it was obvious to me that it was about time to do something new with it. At the same time, my wife was watching the reboot of Dallas (it was terrible, alas) and I did the writerly thing of asking myself, how could you take the format of a family, beset by enemies, at war with itself, and make it so no one can ever escape it? Answer: set it on the Moon. The two ideas crashed and fused.\nThe society on the moon is a melting pot, or pressure cooker, of cultures, languages, and ethnicities that all blend and interact seamlessly. What kind of research did you do to make each section of the moon so rounded and developed? Have you traveled to Brazil, Ghana, or Australia?\nI’ve been to Brazil, which still fascinates me as a nation and culture. I wanted the Moon to be a place where identities and cultures, meet, melt, and form a new society under the immense pressures of living and working in such a hostile world. I didn’t want the usual suspects either—so it’s not a North American dominated moon, though the Chinese, in the form of the Sun family and Russians—the deeply weird Vorontsovs—are represented. I wanted a West African society, so the Asamoahs started off as contract workers in the early days of lunar development and have grown to become one the Five Dragons, the corporations that dominate lunar society. And I liked the idea of having Australians as the bad guys.\nThere’s a lush and large cast of characters in these books. How do you keep them all organized while writing? Do you have a giant corkboard with pins, index cards, and string?\nScapple—a white-board/mind-map app. Also, fantastic for family trees. Aeon Timeline—still getting to grips with this. Evernote—things get clipped in from online sources. Pinterest for Visual Research. (www.pinterest.com/ianneilmcdonald since you asked.) I don’t carry notebooks to jot things down—I practice a kind of Darwinism of ideas—if an idea is strong or fruitful enough, I’ll remember it. And I can’t actually read my handwriting now, anyway.\nI’ve read that the structure of the Luna novels was partially inspired by the Godfather films. Did any films inspire your cast of characters?\nVery much. In the relationship between Rafa and Lucas in New Moon it was very much that of the golden son and the smarter younger brother who knows he can run the show better. Sonny and Michael Corleone, or, if you like, Thor and Loki. But I don’t have a Godfather, I have a Godmother—Adriana Corta. Of course, by the end of New Moon, everything is changed. Changed utterly. Changed terribly. Wolf Moon picks up the pieces. This is the one about sheer survival.\nSome of your other novels feature developing economies. What is it about developing societies and economies that interest you?\nThere’s a raw energy and passion to them that makes them great for story. All the human vices are there—greed, envy, ambition, lust. And the human virtues too. It’s about what races ahead and what—and who—gets left behind. Emergent economies undergo incredible changes in short spaces of time—and that’s gold for the writer. Where you have change, you have its opposite, and you have drama. This developing economy just happens to be on the moon. But it’s the same passions, ambitions, loves, and hatreds that ignite the story.\nWhat kind of research went into the hard science aspects of a society living on the moon and how did it shape the worldbuilding?\nI started the project back in 2012 and since then, the literature on lunar colonization (and there’s a lot, especially online) and the science of the moon has evolved. My problem is, I’m stuck with the 2012 version. So be it. Some pieces of research were huge drivers to the plot—the slow loss of bone density and muscle condition in lunar gravity, meaning that there is a two-year time limit on returning to Earth, after which it will kill you. That’s such a rich source of story. Likewise, the fact that human skin is pretty gas tight, and you don’t explode in vacuum was the source of the Moonrun scene at the start of New Moon, and some simple sums about terminal velocity under lunar gravity inspired Robson’s free-running accident in Wolf Moon. I’m interested in how constraints drive human behavior and how that behavior turns into culture and, ultimately, a civilization.\nThroughout the Luna novels it’s well established that there are a number of ways to die on the moon. What do you think is the worst way to kick the bucket up on the lunar surface?\nAnything slow. Anything that involves breathing, and realizing that that breath you took—that’s your last breath. Anything that allows you to know with a sure certainty that you are going to die.\nSexuality is fluid on the moon. Like the people living there, it’s diverse. Is this a product of the future, because of the way a society might develop on the moon, or a combination of the two?\nIt’s a by-product of the legal system, in some ways. The moon has no criminal or civil law, only contract law. Everything is negotiated, everything is a personal contract. That includes marriage, and sex. We see sexuality in terms of identity groups; no one on the moon would understand that. It’s about who you love—who you want to have sex with (or not have sex with)—not what. Everything is personal. In some ways, it’s a hugely atomized society, in another, it’s a society that has consent—contractually agreed and guaranteed—built right through it.\nThere are four resources that govern survival on the moon: air, water, carbon, and data. They’re necessities of life, but they’ve also been privatized and can be used to intimidate and control people. Do you think that this is something that could or is happening now on Earth?\nI was interested in building a society where no one actually owns anything—everything is rented, in a sense, or licensed. Even the air in your lungs. It’s the ultimate rentier society, and I certainly see our own economic models moving towards rent-seeking rather than innovation and competitive capitalism. Subscription and streaming services—even soft apps are now a monthly subscription rather than buying outright and updating once a year. Certainly, in the UK, insane housing speculation has pushed an entire generation into renting their homes. Rentierism is lazy, controlling and stifling of true innovation, and it looks like it’s only going to get bigger,\nLuna: New Moon was optioned by CBS to be made into a TV show. Is this still in the works? Are there any details that you can share?\nThings in television either happen very quickly, or very slowly. This is the second kind of happen. But things are moving.\nThe Luna books were originally conceived as a duology. What happened that made you want to expand it into a trilogy?\nThe story was too big. To wrap it all up in two books would have made Wolf Moon about eight hundred pages long. Simpler to cut it in two—make it Wolf Moon and Rising Moon. The break between the two feels natural and a suitable conclusion to Wolf Moon: it’s not like a narrative guillotine falls on page four hundred and that’s it. Trilogising also means that readers wouldn’t have to wait an unconscionable amount of time for the story to finish.\nCan you give us a little teaser of what may be coming up in the third book?\nThe structure is inspired by Gladiator. Like the movie, it starts with a battle, ends hand-to-hand, face-to-face, up close and personal. If you’ve read Wolfie you’ll know what that conflict has to be.\nIf you had a 3D printer that could print out any clothes on demand, what decade’s fashion would you choose to fill your closet?\nFor men, the 1920s, if we’re going 20th century. Any era, Europe circa 1798. Impossible for a guy to look bad in that stuff.\nBesides the final book, what other projects do you have in the works?\nAlways thinking a few more books ahead.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/mcdonald_interview_2017/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Howling at the Lunar Landscape: A Conversation with Ian McDonald by Chris Urie"}