{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kij Johnson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "KXiC32+f15f5xIFPgillNU64+mU=", "id": null, "license": null, "comments": "", "raw_text": "4100 words, short story  The Apartment Dweller's Bestiary  The Aincolo  You’re showing your boyfriend what to put in a smoothie and you open a cupboard because he told you that he had toasted coconut somewhere and you figure sure, coconut, why not; and that’s where his aincolo is: squatting in the yellow serving bowl his mom gave him last year for Christmas. That’s cool. You have lots of friends with aincolos. They get in everywhere. But he was so weird about it, picked up the bowl with the aincolo hunched down now, nothing visible but two eyes in a cloud of cream-colored fur, and took it out to the living room and hid it somewhere. Why? Why.  But this got you wondering what else there was, what porn on his hard drive, what numbers in his contacts lists, what texts, what friends, what memories; and you realized you really don’t know anything about him and, more, that you don’t really want to. You have your own secrets, one of them that you aren’t over your last boyfriend yet, and that his is still the only name in your favorites list.  The Alafossi  The bathroom in your new apartment is problematic. Right after you moved, you noticed the fan made weird noises after you turned the shower off—rustling and little rippling squeaks, almost as though there were a bird up there. After a few days, you realized there really was a bird up there, or maybe a couple. And after a couple of weeks spent contemplating the matter while hot water poured on your head during your hangover showers, you decided that they were probably alafossi. You’ve seen them in the neighborhood, pulling on bits of trash they find or just hanging out in the trees out front.  You told your landlord, not caring except you thought one might fall into the bathroom fan. He told you that there’s a screen over the fan so you just dropped it. Anyway, it was winter and you were worried they might not find another place, and the noises were nice, like having a pretty upstairs neighbor and you pretending that she’s maybe putting on her makeup at the exact time you’re shaving, or maybe even sharing your bathroom and leaning in to your mirror with that look they get while they’re doing their eyes.  So everyone’s getting along fine, and now it’s spring; and all of a sudden there are new noises, and you’re like: babies. And it kind of pisses you off, because there’s a thing you can’t ever tell your friends because they would give you endless shit: you want all that. You’re kind of tired of drinking at The Harbor on weeknights. You want a girlfriend who turns into a wife, and then babies and even the hard job and the rest of it. You’ve only told one person, your dad, and he said, Don’t rush it; but you’re ready, you are fucking ready. Anyway, in the meantime, you stop smoking in the bathroom, because it’s bad for real babies so probably alafossi babies, too.  The Begitte  Your grandmother told you, “It’s good luck to have a begitte in the house,” and they are generally pretty great to have. It’s written into your lease, like renter’s insurance and no waterbeds, that a begitte is okay. Your begitte, which you got from a buddy when he moved in with his girlfriend, is a spotted one with crazy long white whiskers. It sleeps on the couch most of the time, looking like a novelty throw pillow. It grooms itself and it does not shed.  Your begitte eats the things that you do not want: dry pens, wire hangers, empty Kleenex boxes, old running shoes, Coke bottles, toothpaste tubes, the dead AA batteries at the back of the junk drawer, the needle you lost in the carpet, your neckties from when you had the shitty job at Clement & Neleman, the JPEGs from other peoples’ weddings, the breakup playlists a girlfriend sent you, some porn that got downloaded back in December.  It also ate that one picture of your old girlfriend from, what is it, ten years ago now? The one at the beach where it was pouring rain and she was freezing her ass off but then she got hit by that huge wave and even though she was soaked to the skin she started laughing and couldn’t stop, and that was pretty much the moment you fell in love with her. The begitte was right about that one, too.  The Bergdis  There’s a black-and-white picture of your mom with a bergdis, back when she was a librarian in St. Paul, before she met your dad and they moved to Iowa. It’s hard to tell what color it is, but you can tell from the photo that it’s a beautiful one, its long tail wrapped down her arm and around her wrist for balance, and its diamond-shaped face half-buried in her dark hair. She’s looking at whoever is taking the picture and laughing, so hard.  Bergdises live anything from thirty to fifty years, but you don’t remember seeing it or her talking about it. You don’t know who is taking the picture. You don’t remember ever seeing your mom laughing like that. There’s actually a lot you don’t know about the people who own bergdises.  The Crestone  One of your friends got a crestone a few months back. It’s cute, a small reddish male with a black tail that she braids with a little yellow ribbon on the end. It licks crumbs off the kitchen floor. It kills spiders. It helps with zippers up the backs of dresses. If she is hanging a picture, it stands on the couch and lets her know by tipping its head how to straighten it. When she choked on a piece of takeout tikka masala last week, it dialed 911, though she managed to clear her throat before the EMT people showed up.  “You could call me,” you say. “For stuff like that. You didn’t need to get a crestone.”  “Not the nine-one-one call,” she says. “And I can’t keep getting you to come over and kill spiders. Look, it’s always there when I get home. What’s wrong with wanting that?”  You understand, and you’re tempted. A crestone would have your back, too. But maybe you would get a terrible crestone. Maybe it wouldn’t tell you when your hem was down or remember your birthday. Plus, your boyfriend left; why wouldn’t your crestone?  The Deliper  You still remember that last night. You were both crying, so why was this even happening? If neither of you wanted it, then why could neither of you seem to stop it? And if one of you did, then why wasn’t it already over? And then it was, and you drove to a hotel and that was that. But you hated it, even after you got this apartment, even after you got the new furniture, the unsprung mattress, the silverware with the fake patina. You smacked the console table against the wall a little, just so that it had some dents. You hung some family pictures.  Getting the deliper was supposed to help, but it hasn’t worked that way. Now there are two of you alone together, and the deliper hates this life just as much as you do.  The Hapsod  You find the hapsod behind the bed when you move it to vacuum, a task you generally avoid; only, last night your girlfriend brought a little jar of powdered honey over, promising to brush it onto you with a feathery cat toy shaped like a bird (which she also brought) and then to lick it off: something she had found online, or maybe one of her girlfriends had. You have to admit that it felt pretty good until she inhaled some, went off in a coughing fit, and dropped the jar. The powder went everywhere. And so, not generally the sort of guy who vacuums but aware of the possibility of ants, you get out the Hoover, pull the bed away from the wall, and find the hapsod.  It is quite small for a hapsod—which you have seen in an occasional YouTube video, plus some of your friends have admitted to encountering one: clearly an adolescent, crouched over the pale scattering of powder on the carpet next to a golf ball that has rolled under the bed even though you don’t play golf and don’t know anyone who does.  You are pretty sure your girlfriend would swoon over the blunt little antlers, the rabbit-soft gray fur, the immense eyes. Your phone is in your pocket. You could call her. She would be here in no time. She would rush in and coo over your hapsod. She would puzzle over what to feed it, and the words we and us would turn up a lot in that conversation. She might stay for the night; but really, who needs that? You and your hapsod are fine together. It’s probably easier just to break up now and get it over with.  The Hericy  You pretty much stopped using your kitchen once you started that huge project at work, but now you’re going to a dinner party hosted by your ex-boyfriend and his new girlfriend. You don’t want to look like you’re not over him, which you actually are even though you’re a little tired of people asking you about it. You figure that hand-baked cheese crackers should fulfill your host-gift responsibilities nicely.  The oven is set to warm, though you’re pretty sure the last time you used it was the last time you made cheese crackers. You pull open the door and peer in. Six sets of shiny black eyes peer out. It’s your hericy, which vanished three months ago and you never could find, and you must have cried for weeks about it—only now there’s another hericy too, a largeish good-looking gray one, also some babies rolling around in a pile of shredded parchment paper on one of the racks. They’ve got a crumpled aluminum-foil dish of dried apricots and a small cast-iron skillet you’re pretty sure is not yours, filled with water. Really, you had no idea hericies were so resourceful.  You pick one of the cuter ones and tuck it into the red Chinese take-out box you were going to use for the crackers. You know what’s going to happen now. The new girlfriend is going to squeal and cuddle it, hold it up to your ex-boyfriend for him to cuddle it, too. The ex-boyfriend is going to look a little nervous, as though the hericy-bearing ex-girlfriend might make a scene. You know this because it’s how you ended up with your hericy. Still, a hericy is pretty cool, so at least she’ll have that.  The Lopi  When you move into the apartment on Vermont Street, the lopi are already there, two or three of them fluttering in the corners of each room, just where the walls and ceilings meet. What exactly do they look like? Like bats, like insects, like tiny silent birds the color of smoke? They never seem to rest. And what do they eat? Do they chew on your soap, lick the shampoo residue from the bottles in the bathroom? Or late at night, when you are trying but unable to sleep, do they swoop down to eat whatever has fallen into the aluminum liners under the stove’s burners? Wikipedia is of limited assistance here.  Before you moved in, your landlord promised to replace the old windows and repaint the dirty walls, and also to take care of the lopi problem. The windows are done, the walls now a tasteful eggshell color, but the lopi remain, and really, it’s not worth calling the landlord about them. They’re not that bad. They replace the pictures you don’t hang. The whirring of their wings is a white noise that conceals the silence.  And there are nights when you are alone in the full-sized bed in the single bedroom in the new apartment, everything so much smaller than your old life, and just as you fall asleep, you feel their feet on your face, delicate as antennae or memories.  The Louet  No one wants a louet, and yet, here you are with one. It has no great love of incense. It eats cantaloupe and the germ of corn, which it painstakingly chews from the kernels with its tiny scooplike teeth. It likes being read to, especially Henry James’s lesser works. It frowns intelligently at certain places in his travel writing, but you are pretty sure it is faking it; your own appreciation of Henry James is shaky; how can something the size of a kitten be more esthetically enlightened than you?  And yet, it is the louet that suggested you not get the retro haircut; the louet that suggested you stay away from Cheever’s later work; and your most recent boyfriend. The louet is always right, and you are always wrong, and it is the despair of the louet that you never seem to figure this out before it’s too late.  The Mume  The great thing about your mume is how it never makes you feel bad about anything. It loves the food you eat, the movies you watch, the clothes you wear. Feathers ruffled in excitement, it sits on your shoulder when you play computer games. It never gets bored. It never has needs. It sleeps on your pillow if you let it, but if you don’t, that’s okay too. You’re never wrong. You get the feeling that if the mume could speak, everything would end with an exclamation point. How many things in life make you feel as though you just won a trophy for general awesomeness?  It also doesn’t care in the least that you were kind of an asshole to your last girlfriend. She didn’t care at first either, but by the end she would call you on your shit, which you didn’t want to hear, which is maybe the reason why she is gone and you have a mume instead.  The Orco  Most nights, you fall asleep while reading, and your book and your glasses end up in bed beside you, along with your phone, just in case, and your orco. You were always someone who liked to sleep touching, so sometimes in the night you reach across and feel the wand of an earpiece, the book’s hard spine, the ruffle of the orco’s hair against your palm, its warm breath on your hand. As long as you don’t wake up all the way, it’s like all the pieces of someone.  The Hooded Quilliot  You bring your new hooded quilliot home in a cardboard carrier and let it out in the living room. At first you see only the top of its head and then its eyes glaring up, and then the quilliot leaps out of the carrier and onto your coffee table.  Your hooded quilliot has lived better places than this, with nicer people who made more money and they all adored, adored it. It had its own room. It ate oysters flown in from the coast and bruschetta. A professional groomer came every two weeks to trim its nails. This—the cute teak coffee table you got for fifteen bucks at an amazing garage sale last year, and the rest of it, too: your friends bringing home-made salsa and crab dip for card parties that last ’til four, and the shoes piled by the back door because everyone here goes barefoot—this is not what your quilliot is used to and, to be frank, it is all very, very disappointing.  But then, you’re not the one that was in a little steel cage back at the shelter, with a yellow sheet of paper clipped to the bars that said “Abandoned.”  The Ravock  There’s all sorts of information about it online, post-mortum predation. First they eat your lips, your ears, the end of your nose. Your eyelids. The flare of your nostrils. Fingertips. All the places a girlfriend would kiss you first.  Their weak paws and small teeth cannot make a way into your body until you are already dissolving. When is that, like a week after death? Would someone find you before then, and why? Would your absence be noted? When your friend Jason got dumped by his boyfriend, it was almost a week before you realized you hadn’t seen any texts from him lately. You assumed he was talking to other people, and anyway, you’re always getting busy or distracted, and so is everyone else.  You imagine it: a stroke, maybe, since you’re not the overdose type; you, slumped over your dead laptop. Would there be shit? You look down at your ravock, curled into a tight ball on the rug by your feet where it’s sleeping off dinner. It’s making that little dreaming growling noise it does sometimes. How long would it wait?  The Grey Regia  Your regia hated your old boyfriend, the one who came over after you had your surgery to read children’s books to you when you couldn’t sleep. He used funny voices for the different animals and you would start laughing and then it would start hurting and you would tell him to stop. And he would stop, that was the amazing part. Most guys would have kept on reading, just for a moment or two, teasing maybe or just that little streak of meanness that all men have. He was even really nice to your regia, though it was pretty obvious what it thought of him.  But it didn’t work out. You talked about moving in together but then there was an amicable sort of breakup, neither of you quite sure what was happening but both pretty sure it was the right thing. Maybe one of you just lost interest? Anyway, you have the new boyfriend. He would have kept reading, but your regia likes him better and maybe your regia knows what you deserve.  The Sandnes Garn  You knew you had a Sandnes garn at your old place, but it didn’t bug you or anything. It’s a pest, sure, but you learned to make some noise as you walked into your bedroom to give it time to hide. Under the bed? In the closet? The occasional glimpses were kind of cute, little furry horns and beady eyes peeping from behind the dresser you got from IKEA.  When you decided to move in with your girlfriend, your friends offered to help with the lifting. “Does your apartment still have that Sandnes garn?” one said. You nodded. “You need to set some traps or fumigate or something, ’cause otherwise you’ll spread them to her place and she’ll be pretty pissed. I’ll take that dresser if you’re not going to want it,” he added.  He did take the dresser but you didn’t fumigate, and when you got settled in you realize he was right. You see it sometimes, when she’s fallen asleep, half spooned against you, her hair a grapefruit-scented tickle in your face. The Sandnes garn sits on the chest of drawers that came from her mother’s house, next to the picture of all her brothers. Its eyes gleam in the hall light. Your Sandnes garn is patient. It can wait. You’ll fuck this one up, too.  The Skacel  There are close to a hundred species of skacel. While some can be easily distinguished by the casual observer, others may only be differentiated behaviorally or through DNA analysis. People, it seems, make a hobby of identifying their skacels, and a surprising number get the test, which costs between sixty-nine and just under two hundred dollars.  You’re not willing to go that far, but you have spent some Friday nights clicking through the internet looking for your skacel, which is small, short-beaked, and rose-colored. The Short-beaked Skacel is a sandy-olive color with a burgundy head and green eye markings. The Roseate Skacel has a narrow beak with a slightly hooked tip. The Lesser Skacel eats roaches, spiders, and other vermin but is neither roseate nor short-beaked; plus, your skacel tends not to eat them so much as kill them and leave them in the bathtub.  The Eastern Skacel drinks cold coffee from a saucer on the floor, which your skacel does not. The Kansas Skacel can eat and digest styrofoam take-out containers. The Blue-faced Skacel nests most often in linen closets, especially among the guest towels. Given short walks outside and plenty of toys, the Norway Skacel can live happily in even the smallest apartment. The King Skacel can be trained to retrieve items but resents neglect. Burney’s Skacel would prefer it if you stopped bringing girls over. So would the Noro (a variety of skacel), plus it has some feelings about post-modernism.  Your old girlfriend probably wishes you had spent this sort of time on her. She has a skacel too, with an unmemorable beak but vivid yellow markings along the wingtips. You haven’t been able to find that one, either.  The Smerle  You could take your smerle outside and people were always very impressed—an actual smerle, with the long feet and the outrageous tail and everything. Where did you get it? Was it imported? If you didn’t mind telling, how much did it cost? It was like baking your own bagels or driving a 1960s car: a lot of work, but generally worth it.  But then things changed. It started to droop and its colors faded. “Get another smerle,” one of your friends advised. “Smerles love company.”  “I’m company,” you said, but you got another one anyway, this one chestnut colored. Your smerle perked up and now you had two to walk on matching leashes: two smerles that played together, twined about one another; a pair that pretty much ignored you.  The Tatamy  “One tatamy grows lonely,” your grandmother always says, like, “Troubles come in threes,” and you figure that’s about right. You started with the one. You were getting dressed for work one morning and there it was, curled tight into a gladiator sandal you’d almost forgotten you had. A week later, there was one in the other sandal, and then a few days later, two more peeked from your Uggs from college, and then there were what seemed like dozens, tucked into all the pairs of out-of-date shoes and boots you’d meant to take to Goodwill. They leave your sensible shoes, the work pumps and trainers, alone. You’re not sure whether this is a judgment.  You have no idea what they eat, and you’re not sure what they do with themselves when they are not tucked into your shoes like hermit crabs. All night you hear them rustling in your closet, often making small rhythmic bumps, as if they’re mating or dancing to house. You don’t mind that you are the only one in the apartment who is going to bed early or sleeping alone. But there are times when you imagine turning on the light, stepping into your old shoes, and dancing.  The Wolle  It’s hard to pull the trigger on an apartment. The one-bedroom on Massachusetts Street has a southern exposure and tall windows that look down onto cute shops and busy sidewalks, though you wonder whether that would get on your nerves. It’s small. If someone came, they wouldn’t have anywhere to stay. There’s no pet deposit if you get a begitte. Maybe later; right now you can’t see making a commitment like that.  On the other hand, the two-bedroom out on California is cool and shady. It’s a beautiful neighborhood, right next to a park with a really good disc-golf course. There is nothing on the hardwood floors and no curtains in the windows, so the rooms echo. Guests could stay in the second bedroom, if you bought a bed—but the rest of the time? You think you’ll have a hard time filling that space. There are probably lopi.  Or you could just keep sleeping on the couch in Cortney’s living room in her place on Vermont Street, and then you don’t have to choose anything at all. It’s a comfortable couch. She says she doesn’t mind, says you’re a great houseguest, says you’re not a pain in the ass the way some people are. You take out the trash. If you borrow her car, you fill the tank. The two of you order takeout and watch television shows a season at a time. Her wolle curls up between you, dozing.  It occurs to you that in another life, you might very well be the begitte, the lopi, the quilliot.  Kij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "text": "4100 words, short story\nThe Apartment Dweller's Bestiary\nThe Aincolo\nYou’re showing your boyfriend what to put in a smoothie and you open a cupboard because he told you that he had toasted coconut somewhere and you figure sure, coconut, why not; and that’s where his aincolo is: squatting in the yellow serving bowl his mom gave him last year for Christmas. That’s cool. You have lots of friends with aincolos. They get in everywhere. But he was so weird about it, picked up the bowl with the aincolo hunched down now, nothing visible but two eyes in a cloud of cream-colored fur, and took it out to the living room and hid it somewhere. Why? Why.\nBut this got you wondering what else there was, what porn on his hard drive, what numbers in his contacts lists, what texts, what friends, what memories; and you realized you really don’t know anything about him and, more, that you don’t really want to. You have your own secrets, one of them that you aren’t over your last boyfriend yet, and that his is still the only name in your favorites list.\nThe Alafossi\nThe bathroom in your new apartment is problematic. Right after you moved, you noticed the fan made weird noises after you turned the shower off—rustling and little rippling squeaks, almost as though there were a bird up there. After a few days, you realized there really was a bird up there, or maybe a couple. And after a couple of weeks spent contemplating the matter while hot water poured on your head during your hangover showers, you decided that they were probably alafossi. You’ve seen them in the neighborhood, pulling on bits of trash they find or just hanging out in the trees out front.\nYou told your landlord, not caring except you thought one might fall into the bathroom fan. He told you that there’s a screen over the fan so you just dropped it. Anyway, it was winter and you were worried they might not find another place, and the noises were nice, like having a pretty upstairs neighbor and you pretending that she’s maybe putting on her makeup at the exact time you’re shaving, or maybe even sharing your bathroom and leaning in to your mirror with that look they get while they’re doing their eyes.\nSo everyone’s getting along fine, and now it’s spring; and all of a sudden there are new noises, and you’re like: babies. And it kind of pisses you off, because there’s a thing you can’t ever tell your friends because they would give you endless shit: you want all that. You’re kind of tired of drinking at The Harbor on weeknights. You want a girlfriend who turns into a wife, and then babies and even the hard job and the rest of it. You’ve only told one person, your dad, and he said, Don’t rush it; but you’re ready, you are fucking ready. Anyway, in the meantime, you stop smoking in the bathroom, because it’s bad for real babies so probably alafossi babies, too.\nThe Begitte\nYour grandmother told you, “It’s good luck to have a begitte in the house,” and they are generally pretty great to have. It’s written into your lease, like renter’s insurance and no waterbeds, that a begitte is okay. Your begitte, which you got from a buddy when he moved in with his girlfriend, is a spotted one with crazy long white whiskers. It sleeps on the couch most of the time, looking like a novelty throw pillow. It grooms itself and it does not shed.\nYour begitte eats the things that you do not want: dry pens, wire hangers, empty Kleenex boxes, old running shoes, Coke bottles, toothpaste tubes, the dead AA batteries at the back of the junk drawer, the needle you lost in the carpet, your neckties from when you had the shitty job at Clement & Neleman, the JPEGs from other peoples’ weddings, the breakup playlists a girlfriend sent you, some porn that got downloaded back in December.\nIt also ate that one picture of your old girlfriend from, what is it, ten years ago now? The one at the beach where it was pouring rain and she was freezing her ass off but then she got hit by that huge wave and even though she was soaked to the skin she started laughing and couldn’t stop, and that was pretty much the moment you fell in love with her. The begitte was right about that one, too.\nThe Bergdis\nThere’s a black-and-white picture of your mom with a bergdis, back when she was a librarian in St. Paul, before she met your dad and they moved to Iowa. It’s hard to tell what color it is, but you can tell from the photo that it’s a beautiful one, its long tail wrapped down her arm and around her wrist for balance, and its diamond-shaped face half-buried in her dark hair. She’s looking at whoever is taking the picture and laughing, so hard.\nBergdises live anything from thirty to fifty years, but you don’t remember seeing it or her talking about it. You don’t know who is taking the picture. You don’t remember ever seeing your mom laughing like that. There’s actually a lot you don’t know about the people who own bergdises.\nThe Crestone\nOne of your friends got a crestone a few months back. It’s cute, a small reddish male with a black tail that she braids with a little yellow ribbon on the end. It licks crumbs off the kitchen floor. It kills spiders. It helps with zippers up the backs of dresses. If she is hanging a picture, it stands on the couch and lets her know by tipping its head how to straighten it. When she choked on a piece of takeout tikka masala last week, it dialed 911, though she managed to clear her throat before the EMT people showed up.\n“You could call me,” you say. “For stuff like that. You didn’t need to get a crestone.”\n“Not the nine-one-one call,” she says. “And I can’t keep getting you to come over and kill spiders. Look, it’s always there when I get home. What’s wrong with wanting that?”\nYou understand, and you’re tempted. A crestone would have your back, too. But maybe you would get a terrible crestone. Maybe it wouldn’t tell you when your hem was down or remember your birthday. Plus, your boyfriend left; why wouldn’t your crestone?\nThe Deliper\nYou still remember that last night. You were both crying, so why was this even happening? If neither of you wanted it, then why could neither of you seem to stop it? And if one of you did, then why wasn’t it already over? And then it was, and you drove to a hotel and that was that. But you hated it, even after you got this apartment, even after you got the new furniture, the unsprung mattress, the silverware with the fake patina. You smacked the console table against the wall a little, just so that it had some dents. You hung some family pictures.\nGetting the deliper was supposed to help, but it hasn’t worked that way. Now there are two of you alone together, and the deliper hates this life just as much as you do.\nThe Hapsod\nYou find the hapsod behind the bed when you move it to vacuum, a task you generally avoid; only, last night your girlfriend brought a little jar of powdered honey over, promising to brush it onto you with a feathery cat toy shaped like a bird (which she also brought) and then to lick it off: something she had found online, or maybe one of her girlfriends had. You have to admit that it felt pretty good until she inhaled some, went off in a coughing fit, and dropped the jar. The powder went everywhere. And so, not generally the sort of guy who vacuums but aware of the possibility of ants, you get out the Hoover, pull the bed away from the wall, and find the hapsod.\nIt is quite small for a hapsod—which you have seen in an occasional YouTube video, plus some of your friends have admitted to encountering one: clearly an adolescent, crouched over the pale scattering of powder on the carpet next to a golf ball that has rolled under the bed even though you don’t play golf and don’t know anyone who does.\nYou are pretty sure your girlfriend would swoon over the blunt little antlers, the rabbit-soft gray fur, the immense eyes. Your phone is in your pocket. You could call her. She would be here in no time. She would rush in and coo over your hapsod. She would puzzle over what to feed it, and the words we and us would turn up a lot in that conversation. She might stay for the night; but really, who needs that? You and your hapsod are fine together. It’s probably easier just to break up now and get it over with.\nThe Hericy\nYou pretty much stopped using your kitchen once you started that huge project at work, but now you’re going to a dinner party hosted by your ex-boyfriend and his new girlfriend. You don’t want to look like you’re not over him, which you actually are even though you’re a little tired of people asking you about it. You figure that hand-baked cheese crackers should fulfill your host-gift responsibilities nicely.\nThe oven is set to warm, though you’re pretty sure the last time you used it was the last time you made cheese crackers. You pull open the door and peer in. Six sets of shiny black eyes peer out. It’s your hericy, which vanished three months ago and you never could find, and you must have cried for weeks about it—only now there’s another hericy too, a largeish good-looking gray one, also some babies rolling around in a pile of shredded parchment paper on one of the racks. They’ve got a crumpled aluminum-foil dish of dried apricots and a small cast-iron skillet you’re pretty sure is not yours, filled with water. Really, you had no idea hericies were so resourceful.\nYou pick one of the cuter ones and tuck it into the red Chinese take-out box you were going to use for the crackers. You know what’s going to happen now. The new girlfriend is going to squeal and cuddle it, hold it up to your ex-boyfriend for him to cuddle it, too. The ex-boyfriend is going to look a little nervous, as though the hericy-bearing ex-girlfriend might make a scene. You know this because it’s how you ended up with your hericy. Still, a hericy is pretty cool, so at least she’ll have that.\nThe Lopi\nWhen you move into the apartment on Vermont Street, the lopi are already there, two or three of them fluttering in the corners of each room, just where the walls and ceilings meet. What exactly do they look like? Like bats, like insects, like tiny silent birds the color of smoke? They never seem to rest. And what do they eat? Do they chew on your soap, lick the shampoo residue from the bottles in the bathroom? Or late at night, when you are trying but unable to sleep, do they swoop down to eat whatever has fallen into the aluminum liners under the stove’s burners? Wikipedia is of limited assistance here.\nBefore you moved in, your landlord promised to replace the old windows and repaint the dirty walls, and also to take care of the lopi problem. The windows are done, the walls now a tasteful eggshell color, but the lopi remain, and really, it’s not worth calling the landlord about them. They’re not that bad. They replace the pictures you don’t hang. The whirring of their wings is a white noise that conceals the silence.\nAnd there are nights when you are alone in the full-sized bed in the single bedroom in the new apartment, everything so much smaller than your old life, and just as you fall asleep, you feel their feet on your face, delicate as antennae or memories.\nThe Louet\nNo one wants a louet, and yet, here you are with one. It has no great love of incense. It eats cantaloupe and the germ of corn, which it painstakingly chews from the kernels with its tiny scooplike teeth. It likes being read to, especially Henry James’s lesser works. It frowns intelligently at certain places in his travel writing, but you are pretty sure it is faking it; your own appreciation of Henry James is shaky; how can something the size of a kitten be more esthetically enlightened than you?\nAnd yet, it is the louet that suggested you not get the retro haircut; the louet that suggested you stay away from Cheever’s later work; and your most recent boyfriend. The louet is always right, and you are always wrong, and it is the despair of the louet that you never seem to figure this out before it’s too late.\nThe Mume\nThe great thing about your mume is how it never makes you feel bad about anything. It loves the food you eat, the movies you watch, the clothes you wear. Feathers ruffled in excitement, it sits on your shoulder when you play computer games. It never gets bored. It never has needs. It sleeps on your pillow if you let it, but if you don’t, that’s okay too. You’re never wrong. You get the feeling that if the mume could speak, everything would end with an exclamation point. How many things in life make you feel as though you just won a trophy for general awesomeness?\nIt also doesn’t care in the least that you were kind of an asshole to your last girlfriend. She didn’t care at first either, but by the end she would call you on your shit, which you didn’t want to hear, which is maybe the reason why she is gone and you have a mume instead.\nThe Orco\nMost nights, you fall asleep while reading, and your book and your glasses end up in bed beside you, along with your phone, just in case, and your orco. You were always someone who liked to sleep touching, so sometimes in the night you reach across and feel the wand of an earpiece, the book’s hard spine, the ruffle of the orco’s hair against your palm, its warm breath on your hand. As long as you don’t wake up all the way, it’s like all the pieces of someone.\nThe Hooded Quilliot\nYou bring your new hooded quilliot home in a cardboard carrier and let it out in the living room. At first you see only the top of its head and then its eyes glaring up, and then the quilliot leaps out of the carrier and onto your coffee table.\nYour hooded quilliot has lived better places than this, with nicer people who made more money and they all adored, adored it. It had its own room. It ate oysters flown in from the coast and bruschetta. A professional groomer came every two weeks to trim its nails. This—the cute teak coffee table you got for fifteen bucks at an amazing garage sale last year, and the rest of it, too: your friends bringing home-made salsa and crab dip for card parties that last ’til four, and the shoes piled by the back door because everyone here goes barefoot—this is not what your quilliot is used to and, to be frank, it is all very, very disappointing.\nBut then, you’re not the one that was in a little steel cage back at the shelter, with a yellow sheet of paper clipped to the bars that said “Abandoned.”\nThe Ravock\nThere’s all sorts of information about it online, post-mortum predation. First they eat your lips, your ears, the end of your nose. Your eyelids. The flare of your nostrils. Fingertips. All the places a girlfriend would kiss you first.\nTheir weak paws and small teeth cannot make a way into your body until you are already dissolving. When is that, like a week after death? Would someone find you before then, and why? Would your absence be noted? When your friend Jason got dumped by his boyfriend, it was almost a week before you realized you hadn’t seen any texts from him lately. You assumed he was talking to other people, and anyway, you’re always getting busy or distracted, and so is everyone else.\nYou imagine it: a stroke, maybe, since you’re not the overdose type; you, slumped over your dead laptop. Would there be shit? You look down at your ravock, curled into a tight ball on the rug by your feet where it’s sleeping off dinner. It’s making that little dreaming growling noise it does sometimes. How long would it wait?\nThe Grey Regia\nYour regia hated your old boyfriend, the one who came over after you had your surgery to read children’s books to you when you couldn’t sleep. He used funny voices for the different animals and you would start laughing and then it would start hurting and you would tell him to stop. And he would stop, that was the amazing part. Most guys would have kept on reading, just for a moment or two, teasing maybe or just that little streak of meanness that all men have. He was even really nice to your regia, though it was pretty obvious what it thought of him.\nBut it didn’t work out. You talked about moving in together but then there was an amicable sort of breakup, neither of you quite sure what was happening but both pretty sure it was the right thing. Maybe one of you just lost interest? Anyway, you have the new boyfriend. He would have kept reading, but your regia likes him better and maybe your regia knows what you deserve.\nThe Sandnes Garn\nYou knew you had a Sandnes garn at your old place, but it didn’t bug you or anything. It’s a pest, sure, but you learned to make some noise as you walked into your bedroom to give it time to hide. Under the bed? In the closet? The occasional glimpses were kind of cute, little furry horns and beady eyes peeping from behind the dresser you got from IKEA.\nWhen you decided to move in with your girlfriend, your friends offered to help with the lifting. “Does your apartment still have that Sandnes garn?” one said. You nodded. “You need to set some traps or fumigate or something, ’cause otherwise you’ll spread them to her place and she’ll be pretty pissed. I’ll take that dresser if you’re not going to want it,” he added.\nHe did take the dresser but you didn’t fumigate, and when you got settled in you realize he was right. You see it sometimes, when she’s fallen asleep, half spooned against you, her hair a grapefruit-scented tickle in your face. The Sandnes garn sits on the chest of drawers that came from her mother’s house, next to the picture of all her brothers. Its eyes gleam in the hall light. Your Sandnes garn is patient. It can wait. You’ll fuck this one up, too.\nThe Skacel\nThere are close to a hundred species of skacel. While some can be easily distinguished by the casual observer, others may only be differentiated behaviorally or through DNA analysis. People, it seems, make a hobby of identifying their skacels, and a surprising number get the test, which costs between sixty-nine and just under two hundred dollars.\nYou’re not willing to go that far, but you have spent some Friday nights clicking through the internet looking for your skacel, which is small, short-beaked, and rose-colored. The Short-beaked Skacel is a sandy-olive color with a burgundy head and green eye markings. The Roseate Skacel has a narrow beak with a slightly hooked tip. The Lesser Skacel eats roaches, spiders, and other vermin but is neither roseate nor short-beaked; plus, your skacel tends not to eat them so much as kill them and leave them in the bathtub.\nThe Eastern Skacel drinks cold coffee from a saucer on the floor, which your skacel does not. The Kansas Skacel can eat and digest styrofoam take-out containers. The Blue-faced Skacel nests most often in linen closets, especially among the guest towels. Given short walks outside and plenty of toys, the Norway Skacel can live happily in even the smallest apartment. The King Skacel can be trained to retrieve items but resents neglect. Burney’s Skacel would prefer it if you stopped bringing girls over. So would the Noro (a variety of skacel), plus it has some feelings about post-modernism.\nYour old girlfriend probably wishes you had spent this sort of time on her. She has a skacel too, with an unmemorable beak but vivid yellow markings along the wingtips. You haven’t been able to find that one, either.\nThe Smerle\nYou could take your smerle outside and people were always very impressed—an actual smerle, with the long feet and the outrageous tail and everything. Where did you get it? Was it imported? If you didn’t mind telling, how much did it cost? It was like baking your own bagels or driving a 1960s car: a lot of work, but generally worth it.\nBut then things changed. It started to droop and its colors faded. “Get another smerle,” one of your friends advised. “Smerles love company.”\n“I’m company,” you said, but you got another one anyway, this one chestnut colored. Your smerle perked up and now you had two to walk on matching leashes: two smerles that played together, twined about one another; a pair that pretty much ignored you.\nThe Tatamy\n“One tatamy grows lonely,” your grandmother always says, like, “Troubles come in threes,” and you figure that’s about right. You started with the one. You were getting dressed for work one morning and there it was, curled tight into a gladiator sandal you’d almost forgotten you had. A week later, there was one in the other sandal, and then a few days later, two more peeked from your Uggs from college, and then there were what seemed like dozens, tucked into all the pairs of out-of-date shoes and boots you’d meant to take to Goodwill. They leave your sensible shoes, the work pumps and trainers, alone. You’re not sure whether this is a judgment.\nYou have no idea what they eat, and you’re not sure what they do with themselves when they are not tucked into your shoes like hermit crabs. All night you hear them rustling in your closet, often making small rhythmic bumps, as if they’re mating or dancing to house. You don’t mind that you are the only one in the apartment who is going to bed early or sleeping alone. But there are times when you imagine turning on the light, stepping into your old shoes, and dancing.\nThe Wolle\nIt’s hard to pull the trigger on an apartment. The one-bedroom on Massachusetts Street has a southern exposure and tall windows that look down onto cute shops and busy sidewalks, though you wonder whether that would get on your nerves. It’s small. If someone came, they wouldn’t have anywhere to stay. There’s no pet deposit if you get a begitte. Maybe later; right now you can’t see making a commitment like that.\nOn the other hand, the two-bedroom out on California is cool and shady. It’s a beautiful neighborhood, right next to a park with a really good disc-golf course. There is nothing on the hardwood floors and no curtains in the windows, so the rooms echo. Guests could stay in the second bedroom, if you bought a bed—but the rest of the time? You think you’ll have a hard time filling that space. There are probably lopi.\nOr you could just keep sleeping on the couch in Cortney’s living room in her place on Vermont Street, and then you don’t have to choose anything at all. It’s a comfortable couch. She says she doesn’t mind, says you’re a great houseguest, says you’re not a pain in the ass the way some people are. You take out the trash. If you borrow her car, you fill the tank. The two of you order takeout and watch television shows a season at a time. Her wolle curls up between you, dozing.\nIt occurs to you that in another life, you might very well be the begitte, the lopi, the quilliot.\nKij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "source": "https://clarkesworldmagazine.com/johnson_01_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Apartment Dweller's Bestiary by Kij Johnson"}