{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JudlxVFzLm/mfCXthlHGi07Rw5k=", "id": null, "license": null, "comments": "", "raw_text": "Interview  To Believe the Magic Is Real: A Conversation with Ed Greenwood  Ed Greenwood wanders the floor at GenCon 2008 with his arms full of Dungeons and Dragons miniatures. At one of the country’s largest gaming conventions, just about everybody recognizes him as the guy who created the fantasy world The Forgotten Realms.  The Canadian library clerk seems unimpressed with how many people stop to shake his hand or ask him to sign a novel or gaming supplement. He’s busy buying mini’s for his granddaughter, but not too busy to share a quick word or catch up with fellow gamers.  It’s been a few years since Greenwood has showed up at a convention dressed as the wizard, Elminster, who is the protagonist of his most famous series of novels, but he still sports the distinctive long white beard and pageboy haircut. More to the point, Greenwood is infamously friendly and he loves to talk about what he does: write fiction, non-fiction, and game supplements.  At a signing earlier in the convention, the line wrapped halfway around the hall. People lugged stacks of books from all over Greenwood’s canon—Spellfire, The Making of a Mage, Swords of Eveningstar, Silverfall, The Kingless Land, Dark Lord—and you’d think ever reader knew him personally. That’s how his books feel, personable, just like he is.  Over the years Greenwood has built many fictional worlds, including Falconfar, Niflheim, and The Forgotten Realms. He’s created them for short stories, role-playing games, novels, and for his own amusement.  “Some folks collect bowling trophies, some rebuild cars in their driveways, and some try not to miss a single televised moment of football,” he says in the introduction to Castlemourn: A Fantasy Campaign Setting. “I dream up fantasy worlds.”  “I started worldbuilding in my childhood,” he adds, “imagining what grew into The Forgotten Realms (now a shared world that continues to grow through the dreamings of literally millions of readers and gamers.) It was the first of over a dozen worlds I’ve played with since.”  Greenwood’s worlds are lively, richly detailed, and fun to visit. Whether as dark as Niflheim or as versatile as The Realms, a world designed by Ed Greenwood is alive and waiting for readers or gamers to delve in. And that’s what is most striking about Greenwood’s worlds: they are welcoming. They also tend to feel both fully realized and full of possibility.  After meeting Greenwood, it is easy to imagine him smiling and perhaps chuckling to himself as he pounds away at the keyboard. The conversation that follows is a portion of a longer correspondence that started before GenCon 2008 and stretch well into the fall.    Where do you start building a world?  As with everything, there’s a caveat: there is no “one and only one right way” [to build a world]. This is just what works for me.  I’ve been working on the [Forgotten] Realms for over 40 years now, and don’t expect to ever be finished. Over that time I’ve written or co-written almost 200 fiction and game books set in the Realms.  However, I have seen a tendency in other writers to “never get down to writing that novel” or at least to bog down and get overly delayed, when they try to develop their worlds down to the last scuttling insect and ripening fruit before starting to actually write (as opposed to plan) any fiction. So going the “detail everything” route is obviously a trap for some.  I think the best initial step for most writers would be to define what they want to use the world for, and for how long. So are you, the writer:   A. Designing the world to outlast you, and any uses you can immediately see, as I did for the Realms?  B. Or do you have a contract for a short story due in a month, for which your total payment is probably going to be a couple hundred bucks at most, for which you have to design an original fantasy setting?  C. Or is your need somewhere in between?  I suspect, for most people, “C” is going to be the appropriate answer, but let’s look quickly at “A” and at “B,” for the different most-appropriate approaches they point at.  For “A”, I look at my immediate needs, make them dictate the geographical spots I’m going to super-detail and then start “designing outwards from” until I cover the world, years hence. I start with the spots I need right now, note all the design decisions (trade currents, weather, dominant life forms, etc.) I make that have wider implications, and take each of those implications at least one step. “Well, I’ve said they have severe winters, so therefore . . . ” and I do this process to see if I’ve aimed myself at any problems or conflicts, so I can make changes now, before publication. This isn’t a one-time step, this is how I conduct the process from now on, month after month and year after year.  A bit daunting, yes?  “B” is the other end. Although it might be fun to detail a complete fantasy world for such a limited use, it isn’t a wise use of creative time. So in “B”, I plot the story first, and then shape the world to fit the story needs. If it’s a story about a romance between dragons, okay, I need a setting in which dragons live. Do I need that setting to provide conflict or hardships or problems-to-be-solved for my dragon characters? If yes, build ‘em in, and develop the world from there.  I have talked with writers who just shrug, write the story using placeholders (“He could tell from her purplish snout that she was from XXX. Well enough. He can stomach wyrms from XXX. So they flew on together, over YYY, where the ZZZs were always succulent, and there was no danger of AAAs bursting up out of the trees, shrieking, to attack.”) and then fill everything in when the tale is told the way they want it to. In other words, the world is built to fit the story, and developed only as far as the story needs dictate.  If this “B” approach is done by someone thinking, “I might just have to come back to this setting in a future story,” they either start applying the “consequences” approach of “A,” or they take refuge in saying as little as possible. (If I have a character say there are only two continents, I’ve shattered my development chances or thrown myself into having to make an awkward explanation . . . but if the character just mutters something like, “Not many other places open to us,” that’s vague enough and one-character-knowledge-centric-enough to give me ample room to pull any number of other continents out of a hat, later.)  There’s nothing wrong with leaving the setting “out of the story” as much as possible, so long as it’s in the story enough for the reader to feel as if this is a real, living, coherent place that the story belongs in.  So, of course, it’s another tightrope walk for the writer. Put in enough to make the setting believable and integral to the story, but not enough to paint yourself into any corners or future corners.  How did your approach Niflheim?  My Niflheim setting is featured, thus far, in the novels Dark Warrior Rising and Dark Vengeance). Essentially, it’s an endless subterranean cavern world that I can put whatever features into that I need for my story.  Driving theme of first book: a human slave seeking to get back to the surface he was snatched from, long ago, who sees his chance and seizes it.  So, we must have a slave-taking subterranean society, in an underworld that has surface connections, and uses them in ongoing slave-taking raids.  His chance to do this is an attack on the city of his captors. They are cruel, evil beings (dark elves) and I need to show this. Strife among them is the easiest way to do that, but they also must have rivals (to provide the attackers).  So I envisage a city divided into factions, both rival noble houses and a secular/religious confrontation (between priestesses and warriors of each house). I need things complicated enough not to have burst into open every-elf-kill-every-other-elf long before my story takes place, but to provide plenty of instances for simmering rage and grudges to build, and small cruelties to be enacted. A great place to hate, in other words, and interesting to the reader. That way, its destruction will mean something to the reader.  I also conceive of another city, or better “other cities, plural” (because if it’s just two warring cities, why didn’t they destroy each other long before the events of my books?), who are the sworn foes of this city where the human protagonist is captive. They will send the army to attack this city where the slave is held.  I need to make these two cities very different, to give me opportunities to compare and contrast their ways of doing things.  So . . . two different dark elf religions, two ways of living life: those who worship the Ever-Ice (the coldness at the heart of the underworld, that they believe is the source of all magic), and those who worship Olone, a goddess of perfection and beauty, which provides my explanation for why a city full of her worshippers needs slaves (to do work that is likely to burn, scar, or otherwise mar the striving-to-be-perfect elves’ bodies). Expand on the consequences of those root story needs, and two different societies begin to take shape.  I wanted (as did the publisher) for the novels in this series to work as stand-alones, not tell a story arc that is a predetermined trilogy or quartet. So I had to establish conditions in the setting that would enable the first book, Dark Warrior Rising, to be dramatic and reach a reader-satisfying conclusion, but at the same time leave things open for a meaningful-on-its-own second book.  So the events of the first book must force characters (those who survive, heh heh) to develop and grow, thrusting them into actions that will make the events of the second book happen (the male noble heir who rises to rule one city, for example).  I also have a story need for a “wild” part of the subterranean world, where monsters roam, beyond the real control of the cities, to have a lot of the action take place.  I want to avoid the reader ever getting the feeling that this world is some sort of lifeless stage set where these two opposing dark elf societies face each other across a featureless underground moonscape I’ve whipped up just for this one story. I need to make this place feel real.  So, name many other offstage cities and places in this subterranean world, and establish peddlers (wandering pack-traders) and caravans that link all the cities in a perilous but ongoing trade, bringing “news from afar” with them. Throw in colorful outcasts who eke out a desperate, dangerous living wandering in the Wild Dark, too. Make the dark subterranean wilderness between the cities feel alive without the events of my story crashing through it. (In other words, take away my story and look at what is left; does it look alive? Interesting? Well, make it be both those things, before putting the action of the story into it.)  Alive? But how do you pull that off?  Well, I think every writer will tackle this in his own way. Some will build up “life cycles” (the what-eats-what ecosystem of the underground caverns, with the big monsters at the top) and do formal trade routes and notes on “City A needs edible fungi but has abundant copper and iron it can make into tools and weapons and mongery, to trade for fungi, City B has” [etc.] Most writers (even if they don’t work out life cycles or trade relationships at all) will decide who’s friends and enemies with who else [both underground communities and the larger “this race gets along with that one, but not with yonder other one”], and jot down any big events in local history (an earthquake or collapse that caused chasms to open up, changing the caverns, wars or at least major battles, plagues, invasions or major migrations of critters).  One keeps on working with elements like these, building up details that fit with each other, until the landscape starts to “feel real.”  Then, when you lay the dramatic events of your planned novel on top of all this, enough of the “ongoing daily life” still shows, around the edges, to make the whole place feel alive.  How conscious is all this?  Years ago I personally moved past the stage of formally thinking all of this through; nowadays, I just instinctively do it, stopping only when I reach something that MUST be thought through. Like a guy who’s been painting stage backdrops all his life, I know the basics of what has to be on each backdrop to make it suitable at all, and just get to work, noting the “larger consequences” decisions when I get to them (and sometimes leaving them for later in favor of rushing to do more of the easy grunt-work [names for characters, and overall “sounds” for the language and names of a particular race or city or land, for example].  That’s the sort of thing the majority of writers, who choose “C,” are going to have to think about, too. If Realm 1 is fighting Realm 2, what about their other neighbors? How are those other lands affecting the war, and how will they react to its events? I might only jot down a line or two in way of answers, but they show me “where my setting is heading” for future stories.  One example of this shorthand: “Over mountains to the north of Realm 2 is the land of Coronth, once a great empire but now a few nomadic, food-following tribes camping out in the ruins of great stone cities and fortresses. Have herds of sheep, sell woolen blankets and cloaks to outlander merchants, otherwise keep to themselves. Tribes each have a “lord” and tend to be ready for war and to attack strangers who don’t look like pack-merchants on sight. People are tall, thin, black-haired, brown-skinned, and cover themselves in layers of clothing; use swords and daggers and spears (no archers). Common person names: XXX, YYY, ZZZ.”  This may be all I ever learn of Coronth, or it may be expanded upon later, if I need to, for other stories. Adhered to, it keeps me from inconsistencies if mentioning Coronth sixteen books later in a series.  This can be an endless creative process, which is why the novice might want to choose “B” until the story is written: What do my characters look like? What do they wear? What are their names? What area(s) are they in, when the action takes place? How do they (and everyone else) move from this spot to that spot (horses? giant flying ants? walking? swinging on vines? any answer defines the societies they’re in, to some extent)? Okay, only now do I come to the more important stuff: what are their aims? Why?  And so on. This is truly the Potentially Endless Answer.  Every step of world-building seems to spark story ideas and I get over loaded, almost paralyzed with the possibilities. But without a richly developed world, the prose comes very slowly and is very thin.  Your observation is very, very true, and I verified that for myself recently by trying (just as an experiment) to write an entire fantasy novel with no outline and no known setting, making things up as I went along. I can do it, but s-l-o-w-l-y . . .  Is the feel or sensation of the writing different when you build the world by the various methods, “A” or “B” or “C”? Is one method more full of surprises or thrills than the other? Is one faster or more rewarding?  Certainly these different ways feel different. “A” gives the broadest horizons and the most to work with, a wealth of detail that plunges many a writer into a “okay, I’m telling this saga, but, oh, hey, mustn’t forget to say a little about that, and—whups! musn’t miss this really cool thing over here, and—” state that can make novels larger and full of more subplots and confused (but seeming real).  “B” can be the fastest (no time spent on detail not part of the story at hand) and result in the leanest, cleanest story, but has almost no surprises: the horizons are all blank, and neither writer nor reader of the finished writing is encouraged to “look outside the story to see what else is going on in the setting” (because nothing is).  “C” is best for most writers, because it leaves “blank areas” for later design/writing/breathing room, but paints in the highlights, so the world around looks nice (if not as teemingly rich as with A), and some logical ideas for sequels/future stories/ongoing conflicts in the setting are at least pointed at.  “Most rewarding” depends on how you define it. “B” is the most efficient, and so yields the greatest return per unit of creative spent on the worldbuilding. “A” is the most fun and absorbing creative practice, and so is the most rewarding to a “pure worldbuilder” who doesn’t care about time poured in (uh, that’d be me, when working on the Realms). “C” will best serve that majority of writers who have a casual “keep avenues open” need for sequels, but are primarily devoted to finishing and getting paid for the novel they’re working on right now.  Do you ever consciously base a world on a “real” culture?  Never.  That is: “consciously,” never. To do it well means you’re writing history, or perhaps alternate history (the Plantagenets kept the throne of England, Hitler lived on and Stalin died instead, plunging Russia into chaos and withdrawal from the war, etc.). To do it badly just jolts readers out of the fantasy (“This idiot writer doesn’t understand stirrups! Or how mangonels work!”), and this extends to using jarringly modern words and items in a quasi-medieval setting, too.  However, one can parody real-world cultures, so as to satirically comment on them (as Terry Pratchett does so brilliantly in his Discworld books). And of course every writer echoes or “unconsciously” copies real-world cultures, or Hollywood echoes of them, by using castles and armored knights and any concept of chivalry and standing stones and almost all of the other classic tropes of fantasy.  But that’s unconsciously, I stress again. I never try to model any part of my fantasy worlds on anything overtly like the real world or the historical past of our real world (though some other designers and fiction writers on staff at TSR did do just that, grafting [among other things] the Dalai Lama onto my fantasy world. A disastrous stylistic (as well as legal) mistake, in my opinion.  Not only is it lazy in a creative sense, it always angers/alienates/irritates some readers because they don’t like the choice you’ve made, or what you say or imply about the real culture by what you include of it and how you show it, or because you’ve made mistakes or disagreed with their interpretations of the original, and they thing you “didn’t do your research.” And again, because all of these reactions represent them being jolted out of your story (snatched out of the fantasy back into the real world). Resulting in a bad reading experience, something a good writer never wants to give a reader.  Lastly, what goes into the creation of a magic system?  All magic systems have to have weaknesses and limitations, or there’s no heroism left in the story, just “the fastest spellhurler left standing.”  The reader doesn’t have to know how the magic works, but they have to feel that they do. Otherwise, there really is no “cool” factor. The ugly “Oh, so this wizard guy can do anything? So why should I care?” situation arises, and you’ve lost your reader.  On the other hand, magic usually provides a sixgun-like “instant blast of retribution” element to a story, and that’s coolness a writer usually wants to include. We can have magics that are so slow that they only “work” when a destiny that’s been waiting a thousand years gets fulfilled (and such things underlie the quests that provide a plot for many fantasy novels), but to give us “thrill” visuals in a story, we need to see magic “work” quickly, right in front of our eyes, at least once or twice.  The way in which characters within the story treat or regard magic also colors the reader’s perception of it. Consider sf movies for an instant, and the differing approaches to spaceships. Moments in 2001 treated spacecraft with awe, but other moments (the “cockpit shots” in the flit across the moon) treated it as everyday life. the ALIEN trilogy gave us spacecraft with dirty, always-needing-fixing, submarine-like conditions. In other words, the everyday mundane as opposed to the awe. The writer always wants the reader (from time to time) to be awed or impressed by what the magic system can do, but the writer doesn’t always want characters in the story to be similarly awed. On the other hand, having a character be cowed or moved by what they see is the best way of showing a reader that your hero is truly special, or their quest is fervently believed in by the inhabitants, or that it’s time to be impressed, because all of these supporting characters sure are.  So for the reader to “believe the magic is real” they either have to know how it works, or believe that the writer knows how it works (and just hasn’t passed on all the details). Sometimes, stories hang on how much ignorant/innocent characters learn about the magic, as the story unfolds. Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nTo Believe the Magic Is Real: A Conversation with Ed Greenwood\nEd Greenwood wanders the floor at GenCon 2008 with his arms full of Dungeons and Dragons miniatures. At one of the country’s largest gaming conventions, just about everybody recognizes him as the guy who created the fantasy world The Forgotten Realms.\nThe Canadian library clerk seems unimpressed with how many people stop to shake his hand or ask him to sign a novel or gaming supplement. He’s busy buying mini’s for his granddaughter, but not too busy to share a quick word or catch up with fellow gamers.\nIt’s been a few years since Greenwood has showed up at a convention dressed as the wizard, Elminster, who is the protagonist of his most famous series of novels, but he still sports the distinctive long white beard and pageboy haircut. More to the point, Greenwood is infamously friendly and he loves to talk about what he does: write fiction, non-fiction, and game supplements.\nAt a signing earlier in the convention, the line wrapped halfway around the hall. People lugged stacks of books from all over Greenwood’s canon—Spellfire, The Making of a Mage, Swords of Eveningstar, Silverfall, The Kingless Land, Dark Lord—and you’d think ever reader knew him personally. That’s how his books feel, personable, just like he is.\nOver the years Greenwood has built many fictional worlds, including Falconfar, Niflheim, and The Forgotten Realms. He’s created them for short stories, role-playing games, novels, and for his own amusement.\n“Some folks collect bowling trophies, some rebuild cars in their driveways, and some try not to miss a single televised moment of football,” he says in the introduction to Castlemourn: A Fantasy Campaign Setting. “I dream up fantasy worlds.”\n“I started worldbuilding in my childhood,” he adds, “imagining what grew into The Forgotten Realms (now a shared world that continues to grow through the dreamings of literally millions of readers and gamers.) It was the first of over a dozen worlds I’ve played with since.”\nGreenwood’s worlds are lively, richly detailed, and fun to visit. Whether as dark as Niflheim or as versatile as The Realms, a world designed by Ed Greenwood is alive and waiting for readers or gamers to delve in. And that’s what is most striking about Greenwood’s worlds: they are welcoming. They also tend to feel both fully realized and full of possibility.\nAfter meeting Greenwood, it is easy to imagine him smiling and perhaps chuckling to himself as he pounds away at the keyboard. The conversation that follows is a portion of a longer correspondence that started before GenCon 2008 and stretch well into the fall.\nWhere do you start building a world?\nAs with everything, there’s a caveat: there is no “one and only one right way” [to build a world]. This is just what works for me.\nI’ve been working on the [Forgotten] Realms for over 40 years now, and don’t expect to ever be finished. Over that time I’ve written or co-written almost 200 fiction and game books set in the Realms.\nHowever, I have seen a tendency in other writers to “never get down to writing that novel” or at least to bog down and get overly delayed, when they try to develop their worlds down to the last scuttling insect and ripening fruit before starting to actually write (as opposed to plan) any fiction. So going the “detail everything” route is obviously a trap for some.\nI think the best initial step for most writers would be to define what they want to use the world for, and for how long. So are you, the writer:\nA. Designing the world to outlast you, and any uses you can immediately see, as I did for the Realms?\nB. Or do you have a contract for a short story due in a month, for which your total payment is probably going to be a couple hundred bucks at most, for which you have to design an original fantasy setting?\nC. Or is your need somewhere in between?\nI suspect, for most people, “C” is going to be the appropriate answer, but let’s look quickly at “A” and at “B,” for the different most-appropriate approaches they point at.\nFor “A”, I look at my immediate needs, make them dictate the geographical spots I’m going to super-detail and then start “designing outwards from” until I cover the world, years hence. I start with the spots I need right now, note all the design decisions (trade currents, weather, dominant life forms, etc.) I make that have wider implications, and take each of those implications at least one step. “Well, I’ve said they have severe winters, so therefore . . . ” and I do this process to see if I’ve aimed myself at any problems or conflicts, so I can make changes now, before publication. This isn’t a one-time step, this is how I conduct the process from now on, month after month and year after year.\nA bit daunting, yes?\n“B” is the other end. Although it might be fun to detail a complete fantasy world for such a limited use, it isn’t a wise use of creative time. So in “B”, I plot the story first, and then shape the world to fit the story needs. If it’s a story about a romance between dragons, okay, I need a setting in which dragons live. Do I need that setting to provide conflict or hardships or problems-to-be-solved for my dragon characters? If yes, build ‘em in, and develop the world from there.\nI have talked with writers who just shrug, write the story using placeholders (“He could tell from her purplish snout that she was from XXX. Well enough. He can stomach wyrms from XXX. So they flew on together, over YYY, where the ZZZs were always succulent, and there was no danger of AAAs bursting up out of the trees, shrieking, to attack.”) and then fill everything in when the tale is told the way they want it to. In other words, the world is built to fit the story, and developed only as far as the story needs dictate.\nIf this “B” approach is done by someone thinking, “I might just have to come back to this setting in a future story,” they either start applying the “consequences” approach of “A,” or they take refuge in saying as little as possible. (If I have a character say there are only two continents, I’ve shattered my development chances or thrown myself into having to make an awkward explanation . . . but if the character just mutters something like, “Not many other places open to us,” that’s vague enough and one-character-knowledge-centric-enough to give me ample room to pull any number of other continents out of a hat, later.)\nThere’s nothing wrong with leaving the setting “out of the story” as much as possible, so long as it’s in the story enough for the reader to feel as if this is a real, living, coherent place that the story belongs in.\nSo, of course, it’s another tightrope walk for the writer. Put in enough to make the setting believable and integral to the story, but not enough to paint yourself into any corners or future corners.\nHow did your approach Niflheim?\nMy Niflheim setting is featured, thus far, in the novels Dark Warrior Rising and Dark Vengeance). Essentially, it’s an endless subterranean cavern world that I can put whatever features into that I need for my story.\nDriving theme of first book: a human slave seeking to get back to the surface he was snatched from, long ago, who sees his chance and seizes it.\nSo, we must have a slave-taking subterranean society, in an underworld that has surface connections, and uses them in ongoing slave-taking raids.\nHis chance to do this is an attack on the city of his captors. They are cruel, evil beings (dark elves) and I need to show this. Strife among them is the easiest way to do that, but they also must have rivals (to provide the attackers).\nSo I envisage a city divided into factions, both rival noble houses and a secular/religious confrontation (between priestesses and warriors of each house). I need things complicated enough not to have burst into open every-elf-kill-every-other-elf long before my story takes place, but to provide plenty of instances for simmering rage and grudges to build, and small cruelties to be enacted. A great place to hate, in other words, and interesting to the reader. That way, its destruction will mean something to the reader.\nI also conceive of another city, or better “other cities, plural” (because if it’s just two warring cities, why didn’t they destroy each other long before the events of my books?), who are the sworn foes of this city where the human protagonist is captive. They will send the army to attack this city where the slave is held.\nI need to make these two cities very different, to give me opportunities to compare and contrast their ways of doing things.\nSo . . . two different dark elf religions, two ways of living life: those who worship the Ever-Ice (the coldness at the heart of the underworld, that they believe is the source of all magic), and those who worship Olone, a goddess of perfection and beauty, which provides my explanation for why a city full of her worshippers needs slaves (to do work that is likely to burn, scar, or otherwise mar the striving-to-be-perfect elves’ bodies). Expand on the consequences of those root story needs, and two different societies begin to take shape.\nI wanted (as did the publisher) for the novels in this series to work as stand-alones, not tell a story arc that is a predetermined trilogy or quartet. So I had to establish conditions in the setting that would enable the first book, Dark Warrior Rising, to be dramatic and reach a reader-satisfying conclusion, but at the same time leave things open for a meaningful-on-its-own second book.\nSo the events of the first book must force characters (those who survive, heh heh) to develop and grow, thrusting them into actions that will make the events of the second book happen (the male noble heir who rises to rule one city, for example).\nI also have a story need for a “wild” part of the subterranean world, where monsters roam, beyond the real control of the cities, to have a lot of the action take place.\nI want to avoid the reader ever getting the feeling that this world is some sort of lifeless stage set where these two opposing dark elf societies face each other across a featureless underground moonscape I’ve whipped up just for this one story. I need to make this place feel real.\nSo, name many other offstage cities and places in this subterranean world, and establish peddlers (wandering pack-traders) and caravans that link all the cities in a perilous but ongoing trade, bringing “news from afar” with them. Throw in colorful outcasts who eke out a desperate, dangerous living wandering in the Wild Dark, too. Make the dark subterranean wilderness between the cities feel alive without the events of my story crashing through it. (In other words, take away my story and look at what is left; does it look alive? Interesting? Well, make it be both those things, before putting the action of the story into it.)\nAlive? But how do you pull that off?\nWell, I think every writer will tackle this in his own way. Some will build up “life cycles” (the what-eats-what ecosystem of the underground caverns, with the big monsters at the top) and do formal trade routes and notes on “City A needs edible fungi but has abundant copper and iron it can make into tools and weapons and mongery, to trade for fungi, City B has” [etc.]\nMost writers (even if they don’t work out life cycles or trade relationships at all) will decide who’s friends and enemies with who else [both underground communities and the larger “this race gets along with that one, but not with yonder other one”], and jot down any big events in local history (an earthquake or collapse that caused chasms to open up, changing the caverns, wars or at least major battles, plagues, invasions or major migrations of critters).\nOne keeps on working with elements like these, building up details that fit with each other, until the landscape starts to “feel real.”\nThen, when you lay the dramatic events of your planned novel on top of all this, enough of the “ongoing daily life” still shows, around the edges, to make the whole place feel alive.\nHow conscious is all this?\nYears ago I personally moved past the stage of formally thinking all of this through; nowadays, I just instinctively do it, stopping only when I reach something that MUST be thought through. Like a guy who’s been painting stage backdrops all his life, I know the basics of what has to be on each backdrop to make it suitable at all, and just get to work, noting the “larger consequences” decisions when I get to them (and sometimes leaving them for later in favor of rushing to do more of the easy grunt-work [names for characters, and overall “sounds” for the language and names of a particular race or city or land, for example].\nThat’s the sort of thing the majority of writers, who choose “C,” are going to have to think about, too. If Realm 1 is fighting Realm 2, what about their other neighbors? How are those other lands affecting the war, and how will they react to its events? I might only jot down a line or two in way of answers, but they show me “where my setting is heading” for future stories.\nOne example of this shorthand: “Over mountains to the north of Realm 2 is the land of Coronth, once a great empire but now a few nomadic, food-following tribes camping out in the ruins of great stone cities and fortresses. Have herds of sheep, sell woolen blankets and cloaks to outlander merchants, otherwise keep to themselves. Tribes each have a “lord” and tend to be ready for war and to attack strangers who don’t look like pack-merchants on sight. People are tall, thin, black-haired, brown-skinned, and cover themselves in layers of clothing; use swords and daggers and spears (no archers). Common person names: XXX, YYY, ZZZ.”\nThis may be all I ever learn of Coronth, or it may be expanded upon later, if I need to, for other stories. Adhered to, it keeps me from inconsistencies if mentioning Coronth sixteen books later in a series.\nThis can be an endless creative process, which is why the novice might want to choose “B” until the story is written: What do my characters look like? What do they wear? What are their names? What area(s) are they in, when the action takes place? How do they (and everyone else) move from this spot to that spot (horses? giant flying ants? walking? swinging on vines? any answer defines the societies they’re in, to some extent)? Okay, only now do I come to the more important stuff: what are their aims? Why?\nAnd so on. This is truly the Potentially Endless Answer.\nEvery step of world-building seems to spark story ideas and I get over loaded, almost paralyzed with the possibilities. But without a richly developed world, the prose comes very slowly and is very thin.\nYour observation is very, very true, and I verified that for myself recently by trying (just as an experiment) to write an entire fantasy novel with no outline and no known setting, making things up as I went along. I can do it, but s-l-o-w-l-y . . .\nIs the feel or sensation of the writing different when you build the world by the various methods, “A” or “B” or “C”? Is one method more full of surprises or thrills than the other? Is one faster or more rewarding?\nCertainly these different ways feel different. “A” gives the broadest horizons and the most to work with, a wealth of detail that plunges many a writer into a “okay, I’m telling this saga, but, oh, hey, mustn’t forget to say a little about that, and—whups! musn’t miss this really cool thing over here, and—” state that can make novels larger and full of more subplots and confused (but seeming real).\n“B” can be the fastest (no time spent on detail not part of the story at hand) and result in the leanest, cleanest story, but has almost no surprises: the horizons are all blank, and neither writer nor reader of the finished writing is encouraged to “look outside the story to see what else is going on in the setting” (because nothing is).\n“C” is best for most writers, because it leaves “blank areas” for later design/writing/breathing room, but paints in the highlights, so the world around looks nice (if not as teemingly rich as with A), and some logical ideas for sequels/future stories/ongoing conflicts in the setting are at least pointed at.\n“Most rewarding” depends on how you define it. “B” is the most efficient, and so yields the greatest return per unit of creative spent on the worldbuilding. “A” is the most fun and absorbing creative practice, and so is the most rewarding to a “pure worldbuilder” who doesn’t care about time poured in (uh, that’d be me, when working on the Realms). “C” will best serve that majority of writers who have a casual “keep avenues open” need for sequels, but are primarily devoted to finishing and getting paid for the novel they’re working on right now.\nDo you ever consciously base a world on a “real” culture?\nNever.\nThat is: “consciously,” never. To do it well means you’re writing history, or perhaps alternate history (the Plantagenets kept the throne of England, Hitler lived on and Stalin died instead, plunging Russia into chaos and withdrawal from the war, etc.). To do it badly just jolts readers out of the fantasy (“This idiot writer doesn’t understand stirrups! Or how mangonels work!”), and this extends to using jarringly modern words and items in a quasi-medieval setting, too.\nHowever, one can parody real-world cultures, so as to satirically comment on them (as Terry Pratchett does so brilliantly in his Discworld books). And of course every writer echoes or “unconsciously” copies real-world cultures, or Hollywood echoes of them, by using castles and armored knights and any concept of chivalry and standing stones and almost all of the other classic tropes of fantasy.\nBut that’s unconsciously, I stress again. I never try to model any part of my fantasy worlds on anything overtly like the real world or the historical past of our real world (though some other designers and fiction writers on staff at TSR did do just that, grafting [among other things] the Dalai Lama onto my fantasy world. A disastrous stylistic (as well as legal) mistake, in my opinion.\nNot only is it lazy in a creative sense, it always angers/alienates/irritates some readers because they don’t like the choice you’ve made, or what you say or imply about the real culture by what you include of it and how you show it, or because you’ve made mistakes or disagreed with their interpretations of the original, and they thing you “didn’t do your research.” And again, because all of these reactions represent them being jolted out of your story (snatched out of the fantasy back into the real world). Resulting in a bad reading experience, something a good writer never wants to give a reader.\nLastly, what goes into the creation of a magic system?\nAll magic systems have to have weaknesses and limitations, or there’s no heroism left in the story, just “the fastest spellhurler left standing.”\nThe reader doesn’t have to know how the magic works, but they have to feel that they do. Otherwise, there really is no “cool” factor. The ugly “Oh, so this wizard guy can do anything? So why should I care?” situation arises, and you’ve lost your reader.\nOn the other hand, magic usually provides a sixgun-like “instant blast of retribution” element to a story, and that’s coolness a writer usually wants to include. We can have magics that are so slow that they only “work” when a destiny that’s been waiting a thousand years gets fulfilled (and such things underlie the quests that provide a plot for many fantasy novels), but to give us “thrill” visuals in a story, we need to see magic “work” quickly, right in front of our eyes, at least once or twice.\nThe way in which characters within the story treat or regard magic also colors the reader’s perception of it. Consider sf movies for an instant, and the differing approaches to spaceships. Moments in 2001 treated spacecraft with awe, but other moments (the “cockpit shots” in the flit across the moon) treated it as everyday life. the ALIEN trilogy gave us spacecraft with dirty, always-needing-fixing, submarine-like conditions. In other words, the everyday mundane as opposed to the awe. The writer always wants the reader (from time to time) to be awed or impressed by what the magic system can do, but the writer doesn’t always want characters in the story to be similarly awed. On the other hand, having a character be cowed or moved by what they see is the best way of showing a reader that your hero is truly special, or their quest is fervently believed in by the inhabitants, or that it’s time to be impressed, because all of these supporting characters sure are.\nSo for the reader to “believe the magic is real” they either have to know how it works, or believe that the writer knows how it works (and just hasn’t passed on all the details). Sometimes, stories hang on how much ignorant/innocent characters learn about the magic, as the story unfolds.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/greenwood_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Believe the Magic Is Real: A Conversation with Ed Greenwood by Jeremy L. Jones"}