{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bo Balder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "7x6lwJVlYAkDzirZVBx3eCjk1ZA=", "id": null, "license": null, "comments": "", "raw_text": "4380 words, short story  A Vastness  Yoshi scythes the lotus seedpod with orange-slickered arms and tosses them in the harvesting bag on her back. The blue sky overhead reflects ominously in the still ponds below. She reaches out and cuts the same perfect pod again. This means she’s in the dream. Any moment now. Dream-Yoshi can’t stop her hands cutting that damn seedpod once more. There it is.  The waters ripple and become still again. Yoshi staggers as the ground below rises up, and up, the water streaming off the new hill. Her legs won’t move although she’s screaming at them to run. Earth and sky tumble over each other. A vast rumbling booms painfully through every bone in her body. She screams but no sound comes out. The world flickers orange and green, and frighteningly, black. Where is the sky? The air slams out of her body and she touches that terrible black hide no it touches her—  “Professor, we need you on the bridge.” Her phone.  Dream-Yoshi wants to answer the phone, but she has no hands, and no pockets. Her hands cycle uselessly in the air, finding nothing.  Yoshi opened gummy eyes. She’d fallen asleep in her desk chair. Unlike the chair, her bed was programmed to wake her up when her vitals became agitated, so no wonder the dream had gone on for so long. She closed her mouth and wiped off drool. Had she been shouting?  Her breath came in gasps and her armpits were drenched. Jesus. Would it never stop? That awful memory of being dragged along by the Guardian monster still made her feel that helpless panic again. No amount of therapy had helped, and it was thirty-five years ago now.  She imagined her grad students hovering over her, expressions of disgust or concern on their faces. But she was the only one judging herself for this, she remembered this from therapy. Get back in the moment. The past was in the past, it had no power over her.  Yoshi lurched out of her cabin, stumbling because her left leg had gone to sleep. She entered the crowded bridge, blinking to make sense of what she saw. Her four grad students hovered behind the semi-circle of the bridge crew seated behind their nav screens.  “Professor A.? You all right? The Guardians are getting away,” Elivera said.  The spaceship’s comm showed the path the school of Guardians was taking in purple. It led away from the galaxy into the void between the stars. The Guardians were speeding up, getting away from the research vessel, into black map-space only sprinkled with galaxies at the edge. Or wait, it was the ship that had slowed down.  Yoshi gestured at the fading spoor.  “That’s where we are going, captain. Set us on an intercept course.”  Captain Makeba bared her teeth. “Professor, please note my objections to this course of action. We are not equipped for speeds like that, and where we’re going there is no one to help us if we get into trouble.”  Finding out about the Guardians, their biology, their ecology, their sentience and culture, if they had it, was Yoshi’s life’s goal. Couldn’t the captain see she was enabling the escape of the most enigmatic aliens humanity had ever met?  “Captain, this vessel’s goal is to follow and study the Guardians. You agreed to that when we rented the ship.”  The captain sighed. “Yes, I did. May I remind you of the waiver you signed for personal compensation in case of mishap? This is dangerous. Also, it could cost your university a lot of money.”  “Fine, fine, you’ve re-dotted a line you already dotted. Can we please continue now?” Yoshi said, reluctant to tear her eyes away from the purple spoor.  The captain nodded to the navigator. “Return to the original settings for the Guardian school. Get us back on track.”  Yoshi tried to follow the grids and statistics and charts, but she didn’t have the hard science background. She stepped back among her students.  “Wiwing?”  Wiwing was the student with the astrophysics and navigation knowledge. She nodded. “That should work. It will get us back onto our original course and ping when we reattach to the school.”  Yoshi wrung her hands. “If we lose them, I’m going to throttle that coward of a captain. We had them.”  Elivera scrunched up her face. “Don’t stress out over it yet, professor. Time enough for that if it happens.”  Yoshi snorted. She was a few decades older than the grad students, and although together they had the skills to follow her course, she suspected that without her they would lack the drive, or maybe she should call it the insanity, to continue their research into the depths of space.  Yoshi had grown up on a planet inhabited by Guardians, immense beings that casually burrowed through human settlements if they wanted to. The defining experience of Yoshi, then a sixteen-year-old boy, had been getting caught up in the slipstream of a Guardian’s travel, ripped out of the lotus field he’d been harvesting. At first she’d dreamed the event every night.  After Yoshi had got away from Libertà to study on Earth and change gender, her fascination with the Guardians had remained. What drove the giant creatures? Why did they stay on a planet for decades, only to abandon it and travel enormous distances? Were they even intelligent, was it play, did it have purpose?  Thirty years later, humanity still knew so little about Guardians that even the size of their population was in question. Some theories about their appearances and sightings speculated that they might have a population of only twenty-three members, others that they might number in the millions or trillions. They had been spotted traveling through wormholes, through time, being in two places at once. For the Guardians, even that didn’t seem out of the question.  Yoshi had barely sat down at her work station when an alarm blared.  “They’ve moved up a space layer. We can see individuals!” Anna said.  Yoshi looked over the navigator’s shoulder at the big screen and whooped with excitement. The subspace image, all blues and grays against a black background, showed a dozen or so stingray-like shapes undulating languidly through space.  “They’re magnificent,” Yoshi breathed. “Amazing. Thirteen?”  “Thirteen,” Wiwing said. “Should we get closer? They’ve got a course ready.”  “Yes, yes, of course,” Yoshi said. She raked a hand through her cropped hair. “We need to observe them 24/7.”  “Yes, sir,” Elivera said with a mock salute.  The grad pod settled back down at their stations, shifting in their seats with little frowns of concentration. At the navigation consoles, the crew went on their business of running the ship.  Yoshi took up Oluwe’s station and familiarized herself with the controls. Her hands typed and swiped faster, images called up and assessed in a microsecond. She felt sharper and faster since the realization that this was really happening. She was following a school of Guardians. Maybe ‘school’ was not grandiose enough, now that she thought about it. The Guardians weren’t fish. Throng, maybe, or gathering. No, too dull.  Vastness. A Vastness of Guardians. Though Guardians itself was a misnomer, a name coined by a superstitious populace eager to believe. She’d been one of them, believing like her mother that the Guardians were gods. Until that etched-in day that the boy Yoshi had his close encounter with their dreadful integument. Then she’d known they weren’t benevolent guardians but monsters.  But Guardians was the name under which they’d strayed into human research and it would have to stay for now. They were certainly immense and awesome, even if they turned out not to be intelligent. But then again, maybe humans couldn’t really measure the intelligence of an alien, let alone one this seemingly untethered from physical limits.  Focus, Yoshi.  Data streamed in about the Guardians’ distortion of space. It seemed the Guardians were physical creatures, of some kind of flesh and blood as ordinary searches returned physical information, but at the same time they were able to bend space and time in a way the spaceship’s instruments just weren’t registering.  “We need so much more than just our grad pod!” Wiwing said, slumping forwards and banging her forehead on her station. “We need AIs, experimental and theoretical physicists to devise new instruments. We can’t measure something if we don’t know what we’re measuring.”  Yoshi ignored Wiwing’s little moment. She was right, of course, but wishing wouldn’t change their situation. They should focus on what they could do right now.  She grunted in dismay. “This projection shows they’ll be going out of range in twenty-four hours. They’re just too fast. And that’s best-case scenario. If they decide to go universe-skipping, we can’t follow anyway. Wiwing, check my calculations?”  The concentration returned to Wiwing’s face, smoothing it out and making her look younger than her late twenties. She chewed her full bottom lip. “You’re right, Professor. We’re gradually falling back. We have to gather as much data as we can.”  “Twenty-four hours is not enough. We need months, years.” Yoshi dragged at her hair in frustration, but the space-shorn locks were too short to give a good yank on. The most she could achieve was hedgehog. “We have to do something.”  “But what?”  “We could shoot off a probe,” Anna said. “We can give it an extra boost so it can stay abreast of the Guardians, and then when it’s exhausted, the ship can pick it up.”  Yoshi whipped her head around. “I like that, Anna. And we can do more. What if we let the probe land on one of the Guardians? Take a sample of its flesh?”  The four of them looked shocked.  “Professor, what if they’re sentient? It seems disrespectful.”  Yoshi shrugged. “Mosquitoes sting us all the time. We don’t like it, but it’s just one of those things.”  “Maybe on Libertà,” Elivera said, a snap in her voice. “On Earth they’re now unable to sting humans anymore. It’s gross and invasive.”  Her Earth-born grad students had obviously received genetic engineering she hadn’t, on her struggling colony planet. But the exchange gave her another idea. “If we’re sticking a sentient being at all, why not stick in something a little bit deeper so we can latch on to it? They’d pull us along in their wake, and the weakness of our engines will no longer be a factor.”  She thought the grad students looked appalled, but she was never sure about facial expressions. “Well? I think it’s a great idea. XO, can you help us think of a way to change the probe so it not only probes but also turns into a hook?”  Oluwe shook her head. “Professor, this is wrong. We want to study these creatures, not hunt them and boil them for oil.”  “You’re taking the whale analogy a bit too far,” Yoshi said. “My mosquito simile was more accurate, and we’re even smaller compared to it than the mosquitoes are to us.”  “That’s a rationalization,” Oluwe said.  “What if we end up marooned in outer space because we were unable to cut ourselves loose from the giant space creature that may or may not be able to create its own wormholes?” the XO asked.  Yoshi held the XO’s eyes and stared back. She knew the woman wouldn’t disobey the captain’s orders, no matter her spluttering.  “And the integrity of the body!” Elivera said.  “You’ve had your genes sampled, haven’t you? A little scrape with a plastic spoon?” Yoshi said.  Why were they were ganging up on her? She must be imagining things. Tiredness and stress. She had to make it happen, persuade them again. “Let’s stand our ground, people, and not keep second guessing ourselves. We committed to this.”  A moment of silence hung in the air, but the balance tipped and fell in Yoshi’s favor.  The grad students and the XO started on their new tasks. Yoshi exhaled a long breath, soundlessly so as not to alert the women. She had to push through now. She wasn’t a fool. If this didn’t work, she wasn’t going to be able to persuade them a third time.  The XO walked them to the probe hatches. The probe bay was a narrow hallway with gleaming chrome doors, one probe behind each almost mirror-like panel. The XO decanted one so they could have a look at it.  It was hard to keep from jostling each other and still get a peek at the probe. It looked like an elongated egg, featureless white, about as long and wide as a coffin.  “Professor, the probe seems fairly limited,” Oluwe said. She was the informatics grad.  “Can’t we expand on its normal instructions? We need it to be able to respond to unexpected circumstances.”  Oluwe shook no. “It has a tiny brain, they really went the cheap route.”  “We put in a bigger brain?” It seemed obvious to Yoshi.  “No, we don’t have enough time to grow a big enough brain. So we’ll only be able to get a few straightforward samples. Turns out it was originally designed for a geology mission,” Oluwe said.  Nothing was going as it was supposed to. Yoshi tugged her hair again. It didn’t help. “Is there room for a person inside that probe?”  Oluwe frowned back. “What? No. I don’t think so. And that would be suicide. It’s a one-way throwaway probe.”  “What other options have we got? Does this ship have lifeboats or shuttles or something?”  The XO turned and stared at Yoshi. The woman had very beautiful light green eyes, gorgeous against her brown skin. Yoshi had never noticed before. It felt like she was in some kind of enhanced state, as if right before a liminal moment. Change was coming, but she didn’t know what kind.  “We do have a shuttle, obviously. You came on board in it.”  “Well, good. Let’s use that instead. It has room for all of us, right?”  “A probe is not like a shuttle. We wanted to use a probe because we can give it a huge acceleration boost. We can’t shoot off the shuttle like that,” Oluwe said.  “We need those bio samples. I don’t care what the solution is, I need speed to reach a Guardian, flexible programming slash a human passenger to get the right samples, something to use as a hook. Get on it.”  They did. Yoshi wiped sweat off her forehead. She’d only have followed orders like that if she really believed in the professor in question or their goals. Maybe her grad students did believe in her. But she didn’t get them. They were all younger, fitter, smarter, better educated than she, gene-edited, therapied to the max. What did they see in this flawed, older model? Maybe because Yoshi had had to fight for everything, for advanced studies, getting off the planet on a grant, getting her gender change. Well, if that was it, they were right. She was going to fight for this expedition, make it count, make it deliver.  Yoshi instructed the XO to open up the probe. As she’d suspected, there was hardly any space between the brains and what looked like propulsion systems. A small person might fit in there if that bundle of tubes was moved to the left, and those spaghettied wires tightened up a bit.  “What if we took out all that tube stuff?”  The XO looked at Yoshi as if she was mad. “You’ve got to be kidding. Those are vital telemetry and cooling systems. And even if you could fit a small person in there, they’d need a spacesuit. Air. A beacon so she could be picked back up.”  Yoshi was a small woman. Her heart thrilled at the idea of riding out at the forefront of science, personally securing cutting-edge discoveries.  “Sure. Let’s try it out! There’s got to be a way.”  The XO shook her head. “You’re insane.”  Yoshi ignored her.  It took nonstop work for 24 hours, while the Guardians crept ever farther out of reach, but finally the probe was ready for testing. Its gleaming white nose peeked out of the bay like the snout of a curious dolphin. The people in their drab coveralls seemed underexposed beside it.  Yoshi wouldn’t be going after all. Reluctantly, she’d realized in order to acquire that Nobel prize, she’d have to be the person publishing the research, not the one dying in the attempt.  Wiwing was the smallest of the grad students. Outfitted with two oxygen tanks and a newly hatched air maker, suited up, she just fit inside the probe. But one look at her green face and quivering mouth told Yoshi enough. She ordered the girl to be lifted out.  Wiwing stood shaking and crying in front of Yoshi. “I’m sorry professor, but I can’t. I just can’t. I’m going to throw up and die.”  She was right to be so afraid, Yoshi knew. It was risky. She might die. And if she was too afraid to function, she almost certainly would fail.  Before Elivera, as the next smallest grad student, could offer to be next, Yoshi spoke out. Never mind the risks, never mind the publication in Nature. She couldn’t not do this.  “I’m doing it. I’m smaller than Elivera.”  Elivera chewed her lip. “You’re older than us. You’ll be at more risk from the acceleration and the cramped position. You should have a medical checkup first.”  The autodoc could do one in less than an hour. But what if it found something? Yoshi was almost sixty, and never had any gene-therapy except the gender change. Her mother had had high blood pressure and had died fairly young. She couldn’t remember about her father, who’d left the family early, but this wasn’t the moment to find out about any risk factors.  “No. The clock is ticking. I’m doing this now. This is the best chance we’ve ever had of getting close to the Guardians. I’m not going to waste it.”  “It’s not worth it, Professor,” Elivera said. “Even if you manage to get a tissue sample.”  “It’s worth trying to stay with them for as long as we can,” Yoshi said. “Think of the data we’ll gather! We need something tangible when they’re out of reach.”  She took her clothes off, feeling slightly ashamed of her aging body in front of these glowing, taut young people, but she shook the thought off. She had something they didn’t. The guts to go for it. She stepped into the spacesuit, still faintly warm from Wiwing’s body, and waited while the XO and Elivera put on the external apparatus and ticked off the checklist.  It was time to climb into her white box. The inside of the helmet smelled like newly printed plastic with overtones of stark fear.  The probe was a tight fit, and uncomfortable from the first moment. Maybe Elivera had been right. If it was this cramped now, she’d have numb extremities in a few minutes, and if her circulation became compromised . . . She didn’t care. She could still publish the definitive paper on Guardians with a few toes missing. Fame and recognition beckoned.  The grad pod waved awkward goodbyes in the opening of the hatch before it slammed shut. The probe moved through the tube to launch position. After that Yoshi heard only her heartbeat, isolated from the outside world by vacuum. A display popped up in her vision, counting down to take off.  A giant foot stomped down on her and flattened her so hard she couldn’t breathe. The display unhelpfully showed the amount of gees her body was withstanding. She wanted to shut it off, it only made her panic increase, but she couldn’t blink or move her tongue.  The foot went away and for a while Yoshi did nothing but breathe, so grateful to be alive. She focused back on the pop-up, that hadn’t stopped flashing stats and updates since the takeoff.  Ten minutes until impact, it said. Already? She called up time passed. Eighteen minutes? It had seemed like two or three. She must have been out of it for a bit. Okay, she’d lain there panting and zoned out, but not that long, right?  She just managed to wrench herself back from zoning out about zoning out. She had stuff to do. Check her vitals. Adrenaline, blood pressure worrying, rest okay. No time to meditate as the app advised.  Hook: ready to be deployed. Biological sampler: ready to be deployed. It was up to her which to do first. Shit. She thought they’d decided that already. How could she make the best decision in her cramped, compressed, mid-level panicked state?  Hook first? But then if the Guardians reacted to it, maybe she’d end up without the tissue sample. Or if she took the tissue sample first, the Guardians might react and they’d lose the school. The vastness.  One minute left. All right, sample first. Even if they lost the vastness, at least they’d have something.  Right on time, the sample taker launched. Yoshi followed its progress on her pop-up screen. The probe’s camera showed unhelpful footage of empty space. She might be hovering only meters away from a Guardian, but she couldn’t see it. If only they’d had more time! She searched in vain through menus to see if she could move the probe’s camera around. Everybody aboard the fucking ship could watch what was happening except her.  Something pinged. The sample had been taken successfully. She ordered it to use its last fuel to take off and hang in space, sending out location data so the ship could pick it up. Time to deploy the hook. The barb.  The harpoon. Ha.  A shock went through the probe. That was excellent. Too bad the probe didn’t have a feedback loop for the hook, because it had been such a hasty improvisation. She sent out a query to her crew. No answer. She couldn’t be out of telemetry range already. That wouldn’t happen so soon, would it?  Elapsed time: 00:999 hours.  Yoshi blinked her eyes. No, it had only been moments.  Elapsed time: 00:3021 hours. That couldn’t be right.  How many hours of oxygen did she have left? She wanted to stretch to relieve the cold, stiff feeling in her limbs, not that she had much room to do that, but she could manage a finger roll and some grimacing.  If only she could move her shoulders. Her neck was killing her. She imagined rolling her shoulders, long and luxurious, back and forth.  The world shattered into shards of glass, piercing her everywhere. Colors speared her heart, sounds made her teeth bleed, and a mix of love and hate painted burning swirls on her skin. Instead of milky white plastics and gray fixings, she saw blackness stippled with light, like the silk blouse she’d once borrowed from her mother. It had freaked her mother out because then she’d been a boy.  Part of her came wide awake. This wasn’t a hallucination, this wasn’t normal. She could see right through the walls of the probe.  She was entering a wormhole without the protection of a ship.  Her intestines sprang free from her body and unwound into a long, writhing loop. She tried blinking, but she couldn’t feel her eyes. One of them must have floated away from her body, because she could see herself. What was left of herself. Part unraveling human, part probe, something clinging to the skin of a Guardian like a leech. How was she even thinking this? Something that broken up couldn’t be alive. Here, an arm fused with gray circuitry, there a belly mosaicked with white probe shards.  Maybe if she lifted her left arm, which still sort of looked like it used to. She willed her hand to move. Instead the world tilted and spun, and when she could see again she seemed to be surrounded by large bodies. Her tail—her tail?—was doing something to space so that it flowed her by like a stream split by a rock, only she was the stream and space the rock.  She felt welcome. She’d never had that before. Was this what that felt like, warmth, and being known and accepted for who she was? But who was she, then? Or what?  A trail of living matter clung to someone’s hide, almost too small for her to perceive. Although hide wasn’t the word, or skin, or integument, or armor. It was more like a self-chosen limit, by a being that wanted to be itself for a little while longer and so kept itself apart from the universe. It could dissolve if it wanted to, but it didn’t.  She twisted to look at the particle of humanity, but her whole body went along. She had no neck anymore. Wait, what was a neck? What was humanity? It was not of her. She shivered her outer layer through three universes at once and dislodged what was not hers. There. Done. She was whole, perfect, unique. Alone.  But a kernel of curiosity lingered. She hadn’t always been this self. A trail stretched out through time, backwards, with the enticing lilac scent of the past. She twisted and plaited the universe until she could follow the trail, back, back, burning red.  She burrowed through another squirming blot of multiple humanity, back, zooming past gravity wells and winking suns, back, until she found the origin. Of herself. It was fascinating. A being that had never existed before appeared out of nowhere. She looped around it in time, before it, during it, after it. It was so small she found it almost impossible to get close enough. She tried again. The planet billowed around her, trying to prevent her from disturbing its integrity. She didn’t care.  There. She managed to touch the new being with the outer shells of herself, universes layered around her so tightly they were almost physical. The tiny thing, that had been her once, tumbled through the air, its color close to the burning red of traveling back in time.  It was done. She’d insured her future. The past lost its allure. She let herself drift on the pulsing tide of the universe’s expanding core. Soon it would contract again. She waited for it. Bo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "text": "4380 words, short story\nA Vastness\nYoshi scythes the lotus seedpod with orange-slickered arms and tosses them in the harvesting bag on her back. The blue sky overhead reflects ominously in the still ponds below. She reaches out and cuts the same perfect pod again. This means she’s in the dream. Any moment now. Dream-Yoshi can’t stop her hands cutting that damn seedpod once more. There it is.\nThe waters ripple and become still again. Yoshi staggers as the ground below rises up, and up, the water streaming off the new hill. Her legs won’t move although she’s screaming at them to run. Earth and sky tumble over each other. A vast rumbling booms painfully through every bone in her body. She screams but no sound comes out. The world flickers orange and green, and frighteningly, black. Where is the sky? The air slams out of her body and she touches that terrible black hide no it touches her—\n“Professor, we need you on the bridge.” Her phone.\nDream-Yoshi wants to answer the phone, but she has no hands, and no pockets. Her hands cycle uselessly in the air, finding nothing.\nYoshi opened gummy eyes. She’d fallen asleep in her desk chair. Unlike the chair, her bed was programmed to wake her up when her vitals became agitated, so no wonder the dream had gone on for so long. She closed her mouth and wiped off drool. Had she been shouting?\nHer breath came in gasps and her armpits were drenched. Jesus. Would it never stop? That awful memory of being dragged along by the Guardian monster still made her feel that helpless panic again. No amount of therapy had helped, and it was thirty-five years ago now.\nShe imagined her grad students hovering over her, expressions of disgust or concern on their faces. But she was the only one judging herself for this, she remembered this from therapy. Get back in the moment. The past was in the past, it had no power over her.\nYoshi lurched out of her cabin, stumbling because her left leg had gone to sleep. She entered the crowded bridge, blinking to make sense of what she saw. Her four grad students hovered behind the semi-circle of the bridge crew seated behind their nav screens.\n“Professor A.? You all right? The Guardians are getting away,” Elivera said.\nThe spaceship’s comm showed the path the school of Guardians was taking in purple. It led away from the galaxy into the void between the stars. The Guardians were speeding up, getting away from the research vessel, into black map-space only sprinkled with galaxies at the edge. Or wait, it was the ship that had slowed down.\nYoshi gestured at the fading spoor.\n“That’s where we are going, captain. Set us on an intercept course.”\nCaptain Makeba bared her teeth. “Professor, please note my objections to this course of action. We are not equipped for speeds like that, and where we’re going there is no one to help us if we get into trouble.”\nFinding out about the Guardians, their biology, their ecology, their sentience and culture, if they had it, was Yoshi’s life’s goal. Couldn’t the captain see she was enabling the escape of the most enigmatic aliens humanity had ever met?\n“Captain, this vessel’s goal is to follow and study the Guardians. You agreed to that when we rented the ship.”\nThe captain sighed. “Yes, I did. May I remind you of the waiver you signed for personal compensation in case of mishap? This is dangerous. Also, it could cost your university a lot of money.”\n“Fine, fine, you’ve re-dotted a line you already dotted. Can we please continue now?” Yoshi said, reluctant to tear her eyes away from the purple spoor.\nThe captain nodded to the navigator. “Return to the original settings for the Guardian school. Get us back on track.”\nYoshi tried to follow the grids and statistics and charts, but she didn’t have the hard science background. She stepped back among her students.\n“Wiwing?”\nWiwing was the student with the astrophysics and navigation knowledge. She nodded. “That should work. It will get us back onto our original course and ping when we reattach to the school.”\nYoshi wrung her hands. “If we lose them, I’m going to throttle that coward of a captain. We had them.”\nElivera scrunched up her face. “Don’t stress out over it yet, professor. Time enough for that if it happens.”\nYoshi snorted. She was a few decades older than the grad students, and although together they had the skills to follow her course, she suspected that without her they would lack the drive, or maybe she should call it the insanity, to continue their research into the depths of space.\nYoshi had grown up on a planet inhabited by Guardians, immense beings that casually burrowed through human settlements if they wanted to. The defining experience of Yoshi, then a sixteen-year-old boy, had been getting caught up in the slipstream of a Guardian’s travel, ripped out of the lotus field he’d been harvesting. At first she’d dreamed the event every night.\nAfter Yoshi had got away from Libertà to study on Earth and change gender, her fascination with the Guardians had remained. What drove the giant creatures? Why did they stay on a planet for decades, only to abandon it and travel enormous distances? Were they even intelligent, was it play, did it have purpose?\nThirty years later, humanity still knew so little about Guardians that even the size of their population was in question. Some theories about their appearances and sightings speculated that they might have a population of only twenty-three members, others that they might number in the millions or trillions. They had been spotted traveling through wormholes, through time, being in two places at once. For the Guardians, even that didn’t seem out of the question.\nYoshi had barely sat down at her work station when an alarm blared.\n“They’ve moved up a space layer. We can see individuals!” Anna said.\nYoshi looked over the navigator’s shoulder at the big screen and whooped with excitement. The subspace image, all blues and grays against a black background, showed a dozen or so stingray-like shapes undulating languidly through space.\n“They’re magnificent,” Yoshi breathed. “Amazing. Thirteen?”\n“Thirteen,” Wiwing said. “Should we get closer? They’ve got a course ready.”\n“Yes, yes, of course,” Yoshi said. She raked a hand through her cropped hair. “We need to observe them 24/7.”\n“Yes, sir,” Elivera said with a mock salute.\nThe grad pod settled back down at their stations, shifting in their seats with little frowns of concentration. At the navigation consoles, the crew went on their business of running the ship.\nYoshi took up Oluwe’s station and familiarized herself with the controls. Her hands typed and swiped faster, images called up and assessed in a microsecond. She felt sharper and faster since the realization that this was really happening. She was following a school of Guardians. Maybe ‘school’ was not grandiose enough, now that she thought about it. The Guardians weren’t fish. Throng, maybe, or gathering. No, too dull.\nVastness. A Vastness of Guardians. Though Guardians itself was a misnomer, a name coined by a superstitious populace eager to believe. She’d been one of them, believing like her mother that the Guardians were gods. Until that etched-in day that the boy Yoshi had his close encounter with their dreadful integument. Then she’d known they weren’t benevolent guardians but monsters.\nBut Guardians was the name under which they’d strayed into human research and it would have to stay for now. They were certainly immense and awesome, even if they turned out not to be intelligent. But then again, maybe humans couldn’t really measure the intelligence of an alien, let alone one this seemingly untethered from physical limits.\nFocus, Yoshi.\nData streamed in about the Guardians’ distortion of space. It seemed the Guardians were physical creatures, of some kind of flesh and blood as ordinary searches returned physical information, but at the same time they were able to bend space and time in a way the spaceship’s instruments just weren’t registering.\n“We need so much more than just our grad pod!” Wiwing said, slumping forwards and banging her forehead on her station. “We need AIs, experimental and theoretical physicists to devise new instruments. We can’t measure something if we don’t know what we’re measuring.”\nYoshi ignored Wiwing’s little moment. She was right, of course, but wishing wouldn’t change their situation. They should focus on what they could do right now.\nShe grunted in dismay. “This projection shows they’ll be going out of range in twenty-four hours. They’re just too fast. And that’s best-case scenario. If they decide to go universe-skipping, we can’t follow anyway. Wiwing, check my calculations?”\nThe concentration returned to Wiwing’s face, smoothing it out and making her look younger than her late twenties. She chewed her full bottom lip. “You’re right, Professor. We’re gradually falling back. We have to gather as much data as we can.”\n“Twenty-four hours is not enough. We need months, years.” Yoshi dragged at her hair in frustration, but the space-shorn locks were too short to give a good yank on. The most she could achieve was hedgehog. “We have to do something.”\n“But what?”\n“We could shoot off a probe,” Anna said. “We can give it an extra boost so it can stay abreast of the Guardians, and then when it’s exhausted, the ship can pick it up.”\nYoshi whipped her head around. “I like that, Anna. And we can do more. What if we let the probe land on one of the Guardians? Take a sample of its flesh?”\nThe four of them looked shocked.\n“Professor, what if they’re sentient? It seems disrespectful.”\nYoshi shrugged. “Mosquitoes sting us all the time. We don’t like it, but it’s just one of those things.”\n“Maybe on Libertà,” Elivera said, a snap in her voice. “On Earth they’re now unable to sting humans anymore. It’s gross and invasive.”\nHer Earth-born grad students had obviously received genetic engineering she hadn’t, on her struggling colony planet. But the exchange gave her another idea. “If we’re sticking a sentient being at all, why not stick in something a little bit deeper so we can latch on to it? They’d pull us along in their wake, and the weakness of our engines will no longer be a factor.”\nShe thought the grad students looked appalled, but she was never sure about facial expressions. “Well? I think it’s a great idea. XO, can you help us think of a way to change the probe so it not only probes but also turns into a hook?”\nOluwe shook her head. “Professor, this is wrong. We want to study these creatures, not hunt them and boil them for oil.”\n“You’re taking the whale analogy a bit too far,” Yoshi said. “My mosquito simile was more accurate, and we’re even smaller compared to it than the mosquitoes are to us.”\n“That’s a rationalization,” Oluwe said.\n“What if we end up marooned in outer space because we were unable to cut ourselves loose from the giant space creature that may or may not be able to create its own wormholes?” the XO asked.\nYoshi held the XO’s eyes and stared back. She knew the woman wouldn’t disobey the captain’s orders, no matter her spluttering.\n“And the integrity of the body!” Elivera said.\n“You’ve had your genes sampled, haven’t you? A little scrape with a plastic spoon?” Yoshi said.\nWhy were they were ganging up on her? She must be imagining things. Tiredness and stress. She had to make it happen, persuade them again. “Let’s stand our ground, people, and not keep second guessing ourselves. We committed to this.”\nA moment of silence hung in the air, but the balance tipped and fell in Yoshi’s favor.\nThe grad students and the XO started on their new tasks. Yoshi exhaled a long breath, soundlessly so as not to alert the women. She had to push through now. She wasn’t a fool. If this didn’t work, she wasn’t going to be able to persuade them a third time.\nThe XO walked them to the probe hatches. The probe bay was a narrow hallway with gleaming chrome doors, one probe behind each almost mirror-like panel. The XO decanted one so they could have a look at it.\nIt was hard to keep from jostling each other and still get a peek at the probe. It looked like an elongated egg, featureless white, about as long and wide as a coffin.\n“Professor, the probe seems fairly limited,” Oluwe said. She was the informatics grad.\n“Can’t we expand on its normal instructions? We need it to be able to respond to unexpected circumstances.”\nOluwe shook no. “It has a tiny brain, they really went the cheap route.”\n“We put in a bigger brain?” It seemed obvious to Yoshi.\n“No, we don’t have enough time to grow a big enough brain. So we’ll only be able to get a few straightforward samples. Turns out it was originally designed for a geology mission,” Oluwe said.\nNothing was going as it was supposed to. Yoshi tugged her hair again. It didn’t help. “Is there room for a person inside that probe?”\nOluwe frowned back. “What? No. I don’t think so. And that would be suicide. It’s a one-way throwaway probe.”\n“What other options have we got? Does this ship have lifeboats or shuttles or something?”\nThe XO turned and stared at Yoshi. The woman had very beautiful light green eyes, gorgeous against her brown skin. Yoshi had never noticed before. It felt like she was in some kind of enhanced state, as if right before a liminal moment. Change was coming, but she didn’t know what kind.\n“We do have a shuttle, obviously. You came on board in it.”\n“Well, good. Let’s use that instead. It has room for all of us, right?”\n“A probe is not like a shuttle. We wanted to use a probe because we can give it a huge acceleration boost. We can’t shoot off the shuttle like that,” Oluwe said.\n“We need those bio samples. I don’t care what the solution is, I need speed to reach a Guardian, flexible programming slash a human passenger to get the right samples, something to use as a hook. Get on it.”\nThey did. Yoshi wiped sweat off her forehead. She’d only have followed orders like that if she really believed in the professor in question or their goals. Maybe her grad students did believe in her. But she didn’t get them. They were all younger, fitter, smarter, better educated than she, gene-edited, therapied to the max. What did they see in this flawed, older model? Maybe because Yoshi had had to fight for everything, for advanced studies, getting off the planet on a grant, getting her gender change. Well, if that was it, they were right. She was going to fight for this expedition, make it count, make it deliver.\nYoshi instructed the XO to open up the probe. As she’d suspected, there was hardly any space between the brains and what looked like propulsion systems. A small person might fit in there if that bundle of tubes was moved to the left, and those spaghettied wires tightened up a bit.\n“What if we took out all that tube stuff?”\nThe XO looked at Yoshi as if she was mad. “You’ve got to be kidding. Those are vital telemetry and cooling systems. And even if you could fit a small person in there, they’d need a spacesuit. Air. A beacon so she could be picked back up.”\nYoshi was a small woman. Her heart thrilled at the idea of riding out at the forefront of science, personally securing cutting-edge discoveries.\n“Sure. Let’s try it out! There’s got to be a way.”\nThe XO shook her head. “You’re insane.”\nYoshi ignored her.\nIt took nonstop work for 24 hours, while the Guardians crept ever farther out of reach, but finally the probe was ready for testing. Its gleaming white nose peeked out of the bay like the snout of a curious dolphin. The people in their drab coveralls seemed underexposed beside it.\nYoshi wouldn’t be going after all. Reluctantly, she’d realized in order to acquire that Nobel prize, she’d have to be the person publishing the research, not the one dying in the attempt.\nWiwing was the smallest of the grad students. Outfitted with two oxygen tanks and a newly hatched air maker, suited up, she just fit inside the probe. But one look at her green face and quivering mouth told Yoshi enough. She ordered the girl to be lifted out.\nWiwing stood shaking and crying in front of Yoshi. “I’m sorry professor, but I can’t. I just can’t. I’m going to throw up and die.”\nShe was right to be so afraid, Yoshi knew. It was risky. She might die. And if she was too afraid to function, she almost certainly would fail.\nBefore Elivera, as the next smallest grad student, could offer to be next, Yoshi spoke out. Never mind the risks, never mind the publication in Nature. She couldn’t not do this.\n“I’m doing it. I’m smaller than Elivera.”\nElivera chewed her lip. “You’re older than us. You’ll be at more risk from the acceleration and the cramped position. You should have a medical checkup first.”\nThe autodoc could do one in less than an hour. But what if it found something? Yoshi was almost sixty, and never had any gene-therapy except the gender change. Her mother had had high blood pressure and had died fairly young. She couldn’t remember about her father, who’d left the family early, but this wasn’t the moment to find out about any risk factors.\n“No. The clock is ticking. I’m doing this now. This is the best chance we’ve ever had of getting close to the Guardians. I’m not going to waste it.”\n“It’s not worth it, Professor,” Elivera said. “Even if you manage to get a tissue sample.”\n“It’s worth trying to stay with them for as long as we can,” Yoshi said. “Think of the data we’ll gather! We need something tangible when they’re out of reach.”\nShe took her clothes off, feeling slightly ashamed of her aging body in front of these glowing, taut young people, but she shook the thought off. She had something they didn’t. The guts to go for it. She stepped into the spacesuit, still faintly warm from Wiwing’s body, and waited while the XO and Elivera put on the external apparatus and ticked off the checklist.\nIt was time to climb into her white box. The inside of the helmet smelled like newly printed plastic with overtones of stark fear.\nThe probe was a tight fit, and uncomfortable from the first moment. Maybe Elivera had been right. If it was this cramped now, she’d have numb extremities in a few minutes, and if her circulation became compromised . . . She didn’t care. She could still publish the definitive paper on Guardians with a few toes missing. Fame and recognition beckoned.\nThe grad pod waved awkward goodbyes in the opening of the hatch before it slammed shut. The probe moved through the tube to launch position. After that Yoshi heard only her heartbeat, isolated from the outside world by vacuum. A display popped up in her vision, counting down to take off.\nA giant foot stomped down on her and flattened her so hard she couldn’t breathe. The display unhelpfully showed the amount of gees her body was withstanding. She wanted to shut it off, it only made her panic increase, but she couldn’t blink or move her tongue.\nThe foot went away and for a while Yoshi did nothing but breathe, so grateful to be alive. She focused back on the pop-up, that hadn’t stopped flashing stats and updates since the takeoff.\nTen minutes until impact, it said. Already? She called up time passed. Eighteen minutes? It had seemed like two or three. She must have been out of it for a bit. Okay, she’d lain there panting and zoned out, but not that long, right?\nShe just managed to wrench herself back from zoning out about zoning out. She had stuff to do. Check her vitals. Adrenaline, blood pressure worrying, rest okay. No time to meditate as the app advised.\nHook: ready to be deployed. Biological sampler: ready to be deployed. It was up to her which to do first. Shit. She thought they’d decided that already. How could she make the best decision in her cramped, compressed, mid-level panicked state?\nHook first? But then if the Guardians reacted to it, maybe she’d end up without the tissue sample. Or if she took the tissue sample first, the Guardians might react and they’d lose the school. The vastness.\nOne minute left. All right, sample first. Even if they lost the vastness, at least they’d have something.\nRight on time, the sample taker launched. Yoshi followed its progress on her pop-up screen. The probe’s camera showed unhelpful footage of empty space. She might be hovering only meters away from a Guardian, but she couldn’t see it. If only they’d had more time! She searched in vain through menus to see if she could move the probe’s camera around. Everybody aboard the fucking ship could watch what was happening except her.\nSomething pinged. The sample had been taken successfully. She ordered it to use its last fuel to take off and hang in space, sending out location data so the ship could pick it up. Time to deploy the hook. The barb.\nThe harpoon. Ha.\nA shock went through the probe. That was excellent. Too bad the probe didn’t have a feedback loop for the hook, because it had been such a hasty improvisation. She sent out a query to her crew. No answer. She couldn’t be out of telemetry range already. That wouldn’t happen so soon, would it?\nElapsed time: 00:999 hours.\nYoshi blinked her eyes. No, it had only been moments.\nElapsed time: 00:3021 hours. That couldn’t be right.\nHow many hours of oxygen did she have left? She wanted to stretch to relieve the cold, stiff feeling in her limbs, not that she had much room to do that, but she could manage a finger roll and some grimacing.\nIf only she could move her shoulders. Her neck was killing her. She imagined rolling her shoulders, long and luxurious, back and forth.\nThe world shattered into shards of glass, piercing her everywhere. Colors speared her heart, sounds made her teeth bleed, and a mix of love and hate painted burning swirls on her skin. Instead of milky white plastics and gray fixings, she saw blackness stippled with light, like the silk blouse she’d once borrowed from her mother. It had freaked her mother out because then she’d been a boy.\nPart of her came wide awake. This wasn’t a hallucination, this wasn’t normal. She could see right through the walls of the probe.\nShe was entering a wormhole without the protection of a ship.\nHer intestines sprang free from her body and unwound into a long, writhing loop. She tried blinking, but she couldn’t feel her eyes. One of them must have floated away from her body, because she could see herself. What was left of herself. Part unraveling human, part probe, something clinging to the skin of a Guardian like a leech. How was she even thinking this? Something that broken up couldn’t be alive. Here, an arm fused with gray circuitry, there a belly mosaicked with white probe shards.\nMaybe if she lifted her left arm, which still sort of looked like it used to. She willed her hand to move. Instead the world tilted and spun, and when she could see again she seemed to be surrounded by large bodies. Her tail—her tail?—was doing something to space so that it flowed her by like a stream split by a rock, only she was the stream and space the rock.\nShe felt welcome. She’d never had that before. Was this what that felt like, warmth, and being known and accepted for who she was? But who was she, then? Or what?\nA trail of living matter clung to someone’s hide, almost too small for her to perceive. Although hide wasn’t the word, or skin, or integument, or armor. It was more like a self-chosen limit, by a being that wanted to be itself for a little while longer and so kept itself apart from the universe. It could dissolve if it wanted to, but it didn’t.\nShe twisted to look at the particle of humanity, but her whole body went along. She had no neck anymore. Wait, what was a neck? What was humanity? It was not of her. She shivered her outer layer through three universes at once and dislodged what was not hers. There. Done. She was whole, perfect, unique. Alone.\nBut a kernel of curiosity lingered. She hadn’t always been this self. A trail stretched out through time, backwards, with the enticing lilac scent of the past. She twisted and plaited the universe until she could follow the trail, back, back, burning red.\nShe burrowed through another squirming blot of multiple humanity, back, zooming past gravity wells and winking suns, back, until she found the origin. Of herself. It was fascinating. A being that had never existed before appeared out of nowhere. She looped around it in time, before it, during it, after it. It was so small she found it almost impossible to get close enough. She tried again. The planet billowed around her, trying to prevent her from disturbing its integrity. She didn’t care.\nThere. She managed to touch the new being with the outer shells of herself, universes layered around her so tightly they were almost physical. The tiny thing, that had been her once, tumbled through the air, its color close to the burning red of traveling back in time.\nIt was done. She’d insured her future. The past lost its allure. She let herself drift on the pulsing tide of the universe’s expanding core. Soon it would contract again. She waited for it.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "source": "https://clarkesworldmagazine.com/balder_05_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Vastness by Bo Balder"}