{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Brooke Wonders", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "vOK7gqT65QTkEOfF68chs20ITBI=", "id": null, "license": null, "comments": "", "raw_text": "3410 words, short story  Everything Must Go  Split-level ranch-style home features a spacious and private fenced backyard with a covered deck and small dog run.  The blue-gray house at 1414 Linden Dr. is afraid of the dark. The foreclosure crisis hit its neighborhood hard, and in house after house, lights wink out and never turn back on. The house at 1414 waits for new families to move in, and sometimes they do, but more often than not the owners abandon their property. Linden Drive grows increasingly desolate, and 1414 clings to the warmth and safety of its inhabitants, sure that it is too well-loved to be left behind.  Its family owns a dog, an ancient mutt with a gray-frosted muzzle who spends most of his time in the backyard, sprawled on his side in the brown grass. The house has long admired the diligence with which the mutt defends its home. When neighbors pass by with their own dogs, Lucky drags himself over to the gate connecting his run to the front yard and lets loose a fit of barking. But one morning in late summer, a man with two collies strolls past, and Lucky doesn’t bark.  Two thick branches of English ivy pull away from 1414’s exterior and wend their way around the corpse. The rusted hinges of its cellar-door croon a lullaby of creaks and whines as they gape wide to receive Lucky. The house pulls the vine-choked body deep inside its walls. Tucked between sheets of plaster and insulation, the dog mortifies; soon the basement reeks of decay. Upstairs, a girl mourns her lost pet.  East-facing bedroom catches morning light, a bonus in wintertime.  The daughter at fourteen is a folded-up girl of elbows, knobby knees and angles a which-way. She loves origami, late into every night creasing out birds of paradise, pagodas, sea horses, and lotuses that trip from her fingertips. From her ceiling hang a thousand cranes it took her months to fold, multicolored and hopeful, made of wrapping paper, construction paper, butcher paper, wax paper, glitter paper, natural-wood-pulp paper. Origami paper proper she treasures, hoards like allowance money or dragon’s gold. The house thinks of the folded-up girl as Paper, and loves her.  Corner bedroom features windows on two sides. Bright and airy!  The son is growing wings. They first appear after his thirteenth birthday party, when his mother burns the cake and then locks herself in the bathroom while his father sits alone in the garage, drinking whiskey and building birdhouses out of scrap. The son packs a suitcase and explains his plans to Paper: he’ll escape out his bedroom window, run away to join the circus. His sister talks him out of it, to the house’s relief. The boy’s wings begin as nubbins protruding from each shoulder blade that ache and ache as he grows. By seventeen, nubbins have grown into a skeletal wing-structure, hollow bones covered in tufted feathers and long pinions, though he cannot yet lift himself off the ground. The house thinks of the winged boy as Bird, and loves him.  Third bedroom, slightly smaller—use it for storage, or turn it into baby’s first bedroom.  Their mother has her own workspace wherein she fashions elaborate textile art from found objects, fabric, and yarn. Lately, though, the house has noted a desperate loneliness threaded through her. Husband at work, kids at school, she fritters away her time following the soaps, crocheting blankets only to unravel them. She ties each member of the family to her via thick silken cords, cords whose color changes depending on her mood: crimson for anger, cerulean for disappointment, jet for possessiveness, silver for regret. The house lets these strings tangle throughout the hallways, following the arcing filaments from room to room. The house tries to warm to her, but she’s metal-cold, her voice scissor-sharp. The house fears her, and calls her Needle.  Two-car garage.  A grease-stained man who smells of slaughter, their father lives in the garage when he doesn’t live at his butcher shop. The house envies him his children’s unconditional love: they crouch at his elbows as he shingles a miniature roof, then fight over who gets to help install his latest creation. A neighborhood’s worth of elaborately finished birdhouses dot the backyard, attracting flocks of cardinals, rooks, and wrens.  But the house knows where the father keeps his skeletons, round glass secrets full of intoxicating oblivion stashed everywhere: in the trunk of the car, in with the New Year’s decorations, beneath the bathroom sink. When the couple’d first moved in, before there were papers or birds between them, he’d kept this secret, and long has the house tracked the ebb and flow of his addiction. It calls him Glass, for the bottles that clink like chains and sing to him from within their hiding places.  Kitchen has no dishwasher but plenty of counter space.  The teens have never seen their parents in the same room at the same time. Needle pours canned green beans and mushroom soup into a casserole dish, then retreats to the pantry just as Glass heads to the fridge for an ice water. Only once he’s wandered back to the garage does she reappear. Though the parents play elaborate hide-and-seek, the walls speak; every night the teens lie awake in their beds and listen to their parents argue.  —The mortgage is too expensive; where can we cut back?  —Do we really need another birdhouse?  —We don’t need more of your wall blankets, that’s for sure.  —It’s not a wall blanket, it’s fiber-art.  —If we can afford your art, why can’t we afford mine?  The house rustles the homemade tapestries that line its walls, drapings heavy with dust and guilt.  Downstairs master bedroom for maximum privacy.  The walls shout louder and louder, the house hating every resonant echo, until the only way the kids can sleep is by pressing palms deep into their ears. As if to compensate for the increase in noise, both parents have begun to fade from view. Their mother flickers in and out like TV static, as if she’s trying to switch to a different channel. Their father’s skin has become glass, behind which amber alcohol roils.  Bird catches his father getting dressed one morning, the flab of Glass’s belly hanging translucent over his belt-buckle. He watches his father remove a fifth of Jack from its sock-drawer hideaway and down a few quick swigs. Through his father’s transparent flesh, Bird can see the liquor slide slow down Glass’s throat until it joins the tawny liquid sloshing waist-high. Tiny waves break against his bellybutton. The immediate difference is imperceptible, but as the days rush by, Bird watches the amber tide rise from bellybutton to chest to clavicle, until Glass has filled himself up nearly to the brim, his eyes shiny as bottle caps.  Carpeted staircase with banister leads down to the lower level.  The house wakes in the middle of the night to a boot kicking through the safety wall of the stairwell landing. It groans through every vertical beam. Glass stands on the stairs, lamplight refracted through him casting whiskey-colored cracks across the house’s interior. Needle’s splayed against the banister, eyes rimmed red with crying, her lip split bloody.  The next morning, Glass spackles over the hole. The house, wounded, shrinks ever smaller. Does your room seem tinier than usual? Paper asks Bird one day. Bird nods, but they’ve gotten older and taller; they aren’t children anymore. The house is grateful for these excuses.  All bedrooms have walk-in closets  Paper folds a dollhouse. The first piece of butcher paper she cuts is massive. It creases down into an eleven-room suburban ranch home identical to her own. Then small squares for all the furnishings. She sets it up like a diorama on top of her chest-of-drawers, back in the deepest recesses of her closet where no one else goes. Its white picket fence spills off into darkness, disappearing behind her winter coats. She folds up father, mother, brother, sister, and stuffs them inside. The house notices that a streak of red mars the mother-doll’s face. Once her parents have gone to bed, Paper steals matches from the pantry and sets the folded father on fire; he crumbles to ash in her metal waste-bin.  Within the hour, Glass slams out the front door. In his wake, a heavy silken thread lies twitching like a coral snake on the lawn, one crimson end severed and fraying. Needle moves methodically from room to room, packing Glass’s belongings into boxes. Gasping cries push past her lips, her sorrow the crackle and shush of a blown speaker, a low rasp on repeat. The house howls wind through its eaves in mourning.  Bird seeks out Paper. Pushing open the door to her bedroom, he finds her sitting inside her closet, folding. She’s trying not to cry, the hitch in each inhale synched in time to her mother. Bird catches Paper’s hands in his to still their darting movements and flutters his wingtips across her fingers. She begins to comb through his feathers in long, even strokes and her breathing steadies long enough for her to confess her crime. Bird assures her that it couldn’t possibly have been her fault, that she had nothing to do with Glass leaving, then helps her dispose of the small pile of new-made origami fathers that litter the floor.  Low ceiling in the living room makes for a cozy living space.  Every piece of furniture stands halved. Of the dining table, only two legs remain, its lacquered surface leaning out over empty space. Half a filament glows dimly within the halved light bulbs inside every light fixture, each under a halved lampshade. The rug is halved, and the refrigerator is definitely halved, as suddenly there’s a lot less food in the house. Glass sends money, and so far they’ve managed to save the house, but Needle struggles to get dinner on the table.  Bird cycles from bedroom to kitchen, twice a day stopping before the half-fridge only to slam it closed in disappointment. The house remembers when it was just a wooden frame, before the contractor had installed its drywall; it imagines Bird must feel something similar: hollowed out and vulnerable.  Paper begins to watch her weight as if she hopes to become parchment, as transparent as her mother. Only the house counts how many times each day Paper locks herself in the bathroom and steps onto the scale. It dislikes the purple veins running so close to the surface of her skin, the curve of her lungs as they contract and expand within her ribcage, her bones visible like an abandoned building exposed to years of bad weather. If Bird notices his sister thinning, he says nothing.  Since Glass left, Bird sleeps on the floor of Paper’s room most nights, and they lie awake talking until all hours, imagining the futures they’ll have when they finally escape. Bird jokes that together they’re a paper bird, one of his sister’s folded cranes but with the power of flight. By their powers combined, they could fly far away from home. His broad wings span the room, a comfort. The house worries that the two teens will be divided next—half a Paper, half a Bird. It vows to keep them safe as houses.  Carpeted upstairs hallway means children can run and play in safety.  Paper grooms her brother’s wings every day, and they grow in strength, though their pristine blackness is occasionally marred by molt. One morning, while finger-combing near his spine, she notices what the house has known for weeks: that several of his primary feathers have been cut about a third of the way down, at sharp angles.  That night, she pulls down all thousand of the cranes that roost against her ceiling, littering her floor with their rainbow corpses. The house admires her ingenuity, the trap she’s laid to catch the wing-clipper.  Crunch, crunch in the dark and Paper leaps up to flick the light-switch. Needle’s outline is a staticky blur, but her sewing shears, poised over one black wing, glisten in the sudden brightness.  Bird wakes in a rage. Before his sister’s eyes, Bird’s features morph into something else, someone the house doesn’t recognize. Surely this nightmare beast can’t be its own winged son? Bird’s face twists into a black beak, his fingers curl into talons, and his feathers beat a furious whirlwind. He lunges at his mother, but she vanishes into white noise.  Downstairs half-bath for guests.  Their mother drifts through the hallways, visible only as a human-shaped distortion in space. Paper watches her mother pace, white-gray ants suffusing the outline of a woman. The house wonders why Needle has not yet returned to her textiles. Bins of crewel, quilting and lace clutter the craft room floor, gathering dust. The house finds this odd, as the craft room is the only space that has yet to be plagued by black holes.  Glass’s exit left holes strewn everywhere—by the work bench in the garage, in front of the refrigerator, hovering over the couch in the den—and Needle keeps falling into them, a phenomenon that concerns the house. The teens generally avoid the holes, though they’ve accidentally created a few: Their dad has hidden bottles everywhere, and whenever they find one, it implodes into a new hole, reality warping around an empty center.  One day, while playing find-the-bottle, Paper catches Bird drinking deep from a fifth of whiskey they’d discovered not a week earlier, one she’d thought had burst into the usual hole. She snatches the bottle from his hand and shatters it against the porcelain sink. Bird’s face begins to elongate into that horrible beak, skin shifting to barbed feathers, hands to scaled talons, as if he’s swallowed a black hole and it’s consuming him from the inside.  From the empty silence surrounding them comes the susurrus of their mother’s presence. Then mother and son are wrestling on the bathroom floor, him a winged, clawed monster, her a disembodied hush and ten fingernails that rake deep red furrows down his biceps. Paper squeezes her eyes shut tight as fists.  The house knows the three of them can’t go on like this, wants to help, and does what it can, battening down the insulation to keep in warmth against oncoming winter.  Master bathroom features two sinks and a separate shower area.  Paper arrives home from school to find the dim outline of her mother seated on the bathroom floor, the under-sink cabinet open and a whiskey bottle next to her. Eyes unseeing, Needle’s hands clutch at empty air. A black hole shimmers unreality beneath her. Paper wants to grab her hands and pull her away from the danger, but she’s been here before: If she’s not terribly careful—the house has watched it happen too many times—she’ll be sucked in as well.  Paper sifts through her mother’s sundry crafting bins until she finds something she thinks will work: a long skein of heavy cord in pale blue. She makes a lasso of cord and loops it over her mother’s shoulders, grips the end, and tugs. Needle tumbles free and the hole blinks out into memory.  Her mother lies comatose, her outline shimmering, a needle held up to light and turned this way and that so its eye flickers into and out of existence. Needle stares through her daughter, and Paper feels as invisible as she’d ever wished to be. She takes her mother’s cold hand in hers. Gently she loops blue cord around Needle’s bloodless fingers. Round and round it ravels. Paper is painstaking; she threads the skein about her mother’s every limb in ever-tightening circles, tugging the cord taut against her mother’s incorporeal corpus.  It takes all day and late into the night for Paper to wind cord, thread, yarn, and string—two full bins of material—around her mother’s body, a body shaped just like her own will be someday. Wrapped up like a spindle or a mummy, Needle can once again be seen. She meets her daughter’s eyes, pupils contracting and expanding in bewilderment.  Needle moves around the house more freely after rejoining the land of the visible, stacking boxes of their father’s things in the garage and out of sight, returning to her crafting, even hugging Paper every so often, though Bird still won’t go near her. The house, thrilled to have Needle back, stretches happily through the long wires inside its walls, solid in the surety of their connection to the outside world. The house can appreciate ties that bind.  Small attic for extra storage.  Bird’s slept in the attic since his mother’s attempted pinioning. He tugs the pull-down ladder up behind him each night, just to be sure. Skin mottled with brown tufts of downy feather, face craggy with shadow, he hunches his back under the weight of the full-grown wings arcing over his head. Bird has been working, saving up for his great escape, and he’s finally made enough, just six days shy of eighteen.  Paper’s stolen her mother’s shears; with them, she cuts Bird free of the silvery blue cord binding him to Needle. She holds out a loose twist of yellow embroidery thread, one end attached to the attic furnace. He recoils, hissing, but she pats his arm to reassure him: he’s tied only to his childhood home, not to Needle. His eyes are falcon-hooded; nevertheless, he allows her to encircle his wrist with the thread. It glimmers in sunlight, golden bright and joyful. He stands to his full height, aware that he’s taller now than their father had been. Stretching dark wings, he’s poised to swoop down from the attic window.  The house is having none of this. It bares paned-glass teeth and snaps a sill shut on Bird’s boot heel. Bird and Paper cry out, and then she braces herself against the window-frame and yanks upward, and Bird loosens his shoelaces and dives downward, and there’s just his black boot stuck in the house’s craw as he swoops low, then speeds sky-high. Windows rove wild-eyed; doors slam open and shut, enraged. Their father’s frayed red thread is still out on the lawn, its color faded to pink. Paper stares after her brother until the black dot of him winks out against the horizon, yellow thread pulled taut as it spools out thinner and thinner.  All through the night, the house growls and shudders like earthquake, terrified that soon it will be plunged into darkness. It’s grown too much like Needle, in her desperation and possessiveness, and too much like Glass, wanting only to be filled. The house’s fears form a yawning black hole that encompasses its plot entirely, as if the earth planned to open like a cellar door and suck the neighborhood underground like a hundred birdhouses perched atop quicksand. The house is immobile and has no means of escape, but it’s seen the family deal with enough such holes to understand their operations.  The dog is in a state of advanced decomposition when the house coughs Lucky up from its bowels. It’s swaddled the body in insulation, but that doesn’t much contain the stench; Paper finds the corpse almost immediately. Tugging a sleeve over her nose, she rolls it into the garden with a rusted shovel and leaves it to mulch. By summertime, the remains will be skin and bones and the hydrangea blooms nearby especially lovely.  Paper walks upstairs to stand before her mirror, turning sideways as if reveling in the acute angles she’s made of her body. Taking one hand in the other, she folds herself in half, then does it again and again and again. By the time the house realizes, long before it can formulate a plan to stop her, she’s disappeared. Her mother finds her that evening, a single sheet of translucent paper, a note explaining what she’s done. Needle and the house are left alone.  Large manicured front lawn with mature trees. Please call Arbor Realty to schedule an appointment to view this property.  A mess of bishop’s weed obscures the walkway. A lattice trestle covered in ivy creeps upward toward the roof’s edge. The house’s eyes are shut, mouth closed and locked up tight. Neighbors who walk past keep on moving; dogs pull their owners across to the other side of the street. The house mutters, settles into its cracked foundation. It monitors the single bright yellow thread that arcs into the distance, waiting for any movement on the line, any sign that its winged boy will soon fly home. Brooke Wonders writes fiction that thinks it's true and memoir that thinks it's fabulism. Despite these oxymora, her work has appeared in or is forthcoming from Monkeybicycle, Daily Science Fiction, and Brevity: A Journal of Concise Nonfiction, among others. She is currently a PhD candidate at the University of Illinois at Chicago. A graduate of Clarion UCSD 2011, she shares an urban shoebox with fellow writer and partner in crime James Will Brady.", "text": "3410 words, short story\nEverything Must Go\nSplit-level ranch-style home features a spacious and private fenced backyard with a covered deck and small dog run.\nThe blue-gray house at 1414 Linden Dr. is afraid of the dark. The foreclosure crisis hit its neighborhood hard, and in house after house, lights wink out and never turn back on. The house at 1414 waits for new families to move in, and sometimes they do, but more often than not the owners abandon their property. Linden Drive grows increasingly desolate, and 1414 clings to the warmth and safety of its inhabitants, sure that it is too well-loved to be left behind.\nIts family owns a dog, an ancient mutt with a gray-frosted muzzle who spends most of his time in the backyard, sprawled on his side in the brown grass. The house has long admired the diligence with which the mutt defends its home. When neighbors pass by with their own dogs, Lucky drags himself over to the gate connecting his run to the front yard and lets loose a fit of barking. But one morning in late summer, a man with two collies strolls past, and Lucky doesn’t bark.\nTwo thick branches of English ivy pull away from 1414’s exterior and wend their way around the corpse. The rusted hinges of its cellar-door croon a lullaby of creaks and whines as they gape wide to receive Lucky. The house pulls the vine-choked body deep inside its walls. Tucked between sheets of plaster and insulation, the dog mortifies; soon the basement reeks of decay. Upstairs, a girl mourns her lost pet.\nEast-facing bedroom catches morning light, a bonus in wintertime.\nThe daughter at fourteen is a folded-up girl of elbows, knobby knees and angles a which-way. She loves origami, late into every night creasing out birds of paradise, pagodas, sea horses, and lotuses that trip from her fingertips. From her ceiling hang a thousand cranes it took her months to fold, multicolored and hopeful, made of wrapping paper, construction paper, butcher paper, wax paper, glitter paper, natural-wood-pulp paper. Origami paper proper she treasures, hoards like allowance money or dragon’s gold. The house thinks of the folded-up girl as Paper, and loves her.\nCorner bedroom features windows on two sides. Bright and airy!\nThe son is growing wings. They first appear after his thirteenth birthday party, when his mother burns the cake and then locks herself in the bathroom while his father sits alone in the garage, drinking whiskey and building birdhouses out of scrap. The son packs a suitcase and explains his plans to Paper: he’ll escape out his bedroom window, run away to join the circus. His sister talks him out of it, to the house’s relief. The boy’s wings begin as nubbins protruding from each shoulder blade that ache and ache as he grows. By seventeen, nubbins have grown into a skeletal wing-structure, hollow bones covered in tufted feathers and long pinions, though he cannot yet lift himself off the ground. The house thinks of the winged boy as Bird, and loves him.\nThird bedroom, slightly smaller—use it for storage, or turn it into baby’s first bedroom.\nTheir mother has her own workspace wherein she fashions elaborate textile art from found objects, fabric, and yarn. Lately, though, the house has noted a desperate loneliness threaded through her. Husband at work, kids at school, she fritters away her time following the soaps, crocheting blankets only to unravel them. She ties each member of the family to her via thick silken cords, cords whose color changes depending on her mood: crimson for anger, cerulean for disappointment, jet for possessiveness, silver for regret. The house lets these strings tangle throughout the hallways, following the arcing filaments from room to room. The house tries to warm to her, but she’s metal-cold, her voice scissor-sharp. The house fears her, and calls her Needle.\nTwo-car garage.\nA grease-stained man who smells of slaughter, their father lives in the garage when he doesn’t live at his butcher shop. The house envies him his children’s unconditional love: they crouch at his elbows as he shingles a miniature roof, then fight over who gets to help install his latest creation. A neighborhood’s worth of elaborately finished birdhouses dot the backyard, attracting flocks of cardinals, rooks, and wrens.\nBut the house knows where the father keeps his skeletons, round glass secrets full of intoxicating oblivion stashed everywhere: in the trunk of the car, in with the New Year’s decorations, beneath the bathroom sink. When the couple’d first moved in, before there were papers or birds between them, he’d kept this secret, and long has the house tracked the ebb and flow of his addiction. It calls him Glass, for the bottles that clink like chains and sing to him from within their hiding places.\nKitchen has no dishwasher but plenty of counter space.\nThe teens have never seen their parents in the same room at the same time. Needle pours canned green beans and mushroom soup into a casserole dish, then retreats to the pantry just as Glass heads to the fridge for an ice water. Only once he’s wandered back to the garage does she reappear. Though the parents play elaborate hide-and-seek, the walls speak; every night the teens lie awake in their beds and listen to their parents argue.\n—The mortgage is too expensive; where can we cut back?\n—Do we really need another birdhouse?\n—We don’t need more of your wall blankets, that’s for sure.\n—It’s not a wall blanket, it’s fiber-art.\n—If we can afford your art, why can’t we afford mine?\nThe house rustles the homemade tapestries that line its walls, drapings heavy with dust and guilt.\nDownstairs master bedroom for maximum privacy.\nThe walls shout louder and louder, the house hating every resonant echo, until the only way the kids can sleep is by pressing palms deep into their ears. As if to compensate for the increase in noise, both parents have begun to fade from view. Their mother flickers in and out like TV static, as if she’s trying to switch to a different channel. Their father’s skin has become glass, behind which amber alcohol roils.\nBird catches his father getting dressed one morning, the flab of Glass’s belly hanging translucent over his belt-buckle. He watches his father remove a fifth of Jack from its sock-drawer hideaway and down a few quick swigs. Through his father’s transparent flesh, Bird can see the liquor slide slow down Glass’s throat until it joins the tawny liquid sloshing waist-high. Tiny waves break against his bellybutton. The immediate difference is imperceptible, but as the days rush by, Bird watches the amber tide rise from bellybutton to chest to clavicle, until Glass has filled himself up nearly to the brim, his eyes shiny as bottle caps.\nCarpeted staircase with banister leads down to the lower level.\nThe house wakes in the middle of the night to a boot kicking through the safety wall of the stairwell landing. It groans through every vertical beam. Glass stands on the stairs, lamplight refracted through him casting whiskey-colored cracks across the house’s interior. Needle’s splayed against the banister, eyes rimmed red with crying, her lip split bloody.\nThe next morning, Glass spackles over the hole. The house, wounded, shrinks ever smaller. Does your room seem tinier than usual? Paper asks Bird one day. Bird nods, but they’ve gotten older and taller; they aren’t children anymore. The house is grateful for these excuses.\nAll bedrooms have walk-in closets\nPaper folds a dollhouse. The first piece of butcher paper she cuts is massive. It creases down into an eleven-room suburban ranch home identical to her own. Then small squares for all the furnishings. She sets it up like a diorama on top of her chest-of-drawers, back in the deepest recesses of her closet where no one else goes. Its white picket fence spills off into darkness, disappearing behind her winter coats. She folds up father, mother, brother, sister, and stuffs them inside. The house notices that a streak of red mars the mother-doll’s face. Once her parents have gone to bed, Paper steals matches from the pantry and sets the folded father on fire; he crumbles to ash in her metal waste-bin.\nWithin the hour, Glass slams out the front door. In his wake, a heavy silken thread lies twitching like a coral snake on the lawn, one crimson end severed and fraying. Needle moves methodically from room to room, packing Glass’s belongings into boxes. Gasping cries push past her lips, her sorrow the crackle and shush of a blown speaker, a low rasp on repeat. The house howls wind through its eaves in mourning.\nBird seeks out Paper. Pushing open the door to her bedroom, he finds her sitting inside her closet, folding. She’s trying not to cry, the hitch in each inhale synched in time to her mother. Bird catches Paper’s hands in his to still their darting movements and flutters his wingtips across her fingers. She begins to comb through his feathers in long, even strokes and her breathing steadies long enough for her to confess her crime. Bird assures her that it couldn’t possibly have been her fault, that she had nothing to do with Glass leaving, then helps her dispose of the small pile of new-made origami fathers that litter the floor.\nLow ceiling in the living room makes for a cozy living space.\nEvery piece of furniture stands halved. Of the dining table, only two legs remain, its lacquered surface leaning out over empty space. Half a filament glows dimly within the halved light bulbs inside every light fixture, each under a halved lampshade. The rug is halved, and the refrigerator is definitely halved, as suddenly there’s a lot less food in the house. Glass sends money, and so far they’ve managed to save the house, but Needle struggles to get dinner on the table.\nBird cycles from bedroom to kitchen, twice a day stopping before the half-fridge only to slam it closed in disappointment. The house remembers when it was just a wooden frame, before the contractor had installed its drywall; it imagines Bird must feel something similar: hollowed out and vulnerable.\nPaper begins to watch her weight as if she hopes to become parchment, as transparent as her mother. Only the house counts how many times each day Paper locks herself in the bathroom and steps onto the scale. It dislikes the purple veins running so close to the surface of her skin, the curve of her lungs as they contract and expand within her ribcage, her bones visible like an abandoned building exposed to years of bad weather. If Bird notices his sister thinning, he says nothing.\nSince Glass left, Bird sleeps on the floor of Paper’s room most nights, and they lie awake talking until all hours, imagining the futures they’ll have when they finally escape. Bird jokes that together they’re a paper bird, one of his sister’s folded cranes but with the power of flight. By their powers combined, they could fly far away from home. His broad wings span the room, a comfort. The house worries that the two teens will be divided next—half a Paper, half a Bird. It vows to keep them safe as houses.\nCarpeted upstairs hallway means children can run and play in safety.\nPaper grooms her brother’s wings every day, and they grow in strength, though their pristine blackness is occasionally marred by molt. One morning, while finger-combing near his spine, she notices what the house has known for weeks: that several of his primary feathers have been cut about a third of the way down, at sharp angles.\nThat night, she pulls down all thousand of the cranes that roost against her ceiling, littering her floor with their rainbow corpses. The house admires her ingenuity, the trap she’s laid to catch the wing-clipper.\nCrunch, crunch in the dark and Paper leaps up to flick the light-switch. Needle’s outline is a staticky blur, but her sewing shears, poised over one black wing, glisten in the sudden brightness.\nBird wakes in a rage. Before his sister’s eyes, Bird’s features morph into something else, someone the house doesn’t recognize. Surely this nightmare beast can’t be its own winged son? Bird’s face twists into a black beak, his fingers curl into talons, and his feathers beat a furious whirlwind. He lunges at his mother, but she vanishes into white noise.\nDownstairs half-bath for guests.\nTheir mother drifts through the hallways, visible only as a human-shaped distortion in space. Paper watches her mother pace, white-gray ants suffusing the outline of a woman. The house wonders why Needle has not yet returned to her textiles. Bins of crewel, quilting and lace clutter the craft room floor, gathering dust. The house finds this odd, as the craft room is the only space that has yet to be plagued by black holes.\nGlass’s exit left holes strewn everywhere—by the work bench in the garage, in front of the refrigerator, hovering over the couch in the den—and Needle keeps falling into them, a phenomenon that concerns the house. The teens generally avoid the holes, though they’ve accidentally created a few: Their dad has hidden bottles everywhere, and whenever they find one, it implodes into a new hole, reality warping around an empty center.\nOne day, while playing find-the-bottle, Paper catches Bird drinking deep from a fifth of whiskey they’d discovered not a week earlier, one she’d thought had burst into the usual hole. She snatches the bottle from his hand and shatters it against the porcelain sink. Bird’s face begins to elongate into that horrible beak, skin shifting to barbed feathers, hands to scaled talons, as if he’s swallowed a black hole and it’s consuming him from the inside.\nFrom the empty silence surrounding them comes the susurrus of their mother’s presence. Then mother and son are wrestling on the bathroom floor, him a winged, clawed monster, her a disembodied hush and ten fingernails that rake deep red furrows down his biceps. Paper squeezes her eyes shut tight as fists.\nThe house knows the three of them can’t go on like this, wants to help, and does what it can, battening down the insulation to keep in warmth against oncoming winter.\nMaster bathroom features two sinks and a separate shower area.\nPaper arrives home from school to find the dim outline of her mother seated on the bathroom floor, the under-sink cabinet open and a whiskey bottle next to her. Eyes unseeing, Needle’s hands clutch at empty air. A black hole shimmers unreality beneath her. Paper wants to grab her hands and pull her away from the danger, but she’s been here before: If she’s not terribly careful—the house has watched it happen too many times—she’ll be sucked in as well.\nPaper sifts through her mother’s sundry crafting bins until she finds something she thinks will work: a long skein of heavy cord in pale blue. She makes a lasso of cord and loops it over her mother’s shoulders, grips the end, and tugs. Needle tumbles free and the hole blinks out into memory.\nHer mother lies comatose, her outline shimmering, a needle held up to light and turned this way and that so its eye flickers into and out of existence. Needle stares through her daughter, and Paper feels as invisible as she’d ever wished to be. She takes her mother’s cold hand in hers. Gently she loops blue cord around Needle’s bloodless fingers. Round and round it ravels. Paper is painstaking; she threads the skein about her mother’s every limb in ever-tightening circles, tugging the cord taut against her mother’s incorporeal corpus.\nIt takes all day and late into the night for Paper to wind cord, thread, yarn, and string—two full bins of material—around her mother’s body, a body shaped just like her own will be someday. Wrapped up like a spindle or a mummy, Needle can once again be seen. She meets her daughter’s eyes, pupils contracting and expanding in bewilderment.\nNeedle moves around the house more freely after rejoining the land of the visible, stacking boxes of their father’s things in the garage and out of sight, returning to her crafting, even hugging Paper every so often, though Bird still won’t go near her. The house, thrilled to have Needle back, stretches happily through the long wires inside its walls, solid in the surety of their connection to the outside world. The house can appreciate ties that bind.\nSmall attic for extra storage.\nBird’s slept in the attic since his mother’s attempted pinioning. He tugs the pull-down ladder up behind him each night, just to be sure. Skin mottled with brown tufts of downy feather, face craggy with shadow, he hunches his back under the weight of the full-grown wings arcing over his head. Bird has been working, saving up for his great escape, and he’s finally made enough, just six days shy of eighteen.\nPaper’s stolen her mother’s shears; with them, she cuts Bird free of the silvery blue cord binding him to Needle. She holds out a loose twist of yellow embroidery thread, one end attached to the attic furnace. He recoils, hissing, but she pats his arm to reassure him: he’s tied only to his childhood home, not to Needle. His eyes are falcon-hooded; nevertheless, he allows her to encircle his wrist with the thread. It glimmers in sunlight, golden bright and joyful. He stands to his full height, aware that he’s taller now than their father had been. Stretching dark wings, he’s poised to swoop down from the attic window.\nThe house is having none of this. It bares paned-glass teeth and snaps a sill shut on Bird’s boot heel. Bird and Paper cry out, and then she braces herself against the window-frame and yanks upward, and Bird loosens his shoelaces and dives downward, and there’s just his black boot stuck in the house’s craw as he swoops low, then speeds sky-high. Windows rove wild-eyed; doors slam open and shut, enraged. Their father’s frayed red thread is still out on the lawn, its color faded to pink. Paper stares after her brother until the black dot of him winks out against the horizon, yellow thread pulled taut as it spools out thinner and thinner.\nAll through the night, the house growls and shudders like earthquake, terrified that soon it will be plunged into darkness. It’s grown too much like Needle, in her desperation and possessiveness, and too much like Glass, wanting only to be filled. The house’s fears form a yawning black hole that encompasses its plot entirely, as if the earth planned to open like a cellar door and suck the neighborhood underground like a hundred birdhouses perched atop quicksand. The house is immobile and has no means of escape, but it’s seen the family deal with enough such holes to understand their operations.\nThe dog is in a state of advanced decomposition when the house coughs Lucky up from its bowels. It’s swaddled the body in insulation, but that doesn’t much contain the stench; Paper finds the corpse almost immediately. Tugging a sleeve over her nose, she rolls it into the garden with a rusted shovel and leaves it to mulch. By summertime, the remains will be skin and bones and the hydrangea blooms nearby especially lovely.\nPaper walks upstairs to stand before her mirror, turning sideways as if reveling in the acute angles she’s made of her body. Taking one hand in the other, she folds herself in half, then does it again and again and again. By the time the house realizes, long before it can formulate a plan to stop her, she’s disappeared. Her mother finds her that evening, a single sheet of translucent paper, a note explaining what she’s done. Needle and the house are left alone.\nLarge manicured front lawn with mature trees. Please call Arbor Realty to schedule an appointment to view this property.\nA mess of bishop’s weed obscures the walkway. A lattice trestle covered in ivy creeps upward toward the roof’s edge. The house’s eyes are shut, mouth closed and locked up tight. Neighbors who walk past keep on moving; dogs pull their owners across to the other side of the street. The house mutters, settles into its cracked foundation. It monitors the single bright yellow thread that arcs into the distance, waiting for any movement on the line, any sign that its winged boy will soon fly home.\nBrooke Wonders writes fiction that thinks it's true and memoir that thinks it's fabulism. Despite these oxymora, her work has appeared in or is forthcoming from Monkeybicycle, Daily Science Fiction, and Brevity: A Journal of Concise Nonfiction, among others. She is currently a PhD candidate at the University of Illinois at Chicago. A graduate of Clarion UCSD 2011, she shares an urban shoebox with fellow writer and partner in crime James Will Brady.", "source": "https://clarkesworldmagazine.com/wonders_11_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Everything Must Go by Brooke Wonders"}