{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cat Rambo", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "l1zYMSgLmIJSmomZxFnf8jVuFyc=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Subtle Art of Promotion  The old perception of how publishing works goes something like this: the author delivers the finished work to their publisher, goes through a few editing passes, and after that, their responsibility is done, aside from having to appear wherever the publisher or their agent books them. There’s room for the reclusive genius in this model: Elena Ferrante, Thomas Pynchon, J.D. Salinger. Marketing is something the publisher worries about; an author who hires a publicity agency might even be considered a bit of flim-flammer, relying on hype rather than honest work.  I’m not sure how true this perception ever was, however. If you read Robert A. Heinlein’s biography, you find a certain amount of self-promotion there, and he’s not the first writer to try to drum up publicity in order to push a book or even to have pronounced ideas backed by experience about how their work should be marketed. Thomas Disch mentions Isaac Asimov being noted for “beating the drum of his own reputation” in On SF. And it has always been true that on the publisher’s side of things, the economics of the advance play a major part; books with big advances get big publicity budgets, and vice versa. This makes sense; if you invest a great deal in something, you are more willing to spend a little extra to help it succeed.  Over the course of the last century, unfortunately, those advances have not grown with inflation, particularly for smaller writers. The SFWA minimum pro rate is currently six cents, while if we adjusted it to what its original rate would be in buying power today, it would be three or four times that. It has become more and more difficult for writers to make a living at writing; someone can be a New York Times bestseller and still be worrying about supporting a family, particularly given the erratic nature of writers’ finances. Adding to the difficulty are publishers who adopt a throw-everything-at-the-wall-and-see-what-sticks policy, quickly ditching authors who fail to immediately sell significant numbers of books.  Based on my talking to fellow writers and looking at the numbers some of them have been kind enough to supply, it seems as though the indies are doing better than those of their fellows sticking totally to the traditional model. This is primarily because they get 50-70% of the net, instead of the 5-15% allotted them by traditional publishing, while at the same time that industry often seems to hurt writers’ sales of e-books by employing what are, to my mind, unreasonably high prices.  Whether opting for indie, traditional, or hybrid, publicity work on behalf of one’s output is less and less optional on the writer’s side of things for everyone except the top tier writers whose fan bases are so established that the publishers know their books are almost guaranteed to sell. Time and time again I have had writers come to me worried that they must create a social media presence because they’ve been told that they must by their agent or publisher. And it’s true that when acquiring books, some publishers look at a writer’s social media, believing that large followings will lead to greater sales.  You can see this pressure to publicize manifest in one form on Twitter, where writers work at projecting their brand as well as writing. It’s a weird balancing act, where they’re working at writing books people will want to read, but also working at attracting readers who might give them a try based on a quip or observation they’ve posted. Sometimes it feels sincere; other times less so. It is undeniable that a strong social media presence will affect sales, but its effect is generally overestimated, in my opinion. Creating consistently good work that brings readers back to look for more will always be the best strategy—although admittedly not one available immediately out of the authorial starting gate.  The question of whether or not a writer has a strong social media presence pops up with particular emphasis in crowdfunding, where often anthology organizers and editors will expect writers to promote both the crowdfunded effort as well as the publication. Sometimes there will be (sometimes not so) gentle pressure to contribute something for a reward level, such as a Tuckerization, story critique, edit, or something else that takes writerly energy. Yes, it’s in the writer’s best interest to promote anthologies they are in, but the likelihood is that such an anthology represents a small part of their output and a pretty minor sum of money.  This requirement for a social media presence disadvantages a number of writers, unfortunately, who produce fine work but fall short in the social media arena. Such a lack may be due to a number of causes. They may lack resources, such as time and energy. They may not have the marketing knowledge or experience to do it effectively, or they may pattern themselves after bad models.  Others may have disabilities or a specific need for privacy. I know I’m not the only writer who has found that unless you are careful about what you do or don’t put up online, you will run into people whose ideas of boundaries may conflict with your own, to put it mildly, and sometimes that threat can even shade into worries about real life violence or harassment, threats to one’s livelihood, or fallout that affects family or friends.  This need for public promotion has gender implications. Multiple studies have shown that men tend to dominate conversations, and this is true online as well. Women often feel less comfortable with self-promotion, due to worries about being perceived as pushy or domineering. And those who do self-promote sometimes do hit such labels, particularly when women are perceived as having spoken more than they actually did. In one study, male executives who talked more than their peers were perceived as more competent, while the opposite held true for female executives. And sadly, women and young adults are more often the target for online harassment. A 2014 PEW study found that the more intertwined your life is with the Internet, the more likely you are to experience harassment.  This growing pressure on writers to have a public persona represents a real problem, particularly for those who are not naturally extroverted. Recently there’s been a discussion circulating on social media about whether or not it’s okay to write an obligation to publicize an anthology into a contributor’s contract. It’s not, but one can see where a frustrated editor might think it’s a valid step. Is there a remedy for this demand on the writer and if so, what is it? It depends on how we approach the problem.  As readers, we can do some of the work. We can share the word of the stuff we’ve loved on social media and our websites. While authors may want to be careful reviewing fellow authors for a variety of reasons, there are plenty of us who just read in the genres we love so much. Word of mouth remains one of the best publicity vehicles around and freely spreading word of the books that knocked your socks off is not just a service to the authors, but to your fellow readers. And it’s something that eventually benefits you yourself: the more you encourage such practices, the more likely you are to find good new titles from other people’s recommendations.  As authors, we can question expectations and push back when they are unreasonable. Those of us who are extroverts or have established presences can make sure that we’re promoting other work beyond our own, and beyond that, that we’re actively looking for voices for whom such amplification is particularly valuable. We can act as mentors to less experienced writers and provide feedback on what works and what doesn’t as well as encouragement.  Publishers and editors can refrain from imposing possession of a robust social media presence on writers as a qualification. They can also recognize resources and facilitate things as much as possible, providing writers with the information they need, such as how organizations like SFWA can assist with book promotion. Their marketing departments can provide authors with cover and illustration graphics to use, samples of successful books campaigns, and press/blogger contact lists.  The shape of publishing is continuing to change. Many writers have moved to a hybrid model, publishing some work traditionally while using independent publishing or crowdfunding models such as Kickstarter or Patreon. Hybrid forms continue to gain power, creating reader-directed texts, a la the old Choose-Your-Own-Adventure novels, experimental work that can be read in a multiplicity of ways, and games as novels. While the writers with extroverted personalities and a willingness to share much of their lives with fans may still be advantaged, let’s not allow the quieter and more introverted voices become lost as a result. Cat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "text": "Non-Fiction\nAnother Word: The Subtle Art of Promotion\nThe old perception of how publishing works goes something like this: the author delivers the finished work to their publisher, goes through a few editing passes, and after that, their responsibility is done, aside from having to appear wherever the publisher or their agent books them. There’s room for the reclusive genius in this model: Elena Ferrante, Thomas Pynchon, J.D. Salinger. Marketing is something the publisher worries about; an author who hires a publicity agency might even be considered a bit of flim-flammer, relying on hype rather than honest work.\nI’m not sure how true this perception ever was, however. If you read Robert A. Heinlein’s biography, you find a certain amount of self-promotion there, and he’s not the first writer to try to drum up publicity in order to push a book or even to have pronounced ideas backed by experience about how their work should be marketed. Thomas Disch mentions Isaac Asimov being noted for “beating the drum of his own reputation” in On SF. And it has always been true that on the publisher’s side of things, the economics of the advance play a major part; books with big advances get big publicity budgets, and vice versa. This makes sense; if you invest a great deal in something, you are more willing to spend a little extra to help it succeed.\nOver the course of the last century, unfortunately, those advances have not grown with inflation, particularly for smaller writers. The SFWA minimum pro rate is currently six cents, while if we adjusted it to what its original rate would be in buying power today, it would be three or four times that. It has become more and more difficult for writers to make a living at writing; someone can be a New York Times bestseller and still be worrying about supporting a family, particularly given the erratic nature of writers’ finances. Adding to the difficulty are publishers who adopt a throw-everything-at-the-wall-and-see-what-sticks policy, quickly ditching authors who fail to immediately sell significant numbers of books.\nBased on my talking to fellow writers and looking at the numbers some of them have been kind enough to supply, it seems as though the indies are doing better than those of their fellows sticking totally to the traditional model. This is primarily because they get 50-70% of the net, instead of the 5-15% allotted them by traditional publishing, while at the same time that industry often seems to hurt writers’ sales of e-books by employing what are, to my mind, unreasonably high prices.\nWhether opting for indie, traditional, or hybrid, publicity work on behalf of one’s output is less and less optional on the writer’s side of things for everyone except the top tier writers whose fan bases are so established that the publishers know their books are almost guaranteed to sell. Time and time again I have had writers come to me worried that they must create a social media presence because they’ve been told that they must by their agent or publisher. And it’s true that when acquiring books, some publishers look at a writer’s social media, believing that large followings will lead to greater sales.\nYou can see this pressure to publicize manifest in one form on Twitter, where writers work at projecting their brand as well as writing. It’s a weird balancing act, where they’re working at writing books people will want to read, but also working at attracting readers who might give them a try based on a quip or observation they’ve posted. Sometimes it feels sincere; other times less so. It is undeniable that a strong social media presence will affect sales, but its effect is generally overestimated, in my opinion. Creating consistently good work that brings readers back to look for more will always be the best strategy—although admittedly not one available immediately out of the authorial starting gate.\nThe question of whether or not a writer has a strong social media presence pops up with particular emphasis in crowdfunding, where often anthology organizers and editors will expect writers to promote both the crowdfunded effort as well as the publication. Sometimes there will be (sometimes not so) gentle pressure to contribute something for a reward level, such as a Tuckerization, story critique, edit, or something else that takes writerly energy. Yes, it’s in the writer’s best interest to promote anthologies they are in, but the likelihood is that such an anthology represents a small part of their output and a pretty minor sum of money.\nThis requirement for a social media presence disadvantages a number of writers, unfortunately, who produce fine work but fall short in the social media arena. Such a lack may be due to a number of causes. They may lack resources, such as time and energy. They may not have the marketing knowledge or experience to do it effectively, or they may pattern themselves after bad models.\nOthers may have disabilities or a specific need for privacy. I know I’m not the only writer who has found that unless you are careful about what you do or don’t put up online, you will run into people whose ideas of boundaries may conflict with your own, to put it mildly, and sometimes that threat can even shade into worries about real life violence or harassment, threats to one’s livelihood, or fallout that affects family or friends.\nThis need for public promotion has gender implications. Multiple studies have shown that men tend to dominate conversations, and this is true online as well. Women often feel less comfortable with self-promotion, due to worries about being perceived as pushy or domineering. And those who do self-promote sometimes do hit such labels, particularly when women are perceived as having spoken more than they actually did. In one study, male executives who talked more than their peers were perceived as more competent, while the opposite held true for female executives. And sadly, women and young adults are more often the target for online harassment. A 2014 PEW study found that the more intertwined your life is with the Internet, the more likely you are to experience harassment.\nThis growing pressure on writers to have a public persona represents a real problem, particularly for those who are not naturally extroverted. Recently there’s been a discussion circulating on social media about whether or not it’s okay to write an obligation to publicize an anthology into a contributor’s contract. It’s not, but one can see where a frustrated editor might think it’s a valid step. Is there a remedy for this demand on the writer and if so, what is it? It depends on how we approach the problem.\nAs readers, we can do some of the work. We can share the word of the stuff we’ve loved on social media and our websites. While authors may want to be careful reviewing fellow authors for a variety of reasons, there are plenty of us who just read in the genres we love so much. Word of mouth remains one of the best publicity vehicles around and freely spreading word of the books that knocked your socks off is not just a service to the authors, but to your fellow readers. And it’s something that eventually benefits you yourself: the more you encourage such practices, the more likely you are to find good new titles from other people’s recommendations.\nAs authors, we can question expectations and push back when they are unreasonable. Those of us who are extroverts or have established presences can make sure that we’re promoting other work beyond our own, and beyond that, that we’re actively looking for voices for whom such amplification is particularly valuable. We can act as mentors to less experienced writers and provide feedback on what works and what doesn’t as well as encouragement.\nPublishers and editors can refrain from imposing possession of a robust social media presence on writers as a qualification. They can also recognize resources and facilitate things as much as possible, providing writers with the information they need, such as how organizations like SFWA can assist with book promotion. Their marketing departments can provide authors with cover and illustration graphics to use, samples of successful books campaigns, and press/blogger contact lists.\nThe shape of publishing is continuing to change. Many writers have moved to a hybrid model, publishing some work traditionally while using independent publishing or crowdfunding models such as Kickstarter or Patreon. Hybrid forms continue to gain power, creating reader-directed texts, a la the old Choose-Your-Own-Adventure novels, experimental work that can be read in a multiplicity of ways, and games as novels. While the writers with extroverted personalities and a willingness to share much of their lives with fans may still be advantaged, let’s not allow the quieter and more introverted voices become lost as a result.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "source": "https://clarkesworldmagazine.com/another_word_08_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Subtle Art of Promotion by Cat Rambo"}