{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lisa Morton", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "eJuVCML0Wr0TNn94Hi9kBk2kGkM=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Smart Broads and Tough Guys: The Strange World of Vintage Paperbacks  It all started with Lance Casebeer.  In the late 60s, a man with a name that sounded as if it’d come straight from a cheap crime novel started collecting old paperbacks. Casebeer, who’d once been a comic book dealer, traded one expendable pop culture item for another, and in 1976 he started sharing his obsession with other collectors. That was the year he inaugurated Lance-Con, the first annual gathering devoted solely to vintage paperbacks; for the next quarter-of-a-century, Lance-Con would continue to be held in Casebeer’s Portland, Oregon home, drawing up to 200 bibliomaniacs yearly. Most came to buy, trade, or sell, and all came to appreciate Casebeer’s collection, which by 2000 was the only complete collection of all paperbacks published between 1938 and 1968. During these gatherings, the almost-exclusively middle-aged men would spill over into the backyards of Casebeer’s neighbors, exchanging esoteric bits of information on their favorite authors, or arguing whether there were more paperback covers featuring Marilyn Monroe or gorillas (that was a real contest Casebeer had once entered into, and he had the roomful of Monroe books to prove he’d won). Each Lance-Con culminated with a group dinner, usually featuring Casebeer’s notorious purple turkeys, some locally hired entertainers, and a lot of kegs.  Casebeer, who died in 2003, also published a newsletter, Collecting Paperbacks, and probably helped to establish vintage paperbacks—which up until the 80s had been largely ignored by most antiquarian booksellers—as legitimate collectibles. Well, if these little jewels, once considered wholly disposable and featuring authors with names like Vin Packer and Gil Brewer, can be said to have any legitimacy whatsoever.  Actually, the first paperbacks didn’t feature mob punks and covers featuring scantily clad women. The first modern paperback was Pocket Books’ edition of Pearl S. Buck’s The Good Earth; priced at twenty-five cents and pocket-sized, the publisher initially issued the book in a small test run of no more than 2,800 copies. (You can imagine the value of that first printing nowadays—only a handful are known to still exist.) Pocket’s baby step into the paperback market was immensely successful, and it immediately began producing more small paperback versions of some of their bestselling hardbacks.  But Pocket’s early, more serious paperbacks aren’t what eventually drew fans like Casebeer. No, that took a publisher named Gold Medal. Founded in 1950 by Roscoe Kent Fawcett, Gold Medal began as a way for Fawcett to exploit a contractual loophole: His distribution deal with Signet/New American Library prevented him from publishing his own paperbacks, but only if they were reprints. Gold Medal became the first paperback publisher to release exclusively paperback original novels (PBOs), and Gold Medal soon found that there was a huge market hungry for the same kind of film noir crime stories that were packing movie houses. Gold Medal’s stable of authors included many who are now considered the masters of the mystery genre, including John D. MacDonald, David Goodis and Chester Himes.  While there were plenty of other publishers also releasing mystery paperbacks—Pocket, Popular Library, Avon, Dell, Lion, Ace—Gold Medal branded themselves with both a distinctive look and a house style. Aside from dynamic cover art that featured the work of artists such as Robert McGinnis, each Gold Medal book bore a distinctive yellow spine with the logo at the bottom. The books were short, running 125 to 175 pages, with fast-paced plots and plenty of punchy dialogue. Even the back cover copy was exciting: “He was a tall, cleanly attractive young man,” reads the blurbage for Peter Rabe’s 1956 Dig My Grave Deep, “the kind you’d like to have for a neighbor. Press the right button and he’d mow you down with the ruthlessness of a Sherman tank.”  One of Gold Medal’s most successful lines, however, wasn’t the macho mystery but the lesbian drama. In their first year of business they had a smash hit with a book called Women’s Barracks, which sold over four million copies. In 1952 they published Spring Fire, a book now canonized as an early lesbian classic. Its author, Vin Packer, published plenty of other books with Gold Medal, most with titles like Come Destroy Me and The Thrill Kids. What his readers at the time didn’t know was that Vin was actually Marijane Meaker, a lesbian who’d once had a two-year affair with mystery writer Patricia Highsmith. Along with Ann Bannon’s series of novels following a young woman with the unlikely name of Beebo Brinker, Meaker’s books paved the way for later feminist and lesbian authors.  Meaker was hardly the only author employing a pseudonym, though. By the late 50s, paperback originals were firmly established and many writers dipped their toes in the water courtesy of pseudonyms, usually employed on “sleaze” or soft-core porn novels. One of the most sought-after vintage paperbacks now is a hot number called Sex Gang, credited to one Paul Merchant—who was actually Harlan Ellison (Ellison has been known to buy copies of the book and tear them up in front of the dealer he’s just paid). Donald Westlake was only one of several authors who wrote sleaze novels for the “Midnight Reader” series under the name Alan Marshall. Robert Silverberg used Don Elliott, and even horror master Dennis Etchison got into the swing with a late 60s porn novel credited to the punny-if-not-funny moniker Ben Dover.  While Gold Medal had the lock on the crime and lesbian markets, other paperback publishers were doing well with science fiction, westerns, and romance. Kurt Vonnegut, Jr. and Philip K. Dick are now darlings of the literati, but both started writing science fiction paperbacks. Dick’s early books often appeared in one of the more unusual paperback lines, the Ace Doubles. These hefty volumes gave readers “Two Complete Novels for 35¢” as the covers proclaimed with two novels bound in opposite directions; flip it over and you got a second front cover. As with Gold Medal, Ace employed some top-notch artists, including Kelly Freas, and the books were guaranteed to at least be eye-catching.  If the Ace books offered a great deal in terms of quantity, the quality sometimes left something to be desired. Modern collectors, for example, are likely to purchase something like, say, Ace Doubles D-193 for the first appearance of Dick’s The Man Who Japed (1956). E. C. Tubb’s The Space-Born, the other novel in the double, generally fails to impress.  Those publisher-assigned serial numbers are a crucial part of paperbacks to their hardcore fan base. Some collectors, like Casebeer, go for complete lines; a perusal of their shelves will turn up rows of clean, bagged paperbacks, their spines reflecting a perfect numerical sequence. Other collectors take a more personal approach, though: They might collect particular authors, cover artists, or even themes. Got a kink for needles? You can put together a fairly substantial collection of vintage paperbacks featuring hypodermics on their covers. Nurses? Bondage? Good girls? Even gorillas.  There’s some dispute among collectors about the end run of vintage paperbacks. DreamHaven Books’ owner and vintage paperback dealer Greg Ketter notes that some of the more valuable paperbacks actually come from the 1970s. “Print runs in the 50s and 60s were astronomical compared to now;100,000 was not an unusually high run,” he says. “That’s one reason you find more books from that period than from the late 70s and throughout the 80s and beyond, where runs have gone as low as 10,000. Some books from the 70s and 80s are among the scarcest of titles.” Most experts cite 1968 or 1969 as the end of the vintage paperback age.  As with comic book hoarders, vintage paperback collectors are fanatics for condition, and listening to them talk can be a disconcerting experience for the novice or total outsider. “It’s got a creased spine, wraps are pulling from the block of the book,” can spell the end of a potential deal. Serious collectors seal their prizes in archival bags, store them away from sunlight, and may even have special shelves built to house their collections. Although paperbacks don’t yet employ the complicated numerical grading scheme used for comic books, the obsession with condition is similar; the more disposable a product once was, the more modern collectors will prize condition of that product.  Disposable though they may once have been, it’s now almost impossible to overestimate the influence of vintage paperbacks on everything from the science fiction novel to academic gender studies. Sure, most literary critics are never going to accord William Faulkner’s paperback-penning brother John the same kudos (despite the fact that John’s bibliography includes the delightful titles Uncle Good’s Girls and The Sin Shouter of Cabin Road), but bestselling authors like Walter Mosley freely acknowledge the importance of some of the early paperback writers. Mosley has often cited the work of Chester Himes, one of the few African American authors working in the largely white world of 50s paperbacks. Tom Piccirilli, a contemporary writer whose own work has moved away from horror and more into crime fiction, is such a fan of vintage hardboiled paperbacks that he recently set up an online forum, “The Big Adios”, to discuss his passion with other devotees. Piccirilli is heavily influenced by David Goodis, saying that, “Goodis . . . taught me how to weave a significant atmosphere of despair into the action of the work.”  Some fans have taken their love in different professional directions. Witness, for example, publisher Hard Case Crime. The founders of Hard Case, Charles Ardai and Max Phillips, had been the CEO and art director (respectively) of the Internet company Juno; when Juno merged with another company and left Ardai and Phillips free to pursue other ventures, a few drinks and a discussion of favorite vintage paperbacks led to the idea behind Hard Case. They published their first book (Grifter’s Game by Lawrence Block) in 2004, and since then have published a mix of reprints and PBOs, all in the hardboiled mystery genre.  Their method of choosing what they reprint is simple: “I have several thousand old paperbacks on my shelves at home,” Ardai told me, “and I’ve read most of them; the ones I remember—and remember loving—years after first having read them are the ones I pursue as reprints.” Ardai and Phillips even went after the classic vintage paperback cover artists, and several of their releases have featured art by the iconic Robert McGinnis “It’s like having your meals cooked by one of the world’s master chefs,” Ardai says of working with McGinnis.  Hard Case recently published their first book by a female author, Christa Faust’s Money Shot. Faust’s book knowingly riffs on the genre’s tropes—a bag full of stolen money, shoot-outs and hideouts, a smart broad and a tough guy—except in Money Shot the smart broad, a former porn star named Angel Dare, is the protagonist.  Women and people of color have a strange and politically incorrect history in the vintage paperbacks, despite the success of the lesbian novels. The tough-guy stereotype of the 50s usually came with plenty of prejudice. Ardai notes that some of Erle Stanley Gardner’s books, for example, “were marred by unfortunate racist portrayals of servants and such.” A new breed of writers—including Faust, Mosley, Megan Abbott and Vicki Hendricks—have begun to appropriate some of the genre’s tropes and reconfigure them for a new century. According to Faust, “We’re making the genre our own, taking tired gender stereotypes like the ‘femme fatale’ and turning them inside out, telling dark, hardboiled stories from a uniquely female perspective.”  Women aren’t the only group that may be discovering (or re-discovering) the excitement of vintage paperbacks now; they’ve also started to make their way into the rarified world of academia. A number of university libraries feature special paperback collections. In fact, Casebeer had hoped that a university would take his collection, although it mostly ended up piecemealed out. The Special Collections Division of the University of Saskatchewan holds a substantial catalog of gay, lesbian and transgender-themed vintage paperbacks; the University of Delaware has a vintage paperback science fiction collection.  And then of course there’s the business side. Where just a few years ago supercollectors like Casebeer were touting the affordability of paperbacks to beginners, their value has evolved well beyond their original two-bits price tag. Want a copy of Fredric Brown’s 1951 Dell release The Case of the Dancing Sandwiches? Be prepared to fork over five C-notes for a pristine copy, if you can even find one. Even so-so copies of books by lesser-known authors now routinely fetch twenty bucks and up. Although there are only a handful of brick-and-mortar retail stores across the country specializing in vintage paperbacks—Kayo Books in San Francisco is the best-known, although the waiting-room-sized Always First in North Hollywood is a favored spot for Southern California collectors—there are dozens of online dealers, many of whom also put out newsletters, guides, and informative websites.  Why vintage paperbacks? What is it about these yellowing tomes that leave booklovers panting after them like a jilted detective after a stripper? Ultimately, despite fancy cover art, inflated prices and even, as Christa Faust notes the tactile pleasure of “that musty old foxed paper smell”, it has to come back to the writing. Hard Case’s Ardai sums it up: “Lean, gripping stories, told with (and often written at) ferocious velocity.” Post-Tarantino, these books—with their machine-gun chatter and twisting plots—feel somehow new and relevant again. With contemporary New York publishers insisting on bloated epics that seem to exist only to justify a ten-dollar price tag for a paperback, the stripped-down, bare-knuckles style of vintage paperbacks offers an exhilarating alternative.  Oh yeah, and—as Casebeer understood all too well—they really do look pretty nice lined up on a custom-made shelf. A reformed screenwriter, Lisa Morton is now the proud author of three books of nonfiction (The Cinema of Tsui Hark, The Halloween Encyclopedia and A Halloween Anthology). Her short fiction has been published in numerous books and magazines; recent and forthcoming appearances include the anthologies Winter Frights, Unspeakable Horror: From the Shadows of the Closet, The Living Dead and Midnight Premiere. Lisa won the 2006 Bram Stoker Award for Short Fiction, and she currently lives in North Hollywood with Henry the Red from Army of Darkness.", "text": "Non-Fiction\nSmart Broads and Tough Guys: The Strange World of Vintage Paperbacks\nIt all started with Lance Casebeer.\nIn the late 60s, a man with a name that sounded as if it’d come straight from a cheap crime novel started collecting old paperbacks. Casebeer, who’d once been a comic book dealer, traded one expendable pop culture item for another, and in 1976 he started sharing his obsession with other collectors. That was the year he inaugurated Lance-Con, the first annual gathering devoted solely to vintage paperbacks; for the next quarter-of-a-century, Lance-Con would continue to be held in Casebeer’s Portland, Oregon home, drawing up to 200 bibliomaniacs yearly. Most came to buy, trade, or sell, and all came to appreciate Casebeer’s collection, which by 2000 was the only complete collection of all paperbacks published between 1938 and 1968. During these gatherings, the almost-exclusively middle-aged men would spill over into the backyards of Casebeer’s neighbors, exchanging esoteric bits of information on their favorite authors, or arguing whether there were more paperback covers featuring Marilyn Monroe or gorillas (that was a real contest Casebeer had once entered into, and he had the roomful of Monroe books to prove he’d won). Each Lance-Con culminated with a group dinner, usually featuring Casebeer’s notorious purple turkeys, some locally hired entertainers, and a lot of kegs.\nCasebeer, who died in 2003, also published a newsletter, Collecting Paperbacks, and probably helped to establish vintage paperbacks—which up until the 80s had been largely ignored by most antiquarian booksellers—as legitimate collectibles. Well, if these little jewels, once considered wholly disposable and featuring authors with names like Vin Packer and Gil Brewer, can be said to have any legitimacy whatsoever.\nActually, the first paperbacks didn’t feature mob punks and covers featuring scantily clad women. The first modern paperback was Pocket Books’ edition of Pearl S. Buck’s The Good Earth; priced at twenty-five cents and pocket-sized, the publisher initially issued the book in a small test run of no more than 2,800 copies. (You can imagine the value of that first printing nowadays—only a handful are known to still exist.) Pocket’s baby step into the paperback market was immensely successful, and it immediately began producing more small paperback versions of some of their bestselling hardbacks.\nBut Pocket’s early, more serious paperbacks aren’t what eventually drew fans like Casebeer. No, that took a publisher named Gold Medal. Founded in 1950 by Roscoe Kent Fawcett, Gold Medal began as a way for Fawcett to exploit a contractual loophole: His distribution deal with Signet/New American Library prevented him from publishing his own paperbacks, but only if they were reprints. Gold Medal became the first paperback publisher to release exclusively paperback original novels (PBOs), and Gold Medal soon found that there was a huge market hungry for the same kind of film noir crime stories that were packing movie houses. Gold Medal’s stable of authors included many who are now considered the masters of the mystery genre, including John D. MacDonald, David Goodis and Chester Himes.\nWhile there were plenty of other publishers also releasing mystery paperbacks—Pocket, Popular Library, Avon, Dell, Lion, Ace—Gold Medal branded themselves with both a distinctive look and a house style. Aside from dynamic cover art that featured the work of artists such as Robert McGinnis, each Gold Medal book bore a distinctive yellow spine with the logo at the bottom. The books were short, running 125 to 175 pages, with fast-paced plots and plenty of punchy dialogue. Even the back cover copy was exciting: “He was a tall, cleanly attractive young man,” reads the blurbage for Peter Rabe’s 1956 Dig My Grave Deep, “the kind you’d like to have for a neighbor. Press the right button and he’d mow you down with the ruthlessness of a Sherman tank.”\nOne of Gold Medal’s most successful lines, however, wasn’t the macho mystery but the lesbian drama. In their first year of business they had a smash hit with a book called Women’s Barracks, which sold over four million copies. In 1952 they published Spring Fire, a book now canonized as an early lesbian classic. Its author, Vin Packer, published plenty of other books with Gold Medal, most with titles like Come Destroy Me and The Thrill Kids. What his readers at the time didn’t know was that Vin was actually Marijane Meaker, a lesbian who’d once had a two-year affair with mystery writer Patricia Highsmith. Along with Ann Bannon’s series of novels following a young woman with the unlikely name of Beebo Brinker, Meaker’s books paved the way for later feminist and lesbian authors.\nMeaker was hardly the only author employing a pseudonym, though. By the late 50s, paperback originals were firmly established and many writers dipped their toes in the water courtesy of pseudonyms, usually employed on “sleaze” or soft-core porn novels. One of the most sought-after vintage paperbacks now is a hot number called Sex Gang, credited to one Paul Merchant—who was actually Harlan Ellison (Ellison has been known to buy copies of the book and tear them up in front of the dealer he’s just paid). Donald Westlake was only one of several authors who wrote sleaze novels for the “Midnight Reader” series under the name Alan Marshall. Robert Silverberg used Don Elliott, and even horror master Dennis Etchison got into the swing with a late 60s porn novel credited to the punny-if-not-funny moniker Ben Dover.\nWhile Gold Medal had the lock on the crime and lesbian markets, other paperback publishers were doing well with science fiction, westerns, and romance. Kurt Vonnegut, Jr. and Philip K. Dick are now darlings of the literati, but both started writing science fiction paperbacks. Dick’s early books often appeared in one of the more unusual paperback lines, the Ace Doubles. These hefty volumes gave readers “Two Complete Novels for 35¢” as the covers proclaimed with two novels bound in opposite directions; flip it over and you got a second front cover. As with Gold Medal, Ace employed some top-notch artists, including Kelly Freas, and the books were guaranteed to at least be eye-catching.\nIf the Ace books offered a great deal in terms of quantity, the quality sometimes left something to be desired. Modern collectors, for example, are likely to purchase something like, say, Ace Doubles D-193 for the first appearance of Dick’s The Man Who Japed (1956). E. C. Tubb’s The Space-Born, the other novel in the double, generally fails to impress.\nThose publisher-assigned serial numbers are a crucial part of paperbacks to their hardcore fan base. Some collectors, like Casebeer, go for complete lines; a perusal of their shelves will turn up rows of clean, bagged paperbacks, their spines reflecting a perfect numerical sequence. Other collectors take a more personal approach, though: They might collect particular authors, cover artists, or even themes. Got a kink for needles? You can put together a fairly substantial collection of vintage paperbacks featuring hypodermics on their covers. Nurses? Bondage? Good girls? Even gorillas.\nThere’s some dispute among collectors about the end run of vintage paperbacks. DreamHaven Books’ owner and vintage paperback dealer Greg Ketter notes that some of the more valuable paperbacks actually come from the 1970s. “Print runs in the 50s and 60s were astronomical compared to now;100,000 was not an unusually high run,” he says. “That’s one reason you find more books from that period than from the late 70s and throughout the 80s and beyond, where runs have gone as low as 10,000. Some books from the 70s and 80s are among the scarcest of titles.” Most experts cite 1968 or 1969 as the end of the vintage paperback age.\nAs with comic book hoarders, vintage paperback collectors are fanatics for condition, and listening to them talk can be a disconcerting experience for the novice or total outsider. “It’s got a creased spine, wraps are pulling from the block of the book,” can spell the end of a potential deal. Serious collectors seal their prizes in archival bags, store them away from sunlight, and may even have special shelves built to house their collections. Although paperbacks don’t yet employ the complicated numerical grading scheme used for comic books, the obsession with condition is similar; the more disposable a product once was, the more modern collectors will prize condition of that product.\nDisposable though they may once have been, it’s now almost impossible to overestimate the influence of vintage paperbacks on everything from the science fiction novel to academic gender studies. Sure, most literary critics are never going to accord William Faulkner’s paperback-penning brother John the same kudos (despite the fact that John’s bibliography includes the delightful titles Uncle Good’s Girls and The Sin Shouter of Cabin Road), but bestselling authors like Walter Mosley freely acknowledge the importance of some of the early paperback writers. Mosley has often cited the work of Chester Himes, one of the few African American authors working in the largely white world of 50s paperbacks. Tom Piccirilli, a contemporary writer whose own work has moved away from horror and more into crime fiction, is such a fan of vintage hardboiled paperbacks that he recently set up an online forum, “The Big Adios”, to discuss his passion with other devotees. Piccirilli is heavily influenced by David Goodis, saying that, “Goodis . . . taught me how to weave a significant atmosphere of despair into the action of the work.”\nSome fans have taken their love in different professional directions. Witness, for example, publisher Hard Case Crime. The founders of Hard Case, Charles Ardai and Max Phillips, had been the CEO and art director (respectively) of the Internet company Juno; when Juno merged with another company and left Ardai and Phillips free to pursue other ventures, a few drinks and a discussion of favorite vintage paperbacks led to the idea behind Hard Case. They published their first book (Grifter’s Game by Lawrence Block) in 2004, and since then have published a mix of reprints and PBOs, all in the hardboiled mystery genre.\nTheir method of choosing what they reprint is simple: “I have several thousand old paperbacks on my shelves at home,” Ardai told me, “and I’ve read most of them; the ones I remember—and remember loving—years after first having read them are the ones I pursue as reprints.” Ardai and Phillips even went after the classic vintage paperback cover artists, and several of their releases have featured art by the iconic Robert McGinnis “It’s like having your meals cooked by one of the world’s master chefs,” Ardai says of working with McGinnis.\nHard Case recently published their first book by a female author, Christa Faust’s Money Shot. Faust’s book knowingly riffs on the genre’s tropes—a bag full of stolen money, shoot-outs and hideouts, a smart broad and a tough guy—except in Money Shot the smart broad, a former porn star named Angel Dare, is the protagonist.\nWomen and people of color have a strange and politically incorrect history in the vintage paperbacks, despite the success of the lesbian novels. The tough-guy stereotype of the 50s usually came with plenty of prejudice. Ardai notes that some of Erle Stanley Gardner’s books, for example, “were marred by unfortunate racist portrayals of servants and such.” A new breed of writers—including Faust, Mosley, Megan Abbott and Vicki Hendricks—have begun to appropriate some of the genre’s tropes and reconfigure them for a new century. According to Faust, “We’re making the genre our own, taking tired gender stereotypes like the ‘femme fatale’ and turning them inside out, telling dark, hardboiled stories from a uniquely female perspective.”\nWomen aren’t the only group that may be discovering (or re-discovering) the excitement of vintage paperbacks now; they’ve also started to make their way into the rarified world of academia. A number of university libraries feature special paperback collections. In fact, Casebeer had hoped that a university would take his collection, although it mostly ended up piecemealed out. The Special Collections Division of the University of Saskatchewan holds a substantial catalog of gay, lesbian and transgender-themed vintage paperbacks; the University of Delaware has a vintage paperback science fiction collection.\nAnd then of course there’s the business side. Where just a few years ago supercollectors like Casebeer were touting the affordability of paperbacks to beginners, their value has evolved well beyond their original two-bits price tag. Want a copy of Fredric Brown’s 1951 Dell release The Case of the Dancing Sandwiches? Be prepared to fork over five C-notes for a pristine copy, if you can even find one. Even so-so copies of books by lesser-known authors now routinely fetch twenty bucks and up. Although there are only a handful of brick-and-mortar retail stores across the country specializing in vintage paperbacks—Kayo Books in San Francisco is the best-known, although the waiting-room-sized Always First in North Hollywood is a favored spot for Southern California collectors—there are dozens of online dealers, many of whom also put out newsletters, guides, and informative websites.\nWhy vintage paperbacks? What is it about these yellowing tomes that leave booklovers panting after them like a jilted detective after a stripper? Ultimately, despite fancy cover art, inflated prices and even, as Christa Faust notes the tactile pleasure of “that musty old foxed paper smell”, it has to come back to the writing. Hard Case’s Ardai sums it up: “Lean, gripping stories, told with (and often written at) ferocious velocity.” Post-Tarantino, these books—with their machine-gun chatter and twisting plots—feel somehow new and relevant again. With contemporary New York publishers insisting on bloated epics that seem to exist only to justify a ten-dollar price tag for a paperback, the stripped-down, bare-knuckles style of vintage paperbacks offers an exhilarating alternative.\nOh yeah, and—as Casebeer understood all too well—they really do look pretty nice lined up on a custom-made shelf.\nA reformed screenwriter, Lisa Morton is now the proud author of three books of nonfiction (The Cinema of Tsui Hark, The Halloween Encyclopedia and A Halloween Anthology). Her short fiction has been published in numerous books and magazines; recent and forthcoming appearances include the anthologies Winter Frights, Unspeakable Horror: From the Shadows of the Closet, The Living Dead and Midnight Premiere. Lisa won the 2006 Bram Stoker Award for Short Fiction, and she currently lives in North Hollywood with Henry the Red from Army of Darkness.", "source": "https://clarkesworldmagazine.com/morton_07_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Smart Broads and Tough Guys: The Strange World of Vintage Paperbacks by Lisa Morton"}