{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Y9u2h6FwIbn/195GWjjwiDDmc5M=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Secret Project!  I’ve been working on a secret project. Time to tell.  Clarkesworld has always tried to cast a wide net in its search for stories. In recent years, thanks to the amazing efforts of Ken Liu and John Chu, we accomplished a long-desired goal of acquiring stories in translation. In April, I was presented with an opportunity to take our work in this area to the next level.  I am pleased to announce that Clarkesworld has entered into an agreement with Storycom International Culture Communication Co., Ltd. to showcase a short story originally published in Chinese in every issue. Each month, an all-star team of professionals intricately familiar with Chinese short fiction will be recommending stories for this special feature and I’ll select which ones get translated and published in each issue. This team includes:  \r\n Liu Cixin—the most-famous science fiction writer in China and author of the THREE BODY TRILOGY  Yao Haijun—Editor-in-Chief of Science Fiction World  Zhang Zhilu—Scriptwriter at the China Film Group Corporation and one of the pioneering scriptwriters of science fiction movies in China  Wu Yan—a Doctoral Supervisor for the Science Fiction Literature major at Beijing Normal University and President of World Chinese Science Fiction Association  Ken Liu—Award-winning American science fiction writer  As it stands, our goal is to launch this new endeavor without giving up any of the existing fiction slots, including the extra story our Patreon supporters recently unlocked. To cover the additional cost of this content, we’re going to need your support. Later this month, I intend to launch a Kickstarter campaign to cover the costs of the inaugural year: three stories in the first six months—our ramp-up period—and six stories in the following six months.  A project like this is perfect for Kickstarter. No one has tried to make translation a regular element of a genre magazine before, and that’s something I hope will be exciting to readers both domestic and international. My previous Kickstarter project—funding Upgraded, which goes on sale later this month—was very educational and provided me with the experience and confidence I’ll need to succeed with this campaign. I feel rather strongly that Kickstarter should only be used to launch new initiatives and projects, so during that first year, we’ll be focused on increasing our subscriber base to continue the program indefinitely.  I’d love to hear your initial thoughts. Obviously I’m excited about this opportunity. I hope that you are, too.  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Secret Project!\nI’ve been working on a secret project. Time to tell.\nClarkesworld has always tried to cast a wide net in its search for stories. In recent years, thanks to the amazing efforts of Ken Liu and John Chu, we accomplished a long-desired goal of acquiring stories in translation. In April, I was presented with an opportunity to take our work in this area to the next level.\nI am pleased to announce that Clarkesworld has entered into an agreement with Storycom International Culture Communication Co., Ltd. to showcase a short story originally published in Chinese in every issue. Each month, an all-star team of professionals intricately familiar with Chinese short fiction will be recommending stories for this special feature and I’ll select which ones get translated and published in each issue. This team includes:\n- Liu Cixin—the most-famous science fiction writer in China and author of the THREE BODY TRILOGY\n- Yao Haijun—Editor-in-Chief of Science Fiction World\n- Zhang Zhilu—Scriptwriter at the China Film Group Corporation and one of the pioneering scriptwriters of science fiction movies in China\n- Wu Yan—a Doctoral Supervisor for the Science Fiction Literature major at Beijing Normal University and President of World Chinese Science Fiction Association\n- Ken Liu—Award-winning American science fiction writer\nAs it stands, our goal is to launch this new endeavor without giving up any of the existing fiction slots, including the extra story our Patreon supporters recently unlocked. To cover the additional cost of this content, we’re going to need your support. Later this month, I intend to launch a Kickstarter campaign to cover the costs of the inaugural year: three stories in the first six months—our ramp-up period—and six stories in the following six months.\nA project like this is perfect for Kickstarter. No one has tried to make translation a regular element of a genre magazine before, and that’s something I hope will be exciting to readers both domestic and international. My previous Kickstarter project—funding Upgraded, which goes on sale later this month—was very educational and provided me with the experience and confidence I’ll need to succeed with this campaign. I feel rather strongly that Kickstarter should only be used to launch new initiatives and projects, so during that first year, we’ll be focused on increasing our subscriber base to continue the program indefinitely.\nI’d love to hear your initial thoughts. Obviously I’m excited about this opportunity. I hope that you are, too.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_09_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Secret Project! by Neil Clarke"}