{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "WuKN7t28y7HkA6uJvq4//1Unuxo=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Miles . . . to Go: A Conversation with Lauren Beukes  International bestselling author Lauren Beukes grew up in Johannesburg, South Africa. She attended Roedean School in Johannesburg, earned an MA in creative writing from the University of Cape Town, and spent a decade as a freelance journalist working in South Africa and the US, covering electricity cable thieves, HIV+ beauty pageants, metro cops, and homeless sex workers.  Her work has appeared in publications such as Elle, Marie Claire, The Hollywood Reporter, and The Sunday Times. She directed Glitterboys & Ganglands, a documentary that won Best LGBT Film at the San Diego Black Film Festival, and was showrunner and head writer on South Africa’s first half-hour animated TV show, Pax Afrika, which ran for one hundred and four episodes. Her comic books include original horror series Survivors’ Club with Dale Halvorsen and Ryan Kelly; Fairest: The Hidden Kingdom, a Japanese horror remix of Rapunzel, with artist Inaki; as well as The Problem with Cats, a Wonder Woman short set in Soweto, with Mike Maihack.  Beukes began publishing short fiction in 2004. Her novels have been published in twenty-four countries and are being adapted for film and TV. Debut novel Moxyland came out in 2008. This was followed by Zoo City in 2010, which was a finalist for the World Fantasy and Crawford awards and won both a Kitschies Red Tentacle and an Arthur C. Clarke Award. The Shining Girls won the August Derleth Award for Best Horror Novel, the University of Johannesburg Prize, and the Strand Critics Choice Award for Best Mystery Novel. 2014’s Broken Monsters was a Shirley Jackson nominee, and a 2016 collection Slipping was on the Locus Recommended Reading list. She also wrote nonfiction book Maverick: Extraordinary Women from South Africa’s Past. She was a finalist for the Campbell Award for Best New Writer in 2011. Her latest novel is Afterland.  Besides writing stunning novels, Beukes has given talks on storytelling at tech conferences and literary festivals around the world, including Design Indaba, TEDxJohannesburg, Webstock, and D-Construct. Lauren has also spearheaded charity art show fundraisers for all her books, raising R100 000 for Rape Crisis and R350 000 for kids lit org, Book Dash.  Lauren Beukes lives in Cape Town, South Africa with her daughter “and two trouble cats.”   What were the books you grew up reading? What stands out as important in your memory and why?  I loved the Usborne Greek mythology books and fairy tales and Joan Aiken and Roald Dahl. I had a fondness for magic and justice where the terrible people got their comeuppance. As a young teen, my dad got me into Anne McCaffrey and Philip K. Dick, my mom got me into ElfQuest and Dragonlance, and 2000 AD Monthly was a formative comics influence. The punk aesthetic, the stories about police states or mutants treated as lesser citizens, resonated as I became more politically engaged and aware of our own racist regime under apartheid.  You started publishing in 2004 and had your debut novel in 2008—Moxyland. Before that, you were a journalist. Did you struggle to break into fiction, or did it happen for you right away?  Oh man, I’m laughing over here. I’d published a couple of short stories locally in South Africa and a pop history about maverick South African women, which was a commission, but Moxyland took me four years to write while working full time as a journalist and lecturing at the University of Cape Town, and it took me a year of rejections to sell it. One of those was from Philip K. Dick’s agent who compared it to having sex on a skateboard, which is apparently a bad thing? I mean, surely, as long as you’re not falling off . . . ?  Finally, I sent it to a local publisher, Jacana, who has an eye for new talent. The publishing director Maggie Davey read it on the plane en route to the Frankfurt Book Fair and by the time she landed in Germany, I had a book deal! Thank god for eleven-hour flights! It was published in South Africa to good reviews and then disappeared without a trace, as so many novels do, but by that time I’d managed to sell it to Angry Robot in the UK as part of a two book deal for 8000 GBP. The second book I had in mind was a noir set in a magical Johannesburg where a young woman with a sloth on her back takes a break from writing email scams and finding lost objects to take on the case of a missing teenage pop star. It became Zoo City, which won the Arthur C. Clarke Award and that changed my whole career. It put me in the spotlight and I happened to have a great idea for a new novel, about a time traveling serial killer and the survivor who turns the hunt around, that also explores misogyny, the loops of history, and feminism in the twentieth Century.  You’ve done several comic books at major houses, including Wonder Woman for DC. How did you break into that industry, and what do you enjoy most about working on comic books?  I was championed first by Bill Willingham, who I met at Worldcon in Toronto, and then legendary Vertigo editor Shelly Bond. Shelly gave me a shot on an eight pager, which was my audition script for a larger project, writing a six parter set in the Fables universe, which became Fairest: The Hidden Kingdom, a J horror take on Rapunzel, with Inaki and Eva de la Cruz. I contributed some other shorts, including a Wonder Woman story set in Soweto, The Trouble with Cats with Mike Maihack. In 2014, I landed an original horror series, Survivors’ Club, based on a concept by my dear friend and cowriter, Dale Halvorsen, with art by Ryan Kelly and Inaki.  I love the collaboration of comics, how the art and the colors and the lettering too can change the shape of the thing, give you a different perspective on the characters or shift the dialogue. It’s such a communal art form.  Are there important differences between writing for comic books and writing short stories or novels?  In fiction, the whole world is on your shoulders, you have to hold it together. Comics is liberating because it’s collaborative, the art does more than half the work. Novels are all-consuming hellbeasts that will eat my life for a year, short stories are only hellkittens, although they always take me longer than I intended. Both allow me to indulge my love of dialogue, which I have to put hard limits on when writing comics.  Have you learned things from writing comics that you’ve applied to stories or novels?  I learned a lot from being the showrunner on South Africa’s first half-hour animated TV series, URBO: The Adventures of Pax Afrika in 2005–2009. You’re writing for kids, you’ve got twenty-four minutes to tell a whole story, so every scene has to do the work, either building on character or unfolding the plot, and ideally both. Get in and out as fast as possible, don’t waste time. It taught me to think very visually, because someone was going to have to animate what I wrote, keep dialogue taut and moving along, and to write action, which doesn’t come naturally to me.  You write in short fiction and novel length and slip across genres—do you feel like there are certain specific characteristics or themes that usually show up in your stories?  I’m interested in intersectionality, in psychogeographies, and how we’re haunted by history. I’m interested in how we can strive to be better people in the darkest of times, how it’s okay to make mistakes, if you take accountability, learn from them. The intersectional feminism is strong in my work, I hope.  Afterland is described as a thriller and you are well-known for writing thrillers. What are the most important keys to writing effective, taut thrillers?  Gosh, I don’t have a formula. I write what I’d like to read. I’m interested in putting my characters in terrible situations and seeing how they come out the other side, not wasting time, keeping it taut and moving. I always write in present tense, which gives me a sense of urgency, and mystery.  Cole and her son, Miles, and their relationship, are at the heart of Afterland. What are your favorite things about these characters, and what was the most challenging thing about writing them?  They’re both very witty, sometimes caustically with each other when they’re exasperated or under pressure, but that banter is part of their love language. I admire Cole’s ferocity, and how she’s trying to do the right thing and course corrects when she makes a mistake (and she makes some very bad mistakes). There’s a line that sums her up for me, “parenting is the worst game of improv ever.” At twelve years old, Miles is coming into himself, figuring out who he is, and part of that is in reaction to his mom, which puts him in a dangerous position that could wreck everything for both of them.  Challenging? Keeping them on track but also allowing them to be themselves, do the wrong thing, feel resentful or frustrated, and dig into this relationship, which is by no means perfect, and in terrible circumstances.  In your PEN Ten interview, you were asked “What is the responsibility of the writer?” you said it was “to ask hard questions, which you don’t necessarily have the answers to . . . ” What are some of the most pressing questions you attempt to ask in Afterland?  I wanted to gender flip the idea of the teenage girl in peril, how we sexualize girls, treat them as commodities and reproductive resources. Suddenly it’s Miles facing dehumanizing objectification, more important for what’s between his legs than who he is as a person. I wanted to interrogate the idea of a world-without-men being a gentler, kinder place, and this notion that women are inherently good and nurturing, because of course we aren’t. Because, surprise, we’re fully human, just as self-interested, corruptible, power hungry, and capable of terrible acts as men. Would there be less violence, yes, but the problems are the problems and they’re deeply embedded in our society.  Are there specific challenges to writing this narrative, or is it as simple as writing the characters and roles that you wanted to, and it happened to be a wonderfully feminist story?  That was all intentional, but I just wrote the story I wanted to. I did waste a lot of time trying to make the villain a man and it wasn’t working. It was only when I introduced the narcissist sister that the narrative fell into place.  Afterland is a near-future apocalyptic vision, with a speculative premise around a disease nearly wiping out men. The publisher, Mulholland, labels it as “Mystery & Thriller/Fiction/Thrillers/ Suspense,” only acknowledging the science fiction as an element blended into the rest. Is it important to call this work speculative fiction, or science fiction, or thriller? Do these labels carry a relevance that speak to the true nature of the narrative? Or are they just sales tactics?  I’m not a huge fan of labels. I understand marketing needs them and that publishing is a business and that it can be very useful for readers to find more of what they love, speaking as someone who used to have to get my science fiction and fantasy through a specialty mail order company when I was in my teens, because the bookstores in South Africa in the nineties only stocked the big names and had a single lonely shelf devoted to genre. I write the books I want to write. I’m not overly vested in how people want to categorize them. Please call it whatever makes you happy.  What are you working on now, what do you have coming up that fans can look forward to?  I’m pitching some TV projects with friends and I’ve started in on a new novel, although the writing is slow in lockdown life, with the generalized anxiety of the pandemic, and the specificities, and the hours lost to supervising my eleven year old Zoom-schooling from home. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nMiles . . . to Go: A Conversation with Lauren Beukes\nInternational bestselling author Lauren Beukes grew up in Johannesburg, South Africa. She attended Roedean School in Johannesburg, earned an MA in creative writing from the University of Cape Town, and spent a decade as a freelance journalist working in South Africa and the US, covering electricity cable thieves, HIV+ beauty pageants, metro cops, and homeless sex workers.\nHer work has appeared in publications such as Elle, Marie Claire, The Hollywood Reporter, and The Sunday Times. She directed Glitterboys & Ganglands, a documentary that won Best LGBT Film at the San Diego Black Film Festival, and was showrunner and head writer on South Africa’s first half-hour animated TV show, Pax Afrika, which ran for one hundred and four episodes. Her comic books include original horror series Survivors’ Club with Dale Halvorsen and Ryan Kelly; Fairest: The Hidden Kingdom, a Japanese horror remix of Rapunzel, with artist Inaki; as well as The Problem with Cats, a Wonder Woman short set in Soweto, with Mike Maihack.\nBeukes began publishing short fiction in 2004. Her novels have been published in twenty-four countries and are being adapted for film and TV. Debut novel Moxyland came out in 2008. This was followed by Zoo City in 2010, which was a finalist for the World Fantasy and Crawford awards and won both a Kitschies Red Tentacle and an Arthur C. Clarke Award. The Shining Girls won the August Derleth Award for Best Horror Novel, the University of Johannesburg Prize, and the Strand Critics Choice Award for Best Mystery Novel. 2014’s Broken Monsters was a Shirley Jackson nominee, and a 2016 collection Slipping was on the Locus Recommended Reading list. She also wrote nonfiction book Maverick: Extraordinary Women from South Africa’s Past. She was a finalist for the Campbell Award for Best New Writer in 2011. Her latest novel is Afterland.\nBesides writing stunning novels, Beukes has given talks on storytelling at tech conferences and literary festivals around the world, including Design Indaba, TEDxJohannesburg, Webstock, and D-Construct. Lauren has also spearheaded charity art show fundraisers for all her books, raising R100 000 for Rape Crisis and R350 000 for kids lit org, Book Dash.\nLauren Beukes lives in Cape Town, South Africa with her daughter “and two trouble cats.”\nWhat were the books you grew up reading? What stands out as important in your memory and why?\nI loved the Usborne Greek mythology books and fairy tales and Joan Aiken and Roald Dahl. I had a fondness for magic and justice where the terrible people got their comeuppance. As a young teen, my dad got me into Anne McCaffrey and Philip K. Dick, my mom got me into ElfQuest and Dragonlance, and 2000 AD Monthly was a formative comics influence. The punk aesthetic, the stories about police states or mutants treated as lesser citizens, resonated as I became more politically engaged and aware of our own racist regime under apartheid.\nYou started publishing in 2004 and had your debut novel in 2008—Moxyland. Before that, you were a journalist. Did you struggle to break into fiction, or did it happen for you right away?\nOh man, I’m laughing over here. I’d published a couple of short stories locally in South Africa and a pop history about maverick South African women, which was a commission, but Moxyland took me four years to write while working full time as a journalist and lecturing at the University of Cape Town, and it took me a year of rejections to sell it. One of those was from Philip K. Dick’s agent who compared it to having sex on a skateboard, which is apparently a bad thing? I mean, surely, as long as you’re not falling off . . . ?\nFinally, I sent it to a local publisher, Jacana, who has an eye for new talent. The publishing director Maggie Davey read it on the plane en route to the Frankfurt Book Fair and by the time she landed in Germany, I had a book deal! Thank god for eleven-hour flights! It was published in South Africa to good reviews and then disappeared without a trace, as so many novels do, but by that time I’d managed to sell it to Angry Robot in the UK as part of a two book deal for 8000 GBP. The second book I had in mind was a noir set in a magical Johannesburg where a young woman with a sloth on her back takes a break from writing email scams and finding lost objects to take on the case of a missing teenage pop star. It became Zoo City, which won the Arthur C. Clarke Award and that changed my whole career. It put me in the spotlight and I happened to have a great idea for a new novel, about a time traveling serial killer and the survivor who turns the hunt around, that also explores misogyny, the loops of history, and feminism in the twentieth Century.\nYou’ve done several comic books at major houses, including Wonder Woman for DC. How did you break into that industry, and what do you enjoy most about working on comic books?\nI was championed first by Bill Willingham, who I met at Worldcon in Toronto, and then legendary Vertigo editor Shelly Bond. Shelly gave me a shot on an eight pager, which was my audition script for a larger project, writing a six parter set in the Fables universe, which became Fairest: The Hidden Kingdom, a J horror take on Rapunzel, with Inaki and Eva de la Cruz. I contributed some other shorts, including a Wonder Woman story set in Soweto, The Trouble with Cats with Mike Maihack. In 2014, I landed an original horror series, Survivors’ Club, based on a concept by my dear friend and cowriter, Dale Halvorsen, with art by Ryan Kelly and Inaki.\nI love the collaboration of comics, how the art and the colors and the lettering too can change the shape of the thing, give you a different perspective on the characters or shift the dialogue. It’s such a communal art form.\nAre there important differences between writing for comic books and writing short stories or novels?\nIn fiction, the whole world is on your shoulders, you have to hold it together. Comics is liberating because it’s collaborative, the art does more than half the work. Novels are all-consuming hellbeasts that will eat my life for a year, short stories are only hellkittens, although they always take me longer than I intended. Both allow me to indulge my love of dialogue, which I have to put hard limits on when writing comics.\nHave you learned things from writing comics that you’ve applied to stories or novels?\nI learned a lot from being the showrunner on South Africa’s first half-hour animated TV series, URBO: The Adventures of Pax Afrika in 2005–2009. You’re writing for kids, you’ve got twenty-four minutes to tell a whole story, so every scene has to do the work, either building on character or unfolding the plot, and ideally both. Get in and out as fast as possible, don’t waste time. It taught me to think very visually, because someone was going to have to animate what I wrote, keep dialogue taut and moving along, and to write action, which doesn’t come naturally to me.\nYou write in short fiction and novel length and slip across genres—do you feel like there are certain specific characteristics or themes that usually show up in your stories?\nI’m interested in intersectionality, in psychogeographies, and how we’re haunted by history. I’m interested in how we can strive to be better people in the darkest of times, how it’s okay to make mistakes, if you take accountability, learn from them. The intersectional feminism is strong in my work, I hope.\nAfterland is described as a thriller and you are well-known for writing thrillers. What are the most important keys to writing effective, taut thrillers?\nGosh, I don’t have a formula. I write what I’d like to read. I’m interested in putting my characters in terrible situations and seeing how they come out the other side, not wasting time, keeping it taut and moving. I always write in present tense, which gives me a sense of urgency, and mystery.\nCole and her son, Miles, and their relationship, are at the heart of Afterland. What are your favorite things about these characters, and what was the most challenging thing about writing them?\nThey’re both very witty, sometimes caustically with each other when they’re exasperated or under pressure, but that banter is part of their love language. I admire Cole’s ferocity, and how she’s trying to do the right thing and course corrects when she makes a mistake (and she makes some very bad mistakes). There’s a line that sums her up for me, “parenting is the worst game of improv ever.” At twelve years old, Miles is coming into himself, figuring out who he is, and part of that is in reaction to his mom, which puts him in a dangerous position that could wreck everything for both of them.\nChallenging? Keeping them on track but also allowing them to be themselves, do the wrong thing, feel resentful or frustrated, and dig into this relationship, which is by no means perfect, and in terrible circumstances.\nIn your PEN Ten interview, you were asked “What is the responsibility of the writer?” you said it was “to ask hard questions, which you don’t necessarily have the answers to . . . ” What are some of the most pressing questions you attempt to ask in Afterland?\nI wanted to gender flip the idea of the teenage girl in peril, how we sexualize girls, treat them as commodities and reproductive resources. Suddenly it’s Miles facing dehumanizing objectification, more important for what’s between his legs than who he is as a person. I wanted to interrogate the idea of a world-without-men being a gentler, kinder place, and this notion that women are inherently good and nurturing, because of course we aren’t. Because, surprise, we’re fully human, just as self-interested, corruptible, power hungry, and capable of terrible acts as men. Would there be less violence, yes, but the problems are the problems and they’re deeply embedded in our society.\nAre there specific challenges to writing this narrative, or is it as simple as writing the characters and roles that you wanted to, and it happened to be a wonderfully feminist story?\nThat was all intentional, but I just wrote the story I wanted to. I did waste a lot of time trying to make the villain a man and it wasn’t working. It was only when I introduced the narcissist sister that the narrative fell into place.\nAfterland is a near-future apocalyptic vision, with a speculative premise around a disease nearly wiping out men. The publisher, Mulholland, labels it as “Mystery & Thriller/Fiction/Thrillers/ Suspense,” only acknowledging the science fiction as an element blended into the rest. Is it important to call this work speculative fiction, or science fiction, or thriller? Do these labels carry a relevance that speak to the true nature of the narrative? Or are they just sales tactics?\nI’m not a huge fan of labels. I understand marketing needs them and that publishing is a business and that it can be very useful for readers to find more of what they love, speaking as someone who used to have to get my science fiction and fantasy through a specialty mail order company when I was in my teens, because the bookstores in South Africa in the nineties only stocked the big names and had a single lonely shelf devoted to genre. I write the books I want to write. I’m not overly vested in how people want to categorize them. Please call it whatever makes you happy.\nWhat are you working on now, what do you have coming up that fans can look forward to?\nI’m pitching some TV projects with friends and I’ve started in on a new novel, although the writing is slow in lockdown life, with the generalized anxiety of the pandemic, and the specificities, and the hours lost to supervising my eleven year old Zoom-schooling from home.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/beukes_interview_2020/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Miles . . . to Go: A Conversation with Lauren Beukes by Arley Sorg"}