{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nin Harris", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "gPVOcPvpcuSKgcYM90q8FdEnyAI=", "id": null, "license": null, "comments": "", "raw_text": "5250 words, short story  What the Stories Steal  The woods had claimed her husband’s mind, and left her with a husk.  In the Svieg, it was known that the killing of sacred animals led to madness, loss, or the substitution of a human life for the animal that had been slain. The animals were sometimes the Barlishya, who had emerged when the emissaries of the Bunian Empire had seeded the planetary over-soul by merging with it. In so doing, the emissaries had voluntarily voided themselves of identity, transmuting the remnants of the Empire that had Arrived on Sesen to bring a new world into being. These were the animals that her husband had slain. These were the rules that he had transgressed.  Ipsita’s fingers sank knuckle-deep into the mashed potatoes as she worked in egg yolks, flour, nutmeg, and salt. Her husband’s body was now supported by neithyr-tended crystals in the caverns of healing in Lyshavik, the capitol city of Mirozkh. Her last sight of him had been of a man partially wrapped in Mirozhi linen and suspended in a nimbus of colored light that emanated from five sentient crystals. But even those crystals could not bring back a mind stolen by the the Arlishya of the Svieg.  Alone in the lodge that she used to hate, Ipsita was making knödel.  Even before the accident, Ipsita tried to learn the things that must have filled Hans’ childhood, rummaging in the attic of the lodge, doing her best to ignore the tricks of the houseguest. Ipsita tried, because she thought that if she understood her husband better, he would love her better. And now that he was all but gone, there was a wild hope that if she tried hard enough, she could bring Hans back.  She shivered, staring at her spices that she had brought here as a talisman against the cold of the North. The neat row of glass jars were all labeled meticulously in her precise, elegant script. She ran her fingers through the paper labels. Cinnamon, cumin, star anise, fenugreek, and asafoetida added warmth to both her curries and stews. These much coveted spices and gold-lit censors filled the books that Hans wrote about conquest and domination of the various tribes and regions on the planet that they had left.  Ipsita loved the kitchen with its tiled stove, the collection of oddities along the wall, the faded figurine of the Great Hare of the North that held up her collection of recipe books and recipe journals looted from various used bookstores in the woodland outpost of Tare deep in the southernmost reaches of the Svieg. She had come to grow fond of the timeworn Great Hare, feeling comforted by its presence, more so than the woodcarving of the Raccoon, or even the beautifully-wrought devotional carving of Neith, The Woman Who Weaves.  Books from a long-imploded earth with embroidered prose were Ipsita’s main obsession apart from pragmatic philosophy. She devoured Raja Rao, Salman Rushdie, Sara Suleri, Kiran Desai, Anita Nair, Rohinton Mistry, along with the words of Hilary Putnam and William James. They were the remnants of a world that had ceased to exist—the books that had been brought in the last hundred tunnel-through trips between Sesen and Earth, before the over-soul rejected the technology that made the tunnel-throughs work.  Hans had accused her of building an unnecessary cultural wall between them. He was equally uneasy with her philosophical leanings. She would defend herself by saying the wall had been built on both sides. In the end, all that mattered was that the wall existed, slamming between them with the violence of cultural differences. The reality that their cultures had been inherited from a world that no longer existed and had been irrevocably destroyed exacerbated the tension. It was there in the way he looked at her, in the way she responded to him. It hovered like a gas cloud every time they sniped at each other; his, of the passive aggressive frost. Hers would manifest in the spurts and steam of a hot monsoon afternoon, showering both of them with her tears before drying away with the sunlight.  Behind her, the houseguest flitted about the kitchen. The staccato blips and flickers of sound served as his contribution to the conversation on most evenings. It was a counterpoint to the news reports on the radiogram and the occasional whirr as messages spooled out of the telegraph machine. It was as though some invisible instrument was processing air and filtering it, creating a percussive effect, sometimes against her skin, like the impression of lips trying to communicate. The houseguest was a presence that never went away, even when Ipsita’s consciousness sank into binaries of shadow and light within her dreams.  The houseguest had not been present in the emptiness of the apartment she shared with Hans, but that was not where she had lost him.  She had lost him in this lodge so far north that the Barlishyan lycanthropes howled when the Eldest Moon danced alone in the sky, spurning the company of the other six sentient moons. Sometimes, Ipsita did not know if she existed within the confines of a waking world or within the snowy blanket of a fairytale.  Stories brought them here. Herself, the houseguest, and her husband who was present only as a memory. Ipsita had lost Hans twice now. She was fortifying herself against the third and final way the stories would steal her husband from her with every meal that she cooked.  And that was perhaps why she had returned here.  The first thing the stories had stolen from her was his heart.  “It is the houseguest that’s responsible for all the disturbances,” Hans had told her the night that he had stopped loving her. She had tickled him into submission, her naked flesh against his as she ran the feather up and down his heaving torso.  “You have an invisible houseguest?” she asked as she laughed down into his face. His gray eyes had sobered, as he answered.  “He has always been with us. From before the time the first generation Arrived on Sesen. He came with my family on the interdimensional tunnel-throughs. We will never be free of him. My great-grand-uncle always maintained that the houseguest was a kobold who had come along with the other unhumans who helped us find this world.”  Ipsita had laughed, a hard-edged, taunting laugh, surprising herself with her sudden unkindness. But she could not stop herself from speaking, teasing him in an arch, combative manner as she straddled him.  “Always? From time immemorial? That sounds like a burden too heavy to bear. Was he a kobold before there was a name for kobolds? Before there was an Austria? A dead Earth? Before Sesen even?”  His silence descended, grim. Ipsita felt his shoulders stiffen in affront. She understood that she may have pushed a little too far, may have been far too disrespectful. They may have been fourth generation Arrivals, but the ties to respective motherlands were still strong, as was the pain of a home planet long-imploded.  Ipsita pressed her palms of her hands onto his shoulders and stared down at him.  “What did your uncle take from the lake?” Ipsita asked now. Her voice was soft, conciliatory, as she gently rubbed the palm of her right hand against his naked chest. Gray eyes looked back up at her.  “He was a houseguest,” he said, “an invisible houseguest who played tricks upon the family until they believed in his existence. The good fortune of our family depends on our believing in his existence, Ipsita.”  Ipsita could not help it. She started laughing again. It was a nasty little jeering sound. She did not know why she did this, if it was fear, genuine amusement, or some inexplicable feeling of envy that some part of him was possessed by a story. She laughed as if she herself was possessed by some residue, autochthonous anger. He pushed her chest away from him with hard hands but she gripped his body with her limbs and thighs, staring into his face. Her eyes pleaded with him. He heaved his shoulders under her warm hands, looking away. Ipsita felt the shame of sexual rejection and something more, a restless and deep anger that was not entirely her own.  She got off his now unresponsive body. Curling up on opposite sides of the bed that night, she had felt the snowdrifts brought in by the houseguest growing between them. The houseguest was most exacting, and possessive.  The distances grew because she had mocked its place within the household.  The distance between Ipsita and Hans had been growing long before he had lost his mind, somewhere out there where the wolves howl. That was the second time she had lost him, first his heart, now his mind. The distance was a frigid tunnel of ice. She had run away from his body a week ago, after six months of faithfully tending to him, and ignoring the pitying looks of the neithyrs who sang to the crystals and attempted to heal his mind. She had packed two bags, one with clothes, and the other with supplies. She had booked a ride on the next caravan heading towards the northernmost reaches of the Svieg, just before the continent-spreading forests reached the great mountains of Mirozkh.  Ipsita had arrived before a blizzard had been detected by the meteorologists and the telegrams sent to all major outposts. The telegram had been waiting for her at the lodge, spooling out from the machine that she had personally installed when Hans had first brought her here. Away from the main roads and all avenues of rescue, it felt as though she existed within a snow globe. She had married outside of the race and the religion her ancestors had brought with them into Sesen. This urge to retreat into the lodge that she had hated, away from civilization, and entombed by snow defied her own understanding of herself.  Desperate to do something tangible, Ipsita left the warmth of the kitchen where she had the now-cooked potato dumplings warming in the oven, waiting for a pan sauce to be made in accompaniment. She stopped only to retrieve a fur-lined coat, scarves, mittens, and another sweater to insulate her body against the cold. Unlatching the heavy iron door, she pulled the chain that turned on the coal-powered lantern of bronze and white enamel which had floral designs of green and red. She looked at the carcasses hanging in a row. He had hunted indiscriminately during the last week of his waking self. Birds, predators, and herbivores all hung from meat hooks, expertly skinned and gutted. He had taught her how to skin and to cure the beasts. She had acquiesced despite her initial squeamishness. She had hoped the activity would build a bridge between them, connect them despite his increasing remoteness.  Sometimes, when Hans returned from the hunt at night with that wild look in his eyes, she felt as though she would be next. It was as though the prey he had been chasing down all those long afternoons and evenings had been the one that slept beside him. There were days in which his indifference was a silent damnation of the woman he had wed. On those days, the radiogram and the telegraph machine would have to be switched off so that he may remain insulated. Hans disappeared deeper into the woods, to hunt, kill, and maim.  She still failed to understand how a man could change so suddenly, so dramatically. Perhaps fear of difference did invite extremities, after all. Ipsita stared at the carcasses of wild boars, deer, and even a wolf, hanging from the ceiling. The stink of death filled the room. Ipsita dragged carcass after carcass off the meat hooks with arms made sturdy from years of the heavy lifting required of engineers. She unlatched the other door, which opened out into the backyard that faced the woods.  The cold bit against her cheek and nipped at her nose, but her body was well-insulated by thermal underwear and layers of vests and sweaters. Working quickly before she lost all sensation, Ipsita pulled out all the carcasses and the pelts. She touched the box of matchsticks she carried in her pocket at all times now, and pulled out the container of oil that sat by the door. She supposed she had been thinking about this for much longer than she would choose to admit.  She uncapped the container of oil, and lifted it to drench the pile of meat, bones, and pelt. Perhaps it was the particularly biting quality of the wind; perhaps it was something else. She stopped suddenly, as if chastised. Looking up, she saw a tall figure approaching, out of the darkness. She lowered the oil, wondering if the cold had seeped through the layers she had worn to gird herself.  “These will make a poor fire, if burned,” the man said to her as he took away the oil and the matches from her hands which felt limp and boneless.  “What else am I to do with them?” she asked.  He merely looked at her, his face expressionless.  “Do you want the carcasses back?” she asked.  “Poor compensation for the life taken and blood that has been shed,” he said.  “I cannot bring them back to life,” she answered, hoping that dialogue would help to resolve the impossibly supernatural situation she found herself in.  He smiled, baring teeth, faintly yellowed against his weather-beaten skin.  “No, you cannot. And you cannot bring that man of yours back to life either, can you?”  “Others hunt too, was he so very offensive?”  “You know he was.”  “What can I do, to make amends?”  “You would do this on his behalf? That is so very kind of you, considering the fact that he would be gladly rid of you if he could.”  “He is my husband.”  They stared at each other. She shivered and pushed her hands into the fur-lined pockets of her jacket.  “Only one manner of compensation will be valued above the rest. Only that one will bring him back.” His eyes were intent upon her as he said this.  “I do not understand what you mean,” she said.  “Do you want him to live?”  “Yes,” she said, feeling the cold freeze the tears upon her cheek.  “Then a trade must be made.”  “Do you wish for my death in his stead?”  He smiled, the flash of his teeth causing her to step back. “Not quite.”  “What is the approximation of a life then?”  In answer, he held out his hands. “Come with me into the woods, and you will find out.”  Almost obediently, as though in thrall, Ipsita placed her fingers in his, the wool of the mittens not reducing the impact of his bare hand. She expected it to be cold, but the warmth oozed its way from his skin through to her gloves, meeting her frozen fingertips. Around them, the snowflakes fell in a more temperate rhythm. Perhaps, if the weather grew milder, the roads would become passable again. They turned their back on the pile of carcasses, into the unforgiving darkness between the trees. She wondered what she would see if she looked back.  Around them the snow seemed to make strange shapes. She tried not to supply the shapes with identities from the stories Hans had whispered to her as a love-gift. Instead, she conjured lavish and lush images of apsaras deep in a vedic forest within her mind, as a thought-sanctuary. But these images were chased away by the flitting shadows of the Great Hare, and of the Barlishya, whom she feared with an irrational strength.  “Ipsita,” he called her name, making it sound like a caress. Desire, her name meant in Sanskrit. Perhaps it was a name that defined her entire being.  She opened her eyes.  “Why did you return to the lodge, Ipsita?”  “I don’t know. I just wanted to understand, just wanted to know why all of this is happening to me—to us!”  “All beings need their stories. And yours are so intoxicating. And our stories, don’t our stories mesh well, together? Look!”  She turned, and stared in awe as the snow made patterns. Layers of the images he wove before her interlaced with each other, creating a playground of woodland creatures from three continents and two worlds—their planet Sesen, and the long-dead Earth that had seeded it.  “What if I told you more of my stories, then?” she asked of him, thoughts of the vedic stories she had grown up with whirling in her mind, spilling over the edges where her consciousness intersected with his.  “That would not be enough for a bargain, I am afraid. Stories are only the beginning, and the ending after something has happened. Right here, we are in between the beginning and the end. And I am both full of, and emptied of stories. I am what I am because your husband’s family made me so. Now I need to be filled.”  He moved a finger to the chill of her cheek, and he stroked it, wordless as he touched her, his warmth radiating from his fingers.  “Do you consider yourself my debtor, then?” she asked, her voice heavy with skepticism, but laced with softness as she considered the houseguest. It was a manner Hans would recognize as her “ripe for plunder” stance: combative, aggressive, and yet pliant at the same time. She used to invite Hans’ plunder, once upon a time.  “A debtor of inherited dreams and visions, perhaps, you would like to say. No, I am beyond the concerns of debts, my dear.”  He moved closer, and she found the god-light in his eyes far too compelling to bear. She closed her eyes and whispered. “Am I dreaming you into being?”  He trailed a finger against the side of her chilled neck. “Do I feel like a dream?”  “No. No, you don’t.” She shivered. Hans was doubtless dreaming strange, frost-ridden dreams in a cavern of thrumming crystals. Here, she was walking deeper into an ice-patterned forest with a creature that wore his eyes. The man now seemed to be made of the crystalline green and blue that had somehow melted into crushed snow.  “Did you think a mere presentation of your conscious mind, your soul, or your body would be enough to win your husband free? No, I would have more than that.”  “I would think that a wife in his stead would be far too generous a compensation for his health,” Ipsita retorted. She was astounded to find that she was feeling deeply slighted by his tacit rejection.  He smiled, teeth gleaming against his pale skin. “Your bitterness is showing, Ipsita. But no, you greatly misunderstand my purpose in coming to you.”  Ipsita shook her head, speechless. He smiled then. She caught her breath before it left her in a smoke spiral against the cold air.  She asked, “Are you substantial now with the essence you stole from my husband? Would you have stolen mine too? What is it that you truly crave?”  “What would you know about what I truly crave? When have you ever bothered to ask?” His eyes darkened, changing irrevocably from gray to black. His face became a mask; one in which patterns could be discerned. Confusion was writ upon his face.  She found herself feeling compassion and more desire, for both comfort and familiarity. She shook away the desire, and concentrated on reparation.  “How about a release of sorts, surely that is adequate enough for barter? You can cease being the houseguest of my family. You can become something more than an unwanted presence. How about it? It would entail freedom for both of us.”  “Your family?”  “Indeed. Mine. He is still mine, for now.”  He shook his head at her, his expression one of skepticism.  “That is far too bold a claim to make, Ipsita. Do you really want your husband to wake up? Do you wish for him to be cold, and distant again with you?”  She stared at him, her expression unreadable, her mind a blank.  “Well, do you?” The backs of his hands moved up and down her forearms, gently, pebbling the skin. “If he does not wake up, you will be doomed for life, looking after him. If he wakes up, you return to a sterile, loveless marriage. Nothing is stopping you from walking away, right now, Ipsita. I could set you free.”  He looked at her with something approximating desperation. She began to wonder what she was bartering for, what he truly wanted.  “Responsibilities are part of humanity; it makes us who we are. It shapes our daily life, gives us purpose,” she told him, but her voiced cracked a little as she said, “and there was love, once. Perhaps love will return.”  He laughed, it was an uneasy sound. “Psh! Excuses! You do not want the guilt.”  “Well, nothing is stopping you from walking away either. Do you really want to be a houseguest forever? What keeps you chained to this family?”  He stopped, and looked around as though confused, and pensive. Around them, the snow continued to take on amorphous and ambiguous shapes. She waited till his silence resolved into words.  “His great grand-uncle took something from the Svieg when they first came here from the Jadhyan Isles to build the lodge. It was part of a signpost placed by the Bunian Empire before they seeded the over-soul. I was stolen from the still-newly seeded over-soul, a piece of a growing consciousness. Placed within an idol he carved from the tree he cut down.”  Ipsita stared at him. “Hans said you came from the Tyrol!”  The houseguest shook his head as he played with the snow that fell upon his face and hands in childlike wonder.  “His grand-uncle was a smart man. He made the fetish fit the story that he told. He shaped me in its guise when the over-soul was still young and turbulent. He pulled me from the Arlishya collective that was only then being birthed. He bound me with his knowledge. He reduced this small part of me that was chipped away. He was one of the first human Arrivals who interceded with the over-soul. He used forgotten sciences to bind me when the splintering of the over-soul was still new. He kept this piece of me here until I had an identity separate from the over-soul.”  Ipsita looked at him as he spoke, as the act of speaking darkened his cheeks and raised his cheekbones. “Tell me what the object looks like, and I will give it back to you.”  “Is this your choice, then? Is this your barter? Because it would mean your husband’s family would lose the fortune and luck they’ve had.”  Ipsita shook her head. “How fortunate are they if they have lost their son? And if they have stolen from the over-soul and caused it harm, I would gladly steal it back from them.”  “You have to understand this, Ipsita. The loss of your husband’s mind had nothing to do with me. He transgressed against the rules the original Arrivals made with the over-soul. The Svieg is not to be over-harvested by humans. The animals that the over-soul has marked are not to be killed. Ironically, his transgression allowed me to transgress this evening, giving me an opportunity for barter. But I raised not one hand against him. Now, tell me. What are we bartering for?”  “My husband’s life, if you will free him. My freedom, and your emancipation from this house. All three of us, freed. Redeemed.”  Her voice was decisive as she looked at him, but his face changed, looked uncertain and a little fearful. “Mine? Why do you care what happens to me?”  “Because I do care. Because you’re as trapped in this family as I am. And because I am curious about who you are and who you could be, once we win your freedom.”  Ipsita’s eyes softened as she continued. Her voice was coaxing and seductive. It had always been thus, for Ipsita could not stop being the apsara, not even now. Especially not now. “Tell me where to find it, this thing that holds you here.”  The houseguest laughed again, lifting his strong throat as the sound troubled the snowflakes. His dark hair escaped the knot at the nape of his neck, and Ipsita had to focus on his words. “Can you not guess where it is? You spend most of your days with it.”  “In the kitchen?” She asked, her voice wondering, her thoughts returning to the spices she kept in jars and her books.  “Look to where you keep the rest of the things you love. If you truly want to set both me and your husband free, you know what you must do.”  He walked away, then—dissolving as the snowflakes fell down hard and fast again.  The doors of the cold room were still open. She stumbled inside. Stalking into her warm kitchen, she looked around at the old pots and pans, the ornate silverware and dishes. Her eyes grazed the side table that hosted an untidy stack of cookbooks, old second-hand cooking diaries as well as her own, much-annotated journal before resting on what she had been using as a bookend. The wooden hare that she had loved so well looked at her, as it had always looked at her. It had been in this kitchen for as long as she had remembered. She put her hand on the Hare, and shivered. She felt herself being watched.  “Is this it? Is this who you are?” There was no answer. Ipsita held on to the figurine, and unlatched the kitchen door, stepping outside into the freezing cold. She pulled the hood of the windbreaker over her head and walked down what would be a crazy-paved path in spring, leading between herb garden patches, into the pine woods. She moved into the woods and found a tree with a hollow in it. Not knowing what to do in the harsh, falling snow, she stuck the figurine into the tree.  “It’s cold out here,” his voice came from behind her. It was matter-of-fact rather than wheedling, but it also had a quality of reluctance in it.  “Well, don’t blame me,” she said, her eyes scanning his figure, now wrapped in doeskin and furs. She suppressed the urge to touch the angular lines of his face, which was now the color of rich redwood with the warmth of her palm. She spoke, “You asked for the figurine.”  “I didn’t. You did. I’d rather be inside my burrow with you. Making little hares that will go bounding about in the forest in the springtime.” He gave her a crooked grin that let her know he was not serious.  Ipsita shook her head, “You don’t even know what you want!”  He shrugged, “I’ve become so used to this household. You have become used to it to. Look at how willing you are to be trapped here. We could continue indefinitely like this. I like being in the kitchen with you.”  His voice was tentative here, almost bashful.  Ipsita shook her head. “That is not enough for either of us and you know it. Do you even have a name anymore? Do you even remember who you were before?”  He laughed. “I always knew I was Arlishya. But I was stolen away from the collective before I could be formed. I have become something other than the Alpha and Beta unhuman tribes of this planet. I became a thing separate from the over-soul. It was a rupturing that hurt for so many years, until I started to grow used to it.”  “Well then. You are something rare and different, and you have much to discover about what you can and cannot do.” Ipsita raised her palm to stroke his cheek in wonder.  He gave her an uncertain smile. “I don’t even know what to call myself. I have no name!”  Ipsita said tentatively. “Perhaps you don’t even need one, but I am sure the right name will come to you once you learn for yourself who you are.”  She retrieved the figurine from the hollow and dropped it gently into his hands. “You may be just a piece of the over-soul, but so am I. So are we all. You have an identity now. You have that choice, that autonomy. Find yourself. Find your name.”  The houseguest looked at her with puzzlement. She could not stop herself from leaning towards him, planting a kiss on his cheek. He smiled at her, a jaunty smile that had a hint of uncertainty in it.  In this world, more than one being was made flesh from the seeds of the Bunian Empire. Perhaps she was but a splinter of the over-soul too, despite being a descendent of the early human Arrivals. They had been as transmuted as the autochthonous tribes by the Arrival and by the Seeding.  “Go,” she said, “Go. But don’t forget your promise. Make my husband well. I have given you your freedom. Make him well, please.”  She said this with a note of pleading in her voice, but her eyes were uncertain.  “Are you sure you want me to just walk out of here—like this? Don’t you want to come with me? And why should you believe that I will keep this promise? How do you know I am able to keep this promise? I am not sure I am able.”  His eyes were confused, and he sounded divided. She shook her head. With the palms of her hands, she pushed against his solid chest. She pushed him till he backed away from her, deeper into the woods beyond the borders of the house.  “This is why you wanted me, did you not? To set you free? Go ahead then. Walk out of this tale. It does not belong to you. It does not belong to either of us. We have merely allowed ourselves to be entangled within its confines, exchanging our lives and identities. Walk free, my friend. Go back into the woods. I will remember you. You will keep your promise. You must. You must.”  The Arlishya gifted her with one last smile of appreciation before he turned, wordless. He walked unwillingly towards his liberation. She watched till there was nothing to see, and until it became too cold.  She returned to the waiting warmth of the kitchen. She would make soup tonight to go with her knödel, she thought. She would make potato soup for her absent Hans. If the making of it was not entirely out of love, at the very least it would emanate from a very human resolve to do the right thing, whether it led to reconciliation or a compassionate separation. It would be flavored with a subtle hint of spices from the east. She would add two cloves for body, some meat for flavor. She might even sprinkle a tiny pinch of cinnamon powder. She would flavor it with her hopes, not entirely empirical. She would hope that, in the healing caverns of the neithyr, far away from her, he would be dreaming. She would not be able to tell if his dreams were bad or good. She could never tell what his dreams were. He had never told her. She had never asked. She had merely hoped. Nin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "text": "5250 words, short story\nWhat the Stories Steal\nThe woods had claimed her husband’s mind, and left her with a husk.\nIn the Svieg, it was known that the killing of sacred animals led to madness, loss, or the substitution of a human life for the animal that had been slain. The animals were sometimes the Barlishya, who had emerged when the emissaries of the Bunian Empire had seeded the planetary over-soul by merging with it. In so doing, the emissaries had voluntarily voided themselves of identity, transmuting the remnants of the Empire that had Arrived on Sesen to bring a new world into being. These were the animals that her husband had slain. These were the rules that he had transgressed.\nIpsita’s fingers sank knuckle-deep into the mashed potatoes as she worked in egg yolks, flour, nutmeg, and salt. Her husband’s body was now supported by neithyr-tended crystals in the caverns of healing in Lyshavik, the capitol city of Mirozkh. Her last sight of him had been of a man partially wrapped in Mirozhi linen and suspended in a nimbus of colored light that emanated from five sentient crystals. But even those crystals could not bring back a mind stolen by the the Arlishya of the Svieg.\nAlone in the lodge that she used to hate, Ipsita was making knödel.\nEven before the accident, Ipsita tried to learn the things that must have filled Hans’ childhood, rummaging in the attic of the lodge, doing her best to ignore the tricks of the houseguest. Ipsita tried, because she thought that if she understood her husband better, he would love her better. And now that he was all but gone, there was a wild hope that if she tried hard enough, she could bring Hans back.\nShe shivered, staring at her spices that she had brought here as a talisman against the cold of the North. The neat row of glass jars were all labeled meticulously in her precise, elegant script. She ran her fingers through the paper labels. Cinnamon, cumin, star anise, fenugreek, and asafoetida added warmth to both her curries and stews. These much coveted spices and gold-lit censors filled the books that Hans wrote about conquest and domination of the various tribes and regions on the planet that they had left.\nIpsita loved the kitchen with its tiled stove, the collection of oddities along the wall, the faded figurine of the Great Hare of the North that held up her collection of recipe books and recipe journals looted from various used bookstores in the woodland outpost of Tare deep in the southernmost reaches of the Svieg. She had come to grow fond of the timeworn Great Hare, feeling comforted by its presence, more so than the woodcarving of the Raccoon, or even the beautifully-wrought devotional carving of Neith, The Woman Who Weaves.\nBooks from a long-imploded earth with embroidered prose were Ipsita’s main obsession apart from pragmatic philosophy. She devoured Raja Rao, Salman Rushdie, Sara Suleri, Kiran Desai, Anita Nair, Rohinton Mistry, along with the words of Hilary Putnam and William James. They were the remnants of a world that had ceased to exist—the books that had been brought in the last hundred tunnel-through trips between Sesen and Earth, before the over-soul rejected the technology that made the tunnel-throughs work.\nHans had accused her of building an unnecessary cultural wall between them. He was equally uneasy with her philosophical leanings. She would defend herself by saying the wall had been built on both sides. In the end, all that mattered was that the wall existed, slamming between them with the violence of cultural differences. The reality that their cultures had been inherited from a world that no longer existed and had been irrevocably destroyed exacerbated the tension. It was there in the way he looked at her, in the way she responded to him. It hovered like a gas cloud every time they sniped at each other; his, of the passive aggressive frost. Hers would manifest in the spurts and steam of a hot monsoon afternoon, showering both of them with her tears before drying away with the sunlight.\nBehind her, the houseguest flitted about the kitchen. The staccato blips and flickers of sound served as his contribution to the conversation on most evenings. It was a counterpoint to the news reports on the radiogram and the occasional whirr as messages spooled out of the telegraph machine. It was as though some invisible instrument was processing air and filtering it, creating a percussive effect, sometimes against her skin, like the impression of lips trying to communicate. The houseguest was a presence that never went away, even when Ipsita’s consciousness sank into binaries of shadow and light within her dreams.\nThe houseguest had not been present in the emptiness of the apartment she shared with Hans, but that was not where she had lost him.\nShe had lost him in this lodge so far north that the Barlishyan lycanthropes howled when the Eldest Moon danced alone in the sky, spurning the company of the other six sentient moons. Sometimes, Ipsita did not know if she existed within the confines of a waking world or within the snowy blanket of a fairytale.\nStories brought them here. Herself, the houseguest, and her husband who was present only as a memory. Ipsita had lost Hans twice now. She was fortifying herself against the third and final way the stories would steal her husband from her with every meal that she cooked.\nAnd that was perhaps why she had returned here.\nThe first thing the stories had stolen from her was his heart.\n“It is the houseguest that’s responsible for all the disturbances,” Hans had told her the night that he had stopped loving her. She had tickled him into submission, her naked flesh against his as she ran the feather up and down his heaving torso.\n“You have an invisible houseguest?” she asked as she laughed down into his face. His gray eyes had sobered, as he answered.\n“He has always been with us. From before the time the first generation Arrived on Sesen. He came with my family on the interdimensional tunnel-throughs. We will never be free of him. My great-grand-uncle always maintained that the houseguest was a kobold who had come along with the other unhumans who helped us find this world.”\nIpsita had laughed, a hard-edged, taunting laugh, surprising herself with her sudden unkindness. But she could not stop herself from speaking, teasing him in an arch, combative manner as she straddled him.\n“Always? From time immemorial? That sounds like a burden too heavy to bear. Was he a kobold before there was a name for kobolds? Before there was an Austria? A dead Earth? Before Sesen even?”\nHis silence descended, grim. Ipsita felt his shoulders stiffen in affront. She understood that she may have pushed a little too far, may have been far too disrespectful. They may have been fourth generation Arrivals, but the ties to respective motherlands were still strong, as was the pain of a home planet long-imploded.\nIpsita pressed her palms of her hands onto his shoulders and stared down at him.\n“What did your uncle take from the lake?” Ipsita asked now. Her voice was soft, conciliatory, as she gently rubbed the palm of her right hand against his naked chest. Gray eyes looked back up at her.\n“He was a houseguest,” he said, “an invisible houseguest who played tricks upon the family until they believed in his existence. The good fortune of our family depends on our believing in his existence, Ipsita.”\nIpsita could not help it. She started laughing again. It was a nasty little jeering sound. She did not know why she did this, if it was fear, genuine amusement, or some inexplicable feeling of envy that some part of him was possessed by a story. She laughed as if she herself was possessed by some residue, autochthonous anger. He pushed her chest away from him with hard hands but she gripped his body with her limbs and thighs, staring into his face. Her eyes pleaded with him. He heaved his shoulders under her warm hands, looking away. Ipsita felt the shame of sexual rejection and something more, a restless and deep anger that was not entirely her own.\nShe got off his now unresponsive body. Curling up on opposite sides of the bed that night, she had felt the snowdrifts brought in by the houseguest growing between them. The houseguest was most exacting, and possessive.\nThe distances grew because she had mocked its place within the household.\nThe distance between Ipsita and Hans had been growing long before he had lost his mind, somewhere out there where the wolves howl. That was the second time she had lost him, first his heart, now his mind. The distance was a frigid tunnel of ice. She had run away from his body a week ago, after six months of faithfully tending to him, and ignoring the pitying looks of the neithyrs who sang to the crystals and attempted to heal his mind. She had packed two bags, one with clothes, and the other with supplies. She had booked a ride on the next caravan heading towards the northernmost reaches of the Svieg, just before the continent-spreading forests reached the great mountains of Mirozkh.\nIpsita had arrived before a blizzard had been detected by the meteorologists and the telegrams sent to all major outposts. The telegram had been waiting for her at the lodge, spooling out from the machine that she had personally installed when Hans had first brought her here. Away from the main roads and all avenues of rescue, it felt as though she existed within a snow globe. She had married outside of the race and the religion her ancestors had brought with them into Sesen. This urge to retreat into the lodge that she had hated, away from civilization, and entombed by snow defied her own understanding of herself.\nDesperate to do something tangible, Ipsita left the warmth of the kitchen where she had the now-cooked potato dumplings warming in the oven, waiting for a pan sauce to be made in accompaniment. She stopped only to retrieve a fur-lined coat, scarves, mittens, and another sweater to insulate her body against the cold. Unlatching the heavy iron door, she pulled the chain that turned on the coal-powered lantern of bronze and white enamel which had floral designs of green and red. She looked at the carcasses hanging in a row. He had hunted indiscriminately during the last week of his waking self. Birds, predators, and herbivores all hung from meat hooks, expertly skinned and gutted. He had taught her how to skin and to cure the beasts. She had acquiesced despite her initial squeamishness. She had hoped the activity would build a bridge between them, connect them despite his increasing remoteness.\nSometimes, when Hans returned from the hunt at night with that wild look in his eyes, she felt as though she would be next. It was as though the prey he had been chasing down all those long afternoons and evenings had been the one that slept beside him. There were days in which his indifference was a silent damnation of the woman he had wed. On those days, the radiogram and the telegraph machine would have to be switched off so that he may remain insulated. Hans disappeared deeper into the woods, to hunt, kill, and maim.\nShe still failed to understand how a man could change so suddenly, so dramatically. Perhaps fear of difference did invite extremities, after all. Ipsita stared at the carcasses of wild boars, deer, and even a wolf, hanging from the ceiling. The stink of death filled the room. Ipsita dragged carcass after carcass off the meat hooks with arms made sturdy from years of the heavy lifting required of engineers. She unlatched the other door, which opened out into the backyard that faced the woods.\nThe cold bit against her cheek and nipped at her nose, but her body was well-insulated by thermal underwear and layers of vests and sweaters. Working quickly before she lost all sensation, Ipsita pulled out all the carcasses and the pelts. She touched the box of matchsticks she carried in her pocket at all times now, and pulled out the container of oil that sat by the door. She supposed she had been thinking about this for much longer than she would choose to admit.\nShe uncapped the container of oil, and lifted it to drench the pile of meat, bones, and pelt. Perhaps it was the particularly biting quality of the wind; perhaps it was something else. She stopped suddenly, as if chastised. Looking up, she saw a tall figure approaching, out of the darkness. She lowered the oil, wondering if the cold had seeped through the layers she had worn to gird herself.\n“These will make a poor fire, if burned,” the man said to her as he took away the oil and the matches from her hands which felt limp and boneless.\n“What else am I to do with them?” she asked.\nHe merely looked at her, his face expressionless.\n“Do you want the carcasses back?” she asked.\n“Poor compensation for the life taken and blood that has been shed,” he said.\n“I cannot bring them back to life,” she answered, hoping that dialogue would help to resolve the impossibly supernatural situation she found herself in.\nHe smiled, baring teeth, faintly yellowed against his weather-beaten skin.\n“No, you cannot. And you cannot bring that man of yours back to life either, can you?”\n“Others hunt too, was he so very offensive?”\n“You know he was.”\n“What can I do, to make amends?”\n“You would do this on his behalf? That is so very kind of you, considering the fact that he would be gladly rid of you if he could.”\n“He is my husband.”\nThey stared at each other. She shivered and pushed her hands into the fur-lined pockets of her jacket.\n“Only one manner of compensation will be valued above the rest. Only that one will bring him back.” His eyes were intent upon her as he said this.\n“I do not understand what you mean,” she said.\n“Do you want him to live?”\n“Yes,” she said, feeling the cold freeze the tears upon her cheek.\n“Then a trade must be made.”\n“Do you wish for my death in his stead?”\nHe smiled, the flash of his teeth causing her to step back. “Not quite.”\n“What is the approximation of a life then?”\nIn answer, he held out his hands. “Come with me into the woods, and you will find out.”\nAlmost obediently, as though in thrall, Ipsita placed her fingers in his, the wool of the mittens not reducing the impact of his bare hand. She expected it to be cold, but the warmth oozed its way from his skin through to her gloves, meeting her frozen fingertips. Around them, the snowflakes fell in a more temperate rhythm. Perhaps, if the weather grew milder, the roads would become passable again. They turned their back on the pile of carcasses, into the unforgiving darkness between the trees. She wondered what she would see if she looked back.\nAround them the snow seemed to make strange shapes. She tried not to supply the shapes with identities from the stories Hans had whispered to her as a love-gift. Instead, she conjured lavish and lush images of apsaras deep in a vedic forest within her mind, as a thought-sanctuary. But these images were chased away by the flitting shadows of the Great Hare, and of the Barlishya, whom she feared with an irrational strength.\n“Ipsita,” he called her name, making it sound like a caress. Desire, her name meant in Sanskrit. Perhaps it was a name that defined her entire being.\nShe opened her eyes.\n“Why did you return to the lodge, Ipsita?”\n“I don’t know. I just wanted to understand, just wanted to know why all of this is happening to me—to us!”\n“All beings need their stories. And yours are so intoxicating. And our stories, don’t our stories mesh well, together? Look!”\nShe turned, and stared in awe as the snow made patterns. Layers of the images he wove before her interlaced with each other, creating a playground of woodland creatures from three continents and two worlds—their planet Sesen, and the long-dead Earth that had seeded it.\n“What if I told you more of my stories, then?” she asked of him, thoughts of the vedic stories she had grown up with whirling in her mind, spilling over the edges where her consciousness intersected with his.\n“That would not be enough for a bargain, I am afraid. Stories are only the beginning, and the ending after something has happened. Right here, we are in between the beginning and the end. And I am both full of, and emptied of stories. I am what I am because your husband’s family made me so. Now I need to be filled.”\nHe moved a finger to the chill of her cheek, and he stroked it, wordless as he touched her, his warmth radiating from his fingers.\n“Do you consider yourself my debtor, then?” she asked, her voice heavy with skepticism, but laced with softness as she considered the houseguest. It was a manner Hans would recognize as her “ripe for plunder” stance: combative, aggressive, and yet pliant at the same time. She used to invite Hans’ plunder, once upon a time.\n“A debtor of inherited dreams and visions, perhaps, you would like to say. No, I am beyond the concerns of debts, my dear.”\nHe moved closer, and she found the god-light in his eyes far too compelling to bear. She closed her eyes and whispered. “Am I dreaming you into being?”\nHe trailed a finger against the side of her chilled neck. “Do I feel like a dream?”\n“No. No, you don’t.” She shivered. Hans was doubtless dreaming strange, frost-ridden dreams in a cavern of thrumming crystals. Here, she was walking deeper into an ice-patterned forest with a creature that wore his eyes. The man now seemed to be made of the crystalline green and blue that had somehow melted into crushed snow.\n“Did you think a mere presentation of your conscious mind, your soul, or your body would be enough to win your husband free? No, I would have more than that.”\n“I would think that a wife in his stead would be far too generous a compensation for his health,” Ipsita retorted. She was astounded to find that she was feeling deeply slighted by his tacit rejection.\nHe smiled, teeth gleaming against his pale skin. “Your bitterness is showing, Ipsita. But no, you greatly misunderstand my purpose in coming to you.”\nIpsita shook her head, speechless. He smiled then. She caught her breath before it left her in a smoke spiral against the cold air.\nShe asked, “Are you substantial now with the essence you stole from my husband? Would you have stolen mine too? What is it that you truly crave?”\n“What would you know about what I truly crave? When have you ever bothered to ask?” His eyes darkened, changing irrevocably from gray to black. His face became a mask; one in which patterns could be discerned. Confusion was writ upon his face.\nShe found herself feeling compassion and more desire, for both comfort and familiarity. She shook away the desire, and concentrated on reparation.\n“How about a release of sorts, surely that is adequate enough for barter? You can cease being the houseguest of my family. You can become something more than an unwanted presence. How about it? It would entail freedom for both of us.”\n“Your family?”\n“Indeed. Mine. He is still mine, for now.”\nHe shook his head at her, his expression one of skepticism.\n“That is far too bold a claim to make, Ipsita. Do you really want your husband to wake up? Do you wish for him to be cold, and distant again with you?”\nShe stared at him, her expression unreadable, her mind a blank.\n“Well, do you?” The backs of his hands moved up and down her forearms, gently, pebbling the skin. “If he does not wake up, you will be doomed for life, looking after him. If he wakes up, you return to a sterile, loveless marriage. Nothing is stopping you from walking away, right now, Ipsita. I could set you free.”\nHe looked at her with something approximating desperation. She began to wonder what she was bartering for, what he truly wanted.\n“Responsibilities are part of humanity; it makes us who we are. It shapes our daily life, gives us purpose,” she told him, but her voiced cracked a little as she said, “and there was love, once. Perhaps love will return.”\nHe laughed, it was an uneasy sound. “Psh! Excuses! You do not want the guilt.”\n“Well, nothing is stopping you from walking away either. Do you really want to be a houseguest forever? What keeps you chained to this family?”\nHe stopped, and looked around as though confused, and pensive. Around them, the snow continued to take on amorphous and ambiguous shapes. She waited till his silence resolved into words.\n“His great grand-uncle took something from the Svieg when they first came here from the Jadhyan Isles to build the lodge. It was part of a signpost placed by the Bunian Empire before they seeded the over-soul. I was stolen from the still-newly seeded over-soul, a piece of a growing consciousness. Placed within an idol he carved from the tree he cut down.”\nIpsita stared at him. “Hans said you came from the Tyrol!”\nThe houseguest shook his head as he played with the snow that fell upon his face and hands in childlike wonder.\n“His grand-uncle was a smart man. He made the fetish fit the story that he told. He shaped me in its guise when the over-soul was still young and turbulent. He pulled me from the Arlishya collective that was only then being birthed. He bound me with his knowledge. He reduced this small part of me that was chipped away. He was one of the first human Arrivals who interceded with the over-soul. He used forgotten sciences to bind me when the splintering of the over-soul was still new. He kept this piece of me here until I had an identity separate from the over-soul.”\nIpsita looked at him as he spoke, as the act of speaking darkened his cheeks and raised his cheekbones. “Tell me what the object looks like, and I will give it back to you.”\n“Is this your choice, then? Is this your barter? Because it would mean your husband’s family would lose the fortune and luck they’ve had.”\nIpsita shook her head. “How fortunate are they if they have lost their son? And if they have stolen from the over-soul and caused it harm, I would gladly steal it back from them.”\n“You have to understand this, Ipsita. The loss of your husband’s mind had nothing to do with me. He transgressed against the rules the original Arrivals made with the over-soul. The Svieg is not to be over-harvested by humans. The animals that the over-soul has marked are not to be killed. Ironically, his transgression allowed me to transgress this evening, giving me an opportunity for barter. But I raised not one hand against him. Now, tell me. What are we bartering for?”\n“My husband’s life, if you will free him. My freedom, and your emancipation from this house. All three of us, freed. Redeemed.”\nHer voice was decisive as she looked at him, but his face changed, looked uncertain and a little fearful. “Mine? Why do you care what happens to me?”\n“Because I do care. Because you’re as trapped in this family as I am. And because I am curious about who you are and who you could be, once we win your freedom.”\nIpsita’s eyes softened as she continued. Her voice was coaxing and seductive. It had always been thus, for Ipsita could not stop being the apsara, not even now. Especially not now. “Tell me where to find it, this thing that holds you here.”\nThe houseguest laughed again, lifting his strong throat as the sound troubled the snowflakes. His dark hair escaped the knot at the nape of his neck, and Ipsita had to focus on his words. “Can you not guess where it is? You spend most of your days with it.”\n“In the kitchen?” She asked, her voice wondering, her thoughts returning to the spices she kept in jars and her books.\n“Look to where you keep the rest of the things you love. If you truly want to set both me and your husband free, you know what you must do.”\nHe walked away, then—dissolving as the snowflakes fell down hard and fast again.\nThe doors of the cold room were still open. She stumbled inside. Stalking into her warm kitchen, she looked around at the old pots and pans, the ornate silverware and dishes. Her eyes grazed the side table that hosted an untidy stack of cookbooks, old second-hand cooking diaries as well as her own, much-annotated journal before resting on what she had been using as a bookend. The wooden hare that she had loved so well looked at her, as it had always looked at her. It had been in this kitchen for as long as she had remembered. She put her hand on the Hare, and shivered. She felt herself being watched.\n“Is this it? Is this who you are?” There was no answer. Ipsita held on to the figurine, and unlatched the kitchen door, stepping outside into the freezing cold. She pulled the hood of the windbreaker over her head and walked down what would be a crazy-paved path in spring, leading between herb garden patches, into the pine woods. She moved into the woods and found a tree with a hollow in it. Not knowing what to do in the harsh, falling snow, she stuck the figurine into the tree.\n“It’s cold out here,” his voice came from behind her. It was matter-of-fact rather than wheedling, but it also had a quality of reluctance in it.\n“Well, don’t blame me,” she said, her eyes scanning his figure, now wrapped in doeskin and furs. She suppressed the urge to touch the angular lines of his face, which was now the color of rich redwood with the warmth of her palm. She spoke, “You asked for the figurine.”\n“I didn’t. You did. I’d rather be inside my burrow with you. Making little hares that will go bounding about in the forest in the springtime.” He gave her a crooked grin that let her know he was not serious.\nIpsita shook her head, “You don’t even know what you want!”\nHe shrugged, “I’ve become so used to this household. You have become used to it to. Look at how willing you are to be trapped here. We could continue indefinitely like this. I like being in the kitchen with you.”\nHis voice was tentative here, almost bashful.\nIpsita shook her head. “That is not enough for either of us and you know it. Do you even have a name anymore? Do you even remember who you were before?”\nHe laughed. “I always knew I was Arlishya. But I was stolen away from the collective before I could be formed. I have become something other than the Alpha and Beta unhuman tribes of this planet. I became a thing separate from the over-soul. It was a rupturing that hurt for so many years, until I started to grow used to it.”\n“Well then. You are something rare and different, and you have much to discover about what you can and cannot do.” Ipsita raised her palm to stroke his cheek in wonder.\nHe gave her an uncertain smile. “I don’t even know what to call myself. I have no name!”\nIpsita said tentatively. “Perhaps you don’t even need one, but I am sure the right name will come to you once you learn for yourself who you are.”\nShe retrieved the figurine from the hollow and dropped it gently into his hands. “You may be just a piece of the over-soul, but so am I. So are we all. You have an identity now. You have that choice, that autonomy. Find yourself. Find your name.”\nThe houseguest looked at her with puzzlement. She could not stop herself from leaning towards him, planting a kiss on his cheek. He smiled at her, a jaunty smile that had a hint of uncertainty in it.\nIn this world, more than one being was made flesh from the seeds of the Bunian Empire. Perhaps she was but a splinter of the over-soul too, despite being a descendent of the early human Arrivals. They had been as transmuted as the autochthonous tribes by the Arrival and by the Seeding.\n“Go,” she said, “Go. But don’t forget your promise. Make my husband well. I have given you your freedom. Make him well, please.”\nShe said this with a note of pleading in her voice, but her eyes were uncertain.\n“Are you sure you want me to just walk out of here—like this? Don’t you want to come with me? And why should you believe that I will keep this promise? How do you know I am able to keep this promise? I am not sure I am able.”\nHis eyes were confused, and he sounded divided. She shook her head. With the palms of her hands, she pushed against his solid chest. She pushed him till he backed away from her, deeper into the woods beyond the borders of the house.\n“This is why you wanted me, did you not? To set you free? Go ahead then. Walk out of this tale. It does not belong to you. It does not belong to either of us. We have merely allowed ourselves to be entangled within its confines, exchanging our lives and identities. Walk free, my friend. Go back into the woods. I will remember you. You will keep your promise. You must. You must.”\nThe Arlishya gifted her with one last smile of appreciation before he turned, wordless. He walked unwillingly towards his liberation. She watched till there was nothing to see, and until it became too cold.\nShe returned to the waiting warmth of the kitchen. She would make soup tonight to go with her knödel, she thought. She would make potato soup for her absent Hans. If the making of it was not entirely out of love, at the very least it would emanate from a very human resolve to do the right thing, whether it led to reconciliation or a compassionate separation. It would be flavored with a subtle hint of spices from the east. She would add two cloves for body, some meat for flavor. She might even sprinkle a tiny pinch of cinnamon powder. She would flavor it with her hopes, not entirely empirical. She would hope that, in the healing caverns of the neithyr, far away from her, he would be dreaming. She would not be able to tell if his dreams were bad or good. She could never tell what his dreams were. He had never told her. She had never asked. She had merely hoped.\nNin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "source": "https://clarkesworldmagazine.com/harris_11_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: What the Stories Steal by Nin Harris"}