{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Y M Pang", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Zn11Q1z9u6Slmf+y4zHgFZ3O2rU=", "id": null, "license": null, "comments": "", "raw_text": "1820 words, short story  Skyscrapers in the Sand  “I wish I were Petra, I wish I were Vegas . . . ”  Xuming croaked out Yaniv’s old hit. Her voice wouldn’t have decorated any playlists in her youth—not even as a backup singer, not even with autotune—and these days it was dry and cracking despite the best efforts of nano-res. Thankfully there was no one around to criticize her singing, and they wouldn’t hear her anyway through her suit’s headgear.  Desert stretched everywhere. A breeze dusted over the dunes, the headset transferring its whistle to Xuming’s ears. Her breath rasped as her boots sank into sand. Despite her filters showing as fully functional, next change needed in 37 days and 3 hours, Xuming’s throat felt like she’d swallowed fish bone. She coughed, the sound echoing inside her headgear. She contemplated switching to the oxygen tank—compressed, eight hours—since the loc-guide said she was almost there, but she resisted the urge.  Right foot. Left foot. Humming the second verse of “Skyscrapers in the Sand.” She longed to play the song, to let her headset blast it at her instead of hearing her own quivery voice. But no. She would not listen to that song again until she reached her destination.  Her loc-guide, tracing her steps over the buried ruins, said she’d arrived on the outskirts of Shanghai. Xuming stared at the roads and buildings mapped out on her loc-guide, then the sand at her feet. She followed the flashing orange arrow pointing in the direction of the Oriental Pearl Tower.  The sky was bleeding into red when Xuming spotted the Tower’s antenna spire rising from the sand. The wind had picked up, and the swirling sand made it hard to see beyond a few steps. Xuming walked up to the Tower and watched the orange arrow representing it and the purple arrow representing her overlap on her loc-guide.  Much of the antenna spire had broken off. Reports estimated the sand coverage to be three hundred and fifty-three meters above baseline, which meant a good one hundred and fifteen meters of spire should have been looming above her. But what remained was only around twice her height, its tip jagged, its missing pieces nowhere visible on the sand.  Xuming stood still for a moment, catching her breath. She could practically hear Javier’s voice in her ear, “Should’ve rode a skimmer.” No. This was one journey Xuming would take on her own two legs, even if it exhausted her, even if after this she could not journey again.  She dropped her pack and pulled out her collapsible shovel. It unfolded with the press of a button. Then she gripped the handle with both hands, shoved down with one foot. She filled the shovel with sand, lifted, hurled the sand away—barely two paces away, for Xuming couldn’t muster the strength. Repeat. She dug carefully around the tower, not knowing how fragile it was now, not wanting to find out.  The gloves of her suit protected her hands from blisters. Her sweat, too, was sucked away. It wasn’t like that long-ago day in the bio-dome, when their class had won the raffle to perform the planting. Xuming had marveled at the bio-dome panels that allowed in filtered sunlight, and the green, leafy trees around them she’d previously only seen in videos. “The surface used to have them everywhere,” Ms. Starr had said. And though it was largely ceremonial, though it gave her blisters, Xuming had fought off several classmates for a chance to perform the digging. The shovel had been as large as she was, and several other children laughed at her struggles.  Not Yaniv though. He hadn’t even been there. He’d run off playing hide and seek with Javier and Felix, and their families all got fined after they trampled some plant somewhere—an easy one to replenish, but every plant was precious. That was Yaniv. Always doing what he wanted, not what he should.  The red sun bled to a smoky gray, then into black. The suit kept Xuming’s body at one steady temperature; she did not feel the chill now any more than she’d felt the heat before. Sensing the physiological signs of exhaustion, her suit flashed a message across the corner of her visor. Sleep Mode?  No.  I wish I were Petra, I wish I were Vegas.  I wish I could stand in a desert without us.  I wish I were the only one left on this land.  I wish I could live like a skyscraper in sand.  Stupid silly pop song. Dig, step, fling. How did this become a hit? Hitched breath, raised hand to brush away hair, then the realization she was all suit. Yaniv never confirmed it, but nearly everyone thought the song was about her. Or rather, him leaving her.  A round object began to reveal itself beneath her shovel. The Space Module, the highest observatory level of the Oriental Pearl Tower. Xuming peered down, activating her headlight to illuminate the area.  She dug around it carefully. She had no background in archeological extraction beyond the articles she’d accessed on the Netspace. It didn’t matter. She wasn’t digging up the city. She just needed to expose the Space Module. She just needed somewhere to bury this.  Piles of sand crowded around her, their shape and color reminding her of the conical corn bread made by her Northerner father. Xuming slid down the side of her hole, dislodging sand, for a moment wondering if she’d created her own grave. Wouldn’t that be romantic: Burying herself in the city of her mother’s birth, the city she’d never even seen, alongside the last thing she’d do for Yaniv.  She brushed a hand over the top of the Space Module. Unlike the antenna spire, the concrete here seemed little deteriorated. She hummed Yaniv’s song about Petra and Vegas and thought this was more like Pompeii, civilization preserved beneath the wings of disaster.  She pulled the small silver sphere from her pack, fingers clumsy from the gloves. The time capsule looked like the offspring of an egg and a disco ball. She attached it to the Space Module’s outer surface, then activated it.  “Skyscrapers in the Sand” began to play.  She barely managed to climb out of the hole, sand slipping beneath her hands and feet. Tears pricked her eyes. Yaniv’s voice, all she had left of him. She thought she felt the sand shudder with it, but it was only her own trembling.  Xuming stood, grabbed hold of her shovel, began shoveling sand back down. When the spherical time capsule was covered, the song stopped. Her headlight remained on, but Xuming felt like her world went dark.  She worked in silence, burying the Space Module, the time capsule. Someday, when humanity was ready to resurface, they would dig up this city and remove the sand from the sphere. Then Yaniv’s song would play again. It was his only wish she could honor, the only one she even wanted to honor. She’ll let him live in his desert city, let him sing to the future. And if those faraway explorers cared to peel beneath the surface, if they opened up the sphere, they would find her photos and emails stored on an Alltab—her story, their story, told in records other than the convenient medium of a catchy song. Less pretty, perhaps. But closer to the truth, which was something Yaniv never understood.  She finished filling the hole. Soon desert wind would smooth all traces. On every previous night of this journey, she’d inflated her tent before sleeping. But tonight Xuming lay on the ground, facing a moon she could not see. Her suit protected her from cold and heat, but it wouldn’t take something as drastic as a sandstorm to bury her.  Didn’t matter. Tonight, she would lie here without that extra shield. Just the sand and suit between her and Shanghai, her and Yaniv. It would have to do. She couldn’t get any closer to the city, nor to him.  Xuming laughed, and the laugh became a cough. She closed her eyes but left on the input of her headset, so the desert wind sang to her as she drifted off.  She walked down a paved path. Countless others walked around her: in the same direction, in the opposite direction. Someone bumped into her, and instead of apologizing the girl ran off, muttering about slow grannies.  Snarling, Xuming moved to chase the girl. But a familiar hand laid itself on her shoulder, stopping her in her tracks. She whirled around and found herself face to face with Yaniv. Some version of him anyway, like a collage of her different memories. Lines were starting to form in the corners of his eyes, and visible gray strands streaked his wavy brown hair. But he didn’t have the scar over his high nose, which Xuming remembered him getting long before his temples had started to gray.  Xuming threw off his hand, stared out at the crowd. She couldn’t find the girl anymore. “Damn it, Yaniv. Why’d you stop me?”  “She was just in a rush,” Yaniv said. “Why are you so angry all the time?”  “Angry? Or maybe I just don’t buy your optimistic crap—”  She broke off, staring at something over his shoulder. It was a tall, white-blue structure lit up against its dark background, two large spheres breaking its otherwise slim shape.  The Oriental Pearl Tower. Shining against a night sky.  Xuming gasped and turned in a circle. She’d been so focused on that rude stranger and Yaniv. She hadn’t realized where she was.  She wasn’t walking down a tunnel; the paved path had no walls of dirt or steel. Instead what boxed her in were buildings on one side and swift-moving vehicles on the other, their golden headlights and red taillights streaking past like some abstract painting. Signs danced before buildings, washing the night with more color than the functionally lit tunnels would ever have.  “Yaniv, what . . . ?”  But before he could answer the buildings around them began to disappear. The tower sank into the ground, as if a crack had suddenly appeared. And Yaniv began to fade, like the people walking around her.  Xuming woke to sunlight. The monitor on the bottom right of her visor said 10:43, which meant she’d slept for quite a while. Still alive then, though her breath hitched as she stood. She opened her nutrition tube, which fed nutrients directly into her bloodstream.  “Stupid Yaniv,” she muttered. “Even the dream version of you never takes my side.”  She scuffed the sand with her boot, as if longing to uncover Shanghai once more. Was it a dream? Or was there a different Shanghai beneath the sands, a city of ghosts she’d briefly trespassed into?  Xuming stared in the direction of the sun. It was a long trek back to Exit X-78. Her suit would hold, but would she? The alternative didn’t fill her with longing, but it didn’t fill her with fear either.", "text": "1820 words, short story\nSkyscrapers in the Sand\n“I wish I were Petra, I wish I were Vegas . . . ”\nXuming croaked out Yaniv’s old hit. Her voice wouldn’t have decorated any playlists in her youth—not even as a backup singer, not even with autotune—and these days it was dry and cracking despite the best efforts of nano-res. Thankfully there was no one around to criticize her singing, and they wouldn’t hear her anyway through her suit’s headgear.\nDesert stretched everywhere. A breeze dusted over the dunes, the headset transferring its whistle to Xuming’s ears. Her breath rasped as her boots sank into sand. Despite her filters showing as fully functional, next change needed in 37 days and 3 hours, Xuming’s throat felt like she’d swallowed fish bone. She coughed, the sound echoing inside her headgear. She contemplated switching to the oxygen tank—compressed, eight hours—since the loc-guide said she was almost there, but she resisted the urge.\nRight foot. Left foot. Humming the second verse of “Skyscrapers in the Sand.” She longed to play the song, to let her headset blast it at her instead of hearing her own quivery voice. But no. She would not listen to that song again until she reached her destination.\nHer loc-guide, tracing her steps over the buried ruins, said she’d arrived on the outskirts of Shanghai. Xuming stared at the roads and buildings mapped out on her loc-guide, then the sand at her feet. She followed the flashing orange arrow pointing in the direction of the Oriental Pearl Tower.\nThe sky was bleeding into red when Xuming spotted the Tower’s antenna spire rising from the sand. The wind had picked up, and the swirling sand made it hard to see beyond a few steps. Xuming walked up to the Tower and watched the orange arrow representing it and the purple arrow representing her overlap on her loc-guide.\nMuch of the antenna spire had broken off. Reports estimated the sand coverage to be three hundred and fifty-three meters above baseline, which meant a good one hundred and fifteen meters of spire should have been looming above her. But what remained was only around twice her height, its tip jagged, its missing pieces nowhere visible on the sand.\nXuming stood still for a moment, catching her breath. She could practically hear Javier’s voice in her ear, “Should’ve rode a skimmer.” No. This was one journey Xuming would take on her own two legs, even if it exhausted her, even if after this she could not journey again.\nShe dropped her pack and pulled out her collapsible shovel. It unfolded with the press of a button. Then she gripped the handle with both hands, shoved down with one foot. She filled the shovel with sand, lifted, hurled the sand away—barely two paces away, for Xuming couldn’t muster the strength. Repeat. She dug carefully around the tower, not knowing how fragile it was now, not wanting to find out.\nThe gloves of her suit protected her hands from blisters. Her sweat, too, was sucked away. It wasn’t like that long-ago day in the bio-dome, when their class had won the raffle to perform the planting. Xuming had marveled at the bio-dome panels that allowed in filtered sunlight, and the green, leafy trees around them she’d previously only seen in videos. “The surface used to have them everywhere,” Ms. Starr had said. And though it was largely ceremonial, though it gave her blisters, Xuming had fought off several classmates for a chance to perform the digging. The shovel had been as large as she was, and several other children laughed at her struggles.\nNot Yaniv though. He hadn’t even been there. He’d run off playing hide and seek with Javier and Felix, and their families all got fined after they trampled some plant somewhere—an easy one to replenish, but every plant was precious. That was Yaniv. Always doing what he wanted, not what he should.\nThe red sun bled to a smoky gray, then into black. The suit kept Xuming’s body at one steady temperature; she did not feel the chill now any more than she’d felt the heat before. Sensing the physiological signs of exhaustion, her suit flashed a message across the corner of her visor. Sleep Mode?\nNo.\nI wish I were Petra, I wish I were Vegas.\nI wish I could stand in a desert without us.\nI wish I were the only one left on this land.\nI wish I could live like a skyscraper in sand.\nStupid silly pop song. Dig, step, fling. How did this become a hit? Hitched breath, raised hand to brush away hair, then the realization she was all suit. Yaniv never confirmed it, but nearly everyone thought the song was about her. Or rather, him leaving her.\nA round object began to reveal itself beneath her shovel. The Space Module, the highest observatory level of the Oriental Pearl Tower. Xuming peered down, activating her headlight to illuminate the area.\nShe dug around it carefully. She had no background in archeological extraction beyond the articles she’d accessed on the Netspace. It didn’t matter. She wasn’t digging up the city. She just needed to expose the Space Module. She just needed somewhere to bury this.\nPiles of sand crowded around her, their shape and color reminding her of the conical corn bread made by her Northerner father. Xuming slid down the side of her hole, dislodging sand, for a moment wondering if she’d created her own grave. Wouldn’t that be romantic: Burying herself in the city of her mother’s birth, the city she’d never even seen, alongside the last thing she’d do for Yaniv.\nShe brushed a hand over the top of the Space Module. Unlike the antenna spire, the concrete here seemed little deteriorated. She hummed Yaniv’s song about Petra and Vegas and thought this was more like Pompeii, civilization preserved beneath the wings of disaster.\nShe pulled the small silver sphere from her pack, fingers clumsy from the gloves. The time capsule looked like the offspring of an egg and a disco ball. She attached it to the Space Module’s outer surface, then activated it.\n“Skyscrapers in the Sand” began to play.\nShe barely managed to climb out of the hole, sand slipping beneath her hands and feet. Tears pricked her eyes. Yaniv’s voice, all she had left of him. She thought she felt the sand shudder with it, but it was only her own trembling.\nXuming stood, grabbed hold of her shovel, began shoveling sand back down. When the spherical time capsule was covered, the song stopped. Her headlight remained on, but Xuming felt like her world went dark.\nShe worked in silence, burying the Space Module, the time capsule. Someday, when humanity was ready to resurface, they would dig up this city and remove the sand from the sphere. Then Yaniv’s song would play again. It was his only wish she could honor, the only one she even wanted to honor. She’ll let him live in his desert city, let him sing to the future. And if those faraway explorers cared to peel beneath the surface, if they opened up the sphere, they would find her photos and emails stored on an Alltab—her story, their story, told in records other than the convenient medium of a catchy song. Less pretty, perhaps. But closer to the truth, which was something Yaniv never understood.\nShe finished filling the hole. Soon desert wind would smooth all traces. On every previous night of this journey, she’d inflated her tent before sleeping. But tonight Xuming lay on the ground, facing a moon she could not see. Her suit protected her from cold and heat, but it wouldn’t take something as drastic as a sandstorm to bury her.\nDidn’t matter. Tonight, she would lie here without that extra shield. Just the sand and suit between her and Shanghai, her and Yaniv. It would have to do. She couldn’t get any closer to the city, nor to him.\nXuming laughed, and the laugh became a cough. She closed her eyes but left on the input of her headset, so the desert wind sang to her as she drifted off.\nShe walked down a paved path. Countless others walked around her: in the same direction, in the opposite direction. Someone bumped into her, and instead of apologizing the girl ran off, muttering about slow grannies.\nSnarling, Xuming moved to chase the girl. But a familiar hand laid itself on her shoulder, stopping her in her tracks. She whirled around and found herself face to face with Yaniv. Some version of him anyway, like a collage of her different memories. Lines were starting to form in the corners of his eyes, and visible gray strands streaked his wavy brown hair. But he didn’t have the scar over his high nose, which Xuming remembered him getting long before his temples had started to gray.\nXuming threw off his hand, stared out at the crowd. She couldn’t find the girl anymore. “Damn it, Yaniv. Why’d you stop me?”\n“She was just in a rush,” Yaniv said. “Why are you so angry all the time?”\n“Angry? Or maybe I just don’t buy your optimistic crap—”\nShe broke off, staring at something over his shoulder. It was a tall, white-blue structure lit up against its dark background, two large spheres breaking its otherwise slim shape.\nThe Oriental Pearl Tower. Shining against a night sky.\nXuming gasped and turned in a circle. She’d been so focused on that rude stranger and Yaniv. She hadn’t realized where she was.\nShe wasn’t walking down a tunnel; the paved path had no walls of dirt or steel. Instead what boxed her in were buildings on one side and swift-moving vehicles on the other, their golden headlights and red taillights streaking past like some abstract painting. Signs danced before buildings, washing the night with more color than the functionally lit tunnels would ever have.\n“Yaniv, what . . . ?”\nBut before he could answer the buildings around them began to disappear. The tower sank into the ground, as if a crack had suddenly appeared. And Yaniv began to fade, like the people walking around her.\nXuming woke to sunlight. The monitor on the bottom right of her visor said 10:43, which meant she’d slept for quite a while. Still alive then, though her breath hitched as she stood. She opened her nutrition tube, which fed nutrients directly into her bloodstream.\n“Stupid Yaniv,” she muttered. “Even the dream version of you never takes my side.”\nShe scuffed the sand with her boot, as if longing to uncover Shanghai once more. Was it a dream? Or was there a different Shanghai beneath the sands, a city of ghosts she’d briefly trespassed into?\nXuming stared in the direction of the sun. It was a long trek back to Exit X-78. Her suit would hold, but would she? The alternative didn’t fill her with longing, but it didn’t fill her with fear either.", "source": "https://clarkesworldmagazine.com/pang_04_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Skyscrapers in the Sand by Y.M. Pang"}