{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kerry Tynan Fraser", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VFvaSkHlGLltZz+izJtJAOY0ybA=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Neologism and Linguicide  Languages, like species, mutate and evolve.  Take English for example. When I taught English overseas I learned a funny thing: there’s more than one kind of English. There’s Canadian English, which I can speak and teach, but there’s also American English, there’s the Queen’s English and there’s Australian English. While we’re at it, there’s also Jamaican English, Scottish English, South African English and many others.  There are also dialects of these many kinds of English. There’s Hawaiian English and Newfoundlandian English. There’s Alaskan English which gave us “cache,” and “cabin fever.” And there are the many Creoles and Black Englishes which brought us hundreds of common words and word usages such as “funky,” “foxy,” “jive,” “zombie,” and “jazz.”  And there are forms of English that come from blending languages and ethnicities: Hinglish is Hindi and English, Spanglish is Spanish and English and Newyorican is a mixture of Puerto Rican and New York English.  I am reminded of this problem as I try and submit stories and articles to publishers in different countries. In America I have to edit one way, in the UK another and so on. It’s true that English is shaping up to be one of the most dominant languages on the planet, but English itself is changing, it’s evolving, and it is evolving us. As Marshal McLuhan said, “First we shape our tools and thereafter they shape us.”  Languages grow and languages can just die as well. We’ve all heard of the sad scenario of species becoming endangered, but the famous anthropologist Wade Davis warns of a similar problem happening to the richness of the world’s cultures. Davis warns of endangered cultures. Just as quickly as English is becoming one of the first planetary super languages; so too are thousands of native languages and millions of words perishing daily. How we preserve or destroy these languages and how we cultivate linguistic habits, will determine what we are able to think in the world of the near future.  Many philosophers have emphasized how important language is in how we think. The creator of General Semantics, Alfred Korzybski, believed that abstract words have hypnotizing effects and suggested we should remove all words from our language that do not have referents. For example the words “water” and “rock,” both have referents in reality but none of the words “justice,” or “truth,” or for that matter “singularity” (from Transhumanism) have referents; they exist only in the human imagination. George Orwell, who gave us both “Newspeak,” and “thoughtcrime,” wrote at length about how language can be used as a political weapon. Foucault argued that the unconscious assumptions of language keep us in invisible prisons. Wittgenstein believed that culture literally couldn’t evolve until our language evolved, saying things like: “A man will be imprisoned in a room with a door that’s unlocked and opens inwards; as long as it does not occur to him to pull rather than push.”  I wonder about this, about this mutation of English and where it’s going, and for this reason I regularly read sites like urbandictionary.com and wordspy.com. Nothing is better for telling us what kind of semantic worlds we are currently inhabiting than studying neologisms: the bleeding edge of language evolution. A “neologism” is a new word. The study of these words as they mutate and evolve languages is widely understood to be an area of linguistics called word formation or word coinage.1  Where do these new words come from? According to Bill Bryson, author of The Mother Tongue there are five main ways words come into being: error, adoption, creation, a natural change in context and finally addition or subtraction:  Error: According to Darwinians, RNA copying mistakes are the source of Nature’s vast creativity, and it’s no different with languages. When words are transcribed incorrectly, or communicated incorrectly, they mutate and become new. For example the word “asparagus” used to be “sparrow grass,” but through linguistic mutation changed into its new form. Similarly, “monkey wrench” was “Moncky wrench,” after its inventor Charles Moncky.  Also, dictionaries sometimes make printing mistakes, which then get copied into other dictionaries. These strange little mutants are known as “ghost words.” “Dord” which means “density,” was accidentally entered into Webster’s New International Dictionary. “Foupe,” should have been “soup” and somehow came to mean “to drive with a sudden impetuosity.” Apparently “syllabus,” “scapegoat,” and “gravy,” are all ghostwords as well. All of this happens when some well-meaning editor makes a simple mistake, but there are also intentional fake entries made into articles and reference works all the time. These words and references are called “Mountweazels,” or “Nihilartikels,” (Nothing Articles). Apparently for satirical reasons, or just old-fashioned pranksterism, writers and editors will make stuff up just to screw with people. My favorite example is when The Economist wrote an article about genetically engineered pet dragons for one April Fool’s Day.  Mistakes like these have long been known to be a source of serendipitous creativity and many of the words we use are the result of transcription errors.  Adoption: Also called “loanwords.” English in particular is a language of adoption. We borrow and integrate words from everywhere. In the purest sense, most of what we think of as English is really a mixture of Norman, Old English, French, Latin, and every other European culture. We use “clichés” without even considering we are thinking in French. We gamble in “casinos,” which are Italian, as are “umbrellas,” “volcanoes,” “broccoli,” “jeans,” “manifestos,” and “wigs.” “Walrus,” and “gremlin,” are Scandinavian. “Intelligentsia” is Russian. “Bog,” “glamour,” “gruesome,” and “weird” are Scottish. “Boycott” and “brogue” are Irish.  There are thousands of examples of loanwords: “pajama” and “shampoo” are Hindi, “ketchup” and “tea” are Chinese, “chocolate” and “chili” are Aztec. “Chess,” “magic,” “angel,” and “peach” are all Persian. “Boondocks” is Tagalog. “Banana” and “mumbo jumbo” are African. And then there are words called “calque” words which are translations from other languages like “flea market” which is from the French “marché aux puces” which literally means “market of the fleas.”  So the English language is a great integrator of words from other languages.  Protologisms: Protologisms are words created by somebody in the hopes that they’ll survive and become part of a natural vocabulary. Where do they come from? Science creates new words all the time such as “quark” and “robot,”2 and acronyms such as “scuba” and “laser” can become popular and common. Writers also create new words. Two writers that come to mind are Orwell (see above) and J.K. Rowling with her “hinkypunks.” I’m tempted to include Shakespeare, but he didn’t so much create words as he did expressions which have become clichés: “love is blind,” “all the world’s a stage,” “brave new world,” “the winter of our discontent.” I could go on but brevity is the soul of wit. When a word has no real etymology, it’s a good sign it was made up somewhere along the way. Protologisms can be invented from onomatopoeia like with “cuckoo” and from phono-semantic matching, which is matching new words with the sounds of similar existing words. The Mandarin term for “World Wide Web,” for example is wàn, wéi, wăng, which means “myriad dimensional net.”  The word “neologism” itself was at one time a protologism: it entered our vocabulary somewhere between the 1400’s and the 1800’s.  Context: “Hamburger” was originally a steak named after the German city where it was popular and the clipped word “burger” followed that. Now “burger” can be applied to any sort of food pressed into a patty: like cheeseburger or veggie-burger. “Maverick” comes from Samuel Maverick, a rancher who didn’t brand his calves; therefore a “maverick” was an unbranded calf. Now it is any person who doesn’t follow the crowd. Words change over time as the culture changes around them. “Apple,” in old English meant any kind of fruit. “Green” was once only a color and now it is the environmental ideology. “Awful” was once deserving of awe. “Girl” was once just a young person, male or female. “Pretty” began as crafty, which mutated into clever or skillfully made, then mutated into refined/fine and landed on beautiful. If you don’t feel like making up new words just wait a while. Given enough time, culture will re-invent itself around existing words.  Addition or Subtraction: New words are also created by combining and adding to them or by subtracting from them. “Smog” was a portmanteaux created by combining “smoke” and “fog.” “Earthquake” obviously came from compounding “earth” and “quake.” “Ad” came from clipping “advertisement.” And then there is agglutination: forming new words by adding affixes to them. If you found yourself confused in English class about proper usage, it was probably because English is an organic and living language (not to mention its grammar was stolen wholesale from Latin and makes no sense in English.) Nobody really knows what the rules of English are, to be honest, and we just invent rules and words all the time. For example, as author Bill Bryson points out, we have six ways of making “labyrinth” into an adjective: labyrinthian, labyrinthean, labyrinthal, labyrinthine, labyrinthic, and labyrinthical. This is because of how many prefixes and suffixes we have in English and how indiscriminately we use them. Incidentally, my spellchecker doesn’t recognize four of these six examples, but it does recognize the word “spellchecker.” We live in an extremely information rich environment and synthetically modifying words and phrases is almost a requirement for speaking now.  Signal and Noise  We are told that the universe always moves in the direction of greater disorder: from a more useful state to a less useful state. But we are also told that some processes (like Life itself and Intelligence) try to combat this trend by cherry-picking the results of that disorder. Life takes all the good stuff and leaves all the bad stuff. As a result, information and entropy are always competing with each other.  For example, all the early developers of Information Science found that the bigger and more complex their communication tools got, the more chance there was for noise to creep into those systems. Specifically the longer telephone cables became, the weaker and more confused the signal passing through the cables got. Signal and noise are like the white-hatted and black-hatted characters in a Western novel, and signal-to-noise ratio is the novel’s plot. This is as true in the growth of our languages as it is in Information Science: the more complex our language and thoughts are, the more room there is for distortion to flourish.  Of the 6000 to 7000 languages that exist on the planet today, a quarter to a half of them are not being taught to new generations, meaning they are effectively dead languages. But new words are also born all the time. Technology and pop culture change word contexts so fast that any example from them I could provide as proof would be outdated by the time this went to print. Text-messaging, blogs, (both neologisms) and digital Darwinism are changing the meanings of words second by second. And it begs the question: how will people speak in the deep future? Will we speak a mishmash language like City Speak from “Blade Runner?” Will we speak in some alternative, pseudo-English like Nadsat from “A Clockwork Orange?” Will we mumble to each other in a managed, totalitarian language like Newspeak? Will we all need Babel Fish to communicate? These are useful things to consider for would-be science fiction authors or to readers interested in what kind of symbolic universe we will inhabit tomorrow.  English is being created as quickly as it is being destroyed, it’s mutating so fast that studying its neologisms can be like watching the succession of fruit flies being born, reproducing and dying in a petri-dish all in a matter of days. Entire subcultures can rise up and disappear overnight, and the chaotic edge of that process is exactly where I want to be.  FOOTNOTES:  1 - Except in Psychology, where curiously, “neologism” means something a little different. In that field it refers to the private, tinfoil-hat-words invented by patients, which have no meaning to anyone else. Perhaps it is merely a coincidence that only the field of Psychology has invented a neologistic use for the word “neologism,” thereby exhibiting the behavior it is describing. I’m just speculating here.  2 - Or in the later case science fiction. Josef Čapek coined the concept of the “robot,” based on a Czech word for drudgery, and Isaac Asimov added the science of “robotics.” Kerry spends 9 months of the year working as a private investigator and 3 months of the year working as a Sherpa in the Himalayas. His work has appeared in Surprising Stories, Orion's Child, Antipodean SF, Aurealis, subTerrain, Filling Station, Descant, Utne Reader as well as many others.", "text": "Non-Fiction\nNeologism and Linguicide\nLanguages, like species, mutate and evolve.\nTake English for example. When I taught English overseas I learned a funny thing: there’s more than one kind of English. There’s Canadian English, which I can speak and teach, but there’s also American English, there’s the Queen’s English and there’s Australian English. While we’re at it, there’s also Jamaican English, Scottish English, South African English and many others.\nThere are also dialects of these many kinds of English. There’s Hawaiian English and Newfoundlandian English. There’s Alaskan English which gave us “cache,” and “cabin fever.” And there are the many Creoles and Black Englishes which brought us hundreds of common words and word usages such as “funky,” “foxy,” “jive,” “zombie,” and “jazz.”\nAnd there are forms of English that come from blending languages and ethnicities: Hinglish is Hindi and English, Spanglish is Spanish and English and Newyorican is a mixture of Puerto Rican and New York English.\nI am reminded of this problem as I try and submit stories and articles to publishers in different countries. In America I have to edit one way, in the UK another and so on. It’s true that English is shaping up to be one of the most dominant languages on the planet, but English itself is changing, it’s evolving, and it is evolving us. As Marshal McLuhan said, “First we shape our tools and thereafter they shape us.”\nLanguages grow and languages can just die as well. We’ve all heard of the sad scenario of species becoming endangered, but the famous anthropologist Wade Davis warns of a similar problem happening to the richness of the world’s cultures. Davis warns of endangered cultures. Just as quickly as English is becoming one of the first planetary super languages; so too are thousands of native languages and millions of words perishing daily. How we preserve or destroy these languages and how we cultivate linguistic habits, will determine what we are able to think in the world of the near future.\nMany philosophers have emphasized how important language is in how we think. The creator of General Semantics, Alfred Korzybski, believed that abstract words have hypnotizing effects and suggested we should remove all words from our language that do not have referents. For example the words “water” and “rock,” both have referents in reality but none of the words “justice,” or “truth,” or for that matter “singularity” (from Transhumanism) have referents; they exist only in the human imagination. George Orwell, who gave us both “Newspeak,” and “thoughtcrime,” wrote at length about how language can be used as a political weapon. Foucault argued that the unconscious assumptions of language keep us in invisible prisons. Wittgenstein believed that culture literally couldn’t evolve until our language evolved, saying things like: “A man will be imprisoned in a room with a door that’s unlocked and opens inwards; as long as it does not occur to him to pull rather than push.”\nI wonder about this, about this mutation of English and where it’s going, and for this reason I regularly read sites like urbandictionary.com and wordspy.com. Nothing is better for telling us what kind of semantic worlds we are currently inhabiting than studying neologisms: the bleeding edge of language evolution. A “neologism” is a new word. The study of these words as they mutate and evolve languages is widely understood to be an area of linguistics called word formation or word coinage.1\nWhere do these new words come from? According to Bill Bryson, author of The Mother Tongue there are five main ways words come into being: error, adoption, creation, a natural change in context and finally addition or subtraction:\nError: According to Darwinians, RNA copying mistakes are the source of Nature’s vast creativity, and it’s no different with languages. When words are transcribed incorrectly, or communicated incorrectly, they mutate and become new. For example the word “asparagus” used to be “sparrow grass,” but through linguistic mutation changed into its new form. Similarly, “monkey wrench” was “Moncky wrench,” after its inventor Charles Moncky.\nAlso, dictionaries sometimes make printing mistakes, which then get copied into other dictionaries. These strange little mutants are known as “ghost words.” “Dord” which means “density,” was accidentally entered into Webster’s New International Dictionary. “Foupe,” should have been “soup” and somehow came to mean “to drive with a sudden impetuosity.” Apparently “syllabus,” “scapegoat,” and “gravy,” are all ghostwords as well. All of this happens when some well-meaning editor makes a simple mistake, but there are also intentional fake entries made into articles and reference works all the time. These words and references are called “Mountweazels,” or “Nihilartikels,” (Nothing Articles). Apparently for satirical reasons, or just old-fashioned pranksterism, writers and editors will make stuff up just to screw with people. My favorite example is when The Economist wrote an article about genetically engineered pet dragons for one April Fool’s Day.\nMistakes like these have long been known to be a source of serendipitous creativity and many of the words we use are the result of transcription errors.\nAdoption: Also called “loanwords.” English in particular is a language of adoption. We borrow and integrate words from everywhere. In the purest sense, most of what we think of as English is really a mixture of Norman, Old English, French, Latin, and every other European culture. We use “clichés” without even considering we are thinking in French. We gamble in “casinos,” which are Italian, as are “umbrellas,” “volcanoes,” “broccoli,” “jeans,” “manifestos,” and “wigs.” “Walrus,” and “gremlin,” are Scandinavian. “Intelligentsia” is Russian. “Bog,” “glamour,” “gruesome,” and “weird” are Scottish. “Boycott” and “brogue” are Irish.\nThere are thousands of examples of loanwords: “pajama” and “shampoo” are Hindi, “ketchup” and “tea” are Chinese, “chocolate” and “chili” are Aztec. “Chess,” “magic,” “angel,” and “peach” are all Persian. “Boondocks” is Tagalog. “Banana” and “mumbo jumbo” are African. And then there are words called “calque” words which are translations from other languages like “flea market” which is from the French “marché aux puces” which literally means “market of the fleas.”\nSo the English language is a great integrator of words from other languages.\nProtologisms: Protologisms are words created by somebody in the hopes that they’ll survive and become part of a natural vocabulary. Where do they come from? Science creates new words all the time such as “quark” and “robot,”2 and acronyms such as “scuba” and “laser” can become popular and common. Writers also create new words. Two writers that come to mind are Orwell (see above) and J.K. Rowling with her “hinkypunks.” I’m tempted to include Shakespeare, but he didn’t so much create words as he did expressions which have become clichés: “love is blind,” “all the world’s a stage,” “brave new world,” “the winter of our discontent.” I could go on but brevity is the soul of wit. When a word has no real etymology, it’s a good sign it was made up somewhere along the way. Protologisms can be invented from onomatopoeia like with “cuckoo” and from phono-semantic matching, which is matching new words with the sounds of similar existing words. The Mandarin term for “World Wide Web,” for example is wàn, wéi, wăng, which means “myriad dimensional net.”\nThe word “neologism” itself was at one time a protologism: it entered our vocabulary somewhere between the 1400’s and the 1800’s.\nContext: “Hamburger” was originally a steak named after the German city where it was popular and the clipped word “burger” followed that. Now “burger” can be applied to any sort of food pressed into a patty: like cheeseburger or veggie-burger. “Maverick” comes from Samuel Maverick, a rancher who didn’t brand his calves; therefore a “maverick” was an unbranded calf. Now it is any person who doesn’t follow the crowd. Words change over time as the culture changes around them. “Apple,” in old English meant any kind of fruit. “Green” was once only a color and now it is the environmental ideology. “Awful” was once deserving of awe. “Girl” was once just a young person, male or female. “Pretty” began as crafty, which mutated into clever or skillfully made, then mutated into refined/fine and landed on beautiful. If you don’t feel like making up new words just wait a while. Given enough time, culture will re-invent itself around existing words.\nAddition or Subtraction: New words are also created by combining and adding to them or by subtracting from them. “Smog” was a portmanteaux created by combining “smoke” and “fog.” “Earthquake” obviously came from compounding “earth” and “quake.” “Ad” came from clipping “advertisement.” And then there is agglutination: forming new words by adding affixes to them. If you found yourself confused in English class about proper usage, it was probably because English is an organic and living language (not to mention its grammar was stolen wholesale from Latin and makes no sense in English.) Nobody really knows what the rules of English are, to be honest, and we just invent rules and words all the time. For example, as author Bill Bryson points out, we have six ways of making “labyrinth” into an adjective: labyrinthian, labyrinthean, labyrinthal, labyrinthine, labyrinthic, and labyrinthical. This is because of how many prefixes and suffixes we have in English and how indiscriminately we use them. Incidentally, my spellchecker doesn’t recognize four of these six examples, but it does recognize the word “spellchecker.” We live in an extremely information rich environment and synthetically modifying words and phrases is almost a requirement for speaking now.\nSignal and Noise\nWe are told that the universe always moves in the direction of greater disorder: from a more useful state to a less useful state. But we are also told that some processes (like Life itself and Intelligence) try to combat this trend by cherry-picking the results of that disorder. Life takes all the good stuff and leaves all the bad stuff. As a result, information and entropy are always competing with each other.\nFor example, all the early developers of Information Science found that the bigger and more complex their communication tools got, the more chance there was for noise to creep into those systems. Specifically the longer telephone cables became, the weaker and more confused the signal passing through the cables got. Signal and noise are like the white-hatted and black-hatted characters in a Western novel, and signal-to-noise ratio is the novel’s plot. This is as true in the growth of our languages as it is in Information Science: the more complex our language and thoughts are, the more room there is for distortion to flourish.\nOf the 6000 to 7000 languages that exist on the planet today, a quarter to a half of them are not being taught to new generations, meaning they are effectively dead languages. But new words are also born all the time. Technology and pop culture change word contexts so fast that any example from them I could provide as proof would be outdated by the time this went to print. Text-messaging, blogs, (both neologisms) and digital Darwinism are changing the meanings of words second by second. And it begs the question: how will people speak in the deep future? Will we speak a mishmash language like City Speak from “Blade Runner?” Will we speak in some alternative, pseudo-English like Nadsat from “A Clockwork Orange?” Will we mumble to each other in a managed, totalitarian language like Newspeak? Will we all need Babel Fish to communicate? These are useful things to consider for would-be science fiction authors or to readers interested in what kind of symbolic universe we will inhabit tomorrow.\nEnglish is being created as quickly as it is being destroyed, it’s mutating so fast that studying its neologisms can be like watching the succession of fruit flies being born, reproducing and dying in a petri-dish all in a matter of days. Entire subcultures can rise up and disappear overnight, and the chaotic edge of that process is exactly where I want to be.\nFOOTNOTES:\n1 - Except in Psychology, where curiously, “neologism” means something a little different. In that field it refers to the private, tinfoil-hat-words invented by patients, which have no meaning to anyone else. Perhaps it is merely a coincidence that only the field of Psychology has invented a neologistic use for the word “neologism,” thereby exhibiting the behavior it is describing. I’m just speculating here.\n2 - Or in the later case science fiction. Josef Čapek coined the concept of the “robot,” based on a Czech word for drudgery, and Isaac Asimov added the science of “robotics.”\nKerry spends 9 months of the year working as a private investigator and 3 months of the year working as a Sherpa in the Himalayas. His work has appeared in Surprising Stories, Orion's Child, Antipodean SF, Aurealis, subTerrain, Filling Station, Descant, Utne Reader as well as many others.", "source": "https://clarkesworldmagazine.com/fraser_02_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Neologism and Linguicide by Kerry Tynan Fraser"}