{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "4CTfMBOuP0eTjftXssTmBnyZFDs=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Occult Agencies and Political Satire: A Conversation with Charles Stross  Novels can be clever or profound. They can be funny or horrifying. But rarely are they ever profoundly funny and yet stray into the kind of stuff reserved for nightmares. When a story gets just the right mix of lurking monsters, mathematical magic, and an unreliable character exhausted by paperwork, you may find yourself in a Charles Stross novel.  The newest novel in the Laundry Files series is The Delirium Brief. Bob Howard works at The Laundry, a not-so-secret government agency tasked with dealing with the various things that go bump in the night. After the events of The Nightmare Stacks where a monstrous invasion in Yorkshire, England outed the once secret occult agency, Bob is tasked with some PR damage control. He quickly gets embroiled in a whole new kind of horror: a government conspiracy.  Charles Stross is the award-winning author of numerous novels. He’s won the Hugo and Locus Awards and has been nominated for the John W. Campbell Memorial Award, Arthur C. Clarke Award, and the Japanese Seiun Award. His newest novel in the Laundry Files series, The Delirium Brief, was released by Tor.com on July 11.   What are some of the challenges of writing a long-running series? How do you keep things fresh and engaging while making it somewhat accessible to new readers?  I’m currently juggling two long-running series, both around the million word mark, and they both get harder with each successive book. However, the problems I deal with in each series are different because they follow a different structure.  The Merchant Princes series—now rebooted in the form of a new trilogy, Empire Games, set a generation after the original series—actually consists of a couple of very big stories, set consecutively and involving the same protagonists, that had to be divided up into multiple books due to their length. These stories are self-contained, but cover a lot of ground with an ensemble cast of protagonists and an evolving world.  Meanwhile, the Laundry Files started out as a single short novel, then acquired sequels. As the setting acquired more furniture and more secondary characters the background got deeper and more complex and some of the secondary characters demanded their own novels. The books can mostly be approached independently, although there’s an underlying sequence and background in earlier novels that sets up later stories.  Keeping track of a million words of backstory is hard for my middle-aged brain, but there are a couple of neat tricks you can use to manage it if you’re not the kind of author who writes an exhaustive series bible as they go along: firstly, you decree that your narrator (Bob, in the Laundry Files) is unreliable and doesn’t understand everything he sees, thereby allowing you to retcon new twists on old mistakes (“I meant to do that!”). And secondly, there’s GRRM’s classic rule: “when I find I’m juggling too many protagonists, I kill a few of them. It keeps the readers on their toes and makes life easier for me.” (Paraphrased, not a direct quote.)  Humor plays a part in your new novel. What kind of humor do you think works best in novels?  Whatever kind the author is capable of emitting? Seriously, I have no idea how many different kinds of humor there are, or how to anatomize them!  The Laundry Files started with an element of situational comedy juxtaposed on a background of nightmarish horror: the government agency for protecting us from the likes of Cthulhu turns out to be just another secret civil service bureaucracy with forms, committee meetings, and an obsession with secrecy. Into which we inject a narrator who is a brash young hacker-nerd from the late 90s dot-com culture (who has been conscripted willy-nilly into something structured a lot like a very 1950s-ish Len Deighton spy agency, if updated in line with health and safety and HR legislation). “The inappropriate hero” is one of the classic humorous narrative forms because it gives us a sympathetic viewpoint from which to explore the lunacy of a situation, and there’s plenty of humor in any bureaucracy (as the early Dilbert cartoon strips illustrated, before it jumped the shark circa 1998).  By the eighth book in the Laundry Files, Bob isn’t an outsider anymore; indeed, he’s at the lower end of senior management, representing the agency in public. But there’s still plenty of situational humor to be extracted by watching how a government deals with a whole new bureaucracy it was hitherto unaware it possessed.  And then, of course, there’s the horror element. Like humor, horror is a tone you can apply to any other genre of fiction. (You can have a horror-spy crossover, or horror on top of SF, or horror on top of historical fiction, or . . .) And I find combining horror and humor particularly useful because the one contrasts with the other to great effect.  Do you have a particular recipe that makes up a Laundry Files novel? Have you ever found while editing that you might have a bit too much of one particular spice?  The first four books in the series were, individually, tributes to specific British Cold War thriller writers (Len Deighton, Ian Fleming, Anthony Price, and Peter O’Donnell respectively). After I ploughed that field, I then switched to writing pastiches of different urban fantasy genres: I did vampires, superheroes, unicorns (in a novella), and elves (with a side order of Lovecraftian dragons).  But as of The Delirium Brief the universe of the Laundry Files got so dense and self-referential that there wasn’t really room to pastiche any other author or sub-genre: it had become more or less self-sustaining, and big enough that it needed more than the single first-person narrator (Bob) I started off with. Future Laundry stories won’t be pastiches either, for the same reason (although there may be some sly nods at inspirational sources).  Do you feel like the current political climate of the U.K. has influenced this novel at all? I saw mention of asylum seekers.  Yes.  I wrote the original draft of The Delirium Brief in late 2015 to early 2016, and was just about to submit it to my editors when the Brexit referendum upset happened. And within two weeks I realized that I had to rewrite about half the book.  The original version had a fairly simple plot conceit: after the events of The Nightmare Stacks the Laundry has been exposed publicly, and thus comes to the attention of a thinly-disguised version of the 2010-15 UK coalition government, who do what British governments since 1979 have done, and try to privatize the agency (with a side-order of crony capitalism and corruption). So I had a line of delicate British political satire . . . and then we had two party leadership challenges and three constitutional crises break in two weeks flat, culminating in the appointment of Boris Johnson as Foreign Secretary. Satire was not merely dead; its withered corpse had been exhumed and paraded through the streets on a litter borne by clowns. And I had to go back to the drawing board, tear up about 55,000 words, and rewrite the whole damned thing to give it some bite.  Math, science, and magic are all sort of rolled into one in your Laundry Files novels. What made you ground the fantastic in something logical?  As Arthur C. Clarke observed, any sufficiently advanced technology is indistinguishable from magic. This aphorism works just as well inverted; what we don’t understand we used to call magic, and if magic presented itself to us today the rational urge would try and systematize and explain it. To most people today we live in a magical world, where mysterious entities in our ghost-haunted machines interpret our desires; meanwhile, if we actually had a working form of magic, its practice would probably end up a lot like software engineering—bounded by regulations, unfolding in accordance with development methodologies and project plans, and carried out by team-work.  Is there a knack to writing great dialogue? What is it?  Know your characters? Try and make their speech patterns distinctively their own? Don’t underestimate the importance of word-play? Beyond that, I’ve got nothing: it just takes a lot of practice!  The Laundry Files novels feature a number of different protagonists. Whose perspective is your favorite to write from and why?  Originally the series was all Bob, all of the time. Because it wasn’t really about the Laundry—it was about Bob.  Some time after my editor at Ace pinned a series title on these books (I didn’t come up with “The Laundry Files!”) I realized a couple of things. Firstly, there were stories that Bob couldn’t tell; I needed different viewpoints for them. (As Bob is an unreliable narrator, if I want to show the reader just how unreliable he is, I need to step completely outside his head.) And secondly, Bob was leveling up too rapidly to sustain a series for very long. In The Rhesus Chart there’s a scene which is telling, by implication: Bob accidentally walks into a nest of vampires . . . and escapes with his hair mussed and his dignity in shreds, but basically undamaged. He could no longer serve as a naïve, wet-behind-the-ears low level dogsbody viewpoint—he knew too much and was far too formidable. So I needed to switch around and use other sets of eyeballs to show what was going on.  First up was Dr. Dominique O’Brien, Bob’s wife—and cause of considerable hate mail from fans of the series who were really fans of Bob Howard, cuddly uber-hacker-bro-dude and Olympic gold medalist at self-deception. Mo, his wife of some years, harbored very few delusions about her husband; but this came as an unwelcome bucket of cold water over the heads of those readers who read Bob naïvely as a relatable hero-protagonist. And Mo is, in many ways, the more competent of the two of them (and also the more brittle: The Annihilation Score was her a nervous breakdown novel, with superheroes).  Next up was Alex Schwartz, junior vampire and bumbling wunderkind. By The Nightmare Stacks, the threats facing the agency had levelled up almost as much as Bob’s personal power; so I needed a new entry-level protagonist. Alex is a replacement for the young Bob, with added mojo to deal with the new challenges. He’s less self-deluding and less over-confident, which is good: he also has serious self-confidence issues centering around his case of PHANG syndrome. All in all, he’s more interesting to write than Bob these days (although I’m not sure I dare write much more from the perspective of Cassie, his manic pixie dream girl: she’s even less human than her vampire nerd boy, and conveying that sort of thing convincingly is hard work).  And the next viewpoint protagonist on stage will be Mhari Murphy, the narrator of The Labyrinth Index, but I’d like to keep that story a surprise for now. Let’s just say that Mhari, who Bob remembers as his ex- from hell (returned as a vampire working in Human Resources) and Mo relates to her as a somewhat chilly but efficient number two from an occult police force, is actually something else again.  How do you discover the voices for each character? Does the personality come first and then the voice or do you build the character around a particular voice?  I can’t help you—it all happens in parallel, and I can’t really disentangle those threads!  What made you choose to write these novels as a sort of diary or recounting of events? Did it provide more room for mystery and an unreliable narrator?  Nope, it was an accident.  The original short novel, The Atrocity Archives, wasn’t written with any expectation of a sequel. I picked first-person present tense because it’s an easy way to convey immediacy and tension, and easy to convey a voice, if you can put yourself in your narrator’s shoes. (Received wisdom seems to be that beginners should write novels in tight third person past tense, but I actually find first-person present makes for better training wheels: it enforces the tight viewpoint, forces you to develop your protagonist’s voice, and helps you identify slow pacing.)  Then I ended up being asked to write a sequel novella, and then another novel, and ran into a problem: first person narratives imply that the narrator survives the story.  This is a huge headache if you’re writing a horror story (or even a humorous horrifying spy thriller) because it implicitly defuses the tension. But when I got to The Fuller Memorandum I realized that if I framed it as a confidential diary written after the event I could leave the reader guessing—is Bob going to suddenly stop, and the narrative switch to another narrator in the closing chapters? It also gave me permission to step outside Bob’s head and go third-person with reaction shots by other characters—something I used increasingly in The Delirium Brief. (Bob is the only first-person narrator in The Delirium Brief but we get tight third person accounts from Mo, Mhari, Persephone, Alex, and Cassie.)  And of course, once Bob is keeping a workplace diary to ensure his successor knows what he’s been doing if he is unavailable, it was logical for Mo, Alex, et al. to do likewise.  How has Bob evolved over the course of the series? Has his character surprised you at all while writing?  Bob started out (in 1999) a decade younger than his author. As there was a five year gap before I wrote the second novel, and a three year gap before the third, I couldn’t leave Bob stranded in the past—especially as his conceptual waypoints are technological artifacts. So in The Jennifer Morgue I decided to have Bob age twelve months for every year that passed in the real world, and kept it up right up until The Nightmare Stacks, which is set in mid-2014. (From that point on, the Laundry novels are set in a wildly divergent world—a world in which the Lovecraftian Singularity of CASE NIGHTMARE GREEN has already occurred and by mid-2015 the UK is ruled by Nyarlathotep. (What’s going on in America in the meantime is the subject of The Labyrinth Index.)  Anyway: the mid-twenties, brash, cocky Bob of The Atrocity Archives is a married, cynical, early-thirties Bob by The Fuller Memorandum, a late-thirties marriage-in-trouble senior Bob by The Rhesus Chart, and as of The Delirium Brief he’s forced to grow the hell up and stop kidding himself (spoiler: he’s really unhappy about this).  I had no idea when I wrote The Atrocity Archives that Bob was going to get married and turn middle-aged on me. Nor did I know that Bob, who was initially a dogsbody, was going to turn into a terrifying organization monster like Angleton. I’m still not sure I know where Bob is going, at this point. What I do know is, he’s very unlikely to die in bed at this rate.  Would you ever work at The Laundry? If so, what would be your job?  If I woke up in the universe of the Laundry, I would be strongly tempted to commit suicide. Because, seriously? The Elder Gods are returning. And when Bob asserted in Equoid that “Cthulhu does not exist,” he was being, shall we say, an unreliable narrator . . .  What other projects do you have in the works?  I’m still finishing up the Empire Games trilogy; the second book, Dark State, comes out in January 2018, and my next job is to rewrite the second half of book three, Invisible Sun (due out January 2019).  I’m also working on a stand-alone space opera, Ghost Engine, which was previously expected in mid-2018, but which I’m pushing back a year (it needs time for another draft and I don’t want to force the pace of work on it). Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nOccult Agencies and Political Satire: A Conversation with Charles Stross\nNovels can be clever or profound. They can be funny or horrifying. But rarely are they ever profoundly funny and yet stray into the kind of stuff reserved for nightmares. When a story gets just the right mix of lurking monsters, mathematical magic, and an unreliable character exhausted by paperwork, you may find yourself in a Charles Stross novel.\nThe newest novel in the Laundry Files series is The Delirium Brief. Bob Howard works at The Laundry, a not-so-secret government agency tasked with dealing with the various things that go bump in the night. After the events of The Nightmare Stacks where a monstrous invasion in Yorkshire, England outed the once secret occult agency, Bob is tasked with some PR damage control. He quickly gets embroiled in a whole new kind of horror: a government conspiracy.\nCharles Stross is the award-winning author of numerous novels. He’s won the Hugo and Locus Awards and has been nominated for the John W. Campbell Memorial Award, Arthur C. Clarke Award, and the Japanese Seiun Award. His newest novel in the Laundry Files series, The Delirium Brief, was released by Tor.com on July 11.\nWhat are some of the challenges of writing a long-running series? How do you keep things fresh and engaging while making it somewhat accessible to new readers?\nI’m currently juggling two long-running series, both around the million word mark, and they both get harder with each successive book. However, the problems I deal with in each series are different because they follow a different structure.\nThe Merchant Princes series—now rebooted in the form of a new trilogy, Empire Games, set a generation after the original series—actually consists of a couple of very big stories, set consecutively and involving the same protagonists, that had to be divided up into multiple books due to their length. These stories are self-contained, but cover a lot of ground with an ensemble cast of protagonists and an evolving world.\nMeanwhile, the Laundry Files started out as a single short novel, then acquired sequels. As the setting acquired more furniture and more secondary characters the background got deeper and more complex and some of the secondary characters demanded their own novels. The books can mostly be approached independently, although there’s an underlying sequence and background in earlier novels that sets up later stories.\nKeeping track of a million words of backstory is hard for my middle-aged brain, but there are a couple of neat tricks you can use to manage it if you’re not the kind of author who writes an exhaustive series bible as they go along: firstly, you decree that your narrator (Bob, in the Laundry Files) is unreliable and doesn’t understand everything he sees, thereby allowing you to retcon new twists on old mistakes (“I meant to do that!”). And secondly, there’s GRRM’s classic rule: “when I find I’m juggling too many protagonists, I kill a few of them. It keeps the readers on their toes and makes life easier for me.” (Paraphrased, not a direct quote.)\nHumor plays a part in your new novel. What kind of humor do you think works best in novels?\nWhatever kind the author is capable of emitting? Seriously, I have no idea how many different kinds of humor there are, or how to anatomize them!\nThe Laundry Files started with an element of situational comedy juxtaposed on a background of nightmarish horror: the government agency for protecting us from the likes of Cthulhu turns out to be just another secret civil service bureaucracy with forms, committee meetings, and an obsession with secrecy. Into which we inject a narrator who is a brash young hacker-nerd from the late 90s dot-com culture (who has been conscripted willy-nilly into something structured a lot like a very 1950s-ish Len Deighton spy agency, if updated in line with health and safety and HR legislation). “The inappropriate hero” is one of the classic humorous narrative forms because it gives us a sympathetic viewpoint from which to explore the lunacy of a situation, and there’s plenty of humor in any bureaucracy (as the early Dilbert cartoon strips illustrated, before it jumped the shark circa 1998).\nBy the eighth book in the Laundry Files, Bob isn’t an outsider anymore; indeed, he’s at the lower end of senior management, representing the agency in public. But there’s still plenty of situational humor to be extracted by watching how a government deals with a whole new bureaucracy it was hitherto unaware it possessed.\nAnd then, of course, there’s the horror element. Like humor, horror is a tone you can apply to any other genre of fiction. (You can have a horror-spy crossover, or horror on top of SF, or horror on top of historical fiction, or . . .) And I find combining horror and humor particularly useful because the one contrasts with the other to great effect.\nDo you have a particular recipe that makes up a Laundry Files novel? Have you ever found while editing that you might have a bit too much of one particular spice?\nThe first four books in the series were, individually, tributes to specific British Cold War thriller writers (Len Deighton, Ian Fleming, Anthony Price, and Peter O’Donnell respectively). After I ploughed that field, I then switched to writing pastiches of different urban fantasy genres: I did vampires, superheroes, unicorns (in a novella), and elves (with a side order of Lovecraftian dragons).\nBut as of The Delirium Brief the universe of the Laundry Files got so dense and self-referential that there wasn’t really room to pastiche any other author or sub-genre: it had become more or less self-sustaining, and big enough that it needed more than the single first-person narrator (Bob) I started off with. Future Laundry stories won’t be pastiches either, for the same reason (although there may be some sly nods at inspirational sources).\nDo you feel like the current political climate of the U.K. has influenced this novel at all? I saw mention of asylum seekers.\nYes.\nI wrote the original draft of The Delirium Brief in late 2015 to early 2016, and was just about to submit it to my editors when the Brexit referendum upset happened. And within two weeks I realized that I had to rewrite about half the book.\nThe original version had a fairly simple plot conceit: after the events of The Nightmare Stacks the Laundry has been exposed publicly, and thus comes to the attention of a thinly-disguised version of the 2010-15 UK coalition government, who do what British governments since 1979 have done, and try to privatize the agency (with a side-order of crony capitalism and corruption). So I had a line of delicate British political satire . . . and then we had two party leadership challenges and three constitutional crises break in two weeks flat, culminating in the appointment of Boris Johnson as Foreign Secretary. Satire was not merely dead; its withered corpse had been exhumed and paraded through the streets on a litter borne by clowns. And I had to go back to the drawing board, tear up about 55,000 words, and rewrite the whole damned thing to give it some bite.\nMath, science, and magic are all sort of rolled into one in your Laundry Files novels. What made you ground the fantastic in something logical?\nAs Arthur C. Clarke observed, any sufficiently advanced technology is indistinguishable from magic. This aphorism works just as well inverted; what we don’t understand we used to call magic, and if magic presented itself to us today the rational urge would try and systematize and explain it. To most people today we live in a magical world, where mysterious entities in our ghost-haunted machines interpret our desires; meanwhile, if we actually had a working form of magic, its practice would probably end up a lot like software engineering—bounded by regulations, unfolding in accordance with development methodologies and project plans, and carried out by team-work.\nIs there a knack to writing great dialogue? What is it?\nKnow your characters? Try and make their speech patterns distinctively their own? Don’t underestimate the importance of word-play? Beyond that, I’ve got nothing: it just takes a lot of practice!\nThe Laundry Files novels feature a number of different protagonists. Whose perspective is your favorite to write from and why?\nOriginally the series was all Bob, all of the time. Because it wasn’t really about the Laundry—it was about Bob.\nSome time after my editor at Ace pinned a series title on these books (I didn’t come up with “The Laundry Files!”) I realized a couple of things. Firstly, there were stories that Bob couldn’t tell; I needed different viewpoints for them. (As Bob is an unreliable narrator, if I want to show the reader just how unreliable he is, I need to step completely outside his head.) And secondly, Bob was leveling up too rapidly to sustain a series for very long. In The Rhesus Chart there’s a scene which is telling, by implication: Bob accidentally walks into a nest of vampires . . . and escapes with his hair mussed and his dignity in shreds, but basically undamaged. He could no longer serve as a naïve, wet-behind-the-ears low level dogsbody viewpoint—he knew too much and was far too formidable. So I needed to switch around and use other sets of eyeballs to show what was going on.\nFirst up was Dr. Dominique O’Brien, Bob’s wife—and cause of considerable hate mail from fans of the series who were really fans of Bob Howard, cuddly uber-hacker-bro-dude and Olympic gold medalist at self-deception. Mo, his wife of some years, harbored very few delusions about her husband; but this came as an unwelcome bucket of cold water over the heads of those readers who read Bob naïvely as a relatable hero-protagonist. And Mo is, in many ways, the more competent of the two of them (and also the more brittle: The Annihilation Score was her a nervous breakdown novel, with superheroes).\nNext up was Alex Schwartz, junior vampire and bumbling wunderkind. By The Nightmare Stacks, the threats facing the agency had levelled up almost as much as Bob’s personal power; so I needed a new entry-level protagonist. Alex is a replacement for the young Bob, with added mojo to deal with the new challenges. He’s less self-deluding and less over-confident, which is good: he also has serious self-confidence issues centering around his case of PHANG syndrome. All in all, he’s more interesting to write than Bob these days (although I’m not sure I dare write much more from the perspective of Cassie, his manic pixie dream girl: she’s even less human than her vampire nerd boy, and conveying that sort of thing convincingly is hard work).\nAnd the next viewpoint protagonist on stage will be Mhari Murphy, the narrator of The Labyrinth Index, but I’d like to keep that story a surprise for now. Let’s just say that Mhari, who Bob remembers as his ex- from hell (returned as a vampire working in Human Resources) and Mo relates to her as a somewhat chilly but efficient number two from an occult police force, is actually something else again.\nHow do you discover the voices for each character? Does the personality come first and then the voice or do you build the character around a particular voice?\nI can’t help you—it all happens in parallel, and I can’t really disentangle those threads!\nWhat made you choose to write these novels as a sort of diary or recounting of events? Did it provide more room for mystery and an unreliable narrator?\nNope, it was an accident.\nThe original short novel, The Atrocity Archives, wasn’t written with any expectation of a sequel. I picked first-person present tense because it’s an easy way to convey immediacy and tension, and easy to convey a voice, if you can put yourself in your narrator’s shoes. (Received wisdom seems to be that beginners should write novels in tight third person past tense, but I actually find first-person present makes for better training wheels: it enforces the tight viewpoint, forces you to develop your protagonist’s voice, and helps you identify slow pacing.)\nThen I ended up being asked to write a sequel novella, and then another novel, and ran into a problem: first person narratives imply that the narrator survives the story.\nThis is a huge headache if you’re writing a horror story (or even a humorous horrifying spy thriller) because it implicitly defuses the tension. But when I got to The Fuller Memorandum I realized that if I framed it as a confidential diary written after the event I could leave the reader guessing—is Bob going to suddenly stop, and the narrative switch to another narrator in the closing chapters? It also gave me permission to step outside Bob’s head and go third-person with reaction shots by other characters—something I used increasingly in The Delirium Brief. (Bob is the only first-person narrator in The Delirium Brief but we get tight third person accounts from Mo, Mhari, Persephone, Alex, and Cassie.)\nAnd of course, once Bob is keeping a workplace diary to ensure his successor knows what he’s been doing if he is unavailable, it was logical for Mo, Alex, et al. to do likewise.\nHow has Bob evolved over the course of the series? Has his character surprised you at all while writing?\nBob started out (in 1999) a decade younger than his author. As there was a five year gap before I wrote the second novel, and a three year gap before the third, I couldn’t leave Bob stranded in the past—especially as his conceptual waypoints are technological artifacts. So in The Jennifer Morgue I decided to have Bob age twelve months for every year that passed in the real world, and kept it up right up until The Nightmare Stacks, which is set in mid-2014. (From that point on, the Laundry novels are set in a wildly divergent world—a world in which the Lovecraftian Singularity of CASE NIGHTMARE GREEN has already occurred and by mid-2015 the UK is ruled by Nyarlathotep. (What’s going on in America in the meantime is the subject of The Labyrinth Index.)\nAnyway: the mid-twenties, brash, cocky Bob of The Atrocity Archives is a married, cynical, early-thirties Bob by The Fuller Memorandum, a late-thirties marriage-in-trouble senior Bob by The Rhesus Chart, and as of The Delirium Brief he’s forced to grow the hell up and stop kidding himself (spoiler: he’s really unhappy about this).\nI had no idea when I wrote The Atrocity Archives that Bob was going to get married and turn middle-aged on me. Nor did I know that Bob, who was initially a dogsbody, was going to turn into a terrifying organization monster like Angleton. I’m still not sure I know where Bob is going, at this point. What I do know is, he’s very unlikely to die in bed at this rate.\nWould you ever work at The Laundry? If so, what would be your job?\nIf I woke up in the universe of the Laundry, I would be strongly tempted to commit suicide. Because, seriously? The Elder Gods are returning. And when Bob asserted in Equoid that “Cthulhu does not exist,” he was being, shall we say, an unreliable narrator . . .\nWhat other projects do you have in the works?\nI’m still finishing up the Empire Games trilogy; the second book, Dark State, comes out in January 2018, and my next job is to rewrite the second half of book three, Invisible Sun (due out January 2019).\nI’m also working on a stand-alone space opera, Ghost Engine, which was previously expected in mid-2018, but which I’m pushing back a year (it needs time for another draft and I don’t want to force the pace of work on it).\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/stross_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Occult Agencies and Political Satire: A Conversation with Charles Stross by Chris Urie"}