{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jess Barber; Sara Saab", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "oAhvuBWeX0WhCu2lbuGIM8yiHz8=", "id": null, "license": null, "comments": "", "raw_text": "12030 words, novelette  Pan-Humanism: Hope and Pragmatics  1: THE MOST HALLOWED OF OUR SPACES  Amir Tarabi is scrubbing himself down in the misting rooms the first time he meets Mani Rizk.  The mister in Beirut-4 is being upgraded, the zone’s residents using Beirut-3’s misting rooms on rotation, so it is especially crowded that day. Amir avoids making eye contact with the bathers in adjacent patches with rigorous politeness. At sixteen, he’s already spent a hundred personal growth hours thinking about civic decency, appreciates the role of uninterrupted private rituals in fostering social cohesion—  —then someone comes out of the mist and straight into his line of vision, Amir thinks by accident. He tries to keep his eyes on what he’s doing. The sparse rivulets of soapy water starting in his elbows and armpits are usually an easy bliss to meditate on, how they track down his skin, how they catch and collect on little hairs. Water coalescing from mist doesn’t have enough body to drip to the floor. Amir can feel it evaporate at his hips, his thighs, his ankles.  “Excuse me?” says the interrupting someone-who-turns-out-to-be-Mani, and Amir’s head lifts before his principles regroup. Her teeth are chattering but she smiles gamely through it. “My patch is really cold. Does that happen?”  “Not that I remember?” he says. “Show me?”  “Sure,” she clatters. “Thanks. This way.”  He doesn’t recall ever being approached by another bather in the mist before. She’s naked, so is he, so is everyone. Nudity isn’t weird in water-scarce Beirut at the height of summer. Less clothing means less sweat. It’s her still-soapy hair that strikes him: so thick that there’s two inches of it plastered soaking to her head, which of course means she’s nearly at the end of her timeslot. The mist takes a long time to permeate a head of hair.  It’s so crowded. They weave through an infinity mirror of bathing bodies which fade in the middle distance into a wall of mist. Amir wonders what brought his new friend all the way to his patch when any neighbor would’ve been glad to help.  “You’re from Beirut-4?” he asks.  “The finest of all arbitrary urban planning constructs,” she calls behind her.  At sixteen, Amir doesn’t believe in competitive jokes about city zones, just as he doesn’t believe in identities constructed in opposition. He doesn’t say anything. It doesn’t seem the right moment.  Mani finds the four lit wands in the mist that mark the corners of patch 49.  “Cold, right?”  Amir steps solemnly into the center of her patch for a few seconds. The concentrated plume of mist envelops him.  “Feels okay to me?”  Mani shoots him an aghast look, moves into her patch as Amir steps out. She gives a long-suffering sigh. “Why are they upgrading our mister? Beirut-3 needs it more.”  “Are you sure you’re not physiologically reacting to a new environment?” Amir counters. “All the misters have the same temperature settings.”  “Is that so?” Mani says.  “Pretty sure.”  She readies a retort, then shakes it off. “Thanks anyway,” she says, kneading her hair. “I pulled you away while your mist is running.” Sudsy water trickles onto her shoulders.  “That’s okay. Enjoy your shower,” Amir says, and waves himself off. Enjoy your shower. He’s vaguely disappointed by the whole exchange for a reason he can’t examine.  In the airing room, hot blasts of air spread warmth through his chest. This fills him with something like gratitude. He second-guesses whether he might’ve been cold, before.  “Two degrees lower,” says a voice he recognizes.  “Really?” he says after a moment. Now he’s vaguely happy for reasons he can’t place.  “I asked the supervisor. By community agreement, motion passed five years ago, the Beirut-3 misting room is two degrees cooler than default in summer.”  “Ah,” says Amir. “Good of you to correct a misbelief.”  “My pan-humanist agenda’s pretty on point,” she says. The wry note in her voice doesn’t irritate him. “I’m Mani. I live near al-Raouché. Want to do a personal growth hour together?”  Amir doesn’t remember what he stammered then, but it must’ve been affirmative, because the rest of his teenage days have Mani in them, as the water situation worsens, then gets a bit better, then worsens, then stabilizes.  It’s a lot of days to have with someone. A lot of staring at the cloudless sky on a blanket from the exposed seabed of al-Raouché, a lot of synth-protein shawarmas in Hamra, a lot of silent meditative spans huddled in Mani’s bed because talking hurts too much with the thirst and their mouths so dry.  But it’s also true that all the days in a human life can feel like not enough.  The first time the water situation shows signs of getting better is a Monday. Amir knows this because that’s the day for municipal announcements in Beirut-1 through -5. He and Mani are sitting in a seabed café in the shadow of al-Raouché. The rock pillar’s become a sort of geologic Champs-Élysées, and though the bay has begun to recover from the decades of hyperwarming that dried it out, Beirut Grid have installed a seawall to protect the shops and cafés that went up while water was critically scarce.  “It’s oddly beautiful,” Amir says to Mani. The seawall is muraled with depictions of water-protection craft, the lighthouse, the rickety old Ferris wheel on the boardwalk. Beyond it, the sea shushes loudly. The sun festers behind the clouds and because Amir and Mani have been through screen-mist they’re lounging in just swim knickers.  Amir rotates his cup and watches bits of tealeaf bob near the bottom. “Do you think it’s unethical to celebrate a built environment that’s a direct result of water scarcity?” he asks.  Mani looks up from her book: Pan-Humanism in the Middle East. It’s just come out, and she’s been excited to read it because it challenges some of the core arguments of Stella Kadri’s Pan-Humanism: Hope and Pragmatics, a book of heroic stature for how it butterfly-effected the sociopolitics of the modern world.  “Not unethical to feel joy if no one’s suffering,” she says.  “Fish desperate to swim figure eights around al-Raouché could be suffering.”  “You have to draw a line where arguments descend into absurdity.” She cracks a smile, powers off her book.  “But there’s nothing absurd about a healthy marine ecosystem,” Amir says. Her pragmatism makes him uneasy. As a life skill it sits uncomfortably against his complete dedication to absolutes: the True, the Good. But it’s captivating. It makes her quick to laughter and gracious, even excited, about changing her mind.  Mani gulps her tea. “Still hot. So now I’ve burned my tongue worrying about the fish.” She glances down. “Didn’t I turn that off?” Her book’s flashing a notification. So’s her watch. So are her shades.  Amir blows on his tea before he sips. “On override? Must be important.”  They read the message, heads hovering together. It’s from the municipality. Beirut Water pilot. First sectors, random pick: Beirut-4, Beirut-9. Water reconnected via mains for 24hrs from 2PM. OK: taps, showers, hoses. Use judgment: industrial electronics.  It takes a moment to sink in.  “Wait. Are you kidding?”  “I had no idea they were ready to try,” Mani says.  They’re both gathering their things, tapping over a tab-close, standing. “Warsaw managed to run a water supply off a condensation system for a week,” Amir says. “But this is Beirut.”  “So what if it is?” Mani says. “Beirut is superb! Beirut has water!”  They’re skipping along the stairs to the boardwalk. A louder murmur than the sea is rising from the seabed café: the municipality message spreading.  They reach Mani’s house in record time. It’s a hot day and Amir is itching from sweat and screen residue with an urgency he’s never felt before.  “Mom? There’s water!” Mani shouts into the dark house.  “No one,” says Amir.  “Ah, she’s got an hour of cross-skilling this afternoon.”  “Should we wash our hands?” Amir pants, chasing Mani up the stairs.  “Don’t be ridiculous. Have to go all the way.” She opens a door in the hall. “In here.”  Amir follows her. She’s planted in front of a bone-dry shower stall. The showerhead is impossibly shiny. There’s still a bit of plastic wrapping on it. It’s an antique, but brand new.  “It’s nearly two o’clock.”  “Are they going to be able to do this?”  “Trust, Amir. Trust.”  “Do you think it might even be heated?”  Mani, scooting out of her swim knickers, raises her eyebrows at him till he shoves his down too. “I bet it is.” She reaches into the shower stall and twists a handle. It screeches with disuse.  They wait.  At exactly two, their ears fill with the furious sound of a rainstorm. Then their own whooping. Mani bounds in without testing the temperature, makes a shrill sound. “It’s warming up!” She reaches out and grabs Amir’s arm. Her grip raises goosebumps. “Come on, get in!”  He does. It’s the most sublime thing he’s ever felt. He puts his hands flat on the wet tiles and closes his eyes under a hammering of water.  “How long can we stay in here?” He manages not to choke. Such a quantity of water is coursing down his face and onto his tongue.  “We’re being good by sharing. Let’s not get out for a while,” Mani says. “Are you crying?”  “Yes!” He opens his eyes to look at her but her face is blurry-wet. “Are you?”  “That’s private,” Mani says. But she wraps her arms around his waist, her belly against his flank, and rests her forehead on his cheek. Their bodies are slippery and warm. Amir hears himself make a purring noise. “Oh. Wow.”  “Yeah.”  “Not like the mist,” he says.  “No. Totally different.”  Sharing a patch is encouraged in the misting rooms. They’ve done this many times. They wash each other’s backs and argue about what true pan-humanism might look like. It’s pleasurable. But this—private, warm, untimed, all this water sheeting down—is a whole different register of existence.  “I think I should tell you,” Mani says, “that I’m thinking about sex.”  Amir opens one eye to look at her, can only see the top of her head against his cheek. “Me, too,” he says, almost but not totally redundantly. Mani’s got a good view.  They’ve almost so many times, but never. This moment feels ripe, so very theirs. But it’s also the wrong moment.  “Water, though, Mani! Mindfulness. Presence. This.”  “Of course,” she says.  “We might never be able to have this again.”  “We might never have any given thing again,” Mani says, the pedantic one for a change.  “But all this water,” he says.  “No, you’re right,” says Mani, hushed in the hypnotic roar of the shower. “All this water.”  The Beirut Water pilot is considered only a partial success; it isn’t repeated again for almost two years. By then Mani has left. Amir will remember different selections of things from the day of the pilot depending on how hot or cold his thoughts are, but he’ll cap the memory with this, every single time: the fond way Mani slides her hand against his drenched ribs under the flow of hot water before she entirely lets him go.  Amir sleeps poorly the night before university assignments are due to go out. He knows but does not know-know that he will get into Beirut and Environs, his first choice. His grades are excellent. He’s done twenty percent more personal growth hours than required—he likes doing them—and his civic engagement score is the highest ever for Beirut-3’s Academy. But he’s still nervous. When his watch buzzes at four AM, he startles awake: BEIRUT AND ENVIRONS FUTURIST COLLEGE, UTOPIAN PHILOSOPHY STREAM.  He taps over the notification to Mani with a string of exclamation points, his foggy enthusiasm-slash-relief dampened only slightly when she doesn’t respond right away. Mani’s grades are stellar but her civic engagement score’s not great. She’d wanted Pan-Humanist Polytechnic but Amir has a sinking feeling she’s been assigned to College of the Near East.  He composes a fortifying speech in his head as he gets ready, complete with references to the most famous pan-humanist thinkers who’d attended Near East and their contributions to society. Near East is a great school, and it’s half an hour closer to Beirut and Environs by bullet than Pan-Humanist Polytechnic. Mani will do amazing things wherever she goes.  Amir is fifteen minutes early for the morning’s personal growth session. They’ve only just opened the doors to the Reflection Center, a handful of early risers filtering in under the kaleidoscopic arches, quiet murmurs of conversation as they set up mats and blankets on the centuries-old stone floor. But Mani is already there waiting for him, sitting cross-legged on her mat, gripping her hands together so tight that her fingers are white to the knuckle. Amir is brought up short.  “Mani?” he asks, uncertain.  Wordlessly, she raises her wrist for him to see, the notification still up on the watch screen: INTL UNIVERSITY FOR HUMANISM, MOGADISHU, GLOBAL PROGRESS.  Amir feels his heart go ka-thunk. Global Progress at IUH is . . . he’d thought about applying, more as a lark than anything, but they only accept three students per year, from the entire world, and he never thought . . .  “Wow,” he says, dropping down next to her, voice low so it won’t echo. “Wow, Mani, that’s—I didn’t even know you were going to apply, that’s—amazing. That’s so amazing. I’m so, so proud of you,” he says, and even means it.  Mani’s face is complicated with emotions, flickering by too quickly for Amir to properly catalog them, happy-sad-excited-nervous. “It’s far away,” she says.  “It’s exciting,” he corrects. “Mogadishu, can you even imagine! Maybe I could visit you, one time.” This is unlikely, and they both know it. Mogadishu’s not on a clean air travel vector with Beirut yet. He’d have to do two months of civic engagement and a month of personal growth to balance taking a dirty flight for leisure. Mani musters a smile anyway.  “I’d love that,” she says. In the center of the room, today’s meditation guide is setting up at the podium. The overhead heaters have been switched on, spreading the scent of the cedar beams throughout the space. Mani bumps Amir’s shoulder with her own. Her smile builds into something a little more true. “Come on, though. We both know you’ll be too busy changing the world to think of me at all.”  2: THE MECHANISM, A WORTHWHILE TRADE  It’s not that Mani’s right, because of course Amir thinks of her. He thinks of her every single day, at least at first. But then the water starts coming back to Beirut, and Amir gets swept up in the civic spirit, in the new swell of hope. He switches out of Utopian Philosophy the day after he helps a volunteer group install a kinetic walkway on the university’s main green—they expect to be able to clean-power the quad’s lamps for two hours each night—and enrolls in Urban Design. The idea of regeneration-planning the city is wedged deep under his skin.  After graduation he walks into a competitive apprenticeship with Beirut Grid, where he meets Rafa, who’s working on the Bekaa Valley’s poetry microcity and in the capital on up-skill, and Ester, a third generation Beiruti whose grandmother led the rights movement for domestic workers at the turn of the century. They all fall for each other almost simultaneously.  He’s twenty-two. He’s got an apartment on al-Manara. Through his kitchen window, the lighthouse illuminates the brushstroke froth of the Mediterranean and every time Amir Tarabi sees it he says a silent word of hope for the sea, for it to have body and swell with muscle forever. He remembers his conversation with Mani about the fish, imagines a day in the future when they’ll wade into the surf and see entire schools, silver and bronze and fleeting, with their own eyes.  Amir’s at work late when his watch buzzes. Rafa and Ester. Let us in, we’re at the door to Research-4.  He limps down the hall on pins-and-needles. The recollection that they’d planned a dinner date for tonight—for an hour ago—wallops him right before he releases the door.  Rafa and Ester don’t usually band together against Amir, but here they are, standing side by side wearing exactly the same expression, and it’s not we’re so glad to see you.  Ester raises a package and Amir smells food.  “I don’t remember ever blowing through a date with Amir when I worked at the Grid,” Ester says pointedly to Rafa.  “Hmm, Ester,” Rafa replies theatrically. “Is that because you were respectful of his time and attention? Because you understood that interpersonal relationships require careful cultivation?”  “I’m so sorry,” Amir squeaks, letting them in, putting a hand out for their coats. “Can I explain what happened? Not an excuse, just context.”  Ester looks at Rafa. Rafa looks at Ester. Both of them look skeptically at Amir.  “You guys, I’m sorry. Do you remember my Crowdgrow thing?”  “Where you wanted to foster-home ecoboosted flowers around the neighborhood?” asks Rafa. “You told us about it last month.”  “Right,” says Amir. “We found out today the bio team managed to get a couple of shoots synthesizing air pollutants in the lab. Mesilla asked me to put together a grant application for the project. If it gets funded, she wants me to lead the research team.”  Amir’s fortunate that both his partners know what this means to him. Their faces soften.  “Nice. I knew Mesilla would come around,” Ester says. “You still don’t get to flake on dates.”  In a deserted Beirut Grid kitchenette, Amir fetches plates and Rafa piles herbed eggplant casserole onto them. While they eat Amir projects stained photos of cross-sectioned saplings onto a wall, and Rafa and Ester mmm through his commentary for a few minutes, until Rafa says,  “Amir, love, it’s nine PM and you’re still using words like ‘floral load.’”  “Good point, Rafa,” Ester says. “Amir, tap over projector control.”  The projection cuts to the backdrop of his favorite immersion strategy game.  “I’ve got dessert,” Rafa says. He produces a huge bag of caramel chews and a bottle of whiskey. They clear some space.  “Ooh,” Ester says, confirming a glance-down-pause setting. “We need to be able to snack.”  “Oh no,” Amir says. “This never goes well. It’s an immersion game.”  “Shush,” Rafa says. “It’s destined to be a drunk immersion game.”  Their love is like this, comfortable and forgiving of Amir’s faults. Then, at the beginning of summer, Ester breaks up with Rafa and Amir—no hard feelings, just different needs, different takes on life. It’s not that it doesn’t hurt. Amir and Rafa spend several days moping in each other’s laps, swapping sympathy cuddles. But Amir’s always believed what pan-humanist theory says: that love is respect and collaboration held together with radical acceptance, freely gained and lost.  Amir tells himself to take comfort in this, and does his best to keep an open heart.  The Future Good conference in Hanoi is the biggest of its kind, twelve academic streams and full air travel exemption. Amir and Rafa apply for spots every year and never get them, until they do. They’re giddy on the flight over: neither of them gets to leave Beirut often, and they’ve certainly never had a reason to travel by air together.  They attend the welcome address then spend the allotted cultural hours in the Old Quarter, sitting on low stools with their knees knocking together, feeding each other quail egg bánh bao. Rafa’s old advisor is leading a Q&A session on arts micro-cities, but Rafa and Amir lose track of time strolling the banks of the Red River hand in hand. Once they’ve missed that, there’s no reason to go back to the hotel, so they stay out till three AM sampling sticky rice wine, which everyone tries to warn them is stronger than it tastes.  The next morning’s reclamation technologies forum is something of an accident.  They’re trying—oh, Amir is almost too embarrassed to admit it. They’re trying to find breakfast, and Rafa spies a cute ambiguously-gendered human with multicolored hair and a dapper three-piece suit sneaking out of one of the conference rooms, their arms full of coffee cups and muffins. Amir and Rafa are hungry, so they creep into the back, sights set on the buffet table lining the rear wall, and there is Mani Rizk, making her way to the front podium.  Amir’s entire body floods with adrenaline. He grabs Rafa by the cuff of his sleeve and steers him to one of the chairs. He’s trying to be stealthy but Rafa is mumbling confused protests around a coffee-stirrer and Mani sees them, of course she does, and her face goes taken aback then pleased. And then she does a pretty good job of pretending like she didn’t see Amir, because she’s got a lecture to deliver, after all.  Rafa stares at Amir in confusion for about a minute before his eyebrows go up in a particularly knowing manner. He spends the rest of the lecture elbowing Amir any time Mani says something brilliant, which is about every thirty seconds.  “So?” Rafa asks, delighted, when the lecture is over and they’re waiting at the back of a densely knotted crowd. “Who is she, eh? Political rival? Academic crush? Long lost lover?”  “No,” protests Amir, a little too loudly for the enclosed space. “She’s just—a friend. We were friends, when we were young. That was all.”  If nothing else, Mani seems at least as eager to see him as he is to see her: her attention keeps sliding away from whoever she’s talking with, darting to Amir over and over. He smiles, catching her eye, spreading his hands in an awkward gesture that he hopes will convey both hi and I’ll wait. As soon as the crowd thins enough for her to break away she does so, inching her way to Amir and Rafa with a string of apologies and excuses.  “Amir,” she says, and half-tackles him in a hug.  She’s round and solid and small—it’s weird, Amir hadn’t hit his growth spurt until he was eighteen, and in his memory they’re still like that, him looking up. Now Mani barely comes up to his collarbone. He wraps arms that feel oddly long and lanky around her shoulders, holds her tight.  When she finally lets go her eyes look suspiciously bright, but that might just be the ceiling ambients. “I didn’t know you were coming to my talk,” she says.  “It was kind of an accident,” Amir admits.  Beside him, Rafa groans. “Don’t tell her that!” He turns to Mani. “What he means to say is, he wanted to surprise you. And your lecture was phenomenal.”  “I’m not going to lie to her,” says Amir, affronted. “About the surprise, I mean. Your lecture was phenomenal. I didn’t know you’d been studying hydrophobic materials.”  “I’m part of a water reclamation forum at IUH,” says Mani, and then, to Rafa, “and I’ve known Amir too long to expect flattery. I’m Mani.”  “Rafa Zarkesian. I consult on architecture projects for art spaces in Beirut.”  “Rafa’s my boyfriend,” says Amir. It seems important to mention.  “Oh, I thought I recognized you! I’ve seen your picture on Amir’s stream. How long—”  “Mx Rizk?” cuts in a voice over Mani’s shoulder. “I’m so sorry to intrude, but—”  “No, no, of course,” says Mani. “Sorry, I really should—”  “Yes, of course,” says Amir. “It was good to see you, Mani, I—”  “Tonight,” she interrupts, “after closing remarks. There’s that gallery installation, the interactive city grid? I haven’t been able to see it yet. If you have time, maybe the three of us . . . ”  They’ve got a pre-dawn flight back to Beirut; they’d planned to get to bed early and had contemplated skipping the closing remarks entirely.  “That would be wonderful,” says Rafa. “We wouldn’t miss it.”  That night, it rains in Hanoi, just a light, champagne-fizz mist, but it’s enough to lend a celebratory attitude to the entire city. They find Mani waiting for them outside the installation’s entrance, a crown of water droplets clinging to her hair, reflecting a riot of blinking, changeable light. Amir grips Rafa’s hand a little harder.  “We got lucky,” Mani says, squinting as she tilts her face upward, holding out a cupped palm as if to collect water there. “Good closing note for the conference.”  “Lucky,” echoes Amir, feeling a little dazed.  Rafa bumps his shoulder against Amir’s. “Come on, you two,” he says, already fond. “Let’s go in.”  The installation is a concept city rendered one-fiftieth scale in shimmering interactive holograms and delicate print-resin latticework. The space isn’t enclosed, and the scrim of the rain occasionally does glitchy things to the projections that make Amir groan in solidarity with the event planners. Rafa and Mani are both charmed, however, and Amir can’t help but be delighted by their delight. He gets video of the support cables of a projected suspension bridge twining around Mani’s ankles, insistent and loving as a cat. They take turns decorating Rafa with sprigs of star-like flowers in the constructed wetlands section.  At one point, Amir is walking sandwiched between the two of them, face craned up to ogle the dazzling phyllotactic archway they’re underneath. Rafa reaches down to twine his fingers with Amir’s, and, after a moment that might be hesitation, on the other side Mani reaches down and does the same. Amir can feel his own heartbeat in his palms and he’s sure Mani and Rafa must be able to as well, but neither of them says a thing.  Afterward, they make promises about staying in better contact. There’s a conference in Mogadishu, only six months out; it’s not a perfect fit for his research, but maybe Amir can swing an invite. It’s ridiculous, really, that Amir hasn’t yet seen Mani’s new city, Mani’s new life. Mani’s so busy—they’re all so busy, but they can message more, at least. Maybe even holochat, sometimes. They work in related fields, after all; it’s their responsibility to foster international communication and collaboration. Plus, they miss each other. There’s no reason to fall so out of touch.  They say all this, and mean it. But, well. Life.  3: EACH BRICK LAID THOUSANDS OF TIMES OVER  The lab at Beirut Grid successfully demonstrates at-quantity ecoboosting in model organisms two weeks before Amir turns twenty-eight, which is a pretty good early birthday present, as far as he’s concerned. To celebrate, Mesilla takes Amir to the botanical garden in Rmeil to evaluate options for the Crowdgrow pilot; Hanne from New Projects tags along.  The conservatory curator herself gives them a guided tour. She leads them down dense green walkways, extolls the growth patterns of crawler vines and Chouf evergreens, both commendably hardy species, survivors of the worst of the water scarcity. Mesilla seems invested—she examines a potted evergreen the curator’s handed her, sinks a finger in the soil—but Hanne is paying zero attention, cleaning up her notifications on Impulse or something. Then, out of nowhere Hanne blurts,  “Oh, Mesilla. They just announced funds for a world-first Wet City implementation.”  The crinkly cellophane of the potted evergreen goes still. The curator says, “Anything else I can show you?” into the silence; Amir babbles about high-altitude crawler vines. They move on to another greenhouse.  In line for lunch, after, Amir waits for Mesilla to pick his brain. He’s all but decided he wants to try ecoboosting crawler vines, but wouldn’t mind talking it through.  “So,” Mesilla says as soon as they’ve found a sunny patch of grass on Achrafieh green for a picnic, “There’s a Wet City funding opportunity? When’s the deadline?”  “One month,” says Hanne. “Not much time to put together a proposal.”  Amir puffs out his breath, struggling to rearrange his thoughts. “Has anyone proven the water reclamation wings would work at that scale? Wasn’t that the sticking point in Colson and Smith’s paper?”  Hanne jabs the chunk of carrot on the end of her fork at Amir. “Right. But the All People funds were greenlit on the back of a rebuttal slash instruction manual by—” Hanne’s eyes blink away as she navigates Impulse. “By Sameen Jaladi at IUH Mogadishu.” The name of Mani’s school fills Amir with a mixture of possessiveness and pride.  Amir can think of twenty reasons to be wary: the technical challenge of large-scale moisture collection, yes, but also overheating the built habitat, uncontrollable wet seasons, mold and mosquitos and respiratory conditions. That’s not to mention his immediate questions around clean-powering the wings and purging waste bays. He puts his sandwich in its basket, turns to Mesilla.  “It’s a lot of resources toward an unproven concept. We’d have to divert money and energy we could spend in demonstrably useful directions,” he says. Like on Crowdgrow, he doesn’t say.  “But in theory,” Mesilla says. “Every metropolis a little green oasis. Latticed condensation wings, clean water from the air. Theoretically, no shortages ever again.”  She unwraps a bit more sandwich in a studied way: bean protein fillet in minted yogurt sauce, her usual. “Can someone get me the Jaladi paper and the bid guidelines?”  Amir’s already poring through Impulse. He taps the documents over to Mesilla with two hard blinks. “They’re with you.”  They walk back to the Beirut Grid offices talking about Amir’s birthday plans—Joud’s taking him on an overnight bullet to Damascus; their first trip together as a couple—but the lunch conversation is still humming under his skin.  Two days later, when Mesilla pulls Amir and Hanne aside and asks them to put together a Wet City bid, it doesn’t surprise him.  It’s a hot day with a really crappy clean air index. Everyone’s been permitted to stay home but a few of them are in, including Amir, because his apartment was so hot he feared he might melt into his armchair. The heat reminds him of sitting in a seabed café with Mani, which of course reminds him of the Future Good conference with Mani, which takes Amir’s thoughts nowhere helpful at all.  The Impulse note arrives from Mesilla in two parts. The first, short, buzzes at his wrist and pings urgently in his display. It’s to Amir and Hanne, two words: We won!  He expects excitement but feels only bone-tiredness.  The second part of Mesilla’s note is a travel itinerary on wider distribution. The subject line makes Amir’s body do weird things: Academics from IUH Mogadishu. He taps it open on his wrist, as if he needs to see this in physical space, and sure enough:  Jaladi, Sameen  Proctor, Trevor  Gupta, Jan-Helga  Rizk, Mani  “Shit,” he croaks. His side of the office is empty. He can hear the descending xylophone of the bullet zipping along its girders through the open window, and nearer, a heat-oppressed bird call that sounds more tired than he does.  He blinks up his conversation thread with Mani. Their last exchange: Happy new year! from her to him, half a year ago; Happy new year!! from him to her a couple hours later, and since then, nothing. He winces.  Beirut???? he taps over.  Mani’s response is almost instant. Leave in a week.  !!! Amir sends. His belly is one big knot.  Took the effusive punctuation straight out of my mouth, she replies.  Amir wrangles his way into airport chaperone duty for the IUH academics. At Future Good, running into Mani had been a sudden shock; the week he waits for her plane to arrive his nerves are like a leaky faucet. He can’t eat properly but finds himself stocking his pantry with everything he remembers Mani loving: carob molasses, salted pili nuts, a Bekaa Valley Merlot, cashew feta cheese. Joud tries to season a stew with the good cinnamon sticks Amir picked up at al-Raouché market for spiced tea and Amir won’t let them.  “I’m saving those,” Amir says, guiltily filing away that there should be a Joud-him-Mani dinner involving cinnamon sticks. He doesn’t know what’s wrong with him. The plane from Mogadishu, oblivious and probably flying over Independent Greenland on other business, is killing him.  Then he’s at the airport and his Impulse tells him the flight from Mogadishu’s arrived safely. Mani has sent him her Impulse geo, which means he can tell exactly when she’s walking through customs and toward the public area.  He distracts himself by trying to calculate how long it’s been since they’ve seen each other using mental math. His Impulse helper picks up on his saccades. You seem to be working something out. Can I help? Amir moans and blinks it away. He finishes the calculation—1,513 days—but now he can barely breathe. And then the arrivals door pistons up and a column of passengers is behind it. He sees Mani in the throng, and she sees him back.  It’s not the moment he’s been imagining. Mani’s engrossed in conversation with her colleagues. She weaves them toward Amir and he wants to hug her but the fact that he’s on official duty—that there are three field-pioneering academics he’s never met studying him—plants him to his spot.  “Hi,” Mani says.  “Hi,” Amir says. Not wow, you and me in Beirut, like when we were seventeen. Which is what he’s thinking.  “Sameen, Trevor, Helga, Amir,” Mani says, and then there’s a blur and they’re all on the bullet in the private compartment Amir booked and everyone is staring out the window at this city they’ve missed or never seen before and the conversation turns to how wonderfully Beirut will function as a Wet City.  He tries not to catch Mani’s eye too much, but when he does she gives him a conspiratorial smile he remembers. He thinks of the wine and the cheese. They’ll get loads of time together later.  Except, the next day Mesilla kicks off the Wet City stuff in earnest. And Amir and Mani start to argue. A lot.  In some ways it’s not new. They’d argued as kids, the minutiae of pan-humanist theory over hot black tea: whether animals deserved more pronounced protection than plants, whether population control was ever justified, whether power should in all cases decentralize in the direction of local communities.  But now the stakes are different. They’re different. The worst of the arguments take place during project meetings, in front of Hanne and Caveg and the rest of the team. Amir leaves meeting after meeting feeling battered. The way Mani seems to have a reassuring study on hand to refute each of his worries makes him clench his jaw in a very uncivic way. He’s so embarrassed by the incessant jaw clenching he grows his beard out to hide it.  They avoid casual conversation for the better part of two weeks. Amir starts to hate going to work, which has never happened before. Then, one Monday, Mani stops at Amir’s station, gets close to see if he’s working in Impulse, and he can smell her perfume, mineral and saline and only the slightest bit sweet.  “Help me draft an advisory? If you’re not busy?” she asks. She lifts a satchel. “I brought us tea from kiosk auntie downstairs.”  “Advisory?” Amir’s immediately on edge. “Do you need planning language in it? Can Caveg help?”  Mani’s eyebrows come down. “I don’t really need planning language in it. I just miss doing things together. I thought there’d be a lot more of that.”  “Yeah,” Amir says, and stands to follow. He remembers following her that first time, in the misting rooms. He doesn’t understand himself. He’s been waiting to have Mani back for a decade—not a vague wistfulness, but an active full-body sort of waiting, if he’s really examining it. And now she’s right here, and he can’t bring himself to speak to her without getting upset. The funny thing is that he’s not even angry at her. It’s something more like bedazzlement. She’s a sun that blasts his vision into afterimages.  “Or,” Amir says in the corridor, “we could go to our old café? It won’t be too busy right now.”  Mani nods decisively. “Let’s go. Sameen will happily take the kiosk auntie tea.”  The bullet ride is mainly Mani pointing out new art installations and green spaces and Amir telling her what year they were built and why. He’s good at this. He does almost all of them without Impulse, but confesses when he has to look one up. Mani gives him grief for not knowing them all by heart.  “Everyone told me, oh, Amir, Beirut Grid’s own whizkid. A sort of city-planning savant. I guess I expected more,” she teases.  “No one said that,” Amir says. “And even if they did, IUH has given you impossible expectations.”  “Pan-humanism is all about realizing a civilizational system that game theory would say is impossible, right?”  “Right,” says Amir. “But there’s plain old pan-humanist theory impossible and then there’s IUH Mogadishu impossible.”  The bullet slows and stops beside their old café. They go down the boardwalk to their usual table, tap across an order of tea, and settle into their respective chairs. “Wow,” says Amir.  “Swap adult clothes for swim knickers and shave the beard and it could be a decade ago.”  Amir lifts their order of tea off a tray bot. “Were we that familiar with each other? Hard to believe.”  Mani takes her glass from him. “Oh yeah. We were ridiculous. Like one person in two bodies, back then.”  Amir startles in a way that melts him into himself, like his chest is swallowing the rest of him, swallowing his words. Mani’s always been the forthright one, but they both know he’s more sentimental, and he’s afraid that if he says anything now it will be too much.  “You don’t like the beard?” he manages.  Mani reaches across and strokes his cheek against the grain. “I don’t not like it,” she says.  Amir shakes his head at her. She withdraws her hand. He’d forgotten how transparent they were to each other. Are, to each other.  “How’s Rafa?” Mani says, stirring her tea.  “We broke up last year.” He doesn’t bother waving it off. Mani will know it was a big deal.  Mani’s silent a bit, then: “I just ordered you a glass of ʿarak.”  Amir laughs and puts his head on his arms. “It’s two PM But thank you.” Seagulls croon from the frames of the yellow beach umbrellas. “This Wet City thing, Mani,” he starts. Doesn’t know how to finish.  “You don’t believe in it,” says Mani.  Amir grimaces. “That obvious?”  “No.” This should be reassuring, but Mani’s turning her teacup in slow circles, not meeting Amir’s eyes. “Amir-with-his-heart-not-in-it works with more passion than most humans on their best days. But I can tell.”  This should also be reassuring. Instead Amir feels irritation spiking in his chest. “I’ve spent every moment of my workday for the past six days chasing down permitting documentation for an experimental metallofoam that’s going to be used in less than two percent of the load-bearings struts of the wing structure,” he says. “It’s not exactly how I envisioned my career path. But I’m doing it. It’s not fair to call me out for lack of enthusiasm.”  “I wasn’t calling you out,” says Mani. “I think you’re doing good work.”  “Yeah,” says Amir. The ʿarak comes. He plucks it off the tray bot and sets it next to his teacup, aligning them carefully side by side. He can tell Mani is waiting for him to say something else. He shouldn’t. He should try to steer the conversation back toward safety. “Do you remember,” he says, “the Crowdgrow project I told you about during the Future Good conference?”  “You were really excited about it,” Mani says. “It seemed promising.”  “It was. The closed-room tests showed a fifteen percent improvement in air quality, and we had almost a thousand households signed up as testers. And we’ve applied for continuation funding every open cycle since. Not a lot—just enough for a pilot study. Less than we spend in administrative overhead on the Wet City project every week.”  “But no luck?” asks Mani.  “But no luck,” agrees Amir.  “Amir,” says Mani, but there’s too much pity in the way she says his name.  “I know what you’re thinking,” Amir says. “That it would be a waste. That Wet City is a better use of resources.”  “Yes,” says Mani. “I do think that.” The way she says this could have been kind, but it isn’t.  “You’re always so sure of yourself,” says Amir. The way he says this could have been a compliment, but it isn’t. “Is it ego?”  “Is it jealousy?” Mani shoots back.  Amir feels that familiar muscle in his jaw tic. He takes a careful, measured sip of ʿarak, as if that will hide it. “If this goes wrong—” he begins, once he’s sure his voice will come out steady.  “Oh, please,” interrupts Mani. “You’re going to tell me to be afraid of trying something really big, really innovative, because there’s a chance we’ll end up looking like fools? Now that’s ego.”  “It’s not about personal reputation,” Amir says. “It’s about the wasted money, the time, the emotional investment—do you know how demoralizing a project like this can be for a community if it fails—”  “It won’t fail.”  “You can’t know that.”  “We’ve done all the tests and simulations and proof-of-concept models we can, Amir. The only way to be any more sure is to let someone else go first, and I’m not willing to do that.”  “Ego,” says Amir.  “So what,” Mani snaps, sounding genuinely angry now, “we’d all be better off staying in our backyards planting mutant daisies? Grow up, Amir. You have the chance to work on something that really, actually matters here, and you’re too scared to take it.”  If it were Amir, he would regret such harsh words immediately, start falling all over himself to apologize before the sting had a chance to land.  But it’s Mani. And Mani always says what she means.  Amir looks down at the now-empty glass cradled in his fingers. “It’s getting late,” he says. “We should probably be getting back.”  Mani stands, the legs of her chair protesting loudly against the concrete. “We get this chance—” she stops. “I can’t understand why you’re making it so hard.”  He should argue. Instead, he orders another ʿarak, and doesn’t let himself watch her walk to the bullet station.  4: THAT EACH OF US INVESTS THE LABOR  It’s not that Amir and Mani stay angry a whole year and a half. Something that dire would’ve spurred Amir to action, forced him to have the trembly, awkward conversation that showed them the way back to exchanges of essay clippings and meandering debates and maybe even limb-jumble lie-downs after a gigantic dinner cooked together.  They are not angry: they are too intelligent for anger, Amir thinks, or too proud. They’re just hardened to each other. Their words bounce, too few absorbing. Their lunches together have one too many silences that call for a new conversation thread, and when congratulations are due—as when the first wing is drone-dropped into place at Martyrs’ Square and measurements show promising vapor transfer into the condensation bays at the base—their hugs are guarded and bodiless.  The Wet City project hits miraculously few snags, but once or twice Amir catches a design flaw that makes Mani give him a deep, reckoning look.  “I’m just doing some calculations in Impulse,” Amir says. “The Beirut-3 east wing might not come out inwardly reflective the way we want, with the new bug-in-amber angled like that?” Bug-in-amber is their shorthand for the art pieces they’ll embed in each translucent wing, one of Amir’s favorite streams of the project. He taps across his calculations.  “Whizkid,” is all Mani says, and Amir almost asks if she wants to grab dinner with him after work. He doesn’t. He gets better at finding flaws, though. There are times when flaws are all he sees.  Post-water-crisis Beirut is mesmerizing, boisterous street markets by day and elaborate street parties by night.  Amir and Joud meet every couple of weeks to trawl the artisans’ quarter in Nouveau Centre-Ville, Amir on the lookout for sustainable art references for the much larger bug-in-amber pieces to come, Joud hoping to enrich their collection of silk and brocade Lebanese abayas. They are especially taken by androgynous styles that combine an embroidered abaya tunic with a shirwal bottom. They stroke the parchment packets, their fingers lingering on the teardrop calligraphy of the artisan’s sigil. The two of them often return to Amir’s apartment with towering ice cream cones, and Joud tells him what they’ve learned about tonight’s artisan on Impulse, and they have the sort of voracious, aching sex that comes after absence.  “How is Mani?” Joud asks tonight, nestled against the hollow of Amir’s chest. Joud frequently asks about Mani. They know, but their affection for Amir is so confident, so stable, that the question can come right after intimacy and carry no trace of malice or envy.  “Today she proposed a walkway up the side of the sea-facing wings for a view of the sunset,” Amir says. “And yesterday she gave a site tour to a delegation that arrived two days early from Singapore.”  Joud hums in appreciation. They always do. Joud loves expansively, navigating a multitude of relationships with a grace and wholeheartedness that makes Amir feel he’s never absorbed a moment of personal growth.  “You don’t have to indulge me, you know,” Amir says. He presses three fingertips against the place where Joud’s temple meets soft brown hair, scratches them there tenderly. “You and I have been in each other’s lives two years and I’ve never been—I mean, Mani’s always been—”  Joud stills his lips with their cheek. “It doesn’t bother me, darling. What I figure is some people stand beside each other, and some people end up locked together,” Joud laces their own hands tight, to the knuckles. “And I don’t think the latter is better.”  “You’re right, love,” Amir says to Joud, who smells like green branches and clay and sex. In that moment the appellation feels miraculous and genuine on his tongue. “In many ways it’s worse.”  There are times when hitting the forecasted Wet City launch date seems like a pipe dream, but as more and more pieces slot into place, it starts to become attainable, and then an unavoidable reality. Twenty hyper-efficient months after Hanne’s distracted aside in the conservatory, the first wings come online; the engineers begin their final stress tests; the notion of a citywide festival around the launch begins to coalesce. And then, with three and a half months to the launch date, Mesilla calls Amir into her office.  Two of their artists won’t have their bugs-in-amber finished by the festival and Amir’s been heading up the effort to ensure their temporary prototypes are materially similar enough for the engineers to work with; he assumes this is what Mesilla wants to talk about. Instead he’s greeted by a stranger. “Amir,” Mesilla says, “I wanted you to meet one of my oldest colleagues: Adah Bertonneau.”  Adah Bertonneau is even taller than Amir, with impressive cheekbones and two-hand-clasp handshake. “A pleasure to finally meet you,” Adah says, their accent a rich, rolling thing Amir can’t quite place.  Amir smiles, puzzled. “Finally?”  “Read your Crowdgrow grant application five years ago now,” says Adah. “Told myself I’d make Mesilla introduce us if I ever made it to this part of the globe. And here I am.”  “Oh.” Amir resists the inclination to try to look up Adah on Impulse—he’s still not very good at interfacing with it discreetly. “Well, unfortunately, we haven’t had the opportunity to prove out the research, but I hope that one day—”  “Mx Tarabi,” interrupts Adah. “That is, of course, precisely why I’m here to talk to you.”  Adah Bertonneau, it turns out, works at the Nantes Center for Naturalist Studies. The Center is neither large nor prestigious (Amir gives up and looks it up on Impulse), but their work seems well-respected enough, and a few of their recent papers have appeared in journals Amir would have once given his eyeteeth to be published in. Adah’s lab is new, getting off the ground with an extremely generous grant from France Centrale, and it seems, more or less, that they’re looking for ways to spend it.  “One must make a splash early,” says Adah, peering at Amir seriously over the rim of their teacup. “We’re frontloading, trying to get several programs up and running right out the door. Not all of them will work out in the long term, of course, but I’d guarantee funding for the full two-year period you requested, regardless of the findings. Between you and me, though? I have this . . . call it a premonition, that what you’ve proposed is going to work.”  Of course it’s a dream come true. And of course the timing couldn’t be worse.  “I wish I could tell you to take your time making a decision,” continues Adah, “but the start date’s in a month, and I’m afraid it’s not flexible.” They want to do the study with a particular crawler vine, Adah explains, whose cuttings are most viable in the fall. One week, and they’ll need a yes or no, “else there won’t be enough time to get the paperwork in order, you understand.” Amir understands. Hands are shaken. Mesilla walks Amir out.  “Take the rest of the day,” she says. “I—well, I don’t know whether to say I’m sorry or congratulations. I know it’s a lot at once.”  Amir very nearly just asks her to tell him what to do, but she seems to read this on his face. “We can talk it over tomorrow, if you need. But sleep on it. Before you start cataloging opinions.”  Amir nods. It’s smart. Mesilla’s always smart. He goes to his office, gathers his things, does his best to slip out unnoticed.  Except he runs into Mani waiting for the elevator.  “Hey,” she says, smiling a little awkwardly, that try-hard friendliness. Then she spots his messenger bag. “Headed out?”  It’s not even ten in the morning. Amir hits the down button again—the Grid’s elevators are vintage, which is a cute way of saying unbearably slow. The doors are mirrored; Amir read somewhere that mirroring elevator doors reduced complaints about wait times, because people got carried away admiring themselves. He wonders if it’s true. He hopes it’s not. He thinks it probably is.  “Mani,” he says, “I’m quitting.”  Mani’s reflection stares at him.  The doors bing open.  Amir steps into the elevator; Mani takes an extra second to step in after him.  “Explain,” Mani says. “Now? Are you serious?”  Amir is serious. He only knew it as he said the words aloud. “Skive off today?” he asks Mani, pretending he doesn’t hear the note of pleading in his own voice. “I could really use a drink.”  They end up going back to his. They take the bullet train in silence—it’s mostly empty at this odd hour of the morning, but the tunnel-rush of wind makes holding a conversation difficult. The ride’s only five minutes, but it’s long enough to put Amir on edge. He stares down at his interlaced fingers, bracketed by his knees. There’s an empty seat between him and Mani, because there was space to spread out, and why would they not? After all, these days, it’s not like they’re—well. It’s barely like they’re friends.  Mani has never been to Amir’s apartment. He realizes this as he keys into the front door; they’ve tried, a few times, vague agreements about dinner that fell through at the last moment, meetings that wound up getting moved to workspaces with excuses of better bullet access. It should make him nervous, he thinks. He should be worrying about the fact that none of his coffee mugs match, or whether he left toothpaste flecks on the bathroom mirror that morning. But he isn’t nervous. Mani knows all the worst parts of him already.  The Bekaa Valley Merlot is still at the back of the cupboard, because Amir’s life is a joke. He uncorks it and pours them both generous glasses, and settles himself next to her at the small kitchen table. “There’s a research institute in Nantes,” he says. “They want to fund a Crowdgrow roll-out.”  Mani looks stunned, just for a second, then raises her wineglass. “This is now a toast,” she says. “To the long overdue recognition of my brilliant friend Amir Tarabi.”  Amir tilts his glass toward hers. “Thing is,” he says, “I’d have to start basically immediately. A few weeks. I wouldn’t be here to close out Wet City. I wouldn’t be able to make the launch festival.”  “ . . . oh,” says Mani. She lowers her glass. “Damn.”  “Right.” Amir lowers his glass, too. He’s not quite sure how to look at Mani, so he focuses on the wineglass, turning it in careful circles, watching the light refract. “I mean, it’s not the end of the world,” he says. “I’ll need to pass some stuff off sort of hastily, but let’s be honest, I’m no longer really essential personnel. And I don’t care about the festival. It’s just . . . ”  Amir stops, looks up. He doesn’t know how to read Mani’s expression. Complicated, sad. A little like how she looks when she’s working her way through a thorny problem. She reaches forward, finding his fingers with her own, carefully unlacing them from the stem of the wineglass. She holds his hand there in the warm cradle of her palms, running her thumb in a discovering sort of way across the ridgeline below his knuckles, as if she were going to read his fortune.  “It would have been nice,” says Mani, “to have had more time.”  “Mani,” says Amir, helplessly. She looks up, looks at him. He feels on display, as if she’s taking inventory of him, all the things that are different, all the things that are the same. He swallows. “I want—” he says.  Mani reaches up, running her fingertips through the scruff of his beard, bracing her thumb against his cheekbone. “Come here,” she says. He goes, letting her guide him forward until she finds his mouth with hers, and kisses him.  His mind goes blank. He’s a teenager again, unsure what to do with his hands. He loves her so much he thinks he might fly into a million separate parts.  She undresses him first, won’t let him help, won’t let him touch, torturous slowness as she undoes every button, every hook. She runs her fingertips over all the planes and angles of him, presses teasing thumbs into the hollows by his hipbones and kisses him until he feels drunk with it. Then she lets him do the same to her, and she takes his hands and shows him where to touch, and he thinks this might be the most beautiful thing he’s ever done.  Afterward, they lie tangled together, exhausted, belly-to-flank, Amir’s cheek pressed against the top of Mani’s head. The warm reality of her, the slow swell-and-recede of her body against his, is almost too much to stand.  “I’m going to miss you,” Amir says. “I’m going to miss you so much. It wasn’t enough time.”  He feels her pause, then twist to look at him. “I shouldn’t have said that, earlier,” she says, very serious. “We can’t think that way. We have to say to ourselves, this was right. This was exactly enough.”  Amir shuts his eyes, tips his head forward to rest against hers, and tries to believe it.  He keeps his eyes closed until they both fall asleep.  5: THE BEAM COMES ON, ILLUMINATING US ALL  Amir arrives in France just after dawn on a foggy fall day. His out-breaths add frills of fog to Nantes’ thick cloak of it. He keeps his Impulse off after landing. Sounds muffled, skin damp, his first impression of his new home is of being underwater.  He explores the city on foot, stopping for croissants then brioches then tartines. At sunset, he sits on the lawn of the Château des Ducs de Bretagne and tosses a bag of soy chips to two mallards and their ducklings paddling in the castle’s moat. Impulse would help him form a mental map, but he knows if he turns it on he’s going to look for a message from Mani, and if there’s none he’s going to be heartsick. And if there is one he’s going to be heartsick.  Three things cycle through Amir’s mind: first, how to make the most of this opportunity; second, how desperately he needs to recenter himself in personal growth practice; third, the problem he’s had for most of his life, which is that he can’t stop thinking about Mani.  Amir wakes up with the sun on his first morning in his Nantes apartment and he takes creaking steps that raise dust motes along the woodgrain floorboards. At the window he turns Impulse on and his heart rattles the split-second before his unreads appear.  Nothing from Mani.  Amir starts to compose a message. “Hi! Nantes is beautiful. There’s a duckling in the castle moat who has learned to swim alongside—” then he closes his eyes, hard, and deletes. When he opens them the weathervane across from his window has flipped 180 degrees and the sun is a blur of honey.  The Crowdgrow pilot takes place along two residential streets in Nantes-2, just north of the Gare de Nantes. Amir hand-delivers cuttings of ecoboosted crawler vine to each of the experiment’s participants.  “Je vous attends toute la matinée,” says one girl when Amir puts the little red planter pot in her hands. Her tight cornrows have been braided into an orchid-shaped bun on top of her head. She takes him round to the back garden, shows him the sheltered hole in the soil she’s dug. There is so much care in her actions that Amir’s belief in—dedication to—Crowdgrow redoubles just like that.  “Mes mamans disent que le ciel sera plein d’oiseaux,” she says.  “Yes,” Amir replies through Impulse. “As many birds as the sky can handle.”  Nantes is on a clean air travel vector with Beirut, so Joud comes to visit the week before Amir presents the results of the pilot to a delegation from Nantes’ municipality. They go to Nantes’ shipyard island, go on mech-AI safari. They feed the giant hydraulic elephants from a tray of silicon peanuts, and the elephants regurgitate silicon caricatures of Amir and Joud. Joud’s is great: an impossibly vertical cone of hair, small ears rendered as notches. Amir’s own caricature makes him feel every year as old as his thirty-two, and older.  He wraps their portraits up and tucks them in his bag, presses Joud close. Arm in arm, they survey nearby menus on Impulse until Amir finds one that does a much-lauded synth-protein steak with cassava frites. They wash it down with crisp, sweet Breton cider.  “To new avenues,” Joud says.  “To the companions who walk our lives with us,” Amir says. The words are from a passage Mani once clipped from a poem. He clinks the neck of his bottle against Joud’s.  The first results come back from Crowdgrow in Nantes-2. The air quality in that sector has improved a modest part per billion, but what’s really encouraging is that all the crawler vines have survived. Many have gained a meter or more in length. The pilot expands to a citywide project, Adah’s grant money matched by government funds.  Amir comes home late one evening from overseeing a plant-in at a primary school, a little dazed from hours of sun and excitable schoolchildren, but in good spirits. He’s dirt all over, ground into the new callouses on his palms and spilling from the hems of his trousers. The soil here is still toxic, and he should probably wash it off before doing anything else, but his diminutive wrought-iron balcony gets an excellent view of the sunset, and he can’t help but peel off his shoes and socks and sit down at the wooden folding table to watch it. The last flash of sunlight is winking out on the windows of the Cathédrale Saint-Pierre et Saint-Paul when his Impulse pings with a call from Mani.  He answers without thinking—or, he answers before he can let himself think about it. “Mani?” he says, a question, like it could be anyone else.  “Hi,” says definitely-Mani. “Are you—”  “Free,” says Amir, straightening a little, though she hasn’t initiated holo. “I mean, I just got home from work. I was just—” He stumbles. Watching the sunset feels too corny. “Relaxing,” he finishes.  “Good,” says Mani. “I saw on the Beirut Grid announcement stream that your project won that funding extension from the city. Wanted to say congratulations. So, well.” She laughs a little. “Congratulations.”  Amir sinks back into his chair. “Thanks,” he says. “You too. I watched your speech at the launch ceremony. It was really beautiful.”  “Thank you,” says Mani. “I read your message to the team.”  He’d figured she had, even when she didn’t respond. He’s not sure what to say to this.  “You should have been there,” Mani says.  The morning of the Wet City launch festival in Beirut, they’d gotten the first full bloom on a crawler vine in Nantes-2, a pale blue flower veined with green, nearly the size of Amir’s head. The stem wasn’t robust yet; the smallest breeze set the blossom trembling, like any moment it would come free and drop to the earth. Amir had spent most of the morning crouched in the dewy garden, waiting to see if it would last. “That’s kind of you,” says Amir, “but you were fine without me.”  The connection goes so silent Amir has to check Impulse for the activity blip.  “It’s been harder,” says Mani, “than I thought it would be.”  Amir closes his eyes. He wants to say: I would come back if you asked me to. He wants to say: I wouldn’t have left in the first place. Instead he says, “Mani.”  “I love you,” says Mani. “Even if we never quite figure out what that should look like. You know that, right?”  The breeze is sharpening with night, carrying scents of yeast and toffee from the bakery on street level. The latticework of the metal balcony presses geometry into the soles of Amir’s feet. He can hear the soft hush of Mani’s breath, in and out.  “Yes,” says Amir. “I know.”  Over the next seven years, Nantes becomes a garden city. Every green space is verdant with ecoboosted flora from Amir’s program; parks and groves are remade from concrete lots and musky alleys. The skies, as one little girl had once hoped, are full of birds.  Amir spends one of those years working with his team on tweaks to the Crowdgrow flora to ensure the boosted species are hospitable to native ones, and that summer there are small populations of roe deer, and bushes of garden aster, and swallows, and a sighting of a pair of endangered partridges on the steps of the Théâtre Graslin.  Mani stays in Beirut after Wet City launches, takes up a just-formed position as Beirut’s Minister for Enrichment. Amir pieces together through her understatements and Impulse research that this means she oversees almost every program in Beirut that impacts quality of life—standards for natural lighting in modular housing, breeding programs for Mediterranean loggerheads, the national poetry curriculum. He’s immensely proud and touched.  Amir thinks about surprising Mani in Beirut for her thirty-sixth birthday; he’s been back home twice while Mani was away on diplomatic visits, just bad luck. He asks circumspect questions to make sure she’ll be in town, buys a ticket. The day before the flight he gets scary news: one of the Crowdgrow fern populations has been proliferating invasively, has killed off a native garden. Amir gets on a bullet to Nantes-11 and he’s so nervous about the clean-up operation he doesn’t see the inside of his apartment for three days.  They control the fern; he misses his chance to visit Mani.  Time goes so quickly those years. But he spends more evenings sitting on his balcony watching the sunset than not.  It’s Adah who brings Amir the news personally: they’ve received an application to start a Crowdgrow program in Beirut.  It’ll be the seventeenth spin-off of the original Nantes pilot—the first three Amir went to oversee himself, spending months in Bruges, Liverpool, Alexandria. After that, they’d developed a formula, easy for new cities to follow with only a few weeks’ oversight from Amir’s staff.  “It’s below your pay grade,” says Adah. “But I thought you might want to take this one on yourself. Chance to catch up with old friends. But we’ll send someone else if you’re too busy.”  Amir is definitely too busy. “Don’t send anyone else,” he says. “I’d love to go.”  Amir calls Mani that afternoon as he’s walking home from work, feeling like something in him’s unfurling in the late autumn sun. “I hear someone in Beirut ordered some mutant daisies,” he says the moment she picks up.  “Smug,” Mani says. “I was so pleased when the proposal came through.”  “Me too. And, um. Adah asked if I wanted to come do the kickoff myself.”  There’s a pause. “What did you say?”  Amir huffs. “I said yes, obviously! What do you think?” He scruffs his knuckles over the stubble on his jawline, tries to keep his voice casual.  “I’ll clear my calendar,” Mani says.  Amir’s Impulse pings with an unread as his plane begins to descend into Beirut. Joud. Meet at the rock wharf by al-Raouché, bring a warm coat.  It’s five AM and Amir’s had no sleep. He’s really getting too old for no sleep. But the trembly adrenaline of night flights and home is a jolt in his chest, so he goes, his luggage tracking him at a polite distance.  The wind is insistent and briny. Amir seals his coat to his chin. There’s a huge crowd at the wharf, and food kiosks, and banners, a bunch of institutional logos he doesn’t recognize, and one he does—Beirut Grid’s.  Joud finds him where he’s paused at a corniche railing trying to work out the reason for the commotion. He hasn’t seen Joud in two years, not since Joud moved into a rundown mountain house in Ehden with three partners and their five little ones to begin hand-renovating the house to ecopositive standards.  They look great. Sun-hardened, their hair a wiry nest of salt and pepper, clipped a little closer than Amir remembers.  “There’s a team from Beirut Grid here,” Joud says when they hug. “And a couple of my kids. I want you to meet them. Leave the luggage, come.”  Joud leads Amir into the wharf and onto the rocks beyond, where adults and children are queued up to use what look like fishing poles. There’s a din of excitement and an occasional whoop of triumph.  Amir is stunned. “Are they fishing?”  Joud laughs, just as three little humans run into their arms shouting, “We fed one!”  “Show Amir,” Joud says, and a kid with the same shy grin as their parent holds out a glossy pellet cradled in their palm.  “Vitamin feed to correct an imbalance in the ecosystem,” says Joud. “It’s civic engagement, a bit of publicity. There’s a water-soluble version they’ll pump in after.”  “Joud?” asks the smallest child. “Are they going to come live with us?” They glance at Amir. “We have enough water for them to do a mineral soak once a week too.”  “He’s welcome to come live with us,” Joud says, and Amir forces himself not to look away from the softness on Joud’s face.  “Amir Tarabi! Of all the fish-feeding parties in all the towns . . . ” says someone behind him. He turns around to see Mesilla carrying a pail, and behind her Hanne and Caveg.  “This is crazy,” Amir says, and gathers them into a hug. “I just got off the plane from France. How . . . ”  “Maybe not totally a coincidence.” Joud winks at him. “I thought Mani would be here too. But her assistant told me she’s working a short day today, had to wrap things up at the ministry.”  Hanne cracks a joke about Amir still overthinking everything, except now in French, and it’s one of those moments younger Amir wouldn’t have believed in: like the universe has turned its spotlight on him, for a fleeting instant, and instructed him to rest.  Eventually, the trajectory of the future will look like this: some years, Amir in Beirut, guest lecturing at Pan-Humanist Polytechnic, consulting on the new ecoboosted installation in Zahleh, taking a sabbatical to work on a collection of essays about crowdsourcing civic change. Some of those years, Mani in Beirut too, but others, Mani in the Arctic, Mani back in Mogadishu, Mani on the Gulf Coast. Once, eighteen glorious months both in Beirut, a routine of dinner parties at Mani’s girlfriend’s loft apartment, and stargazing every third weekend during Beirut’s Dark Skies nights: picnic blankets and wine, Amir’s head in Mani’s lap, Mani’s fingers in his hair. Once, ten long years where the vagaries of circumstance mean they don’t manage to see each other at all.  Eventually, all the days in a human life, whether or not they feel like enough.  But for now, all the hard, gut-ache hope and all the pragmatics and all the inexorable decades coalesce like this: Amir steps out of a Beirut hotel two streets up from his old al-Manara apartment holding a potted Crowdgrow cutting, and points himself toward Stella Kadri Square.  Mani messages him just as he spots the showcase Wet City wings fanning out in the distance, describing the perimeter of the brand new square. Their bugs-in-amber make them into a museum of petrified art. He saw hundreds of the wings from the air and he’d seen the beachfront ones from a distance on his brief visits home, but now they strike him. It’s like walking toward the foot of a mountain, that same organic rightness of approaching and finding the world continuing up and out beneath his feet.  Mani sends him geo for a bench she’s found. He wants to play that old game of how long has it been, but he draws every minute of personal growth he’s ever done to ground himself—he notes the flinty musk of impending rain, the drawn out ping of the bullet slicing across the city, the tickle in his throat from the boosted pollen of the Crowdgrow cutting. His heart, beating in his neck.  Amir spots the bench from a distance. Mani is a blue-coated speck on one side of it. He’s shy, suddenly, walking into a casual get-together with Beirut’s Minister for Enrichment, walking across the grandeur of a public space he knows she conceived and oversaw to completion, a tribute to the world Mani’s rallied for and railed against so passionately her whole life. Then Mani messages him a biofeedback wave, and Amir viscerally feels her excitement hum in his brain, and he’s not shy anymore. He wants to be near enough to touch her so badly. He almost breaks into a run.  But doesn’t. He gets close enough for her to hear him and shouts “Mani!” Her peacoat’s the shade of the ocean, collar drawn up. Her face is open and happy. Amir can’t believe she could possibly wear that expression for him.  “You look like you’re having a pretty good day,” he laughs.  She shakes her head, gets up, and closes the distance and hugs him and her cheek is right over the brutal hammering of his heart. Amir stands as still as he can, clutching the Crowdgrow pot against Mani’s back, waiting for the moment she breaks the embrace, kind of hoping that will be never.  “I brought you a cutting,” Amir says.  “Welcome home,” Mani mumbles. Her voice vibrates in his chest.  “To us both,” he says.  She turns her face up to his and puts fingers on his jaw and kisses him and doesn’t stop, and Amir must really be in a kinder world because it starts to rain, raindrops that splatter open, big and clean and warm. Sara Saab was born in Beirut, Lebanon. She now lives in North London, where she has perfected her Resting London Face. Her current interests are croissants and emojis thereof, amassing poetry collections, and coming up with a plausible reason to live on a sleeper train. Sara's a 2015 graduate of the Clarion Writers' Workshop. You can find more of her on Twitter as @fortnightlysara.", "text": "12030 words, novelette\nPan-Humanism: Hope and Pragmatics\n1: THE MOST HALLOWED OF OUR SPACES\nAmir Tarabi is scrubbing himself down in the misting rooms the first time he meets Mani Rizk.\nThe mister in Beirut-4 is being upgraded, the zone’s residents using Beirut-3’s misting rooms on rotation, so it is especially crowded that day. Amir avoids making eye contact with the bathers in adjacent patches with rigorous politeness. At sixteen, he’s already spent a hundred personal growth hours thinking about civic decency, appreciates the role of uninterrupted private rituals in fostering social cohesion—\n—then someone comes out of the mist and straight into his line of vision, Amir thinks by accident. He tries to keep his eyes on what he’s doing. The sparse rivulets of soapy water starting in his elbows and armpits are usually an easy bliss to meditate on, how they track down his skin, how they catch and collect on little hairs. Water coalescing from mist doesn’t have enough body to drip to the floor. Amir can feel it evaporate at his hips, his thighs, his ankles.\n“Excuse me?” says the interrupting someone-who-turns-out-to-be-Mani, and Amir’s head lifts before his principles regroup. Her teeth are chattering but she smiles gamely through it. “My patch is really cold. Does that happen?”\n“Not that I remember?” he says. “Show me?”\n“Sure,” she clatters. “Thanks. This way.”\nHe doesn’t recall ever being approached by another bather in the mist before. She’s naked, so is he, so is everyone. Nudity isn’t weird in water-scarce Beirut at the height of summer. Less clothing means less sweat. It’s her still-soapy hair that strikes him: so thick that there’s two inches of it plastered soaking to her head, which of course means she’s nearly at the end of her timeslot. The mist takes a long time to permeate a head of hair.\nIt’s so crowded. They weave through an infinity mirror of bathing bodies which fade in the middle distance into a wall of mist. Amir wonders what brought his new friend all the way to his patch when any neighbor would’ve been glad to help.\n“You’re from Beirut-4?” he asks.\n“The finest of all arbitrary urban planning constructs,” she calls behind her.\nAt sixteen, Amir doesn’t believe in competitive jokes about city zones, just as he doesn’t believe in identities constructed in opposition. He doesn’t say anything. It doesn’t seem the right moment.\nMani finds the four lit wands in the mist that mark the corners of patch 49.\n“Cold, right?”\nAmir steps solemnly into the center of her patch for a few seconds. The concentrated plume of mist envelops him.\n“Feels okay to me?”\nMani shoots him an aghast look, moves into her patch as Amir steps out. She gives a long-suffering sigh. “Why are they upgrading our mister? Beirut-3 needs it more.”\n“Are you sure you’re not physiologically reacting to a new environment?” Amir counters. “All the misters have the same temperature settings.”\n“Is that so?” Mani says.\n“Pretty sure.”\nShe readies a retort, then shakes it off. “Thanks anyway,” she says, kneading her hair. “I pulled you away while your mist is running.” Sudsy water trickles onto her shoulders.\n“That’s okay. Enjoy your shower,” Amir says, and waves himself off. Enjoy your shower. He’s vaguely disappointed by the whole exchange for a reason he can’t examine.\nIn the airing room, hot blasts of air spread warmth through his chest. This fills him with something like gratitude. He second-guesses whether he might’ve been cold, before.\n“Two degrees lower,” says a voice he recognizes.\n“Really?” he says after a moment. Now he’s vaguely happy for reasons he can’t place.\n“I asked the supervisor. By community agreement, motion passed five years ago, the Beirut-3 misting room is two degrees cooler than default in summer.”\n“Ah,” says Amir. “Good of you to correct a misbelief.”\n“My pan-humanist agenda’s pretty on point,” she says. The wry note in her voice doesn’t irritate him. “I’m Mani. I live near al-Raouché. Want to do a personal growth hour together?”\nAmir doesn’t remember what he stammered then, but it must’ve been affirmative, because the rest of his teenage days have Mani in them, as the water situation worsens, then gets a bit better, then worsens, then stabilizes.\nIt’s a lot of days to have with someone. A lot of staring at the cloudless sky on a blanket from the exposed seabed of al-Raouché, a lot of synth-protein shawarmas in Hamra, a lot of silent meditative spans huddled in Mani’s bed because talking hurts too much with the thirst and their mouths so dry.\nBut it’s also true that all the days in a human life can feel like not enough.\nThe first time the water situation shows signs of getting better is a Monday. Amir knows this because that’s the day for municipal announcements in Beirut-1 through -5. He and Mani are sitting in a seabed café in the shadow of al-Raouché. The rock pillar’s become a sort of geologic Champs-Élysées, and though the bay has begun to recover from the decades of hyperwarming that dried it out, Beirut Grid have installed a seawall to protect the shops and cafés that went up while water was critically scarce.\n“It’s oddly beautiful,” Amir says to Mani. The seawall is muraled with depictions of water-protection craft, the lighthouse, the rickety old Ferris wheel on the boardwalk. Beyond it, the sea shushes loudly. The sun festers behind the clouds and because Amir and Mani have been through screen-mist they’re lounging in just swim knickers.\nAmir rotates his cup and watches bits of tealeaf bob near the bottom. “Do you think it’s unethical to celebrate a built environment that’s a direct result of water scarcity?” he asks.\nMani looks up from her book: Pan-Humanism in the Middle East. It’s just come out, and she’s been excited to read it because it challenges some of the core arguments of Stella Kadri’s Pan-Humanism: Hope and Pragmatics, a book of heroic stature for how it butterfly-effected the sociopolitics of the modern world.\n“Not unethical to feel joy if no one’s suffering,” she says.\n“Fish desperate to swim figure eights around al-Raouché could be suffering.”\n“You have to draw a line where arguments descend into absurdity.” She cracks a smile, powers off her book.\n“But there’s nothing absurd about a healthy marine ecosystem,” Amir says. Her pragmatism makes him uneasy. As a life skill it sits uncomfortably against his complete dedication to absolutes: the True, the Good. But it’s captivating. It makes her quick to laughter and gracious, even excited, about changing her mind.\nMani gulps her tea. “Still hot. So now I’ve burned my tongue worrying about the fish.” She glances down. “Didn’t I turn that off?” Her book’s flashing a notification. So’s her watch. So are her shades.\nAmir blows on his tea before he sips. “On override? Must be important.”\nThey read the message, heads hovering together. It’s from the municipality. Beirut Water pilot. First sectors, random pick: Beirut-4, Beirut-9. Water reconnected via mains for 24hrs from 2PM. OK: taps, showers, hoses. Use judgment: industrial electronics.\nIt takes a moment to sink in.\n“Wait. Are you kidding?”\n“I had no idea they were ready to try,” Mani says.\nThey’re both gathering their things, tapping over a tab-close, standing. “Warsaw managed to run a water supply off a condensation system for a week,” Amir says. “But this is Beirut.”\n“So what if it is?” Mani says. “Beirut is superb! Beirut has water!”\nThey’re skipping along the stairs to the boardwalk. A louder murmur than the sea is rising from the seabed café: the municipality message spreading.\nThey reach Mani’s house in record time. It’s a hot day and Amir is itching from sweat and screen residue with an urgency he’s never felt before.\n“Mom? There’s water!” Mani shouts into the dark house.\n“No one,” says Amir.\n“Ah, she’s got an hour of cross-skilling this afternoon.”\n“Should we wash our hands?” Amir pants, chasing Mani up the stairs.\n“Don’t be ridiculous. Have to go all the way.” She opens a door in the hall. “In here.”\nAmir follows her. She’s planted in front of a bone-dry shower stall. The showerhead is impossibly shiny. There’s still a bit of plastic wrapping on it. It’s an antique, but brand new.\n“It’s nearly two o’clock.”\n“Are they going to be able to do this?”\n“Trust, Amir. Trust.”\n“Do you think it might even be heated?”\nMani, scooting out of her swim knickers, raises her eyebrows at him till he shoves his down too. “I bet it is.” She reaches into the shower stall and twists a handle. It screeches with disuse.\nThey wait.\nAt exactly two, their ears fill with the furious sound of a rainstorm. Then their own whooping. Mani bounds in without testing the temperature, makes a shrill sound. “It’s warming up!” She reaches out and grabs Amir’s arm. Her grip raises goosebumps. “Come on, get in!”\nHe does. It’s the most sublime thing he’s ever felt. He puts his hands flat on the wet tiles and closes his eyes under a hammering of water.\n“How long can we stay in here?” He manages not to choke. Such a quantity of water is coursing down his face and onto his tongue.\n“We’re being good by sharing. Let’s not get out for a while,” Mani says. “Are you crying?”\n“Yes!” He opens his eyes to look at her but her face is blurry-wet. “Are you?”\n“That’s private,” Mani says. But she wraps her arms around his waist, her belly against his flank, and rests her forehead on his cheek. Their bodies are slippery and warm. Amir hears himself make a purring noise. “Oh. Wow.”\n“Yeah.”\n“Not like the mist,” he says.\n“No. Totally different.”\nSharing a patch is encouraged in the misting rooms. They’ve done this many times. They wash each other’s backs and argue about what true pan-humanism might look like. It’s pleasurable. But this—private, warm, untimed, all this water sheeting down—is a whole different register of existence.\n“I think I should tell you,” Mani says, “that I’m thinking about sex.”\nAmir opens one eye to look at her, can only see the top of her head against his cheek. “Me, too,” he says, almost but not totally redundantly. Mani’s got a good view.\nThey’ve almost so many times, but never. This moment feels ripe, so very theirs. But it’s also the wrong moment.\n“Water, though, Mani! Mindfulness. Presence. This.”\n“Of course,” she says.\n“We might never be able to have this again.”\n“We might never have any given thing again,” Mani says, the pedantic one for a change.\n“But all this water,” he says.\n“No, you’re right,” says Mani, hushed in the hypnotic roar of the shower. “All this water.”\nThe Beirut Water pilot is considered only a partial success; it isn’t repeated again for almost two years. By then Mani has left. Amir will remember different selections of things from the day of the pilot depending on how hot or cold his thoughts are, but he’ll cap the memory with this, every single time: the fond way Mani slides her hand against his drenched ribs under the flow of hot water before she entirely lets him go.\nAmir sleeps poorly the night before university assignments are due to go out. He knows but does not know-know that he will get into Beirut and Environs, his first choice. His grades are excellent. He’s done twenty percent more personal growth hours than required—he likes doing them—and his civic engagement score is the highest ever for Beirut-3’s Academy. But he’s still nervous. When his watch buzzes at four AM, he startles awake: BEIRUT AND ENVIRONS FUTURIST COLLEGE, UTOPIAN PHILOSOPHY STREAM.\nHe taps over the notification to Mani with a string of exclamation points, his foggy enthusiasm-slash-relief dampened only slightly when she doesn’t respond right away. Mani’s grades are stellar but her civic engagement score’s not great. She’d wanted Pan-Humanist Polytechnic but Amir has a sinking feeling she’s been assigned to College of the Near East.\nHe composes a fortifying speech in his head as he gets ready, complete with references to the most famous pan-humanist thinkers who’d attended Near East and their contributions to society. Near East is a great school, and it’s half an hour closer to Beirut and Environs by bullet than Pan-Humanist Polytechnic. Mani will do amazing things wherever she goes.\nAmir is fifteen minutes early for the morning’s personal growth session. They’ve only just opened the doors to the Reflection Center, a handful of early risers filtering in under the kaleidoscopic arches, quiet murmurs of conversation as they set up mats and blankets on the centuries-old stone floor. But Mani is already there waiting for him, sitting cross-legged on her mat, gripping her hands together so tight that her fingers are white to the knuckle. Amir is brought up short.\n“Mani?” he asks, uncertain.\nWordlessly, she raises her wrist for him to see, the notification still up on the watch screen: INTL UNIVERSITY FOR HUMANISM, MOGADISHU, GLOBAL PROGRESS.\nAmir feels his heart go ka-thunk. Global Progress at IUH is . . . he’d thought about applying, more as a lark than anything, but they only accept three students per year, from the entire world, and he never thought . . .\n“Wow,” he says, dropping down next to her, voice low so it won’t echo. “Wow, Mani, that’s—I didn’t even know you were going to apply, that’s—amazing. That’s so amazing. I’m so, so proud of you,” he says, and even means it.\nMani’s face is complicated with emotions, flickering by too quickly for Amir to properly catalog them, happy-sad-excited-nervous. “It’s far away,” she says.\n“It’s exciting,” he corrects. “Mogadishu, can you even imagine! Maybe I could visit you, one time.” This is unlikely, and they both know it. Mogadishu’s not on a clean air travel vector with Beirut yet. He’d have to do two months of civic engagement and a month of personal growth to balance taking a dirty flight for leisure. Mani musters a smile anyway.\n“I’d love that,” she says. In the center of the room, today’s meditation guide is setting up at the podium. The overhead heaters have been switched on, spreading the scent of the cedar beams throughout the space. Mani bumps Amir’s shoulder with her own. Her smile builds into something a little more true. “Come on, though. We both know you’ll be too busy changing the world to think of me at all.”\n2: THE MECHANISM, A WORTHWHILE TRADE\nIt’s not that Mani’s right, because of course Amir thinks of her. He thinks of her every single day, at least at first. But then the water starts coming back to Beirut, and Amir gets swept up in the civic spirit, in the new swell of hope. He switches out of Utopian Philosophy the day after he helps a volunteer group install a kinetic walkway on the university’s main green—they expect to be able to clean-power the quad’s lamps for two hours each night—and enrolls in Urban Design. The idea of regeneration-planning the city is wedged deep under his skin.\nAfter graduation he walks into a competitive apprenticeship with Beirut Grid, where he meets Rafa, who’s working on the Bekaa Valley’s poetry microcity and in the capital on up-skill, and Ester, a third generation Beiruti whose grandmother led the rights movement for domestic workers at the turn of the century. They all fall for each other almost simultaneously.\nHe’s twenty-two. He’s got an apartment on al-Manara. Through his kitchen window, the lighthouse illuminates the brushstroke froth of the Mediterranean and every time Amir Tarabi sees it he says a silent word of hope for the sea, for it to have body and swell with muscle forever. He remembers his conversation with Mani about the fish, imagines a day in the future when they’ll wade into the surf and see entire schools, silver and bronze and fleeting, with their own eyes.\nAmir’s at work late when his watch buzzes. Rafa and Ester. Let us in, we’re at the door to Research-4.\nHe limps down the hall on pins-and-needles. The recollection that they’d planned a dinner date for tonight—for an hour ago—wallops him right before he releases the door.\nRafa and Ester don’t usually band together against Amir, but here they are, standing side by side wearing exactly the same expression, and it’s not we’re so glad to see you.\nEster raises a package and Amir smells food.\n“I don’t remember ever blowing through a date with Amir when I worked at the Grid,” Ester says pointedly to Rafa.\n“Hmm, Ester,” Rafa replies theatrically. “Is that because you were respectful of his time and attention? Because you understood that interpersonal relationships require careful cultivation?”\n“I’m so sorry,” Amir squeaks, letting them in, putting a hand out for their coats. “Can I explain what happened? Not an excuse, just context.”\nEster looks at Rafa. Rafa looks at Ester. Both of them look skeptically at Amir.\n“You guys, I’m sorry. Do you remember my Crowdgrow thing?”\n“Where you wanted to foster-home ecoboosted flowers around the neighborhood?” asks Rafa. “You told us about it last month.”\n“Right,” says Amir. “We found out today the bio team managed to get a couple of shoots synthesizing air pollutants in the lab. Mesilla asked me to put together a grant application for the project. If it gets funded, she wants me to lead the research team.”\nAmir’s fortunate that both his partners know what this means to him. Their faces soften.\n“Nice. I knew Mesilla would come around,” Ester says. “You still don’t get to flake on dates.”\nIn a deserted Beirut Grid kitchenette, Amir fetches plates and Rafa piles herbed eggplant casserole onto them. While they eat Amir projects stained photos of cross-sectioned saplings onto a wall, and Rafa and Ester mmm through his commentary for a few minutes, until Rafa says,\n“Amir, love, it’s nine PM and you’re still using words like ‘floral load.’”\n“Good point, Rafa,” Ester says. “Amir, tap over projector control.”\nThe projection cuts to the backdrop of his favorite immersion strategy game.\n“I’ve got dessert,” Rafa says. He produces a huge bag of caramel chews and a bottle of whiskey. They clear some space.\n“Ooh,” Ester says, confirming a glance-down-pause setting. “We need to be able to snack.”\n“Oh no,” Amir says. “This never goes well. It’s an immersion game.”\n“Shush,” Rafa says. “It’s destined to be a drunk immersion game.”\nTheir love is like this, comfortable and forgiving of Amir’s faults. Then, at the beginning of summer, Ester breaks up with Rafa and Amir—no hard feelings, just different needs, different takes on life. It’s not that it doesn’t hurt. Amir and Rafa spend several days moping in each other’s laps, swapping sympathy cuddles. But Amir’s always believed what pan-humanist theory says: that love is respect and collaboration held together with radical acceptance, freely gained and lost.\nAmir tells himself to take comfort in this, and does his best to keep an open heart.\nThe Future Good conference in Hanoi is the biggest of its kind, twelve academic streams and full air travel exemption. Amir and Rafa apply for spots every year and never get them, until they do. They’re giddy on the flight over: neither of them gets to leave Beirut often, and they’ve certainly never had a reason to travel by air together.\nThey attend the welcome address then spend the allotted cultural hours in the Old Quarter, sitting on low stools with their knees knocking together, feeding each other quail egg bánh bao. Rafa’s old advisor is leading a Q&A session on arts micro-cities, but Rafa and Amir lose track of time strolling the banks of the Red River hand in hand. Once they’ve missed that, there’s no reason to go back to the hotel, so they stay out till three AM sampling sticky rice wine, which everyone tries to warn them is stronger than it tastes.\nThe next morning’s reclamation technologies forum is something of an accident.\nThey’re trying—oh, Amir is almost too embarrassed to admit it. They’re trying to find breakfast, and Rafa spies a cute ambiguously-gendered human with multicolored hair and a dapper three-piece suit sneaking out of one of the conference rooms, their arms full of coffee cups and muffins. Amir and Rafa are hungry, so they creep into the back, sights set on the buffet table lining the rear wall, and there is Mani Rizk, making her way to the front podium.\nAmir’s entire body floods with adrenaline. He grabs Rafa by the cuff of his sleeve and steers him to one of the chairs. He’s trying to be stealthy but Rafa is mumbling confused protests around a coffee-stirrer and Mani sees them, of course she does, and her face goes taken aback then pleased. And then she does a pretty good job of pretending like she didn’t see Amir, because she’s got a lecture to deliver, after all.\nRafa stares at Amir in confusion for about a minute before his eyebrows go up in a particularly knowing manner. He spends the rest of the lecture elbowing Amir any time Mani says something brilliant, which is about every thirty seconds.\n“So?” Rafa asks, delighted, when the lecture is over and they’re waiting at the back of a densely knotted crowd. “Who is she, eh? Political rival? Academic crush? Long lost lover?”\n“No,” protests Amir, a little too loudly for the enclosed space. “She’s just—a friend. We were friends, when we were young. That was all.”\nIf nothing else, Mani seems at least as eager to see him as he is to see her: her attention keeps sliding away from whoever she’s talking with, darting to Amir over and over. He smiles, catching her eye, spreading his hands in an awkward gesture that he hopes will convey both hi and I’ll wait. As soon as the crowd thins enough for her to break away she does so, inching her way to Amir and Rafa with a string of apologies and excuses.\n“Amir,” she says, and half-tackles him in a hug.\nShe’s round and solid and small—it’s weird, Amir hadn’t hit his growth spurt until he was eighteen, and in his memory they’re still like that, him looking up. Now Mani barely comes up to his collarbone. He wraps arms that feel oddly long and lanky around her shoulders, holds her tight.\nWhen she finally lets go her eyes look suspiciously bright, but that might just be the ceiling ambients. “I didn’t know you were coming to my talk,” she says.\n“It was kind of an accident,” Amir admits.\nBeside him, Rafa groans. “Don’t tell her that!” He turns to Mani. “What he means to say is, he wanted to surprise you. And your lecture was phenomenal.”\n“I’m not going to lie to her,” says Amir, affronted. “About the surprise, I mean. Your lecture was phenomenal. I didn’t know you’d been studying hydrophobic materials.”\n“I’m part of a water reclamation forum at IUH,” says Mani, and then, to Rafa, “and I’ve known Amir too long to expect flattery. I’m Mani.”\n“Rafa Zarkesian. I consult on architecture projects for art spaces in Beirut.”\n“Rafa’s my boyfriend,” says Amir. It seems important to mention.\n“Oh, I thought I recognized you! I’ve seen your picture on Amir’s stream. How long—”\n“Mx Rizk?” cuts in a voice over Mani’s shoulder. “I’m so sorry to intrude, but—”\n“No, no, of course,” says Mani. “Sorry, I really should—”\n“Yes, of course,” says Amir. “It was good to see you, Mani, I—”\n“Tonight,” she interrupts, “after closing remarks. There’s that gallery installation, the interactive city grid? I haven’t been able to see it yet. If you have time, maybe the three of us . . . ”\nThey’ve got a pre-dawn flight back to Beirut; they’d planned to get to bed early and had contemplated skipping the closing remarks entirely.\n“That would be wonderful,” says Rafa. “We wouldn’t miss it.”\nThat night, it rains in Hanoi, just a light, champagne-fizz mist, but it’s enough to lend a celebratory attitude to the entire city. They find Mani waiting for them outside the installation’s entrance, a crown of water droplets clinging to her hair, reflecting a riot of blinking, changeable light. Amir grips Rafa’s hand a little harder.\n“We got lucky,” Mani says, squinting as she tilts her face upward, holding out a cupped palm as if to collect water there. “Good closing note for the conference.”\n“Lucky,” echoes Amir, feeling a little dazed.\nRafa bumps his shoulder against Amir’s. “Come on, you two,” he says, already fond. “Let’s go in.”\nThe installation is a concept city rendered one-fiftieth scale in shimmering interactive holograms and delicate print-resin latticework. The space isn’t enclosed, and the scrim of the rain occasionally does glitchy things to the projections that make Amir groan in solidarity with the event planners. Rafa and Mani are both charmed, however, and Amir can’t help but be delighted by their delight. He gets video of the support cables of a projected suspension bridge twining around Mani’s ankles, insistent and loving as a cat. They take turns decorating Rafa with sprigs of star-like flowers in the constructed wetlands section.\nAt one point, Amir is walking sandwiched between the two of them, face craned up to ogle the dazzling phyllotactic archway they’re underneath. Rafa reaches down to twine his fingers with Amir’s, and, after a moment that might be hesitation, on the other side Mani reaches down and does the same. Amir can feel his own heartbeat in his palms and he’s sure Mani and Rafa must be able to as well, but neither of them says a thing.\nAfterward, they make promises about staying in better contact. There’s a conference in Mogadishu, only six months out; it’s not a perfect fit for his research, but maybe Amir can swing an invite. It’s ridiculous, really, that Amir hasn’t yet seen Mani’s new city, Mani’s new life. Mani’s so busy—they’re all so busy, but they can message more, at least. Maybe even holochat, sometimes. They work in related fields, after all; it’s their responsibility to foster international communication and collaboration. Plus, they miss each other. There’s no reason to fall so out of touch.\nThey say all this, and mean it. But, well. Life.\n3: EACH BRICK LAID THOUSANDS OF TIMES OVER\nThe lab at Beirut Grid successfully demonstrates at-quantity ecoboosting in model organisms two weeks before Amir turns twenty-eight, which is a pretty good early birthday present, as far as he’s concerned. To celebrate, Mesilla takes Amir to the botanical garden in Rmeil to evaluate options for the Crowdgrow pilot; Hanne from New Projects tags along.\nThe conservatory curator herself gives them a guided tour. She leads them down dense green walkways, extolls the growth patterns of crawler vines and Chouf evergreens, both commendably hardy species, survivors of the worst of the water scarcity. Mesilla seems invested—she examines a potted evergreen the curator’s handed her, sinks a finger in the soil—but Hanne is paying zero attention, cleaning up her notifications on Impulse or something. Then, out of nowhere Hanne blurts,\n“Oh, Mesilla. They just announced funds for a world-first Wet City implementation.”\nThe crinkly cellophane of the potted evergreen goes still. The curator says, “Anything else I can show you?” into the silence; Amir babbles about high-altitude crawler vines. They move on to another greenhouse.\nIn line for lunch, after, Amir waits for Mesilla to pick his brain. He’s all but decided he wants to try ecoboosting crawler vines, but wouldn’t mind talking it through.\n“So,” Mesilla says as soon as they’ve found a sunny patch of grass on Achrafieh green for a picnic, “There’s a Wet City funding opportunity? When’s the deadline?”\n“One month,” says Hanne. “Not much time to put together a proposal.”\nAmir puffs out his breath, struggling to rearrange his thoughts. “Has anyone proven the water reclamation wings would work at that scale? Wasn’t that the sticking point in Colson and Smith’s paper?”\nHanne jabs the chunk of carrot on the end of her fork at Amir. “Right. But the All People funds were greenlit on the back of a rebuttal slash instruction manual by—” Hanne’s eyes blink away as she navigates Impulse. “By Sameen Jaladi at IUH Mogadishu.” The name of Mani’s school fills Amir with a mixture of possessiveness and pride.\nAmir can think of twenty reasons to be wary: the technical challenge of large-scale moisture collection, yes, but also overheating the built habitat, uncontrollable wet seasons, mold and mosquitos and respiratory conditions. That’s not to mention his immediate questions around clean-powering the wings and purging waste bays. He puts his sandwich in its basket, turns to Mesilla.\n“It’s a lot of resources toward an unproven concept. We’d have to divert money and energy we could spend in demonstrably useful directions,” he says. Like on Crowdgrow, he doesn’t say.\n“But in theory,” Mesilla says. “Every metropolis a little green oasis. Latticed condensation wings, clean water from the air. Theoretically, no shortages ever again.”\nShe unwraps a bit more sandwich in a studied way: bean protein fillet in minted yogurt sauce, her usual. “Can someone get me the Jaladi paper and the bid guidelines?”\nAmir’s already poring through Impulse. He taps the documents over to Mesilla with two hard blinks. “They’re with you.”\nThey walk back to the Beirut Grid offices talking about Amir’s birthday plans—Joud’s taking him on an overnight bullet to Damascus; their first trip together as a couple—but the lunch conversation is still humming under his skin.\nTwo days later, when Mesilla pulls Amir and Hanne aside and asks them to put together a Wet City bid, it doesn’t surprise him.\nIt’s a hot day with a really crappy clean air index. Everyone’s been permitted to stay home but a few of them are in, including Amir, because his apartment was so hot he feared he might melt into his armchair. The heat reminds him of sitting in a seabed café with Mani, which of course reminds him of the Future Good conference with Mani, which takes Amir’s thoughts nowhere helpful at all.\nThe Impulse note arrives from Mesilla in two parts. The first, short, buzzes at his wrist and pings urgently in his display. It’s to Amir and Hanne, two words: We won!\nHe expects excitement but feels only bone-tiredness.\nThe second part of Mesilla’s note is a travel itinerary on wider distribution. The subject line makes Amir’s body do weird things: Academics from IUH Mogadishu. He taps it open on his wrist, as if he needs to see this in physical space, and sure enough:\nJaladi, Sameen\nProctor, Trevor\nGupta, Jan-Helga\nRizk, Mani\n“Shit,” he croaks. His side of the office is empty. He can hear the descending xylophone of the bullet zipping along its girders through the open window, and nearer, a heat-oppressed bird call that sounds more tired than he does.\nHe blinks up his conversation thread with Mani. Their last exchange: Happy new year! from her to him, half a year ago; Happy new year!! from him to her a couple hours later, and since then, nothing. He winces.\nBeirut???? he taps over.\nMani’s response is almost instant. Leave in a week.\n!!! Amir sends. His belly is one big knot.\nTook the effusive punctuation straight out of my mouth, she replies.\nAmir wrangles his way into airport chaperone duty for the IUH academics. At Future Good, running into Mani had been a sudden shock; the week he waits for her plane to arrive his nerves are like a leaky faucet. He can’t eat properly but finds himself stocking his pantry with everything he remembers Mani loving: carob molasses, salted pili nuts, a Bekaa Valley Merlot, cashew feta cheese. Joud tries to season a stew with the good cinnamon sticks Amir picked up at al-Raouché market for spiced tea and Amir won’t let them.\n“I’m saving those,” Amir says, guiltily filing away that there should be a Joud-him-Mani dinner involving cinnamon sticks. He doesn’t know what’s wrong with him. The plane from Mogadishu, oblivious and probably flying over Independent Greenland on other business, is killing him.\nThen he’s at the airport and his Impulse tells him the flight from Mogadishu’s arrived safely. Mani has sent him her Impulse geo, which means he can tell exactly when she’s walking through customs and toward the public area.\nHe distracts himself by trying to calculate how long it’s been since they’ve seen each other using mental math. His Impulse helper picks up on his saccades. You seem to be working something out. Can I help? Amir moans and blinks it away. He finishes the calculation—1,513 days—but now he can barely breathe. And then the arrivals door pistons up and a column of passengers is behind it. He sees Mani in the throng, and she sees him back.\nIt’s not the moment he’s been imagining. Mani’s engrossed in conversation with her colleagues. She weaves them toward Amir and he wants to hug her but the fact that he’s on official duty—that there are three field-pioneering academics he’s never met studying him—plants him to his spot.\n“Hi,” Mani says.\n“Hi,” Amir says. Not wow, you and me in Beirut, like when we were seventeen. Which is what he’s thinking.\n“Sameen, Trevor, Helga, Amir,” Mani says, and then there’s a blur and they’re all on the bullet in the private compartment Amir booked and everyone is staring out the window at this city they’ve missed or never seen before and the conversation turns to how wonderfully Beirut will function as a Wet City.\nHe tries not to catch Mani’s eye too much, but when he does she gives him a conspiratorial smile he remembers. He thinks of the wine and the cheese. They’ll get loads of time together later.\nExcept, the next day Mesilla kicks off the Wet City stuff in earnest. And Amir and Mani start to argue. A lot.\nIn some ways it’s not new. They’d argued as kids, the minutiae of pan-humanist theory over hot black tea: whether animals deserved more pronounced protection than plants, whether population control was ever justified, whether power should in all cases decentralize in the direction of local communities.\nBut now the stakes are different. They’re different. The worst of the arguments take place during project meetings, in front of Hanne and Caveg and the rest of the team. Amir leaves meeting after meeting feeling battered. The way Mani seems to have a reassuring study on hand to refute each of his worries makes him clench his jaw in a very uncivic way. He’s so embarrassed by the incessant jaw clenching he grows his beard out to hide it.\nThey avoid casual conversation for the better part of two weeks. Amir starts to hate going to work, which has never happened before. Then, one Monday, Mani stops at Amir’s station, gets close to see if he’s working in Impulse, and he can smell her perfume, mineral and saline and only the slightest bit sweet.\n“Help me draft an advisory? If you’re not busy?” she asks. She lifts a satchel. “I brought us tea from kiosk auntie downstairs.”\n“Advisory?” Amir’s immediately on edge. “Do you need planning language in it? Can Caveg help?”\nMani’s eyebrows come down. “I don’t really need planning language in it. I just miss doing things together. I thought there’d be a lot more of that.”\n“Yeah,” Amir says, and stands to follow. He remembers following her that first time, in the misting rooms. He doesn’t understand himself. He’s been waiting to have Mani back for a decade—not a vague wistfulness, but an active full-body sort of waiting, if he’s really examining it. And now she’s right here, and he can’t bring himself to speak to her without getting upset. The funny thing is that he’s not even angry at her. It’s something more like bedazzlement. She’s a sun that blasts his vision into afterimages.\n“Or,” Amir says in the corridor, “we could go to our old café? It won’t be too busy right now.”\nMani nods decisively. “Let’s go. Sameen will happily take the kiosk auntie tea.”\nThe bullet ride is mainly Mani pointing out new art installations and green spaces and Amir telling her what year they were built and why. He’s good at this. He does almost all of them without Impulse, but confesses when he has to look one up. Mani gives him grief for not knowing them all by heart.\n“Everyone told me, oh, Amir, Beirut Grid’s own whizkid. A sort of city-planning savant. I guess I expected more,” she teases.\n“No one said that,” Amir says. “And even if they did, IUH has given you impossible expectations.”\n“Pan-humanism is all about realizing a civilizational system that game theory would say is impossible, right?”\n“Right,” says Amir. “But there’s plain old pan-humanist theory impossible and then there’s IUH Mogadishu impossible.”\nThe bullet slows and stops beside their old café. They go down the boardwalk to their usual table, tap across an order of tea, and settle into their respective chairs. “Wow,” says Amir.\n“Swap adult clothes for swim knickers and shave the beard and it could be a decade ago.”\nAmir lifts their order of tea off a tray bot. “Were we that familiar with each other? Hard to believe.”\nMani takes her glass from him. “Oh yeah. We were ridiculous. Like one person in two bodies, back then.”\nAmir startles in a way that melts him into himself, like his chest is swallowing the rest of him, swallowing his words. Mani’s always been the forthright one, but they both know he’s more sentimental, and he’s afraid that if he says anything now it will be too much.\n“You don’t like the beard?” he manages.\nMani reaches across and strokes his cheek against the grain. “I don’t not like it,” she says.\nAmir shakes his head at her. She withdraws her hand. He’d forgotten how transparent they were to each other. Are, to each other.\n“How’s Rafa?” Mani says, stirring her tea.\n“We broke up last year.” He doesn’t bother waving it off. Mani will know it was a big deal.\nMani’s silent a bit, then: “I just ordered you a glass of ʿarak.”\nAmir laughs and puts his head on his arms. “It’s two PM But thank you.” Seagulls croon from the frames of the yellow beach umbrellas. “This Wet City thing, Mani,” he starts. Doesn’t know how to finish.\n“You don’t believe in it,” says Mani.\nAmir grimaces. “That obvious?”\n“No.” This should be reassuring, but Mani’s turning her teacup in slow circles, not meeting Amir’s eyes. “Amir-with-his-heart-not-in-it works with more passion than most humans on their best days. But I can tell.”\nThis should also be reassuring. Instead Amir feels irritation spiking in his chest. “I’ve spent every moment of my workday for the past six days chasing down permitting documentation for an experimental metallofoam that’s going to be used in less than two percent of the load-bearings struts of the wing structure,” he says. “It’s not exactly how I envisioned my career path. But I’m doing it. It’s not fair to call me out for lack of enthusiasm.”\n“I wasn’t calling you out,” says Mani. “I think you’re doing good work.”\n“Yeah,” says Amir. The ʿarak comes. He plucks it off the tray bot and sets it next to his teacup, aligning them carefully side by side. He can tell Mani is waiting for him to say something else. He shouldn’t. He should try to steer the conversation back toward safety. “Do you remember,” he says, “the Crowdgrow project I told you about during the Future Good conference?”\n“You were really excited about it,” Mani says. “It seemed promising.”\n“It was. The closed-room tests showed a fifteen percent improvement in air quality, and we had almost a thousand households signed up as testers. And we’ve applied for continuation funding every open cycle since. Not a lot—just enough for a pilot study. Less than we spend in administrative overhead on the Wet City project every week.”\n“But no luck?” asks Mani.\n“But no luck,” agrees Amir.\n“Amir,” says Mani, but there’s too much pity in the way she says his name.\n“I know what you’re thinking,” Amir says. “That it would be a waste. That Wet City is a better use of resources.”\n“Yes,” says Mani. “I do think that.” The way she says this could have been kind, but it isn’t.\n“You’re always so sure of yourself,” says Amir. The way he says this could have been a compliment, but it isn’t. “Is it ego?”\n“Is it jealousy?” Mani shoots back.\nAmir feels that familiar muscle in his jaw tic. He takes a careful, measured sip of ʿarak, as if that will hide it. “If this goes wrong—” he begins, once he’s sure his voice will come out steady.\n“Oh, please,” interrupts Mani. “You’re going to tell me to be afraid of trying something really big, really innovative, because there’s a chance we’ll end up looking like fools? Now that’s ego.”\n“It’s not about personal reputation,” Amir says. “It’s about the wasted money, the time, the emotional investment—do you know how demoralizing a project like this can be for a community if it fails—”\n“It won’t fail.”\n“You can’t know that.”\n“We’ve done all the tests and simulations and proof-of-concept models we can, Amir. The only way to be any more sure is to let someone else go first, and I’m not willing to do that.”\n“Ego,” says Amir.\n“So what,” Mani snaps, sounding genuinely angry now, “we’d all be better off staying in our backyards planting mutant daisies? Grow up, Amir. You have the chance to work on something that really, actually matters here, and you’re too scared to take it.”\nIf it were Amir, he would regret such harsh words immediately, start falling all over himself to apologize before the sting had a chance to land.\nBut it’s Mani. And Mani always says what she means.\nAmir looks down at the now-empty glass cradled in his fingers. “It’s getting late,” he says. “We should probably be getting back.”\nMani stands, the legs of her chair protesting loudly against the concrete. “We get this chance—” she stops. “I can’t understand why you’re making it so hard.”\nHe should argue. Instead, he orders another ʿarak, and doesn’t let himself watch her walk to the bullet station.\n4: THAT EACH OF US INVESTS THE LABOR\nIt’s not that Amir and Mani stay angry a whole year and a half. Something that dire would’ve spurred Amir to action, forced him to have the trembly, awkward conversation that showed them the way back to exchanges of essay clippings and meandering debates and maybe even limb-jumble lie-downs after a gigantic dinner cooked together.\nThey are not angry: they are too intelligent for anger, Amir thinks, or too proud. They’re just hardened to each other. Their words bounce, too few absorbing. Their lunches together have one too many silences that call for a new conversation thread, and when congratulations are due—as when the first wing is drone-dropped into place at Martyrs’ Square and measurements show promising vapor transfer into the condensation bays at the base—their hugs are guarded and bodiless.\nThe Wet City project hits miraculously few snags, but once or twice Amir catches a design flaw that makes Mani give him a deep, reckoning look.\n“I’m just doing some calculations in Impulse,” Amir says. “The Beirut-3 east wing might not come out inwardly reflective the way we want, with the new bug-in-amber angled like that?” Bug-in-amber is their shorthand for the art pieces they’ll embed in each translucent wing, one of Amir’s favorite streams of the project. He taps across his calculations.\n“Whizkid,” is all Mani says, and Amir almost asks if she wants to grab dinner with him after work. He doesn’t. He gets better at finding flaws, though. There are times when flaws are all he sees.\nPost-water-crisis Beirut is mesmerizing, boisterous street markets by day and elaborate street parties by night.\nAmir and Joud meet every couple of weeks to trawl the artisans’ quarter in Nouveau Centre-Ville, Amir on the lookout for sustainable art references for the much larger bug-in-amber pieces to come, Joud hoping to enrich their collection of silk and brocade Lebanese abayas. They are especially taken by androgynous styles that combine an embroidered abaya tunic with a shirwal bottom. They stroke the parchment packets, their fingers lingering on the teardrop calligraphy of the artisan’s sigil. The two of them often return to Amir’s apartment with towering ice cream cones, and Joud tells him what they’ve learned about tonight’s artisan on Impulse, and they have the sort of voracious, aching sex that comes after absence.\n“How is Mani?” Joud asks tonight, nestled against the hollow of Amir’s chest. Joud frequently asks about Mani. They know, but their affection for Amir is so confident, so stable, that the question can come right after intimacy and carry no trace of malice or envy.\n“Today she proposed a walkway up the side of the sea-facing wings for a view of the sunset,” Amir says. “And yesterday she gave a site tour to a delegation that arrived two days early from Singapore.”\nJoud hums in appreciation. They always do. Joud loves expansively, navigating a multitude of relationships with a grace and wholeheartedness that makes Amir feel he’s never absorbed a moment of personal growth.\n“You don’t have to indulge me, you know,” Amir says. He presses three fingertips against the place where Joud’s temple meets soft brown hair, scratches them there tenderly. “You and I have been in each other’s lives two years and I’ve never been—I mean, Mani’s always been—”\nJoud stills his lips with their cheek. “It doesn’t bother me, darling. What I figure is some people stand beside each other, and some people end up locked together,” Joud laces their own hands tight, to the knuckles. “And I don’t think the latter is better.”\n“You’re right, love,” Amir says to Joud, who smells like green branches and clay and sex. In that moment the appellation feels miraculous and genuine on his tongue. “In many ways it’s worse.”\nThere are times when hitting the forecasted Wet City launch date seems like a pipe dream, but as more and more pieces slot into place, it starts to become attainable, and then an unavoidable reality. Twenty hyper-efficient months after Hanne’s distracted aside in the conservatory, the first wings come online; the engineers begin their final stress tests; the notion of a citywide festival around the launch begins to coalesce. And then, with three and a half months to the launch date, Mesilla calls Amir into her office.\nTwo of their artists won’t have their bugs-in-amber finished by the festival and Amir’s been heading up the effort to ensure their temporary prototypes are materially similar enough for the engineers to work with; he assumes this is what Mesilla wants to talk about. Instead he’s greeted by a stranger. “Amir,” Mesilla says, “I wanted you to meet one of my oldest colleagues: Adah Bertonneau.”\nAdah Bertonneau is even taller than Amir, with impressive cheekbones and two-hand-clasp handshake. “A pleasure to finally meet you,” Adah says, their accent a rich, rolling thing Amir can’t quite place.\nAmir smiles, puzzled. “Finally?”\n“Read your Crowdgrow grant application five years ago now,” says Adah. “Told myself I’d make Mesilla introduce us if I ever made it to this part of the globe. And here I am.”\n“Oh.” Amir resists the inclination to try to look up Adah on Impulse—he’s still not very good at interfacing with it discreetly. “Well, unfortunately, we haven’t had the opportunity to prove out the research, but I hope that one day—”\n“Mx Tarabi,” interrupts Adah. “That is, of course, precisely why I’m here to talk to you.”\nAdah Bertonneau, it turns out, works at the Nantes Center for Naturalist Studies. The Center is neither large nor prestigious (Amir gives up and looks it up on Impulse), but their work seems well-respected enough, and a few of their recent papers have appeared in journals Amir would have once given his eyeteeth to be published in. Adah’s lab is new, getting off the ground with an extremely generous grant from France Centrale, and it seems, more or less, that they’re looking for ways to spend it.\n“One must make a splash early,” says Adah, peering at Amir seriously over the rim of their teacup. “We’re frontloading, trying to get several programs up and running right out the door. Not all of them will work out in the long term, of course, but I’d guarantee funding for the full two-year period you requested, regardless of the findings. Between you and me, though? I have this . . . call it a premonition, that what you’ve proposed is going to work.”\nOf course it’s a dream come true. And of course the timing couldn’t be worse.\n“I wish I could tell you to take your time making a decision,” continues Adah, “but the start date’s in a month, and I’m afraid it’s not flexible.” They want to do the study with a particular crawler vine, Adah explains, whose cuttings are most viable in the fall. One week, and they’ll need a yes or no, “else there won’t be enough time to get the paperwork in order, you understand.” Amir understands. Hands are shaken. Mesilla walks Amir out.\n“Take the rest of the day,” she says. “I—well, I don’t know whether to say I’m sorry or congratulations. I know it’s a lot at once.”\nAmir very nearly just asks her to tell him what to do, but she seems to read this on his face. “We can talk it over tomorrow, if you need. But sleep on it. Before you start cataloging opinions.”\nAmir nods. It’s smart. Mesilla’s always smart. He goes to his office, gathers his things, does his best to slip out unnoticed.\nExcept he runs into Mani waiting for the elevator.\n“Hey,” she says, smiling a little awkwardly, that try-hard friendliness. Then she spots his messenger bag. “Headed out?”\nIt’s not even ten in the morning. Amir hits the down button again—the Grid’s elevators are vintage, which is a cute way of saying unbearably slow. The doors are mirrored; Amir read somewhere that mirroring elevator doors reduced complaints about wait times, because people got carried away admiring themselves. He wonders if it’s true. He hopes it’s not. He thinks it probably is.\n“Mani,” he says, “I’m quitting.”\nMani’s reflection stares at him.\nThe doors bing open.\nAmir steps into the elevator; Mani takes an extra second to step in after him.\n“Explain,” Mani says. “Now? Are you serious?”\nAmir is serious. He only knew it as he said the words aloud. “Skive off today?” he asks Mani, pretending he doesn’t hear the note of pleading in his own voice. “I could really use a drink.”\nThey end up going back to his. They take the bullet train in silence—it’s mostly empty at this odd hour of the morning, but the tunnel-rush of wind makes holding a conversation difficult. The ride’s only five minutes, but it’s long enough to put Amir on edge. He stares down at his interlaced fingers, bracketed by his knees. There’s an empty seat between him and Mani, because there was space to spread out, and why would they not? After all, these days, it’s not like they’re—well. It’s barely like they’re friends.\nMani has never been to Amir’s apartment. He realizes this as he keys into the front door; they’ve tried, a few times, vague agreements about dinner that fell through at the last moment, meetings that wound up getting moved to workspaces with excuses of better bullet access. It should make him nervous, he thinks. He should be worrying about the fact that none of his coffee mugs match, or whether he left toothpaste flecks on the bathroom mirror that morning. But he isn’t nervous. Mani knows all the worst parts of him already.\nThe Bekaa Valley Merlot is still at the back of the cupboard, because Amir’s life is a joke. He uncorks it and pours them both generous glasses, and settles himself next to her at the small kitchen table. “There’s a research institute in Nantes,” he says. “They want to fund a Crowdgrow roll-out.”\nMani looks stunned, just for a second, then raises her wineglass. “This is now a toast,” she says. “To the long overdue recognition of my brilliant friend Amir Tarabi.”\nAmir tilts his glass toward hers. “Thing is,” he says, “I’d have to start basically immediately. A few weeks. I wouldn’t be here to close out Wet City. I wouldn’t be able to make the launch festival.”\n“ . . . oh,” says Mani. She lowers her glass. “Damn.”\n“Right.” Amir lowers his glass, too. He’s not quite sure how to look at Mani, so he focuses on the wineglass, turning it in careful circles, watching the light refract. “I mean, it’s not the end of the world,” he says. “I’ll need to pass some stuff off sort of hastily, but let’s be honest, I’m no longer really essential personnel. And I don’t care about the festival. It’s just . . . ”\nAmir stops, looks up. He doesn’t know how to read Mani’s expression. Complicated, sad. A little like how she looks when she’s working her way through a thorny problem. She reaches forward, finding his fingers with her own, carefully unlacing them from the stem of the wineglass. She holds his hand there in the warm cradle of her palms, running her thumb in a discovering sort of way across the ridgeline below his knuckles, as if she were going to read his fortune.\n“It would have been nice,” says Mani, “to have had more time.”\n“Mani,” says Amir, helplessly. She looks up, looks at him. He feels on display, as if she’s taking inventory of him, all the things that are different, all the things that are the same. He swallows. “I want—” he says.\nMani reaches up, running her fingertips through the scruff of his beard, bracing her thumb against his cheekbone. “Come here,” she says. He goes, letting her guide him forward until she finds his mouth with hers, and kisses him.\nHis mind goes blank. He’s a teenager again, unsure what to do with his hands. He loves her so much he thinks he might fly into a million separate parts.\nShe undresses him first, won’t let him help, won’t let him touch, torturous slowness as she undoes every button, every hook. She runs her fingertips over all the planes and angles of him, presses teasing thumbs into the hollows by his hipbones and kisses him until he feels drunk with it. Then she lets him do the same to her, and she takes his hands and shows him where to touch, and he thinks this might be the most beautiful thing he’s ever done.\nAfterward, they lie tangled together, exhausted, belly-to-flank, Amir’s cheek pressed against the top of Mani’s head. The warm reality of her, the slow swell-and-recede of her body against his, is almost too much to stand.\n“I’m going to miss you,” Amir says. “I’m going to miss you so much. It wasn’t enough time.”\nHe feels her pause, then twist to look at him. “I shouldn’t have said that, earlier,” she says, very serious. “We can’t think that way. We have to say to ourselves, this was right. This was exactly enough.”\nAmir shuts his eyes, tips his head forward to rest against hers, and tries to believe it.\nHe keeps his eyes closed until they both fall asleep.\n5: THE BEAM COMES ON, ILLUMINATING US ALL\nAmir arrives in France just after dawn on a foggy fall day. His out-breaths add frills of fog to Nantes’ thick cloak of it. He keeps his Impulse off after landing. Sounds muffled, skin damp, his first impression of his new home is of being underwater.\nHe explores the city on foot, stopping for croissants then brioches then tartines. At sunset, he sits on the lawn of the Château des Ducs de Bretagne and tosses a bag of soy chips to two mallards and their ducklings paddling in the castle’s moat. Impulse would help him form a mental map, but he knows if he turns it on he’s going to look for a message from Mani, and if there’s none he’s going to be heartsick. And if there is one he’s going to be heartsick.\nThree things cycle through Amir’s mind: first, how to make the most of this opportunity; second, how desperately he needs to recenter himself in personal growth practice; third, the problem he’s had for most of his life, which is that he can’t stop thinking about Mani.\nAmir wakes up with the sun on his first morning in his Nantes apartment and he takes creaking steps that raise dust motes along the woodgrain floorboards. At the window he turns Impulse on and his heart rattles the split-second before his unreads appear.\nNothing from Mani.\nAmir starts to compose a message. “Hi! Nantes is beautiful. There’s a duckling in the castle moat who has learned to swim alongside—” then he closes his eyes, hard, and deletes. When he opens them the weathervane across from his window has flipped 180 degrees and the sun is a blur of honey.\nThe Crowdgrow pilot takes place along two residential streets in Nantes-2, just north of the Gare de Nantes. Amir hand-delivers cuttings of ecoboosted crawler vine to each of the experiment’s participants.\n“Je vous attends toute la matinée,” says one girl when Amir puts the little red planter pot in her hands. Her tight cornrows have been braided into an orchid-shaped bun on top of her head. She takes him round to the back garden, shows him the sheltered hole in the soil she’s dug. There is so much care in her actions that Amir’s belief in—dedication to—Crowdgrow redoubles just like that.\n“Mes mamans disent que le ciel sera plein d’oiseaux,” she says.\n“Yes,” Amir replies through Impulse. “As many birds as the sky can handle.”\nNantes is on a clean air travel vector with Beirut, so Joud comes to visit the week before Amir presents the results of the pilot to a delegation from Nantes’ municipality. They go to Nantes’ shipyard island, go on mech-AI safari. They feed the giant hydraulic elephants from a tray of silicon peanuts, and the elephants regurgitate silicon caricatures of Amir and Joud. Joud’s is great: an impossibly vertical cone of hair, small ears rendered as notches. Amir’s own caricature makes him feel every year as old as his thirty-two, and older.\nHe wraps their portraits up and tucks them in his bag, presses Joud close. Arm in arm, they survey nearby menus on Impulse until Amir finds one that does a much-lauded synth-protein steak with cassava frites. They wash it down with crisp, sweet Breton cider.\n“To new avenues,” Joud says.\n“To the companions who walk our lives with us,” Amir says. The words are from a passage Mani once clipped from a poem. He clinks the neck of his bottle against Joud’s.\nThe first results come back from Crowdgrow in Nantes-2. The air quality in that sector has improved a modest part per billion, but what’s really encouraging is that all the crawler vines have survived. Many have gained a meter or more in length. The pilot expands to a citywide project, Adah’s grant money matched by government funds.\nAmir comes home late one evening from overseeing a plant-in at a primary school, a little dazed from hours of sun and excitable schoolchildren, but in good spirits. He’s dirt all over, ground into the new callouses on his palms and spilling from the hems of his trousers. The soil here is still toxic, and he should probably wash it off before doing anything else, but his diminutive wrought-iron balcony gets an excellent view of the sunset, and he can’t help but peel off his shoes and socks and sit down at the wooden folding table to watch it. The last flash of sunlight is winking out on the windows of the Cathédrale Saint-Pierre et Saint-Paul when his Impulse pings with a call from Mani.\nHe answers without thinking—or, he answers before he can let himself think about it. “Mani?” he says, a question, like it could be anyone else.\n“Hi,” says definitely-Mani. “Are you—”\n“Free,” says Amir, straightening a little, though she hasn’t initiated holo. “I mean, I just got home from work. I was just—” He stumbles. Watching the sunset feels too corny. “Relaxing,” he finishes.\n“Good,” says Mani. “I saw on the Beirut Grid announcement stream that your project won that funding extension from the city. Wanted to say congratulations. So, well.” She laughs a little. “Congratulations.”\nAmir sinks back into his chair. “Thanks,” he says. “You too. I watched your speech at the launch ceremony. It was really beautiful.”\n“Thank you,” says Mani. “I read your message to the team.”\nHe’d figured she had, even when she didn’t respond. He’s not sure what to say to this.\n“You should have been there,” Mani says.\nThe morning of the Wet City launch festival in Beirut, they’d gotten the first full bloom on a crawler vine in Nantes-2, a pale blue flower veined with green, nearly the size of Amir’s head. The stem wasn’t robust yet; the smallest breeze set the blossom trembling, like any moment it would come free and drop to the earth. Amir had spent most of the morning crouched in the dewy garden, waiting to see if it would last. “That’s kind of you,” says Amir, “but you were fine without me.”\nThe connection goes so silent Amir has to check Impulse for the activity blip.\n“It’s been harder,” says Mani, “than I thought it would be.”\nAmir closes his eyes. He wants to say: I would come back if you asked me to. He wants to say: I wouldn’t have left in the first place. Instead he says, “Mani.”\n“I love you,” says Mani. “Even if we never quite figure out what that should look like. You know that, right?”\nThe breeze is sharpening with night, carrying scents of yeast and toffee from the bakery on street level. The latticework of the metal balcony presses geometry into the soles of Amir’s feet. He can hear the soft hush of Mani’s breath, in and out.\n“Yes,” says Amir. “I know.”\nOver the next seven years, Nantes becomes a garden city. Every green space is verdant with ecoboosted flora from Amir’s program; parks and groves are remade from concrete lots and musky alleys. The skies, as one little girl had once hoped, are full of birds.\nAmir spends one of those years working with his team on tweaks to the Crowdgrow flora to ensure the boosted species are hospitable to native ones, and that summer there are small populations of roe deer, and bushes of garden aster, and swallows, and a sighting of a pair of endangered partridges on the steps of the Théâtre Graslin.\nMani stays in Beirut after Wet City launches, takes up a just-formed position as Beirut’s Minister for Enrichment. Amir pieces together through her understatements and Impulse research that this means she oversees almost every program in Beirut that impacts quality of life—standards for natural lighting in modular housing, breeding programs for Mediterranean loggerheads, the national poetry curriculum. He’s immensely proud and touched.\nAmir thinks about surprising Mani in Beirut for her thirty-sixth birthday; he’s been back home twice while Mani was away on diplomatic visits, just bad luck. He asks circumspect questions to make sure she’ll be in town, buys a ticket. The day before the flight he gets scary news: one of the Crowdgrow fern populations has been proliferating invasively, has killed off a native garden. Amir gets on a bullet to Nantes-11 and he’s so nervous about the clean-up operation he doesn’t see the inside of his apartment for three days.\nThey control the fern; he misses his chance to visit Mani.\nTime goes so quickly those years. But he spends more evenings sitting on his balcony watching the sunset than not.\nIt’s Adah who brings Amir the news personally: they’ve received an application to start a Crowdgrow program in Beirut.\nIt’ll be the seventeenth spin-off of the original Nantes pilot—the first three Amir went to oversee himself, spending months in Bruges, Liverpool, Alexandria. After that, they’d developed a formula, easy for new cities to follow with only a few weeks’ oversight from Amir’s staff.\n“It’s below your pay grade,” says Adah. “But I thought you might want to take this one on yourself. Chance to catch up with old friends. But we’ll send someone else if you’re too busy.”\nAmir is definitely too busy. “Don’t send anyone else,” he says. “I’d love to go.”\nAmir calls Mani that afternoon as he’s walking home from work, feeling like something in him’s unfurling in the late autumn sun. “I hear someone in Beirut ordered some mutant daisies,” he says the moment she picks up.\n“Smug,” Mani says. “I was so pleased when the proposal came through.”\n“Me too. And, um. Adah asked if I wanted to come do the kickoff myself.”\nThere’s a pause. “What did you say?”\nAmir huffs. “I said yes, obviously! What do you think?” He scruffs his knuckles over the stubble on his jawline, tries to keep his voice casual.\n“I’ll clear my calendar,” Mani says.\nAmir’s Impulse pings with an unread as his plane begins to descend into Beirut. Joud. Meet at the rock wharf by al-Raouché, bring a warm coat.\nIt’s five AM and Amir’s had no sleep. He’s really getting too old for no sleep. But the trembly adrenaline of night flights and home is a jolt in his chest, so he goes, his luggage tracking him at a polite distance.\nThe wind is insistent and briny. Amir seals his coat to his chin. There’s a huge crowd at the wharf, and food kiosks, and banners, a bunch of institutional logos he doesn’t recognize, and one he does—Beirut Grid’s.\nJoud finds him where he’s paused at a corniche railing trying to work out the reason for the commotion. He hasn’t seen Joud in two years, not since Joud moved into a rundown mountain house in Ehden with three partners and their five little ones to begin hand-renovating the house to ecopositive standards.\nThey look great. Sun-hardened, their hair a wiry nest of salt and pepper, clipped a little closer than Amir remembers.\n“There’s a team from Beirut Grid here,” Joud says when they hug. “And a couple of my kids. I want you to meet them. Leave the luggage, come.”\nJoud leads Amir into the wharf and onto the rocks beyond, where adults and children are queued up to use what look like fishing poles. There’s a din of excitement and an occasional whoop of triumph.\nAmir is stunned. “Are they fishing?”\nJoud laughs, just as three little humans run into their arms shouting, “We fed one!”\n“Show Amir,” Joud says, and a kid with the same shy grin as their parent holds out a glossy pellet cradled in their palm.\n“Vitamin feed to correct an imbalance in the ecosystem,” says Joud. “It’s civic engagement, a bit of publicity. There’s a water-soluble version they’ll pump in after.”\n“Joud?” asks the smallest child. “Are they going to come live with us?” They glance at Amir. “We have enough water for them to do a mineral soak once a week too.”\n“He’s welcome to come live with us,” Joud says, and Amir forces himself not to look away from the softness on Joud’s face.\n“Amir Tarabi! Of all the fish-feeding parties in all the towns . . . ” says someone behind him. He turns around to see Mesilla carrying a pail, and behind her Hanne and Caveg.\n“This is crazy,” Amir says, and gathers them into a hug. “I just got off the plane from France. How . . . ”\n“Maybe not totally a coincidence.” Joud winks at him. “I thought Mani would be here too. But her assistant told me she’s working a short day today, had to wrap things up at the ministry.”\nHanne cracks a joke about Amir still overthinking everything, except now in French, and it’s one of those moments younger Amir wouldn’t have believed in: like the universe has turned its spotlight on him, for a fleeting instant, and instructed him to rest.\nEventually, the trajectory of the future will look like this: some years, Amir in Beirut, guest lecturing at Pan-Humanist Polytechnic, consulting on the new ecoboosted installation in Zahleh, taking a sabbatical to work on a collection of essays about crowdsourcing civic change. Some of those years, Mani in Beirut too, but others, Mani in the Arctic, Mani back in Mogadishu, Mani on the Gulf Coast. Once, eighteen glorious months both in Beirut, a routine of dinner parties at Mani’s girlfriend’s loft apartment, and stargazing every third weekend during Beirut’s Dark Skies nights: picnic blankets and wine, Amir’s head in Mani’s lap, Mani’s fingers in his hair. Once, ten long years where the vagaries of circumstance mean they don’t manage to see each other at all.\nEventually, all the days in a human life, whether or not they feel like enough.\nBut for now, all the hard, gut-ache hope and all the pragmatics and all the inexorable decades coalesce like this: Amir steps out of a Beirut hotel two streets up from his old al-Manara apartment holding a potted Crowdgrow cutting, and points himself toward Stella Kadri Square.\nMani messages him just as he spots the showcase Wet City wings fanning out in the distance, describing the perimeter of the brand new square. Their bugs-in-amber make them into a museum of petrified art. He saw hundreds of the wings from the air and he’d seen the beachfront ones from a distance on his brief visits home, but now they strike him. It’s like walking toward the foot of a mountain, that same organic rightness of approaching and finding the world continuing up and out beneath his feet.\nMani sends him geo for a bench she’s found. He wants to play that old game of how long has it been, but he draws every minute of personal growth he’s ever done to ground himself—he notes the flinty musk of impending rain, the drawn out ping of the bullet slicing across the city, the tickle in his throat from the boosted pollen of the Crowdgrow cutting. His heart, beating in his neck.\nAmir spots the bench from a distance. Mani is a blue-coated speck on one side of it. He’s shy, suddenly, walking into a casual get-together with Beirut’s Minister for Enrichment, walking across the grandeur of a public space he knows she conceived and oversaw to completion, a tribute to the world Mani’s rallied for and railed against so passionately her whole life. Then Mani messages him a biofeedback wave, and Amir viscerally feels her excitement hum in his brain, and he’s not shy anymore. He wants to be near enough to touch her so badly. He almost breaks into a run.\nBut doesn’t. He gets close enough for her to hear him and shouts “Mani!” Her peacoat’s the shade of the ocean, collar drawn up. Her face is open and happy. Amir can’t believe she could possibly wear that expression for him.\n“You look like you’re having a pretty good day,” he laughs.\nShe shakes her head, gets up, and closes the distance and hugs him and her cheek is right over the brutal hammering of his heart. Amir stands as still as he can, clutching the Crowdgrow pot against Mani’s back, waiting for the moment she breaks the embrace, kind of hoping that will be never.\n“I brought you a cutting,” Amir says.\n“Welcome home,” Mani mumbles. Her voice vibrates in his chest.\n“To us both,” he says.\nShe turns her face up to his and puts fingers on his jaw and kisses him and doesn’t stop, and Amir must really be in a kinder world because it starts to rain, raindrops that splatter open, big and clean and warm.\nSara Saab was born in Beirut, Lebanon. She now lives in North London, where she has perfected her Resting London Face. Her current interests are croissants and emojis thereof, amassing poetry collections, and coming up with a plausible reason to live on a sleeper train. Sara's a 2015 graduate of the Clarion Writers' Workshop. You can find more of her on Twitter as @fortnightlysara.", "source": "https://clarkesworldmagazine.com/barber-saab_09_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pan-Humanism: Hope and Pragmatics by Jess Barber and Sara Saab"}