{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Carrie Sessarego", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "a+xjHO19o9+hJ6UMTTZt+gWQVHY=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Fungi in Fiction  Depictions of alien life-forms in movies and television are constrained by budget, by practicalities, and by storytelling purposes. For the purposes of budget and storytelling possibilities, Hollywood tends to highlight aliens with whom we can communicate, combat, cooperate with, and (if the original Star Trek is any indication) have sex with. Because of this, most aliens in visual media are bipedal and humanoid in appearance.  However, our own planet teems with life that is far more alien (in the sense of having profoundly different biological systems than humans) than most Star Trek characters. One of the most bizarre forms of life are fungi, a kingdom that includes an estimated 1.5–5 million diverse species. Some fiction has explored the concept of fungal life-forms on Earth and elsewhere.  Remember playing Twenty Questions? Fungi are technically neither animal nor vegetable nor mineral, instead, they constitute a taxonomy kingdom all their own. The kingdom of fungi includes mushrooms, yeasts, and molds. Like animals, fungi must consume or absorb nutrients from other carbon-based sources. Some break down decaying matter, while others have adapted to leech nutrients from living sources.  Most fungi reproduce using spores, but others engage in sexual reproduction involving the mingling of hyphae. Hyphae are long structures, like tiny threads, that form the main body of the fungus and extend far into the soil or other matter that the fungus is growing on. When you cut a mushroom stem in half, it appears fibrous because it is made of millions of fibers—the hyphae. When hyphae extend and connect with other hyphae, they create a mat or a net of hyphae that is called “mycelium.” Forests sit on an underground network of mycelium through which energy impulses travel. The nature of these electrical impulses and the movement of nutrients across fungal and plant organisms is the topic of much study and speculation. This network of hyphae and plant roots, all of which seem to feed off of and pass messages to each other, is sometimes referred to as “the wood wide web.”  The mushroom you see is the spore-laden body of an organism that may extend for miles. A single specimen of honey mushroom (Armillaria ostoyae) is thought to be the largest single organism in the world (by area), with mycelium that stretch over 8.9 square kilometers (over 5.5 miles) in a forest in Oregon. Fungi have been around for at least one billion years and are widely thought to have been the first organisms to live on land on our planet. They thrive on every continent, including Antarctica. Deserts, forests, and deep-sea hydrothermal zones are home for fungi. Some fungi have been exposed to low-Earth orbit and the radiation of deep space and survived. Others were found in the International Space Station, where they most certainly were not supposed to be.  Fungi are ever-present in the world of humans. Without them there is no risen bread and, heaven forbid, no beer. We consume fungi in the form of edible mushrooms and consume drinks and seasoning fermented with yeast, including wine and soy sauce. The blue veins in blue cheese are caused by fungi. Mushrooms and molds in past and present form the basis of psychological and spiritual explorations as well as life-saving medicines, including penicillin. They are used as pesticides, as an enzyme in certain products, such as detergents, and experimentally as building materials.  Fungi are also constantly present in and on our bodies. A 2010 study found that there are approximately nine to twenty-three fungal species in the human mouth alone. Most of these fungi are harmless to humans. Others cause discomfort or make us sick, as in the dreaded athlete’s foot, yeast infection, and ringworm, a condition that is caused by a fungus and not a worm as the name suggests. Stachybotrys chartarum, AKA black mold, is loathed by homeowners since it is anecdotally linked to health problems in humans. Farmworkers dread contracting Valley Fever, a respiratory disease caused by inhaling the spores of Coccidioides, a soil fungus.  Neither animal nor vegetable nor mineral, and with the ability to survive almost anywhere, fungi are truly bizarre. Many writers of speculative fiction have used certain qualities of fungi in their stories and most fall into one of four camps:  \r\n  Fungi grows on everything until everything is dissolved by it, the way certain kinds of fungi grow on decaying fruit. In other words: if you touch it or breathe it, it consumes you.  Fungi take over the nervous system and brain of a still living organism, the way Ophiocordyceps unilateralis takes over the bodies of ants (more on this to come). In other words: if you touch it or breathe it, it controls you.  Sentient fungal life-forms exist either instead of or alongside humans and other life-forms. In other words: it coexists or competes with you on a sentient level.  Fungi can be utilized in ways we haven’t discovered yet. If you are sufficiently advanced, you can unleash its endless potential as a tool.  Looking at the first type of story, the one that posits that if you touch or inhale or ingest a substance, that substances will consume you utterly and inescapably: every living creature on this planet dies and, eventually, decomposes, with fungi playing an important role in this decomposition. What is horrifying is the extent to which fungi attempt to decompose organisms while they are still alive. The attempt to keep windowsills and bathrooms free from the mold that devours wood and wallpaper can drive a homeowner mad with frustration. Food that looked fine one day may the next day be transformed into a ball of powdery fungus. Many speculative fiction writers take this further and imagine what would happen if fungi colonized a person or an environment and devoured it while it was still alive. This theme combines a horror of death, contagion, and “the other,” not to mention an epic amount of body horror and a kind of obsessive-compulsive nightmare, as characters attempt to avoid exposure to a substance that is everywhere.  The quintessential story of this type is “The Voice in the Night” by William Hope Hodgson. Hodgson was an early writer of weird horror and an influence on H. P. Lovecraft and others. He spent much of his life at sea and his horror stories set at sea contain an authenticity that makes their supernatural elements all the more terrifying. This particular story also inspired the movie Matango, from 1963, directed by Ishiro Honda of Godzilla fame.  In “The Voice in the Night,” a ship responds to a cry for help from a rowboat. The person in the rowboat refuses to come aboard but begs for provisions to be floated to him in a wooden box. He tells of how he and his fiancée survived a sinking ship and found an abandoned ship that was coated with fungus. They cleaned the ship but the fungus kept growing back. They took refuge on an island and nearly starved to death. The entire island was covered with the same growth, which the couple found growing on their own skin. Eventually, gradually, and horribly, the couple becomes consumed by fungus, like the other beings on the island.  A more recent example of the “consumed by fungus” story is “Grey Matter,” a short story by Stephen King. In this story, a small-town convenience store regularly sells beer to a local man who disappears. His son comes to the store and tells the owner that the man drank “a bad can” of beer. Since then, the man has been sitting in a chair in his apartment, with all the lights off, undergoing a terrible metamorphosis into a fungal creature.  The story has a cliffhanger ending and leaves the reader with a terrible case of the “ewwwws” as the body horror progresses from a bit of gray slime to the horror described above. While some “consumed by fungus” stories are gorier than others, the body horror element always plays the largest role in the horror of the tale.  The second type of fungus story posits that a fungus can infect a host and control its brain. This is true for certain types of fungus in reality. The genera Cordyceps and Ophiocordycipitaceae include species of fungi that infect insect and arthropod hosts. The mycelium of the fungus grows through and feeds on the flesh of the host while the host is still alive and the fruiting body of the fungus grows through the skin of the host and into the open air, releasing more spores.  Ophiocordyceps unilateralis doesn’t just consume its victim. It infects carpenter ants. The fungus enters the ant’s body as a single cell and colonizes every part of the ant except the brain. The fungus then controls the ant’s muscles, forcing it to climb plant stems until it reaches a height of exactly twenty-five centimeters. At that point, the ant fastens itself onto a leaf, where it hangs until a stalk grows through the ant’s head, finally killing the ant and releasing spores onto the ants below.  Some recent zombie stories have used fungal, rather than viral, infection to explain humans who have lost everything but the desire to feed. In The Girl With All the Gifts, a novel by Mike Carey, a variation of Ophiocordyceps unilateralis infests humans instead of ants, and spreads by contact with bodily fluids instead of by spores.  Additionally, in the video game The Last of Us, characters struggle to survive in a world in which people fall victim to cordyceps brain infection.  Not all speculative fiction stories involve fungal infection. Some describe a world in which sentient, intelligent fungal creatures (usually mushroomlike in appearance) exist either in competition with or alongside humans. A benign version of this can be found in The Wonderful Flight to the Mushroom Planet, by Eleanor Cameron. This book tells the story of two children who build a spaceship and fly to a planet that is covered with mushrooms and populated by people who are essentially also mushrooms, albeit walking, talking, humanoid mushrooms with a full civilization. The children save the planet and launch a series of six books.  In the Ambergris trilogy, Jeff VanderMeer sets up a more sinister relationship between fungi and humanity. The planet Ambergris was originally populated by fungal humanoids known by humans as “grey caps.” Humans took over the city, literally driving the grey caps underground, until the grey caps retook the city and established a totalitarian police state. The trilogy explores issues of colonization and occupation with a side helping of body horror and surrealism.  In recent years, scientists, gardeners, architects, doctors, and others have been exploring the possibilities of using fungus in unprecedented ways. Some of this is finding its way into modern fiction, most noticeably in Star Trek: Discovery. This show named a character after the show’s mycelium expert advisor, real-life mycologist Paul Stamets.  In the universe of Star Trek: Discovery, interstellar travel is made possible through use of the “spore drive.” As explained by Linh Anh Cat in an article for Forbes:   The spore drive operates by bringing USS Discovery into the mycelial plane, where it can traverse the mycelial network . . . In Star Trek: Discovery, mycelia form the foundation of space and connect every aspect of life across the multiverse. The mycelial network is also its own ecosystem. USS Discovery can jump anywhere almost instantaneously using the network.  The Discovery cultures blue spores, which power the spore drive. They glow blue as a nod to the tendency of real-life psilocybin mushrooms (AKA “magic mushrooms”) to have a blue color under certain conditions. In the show, the jahSepp, a species of sentient fungus, live within the mycelium plane and consume matter that enters the plane. The conflict between the jahSepp, who believe that spore drives threaten their existence, and Starfleet, which initially is unaware of the jahSepp’s existence, drives several episodes and character arcs. Other storytelling possibilities appear when Discovery’s crew realizes that it is possible to enter alternate universes through the mycelium network.  Star Trek: Discovery provides an extreme example of how the complex and peculiar real-world biology of fungus can provide storytelling possibilities. Other examples abound. The existence of mushrooms that cause mood changes and hallucinations has inspired many stories, most famously Alice’s Adventures in Wonderland by Lewis Carroll. In the TV series Hannibal, mushrooms provide a body disposal tool for a serial killer named Eldon Stammets (again, after mycologist Paul Stamets). On a more prosaic note, who can forget the hobbits’ fondness for mushrooms in The Fellowship of the Ring, by J. R. R. Tolkien?  Fungi make for fascinating speculative fiction because they are so very, very different from humans, because there is so much about them that is not fully understood, and because the storytelling possibilities they present are almost endless. Whether as agents of body horror, terrifying or liberating forces of mind control, or beings that force us to challenge ideas about colonization, occupation, power, and sex, these amazing life-forms permeate speculative fiction on page and on screen. Carrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats.", "text": "Non-Fiction\nFungi in Fiction\nDepictions of alien life-forms in movies and television are constrained by budget, by practicalities, and by storytelling purposes. For the purposes of budget and storytelling possibilities, Hollywood tends to highlight aliens with whom we can communicate, combat, cooperate with, and (if the original Star Trek is any indication) have sex with. Because of this, most aliens in visual media are bipedal and humanoid in appearance.\nHowever, our own planet teems with life that is far more alien (in the sense of having profoundly different biological systems than humans) than most Star Trek characters. One of the most bizarre forms of life are fungi, a kingdom that includes an estimated 1.5–5 million diverse species. Some fiction has explored the concept of fungal life-forms on Earth and elsewhere.\nRemember playing Twenty Questions? Fungi are technically neither animal nor vegetable nor mineral, instead, they constitute a taxonomy kingdom all their own. The kingdom of fungi includes mushrooms, yeasts, and molds. Like animals, fungi must consume or absorb nutrients from other carbon-based sources. Some break down decaying matter, while others have adapted to leech nutrients from living sources.\nMost fungi reproduce using spores, but others engage in sexual reproduction involving the mingling of hyphae. Hyphae are long structures, like tiny threads, that form the main body of the fungus and extend far into the soil or other matter that the fungus is growing on. When you cut a mushroom stem in half, it appears fibrous because it is made of millions of fibers—the hyphae. When hyphae extend and connect with other hyphae, they create a mat or a net of hyphae that is called “mycelium.” Forests sit on an underground network of mycelium through which energy impulses travel. The nature of these electrical impulses and the movement of nutrients across fungal and plant organisms is the topic of much study and speculation. This network of hyphae and plant roots, all of which seem to feed off of and pass messages to each other, is sometimes referred to as “the wood wide web.”\nThe mushroom you see is the spore-laden body of an organism that may extend for miles. A single specimen of honey mushroom (Armillaria ostoyae) is thought to be the largest single organism in the world (by area), with mycelium that stretch over 8.9 square kilometers (over 5.5 miles) in a forest in Oregon. Fungi have been around for at least one billion years and are widely thought to have been the first organisms to live on land on our planet. They thrive on every continent, including Antarctica. Deserts, forests, and deep-sea hydrothermal zones are home for fungi. Some fungi have been exposed to low-Earth orbit and the radiation of deep space and survived. Others were found in the International Space Station, where they most certainly were not supposed to be.\nFungi are ever-present in the world of humans. Without them there is no risen bread and, heaven forbid, no beer. We consume fungi in the form of edible mushrooms and consume drinks and seasoning fermented with yeast, including wine and soy sauce. The blue veins in blue cheese are caused by fungi. Mushrooms and molds in past and present form the basis of psychological and spiritual explorations as well as life-saving medicines, including penicillin. They are used as pesticides, as an enzyme in certain products, such as detergents, and experimentally as building materials.\nFungi are also constantly present in and on our bodies. A 2010 study found that there are approximately nine to twenty-three fungal species in the human mouth alone. Most of these fungi are harmless to humans. Others cause discomfort or make us sick, as in the dreaded athlete’s foot, yeast infection, and ringworm, a condition that is caused by a fungus and not a worm as the name suggests. Stachybotrys chartarum, AKA black mold, is loathed by homeowners since it is anecdotally linked to health problems in humans. Farmworkers dread contracting Valley Fever, a respiratory disease caused by inhaling the spores of Coccidioides, a soil fungus.\nNeither animal nor vegetable nor mineral, and with the ability to survive almost anywhere, fungi are truly bizarre. Many writers of speculative fiction have used certain qualities of fungi in their stories and most fall into one of four camps:\n- Fungi grows on everything until everything is dissolved by it, the way certain kinds of fungi grow on decaying fruit. In other words: if you touch it or breathe it, it consumes you.\n- Fungi take over the nervous system and brain of a still living organism, the way Ophiocordyceps unilateralis takes over the bodies of ants (more on this to come). In other words: if you touch it or breathe it, it controls you.\n- Sentient fungal life-forms exist either instead of or alongside humans and other life-forms. In other words: it coexists or competes with you on a sentient level.\n- Fungi can be utilized in ways we haven’t discovered yet. If you are sufficiently advanced, you can unleash its endless potential as a tool.\nLooking at the first type of story, the one that posits that if you touch or inhale or ingest a substance, that substances will consume you utterly and inescapably: every living creature on this planet dies and, eventually, decomposes, with fungi playing an important role in this decomposition. What is horrifying is the extent to which fungi attempt to decompose organisms while they are still alive. The attempt to keep windowsills and bathrooms free from the mold that devours wood and wallpaper can drive a homeowner mad with frustration. Food that looked fine one day may the next day be transformed into a ball of powdery fungus. Many speculative fiction writers take this further and imagine what would happen if fungi colonized a person or an environment and devoured it while it was still alive. This theme combines a horror of death, contagion, and “the other,” not to mention an epic amount of body horror and a kind of obsessive-compulsive nightmare, as characters attempt to avoid exposure to a substance that is everywhere.\nThe quintessential story of this type is “The Voice in the Night” by William Hope Hodgson. Hodgson was an early writer of weird horror and an influence on H. P. Lovecraft and others. He spent much of his life at sea and his horror stories set at sea contain an authenticity that makes their supernatural elements all the more terrifying. This particular story also inspired the movie Matango, from 1963, directed by Ishiro Honda of Godzilla fame.\nIn “The Voice in the Night,” a ship responds to a cry for help from a rowboat. The person in the rowboat refuses to come aboard but begs for provisions to be floated to him in a wooden box. He tells of how he and his fiancée survived a sinking ship and found an abandoned ship that was coated with fungus. They cleaned the ship but the fungus kept growing back. They took refuge on an island and nearly starved to death. The entire island was covered with the same growth, which the couple found growing on their own skin. Eventually, gradually, and horribly, the couple becomes consumed by fungus, like the other beings on the island.\nA more recent example of the “consumed by fungus” story is “Grey Matter,” a short story by Stephen King. In this story, a small-town convenience store regularly sells beer to a local man who disappears. His son comes to the store and tells the owner that the man drank “a bad can” of beer. Since then, the man has been sitting in a chair in his apartment, with all the lights off, undergoing a terrible metamorphosis into a fungal creature.\nThe story has a cliffhanger ending and leaves the reader with a terrible case of the “ewwwws” as the body horror progresses from a bit of gray slime to the horror described above. While some “consumed by fungus” stories are gorier than others, the body horror element always plays the largest role in the horror of the tale.\nThe second type of fungus story posits that a fungus can infect a host and control its brain. This is true for certain types of fungus in reality. The genera Cordyceps and Ophiocordycipitaceae include species of fungi that infect insect and arthropod hosts. The mycelium of the fungus grows through and feeds on the flesh of the host while the host is still alive and the fruiting body of the fungus grows through the skin of the host and into the open air, releasing more spores.\nOphiocordyceps unilateralis doesn’t just consume its victim. It infects carpenter ants. The fungus enters the ant’s body as a single cell and colonizes every part of the ant except the brain. The fungus then controls the ant’s muscles, forcing it to climb plant stems until it reaches a height of exactly twenty-five centimeters. At that point, the ant fastens itself onto a leaf, where it hangs until a stalk grows through the ant’s head, finally killing the ant and releasing spores onto the ants below.\nSome recent zombie stories have used fungal, rather than viral, infection to explain humans who have lost everything but the desire to feed. In The Girl With All the Gifts, a novel by Mike Carey, a variation of Ophiocordyceps unilateralis infests humans instead of ants, and spreads by contact with bodily fluids instead of by spores.\nAdditionally, in the video game The Last of Us, characters struggle to survive in a world in which people fall victim to cordyceps brain infection.\nNot all speculative fiction stories involve fungal infection. Some describe a world in which sentient, intelligent fungal creatures (usually mushroomlike in appearance) exist either in competition with or alongside humans. A benign version of this can be found in The Wonderful Flight to the Mushroom Planet, by Eleanor Cameron. This book tells the story of two children who build a spaceship and fly to a planet that is covered with mushrooms and populated by people who are essentially also mushrooms, albeit walking, talking, humanoid mushrooms with a full civilization. The children save the planet and launch a series of six books.\nIn the Ambergris trilogy, Jeff VanderMeer sets up a more sinister relationship between fungi and humanity. The planet Ambergris was originally populated by fungal humanoids known by humans as “grey caps.” Humans took over the city, literally driving the grey caps underground, until the grey caps retook the city and established a totalitarian police state. The trilogy explores issues of colonization and occupation with a side helping of body horror and surrealism.\nIn recent years, scientists, gardeners, architects, doctors, and others have been exploring the possibilities of using fungus in unprecedented ways. Some of this is finding its way into modern fiction, most noticeably in Star Trek: Discovery. This show named a character after the show’s mycelium expert advisor, real-life mycologist Paul Stamets.\nIn the universe of Star Trek: Discovery, interstellar travel is made possible through use of the “spore drive.” As explained by Linh Anh Cat in an article for Forbes:\nThe spore drive operates by bringing USS Discovery into the mycelial plane, where it can traverse the mycelial network . . . In Star Trek: Discovery, mycelia form the foundation of space and connect every aspect of life across the multiverse. The mycelial network is also its own ecosystem. USS Discovery can jump anywhere almost instantaneously using the network.\nThe Discovery cultures blue spores, which power the spore drive. They glow blue as a nod to the tendency of real-life psilocybin mushrooms (AKA “magic mushrooms”) to have a blue color under certain conditions. In the show, the jahSepp, a species of sentient fungus, live within the mycelium plane and consume matter that enters the plane. The conflict between the jahSepp, who believe that spore drives threaten their existence, and Starfleet, which initially is unaware of the jahSepp’s existence, drives several episodes and character arcs. Other storytelling possibilities appear when Discovery’s crew realizes that it is possible to enter alternate universes through the mycelium network.\nStar Trek: Discovery provides an extreme example of how the complex and peculiar real-world biology of fungus can provide storytelling possibilities. Other examples abound. The existence of mushrooms that cause mood changes and hallucinations has inspired many stories, most famously Alice’s Adventures in Wonderland by Lewis Carroll. In the TV series Hannibal, mushrooms provide a body disposal tool for a serial killer named Eldon Stammets (again, after mycologist Paul Stamets). On a more prosaic note, who can forget the hobbits’ fondness for mushrooms in The Fellowship of the Ring, by J. R. R. Tolkien?\nFungi make for fascinating speculative fiction because they are so very, very different from humans, because there is so much about them that is not fully understood, and because the storytelling possibilities they present are almost endless. Whether as agents of body horror, terrifying or liberating forces of mind control, or beings that force us to challenge ideas about colonization, occupation, power, and sex, these amazing life-forms permeate speculative fiction on page and on screen.\nCarrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats.", "source": "https://clarkesworldmagazine.com/sessarego_06_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fungi in Fiction by Carrie Sessarego"}