{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "James Tiptree Jr", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "x4HNe50AzOsHku2Efm5ftLSLS+s=", "id": null, "license": null, "comments": "", "raw_text": "6920 words, short story, REPRINT  Her Smoke Rose Up Forever  —Deliverance quickens, catapults him into his boots on mountain gravel, his mittened hand on the rusty 1935 International truck. Cold rushes into his young lungs, his eyelashes are knots of ice as he peers down at the lake below the pass. He is in a bare bleak bowl of mountains just showing rusty in the dawn; not one scrap of cover anywhere, not a tree, not a rock.  The lake below shines emptily, its wide rim of ice silvered by the setting moon. It looks small, everything looks small from up here. Is that scar on the edge his boat? Yes—it’s there, it’s all okay! The black path snaking out from the boat to the patch of tulegrass is the waterway he broke last night. Joy rises in him, hammers his heart. This is it. This—is—it.  He squints his lashes, can just make out the black threads of the tules. Black knots among them—sleeping ducks. Just you wait! His grin crackles the ice in his nose. The tules will be his cover—that perfect patch out there. About eighty yards, too far to hit from shore. That’s where he’ll be when the dawn flight comes over. Old Tom said he was loco. Loco Petey. Just you wait. Loco Tom.  The pickup’s motor clanks, cooling, in the huge silence. No echo here, too dry. No wind. Petey listens intently: a thin wailing in the peaks overhead, a tiny croak from the lake below. Waking up. He scrapes back his frozen canvas cuff over the birthday watch, is oddly, fleetingly puzzled by his own knobby fourteen-year-old wrist. Twenty-five—no, twenty-four minutes to the duck season. Opening day! Excitement ripples down his stomach, jumps his dick against his scratchy longjohns. Gentlemen don’t beat the gun. He reaches into the pickup, reverently lifts out the brand-new Fox CE double-barrel twelve-gauge.  The barrels strike cold right through his mitts. He’ll have to take one off to shoot, too: it’ll be fierce. Petey wipes his nose with his cuff, pokes three fingers through his cut mitten and breaks the gun. Ice in the sight. He checks his impulse to blow it out, dabs clumsily. Shouldn’t have taken it in his sleeping bag. He fumbles two heavy sixes from his shell pocket, loads the sweet blue bores, is hardly able to breathe for joy. He is holding a zillion dumb bags of the Albuquerque Herald, a whole summer of laying adobe for Mr. Noff—all transmuted into this: his perfect, agonizingly chosen OWN GUN. No more borrowing old Tom’s stinky over-and-under with the busted sight. His own gun with his initials on the silver stock-plate.  Exaltation floods him, rises perilously. Holding his gun, Petey takes one more look around at the enormous barren slopes. Empty, only himself and his boat and the ducks. The sky has gone cold gas-pink. He is standing on a cusp of the Great Divide at ten thousand feet, the main pass of the western flyway. At dawn on opening day . . . What if Apaches came around now? Mescalero Apaches own these mountains, but he’s never seen one out here. His father says they all have TB or something. In the old days, did they come here on horses? They’d look tiny; the other side is ten miles at least.  Petey squints at a fuzzy place on the far shore, decides it’s only sagebrush, but gets the keys and the ax out of the pickup just in case. Holding the ax away from his gun, he starts down to the lake. His chest is banging, his knees wobble, he can barely feel his feet skidding down the rocks. The whole world seems to be brimming up with tension.  He tells himself to calm down, blinking to get rid of a funny blackness behind his eyes. He stumbles, catches himself, has to stop to rub at his eyes. As he does so everything flashes black-white—the moon jumps out of a black sky like a locomotive headlight, he is sliding on darkness with a weird humming all around. Oh, Jeeze—mustn’t get an altitude blackout, not now! And he makes himself breathe deeply, goes on down with his boots crunching hard like rhythmic ski turns, the heavy shell pockets banging his legs, down, going quicker now, down to the waiting boat.  As he gets closer he sees the open water-path has iced over a little during the night. Good job he has the ax. Some ducks are swimming slow circles right by the ice. One of them rears up and quack-flaps, showing the big raked head: canvasback!  “Ah, you beauty,” Petey says aloud, starting to run now, skidding, his heart pumping love, on fire for that first boom and rush. “I wouldn’t shoot a sitting duck.” His nose-drip has frozen, he is seeing himself hidden in those tules when the flights come over the pass, thinking of old Tom squatting in the rocks back by camp. Knocking back his brandy with his old gums slobbering, dreaming of dawns on World War I airdromes, dreaming of shooting a goose, dying of TB. Crazy old fool. Just you wait. Petey sees his plywood boat heaped with the great pearly breasts and the red-black Roman noses of the canvasbacks bloodied and stiff, the virgin twelve-gauge lying across them, fulfilled.  And suddenly he’s beside the boat, still blinking away a curious unreal feeling. Mysterious to see his own footprints here. The midget boat and the four frosted decoys are okay, but there’s ice in the waterway, all right. He lays the gun and ax inside and pushes the boat out from the shore. It sticks, bangs, rides up over the new ice.  Jeeze, it’s really thick! Last night he’d kicked through it easily and poled free by gouging in the paddle. Now he stamps out a couple of yards, pulling the boat. The ice doesn’t give. Darn! He takes a few more cautious steps—and suddenly hears the whew-whew, whew-whew of ducks coming in. Coming in—and he’s out here in the open! He drops beside the boat, peers into the bright white sky over the pass.  Oh Jeeze—there they are! Ninety miles an hour, coming downwind, a big flight! And he hugs his gun to hide the glitter, seeing the hurtling birds set their wings, become bloodcurdling black crescent-shapes, webs dangling, dropping like dive-bombers—but they’ve seen him, they veer in a great circle out beyond the tules, all quacking now, away and down. He hears the far rip of water and stands up aching toward them. You wait. Just wait till I get this dumb boat out there!  He starts yanking the boat out over the creaking ice in the brightening light, cold biting at his face and neck. The ice snaps, shivers, is still hard. Better push the boat around ahead of him so he can fall in it when it goes. He does so, makes another two yards, three—and then the whole sheet tilts and slides under with him floundering, and grounds on gravel. Water slops over his boot tops, burns inside his three pairs of socks.  But it’s shallow. He stamps forward, bashing ice, slipping and staggering. A yard, a yard, a yard more—he can’t feel his feet, he can’t get purchase. Crap darn, this is too slow! He grabs the boat, squats, throws himself ahead and in with all his might. The boat rams forward like an icebreaker. Again! He’ll be out of the ice soon now. Another lunge! And again!  But this time the boat recoils, doesn’t ram. Darn shit, the crappy ice is so thick! How could it get this thick when it was open water last night? ‘Cause the wind stopped, that’s why, and it’s ten above zero. Old Tom knew, darn him to hell. But there’s only about thirty yards left to go to open water, only a few yards between him and the promised land. Get there. Get over it or under it or through it, go! He grabs the ax, wades out ahead of the boat, and starts hitting ice, trying to make cracks. A piece breaks, he hits harder. But it doesn’t want to crack, the ax-head keeps going in, thunk. He has to work it out of the black holes. And it’s getting deep, he’s way over his boots now. So what? Thunk! Work it loose. Thunk!  But some remaining sanity reminds him he really will freeze out here if he gets his clothes soaked. Shee-it! He stops, stands panting, staring at the ducks, which are now tipping up, feeding peacefully well out of range, chuckling paducah, paducah at him and his rage.  Twenty more yards, shit darn, God-darn. He utters a caw of fury and hunger and at that moment hears a tiny distant crack. Old Tom, firing. Crack!  Petey jumps into the boat, jerking off his canvas coat, peeling off the two sweaters, pants, the gray longjohns. His fingers can barely open the icy knots of his bootlaces, but his body is radiant with heat, it sizzles the air, only his balls are trying to climb back inside as he stands up naked. Twenty yards!  He yanks the sodden boots back on and crashes out into the ice, whacking with the ax-handle, butting whole sheets aside. He’s making it! Ten more feet, twenty! He rams with the boat, bangs it up and down like a sledgehammer. Another yard! Another! His teeth are clattering, his shins are bleeding, and it’s cutting his thighs now, but he feels nothing, only joy, joy!—until suddenly he is slewing full-length under water with the incredible cold going up his ass and into his armpits like skewers and ice cutting his nose.  His hands find the edge, and he hauls himself up on the side of the boat. The bottom has gone completely. His ax—his ax is gone.  The ice is still there.  A black hand grabs him inside, he can’t breathe. He kicks and flails, dragging himself up into the boat to kneel bleeding, trying to make his ribs work and his jaws stop banging. The first sunray slicks him with ice and incredible goose bumps; he gets a breath and can see ahead, see the gleaming ducks. So close!  The paddle. He seizes it and stabs at the ice in front of the boat. It clatters, rebounds, the boat goes backward. With all his force he flails the ice, but it’s too thick, the paddle stem is cracking. No bottom to brace on. Crack! And the paddle blade skitters away across the ice. He has nothing left.  He can’t make it.  Rage, helpless rage, vomits through him, his eyes are crying hot ice down his face. So close! So close! And sick with fury he sees them come—whew-whew! whew-whew-whew-whew!—a torrent of whistling wings in the bright air, the ducks are pouring over the pass. Ten thousand noble canvasbacks hurtling down the sky at him silver and black, the sky is wings beating above him, but too high, too high—they know the range, oh, yes!  He has never seen so many, he will never see it again—and he is standing up in the boat now, a naked bleeding loco ice-boy, raging, sweeping the virgin twelve-gauge, firing—BAM-BAM! both barrels at nothing, at the ice, at the sky, spilling out the shells, ramming them in with tearing frozen hands. A drake bullets toward him, nearer—it has to be near enough! BAM! BAM!  But it isn’t, it isn’t, and the air-riders, the magic bodies of his love beat over him yelling—canvasback, teal, wigeon, pintails, redheads, every duck in the world rising now, he is in a ten-mile swirl of birds, firing, firing, a weeping maniac under the flashing wings, white-black, black-white. And among the flashing he sees not only ducks but geese, cranes, every great bird that ever rode this wind: hawks, eagles, condors, pterodactyls—BAM! BAM! BAM-BAM!! in the crazy air, in the gale of rage and tears exploding in great black pulses—black! light! black!—whirling unbearably, rushing him up—  —And he surfaces suddenly into total calm and dimness, another self with all fury shrunk to a tiny knot below his mind and his eyes feasting in the open throat of a girl’s white shirt. He is in a room, a cool cave humming with secret promise. Behind the girl the windows are curtained with sheer white stuff against the glare outside.  “Your mother said you went to Santa Fe.” He hears his throat threaten soprano and digs his fists into the pockets of his Levi’s.  The girl Pilar—Pee-lar, crazy-name-Pilar—bends to pick at her tanned ankle, feathery brown bob swinging across her cheek and throat.  “Um-m.” She is totally absorbed in a thin gold chain around her ankle, crouching on a big red leather thing her parents got in where, Morocco—Pilar of the urgently slender waist curving into her white Levi’s, the shirt so softly holding swelling softness; everything so white against her golden tan, smelling of soap and flowers and girl. So clean. She has to be a virgin, his heart knows it; a marvelous slow-motion happiness is brimming up in the room. She likes me. She’s so shy, even if she’s a year older, nearly seventeen, she’s like a baby. The pathos of her vulnerable body swells in him, he balls his fists to hide the bulge by his fly. Oh, Jeeze, I mean Jesus, let her not look, Pilar. But she does look up then, brushing her misty hair back, smiling dreamily up at him.  “I was at the La Fonda, I had a dinner date with René.”  “Who’s René?”  “I told you, Pe-ter.” Not looking at him, she uncurls from the hassock, drifts like a child to the window, one hand rubbing her arm. “He’s my cousin. He’s old, he’s twenty-five or thirty. He’s a lieutenant now.”  “Oh.”  “An older man.” She makes a face, grins secretly, peeking out through the white curtains.  His heart fizzes with relief, with the exultance rising in the room. She’s a virgin, all right. From the bright hot world outside comes the sound of a car starting. A horse whickers faintly down at the club stables, answered by the double wheeze of a donkey. They both giggle. Peter flexes his shoulders, opens and grips his hand around an imaginary mallet.  “Does your father know you were out with him?”  “Oh, yes.” She’s cuddling her cheek against her shoulder, pushing the immaculate collar, letting him see the creamy mounds. She wants me, Peter thinks. His guts jump. She’s going to let me do it to her. And all at once he is calm, richly calm like that first morning at the corral, watching his mare come to him; knowing.  “Pa-pa doesn’t care, it’s nineteen forty-four. René is my cousin.”  Her parents are so terribly sophisticated; he knows her father is some kind of secret war scientist: they are all here because of the war, something over at Los Alamos. And her mother talking French, talking about weird places like Dee-jon and Tan-jay. His own mother doesn’t know French, his father teaches high school, he never would be going around with these sophisticated strangers except they need him for their sandlot polo. And he can play rings around them all, too, Peter thinks, grinning, all those smooth sweating old young men—even with his one mare for four chukkers and her tendons like big hot balloons, even with his spliced mallet he can cut it over their heads! If he could only get an official rating. Three goals, sure. Maybe four, he muses, seeing himself riding through that twerp Drexel with his four remounts, seeing Pilar smile, not looking at him. She’s shy. That time he let her ride the mare she was really frightened, incredibly awkward; he could feel her thighs tremble when he boosted her up.  His own thighs tremble, remembering the weak tenderness of her in his hands. Always before your voice my soul is as some smooth and awkward foal—it doesn’t sound so wet now, his mother’s nutty line. His foal, his velvety vulnerable baby mare. Compared to her he’s a gorilla, even if he’s technically a virgin too, men are different. And he understands suddenly that weird Havelock Ellis book in her father’s den. Gentle. He must be gentle. Not like—a what?—a baboon playing a violin.  “You shouldn’t fool around with older men,” he says and is gratified by the gruffness. “You don’t know.”  She’s watching him now under the fall of her hair, coming close, still hugging herself with her hand going slowly up and down her arm, caressing it. A warm soap smell fills his nose, a sharp muskiness under it. She doesn’t know what she’s doing, he thinks choking, she doesn’t know about men. And he grunts something like “Don’t,” or “Can it,” trying to hold down the leaping heat between them, but is confused by her voice whispering.  “It hurts, Pe-ter.”  “What, your arm?”  “Here, do-pee,” and his hand is suddenly taken hold of by cool small fingers pulling it not to her arm but in wonder to her side, pressed in the rustling shirt under which he feels at first nothing and then shockingly too far in not his own wide ribs but the warm stem of her, and as his paralyzed hand fumbles, clasps, she half turns around so that his ignited hand rides onto a searing soft unnatural swelling—her breast—and the room blanks out, whirls up on a brimming, drumming tide as if all the dead buffalo were pounding back. And the window blinks once with lemon light shooting around their two bodies where her hip is butting into his thigh making it wholly impossible to continue standing there with his hands gentle on her tits.  “You don’t know what you’re doing, Pilar. Don’t be a dope, your mother—”  “She’s a-way now.” And there is a confused interval of mouths and hands trying to be gentle, trying to hold her away from his fly, trying to stuff her into himself in total joy, if he had six hands he couldn’t cope with the electric all of her—until suddenly she pulls back, is asking inanely, “Pe-ter, don’t you have a friend?”  The subtle difference in her voice makes him blink, answering stupidly, “Sure, Tom Ring,” while her small nose wrinkles.  “Dopee Pe-ter, I mean a boyfriend. Somebody smooth.”  He stands trying to pant dignifiedly, thinking Jeeze, I mean Christ, she knows I don’t have any smooth friends; if it’s for a picnic maybe Diego Martine? But before he can suggest this she has leaned into the window bay, cuddling the silky curtain around her, peeking at him so that his hands go pawing in the cloth.  “René has a friend.”  “Uh.”  “He’s older too, he’s twen-tee,” she breathes teasingly. “Lieutenant Shar-lo. That’s Charles to you, see?” And she turns around full into his arms, curtain and all, and from the press of silk and giggles comes a small voice saying forever, “And Re-né and Shar-lo and Pee-lar all went to bed together and they played with me, oh, for hours and hours, Pe-ter, it was too marvelous. I will ne-ver do it with just one boy again.”  Everything drops then except her face before him horribly heavy and exalted and alien, and just as his heart knows it’s dead and an evil so generalized he can hardly recognize it as fury starts tearing emptily at him inside, her hand comes up over her mouth and she is running doubled over past him.  “I’m going to be sick, Peter help me!”  And he stumbles after down the dim cool hall to find her crumpled down, her brown hair flowing into the toilet as she retches, retches, whimpering, convulses unbearably. The white shirt has ridden up to expose her pathetically narrow back, soft knobs of her spine curving down into her pants, her tender buttocks bumping his knees as he stands helplessly strangling a sopping towel instead of her neck, trying to swab at her hidden forehead. His own gullet is retching too, his face feels doughy, and water is running down into his open mouth while one of her hands grips his, shaking him with her spasms there in the dim hospital-like bathroom. The world is groaning, he is seeing not her father’s bay rum bottle but the big tiled La Fonda bedroom, the three bodies writhing on the bed, performing unknown horrors. Playing with her . . .  His stomach heaves, only what it is, he is coming in his Levi’s in a dreadful slow unrelieving ooze like a red-hot wire dragging through his crotch, while he stands by her uselessly as he will stand helplessly by in some near future he can’t imagine or remember—and the tension keeps building, pounding, the light flickers—a storm is coming or maybe his eyes are going bad, but he can see below him her pure profile resting spent on the edge of the toilet, oblivious to his furious towel; in the flashing dimness sees the incomprehensible letters S-E-P-T-I-C A-B-O-R-T-I-O-N snaking shadowy down the spine of his virgin love, while the universe beats Black! Flash! Black! Drumming with hooves harsher than any storm—hurling him through lightning-claps of blinding darkness to a thrumming stasis in which what exists of him senses—something—but is instantly shot away on unimaginable energies—  —And achieves condensement, blooms into the green and open sunlight of another world, into a mellow springtime self—in which a quite different girl is jostling his hip.  “Molly,” he hears his older voice say vaguely, seeing with joy how the willow fronds trail in the friendly, dirty Potomac. The bars and caduceus on his collar are pricking his neck.  “Yes, sir, Doctor sir.” She spins around, kneels down in the scruffy grass to open Howard Johnson boxes. “Oh, god, the coffee.” Handing him up a hot dog, swinging back her fair hair. Her arm is so female with its tender pale armpit, her whole body is edible, even her dress is like lemonade so fresh and clean—no, radiant, he corrects himself. That’s the word, radiant. His radiant woman. He shrugs away a tiny darkness, thinking of her hair sliding on his body in the Roger Smith hotel bedroom.  “C’mon sit, Pete. It’s only a little dirty.”  “Nothing’s dirty anymore.” He flops down beside her, one arm finding its natural way around the opulence of her buttocks on the grass. She chuckles down at him, shaking her head.  “You’re a hard case, Pete.” She takes a big bite of hot dog with such lips that he considers flinging himself upon her then and there, barely remembers the cars tearing by above them. “I swear,” she says, chewing, “I don’t think you ever screwed anybody you were friends with before.”  “Something like that.” He puts his hot dog down to loosen his GI tie.  “Thirty days to civvies, you’ll be in Baltimore.” She licks her fingers happily. “Oh, wow, Pete, I’m so glad you got your fellowship. Try the coleslaw, it’s all right. Will you remember us poor slaves when you’re a big old pathologist?”  “I’ll remember.” To distract himself he pokes in the boxes, spills coleslaw on a book. “What you reading?”  “Oh, Whately Carington.”  “Whatly what?”  “No, Whate-ly. Carington. A Limey. Psychical research man, they do that veddy seddiously, the Limies.”  “Uh?” He beams at the river, blinks to get rid of a flicker in the back of his eyes. Amphetamine withdrawal, after six months?  “He has this theory, about K-objects. Whatever thing you feel most intense about, part of you lives on—Pete, what’s wrong?”  “Nothing.”  But the flicker won’t quit, it is suddenly worse; through it he can just make out her face turned nurse-wary, coming close, and he tries to hang on through a world flashing black—green—BLACK!—is trapped for unbreathing timelessness in dark nowhere, a phantom landscape of gray tumbled ash under a hard black sky, seeing without eyes a distant tangle of wreckage on the plain so menacing that his un-bodied voice screams at the shadow of a metal scrap beside him in the ashes, 2004 the ghostly unmeaning numbers—STOP IT!—And he is back by the river under Molly’s springtime eyes, his hands gripping into the bones of her body.  “Hey-y-y, honey, the war’s over.” Sweet sensual pixie-smile now watchful, her nurse’s hand inside his shirt. “Korea’s ten thousand miles away, you’re in good old DC, Doctor.”  “I know. I saw a license plate.” He laughs unconvincingly, makes his hands relax. Will the ghosts of Seoul never let him go? And his body guiltily intact, no piece of him in the stained waste cans into which he has—Stop it! Think of Molly. I like Ike. Johns Hopkins research fellowship. Some men simply aren’t cut out for surgical practice.  “I’m a gutless wonder, Molly. Research.”  “Oh, for Christ’s sake, Pete,” she says with total warmth, nurse-hand satisfied, changing to lover’s on his chest. “We’ve been over all that.”  And of course they have, he knows it and only mutters, “My Dad wanted me to be an Indian doctor,” which they have been over too; and the brimming gladness is back now, buoyantly he seizes the coleslaw, demands entertainment, demonstrating reality-grasp.  “So what about Whatly?”  “It’s serious-s-s,” she protests, snickering, and is mercurially almost serious too. “I mean, I’m an atheist, Pete, I don’t believe there’s anything afterward, but this theory . . . ” And she rattles on about K-objects and the pool of time, intense energic structures of the mind undying—sweet beddable girl in the springtime who has taught him unclaiming love. His friend. Liberated him.  He stretches luxuriously, relishes a coleslaw belch. Free male beside a willing woman. No problems. What is it man in woman doth require? The lineaments of gratified desire. The radiance of her. He has gratified her. Will gratify her again . . .  “It’s kind of spooky, though.” She flings the box at the river with tremendous effort, it flies twenty feet. “Damn! But think of parts of yourself whirling around forever sticking to whatever you loved!” She settles against the willow, watching the box float away. “I wonder if part of me is going to spend eternity hanging around a dumb cat. I loved that old cat. Henry. He died, though.”  The ghost of a twelve-gauge fires soundlessly across his mind, a mare whickers. He sneezes and rolls over onto her lap with his nose in her warm scented thighs. She peers dreamily down at him over her breasts, is almost beautiful.  “Whatever you love, forever. Be careful what you love.” She squints wickedly. “Only with you I think it’d be whatever you were maddest at—no, that’s a horrible thought. Love has to be the most intense.”  He doubts it but is willing to be convinced, rooting in her lap while she pretends to pound on him and then squirms, stretching up her arms, giving herself to the air, to him, to life.  “I want to spend eternity whirling around you.” He heaves up to capture her, no longer giving a damn about the cars, and as the sweet familiar body comes pliantly under him he realizes it’s true, he’s known it for some time. Not friendship at all, or rather, the best of friendships. The real one. “I love you, Molly. We love.”  “Ooh, Pete.”  “You’re coming to Baltimore with me. We’ll get married,” he tells her warm neck, feeling the flesh under her skirt heavy in his hand, feeling also an odd stillness that makes him draw back to where he can see her face, see her lips whispering, “I was afraid of that.”  “Afraid?” His heart jumps with relief, jumps so hard that the flicker comes back in the air, through which he sees her lying too composed under his urgency. “Don’t be afraid, Molly. I love you.”  But she is saying softly, “Oh, damn, damn, Pete, I’m so sorry, it’s a lousy thing women do. I was just so happy, because . . . ” She swallows, goes on in an absurd voice. “Because someone very dear to me is coming home. He called me this morning from Honolulu.”  This he cannot, will not, understand among the flashing pulses, but repeats patiently, “You love me, Molly. I love you. We’ll get married in Baltimore,” while she fights gently away from him, saying, “Oh, I do, Pete, I do, but it’s not the same.”  “You’ll be happy with me. You love me.”  They are both up crouching now in the blinking, pounding sunlight.  “No, Pete, I never said. I didn’t—” Her hands are out seeking him, like knives.  “I can’t marry you, honey. I’m going to marry a man called Charlie McMahon.”  McMahon—Maaa—honn—aa—on-n-n the idiot sound flaps through the universe, his carotids are hammering, the air is drumming with his hurt and rage as he stands foolishly wounded, unable to believe the treachery of everything-which is now strobing in great blows of blackness as his voice shouts “Whore!” shouts “Bitch-bitch-bitch . . . ” into a dwindling, flashing chaos—  —And explodes silently into a nonbeing which is almost familiar, is happening this time more slowly as if huge energy is tiding to its crest so slowly that some structure of himself endures to form in what is no longer a brain the fear that he is indeed dead and damned to live forever in furious fragments. And against this horror his essence strains to protest But I did love! at a horizon of desolation—a plain of endless, lifeless rubble under a cold black sky, in which he or some pattern of energies senses once more that distant presence: wreckage, machines, huge structures incomprehensibly operative, radiating dark force in the nightmare world, the force which now surges—  —To incorporate him anew within familiar walls, with the words “But I did love” meaninglessly on his lips. He leans back in his familiarly unoiled swivel chair, savoring content. Somewhere within him weak darkness stirs, has power only to send his gaze to the three-di portraits behind the pile of printouts on his desk.  Molly smiles back at him over the computer sheets, her arm around their eldest daughter. For the first time in years the thought of poor Charlie McMahon crosses his mind, triggers the automatic incantation: Molly-never-would-have-been-happy-with-him. They had a bad time around there, but it worked out. Funny how vividly he recalls that day by the river, in spite of all the good years since. But I did love, his mind murmurs uneasily, as his eyes go lovingly to the computer printouts.  The lovely, elegant results. All confirmed eight ways now, the variance all pinned down. Even better than he’d hoped. The journal paper can go in the mail tomorrow. Of course the pub-lag is nearly three years now; never mind: the AAAS panel comes next week. That’s the important thing. Lucky timing, couldn’t be neater. The press is bound to play it up . . . Going to be hard not to watch Gilliam’s face, Peter muses, his own face ten years younger, sparkling, all lines upturned.  “I do love it, that’s what counts,” he thinks, a jumble of the years of off-hours drudgery in his mind . . . Coffee-ringed clipboards, the new centrifuge, the animal mess, a girl’s open lab coat, arguments with Ferris in Analysis, arguments about space, about equipment, about costs—and arching over it like a laser-grid, the luminous order of his hypothesis. His proven—no, mustn’t say it—his meticulously tested hypothesis. The lucky lifetime break. The beauty one. Never do it again, he hasn’t another one like this left in him; no matter! This is it, the peak. Just in time. Don’t think of what Nathan said, don’t think the word. (Nobel)—That’s stupid. (Nobel) Think of the work itself, the explanatory power, the clarity.  His hand has been wandering toward the in-basket under the printouts where his mail has been growing moss (he’ll get a secretary out of this, that’s for sure!), but the idea of light turns him to the window. The room feels tense, brimming with a tide of energy. Too much coffee, he thinks, too much joy. I’m not used to it. Too much of a loner. From here in I share. Spread it around, encourage younger men. Herds of assistants now . . .  Across his view of tired Bethesda suburbs around the NIH Annex floats the train of multiple-author papers, his name as senior, a genial myth; sponsoring everybody’s maiden publication. A fixture in the mainstream . . . Kids playing down there, he sees, shooting baskets by a garage, will some of them live to have a myeloma cured by the implications of his grubby years up here? If the crystallization can be made easier. Bound to come. But not by me, he thinks, trying to focus on the running figures through a faint stroboscopic blink which seems to arise from the streets below, although he knows it must be in his retinae.  Really too much caffeine, he warns himself. Let’s not have a hypertensive episode, not now, for god’s sake. Exultation is almost tangible in the room, it’s not distracting but integrative; as if he were achieving some higher level of vitality, a norepinephrine-like effect. Maybe I really will live on a higher level, he muses, rubbing the bridge of his nose between two fingers to get rid of a black afterimage which seems almost like an Apollo moonscape behind his eyes, a trifle unpleasant.  Too much doom, he tells himself, vigorously polishing his glasses, too much bomb-scare, ecology-scare, fascism-scare, race-war-scare, death-of-everything scare. He jerks his jaw to stop the tinnitus thrumming in his inner ear, glancing at the big 1984 desk calendar with its scrawled joke: If everything’s okay why are we whispering? Right. Let’s get at it and get home. To Molly and Sue and little Pete, their late-born.  He grins, thinking of the kid running to him, and thrusts his hand under the printouts to his packet of stale mail—and as his hand touches it an icicle rams into his heart.  For an instant he thinks he really is having a coronary. But it isn’t his real heart, it’s a horrible cold current of knowledge striking from his fingers to his soul, from that hideous sleazy tan-covered foreign journal which he now pulls slowly out to see the penciled note clipped to the cover, the personally delivered damned journal which has been lying under there like a time bomb, for how long? Weeks?  Pete, you better look at this. Sorry as hell.  But he doesn’t need to look, riffling through the wretchedly printed pages with fingers grown big and cold as clubs; he already knows what he’ll find inside there published so neatly, so sweetly, and completely, with the confirmation even stronger and more elegant, the implication he hadn’t thought of—and all so modest and terse. So young. Despair takes him as the page opens. Djakarta University for Jesus Christ’s sake? And some Hindu’s bloody paradigm—  Sick fury fulminates, bile and ashes rain through his soul as his hands fumble the pages, the gray unreal unreadable pages which are now strobing—Flash! Black! Flash! Black!—swallowing the world, roaring him in or up or out on a phantom whirlwind—  —’Til unsensation crescendos past all limit, bursts finally into the silence of pure energy, where he—or what is left of him, or momentarily reconstituted of him—integrates to terrified insight, achieves actual deathly awareness of its extinct self immaterially spinning in the dust of an eons-gone NIH Annex on a destroyed planet. And comprehends with agonized lucidity the real death of everything that lived—excepting only that in himself which he would most desperately wish to be dead.  What happened? He does not know, can never know, which of the dooms or some other had finally overtaken them, nor when; only that he is registering eternity, not time, that all that lived here has been gone so long that even time is still. Gone, all gone; centuries or millennia gone, all gone to ashes under pulseless stars in the icy dark, gone forever. Saving him alone and his trivial pain.  He alone . . . But as the mercilessly reifying force floods higher there wakes in him a dim uncomforting sense of presence; a bodiless disquiet in the dust tells him he is companioned, is but a node in a ghostly film of dead life shrouding the cold rock-ball. Unreachable, isolate—he strains for contact and is incorporeally stricken by new dread. Are they too in pain? Was pain indeed the fiercest fire in our nerves, alone able to sustain its flame through death? What of love, of joy? . . . There are none here.  He wails voicelessly as conviction invades him, he who had believed in nothing before. All the agonies of Earth, uncanceled? Are broken ghosts limping forever from Stalingrad and Salamis, from Gettysburg and Thebes and Dunkirk and Khartoum? Do the butchers’ blows still fall at Ravensbrück and Wounded Knee? Are the dead of Carthage and Hiroshima and Cusco burning yet? Have ghostly women waked again only to re-suffer violation, only to watch again their babies slain? Is every nameless slave still feeling the iron bite, is every bomb, every bullet and arrow and stone that ever flew, still finding its screaming mark—atrocity without end or comfort, forever?  Molly. The name forms in his canceled heart. She who was love. He tries to know that she or some fragment of her is warm among her children, but can summon only the image of her crawling forever through wreckage to Charlie McMahon’s bloody head.  Let it not be! He would shriek defiance at the wastes, finding himself more real as the strange energy densens; he struggles bodilessly, flails perished non-limbs to conjure love out of extinction to shield him against hell, calling with all his obliterated soul on the ultimate talisman: the sound of his little son’s laugh, the child running to him, clasping his leg in welcome home.  For an instant he thinks he has it—he can see the small face turn up, the mouth open—but as he tries to grasp, the ghost-child fades, frays out, leaving in his destroyed heart only another echo of hurt—I want Mommy, Mommy, my Mommy. And he perceives that what he had taken for its head are forms. Presences intrusive, alien as the smooth, bleak regard of sharks met under water.  They move, process obscurely—they exist here on this time-lost plain! And he understands with loathing that it is from them or those—machines or beings, he cannot tell—that the sustaining energy flows. It is their dark potency which has raised him from the patterns of the dust.  Hating them he hungers, would sway after them to suck his death-life, as a billion other remnants are yearning, dead sunflowers thirsting toward their black sun—but finds he cannot, can only crave helplessly as they recede.  They move, he perceives, toward those black distant cenotaphs, skeletal and alien, which alone break the dead horizon. What these can be, engines or edifices, is beyond his knowing. He strains sightlessly, sensing now a convergence, an inflowing as of departure like ants into no earthly nest. And at this he understands that the energy up-buoying him is sinking, is starting to ebb. The alien radiance that raised him is going, and he is guttering out. Do you know? he voicelessly cries after them, Do you know? Do you move oblivious among our agonies?  But he receives no answer, will never receive one; and as his tenuous structure fails he has consciousness only to wonder briefly what unimaginable errand brought such beings here to his dead cinder. Emissaries, he wonders, dwindling; explorers, engineers? Or is it possible that they are only sightseers? Idling among our ruins, perhaps even cognizant of the ghosts they raise to wail—turning us on, recreating our dead-show for their entertainment?  Shriveling, he watches them go in, taking with them his lacerating life, returning him to the void. Will they return? Or—his waning self forms one last desolation—have they returned already on their millennial tours? Has this recurred, to recur and recur again? Must he and all dead life be borne back each time helplessly to suffer, to jerk anew on the same knives and die again until another energy exhumes him for the next performance?  Let us die! But his decaying identity can no longer sustain protest, knows only that it is true, is unbearably all true, has all been done to him before and is all to do again and again and again without mercy forever.  And as he sinks back through the collapsing levels he can keep hold only of despair, touching again the deadly limp brown journal—Djakarta University? Flash—and he no longer knows the cause of the terror in his soul as he crumbles through lost springtime—I don’t love you that way, Pete—and is betrayed to aching joy as his hand closes over the young breast within her white shirt—Pe-ter, don’t you have a friend?—while his being shreds out, disperses among a myriad draining ghosts of anguish as the alien life deserts them, strands them lower and lower toward the final dark—until with uncomprehending grief he finds himself, or a configuration that was himself, for a last instant real—his boots on gravel in the dawn, his hand on a rusty pickup truck.  A joy he cannot bear rises in his fourteen-year-old heart as he peers down at the magic ducks, sees his boat safe by the path he’s cut; not understanding why the wind shrieks pain through the peaks above as he starts leaping down the rocks holding his ax and his first own gun, down to the dark lake under the cold stars, forever.    Originally published in Final Stage: The Ultimate Science Fiction Anthology, edited by Edward L. Ferman and Barry N. Malzberg.  Multiple Hugo and Nebula Award-winning author James Tiptree, Jr. was the pseudonym of the late Dr. Alice Sheldon, a semi-retired experimental psychologist and former member of the American intelligence community who also wrote occasionally under the name of Raccoona Sheldon. Dr. Sheldon's tragic death in 1987 put an end to \"both\" careers, but not before she had won two Nebula and two Hugo Awards as Tiptree, won another Nebula Award as Raccoona Sheldon, and established herself, under whatever name, as one of the very best science fiction writers of our times. As Tiptree, Dr. Sheldon published two novels, Up the Walls of the World and Brightness Falls From the Air, and nine short-story collections: Ten Thousand Light Years From Home, Warm Worlds and Otherwise, Starsongs of an Old Primate, Out of the Everywhere, Tales of the Quintana Roo, Byte Beautiful, The Starry Rift, the posthumously published Crown of Stars, and the definitive posthumous retrospective collection, Her Smoke Rose Up Forever.", "text": "6920 words, short story, REPRINT\nHer Smoke Rose Up Forever\n—Deliverance quickens, catapults him into his boots on mountain gravel, his mittened hand on the rusty 1935 International truck. Cold rushes into his young lungs, his eyelashes are knots of ice as he peers down at the lake below the pass. He is in a bare bleak bowl of mountains just showing rusty in the dawn; not one scrap of cover anywhere, not a tree, not a rock.\nThe lake below shines emptily, its wide rim of ice silvered by the setting moon. It looks small, everything looks small from up here. Is that scar on the edge his boat? Yes—it’s there, it’s all okay! The black path snaking out from the boat to the patch of tulegrass is the waterway he broke last night. Joy rises in him, hammers his heart. This is it. This—is—it.\nHe squints his lashes, can just make out the black threads of the tules. Black knots among them—sleeping ducks. Just you wait! His grin crackles the ice in his nose. The tules will be his cover—that perfect patch out there. About eighty yards, too far to hit from shore. That’s where he’ll be when the dawn flight comes over. Old Tom said he was loco. Loco Petey. Just you wait. Loco Tom.\nThe pickup’s motor clanks, cooling, in the huge silence. No echo here, too dry. No wind. Petey listens intently: a thin wailing in the peaks overhead, a tiny croak from the lake below. Waking up. He scrapes back his frozen canvas cuff over the birthday watch, is oddly, fleetingly puzzled by his own knobby fourteen-year-old wrist. Twenty-five—no, twenty-four minutes to the duck season. Opening day! Excitement ripples down his stomach, jumps his dick against his scratchy longjohns. Gentlemen don’t beat the gun. He reaches into the pickup, reverently lifts out the brand-new Fox CE double-barrel twelve-gauge.\nThe barrels strike cold right through his mitts. He’ll have to take one off to shoot, too: it’ll be fierce. Petey wipes his nose with his cuff, pokes three fingers through his cut mitten and breaks the gun. Ice in the sight. He checks his impulse to blow it out, dabs clumsily. Shouldn’t have taken it in his sleeping bag. He fumbles two heavy sixes from his shell pocket, loads the sweet blue bores, is hardly able to breathe for joy. He is holding a zillion dumb bags of the Albuquerque Herald, a whole summer of laying adobe for Mr. Noff—all transmuted into this: his perfect, agonizingly chosen OWN GUN. No more borrowing old Tom’s stinky over-and-under with the busted sight. His own gun with his initials on the silver stock-plate.\nExaltation floods him, rises perilously. Holding his gun, Petey takes one more look around at the enormous barren slopes. Empty, only himself and his boat and the ducks. The sky has gone cold gas-pink. He is standing on a cusp of the Great Divide at ten thousand feet, the main pass of the western flyway. At dawn on opening day . . . What if Apaches came around now? Mescalero Apaches own these mountains, but he’s never seen one out here. His father says they all have TB or something. In the old days, did they come here on horses? They’d look tiny; the other side is ten miles at least.\nPetey squints at a fuzzy place on the far shore, decides it’s only sagebrush, but gets the keys and the ax out of the pickup just in case. Holding the ax away from his gun, he starts down to the lake. His chest is banging, his knees wobble, he can barely feel his feet skidding down the rocks. The whole world seems to be brimming up with tension.\nHe tells himself to calm down, blinking to get rid of a funny blackness behind his eyes. He stumbles, catches himself, has to stop to rub at his eyes. As he does so everything flashes black-white—the moon jumps out of a black sky like a locomotive headlight, he is sliding on darkness with a weird humming all around. Oh, Jeeze—mustn’t get an altitude blackout, not now! And he makes himself breathe deeply, goes on down with his boots crunching hard like rhythmic ski turns, the heavy shell pockets banging his legs, down, going quicker now, down to the waiting boat.\nAs he gets closer he sees the open water-path has iced over a little during the night. Good job he has the ax. Some ducks are swimming slow circles right by the ice. One of them rears up and quack-flaps, showing the big raked head: canvasback!\n“Ah, you beauty,” Petey says aloud, starting to run now, skidding, his heart pumping love, on fire for that first boom and rush. “I wouldn’t shoot a sitting duck.” His nose-drip has frozen, he is seeing himself hidden in those tules when the flights come over the pass, thinking of old Tom squatting in the rocks back by camp. Knocking back his brandy with his old gums slobbering, dreaming of dawns on World War I airdromes, dreaming of shooting a goose, dying of TB. Crazy old fool. Just you wait. Petey sees his plywood boat heaped with the great pearly breasts and the red-black Roman noses of the canvasbacks bloodied and stiff, the virgin twelve-gauge lying across them, fulfilled.\nAnd suddenly he’s beside the boat, still blinking away a curious unreal feeling. Mysterious to see his own footprints here. The midget boat and the four frosted decoys are okay, but there’s ice in the waterway, all right. He lays the gun and ax inside and pushes the boat out from the shore. It sticks, bangs, rides up over the new ice.\nJeeze, it’s really thick! Last night he’d kicked through it easily and poled free by gouging in the paddle. Now he stamps out a couple of yards, pulling the boat. The ice doesn’t give. Darn! He takes a few more cautious steps—and suddenly hears the whew-whew, whew-whew of ducks coming in. Coming in—and he’s out here in the open! He drops beside the boat, peers into the bright white sky over the pass.\nOh Jeeze—there they are! Ninety miles an hour, coming downwind, a big flight! And he hugs his gun to hide the glitter, seeing the hurtling birds set their wings, become bloodcurdling black crescent-shapes, webs dangling, dropping like dive-bombers—but they’ve seen him, they veer in a great circle out beyond the tules, all quacking now, away and down. He hears the far rip of water and stands up aching toward them. You wait. Just wait till I get this dumb boat out there!\nHe starts yanking the boat out over the creaking ice in the brightening light, cold biting at his face and neck. The ice snaps, shivers, is still hard. Better push the boat around ahead of him so he can fall in it when it goes. He does so, makes another two yards, three—and then the whole sheet tilts and slides under with him floundering, and grounds on gravel. Water slops over his boot tops, burns inside his three pairs of socks.\nBut it’s shallow. He stamps forward, bashing ice, slipping and staggering. A yard, a yard, a yard more—he can’t feel his feet, he can’t get purchase. Crap darn, this is too slow! He grabs the boat, squats, throws himself ahead and in with all his might. The boat rams forward like an icebreaker. Again! He’ll be out of the ice soon now. Another lunge! And again!\nBut this time the boat recoils, doesn’t ram. Darn shit, the crappy ice is so thick! How could it get this thick when it was open water last night?\n‘Cause the wind stopped, that’s why, and it’s ten above zero. Old Tom knew, darn him to hell. But there’s only about thirty yards left to go to open water, only a few yards between him and the promised land. Get there. Get over it or under it or through it, go!\nHe grabs the ax, wades out ahead of the boat, and starts hitting ice, trying to make cracks. A piece breaks, he hits harder. But it doesn’t want to crack, the ax-head keeps going in, thunk. He has to work it out of the black holes. And it’s getting deep, he’s way over his boots now. So what? Thunk! Work it loose. Thunk!\nBut some remaining sanity reminds him he really will freeze out here if he gets his clothes soaked. Shee-it! He stops, stands panting, staring at the ducks, which are now tipping up, feeding peacefully well out of range, chuckling paducah, paducah at him and his rage.\nTwenty more yards, shit darn, God-darn. He utters a caw of fury and hunger and at that moment hears a tiny distant crack. Old Tom, firing. Crack!\nPetey jumps into the boat, jerking off his canvas coat, peeling off the two sweaters, pants, the gray longjohns. His fingers can barely open the icy knots of his bootlaces, but his body is radiant with heat, it sizzles the air, only his balls are trying to climb back inside as he stands up naked. Twenty yards!\nHe yanks the sodden boots back on and crashes out into the ice, whacking with the ax-handle, butting whole sheets aside. He’s making it! Ten more feet, twenty! He rams with the boat, bangs it up and down like a sledgehammer. Another yard! Another! His teeth are clattering, his shins are bleeding, and it’s cutting his thighs now, but he feels nothing, only joy, joy!—until suddenly he is slewing full-length under water with the incredible cold going up his ass and into his armpits like skewers and ice cutting his nose.\nHis hands find the edge, and he hauls himself up on the side of the boat. The bottom has gone completely. His ax—his ax is gone.\nThe ice is still there.\nA black hand grabs him inside, he can’t breathe. He kicks and flails, dragging himself up into the boat to kneel bleeding, trying to make his ribs work and his jaws stop banging. The first sunray slicks him with ice and incredible goose bumps; he gets a breath and can see ahead, see the gleaming ducks. So close!\nThe paddle. He seizes it and stabs at the ice in front of the boat. It clatters, rebounds, the boat goes backward. With all his force he flails the ice, but it’s too thick, the paddle stem is cracking. No bottom to brace on. Crack! And the paddle blade skitters away across the ice. He has nothing left.\nHe can’t make it.\nRage, helpless rage, vomits through him, his eyes are crying hot ice down his face. So close! So close! And sick with fury he sees them come—whew-whew! whew-whew-whew-whew!—a torrent of whistling wings in the bright air, the ducks are pouring over the pass. Ten thousand noble canvasbacks hurtling down the sky at him silver and black, the sky is wings beating above him, but too high, too high—they know the range, oh, yes!\nHe has never seen so many, he will never see it again—and he is standing up in the boat now, a naked bleeding loco ice-boy, raging, sweeping the virgin twelve-gauge, firing—BAM-BAM! both barrels at nothing, at the ice, at the sky, spilling out the shells, ramming them in with tearing frozen hands. A drake bullets toward him, nearer—it has to be near enough! BAM! BAM!\nBut it isn’t, it isn’t, and the air-riders, the magic bodies of his love beat over him yelling—canvasback, teal, wigeon, pintails, redheads, every duck in the world rising now, he is in a ten-mile swirl of birds, firing, firing, a weeping maniac under the flashing wings, white-black, black-white. And among the flashing he sees not only ducks but geese, cranes, every great bird that ever rode this wind: hawks, eagles, condors, pterodactyls—BAM! BAM! BAM-BAM!! in the crazy air, in the gale of rage and tears exploding in great black pulses—black! light! black!—whirling unbearably, rushing him up—\n—And he surfaces suddenly into total calm and dimness, another self with all fury shrunk to a tiny knot below his mind and his eyes feasting in the open throat of a girl’s white shirt. He is in a room, a cool cave humming with secret promise. Behind the girl the windows are curtained with sheer white stuff against the glare outside.\n“Your mother said you went to Santa Fe.” He hears his throat threaten soprano and digs his fists into the pockets of his Levi’s.\nThe girl Pilar—Pee-lar, crazy-name-Pilar—bends to pick at her tanned ankle, feathery brown bob swinging across her cheek and throat.\n“Um-m.” She is totally absorbed in a thin gold chain around her ankle, crouching on a big red leather thing her parents got in where, Morocco—Pilar of the urgently slender waist curving into her white Levi’s, the shirt so softly holding swelling softness; everything so white against her golden tan, smelling of soap and flowers and girl. So clean. She has to be a virgin, his heart knows it; a marvelous slow-motion happiness is brimming up in the room. She likes me. She’s so shy, even if she’s a year older, nearly seventeen, she’s like a baby. The pathos of her vulnerable body swells in him, he balls his fists to hide the bulge by his fly. Oh, Jeeze, I mean Jesus, let her not look, Pilar. But she does look up then, brushing her misty hair back, smiling dreamily up at him.\n“I was at the La Fonda, I had a dinner date with René.”\n“Who’s René?”\n“I told you, Pe-ter.” Not looking at him, she uncurls from the hassock, drifts like a child to the window, one hand rubbing her arm. “He’s my cousin. He’s old, he’s twenty-five or thirty. He’s a lieutenant now.”\n“Oh.”\n“An older man.” She makes a face, grins secretly, peeking out through the white curtains.\nHis heart fizzes with relief, with the exultance rising in the room. She’s a virgin, all right. From the bright hot world outside comes the sound of a car starting. A horse whickers faintly down at the club stables, answered by the double wheeze of a donkey. They both giggle. Peter flexes his shoulders, opens and grips his hand around an imaginary mallet.\n“Does your father know you were out with him?”\n“Oh, yes.” She’s cuddling her cheek against her shoulder, pushing the immaculate collar, letting him see the creamy mounds. She wants me, Peter thinks. His guts jump. She’s going to let me do it to her. And all at once he is calm, richly calm like that first morning at the corral, watching his mare come to him; knowing.\n“Pa-pa doesn’t care, it’s nineteen forty-four. René is my cousin.”\nHer parents are so terribly sophisticated; he knows her father is some kind of secret war scientist: they are all here because of the war, something over at Los Alamos. And her mother talking French, talking about weird places like Dee-jon and Tan-jay. His own mother doesn’t know French, his father teaches high school, he never would be going around with these sophisticated strangers except they need him for their sandlot polo. And he can play rings around them all, too, Peter thinks, grinning, all those smooth sweating old young men—even with his one mare for four chukkers and her tendons like big hot balloons, even with his spliced mallet he can cut it over their heads! If he could only get an official rating. Three goals, sure. Maybe four, he muses, seeing himself riding through that twerp Drexel with his four remounts, seeing Pilar smile, not looking at him. She’s shy. That time he let her ride the mare she was really frightened, incredibly awkward; he could feel her thighs tremble when he boosted her up.\nHis own thighs tremble, remembering the weak tenderness of her in his hands. Always before your voice my soul is as some smooth and awkward foal—it doesn’t sound so wet now, his mother’s nutty line. His foal, his velvety vulnerable baby mare. Compared to her he’s a gorilla, even if he’s technically a virgin too, men are different. And he understands suddenly that weird Havelock Ellis book in her father’s den. Gentle. He must be gentle. Not like—a what?—a baboon playing a violin.\n“You shouldn’t fool around with older men,” he says and is gratified by the gruffness. “You don’t know.”\nShe’s watching him now under the fall of her hair, coming close, still hugging herself with her hand going slowly up and down her arm, caressing it. A warm soap smell fills his nose, a sharp muskiness under it. She doesn’t know what she’s doing, he thinks choking, she doesn’t know about men. And he grunts something like “Don’t,” or “Can it,” trying to hold down the leaping heat between them, but is confused by her voice whispering.\n“It hurts, Pe-ter.”\n“What, your arm?”\n“Here, do-pee,” and his hand is suddenly taken hold of by cool small fingers pulling it not to her arm but in wonder to her side, pressed in the rustling shirt under which he feels at first nothing and then shockingly too far in not his own wide ribs but the warm stem of her, and as his paralyzed hand fumbles, clasps, she half turns around so that his ignited hand rides onto a searing soft unnatural swelling—her breast—and the room blanks out, whirls up on a brimming, drumming tide as if all the dead buffalo were pounding back. And the window blinks once with lemon light shooting around their two bodies where her hip is butting into his thigh making it wholly impossible to continue standing there with his hands gentle on her tits.\n“You don’t know what you’re doing, Pilar. Don’t be a dope, your mother—”\n“She’s a-way now.” And there is a confused interval of mouths and hands trying to be gentle, trying to hold her away from his fly, trying to stuff her into himself in total joy, if he had six hands he couldn’t cope with the electric all of her—until suddenly she pulls back, is asking inanely, “Pe-ter, don’t you have a friend?”\nThe subtle difference in her voice makes him blink, answering stupidly, “Sure, Tom Ring,” while her small nose wrinkles.\n“Dopee Pe-ter, I mean a boyfriend. Somebody smooth.”\nHe stands trying to pant dignifiedly, thinking Jeeze, I mean Christ, she knows I don’t have any smooth friends; if it’s for a picnic maybe Diego Martine? But before he can suggest this she has leaned into the window bay, cuddling the silky curtain around her, peeking at him so that his hands go pawing in the cloth.\n“René has a friend.”\n“Uh.”\n“He’s older too, he’s twen-tee,” she breathes teasingly. “Lieutenant Shar-lo. That’s Charles to you, see?” And she turns around full into his arms, curtain and all, and from the press of silk and giggles comes a small voice saying forever, “And Re-né and Shar-lo and Pee-lar all went to bed together and they played with me, oh, for hours and hours, Pe-ter, it was too marvelous. I will ne-ver do it with just one boy again.”\nEverything drops then except her face before him horribly heavy and exalted and alien, and just as his heart knows it’s dead and an evil so generalized he can hardly recognize it as fury starts tearing emptily at him inside, her hand comes up over her mouth and she is running doubled over past him.\n“I’m going to be sick, Peter help me!”\nAnd he stumbles after down the dim cool hall to find her crumpled down, her brown hair flowing into the toilet as she retches, retches, whimpering, convulses unbearably. The white shirt has ridden up to expose her pathetically narrow back, soft knobs of her spine curving down into her pants, her tender buttocks bumping his knees as he stands helplessly strangling a sopping towel instead of her neck, trying to swab at her hidden forehead. His own gullet is retching too, his face feels doughy, and water is running down into his open mouth while one of her hands grips his, shaking him with her spasms there in the dim hospital-like bathroom. The world is groaning, he is seeing not her father’s bay rum bottle but the big tiled La Fonda bedroom, the three bodies writhing on the bed, performing unknown horrors. Playing with her . . .\nHis stomach heaves, only what it is, he is coming in his Levi’s in a dreadful slow unrelieving ooze like a red-hot wire dragging through his crotch, while he stands by her uselessly as he will stand helplessly by in some near future he can’t imagine or remember—and the tension keeps building, pounding, the light flickers—a storm is coming or maybe his eyes are going bad, but he can see below him her pure profile resting spent on the edge of the toilet, oblivious to his furious towel; in the flashing dimness sees the incomprehensible letters S-E-P-T-I-C A-B-O-R-T-I-O-N snaking shadowy down the spine of his virgin love, while the universe beats Black! Flash! Black! Drumming with hooves harsher than any storm—hurling him through lightning-claps of blinding darkness to a thrumming stasis in which what exists of him senses—something—but is instantly shot away on unimaginable energies—\n—And achieves condensement, blooms into the green and open sunlight of another world, into a mellow springtime self—in which a quite different girl is jostling his hip.\n“Molly,” he hears his older voice say vaguely, seeing with joy how the willow fronds trail in the friendly, dirty Potomac. The bars and caduceus on his collar are pricking his neck.\n“Yes, sir, Doctor sir.” She spins around, kneels down in the scruffy grass to open Howard Johnson boxes. “Oh, god, the coffee.” Handing him up a hot dog, swinging back her fair hair. Her arm is so female with its tender pale armpit, her whole body is edible, even her dress is like lemonade so fresh and clean—no, radiant, he corrects himself. That’s the word, radiant. His radiant woman. He shrugs away a tiny darkness, thinking of her hair sliding on his body in the Roger Smith hotel bedroom.\n“C’mon sit, Pete. It’s only a little dirty.”\n“Nothing’s dirty anymore.” He flops down beside her, one arm finding its natural way around the opulence of her buttocks on the grass. She chuckles down at him, shaking her head.\n“You’re a hard case, Pete.” She takes a big bite of hot dog with such lips that he considers flinging himself upon her then and there, barely remembers the cars tearing by above them. “I swear,” she says, chewing, “I don’t think you ever screwed anybody you were friends with before.”\n“Something like that.” He puts his hot dog down to loosen his GI tie.\n“Thirty days to civvies, you’ll be in Baltimore.” She licks her fingers happily. “Oh, wow, Pete, I’m so glad you got your fellowship. Try the coleslaw, it’s all right. Will you remember us poor slaves when you’re a big old pathologist?”\n“I’ll remember.” To distract himself he pokes in the boxes, spills coleslaw on a book. “What you reading?”\n“Oh, Whately Carington.”\n“Whatly what?”\n“No, Whate-ly. Carington. A Limey. Psychical research man, they do that veddy seddiously, the Limies.”\n“Uh?” He beams at the river, blinks to get rid of a flicker in the back of his eyes. Amphetamine withdrawal, after six months?\n“He has this theory, about K-objects. Whatever thing you feel most intense about, part of you lives on—Pete, what’s wrong?”\n“Nothing.”\nBut the flicker won’t quit, it is suddenly worse; through it he can just make out her face turned nurse-wary, coming close, and he tries to hang on through a world flashing black—green—BLACK!—is trapped for unbreathing timelessness in dark nowhere, a phantom landscape of gray tumbled ash under a hard black sky, seeing without eyes a distant tangle of wreckage on the plain so menacing that his un-bodied voice screams at the shadow of a metal scrap beside him in the ashes, 2004 the ghostly unmeaning numbers—STOP IT!—And he is back by the river under Molly’s springtime eyes, his hands gripping into the bones of her body.\n“Hey-y-y, honey, the war’s over.” Sweet sensual pixie-smile now watchful, her nurse’s hand inside his shirt. “Korea’s ten thousand miles away, you’re in good old DC, Doctor.”\n“I know. I saw a license plate.” He laughs unconvincingly, makes his hands relax. Will the ghosts of Seoul never let him go? And his body guiltily intact, no piece of him in the stained waste cans into which he has—Stop it! Think of Molly. I like Ike. Johns Hopkins research fellowship. Some men simply aren’t cut out for surgical practice.\n“I’m a gutless wonder, Molly. Research.”\n“Oh, for Christ’s sake, Pete,” she says with total warmth, nurse-hand satisfied, changing to lover’s on his chest. “We’ve been over all that.”\nAnd of course they have, he knows it and only mutters, “My Dad wanted me to be an Indian doctor,” which they have been over too; and the brimming gladness is back now, buoyantly he seizes the coleslaw, demands entertainment, demonstrating reality-grasp.\n“So what about Whatly?”\n“It’s serious-s-s,” she protests, snickering, and is mercurially almost serious too. “I mean, I’m an atheist, Pete, I don’t believe there’s anything afterward, but this theory . . . ” And she rattles on about K-objects and the pool of time, intense energic structures of the mind undying—sweet beddable girl in the springtime who has taught him unclaiming love. His friend. Liberated him.\nHe stretches luxuriously, relishes a coleslaw belch. Free male beside a willing woman. No problems. What is it man in woman doth require? The lineaments of gratified desire. The radiance of her. He has gratified her. Will gratify her again . . .\n“It’s kind of spooky, though.” She flings the box at the river with tremendous effort, it flies twenty feet. “Damn! But think of parts of yourself whirling around forever sticking to whatever you loved!” She settles against the willow, watching the box float away. “I wonder if part of me is going to spend eternity hanging around a dumb cat. I loved that old cat. Henry. He died, though.”\nThe ghost of a twelve-gauge fires soundlessly across his mind, a mare whickers. He sneezes and rolls over onto her lap with his nose in her warm scented thighs. She peers dreamily down at him over her breasts, is almost beautiful.\n“Whatever you love, forever. Be careful what you love.” She squints wickedly. “Only with you I think it’d be whatever you were maddest at—no, that’s a horrible thought. Love has to be the most intense.”\nHe doubts it but is willing to be convinced, rooting in her lap while she pretends to pound on him and then squirms, stretching up her arms, giving herself to the air, to him, to life.\n“I want to spend eternity whirling around you.” He heaves up to capture her, no longer giving a damn about the cars, and as the sweet familiar body comes pliantly under him he realizes it’s true, he’s known it for some time. Not friendship at all, or rather, the best of friendships. The real one. “I love you, Molly. We love.”\n“Ooh, Pete.”\n“You’re coming to Baltimore with me. We’ll get married,” he tells her warm neck, feeling the flesh under her skirt heavy in his hand, feeling also an odd stillness that makes him draw back to where he can see her face, see her lips whispering, “I was afraid of that.”\n“Afraid?” His heart jumps with relief, jumps so hard that the flicker comes back in the air, through which he sees her lying too composed under his urgency. “Don’t be afraid, Molly. I love you.”\nBut she is saying softly, “Oh, damn, damn, Pete, I’m so sorry, it’s a lousy thing women do. I was just so happy, because . . . ” She swallows, goes on in an absurd voice. “Because someone very dear to me is coming home. He called me this morning from Honolulu.”\nThis he cannot, will not, understand among the flashing pulses, but repeats patiently, “You love me, Molly. I love you. We’ll get married in Baltimore,” while she fights gently away from him, saying, “Oh, I do, Pete, I do, but it’s not the same.”\n“You’ll be happy with me. You love me.”\nThey are both up crouching now in the blinking, pounding sunlight.\n“No, Pete, I never said. I didn’t—” Her hands are out seeking him, like knives.\n“I can’t marry you, honey. I’m going to marry a man called Charlie McMahon.”\nMcMahon—Maaa—honn—aa—on-n-n the idiot sound flaps through the universe, his carotids are hammering, the air is drumming with his hurt and rage as he stands foolishly wounded, unable to believe the treachery of everything-which is now strobing in great blows of blackness as his voice shouts “Whore!” shouts “Bitch-bitch-bitch . . . ” into a dwindling, flashing chaos—\n—And explodes silently into a nonbeing which is almost familiar, is happening this time more slowly as if huge energy is tiding to its crest so slowly that some structure of himself endures to form in what is no longer a brain the fear that he is indeed dead and damned to live forever in furious fragments. And against this horror his essence strains to protest But I did love! at a horizon of desolation—a plain of endless, lifeless rubble under a cold black sky, in which he or some pattern of energies senses once more that distant presence: wreckage, machines, huge structures incomprehensibly operative, radiating dark force in the nightmare world, the force which now surges—\n—To incorporate him anew within familiar walls, with the words “But I did love” meaninglessly on his lips. He leans back in his familiarly unoiled swivel chair, savoring content. Somewhere within him weak darkness stirs, has power only to send his gaze to the three-di portraits behind the pile of printouts on his desk.\nMolly smiles back at him over the computer sheets, her arm around their eldest daughter. For the first time in years the thought of poor Charlie McMahon crosses his mind, triggers the automatic incantation: Molly-never-would-have-been-happy-with-him. They had a bad time around there, but it worked out. Funny how vividly he recalls that day by the river, in spite of all the good years since. But I did love, his mind murmurs uneasily, as his eyes go lovingly to the computer printouts.\nThe lovely, elegant results. All confirmed eight ways now, the variance all pinned down. Even better than he’d hoped. The journal paper can go in the mail tomorrow. Of course the pub-lag is nearly three years now; never mind: the AAAS panel comes next week. That’s the important thing. Lucky timing, couldn’t be neater. The press is bound to play it up . . . Going to be hard not to watch Gilliam’s face, Peter muses, his own face ten years younger, sparkling, all lines upturned.\n“I do love it, that’s what counts,” he thinks, a jumble of the years of off-hours drudgery in his mind . . . Coffee-ringed clipboards, the new centrifuge, the animal mess, a girl’s open lab coat, arguments with Ferris in Analysis, arguments about space, about equipment, about costs—and arching over it like a laser-grid, the luminous order of his hypothesis. His proven—no, mustn’t say it—his meticulously tested hypothesis. The lucky lifetime break. The beauty one. Never do it again, he hasn’t another one like this left in him; no matter! This is it, the peak. Just in time. Don’t think of what Nathan said, don’t think the word. (Nobel)—That’s stupid. (Nobel) Think of the work itself, the explanatory power, the clarity.\nHis hand has been wandering toward the in-basket under the printouts where his mail has been growing moss (he’ll get a secretary out of this, that’s for sure!), but the idea of light turns him to the window. The room feels tense, brimming with a tide of energy. Too much coffee, he thinks, too much joy. I’m not used to it. Too much of a loner. From here in I share. Spread it around, encourage younger men. Herds of assistants now . . .\nAcross his view of tired Bethesda suburbs around the NIH Annex floats the train of multiple-author papers, his name as senior, a genial myth; sponsoring everybody’s maiden publication. A fixture in the mainstream . . . Kids playing down there, he sees, shooting baskets by a garage, will some of them live to have a myeloma cured by the implications of his grubby years up here? If the crystallization can be made easier. Bound to come. But not by me, he thinks, trying to focus on the running figures through a faint stroboscopic blink which seems to arise from the streets below, although he knows it must be in his retinae.\nReally too much caffeine, he warns himself. Let’s not have a hypertensive episode, not now, for god’s sake. Exultation is almost tangible in the room, it’s not distracting but integrative; as if he were achieving some higher level of vitality, a norepinephrine-like effect. Maybe I really will live on a higher level, he muses, rubbing the bridge of his nose between two fingers to get rid of a black afterimage which seems almost like an Apollo moonscape behind his eyes, a trifle unpleasant.\nToo much doom, he tells himself, vigorously polishing his glasses, too much bomb-scare, ecology-scare, fascism-scare, race-war-scare, death-of-everything scare. He jerks his jaw to stop the tinnitus thrumming in his inner ear, glancing at the big 1984 desk calendar with its scrawled joke: If everything’s okay why are we whispering? Right. Let’s get at it and get home. To Molly and Sue and little Pete, their late-born.\nHe grins, thinking of the kid running to him, and thrusts his hand under the printouts to his packet of stale mail—and as his hand touches it an icicle rams into his heart.\nFor an instant he thinks he really is having a coronary. But it isn’t his real heart, it’s a horrible cold current of knowledge striking from his fingers to his soul, from that hideous sleazy tan-covered foreign journal which he now pulls slowly out to see the penciled note clipped to the cover, the personally delivered damned journal which has been lying under there like a time bomb, for how long? Weeks?\nPete, you better look at this. Sorry as hell.\nBut he doesn’t need to look, riffling through the wretchedly printed pages with fingers grown big and cold as clubs; he already knows what he’ll find inside there published so neatly, so sweetly, and completely, with the confirmation even stronger and more elegant, the implication he hadn’t thought of—and all so modest and terse. So young. Despair takes him as the page opens. Djakarta University for Jesus Christ’s sake? And some Hindu’s bloody paradigm—\nSick fury fulminates, bile and ashes rain through his soul as his hands fumble the pages, the gray unreal unreadable pages which are now strobing—Flash! Black! Flash! Black!—swallowing the world, roaring him in or up or out on a phantom whirlwind—\n—’Til unsensation crescendos past all limit, bursts finally into the silence of pure energy, where he—or what is left of him, or momentarily reconstituted of him—integrates to terrified insight, achieves actual deathly awareness of its extinct self immaterially spinning in the dust of an eons-gone NIH Annex on a destroyed planet. And comprehends with agonized lucidity the real death of everything that lived—excepting only that in himself which he would most desperately wish to be dead.\nWhat happened? He does not know, can never know, which of the dooms or some other had finally overtaken them, nor when; only that he is registering eternity, not time, that all that lived here has been gone so long that even time is still. Gone, all gone; centuries or millennia gone, all gone to ashes under pulseless stars in the icy dark, gone forever. Saving him alone and his trivial pain.\nHe alone . . . But as the mercilessly reifying force floods higher there wakes in him a dim uncomforting sense of presence; a bodiless disquiet in the dust tells him he is companioned, is but a node in a ghostly film of dead life shrouding the cold rock-ball. Unreachable, isolate—he strains for contact and is incorporeally stricken by new dread. Are they too in pain? Was pain indeed the fiercest fire in our nerves, alone able to sustain its flame through death? What of love, of joy? . . . There are none here.\nHe wails voicelessly as conviction invades him, he who had believed in nothing before. All the agonies of Earth, uncanceled? Are broken ghosts limping forever from Stalingrad and Salamis, from Gettysburg and Thebes and Dunkirk and Khartoum? Do the butchers’ blows still fall at Ravensbrück and Wounded Knee? Are the dead of Carthage and Hiroshima and Cusco burning yet? Have ghostly women waked again only to re-suffer violation, only to watch again their babies slain? Is every nameless slave still feeling the iron bite, is every bomb, every bullet and arrow and stone that ever flew, still finding its screaming mark—atrocity without end or comfort, forever?\nMolly. The name forms in his canceled heart. She who was love. He tries to know that she or some fragment of her is warm among her children, but can summon only the image of her crawling forever through wreckage to Charlie McMahon’s bloody head.\nLet it not be! He would shriek defiance at the wastes, finding himself more real as the strange energy densens; he struggles bodilessly, flails perished non-limbs to conjure love out of extinction to shield him against hell, calling with all his obliterated soul on the ultimate talisman: the sound of his little son’s laugh, the child running to him, clasping his leg in welcome home.\nFor an instant he thinks he has it—he can see the small face turn up, the mouth open—but as he tries to grasp, the ghost-child fades, frays out, leaving in his destroyed heart only another echo of hurt—I want Mommy, Mommy, my Mommy. And he perceives that what he had taken for its head are forms. Presences intrusive, alien as the smooth, bleak regard of sharks met under water.\nThey move, process obscurely—they exist here on this time-lost plain! And he understands with loathing that it is from them or those—machines or beings, he cannot tell—that the sustaining energy flows. It is their dark potency which has raised him from the patterns of the dust.\nHating them he hungers, would sway after them to suck his death-life, as a billion other remnants are yearning, dead sunflowers thirsting toward their black sun—but finds he cannot, can only crave helplessly as they recede.\nThey move, he perceives, toward those black distant cenotaphs, skeletal and alien, which alone break the dead horizon. What these can be, engines or edifices, is beyond his knowing. He strains sightlessly, sensing now a convergence, an inflowing as of departure like ants into no earthly nest. And at this he understands that the energy up-buoying him is sinking, is starting to ebb. The alien radiance that raised him is going, and he is guttering out. Do you know? he voicelessly cries after them, Do you know? Do you move oblivious among our agonies?\nBut he receives no answer, will never receive one; and as his tenuous structure fails he has consciousness only to wonder briefly what unimaginable errand brought such beings here to his dead cinder. Emissaries, he wonders, dwindling; explorers, engineers? Or is it possible that they are only sightseers? Idling among our ruins, perhaps even cognizant of the ghosts they raise to wail—turning us on, recreating our dead-show for their entertainment?\nShriveling, he watches them go in, taking with them his lacerating life, returning him to the void. Will they return? Or—his waning self forms one last desolation—have they returned already on their millennial tours? Has this recurred, to recur and recur again? Must he and all dead life be borne back each time helplessly to suffer, to jerk anew on the same knives and die again until another energy exhumes him for the next performance?\nLet us die! But his decaying identity can no longer sustain protest, knows only that it is true, is unbearably all true, has all been done to him before and is all to do again and again and again without mercy forever.\nAnd as he sinks back through the collapsing levels he can keep hold only of despair, touching again the deadly limp brown journal—Djakarta University? Flash—and he no longer knows the cause of the terror in his soul as he crumbles through lost springtime—I don’t love you that way, Pete—and is betrayed to aching joy as his hand closes over the young breast within her white shirt—Pe-ter, don’t you have a friend?—while his being shreds out, disperses among a myriad draining ghosts of anguish as the alien life deserts them, strands them lower and lower toward the final dark—until with uncomprehending grief he finds himself, or a configuration that was himself, for a last instant real—his boots on gravel in the dawn, his hand on a rusty pickup truck.\nA joy he cannot bear rises in his fourteen-year-old heart as he peers down at the magic ducks, sees his boat safe by the path he’s cut; not understanding why the wind shrieks pain through the peaks above as he starts leaping down the rocks holding his ax and his first own gun, down to the dark lake under the cold stars, forever.\nOriginally published in Final Stage: The Ultimate Science Fiction Anthology, edited by Edward L. Ferman and Barry N. Malzberg.\nMultiple Hugo and Nebula Award-winning author James Tiptree, Jr. was the pseudonym of the late Dr. Alice Sheldon, a semi-retired experimental psychologist and former member of the American intelligence community who also wrote occasionally under the name of Raccoona Sheldon. Dr. Sheldon's tragic death in 1987 put an end to \"both\" careers, but not before she had won two Nebula and two Hugo Awards as Tiptree, won another Nebula Award as Raccoona Sheldon, and established herself, under whatever name, as one of the very best science fiction writers of our times. As Tiptree, Dr. Sheldon published two novels, Up the Walls of the World and Brightness Falls From the Air, and nine short-story collections: Ten Thousand Light Years From Home, Warm Worlds and Otherwise, Starsongs of an Old Primate, Out of the Everywhere, Tales of the Quintana Roo, Byte Beautiful, The Starry Rift, the posthumously published Crown of Stars, and the definitive posthumous retrospective collection, Her Smoke Rose Up Forever.", "source": "https://clarkesworldmagazine.com/tiptree_01_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Her Smoke Rose Up Forever by James Tiptree Jr."}