{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "QysgQxJqqlYottrbJpXMriN7vaw=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Fractal Universes, Serialized Novels, and a Cat: A Conversation with Yoon Ha Lee  A well-worn fictional universe is something to love. When you’ve spent countless enjoyable pages exploring the depths of nebulas and far flung planets, you find yourself occasionally wanting to go back after the last page has been turned. Thankfully, authors love to dip back in and explore their universes almost as much as we do.  Diving back into the universe of the Machineries of the Empire series, Hexarchate Stories features art thieves, galaxy destroying weapons, renegades, and even an assassin cat. With trademark wit and storytelling ability, Yoon treats fans of the series with even more bits of the universe to explore.  Yoon Ha Lee’s fiction has appeared in The Magazine of Fantasy & Science Fiction, Tor.com, Clarkesworld Magazine, and many more anthologies. Hexarchate Stories is a collection that explores more of the universe first glimpsed in Ninefox Gambit. The collection is available now from Solaris Books.   When did you know you wanted to be a writer?  Third grade, actually! Nobody gives third graders sound career advice, like “become an actuary.” My teacher, Mr. McCracken, used to dress up as the superhero, Story Man once a week, complete with spandex outfit. (In retrospect I wonder where on earth he got the outfit.) Story Man taught our class creative writing. Up until then, I had the vague notion that books sort of grew on trees and fell out of the sky into the library. It hadn’t really penetrated that people wrote books. But when Story Man taught us that stories come from people, I said to myself, I’m a person, so maybe someday I can write a book!  It took rather a lot of years to get to that first novel, but hey, persistence is worth something.  What drew you to science fiction?  My path was a bit circuitous. My first real exposure to science fiction was Anne McCaffrey’s Dragonriders of Pern series in third or fourth grade, because my friend Gwyn had gotten into the Harper Hall trilogy and I decided to give Dragonflight a try. The time travel plot element really blew my mind! And then I went back to reading dragon and unicorn books for years.  It wasn’t until middle school that I really got back into science fiction, and I’m afraid it was by way of unicorns. Specifically, one of Piers Anthony’s Apprentice Adept books had a unicorn on the cover so I checked it out, even though it turned out to be like the fifth book in the series or something. From there, I read more Anthony—I’m still fond of Macroscope—and branched out into H. G. Wells, Pamela Sargent, Roger Zelazny, and more.  What has kept you coming back to short fiction?  Two things: One, they usually pay you faster (even though there’s more money in novels). Two, short stories are a great medium for exploring short, sharp ideas. I think of a short story as more of a surgical strike and a novel as more of a war. (I’m afraid I think of the reader as an adversary?)  What other projects are you working on?  I’m currently working on a fantasy novel for Solaris called Phoenix Extravagant. The setting is loosely based on Korea during the Japanese occupation, and it has automata and magical pigments that are used to program them with qualities like courage or loyalty. My protagonist is a painter who discovers the terrible truth behind the pigments and a pacifist mecha dragon who becomes their ally.  I’m also working on two chapters of a serialized tie-in novel about Marvel’s Thor for Serial Box. The lead writer is Aaron Stewart-Ahn, and the other writers, Brian Keene and Jay Edidin, are also terrific. I’m really thrilled to be a part of this project.  Finally, S. L. Huang, author of the brilliant novel Zero Sum Game, and I are collaborating on a mathy space opera novel that we have code-named Space Hypatia, which is set in a far future Library of Alexandria that never was. (Spoiler: our Hypatia survives!) We both have math degrees and are having fun rolling around in the worldbuilding. We’re extremely excited both about the novel and about working with each other.  You’ve said that titles aren’t your strong suit. What are some of your favorite working titles you’ve had for your stories?  Oh man. There was the fantasy novel that I ended up trunking, whose title went from Paper Knives to Origami Souls to Paper Souls to . . . toward the end I just called it Millstone Fantasy Novel since that was what it felt like! And the original title of Ninefox Gambit was Ninefox and Suicide Hawk, which a friend of mine noted sounded like two superheroes who were unusually bad at picking superhero names! I kinda liked it though.  In Hexarchate Stories, the final novella, “Glass Cannon,” originally went by the working title “Jedao Lives.” I have no imagination . . .  You worked on The Vela for Serial Box. How was it writing together with other authors? Did you find it changed how you crafted a story?  So one of the biggest reasons I agreed to work on The Vela was that I had been wanting to try collaborative writing for some time. I’d done it once in, uh, a Legend of the Five Rings fanfic with my friend Brent Morgan, and really loved it. Obviously, the experience is going to differ based on the mix of personalities. Well, I was very fortunate, because we all hit it off immediately. Working with Becky Chambers, Rivers Solomon, and S. L. Huang was a dream. We’re all very different kinds of writers, but I admire the others’ work so much, they’re superb people as well, and we were able to bring our diverse strengths to the story in a way that I feel really strengthened the telling.  Serial Box’s method involves bringing all the writers together with the producer (in our case, Lydia Shamah, whose concept it was) to do the worldbuilding and plotting and characterization and so on in person for two and a half days. It was pretty intense—I normally don’t do all the planning for a novel in that amount of time, I tend to mosey my way through that kind of thing, but of course that would have been cost-prohibitive. I was the most plot-focused writer so I was concerned with plot structure, but I’m weak on characterization, which is where the others’ strengths here really shone. Worldbuilding in a team is also a thrilling experience because you can draw on multiple people’s expertise in disparate areas.  The other thing is to save time, we were all writing chapters (called “episodes” in Serial Box’s parlance) simultaneously. So originally S. L. Huang wrote the first episode so we could all get a feel for the setup, and then we wrote eps. 2-5 simultaneously, had a phone conference and Slack meetings to hash out continuity, then did the same for the second half. As you might imagine, there was some pretty intense editing to make sure everything was consistent between episodes, modulo some differences in individual prose styles.  The universe you’ve created is lovingly crafted and deep. You’ve already finished a trilogy in this universe, what keeps you coming back to tell stories in this universe?  Well, the shallow answer is money. I personally feel that it is very nice to be able to pay the bills. But the other answer is that I feel that a good story universe is fractal—there are infinite possibilities for stories to tell and it’s just a matter of finding the ones that appeal to me personally. That being said, Hexarchate Stories is probably it for a while. I’ve been noodling at doing “The Battle of Candle Arc” in comic form but it has to happen in between my other commitments.  Did some of the stories included in the collection start out as part of the main trilogy, then took on a life of their own?  The only one that fits that description is “Calendrical Rot,” which was the first thing I wrote. It was originally the prologue to Ninefox Gambit. I ended up cutting it because I have a strong philosophical objection to most prologues (the big exception for me is the one for Guy Gavriel Kay’s splendid Tigana), but I sort of regret it because I wonder if the novel would have parsed better with that setup.  I honestly suspect “The Battle of Candle Arc” would have made a better prologue, if a long one, but I didn’t write it until after I drafted Ninefox Gambit even though it was published first, in Clarkesworld Magazine. I’d originally left the specifics of Jedao’s victory at that battle to the imagination, but it nagged me that I didn’t know how he’d done it, and finally I wrote the story, helped along by the fact that Neil Clarke had hinted that he would like me to darken his submissions inbox. My friend and beta reader Daedala told me I should just go ahead and crib off a historical battle for the tactics, so I did that. I went with the Battle of Myeongnyang, which is not well known in the West; Admiral Yi Sun-Sin faced worse odds than Jedao, won a more decisive victory, and took fewer casualties. I sort of toned things down because I didn’t want to push suspension of belief, ironically, even though the history was even more impressive!  You decided to include a prose poem in this collection. Did you set out to write a poem or did the story eventually dictate the form?  I set out to write a prose poem. I’ve published poetry in the past, and I love reading it and on occasion writing it, but I didn’t love it enough to keep doing it for $5/poem when I could be making more money doing something else.  There are notes at the end of each story that are extraordinarily informative. What made you want to include these?  Mainly because when I read a story collection or anthology, the notes are some of my favorite bits! You can learn the randomest things about writers, editors, or stories from notes. So I was figuring that maybe there would be other readers who enjoy that kind of thing and would have fun with the notes, and that anyone who wasn’t interested could just skip them.  What inspired “Irriz the Assassin-Cat?”  Oh, that’s easy—I have a cat! Her name is Cloud, and she sheds on eeeeeeeeeeeverything. We only got her four years ago so she wasn’t around when our daughter was small. But one of the tall tales I like to tell my daughter, because we Texans love our tall tales, is that we ordered her as an egg from the stork, and the stork delivered the egg, and we had our cat incubate the egg for us because I’m personally too lazy to sit on an egg. My daughter rolls her eyes every time she hears this story, because as a teenager she’s too wise to be fooled by it. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nFractal Universes, Serialized Novels, and a Cat: A Conversation with Yoon Ha Lee\nA well-worn fictional universe is something to love. When you’ve spent countless enjoyable pages exploring the depths of nebulas and far flung planets, you find yourself occasionally wanting to go back after the last page has been turned. Thankfully, authors love to dip back in and explore their universes almost as much as we do.\nDiving back into the universe of the Machineries of the Empire series, Hexarchate Stories features art thieves, galaxy destroying weapons, renegades, and even an assassin cat. With trademark wit and storytelling ability, Yoon treats fans of the series with even more bits of the universe to explore.\nYoon Ha Lee’s fiction has appeared in The Magazine of Fantasy & Science Fiction, Tor.com, Clarkesworld Magazine, and many more anthologies. Hexarchate Stories is a collection that explores more of the universe first glimpsed in Ninefox Gambit. The collection is available now from Solaris Books.\nWhen did you know you wanted to be a writer?\nThird grade, actually! Nobody gives third graders sound career advice, like “become an actuary.” My teacher, Mr. McCracken, used to dress up as the superhero, Story Man once a week, complete with spandex outfit. (In retrospect I wonder where on earth he got the outfit.) Story Man taught our class creative writing. Up until then, I had the vague notion that books sort of grew on trees and fell out of the sky into the library. It hadn’t really penetrated that people wrote books. But when Story Man taught us that stories come from people, I said to myself, I’m a person, so maybe someday I can write a book!\nIt took rather a lot of years to get to that first novel, but hey, persistence is worth something.\nWhat drew you to science fiction?\nMy path was a bit circuitous. My first real exposure to science fiction was Anne McCaffrey’s Dragonriders of Pern series in third or fourth grade, because my friend Gwyn had gotten into the Harper Hall trilogy and I decided to give Dragonflight a try. The time travel plot element really blew my mind! And then I went back to reading dragon and unicorn books for years.\nIt wasn’t until middle school that I really got back into science fiction, and I’m afraid it was by way of unicorns. Specifically, one of Piers Anthony’s Apprentice Adept books had a unicorn on the cover so I checked it out, even though it turned out to be like the fifth book in the series or something. From there, I read more Anthony—I’m still fond of Macroscope—and branched out into H. G. Wells, Pamela Sargent, Roger Zelazny, and more.\nWhat has kept you coming back to short fiction?\nTwo things: One, they usually pay you faster (even though there’s more money in novels). Two, short stories are a great medium for exploring short, sharp ideas. I think of a short story as more of a surgical strike and a novel as more of a war. (I’m afraid I think of the reader as an adversary?)\nWhat other projects are you working on?\nI’m currently working on a fantasy novel for Solaris called Phoenix Extravagant. The setting is loosely based on Korea during the Japanese occupation, and it has automata and magical pigments that are used to program them with qualities like courage or loyalty. My protagonist is a painter who discovers the terrible truth behind the pigments and a pacifist mecha dragon who becomes their ally.\nI’m also working on two chapters of a serialized tie-in novel about Marvel’s Thor for Serial Box. The lead writer is Aaron Stewart-Ahn, and the other writers, Brian Keene and Jay Edidin, are also terrific. I’m really thrilled to be a part of this project.\nFinally, S. L. Huang, author of the brilliant novel Zero Sum Game, and I are collaborating on a mathy space opera novel that we have code-named Space Hypatia, which is set in a far future Library of Alexandria that never was. (Spoiler: our Hypatia survives!) We both have math degrees and are having fun rolling around in the worldbuilding. We’re extremely excited both about the novel and about working with each other.\nYou’ve said that titles aren’t your strong suit. What are some of your favorite working titles you’ve had for your stories?\nOh man. There was the fantasy novel that I ended up trunking, whose title went from Paper Knives to Origami Souls to Paper Souls to . . . toward the end I just called it Millstone Fantasy Novel since that was what it felt like! And the original title of Ninefox Gambit was Ninefox and Suicide Hawk, which a friend of mine noted sounded like two superheroes who were unusually bad at picking superhero names! I kinda liked it though.\nIn Hexarchate Stories, the final novella, “Glass Cannon,” originally went by the working title “Jedao Lives.” I have no imagination . . .\nYou worked on The Vela for Serial Box. How was it writing together with other authors? Did you find it changed how you crafted a story?\nSo one of the biggest reasons I agreed to work on The Vela was that I had been wanting to try collaborative writing for some time. I’d done it once in, uh, a Legend of the Five Rings fanfic with my friend Brent Morgan, and really loved it. Obviously, the experience is going to differ based on the mix of personalities. Well, I was very fortunate, because we all hit it off immediately. Working with Becky Chambers, Rivers Solomon, and S. L. Huang was a dream. We’re all very different kinds of writers, but I admire the others’ work so much, they’re superb people as well, and we were able to bring our diverse strengths to the story in a way that I feel really strengthened the telling.\nSerial Box’s method involves bringing all the writers together with the producer (in our case, Lydia Shamah, whose concept it was) to do the worldbuilding and plotting and characterization and so on in person for two and a half days. It was pretty intense—I normally don’t do all the planning for a novel in that amount of time, I tend to mosey my way through that kind of thing, but of course that would have been cost-prohibitive. I was the most plot-focused writer so I was concerned with plot structure, but I’m weak on characterization, which is where the others’ strengths here really shone. Worldbuilding in a team is also a thrilling experience because you can draw on multiple people’s expertise in disparate areas.\nThe other thing is to save time, we were all writing chapters (called “episodes” in Serial Box’s parlance) simultaneously. So originally S. L. Huang wrote the first episode so we could all get a feel for the setup, and then we wrote eps. 2-5 simultaneously, had a phone conference and Slack meetings to hash out continuity, then did the same for the second half. As you might imagine, there was some pretty intense editing to make sure everything was consistent between episodes, modulo some differences in individual prose styles.\nThe universe you’ve created is lovingly crafted and deep. You’ve already finished a trilogy in this universe, what keeps you coming back to tell stories in this universe?\nWell, the shallow answer is money. I personally feel that it is very nice to be able to pay the bills. But the other answer is that I feel that a good story universe is fractal—there are infinite possibilities for stories to tell and it’s just a matter of finding the ones that appeal to me personally. That being said, Hexarchate Stories is probably it for a while. I’ve been noodling at doing “The Battle of Candle Arc” in comic form but it has to happen in between my other commitments.\nDid some of the stories included in the collection start out as part of the main trilogy, then took on a life of their own?\nThe only one that fits that description is “Calendrical Rot,” which was the first thing I wrote. It was originally the prologue to Ninefox Gambit. I ended up cutting it because I have a strong philosophical objection to most prologues (the big exception for me is the one for Guy Gavriel Kay’s splendid Tigana), but I sort of regret it because I wonder if the novel would have parsed better with that setup.\nI honestly suspect “The Battle of Candle Arc” would have made a better prologue, if a long one, but I didn’t write it until after I drafted Ninefox Gambit even though it was published first, in Clarkesworld Magazine. I’d originally left the specifics of Jedao’s victory at that battle to the imagination, but it nagged me that I didn’t know how he’d done it, and finally I wrote the story, helped along by the fact that Neil Clarke had hinted that he would like me to darken his submissions inbox. My friend and beta reader Daedala told me I should just go ahead and crib off a historical battle for the tactics, so I did that. I went with the Battle of Myeongnyang, which is not well known in the West; Admiral Yi Sun-Sin faced worse odds than Jedao, won a more decisive victory, and took fewer casualties. I sort of toned things down because I didn’t want to push suspension of belief, ironically, even though the history was even more impressive!\nYou decided to include a prose poem in this collection. Did you set out to write a poem or did the story eventually dictate the form?\nI set out to write a prose poem. I’ve published poetry in the past, and I love reading it and on occasion writing it, but I didn’t love it enough to keep doing it for $5/poem when I could be making more money doing something else.\nThere are notes at the end of each story that are extraordinarily informative. What made you want to include these?\nMainly because when I read a story collection or anthology, the notes are some of my favorite bits! You can learn the randomest things about writers, editors, or stories from notes. So I was figuring that maybe there would be other readers who enjoy that kind of thing and would have fun with the notes, and that anyone who wasn’t interested could just skip them.\nWhat inspired “Irriz the Assassin-Cat?”\nOh, that’s easy—I have a cat! Her name is Cloud, and she sheds on eeeeeeeeeeeverything. We only got her four years ago so she wasn’t around when our daughter was small. But one of the tall tales I like to tell my daughter, because we Texans love our tall tales, is that we ordered her as an egg from the stork, and the stork delivered the egg, and we had our cat incubate the egg for us because I’m personally too lazy to sit on an egg. My daughter rolls her eyes every time she hears this story, because as a teenager she’s too wise to be fooled by it.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/lee_interview_2019/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fractal Universes, Serialized Novels, and a Cat: A Conversation with Yoon Ha Lee by Chris Urie"}