{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Eleanna Castroianni", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "FWdK6V3vv4/cEZSZ25dgMNu1Snk=", "id": null, "license": null, "comments": "", "raw_text": "6310 words, short story  Without Exile  But when the radiant light of the sun rose, we beheld the Aegean flowering with corpses—Aeschylus, Agamemnon  Luciole. I dreamed I was swimming in the seas of my homeland again. My hair turned into seaweed thick with petrol; my mouth tasted like radiation and uranium. I opened my eyes—lashes threaded with sticky fish entrails—and found myself on a starboat made out of the silken carcasses of sand-sparrows. I see fingers and nacre-colored fingernails, fingertips burned to sable, spidery blood vessels twirling like ribbons on the tails of kites still riding the wind. Every time I think I have escaped that life, a tidal wave of fear rises again to engulf me.  Star seas are full of dead bodies. We’re drowning in an ocean of floating body parts.  “Another ship has crashed, sir.”  Your even, soothing voice draws me out of my rapture. Luciole, you are programmed to speak the profoundest horrors in the levelest voice I’ve ever heard.  We’re in my office, the paper-thin walls making it barely quiet, and I turn away from the window because the view of the universe makes me, to this day, sick with nausea. “Report,” I say.  Magenta and lime green lights syncopate on your interface. By now I am able to get a good hint of your whims and emotions even though you don’t have a human face. “Twenty-three emergency pods have reached Sandpiper Station since yesterday.”  And how many more have crashed into space debris, blowing up with all their human cargo? I won’t ask; I don’t want to know.  “Fifteen more have reached Swallow and Stork,” you go on. Civilians, militia, media, governments, both rich and poor—everyone’s complaining and asking why station AI can’t block access. They forget that life pods were only made to be picked up by nearby vessels; that they do not appear on station systems because they weren’t designed for this. No one ever thought that people would be so desperate to attempt intra-system travel in such poorly-made vessels.  “Survivors?” I mutter. My tongue is dry; my brow sweaty. But I’ve been doing this for a while. I’m a professional. I ought to know how to keep calm.  “About one hundred and forty,” you say. Each pod is meant to hold a maximum of five people, so they left loaded with more than ten each. Those who survived, are so, so incredibly lucky. “Expect severe health problems due to radiation, zero gravity, and poor health conditions. All survivors have taken shelter in the Flower Cemetery.”  “More of them in the Cemetery? There’s no space left down there.”  “That’s where they are, sir. Nowhere else they can go,” you ground me with your matter-of-factness. If you had any shoulders, you would shrug. “Shall we start? You have appointments.”  I nod and dive into my paperwork briefly before we leave my cardboard-thin office.  The image of an arm won’t leave my eyes: an arm, a disembodied arm. It’s been with me for twenty years now, almost like an extra limb I’ve grown. I’ve learned to ignore its presence, along with other monsters. But today it persists and distracts me from one moment to the next.  Luciole, my friend. When I speak to you of home, you are the only one who stays silent and expressionless, as if every image of rocky shores sinks into your circuitry, every spoonful of neranj sweet preserve travels inside your software, to burrow somewhere warm and transform into memory.  I don’t know if it’s the parent’s eyes or the child’s that pluck something in me.  With you by my side I walk through the camp—a thick forest of tents, waste, and human limbs. I push aside the hanging laundry, make my way between children chasing each other, blissful in the moment. I’m wearing my padded jacket and still get shivers. The air is colder here; the station won’t waste energy to regulate temperature on the level where pod people live. It’s a small station anyway, meant to act as an in-between stop for the Turm when they travel from one side of their Empire to the other. When you’re stuck here, there’s nowhere to go. Home is hell. Here is a slightly better version of hell: one in which you die slowly, hope the only staple to sustain you.  My head is always misty when I’m in the camps. Memories of cold bean soup and dark brown urine mingle with the present and I’m not sure which planet I’m standing on, which day, which reality. But I’m not a child anymore. People know me and greet me—other lawyers, a few humanitarian workers, some beneficiaries. “Want me to tell you the poem of the day, sir?” you ask. Luciole, your obsession with poetry is one of a kind. I welcome it. “The shores of my homeland, how they’re full of corpses—I write this poem because I can’t leave them flowers.”  Your words shake me out of my trance, back into this world. Every time I’m here I realize there’s so little I can do. I am only a corporate lawyer, sent to Sandpiper by my company as part of its corporate responsibility program. “Nell is from Koohar, isn’t she?” my bosses said. “She will do great at Sandpiper then.” All my papers say I’m Turm, because Turm Empire wanted so badly to forget where I come from, but whenever it’s convenient they remember my true origin.  I could have said no to this position, really. Someone else could be handling it better than I do now—without the sickness, without the flashbacks and the fugues. And now the child is tugging at my sleeve, and the parent is staring at me with those eyes that demand something, but are too stubborn to speak up. I’m standing transfixed between them, a ghost caught between two worlds.  “Lawyer, you’re meeting with us today,” she says in Luti, a Koohar language I can’t speak but recognize by the sing-song inflection. You translate inside my head, voice flat and smooth like a sinking sunset.  I draw a quick confirmation as you feed me through the mini-com the few data we have for this family: names, ages, origin, dates of arrival. My company’s other lawyer had been working with them for a while, but it seems that he suddenly handed them over to me with no further explanation. Your data only state cultural reasons for the switch.  I’ve learned by now that this is code for Koohari too difficult to deal with. “Yes,” I find myself saying, “let’s have a meeting now, shall we? I’m Nell.”  My impromptu office is three walls leftover medicine supplies containers, one wall micro-plastics glass that engulfs Sandpiper into its bubble, keeping breathing air inside and cosmic radiation outside. Outside, where the wide, wild space looms, full of stars, debris, and human-made vessels. Among them float dead bodies, thousands of them, but they are too small to see with naked eye. They will merge with the space debris, dissipate into the merciless void of the universe. No trace. Back to stardust.  We sit on the floor. “Uruna,” I read the parent’s name from the notes you’re feeding me. My data doesn’t say and I’m quite bad myself at discerning it, so I have to ask: “Gender?”  “Soom,” she replies calmly, then points at her child. “Katii is nutu.”  I nod and wonder how much of this will the asylum officers care to understand this time—Koohar genders are completely incomprehensible to them. For lack of better terms, soom means child-rearing female; nutu means child-bearing male. For the Turm Empire, this distinction makes no sense. They neither have the language to accommodate it nor do they care to do that.  “My child is ill,” Uruna says before I can ask anything else. It is the only thing she has in mind now and rightfully so. Survivors of pods often arrive as bundles of star-travel disease. Nothing of it is infectious, yet still it’s too easy to brand them as ‘pod people,’ as dehumanized health hazards. “They won’t give me any medicine. They told me that only in Turm system they can fix him.”  Little Katii is no more than eight. I can already see the sagging skin, devoid of luminosity, the thinning hair falling off in patches. Radiation has poisoned him, but it’s not his illness that makes me think that something about him is uneasy and familiar, like looking into a mirror that distorts your image only slightly. His red-rimmed eyes won’t leave mine. Katii is a silent one, but he has a fire burning inside.  “You can’t travel further in yet,” I say. You momentarily distract me by folding a piece of reusable paper with your small, metallic, three-joint hands. “I’m here to help you with your asylum application. With refugee status, you and your child can be sent to inner Turm system. And from there somewhere more permanent. Okay?”  She has heard all this before, yet something about her looks unconvinced. She’s wary; the experience with the previous lawyer could not have been very good. Still, she nods. By now you have finished folding and you hand a small, elegant paper-bird to Katii. “Sand-sparrow,” he says and his eyes light up. The color is unmistakably that of the desert, the golden-purple plumage of sand-sparrows. He shows it to his mother, who smiles sweetly back at him. They both look more relaxed and I’m thankful you are so good at this sort of thing, Luciole. As I go through my paperwork, Uruna strokes Katii’s thinning hair. She mutters a lullaby and your mellow lights join them in their sleepiness. I’d rather not have the child with us as we do the interview preparation, but he is sleeping so peacefully I can’t bring myself to separate them just now.  I choose my approach carefully. Whatever trauma she is carrying with her, it is impossible to not relive during our talk. But I want to soften the impact, to make sure I know what really happened so I can help her. After a few questions on her origin, I ask, “Tell me, Uruna, why did you leave?”  “Everything collapsed.” She’s staring at the darkness of the galaxy outside. Her voice is small and distant, as if coming from a faraway ocean. “The world collapsed.” She turns to look at me.  Uruna’s eyes are the color of my mother’s eyes.  I shake the memory from me, quickly, violently. I can’t afford to deal with this now. I will return to pick it up later.  I cough.  Koohar’s biggest problem is its ecological disaster, one that’s been going on for years and years after decades of catastrophic wars. Water now covers four fifths of the planet and animals are near-extinct. Yet such disasters are never reason enough to give asylum to people fleeing from them, because that would mean accepting everyone and not only a select few. Somehow you’re expected to stay on a planet that’s trying to kill you.  “I know this,” I say, “but it won’t get you refugee status. We have to think through what you will say in your interview. Truthful things, but carefully laid out. What about the war?”  “The Haz ruined everything,” she answers vaguely, as expected. Eyes wander again, as if we’re at school and I’m the persistent teacher and all Uruna wants is to play outside. I’ll have to lay the architecture of my questions carefully, like a funnel. Start from the bigger and narrow it down to the miniscule.  “Are there any instances of fear for your lives from the Haz? Things that happened to your extended family, perhaps, and which you can tell the officer?” Everyone has someone like that. I know I did.  She thinks for a moment, then answers, “Yes,” letting unsaid words linger on her lips. Finally, she starts to speak.  It’s not a linear narrative. She jumps from one thing to the next, from one day five years ago to what happened last week. You are transcribing everything and I trust your software to sort out a few things for me. Uruna surprises me by starting from the shores of Antu—from my hometown. Turns out she was an immigrant there, working to gather and dry kelp, when she got caught up in the conflict with the Haz. She speaks of her birth-mother’s family and of her neighbors, and of Katii’s birth-father and his other raising-mother too. “Then a bomb exploded,” she says. “Torn them both to pieces. We only found an arm.”  I close my eyes; the image of the arm comes back to me, intrudes my thoughts.  Uruna is calm, much calmer than I am, and other lawyers would be shocked at how she can recite such horrors and carry that taciturn half-smile; at how she can still speak of her home fondly, even after all the things that happened to her there. I only know I’m not surprised at all: sympathy is for the privileged. Pity would be no more, you said once in the words of an old poet, if we did not make somebody poor.  Again, I push the image of the arm away. I try to hold on as myself is slipping away from me.  You hand me a glass of water at the right moment, then offer some to Uruna. I gently ask her to repeat parts of this story, to establish the relations between her relatives and make the timeline as clear as possible without exhausting or vexing her. “These stories are what you need to get your application accepted,” I tell her when we’re done. The arm is here with me again. It hasn’t left. It never leaves. “Tell them as you told me. If they ask you to repeat them, don’t change them. Don’t give them reasons to doubt you’re telling the truth.”  Uruna frowns, arched, thick eyebrows conferring in annoyance. Her voice rises and shakes, as if all pent-up emotion was to be channeled in this answer alone. “Doubt what? We climbed on a crumbling pod to get here. We left our homes. You think we wanted that? Why would we lie?”  Her indignant inflection is so different from your flat translation. Her anger is a real piece of work: everyone comes to me scared, ready to blurt out any lie that will grant them passage out of this in-between purgatory. But Uruna is enraged.  “You are right,” I tell her and drink more water. It flows cold down my throat and does nothing to quench my thirst. “But this is how the procedure goes. They’re trying to trim the edges and grant asylum only to the most vulnerable ones. You are a parent with a child—a sick one too—and your stories from home justify your fear. If all goes well in your interview, there won’t be a problem.”  Uruna’s suspicious look makes me think she doesn’t completely trust me. I don’t know what else to do. My head is empty by now; my palms itch and sting. The room has started darkening and my breath is not enough.  “Lawyer, are you alright?” Uruna asks in concern.  “Sir, your vitals indicate need for rest and medication.”  “Yes, Luciole.” I meet Uruna’s eyes one last time—my mother’s eyes. “I am sorry. I have to rest. You will have to meet with our psychologist now. I can arrange more meetings with another lawyer, but I hope you feel more confident in your interview?”  “Of course,” she says quickly, hiding—unsuccessfully—a generous portion of self-doubt. She strokes Katii’s hair one last time, meets my eyes with a hint of worry. She thanks me, then gently picks him up in her arms and leaves.  “Sir,” you say once I’ve lied down on the floor. The tranquilizer works fast and I’m sinking in the numbness. “That young human looked a lot like you. The smaller one, I mean.”  I laugh, my laughter turning into a cough. Luciole. All the things I try not to notice, to hide from myself. You pick them up and hurl them right back at me. “Cheeky, Luciole. That’s why I chose you.”  The single red light on your interface indicates pleasure. “I know.”  The arm and I have a long history, Luciole.  Back then, it was a woman’s arm. Soom, I think, because the long, calloused fingers looked like my raising-mother’s who worked the fields daily. I can’t recall my mother’s face, but the image and texture of her fingers have always stayed with me. How they wrapped around the crocus-colored tunics she wore, how she folded them around my nettle-and-hemp dress.  I thought I had forgotten my mother’s eyes but Uruna had the exact same hue in her pupils. It was like looking straight into my mother’s face.  Tonight, nightmares wake me up many times. Something has been suffocating me. You play soothing sounds of bird chirrups and running river water for me.  “Sir, why did you come to Sandpiper?” you surprise me. Again, this is a question outside your protocol. This is you, the personality that is Luciole, the office bot, speaking.  “My company sent me,” I tell you something you already know and we are both aware I’m trying to avoid an honest answer. In the darkness, only a small white light comes from you, tracing the contours of my bed frame and duvet.  “Maybe they ought to send you back,” you say, ruthless. “Your flashbacks are causing you too much stress.”  Ah, Luciole. Your care is something I won’t forget, ever. You’d be excellent in this job on your own.  “You know I won’t leave.”  Pause. The white light is flickering like a distant star. “I know, sir. But you’re not the right person for this.”  “Who is then?”  You stay silent. You and I both know that the only people who can do this right, are all the wrong people.  “You changed your statement? Why?”  Uruna is excessively stubborn today, arms crossed over her chest, eyeing me with my mother’s eyes as if I’ve done some unspeakable evil. I don’t know what went wrong between us. Since that first day she never trusted me completely, never allowed me to help her.  When she does not reply, I try to explain as calmly as I can. “I told you it was very important to not retract anything. When we first met, I reassured you that with history such as yours, I can get you out of here. Yet you changed statements.”  “What do you want me to do now?” she bursts. “It is what it is!”  I understand she’s more embarrassed and angry at herself than she is at me. She feels alone in this, but truth is, she’s not—it’s terribly easy for the applicants to get confused during the long interviews. The rules are strict. One fake-sounding statement and you’re all done.  Katii isn’t with us—a friend is looking after him because he’s feeling too weak today. And I can tell Uruna is anxious to return to the child, always turning her head towards the sounds and voices coming from the camp.  “You are right,” I admit. It’s no use to keep this conversation going. My own guilt engulfs me: I was too ill to help her prepare. I didn’t even join her at the interview. “It is what it is. I should have done my job better.”  At my sharing of responsibility, Uruna loosens up. Her stubborn mask gives way into genuine distress and disappointment. Tears fill her eyes, but they’re tears of anger. I remember angry tears. I used to cry of anger too. “I told them many times over! How Katii has four parents, and so does everyone.” She’s making fists, spitting the words like fire. “They thought I was lying! Making up things about my parents and relatives. Because I said father and mother several times and they couldn’t figure out who was who!”  Exactly as I feared. Even though we rehearsed many times and made sure to clarify who did what, even though there are so many asylum seekers from Koohar right now, to Turm ears it all sounds like a hopelessly tangled ball of yarn. Even the most cooperative of the asylum officers, those who will patiently ask clarifications on who is who, might eventually find the account flawed and unconvincing.  Although it’s hard, it’s not impossible to clear up this mess. The law allows us to ask for a second audience due to malpractice.  Then Uruna surprises me, catching me off guard. “You don’t look like Turm. You look more like us.”  While I was lost in my own thoughts she had been examining my face. We have the same sandy skin, the same wild curls, the same arched eyebrows. But I dye my hair and keep it sleek, pluck my eyebrows and hide my complexion under makeup. “Can you tell?” I laugh.  She points at my ears. No one ever wondered if there was anything wrong with my ears. But Uruna sees something others can’t see. “Only esom have this ear-shape,” she says.  Esom. Child-bearing female. What I would have been. “I am esom,” I admit, a knowledge I took with me from Koohar. I was nine when I left, and the miniscule changes that split the two genders into four start at eight. “But for the Turm, it doesn’t matter. I’m just a woman.”  “Woman,” Uruna says, pondering the word. “Maybe it’s better to be just woman.” In my notes fed through the mini-com, I see you have translated the Luti word for girl. Woman does not exist on Koohar. “What does it mean for adults?” she asks, trying to understand people who stay a dyad and don’t transform a second time. Suddenly, it is Uruna who’s interviewing me and it’s uneasy. This is one way applicants try to gain more control, even to manipulate. I should stay on top of this, yet I want to answer. I’ve never talked about being esom with anyone after I left.  “It means both potential child-bearer and raiser. Both soom and esom,” I explain. “The Turm think that when you have children, you raise them too.”  She laughs, but her laugh is tinged with disgust. “That’s ridiculous!”  I shrug. “It’s okay. I won’t have children. I can’t.” I’m not sure if I was born like this or if my infertility is the aftermath of several things I’ve been through during those days I wandered as a child around camps, loosely guarded camps, horrendously chaotic camps. The fate of loneliness this knowledge has sealed for me is something I do not think about.  Uruna’s eyes widen. “Naya!” she says, but you won’t translate this word. I check your translation notes from Luti language and they look empty: the entry is missing. Another Koohar thing too complex to translate? “Sir, I’m looking this up,” you whisper in my head.  Her face softens, in distant sadness and a tiny bit of understanding. “You’re so unlucky,” she tells me and embarrassment consumes me. In Koohar, where people take so much pride in looking after the next generation whichever way they can, I’m a child-bearer who’s infertile—what else could I receive except pity? Our little talk is getting dangerously out of hand. Then she asks what I’ve been fearing all along: “How did you end up in Turm?”  By now I know there’s no way out of this. But maybe if I talk about myself she will start trusting me. Maybe it’s the right moment to take her on my side. “I was a refugee in the Two Systems War. Grew up in camps around the solar system. When I was eleven, a Turm family adopted me. I don’t remember much of my life before.”  “I remember Two Systems,” Uruna says, “I was five or six back then.” Only now she must have realized how close we are, how many things connect us.  I am mistaken. “So you’re Turm,” she announces her verdict. It hurts, but finally I have an answer to why she can’t trust me. “Through and through,” she twists the knife. “You ran to save yourself from the Turm, then they adopted you. Thought they were doing you a favor?”  “Maybe I am Turm,” I say, uncertain how to deal with this. To the Koohari woman I represent Turm Empire. But to the Turm, I’m still an orphan their own wars created, a mirror to the actions they tried to banish by giving me a second chance to live. “But I’m also Koohari, from Antu,” I assert, trying too late to gain control of the conversation, “and I’m here to help you. Will you trust me?”  The frown returns on her face, the distraction that was my past having ended. “What do you want me to do?” she mutters. “You said you can’t help me now.”  “I can help,” I say with confidence, clutching onto this little opening to drag myself back on top of the conversation. “Look, the Station’s in real trouble. They really want to remove from here as many of you as they can. We can ask for a second interview. Or if your application gets rejected we can always appeal. About the misunderstandings, we can justify them with memory gaps. There’s always a solution. We will keep fighting. Okay?”  She finally looks a little more convinced and promises to work with me to prepare a second interview. You assist us, translating and keeping notes, tiny red lights of worry betraying you.  Beyond Uruna, I can see an arm. I close my eyes and it’s still there.  “You can’t catch me,” I say to myself. “You’re dead.”  Luciole. What is home?  I wish I could tell you more about the rocky shores and the neranj spoon preserve, about the flocks of migratory sand-sparrows traveling the planet, chasing hot gusts of wind. I wish I could, but my memory is blown up in splinters and all I’ve told you about rocky shores and neranj spoon preserves is all reconstructed things, all an effort to remember through pictures and video footage and music. Something I decided to do on my own when I was in college and took an elective on the geopolitics and culture of the system Koohar’s in. Koohar is still a foreign land to me; a foreign land that’s running in my veins.  “Sir. They are asking you to return to Oonti.”  How could I not be grateful when they took me, an orphan refugee, to grow up as part of a middle-class Turm family? To have food and shelter and two parents. Access to education and a much-coveted Turm citizenship. My Koohar name was forgotten; I was a new person now. I walked the silver-gray streets of Oonti to my school, studied calculus and the language of the Empire. Koohar was the place where bodies were blown up by bombs. Where my mother died. Where disembodied arms could be found on the ground on your way back home from school. Where home does not exist anymore.  “You can choose to stay if you want. If you don’t, they will send someone else.”  Memory gaps are very real, Luciole. A psychologist told me once that trauma is like a giant metal ball and memory is a tiny glass one. When trauma drops onto memory, it shatters it into such tiny fragments, that days and moments get hopelessly mixed up, that your sixth birthday ends up next to the day they killed your father and you can’t tell the story differently because you don’t know how it really happened, not anymore. They say brain surgery can fix these things now. But who in their right mind would choose to bring back fragments of memories that are hidden and forgotten? Let the song of sand-sparrows wither in my memory if the whistling song of bombs might fade too.  My mother’s eyes and hands, my brother’s scraped knees, the sweet and sour taste of flower cakes and the feel of cool saltwater under my toes. I thought those memories were gone forever. Now that Koohar’s almost destroyed, they’re coming back to me—refugees themselves, fleeing.  “I think you should take this opportunity, sir. You’ve done as much as you can here.”  Could it be because I talk to you of home all the time that home keeps returning to me? Are you the one storing those memories, wrapping them into a soft cocoon of spit thread, and nurturing them into moths and butterflies?  If exiles can’t dream of home then how can they keep on living?  The wide universe around us feels colder today.  I’m meeting with Uruna at my office again. I wish there were places to take her, places to see, but Uruna is not allowed out of the camp. We’re sitting in a prison within a prison.  “What do you mean Katii is gone?” I blink at her, trying to make sense out of your translated words.  She looks embarrassed, yet her jaw is set, unrepentant, her eyes fixed somewhere beyond me where I can never see. “I couldn’t wait. The application takes such a long time . . . And C-Doctors have no medication for my child. They say they’ve run out of supplies.”  “Where is your child, Uruna?” I ask again, hoping to hear something a little less terrible than what I have in mind.  “I sent him to inner Turm,” she mutters, this time meeting my eyes. I know she will defend her choice to the end. “They won’t deny Katii treatment there.”  “How?” I insist. “Smugglers? They’re on Sandpiper?”  She nods. “They made the passport. And said it’s easier for me to get sent there later on, if Katii is there alone. Other people told me the same thing. That it’s the law and can’t be changed. This will help the application. Why didn’t you tell me?”  Her accusing question at the end leaves me stunned. Again, she’s making an enemy out of me. How could I have been so stupid, to not warn her about smugglers? “Uruna . . . no,” I try to explain. “Smugglers lie because they want your money. This is the law, yes, that families ought to reunite. But it’s not easy. It never happens. Maybe one person in thousand.”  She licks her lips, her frown deepens. She’s only starting to realize what she has done. “But it’s the law. Why don’t they apply it?”  “Because the law is vague and asks for hundreds of other things to grant you protection,” I say. By now, my words have turned into whispers. My own will has been sapped. “Don’t you get it? The law wasn’t made to bring you in. It was meant to keep you out.”  Confusion, then understanding. She knows she’s made a big mistake and I don’t wish to aggravate her guilt for leaving her sick child alone. Katii is floating somewhere among the stars. She sets her eyes on one of them, where she hopes her child might have a better life.  “I’m willing to wait,” she says, tears in her voice. “Maybe I’ll be the one in a thousand.”  I’m holding my breath. “How much did you pay?” I ask quietly.  “All I had. Not enough to go with him.” She turns to look at me again, suspicion back on her face. “Maasa said your company wants to take you back home. Will you leave us then?”  News travels fast. I haven’t decided yet. “What? Of course I won’t.” I’m not even sure I’m lying, but there’s nothing else I can say. “I will do my best, Uruna. If he reaches inner Turm safely, then we can track Katii’s whereabouts. We can even communicate. Don’t be afraid.”  At last, she sinks her cheeks into her hands. As she is weeping quietly, I recognize it—calloused joints, burned fingertips, patches of dried blood. The arm is here again. Maybe it will stay with her, leaving me in peace at last.  “Do you ever want to go back?” she asks, wiping her eyes and nose. “Not Turm. Koohar. You left too young. Almost an age with Katii.” Worry, concern. I think the distance between us has started bridging itself. Too late, but it has.  “I don’t remember much,” I admit. “But maybe.” Yes.  She shakes her head. “It’s all gone now. The land is ruined. There’s nothing left.” I keep silent; I don’t know what to say. For both of us, Koohar can only live in memories now. “I thought you were Turm and hated you. Then noticed you’re Koohar and hated you more. You look and act everything Turm. How could I trust you?”  I nod. “Right.”  “But all I want for Katii now is to live and grow up in inner Turm, somewhere nice.” She meets my eyes again, an honest shine in them—my mother’s eyes. “Like you did. Look at you. You’re doing fine.” I don’t want to ruin her illusion that I’m doing fine. She will have no hope left if I do that. “Maybe an adoptive family would be good. He will turn Turm, yes. But maybe he won’t forget his poor mother. Do you remember yours?”  Hope. With a pang I realize that my poor self that she pitied the other day, was hope to her, to her child. I survived, even as a product of a system that had tried to destroy me. Still, I survived.  “I thought I had forgotten her,” I say. “But you look so much like her.”  She nods, accepting my words. “Nell. What was your Koohar name? Do you remember?”  “I do. My mother called me Nuruli.”  “Nuruli.” Sand-sparrow. “What a fine name to remind one of home. Want me to talk to you about Antu?”  I nod. So I sit and listen to the woman with my mother’s eyes, to that generous gift she’s giving me. As she speaks I blink through the haze and the arm, for once, is nowhere to be seen. I know it still sits somewhere inside me, merged with parts of me, entirely unrecognizable now.  Luciole. Have I ever told you about the camps? About how small joys flowered in the midst of misery?  “Sir, you’re too pale. Have a seat. Drink some water.”  The air is thick with human smells and sharp with cold. My breath is crafting crystals in the air. I’m here to help, but I can barely help myself, Luciole.  “She sent Katii off,” I mutter. “I hope I won’t lose her too. She looks ready to jump ship any moment now.”  “She does look a little hard to pin down,” you say, unimpressed. “But it’s not your fault, sir. So . . . you’re staying to help her?”  “I’m staying.” I know you’re disapproving, Luciole, I know you do. Like a mother and a father, you keep hoping for me to make the decision that’s hurting me least. I change the topic quickly. “I have a gift for you,” I say. The poetry data disk was the best one I could find on Sandpiper, although a little shabby for someone so knowledgeable as you.  The explosion of colorful lights speaks to me of your joy, even as you say, cynically, “Ah. Thank you, sir. Poetry is useless, though.”  “How can you say that?”  You are already copying the disk, scanning through the text. “All poetry can do is dig graves for the things that are left unmourned.”  “And that is useless?”  I can read satisfaction coming from you. “You understand poetry then, sir.”  You pour me some tea and I can hear a faint humming as you go through the poetry passages, carefully curating your favorites. My fingers soften around the hot mug. Moments of peace amidst chaos are sometimes the only thing we can hold onto.  “Sir, I found a translation for naya, remember? Naya are blessed in Koohar.”  I shake my head. “I would be an embarrassment to my mother had she lived to see me grow up.”  “You are mistaken, sir. Naya are childless women. They help everyone, keep knowledge. They are the greatest poets ever known. It’s very rare, to be of fifth nature. You would have guided the Koohari well, back home.”  “I’m not so sure about that,” I cough. Your words strike me. There is so much I don’t know about Koohar. “Then why did Uruna call me unlucky?”  “Because you were chased out. Never had the chance to be what you would have been. Doesn’t it make sense?” Your ability to use logic so aptly is a skill I covet. You cease your scanning through the poetry data, focus all attention on me. “Maybe it’s a good idea to stay here, sir. Become naya.”  “I know nothing. I remember nothing.” The harsh reality of my words is crushing me. The feeling of helplessness has never, ever truly left me. “There’s so little I can do. I’m as trapped as everyone else.”  “You survived once,” you assert. “You already know how to do it. That’s precious data you have there.”  Is it? How did I do it? At what cost? I don’t know. Surviving becomes reflex. Uruna and Katii know it too.  Luciole, how can we go on without exile? We, who live by the ever-changing horizon fixed in our eyes, the place we always long to go but never can. We, who live by orbit alone, always at a distance and with nowhere else to go.  I close my eyes and the arm is still somewhere there. But behind it I see other shapes, lingering in their larval dreams, waiting to be born.  “Talk to me of home, Luciole.”  You blink at me, electric eyes of warm light. Something in the world is changing, flowering, as much as it’s flowering in me. “Of the home you lost, or the home you’ll build?”  “Of the place we’ll always return to.” Eleanna Castroianni is a writer, poet and oral storyteller from Greece. A cultural geographer by training, Eleanna tells stories from the margins of history and the far futures of the Anthropocene. Their written work has appeared in Clarkesworld, Strange Horizons, Beneath Ceaseless Skies, Podcastle, The Stinging Fly, and elsewhere. They live in Athens, Greece, with a growing number of string instruments.", "text": "6310 words, short story\nWithout Exile\nBut when the radiant light of the sun rose, we beheld the Aegean flowering with corpses—Aeschylus, Agamemnon\nLuciole. I dreamed I was swimming in the seas of my homeland again. My hair turned into seaweed thick with petrol; my mouth tasted like radiation and uranium. I opened my eyes—lashes threaded with sticky fish entrails—and found myself on a starboat made out of the silken carcasses of sand-sparrows. I see fingers and nacre-colored fingernails, fingertips burned to sable, spidery blood vessels twirling like ribbons on the tails of kites still riding the wind. Every time I think I have escaped that life, a tidal wave of fear rises again to engulf me.\nStar seas are full of dead bodies. We’re drowning in an ocean of floating body parts.\n“Another ship has crashed, sir.”\nYour even, soothing voice draws me out of my rapture. Luciole, you are programmed to speak the profoundest horrors in the levelest voice I’ve ever heard.\nWe’re in my office, the paper-thin walls making it barely quiet, and I turn away from the window because the view of the universe makes me, to this day, sick with nausea. “Report,” I say.\nMagenta and lime green lights syncopate on your interface. By now I am able to get a good hint of your whims and emotions even though you don’t have a human face. “Twenty-three emergency pods have reached Sandpiper Station since yesterday.”\nAnd how many more have crashed into space debris, blowing up with all their human cargo? I won’t ask; I don’t want to know.\n“Fifteen more have reached Swallow and Stork,” you go on. Civilians, militia, media, governments, both rich and poor—everyone’s complaining and asking why station AI can’t block access. They forget that life pods were only made to be picked up by nearby vessels; that they do not appear on station systems because they weren’t designed for this. No one ever thought that people would be so desperate to attempt intra-system travel in such poorly-made vessels.\n“Survivors?” I mutter. My tongue is dry; my brow sweaty. But I’ve been doing this for a while. I’m a professional. I ought to know how to keep calm.\n“About one hundred and forty,” you say. Each pod is meant to hold a maximum of five people, so they left loaded with more than ten each. Those who survived, are so, so incredibly lucky. “Expect severe health problems due to radiation, zero gravity, and poor health conditions. All survivors have taken shelter in the Flower Cemetery.”\n“More of them in the Cemetery? There’s no space left down there.”\n“That’s where they are, sir. Nowhere else they can go,” you ground me with your matter-of-factness. If you had any shoulders, you would shrug. “Shall we start? You have appointments.”\nI nod and dive into my paperwork briefly before we leave my cardboard-thin office.\nThe image of an arm won’t leave my eyes: an arm, a disembodied arm. It’s been with me for twenty years now, almost like an extra limb I’ve grown. I’ve learned to ignore its presence, along with other monsters. But today it persists and distracts me from one moment to the next.\nLuciole, my friend. When I speak to you of home, you are the only one who stays silent and expressionless, as if every image of rocky shores sinks into your circuitry, every spoonful of neranj sweet preserve travels inside your software, to burrow somewhere warm and transform into memory.\nI don’t know if it’s the parent’s eyes or the child’s that pluck something in me.\nWith you by my side I walk through the camp—a thick forest of tents, waste, and human limbs. I push aside the hanging laundry, make my way between children chasing each other, blissful in the moment. I’m wearing my padded jacket and still get shivers. The air is colder here; the station won’t waste energy to regulate temperature on the level where pod people live. It’s a small station anyway, meant to act as an in-between stop for the Turm when they travel from one side of their Empire to the other. When you’re stuck here, there’s nowhere to go. Home is hell. Here is a slightly better version of hell: one in which you die slowly, hope the only staple to sustain you.\nMy head is always misty when I’m in the camps. Memories of cold bean soup and dark brown urine mingle with the present and I’m not sure which planet I’m standing on, which day, which reality. But I’m not a child anymore. People know me and greet me—other lawyers, a few humanitarian workers, some beneficiaries. “Want me to tell you the poem of the day, sir?” you ask. Luciole, your obsession with poetry is one of a kind. I welcome it. “The shores of my homeland, how they’re full of corpses—I write this poem because I can’t leave them flowers.”\nYour words shake me out of my trance, back into this world. Every time I’m here I realize there’s so little I can do. I am only a corporate lawyer, sent to Sandpiper by my company as part of its corporate responsibility program. “Nell is from Koohar, isn’t she?” my bosses said. “She will do great at Sandpiper then.” All my papers say I’m Turm, because Turm Empire wanted so badly to forget where I come from, but whenever it’s convenient they remember my true origin.\nI could have said no to this position, really. Someone else could be handling it better than I do now—without the sickness, without the flashbacks and the fugues. And now the child is tugging at my sleeve, and the parent is staring at me with those eyes that demand something, but are too stubborn to speak up. I’m standing transfixed between them, a ghost caught between two worlds.\n“Lawyer, you’re meeting with us today,” she says in Luti, a Koohar language I can’t speak but recognize by the sing-song inflection. You translate inside my head, voice flat and smooth like a sinking sunset.\nI draw a quick confirmation as you feed me through the mini-com the few data we have for this family: names, ages, origin, dates of arrival. My company’s other lawyer had been working with them for a while, but it seems that he suddenly handed them over to me with no further explanation. Your data only state cultural reasons for the switch.\nI’ve learned by now that this is code for Koohari too difficult to deal with. “Yes,” I find myself saying, “let’s have a meeting now, shall we? I’m Nell.”\nMy impromptu office is three walls leftover medicine supplies containers, one wall micro-plastics glass that engulfs Sandpiper into its bubble, keeping breathing air inside and cosmic radiation outside. Outside, where the wide, wild space looms, full of stars, debris, and human-made vessels. Among them float dead bodies, thousands of them, but they are too small to see with naked eye. They will merge with the space debris, dissipate into the merciless void of the universe. No trace. Back to stardust.\nWe sit on the floor. “Uruna,” I read the parent’s name from the notes you’re feeding me. My data doesn’t say and I’m quite bad myself at discerning it, so I have to ask: “Gender?”\n“Soom,” she replies calmly, then points at her child. “Katii is nutu.”\nI nod and wonder how much of this will the asylum officers care to understand this time—Koohar genders are completely incomprehensible to them. For lack of better terms, soom means child-rearing female; nutu means child-bearing male. For the Turm Empire, this distinction makes no sense. They neither have the language to accommodate it nor do they care to do that.\n“My child is ill,” Uruna says before I can ask anything else. It is the only thing she has in mind now and rightfully so. Survivors of pods often arrive as bundles of star-travel disease. Nothing of it is infectious, yet still it’s too easy to brand them as ‘pod people,’ as dehumanized health hazards. “They won’t give me any medicine. They told me that only in Turm system they can fix him.”\nLittle Katii is no more than eight. I can already see the sagging skin, devoid of luminosity, the thinning hair falling off in patches. Radiation has poisoned him, but it’s not his illness that makes me think that something about him is uneasy and familiar, like looking into a mirror that distorts your image only slightly. His red-rimmed eyes won’t leave mine. Katii is a silent one, but he has a fire burning inside.\n“You can’t travel further in yet,” I say. You momentarily distract me by folding a piece of reusable paper with your small, metallic, three-joint hands. “I’m here to help you with your asylum application. With refugee status, you and your child can be sent to inner Turm system. And from there somewhere more permanent. Okay?”\nShe has heard all this before, yet something about her looks unconvinced. She’s wary; the experience with the previous lawyer could not have been very good. Still, she nods. By now you have finished folding and you hand a small, elegant paper-bird to Katii. “Sand-sparrow,” he says and his eyes light up. The color is unmistakably that of the desert, the golden-purple plumage of sand-sparrows. He shows it to his mother, who smiles sweetly back at him. They both look more relaxed and I’m thankful you are so good at this sort of thing, Luciole. As I go through my paperwork, Uruna strokes Katii’s thinning hair. She mutters a lullaby and your mellow lights join them in their sleepiness. I’d rather not have the child with us as we do the interview preparation, but he is sleeping so peacefully I can’t bring myself to separate them just now.\nI choose my approach carefully. Whatever trauma she is carrying with her, it is impossible to not relive during our talk. But I want to soften the impact, to make sure I know what really happened so I can help her. After a few questions on her origin, I ask, “Tell me, Uruna, why did you leave?”\n“Everything collapsed.” She’s staring at the darkness of the galaxy outside. Her voice is small and distant, as if coming from a faraway ocean. “The world collapsed.” She turns to look at me.\nUruna’s eyes are the color of my mother’s eyes.\nI shake the memory from me, quickly, violently. I can’t afford to deal with this now. I will return to pick it up later.\nI cough.\nKoohar’s biggest problem is its ecological disaster, one that’s been going on for years and years after decades of catastrophic wars. Water now covers four fifths of the planet and animals are near-extinct. Yet such disasters are never reason enough to give asylum to people fleeing from them, because that would mean accepting everyone and not only a select few. Somehow you’re expected to stay on a planet that’s trying to kill you.\n“I know this,” I say, “but it won’t get you refugee status. We have to think through what you will say in your interview. Truthful things, but carefully laid out. What about the war?”\n“The Haz ruined everything,” she answers vaguely, as expected. Eyes wander again, as if we’re at school and I’m the persistent teacher and all Uruna wants is to play outside. I’ll have to lay the architecture of my questions carefully, like a funnel. Start from the bigger and narrow it down to the miniscule.\n“Are there any instances of fear for your lives from the Haz? Things that happened to your extended family, perhaps, and which you can tell the officer?” Everyone has someone like that. I know I did.\nShe thinks for a moment, then answers, “Yes,” letting unsaid words linger on her lips. Finally, she starts to speak.\nIt’s not a linear narrative. She jumps from one thing to the next, from one day five years ago to what happened last week. You are transcribing everything and I trust your software to sort out a few things for me. Uruna surprises me by starting from the shores of Antu—from my hometown. Turns out she was an immigrant there, working to gather and dry kelp, when she got caught up in the conflict with the Haz. She speaks of her birth-mother’s family and of her neighbors, and of Katii’s birth-father and his other raising-mother too. “Then a bomb exploded,” she says. “Torn them both to pieces. We only found an arm.”\nI close my eyes; the image of the arm comes back to me, intrudes my thoughts.\nUruna is calm, much calmer than I am, and other lawyers would be shocked at how she can recite such horrors and carry that taciturn half-smile; at how she can still speak of her home fondly, even after all the things that happened to her there. I only know I’m not surprised at all: sympathy is for the privileged. Pity would be no more, you said once in the words of an old poet, if we did not make somebody poor.\nAgain, I push the image of the arm away. I try to hold on as myself is slipping away from me.\nYou hand me a glass of water at the right moment, then offer some to Uruna. I gently ask her to repeat parts of this story, to establish the relations between her relatives and make the timeline as clear as possible without exhausting or vexing her. “These stories are what you need to get your application accepted,” I tell her when we’re done. The arm is here with me again. It hasn’t left. It never leaves. “Tell them as you told me. If they ask you to repeat them, don’t change them. Don’t give them reasons to doubt you’re telling the truth.”\nUruna frowns, arched, thick eyebrows conferring in annoyance. Her voice rises and shakes, as if all pent-up emotion was to be channeled in this answer alone. “Doubt what? We climbed on a crumbling pod to get here. We left our homes. You think we wanted that? Why would we lie?”\nHer indignant inflection is so different from your flat translation. Her anger is a real piece of work: everyone comes to me scared, ready to blurt out any lie that will grant them passage out of this in-between purgatory. But Uruna is enraged.\n“You are right,” I tell her and drink more water. It flows cold down my throat and does nothing to quench my thirst. “But this is how the procedure goes. They’re trying to trim the edges and grant asylum only to the most vulnerable ones. You are a parent with a child—a sick one too—and your stories from home justify your fear. If all goes well in your interview, there won’t be a problem.”\nUruna’s suspicious look makes me think she doesn’t completely trust me. I don’t know what else to do. My head is empty by now; my palms itch and sting. The room has started darkening and my breath is not enough.\n“Lawyer, are you alright?” Uruna asks in concern.\n“Sir, your vitals indicate need for rest and medication.”\n“Yes, Luciole.” I meet Uruna’s eyes one last time—my mother’s eyes. “I am sorry. I have to rest. You will have to meet with our psychologist now. I can arrange more meetings with another lawyer, but I hope you feel more confident in your interview?”\n“Of course,” she says quickly, hiding—unsuccessfully—a generous portion of self-doubt. She strokes Katii’s hair one last time, meets my eyes with a hint of worry. She thanks me, then gently picks him up in her arms and leaves.\n“Sir,” you say once I’ve lied down on the floor. The tranquilizer works fast and I’m sinking in the numbness. “That young human looked a lot like you. The smaller one, I mean.”\nI laugh, my laughter turning into a cough. Luciole. All the things I try not to notice, to hide from myself. You pick them up and hurl them right back at me. “Cheeky, Luciole. That’s why I chose you.”\nThe single red light on your interface indicates pleasure. “I know.”\nThe arm and I have a long history, Luciole.\nBack then, it was a woman’s arm. Soom, I think, because the long, calloused fingers looked like my raising-mother’s who worked the fields daily. I can’t recall my mother’s face, but the image and texture of her fingers have always stayed with me. How they wrapped around the crocus-colored tunics she wore, how she folded them around my nettle-and-hemp dress.\nI thought I had forgotten my mother’s eyes but Uruna had the exact same hue in her pupils. It was like looking straight into my mother’s face.\nTonight, nightmares wake me up many times. Something has been suffocating me. You play soothing sounds of bird chirrups and running river water for me.\n“Sir, why did you come to Sandpiper?” you surprise me. Again, this is a question outside your protocol. This is you, the personality that is Luciole, the office bot, speaking.\n“My company sent me,” I tell you something you already know and we are both aware I’m trying to avoid an honest answer. In the darkness, only a small white light comes from you, tracing the contours of my bed frame and duvet.\n“Maybe they ought to send you back,” you say, ruthless. “Your flashbacks are causing you too much stress.”\nAh, Luciole. Your care is something I won’t forget, ever. You’d be excellent in this job on your own.\n“You know I won’t leave.”\nPause. The white light is flickering like a distant star. “I know, sir. But you’re not the right person for this.”\n“Who is then?”\nYou stay silent. You and I both know that the only people who can do this right, are all the wrong people.\n“You changed your statement? Why?”\nUruna is excessively stubborn today, arms crossed over her chest, eyeing me with my mother’s eyes as if I’ve done some unspeakable evil. I don’t know what went wrong between us. Since that first day she never trusted me completely, never allowed me to help her.\nWhen she does not reply, I try to explain as calmly as I can. “I told you it was very important to not retract anything. When we first met, I reassured you that with history such as yours, I can get you out of here. Yet you changed statements.”\n“What do you want me to do now?” she bursts. “It is what it is!”\nI understand she’s more embarrassed and angry at herself than she is at me. She feels alone in this, but truth is, she’s not—it’s terribly easy for the applicants to get confused during the long interviews. The rules are strict. One fake-sounding statement and you’re all done.\nKatii isn’t with us—a friend is looking after him because he’s feeling too weak today. And I can tell Uruna is anxious to return to the child, always turning her head towards the sounds and voices coming from the camp.\n“You are right,” I admit. It’s no use to keep this conversation going. My own guilt engulfs me: I was too ill to help her prepare. I didn’t even join her at the interview. “It is what it is. I should have done my job better.”\nAt my sharing of responsibility, Uruna loosens up. Her stubborn mask gives way into genuine distress and disappointment. Tears fill her eyes, but they’re tears of anger. I remember angry tears. I used to cry of anger too. “I told them many times over! How Katii has four parents, and so does everyone.” She’s making fists, spitting the words like fire. “They thought I was lying! Making up things about my parents and relatives. Because I said father and mother several times and they couldn’t figure out who was who!”\nExactly as I feared. Even though we rehearsed many times and made sure to clarify who did what, even though there are so many asylum seekers from Koohar right now, to Turm ears it all sounds like a hopelessly tangled ball of yarn. Even the most cooperative of the asylum officers, those who will patiently ask clarifications on who is who, might eventually find the account flawed and unconvincing.\nAlthough it’s hard, it’s not impossible to clear up this mess. The law allows us to ask for a second audience due to malpractice.\nThen Uruna surprises me, catching me off guard. “You don’t look like Turm. You look more like us.”\nWhile I was lost in my own thoughts she had been examining my face. We have the same sandy skin, the same wild curls, the same arched eyebrows. But I dye my hair and keep it sleek, pluck my eyebrows and hide my complexion under makeup. “Can you tell?” I laugh.\nShe points at my ears. No one ever wondered if there was anything wrong with my ears. But Uruna sees something others can’t see. “Only esom have this ear-shape,” she says.\nEsom. Child-bearing female. What I would have been. “I am esom,” I admit, a knowledge I took with me from Koohar. I was nine when I left, and the miniscule changes that split the two genders into four start at eight. “But for the Turm, it doesn’t matter. I’m just a woman.”\n“Woman,” Uruna says, pondering the word. “Maybe it’s better to be just woman.” In my notes fed through the mini-com, I see you have translated the Luti word for girl. Woman does not exist on Koohar. “What does it mean for adults?” she asks, trying to understand people who stay a dyad and don’t transform a second time. Suddenly, it is Uruna who’s interviewing me and it’s uneasy. This is one way applicants try to gain more control, even to manipulate. I should stay on top of this, yet I want to answer. I’ve never talked about being esom with anyone after I left.\n“It means both potential child-bearer and raiser. Both soom and esom,” I explain. “The Turm think that when you have children, you raise them too.”\nShe laughs, but her laugh is tinged with disgust. “That’s ridiculous!”\nI shrug. “It’s okay. I won’t have children. I can’t.” I’m not sure if I was born like this or if my infertility is the aftermath of several things I’ve been through during those days I wandered as a child around camps, loosely guarded camps, horrendously chaotic camps. The fate of loneliness this knowledge has sealed for me is something I do not think about.\nUruna’s eyes widen. “Naya!” she says, but you won’t translate this word. I check your translation notes from Luti language and they look empty: the entry is missing. Another Koohar thing too complex to translate? “Sir, I’m looking this up,” you whisper in my head.\nHer face softens, in distant sadness and a tiny bit of understanding. “You’re so unlucky,” she tells me and embarrassment consumes me. In Koohar, where people take so much pride in looking after the next generation whichever way they can, I’m a child-bearer who’s infertile—what else could I receive except pity? Our little talk is getting dangerously out of hand. Then she asks what I’ve been fearing all along: “How did you end up in Turm?”\nBy now I know there’s no way out of this. But maybe if I talk about myself she will start trusting me. Maybe it’s the right moment to take her on my side. “I was a refugee in the Two Systems War. Grew up in camps around the solar system. When I was eleven, a Turm family adopted me. I don’t remember much of my life before.”\n“I remember Two Systems,” Uruna says, “I was five or six back then.” Only now she must have realized how close we are, how many things connect us.\nI am mistaken. “So you’re Turm,” she announces her verdict. It hurts, but finally I have an answer to why she can’t trust me. “Through and through,” she twists the knife. “You ran to save yourself from the Turm, then they adopted you. Thought they were doing you a favor?”\n“Maybe I am Turm,” I say, uncertain how to deal with this. To the Koohari woman I represent Turm Empire. But to the Turm, I’m still an orphan their own wars created, a mirror to the actions they tried to banish by giving me a second chance to live. “But I’m also Koohari, from Antu,” I assert, trying too late to gain control of the conversation, “and I’m here to help you. Will you trust me?”\nThe frown returns on her face, the distraction that was my past having ended. “What do you want me to do?” she mutters. “You said you can’t help me now.”\n“I can help,” I say with confidence, clutching onto this little opening to drag myself back on top of the conversation. “Look, the Station’s in real trouble. They really want to remove from here as many of you as they can. We can ask for a second interview. Or if your application gets rejected we can always appeal. About the misunderstandings, we can justify them with memory gaps. There’s always a solution. We will keep fighting. Okay?”\nShe finally looks a little more convinced and promises to work with me to prepare a second interview. You assist us, translating and keeping notes, tiny red lights of worry betraying you.\nBeyond Uruna, I can see an arm. I close my eyes and it’s still there.\n“You can’t catch me,” I say to myself. “You’re dead.”\nLuciole. What is home?\nI wish I could tell you more about the rocky shores and the neranj spoon preserve, about the flocks of migratory sand-sparrows traveling the planet, chasing hot gusts of wind. I wish I could, but my memory is blown up in splinters and all I’ve told you about rocky shores and neranj spoon preserves is all reconstructed things, all an effort to remember through pictures and video footage and music. Something I decided to do on my own when I was in college and took an elective on the geopolitics and culture of the system Koohar’s in. Koohar is still a foreign land to me; a foreign land that’s running in my veins.\n“Sir. They are asking you to return to Oonti.”\nHow could I not be grateful when they took me, an orphan refugee, to grow up as part of a middle-class Turm family? To have food and shelter and two parents. Access to education and a much-coveted Turm citizenship. My Koohar name was forgotten; I was a new person now. I walked the silver-gray streets of Oonti to my school, studied calculus and the language of the Empire. Koohar was the place where bodies were blown up by bombs. Where my mother died. Where disembodied arms could be found on the ground on your way back home from school. Where home does not exist anymore.\n“You can choose to stay if you want. If you don’t, they will send someone else.”\nMemory gaps are very real, Luciole. A psychologist told me once that trauma is like a giant metal ball and memory is a tiny glass one. When trauma drops onto memory, it shatters it into such tiny fragments, that days and moments get hopelessly mixed up, that your sixth birthday ends up next to the day they killed your father and you can’t tell the story differently because you don’t know how it really happened, not anymore. They say brain surgery can fix these things now. But who in their right mind would choose to bring back fragments of memories that are hidden and forgotten? Let the song of sand-sparrows wither in my memory if the whistling song of bombs might fade too.\nMy mother’s eyes and hands, my brother’s scraped knees, the sweet and sour taste of flower cakes and the feel of cool saltwater under my toes. I thought those memories were gone forever. Now that Koohar’s almost destroyed, they’re coming back to me—refugees themselves, fleeing.\n“I think you should take this opportunity, sir. You’ve done as much as you can here.”\nCould it be because I talk to you of home all the time that home keeps returning to me? Are you the one storing those memories, wrapping them into a soft cocoon of spit thread, and nurturing them into moths and butterflies?\nIf exiles can’t dream of home then how can they keep on living?\nThe wide universe around us feels colder today.\nI’m meeting with Uruna at my office again. I wish there were places to take her, places to see, but Uruna is not allowed out of the camp. We’re sitting in a prison within a prison.\n“What do you mean Katii is gone?” I blink at her, trying to make sense out of your translated words.\nShe looks embarrassed, yet her jaw is set, unrepentant, her eyes fixed somewhere beyond me where I can never see. “I couldn’t wait. The application takes such a long time . . . And C-Doctors have no medication for my child. They say they’ve run out of supplies.”\n“Where is your child, Uruna?” I ask again, hoping to hear something a little less terrible than what I have in mind.\n“I sent him to inner Turm,” she mutters, this time meeting my eyes. I know she will defend her choice to the end. “They won’t deny Katii treatment there.”\n“How?” I insist. “Smugglers? They’re on Sandpiper?”\nShe nods. “They made the passport. And said it’s easier for me to get sent there later on, if Katii is there alone. Other people told me the same thing. That it’s the law and can’t be changed. This will help the application. Why didn’t you tell me?”\nHer accusing question at the end leaves me stunned. Again, she’s making an enemy out of me. How could I have been so stupid, to not warn her about smugglers? “Uruna . . . no,” I try to explain. “Smugglers lie because they want your money. This is the law, yes, that families ought to reunite. But it’s not easy. It never happens. Maybe one person in thousand.”\nShe licks her lips, her frown deepens. She’s only starting to realize what she has done. “But it’s the law. Why don’t they apply it?”\n“Because the law is vague and asks for hundreds of other things to grant you protection,” I say. By now, my words have turned into whispers. My own will has been sapped. “Don’t you get it? The law wasn’t made to bring you in. It was meant to keep you out.”\nConfusion, then understanding. She knows she’s made a big mistake and I don’t wish to aggravate her guilt for leaving her sick child alone. Katii is floating somewhere among the stars. She sets her eyes on one of them, where she hopes her child might have a better life.\n“I’m willing to wait,” she says, tears in her voice. “Maybe I’ll be the one in a thousand.”\nI’m holding my breath. “How much did you pay?” I ask quietly.\n“All I had. Not enough to go with him.” She turns to look at me again, suspicion back on her face. “Maasa said your company wants to take you back home. Will you leave us then?”\nNews travels fast. I haven’t decided yet. “What? Of course I won’t.” I’m not even sure I’m lying, but there’s nothing else I can say. “I will do my best, Uruna. If he reaches inner Turm safely, then we can track Katii’s whereabouts. We can even communicate. Don’t be afraid.”\nAt last, she sinks her cheeks into her hands. As she is weeping quietly, I recognize it—calloused joints, burned fingertips, patches of dried blood. The arm is here again. Maybe it will stay with her, leaving me in peace at last.\n“Do you ever want to go back?” she asks, wiping her eyes and nose. “Not Turm. Koohar. You left too young. Almost an age with Katii.” Worry, concern. I think the distance between us has started bridging itself. Too late, but it has.\n“I don’t remember much,” I admit. “But maybe.” Yes.\nShe shakes her head. “It’s all gone now. The land is ruined. There’s nothing left.” I keep silent; I don’t know what to say. For both of us, Koohar can only live in memories now. “I thought you were Turm and hated you. Then noticed you’re Koohar and hated you more. You look and act everything Turm. How could I trust you?”\nI nod. “Right.”\n“But all I want for Katii now is to live and grow up in inner Turm, somewhere nice.” She meets my eyes again, an honest shine in them—my mother’s eyes. “Like you did. Look at you. You’re doing fine.” I don’t want to ruin her illusion that I’m doing fine. She will have no hope left if I do that. “Maybe an adoptive family would be good. He will turn Turm, yes. But maybe he won’t forget his poor mother. Do you remember yours?”\nHope. With a pang I realize that my poor self that she pitied the other day, was hope to her, to her child. I survived, even as a product of a system that had tried to destroy me. Still, I survived.\n“I thought I had forgotten her,” I say. “But you look so much like her.”\nShe nods, accepting my words. “Nell. What was your Koohar name? Do you remember?”\n“I do. My mother called me Nuruli.”\n“Nuruli.” Sand-sparrow. “What a fine name to remind one of home. Want me to talk to you about Antu?”\nI nod. So I sit and listen to the woman with my mother’s eyes, to that generous gift she’s giving me. As she speaks I blink through the haze and the arm, for once, is nowhere to be seen. I know it still sits somewhere inside me, merged with parts of me, entirely unrecognizable now.\nLuciole. Have I ever told you about the camps? About how small joys flowered in the midst of misery?\n“Sir, you’re too pale. Have a seat. Drink some water.”\nThe air is thick with human smells and sharp with cold. My breath is crafting crystals in the air. I’m here to help, but I can barely help myself, Luciole.\n“She sent Katii off,” I mutter. “I hope I won’t lose her too. She looks ready to jump ship any moment now.”\n“She does look a little hard to pin down,” you say, unimpressed. “But it’s not your fault, sir. So . . . you’re staying to help her?”\n“I’m staying.” I know you’re disapproving, Luciole, I know you do. Like a mother and a father, you keep hoping for me to make the decision that’s hurting me least. I change the topic quickly. “I have a gift for you,” I say. The poetry data disk was the best one I could find on Sandpiper, although a little shabby for someone so knowledgeable as you.\nThe explosion of colorful lights speaks to me of your joy, even as you say, cynically, “Ah. Thank you, sir. Poetry is useless, though.”\n“How can you say that?”\nYou are already copying the disk, scanning through the text. “All poetry can do is dig graves for the things that are left unmourned.”\n“And that is useless?”\nI can read satisfaction coming from you. “You understand poetry then, sir.”\nYou pour me some tea and I can hear a faint humming as you go through the poetry passages, carefully curating your favorites. My fingers soften around the hot mug. Moments of peace amidst chaos are sometimes the only thing we can hold onto.\n“Sir, I found a translation for naya, remember? Naya are blessed in Koohar.”\nI shake my head. “I would be an embarrassment to my mother had she lived to see me grow up.”\n“You are mistaken, sir. Naya are childless women. They help everyone, keep knowledge. They are the greatest poets ever known. It’s very rare, to be of fifth nature. You would have guided the Koohari well, back home.”\n“I’m not so sure about that,” I cough. Your words strike me. There is so much I don’t know about Koohar. “Then why did Uruna call me unlucky?”\n“Because you were chased out. Never had the chance to be what you would have been. Doesn’t it make sense?” Your ability to use logic so aptly is a skill I covet. You cease your scanning through the poetry data, focus all attention on me. “Maybe it’s a good idea to stay here, sir. Become naya.”\n“I know nothing. I remember nothing.” The harsh reality of my words is crushing me. The feeling of helplessness has never, ever truly left me. “There’s so little I can do. I’m as trapped as everyone else.”\n“You survived once,” you assert. “You already know how to do it. That’s precious data you have there.”\nIs it? How did I do it? At what cost? I don’t know. Surviving becomes reflex. Uruna and Katii know it too.\nLuciole, how can we go on without exile? We, who live by the ever-changing horizon fixed in our eyes, the place we always long to go but never can. We, who live by orbit alone, always at a distance and with nowhere else to go.\nI close my eyes and the arm is still somewhere there. But behind it I see other shapes, lingering in their larval dreams, waiting to be born.\n“Talk to me of home, Luciole.”\nYou blink at me, electric eyes of warm light. Something in the world is changing, flowering, as much as it’s flowering in me. “Of the home you lost, or the home you’ll build?”\n“Of the place we’ll always return to.”\nEleanna Castroianni is a writer, poet and oral storyteller from Greece. A cultural geographer by training, Eleanna tells stories from the margins of history and the far futures of the Anthropocene. Their written work has appeared in Clarkesworld, Strange Horizons, Beneath Ceaseless Skies, Podcastle, The Stinging Fly, and elsewhere. They live in Athens, Greece, with a growing number of string instruments.", "source": "https://clarkesworldmagazine.com/castroianni_04_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Without Exile by Eleanna Castroianni"}