{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Beston Barnett", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yRLmOJfIbiaLdAiFWJFHoj/1NEU=", "id": null, "license": null, "comments": "", "raw_text": "4490 words, short story  Entangled  1 <air> I am lonely on Earth.  As with many of my emotions, I cannot be certain whether this loneliness is a result of Earth socialization or genuine inborn experience. But I do pine for a companion. Not sexual intercourse though, I cannot pretend an interest in that. I could have something to mimic erogenous zones rigged to my xuit, but surely that would be disingenuous to my partner? Sex is meant to be a sharing of heightened intimacy. I would not wish to mislead.  No, with my partner I wish to be honest in all things. And is that Earth socialization as well—the wish for depth and honesty in a relationship—or is it something I bring with me? Again, I cannot be certain.  Luckily, there are a number of dating sites for people like me, who, either because of disability or disinclination, are seeking a partner without sexual obligations. There are even some with a variety of gender labels. “Non-binary” is accurate. It is still too early in the process of Earth’s inclusion into the Intergalactic Cooperative to expect these sites to have a box labelled “transhuman.”  I put that information under “Interests/Hobbies.”  2 <air> Aliquah, a woman with whom I had a relationship for about six months, once described a dream she had about us:  “We were lying on a wide meadow of beautiful green grass, the two of us, like kids making snow angels without snow. Our arms were outstretched and our fingers barely touched. A lovely breeze ruffled the grass.  “I heard a disturbing sound. A thumping but also a fluttering: flutter/thump/flutter . . . flutter/thump/flutter . . . I looked over at you, but instead of your xuit, you were wearing an old sci-fi robot, with a big steel boiler for a torso and vacuum tubes for eyes. You were large and somewhat rusty, like a submarine beached on the meadow. The flutter/thump/flutter was coming from inside you. I was able to climb rungs up your side and open a hatch in your chest. Inside, in the dark of your hull, a robin fluttered from wall to wall.”  It did not work out between me and Aliquah—she says I rekindled the desire for human touch that she thought she had lost—but I am grateful to her for this image of myself.  3 <ground> The stages of inclusion into the Intergalactic Cooperative:  \r\n    Contact  Language Sharing  Information Sharing  Tourism/Exploration  Citizenship  I represent the leading edge of the fifth stage: the first alien of any species to be naturalized as a citizen of planet Earth. Earth’s governing councils had to construct an entirely new system of laws to account for me, though in this they were guided by a thousand worlds’ precedents. In the eyes of the IGC, I bring honor to both my origin planet and my adopted. I represent a strengthening of ties and a leap of faith.  Most of the speech I made at my naturalization ceremony consisted of platitudes like these, written for me by diplomats of both species, but I included some thoughts of my own:  “Humans and Len share many traits, but one holds a special personal interest. In our deepest selves, both species yearn for a sense of belonging. I hope to find that belonging in the commonwealth of Earth, as Human and as Len.”  I spoke those words, broadcast across many worlds, when I was only two years old (though of course Len minds do not mature as humans’ do, but are hatched fully functioning). Thirty years later, I am less optimistic. Luck plays such an intimidating role in finding community or companionship; each day alone must be faced anew; hope must be kindled against hope.  And this feeling too could be socialization, for do humans not already have the types of the lonesome poet-lover, the pining old maid, the stranger seeking acceptance in a strange land?  4 <air> I dated an actor for a time, somewhat past his prime but nonetheless a celebrated leading man and auteur, handsome and creative and bored with sexual pursuits. Neither of us publicized our relationship—I am thankful for that—and anyway we were not exclusive.  When he touched me, he liked to imagine he was stroking the neck of a swan in a distant galaxy. “My lonesome swan,” he would call me. I was on my third xuit at the time, one that had receptors (pleasure-producing but nonsexual) in long silken strips down my neck and shoulders. The romantic possibilities fascinated him. For myself, I was drawn to the fierceness of his creativity, his ability to give himself so completely to the role. For many years, I thought this was my goal as well: to commit wholly to the role of being human.  But by the time he broke off our relationship, I had come to find his intensity overwhelming. Humans expect their relationships—with groups and with mates—to be messy, stormy, and marked by a push-and-pull that they feel unnatural without.  The Len in me desires a more nuanced kind of belonging.  5 <ground> The Len bear little phenotypic resemblance to swans, though we are white in color—at least in the spectrum visible to humans—and we fly. Humans make these analogies instinctively: the Slikovk are lobsters, the Ulmians are big amoebas, the Len are swans. What seem feathers to Earth eyes are biologically more akin to fine interwoven tendrils of silk.  Like the majority of the intelligent species so far encountered by the IGC, the Len carry our sentience outside our bodies. Earth species are rare in supporting such delicate quantum phenomena in the dangerous electrical switchboards of their brains, and this explains why they have had a more difficult time adjusting to exploration in xuits. For the Len, “consciousness” is gathered just along the trailing edge of our silken wings.  For most of our precontact history, the Len believed that, when flying, the wind through our mind-wings caused our sense of self to loosen or purify somehow, and only in the light of later scientific study did this conviction prove to be merely poetical. However, the dichotomy of a flight state and a ground state runs deep in Len linguistics. Every sentence contains two, an air component and a ground component, and the dissonance between them provides an additional layer of meaning, as a hand gesture or an emoji might.  <ground> The robot’s chest is empty.  <air> The robin flies in the robot’s chest.  In this example—which I have sometimes used in my Len class—there is an interesting dissonance: the robot is “empty,” yet it contains a robin. The emptiness is in the ground state, which suggests it is ongoing, whereas the robin appears in the flight state, which suggests impermanence. To the Len, this is a single thought, or rather, every thought has this dual nature. Even long passages of Len technical writing, free of poetic content and given entirely in <ground>, imply an accompanying <air> component, which translates roughly as:  <air> It may be so.  Of course, I learned it as a second language, the same as any other human who speaks Len. But it is assumed that, because of my Len nature, I have a facility with the language that other humans lack. Whether this is true or not, teaching at the Len Institute has proved an important part of my career. I am said to have a unique perspective: both outsider and insider.  But I have never flown, never felt the thin air of Lennaia stream through my wings, never banked and soared with a flock of my own. I carry my mind-wings within me, galaxies away.  6 <ground> Faster-than-light travel is prohibitively impractical.  Data, however, can travel not only faster-than-light, but instantaneously. It is a question of identifying long-lost twins: elementary particles, separated in those first few moments after the Big Bang, but still in an entangled state. Once a species has the technology to identify them, these entangled twins are everywhere. Tweaking one tweaks the other, no matter how impossibly distant.  Almost anything can travel as data: images, poetry, schematics, code to run on a 3-D printer. Theoretically, every molecule of a body can be scanned and recreated. Theoretically, the electrical state of every neuron in a brain can be scanned and recreated. But what cannot be scanned or recreated is consciousness, because the essential trait of consciousness—its unpredictability, its free will—arises from quantum phenomena. And quantum phenomena are governed by the uncertainty principle: they can never be perfectly mapped.  Thus, a species from one galaxy can communicate with a species in another, can pass technology, can suggest things or even bodies which can be built. But we cannot go to one another, we cannot touch, and we certainly cannot conquer.  To get anything done between the galaxies, we must cooperate.  7 <air> Though I did not require nursing or caring in the way that other children do, I was assigned a human mother and father on first hatching. It was thought by both species that this would enhance my socialization. Doctors Anne and Joachim Stoltzfus-Veloso were both researchers at the Len Institute; I am their only child.  Anne is retired, though she still keeps an office at the Institute. I see her once a week for dinner.  Joachim passed away last year. His death has affected me more than I anticipated. A painful series of thoughts keep circling back on me without resolution. I cannot rid myself of the conviction that, with my disinterest in diplomacy and what must have seemed to him a morbid obsession with human romance, I have let my father down. He was a man to live up to: idealistic, curious about the universe, and stubborn as a terrier when he had his teeth in a project. I loved him very much.  “He loved you too,” says my mother, sitting in her room at the assisted-care facility into which she has recently moved.  “He expected more from me.”  I am uncomfortable in her new room. Everything is unfamiliar; even our family photos look changed in this lessened space. “Why should his disappointment haunt me? Len do not form this kind of parental bond.”  “They bond. They grieve. What does it matter what the Len do? Will you feel more authentic or less real? You’ve lost your father. I’ve lost my husband . . . Shush, now, I miss him too.”  8 <ground> I have Len parents as well. A parental group of anywhere from two to forty-eight can make an egg, carefully apportioning favored elements of genetic material among them. I was made by a large civic-minded flock specifically to be an Earth citizen. This rational approach to reproduction has allowed the Len to repeatedly supply candidates for citizenship on other planets well before many of the IGC’s more conservative member species.  Still, I cannot help but find the Len’s reproductive process impersonal and my biological parents uncomforting.  I miss my human father and do not know if I honor him.  9 <ground> A xuit is any remotely controlled body, be it biological or mechanical or hybrid. The xuit receives real-time motor control and transmits real-time sensory information. What sensory information the xuit may collect depends on the operator’s species, though electromagnetic wave detection and chemical analysis (sight and smell in humans) are nearly ubiquitous across the member species.  When a fallow intelligence like the Earth’s enters the stage of Tourism/Exploration, the first xuits cooperatively produced are usually small flying drones. The co-production begins one-for-one: one drone produced on Ulmlt for a human operator on Earth, one drone produced on Earth for an Ulmian operator on Ulmlt. (This is not simply an example; Ulmians were the first to get xuits on the ground on Earth.)  As the absorption of alien technology increases, so does the quality and flexibility of xuits adapted to the new environment. Operators from distant galaxies can integrate more directly with their xuits: they may choose to have all the stimuli from their birth-bodies nullified so that they can focus on their xuits completely. In a fully integrated xuit, the operator’s mind is technically at an impassable distance, but everything feels present and instantaneous.  So when I experience grief or love or loneliness, these emotions are technically being experienced on Lennaia, lighteons away. Yet the stimuli that produced them and the people I share them with are all here on Earth. When I grieve for my father, is the grief doubled or is it somehow thinned by all that distance? A very Len thought.  <ground> A distant fledgling grieves the death of a parent.  <air> Grief is an entangled state.  10 <air> I meet Kwase on RomanceOnly.com. He is an older man, a xuit engineer based in Luanda. Kwase lost his legs to a land mine, though in his profile he writes that he considered himself asexual even before the accident. He is an enthusiastic correspondent, a shameless gourmand, and an avid tourist—on other worlds and on this one. We have been writing back and forth for several months when he invites me to join him on a food tour in Malaysia. “We’ll split the distance,” he writes. That is the kind of impulsive man he is. Most of my first dates have been over cautious cups of coffee; Kwase is suggesting a week’s worth of laksa, coconut rice, and salted egg crab.  I have recently upgraded to a new xuit, my fourth. It takes trial-and-error to match the sensory input of one world to the brain stimuli of a species evolved on another. Salty, spicy, creamy, tangy—what do these qualities mean to a Len body? But my new xuit has significant improvements, and I am tasting Earth foods in a way I never have before.  Not that my xuit needs to eat, but neither do humans, half the time.  Kuala Lumpur is a revelation. Malay, Indian, Chinese, and xuits from a dozen different species, the hurly-burly of the intergalactic community come to Earth, everyone crowded together, curious, ambitious, dreaming. Everyone hungry! After we work out that Kwase does not mind being carried and that I enjoy carrying him, we have a successful week together. I feel taken out of myself.  “What are you truly hoping to find in a partner?” he messages me when I am back in Toronto. “I had a wonderful trip with you, but I won’t live forever. I do not wish to waste your time or my own. Now you’ve met me, what do you think?”  I do not know how to respond. It is among the strange qualities of loneliness that you feel there is something missing, but you cannot precisely identify what is missing or why it matters. Fear of dying is tied up in loneliness as well—I have felt this since losing my father—and fear of dying alone, most of all. Kwase thinks of me as strong and young, but he is thinking of the xuit. I will lose motor control eventually. My senses will dim. Len life span is shorter than human: at our ages, either Kwase or I could go first.  I do know that I have felt less alone since meeting him. But where Kwase is impulsive and sincere, I am more circumspect. He would call me coy. I reply to him in Len.  <ground> I only know that I would like to see you again.  <air> My knowing has wings.  11 <ground> Aliens are increasingly common on Earth, but I am still the only naturalized citizen.  The others are technically explorers or tourists, though they may perform functions beyond what those labels imply. But they all enter and leave their xuits at will; they are all essentially embodied on their home worlds. A citizen, in the IGC’s terminology, is someone who is born into their xuit, without having first known their homeworld. On the older worlds, there are colonies of citizens naturalized from all over the universe.  I was hatched on Lennaia, directly into a web of sensors which connected me to my first xuit, already prepared for me at the Len Institute on Earth. My first imprints were my human mother and father. My first language was English. The first light from which my xuit drew power came from Earth’s sun. I had to be taught that my actual body was elsewhere; that I was, in some sense, not who I was.  There is a reason that after thirty years I am still Earth’s only naturalized citizen. Tourism and exploration may be costly, they may require generations of cooperation and technical advance, but they are easy, emotionally. Citizenship is difficult, even dangerous. Will the citizen accept the new world? Will the new world accept the citizen? Will the citizen find belonging? So much can go wrong.  I am like a canary in a coal mine. And, though they are discreet, many worlds are watching to see if I thrive or if I wither.  12 <air> “Twice I have gone on dates with women only to find that their self-identification as asexual was distinctly misleading.”  Ha! Kwase types, That’s because your xuit is so cute! I keep telling you . . .  “It is not really,” I reply, the xuit transcribing thoughts into text, “People see what they want to see. I am glad you see cute.”  Yeah, and those ladies saw a sex toy.  Humans can tell so much from the first few seconds of a date. Facial expressions and cultural cues line up like symptoms in a medical chart. But it is more difficult for me: I lack the specific neural hardwiring that most humans rely on to form first impressions.  Kwase likes stories about dates of mine that went wrong. At first I thought he was mocking me. Actually, I am sure he is mocking me (and himself), but I have begun to see that laughing at your own misadventures lessens them. The burden of past romantic failures is lightened.  “Once I went on a date with a man who just wanted a friend to watch precontact sci-fi movies with. He thought I would be perfect.”  So that’s why you like those!  “I did develop a fondness, but I would not describe it as a fulfilling relationship.”  I refuse to watch any old sci-fi movies that don’t star Will Smith.  “LOL”  I sit back in my office staring out at the cruddy snow plowed into mounds around the Institute carpool lot.  “I dread the day-after messages,” I transmit, “I think it is because of the xuit that they think they can write anything to me. As if I am only a machine. I have been called empty, weird, abnormal, too dumb or too smart, too needy or too distant, soulless—”  Aw, sweetie, writes Kwase, they didn’t know the first thing about you.  “Maybe they just saw the obvious.”  A pause in the discussion, and I wonder if I have insulted him. Outside my window, it has begun to sleet, the carpool lot blurring. Have I suggested that Kwase is deluded himself, that he is blind to my obvious alienness? Is he? Is any human who loves me deluding themselves?  Eventually, he writes back, You can’t blame everything bad that happens to you on being Len.  13 <ground> It may be some time before Earth is prepared to reciprocate.  It has naturalized a citizen: me. But to achieve full-fledged membership in the IGC, Earth must also consign one of its own to another planet to be raised by another species.  Imagine a human couple offering their newborn infant for such a purpose, the helpless baby placed in a vat, sensors wrapping its head and hands, respirators and feeding tubes and evacuators performing its bodily functions. The child to grow up without milk, without mother and father. Its sexuality to be thwarted and misunderstood; its reproduction to be carried out artificially, if at all.  Not such a hard thing for the Len, maybe, but what human couple would make such a choice? What human institution would dare to suggest such a thing be done to an orphan?  Even I—part Len, and purportedly empty, weird, abnormal, soulless—know that humanity may not be ready for a long time.  14 <air> “How is Kwase?” asks my mother.  “He is well.”  “But . . . ?”  We are sitting in the cafeteria of my mother’s assisted-care facility. I am worried about her: in the span of a few short weeks she has diminished somehow, become suddenly fragile. Yet Dr. Anne Stoltzfus-Veloso still retains the unsettling ability—through thirty years and four different xuits—to read my thoughts as if they were projected across my forehead.  “Kwase and I . . . I am not certain how much longer we will be together. I believe he wants . . . a kind of commitment I may not know how to give. We don’t even live in the same city.”  “He wants to get married?”  She offers the word so casually.  “No . . . Maybe . . . I think he only wants to know that I will be there for him, and I would be . . . but I think he needs some decisive demonstration from me.”  “And why not give him one? Do you want to get married?”  “Married? I never thought of myself as someone who could . . . You know that I have always felt the gaze of these two worlds on me. And not only on me, but within me. Human and Len. Ground state and air state—though which is analogous to which I have never been able to decide. Air passes over ground, they touch, they shape one another, but they do not speak with one voice. And Len do not marry.”  My grasp of facial expressions may be weak, but I can guess at my mother’s: she is unconvinced.  15 <air> After two weeks with almost no communication, Kwase writes to suggest we visit Lennaia.  I am confused; I had thought we were taking a break.  We have been on a few small vacations to other worlds together; he, from his desk in Luanda, and I, from my office at the Institute in Toronto. It is fun, seeing these places with Kwase. We travel in simple, inexpensive drones that can be operated with no more than a pair of VR goggles and a joystick. No sensory implants necessary. Strange to think of my signals crisscrossing the universe like that: from Lennaia to my xuit on Earth, then from Earth to a drone on Slivka or H/le/ops or K.elo.ma. All instantaneous. My being, stretched even thinner than usual.  But to be a tourist on Lennaia.  It seems somehow silly or embarrassing to me. I am a professor of Len studies. I have spoken to hundreds of Len on screens or in xuits here on Earth or in virtual conferences hosted on any number of worlds. But he argues that I have never travelled there for pleasure, and never with him.  I am reticent.  He insists.  Lifting off from the port outside Lorle, we steer our drones towards the blue mountain ring to the north and join a community flock circling the city-cluster. Kwase has organized all this, and though he promised he would not identify me to our hosts, I can tell I am recognized by the way the flock adjusts to accept us. (It is a motif from human sitcoms—the boyfriend introduced to the parents—though here it is reversed, and I who am being introduced.)  So much has been written about Len flocking behavior, most of it by the Len themselves. There are, of course, rough hierarchies suggested in the patterns of the flock, but that is just the beginning of the nuanced meanings implied by position, cohesion, alignment, response time, drafting, and myriad other qualities of the flock I cannot hope to understand. Banking in, we are shuffled into a position denoting something more familiar than tourist, something like “honored distant relative.” A community flock is not a proper bonded flock like the one that produced me. It is more like a walking club.  I am nervous but also exhilarated, and I feel Kwase watching me. The great blue shoulders of the mountains are reflected in purple-tinged water-fields below us, over which the double shadows of our flock hurry, frightening the aquatic life below. In the distance, the nearest urban cluster-arm glitters. We cannot truly feel the wind through our interfaces, but I sense the phantom currents around me nonetheless. Our drones are primitive: an array of propellers, audio and video relay, and low-res holograms of our faces projected flatly before us. A human would see insects with ghost heads flying in the midst of swans. Kwase’s two-dimensional face tilts towards me. “You’re a natural at this!” he shouts, “I can’t believe you’ve never done it before!”  Later, we buzz through a fish market, its character more or less unchanged since before Len contact, tens of thousands of years ago. Though not as noisy, this is Kuala Lumpur all over again: vibrant trade, food of every shape and color, Len old and young, and xuits from a hundred worlds commingling. It is impossible to be lonely in a fish market. Kwase and I skim through eagerly, saying to each other how much we wish we had paid extra for taste or smell sensors.  But Kwase wants to leave the market sooner than I would have expected. He has planned a surprise, he says, and I am suddenly filled with trepidation.  The incubatorium is a wide white building, just a short flight from the market. A nurse meets us on the roof.  Inside, halls wide enough to glide through are lined with small porthole windows into individual chambers kept dark. There is a low foreboding sound like the muffled turning of great turbines. I cannot say why I have never come here, never requested a visual or even a report. I am like a human child afraid to go to the doctor, except of course it is more than that. And this too is a human feeling, is it not? To sense that there is some essential part of yourself that should not be looked at too closely? Some inner mystery that should not perhaps be plumbed? And for fear of what, exactly? Of change too drastic to handle? Of wandering lost in a hall of mirrors?  The nurse says,  <ground> You come to see yourself.  <air> Your self is a circle.  The nurse is following the glowing readouts beneath the windows along the wall. Halfway down, it pulls into a graceful landing where, by some signal of its wing, the light behind one window fades slowly on.  I wish we were in the same city at the same desk, so I could hold Kwase’s hand.  We cluster at the window. Inside the small chamber a swan floats on a current of air and a magnetic field. Asleep, dreaming, says my human eye, though the Len do not sleep. Tiny sensors like sprinkled silver dust sparkle along its folded wings.  I turn. The low-res hologram of Kwase’s drone is not easy to read, but I think a tear has blossomed on his smiling face.  “That’s you in there,” he says. “That’s you.”  During the day, author Beston Barnett designs and builds furniture in San Diego. At night, he plays Romani jazz. The rest of the time, he writes quirky little stories in which he struggles--rarely successfully--to leave his characters living happily ever after. He is a graduate of the 2018 Clarion Workshop.", "text": "4490 words, short story\nEntangled\n1\n<air>\nI am lonely on Earth.\nAs with many of my emotions, I cannot be certain whether this loneliness is a result of Earth socialization or genuine inborn experience. But I do pine for a companion. Not sexual intercourse though, I cannot pretend an interest in that. I could have something to mimic erogenous zones rigged to my xuit, but surely that would be disingenuous to my partner? Sex is meant to be a sharing of heightened intimacy. I would not wish to mislead.\nNo, with my partner I wish to be honest in all things. And is that Earth socialization as well—the wish for depth and honesty in a relationship—or is it something I bring with me? Again, I cannot be certain.\nLuckily, there are a number of dating sites for people like me, who, either because of disability or disinclination, are seeking a partner without sexual obligations. There are even some with a variety of gender labels. “Non-binary” is accurate. It is still too early in the process of Earth’s inclusion into the Intergalactic Cooperative to expect these sites to have a box labelled “transhuman.”\nI put that information under “Interests/Hobbies.”\n2\n<air>\nAliquah, a woman with whom I had a relationship for about six months, once described a dream she had about us:\n“We were lying on a wide meadow of beautiful green grass, the two of us, like kids making snow angels without snow. Our arms were outstretched and our fingers barely touched. A lovely breeze ruffled the grass.\n“I heard a disturbing sound. A thumping but also a fluttering: flutter/thump/flutter . . . flutter/thump/flutter . . . I looked over at you, but instead of your xuit, you were wearing an old sci-fi robot, with a big steel boiler for a torso and vacuum tubes for eyes. You were large and somewhat rusty, like a submarine beached on the meadow. The flutter/thump/flutter was coming from inside you. I was able to climb rungs up your side and open a hatch in your chest. Inside, in the dark of your hull, a robin fluttered from wall to wall.”\nIt did not work out between me and Aliquah—she says I rekindled the desire for human touch that she thought she had lost—but I am grateful to her for this image of myself.\n3\n<ground>\nThe stages of inclusion into the Intergalactic Cooperative:\n- Contact\n- Language Sharing\n- Information Sharing\n- Tourism/Exploration\n- Citizenship\nI represent the leading edge of the fifth stage: the first alien of any species to be naturalized as a citizen of planet Earth. Earth’s governing councils had to construct an entirely new system of laws to account for me, though in this they were guided by a thousand worlds’ precedents. In the eyes of the IGC, I bring honor to both my origin planet and my adopted. I represent a strengthening of ties and a leap of faith.\nMost of the speech I made at my naturalization ceremony consisted of platitudes like these, written for me by diplomats of both species, but I included some thoughts of my own:\n“Humans and Len share many traits, but one holds a special personal interest. In our deepest selves, both species yearn for a sense of belonging. I hope to find that belonging in the commonwealth of Earth, as Human and as Len.”\nI spoke those words, broadcast across many worlds, when I was only two years old (though of course Len minds do not mature as humans’ do, but are hatched fully functioning). Thirty years later, I am less optimistic. Luck plays such an intimidating role in finding community or companionship; each day alone must be faced anew; hope must be kindled against hope.\nAnd this feeling too could be socialization, for do humans not already have the types of the lonesome poet-lover, the pining old maid, the stranger seeking acceptance in a strange land?\n4\n<air>\nI dated an actor for a time, somewhat past his prime but nonetheless a celebrated leading man and auteur, handsome and creative and bored with sexual pursuits. Neither of us publicized our relationship—I am thankful for that—and anyway we were not exclusive.\nWhen he touched me, he liked to imagine he was stroking the neck of a swan in a distant galaxy. “My lonesome swan,” he would call me. I was on my third xuit at the time, one that had receptors (pleasure-producing but nonsexual) in long silken strips down my neck and shoulders. The romantic possibilities fascinated him. For myself, I was drawn to the fierceness of his creativity, his ability to give himself so completely to the role. For many years, I thought this was my goal as well: to commit wholly to the role of being human.\nBut by the time he broke off our relationship, I had come to find his intensity overwhelming. Humans expect their relationships—with groups and with mates—to be messy, stormy, and marked by a push-and-pull that they feel unnatural without.\nThe Len in me desires a more nuanced kind of belonging.\n5\n<ground>\nThe Len bear little phenotypic resemblance to swans, though we are white in color—at least in the spectrum visible to humans—and we fly. Humans make these analogies instinctively: the Slikovk are lobsters, the Ulmians are big amoebas, the Len are swans. What seem feathers to Earth eyes are biologically more akin to fine interwoven tendrils of silk.\nLike the majority of the intelligent species so far encountered by the IGC, the Len carry our sentience outside our bodies. Earth species are rare in supporting such delicate quantum phenomena in the dangerous electrical switchboards of their brains, and this explains why they have had a more difficult time adjusting to exploration in xuits. For the Len, “consciousness” is gathered just along the trailing edge of our silken wings.\nFor most of our precontact history, the Len believed that, when flying, the wind through our mind-wings caused our sense of self to loosen or purify somehow, and only in the light of later scientific study did this conviction prove to be merely poetical. However, the dichotomy of a flight state and a ground state runs deep in Len linguistics. Every sentence contains two, an air component and a ground component, and the dissonance between them provides an additional layer of meaning, as a hand gesture or an emoji might.\n<ground> The robot’s chest is empty.\n<air> The robin flies in the robot’s chest.\nIn this example—which I have sometimes used in my Len class—there is an interesting dissonance: the robot is “empty,” yet it contains a robin. The emptiness is in the ground state, which suggests it is ongoing, whereas the robin appears in the flight state, which suggests impermanence. To the Len, this is a single thought, or rather, every thought has this dual nature. Even long passages of Len technical writing, free of poetic content and given entirely in <ground>, imply an accompanying <air> component, which translates roughly as:\n<air> It may be so.\nOf course, I learned it as a second language, the same as any other human who speaks Len. But it is assumed that, because of my Len nature, I have a facility with the language that other humans lack. Whether this is true or not, teaching at the Len Institute has proved an important part of my career. I am said to have a unique perspective: both outsider and insider.\nBut I have never flown, never felt the thin air of Lennaia stream through my wings, never banked and soared with a flock of my own. I carry my mind-wings within me, galaxies away.\n6\n<ground>\nFaster-than-light travel is prohibitively impractical.\nData, however, can travel not only faster-than-light, but instantaneously. It is a question of identifying long-lost twins: elementary particles, separated in those first few moments after the Big Bang, but still in an entangled state. Once a species has the technology to identify them, these entangled twins are everywhere. Tweaking one tweaks the other, no matter how impossibly distant.\nAlmost anything can travel as data: images, poetry, schematics, code to run on a 3-D printer. Theoretically, every molecule of a body can be scanned and recreated. Theoretically, the electrical state of every neuron in a brain can be scanned and recreated. But what cannot be scanned or recreated is consciousness, because the essential trait of consciousness—its unpredictability, its free will—arises from quantum phenomena. And quantum phenomena are governed by the uncertainty principle: they can never be perfectly mapped.\nThus, a species from one galaxy can communicate with a species in another, can pass technology, can suggest things or even bodies which can be built. But we cannot go to one another, we cannot touch, and we certainly cannot conquer.\nTo get anything done between the galaxies, we must cooperate.\n7\n<air>\nThough I did not require nursing or caring in the way that other children do, I was assigned a human mother and father on first hatching. It was thought by both species that this would enhance my socialization. Doctors Anne and Joachim Stoltzfus-Veloso were both researchers at the Len Institute; I am their only child.\nAnne is retired, though she still keeps an office at the Institute. I see her once a week for dinner.\nJoachim passed away last year. His death has affected me more than I anticipated. A painful series of thoughts keep circling back on me without resolution. I cannot rid myself of the conviction that, with my disinterest in diplomacy and what must have seemed to him a morbid obsession with human romance, I have let my father down. He was a man to live up to: idealistic, curious about the universe, and stubborn as a terrier when he had his teeth in a project. I loved him very much.\n“He loved you too,” says my mother, sitting in her room at the assisted-care facility into which she has recently moved.\n“He expected more from me.”\nI am uncomfortable in her new room. Everything is unfamiliar; even our family photos look changed in this lessened space. “Why should his disappointment haunt me? Len do not form this kind of parental bond.”\n“They bond. They grieve. What does it matter what the Len do? Will you feel more authentic or less real? You’ve lost your father. I’ve lost my husband . . . Shush, now, I miss him too.”\n8\n<ground>\nI have Len parents as well. A parental group of anywhere from two to forty-eight can make an egg, carefully apportioning favored elements of genetic material among them. I was made by a large civic-minded flock specifically to be an Earth citizen. This rational approach to reproduction has allowed the Len to repeatedly supply candidates for citizenship on other planets well before many of the IGC’s more conservative member species.\nStill, I cannot help but find the Len’s reproductive process impersonal and my biological parents uncomforting.\nI miss my human father and do not know if I honor him.\n9\n<ground>\nA xuit is any remotely controlled body, be it biological or mechanical or hybrid. The xuit receives real-time motor control and transmits real-time sensory information. What sensory information the xuit may collect depends on the operator’s species, though electromagnetic wave detection and chemical analysis (sight and smell in humans) are nearly ubiquitous across the member species.\nWhen a fallow intelligence like the Earth’s enters the stage of Tourism/Exploration, the first xuits cooperatively produced are usually small flying drones. The co-production begins one-for-one: one drone produced on Ulmlt for a human operator on Earth, one drone produced on Earth for an Ulmian operator on Ulmlt. (This is not simply an example; Ulmians were the first to get xuits on the ground on Earth.)\nAs the absorption of alien technology increases, so does the quality and flexibility of xuits adapted to the new environment. Operators from distant galaxies can integrate more directly with their xuits: they may choose to have all the stimuli from their birth-bodies nullified so that they can focus on their xuits completely. In a fully integrated xuit, the operator’s mind is technically at an impassable distance, but everything feels present and instantaneous.\nSo when I experience grief or love or loneliness, these emotions are technically being experienced on Lennaia, lighteons away. Yet the stimuli that produced them and the people I share them with are all here on Earth. When I grieve for my father, is the grief doubled or is it somehow thinned by all that distance? A very Len thought.\n<ground> A distant fledgling grieves the death of a parent.\n<air> Grief is an entangled state.\n10\n<air>\nI meet Kwase on RomanceOnly.com. He is an older man, a xuit engineer based in Luanda. Kwase lost his legs to a land mine, though in his profile he writes that he considered himself asexual even before the accident. He is an enthusiastic correspondent, a shameless gourmand, and an avid tourist—on other worlds and on this one. We have been writing back and forth for several months when he invites me to join him on a food tour in Malaysia. “We’ll split the distance,” he writes. That is the kind of impulsive man he is. Most of my first dates have been over cautious cups of coffee; Kwase is suggesting a week’s worth of laksa, coconut rice, and salted egg crab.\nI have recently upgraded to a new xuit, my fourth. It takes trial-and-error to match the sensory input of one world to the brain stimuli of a species evolved on another. Salty, spicy, creamy, tangy—what do these qualities mean to a Len body? But my new xuit has significant improvements, and I am tasting Earth foods in a way I never have before.\nNot that my xuit needs to eat, but neither do humans, half the time.\nKuala Lumpur is a revelation. Malay, Indian, Chinese, and xuits from a dozen different species, the hurly-burly of the intergalactic community come to Earth, everyone crowded together, curious, ambitious, dreaming. Everyone hungry! After we work out that Kwase does not mind being carried and that I enjoy carrying him, we have a successful week together. I feel taken out of myself.\n“What are you truly hoping to find in a partner?” he messages me when I am back in Toronto. “I had a wonderful trip with you, but I won’t live forever. I do not wish to waste your time or my own. Now you’ve met me, what do you think?”\nI do not know how to respond. It is among the strange qualities of loneliness that you feel there is something missing, but you cannot precisely identify what is missing or why it matters. Fear of dying is tied up in loneliness as well—I have felt this since losing my father—and fear of dying alone, most of all. Kwase thinks of me as strong and young, but he is thinking of the xuit. I will lose motor control eventually. My senses will dim. Len life span is shorter than human: at our ages, either Kwase or I could go first.\nI do know that I have felt less alone since meeting him. But where Kwase is impulsive and sincere, I am more circumspect. He would call me coy. I reply to him in Len.\n<ground> I only know that I would like to see you again.\n<air> My knowing has wings.\n11\n<ground>\nAliens are increasingly common on Earth, but I am still the only naturalized citizen.\nThe others are technically explorers or tourists, though they may perform functions beyond what those labels imply. But they all enter and leave their xuits at will; they are all essentially embodied on their home worlds. A citizen, in the IGC’s terminology, is someone who is born into their xuit, without having first known their homeworld. On the older worlds, there are colonies of citizens naturalized from all over the universe.\nI was hatched on Lennaia, directly into a web of sensors which connected me to my first xuit, already prepared for me at the Len Institute on Earth. My first imprints were my human mother and father. My first language was English. The first light from which my xuit drew power came from Earth’s sun. I had to be taught that my actual body was elsewhere; that I was, in some sense, not who I was.\nThere is a reason that after thirty years I am still Earth’s only naturalized citizen. Tourism and exploration may be costly, they may require generations of cooperation and technical advance, but they are easy, emotionally. Citizenship is difficult, even dangerous. Will the citizen accept the new world? Will the new world accept the citizen? Will the citizen find belonging? So much can go wrong.\nI am like a canary in a coal mine. And, though they are discreet, many worlds are watching to see if I thrive or if I wither.\n12\n<air>\n“Twice I have gone on dates with women only to find that their self-identification as asexual was distinctly misleading.”\nHa! Kwase types, That’s because your xuit is so cute! I keep telling you . . .\n“It is not really,” I reply, the xuit transcribing thoughts into text, “People see what they want to see. I am glad you see cute.”\nYeah, and those ladies saw a sex toy.\nHumans can tell so much from the first few seconds of a date. Facial expressions and cultural cues line up like symptoms in a medical chart. But it is more difficult for me: I lack the specific neural hardwiring that most humans rely on to form first impressions.\nKwase likes stories about dates of mine that went wrong. At first I thought he was mocking me. Actually, I am sure he is mocking me (and himself), but I have begun to see that laughing at your own misadventures lessens them. The burden of past romantic failures is lightened.\n“Once I went on a date with a man who just wanted a friend to watch precontact sci-fi movies with. He thought I would be perfect.”\nSo that’s why you like those!\n“I did develop a fondness, but I would not describe it as a fulfilling relationship.”\nI refuse to watch any old sci-fi movies that don’t star Will Smith.\n“LOL”\nI sit back in my office staring out at the cruddy snow plowed into mounds around the Institute carpool lot.\n“I dread the day-after messages,” I transmit, “I think it is because of the xuit that they think they can write anything to me. As if I am only a machine. I have been called empty, weird, abnormal, too dumb or too smart, too needy or too distant, soulless—”\nAw, sweetie, writes Kwase, they didn’t know the first thing about you.\n“Maybe they just saw the obvious.”\nA pause in the discussion, and I wonder if I have insulted him. Outside my window, it has begun to sleet, the carpool lot blurring. Have I suggested that Kwase is deluded himself, that he is blind to my obvious alienness? Is he? Is any human who loves me deluding themselves?\nEventually, he writes back, You can’t blame everything bad that happens to you on being Len.\n13\n<ground>\nIt may be some time before Earth is prepared to reciprocate.\nIt has naturalized a citizen: me. But to achieve full-fledged membership in the IGC, Earth must also consign one of its own to another planet to be raised by another species.\nImagine a human couple offering their newborn infant for such a purpose, the helpless baby placed in a vat, sensors wrapping its head and hands, respirators and feeding tubes and evacuators performing its bodily functions. The child to grow up without milk, without mother and father. Its sexuality to be thwarted and misunderstood; its reproduction to be carried out artificially, if at all.\nNot such a hard thing for the Len, maybe, but what human couple would make such a choice? What human institution would dare to suggest such a thing be done to an orphan?\nEven I—part Len, and purportedly empty, weird, abnormal, soulless—know that humanity may not be ready for a long time.\n14\n<air>\n“How is Kwase?” asks my mother.\n“He is well.”\n“But . . . ?”\nWe are sitting in the cafeteria of my mother’s assisted-care facility. I am worried about her: in the span of a few short weeks she has diminished somehow, become suddenly fragile. Yet Dr. Anne Stoltzfus-Veloso still retains the unsettling ability—through thirty years and four different xuits—to read my thoughts as if they were projected across my forehead.\n“Kwase and I . . . I am not certain how much longer we will be together. I believe he wants . . . a kind of commitment I may not know how to give. We don’t even live in the same city.”\n“He wants to get married?”\nShe offers the word so casually.\n“No . . . Maybe . . . I think he only wants to know that I will be there for him, and I would be . . . but I think he needs some decisive demonstration from me.”\n“And why not give him one? Do you want to get married?”\n“Married? I never thought of myself as someone who could . . . You know that I have always felt the gaze of these two worlds on me. And not only on me, but within me. Human and Len. Ground state and air state—though which is analogous to which I have never been able to decide. Air passes over ground, they touch, they shape one another, but they do not speak with one voice. And Len do not marry.”\nMy grasp of facial expressions may be weak, but I can guess at my mother’s: she is unconvinced.\n15\n<air>\nAfter two weeks with almost no communication, Kwase writes to suggest we visit Lennaia.\nI am confused; I had thought we were taking a break.\nWe have been on a few small vacations to other worlds together; he, from his desk in Luanda, and I, from my office at the Institute in Toronto. It is fun, seeing these places with Kwase. We travel in simple, inexpensive drones that can be operated with no more than a pair of VR goggles and a joystick. No sensory implants necessary. Strange to think of my signals crisscrossing the universe like that: from Lennaia to my xuit on Earth, then from Earth to a drone on Slivka or H/le/ops or K.elo.ma. All instantaneous. My being, stretched even thinner than usual.\nBut to be a tourist on Lennaia.\nIt seems somehow silly or embarrassing to me. I am a professor of Len studies. I have spoken to hundreds of Len on screens or in xuits here on Earth or in virtual conferences hosted on any number of worlds. But he argues that I have never travelled there for pleasure, and never with him.\nI am reticent.\nHe insists.\nLifting off from the port outside Lorle, we steer our drones towards the blue mountain ring to the north and join a community flock circling the city-cluster. Kwase has organized all this, and though he promised he would not identify me to our hosts, I can tell I am recognized by the way the flock adjusts to accept us. (It is a motif from human sitcoms—the boyfriend introduced to the parents—though here it is reversed, and I who am being introduced.)\nSo much has been written about Len flocking behavior, most of it by the Len themselves. There are, of course, rough hierarchies suggested in the patterns of the flock, but that is just the beginning of the nuanced meanings implied by position, cohesion, alignment, response time, drafting, and myriad other qualities of the flock I cannot hope to understand. Banking in, we are shuffled into a position denoting something more familiar than tourist, something like “honored distant relative.” A community flock is not a proper bonded flock like the one that produced me. It is more like a walking club.\nI am nervous but also exhilarated, and I feel Kwase watching me. The great blue shoulders of the mountains are reflected in purple-tinged water-fields below us, over which the double shadows of our flock hurry, frightening the aquatic life below. In the distance, the nearest urban cluster-arm glitters. We cannot truly feel the wind through our interfaces, but I sense the phantom currents around me nonetheless. Our drones are primitive: an array of propellers, audio and video relay, and low-res holograms of our faces projected flatly before us. A human would see insects with ghost heads flying in the midst of swans. Kwase’s two-dimensional face tilts towards me. “You’re a natural at this!” he shouts, “I can’t believe you’ve never done it before!”\nLater, we buzz through a fish market, its character more or less unchanged since before Len contact, tens of thousands of years ago. Though not as noisy, this is Kuala Lumpur all over again: vibrant trade, food of every shape and color, Len old and young, and xuits from a hundred worlds commingling. It is impossible to be lonely in a fish market. Kwase and I skim through eagerly, saying to each other how much we wish we had paid extra for taste or smell sensors.\nBut Kwase wants to leave the market sooner than I would have expected. He has planned a surprise, he says, and I am suddenly filled with trepidation.\nThe incubatorium is a wide white building, just a short flight from the market. A nurse meets us on the roof.\nInside, halls wide enough to glide through are lined with small porthole windows into individual chambers kept dark. There is a low foreboding sound like the muffled turning of great turbines. I cannot say why I have never come here, never requested a visual or even a report. I am like a human child afraid to go to the doctor, except of course it is more than that. And this too is a human feeling, is it not? To sense that there is some essential part of yourself that should not be looked at too closely? Some inner mystery that should not perhaps be plumbed? And for fear of what, exactly? Of change too drastic to handle? Of wandering lost in a hall of mirrors?\nThe nurse says,\n<ground> You come to see yourself.\n<air> Your self is a circle.\nThe nurse is following the glowing readouts beneath the windows along the wall. Halfway down, it pulls into a graceful landing where, by some signal of its wing, the light behind one window fades slowly on.\nI wish we were in the same city at the same desk, so I could hold Kwase’s hand.\nWe cluster at the window. Inside the small chamber a swan floats on a current of air and a magnetic field. Asleep, dreaming, says my human eye, though the Len do not sleep. Tiny sensors like sprinkled silver dust sparkle along its folded wings.\nI turn. The low-res hologram of Kwase’s drone is not easy to read, but I think a tear has blossomed on his smiling face.\n“That’s you in there,” he says. “That’s you.”\nDuring the day, author Beston Barnett designs and builds furniture in San Diego. At night, he plays Romani jazz. The rest of the time, he writes quirky little stories in which he struggles--rarely successfully--to leave his characters living happily ever after. He is a graduate of the 2018 Clarion Workshop.", "source": "https://clarkesworldmagazine.com/barnett_08_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Entangled by Beston Barnett"}