{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Stephen Gaskell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "I4bOT0XXqTAqp8/myTdkTG0WiZ4=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Energizing Futures: How SF Fuels Itself  Virtual worlds. Terraforming complexes. Star-spanning generation ships. Science fiction is chock-full of massive technological artifacts born of humankind’s desire to create, to explore. What do they all have in common? They all consume energy like black holes swallow stars. Computation, mechanization, acceleration. If the future’s getting faster, it’s certainly getting more energy intensive.  Even when SF is not envisioning these glittering futures, a growing Earth population living increasingly modern lifestyles means that our collective energy needs will inevitably rise, new technologies or not. One question that’s often not given much attention is: Where does this energy come from?  System Shock  Even after Kelvin and others developed the theory of thermodynamics in the mid-19th century, early works of SF paid little heed to the energetic considerations of their invented worlds. Although Copernicus and Newton had ushered in enlightenment thinking centuries earlier—and the heavens were no longer thought of as a Platonic realm of a different category of nature to that found on Earth—writers of this period struggled (or perhaps chose not) to engage with mechanical realities.  For example, the concept of escape velocity—the minimal speed an object must be projected to escape the gravitational attraction of the body on which it resides—was well known since Newton formulated his laws, but it did not filter into most writers’ thoughts. Locomotive means usually relied on mystical “will,” such as in Olaf Stapledon’s Star Maker (1937), where the narrator travels the cosmos telepathically, or highly speculative technology, most notably antigravity devices. In Charles Curtis Dail’s Willmoth the Wanderer, or The Man from Saturn (1890), the alien protagonist traverses the solar system with the aid of an antigravity ointment smeared over his body, while in H. G. Wells’ First Men in the Moon (1901) the inventor Cavorite famously creates a gravity-screening substance by the same name.  Despite being scientifically unsound—no evidence for either gravitationally-repulsive matter or “mind over matter” ever having been found—both methods have remained popular for dodging the killjoy of physical law. Antigravity technology adorns the decks of most starships from the USS Enterprise to Battlestar Galactica, and mental gymnastics facilitate travel for everyone from Roger Zelazny’s Nine Princes of Amber to Neo of The Matrix.  One of the earliest fictionalizations of the seeds of a workable route off-world appeared in Achille Eyraud’s Voyage à Vénus (1865). Unlike Jules Verne’s From the Earth to the Moon, published in the same year, where astronauts were fired into space from a giant cannon, Eyraud had his adventurers lifted from the Earth by a water-based rocket propulsion system. Though he used the correct principle, if not the most efficient propellant, Eyraud’s novel went largely unnoticed, while Jules Verne’s became one of his world-famous masterpieces.  [An early vision of astronaut transport courtesy of Jules Verne.] Despite Verne’s oversight on a cannon as a launching means, he carefully researched the scientific possibilities of the day, inventing many plausible technologies, and coming to understandings that were often remarkably prophetic. For example, he accurately described weightlessness in outer space, and inspired American submarine inventor Simon Lake with his tale Twenty Thousand Leagues Under the Sea. Most importantly for the future of SF, Verne together with his fellow “Father of Science Fiction,” H. G. Wells, laid a framework for a new brand of SF where scientific truths, as much as they could, infused the fiction.  One of the chief consequences of this focus on scientific awareness, of course, was a renewed examination of how the myriad spacecraft, off-world bases, orbitals, etc. would be powered. Rather than expanding horizons, hard SF actually narrowed the wider genre’s remit, concentrating on places and journeys within our solar system. Here, writers could extrapolate from modern engineering principles, marrying this understanding with the knowledge of our increasingly well-charted interstellar backyard.  Arthur C. Clarke, arguably the greatest exponent of creating great sensawunda moments underpinned by scientific rationale, used the solar wind—the faint pressure of innumerable photons flung from the sun—to power solar yachts in his story “Sunjammer.” And in The Fountains of Paradise, Clarke describes the construction of a space elevator from Sri Lanka. Such an engineering feat, seriously considered by NASA among other groups, would make space exploration an energetically, and much more economically viable proposition. However, it is still reliant on the development of several technologies—including carbon nanotubes for the cable and electromagnetic propulsion for the transportation.  Perhaps tracking the optimism and successes of various space agencies, hard SF set in the local neighborhood probably attained its greatest popularity in the late ’80s and early ’90s, when Cold War paranoia was in its final throes. Classic texts such as Kim Stanley Robinson’s Mars trilogy and Bruce Sterling’s Schismatrix paint detailed pictures of how the solar system might be colonized. In Red Mars, the terraforming of the red planet is kick-started by “mohole” drilling to release subsurface heat; the detonation of nuclear explosions deep in the permafrost to release carbon-dioxide and other heat-trapping atmospheric gases; and the insertion of a geosynchronous asteroid to which a space elevator cable is tethered. These steps provide the foundation for the introduction of plant life in the sequel, Green Mars.  In Schismatrix Sterling posits a fragmented humanity, an Earth shattered from ecological collapse, and pockets of Shaper/Mechanist enclaves living in artificial habitats (often asteroids or small moons scooped of their interiors and spun to create artificial gravity). Energy is harvested in myriad ways utilizing biotech, solar collection, and nuclear fusion. Interestingly, although competition between the factions is intense, warfare is considered too horrifying to contemplate—not only because the memory of Earth’s demise is fresh in mind, but because the habitats are so fragile and easy to destroy. Space as an utterly hostile environment for human life is often overlooked in SF, a lesson not forgotten here.  Recent works—such as Duncan Jones’ film Moon, Jeff Carlson’s novella The Frozen Sky, and Joan Slonczewski’s novel The Highest Frontier—continue this tradition of scientifically informed, near-Earth exploration. In both Moon and The Frozen Sky, Jones and Carlson envision the off-world mining of fuels for nuclear fusion. In Moon, Helium-3 is harvested from the dark side of the moon to power an energy-spent Earth, and in The Frozen Sky, mecha-mine deuterium from the water ice of Europa to run a fusion “gas” station at the outer reaches of the solar system. In The Highest Frontier, by contrast, the cylindrical habitat of Frontera—orbiting above a climate-threatened Earth—draws power from an outer shell of photosynthetic microbes, piggybacking on research into hydrogen-producing bacteria.  [Not simply inspiration for Pink Floyd!] Universal Power  Modern SF, of course, hasn’t only concerned itself with the exploration and colonization of places within our own solar system. Overlapping with the declining popularity of “space-race” SF through the latter part of the 20th century, new-wave space opera married the pulp adventures of the subgenre’s early days with extensive knowledge of the wider cosmos gleaned from astronomer’s increasingly powerful telescopes.  Seeing deeper and more up-close than ever before, writers such as Alistair Reynolds, Nancy Kress, Greg Egan, and Justina Robson have utilized the exotic playground of dark energy, pulsars, binary stars, exoplanets, nebulae, and black holes (among other phenomena) to depict human stories against the widest, most awe-inspiring backdrops. And the energy sources have often been equally spectacular.  Adam Roberts, in his first novel, Salt, begins with a 37-year starship journey powered by a captured comet: “Our comet, fuel and buffer, building speed slowly. Us, strung out along the cable behind, eleven little homes like seashells on a child’s necklace-string.” Not only does using a comet as fuel source remove the need to bring millions of tones of propellant up the energy-sapping gradient of the Earth’s gravitational well, but affixing it to the front of a starship also means the ship is ingeniously shielded from interstellar debris, which even in tiny clumps could be lethal when traveling at appreciable fractions of light speed.  But why take any fuel at all, when the interstellar medium is chock-full of ionized hydrogen anyhow? That was the astronomical fact that inspired an American physicist to conceive of the Bussard ramjet, a space drive powered by scooping up protons using powerful electromagnetic fields, fusing those protons in a fusion reactor, and using the exhaust like a conventional rocket. Despite both theoretical and technical challenges concerning the frictional force of the interstellar gas, insufficient cloud densities, and the difficulty of fusing hydrogen, Larry Niven immortalized the Bussard ramjet by using it as a staple in his Known Space universe, most notably as the engines of his eponymous Ringworld.  [Giant space jellyfish, er, Bussard ramjet, ahoy!] If you really want a decent, innovative power source for your galactic civilization though, you’re going to want to move away from the relatively pedestrian concepts of combustion or fusion. Burning stuff has been old hat for millennia, and fusing nuclei for magnitudes longer, the domain of a trillion stars. Antimatter is one such candidate. With impeccable scientific credentials—theorized by Dirac and discovered by Andersen a mere four years later—antimatter packs a colossal energetic punch. Being the antithesis of normal matter in every regard except mass, any antiparticle can be combined with its particle sibling in an annihilation reaction that produces oodles of energy in accordance with Einstein’s famous mass-energy equivalence equation, E = mc2. Although Captain Kirk was exaggerating in the Star Trek episode “Obsession,” when he told an ensign that a pound of antimatter could destroy a solar system, the annihilation of fifteen pounds of antimatter is approximately equal to the energy that Hurricane Katrina unleashed in 2005.  As well as powering the warp core of the USS Enterprise, antimatter has a long history in the genre as an energy source. Back in 1942, Jack Williamson published his story “Collision Orbit” in Astounding Science Fiction, in which engineer Jim Drake struggles to exploit the energy of contraterrene (antimatter) asteroids. Most recently, antimatter can be found propelling the ISV Venture Star, the vessel that carried Jake Sully to Pandora in Avatar. What’s often not confronted in these stories is where this antimatter comes from. To this day, for reasons physicists still don’t fully understand, the universe seems almost entirely matter-dominant, with no sign of the vast gamma ray displays that would occur along the boundaries between matter and antimatter regions. And although antiparticles can be easily created and trapped in places like CERN, if you have to make the stuff in the first place, energy considerations render the idea a non-starter.  Making stuff up is, of course, meat and potatoes for SF writers. Dubious science (Asimov’s positronic brains, anyone?) has never been a barrier to speculative power sources, as Iain M. Banks readily admits in a passage in his famous essay “A Few Notes On the Culture”: “Between each universe [in Banks’ Culture series] there is something called the Energy Grid (I said this was all fake); I have no idea what this is, but it’s what the Culture starships run on.”  Perhaps Banks’ Energy Grid is not as far-fetched as it initially sounds, given a patina of credibility by the concept of zero-point energy. ZPE, or vacuum energy, is the lowest possible energy state of a quantum mechanical system. It can be conceived as a vast reservoir of infinite energy sitting below the surface of reality. Doubts are high as to whether this energy can ever be used, but this hasn’t prevented ZPE making an appearance in plenty of SF. In the Halo universe, zero-point generators harvest energy from slipspace, while in Arthur C. Clarke’s Songs of Distant Earth, humanity’s last chance resides with the starship Magellan, which is powered by a quantum drive that taps the vacuum energy.  Another of nature’s most mystifying phenomena, black holes, have also been mooted as potential wells of vast amounts of energy. Mini-black holes as compact energy sources were featured in both Joe Haldeman’s The Forever War, where the starships use them as drives, and John Varley’s The Ophiuchi Hotline, where prospectors hunt for ones that orbit the solar system. Unlike more massive black holes—which can be leveraged as energy sources via the emission of electromagnetic radiation from the infalling accretion disc, or through the theft of the holes’ angular momentum as in the Penrose process—reaping energy from miniature black holes utilizes a quantum-mechanical quirk that leads to the holes evaporating via Hawking radiation.  All this galactic back-and-forth probably gets a little tiring, and once a civilization has trekked around the cosmos, it’s probably going to want to take a rest and heat up from the warming fire of its destination star. This hasn’t escaped the attention of many SF writers. A whole cornucopia of Dyson spheres, bubbles, swarms, and shells have cloaked many a sun across the galaxy. In John Scalzi’s Old Man’s War, an alien civilization use a sphere to power a planetary shield, while in Charles Stross’ Accelerando a swarm “of computronium forms a massive matrioshka brain around the sun, providing virtual space for trillions of uploaded human minds and corporate AI.”  The Stars Not Our Destination  Environmental destruction, the specter of peak oil, the increasing wealth gap, and a tarnishing of the dream to colonize space have led many of the latest crop of SF writers to abandon a vision of humankind’s expansion into the cosmos. Instead, they’ve been focusing on terrestrial concerns of resource scarcity, ecological collapse, and sustainability. Addressing these issues has led to energy sources playing a more prominent role in both the setting and the plot of many contemporary works.  In Paolo Bacigalupi’s post-oil-age novel The Windup Girl, megodonts—huge, gene-hacked animals seemingly related to the Indian Elephant—“tread slow circles around power spindles,” winding highly engineered kink-springs that can hold gigajoules of stored energy. Whether this makes energetic sense given energy wastage between the foodstuff to animal, and animal to spring steps, requires further analysis. But the presence of an energy storage device based on elastic potential is a rarity in literature.  An energy source not often given much stage-time—but which could become a critical component of the portfolio of renewables through the 21st century—featured in the recent Doctor Who episode “The Fires of Pompeii.” Geothermal energy, powered by the decay of radioactive materials in the heart of the planet, has its most spectacular manifestation in volcanic eruptions that spew lava far and wide, and in “The Fires of Pompeii” it’s aliens tapping Vesuvius for this energy that precipitates the Doctor’s involvement.  [Did Doctor Who cause the AD 79 eruption of Vesuvius?] In Nancy Kress’ Beggars in Spain, energy is plentiful as society is powered by Y-energy, a form of cold fusion named after its pioneer, Kenzo Yagai, while in Lauren Beukes’ kinetic, urban dystopia Moxyland, one of the less narcissistic characters does up her home with “solar panels on the ceiling, a wind farm in the garden,” which suggests a world where energy generation is becoming an increasingly personal affair. Even more literary writers are getting in on the act. For example, the recent novel Solar by Ian McEwan is a black comedy about a morally bankrupt physicist who attempts to create artificial photosynthesis in an effort to stave off climate change.  Even when our best writers confront the very worst futures, envisaging dystopian societies borne of virus outbreaks, robot uprisings, solar catastrophes, or meddling with the fabric of space-time, the matter of fuelling up is never completely out of sight. Jeff Carlson begins Plague Year with the appetizing “They ate Jorgensen first,” while in Go-Go Girls of the Apocalypse, Victor Gischler has indentured servants generating electricity by pedaling exercise bikes.  My personal favorite for vacuuming up the ergs at the end of the world, though, has to come from the pages of Frederik Pohl’s Gateway. In it, humanity subsists on vast vats of yeast grown underground from vile-smelling kerogen shales: “And the runoff heat from the extractors warms the culture sheds, and the oil grows its slime as it trickles through the shed, and the slime-skimmers scoop it off and dry it and press it . . . and we eat it, or some of it, for breakfast.” And remember, kids, if you’re ever caught up in an apocalypse, ants are a great source of protein! Stephen Gaskell is an author, games designer, and champion of science. In his recent novella, Strata, co-written with Bradley P. Beaulieu, he envisions Earth's voracious appetite for energy being sated by vast solar-mining platforms circling the sun's chromosphere. He runs the \"science-behind-the-story\" website Creepy Treehouse, and is currently finishing the first draft of a weird, ecological apocalypse thriller set in Lagos, Nigeria. He lives on England's south coast with his partner, Eloise.", "text": "Non-Fiction\nEnergizing Futures: How SF Fuels Itself\nVirtual worlds. Terraforming complexes. Star-spanning generation ships. Science fiction is chock-full of massive technological artifacts born of humankind’s desire to create, to explore. What do they all have in common? They all consume energy like black holes swallow stars. Computation, mechanization, acceleration. If the future’s getting faster, it’s certainly getting more energy intensive.\nEven when SF is not envisioning these glittering futures, a growing Earth population living increasingly modern lifestyles means that our collective energy needs will inevitably rise, new technologies or not. One question that’s often not given much attention is: Where does this energy come from?\nSystem Shock\nEven after Kelvin and others developed the theory of thermodynamics in the mid-19th century, early works of SF paid little heed to the energetic considerations of their invented worlds. Although Copernicus and Newton had ushered in enlightenment thinking centuries earlier—and the heavens were no longer thought of as a Platonic realm of a different category of nature to that found on Earth—writers of this period struggled (or perhaps chose not) to engage with mechanical realities.\nFor example, the concept of escape velocity—the minimal speed an object must be projected to escape the gravitational attraction of the body on which it resides—was well known since Newton formulated his laws, but it did not filter into most writers’ thoughts. Locomotive means usually relied on mystical “will,” such as in Olaf Stapledon’s Star Maker (1937), where the narrator travels the cosmos telepathically, or highly speculative technology, most notably antigravity devices. In Charles Curtis Dail’s Willmoth the Wanderer, or The Man from Saturn (1890), the alien protagonist traverses the solar system with the aid of an antigravity ointment smeared over his body, while in H. G. Wells’ First Men in the Moon (1901) the inventor Cavorite famously creates a gravity-screening substance by the same name.\nDespite being scientifically unsound—no evidence for either gravitationally-repulsive matter or “mind over matter” ever having been found—both methods have remained popular for dodging the killjoy of physical law. Antigravity technology adorns the decks of most starships from the USS Enterprise to Battlestar Galactica, and mental gymnastics facilitate travel for everyone from Roger Zelazny’s Nine Princes of Amber to Neo of The Matrix.\nOne of the earliest fictionalizations of the seeds of a workable route off-world appeared in Achille Eyraud’s Voyage à Vénus (1865). Unlike Jules Verne’s From the Earth to the Moon, published in the same year, where astronauts were fired into space from a giant cannon, Eyraud had his adventurers lifted from the Earth by a water-based rocket propulsion system. Though he used the correct principle, if not the most efficient propellant, Eyraud’s novel went largely unnoticed, while Jules Verne’s became one of his world-famous masterpieces.\n[An early vision of astronaut transport courtesy of Jules Verne.]\nDespite Verne’s oversight on a cannon as a launching means, he carefully researched the scientific possibilities of the day, inventing many plausible technologies, and coming to understandings that were often remarkably prophetic. For example, he accurately described weightlessness in outer space, and inspired American submarine inventor Simon Lake with his tale Twenty Thousand Leagues Under the Sea. Most importantly for the future of SF, Verne together with his fellow “Father of Science Fiction,” H. G. Wells, laid a framework for a new brand of SF where scientific truths, as much as they could, infused the fiction.\nOne of the chief consequences of this focus on scientific awareness, of course, was a renewed examination of how the myriad spacecraft, off-world bases, orbitals, etc. would be powered. Rather than expanding horizons, hard SF actually narrowed the wider genre’s remit, concentrating on places and journeys within our solar system. Here, writers could extrapolate from modern engineering principles, marrying this understanding with the knowledge of our increasingly well-charted interstellar backyard.\nArthur C. Clarke, arguably the greatest exponent of creating great sensawunda moments underpinned by scientific rationale, used the solar wind—the faint pressure of innumerable photons flung from the sun—to power solar yachts in his story “Sunjammer.” And in The Fountains of Paradise, Clarke describes the construction of a space elevator from Sri Lanka. Such an engineering feat, seriously considered by NASA among other groups, would make space exploration an energetically, and much more economically viable proposition. However, it is still reliant on the development of several technologies—including carbon nanotubes for the cable and electromagnetic propulsion for the transportation.\nPerhaps tracking the optimism and successes of various space agencies, hard SF set in the local neighborhood probably attained its greatest popularity in the late ’80s and early ’90s, when Cold War paranoia was in its final throes. Classic texts such as Kim Stanley Robinson’s Mars trilogy and Bruce Sterling’s Schismatrix paint detailed pictures of how the solar system might be colonized. In Red Mars, the terraforming of the red planet is kick-started by “mohole” drilling to release subsurface heat; the detonation of nuclear explosions deep in the permafrost to release carbon-dioxide and other heat-trapping atmospheric gases; and the insertion of a geosynchronous asteroid to which a space elevator cable is tethered. These steps provide the foundation for the introduction of plant life in the sequel, Green Mars.\nIn Schismatrix Sterling posits a fragmented humanity, an Earth shattered from ecological collapse, and pockets of Shaper/Mechanist enclaves living in artificial habitats (often asteroids or small moons scooped of their interiors and spun to create artificial gravity). Energy is harvested in myriad ways utilizing biotech, solar collection, and nuclear fusion. Interestingly, although competition between the factions is intense, warfare is considered too horrifying to contemplate—not only because the memory of Earth’s demise is fresh in mind, but because the habitats are so fragile and easy to destroy. Space as an utterly hostile environment for human life is often overlooked in SF, a lesson not forgotten here.\nRecent works—such as Duncan Jones’ film Moon, Jeff Carlson’s novella The Frozen Sky, and Joan Slonczewski’s novel The Highest Frontier—continue this tradition of scientifically informed, near-Earth exploration. In both Moon and The Frozen Sky, Jones and Carlson envision the off-world mining of fuels for nuclear fusion. In Moon, Helium-3 is harvested from the dark side of the moon to power an energy-spent Earth, and in The Frozen Sky, mecha-mine deuterium from the water ice of Europa to run a fusion “gas” station at the outer reaches of the solar system. In The Highest Frontier, by contrast, the cylindrical habitat of Frontera—orbiting above a climate-threatened Earth—draws power from an outer shell of photosynthetic microbes, piggybacking on research into hydrogen-producing bacteria.\n[Not simply inspiration for Pink Floyd!]\nUniversal Power\nModern SF, of course, hasn’t only concerned itself with the exploration and colonization of places within our own solar system. Overlapping with the declining popularity of “space-race” SF through the latter part of the 20th century, new-wave space opera married the pulp adventures of the subgenre’s early days with extensive knowledge of the wider cosmos gleaned from astronomer’s increasingly powerful telescopes.\nSeeing deeper and more up-close than ever before, writers such as Alistair Reynolds, Nancy Kress, Greg Egan, and Justina Robson have utilized the exotic playground of dark energy, pulsars, binary stars, exoplanets, nebulae, and black holes (among other phenomena) to depict human stories against the widest, most awe-inspiring backdrops. And the energy sources have often been equally spectacular.\nAdam Roberts, in his first novel, Salt, begins with a 37-year starship journey powered by a captured comet: “Our comet, fuel and buffer, building speed slowly. Us, strung out along the cable behind, eleven little homes like seashells on a child’s necklace-string.” Not only does using a comet as fuel source remove the need to bring millions of tones of propellant up the energy-sapping gradient of the Earth’s gravitational well, but affixing it to the front of a starship also means the ship is ingeniously shielded from interstellar debris, which even in tiny clumps could be lethal when traveling at appreciable fractions of light speed.\nBut why take any fuel at all, when the interstellar medium is chock-full of ionized hydrogen anyhow? That was the astronomical fact that inspired an American physicist to conceive of the Bussard ramjet, a space drive powered by scooping up protons using powerful electromagnetic fields, fusing those protons in a fusion reactor, and using the exhaust like a conventional rocket. Despite both theoretical and technical challenges concerning the frictional force of the interstellar gas, insufficient cloud densities, and the difficulty of fusing hydrogen, Larry Niven immortalized the Bussard ramjet by using it as a staple in his Known Space universe, most notably as the engines of his eponymous Ringworld.\n[Giant space jellyfish, er, Bussard ramjet, ahoy!]\nIf you really want a decent, innovative power source for your galactic civilization though, you’re going to want to move away from the relatively pedestrian concepts of combustion or fusion. Burning stuff has been old hat for millennia, and fusing nuclei for magnitudes longer, the domain of a trillion stars. Antimatter is one such candidate. With impeccable scientific credentials—theorized by Dirac and discovered by Andersen a mere four years later—antimatter packs a colossal energetic punch. Being the antithesis of normal matter in every regard except mass, any antiparticle can be combined with its particle sibling in an annihilation reaction that produces oodles of energy in accordance with Einstein’s famous mass-energy equivalence equation, E = mc2. Although Captain Kirk was exaggerating in the Star Trek episode “Obsession,” when he told an ensign that a pound of antimatter could destroy a solar system, the annihilation of fifteen pounds of antimatter is approximately equal to the energy that Hurricane Katrina unleashed in 2005.\nAs well as powering the warp core of the USS Enterprise, antimatter has a long history in the genre as an energy source. Back in 1942, Jack Williamson published his story “Collision Orbit” in Astounding Science Fiction, in which engineer Jim Drake struggles to exploit the energy of contraterrene (antimatter) asteroids. Most recently, antimatter can be found propelling the ISV Venture Star, the vessel that carried Jake Sully to Pandora in Avatar. What’s often not confronted in these stories is where this antimatter comes from. To this day, for reasons physicists still don’t fully understand, the universe seems almost entirely matter-dominant, with no sign of the vast gamma ray displays that would occur along the boundaries between matter and antimatter regions. And although antiparticles can be easily created and trapped in places like CERN, if you have to make the stuff in the first place, energy considerations render the idea a non-starter.\nMaking stuff up is, of course, meat and potatoes for SF writers. Dubious science (Asimov’s positronic brains, anyone?) has never been a barrier to speculative power sources, as Iain M. Banks readily admits in a passage in his famous essay “A Few Notes On the Culture”: “Between each universe [in Banks’ Culture series] there is something called the Energy Grid (I said this was all fake); I have no idea what this is, but it’s what the Culture starships run on.”\nPerhaps Banks’ Energy Grid is not as far-fetched as it initially sounds, given a patina of credibility by the concept of zero-point energy. ZPE, or vacuum energy, is the lowest possible energy state of a quantum mechanical system. It can be conceived as a vast reservoir of infinite energy sitting below the surface of reality. Doubts are high as to whether this energy can ever be used, but this hasn’t prevented ZPE making an appearance in plenty of SF. In the Halo universe, zero-point generators harvest energy from slipspace, while in Arthur C. Clarke’s Songs of Distant Earth, humanity’s last chance resides with the starship Magellan, which is powered by a quantum drive that taps the vacuum energy.\nAnother of nature’s most mystifying phenomena, black holes, have also been mooted as potential wells of vast amounts of energy. Mini-black holes as compact energy sources were featured in both Joe Haldeman’s The Forever War, where the starships use them as drives, and John Varley’s The Ophiuchi Hotline, where prospectors hunt for ones that orbit the solar system. Unlike more massive black holes—which can be leveraged as energy sources via the emission of electromagnetic radiation from the infalling accretion disc, or through the theft of the holes’ angular momentum as in the Penrose process—reaping energy from miniature black holes utilizes a quantum-mechanical quirk that leads to the holes evaporating via Hawking radiation.\nAll this galactic back-and-forth probably gets a little tiring, and once a civilization has trekked around the cosmos, it’s probably going to want to take a rest and heat up from the warming fire of its destination star. This hasn’t escaped the attention of many SF writers. A whole cornucopia of Dyson spheres, bubbles, swarms, and shells have cloaked many a sun across the galaxy. In John Scalzi’s Old Man’s War, an alien civilization use a sphere to power a planetary shield, while in Charles Stross’ Accelerando a swarm “of computronium forms a massive matrioshka brain around the sun, providing virtual space for trillions of uploaded human minds and corporate AI.”\nThe Stars Not Our Destination\nEnvironmental destruction, the specter of peak oil, the increasing wealth gap, and a tarnishing of the dream to colonize space have led many of the latest crop of SF writers to abandon a vision of humankind’s expansion into the cosmos. Instead, they’ve been focusing on terrestrial concerns of resource scarcity, ecological collapse, and sustainability. Addressing these issues has led to energy sources playing a more prominent role in both the setting and the plot of many contemporary works.\nIn Paolo Bacigalupi’s post-oil-age novel The Windup Girl, megodonts—huge, gene-hacked animals seemingly related to the Indian Elephant—“tread slow circles around power spindles,” winding highly engineered kink-springs that can hold gigajoules of stored energy. Whether this makes energetic sense given energy wastage between the foodstuff to animal, and animal to spring steps, requires further analysis. But the presence of an energy storage device based on elastic potential is a rarity in literature.\nAn energy source not often given much stage-time—but which could become a critical component of the portfolio of renewables through the 21st century—featured in the recent Doctor Who episode “The Fires of Pompeii.” Geothermal energy, powered by the decay of radioactive materials in the heart of the planet, has its most spectacular manifestation in volcanic eruptions that spew lava far and wide, and in “The Fires of Pompeii” it’s aliens tapping Vesuvius for this energy that precipitates the Doctor’s involvement.\n[Did Doctor Who cause the AD 79 eruption of Vesuvius?]\nIn Nancy Kress’ Beggars in Spain, energy is plentiful as society is powered by Y-energy, a form of cold fusion named after its pioneer, Kenzo Yagai, while in Lauren Beukes’ kinetic, urban dystopia Moxyland, one of the less narcissistic characters does up her home with “solar panels on the ceiling, a wind farm in the garden,” which suggests a world where energy generation is becoming an increasingly personal affair. Even more literary writers are getting in on the act. For example, the recent novel Solar by Ian McEwan is a black comedy about a morally bankrupt physicist who attempts to create artificial photosynthesis in an effort to stave off climate change.\nEven when our best writers confront the very worst futures, envisaging dystopian societies borne of virus outbreaks, robot uprisings, solar catastrophes, or meddling with the fabric of space-time, the matter of fuelling up is never completely out of sight. Jeff Carlson begins Plague Year with the appetizing “They ate Jorgensen first,” while in Go-Go Girls of the Apocalypse, Victor Gischler has indentured servants generating electricity by pedaling exercise bikes.\nMy personal favorite for vacuuming up the ergs at the end of the world, though, has to come from the pages of Frederik Pohl’s Gateway. In it, humanity subsists on vast vats of yeast grown underground from vile-smelling kerogen shales: “And the runoff heat from the extractors warms the culture sheds, and the oil grows its slime as it trickles through the shed, and the slime-skimmers scoop it off and dry it and press it . . . and we eat it, or some of it, for breakfast.” And remember, kids, if you’re ever caught up in an apocalypse, ants are a great source of protein!\nStephen Gaskell is an author, games designer, and champion of science. In his recent novella, Strata, co-written with Bradley P. Beaulieu, he envisions Earth's voracious appetite for energy being sated by vast solar-mining platforms circling the sun's chromosphere. He runs the \"science-behind-the-story\" website Creepy Treehouse, and is currently finishing the first draft of a weird, ecological apocalypse thriller set in Lagos, Nigeria. He lives on England's south coast with his partner, Eloise.", "source": "https://clarkesworldmagazine.com/gaskell_06_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Energizing Futures: How SF Fuels Itself by Stephen Gaskell"}