{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Elizabeth Bear", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "GJ0evRWhrV8ZZ4q9WWk++fYtUJw=", "id": null, "license": null, "comments": "", "raw_text": "5520 words, short story, REPRINT  The Deeps of the Sky  Stormchases’ little skiff skipped and glided across the tropopause, skimming the denser atmosphere of the warm cloud-sea beneath, running before a fierce wind. The skiff’s hull was broad and shallow, supported by buoyant pontoons, the whole designed to float atop the heavy, opaque atmosphere beneath. Stormchases had shot the sails high into the stratosphere and good winds blew the skiff onward, against the current of the dark belt beneath.  Ahead, the vast ruddy wall of a Deep Storm loomed, the base wreathed in shreds of tossing white mist: caustic water clouds churned up from deep in the deadly, layered troposphere. The Deep Storm stretched from horizon to horizon, disappearing at either end in a blur of perspective and atmospheric haze. Its breadth was so great as to make even its massive height seem insignificant, though the billowing ammonia cloud wall was smeared flat-topped by stratospheric winds where it broke the tropopause.  The storm glowed with the heat of the deep atmosphere, other skiffs silhouetted cool against it. Their chatter rang over Stormchases’ talker. Briefly, he leaned down to the pickup and greeted his colleagues. His competition. Many of them came from the same long lines of miners that he did; many carried the same long-hoarded knowledge.  But Stormchases was determined that, with the addition of his own skill and practice, he would be among the best sky-miners of them all.  Behind and above, clear skies showed a swallowing indigo, speckled with bright stars. The hurtling crescents of a dozen or so of the moons were currently visible, as was the searing pinpoint of the world’s primary—so bright it washed out nearby stars. Warmth made the sky glow too, the variegated brightness of the thermosphere far above. Stormchases’ thorax squeezed with emotion as he gazed upon the elegant canopies of a group of Drift-Worlds rising in slow sunlit coils along the warm vanguard of the Deep Storm, their colors bright by sunlight, their silhouettes dark by thermal sense.  He should not look; he should not hope. But there—a distance-hazed shape behind her lesser daughters and sisters, her great canopy dappled in sheeny gold and violet—soared the Mothergraves. Stormchases was too far and too low to see the teeming ecosystem she bore on her vast back, up high above the colorful clouds where the sunlight could reach and nurture them. He could just make out the color variations caused by the dripping net-roots of veil trees that draped the Mothergraves’ sides, capturing life-giving ammonia from the atmosphere and drawing it in to plump leaves and firm nutritious fruit.  Stormchases arched his face up to her, eyes shivering with longing. His wings hummed against his back. There was no desire like the pain of being separate from the Mothergraves, no need like the need to go to her. But he must resist it. He must brave the Deep Storm and harvest it, and perhaps then she would deem him worthy to be one of hers. He had the provider-status to pay court to one of the younger Drift-Worlds . . . but they could not give his young the safety and stability that a berth on the greatest and oldest of the Mothers would.  In the hot deeps of the sky, too high even for the Mothers and their symbiotic colony-flyers or too low even for the boldest and most intrepid of Stormchases’ brethren, other things lived.  Above were other kinds of flyers and the drifters, winged or buoyant or merely infinitesimal things that could not survive even the moderate pressure and chill of the tropopause. Below, swimmers dwelled in the ammoniated thicks of the mid-troposphere that never knew the light of stars or sun. They saw only thermally. They could endure massive pressures, searing temperatures, and the lashings of molten water and even oxygen, the gas so reactive that it could set an exhalation on fire. That environment would crush Stormchases to a pulp, dissolve his delicate wing membranes, burn him from the gills to the bone.  Stormchases’ folk were built for more moderate climes—the clear skies and thick, buoying atmosphere of the tropopause, where life flourished and the skies were full of food. But even here, in this temperate part of the sky, survival required a certain element of risk. And there were things that could only be mined where a Deep Storm pulled them up through the layers of atmosphere to an accessible height.  Which was why Stormchases sailed directly into the lowering wings of the Deep Storm, one manipulator on the skiff’s controls, the other watching the perspective-shrunken sail shimmering so high above. Flyers would avoid the cable, which was monofilament spun into an intentionally refractive, high-visibility lattice with good tensile properties. But the enormous, translucent-bodied Drift-Worlds were not nimble. Chances were good that the Mother would survive a sail-impact, albeit with some scars—and some damage to the sky-island ecosystems she carried on her backs—and the skiff would likely hold together through such an incident. If he tangled a Mother in the monofilament shroud-lines spun from the same material that reinforced the Drift-World’s great canopies . . . it didn’t bear thinking of. That was why the lines were so gaily streamered: so anyone could see them from afar.  If Stormchases lost the skiff, it would just be a long flight home and probably a period of indenture to another miner until he could earn another, and begin proving himself again. But injuring a Mother, even a minor one who floated low, would be the end of his hopes to serve the Mothergraves.  So he watched the cable, and the overhead skies. And—of course—the storm.  Stormchases could smell the Deep Storm now, the dank corrosive tang of water vapor stinging his gills. The richly colored billows of the Deep Storm proved it had something to give. The storm’s dark-red wall churned, marking the boundary of a nearly-closed atmospheric cell rich with rare elements and compounds pumped up from the deeps. Soon, Stormchases would don his protective suit, seal the skiff, and begin the touchy business—so close to the storm—of hauling in the sail. The prevailing wind broke around the Deep Storm, eddying and compacting as it sped past those towering clouds. The air currents there were even more dangerous and unnavigable than those at the boundary between the world’s temperate and subtropical zones, where two counter-rotating bands of wind met and sheared against each other.  And Stormchases was going to pass through it.  Once the sail was stowed, Stormchases would maneuver the skiff closer under engine power—as close as those cool silhouettes ahead—and begin harvesting. But he would not be cowed by the storm wall. Could not be, if he hoped to win a berth on the Mothergraves.  He would brave the outer walls of the storm itself. He had the skill; he had the ancestral knowledge. The reward for his courage would be phosphates, silicates, organic compounds. Iron. Solid things, from which technologies like his skiff were built. Noble gases. And fallers, the tiny creatures that spent their small lives churned in the turbulence of the Deep Storm, and which were loaded with valuable nutrition and trace elements hard to obtain, for the unfledged juveniles who lived amid the roots and foliage and trapped organics of the Drift-World ecosystems.  The Deep Storm was a rich, if deadly, resource. With its treasures, he would purchase his place on the Mothergraves.  Stormchases streamed current weather data, forecasts and predictions. He tuned into the pulsed-light broadcasts of the skiffs already engaged in harvesting, and set about making himself ready.  The good news about Deep Storms was that they were extraordinarily stable, and the new information didn’t tell Stormchases much that he could not have anticipated. Still, there was always a thrill of unease as one made ready for a filtering run. A little too far, and—well, everyone knew or knew of somebody who had been careless at the margin of a storm and sucked into the depths of its embrace. A skiff couldn’t survive that, and a person definitely couldn’t. If the molten water didn’t cauterize flesh from carapace, convective torrents would soon drag one down into the red depths of the atmosphere, to be melted and crushed and torn.  It was impossible to be too careful, sky-mining.  Stormchases checked the skiff’s edge seals preliminary to locking down. Water could insinuate through a tiny gap and spray under the pressure of winds, costing an unwary or unlucky operator an eye. Too many sky-miners bore the scars of its caustic burns on their carapaces and manipulators.  A careful assessment showed the seals to be intact. Behind the skiff, the long cluster of cargo capsules bumped and swung. Empty, they were buoyant, and tended to drag the skiff upwards, forcing Stormchases to constant adjustments of the trim. He dropped a sky-anchor and owner-beacon to hold the majority of the cargo capsules, loaded one into the skiff’s dock with the magnetic claw, and turned the little vessel toward the storm.  Siphons contracted, feeling each heave of the atmosphere, Stormchases slid quickly but cautiously into the turbulent band surrounding the storm. It would be safer to match the wind’s velocity before he made the transition to within-the-storm itself, but his little skiff did not have that much power. Instead, it was built to catch the wind and self-orient, using the storm itself for stability rather than being tumbled and tossed like a thrown flyer’s egg.  Stormchases fixed his restraint harness to the tightest setting. He brought the skiff alongside the cloud wall, then deflated and retracted the pontoons, leaving the skiff less buoyant but far more streamlined. Holding hope in his mind—hope, because the Mothergraves taught that intention affected outcome—Stormchases took a deep breath, smelled the tang of methane on his exhalation, and slipped the skiff into the storm.  The wind hit the skiff in a torrent. Through long experience, Stormchases’ manipulators stayed soft on the controls. He let them vibrate against his skin, but held them steady—gently, gently, without too much pressure but without yielding to the wrath of the storm. The skiff tumbled for a moment as it made the transition; he regained trim and steadied it, bringing its pointed nose around to part the wind that pushed it. It shivered—feeling alive as the sun-warmed hide of the Mother upon whose broad back Stormchases had grown—and steadied. Stormchases guided it with heat-sight only. Here in the massive swirl of the cloud wall, the viewports showed him only the skiff’s interior lighting reflecting off the featureless red clouds of the storm, as if he and his rugged little ship were swaddled in an uncle’s wings.  A peaceful image, for a thing that would kill him in instants. If he went too far in, the winds would rip his tiny craft apart around him. If he got too close to the wall, turbulence could send him spinning out of control.  When the skiff finally floated serenely amidst the unending gyre, Stormchases opened the siphons. He felt the skiff belly and wallow as the wind filled it, then the increased stability as the filters activated and the capsule filled.  It didn’t take long; the storm was pumping a rich mix of resources. When the capsule reached its pressurized capacity, Stormchases sealed the siphons again. Still holding his position against the fury of the winds, he tested the responses of the laden skiff. It was heavier, sluggish—but as responsive as he could have hoped.  He brought her out of the fog of red and gray, under a clear black sky. A bit of turbulence caught his wingtip as he slipped away, and it sent the skiff spinning flat like a spat seed across the tropopause. Other skiffs scattered like a swarm of infant cloud-skaters before a flyer’s dive. Shaken, the harness bruising the soft flesh at his joints, Stormchases got control of the skiff and brought her around on a soft loop. His talker exploded with the whoops of other miners; mingled appreciation and teasing.  There was his beacon. He deployed pontoons to save energy and skimmed the atmosphere over to exchange capsules.  Then he turned to the storm, and went back to do it again.  Stormchases had secured his full capsules and was still rechecking the skiff’s edge-seals, preliminary to popping the craft open, when he caught sight of a tiny speck of a shadow descending along the margin of the storm. Something sharp-nosed and hot enough to be uncomfortable to look upon . . .  Stormchases scrambled for the telescope as the speck dropped toward the Deep Storm. It locked and tracked; he pressed two eyes to the viewers and found himself regarding a sleek black . . . something, a glossy surface he could not name. Nor could he make out any detail of shape. The autofocus had locked too close, and as he backed it off the object slipped into the edge of the Deep Storm.  Bigger than a flyer—bigger even than folk and nothing with any sense would get that close to the smeary pall of water vapor without protective gear. It looked a little like a flyer, though—a curved, streamlined wing shape with a dartlike nose. But the wings didn’t flap as it descended, banking wide on the cushion of air before the storm, curving between the scudding masses of the herd of Drift-Worlds.  It was like nothing Stormchases had ever seen.  Its belly was bright-hot, hot enough to spark open flame if it brushed oxygen, but as it banked Stormchases saw that the back was cold, black-cold against the warmth of the high sky, so dark and chill it seemed a band of brightness delineated it—but that was only the contrast with the soaking heat from the thermosphere. Stormchases had always had an interest in xenophysics. He felt his wings furl with shock as he realised that the object might show that heat-pattern if it had warmed its belly with friction as it entered the atmosphere, but the upper part were still breath-stealing cold with the chill of the deep sky.  Was it a ship, and not an animal? A . . . skiff of some kind?  An alien?  Lightning danced around the object, caught and caressed it like a Mother’s feeding tendrils caging a Mate—and then seemed to get caught there, netting and streaking the black hide with rills of savage, glowing vermillion and radiant gold. The wind of the object’s passage blew the shimmers off the trailing edge of its wings; shining vapor writhed in curls in the turbulence of its wake.  Stormchases caught his breath. Neon and helium rain, condensing upon the object’s hard skin, energized by the lightning, luminesced as the object skimmed the high windswept edge of the clouds.  With the eyes not pressed to the telescope, he watched a luminescent red-gold line draw across the dull-red roiling storm wall. Below, at the tropopause border of the storm, the other filter-miners were pulling back, grouping together and gliding away. They had noticed the phenomenon, and the smart sky-miner didn’t approach a storm that was doing something he didn’t understand.  Lightning was a constant wreath in the storm’s upper regions, and whatever the object or creature was made of, the storm seemed to want to reach out and caress it. Meanwhile, the object played with the wall of the storm, threading it like a needle, as oblivious to those deadly veils of water vapor as it was to the savagery of the lightning strikes. Stormchases had operated a mining skiff—valued work, prestigious work, work he hoped would earn him a place in the Mothergraves’ esteem—for his entire fledged life.  He’d seen skiffs go down, seen daring rescues, seen miners saved from impossible situations and miners who were not. He’d seen recklessness, and skill so great its exercise looked like recklessness.  He’d never seen anyone play with a Deep Storm like this.  It couldn’t last.  It could have been a crosswind, an eddy, the sheer of turbulence. Stormchases would never know. But one moment the black object, streaming its meteor-tail of noble gases, was stitching the flank of the storm—and the next it was tumbling, knocked end over end like the losing flyer of a mating dogfight. Stormchases pulled back from the telescope, watching as the object rolled in a flat, descending spiral like a coiled tree-frond, pulled long.  The object was built like a flyer. It had no pontoons, no broad hull meant to maximize its buoyancy against the pressure gradient of the tropopause. It would fall through, and keep falling—  Stormchases clenched the gunwale of his skiff in tense manipulators, glad when the alien object fell well inside the boundary of the storm-fronting thermal the Drift-Worlds rode. It seemed so wrong: the Mothers floating lazily with their multicolored sides placid in the sun; the object plunging to destruction amid the hells of the deep sky, trailing streamers of neon light.  It was folly to project his own experiences upon something that was not folk, of course—but he couldn’t help it. If the object was a skiff, if the aliens were like folk, he knew they would be at their controls even now. Stormchases felt a great, searing pity.  They were something new, and he didn’t want them to die.  Did they need to?  They had a long way to fall, and they were fighting it. The telescope—still locked on the alien object—glided smoothly in its mount. It would be easy to compute the falling ship’s trajectory. Other skiffs were doing so in order to clear the crash path. Stormchases—  Stormchases pulled up the navigation console, downloaded other skiffs’ telemetry on and calculations of the trajectory of the falling craft, ran his own. The object was slowing, but it was not slowing enough—and he was close enough to the crash path to intercept.  He thought of the Mothergraves. He thought of his rich cargo, the price of acceptance.  He clenched his gills and fired his engines to cross the path of the crash.  Its flat spiral path aided him. He did not need to intercept on this pass, though there would not be too many more opportunities. It was a fortunate thing that the object had a long way to fall. All he had to do was get under it, in front of it, and let the computer and the telescope and the cannon do the rest.  There. Now. Even as he thought it, the skiff’s machines made their own decision. The sail-cannon boomed; the first sail itself was a bright streamer climbing the stratosphere. Stormchases checked his restrains with his manipulators and one eye, aware that he’d left it too late. The other three eyes stayed on the alien object, and the ballistic arc of the rising sail.  It snapped to the end of its line—low, too low, so much lower than such things should be deployed. It seemed enormous as it spread. It was enormous, but Stormchases was not used to seeing a sail so close.  He braced himself, one manipulator hovering over the control to depressurize the cargo capsules strung behind him in a long, jostling tail.  The object fell into the sail. Stormchases had a long moment to watch the bright sail—dappled in vermilion and violet—stretch into a trailing comet tail as it caught and wrapped the projectile. He watched the streamers of the shroud-lines buck at impact; the wave traveling their length.  The stretch and yank snapped Stormchases back against his restraints. He felt the shiver through the frame of the skiff as the shroud-motors released, letting the falling object haul line as if it were a flyer running away with the bait. The object’s spiraling descent became an elongating pendulum arc, and Stormchases hoped it or they had the sense not to struggle. The shroud-lines and the sail stretched, twanged—  —Held. The Mothergraves wove the sails from her own silk; they were the same stuff as her canopies. There was no stronger fiber.  Then the object swung down into the tropopause and splashed through the sea of ammonia clouds, and kept falling.  The sealed skiff jerked after. Stormchases felt the heavy crack through the hull as the pontoons broke. He lost light-sight of the sky above as the clouds closed over. He felt as if he floated against his restraints, though he knew it was just the acceleration of the fall defying gravity.  He struggled to bring his manipulator down. The deeper the object pulled him, the hotter and more pressurized—and more toxic—the atmosphere became. And he wouldn’t trust the skiff’s seals after the jar of that impact.  He depressurized and helium-flushed the first cargo capsule.  When it blew, the skiff shuddered again. That capsule was now a balloon filled with gaseous helium, and it snapped upward, slowing Stormchases’ descent—and the descent of the sail-wrapped alien object. They were still plunging, but now dragging a buoyant makeshift pontoon.  The cables connecting the capsule twanged and plinked ominously. It had been the flaw in his plan; he hadn’t been sure they would hold.  For now, at least, they did.  The pressure outside the hull was growing; not dangerous yet, but creeping upward. Eyes on the display, Stormchases triggered a second capsule. He felt a lighter shudder this time, as the skiff shed a little more velocity. The next question would be if he had enough capsules to stop the fall—and to lift his skiff, and the netted object, back to the tropopause.  His talker babbled at him, his colleagues issuing calls and organizing a party for a rescue to follow his descent. “No rescue,” he said. “This is my risk.”  Another capsule. Another, slighter shiver through the lines. Another incremental slowing.  By the Mothergraves, he thought. This is actually going to work.  When his skiff bobbed back to the tropopause, dangling helplessly beneath a dozen empty, depressurized capsules, Stormchases was unprepared for the cheer that rang over his talker. Or the bigger one that followed, when he winched the sail containing the netted object up through the cloud-sea, into clear air.  Stormchases had no pontoons; his main sail was fouled. The empty capsules would support him, but he could not maneuver—and, in fact, his skiff swung beneath them hull-to-the-side, needle-tipped nose pointing down. Stormchases dangled, bruised and aching, in his restraints, trying to figure out how to loose the straps and start work on freeing himself.  He still wasn’t sure how he’d survived. Or that he’d survived. Maybe this was the last fantasy of a dying mind—  The talker bleated at him.  He jerked against the harness, and moaned. The talker bleated again.  It wasn’t words, and whatever it was, it drowned out the voices of the other miners, who were currently arguing over whether his skiff was salvage, and whether they should come to his assistance if it was. He’d been trying to organize his addled thoughts enough to warn them off. Now he vibrated his membranes and managed a croak that sounded fragile even to his own hearing. “Who is it? What do you want?”  That bleat again, or a modestly different one.  “Are you the alien? I can’t understand you.”  With pained manipulators, Stormchases managed to unfasten his restraints. He dropped from them harder than he had intended; it seemed he couldn’t hold onto the rack. As his carapace struck the forward bulkhead, he made a disgruntled noise.  “Speak Language!” he snarled to the talker as he picked himself up. “I can’t understand you.”  It was mostly an expression of frustration. If they knew Language, they wouldn’t be aliens. But he could not hide his sigh of relief when a deep, coveted voice emerged from the talker instead.  “Be strong, Stormchases,” the Mothergraves said. “All will soon be well.”  He pressed two eyes to the viewport. The clouds around his skiff were bright in the sunlight; he watched the encroaching shadow fall across them like the umbra of an eclipse.  It was the great, welcome shade of the Mothergraves as she drifted out of the sky.  She was coming for them. Coming for him.  It was no small thing, for a Drift-World to drop so much altitude. For a Drift-World the size of the Mothergraves, it was a major undertaking, and not one speedily accomplished. Still, she dropped, flanked by her attendant squadrons of flyers and younger Mothers, tiny shapes flitting between her backs. Any of them could have come for Stormchases more easily, but when they would have moved forward, the Mothergraves gestured them back with her trailing, elegant gestures.  Stormchases occupied the time winching in the sail-net containing the alien object. It was heavy, not buoyant at all. He imagined it must skim through the atmosphere like a dart or a flyer—simply by moving so fast that the aerodynamics of its passage bore it up. He would have liked to disentangle the object from the shroud, but if he did, it would sink like a punctured skiff.  Instead, he amused himself by assessing the damage to his skiff (catastrophic) and answering the alien’s bleats on the talker somewhat at random, though he had not given up on trying to understand what it might be saying. Obviously, it had technology—quite possibly it was technology, and the hard carapace might indeed be the equivalent of his own skiff—a craft, meant for entering a hostile environment.  Had it been sampling the storm for useful chemicals and consumables, as well?  He wondered what aliens ate. What they breathed. He wondered if he could teach them Language.  Every time he looked up, the Mothergraves’ great keel was lower. Finally, her tendrils encompassed his horizons and when he craned his eyes back, he could make out the double row of Mates fused to and dependent from her bellies like so many additional, vestigial tendrils. There were dozens. The oldest had lost all trace of their origins, and were merely smooth nubs sealed to the Mothergraves’ flesh. The newest were still identifiable as the individuals they had been.  Many of the lesser Mothers among her escort dangled Mates from their bellies as well, but none had half so many as the Mothergraves . . . and none were so much as two-thirds of her size.  In frustration, Stormchases squinched himself against the interior of his carapace. So close. He had been so close. And now all he had to show for it was a wrecked skiff and a bleating alien. Now he would have to start over—  He could ask the Mothergraves to release his groom-price to a lesser Mother. He had provided well enough for any of her sisters or daughters to consider him.  But none of them were she.  He only hoped his sacrifice of resources in order to rescue the alien had not angered her. That would be too much to bear—although if she decided to reclaim the loss from his corpse, he supposed at the very least he would die fulfilled . . . if briefly.  The talker squawked again. The alien sounds seemed more familiar; he must be getting used to them.  A few of the Mothergraves’ tendrils touched him, as he had so long anticipated. It was bitterest irony now, but the pleasure of the caress almost made it worthwhile. He braced himself for pain and paralysis . . . but she withheld her sting, and the only pain were the bruises left by his restraints and by impact with the bulkheads of the tumbling skiff.  Now her voice came to him directly, rather than by way of the talker. It filled the air around him and vibrated in the hollows of his body like soft thunder. To his shock and disbelief, she said words of ritual to him; words he had hoped and then despaired to hear.  She said, “For the wealth of the whole, what have you brought us, Stormchases?”  Before he could answer, the talker bleated again. This time, in something like Language—bent, barely comprehensible, accented more oddly than any Language Stormchases had ever heard.  It said, “Hello? You us comprehend?”  “I hear you,” the Mothergraves said. “What do you want?”  A long silence before the answer came. “This we fix. Trade science. Go. Place you give us for repairs?”  The aliens—the object was a skiff, of sorts, and it had as many crew members as Stormchases had eyes—had a machine that translated their bleaty words into Language, given a wise enough sample of it. As the revolutions went by, the machine became more and more proficient, and Stormchases spent more and more time talking to A’lees, their crew member in charge of talking. Their names were just nonsense sounds, not words, which made him wonder how any of them ever knew who he was. And they divided labor up in strange ways, with roles determined not by instar and inheritance but by individual life-courses. They told him a great deal about themselves and their peculiar biology; he reciprocated with the more mundane details of his own. A’lees seemed particularly interested that he would soon Mate, and wished to know as much about the process as he could tell.  The aliens sealed themselves in small flexible habitats—pressure carapaces—to leave their skiff, and for good reason. They were made mostly of water, and they oozed water from their bodies, and the pressure and temperature of the world’s atmosphere would destroy them as surely as the deeps of the sky would crush Stormchases. The atmosphere they breathed was made of inert gases and explosive oxygen, and once their skiff was beached on an open patch of the Mothergraves’ back for repairs, just the leakage of oxygen and water vapor from its airlocks soon poisoned a swath of vegetation for a body-length in any direction.  Stormchases stayed well back from the alien skiff while he had these conversations.  Talking to the aliens was a joy and a burden. The Mothergraves insisted he should be the one to serve as an intermediary. He had experience with them, and the aliens valued that kind of experience—and when he was Mated, that experience would be assimilated into the Mothergraves’ collective mind. It would become a part of her, and a part of all their progeny to follow.  The Mothergraves had told him—in the ritual words—that knowledge and discovery were great offerings, unique offerings. That the opportunity to interact with beings from another world was of greater import to her and her brood than organics, or metals, or substances that she could machine within her great body into the stuff of skiffs and sails and other technology. That she accepted his suit, and honored the courage with which he had pressed it.  And that was why the duty was a burden. Because to be available for the aliens while they made the repairs—to play liaison (their word)—meant putting off the moment of joyous union again. And again. To have been so close, and then so far, and then so close again—  The agony of anticipation, and the fear that it would be snatched from him again, was a form of torture.  A’lees came outside of the alien skiff in her pressure carapace and sat in its water-poisoned circle with her forelimbs wrapped around her drawn-up knees, talking comfortably to Stormchases. She said she was a female, a Mother. But that Mothers of her kind were not so physically different from the males, and that even after they Mated, males continued to go about in the world as independent entities.  “But how do they pass their experiences on to their offspring?” Stormchases asked.  A’lees paused for a long time.  “We teach them,” she said. “Your children inherit your memories?”  “Not memories,” he said. “Experiences.”  She hesitated again. “So you become a part of the Mother. A kind of . . . symbiote. And your offspring with her will have all of her experiences, and yours? But . . . not the memories? How does that work?”  “Is knowledge a memory?” he asked.  “No,” she said confidently. “Memories can be destroyed while skills remain . . . Oh. I think . . . I understand.”  They talked for a little while of the structure of the nets and the Mothers’ canopies, but Stormchases could tell A’lees was not finished thinking about memories. Finally she made a little deflating hiss sound and brought the subject up again.  “I am sad,” A’lees said, “that when we have fixed our sampler and had time to arrange a new mission and come back, you will not be here to talk with us.”  “I will be here,” said Stormchases, puzzled. “I will be mated to the Mothergraves.”  “But it won’t be”—whatever A’lees had been about to say, the translator stammered on it; she continued—“the same. You won’t remember us.”  “The Mothergraves will,” Stormchases assured her.  She drew herself in a little smaller. “It will be a long time before we return.”  Stormchases patted toward the edge of the burn zone. He did not let his manipulators cross it, though. Though he would soon enough lose the use of his manipulators to atrophy, he didn’t feel the need to burn them off prematurely. “It’s all right, A’lees,” he said. “We will remember you by the scar.”  Whatever the sound she made next meant, the translator could not manage it.    Originally published in Edge of Infinity, edited by Jonathan Strahan. Elizabeth Bear was born on the same day as Frodo and Bilbo Baggins, but in a different year. She is the Hugo, Sturgeon, Locus, and Campbell Award winning author of over 25 novels, most recently The Red-Stained Wings (Tor Books) and over a hundred short stories. She lives in Massachusetts with her partner, writer Scott Lynch, three adventurous cats, and an elderly and opinionated dog.", "text": "5520 words, short story, REPRINT\nThe Deeps of the Sky\nStormchases’ little skiff skipped and glided across the tropopause, skimming the denser atmosphere of the warm cloud-sea beneath, running before a fierce wind. The skiff’s hull was broad and shallow, supported by buoyant pontoons, the whole designed to float atop the heavy, opaque atmosphere beneath. Stormchases had shot the sails high into the stratosphere and good winds blew the skiff onward, against the current of the dark belt beneath.\nAhead, the vast ruddy wall of a Deep Storm loomed, the base wreathed in shreds of tossing white mist: caustic water clouds churned up from deep in the deadly, layered troposphere. The Deep Storm stretched from horizon to horizon, disappearing at either end in a blur of perspective and atmospheric haze. Its breadth was so great as to make even its massive height seem insignificant, though the billowing ammonia cloud wall was smeared flat-topped by stratospheric winds where it broke the tropopause.\nThe storm glowed with the heat of the deep atmosphere, other skiffs silhouetted cool against it. Their chatter rang over Stormchases’ talker. Briefly, he leaned down to the pickup and greeted his colleagues. His competition. Many of them came from the same long lines of miners that he did; many carried the same long-hoarded knowledge.\nBut Stormchases was determined that, with the addition of his own skill and practice, he would be among the best sky-miners of them all.\nBehind and above, clear skies showed a swallowing indigo, speckled with bright stars. The hurtling crescents of a dozen or so of the moons were currently visible, as was the searing pinpoint of the world’s primary—so bright it washed out nearby stars. Warmth made the sky glow too, the variegated brightness of the thermosphere far above. Stormchases’ thorax squeezed with emotion as he gazed upon the elegant canopies of a group of Drift-Worlds rising in slow sunlit coils along the warm vanguard of the Deep Storm, their colors bright by sunlight, their silhouettes dark by thermal sense.\nHe should not look; he should not hope. But there—a distance-hazed shape behind her lesser daughters and sisters, her great canopy dappled in sheeny gold and violet—soared the Mothergraves. Stormchases was too far and too low to see the teeming ecosystem she bore on her vast back, up high above the colorful clouds where the sunlight could reach and nurture them. He could just make out the color variations caused by the dripping net-roots of veil trees that draped the Mothergraves’ sides, capturing life-giving ammonia from the atmosphere and drawing it in to plump leaves and firm nutritious fruit.\nStormchases arched his face up to her, eyes shivering with longing. His wings hummed against his back. There was no desire like the pain of being separate from the Mothergraves, no need like the need to go to her. But he must resist it. He must brave the Deep Storm and harvest it, and perhaps then she would deem him worthy to be one of hers. He had the provider-status to pay court to one of the younger Drift-Worlds . . . but they could not give his young the safety and stability that a berth on the greatest and oldest of the Mothers would.\nIn the hot deeps of the sky, too high even for the Mothers and their symbiotic colony-flyers or too low even for the boldest and most intrepid of Stormchases’ brethren, other things lived.\nAbove were other kinds of flyers and the drifters, winged or buoyant or merely infinitesimal things that could not survive even the moderate pressure and chill of the tropopause. Below, swimmers dwelled in the ammoniated thicks of the mid-troposphere that never knew the light of stars or sun. They saw only thermally. They could endure massive pressures, searing temperatures, and the lashings of molten water and even oxygen, the gas so reactive that it could set an exhalation on fire. That environment would crush Stormchases to a pulp, dissolve his delicate wing membranes, burn him from the gills to the bone.\nStormchases’ folk were built for more moderate climes—the clear skies and thick, buoying atmosphere of the tropopause, where life flourished and the skies were full of food. But even here, in this temperate part of the sky, survival required a certain element of risk. And there were things that could only be mined where a Deep Storm pulled them up through the layers of atmosphere to an accessible height.\nWhich was why Stormchases sailed directly into the lowering wings of the Deep Storm, one manipulator on the skiff’s controls, the other watching the perspective-shrunken sail shimmering so high above. Flyers would avoid the cable, which was monofilament spun into an intentionally refractive, high-visibility lattice with good tensile properties. But the enormous, translucent-bodied Drift-Worlds were not nimble. Chances were good that the Mother would survive a sail-impact, albeit with some scars—and some damage to the sky-island ecosystems she carried on her backs—and the skiff would likely hold together through such an incident. If he tangled a Mother in the monofilament shroud-lines spun from the same material that reinforced the Drift-World’s great canopies . . . it didn’t bear thinking of. That was why the lines were so gaily streamered: so anyone could see them from afar.\nIf Stormchases lost the skiff, it would just be a long flight home and probably a period of indenture to another miner until he could earn another, and begin proving himself again. But injuring a Mother, even a minor one who floated low, would be the end of his hopes to serve the Mothergraves.\nSo he watched the cable, and the overhead skies. And—of course—the storm.\nStormchases could smell the Deep Storm now, the dank corrosive tang of water vapor stinging his gills. The richly colored billows of the Deep Storm proved it had something to give. The storm’s dark-red wall churned, marking the boundary of a nearly-closed atmospheric cell rich with rare elements and compounds pumped up from the deeps. Soon, Stormchases would don his protective suit, seal the skiff, and begin the touchy business—so close to the storm—of hauling in the sail. The prevailing wind broke around the Deep Storm, eddying and compacting as it sped past those towering clouds. The air currents there were even more dangerous and unnavigable than those at the boundary between the world’s temperate and subtropical zones, where two counter-rotating bands of wind met and sheared against each other.\nAnd Stormchases was going to pass through it.\nOnce the sail was stowed, Stormchases would maneuver the skiff closer under engine power—as close as those cool silhouettes ahead—and begin harvesting. But he would not be cowed by the storm wall. Could not be, if he hoped to win a berth on the Mothergraves.\nHe would brave the outer walls of the storm itself. He had the skill; he had the ancestral knowledge. The reward for his courage would be phosphates, silicates, organic compounds. Iron. Solid things, from which technologies like his skiff were built. Noble gases. And fallers, the tiny creatures that spent their small lives churned in the turbulence of the Deep Storm, and which were loaded with valuable nutrition and trace elements hard to obtain, for the unfledged juveniles who lived amid the roots and foliage and trapped organics of the Drift-World ecosystems.\nThe Deep Storm was a rich, if deadly, resource. With its treasures, he would purchase his place on the Mothergraves.\nStormchases streamed current weather data, forecasts and predictions. He tuned into the pulsed-light broadcasts of the skiffs already engaged in harvesting, and set about making himself ready.\nThe good news about Deep Storms was that they were extraordinarily stable, and the new information didn’t tell Stormchases much that he could not have anticipated. Still, there was always a thrill of unease as one made ready for a filtering run. A little too far, and—well, everyone knew or knew of somebody who had been careless at the margin of a storm and sucked into the depths of its embrace. A skiff couldn’t survive that, and a person definitely couldn’t. If the molten water didn’t cauterize flesh from carapace, convective torrents would soon drag one down into the red depths of the atmosphere, to be melted and crushed and torn.\nIt was impossible to be too careful, sky-mining.\nStormchases checked the skiff’s edge seals preliminary to locking down. Water could insinuate through a tiny gap and spray under the pressure of winds, costing an unwary or unlucky operator an eye. Too many sky-miners bore the scars of its caustic burns on their carapaces and manipulators.\nA careful assessment showed the seals to be intact. Behind the skiff, the long cluster of cargo capsules bumped and swung. Empty, they were buoyant, and tended to drag the skiff upwards, forcing Stormchases to constant adjustments of the trim. He dropped a sky-anchor and owner-beacon to hold the majority of the cargo capsules, loaded one into the skiff’s dock with the magnetic claw, and turned the little vessel toward the storm.\nSiphons contracted, feeling each heave of the atmosphere, Stormchases slid quickly but cautiously into the turbulent band surrounding the storm. It would be safer to match the wind’s velocity before he made the transition to within-the-storm itself, but his little skiff did not have that much power. Instead, it was built to catch the wind and self-orient, using the storm itself for stability rather than being tumbled and tossed like a thrown flyer’s egg.\nStormchases fixed his restraint harness to the tightest setting. He brought the skiff alongside the cloud wall, then deflated and retracted the pontoons, leaving the skiff less buoyant but far more streamlined. Holding hope in his mind—hope, because the Mothergraves taught that intention affected outcome—Stormchases took a deep breath, smelled the tang of methane on his exhalation, and slipped the skiff into the storm.\nThe wind hit the skiff in a torrent. Through long experience, Stormchases’ manipulators stayed soft on the controls. He let them vibrate against his skin, but held them steady—gently, gently, without too much pressure but without yielding to the wrath of the storm. The skiff tumbled for a moment as it made the transition; he regained trim and steadied it, bringing its pointed nose around to part the wind that pushed it. It shivered—feeling alive as the sun-warmed hide of the Mother upon whose broad back Stormchases had grown—and steadied. Stormchases guided it with heat-sight only. Here in the massive swirl of the cloud wall, the viewports showed him only the skiff’s interior lighting reflecting off the featureless red clouds of the storm, as if he and his rugged little ship were swaddled in an uncle’s wings.\nA peaceful image, for a thing that would kill him in instants. If he went too far in, the winds would rip his tiny craft apart around him. If he got too close to the wall, turbulence could send him spinning out of control.\nWhen the skiff finally floated serenely amidst the unending gyre, Stormchases opened the siphons. He felt the skiff belly and wallow as the wind filled it, then the increased stability as the filters activated and the capsule filled.\nIt didn’t take long; the storm was pumping a rich mix of resources. When the capsule reached its pressurized capacity, Stormchases sealed the siphons again. Still holding his position against the fury of the winds, he tested the responses of the laden skiff. It was heavier, sluggish—but as responsive as he could have hoped.\nHe brought her out of the fog of red and gray, under a clear black sky. A bit of turbulence caught his wingtip as he slipped away, and it sent the skiff spinning flat like a spat seed across the tropopause. Other skiffs scattered like a swarm of infant cloud-skaters before a flyer’s dive. Shaken, the harness bruising the soft flesh at his joints, Stormchases got control of the skiff and brought her around on a soft loop. His talker exploded with the whoops of other miners; mingled appreciation and teasing.\nThere was his beacon. He deployed pontoons to save energy and skimmed the atmosphere over to exchange capsules.\nThen he turned to the storm, and went back to do it again.\nStormchases had secured his full capsules and was still rechecking the skiff’s edge-seals, preliminary to popping the craft open, when he caught sight of a tiny speck of a shadow descending along the margin of the storm. Something sharp-nosed and hot enough to be uncomfortable to look upon . . .\nStormchases scrambled for the telescope as the speck dropped toward the Deep Storm. It locked and tracked; he pressed two eyes to the viewers and found himself regarding a sleek black . . . something, a glossy surface he could not name. Nor could he make out any detail of shape. The autofocus had locked too close, and as he backed it off the object slipped into the edge of the Deep Storm.\nBigger than a flyer—bigger even than folk and nothing with any sense would get that close to the smeary pall of water vapor without protective gear. It looked a little like a flyer, though—a curved, streamlined wing shape with a dartlike nose. But the wings didn’t flap as it descended, banking wide on the cushion of air before the storm, curving between the scudding masses of the herd of Drift-Worlds.\nIt was like nothing Stormchases had ever seen.\nIts belly was bright-hot, hot enough to spark open flame if it brushed oxygen, but as it banked Stormchases saw that the back was cold, black-cold against the warmth of the high sky, so dark and chill it seemed a band of brightness delineated it—but that was only the contrast with the soaking heat from the thermosphere. Stormchases had always had an interest in xenophysics. He felt his wings furl with shock as he realised that the object might show that heat-pattern if it had warmed its belly with friction as it entered the atmosphere, but the upper part were still breath-stealing cold with the chill of the deep sky.\nWas it a ship, and not an animal? A . . . skiff of some kind?\nAn alien?\nLightning danced around the object, caught and caressed it like a Mother’s feeding tendrils caging a Mate—and then seemed to get caught there, netting and streaking the black hide with rills of savage, glowing vermillion and radiant gold. The wind of the object’s passage blew the shimmers off the trailing edge of its wings; shining vapor writhed in curls in the turbulence of its wake.\nStormchases caught his breath. Neon and helium rain, condensing upon the object’s hard skin, energized by the lightning, luminesced as the object skimmed the high windswept edge of the clouds.\nWith the eyes not pressed to the telescope, he watched a luminescent red-gold line draw across the dull-red roiling storm wall. Below, at the tropopause border of the storm, the other filter-miners were pulling back, grouping together and gliding away. They had noticed the phenomenon, and the smart sky-miner didn’t approach a storm that was doing something he didn’t understand.\nLightning was a constant wreath in the storm’s upper regions, and whatever the object or creature was made of, the storm seemed to want to reach out and caress it. Meanwhile, the object played with the wall of the storm, threading it like a needle, as oblivious to those deadly veils of water vapor as it was to the savagery of the lightning strikes. Stormchases had operated a mining skiff—valued work, prestigious work, work he hoped would earn him a place in the Mothergraves’ esteem—for his entire fledged life.\nHe’d seen skiffs go down, seen daring rescues, seen miners saved from impossible situations and miners who were not. He’d seen recklessness, and skill so great its exercise looked like recklessness.\nHe’d never seen anyone play with a Deep Storm like this.\nIt couldn’t last.\nIt could have been a crosswind, an eddy, the sheer of turbulence. Stormchases would never know. But one moment the black object, streaming its meteor-tail of noble gases, was stitching the flank of the storm—and the next it was tumbling, knocked end over end like the losing flyer of a mating dogfight. Stormchases pulled back from the telescope, watching as the object rolled in a flat, descending spiral like a coiled tree-frond, pulled long.\nThe object was built like a flyer. It had no pontoons, no broad hull meant to maximize its buoyancy against the pressure gradient of the tropopause. It would fall through, and keep falling—\nStormchases clenched the gunwale of his skiff in tense manipulators, glad when the alien object fell well inside the boundary of the storm-fronting thermal the Drift-Worlds rode. It seemed so wrong: the Mothers floating lazily with their multicolored sides placid in the sun; the object plunging to destruction amid the hells of the deep sky, trailing streamers of neon light.\nIt was folly to project his own experiences upon something that was not folk, of course—but he couldn’t help it. If the object was a skiff, if the aliens were like folk, he knew they would be at their controls even now. Stormchases felt a great, searing pity.\nThey were something new, and he didn’t want them to die.\nDid they need to?\nThey had a long way to fall, and they were fighting it. The telescope—still locked on the alien object—glided smoothly in its mount. It would be easy to compute the falling ship’s trajectory. Other skiffs were doing so in order to clear the crash path. Stormchases—\nStormchases pulled up the navigation console, downloaded other skiffs’ telemetry on and calculations of the trajectory of the falling craft, ran his own. The object was slowing, but it was not slowing enough—and he was close enough to the crash path to intercept.\nHe thought of the Mothergraves. He thought of his rich cargo, the price of acceptance.\nHe clenched his gills and fired his engines to cross the path of the crash.\nIts flat spiral path aided him. He did not need to intercept on this pass, though there would not be too many more opportunities. It was a fortunate thing that the object had a long way to fall. All he had to do was get under it, in front of it, and let the computer and the telescope and the cannon do the rest.\nThere. Now. Even as he thought it, the skiff’s machines made their own decision. The sail-cannon boomed; the first sail itself was a bright streamer climbing the stratosphere. Stormchases checked his restrains with his manipulators and one eye, aware that he’d left it too late. The other three eyes stayed on the alien object, and the ballistic arc of the rising sail.\nIt snapped to the end of its line—low, too low, so much lower than such things should be deployed. It seemed enormous as it spread. It was enormous, but Stormchases was not used to seeing a sail so close.\nHe braced himself, one manipulator hovering over the control to depressurize the cargo capsules strung behind him in a long, jostling tail.\nThe object fell into the sail. Stormchases had a long moment to watch the bright sail—dappled in vermilion and violet—stretch into a trailing comet tail as it caught and wrapped the projectile. He watched the streamers of the shroud-lines buck at impact; the wave traveling their length.\nThe stretch and yank snapped Stormchases back against his restraints. He felt the shiver through the frame of the skiff as the shroud-motors released, letting the falling object haul line as if it were a flyer running away with the bait. The object’s spiraling descent became an elongating pendulum arc, and Stormchases hoped it or they had the sense not to struggle. The shroud-lines and the sail stretched, twanged—\n—Held. The Mothergraves wove the sails from her own silk; they were the same stuff as her canopies. There was no stronger fiber.\nThen the object swung down into the tropopause and splashed through the sea of ammonia clouds, and kept falling.\nThe sealed skiff jerked after. Stormchases felt the heavy crack through the hull as the pontoons broke. He lost light-sight of the sky above as the clouds closed over. He felt as if he floated against his restraints, though he knew it was just the acceleration of the fall defying gravity.\nHe struggled to bring his manipulator down. The deeper the object pulled him, the hotter and more pressurized—and more toxic—the atmosphere became. And he wouldn’t trust the skiff’s seals after the jar of that impact.\nHe depressurized and helium-flushed the first cargo capsule.\nWhen it blew, the skiff shuddered again. That capsule was now a balloon filled with gaseous helium, and it snapped upward, slowing Stormchases’ descent—and the descent of the sail-wrapped alien object. They were still plunging, but now dragging a buoyant makeshift pontoon.\nThe cables connecting the capsule twanged and plinked ominously. It had been the flaw in his plan; he hadn’t been sure they would hold.\nFor now, at least, they did.\nThe pressure outside the hull was growing; not dangerous yet, but creeping upward. Eyes on the display, Stormchases triggered a second capsule. He felt a lighter shudder this time, as the skiff shed a little more velocity. The next question would be if he had enough capsules to stop the fall—and to lift his skiff, and the netted object, back to the tropopause.\nHis talker babbled at him, his colleagues issuing calls and organizing a party for a rescue to follow his descent. “No rescue,” he said. “This is my risk.”\nAnother capsule. Another, slighter shiver through the lines. Another incremental slowing.\nBy the Mothergraves, he thought. This is actually going to work.\nWhen his skiff bobbed back to the tropopause, dangling helplessly beneath a dozen empty, depressurized capsules, Stormchases was unprepared for the cheer that rang over his talker. Or the bigger one that followed, when he winched the sail containing the netted object up through the cloud-sea, into clear air.\nStormchases had no pontoons; his main sail was fouled. The empty capsules would support him, but he could not maneuver—and, in fact, his skiff swung beneath them hull-to-the-side, needle-tipped nose pointing down. Stormchases dangled, bruised and aching, in his restraints, trying to figure out how to loose the straps and start work on freeing himself.\nHe still wasn’t sure how he’d survived. Or that he’d survived. Maybe this was the last fantasy of a dying mind—\nThe talker bleated at him.\nHe jerked against the harness, and moaned. The talker bleated again.\nIt wasn’t words, and whatever it was, it drowned out the voices of the other miners, who were currently arguing over whether his skiff was salvage, and whether they should come to his assistance if it was. He’d been trying to organize his addled thoughts enough to warn them off. Now he vibrated his membranes and managed a croak that sounded fragile even to his own hearing. “Who is it? What do you want?”\nThat bleat again, or a modestly different one.\n“Are you the alien? I can’t understand you.”\nWith pained manipulators, Stormchases managed to unfasten his restraints. He dropped from them harder than he had intended; it seemed he couldn’t hold onto the rack. As his carapace struck the forward bulkhead, he made a disgruntled noise.\n“Speak Language!” he snarled to the talker as he picked himself up. “I can’t understand you.”\nIt was mostly an expression of frustration. If they knew Language, they wouldn’t be aliens. But he could not hide his sigh of relief when a deep, coveted voice emerged from the talker instead.\n“Be strong, Stormchases,” the Mothergraves said. “All will soon be well.”\nHe pressed two eyes to the viewport. The clouds around his skiff were bright in the sunlight; he watched the encroaching shadow fall across them like the umbra of an eclipse.\nIt was the great, welcome shade of the Mothergraves as she drifted out of the sky.\nShe was coming for them. Coming for him.\nIt was no small thing, for a Drift-World to drop so much altitude. For a Drift-World the size of the Mothergraves, it was a major undertaking, and not one speedily accomplished. Still, she dropped, flanked by her attendant squadrons of flyers and younger Mothers, tiny shapes flitting between her backs. Any of them could have come for Stormchases more easily, but when they would have moved forward, the Mothergraves gestured them back with her trailing, elegant gestures.\nStormchases occupied the time winching in the sail-net containing the alien object. It was heavy, not buoyant at all. He imagined it must skim through the atmosphere like a dart or a flyer—simply by moving so fast that the aerodynamics of its passage bore it up. He would have liked to disentangle the object from the shroud, but if he did, it would sink like a punctured skiff.\nInstead, he amused himself by assessing the damage to his skiff (catastrophic) and answering the alien’s bleats on the talker somewhat at random, though he had not given up on trying to understand what it might be saying. Obviously, it had technology—quite possibly it was technology, and the hard carapace might indeed be the equivalent of his own skiff—a craft, meant for entering a hostile environment.\nHad it been sampling the storm for useful chemicals and consumables, as well?\nHe wondered what aliens ate. What they breathed. He wondered if he could teach them Language.\nEvery time he looked up, the Mothergraves’ great keel was lower. Finally, her tendrils encompassed his horizons and when he craned his eyes back, he could make out the double row of Mates fused to and dependent from her bellies like so many additional, vestigial tendrils. There were dozens. The oldest had lost all trace of their origins, and were merely smooth nubs sealed to the Mothergraves’ flesh. The newest were still identifiable as the individuals they had been.\nMany of the lesser Mothers among her escort dangled Mates from their bellies as well, but none had half so many as the Mothergraves . . . and none were so much as two-thirds of her size.\nIn frustration, Stormchases squinched himself against the interior of his carapace. So close. He had been so close. And now all he had to show for it was a wrecked skiff and a bleating alien. Now he would have to start over—\nHe could ask the Mothergraves to release his groom-price to a lesser Mother. He had provided well enough for any of her sisters or daughters to consider him.\nBut none of them were she.\nHe only hoped his sacrifice of resources in order to rescue the alien had not angered her. That would be too much to bear—although if she decided to reclaim the loss from his corpse, he supposed at the very least he would die fulfilled . . . if briefly.\nThe talker squawked again. The alien sounds seemed more familiar; he must be getting used to them.\nA few of the Mothergraves’ tendrils touched him, as he had so long anticipated. It was bitterest irony now, but the pleasure of the caress almost made it worthwhile. He braced himself for pain and paralysis . . . but she withheld her sting, and the only pain were the bruises left by his restraints and by impact with the bulkheads of the tumbling skiff.\nNow her voice came to him directly, rather than by way of the talker. It filled the air around him and vibrated in the hollows of his body like soft thunder. To his shock and disbelief, she said words of ritual to him; words he had hoped and then despaired to hear.\nShe said, “For the wealth of the whole, what have you brought us, Stormchases?”\nBefore he could answer, the talker bleated again. This time, in something like Language—bent, barely comprehensible, accented more oddly than any Language Stormchases had ever heard.\nIt said, “Hello? You us comprehend?”\n“I hear you,” the Mothergraves said. “What do you want?”\nA long silence before the answer came. “This we fix. Trade science. Go. Place you give us for repairs?”\nThe aliens—the object was a skiff, of sorts, and it had as many crew members as Stormchases had eyes—had a machine that translated their bleaty words into Language, given a wise enough sample of it. As the revolutions went by, the machine became more and more proficient, and Stormchases spent more and more time talking to A’lees, their crew member in charge of talking. Their names were just nonsense sounds, not words, which made him wonder how any of them ever knew who he was. And they divided labor up in strange ways, with roles determined not by instar and inheritance but by individual life-courses. They told him a great deal about themselves and their peculiar biology; he reciprocated with the more mundane details of his own. A’lees seemed particularly interested that he would soon Mate, and wished to know as much about the process as he could tell.\nThe aliens sealed themselves in small flexible habitats—pressure carapaces—to leave their skiff, and for good reason. They were made mostly of water, and they oozed water from their bodies, and the pressure and temperature of the world’s atmosphere would destroy them as surely as the deeps of the sky would crush Stormchases. The atmosphere they breathed was made of inert gases and explosive oxygen, and once their skiff was beached on an open patch of the Mothergraves’ back for repairs, just the leakage of oxygen and water vapor from its airlocks soon poisoned a swath of vegetation for a body-length in any direction.\nStormchases stayed well back from the alien skiff while he had these conversations.\nTalking to the aliens was a joy and a burden. The Mothergraves insisted he should be the one to serve as an intermediary. He had experience with them, and the aliens valued that kind of experience—and when he was Mated, that experience would be assimilated into the Mothergraves’ collective mind. It would become a part of her, and a part of all their progeny to follow.\nThe Mothergraves had told him—in the ritual words—that knowledge and discovery were great offerings, unique offerings. That the opportunity to interact with beings from another world was of greater import to her and her brood than organics, or metals, or substances that she could machine within her great body into the stuff of skiffs and sails and other technology. That she accepted his suit, and honored the courage with which he had pressed it.\nAnd that was why the duty was a burden. Because to be available for the aliens while they made the repairs—to play liaison (their word)—meant putting off the moment of joyous union again. And again. To have been so close, and then so far, and then so close again—\nThe agony of anticipation, and the fear that it would be snatched from him again, was a form of torture.\nA’lees came outside of the alien skiff in her pressure carapace and sat in its water-poisoned circle with her forelimbs wrapped around her drawn-up knees, talking comfortably to Stormchases. She said she was a female, a Mother. But that Mothers of her kind were not so physically different from the males, and that even after they Mated, males continued to go about in the world as independent entities.\n“But how do they pass their experiences on to their offspring?” Stormchases asked.\nA’lees paused for a long time.\n“We teach them,” she said. “Your children inherit your memories?”\n“Not memories,” he said. “Experiences.”\nShe hesitated again. “So you become a part of the Mother. A kind of . . . symbiote. And your offspring with her will have all of her experiences, and yours? But . . . not the memories? How does that work?”\n“Is knowledge a memory?” he asked.\n“No,” she said confidently. “Memories can be destroyed while skills remain . . . Oh. I think . . . I understand.”\nThey talked for a little while of the structure of the nets and the Mothers’ canopies, but Stormchases could tell A’lees was not finished thinking about memories. Finally she made a little deflating hiss sound and brought the subject up again.\n“I am sad,” A’lees said, “that when we have fixed our sampler and had time to arrange a new mission and come back, you will not be here to talk with us.”\n“I will be here,” said Stormchases, puzzled. “I will be mated to the Mothergraves.”\n“But it won’t be”—whatever A’lees had been about to say, the translator stammered on it; she continued—“the same. You won’t remember us.”\n“The Mothergraves will,” Stormchases assured her.\nShe drew herself in a little smaller. “It will be a long time before we return.”\nStormchases patted toward the edge of the burn zone. He did not let his manipulators cross it, though. Though he would soon enough lose the use of his manipulators to atrophy, he didn’t feel the need to burn them off prematurely. “It’s all right, A’lees,” he said. “We will remember you by the scar.”\nWhatever the sound she made next meant, the translator could not manage it.\nOriginally published in Edge of Infinity, edited by Jonathan Strahan.\nElizabeth Bear was born on the same day as Frodo and Bilbo Baggins, but in a different year. She is the Hugo, Sturgeon, Locus, and Campbell Award winning author of over 25 novels, most recently The Red-Stained Wings (Tor Books) and over a hundred short stories. She lives in Massachusetts with her partner, writer Scott Lynch, three adventurous cats, and an elderly and opinionated dog.", "source": "https://clarkesworldmagazine.com/bear_06_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Deeps of the Sky by Elizabeth Bear"}