{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "E C Ambrose", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SX1sKhjIKtkeFJ2s43AQqs4VwIw=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Spoiler Alert!  How would you feel if someone revealed the ending of a story before you’d read it? Most of us say we’d be angry. We have even established protocols to prevent having a story “spoiled,” and the term “spoiler alert” has entered common parlance. So recent research like the study at the University of California at San Diego suggesting that many people enjoy a story more when they already know the ending seems counter-intuitive.  Aren’t people coming to fiction for plot: to follow an exciting series of events to a surprising, yet appropriate, conclusion? The UCSD experiment says otherwise—and I believe they’re right. The history of heroic fiction is full of spoilers, often employed directly by the authors themselves, and there are two key reasons why spoilers work to make a work more enjoyable.  Let me give you an example. A careful reading of J. R. R. Tolkien’s The Fellowship of the Ring, reveals a heap of spoilers at the end of the prologue, in a section entitled “Note on the Shire Records.” The conceit of the prologue is that Tolkien is merely organizing and presenting a comprehensive version of a tale told in some older works.  During the course of this academic note, we learn who lives (almost everyone), who marries whom, who has children (and who does not), who becomes king, and who leaves Middle Earth forever. Tolkien reveals the happy endings and hints at the bittersweet ones for most of the protagonists you are about to meet. What is he up to? First of all, he wants to present the narrative as an epistolary text with a historical context. He intended his Middle Earth to be an invented history or mythology for England, and this academic and contextual approach enhances that impression. You don’t read history for plot, so the spoilers reinforce the notion that this is part of the historical record with which the reader may already be familiar.  The information that everybody lives and Aragorn/Elessar is king should reduce the tension of reading the book, shouldn’t it? However, it does not, and I’m willing to bet most readers of the work have forgotten this section even exists. I suspect, in part, that Tolkien wanted to reassure his readers—just as the grandfather in The Princess Bride tells his grandson that the princess “doesn’t get eaten by the eels at this time.”  Tolkien is letting us know that things will turn out well, in spite of all of the hardships these characters are about to endure. By relieving some of the tension of plot upfront, the author directs the reader’s attention to other, more important matters than mere life and death: he invites the reader to explore the work more fully beyond that concern.  However, the spoilers have another effect altogether. We skim over them because, at this point, we simply don’t care. We don’t care who lives or dies, who is king, who is married and who is not. The first time the reader encounters this passage, the names are meaningless and somewhat jumbled. The Aragorn/Elessar connection is not made clear, nor is “Steward of Gondor” a freighted title as it later will be. Readers of The Hobbit might be surprised and disappointed to find that Elrond will leave Rivendell, but first-timers have no connection to that name or place. Far from embedding his work in a dusty old book, Tolkien rather acknowledges that the writer’s first duty is, in fact, to make the reader care. Until and unless the reader is invested in the characters who take the journey, plot spoilers have little impact.  Which brings me to my second point: Spoilers are a declaration of authorial mastery. By telling the reader the ending in advance, Tolkien announces his ability to make you care. The spoiler proclaims to the world that Tolkien is going to do his job so well that you won’t care if you know the plot, you will be desperate to keep reading.  Tolkien is not only an author of fantasy, and an academic writer, he is a student of the early history of story-telling. In many nations, the tradition of the bard includes spoilers up-front, in the form of a brief summary of the events about to occur. “Let me tell you the tale of the great hero, who encounters a dragon, rescues a maiden, and wins her hand in marriage.” Is the audience now done with the story, because the plot is laid out in plain language? Not even begun! The spoiler signals that something exciting is going to happen, and you’ll enjoy the journey—even if know where you’re going to end up.  In the case of many popular oral tales, even before the bard presented his summary, the audience already knew the stories. Written forms of epics like Beowulf proclaim the fame of their heroes even from birth, with the expectation that the listener has already heard the story. The Arthurian legends provide a far-reaching example. Generations of tellers elaborated upon them, with new characters added and old characters changing roles through the next several hundred years, but the basic plot remains the same. The listeners of those medieval bards already knew the story, just as the readers of contemporary Arthurian novels know the plot today.  The spoiler has always been both paternalistic and self-serving on behalf of the story-teller. Spoilers allow the reader a chance to relax and give their full attention to character, theme and authorial vision, the true skills the author wishes to display. It is not what is said that matters, but how it is said, and ultimately, by whom. Many Arthurian novels never transcend their plot, due to their less skillful authors.  In critique groups, the remark is often made that keeping secrets from the reader lessens the tension of the work, because the reader is more distant from the characters, and doesn’t have a chance to worry about how the character will overcome their problems. Note: it’s not what the problem is, or the fact that it will be overcome that readers worry about. I think the spoilers that people object to are not the significant points of plot, but rather the surprises the author embeds on the way to those points. Readers in most genres expect a happy ending—even if it’s bittersweet—and will receive it from an author who wants them to buy the next book. The astute reader expects that Frodo survives and that the ring is destroyed, but the manner of its destruction is meant to be startling. Again, it isn’t the what that’s important, but rather how it happens.  Perhaps the clearest evidence that readers don’t mind spoilers is found their own reading habits. There are some readers who never re-read a book, but there are many who do, who return to their favorite narratives over and over, never losing their love for the work simply because they know the ending already.  Authors play with spoilers in different ways. One version in contemporary fiction is that of a frame narrative, often employed with a first-person narrator. Even having a first-person narrator describing events in the past is a sort of spoiler, and some authors use this device to deliberately set up tension between the parts of a narrative. In Patrick Rothfuss’s The Name of the Wind, he lays out a tale you might have heard, then proceeds to allow the hero to tell you the truth—the story from the inside, which will be somewhat different from the legend.  Mary Doria Russell’s The Sparrow, uses a spoiler structure by introducing the end of the story—the return of a single traveler from a failed voyage—then folding the story in half, building tension between the optimistic beginning of a more traditional space-travel narrative and the aftermath of the ruined trip. By revealing parts of the story to come, she makes the reader eager to know what happened in the middle, the event that links the two halves. Titles like King Javan’s Year, by Katherine Kurtz, or The Wreck of the River of Stars, by Michael Flynn, spoil the end of the work, but also serve as teasers to draw in the reader and give him or her something to worry about.  In each case, the author deliberately reveals something the ordinary narrative view would have kept secret, displaying it as a promise to the reader that the plot is not the purpose of the work. Nicholas Christenfeld, professor of social psychology and one of the authors of the UCSD study is quoted as saying, “What the plot is is (almost) irrelevant. The pleasure is in the writing.”  The great tellers know this. They tease the audience with spoilers, information that should change the experience of the work, but which, instead, draws the reader even closer, manipulating the tension of the tale, until you are so invested in what you are reading, that you even forget you already know how it ends. E. C. Ambrose is the author of \"The Dark Apostle\" historical fantasy series about a medieval barber surgeon to start in July 2013 with Elisha Barber from DAW books. E. C. blogs about history, fantasy and writing at www.wordpress.com/ecambrose and can also be found on twitter @ecambrose. E. C. spends too much time in a tiny office in New England with a mournful black lab lurking under the desk.", "text": "Non-Fiction\nAnother Word: Spoiler Alert!\nHow would you feel if someone revealed the ending of a story before you’d read it? Most of us say we’d be angry. We have even established protocols to prevent having a story “spoiled,” and the term “spoiler alert” has entered common parlance. So recent research like the study at the University of California at San Diego suggesting that many people enjoy a story more when they already know the ending seems counter-intuitive.\nAren’t people coming to fiction for plot: to follow an exciting series of events to a surprising, yet appropriate, conclusion? The UCSD experiment says otherwise—and I believe they’re right. The history of heroic fiction is full of spoilers, often employed directly by the authors themselves, and there are two key reasons why spoilers work to make a work more enjoyable.\nLet me give you an example. A careful reading of J. R. R. Tolkien’s The Fellowship of the Ring, reveals a heap of spoilers at the end of the prologue, in a section entitled “Note on the Shire Records.” The conceit of the prologue is that Tolkien is merely organizing and presenting a comprehensive version of a tale told in some older works.\nDuring the course of this academic note, we learn who lives (almost everyone), who marries whom, who has children (and who does not), who becomes king, and who leaves Middle Earth forever. Tolkien reveals the happy endings and hints at the bittersweet ones for most of the protagonists you are about to meet. What is he up to? First of all, he wants to present the narrative as an epistolary text with a historical context. He intended his Middle Earth to be an invented history or mythology for England, and this academic and contextual approach enhances that impression. You don’t read history for plot, so the spoilers reinforce the notion that this is part of the historical record with which the reader may already be familiar.\nThe information that everybody lives and Aragorn/Elessar is king should reduce the tension of reading the book, shouldn’t it? However, it does not, and I’m willing to bet most readers of the work have forgotten this section even exists. I suspect, in part, that Tolkien wanted to reassure his readers—just as the grandfather in The Princess Bride tells his grandson that the princess “doesn’t get eaten by the eels at this time.”\nTolkien is letting us know that things will turn out well, in spite of all of the hardships these characters are about to endure. By relieving some of the tension of plot upfront, the author directs the reader’s attention to other, more important matters than mere life and death: he invites the reader to explore the work more fully beyond that concern.\nHowever, the spoilers have another effect altogether. We skim over them because, at this point, we simply don’t care. We don’t care who lives or dies, who is king, who is married and who is not. The first time the reader encounters this passage, the names are meaningless and somewhat jumbled. The Aragorn/Elessar connection is not made clear, nor is “Steward of Gondor” a freighted title as it later will be. Readers of The Hobbit might be surprised and disappointed to find that Elrond will leave Rivendell, but first-timers have no connection to that name or place. Far from embedding his work in a dusty old book, Tolkien rather acknowledges that the writer’s first duty is, in fact, to make the reader care. Until and unless the reader is invested in the characters who take the journey, plot spoilers have little impact.\nWhich brings me to my second point: Spoilers are a declaration of authorial mastery. By telling the reader the ending in advance, Tolkien announces his ability to make you care. The spoiler proclaims to the world that Tolkien is going to do his job so well that you won’t care if you know the plot, you will be desperate to keep reading.\nTolkien is not only an author of fantasy, and an academic writer, he is a student of the early history of story-telling. In many nations, the tradition of the bard includes spoilers up-front, in the form of a brief summary of the events about to occur. “Let me tell you the tale of the great hero, who encounters a dragon, rescues a maiden, and wins her hand in marriage.” Is the audience now done with the story, because the plot is laid out in plain language? Not even begun! The spoiler signals that something exciting is going to happen, and you’ll enjoy the journey—even if know where you’re going to end up.\nIn the case of many popular oral tales, even before the bard presented his summary, the audience already knew the stories. Written forms of epics like Beowulf proclaim the fame of their heroes even from birth, with the expectation that the listener has already heard the story. The Arthurian legends provide a far-reaching example. Generations of tellers elaborated upon them, with new characters added and old characters changing roles through the next several hundred years, but the basic plot remains the same. The listeners of those medieval bards already knew the story, just as the readers of contemporary Arthurian novels know the plot today.\nThe spoiler has always been both paternalistic and self-serving on behalf of the story-teller. Spoilers allow the reader a chance to relax and give their full attention to character, theme and authorial vision, the true skills the author wishes to display. It is not what is said that matters, but how it is said, and ultimately, by whom. Many Arthurian novels never transcend their plot, due to their less skillful authors.\nIn critique groups, the remark is often made that keeping secrets from the reader lessens the tension of the work, because the reader is more distant from the characters, and doesn’t have a chance to worry about how the character will overcome their problems. Note: it’s not what the problem is, or the fact that it will be overcome that readers worry about. I think the spoilers that people object to are not the significant points of plot, but rather the surprises the author embeds on the way to those points. Readers in most genres expect a happy ending—even if it’s bittersweet—and will receive it from an author who wants them to buy the next book. The astute reader expects that Frodo survives and that the ring is destroyed, but the manner of its destruction is meant to be startling. Again, it isn’t the what that’s important, but rather how it happens.\nPerhaps the clearest evidence that readers don’t mind spoilers is found their own reading habits. There are some readers who never re-read a book, but there are many who do, who return to their favorite narratives over and over, never losing their love for the work simply because they know the ending already.\nAuthors play with spoilers in different ways. One version in contemporary fiction is that of a frame narrative, often employed with a first-person narrator. Even having a first-person narrator describing events in the past is a sort of spoiler, and some authors use this device to deliberately set up tension between the parts of a narrative. In Patrick Rothfuss’s The Name of the Wind, he lays out a tale you might have heard, then proceeds to allow the hero to tell you the truth—the story from the inside, which will be somewhat different from the legend.\nMary Doria Russell’s The Sparrow, uses a spoiler structure by introducing the end of the story—the return of a single traveler from a failed voyage—then folding the story in half, building tension between the optimistic beginning of a more traditional space-travel narrative and the aftermath of the ruined trip. By revealing parts of the story to come, she makes the reader eager to know what happened in the middle, the event that links the two halves. Titles like King Javan’s Year, by Katherine Kurtz, or The Wreck of the River of Stars, by Michael Flynn, spoil the end of the work, but also serve as teasers to draw in the reader and give him or her something to worry about.\nIn each case, the author deliberately reveals something the ordinary narrative view would have kept secret, displaying it as a promise to the reader that the plot is not the purpose of the work. Nicholas Christenfeld, professor of social psychology and one of the authors of the UCSD study is quoted as saying, “What the plot is is (almost) irrelevant. The pleasure is in the writing.”\nThe great tellers know this. They tease the audience with spoilers, information that should change the experience of the work, but which, instead, draws the reader even closer, manipulating the tension of the tale, until you are so invested in what you are reading, that you even forget you already know how it ends.\nE. C. Ambrose is the author of \"The Dark Apostle\" historical fantasy series about a medieval barber surgeon to start in July 2013 with Elisha Barber from DAW books. E. C. blogs about history, fantasy and writing at www.wordpress.com/ecambrose and can also be found on twitter @ecambrose. E. C. spends too much time in a tiny office in New England with a mournful black lab lurking under the desk.", "source": "https://clarkesworldmagazine.com/another_word_01_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Spoiler Alert! by E. C. Ambrose"}