{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Michael Swanwick", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "mUmQZnEHsghsa2EMYBzCIQF0/8A=", "id": null, "license": null, "comments": "", "raw_text": "5970 words, short story, REPRINT  For I Have Lain Me Down on the Stone of Loneliness and I'll Not Be Back Again   Ich am of Irlaunde,  And of the holy londe Of Irlande. Gode sire, pray ich the, For of saynte chairité Come ant daunce with me In Irlaunde. (Anon.) The bullet scars were still visible on the pillars of the General Post Office in Dublin, almost two centuries after the 1916 uprising. That moved me more than I had expected. But what moved me even more was standing at the exact same spot, not two blocks away, where my great-great-grandfather saw Gerry Adams strolling down O’Connell Street on Easter morning of ’96, the eightieth anniversary of that event, returning from a political rally with a single bodyguard to one side of him and a local politico to the other. It gave me a direct and simple connection to the tangled history of that tragic land.  I never knew my great-great-grandfather, but my grandfather told me that story once and I’ve never forgotten it, though my grandfather died when I was still a boy. If I squeeze my eyes tight shut, I can see his face, liquid and wavy as if glimpsed through candle flames, as he lay dying under a great feather comforter in his New York City railroad flat, his smile weak and his hair forming a halo around him as white as a dandelion waiting for the wind to purse its lips and blow.  “It was doomed from the start,” Mary told me later. “The German guns had been intercepted and the republicans were outnumbered fourteen to one. The British cannons fired on Dublin indiscriminately. The city was afire and there was no food to be had. The survivors were booed as they were marched off to prison and execution, for the common folk did not support them. By any conventional standard it was a fiasco. But once it happened, our independence was assured. We lose and we lose and we lose, but because we never accept it, every defeat and humiliation only leads us closer to victory.”  Her eyes blazed.  I suppose I should tell you about Mary’s eyes, if you’re to understand this story. But if I’m to tell you about her eyes, first I have to tell you about the holy well.  There is a holy well in the Burren that, according to superstition, will cure a toothache. The Burren is a great upwelling of limestone in the west of County Clare, and it is unlike anyplace else on Earth. There is almost no soil. The ground is stony and the stone is weathered in a network of fissures and cracks, called grykes, within which grow a province of plants you will not find in such abundance elsewhere. There are caves in great number to the south and the east, and like everywhere else in that beautiful land, a plenitude of cairns and other antiquities to be found.  The holy well is one such antiquity, though it is only a round hole, perhaps a foot across, filled with water and bright green algae. The altar over it is of recent construction, built by unknown hands from the long slender stones formed by the natural weathering of the limestone between the grykes, which makes the local stone walls so distinctive and the walking so treacherous. You could tear it down and scatter its component parts and never hear a word spoken about your deed. But if you returned a year later you’d find it rebuilt and your vandalism unmade as if it had never happened. People have been visiting the well for a long, long time. The Christian overlay—the holy medals and broken statues of saints that are sometimes left as offerings, along with the prescription bottles, nails, and coins—is a recent and perhaps a transient phenomenon.  But the important thing to know, and the reason people keep coming back to it, is that the holy well works. Some holy wells don’t. You can locate them on old maps, but when you go to have a look, there aren’t any offerings there. Something happened long ago—they were cursed by a saint or defiled by a sinner or simply ran out of mojo—and the magic stopped happening, and the believers went away and never returned. This well, however, is charged with holy power. It gives you shivers just to stand by it.  Mary’s eyes were like that. As green as the water in that well, and as full of dangerous magic.  I knew about the holy well because I’d won big and gotten a ticket off-planet, and so before I went, I took a year off in order to see all the places on Earth I would never return to, ending up with a final month to spend wandering about the land of my ancestors. It was my first time in Ireland and I loved everything about it, and I couldn’t help fantasizing that maybe I’d do so well in the Outsider worlds that someday I’d be rich enough to return and maybe retire there.  I was a fool and, worse, I didn’t know it.  We met in the Fiddler’s Elbow, a pub in that part of the West which the Bord Fáilte calls Yeats Country. I hadn’t come in for music but only to get out of the rain and have a hot whiskey. I was sitting by a small peat fire, savoring the warmth and the sweet smell of it, when somebody opened a door at the back of the room and started collecting admission. There was a sudden rush of people into the pub and so I carried my glass to the bar and asked, “What’s going on?”  “It’s Maire na Raghallach,” the publican said, pronouncing the last name like Reilly. “At the end of a tour she likes to pop in someplace small and give an unadvertised concert. You want to hear, you’d best buy a ticket now. They’re not going to last.”  I didn’t know Maire na Raghallach from Eve. But I’d seen the posters around town and I figured what the hell. I paid and went in.  Maire na Raghallach sang without a backup band and only an amp-and-finger-rings air guitar for instrumentation. Her music was . . . well, either you’ve heard her and know or you haven’t and if you haven’t, words won’t help. But I was mesmerized, ravished, rapt. So much so that midway through the concert, as she was singing “Deirdre’s Lament,” my head swam and a buzzing sensation lifted me up out of my body into a waking dream or hallucination or maybe vision is the word I’m looking for. All the world went away. There were only the two of us facing each other across a vast plain of bones. The sky was black and the bones were white as chalk. The wind was icy cold. We stared at each other. Her eyes pierced me like a spear. They looked right through me, and I was lost, lost, lost. I must have been half in love with her already. All it took was her noticing my existence to send me right over the edge.  Her lips moved. She was saying something and somehow I knew it was vastly important. But the wind whipped her words away unheard. It was howling like a banshee with all the follies of the world laid out before it. It screamed like an electric guitar. When I tried to walk toward her, I discovered I was paralyzed. Though I strained every muscle until I thought I would splinter my bones trying to get closer, trying to hear, I could not move nor make out the least fraction of what she was telling me.  Then I was myself again, panting and sweating and filled with terror. Up on the low stage, Mary (as I later learned to call her) was talking between songs. She grinned cockily and with a nod toward me said, “This one’s for the American in the front row.”  And then, as I trembled in shock and bewilderment, she launched into what I later learned was one of her own songs, “Come Home, the Wild Geese.” The Wild Geese were originally the soldiers who left Ireland, which could no longer support them, to fight for foreign masters in foreign armies everywhere. But over the centuries the term came to be applied to everyone of Irish descent living elsewhere, the children and grandchildren and great-great-great-grandchildren of those unhappy emigrants whose luck was so bad they couldn’t even manage to hold onto their own country and who had passed the guilt of that down through the generations, to be cherished and brooded over by their descendants forever.  “This one’s for the American,” she’d said.  But how had she known?  The thing was that, shortly after hitting the island, I’d bought a new set of clothes locally and dumped all my American things in a charity recycling-device. Plus, I’d bought one of those cheap neuroprogramming pendants that actors use to temporarily redo their accents. Because I’d quickly learned that in Ireland, as soon as you’re pegged for an American, the question comes out: “Looking for your roots, then, are ye?”  “No, it’s just that this is such a beautiful country and I wanted to see it.”  Skeptically, then: “But you do have Irish ancestors, surely?”  “Well, yes, but . . . ”  “Ahhhh.” Hoisting a pint preparatory to draining its lees. “You’re looking for your roots, then. I thought as much.”  But if there’s one thing I wasn’t looking for, it was my fucking roots. I was eighth-generation American Irish and my roots were all about old men in dark little Boston pubs killing themselves a shot glass at a time, and the ladies of Noraid goose-stepping down the street on Saint Patrick’s Day in short black skirts, their heels crashing against the street, a terrifying irruption of fascism into a day that was otherwise all kitsch and false sentiment, and corrupt cops, and young thugs who loved sports and hated school and blamed the niggers and affirmative action for the lousy construction worker jobs they never managed to keep long. I’d come to this country to get away from all that, and a thousand things more that the Irish didn’t know a scrap about. The cartoon leprechauns and the sentimental songs and the cute sayings printed on cheap tea towels somehow all adding up to a sense that you’ve lost before you’ve even begun, that it doesn’t matter what you do or who you become, because you’ll never achieve or amount to shit. The thing that sits like a demon in the dark pit of the soul. That Irish darkness.  So how had she known I was an American?  Maybe it was only an excuse to meet her. If so, it was as good an excuse as any. I hung around after the show, waiting for Mary to emerge from whatever dingy space they’d given her for a dressing room, so I could ask.  When she finally emerged and saw me waiting for her, her mouth turned up in a way that as good as said, “Gotcha!” Without waiting for the question, she said, “I had only to look at you to see that you had prenatal genework. The Outsiders shared it with the States first, for siding with them in the war. There’s no way a young man your age with everything about you perfect could be anything else.”  Then she took me by the arm and led me away to her room.  We were together how long? Three weeks? Forever?  Time enough for Mary to take me everywhere in that green and haunted island. She had the entirety of its history at her fingertips, and she told me all and showed me everything and I, in turn, learned nothing. One day we visited the Portcoon sea cave, a gothic wave-thunderous place that was once occupied by a hermit who had vowed to fast and pray there for the rest of his life and never accept food from human hands. Women swam in on the tides, offering him sustenance, but he refused it. “Or so the story goes,” Mary said. As he was dying, a seal brought him fish and, the seal not being human and having no hands, he ate. Every day it returned and so kept him alive for years. “But what the truth may be,” Mary concluded, “is anyone’s guess.”  Afterwards, we walked ten minutes up the coast to the Giant’s Causeway. There we found a pale blue, four-armed alien in a cotton smock and wide straw hat painting a watercolor of the basalt columns rising and falling like stairs into the air and down to the sea. She held a brush in one right hand and another in a left hand, and plied them simultaneously.  “Soft day,” Mary said pleasantly.  “Oh! Hello!” The alien put down her brushes, turned from her one-legged easel. She did not offer her name, which in her kind—I recognized the species—was never spoken aloud. “Are you local?”  I started to shake my head but, “That we be,” Mary said. It seemed to me that her brogue was much more pronounced than it had been. “Enjoying our island, are ye?”  “Oh, yes. This is such a beautiful country. I’ve never seen such greens!” The alien gestured widely with all four arms. “So many shades of green, and all so intense they make one’s eyes ache.”  “It’s a lovely land,” Mary agreed. “But it can be a dirty one as well. You’ve taken in all the sights, then?”  “I’ve been everywhere—to Tara, and the Cliffs of Moher, and Newgrange, and the Ring of Kerry. I’ve even kissed the Blarney Stone.” The alien lowered her voice and made a complicated gesture that I’m guessing was the equivalent of a giggle. “I was hoping to see one of the little people. But maybe it’s just as well I didn’t. It might have carried me off to a fairy mound and then after a night of feasting and music I’d emerge to find that centuries had gone by and everybody I knew was dead.”  I stiffened, knowing that Mary found this kind of thing offensive. But she only smiled and said, “It’s not the wee folk you have to worry about. It’s the boys.”  “The boys?”  “Aye. Ireland is a hotbed of nativist resistance, you know. During the day, it’s safe enough. But the night belongs to the boys.” She touched her lips to indicate that she wouldn’t speak the organization’s name out loud. “They’ll target a lone Outsider to be killed as an example to others. The landlord gives them the key to her room. They have ropes and guns and filthy big knifes. Then it’s a short jaunt out to the bogs, and what happens there . . . Well, they’re simple, brutal men. It’s all over by dawn and there are never any witnesses. Nobody sees a thing.”  The alien’s arms thrashed. “The tourist officials didn’t say anything about this!”  “Well, they wouldn’t, would they?”  “What do you mean?” the alien asked.  Mary said nothing. She only stood there, staring insolently, waiting for the alien to catch on to what she was saying.  After a time, the alien folded all four of her arms protectively against her thorax. When she did, Mary spoke at last. “Sometimes they’ll give you a warning. A friendly local will come up to you and suggest that the climate is less healthy than you thought, and you might want to leave before nightfall.”  Very carefully, the alien said, “Is that what’s happening here?”  “No, of course not.” Mary’s face was hard and unreadable. “Only, I hear Australia’s lovely this time of year.”  Abruptly, she whirled about and strode away so rapidly that I had to run to catch up to her. When we were well out of earshot of the alien, I grabbed her arm and angrily said, “What the fuck did you do that for?”  “I really don’t think it’s any of your business.”  “Let’s just pretend that it is. Why?”  “To spread fear among the Outsiders,” she said, quiet and fierce. “To remind them that Earth is sacred ground to us and always will be. To let them know that while they may temporarily hold the whip, this isn’t their planet and never will be.”  Then, out of nowhere, she laughed. “Did you see the expression on that skinny blue bitch’s face? She practically turned green!”  “Who are you, Mary O’Reilly?” I asked her that night, when we were lying naked and sweaty among the tangled sheets. I’d spent the day thinking, and realized how little she’d told me about herself. I knew her body far better than I did her mind. “What are your likes and dislikes? What do you hope and what do you fear? What made you a musician, and what do you want to be when you grow up?” I was trying to keep it light, seriously though I meant it all.  “I always had the music, and thank God for that. Music was my salvation.”  “How so?”  “My parents died in the last days of the war. I was only an infant, so I was put into an orphanage. The orphanages were funded with American and Outsider money, part of the campaign to win the hearts and minds of the conquered peoples. We were raised to be denationalized citizens of the universe. Not a word of Irish touched our ears, nor any hint of our history or culture. It was all Greece and Rome and the Aldebaran Unity. Thank Christ for our music! They couldn’t keep that out, though they tried hard to convince us it was all harmless deedle-deedle jigs and reels. But we knew it was subversive. We knew it carried truth. Our minds escaped long before our bodies could.”  We, she’d said, and us and our. “That’s not who you are, Mary. That’s a political speech. I want to know what you’re really like. As a person, I mean.”  Her face was like stone. “I’m what I am. An Irishwoman. A musician. A patriot. Cooze for an American playboy.”  I kept my smile, though I felt as if she’d slapped me. “That’s unfair.”  It’s an evil thing to have a naked woman look at you the way Mary did me. “Is it? Are you not abandoning your planet in two days? Maybe you’re thinking of taking me along. Tell me, exactly how does that work?”  I reached for the whiskey bottle on the table by the bed. We’d drunk it almost empty, but there was still a little left. “If we’re not close, then how is that my fault? You’ve known from the start that I’m mad about you. But you won’t even—oh, fuck it!” I drained the bottle. “Just what the hell do you want from me? Tell me! I don’t think you can.”  Mary grabbed me angrily by the arms and I dropped the bottle and broke her hold and seized her by the wrists. She bit my shoulder so hard it bled and when I tried to push her away, toppled me over on my back and clambered up on top of me.  We did not so much resolve our argument as fuck it into oblivion.  It took me forever to fall asleep that night. Not Mary. She simply decided to sleep and sleep came at her bidding. I, however, sat up for hours staring at her face in the moonlight. It was all hard planes and determination. A strong face but not one given to compromise. I’d definitely fallen in love with the wrong woman. Worse, I was leaving for distant worlds the day after tomorrow. All my life had been shaped toward that end. I had no Plan B.  In the little time I had left, I could never sort out my feelings for Mary, much less hers for me. I loved her, of course, that went without saying. But I hated her bullying ways, her hectoring manner of speech, her arrogant assurance that I would do whatever she wanted me to do. Much as I desired her, I wanted nothing more than to never see her again. I had all the wealth and wonders of the universe ahead of me. My future was guaranteed.  And, God help me, if she’d only asked me to stay, I would have thrown it all away for her in an instant.  In the morning, we took a hyperrapid to Galway and toured its vitrified ruins. “Resistance was stiffest in the West,” Mary said. “One by one all the nations of the earth sued for peace, and even in Dublin there was talk of accommodation. Yet we fought on. So the Outsiders hung a warship in geostationary orbit and turned their strange weapons on us. This beautiful port city was turned to glass. The ships were blown against the shore and broke on the cobbles. The cathedral collapsed under its own weight. Nobody has lived here since.”  The rain spattered to a stop and there was a brief respite from the squalls which in that part of the country come off the Atlantic in waves. The sun dazzled from a hundred crystalline planes. The sudden silence was like a heavy hand laid unexpectedly upon my shoulder. “At least they didn’t kill anyone,” I said weakly. I was of a generation that saw the occupation of the Outsiders as being, ultimately, a good thing. We were healthier, richer, happier, than our parents had been. Nobody worried about environmental degradation or running out of resources anymore. There was no denying we were physically better off for their intervention.  “It was a false mercy that spared the citizens of Galway from immediate death and sent them out into the countryside with no more than the clothes on their backs. How were they supposed to survive? They were doctors and lawyers and accountants. Some of them reverted to brigandry and violence, to be sure. But most simply kept walking until they lay down by the side of the road and died. I can show you as many thousand hours of recordings of the Great Starvation as you can bring yourself to stomach. There was no food to be had, but thanks to the trinkets the Outsiders had used to collapse the economy, everybody had cameras feeding right off their optic nerves, saving all the golden memories of watching their children die.”  Mary was being unfair—the economic troubles hadn’t been the Outsiders’ doing. I knew because I’d taken economics in college. History, too, so I also knew that the war had, in part, been forced upon them. But though I wanted to, I could not adequately answer her. I had no passion that was the equal of hers.  “Things have gotten better,” I said weakly. “Look at all they’ve done for . . . ”  “The benevolence of the conqueror, scattering coins for the peasants to scrabble in the dust after. They’re all smiles when we’re down on our knees before them. But see what happens if one of us stands up on his hind legs and tells them to sod off.”  We stopped in a pub for lunch and then took a hopper to Gartan Lough. There we bicycled into the countryside. Mary led me deep into land that had never been greatly populated and was still dotted with the ruins of houses abandoned a quarter-century before. The roads were poorly paved or else dirt, and the land was so beautiful as to make you weep. It was a perfect afternoon, all blue skies and fluffy clouds. We labored up a hillside to a small stone chapel that had lost its roof centuries ago. It was surrounded by graves, untended and overgrown with wildflowers.  Lying on the ground by the entrance to the graveyard was the Stone of Loneliness.  The Stone of Loneliness was a fallen menhir or standing stone, something not at all uncommon throughout the British Isles. They’d been reared by unknown people for reasons still not understood in Megalithic times, sometimes arranged in circles, and other times as solitary monuments. There were faded cup-and-ring lines carved into what had been the stone’s upper end. And it was broad enough that a grown man could lie down on it. “What should I do?” I asked.  “Lie down on it,” Mary said.  So I did.  I lay down upon the Stone of Loneliness and closed my eyes. Bees hummed lazily in the air. And, standing at a distance, Mary began to sing:  The lions of the hills are gone And I am left alone, alone . . . It was “Deirdre’s Lament,” which I’d first heard her sing in the Fiddler’s Elbow. In Irish legend, Deirdre was promised from infancy to Conchobar, the king of Ulster. But, as happens, she fell in love with and married another, younger man. Naoise, her husband, and his brothers Ardan and Ainnle, the sons of Uisnech, fled with her to Scotland, where they lived in contentment. But the humiliated and vengeful old king lured them back to Ireland with promises of amnesty. Once they were in his hands, he treacherously killed the three sons of Uisnech and took Deirdre to his bed.  The Falcons of the Wood are flown And I am left alone, alone . . . Deirdre of the Sorrows, as she is often called, has become a symbol for Ireland herself—beautiful, suffering from injustice, and possessed of a happy past that looks likely to never return. Of the real Deirdre, the living and breathing woman upon whom the stories were piled like so many stones on a cairn, we know nothing. The legendary Deirdre’s story, however, does not end with her suicide, for in the aftermath of Conchobar’s treachery wars were fought, the injustices of which led to further wars. Which wars continue to this very day. It all fits together suspiciously tidily.  It was no coincidence that Deirdre’s father was the king’s storyteller.  The dragons of the rock are sleeping Sleep that wakes not for our weeping . . . All this, however, I tell you after the fact. At the time, I was not thinking of the legend at all. For the instant I lay down upon the cold stone, I felt all the misery of Ireland flowing into my body. The Stone of Loneliness was charmed, like the well in the Burren. Sleeping on it was said to be a cure for homesickness. So, during the Famine, emigrants would spend their last night atop it before leaving Ireland forever. It seemed to me, prone upon the menhir, that all the sorrow they had shed was flowing into my body. I felt each loss as if it were my own. Helplessly, I started to weep and then to cry openly. I lost track of what Mary was singing, though her voice went on and on. Until finally she sang  Dig the grave both wide and deep Sick I am, and fain would sleep Dig the grave and make it ready Lay me on my true Love’s body and stopped. Leaving a silence that echoed on and on forever.  Then Mary said, “There’s someone I think you’re ready to meet.”  Mary took me to a nondescript cinder block building, the location of which I will take with me to the grave. She led the way in. I followed nervously. The interior was so dim I stumbled on the threshold. Then my eyes adjusted, and I saw that I was in a bar. Not a pub, which is a warm and welcoming public space where families gather to socialize, the adults over a pint and the kiddies drinking their soft drinks, but a bar—a place where men go to get drunk. It smelled of poitín and stale beer. Somebody had ripped the door to the bog off its hinges and no one had bothered to replace it. Presumably Mary was the only woman to set foot in the place for a long, long time.  There were three or four men sitting at small tables in the gloom, their backs to the door, and a lean man with a bad complexion at the bar. “Here you are then,” he said without enthusiasm.  “Don’t mind Liam,” Mary said to me. Then, to Liam, “Have you anything fit for drinking?”  “No.”  “Well, that’s not why we came anyway.” Mary jerked her head toward me. “Here’s the recruit.”  “He doesn’t look like much.”  “Recruit for what?” I said. It struck me suddenly that Liam was keeping his hands below the bar, out of sight. Down where a hard man will keep a weapon, such as a cudgel or a gun.  “Don’t let his American teeth put you off. They’re part of the reason we wanted him in the first place.”  “So you’re a patriot, are you, lad?” Liam said in a voice that indicated he knew good and well that I was not.  “I have no idea what you’re talking about.”  Liam glanced quickly at Mary and curled his lip in a sneer. “Ahh, he’s just in it for the crack.” In Irish craic means “fun” or “kicks.” But the filthy pun was obviously intended. My face hardened and I balled up my fists. Liam didn’t look concerned.  “Hush, you!” Mary said. Then, turning to me, “And I’ll thank you to control yourself as well. This is serious business. Liam, I’ll vouch for the man. Give him the package.”  Liam’s hands appeared at last. They held something the size of a biscuit tin. It was wrapped in white paper and tied up with string. He slid it across the bar.  “What’s this?”  “It’s a device,” Liam said. “Properly deployed, it can implode the entire administrative complex at Shannon Starport without harming a single civilian.”  My flesh ran cold.  “So you want me to plant this in the ’port, do yez?” I said. For the first time in weeks, I became aware of the falseness of my accent. Impulsively, I pulled the neuropendant from beneath my shirt, dropped it on the floor, and stepped on it. Whatever I said here, I would say it as myself. “You want me to go in there and fucking blow myself up?”  “No, of course not,” Mary said. “We have a soldier in place for that. But he—”  “Or she,” Liam amended.  “—or she isn’t in a position to smuggle this in. Human employees aren’t allowed to bring in so much as a pencil. That’s how little the Outsiders think of us. You, however, can. Just take the device through their machines—it’s rigged to read as a box of cigars—in your carry-on. Once you’re inside, somebody will come up to you and ask if you remembered to bring something for granny. Hand it over.”  “That’s all,” Liam said.  “You’ll be halfway to Jupiter before anything happens.”  They both looked at me steadily. “Forget it,” I said. “I’m not killing any innocent people for you.”  “Not people. Aliens.”  “They’re still innocent.”  “They wouldn’t be here if they hadn’t seized the planet. So they’re not innocent.”  “You’re a nation of fucking werewolves!” I cried. Thinking that would put an end to the conversation.  But Mary wasn’t fazed. “That we are,” she agreed. “Day by day, we present our harmless, domestic selves to the world, until one night the beast comes out to feed. But at least we’re not sheep, bleating complacently in the face of the butcher’s knife. Which are you, my heart’s beloved? A sheep? Or could there be a wolf lurking deep within?”  “He can’t do the job,” Liam said. “He’s as weak as watered milk.”  “Shut it. You have no idea what you’re talking about.” Mary fixed me with those amazing eyes of hers, as green as the living heart of Ireland, and I was helpless before them. “It’s not weakness that makes you hesitate,” she said, “but a foolish and misinformed conscience. I’ve thought about this far longer than you have, my treasure. I’ve thought about it all my life. It’s a holy and noble thing that I’m asking of you.”  “I—”  “Night after night, you’ve sworn you’d do anything for me—not with words, I’ll grant you, but with looks, with murmurs, with your soul. Did you think I could not hear the words you dared not say aloud? Now I’m calling you on all those unspoken promises. Do this one thing—if not for the sake of your planet, then for me.”  All the time we’d been talking, the men sitting at their little tables hadn’t made a noise. Nor had any of them turned to face us. They simply sat hunched in place—not drinking, not smoking, not speaking. Just listening. It came to me then how large they were, and how still. How alert. It came to me then that if I turned Mary down, I’d not leave this room alive.  So, really, I had no choice.  “I’ll do it,” I said. “And God damn you for asking me to.”  Mary went to hug me and I pushed her roughly away. “No! I’m doing this thing for you, and that puts us quits. I never want to see you or think of you again.”  For a long, still moment, Mary studied me calmly. I was lying, for I’d never wanted her so much as I did in that instant. I could see that she knew I was lying, too. If she’d let the least sign of that knowledge show, I believe I would have hit her. But she did not. “Very well,” she said. “So long as you keep your word.”  She turned and left and I knew I would never see her again.  Liam walked me to the door. “Be careful with the package outside in the rain,” he said, handing me an umbrella. “It won’t work if you let it get damp.”  I was standing in Shannon Starport, when Homeworld Security closed in on me. Two burly men in ITSA uniforms appeared to my either side and their alien superior said, “Would you please come with us, sir.” It was not a question.  Oh, Mary, I thought sadly. You have a traitor in your organization. Other than me, I meant. “Can I bring my bag?”  “We’ll see to that, sir.”  I was taken to their interrogation room.  Five hours later I got onto the lighter. They couldn’t hold me because there wasn’t anything illegal in my possession. I’d soaked the package Liam gave me in the hotel room sink overnight and then gotten up early and booted it down a storm drain when no one was looking. It was a quick trip to orbit where there waited a ship larger than a skyscraper and rarer than almost anything you could name, for it wouldn’t return to this planet for centuries. I floated on board knowing that for me there’d be no turning back. Earth would be a story I told my children, and a pack of sentimental lies they would tell theirs.  My homeworld shrank behind me and disappeared. I looked out the great black glass walls into a universe thronged with stars and galaxies and had no idea where I was or where I thought I was going. It seemed to me then that we were each and every one of us ships without a harbor, sailors lost on land.  I used to say that only Ireland and my family could make me cry. I cried when my mother died and I cried when Dad had his heart attack the very next year. My baby sister failed to survive the same birth that killed my mother, so some of my tears were for her as well. Then my brother Bill was hit by a drunk driver and I cried and that was the end of my family. Now there’s only Ireland.  But that’s enough.    Originally published in Asimov’ Science Fiction, August 2011.  Michael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.  This year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.  He lives in Philadelphia with his wife, Marianne Porter.", "text": "5970 words, short story, REPRINT\nFor I Have Lain Me Down on the Stone of Loneliness and I'll Not Be Back Again\nIch am of Irlaunde,\nAnd of the holy londe\nOf Irlande.\nGode sire, pray ich the,\nFor of saynte chairité\nCome ant daunce with me\nIn Irlaunde.\n(Anon.)\nThe bullet scars were still visible on the pillars of the General Post Office in Dublin, almost two centuries after the 1916 uprising. That moved me more than I had expected. But what moved me even more was standing at the exact same spot, not two blocks away, where my great-great-grandfather saw Gerry Adams strolling down O’Connell Street on Easter morning of ’96, the eightieth anniversary of that event, returning from a political rally with a single bodyguard to one side of him and a local politico to the other. It gave me a direct and simple connection to the tangled history of that tragic land.\nI never knew my great-great-grandfather, but my grandfather told me that story once and I’ve never forgotten it, though my grandfather died when I was still a boy. If I squeeze my eyes tight shut, I can see his face, liquid and wavy as if glimpsed through candle flames, as he lay dying under a great feather comforter in his New York City railroad flat, his smile weak and his hair forming a halo around him as white as a dandelion waiting for the wind to purse its lips and blow.\n“It was doomed from the start,” Mary told me later. “The German guns had been intercepted and the republicans were outnumbered fourteen to one. The British cannons fired on Dublin indiscriminately. The city was afire and there was no food to be had. The survivors were booed as they were marched off to prison and execution, for the common folk did not support them. By any conventional standard it was a fiasco. But once it happened, our independence was assured. We lose and we lose and we lose, but because we never accept it, every defeat and humiliation only leads us closer to victory.”\nHer eyes blazed.\nI suppose I should tell you about Mary’s eyes, if you’re to understand this story. But if I’m to tell you about her eyes, first I have to tell you about the holy well.\nThere is a holy well in the Burren that, according to superstition, will cure a toothache. The Burren is a great upwelling of limestone in the west of County Clare, and it is unlike anyplace else on Earth. There is almost no soil. The ground is stony and the stone is weathered in a network of fissures and cracks, called grykes, within which grow a province of plants you will not find in such abundance elsewhere. There are caves in great number to the south and the east, and like everywhere else in that beautiful land, a plenitude of cairns and other antiquities to be found.\nThe holy well is one such antiquity, though it is only a round hole, perhaps a foot across, filled with water and bright green algae. The altar over it is of recent construction, built by unknown hands from the long slender stones formed by the natural weathering of the limestone between the grykes, which makes the local stone walls so distinctive and the walking so treacherous. You could tear it down and scatter its component parts and never hear a word spoken about your deed. But if you returned a year later you’d find it rebuilt and your vandalism unmade as if it had never happened. People have been visiting the well for a long, long time. The Christian overlay—the holy medals and broken statues of saints that are sometimes left as offerings, along with the prescription bottles, nails, and coins—is a recent and perhaps a transient phenomenon.\nBut the important thing to know, and the reason people keep coming back to it, is that the holy well works. Some holy wells don’t. You can locate them on old maps, but when you go to have a look, there aren’t any offerings there. Something happened long ago—they were cursed by a saint or defiled by a sinner or simply ran out of mojo—and the magic stopped happening, and the believers went away and never returned. This well, however, is charged with holy power. It gives you shivers just to stand by it.\nMary’s eyes were like that. As green as the water in that well, and as full of dangerous magic.\nI knew about the holy well because I’d won big and gotten a ticket off-planet, and so before I went, I took a year off in order to see all the places on Earth I would never return to, ending up with a final month to spend wandering about the land of my ancestors. It was my first time in Ireland and I loved everything about it, and I couldn’t help fantasizing that maybe I’d do so well in the Outsider worlds that someday I’d be rich enough to return and maybe retire there.\nI was a fool and, worse, I didn’t know it.\nWe met in the Fiddler’s Elbow, a pub in that part of the West which the Bord Fáilte calls Yeats Country. I hadn’t come in for music but only to get out of the rain and have a hot whiskey. I was sitting by a small peat fire, savoring the warmth and the sweet smell of it, when somebody opened a door at the back of the room and started collecting admission. There was a sudden rush of people into the pub and so I carried my glass to the bar and asked, “What’s going on?”\n“It’s Maire na Raghallach,” the publican said, pronouncing the last name like Reilly. “At the end of a tour she likes to pop in someplace small and give an unadvertised concert. You want to hear, you’d best buy a ticket now. They’re not going to last.”\nI didn’t know Maire na Raghallach from Eve. But I’d seen the posters around town and I figured what the hell. I paid and went in.\nMaire na Raghallach sang without a backup band and only an amp-and-finger-rings air guitar for instrumentation. Her music was . . . well, either you’ve heard her and know or you haven’t and if you haven’t, words won’t help. But I was mesmerized, ravished, rapt. So much so that midway through the concert, as she was singing “Deirdre’s Lament,” my head swam and a buzzing sensation lifted me up out of my body into a waking dream or hallucination or maybe vision is the word I’m looking for. All the world went away. There were only the two of us facing each other across a vast plain of bones. The sky was black and the bones were white as chalk. The wind was icy cold. We stared at each other. Her eyes pierced me like a spear. They looked right through me, and I was lost, lost, lost. I must have been half in love with her already. All it took was her noticing my existence to send me right over the edge.\nHer lips moved. She was saying something and somehow I knew it was vastly important. But the wind whipped her words away unheard. It was howling like a banshee with all the follies of the world laid out before it. It screamed like an electric guitar. When I tried to walk toward her, I discovered I was paralyzed. Though I strained every muscle until I thought I would splinter my bones trying to get closer, trying to hear, I could not move nor make out the least fraction of what she was telling me.\nThen I was myself again, panting and sweating and filled with terror. Up on the low stage, Mary (as I later learned to call her) was talking between songs. She grinned cockily and with a nod toward me said, “This one’s for the American in the front row.”\nAnd then, as I trembled in shock and bewilderment, she launched into what I later learned was one of her own songs, “Come Home, the Wild Geese.” The Wild Geese were originally the soldiers who left Ireland, which could no longer support them, to fight for foreign masters in foreign armies everywhere. But over the centuries the term came to be applied to everyone of Irish descent living elsewhere, the children and grandchildren and great-great-great-grandchildren of those unhappy emigrants whose luck was so bad they couldn’t even manage to hold onto their own country and who had passed the guilt of that down through the generations, to be cherished and brooded over by their descendants forever.\n“This one’s for the American,” she’d said.\nBut how had she known?\nThe thing was that, shortly after hitting the island, I’d bought a new set of clothes locally and dumped all my American things in a charity recycling-device. Plus, I’d bought one of those cheap neuroprogramming pendants that actors use to temporarily redo their accents. Because I’d quickly learned that in Ireland, as soon as you’re pegged for an American, the question comes out: “Looking for your roots, then, are ye?”\n“No, it’s just that this is such a beautiful country and I wanted to see it.”\nSkeptically, then: “But you do have Irish ancestors, surely?”\n“Well, yes, but . . . ”\n“Ahhhh.” Hoisting a pint preparatory to draining its lees. “You’re looking for your roots, then. I thought as much.”\nBut if there’s one thing I wasn’t looking for, it was my fucking roots. I was eighth-generation American Irish and my roots were all about old men in dark little Boston pubs killing themselves a shot glass at a time, and the ladies of Noraid goose-stepping down the street on Saint Patrick’s Day in short black skirts, their heels crashing against the street, a terrifying irruption of fascism into a day that was otherwise all kitsch and false sentiment, and corrupt cops, and young thugs who loved sports and hated school and blamed the niggers and affirmative action for the lousy construction worker jobs they never managed to keep long. I’d come to this country to get away from all that, and a thousand things more that the Irish didn’t know a scrap about. The cartoon leprechauns and the sentimental songs and the cute sayings printed on cheap tea towels somehow all adding up to a sense that you’ve lost before you’ve even begun, that it doesn’t matter what you do or who you become, because you’ll never achieve or amount to shit. The thing that sits like a demon in the dark pit of the soul. That Irish darkness.\nSo how had she known I was an American?\nMaybe it was only an excuse to meet her. If so, it was as good an excuse as any. I hung around after the show, waiting for Mary to emerge from whatever dingy space they’d given her for a dressing room, so I could ask.\nWhen she finally emerged and saw me waiting for her, her mouth turned up in a way that as good as said, “Gotcha!” Without waiting for the question, she said, “I had only to look at you to see that you had prenatal genework. The Outsiders shared it with the States first, for siding with them in the war. There’s no way a young man your age with everything about you perfect could be anything else.”\nThen she took me by the arm and led me away to her room.\nWe were together how long? Three weeks? Forever?\nTime enough for Mary to take me everywhere in that green and haunted island. She had the entirety of its history at her fingertips, and she told me all and showed me everything and I, in turn, learned nothing. One day we visited the Portcoon sea cave, a gothic wave-thunderous place that was once occupied by a hermit who had vowed to fast and pray there for the rest of his life and never accept food from human hands. Women swam in on the tides, offering him sustenance, but he refused it. “Or so the story goes,” Mary said. As he was dying, a seal brought him fish and, the seal not being human and having no hands, he ate. Every day it returned and so kept him alive for years. “But what the truth may be,” Mary concluded, “is anyone’s guess.”\nAfterwards, we walked ten minutes up the coast to the Giant’s Causeway. There we found a pale blue, four-armed alien in a cotton smock and wide straw hat painting a watercolor of the basalt columns rising and falling like stairs into the air and down to the sea. She held a brush in one right hand and another in a left hand, and plied them simultaneously.\n“Soft day,” Mary said pleasantly.\n“Oh! Hello!” The alien put down her brushes, turned from her one-legged easel. She did not offer her name, which in her kind—I recognized the species—was never spoken aloud. “Are you local?”\nI started to shake my head but, “That we be,” Mary said. It seemed to me that her brogue was much more pronounced than it had been. “Enjoying our island, are ye?”\n“Oh, yes. This is such a beautiful country. I’ve never seen such greens!” The alien gestured widely with all four arms. “So many shades of green, and all so intense they make one’s eyes ache.”\n“It’s a lovely land,” Mary agreed. “But it can be a dirty one as well. You’ve taken in all the sights, then?”\n“I’ve been everywhere—to Tara, and the Cliffs of Moher, and Newgrange, and the Ring of Kerry. I’ve even kissed the Blarney Stone.” The alien lowered her voice and made a complicated gesture that I’m guessing was the equivalent of a giggle. “I was hoping to see one of the little people. But maybe it’s just as well I didn’t. It might have carried me off to a fairy mound and then after a night of feasting and music I’d emerge to find that centuries had gone by and everybody I knew was dead.”\nI stiffened, knowing that Mary found this kind of thing offensive. But she only smiled and said, “It’s not the wee folk you have to worry about. It’s the boys.”\n“The boys?”\n“Aye. Ireland is a hotbed of nativist resistance, you know. During the day, it’s safe enough. But the night belongs to the boys.” She touched her lips to indicate that she wouldn’t speak the organization’s name out loud. “They’ll target a lone Outsider to be killed as an example to others. The landlord gives them the key to her room. They have ropes and guns and filthy big knifes. Then it’s a short jaunt out to the bogs, and what happens there . . . Well, they’re simple, brutal men. It’s all over by dawn and there are never any witnesses. Nobody sees a thing.”\nThe alien’s arms thrashed. “The tourist officials didn’t say anything about this!”\n“Well, they wouldn’t, would they?”\n“What do you mean?” the alien asked.\nMary said nothing. She only stood there, staring insolently, waiting for the alien to catch on to what she was saying.\nAfter a time, the alien folded all four of her arms protectively against her thorax. When she did, Mary spoke at last. “Sometimes they’ll give you a warning. A friendly local will come up to you and suggest that the climate is less healthy than you thought, and you might want to leave before nightfall.”\nVery carefully, the alien said, “Is that what’s happening here?”\n“No, of course not.” Mary’s face was hard and unreadable. “Only, I hear Australia’s lovely this time of year.”\nAbruptly, she whirled about and strode away so rapidly that I had to run to catch up to her. When we were well out of earshot of the alien, I grabbed her arm and angrily said, “What the fuck did you do that for?”\n“I really don’t think it’s any of your business.”\n“Let’s just pretend that it is. Why?”\n“To spread fear among the Outsiders,” she said, quiet and fierce. “To remind them that Earth is sacred ground to us and always will be. To let them know that while they may temporarily hold the whip, this isn’t their planet and never will be.”\nThen, out of nowhere, she laughed. “Did you see the expression on that skinny blue bitch’s face? She practically turned green!”\n“Who are you, Mary O’Reilly?” I asked her that night, when we were lying naked and sweaty among the tangled sheets. I’d spent the day thinking, and realized how little she’d told me about herself. I knew her body far better than I did her mind. “What are your likes and dislikes? What do you hope and what do you fear? What made you a musician, and what do you want to be when you grow up?” I was trying to keep it light, seriously though I meant it all.\n“I always had the music, and thank God for that. Music was my salvation.”\n“How so?”\n“My parents died in the last days of the war. I was only an infant, so I was put into an orphanage. The orphanages were funded with American and Outsider money, part of the campaign to win the hearts and minds of the conquered peoples. We were raised to be denationalized citizens of the universe. Not a word of Irish touched our ears, nor any hint of our history or culture. It was all Greece and Rome and the Aldebaran Unity. Thank Christ for our music! They couldn’t keep that out, though they tried hard to convince us it was all harmless deedle-deedle jigs and reels. But we knew it was subversive. We knew it carried truth. Our minds escaped long before our bodies could.”\nWe, she’d said, and us and our. “That’s not who you are, Mary. That’s a political speech. I want to know what you’re really like. As a person, I mean.”\nHer face was like stone. “I’m what I am. An Irishwoman. A musician. A patriot. Cooze for an American playboy.”\nI kept my smile, though I felt as if she’d slapped me. “That’s unfair.”\nIt’s an evil thing to have a naked woman look at you the way Mary did me. “Is it? Are you not abandoning your planet in two days? Maybe you’re thinking of taking me along. Tell me, exactly how does that work?”\nI reached for the whiskey bottle on the table by the bed. We’d drunk it almost empty, but there was still a little left. “If we’re not close, then how is that my fault? You’ve known from the start that I’m mad about you. But you won’t even—oh, fuck it!” I drained the bottle. “Just what the hell do you want from me? Tell me! I don’t think you can.”\nMary grabbed me angrily by the arms and I dropped the bottle and broke her hold and seized her by the wrists. She bit my shoulder so hard it bled and when I tried to push her away, toppled me over on my back and clambered up on top of me.\nWe did not so much resolve our argument as fuck it into oblivion.\nIt took me forever to fall asleep that night. Not Mary. She simply decided to sleep and sleep came at her bidding. I, however, sat up for hours staring at her face in the moonlight. It was all hard planes and determination. A strong face but not one given to compromise. I’d definitely fallen in love with the wrong woman. Worse, I was leaving for distant worlds the day after tomorrow. All my life had been shaped toward that end. I had no Plan B.\nIn the little time I had left, I could never sort out my feelings for Mary, much less hers for me. I loved her, of course, that went without saying. But I hated her bullying ways, her hectoring manner of speech, her arrogant assurance that I would do whatever she wanted me to do. Much as I desired her, I wanted nothing more than to never see her again. I had all the wealth and wonders of the universe ahead of me. My future was guaranteed.\nAnd, God help me, if she’d only asked me to stay, I would have thrown it all away for her in an instant.\nIn the morning, we took a hyperrapid to Galway and toured its vitrified ruins. “Resistance was stiffest in the West,” Mary said. “One by one all the nations of the earth sued for peace, and even in Dublin there was talk of accommodation. Yet we fought on. So the Outsiders hung a warship in geostationary orbit and turned their strange weapons on us. This beautiful port city was turned to glass. The ships were blown against the shore and broke on the cobbles. The cathedral collapsed under its own weight. Nobody has lived here since.”\nThe rain spattered to a stop and there was a brief respite from the squalls which in that part of the country come off the Atlantic in waves. The sun dazzled from a hundred crystalline planes. The sudden silence was like a heavy hand laid unexpectedly upon my shoulder. “At least they didn’t kill anyone,” I said weakly. I was of a generation that saw the occupation of the Outsiders as being, ultimately, a good thing. We were healthier, richer, happier, than our parents had been. Nobody worried about environmental degradation or running out of resources anymore. There was no denying we were physically better off for their intervention.\n“It was a false mercy that spared the citizens of Galway from immediate death and sent them out into the countryside with no more than the clothes on their backs. How were they supposed to survive? They were doctors and lawyers and accountants. Some of them reverted to brigandry and violence, to be sure. But most simply kept walking until they lay down by the side of the road and died. I can show you as many thousand hours of recordings of the Great Starvation as you can bring yourself to stomach. There was no food to be had, but thanks to the trinkets the Outsiders had used to collapse the economy, everybody had cameras feeding right off their optic nerves, saving all the golden memories of watching their children die.”\nMary was being unfair—the economic troubles hadn’t been the Outsiders’ doing. I knew because I’d taken economics in college. History, too, so I also knew that the war had, in part, been forced upon them. But though I wanted to, I could not adequately answer her. I had no passion that was the equal of hers.\n“Things have gotten better,” I said weakly. “Look at all they’ve done for . . . ”\n“The benevolence of the conqueror, scattering coins for the peasants to scrabble in the dust after. They’re all smiles when we’re down on our knees before them. But see what happens if one of us stands up on his hind legs and tells them to sod off.”\nWe stopped in a pub for lunch and then took a hopper to Gartan Lough. There we bicycled into the countryside. Mary led me deep into land that had never been greatly populated and was still dotted with the ruins of houses abandoned a quarter-century before. The roads were poorly paved or else dirt, and the land was so beautiful as to make you weep. It was a perfect afternoon, all blue skies and fluffy clouds. We labored up a hillside to a small stone chapel that had lost its roof centuries ago. It was surrounded by graves, untended and overgrown with wildflowers.\nLying on the ground by the entrance to the graveyard was the Stone of Loneliness.\nThe Stone of Loneliness was a fallen menhir or standing stone, something not at all uncommon throughout the British Isles. They’d been reared by unknown people for reasons still not understood in Megalithic times, sometimes arranged in circles, and other times as solitary monuments. There were faded cup-and-ring lines carved into what had been the stone’s upper end. And it was broad enough that a grown man could lie down on it. “What should I do?” I asked.\n“Lie down on it,” Mary said.\nSo I did.\nI lay down upon the Stone of Loneliness and closed my eyes. Bees hummed lazily in the air. And, standing at a distance, Mary began to sing:\nThe lions of the hills are gone\nAnd I am left alone, alone . . .\nIt was “Deirdre’s Lament,” which I’d first heard her sing in the Fiddler’s Elbow. In Irish legend, Deirdre was promised from infancy to Conchobar, the king of Ulster. But, as happens, she fell in love with and married another, younger man. Naoise, her husband, and his brothers Ardan and Ainnle, the sons of Uisnech, fled with her to Scotland, where they lived in contentment. But the humiliated and vengeful old king lured them back to Ireland with promises of amnesty. Once they were in his hands, he treacherously killed the three sons of Uisnech and took Deirdre to his bed.\nThe Falcons of the Wood are flown\nAnd I am left alone, alone . . .\nDeirdre of the Sorrows, as she is often called, has become a symbol for Ireland herself—beautiful, suffering from injustice, and possessed of a happy past that looks likely to never return. Of the real Deirdre, the living and breathing woman upon whom the stories were piled like so many stones on a cairn, we know nothing. The legendary Deirdre’s story, however, does not end with her suicide, for in the aftermath of Conchobar’s treachery wars were fought, the injustices of which led to further wars. Which wars continue to this very day. It all fits together suspiciously tidily.\nIt was no coincidence that Deirdre’s father was the king’s storyteller.\nThe dragons of the rock are sleeping\nSleep that wakes not for our weeping . . .\nAll this, however, I tell you after the fact. At the time, I was not thinking of the legend at all. For the instant I lay down upon the cold stone, I felt all the misery of Ireland flowing into my body. The Stone of Loneliness was charmed, like the well in the Burren. Sleeping on it was said to be a cure for homesickness. So, during the Famine, emigrants would spend their last night atop it before leaving Ireland forever. It seemed to me, prone upon the menhir, that all the sorrow they had shed was flowing into my body. I felt each loss as if it were my own. Helplessly, I started to weep and then to cry openly. I lost track of what Mary was singing, though her voice went on and on. Until finally she sang\nDig the grave both wide and deep\nSick I am, and fain would sleep\nDig the grave and make it ready\nLay me on my true Love’s body\nand stopped. Leaving a silence that echoed on and on forever.\nThen Mary said, “There’s someone I think you’re ready to meet.”\nMary took me to a nondescript cinder block building, the location of which I will take with me to the grave. She led the way in. I followed nervously. The interior was so dim I stumbled on the threshold. Then my eyes adjusted, and I saw that I was in a bar. Not a pub, which is a warm and welcoming public space where families gather to socialize, the adults over a pint and the kiddies drinking their soft drinks, but a bar—a place where men go to get drunk. It smelled of poitín and stale beer. Somebody had ripped the door to the bog off its hinges and no one had bothered to replace it. Presumably Mary was the only woman to set foot in the place for a long, long time.\nThere were three or four men sitting at small tables in the gloom, their backs to the door, and a lean man with a bad complexion at the bar. “Here you are then,” he said without enthusiasm.\n“Don’t mind Liam,” Mary said to me. Then, to Liam, “Have you anything fit for drinking?”\n“No.”\n“Well, that’s not why we came anyway.” Mary jerked her head toward me. “Here’s the recruit.”\n“He doesn’t look like much.”\n“Recruit for what?” I said. It struck me suddenly that Liam was keeping his hands below the bar, out of sight. Down where a hard man will keep a weapon, such as a cudgel or a gun.\n“Don’t let his American teeth put you off. They’re part of the reason we wanted him in the first place.”\n“So you’re a patriot, are you, lad?” Liam said in a voice that indicated he knew good and well that I was not.\n“I have no idea what you’re talking about.”\nLiam glanced quickly at Mary and curled his lip in a sneer. “Ahh, he’s just in it for the crack.” In Irish craic means “fun” or “kicks.” But the filthy pun was obviously intended. My face hardened and I balled up my fists. Liam didn’t look concerned.\n“Hush, you!” Mary said. Then, turning to me, “And I’ll thank you to control yourself as well. This is serious business. Liam, I’ll vouch for the man. Give him the package.”\nLiam’s hands appeared at last. They held something the size of a biscuit tin. It was wrapped in white paper and tied up with string. He slid it across the bar.\n“What’s this?”\n“It’s a device,” Liam said. “Properly deployed, it can implode the entire administrative complex at Shannon Starport without harming a single civilian.”\nMy flesh ran cold.\n“So you want me to plant this in the ’port, do yez?” I said. For the first time in weeks, I became aware of the falseness of my accent. Impulsively, I pulled the neuropendant from beneath my shirt, dropped it on the floor, and stepped on it. Whatever I said here, I would say it as myself. “You want me to go in there and fucking blow myself up?”\n“No, of course not,” Mary said. “We have a soldier in place for that. But he—”\n“Or she,” Liam amended.\n“—or she isn’t in a position to smuggle this in. Human employees aren’t allowed to bring in so much as a pencil. That’s how little the Outsiders think of us. You, however, can. Just take the device through their machines—it’s rigged to read as a box of cigars—in your carry-on. Once you’re inside, somebody will come up to you and ask if you remembered to bring something for granny. Hand it over.”\n“That’s all,” Liam said.\n“You’ll be halfway to Jupiter before anything happens.”\nThey both looked at me steadily. “Forget it,” I said. “I’m not killing any innocent people for you.”\n“Not people. Aliens.”\n“They’re still innocent.”\n“They wouldn’t be here if they hadn’t seized the planet. So they’re not innocent.”\n“You’re a nation of fucking werewolves!” I cried. Thinking that would put an end to the conversation.\nBut Mary wasn’t fazed. “That we are,” she agreed. “Day by day, we present our harmless, domestic selves to the world, until one night the beast comes out to feed. But at least we’re not sheep, bleating complacently in the face of the butcher’s knife. Which are you, my heart’s beloved? A sheep? Or could there be a wolf lurking deep within?”\n“He can’t do the job,” Liam said. “He’s as weak as watered milk.”\n“Shut it. You have no idea what you’re talking about.” Mary fixed me with those amazing eyes of hers, as green as the living heart of Ireland, and I was helpless before them. “It’s not weakness that makes you hesitate,” she said, “but a foolish and misinformed conscience. I’ve thought about this far longer than you have, my treasure. I’ve thought about it all my life. It’s a holy and noble thing that I’m asking of you.”\n“I—”\n“Night after night, you’ve sworn you’d do anything for me—not with words, I’ll grant you, but with looks, with murmurs, with your soul. Did you think I could not hear the words you dared not say aloud? Now I’m calling you on all those unspoken promises. Do this one thing—if not for the sake of your planet, then for me.”\nAll the time we’d been talking, the men sitting at their little tables hadn’t made a noise. Nor had any of them turned to face us. They simply sat hunched in place—not drinking, not smoking, not speaking. Just listening. It came to me then how large they were, and how still. How alert. It came to me then that if I turned Mary down, I’d not leave this room alive.\nSo, really, I had no choice.\n“I’ll do it,” I said. “And God damn you for asking me to.”\nMary went to hug me and I pushed her roughly away. “No! I’m doing this thing for you, and that puts us quits. I never want to see you or think of you again.”\nFor a long, still moment, Mary studied me calmly. I was lying, for I’d never wanted her so much as I did in that instant. I could see that she knew I was lying, too. If she’d let the least sign of that knowledge show, I believe I would have hit her. But she did not. “Very well,” she said. “So long as you keep your word.”\nShe turned and left and I knew I would never see her again.\nLiam walked me to the door. “Be careful with the package outside in the rain,” he said, handing me an umbrella. “It won’t work if you let it get damp.”\nI was standing in Shannon Starport, when Homeworld Security closed in on me. Two burly men in ITSA uniforms appeared to my either side and their alien superior said, “Would you please come with us, sir.” It was not a question.\nOh, Mary, I thought sadly. You have a traitor in your organization. Other than me, I meant. “Can I bring my bag?”\n“We’ll see to that, sir.”\nI was taken to their interrogation room.\nFive hours later I got onto the lighter. They couldn’t hold me because there wasn’t anything illegal in my possession. I’d soaked the package Liam gave me in the hotel room sink overnight and then gotten up early and booted it down a storm drain when no one was looking. It was a quick trip to orbit where there waited a ship larger than a skyscraper and rarer than almost anything you could name, for it wouldn’t return to this planet for centuries. I floated on board knowing that for me there’d be no turning back. Earth would be a story I told my children, and a pack of sentimental lies they would tell theirs.\nMy homeworld shrank behind me and disappeared. I looked out the great black glass walls into a universe thronged with stars and galaxies and had no idea where I was or where I thought I was going. It seemed to me then that we were each and every one of us ships without a harbor, sailors lost on land.\nI used to say that only Ireland and my family could make me cry. I cried when my mother died and I cried when Dad had his heart attack the very next year. My baby sister failed to survive the same birth that killed my mother, so some of my tears were for her as well. Then my brother Bill was hit by a drunk driver and I cried and that was the end of my family. Now there’s only Ireland.\nBut that’s enough.\nOriginally published in Asimov’ Science Fiction, August 2011.\nMichael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.\nThis year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.\nHe lives in Philadelphia with his wife, Marianne Porter.", "source": "https://clarkesworldmagazine.com/swanwick_01_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: For I Have Lain Me Down on the Stone of Loneliness and I'll Not Be Back Again by Michael Swanwick"}