{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cat Rambo", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "x6ua/93QpDaxQ0EcbP4hernvVn0=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Reading For Pleasure  I have a friend—more than one of them, really—who complains about having encountered a phenomenon that I personally would consider a fate worse than death. They are always writers, and they complain that “writing has spoiled reading for them.” They’re just too aware of the mistakes, they say. The nuts and bolts are way too obvious. They can only read the very best of the best. And then they sigh wistfully.  I try not to recoil, wide-eyed, from the notion. I’m always a little worried, though, that I’m going to get infected by that attitude. From kindergarten days onward, I’ve always had a book in my hand in one form or another. The Internet didn’t exist when I was a kid, so I read and reread, and that habit has remained with me. Taking a ride on the bus? Shove a paperback book in my purse. Waiting on the phone for an answer? Pick up the closest text and read. Our house drips with books; a multitude more are contained on my Kindle.  Am I able to read every single book I pick up? No. But it’s much more likely that an overall approach to something will drive me away than any question of technique. If the focus is something that I find problematic, I may have some difficulty getting into it, but even there it may be more nuanced than that.  For example, let’s presume an older work where the assumption is that women cannot be spaceship pilots because (insert biological fact that actually doesn’t justify excluding them). I can probably read that with a minimum amount of mental eye-rolling. I may be less able to do so with a book that unrelentingly assumes that women are horrible monsters out to kill the narrator. Although I did manage to make it all the way through Naked Lunch and enjoyed it. More than once.  How do I manage it? Well, I do exactly what I tell my students to do. I read the work once through for pleasure. And then, if I either really loved it or hated it, I go back and figure out why. I have found that one of the great pleasures in life, actually, is taking an astounding piece of writing apart and looking at all the fascinating ways that it works. That doesn’t destroy my pleasure in it at all. In fact, it makes my admiration for the degree of craft that’s been employed even deeper.  Why go back to something that I hated? Because I want to make sure that I don’t do it in my own writing. Is it just a matter of a basic assumption that I don’t agree with? Then maybe I don’t need to look too closely. But what if I can’t exactly say why I didn’t like it? In that case I really do need to go figure out what happened because a mistake that you don’t understand is one that you are likely to make yourself.  In some ways, this is part of reading while female. So many classics presume a male reader that it becomes very easy to move to a position where you’re not just reading the book but watching yourself reading it. Assumptions are dangerous things and one of the hardest things in life to avoid. Grappling with yours is part of the reading experience, or at least should be every once in a while. Your mind needs that kind of exercise.  So often the readings of the good stuff show writers breaking the rules, and doing so with élan and grace. Take the first page of any Stephen King novel and strip out the punctuation. Now go back and try to punctuate it yourself before comparing it with what he actually did. You will notice he moves frequently outside the rules—and that every time he does it, there’s a reason, perhaps the effect it creates, perhaps something else, but it is never random. Never a mistake.  It’s humbling to look at a piece of work and think, I would’ve never thought to do it that way. But it’s also instructive, because now you would think to do it that way. Now you have a new tool that you can use. You should wander through a great book like a kid in a candy store on free sample day, stuffing as much good stuff in your pockets as you can possibly manage. And test them out, even if it’s just in a piece of flash fiction, so you have a sense of how they work when it’s you controlling the mechanism.  This is also why it’s important to be reading current stuff, to see what is happening in the field. Maybe the only way you’ll use it is to react to it. That’s fine. But a writer who doesn’t read is—in my opinion—denying themselves valuable mental input that would help them write better stories.  There is a strand in fantasy and science fiction that sometimes perpetuates a division between the literary and the nonliterary. It’s not a division that I’m fond of because it denies writers a whole wide range of tools and puts them up on a shelf marked “use at your own peril.” The fact of the matter is that good writing is crucial to a great book. The most gripping plot, the most sympathetic character, the snappiest of dialogue? All useless if the story’s not told in a way that lets it get to the reader. Bad writing gets in the way of understanding. Want to write something that matters? This is part of that and it’s not optional.  One of the often repeated maxims is that one must write a million words before you can get good enough to be published. This is not true. Some people write far less. And others may write more. Getting better is a matter of intentional practice. If you play a musical instrument, you may be familiar with this concept. You don’t play the same piece of music over and over again. You find the parts of it that are giving you trouble, and you practice them. You practice them a lot, not to the point where you unconsciously employ them, but to the point where you cannot make a mistake with them.  Are you having trouble with a particular aspect of writing? Then look to the authors who do that thing well. Look to the people that you think of when you think of that aspect, but go further than that and do some exploration. Ask other people who they think does it well. Poke around on the Internet for recommendations. Put some unfamiliar names on your reading list. And then read each piece through once, enjoying the heck out of it, knowing that you will come back later and examine it. You can have your cake and both eat it too, or at least that’s been my experience with this approach. Eat and enjoy. Then go bake some cake of your own. Cat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "text": "Non-Fiction\nAnother Word: Reading For Pleasure\nI have a friend—more than one of them, really—who complains about having encountered a phenomenon that I personally would consider a fate worse than death. They are always writers, and they complain that “writing has spoiled reading for them.” They’re just too aware of the mistakes, they say. The nuts and bolts are way too obvious. They can only read the very best of the best. And then they sigh wistfully.\nI try not to recoil, wide-eyed, from the notion. I’m always a little worried, though, that I’m going to get infected by that attitude. From kindergarten days onward, I’ve always had a book in my hand in one form or another. The Internet didn’t exist when I was a kid, so I read and reread, and that habit has remained with me. Taking a ride on the bus? Shove a paperback book in my purse. Waiting on the phone for an answer? Pick up the closest text and read. Our house drips with books; a multitude more are contained on my Kindle.\nAm I able to read every single book I pick up? No. But it’s much more likely that an overall approach to something will drive me away than any question of technique. If the focus is something that I find problematic, I may have some difficulty getting into it, but even there it may be more nuanced than that.\nFor example, let’s presume an older work where the assumption is that women cannot be spaceship pilots because (insert biological fact that actually doesn’t justify excluding them). I can probably read that with a minimum amount of mental eye-rolling. I may be less able to do so with a book that unrelentingly assumes that women are horrible monsters out to kill the narrator. Although I did manage to make it all the way through Naked Lunch and enjoyed it. More than once.\nHow do I manage it? Well, I do exactly what I tell my students to do. I read the work once through for pleasure. And then, if I either really loved it or hated it, I go back and figure out why. I have found that one of the great pleasures in life, actually, is taking an astounding piece of writing apart and looking at all the fascinating ways that it works. That doesn’t destroy my pleasure in it at all. In fact, it makes my admiration for the degree of craft that’s been employed even deeper.\nWhy go back to something that I hated? Because I want to make sure that I don’t do it in my own writing. Is it just a matter of a basic assumption that I don’t agree with? Then maybe I don’t need to look too closely. But what if I can’t exactly say why I didn’t like it? In that case I really do need to go figure out what happened because a mistake that you don’t understand is one that you are likely to make yourself.\nIn some ways, this is part of reading while female. So many classics presume a male reader that it becomes very easy to move to a position where you’re not just reading the book but watching yourself reading it. Assumptions are dangerous things and one of the hardest things in life to avoid. Grappling with yours is part of the reading experience, or at least should be every once in a while. Your mind needs that kind of exercise.\nSo often the readings of the good stuff show writers breaking the rules, and doing so with élan and grace. Take the first page of any Stephen King novel and strip out the punctuation. Now go back and try to punctuate it yourself before comparing it with what he actually did. You will notice he moves frequently outside the rules—and that every time he does it, there’s a reason, perhaps the effect it creates, perhaps something else, but it is never random. Never a mistake.\nIt’s humbling to look at a piece of work and think, I would’ve never thought to do it that way. But it’s also instructive, because now you would think to do it that way. Now you have a new tool that you can use. You should wander through a great book like a kid in a candy store on free sample day, stuffing as much good stuff in your pockets as you can possibly manage. And test them out, even if it’s just in a piece of flash fiction, so you have a sense of how they work when it’s you controlling the mechanism.\nThis is also why it’s important to be reading current stuff, to see what is happening in the field. Maybe the only way you’ll use it is to react to it. That’s fine. But a writer who doesn’t read is—in my opinion—denying themselves valuable mental input that would help them write better stories.\nThere is a strand in fantasy and science fiction that sometimes perpetuates a division between the literary and the nonliterary. It’s not a division that I’m fond of because it denies writers a whole wide range of tools and puts them up on a shelf marked “use at your own peril.” The fact of the matter is that good writing is crucial to a great book. The most gripping plot, the most sympathetic character, the snappiest of dialogue? All useless if the story’s not told in a way that lets it get to the reader. Bad writing gets in the way of understanding. Want to write something that matters? This is part of that and it’s not optional.\nOne of the often repeated maxims is that one must write a million words before you can get good enough to be published. This is not true. Some people write far less. And others may write more. Getting better is a matter of intentional practice. If you play a musical instrument, you may be familiar with this concept. You don’t play the same piece of music over and over again. You find the parts of it that are giving you trouble, and you practice them. You practice them a lot, not to the point where you unconsciously employ them, but to the point where you cannot make a mistake with them.\nAre you having trouble with a particular aspect of writing? Then look to the authors who do that thing well. Look to the people that you think of when you think of that aspect, but go further than that and do some exploration. Ask other people who they think does it well. Poke around on the Internet for recommendations. Put some unfamiliar names on your reading list. And then read each piece through once, enjoying the heck out of it, knowing that you will come back later and examine it. You can have your cake and both eat it too, or at least that’s been my experience with this approach. Eat and enjoy. Then go bake some cake of your own.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America.", "source": "https://clarkesworldmagazine.com/another_word_03_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Reading For Pleasure by Cat Rambo"}