{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Doug Dluzen", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "S4d1BzilvmAaba+6+w/J0hLRGIU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  How and Why CRISPR Will Change the World  There is a silent war that is waging on every surface of the planet, in every droplet of water, and on the skin and within the bodies of everyone you know. It’s hypothesized by some that this war began near the dawn of life on Earth. Almost certainly, we have that war to thank for giving us the power to precisely edit our own genomes and play God with our own destinies.  The give and take between bacteria and bacteriophage, those tiny viruses which infect bacterial cells and are more populous than all living cells on Earth, combined, has produced selective pressures to promote their coevolution. CRISPR (Clustered Regularly Interspaced Short Palindromic Repeats) is a genetic mechanism in which bacteria evolved to protect themselves from their viral invaders. In short, CRISPR is a very simple and effective immune system. CRISPR gene-editing technology is a modification of this immune system and its stunning success in the laboratory is reshaping medicine, agriculture, data storage, and perhaps one day it will guide our own evolution.  How Does CRISPR Work?  CRISPR gets its name from palindromic (i.e. the same when read either forwards or backwards) sequences found repeatedly within the genomes of most single-celled archaea prokaryotes and within many bacteria. Stuffed in between these repeating sequences are fragments of bacteriophage and other viral genomes that have been captured by the cell. Stored within the CRISPR genomic locus, it acts as a sort of genetic memory bank. When the next virus comes along and invades a cell, the CRISPR locus of the genome kicks into gear.  First, the stored bits of viral genomes are expressed as RNA transcripts known as guide RNA (gRNA). These gRNA bind with specialized proteins, such as Cas9, to target the invading virus. The gRNA/Cas9 complex then aligns alongside the foreign DNA, although this can also occur with viral RNA genomes, too.  If there’s a perfect match between the foreign DNA and the gRNA, then Cas9 will cleave apart the viral DNA and effectively destroy the ability of the virus to replicate within the cell. These fresh strands of cut DNA can then be claimed by the cell and stored within the CRISPR locus, effectively creating a living memory of the different viruses that have infected that bacterial cell. Importantly, once the viral genome becomes stored within CRISPR, it will forever be passed onto the progeny when that bacteria splits into daughter cells, thereby passing along its immunity.  There are a variety of other protein players involved, including those that cut and paste the captured viral genomic sequences into the CRISPR locus, proteins and other RNAs required to process and assist the gRNAs, and other family members of the famous Cas9 protein that have slightly altered functions or specificities. But what’s important to know is that this immune system is eerily similar to our own, where instead of using protein antibodies to provide resistance to pathogens, bacteria are simply using RNA.  In 2012, Drs. Jennifer Doudna at the University of California, Berkeley and Emmanuelle Charpentier at Umeå University in Sweden were the first to publish that the gRNA could be engineered to guide Cas9 to identify and bind with a specific location along a bacterial genome and cut the DNA strands. They speculated that tailoring specific gRNAs into Cas9 could be used as a more precise and effective gene-editing system and would be useful for future applications in biological research.  Months later, Drs. Feng Zhang of MIT and George Church at Harvard were able to adapt this system to more complex eukaryotic genomes, including those of human cells (this timeline of publication events will be extremely important, as we’ll see later). The CRISPR tool for precise genetic editing had been discovered—all thanks to the ongoing war between bacteria and viruses.  The immense potential of this technology and its implications were immediately apparent. Scientists have had the ability to edit genes and genomes for decades, but what sets CRISPR apart from the other technologies is the simplicity, speed, and cost-effectiveness of this new approach.  And while some discussion remains within the scientific community on how precise this method is, CRISPR is undeniably the most reliable method for genetic engineering. Its reliability is due to the eloquence of the procedure. All one needs to do is purchase a CRISPR-Cas9 kit from one of several manufacturers (and there are plenty of them), design the gRNA to target a gene or genetic region of interest, and introduce the entire system into the cell. It is such a straightforward process that it has already become a staple procedure in many undergraduate teaching laboratories.  As with any discovery in science, there are numerous benefits and potential drawbacks with the use of CRISPR technology. However, there’s also an ugly economic component that can’t be ignored when considering the implications of its use.  The Good CRISPR  CRISPR technology has already provided scientists and clinicians with the power to improve human health. For example, CRISPR is being used to train immune cells to better recognize and attack primary tumors. In mice, circulating tumor cells were isolated from blood and engineered using CRISPR to deliver proteins back to the primary tumor and induce tumor cell death. These CRISPR-modified circulating cells are also programmed to be susceptible to administered drugs that prevent the engineered cells from developing into their own new tumor. It’s a guided missile with a fail-safe.  Phase I clinical trials are scheduled to begin this year in the United States to use CRISPR-based approaches to treat melanoma and several other cancers, and trials are already underway in China to treat advanced lung cancer.  In 2017, researchers used CRISPR in human embryos to correct a mutated version of the MYBPC3 gene, which is responsible for inherited cardiomyopathy. CRISPR approaches are also being explored to treat other congenital diseases, such as sickle cell anemia and phenylketonuria.  CRISPR is also a new weapon against the spread of communicable diseases. It’s being used to understand and combat the pathology of diseases such as AIDS, malaria, and Zika infection, and is aiding the development of vaccines targeting these diseases and many more. Scientists have also used CRISPR to modify mosquitos so that they can no longer carry viruses that cause yellow or dengue fever and CRISPR has opened the door to understanding the genetics of additional disease-hosting organisms.  There are also plenty of nonmedical applications for CRISPR. CRISPR-based data recording has been used to record the events that happen on the genomic level to a particular cell in real time. This system can also be adopted to store data in bacterial genomes, including short videos of a horse running that was used as a proof of principle published in 2017. Its been thought that storing information in bacterial genomes could serve as a back up databank of the Internet or other large file depositories whenever the need for additional storage is required.  Additionally, editing the genomes of crops has led to a breakthrough in agriculture. CRISPR has helped develop new varieties of the domestic tomato plant which has increased their yield and diversified their genetic background. Several genes within the rice genome were recently edited which lead to a substantial increase in grain yield for these new strains, which may be receptive to growing in harsher environments. Climate change and overpopulation continue to place ever-increasing strain on our food supply, making it likely that scientists and governments will continue to find new ways to use CRISPR when combating such global challenges.  The Bad CRISPR  As Michael Crichton warned in Jurassic Park, messing with genetic technologies can have unintended consequences. CRISPR is not flawless. Off-target effects have been reported that may impair the cell’s ability to repair the DNA damage that can be induced when initiating DNA edits. This could lead to the development of cancer or other abnormalities in CRISPR-treated cells that are put back into an individual. Scientists are working hard to further our understanding of these deficiencies and to resolve them.  Often in science we find that nature provides more elegant solutions than the laboratory. We need only look back to the constant war between bacteria and bacteriophage for a potential solution to possible uncontrolled effects of CRISPR. Some phages have evolved their own response to CRISPR. Tucked within the genomes of these phages are genes that code for proteins that will actually bind with Cas9 and prevent Cas9 from cutting and destroying the invading viral genome. These anti-CRISPR proteins have been referred to as a “switch” of sorts that could be useful in preventing CRISPR from running rampant throughout the genomes of particular organisms.  Another cause for concern is the combined use of CRISPR with gene drives. A gene drive is a genetic mechanism which can induce increased probability of inheritance of a specific gene in a population. Once CRISPR is introduced into the germline of a particular organism, gene drives can be initiated to spread the CRISPR components and the resulting edits through a wild population within a few generations. This has already been shown in insects, including mosquitoes, and most recently in mice (although the research article is still under peer review).  There is a potential danger in not knowing the long-term risks of the use of a gene drive in an organism like a mosquito or within its surrounding ecosystem. What would happen if all the mosquitos were killed off to stop the spread of malaria? Would the food chain collapse for creatures that rely on mosquitos? What other problems within the local ecosystem could also occur?  These questions keep many awake at night, and with good reason. The power of CRISPR truly is the power of a god, in that manipulating the germline of an organism could forever change its evolution.  This includes humans.  Perhaps the biggest question mark surrounding CRISPR is how the technology will be used in humans. To be clear, there is a difference when using CRISPR in adult cells in a human body (as in the case with cancer or other disease-related therapies) and in the germline cell, which would be a permanent and heritable change. There is no danger in passing along adult cell modifications to the next generation because the egg and sperm cells, the true gatekeepers of our inheritance, remain untouched.  It’s tempting to edit a human embryo in order to eliminate the chances of passing along a disease allele to a child, such as with Huntington’s Disease. But we don’t yet understand the full implications of what this would mean in society and how quickly it might turn to other types of “designer” modifications that could forever change the course of human evolution . . . or perhaps lead to a Gattaca/Brave New World-like future. Today in the United States and the European Union, there is a ban on using CRISPR technology on viable human embryos. This is not the case everywhere and attempts to modify viable human embryos may well have begun.  And the Ugly . . .  It’s a very real possibility that the future scientific use and development of CRISPR will be decided in the courts. With the seemingly unlimited potential of such a revolutionary technology, it’s not surprising that vested interests have sharpened their swords, lawyered-up, and staked claims of ownership. The Broad Institute of MIT and Harvard University and the University of California, Berkeley have each filed patent claims for ownership and rights to license the commercial use of CRISPR technology in the United States. At stake is a pot of gold that could surpass anything in today’s use of modern biotechnology (as long as CRISPR continues to be the gold standard in gene editing).  Patent law can be fickle and this is certainly the case with the CRISPR court battles in the United States. Mentioned earlier, Dr. Jennifer Doudna at UC Berkley and her collaborators were the first to publish on the use of CRISPR to edit bacterial genomes. She also filed a full patent on this technology in May 2012, a month before her publication appeared. Dr. Feng Zhang of MIT published his work using CRISPR in more complex eukaryotic cells in January 2013 and filed his patent the month before in December 2012, only he filed an expedited application.  It’s not often that such prestigious research institutes go to court against one another so publicly. The courts have sided with MIT in both the initial patent award as well as in the first appeal by UC Berkeley. In the United States the final verdict may boil down to a scientific quirk.  There are many complex scenarios that support both Berkeley and MIT’s claims, but the central issue appears to be whether or not the MIT patent is different enough from Berkeley’s—and the scientific question for the judges is whether or not performing CRISPR in eukaryotic cells is uniquely different from performing the experiment in simpler prokaryotic cells, as Dr. Doudna did first.  The differences between prokaryotic and eukaryotic cells are vast, including the complexity of the genome, the structure and size, the requirements necessary to successfully perform a gene edit, and how to navigate the nuclear membrane, which is lacking in prokaryotic cells.  But it is also not a stretch of the imagination for a gifted scientist like Jennifer Doudna to envision using the CRISPR system to edit genes in eukaryotes. Often, less complex model organisms like bacteria are used first as a proof of concept. Indeed, although Doudna and Charpentier’s paper doesn’t mention the word eukaryotes, they do mention this technology should cleave any “double-stranded DNA of interest” and moving this system to human cells can be inferred. It remains to be seen who the ultimate victor will be.  The Road Ahead  Until the patent battle has been resolved, it will be challenging for society to identify where and when CRISPR should be used. Every week dozens of new journal articles are published exemplifying the use of this technology for this gene or that disease or in animal models.  A revolutionary technology like CRISPR needs to be open and shared with all, while still maintaining rigorous measures to ensure its safe and appropriate use. Many of the uses of CRISPR hold phenomenal potential for improving our health and lives. But because the stakes are so high, the input of and adherence by the global community is required to identify concrete steps to safeguard its use. Hopefully that day comes sooner rather than later. Douglas Dluzen, PhD, is a senior science writer and editor at the NIMHD. He is a geneticist and has previously studied the genetic contributors to aging, cancer, hypertension, and other age-related diseases. He loves to write science and science fiction while sitting on the couch with his wife Julia (who has immeasurably helped him fact-check and edit his work), son Parker, and daughter Cedar.", "text": "Non-Fiction\nHow and Why CRISPR Will Change the World\nThere is a silent war that is waging on every surface of the planet, in every droplet of water, and on the skin and within the bodies of everyone you know. It’s hypothesized by some that this war began near the dawn of life on Earth. Almost certainly, we have that war to thank for giving us the power to precisely edit our own genomes and play God with our own destinies.\nThe give and take between bacteria and bacteriophage, those tiny viruses which infect bacterial cells and are more populous than all living cells on Earth, combined, has produced selective pressures to promote their coevolution. CRISPR (Clustered Regularly Interspaced Short Palindromic Repeats) is a genetic mechanism in which bacteria evolved to protect themselves from their viral invaders. In short, CRISPR is a very simple and effective immune system. CRISPR gene-editing technology is a modification of this immune system and its stunning success in the laboratory is reshaping medicine, agriculture, data storage, and perhaps one day it will guide our own evolution.\nHow Does CRISPR Work?\nCRISPR gets its name from palindromic (i.e. the same when read either forwards or backwards) sequences found repeatedly within the genomes of most single-celled archaea prokaryotes and within many bacteria. Stuffed in between these repeating sequences are fragments of bacteriophage and other viral genomes that have been captured by the cell. Stored within the CRISPR genomic locus, it acts as a sort of genetic memory bank. When the next virus comes along and invades a cell, the CRISPR locus of the genome kicks into gear.\nFirst, the stored bits of viral genomes are expressed as RNA transcripts known as guide RNA (gRNA). These gRNA bind with specialized proteins, such as Cas9, to target the invading virus. The gRNA/Cas9 complex then aligns alongside the foreign DNA, although this can also occur with viral RNA genomes, too.\nIf there’s a perfect match between the foreign DNA and the gRNA, then Cas9 will cleave apart the viral DNA and effectively destroy the ability of the virus to replicate within the cell. These fresh strands of cut DNA can then be claimed by the cell and stored within the CRISPR locus, effectively creating a living memory of the different viruses that have infected that bacterial cell. Importantly, once the viral genome becomes stored within CRISPR, it will forever be passed onto the progeny when that bacteria splits into daughter cells, thereby passing along its immunity.\nThere are a variety of other protein players involved, including those that cut and paste the captured viral genomic sequences into the CRISPR locus, proteins and other RNAs required to process and assist the gRNAs, and other family members of the famous Cas9 protein that have slightly altered functions or specificities. But what’s important to know is that this immune system is eerily similar to our own, where instead of using protein antibodies to provide resistance to pathogens, bacteria are simply using RNA.\nIn 2012, Drs. Jennifer Doudna at the University of California, Berkeley and Emmanuelle Charpentier at Umeå University in Sweden were the first to publish that the gRNA could be engineered to guide Cas9 to identify and bind with a specific location along a bacterial genome and cut the DNA strands. They speculated that tailoring specific gRNAs into Cas9 could be used as a more precise and effective gene-editing system and would be useful for future applications in biological research.\nMonths later, Drs. Feng Zhang of MIT and George Church at Harvard were able to adapt this system to more complex eukaryotic genomes, including those of human cells (this timeline of publication events will be extremely important, as we’ll see later). The CRISPR tool for precise genetic editing had been discovered—all thanks to the ongoing war between bacteria and viruses.\nThe immense potential of this technology and its implications were immediately apparent. Scientists have had the ability to edit genes and genomes for decades, but what sets CRISPR apart from the other technologies is the simplicity, speed, and cost-effectiveness of this new approach.\nAnd while some discussion remains within the scientific community on how precise this method is, CRISPR is undeniably the most reliable method for genetic engineering. Its reliability is due to the eloquence of the procedure. All one needs to do is purchase a CRISPR-Cas9 kit from one of several manufacturers (and there are plenty of them), design the gRNA to target a gene or genetic region of interest, and introduce the entire system into the cell. It is such a straightforward process that it has already become a staple procedure in many undergraduate teaching laboratories.\nAs with any discovery in science, there are numerous benefits and potential drawbacks with the use of CRISPR technology. However, there’s also an ugly economic component that can’t be ignored when considering the implications of its use.\nThe Good CRISPR\nCRISPR technology has already provided scientists and clinicians with the power to improve human health. For example, CRISPR is being used to train immune cells to better recognize and attack primary tumors. In mice, circulating tumor cells were isolated from blood and engineered using CRISPR to deliver proteins back to the primary tumor and induce tumor cell death. These CRISPR-modified circulating cells are also programmed to be susceptible to administered drugs that prevent the engineered cells from developing into their own new tumor. It’s a guided missile with a fail-safe.\nPhase I clinical trials are scheduled to begin this year in the United States to use CRISPR-based approaches to treat melanoma and several other cancers, and trials are already underway in China to treat advanced lung cancer.\nIn 2017, researchers used CRISPR in human embryos to correct a mutated version of the MYBPC3 gene, which is responsible for inherited cardiomyopathy. CRISPR approaches are also being explored to treat other congenital diseases, such as sickle cell anemia and phenylketonuria.\nCRISPR is also a new weapon against the spread of communicable diseases. It’s being used to understand and combat the pathology of diseases such as AIDS, malaria, and Zika infection, and is aiding the development of vaccines targeting these diseases and many more. Scientists have also used CRISPR to modify mosquitos so that they can no longer carry viruses that cause yellow or dengue fever and CRISPR has opened the door to understanding the genetics of additional disease-hosting organisms.\nThere are also plenty of nonmedical applications for CRISPR. CRISPR-based data recording has been used to record the events that happen on the genomic level to a particular cell in real time. This system can also be adopted to store data in bacterial genomes, including short videos of a horse running that was used as a proof of principle published in 2017. Its been thought that storing information in bacterial genomes could serve as a back up databank of the Internet or other large file depositories whenever the need for additional storage is required.\nAdditionally, editing the genomes of crops has led to a breakthrough in agriculture. CRISPR has helped develop new varieties of the domestic tomato plant which has increased their yield and diversified their genetic background. Several genes within the rice genome were recently edited which lead to a substantial increase in grain yield for these new strains, which may be receptive to growing in harsher environments. Climate change and overpopulation continue to place ever-increasing strain on our food supply, making it likely that scientists and governments will continue to find new ways to use CRISPR when combating such global challenges.\nThe Bad CRISPR\nAs Michael Crichton warned in Jurassic Park, messing with genetic technologies can have unintended consequences. CRISPR is not flawless. Off-target effects have been reported that may impair the cell’s ability to repair the DNA damage that can be induced when initiating DNA edits. This could lead to the development of cancer or other abnormalities in CRISPR-treated cells that are put back into an individual. Scientists are working hard to further our understanding of these deficiencies and to resolve them.\nOften in science we find that nature provides more elegant solutions than the laboratory. We need only look back to the constant war between bacteria and bacteriophage for a potential solution to possible uncontrolled effects of CRISPR. Some phages have evolved their own response to CRISPR. Tucked within the genomes of these phages are genes that code for proteins that will actually bind with Cas9 and prevent Cas9 from cutting and destroying the invading viral genome. These anti-CRISPR proteins have been referred to as a “switch” of sorts that could be useful in preventing CRISPR from running rampant throughout the genomes of particular organisms.\nAnother cause for concern is the combined use of CRISPR with gene drives. A gene drive is a genetic mechanism which can induce increased probability of inheritance of a specific gene in a population. Once CRISPR is introduced into the germline of a particular organism, gene drives can be initiated to spread the CRISPR components and the resulting edits through a wild population within a few generations. This has already been shown in insects, including mosquitoes, and most recently in mice (although the research article is still under peer review).\nThere is a potential danger in not knowing the long-term risks of the use of a gene drive in an organism like a mosquito or within its surrounding ecosystem. What would happen if all the mosquitos were killed off to stop the spread of malaria? Would the food chain collapse for creatures that rely on mosquitos? What other problems within the local ecosystem could also occur?\nThese questions keep many awake at night, and with good reason. The power of CRISPR truly is the power of a god, in that manipulating the germline of an organism could forever change its evolution.\nThis includes humans.\nPerhaps the biggest question mark surrounding CRISPR is how the technology will be used in humans. To be clear, there is a difference when using CRISPR in adult cells in a human body (as in the case with cancer or other disease-related therapies) and in the germline cell, which would be a permanent and heritable change. There is no danger in passing along adult cell modifications to the next generation because the egg and sperm cells, the true gatekeepers of our inheritance, remain untouched.\nIt’s tempting to edit a human embryo in order to eliminate the chances of passing along a disease allele to a child, such as with Huntington’s Disease. But we don’t yet understand the full implications of what this would mean in society and how quickly it might turn to other types of “designer” modifications that could forever change the course of human evolution . . . or perhaps lead to a Gattaca/Brave New World-like future. Today in the United States and the European Union, there is a ban on using CRISPR technology on viable human embryos. This is not the case everywhere and attempts to modify viable human embryos may well have begun.\nAnd the Ugly . . .\nIt’s a very real possibility that the future scientific use and development of CRISPR will be decided in the courts. With the seemingly unlimited potential of such a revolutionary technology, it’s not surprising that vested interests have sharpened their swords, lawyered-up, and staked claims of ownership. The Broad Institute of MIT and Harvard University and the University of California, Berkeley have each filed patent claims for ownership and rights to license the commercial use of CRISPR technology in the United States. At stake is a pot of gold that could surpass anything in today’s use of modern biotechnology (as long as CRISPR continues to be the gold standard in gene editing).\nPatent law can be fickle and this is certainly the case with the CRISPR court battles in the United States. Mentioned earlier, Dr. Jennifer Doudna at UC Berkley and her collaborators were the first to publish on the use of CRISPR to edit bacterial genomes. She also filed a full patent on this technology in May 2012, a month before her publication appeared. Dr. Feng Zhang of MIT published his work using CRISPR in more complex eukaryotic cells in January 2013 and filed his patent the month before in December 2012, only he filed an expedited application.\nIt’s not often that such prestigious research institutes go to court against one another so publicly. The courts have sided with MIT in both the initial patent award as well as in the first appeal by UC Berkeley. In the United States the final verdict may boil down to a scientific quirk.\nThere are many complex scenarios that support both Berkeley and MIT’s claims, but the central issue appears to be whether or not the MIT patent is different enough from Berkeley’s—and the scientific question for the judges is whether or not performing CRISPR in eukaryotic cells is uniquely different from performing the experiment in simpler prokaryotic cells, as Dr. Doudna did first.\nThe differences between prokaryotic and eukaryotic cells are vast, including the complexity of the genome, the structure and size, the requirements necessary to successfully perform a gene edit, and how to navigate the nuclear membrane, which is lacking in prokaryotic cells.\nBut it is also not a stretch of the imagination for a gifted scientist like Jennifer Doudna to envision using the CRISPR system to edit genes in eukaryotes. Often, less complex model organisms like bacteria are used first as a proof of concept. Indeed, although Doudna and Charpentier’s paper doesn’t mention the word eukaryotes, they do mention this technology should cleave any “double-stranded DNA of interest” and moving this system to human cells can be inferred. It remains to be seen who the ultimate victor will be.\nThe Road Ahead\nUntil the patent battle has been resolved, it will be challenging for society to identify where and when CRISPR should be used. Every week dozens of new journal articles are published exemplifying the use of this technology for this gene or that disease or in animal models.\nA revolutionary technology like CRISPR needs to be open and shared with all, while still maintaining rigorous measures to ensure its safe and appropriate use. Many of the uses of CRISPR hold phenomenal potential for improving our health and lives. But because the stakes are so high, the input of and adherence by the global community is required to identify concrete steps to safeguard its use. Hopefully that day comes sooner rather than later.\nDouglas Dluzen, PhD, is a senior science writer and editor at the NIMHD. He is a geneticist and has previously studied the genetic contributors to aging, cancer, hypertension, and other age-related diseases. He loves to write science and science fiction while sitting on the couch with his wife Julia (who has immeasurably helped him fact-check and edit his work), son Parker, and daughter Cedar.", "source": "https://clarkesworldmagazine.com/dluzen_09_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: How and Why CRISPR Will Change the World by Doug Dluzen"}