{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nick Wolven", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p9VYB1/BZwpD2ZhYQsSOGye24/g=", "id": null, "license": null, "comments": "", "raw_text": "7590 words, novelette, REPRINT  No Placeholder for You My Love  1  Claire met him at a dinner party in New Orleans, and afterward, she had to remind herself this was true. Yes, that had been it, his very first appearance. It seemed incredible there had been anything so finite as a first time.  He was seated across from her, two chairs down, a gorgeous woman on either side. As usual, the subject had turned to food.  “But I’ve been to this house a dozen times,” one of the gorgeous women was saying. “I’ve been to dinner parties, dance parties, even family parties. And every time, they serve the wrong kind of cuisine.”  She had red hair, the color of the candlelight reflected off the varnished chairs. The house was an old house, full of old things, handmade textiles and walnut chiffoniers, oil paintings of nameless Civil War colonels.  “Is that a problem?” said the young man on Claire’s left. “Why should you care?”  “Because,” said the redhead, pursing her lips. “Meringue pie, at an elegant soiree? Wine and steak tartar, at a child’s birthday party? Lobster bisque at a dance? For God’s sake, it was all over the floor. It seems, I don’t know. Lazy. Thoughtless. Cobbled together.”  She lifted her glass of wine to her mouth, and the liquid vanished the instant it touched her tongue.  The man who was to mean so much to Claire, to embody in his person so much hope and loss, leaned over his soup, eyes dark with amusement. “It is cobbled together. Of course it is. But isn’t that the best part?”  “And why is that, Byron?” someone said with a sigh.  Byron. A fake name, Claire assumed, distilled from the fog of some half-remembered youthful interest. But then, you never knew.  Whatever the source of his name, Byron’s face had the handsome roughness earned through active living. Dots of stubble grayed his skin. A tiny scar divided one eyebrow. His smile made a charming pattern of wrinkles around his eyes. It was a candid face, a well-architected face, a forty-something face.  “Because,” said Byron, and caught Claire’s eye, as if only she would understand. “Look at this furniture, the chandelier. Look at that music stand in the corner. American plantation style, rococo, Art Nouveau. Every piece a different movement. Some are complete anachronisms. That’s why I love this house. You can see the spirit of the designers, here. A kind of whimsy. It’s so personal, so scattershot.”  “You’re such a talker, Byron,” someone sighed.  “Look at all of you,” Byron said, moving his spoon in a circle to encompass the ring of faces. “Some of you I’ve never seen before in my life. And here we are, brought together by chance, for one evening only. You know what? That delights me. That thrills me.” His gesture halted at Claire’s face. “That enchants me.”  “And after tonight,” said the redhead, “we’ll go our separate ways, and forget each other, and maybe never see each other again. So is that part of the wonder, for you, Byron, or does that spoil the wonder?”  “It does neither,” Byron said, “because I don’t believe it.”  His eyes settled on Claire’s. Again, he smiled. She had always liked older men, their slightly chastened air, their solemn and good-humored strength.  “I don’t believe we’ll never see each other again,” Byron said, looking at his spoon. “I don’t believe that’s necessarily our fate. And you know what? The truth is, I wouldn’t mind living in this house forever. Even if they do serve alphabet soup at a dinner party.”  He lifted his hand to his mouth and touched his spoon to his lips. And instantly, the liquid disappeared.  When they had cleared the table, the entertainments began. There were board games in the living room, a live band on the lawn. Stairs led to a dozen shadowy bedrooms, with sad old beds, and rich old carpets, and orchids in baskets on the moonlit windowsills. In town, the music of riverbank revelry scraped and jittered out of ramshackle bars, and paddleboats rode on the slow Mississippi, jingling with the racket of riches won and lost.  Byron borrowed a set of car keys from the houseboy. Claire followed him onto the porch. The breath of the bayou was in the air, warm and buoyant, holding up the clustered leaves of the pecan trees and the high, star-scattered sky. Sweat held her shirt to the small of her back, as if a hand were there, pressing her forward.  “Shall we take a ride?” The car keys dangled, tinkling, from Byron’s upraised hand.  “Wait,” said Claire, “do that again.”  “This?” He gave the keys another shake. The sound tinkled out, a sprinkling of noise, over the thick green nap of the lawn.  “It sounds just like it,” Claire said. “Don’t you hear it? It sounds just like the midnight chime.”  “Oh, God, don’t talk about that now. It’s not for hours.” Byron went halfway down the porch steps, held out a hand. “We still have plenty of time to fall in love.”  The car waiting for them was an early roadster, dazzling with chrome, large and slow. Byron handled the old-fashioned shift with expert nonchalance. They slid past banquet halls downtown, where drunkenness and merriment and red, frantic faces sang and sweated along the laden tables. Often, they pulled to the curb and idled, and the night with its load of romance rolled by.  At a corner café where zydeco livened the air, a young couple argued at a scrollwork table.  “But how can you define it? How can you even describe it?” The woman’s arm swung as she spoke, agitating the streetlights with a quiver of silver bracelets.  “Well, it’s easy enough to define, anyway.” The man made professorial motions with his hands. “It was simply a matter of chemistry.”  “But how would that be any different from, say, smell?”  “Oh, it wasn’t, not really. Taste and smell. Love and desire. All variations on the same experience.”  The couple lifted fried shrimp from a basket as they spoke, the small golden morsels vanishing like fireflies on their lips.  “It can’t be so simple,” the woman said. And the man leaned over the table, reaching for her face, and turned it toward his lips. “You’re right. It’s not.”  “I used to have those kinds of conversations,” Byron sighed. He grasped the old maple knob of the shift, and pulled away from the curb.  They drove out of town onto rural dirt roads, where moonlight splashed across the land. In a plank roadhouse, a dance party was underway, a fiddle keening over stamping feet. Parked in the dirt lot, soaked in yellow light, they conducted the usual conversation.  “Now, me?” Byron said. “Let me tell you about myself. I’m a middle-aged computer programmer who enjoys snuggling, whiskey, and the study of artificial environments. I have a deathly aversion to crowds, and I’m not afraid to admit it. I’m nowhere near as handsome as this in real life, and I can assure you, I’ve been at this game a very long time.”  His face dimpled as he delivered his spiel, not quite smiling. Claire laughed at his directness. Byron thumped a short drumroll on the wheel.  “And you?”  “Oh, me?” Claire said. “Me? I’m no one.”  “That’s an interesting theory.”  “What I mean is, I’m no one anyone should care about. I don’t even care about me.”  “That can’t be true.”  “I guess not. I guess what I mean is, I don’t care who I used to be.” Claire watched the figures dance in the building, the plank walls trembling as shadows moved like living drawings across the dirty windows. “I care what happens to me now, though. I care about nights like this.”  Her lazy hand took in the dancers, the stars. Byron sat back, nodding.  Claire surrendered. “I don’t know. There’s an interesting woman back there, somewhere. A scholar, a geneticist. But it’s hard to believe, nowadays, that she ever existed.”  “Tell me about this geneticist,” he said.  “Well.” Claire afforded him a smile. “What do you want to know? She looked like me. She talked like me. She loved all the things I love. She loved rainy windows and Scrabble and strong tea. She loved her body, because she had a nice one, and she loved to take long baths with organic soap, and she loved the idea that one day, far in her future, there might be someone to share those baths with her. Mostly, I think, she loved the idea that she could find a man who didn’t care about any of those things. A man who would simply take her hand and say, ‘Let’s go.’”  The fiddle stopped. The dancers halted. The shadows on the windows settled into perfect sketches: honey-colored men and women with open, panting lips.  “She was young,” Claire said. “And she was lonely.”  Byron nodded. “I understand.”  Someone threw open the roadhouse door. A carpet of gold rolled down the steps, all the way up the hood into the car, covering Claire in mellow light. Byron studied her. She knew what he was seeing. A beautiful blonde, a perfect face, a statue of a body with cartoon-sized eyes.  “But you’re not,” he said. And after a moment, he clarified: “Young. Not anymore. Are you?”  “No,” said Claire. “Not anymore.”  They drove to town along a different route, on dark, swampy roads where alligators slithered, grunting, from the wheels. On a wharf lined with couples and fishing shops, they stood at the wood rail, looking over the water, waiting together for the midnight chime. A gas-powered ferry struggled from shore, heading northeast toward a sprawl of dark land.  “I don’t care,” Byron said. “I don’t care if you were a biologist. I don’t care if you love Scrabble or tea. I don’t care about any of that.” He held out a hand. “Let’s go.”  The couples on the wharf had fallen silent, waiting. The very twinkling of the stars seemed to pause. Still, the ferry strained and chugged, heading for a shore it would never reach.  “Say it,” Claire said. “You say it first, then I’ll say it, too.”  “I want to see you again,” Byron said.  She took his hand. Before she could respond, the midnight chime sounded. It came three times, eerie and clear, like a jingle of celestial keys. And Byron and the river and the world all disappeared.  2  Claire didn’t see him again for a thousand nights.  It felt like a thousand, anyway. It may have been more. Claire had stopped counting long, long ago.  There were always more nights, more parties, more diversions. And, miraculous as it seemed, more people. Where did they come from? How could there be so many pretty young men, with leonine confidence and smiling lips? How could there be so many women arising out of the million chance assortments of the clubs, swimming through parties as if it could still be a thrill to have a thousand eyes fish for them—as if, like the fish in the proverbial sea, they one day hoped to be hooked?  Claire considered them, contemplated them, and let them go their way. She dated, for a time, a very old, handsome man whose name, in some remote and esoteric way, commanded powerful sources of credit. His wealth opened up new possibilities: private beaches where no one save they two had ever stepped, mountain lodges where the seasons manifested with iconic perfection, pink and green and gold and white. But they weren’t, as the language ran, “compatible”; they were old and tired in different ways.  She met a girl whose face flashed with the markings of youth: sharp earrings, studs, lipstick that blazed in toxic colors. But the girl’s eyes moved slowly, with the irony of age. Theirs was a sexual connection. Night after night, they bowed out of cocktail hours, feeling for each other’s hands across the crush of dances. Every exit was an escape. They sought the nearest private rooms they could find: the neon-bright retreats of city hotels, secret brick basements in converted factories. The thrill was one of shared expertise. Both women knew the limits of sex: what moves were possible, what borders impermeable. They cultivated the matched rhythm, the long caress. Sometimes Claire’s new lover—whose name, she learned after three anonymous encounters, was Isolde—fed delicacies to her, improbable foods, ice carvings and whole cakes, a hundred olives impaled on swizzle sticks, fruit rinds in paintbox colors, orange and lime, stolen from the bottomless bins of restaurants. It was musical sport. Isolde perfected her timing, spacing each treat. Claire eased into a languor of tension and release, her body shivering with an automatic thrill. As the foods touched her mouth, one by one, they flickered immediately into nothingness—gone the instant she felt them, like words on her tongue.  A happy time, this. But love? Every night they were careful to say that magic phrase, far in advance of the midnight chime.  “I want to see you again.”  “I want to see you, too.”  And so the nights went by, and the dates, and the parties, spiced with anticipation.  Soon, Claire knew, it was bound to happen.  The end came in Eastern Europe.  “We could have been compatible, don’t you think?”  They were reposing, at that moment, in a grand hotel with mountain views, somewhere west of the Caucasus, naked in bed while snow flicked the window. Isolde lifted a rum ball from a chased steel tray, manipulating it with silver tongs. She touched it to the candle, collected a curl of flame, brought the morsel, still burning, to her mouth, and snuffed it out of existence, fire and all, against her tongue.  Claire clasped her hands around a pillow. “Do you think so?”  Isolde seemed nervous tonight, opening and closing the tongs, pretending to measure, as with calipers, Claire’s thigh, her knee.  “Don’t get me wrong. I’m not saying we are compatible. I’m only talking about, you know. What might have been.”  Beyond the window, white flakes swarmed in the sky, a portrait of aimless, random motion.  “We’re attracted to each other,” Isolde said. “We have fun. We always have fun.”  “That’s true. We always have fun.”  “Isn’t that what matters?”  “Nothing matters,” Claire said. “Not for us. Isn’t that the common consensus?” She made sure to smile as she said it, lying back with her hands behind her head.  Isolde seemed pained. “I’m only saying. If things had been different. We might have worked. We might have . . . ” She blushed before speaking the forbidden phrase. “We might have made a match.”  Claire felt her smile congealing on her face. She marveled at that—watched, in the oak-framed mirror atop the dresser, as her expression became an expression of disgust. “But things aren’t different. Wouldn’t you say that’s an important fact? Things are exactly, eternally what they are.”  “Eternally. You can’t know that.”  “I can believe it.” Claire sat up, looking out the window, where snowfall and evening had blanked out the sky. “If you want to know what might have been, just wait for the midnight chime. You’ll get a thousand might-have-beens. A thousand Romeos and Juliets. A thousand once-upon-a-times.”  Isolde was shaking, a subtle, repressed tremor that Claire only noticed by looking at the tongs in her hand.  “I know, I know. I’m only saying . . . I mean, how can you resist? How can you stop thinking about it? About us. About . . . ” Her voice dropped. “About love.”  Claire turned from the window, saying nothing, but the mood of the view filled her eyes, the gray mountains falling away into whiteness, the cold precipitation of a million aimless specks.  “I just like to imagine,” Isolde whispered. “That’s all. I like to imagine it could be different.”  A clock stood on the bedside table, scuffed wood and spotted brass, a heavy relic of interwar craftsmanship. Isolde snatched it up with a gasp.  “What’s the matter?” Claire said.  “I just realized.”  “What? What did you just realize?” In Claire’s tone was an implied criticism. What can there possibly be, she wanted to ask, for us to realize? What can we discover that we don’t already know?  Isolde touched the clock face. “We’re in a time-shifted universe. The midnight chime comes earlier, here. At sunset.”  They looked together at the window, where the sky had darkened to charcoal gray.  “We never said it,” Isolde whispered. “We forgot to say it, this time.” She lay beside Claire, a hand on her belly, saying in a shaking voice, “I want to see you again.”  The clock ticked. Snow tapped the window.  “I want to see you again,” Isolde repeated. “Claire? I want to see you again.”  The clock hands had made a line, pointing in opposite directions. How precise, Claire wondered, would the timeshift be? Sometimes these things could be surprisingly inexact. Sometimes, even the designers made mistakes.  “Claire, please say it. I’m sorry I said all those things. We’re not really a match. I was only speculating. Anyway, it doesn’t matter. Does anything matter? We don’t have to talk. We can go back to how it was. We can hang out, play games, have fun.”  In only a moment, a new evening would begin: new faces, new men and women, new possibilities. A whole new universe of beautiful people, like angels falling out of the sky.  “Claire, please say it. I want to see you again.”  “Maybe you will,” Claire said.  And at that moment, the chime sounded, tinkling and omnipresent, shivering three times across the mountain sky. And Isolde and her voice and her tears disappeared.  3  A dry period, then.  Dry? No, that word couldn’t begin to describe this life. It was desert, desolate, arid, barren, with a harsh wind that cut across the eyes, with sharp-edged stones that stung the feet.  Claire became one of those people. She was the woman who haunts the edges of dance floors, rebuffing with silence anyone who dares to approach. At house parties, she wandered out for impromptu walks, seeking the hyperbolic darkness between streetlights, the lonely shadows below leylandii. At dinner parties, she made jokes intended to kill conversation.  “Knock, knock,” Claire said, when young men leaned toward her.  “Who’s there?”  “Claire.”  “Claire who?”  “Exactly.”  “Here’s a good one,” Claire said, to a woman who approached one night on a balcony, the champagne sparkles of a European city bubbling under their feet. “A woman walks into a bar full of beautiful people.”  When the silence became uncomfortable, the woman prompted: “And?”  “And,” said Claire turning away, “who cares?”  She was bitter. But she didn’t care about her bitterness. Like all things, Claire assumed, this too would pass.  On an Amazonian cruise, Claire hit her low point. It was, most surely, a romantic night. Big insects sizzled against the lamps that swung, dusky gold, from the cabin house. The river gathered white ruffles along the hull. A banquet was laid out on deck, river fish on clay platters borne by shirtless deckhands. The dinner guests lounged in a crowd of cane chairs. When Claire came up from below, she found the party talking, as always, about the food.  “I’ve been here a hundred times.” The woman who spoke was white, brunette, beautiful. “I think I’m something of an expert on this universe. And what I always admire is the attention to local cuisine. Everything comes straight from the river. It’s so authentic.”  Claire, who’d entered unnoticed, startled them all with a loud, braying laugh.  “Excuse me?” said the woman. “What do you find so funny?”  The group stared, pushing back their chairs, eyes kindled with reflected lantern light.  “This,” Claire said, and snatched a clay platter out of the hands of the servingman. “I find this funny.” She dumped the fish on the floor, jammed the platter into her mouth. They all winced as her teeth clamped down, grinding on textured ceramic. “Mm, so authentic.”  “What in the world,” said the woman, “is the matter with you?”  “Nothing. I’m simply trying to eat this platter.”  “But why?”  “Because why shouldn’t I?” Claire smashed the platter on the deck. “Why shouldn’t I be able to? What difference does it make? Why shouldn’t anything—any of this—be food?” She stomped around the deck, offering to take bites of the rails, the lamps, the life preservers. “Why shouldn’t I be able to perform the trick with anything I want? Why shouldn’t I be able to pick you up, and send you into the ether with just a touch of my tongue?”  She grabbed at the arm of a nearby man, who pushed his chair back, winking. “Please do.”  Claire threw his hand down in disgust. “I should be able to pick up anything I see, and touch it to my lips, and make it disappear. And why can’t I? It works with fish. It works with fruit. It works with soup and fried shrimp and wedding cakes.”  Expecting protest, mockery, a violent reaction, she faced with dismay the rows of indifferent, idle faces.  “God, I’m so sick of this life,” Claire finished weakly. “I’m sick of always talking about things I can never have.”  “But are you sick of me?”  Claire turned and Byron was standing behind her, leaning on the rail beside the deckhouse, a beer bottle dangling from his hand.  “You?” Claire was stunned. She could hardly believe she recognized him, but she did.  Byron strolled forward and touched her hand. “You never said it.”  “Sorry?”  “Eight hundred and ninety-two nights ago. New Orleans. I said I wanted to see you again. You never answered.”  “I meant to.” Claire struggled for breath, aware of the watching crowd. “I wanted to. I ran out of time.”  He flung his beer bottle overboard. She waited without breathing for it to plunk in the distant water.  “We have time now,” he said.  Dismissing the party with a wave, Byron guided Claire into a lifeboat. With a push of a lever, a creak of pulleys, he lowered them to the water and cut the rope. They drifted loose in darkness, a lantern at their feet. The big boat moved away on a thump of diesel, the strings of lamps and the hundred candles merging into one gold blur. Byron set the oars in the locks, rowing with a grace that seemed derived from real strength: strength of body, of muscle and sinew, strength that belonged to the kinds of people they had both once been.  “Do you know why we can’t eat food?” Byron spoke at his ease, fitting sentences between the creak of the oarlocks. “Do you know why we have no taste, no smell, no digestion? Do you know why we can never eat, and only make food vanish by touching it to our lips?”  His voice sounded elemental, coming out of the darkness: the voice of the river, the jungle, the night.  “Appetite,” Byron said. “We were made without appetite. We were made to want only one thing. True love.”  He let the oars rest. They rocked on the water. The riverboat was gone now, its voices and music lost in buggy stridor.  “I don’t believe that.” Claire let her hand trail in the water, wondering if piranhas and snakes stocked the river, if the authenticity of the environment extended that far. “I don’t believe any of this was planned. Not to that extent. I think it’s all nothing more than a sick, elaborate accident.”  He considered her words, the oars resting, crossed, in his lap. “You must believe that some of this was designed. You must remember designing it. Or designing yourself, I mean: what you look like, how you think. I’ve forgotten quite a bit, but I do remember that.”  A fish nibbled Claire’s finger. She lifted her hand, shook off the drops.  “I don’t mean the world itself,” Claire said. “I mean about what’s happened to us. The way we live. Something’s gone wrong. I don’t think it was intentional.”  Byron nodded. “Apocalypse.”  “Plague. Asteroids. Nuclear holocaust.”  “Economic collapse. Political unrest.” He joined in her joking tone. “Or only a poorly managed bankruptcy. And somewhere out in the Nevada desert, sealed away in a solar-powered server farm, a rack of computers sits, grinding away at a futile simulation, on and on through the lonely centuries.”  She waved away his glib improvisation, accidentally spraying his face with drops.  “I don’t think that’s what happened. Do you know what I think? I think we’ve simply been forgotten.”  He smiled, nodding in time with the rocking boat.  “That’s all,” Claire said. “They made us, they used us for a while, they lost interest. They kept their accounts, or their subscriptions, or whatever, but they stopped paying attention. They don’t care if we find love. They don’t care about anything we do.”  “And yet.” Byron resumed rowing. “If they knew . . . ”  “What?” Claire was irritated at the portentous way he trailed off. “If they knew what?”  He glanced behind him, checking their direction. “Oh, you know. If they knew how wonderfully independent we’ve become. How clever and shy. How suave in the art of romance. How proficient at avoiding any kind of commitment.”  “In other words,” said Claire, “just like them.”  Byron rested a moment, the oars under his chin. “Meet with me again. Say the words.”  Claire looked away from him, down into the water, the black oblivion sliding by. “This can’t go anywhere. You know it can’t. It can’t become anything. We can’t become anything.”  “I don’t care. Say the words.”  “It can never be more than a casual thing.”  “All well and good. Say the words.”  “It can only make us unhappy. We can only go so far. We’ll reach a certain point, and we’ll realize we’re done. Finished. Forever incomplete. It will be like picking up a delicious piece of food and seeing it vanish on our tongues.”  “Brilliant analogy. Say the words.”  “I want to see you,” Claire said, tears in her eyes. “I want to see you, again and again.”  (And wondering, even while she said this, and not for the first time, why the people who built this terrible world had left so much out, had omitted taste, had excised smell, had eliminated pleasure, drunkenness, pain, death, injury, age, and appetite, but had left in these two strange and unpleasant details, had endowed every person with sweat and tears.)  We’re not like them, Claire thought, as Byron, letting the oars ride idle, leaned across the boat. We look like them, we have their habits, their interests, their hopes, even some of their memories. We think and feel like them, whether they know it or not. We can even, in some ways, make love like them. But we’re not like them, not really, and it all comes down to this: whatever we desire, whatever we do, we’ll never know the difference between a drink and a kiss.  When Byron’s lips met hers, a precise and dry contact, it surprised Claire, momentarily, that neither of them disappeared.  4  How many times did they meet? Claire didn’t bother to count. They saw each other in hunting lodges, English gardens, an undersea city, the surface of Mars, the gondola of a transatlantic blimp. To Claire, all locations were frames for Byron’s figure. More than his body, more than the frankness of his smile, she began to love the touch of his hand, the way it overlaid hers on the rails of ocean liners, felt for hers, casually, in the press of theater lobbies. He was a man who coveted contact: half-conscious, constant. She loved his need to know she was there.  And still, he was something much stranger than a lover. In this world, there was one sure pleasure, and this was the pleasure Byron offered. Talk.  “What was it?” she asked him, one night as they mingled, duded out in rodeo getups, with the square-dancing clientele of a cowboy bar. “In New Orleans, that night, you sought me out. What was it that made you notice me?”  Byron didn’t hesitate. “A question,” he said.  “And what question was that?”  He pointed at their knee-slapping environs: the mechanical bull, the rawhide trimmings, the Stetsons and string ties and silver piping. “Our lives are a joke. Anyone can see that, I guess I wondered why you weren’t laughing.”  She laughed then, making herself sad with the sound.  Other evenings they shouted over a buzz of airplane propellers, under the bump of disco, across the chill seats of a climbing chairlift. But always they talked, endlessly, oblivious to their surroundings, one conversation encompassing a thousand fragmented days.  “And you?” Byron spoke between sips of drinks that vanished like snow under his breath. “What did you see in me?”  Claire smiled, silent. She knew he knew the answer.  In the private bedrooms of an endlessly itinerant courtship, they never stripped off their clothes, never attempted the clumsy gyrations that passed for sex. They lounged in lazy proximity, fully clothed. Claire felt no reserve. With Byron, there was no question of making a match. His worn, mature face, sadly humorous, told her he’d put all such questions behind him.  “Anyway, it doesn’t matter.” He often held her hand, rubbing her thumb with his. “You say we’ve been forgotten. Some people say we’ve been abandoned. But what would it change, if we knew the truth? Things would be the same whatever happened in—well, in what I suppose we have to call ‘the real world.’”  “Would they?” Claire focused on the confidence with which he spoke, the weary conviction of his old, wise voice.  Byron narrowed his eyes. “That’s what I believe. We were made to live this way. We were never meant to find a match.” He lifted himself on an elbow, gazing across the folds and drapes of the bedroom, the swaddling silk abundance of an ancient four-poster bed. “Look, the idea is we’re proxies, right? Our originals, they got tired of looking for love. The uncertainty, the effort. So they made us. Poured in their memories and hopes, built this playground, so we could do what they didn’t want to do, keep mixing and mingling and trying and failing. And one day we would find a match, and that would be it, our work would be done, and we would be canceled, deleted, for them to take over.”  Claire lay still, withholding comment. There was a real thrill, she thought, in hearing things put so plainly, the cynical logic of their lives.  “But what if,” Byron said, “that wasn’t ever their real goal? What if they never wanted love at all? What if they only wanted to want it—wanted, in some way, to be able to want it? You remember how things were. We all remember at least some of that world. Was it ever such a loving place? The overcrowding. The overwork. It was so much better to be alone. What if this place only exists . . . what if we only exist to . . . to stand in for something, represent something, some kind of half-remembered dream? A dream our originals had mostly given up, but still felt, in some way, they ought to be dreaming?”  “Oh, God,” Claire sighed.  “I’m sorry.” Byron touched the backs of the hands she held over her face. “I shouldn’t be talking like this.”  “It’s not that.” She dropped her hands. “It’s that it’s all so wrong. You make it sound even more hopeless than it is.”  “I don’t believe it’s hopeless.”  “But if we’re only here to go on some futile, empty search . . . I mean, why?” She sat up, holding fistfuls of sheet. “We’re a joke twice over. A fake of a fake. Even if they didn’t know we would. . . . ” She was garbling her remonstrations, caught, as usual, between religion and philosophy. “I mean, why would anyone put us through this?”  He lay back, staring, pale as an empty screen. “Claire, what if I told you we could make a match?”  She held a pillow to her breast, suddenly cold, wondering if it was the kind of cold a real human being would feel. “Don’t say that.”  “I mean it.”  “Don’t say it. You know what will happen. I hate this world. I hate the people who made it. I hate myself, whatever I am, and I hate the woman I used to be. But I’m not ready to—”  “I’m not saying you have to.”  She watched him with bared teeth, projecting all her fear onto his alarmingly calm face.  “I’m saying we can do it.” Byron’s eyes were like red wine, dark and flickering. “We can do it without giving anything up. We can commit to each other, forever, without being deleted or vanishing. We can declare our love, and no one will ever know, or interfere, or steal it away from us.”  “That’s impossible.” She bit her tongue until she could almost remember what it felt like to feel pain.  “It’s entirely possible.”  “That’s not how things work.”  “You forget. I told you once, long ago, I have an interest in virtual environments. Or anyway, I used to. I know exactly how this world works.”  She sat up, seeing excitement shining from him via those two bright giveaways, perspiration and tears.  “Do you remember, Claire? New Orleans?” He sat up, reaching for her hands. “There’s a dock, there, that runs far out into the river. A ferry sets out from it, every night, toward the far shore. Each night, it leaves a second earlier; each time, it travels a second farther. One time out of a thousand, it reaches the far bank. If we’re on that ferry when it touches land, we’ll be on a border, a threshold, a place where the rules no longer apply. When the scenario resets, we’ll be left behind. We can live there forever, or however long the world lasts.  “Claire.” He insisted, at that moment, on holding both her hands, as if needing to be doubly sure she was there. “Nothing is entirely random. I know you don’t keep count of the nights, but I do. I’ve been tracking the evenings, observing the patterns. And I’ve been looking for a person to take along with me, one person to share with me the rest of time. You are that person. Say the words. In five nights, we will meet again, at a dinner party in New Orleans. The ferry will set out at eleven-forty. Come with me, Claire. Be with me on that deck. Step with me, together, out of this world.”  She saw her fists vanish inside his. The midnight chime would sound in a moment, and with it new crowds, new possibilities, new glories of music and excitement would be conjured out of the unending night. Could she leave all that behind, stand with this man forever on the shore of one permanent land? Together, they would walk, never changing, down unchanging streets, where dance music streamed out of immortal cafés, where orchids stood, never wilting, on the sills of bedroom windows, silvered by a moon that never set. But these would be their cafés, their moon, their orchids, and if there was no way to know how long it might last, still, they would own together that unmeasured quantity of time, laying claim to one house with its scattershot furniture, and never live in fear of the midnight chime.  Already, tonight, that chime was sounding, jangling a warning across the sky. But Claire had time to speak the charmed words.  “I want to see you again.”  5  Around the long dining table in the house in New Orleans, Civil War colonels gazed out of their walnut frames. The candles were at work, scattering reflections, and the antique chairs creaked with conviviality. Claire sat next to Byron, intent on the French-style clock. Dinner was done, the plates cleared away, and two dozen puddings quivered in two dozen china bowls.  “Pudding,” sighed a ravishing girl, dressed, like many, for the setting, in the rustling skirts of a southern belle. “You see what I mean? It’s all so random. Radicchio salads, oxtail for dinner, and they serve us chocolate pudding for dessert.”  Claire, seated across the table, reflected that this was the last time she’d ever have to have this conversation.  Twenty-four spoons dipped and rose. Twenty-four servings of pudding vanished, dispelled by the touch of twenty-four tongues.  When the party dispersed, Byron took Claire’s hand. At the door, he bent to her ear, and she felt his warm whisper. “Three hours. Stay close.”  They stepped out onto the porch. And Byron disappeared.  Claire spun in confusion. The porch, the house, the whole scene was gone. She stood on a dance floor, surrounded by feet that stamped and swung and kicked up a lamplit dust. The dim air shivered to the scratch of a fiddle. There was absolutely no sign of Byron.  Trying to get her bearings, Claire clutched at the jostling shoulders. She spotted a door and wriggled toward it. The energy of the dance, like a bustling machine, ejected her into humid air.  Claire stumbled down three wooden steps. Looking back, she recognized the roadside bar where she’d sat with Byron on their first meeting, several thousand nights ago.  What had happened? Claire staggered toward the road. The moon made iron of the land, steel of the river, and the lights of town were far away.  The ferry! It was only a few miles from here, no more than a two-hour walk. Claire thought she could make it, if she hurried.  She’d walked a quarter of an hour when a vintage roadster, roaring from behind, froze her like a criminal in a flood of light. Byron pushed open the door.  “Get in.”  Claire hurried to the passenger side, jumped into the leather seat. Byron stomped the gas, and the wheels of the car barked on gravel.  “It’s glitching.” Byron leaned forward as he drove. “The environment. The counters are resetting. Like I said, we’re in a liminal place, tonight. The rules are temporarily breaking down. Look.”  He tapped his wrist, where a watch glimmered faintly.  “It’s after ten,” Byron said. “It’s been over an hour since I saw you. We’ve lost a chunk of time, and I’m afraid—damn.” He swerved, almost losing control, as he caught sight of something down the road.  Twisting in her seat, Claire saw the roadside shack, the one she’d just exited, sliding by.  Byron cursed and pushed down on the gas. They rattled up to the old roadster’s maximum speed, forty, fifty. Swamps, river, and road flowed by. The shack passed again, again, again.  “All right, that does it.” Byron braked so hard, Claire nearly whacked her head on the dashboard. He fussed with the gearshift and twisted in his seat, wrapping an arm around her headrest.  “What’s happening?” she asked.  “Can’t you tell? We’re looping.”  “But what are you doing?”  “Desperate problems call for desperate measures.” Byron squinted through the tiny rear windshield. “The way I see it, if you can’t hit fast-forward, hit rewind.”  The car jerked backward.  And car and road and Byron all screeched out of being, and Claire found herself sitting at a café table, alone, deep in the tipsy commotion of town.  She jumped up, knocking over her chair.  Once again, Byron was nowhere to be seen.  Claire cursed, turned in a full circle, cursed again. A passing man in a bowler hat picked up her chair, righted it, and touched his hat.  “Crazy, eh? All these jumps?” He straightened his jacket with a roll of his shoulders, looking up at the sky, as if expecting heaven to crack.  “But what do we do?” Claire gasped. “How do we stop it?”  The man in the bowler hat smiled and shrugged. “Nothing to do, I guess. Except play along.”  Pantomiming, he grabbed a nearby barber pole, swung himself through an open door, and promptly, like a magician’s rabbit, blinked out of existence.  Partiers ran past, giggling and tripping, stretching their faces in merry alarm, like people caught in a thunderstorm. Firefly-like, they meandered through doorways, laughing as they winked in and out of existence. In a world of rules and repetition, Claire had long since observed, childlike chaos greeted any variation in routine.  But what do I do? Claire ducked into a drugstore entrance. What can I do, what should I do? She did her best to steady her mind, analyze the situation. The jumps, the cuts, the vanishings and reappearances—they seemed to happen at moments of transition: entries and exits, sudden moves. If she found some way to game the system . . .  Turning, Claire jumped through the drugstore door. And again, and again, and again, jump after jump. On her fifteenth jump, the trick worked, the environment glitched. Claire tumbled into a banquet hall, crashing into a tray-bearing waiter, scattering scallops and champagne flutes. “Sorry, sorry . . . ” Dashing toward the hall doors, Claire tried again. Another round of jumping propelled her into a rowboat, somewhere out in the stinking bayou. Gators splashed and rolled in the muck, grunting and hissing as they fled from her intrusion. Claire jumped into the water and ducked under, sinking her feet in the creamy ooze. She kicked, launching herself up into the air—  And found herself, sodden with mud, near the bank of the river, back in town.  How many times would she have to do this? Searching the bank, Claire saw no promising doors. She threw herself into the river three more times. The third time, she emerged in a backyard swimming pool.  And so, through portals and windows, through falls and reversals, Claire skipped her way through the liminal evening, traversing a lottery of locations, careening in her soaked dress and dirty hair through car seats, lawn parties, gardens and gazebos, bedrooms where couples lay twined in dim beds. Sometimes she thought she saw Byron, hurrying through a downtown doorway or diving over the rail of a riverboat, moving in his own Lewis Carroll quest through the evening’s hidden rabbit holes. Mostly, she saw hundreds of other adventurers, laughing people who leaped and jostled through doorways, running irreverent races in the night.  At last, Claire stumbled out of a bait shop onto the dock, the ramshackle fishing shacks hung with buoys, the long span of planks laid out like a ruler to measure the expanse of her few remaining minutes—and there was the ferry, resting on the churn of its diesel engine, bearing Byron toward the far shore.  “Claire,” he shouted over the water, and added something she couldn’t hear.  Was it a freak of the fracturing environment, some cruel new distortion, that made the dock seem to lengthen as Claire ran? Was it a new break in that hopelessly broken world that made the planks passing under her feet seem infinite? By the time she came to the end of the dock, Byron and the ferry were in the middle of the river, and his call carried faintly down the boat’s fading wake.  “Jump!”  Was he crazy? The distance was far too wide to swim.  “Claire, I’m serious, jump!”  And now, Claire understood: if it had worked before . . . a thousand-in-one chance, perhaps . . .  Far across the river, Byron was waving. Claire looked into the water. Briefly, she hesitated. And this was the moment she would think back to, a thousand times and a thousand again: this instant when she paused and held back, wondering how badly she wanted to spend eternity in one home, one world, with one man.  The next instant, she had flung herself headfirst into the water. And perhaps this world made more sense than Claire thought. Perhaps the designers had known what they were doing after all. Because of all the cracks and rabbit holes in the environment, of all the possible locations in which she might emerge—  She was splashing, floundering, on the far side of the river, and the ferry was a few yards away.  Claire thrashed at the water, clawing her way forward, as the first of three chimes sounded over the water.  She’d forgotten to kick off her shoes. Her skirt wrapped her legs. She couldn’t fall short, not after trying so hard, chasing potential romances down the bottomless vortex of an artificial night.  The second chime made silver shivers pass across the water.  So close. Claire tore at the waves, glimpsing, between the splashing of her arms, Byron calling from the ferry, leaning over the rail.  As she gave a last, desperate swipe, the third chime rang in the coming of midnight, the sound reminding Claire, as it always would, of the teasing jingle of a set of keys.  Around bright tables, under lamps and music, the partygoers had gathered, to mingle and murmur and comment on the food. So much beauty to be savored, so much variety: so many men and women with whom to flirt and quip and dance away the hours of an endlessly eventful evening. And after tonight, there would be more, and still more—men and women to be savored, sipped, dispelled.  If anyone noticed the woman who moved among them, searching the corners of crowded rooms; if anyone met her at the end of her dock, looking across the starlit water; if anyone heard her calling one name across the waves and throbbing music, they soon moved away. The party was just beginning, lively with romance, and the nights ahead were crowded with the smiles of unknown lovers.    Originally published in Asimov’s Science Fiction, August 2015.", "text": "7590 words, novelette, REPRINT\nNo Placeholder for You My Love\n1\nClaire met him at a dinner party in New Orleans, and afterward, she had to remind herself this was true. Yes, that had been it, his very first appearance. It seemed incredible there had been anything so finite as a first time.\nHe was seated across from her, two chairs down, a gorgeous woman on either side. As usual, the subject had turned to food.\n“But I’ve been to this house a dozen times,” one of the gorgeous women was saying. “I’ve been to dinner parties, dance parties, even family parties. And every time, they serve the wrong kind of cuisine.”\nShe had red hair, the color of the candlelight reflected off the varnished chairs. The house was an old house, full of old things, handmade textiles and walnut chiffoniers, oil paintings of nameless Civil War colonels.\n“Is that a problem?” said the young man on Claire’s left. “Why should you care?”\n“Because,” said the redhead, pursing her lips. “Meringue pie, at an elegant soiree? Wine and steak tartar, at a child’s birthday party? Lobster bisque at a dance? For God’s sake, it was all over the floor. It seems, I don’t know. Lazy. Thoughtless. Cobbled together.”\nShe lifted her glass of wine to her mouth, and the liquid vanished the instant it touched her tongue.\nThe man who was to mean so much to Claire, to embody in his person so much hope and loss, leaned over his soup, eyes dark with amusement. “It is cobbled together. Of course it is. But isn’t that the best part?”\n“And why is that, Byron?” someone said with a sigh.\nByron. A fake name, Claire assumed, distilled from the fog of some half-remembered youthful interest. But then, you never knew.\nWhatever the source of his name, Byron’s face had the handsome roughness earned through active living. Dots of stubble grayed his skin. A tiny scar divided one eyebrow. His smile made a charming pattern of wrinkles around his eyes. It was a candid face, a well-architected face, a forty-something face.\n“Because,” said Byron, and caught Claire’s eye, as if only she would understand. “Look at this furniture, the chandelier. Look at that music stand in the corner. American plantation style, rococo, Art Nouveau. Every piece a different movement. Some are complete anachronisms. That’s why I love this house. You can see the spirit of the designers, here. A kind of whimsy. It’s so personal, so scattershot.”\n“You’re such a talker, Byron,” someone sighed.\n“Look at all of you,” Byron said, moving his spoon in a circle to encompass the ring of faces. “Some of you I’ve never seen before in my life. And here we are, brought together by chance, for one evening only. You know what? That delights me. That thrills me.” His gesture halted at Claire’s face. “That enchants me.”\n“And after tonight,” said the redhead, “we’ll go our separate ways, and forget each other, and maybe never see each other again. So is that part of the wonder, for you, Byron, or does that spoil the wonder?”\n“It does neither,” Byron said, “because I don’t believe it.”\nHis eyes settled on Claire’s. Again, he smiled. She had always liked older men, their slightly chastened air, their solemn and good-humored strength.\n“I don’t believe we’ll never see each other again,” Byron said, looking at his spoon. “I don’t believe that’s necessarily our fate. And you know what? The truth is, I wouldn’t mind living in this house forever. Even if they do serve alphabet soup at a dinner party.”\nHe lifted his hand to his mouth and touched his spoon to his lips. And instantly, the liquid disappeared.\nWhen they had cleared the table, the entertainments began. There were board games in the living room, a live band on the lawn. Stairs led to a dozen shadowy bedrooms, with sad old beds, and rich old carpets, and orchids in baskets on the moonlit windowsills. In town, the music of riverbank revelry scraped and jittered out of ramshackle bars, and paddleboats rode on the slow Mississippi, jingling with the racket of riches won and lost.\nByron borrowed a set of car keys from the houseboy. Claire followed him onto the porch. The breath of the bayou was in the air, warm and buoyant, holding up the clustered leaves of the pecan trees and the high, star-scattered sky. Sweat held her shirt to the small of her back, as if a hand were there, pressing her forward.\n“Shall we take a ride?” The car keys dangled, tinkling, from Byron’s upraised hand.\n“Wait,” said Claire, “do that again.”\n“This?” He gave the keys another shake. The sound tinkled out, a sprinkling of noise, over the thick green nap of the lawn.\n“It sounds just like it,” Claire said. “Don’t you hear it? It sounds just like the midnight chime.”\n“Oh, God, don’t talk about that now. It’s not for hours.” Byron went halfway down the porch steps, held out a hand. “We still have plenty of time to fall in love.”\nThe car waiting for them was an early roadster, dazzling with chrome, large and slow. Byron handled the old-fashioned shift with expert nonchalance. They slid past banquet halls downtown, where drunkenness and merriment and red, frantic faces sang and sweated along the laden tables. Often, they pulled to the curb and idled, and the night with its load of romance rolled by.\nAt a corner café where zydeco livened the air, a young couple argued at a scrollwork table.\n“But how can you define it? How can you even describe it?” The woman’s arm swung as she spoke, agitating the streetlights with a quiver of silver bracelets.\n“Well, it’s easy enough to define, anyway.” The man made professorial motions with his hands. “It was simply a matter of chemistry.”\n“But how would that be any different from, say, smell?”\n“Oh, it wasn’t, not really. Taste and smell. Love and desire. All variations on the same experience.”\nThe couple lifted fried shrimp from a basket as they spoke, the small golden morsels vanishing like fireflies on their lips.\n“It can’t be so simple,” the woman said. And the man leaned over the table, reaching for her face, and turned it toward his lips. “You’re right. It’s not.”\n“I used to have those kinds of conversations,” Byron sighed. He grasped the old maple knob of the shift, and pulled away from the curb.\nThey drove out of town onto rural dirt roads, where moonlight splashed across the land. In a plank roadhouse, a dance party was underway, a fiddle keening over stamping feet. Parked in the dirt lot, soaked in yellow light, they conducted the usual conversation.\n“Now, me?” Byron said. “Let me tell you about myself. I’m a middle-aged computer programmer who enjoys snuggling, whiskey, and the study of artificial environments. I have a deathly aversion to crowds, and I’m not afraid to admit it. I’m nowhere near as handsome as this in real life, and I can assure you, I’ve been at this game a very long time.”\nHis face dimpled as he delivered his spiel, not quite smiling. Claire laughed at his directness. Byron thumped a short drumroll on the wheel.\n“And you?”\n“Oh, me?” Claire said. “Me? I’m no one.”\n“That’s an interesting theory.”\n“What I mean is, I’m no one anyone should care about. I don’t even care about me.”\n“That can’t be true.”\n“I guess not. I guess what I mean is, I don’t care who I used to be.” Claire watched the figures dance in the building, the plank walls trembling as shadows moved like living drawings across the dirty windows. “I care what happens to me now, though. I care about nights like this.”\nHer lazy hand took in the dancers, the stars. Byron sat back, nodding.\nClaire surrendered. “I don’t know. There’s an interesting woman back there, somewhere. A scholar, a geneticist. But it’s hard to believe, nowadays, that she ever existed.”\n“Tell me about this geneticist,” he said.\n“Well.” Claire afforded him a smile. “What do you want to know? She looked like me. She talked like me. She loved all the things I love. She loved rainy windows and Scrabble and strong tea. She loved her body, because she had a nice one, and she loved to take long baths with organic soap, and she loved the idea that one day, far in her future, there might be someone to share those baths with her. Mostly, I think, she loved the idea that she could find a man who didn’t care about any of those things. A man who would simply take her hand and say, ‘Let’s go.’”\nThe fiddle stopped. The dancers halted. The shadows on the windows settled into perfect sketches: honey-colored men and women with open, panting lips.\n“She was young,” Claire said. “And she was lonely.”\nByron nodded. “I understand.”\nSomeone threw open the roadhouse door. A carpet of gold rolled down the steps, all the way up the hood into the car, covering Claire in mellow light. Byron studied her. She knew what he was seeing. A beautiful blonde, a perfect face, a statue of a body with cartoon-sized eyes.\n“But you’re not,” he said. And after a moment, he clarified: “Young. Not anymore. Are you?”\n“No,” said Claire. “Not anymore.”\nThey drove to town along a different route, on dark, swampy roads where alligators slithered, grunting, from the wheels. On a wharf lined with couples and fishing shops, they stood at the wood rail, looking over the water, waiting together for the midnight chime. A gas-powered ferry struggled from shore, heading northeast toward a sprawl of dark land.\n“I don’t care,” Byron said. “I don’t care if you were a biologist. I don’t care if you love Scrabble or tea. I don’t care about any of that.” He held out a hand. “Let’s go.”\nThe couples on the wharf had fallen silent, waiting. The very twinkling of the stars seemed to pause. Still, the ferry strained and chugged, heading for a shore it would never reach.\n“Say it,” Claire said. “You say it first, then I’ll say it, too.”\n“I want to see you again,” Byron said.\nShe took his hand. Before she could respond, the midnight chime sounded. It came three times, eerie and clear, like a jingle of celestial keys. And Byron and the river and the world all disappeared.\n2\nClaire didn’t see him again for a thousand nights.\nIt felt like a thousand, anyway. It may have been more. Claire had stopped counting long, long ago.\nThere were always more nights, more parties, more diversions. And, miraculous as it seemed, more people. Where did they come from? How could there be so many pretty young men, with leonine confidence and smiling lips? How could there be so many women arising out of the million chance assortments of the clubs, swimming through parties as if it could still be a thrill to have a thousand eyes fish for them—as if, like the fish in the proverbial sea, they one day hoped to be hooked?\nClaire considered them, contemplated them, and let them go their way. She dated, for a time, a very old, handsome man whose name, in some remote and esoteric way, commanded powerful sources of credit. His wealth opened up new possibilities: private beaches where no one save they two had ever stepped, mountain lodges where the seasons manifested with iconic perfection, pink and green and gold and white. But they weren’t, as the language ran, “compatible”; they were old and tired in different ways.\nShe met a girl whose face flashed with the markings of youth: sharp earrings, studs, lipstick that blazed in toxic colors. But the girl’s eyes moved slowly, with the irony of age. Theirs was a sexual connection. Night after night, they bowed out of cocktail hours, feeling for each other’s hands across the crush of dances. Every exit was an escape. They sought the nearest private rooms they could find: the neon-bright retreats of city hotels, secret brick basements in converted factories. The thrill was one of shared expertise. Both women knew the limits of sex: what moves were possible, what borders impermeable. They cultivated the matched rhythm, the long caress. Sometimes Claire’s new lover—whose name, she learned after three anonymous encounters, was Isolde—fed delicacies to her, improbable foods, ice carvings and whole cakes, a hundred olives impaled on swizzle sticks, fruit rinds in paintbox colors, orange and lime, stolen from the bottomless bins of restaurants. It was musical sport. Isolde perfected her timing, spacing each treat. Claire eased into a languor of tension and release, her body shivering with an automatic thrill. As the foods touched her mouth, one by one, they flickered immediately into nothingness—gone the instant she felt them, like words on her tongue.\nA happy time, this. But love? Every night they were careful to say that magic phrase, far in advance of the midnight chime.\n“I want to see you again.”\n“I want to see you, too.”\nAnd so the nights went by, and the dates, and the parties, spiced with anticipation.\nSoon, Claire knew, it was bound to happen.\nThe end came in Eastern Europe.\n“We could have been compatible, don’t you think?”\nThey were reposing, at that moment, in a grand hotel with mountain views, somewhere west of the Caucasus, naked in bed while snow flicked the window. Isolde lifted a rum ball from a chased steel tray, manipulating it with silver tongs. She touched it to the candle, collected a curl of flame, brought the morsel, still burning, to her mouth, and snuffed it out of existence, fire and all, against her tongue.\nClaire clasped her hands around a pillow. “Do you think so?”\nIsolde seemed nervous tonight, opening and closing the tongs, pretending to measure, as with calipers, Claire’s thigh, her knee.\n“Don’t get me wrong. I’m not saying we are compatible. I’m only talking about, you know. What might have been.”\nBeyond the window, white flakes swarmed in the sky, a portrait of aimless, random motion.\n“We’re attracted to each other,” Isolde said. “We have fun. We always have fun.”\n“That’s true. We always have fun.”\n“Isn’t that what matters?”\n“Nothing matters,” Claire said. “Not for us. Isn’t that the common consensus?” She made sure to smile as she said it, lying back with her hands behind her head.\nIsolde seemed pained. “I’m only saying. If things had been different. We might have worked. We might have . . . ” She blushed before speaking the forbidden phrase. “We might have made a match.”\nClaire felt her smile congealing on her face. She marveled at that—watched, in the oak-framed mirror atop the dresser, as her expression became an expression of disgust. “But things aren’t different. Wouldn’t you say that’s an important fact? Things are exactly, eternally what they are.”\n“Eternally. You can’t know that.”\n“I can believe it.” Claire sat up, looking out the window, where snowfall and evening had blanked out the sky. “If you want to know what might have been, just wait for the midnight chime. You’ll get a thousand might-have-beens. A thousand Romeos and Juliets. A thousand once-upon-a-times.”\nIsolde was shaking, a subtle, repressed tremor that Claire only noticed by looking at the tongs in her hand.\n“I know, I know. I’m only saying . . . I mean, how can you resist? How can you stop thinking about it? About us. About . . . ” Her voice dropped. “About love.”\nClaire turned from the window, saying nothing, but the mood of the view filled her eyes, the gray mountains falling away into whiteness, the cold precipitation of a million aimless specks.\n“I just like to imagine,” Isolde whispered. “That’s all. I like to imagine it could be different.”\nA clock stood on the bedside table, scuffed wood and spotted brass, a heavy relic of interwar craftsmanship. Isolde snatched it up with a gasp.\n“What’s the matter?” Claire said.\n“I just realized.”\n“What? What did you just realize?” In Claire’s tone was an implied criticism. What can there possibly be, she wanted to ask, for us to realize? What can we discover that we don’t already know?\nIsolde touched the clock face. “We’re in a time-shifted universe. The midnight chime comes earlier, here. At sunset.”\nThey looked together at the window, where the sky had darkened to charcoal gray.\n“We never said it,” Isolde whispered. “We forgot to say it, this time.” She lay beside Claire, a hand on her belly, saying in a shaking voice, “I want to see you again.”\nThe clock ticked. Snow tapped the window.\n“I want to see you again,” Isolde repeated. “Claire? I want to see you again.”\nThe clock hands had made a line, pointing in opposite directions. How precise, Claire wondered, would the timeshift be? Sometimes these things could be surprisingly inexact. Sometimes, even the designers made mistakes.\n“Claire, please say it. I’m sorry I said all those things. We’re not really a match. I was only speculating. Anyway, it doesn’t matter. Does anything matter? We don’t have to talk. We can go back to how it was. We can hang out, play games, have fun.”\nIn only a moment, a new evening would begin: new faces, new men and women, new possibilities. A whole new universe of beautiful people, like angels falling out of the sky.\n“Claire, please say it. I want to see you again.”\n“Maybe you will,” Claire said.\nAnd at that moment, the chime sounded, tinkling and omnipresent, shivering three times across the mountain sky. And Isolde and her voice and her tears disappeared.\n3\nA dry period, then.\nDry? No, that word couldn’t begin to describe this life. It was desert, desolate, arid, barren, with a harsh wind that cut across the eyes, with sharp-edged stones that stung the feet.\nClaire became one of those people. She was the woman who haunts the edges of dance floors, rebuffing with silence anyone who dares to approach. At house parties, she wandered out for impromptu walks, seeking the hyperbolic darkness between streetlights, the lonely shadows below leylandii. At dinner parties, she made jokes intended to kill conversation.\n“Knock, knock,” Claire said, when young men leaned toward her.\n“Who’s there?”\n“Claire.”\n“Claire who?”\n“Exactly.”\n“Here’s a good one,” Claire said, to a woman who approached one night on a balcony, the champagne sparkles of a European city bubbling under their feet. “A woman walks into a bar full of beautiful people.”\nWhen the silence became uncomfortable, the woman prompted: “And?”\n“And,” said Claire turning away, “who cares?”\nShe was bitter. But she didn’t care about her bitterness. Like all things, Claire assumed, this too would pass.\nOn an Amazonian cruise, Claire hit her low point. It was, most surely, a romantic night. Big insects sizzled against the lamps that swung, dusky gold, from the cabin house. The river gathered white ruffles along the hull. A banquet was laid out on deck, river fish on clay platters borne by shirtless deckhands. The dinner guests lounged in a crowd of cane chairs. When Claire came up from below, she found the party talking, as always, about the food.\n“I’ve been here a hundred times.” The woman who spoke was white, brunette, beautiful. “I think I’m something of an expert on this universe. And what I always admire is the attention to local cuisine. Everything comes straight from the river. It’s so authentic.”\nClaire, who’d entered unnoticed, startled them all with a loud, braying laugh.\n“Excuse me?” said the woman. “What do you find so funny?”\nThe group stared, pushing back their chairs, eyes kindled with reflected lantern light.\n“This,” Claire said, and snatched a clay platter out of the hands of the servingman. “I find this funny.” She dumped the fish on the floor, jammed the platter into her mouth. They all winced as her teeth clamped down, grinding on textured ceramic. “Mm, so authentic.”\n“What in the world,” said the woman, “is the matter with you?”\n“Nothing. I’m simply trying to eat this platter.”\n“But why?”\n“Because why shouldn’t I?” Claire smashed the platter on the deck. “Why shouldn’t I be able to? What difference does it make? Why shouldn’t anything—any of this—be food?” She stomped around the deck, offering to take bites of the rails, the lamps, the life preservers. “Why shouldn’t I be able to perform the trick with anything I want? Why shouldn’t I be able to pick you up, and send you into the ether with just a touch of my tongue?”\nShe grabbed at the arm of a nearby man, who pushed his chair back, winking. “Please do.”\nClaire threw his hand down in disgust. “I should be able to pick up anything I see, and touch it to my lips, and make it disappear. And why can’t I? It works with fish. It works with fruit. It works with soup and fried shrimp and wedding cakes.”\nExpecting protest, mockery, a violent reaction, she faced with dismay the rows of indifferent, idle faces.\n“God, I’m so sick of this life,” Claire finished weakly. “I’m sick of always talking about things I can never have.”\n“But are you sick of me?”\nClaire turned and Byron was standing behind her, leaning on the rail beside the deckhouse, a beer bottle dangling from his hand.\n“You?” Claire was stunned. She could hardly believe she recognized him, but she did.\nByron strolled forward and touched her hand. “You never said it.”\n“Sorry?”\n“Eight hundred and ninety-two nights ago. New Orleans. I said I wanted to see you again. You never answered.”\n“I meant to.” Claire struggled for breath, aware of the watching crowd. “I wanted to. I ran out of time.”\nHe flung his beer bottle overboard. She waited without breathing for it to plunk in the distant water.\n“We have time now,” he said.\nDismissing the party with a wave, Byron guided Claire into a lifeboat. With a push of a lever, a creak of pulleys, he lowered them to the water and cut the rope. They drifted loose in darkness, a lantern at their feet. The big boat moved away on a thump of diesel, the strings of lamps and the hundred candles merging into one gold blur. Byron set the oars in the locks, rowing with a grace that seemed derived from real strength: strength of body, of muscle and sinew, strength that belonged to the kinds of people they had both once been.\n“Do you know why we can’t eat food?” Byron spoke at his ease, fitting sentences between the creak of the oarlocks. “Do you know why we have no taste, no smell, no digestion? Do you know why we can never eat, and only make food vanish by touching it to our lips?”\nHis voice sounded elemental, coming out of the darkness: the voice of the river, the jungle, the night.\n“Appetite,” Byron said. “We were made without appetite. We were made to want only one thing. True love.”\nHe let the oars rest. They rocked on the water. The riverboat was gone now, its voices and music lost in buggy stridor.\n“I don’t believe that.” Claire let her hand trail in the water, wondering if piranhas and snakes stocked the river, if the authenticity of the environment extended that far. “I don’t believe any of this was planned. Not to that extent. I think it’s all nothing more than a sick, elaborate accident.”\nHe considered her words, the oars resting, crossed, in his lap. “You must believe that some of this was designed. You must remember designing it. Or designing yourself, I mean: what you look like, how you think. I’ve forgotten quite a bit, but I do remember that.”\nA fish nibbled Claire’s finger. She lifted her hand, shook off the drops.\n“I don’t mean the world itself,” Claire said. “I mean about what’s happened to us. The way we live. Something’s gone wrong. I don’t think it was intentional.”\nByron nodded. “Apocalypse.”\n“Plague. Asteroids. Nuclear holocaust.”\n“Economic collapse. Political unrest.” He joined in her joking tone. “Or only a poorly managed bankruptcy. And somewhere out in the Nevada desert, sealed away in a solar-powered server farm, a rack of computers sits, grinding away at a futile simulation, on and on through the lonely centuries.”\nShe waved away his glib improvisation, accidentally spraying his face with drops.\n“I don’t think that’s what happened. Do you know what I think? I think we’ve simply been forgotten.”\nHe smiled, nodding in time with the rocking boat.\n“That’s all,” Claire said. “They made us, they used us for a while, they lost interest. They kept their accounts, or their subscriptions, or whatever, but they stopped paying attention. They don’t care if we find love. They don’t care about anything we do.”\n“And yet.” Byron resumed rowing. “If they knew . . . ”\n“What?” Claire was irritated at the portentous way he trailed off. “If they knew what?”\nHe glanced behind him, checking their direction. “Oh, you know. If they knew how wonderfully independent we’ve become. How clever and shy. How suave in the art of romance. How proficient at avoiding any kind of commitment.”\n“In other words,” said Claire, “just like them.”\nByron rested a moment, the oars under his chin. “Meet with me again. Say the words.”\nClaire looked away from him, down into the water, the black oblivion sliding by. “This can’t go anywhere. You know it can’t. It can’t become anything. We can’t become anything.”\n“I don’t care. Say the words.”\n“It can never be more than a casual thing.”\n“All well and good. Say the words.”\n“It can only make us unhappy. We can only go so far. We’ll reach a certain point, and we’ll realize we’re done. Finished. Forever incomplete. It will be like picking up a delicious piece of food and seeing it vanish on our tongues.”\n“Brilliant analogy. Say the words.”\n“I want to see you,” Claire said, tears in her eyes. “I want to see you, again and again.”\n(And wondering, even while she said this, and not for the first time, why the people who built this terrible world had left so much out, had omitted taste, had excised smell, had eliminated pleasure, drunkenness, pain, death, injury, age, and appetite, but had left in these two strange and unpleasant details, had endowed every person with sweat and tears.)\nWe’re not like them, Claire thought, as Byron, letting the oars ride idle, leaned across the boat. We look like them, we have their habits, their interests, their hopes, even some of their memories. We think and feel like them, whether they know it or not. We can even, in some ways, make love like them. But we’re not like them, not really, and it all comes down to this: whatever we desire, whatever we do, we’ll never know the difference between a drink and a kiss.\nWhen Byron’s lips met hers, a precise and dry contact, it surprised Claire, momentarily, that neither of them disappeared.\n4\nHow many times did they meet? Claire didn’t bother to count. They saw each other in hunting lodges, English gardens, an undersea city, the surface of Mars, the gondola of a transatlantic blimp. To Claire, all locations were frames for Byron’s figure. More than his body, more than the frankness of his smile, she began to love the touch of his hand, the way it overlaid hers on the rails of ocean liners, felt for hers, casually, in the press of theater lobbies. He was a man who coveted contact: half-conscious, constant. She loved his need to know she was there.\nAnd still, he was something much stranger than a lover. In this world, there was one sure pleasure, and this was the pleasure Byron offered. Talk.\n“What was it?” she asked him, one night as they mingled, duded out in rodeo getups, with the square-dancing clientele of a cowboy bar. “In New Orleans, that night, you sought me out. What was it that made you notice me?”\nByron didn’t hesitate. “A question,” he said.\n“And what question was that?”\nHe pointed at their knee-slapping environs: the mechanical bull, the rawhide trimmings, the Stetsons and string ties and silver piping. “Our lives are a joke. Anyone can see that, I guess I wondered why you weren’t laughing.”\nShe laughed then, making herself sad with the sound.\nOther evenings they shouted over a buzz of airplane propellers, under the bump of disco, across the chill seats of a climbing chairlift. But always they talked, endlessly, oblivious to their surroundings, one conversation encompassing a thousand fragmented days.\n“And you?” Byron spoke between sips of drinks that vanished like snow under his breath. “What did you see in me?”\nClaire smiled, silent. She knew he knew the answer.\nIn the private bedrooms of an endlessly itinerant courtship, they never stripped off their clothes, never attempted the clumsy gyrations that passed for sex. They lounged in lazy proximity, fully clothed. Claire felt no reserve. With Byron, there was no question of making a match. His worn, mature face, sadly humorous, told her he’d put all such questions behind him.\n“Anyway, it doesn’t matter.” He often held her hand, rubbing her thumb with his. “You say we’ve been forgotten. Some people say we’ve been abandoned. But what would it change, if we knew the truth? Things would be the same whatever happened in—well, in what I suppose we have to call ‘the real world.’”\n“Would they?” Claire focused on the confidence with which he spoke, the weary conviction of his old, wise voice.\nByron narrowed his eyes. “That’s what I believe. We were made to live this way. We were never meant to find a match.” He lifted himself on an elbow, gazing across the folds and drapes of the bedroom, the swaddling silk abundance of an ancient four-poster bed. “Look, the idea is we’re proxies, right? Our originals, they got tired of looking for love. The uncertainty, the effort. So they made us. Poured in their memories and hopes, built this playground, so we could do what they didn’t want to do, keep mixing and mingling and trying and failing. And one day we would find a match, and that would be it, our work would be done, and we would be canceled, deleted, for them to take over.”\nClaire lay still, withholding comment. There was a real thrill, she thought, in hearing things put so plainly, the cynical logic of their lives.\n“But what if,” Byron said, “that wasn’t ever their real goal? What if they never wanted love at all? What if they only wanted to want it—wanted, in some way, to be able to want it? You remember how things were. We all remember at least some of that world. Was it ever such a loving place? The overcrowding. The overwork. It was so much better to be alone. What if this place only exists . . . what if we only exist to . . . to stand in for something, represent something, some kind of half-remembered dream? A dream our originals had mostly given up, but still felt, in some way, they ought to be dreaming?”\n“Oh, God,” Claire sighed.\n“I’m sorry.” Byron touched the backs of the hands she held over her face. “I shouldn’t be talking like this.”\n“It’s not that.” She dropped her hands. “It’s that it’s all so wrong. You make it sound even more hopeless than it is.”\n“I don’t believe it’s hopeless.”\n“But if we’re only here to go on some futile, empty search . . . I mean, why?” She sat up, holding fistfuls of sheet. “We’re a joke twice over. A fake of a fake. Even if they didn’t know we would. . . . ” She was garbling her remonstrations, caught, as usual, between religion and philosophy. “I mean, why would anyone put us through this?”\nHe lay back, staring, pale as an empty screen. “Claire, what if I told you we could make a match?”\nShe held a pillow to her breast, suddenly cold, wondering if it was the kind of cold a real human being would feel. “Don’t say that.”\n“I mean it.”\n“Don’t say it. You know what will happen. I hate this world. I hate the people who made it. I hate myself, whatever I am, and I hate the woman I used to be. But I’m not ready to—”\n“I’m not saying you have to.”\nShe watched him with bared teeth, projecting all her fear onto his alarmingly calm face.\n“I’m saying we can do it.” Byron’s eyes were like red wine, dark and flickering. “We can do it without giving anything up. We can commit to each other, forever, without being deleted or vanishing. We can declare our love, and no one will ever know, or interfere, or steal it away from us.”\n“That’s impossible.” She bit her tongue until she could almost remember what it felt like to feel pain.\n“It’s entirely possible.”\n“That’s not how things work.”\n“You forget. I told you once, long ago, I have an interest in virtual environments. Or anyway, I used to. I know exactly how this world works.”\nShe sat up, seeing excitement shining from him via those two bright giveaways, perspiration and tears.\n“Do you remember, Claire? New Orleans?” He sat up, reaching for her hands. “There’s a dock, there, that runs far out into the river. A ferry sets out from it, every night, toward the far shore. Each night, it leaves a second earlier; each time, it travels a second farther. One time out of a thousand, it reaches the far bank. If we’re on that ferry when it touches land, we’ll be on a border, a threshold, a place where the rules no longer apply. When the scenario resets, we’ll be left behind. We can live there forever, or however long the world lasts.\n“Claire.” He insisted, at that moment, on holding both her hands, as if needing to be doubly sure she was there. “Nothing is entirely random. I know you don’t keep count of the nights, but I do. I’ve been tracking the evenings, observing the patterns. And I’ve been looking for a person to take along with me, one person to share with me the rest of time. You are that person. Say the words. In five nights, we will meet again, at a dinner party in New Orleans. The ferry will set out at eleven-forty. Come with me, Claire. Be with me on that deck. Step with me, together, out of this world.”\nShe saw her fists vanish inside his. The midnight chime would sound in a moment, and with it new crowds, new possibilities, new glories of music and excitement would be conjured out of the unending night. Could she leave all that behind, stand with this man forever on the shore of one permanent land? Together, they would walk, never changing, down unchanging streets, where dance music streamed out of immortal cafés, where orchids stood, never wilting, on the sills of bedroom windows, silvered by a moon that never set. But these would be their cafés, their moon, their orchids, and if there was no way to know how long it might last, still, they would own together that unmeasured quantity of time, laying claim to one house with its scattershot furniture, and never live in fear of the midnight chime.\nAlready, tonight, that chime was sounding, jangling a warning across the sky. But Claire had time to speak the charmed words.\n“I want to see you again.”\n5\nAround the long dining table in the house in New Orleans, Civil War colonels gazed out of their walnut frames. The candles were at work, scattering reflections, and the antique chairs creaked with conviviality. Claire sat next to Byron, intent on the French-style clock. Dinner was done, the plates cleared away, and two dozen puddings quivered in two dozen china bowls.\n“Pudding,” sighed a ravishing girl, dressed, like many, for the setting, in the rustling skirts of a southern belle. “You see what I mean? It’s all so random. Radicchio salads, oxtail for dinner, and they serve us chocolate pudding for dessert.”\nClaire, seated across the table, reflected that this was the last time she’d ever have to have this conversation.\nTwenty-four spoons dipped and rose. Twenty-four servings of pudding vanished, dispelled by the touch of twenty-four tongues.\nWhen the party dispersed, Byron took Claire’s hand. At the door, he bent to her ear, and she felt his warm whisper. “Three hours. Stay close.”\nThey stepped out onto the porch. And Byron disappeared.\nClaire spun in confusion. The porch, the house, the whole scene was gone. She stood on a dance floor, surrounded by feet that stamped and swung and kicked up a lamplit dust. The dim air shivered to the scratch of a fiddle. There was absolutely no sign of Byron.\nTrying to get her bearings, Claire clutched at the jostling shoulders. She spotted a door and wriggled toward it. The energy of the dance, like a bustling machine, ejected her into humid air.\nClaire stumbled down three wooden steps. Looking back, she recognized the roadside bar where she’d sat with Byron on their first meeting, several thousand nights ago.\nWhat had happened? Claire staggered toward the road. The moon made iron of the land, steel of the river, and the lights of town were far away.\nThe ferry! It was only a few miles from here, no more than a two-hour walk. Claire thought she could make it, if she hurried.\nShe’d walked a quarter of an hour when a vintage roadster, roaring from behind, froze her like a criminal in a flood of light. Byron pushed open the door.\n“Get in.”\nClaire hurried to the passenger side, jumped into the leather seat. Byron stomped the gas, and the wheels of the car barked on gravel.\n“It’s glitching.” Byron leaned forward as he drove. “The environment. The counters are resetting. Like I said, we’re in a liminal place, tonight. The rules are temporarily breaking down. Look.”\nHe tapped his wrist, where a watch glimmered faintly.\n“It’s after ten,” Byron said. “It’s been over an hour since I saw you. We’ve lost a chunk of time, and I’m afraid—damn.” He swerved, almost losing control, as he caught sight of something down the road.\nTwisting in her seat, Claire saw the roadside shack, the one she’d just exited, sliding by.\nByron cursed and pushed down on the gas. They rattled up to the old roadster’s maximum speed, forty, fifty. Swamps, river, and road flowed by. The shack passed again, again, again.\n“All right, that does it.” Byron braked so hard, Claire nearly whacked her head on the dashboard. He fussed with the gearshift and twisted in his seat, wrapping an arm around her headrest.\n“What’s happening?” she asked.\n“Can’t you tell? We’re looping.”\n“But what are you doing?”\n“Desperate problems call for desperate measures.” Byron squinted through the tiny rear windshield. “The way I see it, if you can’t hit fast-forward, hit rewind.”\nThe car jerked backward.\nAnd car and road and Byron all screeched out of being, and Claire found herself sitting at a café table, alone, deep in the tipsy commotion of town.\nShe jumped up, knocking over her chair.\nOnce again, Byron was nowhere to be seen.\nClaire cursed, turned in a full circle, cursed again. A passing man in a bowler hat picked up her chair, righted it, and touched his hat.\n“Crazy, eh? All these jumps?” He straightened his jacket with a roll of his shoulders, looking up at the sky, as if expecting heaven to crack.\n“But what do we do?” Claire gasped. “How do we stop it?”\nThe man in the bowler hat smiled and shrugged. “Nothing to do, I guess. Except play along.”\nPantomiming, he grabbed a nearby barber pole, swung himself through an open door, and promptly, like a magician’s rabbit, blinked out of existence.\nPartiers ran past, giggling and tripping, stretching their faces in merry alarm, like people caught in a thunderstorm. Firefly-like, they meandered through doorways, laughing as they winked in and out of existence. In a world of rules and repetition, Claire had long since observed, childlike chaos greeted any variation in routine.\nBut what do I do? Claire ducked into a drugstore entrance. What can I do, what should I do? She did her best to steady her mind, analyze the situation. The jumps, the cuts, the vanishings and reappearances—they seemed to happen at moments of transition: entries and exits, sudden moves. If she found some way to game the system . . .\nTurning, Claire jumped through the drugstore door. And again, and again, and again, jump after jump. On her fifteenth jump, the trick worked, the environment glitched. Claire tumbled into a banquet hall, crashing into a tray-bearing waiter, scattering scallops and champagne flutes. “Sorry, sorry . . . ” Dashing toward the hall doors, Claire tried again. Another round of jumping propelled her into a rowboat, somewhere out in the stinking bayou. Gators splashed and rolled in the muck, grunting and hissing as they fled from her intrusion. Claire jumped into the water and ducked under, sinking her feet in the creamy ooze. She kicked, launching herself up into the air—\nAnd found herself, sodden with mud, near the bank of the river, back in town.\nHow many times would she have to do this? Searching the bank, Claire saw no promising doors. She threw herself into the river three more times. The third time, she emerged in a backyard swimming pool.\nAnd so, through portals and windows, through falls and reversals, Claire skipped her way through the liminal evening, traversing a lottery of locations, careening in her soaked dress and dirty hair through car seats, lawn parties, gardens and gazebos, bedrooms where couples lay twined in dim beds. Sometimes she thought she saw Byron, hurrying through a downtown doorway or diving over the rail of a riverboat, moving in his own Lewis Carroll quest through the evening’s hidden rabbit holes. Mostly, she saw hundreds of other adventurers, laughing people who leaped and jostled through doorways, running irreverent races in the night.\nAt last, Claire stumbled out of a bait shop onto the dock, the ramshackle fishing shacks hung with buoys, the long span of planks laid out like a ruler to measure the expanse of her few remaining minutes—and there was the ferry, resting on the churn of its diesel engine, bearing Byron toward the far shore.\n“Claire,” he shouted over the water, and added something she couldn’t hear.\nWas it a freak of the fracturing environment, some cruel new distortion, that made the dock seem to lengthen as Claire ran? Was it a new break in that hopelessly broken world that made the planks passing under her feet seem infinite? By the time she came to the end of the dock, Byron and the ferry were in the middle of the river, and his call carried faintly down the boat’s fading wake.\n“Jump!”\nWas he crazy? The distance was far too wide to swim.\n“Claire, I’m serious, jump!”\nAnd now, Claire understood: if it had worked before . . . a thousand-in-one chance, perhaps . . .\nFar across the river, Byron was waving. Claire looked into the water. Briefly, she hesitated. And this was the moment she would think back to, a thousand times and a thousand again: this instant when she paused and held back, wondering how badly she wanted to spend eternity in one home, one world, with one man.\nThe next instant, she had flung herself headfirst into the water. And perhaps this world made more sense than Claire thought. Perhaps the designers had known what they were doing after all. Because of all the cracks and rabbit holes in the environment, of all the possible locations in which she might emerge—\nShe was splashing, floundering, on the far side of the river, and the ferry was a few yards away.\nClaire thrashed at the water, clawing her way forward, as the first of three chimes sounded over the water.\nShe’d forgotten to kick off her shoes. Her skirt wrapped her legs. She couldn’t fall short, not after trying so hard, chasing potential romances down the bottomless vortex of an artificial night.\nThe second chime made silver shivers pass across the water.\nSo close. Claire tore at the waves, glimpsing, between the splashing of her arms, Byron calling from the ferry, leaning over the rail.\nAs she gave a last, desperate swipe, the third chime rang in the coming of midnight, the sound reminding Claire, as it always would, of the teasing jingle of a set of keys.\nAround bright tables, under lamps and music, the partygoers had gathered, to mingle and murmur and comment on the food. So much beauty to be savored, so much variety: so many men and women with whom to flirt and quip and dance away the hours of an endlessly eventful evening. And after tonight, there would be more, and still more—men and women to be savored, sipped, dispelled.\nIf anyone noticed the woman who moved among them, searching the corners of crowded rooms; if anyone met her at the end of her dock, looking across the starlit water; if anyone heard her calling one name across the waves and throbbing music, they soon moved away. The party was just beginning, lively with romance, and the nights ahead were crowded with the smiles of unknown lovers.\nOriginally published in Asimov’s Science Fiction, August 2015.", "source": "https://clarkesworldmagazine.com/wolven_09_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: No Placeholder for You My Love by Nick Wolven"}