{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Shari Paul", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "gW6WprWMrcq8CjIerpHpdsrdQvI=", "id": null, "license": null, "comments": "", "raw_text": "13780 words, novelette  Between Zero and One There is Infinity  0.1  Nil knows at once that she is no longer on the cargo vessel.  Immanuel is kneeling on the floor across from her, eyes wide, face flushed, glancing frantically at someone nearby she cannot see. That stops her for a moment, she used to have access to everywhere at once, from all angles. She turns without thinking about it, then stops again to glance back at Immanuel, stunned, and stops again when she realizes what it means. She has a body.  One head, a pair of ears, eyes, one nose, lips with a functional tongue, a flexible neck, torso, shoulders, arms, a pair of elbows, wrists, hands, ten fingers, breasts, hips, vagina, thighs, knees, shins, ankles, ten toes. She turns her head and hears the light swish of hair shifting against her clothes. She puts her hands in and draws out a pair of blue-black locs, jangling the tiny ornaments woven in. She had seen a model like this once, searching a catalog when Immanuel had fallen asleep without putting her into hibernation: the “Rasta Empress,” it had been called. A sexbot. She looks up at Immanuel again and wiggles the toes at the end of the feet stretched before her. Then she sits up.  “Captain, it’s awake,” says someone.  Nil turns her head to the speaker as Immanuel snarls, “Her name is Nil, and I told you, she’s not an AI.”  There are two women standing at the door to the garage that they are all in. The first is short, slim, and dark-skinned, with a shaved head, nose and lip rings, and tattoos along both arms. They gleam in the low light: flowers and birds and words. She meets Nil’s gaze and does not look away. The second woman is only a little lighter-skinned than the first, with a curvier build, her hair in a thick Afro. Both are dressed in workmen’s overalls and pressure suits. Neither are smiling.  “What happened to the pirates?” asks Nil.  “They are the pirates,” Immanuel replies.  The second woman scowls but the first laughs and says, “Yes. You can call me Nanny, and this is Yaa. Your name is . . . Nil?”  “Brunilda,” says Nil. “My fathers said it was the name I had when they found me.”  The two women exchange a look and Nanny asks, “Where are you from?”  “Olympus Mons, the Martian Territories,” Nil replies. She turns her head again, barely thinking of it, and looks around. There are four small spacecraft docked in the cavernous garage bay and a fifth angled toward the door. Immanuel’s attempt to escape, probably.  “What are you going to do with us?” asks Nil.  “Your friend says that he is part of the Earthbound Resistance,” Nanny replies. “How did you two meet? What are you doing all the way out here?”  “He found me when the Resistance sent him to spy on my fathers. They were Savreeni. Moltoch was the Curator of Human Artifacts and Archivist of Savreeni Records, and Tuva was an archaeologist,” says Nil.  The women turn to Immanuel, who scowls and says, “They mined our resources under the cover of archaeologist and curator. She was already like this when I met them. She says her body died when she was seven and they preserved her in the house. When the . . . Whistlers, showed up, they just left her there. I downloaded her from the mainframe in the safe room and decided to head for the Safe Zone. Mars is . . . there was nothing for us in the Olympus Mons settlement.”  Nanny nods at this, but Yaa asks, “You said that you were heading for the Resistance? That ship was heading to the outer colonies, not even close to the Safe Zone.”  At this, Nil turns to Immanuel. He meets her gaze, swallows, and says, “I can’t take her to the Resistance. They’d tear her apart looking for intel on the Savreeni.”  Nil feels a drop in her chest, a sensation like falling, and her brain tells her it is shock, “But you said that I could stay with you . . . ”  Immanuel breathes out, short and sharp, and says, “I couldn’t hand you to them, you don’t understand.”  Nil cycles through the conversations they have had since he first uploaded her in his bunk on the cargo ship and asks, “Were you just going to leave me there? Or were you running away too?”  Immanuel turns to glare up at the two women, but replies to Nil, “There’s another planet around another star that Earth sent an interstellar ship to more than a hundred years ago. We know they made it because they started picking up signals from their tech a few decades before the Savreeni showed up. They called it Theia, and there are no Savreeni or Whistlers there. You would be safe.”  “You’re a coward,” Yaa spits, glaring at him.  Immanuel lifts his chin and replies, “You can call me that if you want, but I’m not going to let anyone hurt Nil . . . not even my people.”  Nanny smiles at him and says, “Well that’s out of your hands now, isn’t it?”  Nil wonders if she should be afraid.  0.2  The pirates’ ship, Neuth, is a former military cruiser they stole years ago and retrofitted in the cloud tops of Venus, the pirate haven of the solar system. It’s also where they’re heading now, right past the ongoing war between the remaining Savreeni and Whistlers and United Earth Armies. Space is big, Immanuel had once explained to Nil, so big and so dark that it is impossible to see everything passing by. Also, Venus is on the other side of the sun from the Earth and Mars at this phase in its orbit, so no one will see their approach anyway.  They were less than three million kilometers from the inner edge of the Asteroid Belt when the pirates intercepted their cargo ship, after traveling steadily toward it for nearly a month. It had taken Yaa two days to find Immanuel and then more than a week to get Nil’s drive and upload her to a spare sexbot they had retrieved in an earlier raid.  “Don’t worry, we cleaned her thoroughly before we even put her in our storage. Thought we would sell her back on Venus. Older model, but still popular,” Xue-Li, Nil’s new roommate, explains. Nil’s new body wears a knit top with bikini underneath, cargo pants, combat boots, and copious jewelry. It is not the most practical outfit, but Nil has no need for a pressure suit. “Lucky for you.”  Xue-Li has chin-length hair and a kind smile. She was a soldier once, and now she helps Nanny raid pirate-hunting military ships and otherwise spends most of her nights with Yaa, so Nil has the room to herself. Nil spends most of the time lying on the floor getting used to the feeling of being confined and yet free. She refuses to ask after Immanuel, who she last saw in the garage bay. Xue-Li says that he has been put to work until they get to Venus. Maybe someone there will be willing to take him back out to the colonies or even the Safe Zone. Nil has already decided that she is staying with the pirates. At least they do not lie about what they intend to do with her.  “When the Savreeni and your fathers abandoned the Martian territories, they left a lot of shit behind. Shit that we can use. We want everything that you can tell us about where that shit is. Payment for the body. We could have sold it for a good price. People really like that model,” said Nanny after they had left the garage and assembled in the main mess hall.  Immanuel has been trying to explain the concept of money to Nil from the first day they met, when she said “Hello” and startled him as he sat checking his pay on the back porch of her fathers’ house. She had calculated for a moment based on the cost of similar model at the last price she saw and said, “I want a share.”  Yaa had lifted an eyebrow. Xue-Li burst out laughing, loud and long. A few of the other women—and they are all women, twenty of them, save one, in this crew—mock the captain and protested Nil’s response. Nanny, smiling slightly, had asked, “What about Immanuel?”  “He needs his own share, but you can negotiate that with him,” Nil had replied. “I want enough to pay for a new custom body and maintenance after. I will also need to cover the cost of shelter.”  “Oh, okay then. Deal,” said Nanny.  After that talk, Nil and Immanuel had been dispatched to different parts of the ship. There is an internal network on the ship, mostly for communication or playing music that sometimes leads to fights over said music, but Nil does not connect to it. Instead, she lies down on the floor and listens. Nanny’s method of interrogation was a conversation, nothing at all like what Nil has seen with Immanuel in the many movies they watched on the cargo ship. It leaves Nil feeling drained, as if Nanny has drawn out parts of her with her words. It makes her miss the quiet of the abandoned house, even with the Whistlers’ intermittent whines drawing closer, and for the first time in months, she thinks of her fathers.  Tuva and Moltoch adopted Nil when she was three years old, from a crumbling orphanage in a poor human colony that had been ravaged by yet another disease outbreak. Her parents were long dead, and Nil never quite recovered from that first illness by the time her body died. There might have been DNA, some tangible piece of her somewhere in the house, but after there had been no time to look and Immanuel was on a deadline. But Nil can go still go wherever she wants in this body, and it would last longer. She can stay with the pirates even, Nanny has promised, and make a good life patrolling the solar system. Or she can try for the Resistance that Immanuel was running away from. See if they really will tear her apart to get another kind of treasure. The possibilities are endless.  One week away from Venus, Immanuel comes to visit. Nil is in her usual place now that the planet has appeared on the horizon, an observation deck that doubles as the ship’s common room. No one bothers her here; the human crew play games or movies among themselves while the two gynoids take turns charging in their recessed ports. Nil is mildly surprised to discover that they did put Immanuel to use because his hands still have traces of grime around the fingernails when he settles in beside her.  “I wasn’t just going to put you on the ship when we got to the Asteroid Belt,” he begins without preamble. “I would never . . . after what happened to you, I was not going to make you do anything that you did not want to. I realize now that I didn’t have all the information I needed when I went to play ‘rebel spy’ at your fathers’ house.”  Nil looks at him. Immanuel up close is taller and thinner than the video cameras suggested. He walks with a slight limp due to the brace on his left leg—an old injury, the accident that killed his parents when he was a boy—and he has a trace of a rolling accent from his childhood in Scotland.  “Where would I go without you?” asks Nil. “I want to be out there; I’ve wanted to be out of that house long before you arrived but all I knew was everything I’d read. I don’t know how to . . . ” she trails off and turns back to the window. Outside the endless black is speckled with tiny pinpricks of light and just ahead a glowing, pearlescent ball, the pirate planet, Venus. The sun, huge and bright, is behind them.  Immanuel reaches for her hands, and she lets him touch them, marveling at the pressure of the hold. This is the first contact they have ever actually made and because she wants to squeeze back, she does, and she catches a tiny smile at his lips. He says, “I was going to give you the choice to come with me, you know. And if you wanted to go to Theia, I would have made sure you were settled on a good ship. I . . . the Resistance is also taking care of my little sister, and my aunt and her family are working with them, have been for years. I’m not leaving without her, or them.”  This is the first Immanuel has mentioned of family. In all the months they have known each other now, he has spent most of the time telling Nil about the world and very little about himself. Nil pulls her hands out of his grasp and asks, “You have a sister?”  “Isla,” he replies, smiling softly. “She’s about your age . . . or well, the age you should be if your information is correct. And my aunt, Caitlin, and her husband, Farouk. They live on Mars too, in Viking Colony I. The Resistance recruited them because they knew my aunt’s job put her into contact with high-ranking Savreeni looking for Terran artifacts to decorate their villas. I think Isla would like you.”  “I had no one,” Nil says, looking down at her hands, still fascinated by them. “I remember my fathers would take me everywhere when I was little but then my body died, and then they barely spoke to each other after. When you came, Tuva had just come back after being away for nearly a year. He used to carry me everywhere and then suddenly he would not even speak to me, or he would fight with Moltoch.”  Immanuel says nothing for a time after this, and they sit in silence. Immanuel is probably on a break, but Nil has no skills and so has no job. Nil suspects this is really because Yaa or Nanny are afraid of her damaging the body she promised to return to them once she gets one of her own but cannot be sure.  Finally, Immanuel says, “You have me, even if you are not happy with me right now, and you have every right to be, I’m not going to leave you alone. Whatever you decide to do.”  “What if I decide to stay with them or go to the Resistance?” asks Nil at once.  Immanuel offers a wry smile and says, “I’m with the Resistance. It would be just like going back to give them my final report.”  0.3  The sky above the cloud tops of Venus is yellow and rose gold, never-ending twilight. The pirates’ floating colony is a former research station, decommissioned shortly after the Savreeni arrived. It looks like someone had sewn at least eight hot air balloons together under an octagonal platform on which a glass-walled multilevel tent with retractable lead shields had been erected. There are several ships docked around it on all sides, and a series of zeppelins anchored at various distances, linked to the colony by lengths of nanofiber cables. This is the floating city of Saraniya.  Susie, the cook, a tall blond with a full beard and waist-length hair, stands with Nil to watch the descent. They tell her, “Welcome to the Pirate Snow Globe. The refuge of those who didn’t want to live under the Savreeni, couldn’t go to Earth, and aren’t welcome anywhere else. Thankfully for our forebearers, this place was just sitting here, forgotten. Good thing too, since the Whistlers showed up. They don’t care about it because we don’t have a lot of Savreeni here.”  Immanuel turns to look at them, brows furrowed, and asks, “There are Savreeni here?”  Susie lifts an eyebrow at him and replies, “Yes. Some of the Savreeni didn’t want to live under them either, others were escaping war. Not everyone involved in an invasion ends up well off.”  “But they’re still invaders,” Immanuel says.  Susie glances at Nil before replying, “Please remember that you’re just a guest here.”  Nanny lets the rest of the crew leave before she leads Nil and Immanuel off the ship, flanked by Yaa and Xue-Li. The station they step into is vast but packed with people hurrying about. Immanuel sniffs hopefully toward food carts scattered around the main floor, but Nanny marches them past without a word. They take an escalator up three flights, which gives Nil a view of much of the station: the docks and food court on the lowest levels, living quarters and shopping on the second, and administration on the third. There are even more levels above, which Xue-Li helpfully explains are recreation and entertainment spaces, medical and educational facilities, also, a prison.  Immanuel opens his mouth to say something, but Yaa cuts a look at him, and he wrinkles his nose and remains silent.  Nanny leads them to a blue door in a section of wall that looks no different from the others they pass, though it is at the end of a long corridor they took at least two turns right and one left to get to. The door is opened by a tall, dark-skinned man with long, curly hair, a short goatee, and rectangular tech glasses. He is also not wearing a pressure suit, though most people they pass on the station are. To Nanny he says, “What trouble is this you bring for me here? That boy don’t look like no Resistance fighter and is this a prostitute?”  “She’s seventeen,” Immanuel hisses, glaring at him.  “A baby hooker?” asks the man, with a raised eyebrow.  Nil says, “I died when I was seven and my Savreeni fathers uploaded my brain to their house. Immanuel saved me when they left me behind in the Retreat and this is the only body Nanny could give me. Who are you?”  The man’s eyes go wide, but then he grins and says, “Okay, Baby Hooker, you’re not the first Savreeni adoptee I’ve met. Xue-Li there is one. Hell, you is not even the first Upload. What makes you so special?”  Nanny, behind them, replies, “Easy there, Dmitri. One of her fathers was the Curator.”  Dmitri stops smiling. Nil stares back. He steps closer and Immanuel tugs her away. Dmitri notes the movement with a nod and says, “The Curator, huh? That was a big one, used to be talking to all them Earth leaders like they grew up together. He and all went in the Retreat?”  “The Curator is the Savreeni. Where they go, he must go,” Nil replies.  Dmitri looks at Immanuel again and asks, “I take it enough of the house is still intact that Nanny here thinks it worth the risk of running into Whistlers to recover whatever we can get our hands on?”  “The panic room was intact when we left and it’s made of reinforced materials to protect all the stuff they kept in there,” says Immanuel.  Dmitri stares at Nil for a beat then looks around them. There is no one else in this section of the station. He says, “Let’s take this inside. The last thing we need is someone overhearing this and thinking I’m actually considering this suicide mission.”  “Inside” looks like a larger version of Immanuel’s room back on the cargo ship. Everything folds away until needed, leaving only spare pieces of furniture and a screen wall playing the highlights of various sports. Dmitri goes to a touchscreen beside the door and a long, low table rises from the center of the floor. He takes the seat at one end and Nanny goes to the other, smirking at him. Immanuel settles beside Nil facing the door, while Yaa and Xi-Lue sit facing them. Dmitri says, “Does anyone want anything to drink? A charging port for the gynoid?”  “No,” says Immanuel, as Nanny replies, “That won’t be necessary.”  There is a pause, and Dmitri smiles and says, “I assure you I would not have attempted an upload.”  “We’re pirates discussing treasure and she is the map. I’ll risk offending you for my peace of mind,” says Nanny.  Dmitri laughs at that, loud and long, before turning to Nil and saying, “She has a point. Once word gets out about you, it’s best you stay away from the station’s systems as much as you can.” He stops, clears his throat, and says, “Now, tell me about this treasure in the middle of Whistler territory.”  0.4  The Whistlers are nothing like the Savreeni, or so Nil has been told. The first Nil had ever heard of them, she was still alive, and six years old. Moltoch had dressed her for a dinner party in which Tuva spent most of the evening scowling, annoyed at being separated from the artifacts in his office. Nil did not mind. When he was upset, Tuva would let her crawl all over him.  Caba, the Monitor, his fifth glass of wine in hand, announced it at the table, “The interference I picked up, it’s not background radiation disturbed by a gravitational wave.”  Nil had not understood at the time why the table suddenly fell silent. No one spoke, nor even moved. Nil glanced up at Tuva, and he tightened his grip around her tiny waist. Caba had snorted, then scoffed at them and said, “Why are you so shocked? You all knew it was only a matter of time before they found us. We still have plenty of time to find somewhere else to go or try to end it once and for all. I vote for the latter, by the way, I’m tired of running.”  “How much time do we have?” asked Moltoch, glancing over at Nil and Tuva.  “Decades, probably, a century if we’re lucky. That is, if they don’t get a boost from going around one of the bigger stars. Procyon is what the humans call that one? Yeah, cuts the time in half, easy,” he replied, and refilled his glass. “Then it’s just a few years.”  The Whistlers went around Tau Ceti instead, but by the time the Monitors had figured this out, Nil had become a part of the house and her fathers had broken up. Tuva kept the house, while Moltoch went off to join his family on Ganymede. He had left almost everything behind in the process: human and Savreeni artifacts, art, an extensive library that contained all they had learned of the solar system and Mars, and, most important for the pirates, Nil guesses, maps of the lava tubes and tunnels that had been modified to facilitate habitation of the Red Planet.  As to what the Whistlers look like, their capabilities, their weaknesses, the reason they chase the Savreeni through the galaxy, that Nil does not know. When she tells Dmitri this, he asks, “Do you know what a pirate is?”  Nil glances over at Nanny, then Immanuel, who nods, and she replies, “A thief.”  Nanny snorts at this, as do the others, but Dmitri smiles and corrects, “An entrepreneur. There is a demand for a product in limited supply, or impossible to acquire in the normal way. People like me can get the product, we ain’t afraid to use any means available to us, and our customers are willing to pay whatever we ask, no questions asked.”  “That’s one way of looking at it,” says Nanny.  “Don’t act like you’re any different,” says Dmitri, glaring at her.  She shrugs and rolls her eyes, then turns her attention out the window.  To Nil, Dmitri says, “The war with the Savreeni and the Whistlers haven’t reach Earth or we here on Venus, yet, but that don’t mean it won’t. The Whistlers hard to kill, everybody know that. All you hear before you dead is the whistling of them talking to each other. But the Savreeni have been fighting them long time and they can kill them. Which means that the Savreeni have weapons that can take them out, and there are people on Earth who would be very interested in getting their hands on that.”  “People like the Resistance,” says Immanuel.  “What do you care?” asks Dmitri, lifting an eyebrow.  “I have people with the Resistance,” says Immanuel, meeting his gaze directly.  Dmitri scoffs and says, “Take it easy, you should be glad I trying to help out a situation then.”  “If the Savreeni can kill the Whistlers and we can’t, and because they have been fighting them all the time, the Whistlers haven’t come to Earth, why should we try to get in the middle of that?” asks Immanuel. “I know no one likes the Savreeni, but they have been helping us since they got here. You know these weapons aren’t going to be used against the Whistlers alone.”  “Whose side are you on?” asks Nanny.  “My own,” says Immanuel. “And Nil’s. When I went back to them after the Retreat . . . I’d told them about Nil before because that was what I had been sent to do, give them info on the Curator and his family. They didn’t care that most of the Savreeni had left, they wanted me to guide them back in there so they can ‘see what they can use and what they can sell.’ I asked them why, because with most of the Savreeni gone, the ones who remained couldn’t do anything to anybody. And then they started talking about issues in their own countries and settlements that they could help with the Savreeni technology. We don’t even have anything like Nil, they’ve tried but no one here has figured it out yet. They would tear her up trying to figure out how she works, or they would try to turn her into a weapon. I won’t let them happen.”  Dmitri looks between the two of them for a moment, and says, “I don’t care about that. It cost me a lot just to find out what exactly the Curators and them used to do. Olympus Mons is the largest community the Savreeni had on Mars before the Whistlers showed up. Even just a fragment from that collection is worth trillions, but the books and weapons are priceless—by the way, they didn’t upload anything like that to the girl, right?”  Immanuel’s eyes widen in alarm, but Nanny answers for him, “No. You know that would have wiped out everything else and made her a full AI. Everything you want is still in that room and the girl just tell you the room intact.”  “The weapons wouldn’t be in there,” says Dmitri.  “No, they aren’t,” Nil confirms. “But the Cache was under the Community House.”  Once again, all eyes go to her. She shrugs, her new favorite thing about having a body, and says, “It’s a magma chamber, and they reinforced it. If I was going to hide anything, it would be there.”  Dmitri looks back to Nanny and says, “I can give you fifty million for the girl.”  “No!” says Immanuel, at once, slamming a fist down onto the table. He winces a moment later.  Dmitri just smirks and says, “Don’t worry, this is a group project. We’ll need at least three crews just to get to Mars in the first place. Another two for security and two more for the labor. But we won’t have that. One crew, maybe a few more people than the ones already in this room and absolutely no guarantees that we’re going to get out alive.”  “We also can’t let the Resistance find out about this, unless you want them to cut out the middleman,” says Immanuel. “They sent me to get information, if they know about her, they won’t need you.”  “Do we have an agreement?” Dmitri asks Nanny.  Nanny looks over at Nil, who stares back at her. It takes her a moment to realize that Nanny wants her approval. She nods and Nanny says, “Yes, we do.”  0.5  There’s no real nighttime on Saraniya. They had been invited to stay with their new business partner, but Nanny had refused, insisting that it was much less suspicious for them to take beds at one of the several pod hotels on the station. And so Nil sits on the floor near Immanuel’s pod in the mixed dorm as he calls the family he never told her he had.  “Hey, Auntie. How are you guys?”  The woman who replies sounds young, her voice bright and clear as she says, “Good to see you’re not dead. Where have you been for the past few?”  Immanuel clears his throat and says, “Working my passage home. Told you that I got hired onto a new ship. The crew’s good to me. You don’t have to give me that look, I’m not lying.”  “You shouldn’t have to do this. I wish you hadn’t signed up for this.”  “But I did,” says Immanuel.  There is a sigh on the other end and then the woman asks, “You told me that you were trying to get a friend out. Did you?”  Immanuel glances over at Nil and replies, “Yes. They’re doing better than I expected. They probably don’t even need my help anymore.”  “Well, that’s good,” says his aunt. “Please let them know that they’re free to stay with us for as long as they need.”  Nil lets the invitation wash over her for a moment before looking away from him altogether. He had not been trying to take her to their house. Nil stands and checks the power levels on her body: battery ninety-three percent, all systems operating at full capacity. As she moves to go, Immanuel looks up and asks, “Where are you going? What are you doing?”  “Just outside. I won’t get lost,” she replies.  He rises, ready to follow, and she repeats, “Nanny’s crew is all over this station. No one’s going to let anything happen to me.”  He stares at her for a few beats and says, “Please return in an hour. You shouldn’t use up too much energy until we get back on the ship.”  She gives him her best approximation of a smile and walks out of the pod room.  The shutters around the station have been closed, sealing out the planet’s long daylight for the next several hours so the humans within can continue to have some measure of a circadian rhythm. But the activity within seems to have increased. As Nil makes her way through the open promenade, she nearly collides with several groups of people, human and actual Savreeni speaking a variety of languages and dialects, gathering around food stalls and kiosks selling miscellaneous goods and services. There are charging ports for handhelds and gynoids like her. She thinks she spies another “Rasta Empress,” though this one is wearing a jacket over her net top.  She stops for a while near one of the food stalls. She hasn’t needed food in a decade, her new body detects the scent of salt, turmeric, geera, a variety of meats, artificial beef, chicken, and fish, and cooking oil used too long. The next stall has more chicken and oil smells, but also sweet doughs, vegetables. Savreeni food carried similar scents and over the centuries they had adapted styles from the human settlements. She considers getting a snack for Immanuel, then remembers that she doesn’t have any money.  On the other side of the station from the food stalls are a series of brightly lit booths advertising card and slot games. There are at least two bars, above one of which is a screen playing a light aircraft race going on somewhere else on the planet. Someone says, “They’re not catching Morningstar, that girl flies like a bird.”  Nil wanders past all this watching the people. Parents and their children, couples and triples holding hands, groups sitting together drinking or talking or eating. The maintenance staff are all AI, so people either step around her, mistaking her for one, or give her speculative looks if they don’t. There are more screens on the walls, more races, but also news reports, digi-dramas, talent competitions, and one documentary on the history of humans on Mars. Nil pauses before this one—the images suggest that they’re going to discuss the arrival of the Savreeni—when a woman steps into her line of sight and says, “You must be new here. Did you come with Nanny’s ship?”  Nil steps back, blinking at the woman, immediately searching the station’s database for the woman’s face and ID. Tall, slim, curly brown hair, blue eyes; she’s a pilot, captain of a light ship called Morningstar. Nil asks, “Shouldn’t you be racing?”  “That was earlier. What’s your name?” asks the woman.  Nil looks down at herself. She hasn’t changed her gynoid’s clothing, so she looks like any other model. So why is the woman speaking to her?  She says, “I don’t have what you’re looking for. I need to go back; my people are waiting for me.”  The woman slings a heavy arm around Nil’s shoulders and says, “Did you two think you could just run away from the Resistance?”  “What Resistance? Resistance to what?” asks Nil, looking around at the other people for any sign of Nanny’s crew.  The woman starts leading her away, toward the berths where the ships are docked. If Nil gets on one of those ships, she knows she will never see Immanuel again. She uses all the strength she has access to in her artificial body and pushes into the woman’s side, sending her sprawling. The woman cries out as she falls, surprised, almost colliding with a kiosk, people scatter, shocked, clearing a path, and Nil runs.  Two large men step into her path, arms folded. A moment later, their eyes go wide, and they unfold their arms and hold them up in surrender. Xue-Li and Yaa stand behind them, guns trained at the back of their heads. Nanny swivels ’round from a nearby stall and says, “You’ve wandered too far from home, little rabbit. Go back before the wolves catch you.”  Nil drops her head, trying to make herself invisible and small, and walks away as quickly as she can, directly back to the pod hotel. Immanuel is already packing his bag when she enters, and says, “Nanny sent me a message. We have to get back on the ship. We’re leaving immediately.”  Nil pauses in the doorway and says, “They were waiting for us. How did they know?”  “They didn’t, probably not. Nanny’s crew wouldn’t talk so it’s probably that they were waiting around hoping I would show up somewhere. Let’s go,” says Immanuel.  He leads the way out, and they’re greeted by Nanny. She takes the lead without a word, and they make their way back to the ship. Activity in the station carries on as if it hadn’t been interrupted by Nil’s walking tour. When they get back on board, Nanny says, “They’re not going to let us leave just like this. Go to your cabin and don’t come out unless we let you or the ship is breaking up.”  “Are you going to try to ram your way out?” asks Immanuel, eyes wide.  “If we have to,” says Nanny. “Now go.”  Nil goes directly to her cabin and closes the door in Immanuel’s face when he makes to follow her. Then she lies down on the floor listening to the ship. Her room is completely sealed shut. There are pictures of Xue-Li and Yaa all over the wall, and in some of them Xue-Li is in her old military uniform. Only one has a picture of her Savreeni adoptive parents, both at least a foot shorter and several shades darker than her, so they must have been descendants of one of the tropical lands of the Savreeni home planet.  The ship shudders and swoops around her. Nil slides slightly on the floor but doesn’t get up. There is nothing but silence again for a time, and then Nanny’s voice comes on over the PA, “We’re clear. Rendezvous with our friend in twelve hours.”  So, Nil thinks, still lying on the floor, that was the Resistance.  0.6  They approach Mars as they had Venus, sunward and radio silent. The retrofit on the ship makes it appear no different from the literal billions of asteroids, comets, and other space junk orbiting the yellow star at the center of the system. Nil spends her days watching the rust red planet grow bigger from the observation deck. She had not seen Mars when they left, and the pictures she’d come across over the years barely did justice.  Part of the desert planet is covered in a growing dust storm, engulfing everything in its path in featureless clouds that would hang around for several months. The rest is pockmarked with the remnants of centuries of terraforming projects, above- and underground colonies, and the last devastating war. On the nightside, the dust clouds glow with flickering lights like flames as the remaining colonies’ solar-powered power stations struggle through the storm. The Olympus Mons Savreeni colony is the brightest of them all. None of the humans have ever figured out the secret of their power source, and with the Whistlers roaming about, claiming the entire region around for hundreds of kilometers, no one is willing to try.  “The Savreeni would have picked us up by now but the Whistlers haven’t. They’re going to when we try to land though,” Nanny says to Dmitri.  Dmitri sips from a pack of rum, brewed from aeroponic sugarcane, and says, “Yes, but if your pilot is as good as you say they are, we should be underground before they get there.”  Their destination is the Community House, the central administration building of the Savreeni colony. The colony, like most Martian settlements, is mostly underground, with the surface buildings under a dome, arranged in a series of rings leading to a central park. The Community House takes up the last ring, and in another life had been surrounded by lush greenery, trees transplanted from Earth in previous lifetimes and kept alive by underground water that was spread as mist through the dome every morning. Now, even the dome overhead is broken, so that their smaller, though heavily armed shuttle slips in through a paneless hexagon and descends quickly to the dusty, frozen ruin.  Immanuel glances over at Nil and says, “It wasn’t like this.”  Nil does not know but nods.  Yaa at the controls with Xue-Li, says, “Mars is ruthless.”  Dmitri wants to go for the weapons directly, even though Nil and Immanuel both tell him that the Whistlers have overrun the place. Nanny hired him for his weapons and mercenary skills, after all, and though small, their shuttle is heavily armed.  The moment they enter the atmosphere over the Savreeni colony, the whistling starts. It’s a high-pitched screech that ripples through the speakers in a series of alternating tones like whale sounds put through an electronic filter. It grates at even Nil’s ears and Dmitri curses.  Immanuel tightens his grip on his seat in the main deck and says, “We should have gone to Nil’s house. There weren’t any Whistlers around when we left.”  “Shut up boy!” snaps Dmitri, a moment before something slams into the right side of the ship and sends them skating sideways through the air.  “Oh no!” cries Xue-Li.  “Brace for impact!” Yaa yells, just as the shuttle’s rear clips the side of a building. The shuttle swings away in the other direction. Immanuel grabs for Nil’s hand, but Xue-Li and Yaa are experienced pilots and quickly right the ship.  Nil reaches for the ship’s onboard diagnostics but there is no connection to let her through. Instead, her ears pick up a cacophony of alarms and rapid-fire messages over the speakers. Extensive damage to the right side and left rear of the ship. Fuel intact. Electronics damaged on the right side, cargo door damaged, unable to open, and there was briefly a fire. There are people in the cargo bay, Venusian pirates, including one Savreeni refugee who Dmitri had hired. Nil cannot pick up any vitals from anyone on board, even with Immanuel still holding her, and the ship does not supply them.  “We’re going to the Curator’s house! Change of plans!” Nanny commands.  “We right over the Community House!” Dmitri protests.  “And if we stay here, we will die!” Nanny says. Then she turns to Immanuel, “Take us to the Curator. Where is their house? We can make our way back another way.”  “This is nonsense!” Dmitri yells.  “Yaa! Make sure this man don’t interfere,” says Nanny.  “Yes ma’am,” Yaa replies.  “What?” asks Dmitri, a moment before a series of metal bars curve over his chest and hands. “Nanny, girl, what you doing? Is double-cross you double-crossing me?”  Nanny ignores him, turning to Immanuel and asks again, “Where’s the Curator’s house?”  “At the foot of Olympus Mons, the north side. You can’t miss it, it’s the only house there,” he says.  “Xue-Li, you heard that?” asks Nanny.  “Already setting the course. It’s going to be bumpy though, there’s a lot of them on our tail,” Xue-Li replies.  “That’s alright,” Nanny replies, then she reaches for one of her earrings and says, “Susie, a distraction please.”  Nil does not hear whatever the cook says in return, but moments later there is a deafening explosion, the shockwave of which rattles the entire ship.  Immanuel turns to Nanny in alarm, eyes wide, and says, “What are you doing? It’s not just Whistlers on this planet.”  “Do you want to get off this planet alive or not?” she asks.  Immanuel does not reply.  0.7  One afternoon, without prompting, Immanuel confessed to being a spy for the Earthbound Resistance. Nil, who had never come across any such thing in any of her web-surfing around Mars’ Internet, had asked, “What’s that?”  The Retreat was still weeks away, so Tuva was at work in his basement museum, which he barely left these days except to eat, rest, and pay Immanuel’s wages. He never walked around the grounds anymore, so Nil had no idea why he kept the groundskeeper. As far as they knew at the time, the boy was an immigrant alone on Mars, with no one back on Earth waiting for him and no other prospects in the colony. At Nil’s question, Immanuel had just stared at her for a moment and then replied, “There are people on Earth and in this colony who have been working to get the Savreeni out. We were here before they arrived, this is our solar system, and they just came in and took over a planet. We can’t just let them do that. Humans have been trying to set up colonies all over this system for almost a thousand years now. We don’t have room for anyone else. And what if others come?”  A quick web search confirmed what he said about human settlements, extending even to icy Titan with its methane-powered colonies. But the solar system was more than seventy-nine AU wide, and humans had barely inhabited more than a few million kilometers, and not even entire planets except Earth at that. So, Nil had turned to him and asked, “But why can’t we share?”  He had stared at her for a moment, then said, “Because it’s ours. We were here first, and we should decide who comes and stays here.”  Nil considered this. She had read many articles on human history and development, from Earth to the solar system. There were several that detailed what happened when the inhabitants of one place were met by new arrivals, none of it good. But none of that had happened when the Savreeni came to Mars. There were human settlements, but the one around Olympus Mons had fallen into decline. The human leadership had welcomed the refugees, as the Savreeni were called, and even helped them build up the colony. Later, humans began working for them and the colony expanded as more Savreeni arrived. By the time Nil had been born, three hundred years after they first arrived, nearly half of Mars was Savreeni land.  Of course, there had been clashes. Some humans had not taken kindly to the Savreeni, and some Savreeni did not want the humans in the colony they developed. But officially, there were no disagreements, and anyway, Nil’s parents were Savreeni and loved her, so she said, “But this is their home now, too. Where do you want them to go?”  “Somewhere else. There are other planets around other stars. Why did they have to come to this one?” he asked her.  Nil thought this was a strange question, and replied, “Because they can live here, like us. Their old world was like Earth, but they didn’t try to go to Earth because they saw that the planet had people on it and this one only had a few. Why do people on Earth want them to go? And they’ve brought good things for us, they’ve helped people on Mars and Earth so that they can build up the colonies.”  She pulled up hologram articles for him to see, but he waved them away with a hand and said, “They’re taking more and more of this planet, and their Curator, your father, has been collecting information on humans for a very long time now. What’s going to happen to us when they take over here and then try to take the Earth and the whole system? Where do we go?”  Nil had no answer to his question then, and she decided that she didn’t want to hear any more of it and left him. But she never told Tuva, and then the Retreat happened, and she woke up in the quiet house alone. It would be weeks with no answer, no calls to the house, no reports in the news feeds, which eventually stopped coming, and Nil was forced to break the firewalls to get information from the surrounding colonies. Then she learned that the humans had been fighting the Whistlers for weeks with no idea where they had come from or why, and that the Savreeni were gone.  Nil had tried to send multiple messages to Tuva all that time but received no response and his basement museum remained locked. It was another two weeks before Immanuel showed up, looking dirty and disheveled, his limp worse than usual, but also so happy to see her that he’d tried to hug her hologram.  The Curator’s house has a few more scorch marks than Nil remembers but it’s still standing. Nanny whistles sharply at the sight, which startles Dmitri so that he nearly drops for cover. He turns to look back at her, and Nil can just see his glare, but Nanny ignores him and says, “I’d heard about this place, didn’t expect it to be so . . . normal.”  “Tuva liked simple things,” says Nil.  There is no whistling over their comms and no sound of approaching vehicles from above or the nearby road. The two-story house is quiet as well, the only place in which some trees still have green leaves. Immanuel says, “I knew those trees were a good idea.”  He has his hands on his waist, inspecting his work, but Nil can’t see his face to be sure of the smile she thinks he’s wearing. The others are all in atmo-suits, even Dmitri, who had been released as soon as they landed. He pushes past Immanuel to step out onto the lawn, looking back at the rest of the colony. The fire from the Neuth’s attack has gone out in the thin atmosphere, but the Whistlers’ sleek silver ships swirl around the site.  “This better be worth it. Look how far away we are,” he says.  “You can always go back and let them kill you,” snaps Nanny.  He starts to reply, but she is already walking into the house, followed by her crew. His own men—and they were four men, including the Savreeni, Toman—get off the ship after him and stop to stare at Nil for a time. Then Toman says, “Back home, they would have locked them up for what they did to you.”  “What?” Nil asks.  “Let’s go, we’re wasting time,” says Dmitri, and he leads the way inside.  The inside of the house is exactly as Nil left it. Tuva was a minimalist, only essential furniture, and decoration, easily packed away at a button to make space when needed. Moltoch made sure that the pieces were extravagant, crafted with the finest materials traded from Earth. A few of Dmitri’s men cast appraising looks over the room and one of them says, “We shouldn’t leave this stuff to rot.”  “Not now,” says Dmitri.  The others have disappeared into the depths of the house, heading straight for the museum. The house is still fully powered, and Nil connects to the wireless. Her awareness expands and yet it feels like the house is enveloping her in an embrace. Alongside the power levels of the generators, the exact number of items in the storage and the state of their freshness, the exact number of Whistlers testing the periphery of the security shield, just one for now, searching for a weakness that it can exploit, she can finally feel the presence of the others. Nanny and her crew and Immanuel.  Immanuel still wears the band that allows him access to the house. It won’t let him and the others into the museum basement, but it does let her know that his sugar is low, he has too much painkiller in his system, probably for his knee, and that his heart rate is slowly rising. She marches off to meet him before he comes up again to look for her, and then nearly stumbles when she senses something else. There are more humans nearby, on the other side of the house from the Whistler, but underground. Had the Resistance caught up with them but followed quietly? Or was this another band of scavengers?  She gets into the lift, as it’s faster, and Dmitri and his men hurry in after her. One of them nudges the other but says to her, “You look nice.”  Toman says, “She’s a child.”  The man glances over at him and Dmitri says, “She’s the key to this whole business so if you mess with her, you’re not leaving this planet.”  The rest of the ride is silent. Nil slips out of the elevator before the doors open completely and runs over to where Yaa is attempting to break into the museum door.  “Stop! I’ll do it,” Nil says.  The woman steps back and Nil takes the keypad from her hand and enters the code she has known since Tuva entered it: the date he met Moltoch. The panel lights blue and the doors slide open, and then Nil says, “Someone is trying to get in here from the other side. They made a tunnel. But there’s another way out.”  Dmitri and his men walk past them into the room, and he says as he goes, “Who else you talk to before you come to me?”  “I should be asking you that,” says Nanny. “Is double-cross you trying to double-cross me?”  Another voice speaks up then, familiar, though Nil has not heard it in months, saying, “No, I am the one who should be asking the questions. Who are you, and why are you here?”  Nil runs past them into the room to find her father sitting at his desk, staring back at her.  0.8  Tuva looks, if possible, no different from how he did when Nil last saw him, and yet she almost does not recognize him. And then she looks again and catalogs the changes. He’s slimmer, younger, not a trace of sadness in his eyes, and he’s still wearing the earring Moltoch gave him. Then his image ripples slightly and she stops, frozen, stunned, but reality won’t let her deny it. This isn’t Tuva, at least not the Savreeni she had last seen before the Retreat, but an Upload, like her.  “Tuva-sim?” asks Immanuel, stepping into the room after them.  Tuva glances at him, then back at Nil and the others. She feels the processing, it is merely microseconds, and then he says, “I failed.”  “What?” asks Nanny. Then she turns to Nil and asks again, “What is he talking about?”  Nil cannot answer. Tuva speaks anyway, more to himself than anyone else, “No, they’re here but they can’t get in. There’s still time. They’ve taken over the external networks, but they can’t get in here.”  “What?” asks Nanny again.  Dmitri says, “He’s like the girl. He’s not really here, he can’t do anything. Didn’t she say that there’s another team coming in? Let’s get out of here.”  Dmitri walks to a nearby wall and asks, “Hey, girl, where’s the exit you talking about? I’m not seeing anything in here worth taking except the furniture.”  Nil replies without thinking, “The tunnel is in the back, in the storage room for the fragile artifacts.”  “Right,” says Dmitri. He turns and leads his men in search of it.  “Hey, this is my job,” says Nanny, heading after him.  Nil does not follow, and neither does Immanuel. Tuva watches the others go and turns to Nil and says, “It took me forever, but I know how to stop them. It won’t work for all of them, for that we need to go back to the source, but I can help you get rid of the ones on this planet. They’re all connected to the mainframe in the Community House. I need you to upload me to the mainframe.”  Immanuel asks, “Why didn’t you do it yourself? Isn’t this house connected?”  “No, I had to cut us off to stop them from finding me. And then I had to set up the shield to keep them from getting in when they noticed my feelers,” Tuva replies.  “Since when do you know how to do any of this?” asks Immanuel. “And why didn’t you try to do it before? Why did all of you just take off when the Whistlers arrived?”  Tuva glances at Nil and replies, “I didn’t leave. My body is somewhere in the street near the Community House. If I didn’t already hack into their system, I couldn’t have used the upload to escape.”  The lights flicker slightly as a flood of images sweep past Nil’s eyes. Footage from the several weeks Tuva spent in the basement museum. He spends most of the time first learning, then creating and discarding multiple programs to unravel a code from Whistler tech that had been among the Savreeni artifacts in the museum. He also teaches himself how to use some of the older weapons they have locked away. Some days he slips through the basement, using still-valid credentials to access the records in the Community House, making friendly conversation with fellow Savreeni packing up for the Retreat. All this time he ignores Moltoch’s many messages and calls and on one occasion blatantly ignores him in the street.  “At least tell me how Nil is doing!” Moltoch calls after him, and Nil is surprised to hear her former father mention her name. He had not called her by name once after the upload.  Tuva walks away. Long before they had even come to Mars, Tuva’s own mother, a Seer, had told him that he and Moltoch would not last more than a century. She had been off by a day, but no more than that. They had been having little disagreements in the weeks leading up to Nil’s death, as Moltoch devoted all his time to caring for the tiny child, and Tuva was locked away in his basement. Now Nil knows, and Moltoch never will, that Tuva had also spent that time trying to find a cure.  Nil meets Tuva’s gaze then and asks, “Why didn’t you tell him?”  “I couldn’t save you, but I can save this world, I can make it safe for them to get to the next star,” Tuva replies.  “What is he talking about?” asks Immanuel.  “I told you,” says Tuva. “I have a way to save us, but I need you to do what you did before. I need you to download me and get me into the mainframe of the Community House. I can do everything from there.”  The images are still playing before Nil’s eyes. She sees Tuva come to a discovery that stops him completely in his tracks for several days. He actually drops the Whistler artifact when he realizes what he’s holding and stands for several seconds staring at it in horror.  Tuva says, “We made them.”  “What?” says Immanuel.  “What?” says Nanny, coming back with the others.  Tuva keeps staring at Nil and replies, “The Whistlers. It’s the reason the Uploads weren’t allowed, why Moltoch was so mad at me no matter how much he loved you and wanted you back. Our people made the Whistlers and then we lost control of them, and they have haunted us across the stars ever since. They’re Uploads like Nil. Some of them were recently deceased, some were volunteers trying to stave off death, a few were AI as well, and then things went wrong. There had been fights from the beginning over the Uploads, laws were drawn up, there were protests and even sabotage to destroy them . . . and then they decided to fight back.”  “Blasphemy!” Toman spits.  Tuva turns to him and says, “I have spent my entire life studying the Whistlers, trying to preserve the artifacts of our people for future generations. If I am lying, then where did they come from? Why are they after us? Because they want our land? We left our world millennia ago. They want our bodies? We created them and we lost control of them and now they hunt and kill us. And they will never stop because they can replicate themselves and we banned our people from trying to fix it and chose to flee instead.”  The Whistler at the boundary tests it again, an enquiring message, requesting entry to the house. Tuva’s shield does not acknowledge it.  “If we download you, they’ll overrun the house. We might not be able to escape in time,” says Nil.  “Then you better be quick,” says Tuva. “But I’ve laid a trap in the system, so you better get Nil out of here first.”  “Door’s open,” says Xue-Li. “Someone should go move the ship so we can get out of here later. How do you want to do this?”  “Where’s the other group of humans?” asks Nanny.  Tuva replies, “They’ll break into your tunnel soon. You should try to get out ahead of them.”  “Okay, Xue-Li get the ship. Take two of these men with you and meet us at the Community House. Dmitri let’s go through the tunnel,” says Nanny.  Captain looks at her and asks, “What about them?”  Nanny looks over Nil and Immanuel and says, “They can do whatever, the tunnel’s open.”  She turns at once to go, dragging Dmitri by the arm. Xue-Li and the others have already left. Only Toman remains, staring at Tuva. Nil turns to Immanuel and says, “Do it. We have to hurry.”  “How do you know that what he’s saying is going to work?” asks Toman.  Nil looks at him and says, “He saved me, didn’t he?”  Immanuel walks over to Tuva’s desk. The drive is already in the processor. It is the twin to the one he had used to download Nil, which he had been given by the Resistance to get information on the Curator but had mysteriously lost his second day on the job. Of course, Tuva must have suspected him and stolen it.  Tuva smiles at him and says, “I will leave a command that will keep the system intact long enough for you to get into that tunnel. Don’t look back.”  Immanuel does not reply, taps the screen, and the command prompt is waiting for him. He touches it once, and the download begins and then ends in a matter of seconds. The Whistler tests the shield again and this time it gives. The lights flicker as the feelers spread through the system. Nil snatches the drive from the processor and starts running for the tunnel, Immanuel and Toman at her heels.  She feels the moment the Whistler accesses the processor and smacks against a wall. Tuva’s trap. A single message flashes through her mind, “Go!”  Toman pulls the door shut behind them. There’s a maglev shuttle waiting. There are similar shuttles all over the colony, but Tuva and Moltoch had a personal route. As they get to the door, one wall of the tunnel crumbles and they hear the shouts as the humans on the other side celebrate. Toman hops into the shuttle first, and Immanuel shoves Nil in, then squeezes in next to her.  The shuttle starts up as soon as the door closes, the route already entered. As they speed away from the house, it vanishes from her senses. Tuva’s trap has sprung, and Nil realizes with horror what it is, an electromagnetic pulse that wipes the entire system. Now the house will be open to anyone but useless to the Whistlers. There’s no going back.  0.9  Nanny greets them as they arrive at the Community House, some twenty minutes later. The shuttle had been programmed to stop before the station and when they get out Nanny says, “Whatever your father did has them riled up. Can’t use any channel on the radios. The screeching is enough to make your ears bleed.”  “Isn’t that why you brought that guy?” asks Immanuel.  “Yes, he’s setting charges as we speak,” says Nanny.  “Charges? We’re blowing our way in?” asks Immanuel, voice rising to nearly a squeak at the end.  “You have a better way? There’s only so many distractions Susie can give before the Martians get brave enough to intervene,” says Nanny. “And anyway, this is not that kind of explosive.”  Dmitri jogs over to them with a grin. “Doors are open. Now where’s the cache?”  “The Hall of Human and Savreeni Cooperation,” says Nil.  “Wasn’t that area open to the public?” asks Nanny.  “Yes, some of the artifacts on display are weapons, and there were more in the storage rooms in the back,” she replies.  “And the ammunition?” asks Dmitri.  “They’re always armed,” says Nil.  Nanny and her crew exchange looks, then she asks, “And where do you need to go for whatever it is that you’re doing? Is it going to bring the building down on our heads?”  “If the Whistlers have taken over the network, then we should go to the Hall of Connection. It’s where the mainframe is. I don’t think it will bring the building down but if you want to get out to sell your treasure you should do it quickly,” Nil replies.  “Well then, let’s get those weapons first,” says Dmitri.  There is nothing waiting for them on the other side of the underground entrance. Everything is reddish-pink, covered in a thin layer of Martian regolith, blown in from somewhere above. Nil takes the lead, tracing a path through the building she had made many times by camera feed from home. Through the entrance, down the stairs to the left, continuing along the curving corridors to an open doorway on the right. Nil turns into the doorway and is slapped back into the hall, alerts and warning messages flashing across her eyes, “Warning: major malfunction detected. Upper left shoulder failure of epidermis, silicon, and carbon fiber skeleton. Shutting down left arm to preserve function.”  She looks up to find Immanuel in front of her, hands hovering over the upper left side of her shoulder, eyes wide in horror. Something has shot her. In the background, the others are returning fire. Laser flashes and the flares of the projectile weapons as they try to clear a path for themselves. She pushes Immanuel out of her way, stands up, and says, “I don’t feel it. I can’t use my arm, but I don’t feel it.”  “Is there another way in?” calls Dmitri over his shoulder.  “There are stairs and a lift, but they are all protected by passes we don’t have. If we can get into one of the offices, maybe we can access and override the system,” she replies.  “Why didn’t you suggest that first?” Dmitri demands, turning to glare at her.  “Because the offices are all in the upper areas, in the opposite direction from where we want to be, and where most of the Whistlers have gathered anyway,” she replies.  “And besides,” adds Nanny, “I don’t think it matters anymore now that they know that we’re here.”  “So, you think we can just shoot our way down?” asks Dmitri. He turns to Nil, “What about that Savreeni hologram thing? Can’t we just insert him somewhere? Didn’t he set up a shield around your house?”  “That was different. He always had control of the house. To do any of that I need to get to the Hall of Connection,” she replies.  “We’re wasting time and ammunition,” says one of Dmitri’s men.  “Damn it!” Dmitri spits. To Nanny, he says, “I suggest we take the stairs. I might be able to disable the locks, and we can control some of the attacks.”  Suddenly, the speakers crackle to life through the building and high-pitched whistles pierce the air. Immanuel presses his palms over his ears while Dmitri, Nanny, and the others wince. Nil takes it for the warning that it is and runs for the stairs.  The doors burst open before she gets there and a Whistler steps out, guns blazing. Up close, they are terrifying creatures. They look like the Savreeni, humanoid in form, but with a carbon-fiber exoskeleton protruding from their flesh. Nil gets another warning message, a hit to her thigh, but she dives through the Whistler’s legs as Dmitri hits it in the chest with an explosive round. The shot tears its back open and it collapses.  Immanuel limp-runs over to her, reaches for her thigh, stops himself, and says, “If you get hit in anything major, you will die in this suit.”  “I’m going to the Hall of Connection,” says Nil. “If I don’t go, we’ll all die in here. You can stay with them and get the weapons. I can get hit.”  “Just because it doesn’t hurt doesn’t mean it’s not dangerous!” Immanuel says, nearly crying.  Nil looks past him to the others. Nanny nods and Yaa grabs Immanuel and drags him back. He turns to her, eyes wide, sputtering, “What? What are you doing?”  “Remember, you promised,” Nil says, keeping her eyes on Nanny.  Dmitri glances between them and says, “Toman, go with her.”  “No!” Immanuel protests.  “Toman can shoot. He’ll bring her back,” says Dmitri.  Nil puts on a smile for him, then turns and leads the way down the corridor with Toman at her heels. Moments later, she can hear the slight scuffle as the others drag Immanuel after them to the weapons store.  Toman is silent for most of the way, only tapping her shoulder every now and then so that he can go ahead to scout their direction. Nil lets him take the lead, even when he lingers to stare at video loops playing along the walls or images of former leaders of the Savreeni colony. The Savreeni were long-lived, some of them were still alive and had gone in the Retreat; Nil wonders if he knew them.  The Hall of Connection is in the lowest level of the Community House. Nil has followed staff heading to this place more than once, but never entered the room because that was where the feeds ended. She turns to Toman at the door and says, “We will have to break in. I don’t know the pass.”  Toman aims at the screen beside the door and fires. The screen explodes in sparks and flying splinters, but the doors do not open. Nil asks, “Why did you think that would work?”  Toman does not reply but shoots the doors where they meet in the middle, blasting a hole through one door. Then he reaches through, pulls, and pushes the door open. Nil waits as he goes inside but after almost a minute of silence, she follows and stops in her tracks.  A normal computer bank would be filled with servers, but this room is full of beds. And on each glass coffin-bed lays a Savreeni. They are of different ages, genders, ethnicities, all dressed in simple silver-gray pressure suits, and deeply asleep. But no, not asleep. They are all alive, eyes moving beneath their lids that corresponded to the images on the walls next to them. These are the processors managing the Community House and the colony.  “What?” says Toman.  Nil looks around and finds the one computer in the room, then inserts Tuva’s drive. As soon as he uploads, his hologram appears beside her, looks around, and says, “Yes, this is . . . yes.”  Toman turns to him, eyes wide, and says, “What is this? Did you do this?”  “No,” says Tuva, looking around again. “This is all part of it and the reason why the Whistlers keep finding us no matter where we run to. Why let these processors go to waste no matter how many times they turn on us? Why lose all this knowledge when the body dies?”  Toman is shaking his head, looking around wildly. Nil keeps her attention on the screens, looking for any sign of the other Whistlers noticing their intrusion. Tuva continues, “It was our greed that did this. We already live for so long, why should we try to get more time? Why shouldn’t we appreciate the time we are given? Why won’t we let go of those we’ve lost?” He turns to Nil and says, “My mother told Moltoch and me that we would only have a century and what did I do with most of that time? I went looking for other people’s artifacts. I did not spend enough time with you. But I can save you, and every—”  His hologram disappears and the screens freeze. And a moment later, the whistling starts, high and shrill. Toman covers his ears, squeezing his eyes shut, and drops to his knees.  A hand slaps the glass side of a bed nearby. When she looks, the others have done the same, all toward her. Then Tuva’s hologram reappears, but his gaze is distant, and the person who speaks next is not him, “Why are you doing this to us? Aren’t we what you wanted us to be?”  Toman looks up in alarm, then swings his gun around and starts shooting. Nil is not quick enough to get out of the way, he hits her in the stomach, chest, and clips her ear before she is free. The warning messages across her eyes are angry red, in full caps. Her body is not going to survive this. She hopes that Nanny and the others find enough money to cover the cost.  Toman is still firing. All his shots go clear through Tuva’s hologram, but they hit the computer. One finally hits something important, and Tuva vanishes. One of the Savreeni on the bed jerks and collapses, blood streaming from their nose and ears. On the screens, a few Whistlers fall out of the sky, disintegrating on impact and sending debris crashing through windows and walls. A section of the colony grid goes dark.  Toman stops firing, face red and wet with tears. Nil stares at the sparking computer and realizes what it means. Whatever Tuva’s plan was, it’s done now, stopped by a bullet.  The screens are still frozen, and the screeching had never stopped. She turns to Toman and asks, “Why did you do that? They already know we’re in here. They’ll kill the others, and all of this will be for nothing.”  Toman turns to her and says, “We have to kill them all.”  “We can’t! Not after what you just did! I don’t know how my father was going to do this!” Nil cries.  The alerts are still running before her eyes and most of her body has shut down. She won’t be able to leave this building without help, and if the Whistlers aren’t stopped, then that will be never. She looks again at the ruined computer. The machinery still runs. But of course, it does because it isn’t entirely machine. She turns to Toman and says, “Help me. Get me to the computer.”  “What?” he asks.  “I can’t move. Help me to the computer!” she snaps.  He stumbles across the floor to her, grasps her body by the arms, and drags her over to the computer. She cannot lift her arms anymore, and says, “Plug me in.”  “What? Where?” he asks, looking over her ruined body. “Oh no.”  “There’s a drive at the back of my neck, and there should be other ports on the computer. It’s still running so maybe it’s not too badly damaged. Connect me and let me do the rest. Guard the doors. If they get in before I’m finished, it’s over.”  Nil wonders for a moment if she should have said something for Immanuel. And then she connects to the system.  As she abandons the broken, restrictive shell of her borrowed body, Nil wonders how no one had considered the idea before. Humanity has been at war with itself almost from the beginning, why should anywhere else in the galaxy be any different?  The angry warning messages give way to codes, commands, and requests. Should they keep the lift support system in this chamber running? Yes. Should they freeze all lifts throughout the facility? Only the broken ones. Should they allow the Whistlers access to the facility’s power? No, but the command is ignored. Where is the Whistler, or was it more than one, who spoke to her through the mouths of the Savreeni and Tuva? No response. Would she like to see the progress of the intruders in the Hall of Human and Savreeni Cooperation? Yes, but deny access to Whistlers. If the command is fully obeyed, Nil does not know, but she does see that the pirates have made quick work of their booty. And Immanuel? He is nowhere to be found.  No, there he is. Somehow, Immanuel has slipped past Nanny and the others and is making his way down to the Hall of Connection. And there are Whistlers following him. No!  Nil reaches for the Community House’s security system. Alarms go off throughout the building. A camera in the room shows Toman holding his ears. He has not harmed the Savreeni in the beds, and they have made no further move to attack, but all their mouths are open, screaming. The Whistlers are furious at her intrusion.  They surge at her through the network, screaming commands to lock her out of the parts of the system they have already taken over. Nil lets chaos loose. She seals doors ahead of the approaching Whistlers, switches on the fire suppressant systems, and commands the computers to begin dumping files and shut down. Maintenance drones stream out of their ports to clean the building. She awakens repairs bots and sets them to repairing the damaged dome. They start up sluggish, and it takes a few attempts, but then they are jetting off throughout the colony.  A request draws her attention: file name bRYN corrupted, program paused, recover program? Nil summons the file and it comes to her in broken lines of code. Yes, Nil commands. Seconds pass, and then the reply: file name bRYN corrupted, unable to recover, repair program? Tuva had uploaded himself, then transformed his code into a virus. The Savreeni processors and the Whistlers they sustain have already started attacking the program, eating up the damaged codes and forcing it into shut down. Nil can stop it, but she will have to replace the missing code with her own.  Immanuel finally makes it to the Hall of Connection. She sees him come through the door but doesn’t have the means to project a hologram, so instead she says through the speakers, which turn out to be the mouths of the Savreeni, “I’m sorry. The drive got damaged. I have to finish Tuva’s work.”  “Do you even know what he wanted to do?” demands Immanuel. He rushes to the first bed, seemingly not even slightly disturbed to hear her voice.  Her father’s solution is simple but devastating. A computer virus that once uploaded would hack the Whistlers’ network and obliterate the system. Like the electromagnetic bomb he had set up in the house, this would destroy everything connected to it, including her. But Nil has already died once, and though she doesn’t remember it, she’s not afraid to do it again. And she cannot say any of this to Immanuel.  Instead, while she repairs Tuva’s drive and allows the virus program full access to the network, she says, “I think I know what kind of body I want to get.”  “W-what?” asks Immanuel. His brow furrows in his confusion, and he stands with his mouth open. “What are you talking about?”  “I gave it a lot of thought and, well, I can’t get back the body I had,” says Nil. “It couldn’t keep me no matter what they tried, and it’s long gone anyway. And when I was the house, I could be everywhere at once, but I couldn’t leave, and that was terrible. I was so happy that you got me out of there that I didn’t really care where we were going, even if it was the wrong direction. I thought if I got a new body, one that you liked, instead of living in the drive, then I could walk with you forever. It turns out that this new body can’t keep me either.”  “Nil, what are you talking about?” asks Immanuel. He walks away from the bed to go to the computer.  Nil watches his wide, worried eyes as he stares into the camera. She says, “But if I could choose a new body, I wouldn’t mind one a lot like the one I had before. Because it got me here to you.”  “Nil . . . ” says Immanuel.  The virus moves rapidly, tearing through the network, replicating as it spread, seizing control, and shredding everything its wake. Nil watches the camera feeds glitch, then the Whistlers shudder. The Savreeni on the beds convulse and fall silent. Toman screams in alarm.  “Nil, what are you doing?” cries Immanuel.  Nil wishes she had a body again to hold his hand, but she’s barely holding on as the virus spreads. The chaos in the facility transforms as the Whistlers catch on and try to cut her off or get out of the system. They wind up shooting each other all over the building, and then the city, and then, surprisingly, into space where their ships chase the Savreeni’s Retreat. Across the universe, a voice that sounds like Moltoch says, “Brunilda-sa?”  She watches them explode like fireworks and says, “Beautiful.”  “Nil!” Immanuel screams.  The images begin to fade from her vision as the system starts to shut down. As her connections die, pathways shriveling, sparks cooling to embers, she focuses all her attention at Immanuel in the camera and says, “Thank you for taking me with you. You don’t know what even that little time means to me. I hope at least that you and your family can be safe, and you can find a way to live with the Savreeni who didn’t leave.”  “Oh Nil,” says Immanuel. “I just wanted you to live.”  “But I did,” she says, “everyday with you I did. Don’t worry about me. I’m just a program now, eventually I was going to be obsolete. I wisissshhhhhhh we could have morrre ti-time but you have to let this ‘me’ go.” The virus finds her and tears into her mercilessly, there’s no pain but a spreading nothingness. Staring at Immanuel through the camera as she had for so many months, she says, “Tuuuuuuva was riiiiight . . . heann;naiodiafhasifiua . . . raih . . . ”  1.0  Immanuel had once asked Nil what it was like when he “put her to bed,” as they had decided to call shutting down her program.  Nil, who had never thought about it before but remembered sleep, had told him that it was similar but different. Where his dreams are snatches of things he had experienced during the day or whatever the chemical cocktail in his brain decides to cook up for the night, hers are like a blink. She has no need to rest, so there is no difference between one state and the next. This time, like all the others, is no different.  “Hi,” says Immanuel, smiling at her.  Nil is looking up at him from a hard surface. She can feel the softness of the fabric under her fingertips, wind coming through a window, and the pressure of something on her other hand. She turns, and Moltoch is looking at her with wet eyes, a soft smile on his face. He says, “I heard your voice, I-I had to come back Brunilda-sa.”  Immanuel chatters on, “It took so long before anyone even thought about checking the bot’s memory. It was so badly damaged, it shut down to protect itself. I told them that we would have better luck finding the cargo ship, but they thought they might have wiped the system looking for spyware after the raid. Lucky for us, Moltoch brought back a technician, though our folks already did most of the work. Anyway, hello again.”  They’re in her old bedroom at the Curator’s house. The graffiti she drew all those years ago are on the wall directly across from her. Her new body, she finds when she looks down at herself, is as brown as her old one, aged up for the decade that passed between the old her and this new one. She does not remember calling for Moltoch, but she is happy to see him. She smiles and replies, “Hi.” Shari Paul is a speculative fiction writer from Trinidad and Tobago. A clerk by day, Shari writes adventures in strange new worlds by night. Shari is published in Fiyah and The Dark, with reprints in Il Buio and Podcastle. Shari has BA in Literatures in English, and was awarded a Creative Writing prize for Fiction at the University of the West Indies, where she is now writing for an MFA in Creative Writing.", "text": "13780 words, novelette\nBetween Zero and One There is Infinity\n0.1\nNil knows at once that she is no longer on the cargo vessel.\nImmanuel is kneeling on the floor across from her, eyes wide, face flushed, glancing frantically at someone nearby she cannot see. That stops her for a moment, she used to have access to everywhere at once, from all angles. She turns without thinking about it, then stops again to glance back at Immanuel, stunned, and stops again when she realizes what it means. She has a body.\nOne head, a pair of ears, eyes, one nose, lips with a functional tongue, a flexible neck, torso, shoulders, arms, a pair of elbows, wrists, hands, ten fingers, breasts, hips, vagina, thighs, knees, shins, ankles, ten toes. She turns her head and hears the light swish of hair shifting against her clothes. She puts her hands in and draws out a pair of blue-black locs, jangling the tiny ornaments woven in. She had seen a model like this once, searching a catalog when Immanuel had fallen asleep without putting her into hibernation: the “Rasta Empress,” it had been called. A sexbot. She looks up at Immanuel again and wiggles the toes at the end of the feet stretched before her. Then she sits up.\n“Captain, it’s awake,” says someone.\nNil turns her head to the speaker as Immanuel snarls, “Her name is Nil, and I told you, she’s not an AI.”\nThere are two women standing at the door to the garage that they are all in. The first is short, slim, and dark-skinned, with a shaved head, nose and lip rings, and tattoos along both arms. They gleam in the low light: flowers and birds and words. She meets Nil’s gaze and does not look away. The second woman is only a little lighter-skinned than the first, with a curvier build, her hair in a thick Afro. Both are dressed in workmen’s overalls and pressure suits. Neither are smiling.\n“What happened to the pirates?” asks Nil.\n“They are the pirates,” Immanuel replies.\nThe second woman scowls but the first laughs and says, “Yes. You can call me Nanny, and this is Yaa. Your name is . . . Nil?”\n“Brunilda,” says Nil. “My fathers said it was the name I had when they found me.”\nThe two women exchange a look and Nanny asks, “Where are you from?”\n“Olympus Mons, the Martian Territories,” Nil replies. She turns her head again, barely thinking of it, and looks around. There are four small spacecraft docked in the cavernous garage bay and a fifth angled toward the door. Immanuel’s attempt to escape, probably.\n“What are you going to do with us?” asks Nil.\n“Your friend says that he is part of the Earthbound Resistance,” Nanny replies. “How did you two meet? What are you doing all the way out here?”\n“He found me when the Resistance sent him to spy on my fathers. They were Savreeni. Moltoch was the Curator of Human Artifacts and Archivist of Savreeni Records, and Tuva was an archaeologist,” says Nil.\nThe women turn to Immanuel, who scowls and says, “They mined our resources under the cover of archaeologist and curator. She was already like this when I met them. She says her body died when she was seven and they preserved her in the house. When the . . . Whistlers, showed up, they just left her there. I downloaded her from the mainframe in the safe room and decided to head for the Safe Zone. Mars is . . . there was nothing for us in the Olympus Mons settlement.”\nNanny nods at this, but Yaa asks, “You said that you were heading for the Resistance? That ship was heading to the outer colonies, not even close to the Safe Zone.”\nAt this, Nil turns to Immanuel. He meets her gaze, swallows, and says, “I can’t take her to the Resistance. They’d tear her apart looking for intel on the Savreeni.”\nNil feels a drop in her chest, a sensation like falling, and her brain tells her it is shock, “But you said that I could stay with you . . . ”\nImmanuel breathes out, short and sharp, and says, “I couldn’t hand you to them, you don’t understand.”\nNil cycles through the conversations they have had since he first uploaded her in his bunk on the cargo ship and asks, “Were you just going to leave me there? Or were you running away too?”\nImmanuel turns to glare up at the two women, but replies to Nil, “There’s another planet around another star that Earth sent an interstellar ship to more than a hundred years ago. We know they made it because they started picking up signals from their tech a few decades before the Savreeni showed up. They called it Theia, and there are no Savreeni or Whistlers there. You would be safe.”\n“You’re a coward,” Yaa spits, glaring at him.\nImmanuel lifts his chin and replies, “You can call me that if you want, but I’m not going to let anyone hurt Nil . . . not even my people.”\nNanny smiles at him and says, “Well that’s out of your hands now, isn’t it?”\nNil wonders if she should be afraid.\n0.2\nThe pirates’ ship, Neuth, is a former military cruiser they stole years ago and retrofitted in the cloud tops of Venus, the pirate haven of the solar system. It’s also where they’re heading now, right past the ongoing war between the remaining Savreeni and Whistlers and United Earth Armies. Space is big, Immanuel had once explained to Nil, so big and so dark that it is impossible to see everything passing by. Also, Venus is on the other side of the sun from the Earth and Mars at this phase in its orbit, so no one will see their approach anyway.\nThey were less than three million kilometers from the inner edge of the Asteroid Belt when the pirates intercepted their cargo ship, after traveling steadily toward it for nearly a month. It had taken Yaa two days to find Immanuel and then more than a week to get Nil’s drive and upload her to a spare sexbot they had retrieved in an earlier raid.\n“Don’t worry, we cleaned her thoroughly before we even put her in our storage. Thought we would sell her back on Venus. Older model, but still popular,” Xue-Li, Nil’s new roommate, explains. Nil’s new body wears a knit top with bikini underneath, cargo pants, combat boots, and copious jewelry. It is not the most practical outfit, but Nil has no need for a pressure suit. “Lucky for you.”\nXue-Li has chin-length hair and a kind smile. She was a soldier once, and now she helps Nanny raid pirate-hunting military ships and otherwise spends most of her nights with Yaa, so Nil has the room to herself. Nil spends most of the time lying on the floor getting used to the feeling of being confined and yet free. She refuses to ask after Immanuel, who she last saw in the garage bay. Xue-Li says that he has been put to work until they get to Venus. Maybe someone there will be willing to take him back out to the colonies or even the Safe Zone. Nil has already decided that she is staying with the pirates. At least they do not lie about what they intend to do with her.\n“When the Savreeni and your fathers abandoned the Martian territories, they left a lot of shit behind. Shit that we can use. We want everything that you can tell us about where that shit is. Payment for the body. We could have sold it for a good price. People really like that model,” said Nanny after they had left the garage and assembled in the main mess hall.\nImmanuel has been trying to explain the concept of money to Nil from the first day they met, when she said “Hello” and startled him as he sat checking his pay on the back porch of her fathers’ house. She had calculated for a moment based on the cost of similar model at the last price she saw and said, “I want a share.”\nYaa had lifted an eyebrow. Xue-Li burst out laughing, loud and long. A few of the other women—and they are all women, twenty of them, save one, in this crew—mock the captain and protested Nil’s response. Nanny, smiling slightly, had asked, “What about Immanuel?”\n“He needs his own share, but you can negotiate that with him,” Nil had replied. “I want enough to pay for a new custom body and maintenance after. I will also need to cover the cost of shelter.”\n“Oh, okay then. Deal,” said Nanny.\nAfter that talk, Nil and Immanuel had been dispatched to different parts of the ship. There is an internal network on the ship, mostly for communication or playing music that sometimes leads to fights over said music, but Nil does not connect to it. Instead, she lies down on the floor and listens. Nanny’s method of interrogation was a conversation, nothing at all like what Nil has seen with Immanuel in the many movies they watched on the cargo ship. It leaves Nil feeling drained, as if Nanny has drawn out parts of her with her words. It makes her miss the quiet of the abandoned house, even with the Whistlers’ intermittent whines drawing closer, and for the first time in months, she thinks of her fathers.\nTuva and Moltoch adopted Nil when she was three years old, from a crumbling orphanage in a poor human colony that had been ravaged by yet another disease outbreak. Her parents were long dead, and Nil never quite recovered from that first illness by the time her body died. There might have been DNA, some tangible piece of her somewhere in the house, but after there had been no time to look and Immanuel was on a deadline. But Nil can go still go wherever she wants in this body, and it would last longer. She can stay with the pirates even, Nanny has promised, and make a good life patrolling the solar system. Or she can try for the Resistance that Immanuel was running away from. See if they really will tear her apart to get another kind of treasure. The possibilities are endless.\nOne week away from Venus, Immanuel comes to visit. Nil is in her usual place now that the planet has appeared on the horizon, an observation deck that doubles as the ship’s common room. No one bothers her here; the human crew play games or movies among themselves while the two gynoids take turns charging in their recessed ports. Nil is mildly surprised to discover that they did put Immanuel to use because his hands still have traces of grime around the fingernails when he settles in beside her.\n“I wasn’t just going to put you on the ship when we got to the Asteroid Belt,” he begins without preamble. “I would never . . . after what happened to you, I was not going to make you do anything that you did not want to. I realize now that I didn’t have all the information I needed when I went to play ‘rebel spy’ at your fathers’ house.”\nNil looks at him. Immanuel up close is taller and thinner than the video cameras suggested. He walks with a slight limp due to the brace on his left leg—an old injury, the accident that killed his parents when he was a boy—and he has a trace of a rolling accent from his childhood in Scotland.\n“Where would I go without you?” asks Nil. “I want to be out there; I’ve wanted to be out of that house long before you arrived but all I knew was everything I’d read. I don’t know how to . . . ” she trails off and turns back to the window. Outside the endless black is speckled with tiny pinpricks of light and just ahead a glowing, pearlescent ball, the pirate planet, Venus. The sun, huge and bright, is behind them.\nImmanuel reaches for her hands, and she lets him touch them, marveling at the pressure of the hold. This is the first contact they have ever actually made and because she wants to squeeze back, she does, and she catches a tiny smile at his lips. He says, “I was going to give you the choice to come with me, you know. And if you wanted to go to Theia, I would have made sure you were settled on a good ship. I . . . the Resistance is also taking care of my little sister, and my aunt and her family are working with them, have been for years. I’m not leaving without her, or them.”\nThis is the first Immanuel has mentioned of family. In all the months they have known each other now, he has spent most of the time telling Nil about the world and very little about himself. Nil pulls her hands out of his grasp and asks, “You have a sister?”\n“Isla,” he replies, smiling softly. “She’s about your age . . . or well, the age you should be if your information is correct. And my aunt, Caitlin, and her husband, Farouk. They live on Mars too, in Viking Colony I. The Resistance recruited them because they knew my aunt’s job put her into contact with high-ranking Savreeni looking for Terran artifacts to decorate their villas. I think Isla would like you.”\n“I had no one,” Nil says, looking down at her hands, still fascinated by them. “I remember my fathers would take me everywhere when I was little but then my body died, and then they barely spoke to each other after. When you came, Tuva had just come back after being away for nearly a year. He used to carry me everywhere and then suddenly he would not even speak to me, or he would fight with Moltoch.”\nImmanuel says nothing for a time after this, and they sit in silence. Immanuel is probably on a break, but Nil has no skills and so has no job. Nil suspects this is really because Yaa or Nanny are afraid of her damaging the body she promised to return to them once she gets one of her own but cannot be sure.\nFinally, Immanuel says, “You have me, even if you are not happy with me right now, and you have every right to be, I’m not going to leave you alone. Whatever you decide to do.”\n“What if I decide to stay with them or go to the Resistance?” asks Nil at once.\nImmanuel offers a wry smile and says, “I’m with the Resistance. It would be just like going back to give them my final report.”\n0.3\nThe sky above the cloud tops of Venus is yellow and rose gold, never-ending twilight. The pirates’ floating colony is a former research station, decommissioned shortly after the Savreeni arrived. It looks like someone had sewn at least eight hot air balloons together under an octagonal platform on which a glass-walled multilevel tent with retractable lead shields had been erected. There are several ships docked around it on all sides, and a series of zeppelins anchored at various distances, linked to the colony by lengths of nanofiber cables. This is the floating city of Saraniya.\nSusie, the cook, a tall blond with a full beard and waist-length hair, stands with Nil to watch the descent. They tell her, “Welcome to the Pirate Snow Globe. The refuge of those who didn’t want to live under the Savreeni, couldn’t go to Earth, and aren’t welcome anywhere else. Thankfully for our forebearers, this place was just sitting here, forgotten. Good thing too, since the Whistlers showed up. They don’t care about it because we don’t have a lot of Savreeni here.”\nImmanuel turns to look at them, brows furrowed, and asks, “There are Savreeni here?”\nSusie lifts an eyebrow at him and replies, “Yes. Some of the Savreeni didn’t want to live under them either, others were escaping war. Not everyone involved in an invasion ends up well off.”\n“But they’re still invaders,” Immanuel says.\nSusie glances at Nil before replying, “Please remember that you’re just a guest here.”\nNanny lets the rest of the crew leave before she leads Nil and Immanuel off the ship, flanked by Yaa and Xue-Li. The station they step into is vast but packed with people hurrying about. Immanuel sniffs hopefully toward food carts scattered around the main floor, but Nanny marches them past without a word. They take an escalator up three flights, which gives Nil a view of much of the station: the docks and food court on the lowest levels, living quarters and shopping on the second, and administration on the third. There are even more levels above, which Xue-Li helpfully explains are recreation and entertainment spaces, medical and educational facilities, also, a prison.\nImmanuel opens his mouth to say something, but Yaa cuts a look at him, and he wrinkles his nose and remains silent.\nNanny leads them to a blue door in a section of wall that looks no different from the others they pass, though it is at the end of a long corridor they took at least two turns right and one left to get to. The door is opened by a tall, dark-skinned man with long, curly hair, a short goatee, and rectangular tech glasses. He is also not wearing a pressure suit, though most people they pass on the station are. To Nanny he says, “What trouble is this you bring for me here? That boy don’t look like no Resistance fighter and is this a prostitute?”\n“She’s seventeen,” Immanuel hisses, glaring at him.\n“A baby hooker?” asks the man, with a raised eyebrow.\nNil says, “I died when I was seven and my Savreeni fathers uploaded my brain to their house. Immanuel saved me when they left me behind in the Retreat and this is the only body Nanny could give me. Who are you?”\nThe man’s eyes go wide, but then he grins and says, “Okay, Baby Hooker, you’re not the first Savreeni adoptee I’ve met. Xue-Li there is one. Hell, you is not even the first Upload. What makes you so special?”\nNanny, behind them, replies, “Easy there, Dmitri. One of her fathers was the Curator.”\nDmitri stops smiling. Nil stares back. He steps closer and Immanuel tugs her away. Dmitri notes the movement with a nod and says, “The Curator, huh? That was a big one, used to be talking to all them Earth leaders like they grew up together. He and all went in the Retreat?”\n“The Curator is the Savreeni. Where they go, he must go,” Nil replies.\nDmitri looks at Immanuel again and asks, “I take it enough of the house is still intact that Nanny here thinks it worth the risk of running into Whistlers to recover whatever we can get our hands on?”\n“The panic room was intact when we left and it’s made of reinforced materials to protect all the stuff they kept in there,” says Immanuel.\nDmitri stares at Nil for a beat then looks around them. There is no one else in this section of the station. He says, “Let’s take this inside. The last thing we need is someone overhearing this and thinking I’m actually considering this suicide mission.”\n“Inside” looks like a larger version of Immanuel’s room back on the cargo ship. Everything folds away until needed, leaving only spare pieces of furniture and a screen wall playing the highlights of various sports. Dmitri goes to a touchscreen beside the door and a long, low table rises from the center of the floor. He takes the seat at one end and Nanny goes to the other, smirking at him. Immanuel settles beside Nil facing the door, while Yaa and Xi-Lue sit facing them. Dmitri says, “Does anyone want anything to drink? A charging port for the gynoid?”\n“No,” says Immanuel, as Nanny replies, “That won’t be necessary.”\nThere is a pause, and Dmitri smiles and says, “I assure you I would not have attempted an upload.”\n“We’re pirates discussing treasure and she is the map. I’ll risk offending you for my peace of mind,” says Nanny.\nDmitri laughs at that, loud and long, before turning to Nil and saying, “She has a point. Once word gets out about you, it’s best you stay away from the station’s systems as much as you can.” He stops, clears his throat, and says, “Now, tell me about this treasure in the middle of Whistler territory.”\n0.4\nThe Whistlers are nothing like the Savreeni, or so Nil has been told. The first Nil had ever heard of them, she was still alive, and six years old. Moltoch had dressed her for a dinner party in which Tuva spent most of the evening scowling, annoyed at being separated from the artifacts in his office. Nil did not mind. When he was upset, Tuva would let her crawl all over him.\nCaba, the Monitor, his fifth glass of wine in hand, announced it at the table, “The interference I picked up, it’s not background radiation disturbed by a gravitational wave.”\nNil had not understood at the time why the table suddenly fell silent. No one spoke, nor even moved. Nil glanced up at Tuva, and he tightened his grip around her tiny waist. Caba had snorted, then scoffed at them and said, “Why are you so shocked? You all knew it was only a matter of time before they found us. We still have plenty of time to find somewhere else to go or try to end it once and for all. I vote for the latter, by the way, I’m tired of running.”\n“How much time do we have?” asked Moltoch, glancing over at Nil and Tuva.\n“Decades, probably, a century if we’re lucky. That is, if they don’t get a boost from going around one of the bigger stars. Procyon is what the humans call that one? Yeah, cuts the time in half, easy,” he replied, and refilled his glass. “Then it’s just a few years.”\nThe Whistlers went around Tau Ceti instead, but by the time the Monitors had figured this out, Nil had become a part of the house and her fathers had broken up. Tuva kept the house, while Moltoch went off to join his family on Ganymede. He had left almost everything behind in the process: human and Savreeni artifacts, art, an extensive library that contained all they had learned of the solar system and Mars, and, most important for the pirates, Nil guesses, maps of the lava tubes and tunnels that had been modified to facilitate habitation of the Red Planet.\nAs to what the Whistlers look like, their capabilities, their weaknesses, the reason they chase the Savreeni through the galaxy, that Nil does not know. When she tells Dmitri this, he asks, “Do you know what a pirate is?”\nNil glances over at Nanny, then Immanuel, who nods, and she replies, “A thief.”\nNanny snorts at this, as do the others, but Dmitri smiles and corrects, “An entrepreneur. There is a demand for a product in limited supply, or impossible to acquire in the normal way. People like me can get the product, we ain’t afraid to use any means available to us, and our customers are willing to pay whatever we ask, no questions asked.”\n“That’s one way of looking at it,” says Nanny.\n“Don’t act like you’re any different,” says Dmitri, glaring at her.\nShe shrugs and rolls her eyes, then turns her attention out the window.\nTo Nil, Dmitri says, “The war with the Savreeni and the Whistlers haven’t reach Earth or we here on Venus, yet, but that don’t mean it won’t. The Whistlers hard to kill, everybody know that. All you hear before you dead is the whistling of them talking to each other. But the Savreeni have been fighting them long time and they can kill them. Which means that the Savreeni have weapons that can take them out, and there are people on Earth who would be very interested in getting their hands on that.”\n“People like the Resistance,” says Immanuel.\n“What do you care?” asks Dmitri, lifting an eyebrow.\n“I have people with the Resistance,” says Immanuel, meeting his gaze directly.\nDmitri scoffs and says, “Take it easy, you should be glad I trying to help out a situation then.”\n“If the Savreeni can kill the Whistlers and we can’t, and because they have been fighting them all the time, the Whistlers haven’t come to Earth, why should we try to get in the middle of that?” asks Immanuel. “I know no one likes the Savreeni, but they have been helping us since they got here. You know these weapons aren’t going to be used against the Whistlers alone.”\n“Whose side are you on?” asks Nanny.\n“My own,” says Immanuel. “And Nil’s. When I went back to them after the Retreat . . . I’d told them about Nil before because that was what I had been sent to do, give them info on the Curator and his family. They didn’t care that most of the Savreeni had left, they wanted me to guide them back in there so they can ‘see what they can use and what they can sell.’ I asked them why, because with most of the Savreeni gone, the ones who remained couldn’t do anything to anybody. And then they started talking about issues in their own countries and settlements that they could help with the Savreeni technology. We don’t even have anything like Nil, they’ve tried but no one here has figured it out yet. They would tear her up trying to figure out how she works, or they would try to turn her into a weapon. I won’t let them happen.”\nDmitri looks between the two of them for a moment, and says, “I don’t care about that. It cost me a lot just to find out what exactly the Curators and them used to do. Olympus Mons is the largest community the Savreeni had on Mars before the Whistlers showed up. Even just a fragment from that collection is worth trillions, but the books and weapons are priceless—by the way, they didn’t upload anything like that to the girl, right?”\nImmanuel’s eyes widen in alarm, but Nanny answers for him, “No. You know that would have wiped out everything else and made her a full AI. Everything you want is still in that room and the girl just tell you the room intact.”\n“The weapons wouldn’t be in there,” says Dmitri.\n“No, they aren’t,” Nil confirms. “But the Cache was under the Community House.”\nOnce again, all eyes go to her. She shrugs, her new favorite thing about having a body, and says, “It’s a magma chamber, and they reinforced it. If I was going to hide anything, it would be there.”\nDmitri looks back to Nanny and says, “I can give you fifty million for the girl.”\n“No!” says Immanuel, at once, slamming a fist down onto the table. He winces a moment later.\nDmitri just smirks and says, “Don’t worry, this is a group project. We’ll need at least three crews just to get to Mars in the first place. Another two for security and two more for the labor. But we won’t have that. One crew, maybe a few more people than the ones already in this room and absolutely no guarantees that we’re going to get out alive.”\n“We also can’t let the Resistance find out about this, unless you want them to cut out the middleman,” says Immanuel. “They sent me to get information, if they know about her, they won’t need you.”\n“Do we have an agreement?” Dmitri asks Nanny.\nNanny looks over at Nil, who stares back at her. It takes her a moment to realize that Nanny wants her approval. She nods and Nanny says, “Yes, we do.”\n0.5\nThere’s no real nighttime on Saraniya. They had been invited to stay with their new business partner, but Nanny had refused, insisting that it was much less suspicious for them to take beds at one of the several pod hotels on the station. And so Nil sits on the floor near Immanuel’s pod in the mixed dorm as he calls the family he never told her he had.\n“Hey, Auntie. How are you guys?”\nThe woman who replies sounds young, her voice bright and clear as she says, “Good to see you’re not dead. Where have you been for the past few?”\nImmanuel clears his throat and says, “Working my passage home. Told you that I got hired onto a new ship. The crew’s good to me. You don’t have to give me that look, I’m not lying.”\n“You shouldn’t have to do this. I wish you hadn’t signed up for this.”\n“But I did,” says Immanuel.\nThere is a sigh on the other end and then the woman asks, “You told me that you were trying to get a friend out. Did you?”\nImmanuel glances over at Nil and replies, “Yes. They’re doing better than I expected. They probably don’t even need my help anymore.”\n“Well, that’s good,” says his aunt. “Please let them know that they’re free to stay with us for as long as they need.”\nNil lets the invitation wash over her for a moment before looking away from him altogether. He had not been trying to take her to their house. Nil stands and checks the power levels on her body: battery ninety-three percent, all systems operating at full capacity. As she moves to go, Immanuel looks up and asks, “Where are you going? What are you doing?”\n“Just outside. I won’t get lost,” she replies.\nHe rises, ready to follow, and she repeats, “Nanny’s crew is all over this station. No one’s going to let anything happen to me.”\nHe stares at her for a few beats and says, “Please return in an hour. You shouldn’t use up too much energy until we get back on the ship.”\nShe gives him her best approximation of a smile and walks out of the pod room.\nThe shutters around the station have been closed, sealing out the planet’s long daylight for the next several hours so the humans within can continue to have some measure of a circadian rhythm. But the activity within seems to have increased. As Nil makes her way through the open promenade, she nearly collides with several groups of people, human and actual Savreeni speaking a variety of languages and dialects, gathering around food stalls and kiosks selling miscellaneous goods and services. There are charging ports for handhelds and gynoids like her. She thinks she spies another “Rasta Empress,” though this one is wearing a jacket over her net top.\nShe stops for a while near one of the food stalls. She hasn’t needed food in a decade, her new body detects the scent of salt, turmeric, geera, a variety of meats, artificial beef, chicken, and fish, and cooking oil used too long. The next stall has more chicken and oil smells, but also sweet doughs, vegetables. Savreeni food carried similar scents and over the centuries they had adapted styles from the human settlements. She considers getting a snack for Immanuel, then remembers that she doesn’t have any money.\nOn the other side of the station from the food stalls are a series of brightly lit booths advertising card and slot games. There are at least two bars, above one of which is a screen playing a light aircraft race going on somewhere else on the planet. Someone says, “They’re not catching Morningstar, that girl flies like a bird.”\nNil wanders past all this watching the people. Parents and their children, couples and triples holding hands, groups sitting together drinking or talking or eating. The maintenance staff are all AI, so people either step around her, mistaking her for one, or give her speculative looks if they don’t. There are more screens on the walls, more races, but also news reports, digi-dramas, talent competitions, and one documentary on the history of humans on Mars. Nil pauses before this one—the images suggest that they’re going to discuss the arrival of the Savreeni—when a woman steps into her line of sight and says, “You must be new here. Did you come with Nanny’s ship?”\nNil steps back, blinking at the woman, immediately searching the station’s database for the woman’s face and ID. Tall, slim, curly brown hair, blue eyes; she’s a pilot, captain of a light ship called Morningstar. Nil asks, “Shouldn’t you be racing?”\n“That was earlier. What’s your name?” asks the woman.\nNil looks down at herself. She hasn’t changed her gynoid’s clothing, so she looks like any other model. So why is the woman speaking to her?\nShe says, “I don’t have what you’re looking for. I need to go back; my people are waiting for me.”\nThe woman slings a heavy arm around Nil’s shoulders and says, “Did you two think you could just run away from the Resistance?”\n“What Resistance? Resistance to what?” asks Nil, looking around at the other people for any sign of Nanny’s crew.\nThe woman starts leading her away, toward the berths where the ships are docked. If Nil gets on one of those ships, she knows she will never see Immanuel again. She uses all the strength she has access to in her artificial body and pushes into the woman’s side, sending her sprawling. The woman cries out as she falls, surprised, almost colliding with a kiosk, people scatter, shocked, clearing a path, and Nil runs.\nTwo large men step into her path, arms folded. A moment later, their eyes go wide, and they unfold their arms and hold them up in surrender. Xue-Li and Yaa stand behind them, guns trained at the back of their heads. Nanny swivels ’round from a nearby stall and says, “You’ve wandered too far from home, little rabbit. Go back before the wolves catch you.”\nNil drops her head, trying to make herself invisible and small, and walks away as quickly as she can, directly back to the pod hotel. Immanuel is already packing his bag when she enters, and says, “Nanny sent me a message. We have to get back on the ship. We’re leaving immediately.”\nNil pauses in the doorway and says, “They were waiting for us. How did they know?”\n“They didn’t, probably not. Nanny’s crew wouldn’t talk so it’s probably that they were waiting around hoping I would show up somewhere. Let’s go,” says Immanuel.\nHe leads the way out, and they’re greeted by Nanny. She takes the lead without a word, and they make their way back to the ship. Activity in the station carries on as if it hadn’t been interrupted by Nil’s walking tour. When they get back on board, Nanny says, “They’re not going to let us leave just like this. Go to your cabin and don’t come out unless we let you or the ship is breaking up.”\n“Are you going to try to ram your way out?” asks Immanuel, eyes wide.\n“If we have to,” says Nanny. “Now go.”\nNil goes directly to her cabin and closes the door in Immanuel’s face when he makes to follow her. Then she lies down on the floor listening to the ship. Her room is completely sealed shut. There are pictures of Xue-Li and Yaa all over the wall, and in some of them Xue-Li is in her old military uniform. Only one has a picture of her Savreeni adoptive parents, both at least a foot shorter and several shades darker than her, so they must have been descendants of one of the tropical lands of the Savreeni home planet.\nThe ship shudders and swoops around her. Nil slides slightly on the floor but doesn’t get up. There is nothing but silence again for a time, and then Nanny’s voice comes on over the PA, “We’re clear. Rendezvous with our friend in twelve hours.”\nSo, Nil thinks, still lying on the floor, that was the Resistance.\n0.6\nThey approach Mars as they had Venus, sunward and radio silent. The retrofit on the ship makes it appear no different from the literal billions of asteroids, comets, and other space junk orbiting the yellow star at the center of the system. Nil spends her days watching the rust red planet grow bigger from the observation deck. She had not seen Mars when they left, and the pictures she’d come across over the years barely did justice.\nPart of the desert planet is covered in a growing dust storm, engulfing everything in its path in featureless clouds that would hang around for several months. The rest is pockmarked with the remnants of centuries of terraforming projects, above- and underground colonies, and the last devastating war. On the nightside, the dust clouds glow with flickering lights like flames as the remaining colonies’ solar-powered power stations struggle through the storm. The Olympus Mons Savreeni colony is the brightest of them all. None of the humans have ever figured out the secret of their power source, and with the Whistlers roaming about, claiming the entire region around for hundreds of kilometers, no one is willing to try.\n“The Savreeni would have picked us up by now but the Whistlers haven’t. They’re going to when we try to land though,” Nanny says to Dmitri.\nDmitri sips from a pack of rum, brewed from aeroponic sugarcane, and says, “Yes, but if your pilot is as good as you say they are, we should be underground before they get there.”\nTheir destination is the Community House, the central administration building of the Savreeni colony. The colony, like most Martian settlements, is mostly underground, with the surface buildings under a dome, arranged in a series of rings leading to a central park. The Community House takes up the last ring, and in another life had been surrounded by lush greenery, trees transplanted from Earth in previous lifetimes and kept alive by underground water that was spread as mist through the dome every morning. Now, even the dome overhead is broken, so that their smaller, though heavily armed shuttle slips in through a paneless hexagon and descends quickly to the dusty, frozen ruin.\nImmanuel glances over at Nil and says, “It wasn’t like this.”\nNil does not know but nods.\nYaa at the controls with Xue-Li, says, “Mars is ruthless.”\nDmitri wants to go for the weapons directly, even though Nil and Immanuel both tell him that the Whistlers have overrun the place. Nanny hired him for his weapons and mercenary skills, after all, and though small, their shuttle is heavily armed.\nThe moment they enter the atmosphere over the Savreeni colony, the whistling starts. It’s a high-pitched screech that ripples through the speakers in a series of alternating tones like whale sounds put through an electronic filter. It grates at even Nil’s ears and Dmitri curses.\nImmanuel tightens his grip on his seat in the main deck and says, “We should have gone to Nil’s house. There weren’t any Whistlers around when we left.”\n“Shut up boy!” snaps Dmitri, a moment before something slams into the right side of the ship and sends them skating sideways through the air.\n“Oh no!” cries Xue-Li.\n“Brace for impact!” Yaa yells, just as the shuttle’s rear clips the side of a building. The shuttle swings away in the other direction. Immanuel grabs for Nil’s hand, but Xue-Li and Yaa are experienced pilots and quickly right the ship.\nNil reaches for the ship’s onboard diagnostics but there is no connection to let her through. Instead, her ears pick up a cacophony of alarms and rapid-fire messages over the speakers. Extensive damage to the right side and left rear of the ship. Fuel intact. Electronics damaged on the right side, cargo door damaged, unable to open, and there was briefly a fire. There are people in the cargo bay, Venusian pirates, including one Savreeni refugee who Dmitri had hired. Nil cannot pick up any vitals from anyone on board, even with Immanuel still holding her, and the ship does not supply them.\n“We’re going to the Curator’s house! Change of plans!” Nanny commands.\n“We right over the Community House!” Dmitri protests.\n“And if we stay here, we will die!” Nanny says. Then she turns to Immanuel, “Take us to the Curator. Where is their house? We can make our way back another way.”\n“This is nonsense!” Dmitri yells.\n“Yaa! Make sure this man don’t interfere,” says Nanny.\n“Yes ma’am,” Yaa replies.\n“What?” asks Dmitri, a moment before a series of metal bars curve over his chest and hands. “Nanny, girl, what you doing? Is double-cross you double-crossing me?”\nNanny ignores him, turning to Immanuel and asks again, “Where’s the Curator’s house?”\n“At the foot of Olympus Mons, the north side. You can’t miss it, it’s the only house there,” he says.\n“Xue-Li, you heard that?” asks Nanny.\n“Already setting the course. It’s going to be bumpy though, there’s a lot of them on our tail,” Xue-Li replies.\n“That’s alright,” Nanny replies, then she reaches for one of her earrings and says, “Susie, a distraction please.”\nNil does not hear whatever the cook says in return, but moments later there is a deafening explosion, the shockwave of which rattles the entire ship.\nImmanuel turns to Nanny in alarm, eyes wide, and says, “What are you doing? It’s not just Whistlers on this planet.”\n“Do you want to get off this planet alive or not?” she asks.\nImmanuel does not reply.\n0.7\nOne afternoon, without prompting, Immanuel confessed to being a spy for the Earthbound Resistance. Nil, who had never come across any such thing in any of her web-surfing around Mars’ Internet, had asked, “What’s that?”\nThe Retreat was still weeks away, so Tuva was at work in his basement museum, which he barely left these days except to eat, rest, and pay Immanuel’s wages. He never walked around the grounds anymore, so Nil had no idea why he kept the groundskeeper. As far as they knew at the time, the boy was an immigrant alone on Mars, with no one back on Earth waiting for him and no other prospects in the colony. At Nil’s question, Immanuel had just stared at her for a moment and then replied, “There are people on Earth and in this colony who have been working to get the Savreeni out. We were here before they arrived, this is our solar system, and they just came in and took over a planet. We can’t just let them do that. Humans have been trying to set up colonies all over this system for almost a thousand years now. We don’t have room for anyone else. And what if others come?”\nA quick web search confirmed what he said about human settlements, extending even to icy Titan with its methane-powered colonies. But the solar system was more than seventy-nine AU wide, and humans had barely inhabited more than a few million kilometers, and not even entire planets except Earth at that. So, Nil had turned to him and asked, “But why can’t we share?”\nHe had stared at her for a moment, then said, “Because it’s ours. We were here first, and we should decide who comes and stays here.”\nNil considered this. She had read many articles on human history and development, from Earth to the solar system. There were several that detailed what happened when the inhabitants of one place were met by new arrivals, none of it good. But none of that had happened when the Savreeni came to Mars. There were human settlements, but the one around Olympus Mons had fallen into decline. The human leadership had welcomed the refugees, as the Savreeni were called, and even helped them build up the colony. Later, humans began working for them and the colony expanded as more Savreeni arrived. By the time Nil had been born, three hundred years after they first arrived, nearly half of Mars was Savreeni land.\nOf course, there had been clashes. Some humans had not taken kindly to the Savreeni, and some Savreeni did not want the humans in the colony they developed. But officially, there were no disagreements, and anyway, Nil’s parents were Savreeni and loved her, so she said, “But this is their home now, too. Where do you want them to go?”\n“Somewhere else. There are other planets around other stars. Why did they have to come to this one?” he asked her.\nNil thought this was a strange question, and replied, “Because they can live here, like us. Their old world was like Earth, but they didn’t try to go to Earth because they saw that the planet had people on it and this one only had a few. Why do people on Earth want them to go? And they’ve brought good things for us, they’ve helped people on Mars and Earth so that they can build up the colonies.”\nShe pulled up hologram articles for him to see, but he waved them away with a hand and said, “They’re taking more and more of this planet, and their Curator, your father, has been collecting information on humans for a very long time now. What’s going to happen to us when they take over here and then try to take the Earth and the whole system? Where do we go?”\nNil had no answer to his question then, and she decided that she didn’t want to hear any more of it and left him. But she never told Tuva, and then the Retreat happened, and she woke up in the quiet house alone. It would be weeks with no answer, no calls to the house, no reports in the news feeds, which eventually stopped coming, and Nil was forced to break the firewalls to get information from the surrounding colonies. Then she learned that the humans had been fighting the Whistlers for weeks with no idea where they had come from or why, and that the Savreeni were gone.\nNil had tried to send multiple messages to Tuva all that time but received no response and his basement museum remained locked. It was another two weeks before Immanuel showed up, looking dirty and disheveled, his limp worse than usual, but also so happy to see her that he’d tried to hug her hologram.\nThe Curator’s house has a few more scorch marks than Nil remembers but it’s still standing. Nanny whistles sharply at the sight, which startles Dmitri so that he nearly drops for cover. He turns to look back at her, and Nil can just see his glare, but Nanny ignores him and says, “I’d heard about this place, didn’t expect it to be so . . . normal.”\n“Tuva liked simple things,” says Nil.\nThere is no whistling over their comms and no sound of approaching vehicles from above or the nearby road. The two-story house is quiet as well, the only place in which some trees still have green leaves. Immanuel says, “I knew those trees were a good idea.”\nHe has his hands on his waist, inspecting his work, but Nil can’t see his face to be sure of the smile she thinks he’s wearing. The others are all in atmo-suits, even Dmitri, who had been released as soon as they landed. He pushes past Immanuel to step out onto the lawn, looking back at the rest of the colony. The fire from the Neuth’s attack has gone out in the thin atmosphere, but the Whistlers’ sleek silver ships swirl around the site.\n“This better be worth it. Look how far away we are,” he says.\n“You can always go back and let them kill you,” snaps Nanny.\nHe starts to reply, but she is already walking into the house, followed by her crew. His own men—and they were four men, including the Savreeni, Toman—get off the ship after him and stop to stare at Nil for a time. Then Toman says, “Back home, they would have locked them up for what they did to you.”\n“What?” Nil asks.\n“Let’s go, we’re wasting time,” says Dmitri, and he leads the way inside.\nThe inside of the house is exactly as Nil left it. Tuva was a minimalist, only essential furniture, and decoration, easily packed away at a button to make space when needed. Moltoch made sure that the pieces were extravagant, crafted with the finest materials traded from Earth. A few of Dmitri’s men cast appraising looks over the room and one of them says, “We shouldn’t leave this stuff to rot.”\n“Not now,” says Dmitri.\nThe others have disappeared into the depths of the house, heading straight for the museum. The house is still fully powered, and Nil connects to the wireless. Her awareness expands and yet it feels like the house is enveloping her in an embrace. Alongside the power levels of the generators, the exact number of items in the storage and the state of their freshness, the exact number of Whistlers testing the periphery of the security shield, just one for now, searching for a weakness that it can exploit, she can finally feel the presence of the others. Nanny and her crew and Immanuel.\nImmanuel still wears the band that allows him access to the house. It won’t let him and the others into the museum basement, but it does let her know that his sugar is low, he has too much painkiller in his system, probably for his knee, and that his heart rate is slowly rising. She marches off to meet him before he comes up again to look for her, and then nearly stumbles when she senses something else. There are more humans nearby, on the other side of the house from the Whistler, but underground. Had the Resistance caught up with them but followed quietly? Or was this another band of scavengers?\nShe gets into the lift, as it’s faster, and Dmitri and his men hurry in after her. One of them nudges the other but says to her, “You look nice.”\nToman says, “She’s a child.”\nThe man glances over at him and Dmitri says, “She’s the key to this whole business so if you mess with her, you’re not leaving this planet.”\nThe rest of the ride is silent. Nil slips out of the elevator before the doors open completely and runs over to where Yaa is attempting to break into the museum door.\n“Stop! I’ll do it,” Nil says.\nThe woman steps back and Nil takes the keypad from her hand and enters the code she has known since Tuva entered it: the date he met Moltoch. The panel lights blue and the doors slide open, and then Nil says, “Someone is trying to get in here from the other side. They made a tunnel. But there’s another way out.”\nDmitri and his men walk past them into the room, and he says as he goes, “Who else you talk to before you come to me?”\n“I should be asking you that,” says Nanny. “Is double-cross you trying to double-cross me?”\nAnother voice speaks up then, familiar, though Nil has not heard it in months, saying, “No, I am the one who should be asking the questions. Who are you, and why are you here?”\nNil runs past them into the room to find her father sitting at his desk, staring back at her.\n0.8\nTuva looks, if possible, no different from how he did when Nil last saw him, and yet she almost does not recognize him. And then she looks again and catalogs the changes. He’s slimmer, younger, not a trace of sadness in his eyes, and he’s still wearing the earring Moltoch gave him. Then his image ripples slightly and she stops, frozen, stunned, but reality won’t let her deny it. This isn’t Tuva, at least not the Savreeni she had last seen before the Retreat, but an Upload, like her.\n“Tuva-sim?” asks Immanuel, stepping into the room after them.\nTuva glances at him, then back at Nil and the others. She feels the processing, it is merely microseconds, and then he says, “I failed.”\n“What?” asks Nanny. Then she turns to Nil and asks again, “What is he talking about?”\nNil cannot answer. Tuva speaks anyway, more to himself than anyone else, “No, they’re here but they can’t get in. There’s still time. They’ve taken over the external networks, but they can’t get in here.”\n“What?” asks Nanny again.\nDmitri says, “He’s like the girl. He’s not really here, he can’t do anything. Didn’t she say that there’s another team coming in? Let’s get out of here.”\nDmitri walks to a nearby wall and asks, “Hey, girl, where’s the exit you talking about? I’m not seeing anything in here worth taking except the furniture.”\nNil replies without thinking, “The tunnel is in the back, in the storage room for the fragile artifacts.”\n“Right,” says Dmitri. He turns and leads his men in search of it.\n“Hey, this is my job,” says Nanny, heading after him.\nNil does not follow, and neither does Immanuel. Tuva watches the others go and turns to Nil and says, “It took me forever, but I know how to stop them. It won’t work for all of them, for that we need to go back to the source, but I can help you get rid of the ones on this planet. They’re all connected to the mainframe in the Community House. I need you to upload me to the mainframe.”\nImmanuel asks, “Why didn’t you do it yourself? Isn’t this house connected?”\n“No, I had to cut us off to stop them from finding me. And then I had to set up the shield to keep them from getting in when they noticed my feelers,” Tuva replies.\n“Since when do you know how to do any of this?” asks Immanuel. “And why didn’t you try to do it before? Why did all of you just take off when the Whistlers arrived?”\nTuva glances at Nil and replies, “I didn’t leave. My body is somewhere in the street near the Community House. If I didn’t already hack into their system, I couldn’t have used the upload to escape.”\nThe lights flicker slightly as a flood of images sweep past Nil’s eyes. Footage from the several weeks Tuva spent in the basement museum. He spends most of the time first learning, then creating and discarding multiple programs to unravel a code from Whistler tech that had been among the Savreeni artifacts in the museum. He also teaches himself how to use some of the older weapons they have locked away. Some days he slips through the basement, using still-valid credentials to access the records in the Community House, making friendly conversation with fellow Savreeni packing up for the Retreat. All this time he ignores Moltoch’s many messages and calls and on one occasion blatantly ignores him in the street.\n“At least tell me how Nil is doing!” Moltoch calls after him, and Nil is surprised to hear her former father mention her name. He had not called her by name once after the upload.\nTuva walks away. Long before they had even come to Mars, Tuva’s own mother, a Seer, had told him that he and Moltoch would not last more than a century. She had been off by a day, but no more than that. They had been having little disagreements in the weeks leading up to Nil’s death, as Moltoch devoted all his time to caring for the tiny child, and Tuva was locked away in his basement. Now Nil knows, and Moltoch never will, that Tuva had also spent that time trying to find a cure.\nNil meets Tuva’s gaze then and asks, “Why didn’t you tell him?”\n“I couldn’t save you, but I can save this world, I can make it safe for them to get to the next star,” Tuva replies.\n“What is he talking about?” asks Immanuel.\n“I told you,” says Tuva. “I have a way to save us, but I need you to do what you did before. I need you to download me and get me into the mainframe of the Community House. I can do everything from there.”\nThe images are still playing before Nil’s eyes. She sees Tuva come to a discovery that stops him completely in his tracks for several days. He actually drops the Whistler artifact when he realizes what he’s holding and stands for several seconds staring at it in horror.\nTuva says, “We made them.”\n“What?” says Immanuel.\n“What?” says Nanny, coming back with the others.\nTuva keeps staring at Nil and replies, “The Whistlers. It’s the reason the Uploads weren’t allowed, why Moltoch was so mad at me no matter how much he loved you and wanted you back. Our people made the Whistlers and then we lost control of them, and they have haunted us across the stars ever since. They’re Uploads like Nil. Some of them were recently deceased, some were volunteers trying to stave off death, a few were AI as well, and then things went wrong. There had been fights from the beginning over the Uploads, laws were drawn up, there were protests and even sabotage to destroy them . . . and then they decided to fight back.”\n“Blasphemy!” Toman spits.\nTuva turns to him and says, “I have spent my entire life studying the Whistlers, trying to preserve the artifacts of our people for future generations. If I am lying, then where did they come from? Why are they after us? Because they want our land? We left our world millennia ago. They want our bodies? We created them and we lost control of them and now they hunt and kill us. And they will never stop because they can replicate themselves and we banned our people from trying to fix it and chose to flee instead.”\nThe Whistler at the boundary tests it again, an enquiring message, requesting entry to the house. Tuva’s shield does not acknowledge it.\n“If we download you, they’ll overrun the house. We might not be able to escape in time,” says Nil.\n“Then you better be quick,” says Tuva. “But I’ve laid a trap in the system, so you better get Nil out of here first.”\n“Door’s open,” says Xue-Li. “Someone should go move the ship so we can get out of here later. How do you want to do this?”\n“Where’s the other group of humans?” asks Nanny.\nTuva replies, “They’ll break into your tunnel soon. You should try to get out ahead of them.”\n“Okay, Xue-Li get the ship. Take two of these men with you and meet us at the Community House. Dmitri let’s go through the tunnel,” says Nanny.\nCaptain looks at her and asks, “What about them?”\nNanny looks over Nil and Immanuel and says, “They can do whatever, the tunnel’s open.”\nShe turns at once to go, dragging Dmitri by the arm. Xue-Li and the others have already left. Only Toman remains, staring at Tuva. Nil turns to Immanuel and says, “Do it. We have to hurry.”\n“How do you know that what he’s saying is going to work?” asks Toman.\nNil looks at him and says, “He saved me, didn’t he?”\nImmanuel walks over to Tuva’s desk. The drive is already in the processor. It is the twin to the one he had used to download Nil, which he had been given by the Resistance to get information on the Curator but had mysteriously lost his second day on the job. Of course, Tuva must have suspected him and stolen it.\nTuva smiles at him and says, “I will leave a command that will keep the system intact long enough for you to get into that tunnel. Don’t look back.”\nImmanuel does not reply, taps the screen, and the command prompt is waiting for him. He touches it once, and the download begins and then ends in a matter of seconds. The Whistler tests the shield again and this time it gives. The lights flicker as the feelers spread through the system. Nil snatches the drive from the processor and starts running for the tunnel, Immanuel and Toman at her heels.\nShe feels the moment the Whistler accesses the processor and smacks against a wall. Tuva’s trap. A single message flashes through her mind, “Go!”\nToman pulls the door shut behind them. There’s a maglev shuttle waiting. There are similar shuttles all over the colony, but Tuva and Moltoch had a personal route. As they get to the door, one wall of the tunnel crumbles and they hear the shouts as the humans on the other side celebrate. Toman hops into the shuttle first, and Immanuel shoves Nil in, then squeezes in next to her.\nThe shuttle starts up as soon as the door closes, the route already entered. As they speed away from the house, it vanishes from her senses. Tuva’s trap has sprung, and Nil realizes with horror what it is, an electromagnetic pulse that wipes the entire system. Now the house will be open to anyone but useless to the Whistlers. There’s no going back.\n0.9\nNanny greets them as they arrive at the Community House, some twenty minutes later. The shuttle had been programmed to stop before the station and when they get out Nanny says, “Whatever your father did has them riled up. Can’t use any channel on the radios. The screeching is enough to make your ears bleed.”\n“Isn’t that why you brought that guy?” asks Immanuel.\n“Yes, he’s setting charges as we speak,” says Nanny.\n“Charges? We’re blowing our way in?” asks Immanuel, voice rising to nearly a squeak at the end.\n“You have a better way? There’s only so many distractions Susie can give before the Martians get brave enough to intervene,” says Nanny. “And anyway, this is not that kind of explosive.”\nDmitri jogs over to them with a grin. “Doors are open. Now where’s the cache?”\n“The Hall of Human and Savreeni Cooperation,” says Nil.\n“Wasn’t that area open to the public?” asks Nanny.\n“Yes, some of the artifacts on display are weapons, and there were more in the storage rooms in the back,” she replies.\n“And the ammunition?” asks Dmitri.\n“They’re always armed,” says Nil.\nNanny and her crew exchange looks, then she asks, “And where do you need to go for whatever it is that you’re doing? Is it going to bring the building down on our heads?”\n“If the Whistlers have taken over the network, then we should go to the Hall of Connection. It’s where the mainframe is. I don’t think it will bring the building down but if you want to get out to sell your treasure you should do it quickly,” Nil replies.\n“Well then, let’s get those weapons first,” says Dmitri.\nThere is nothing waiting for them on the other side of the underground entrance. Everything is reddish-pink, covered in a thin layer of Martian regolith, blown in from somewhere above. Nil takes the lead, tracing a path through the building she had made many times by camera feed from home. Through the entrance, down the stairs to the left, continuing along the curving corridors to an open doorway on the right. Nil turns into the doorway and is slapped back into the hall, alerts and warning messages flashing across her eyes, “Warning: major malfunction detected. Upper left shoulder failure of epidermis, silicon, and carbon fiber skeleton. Shutting down left arm to preserve function.”\nShe looks up to find Immanuel in front of her, hands hovering over the upper left side of her shoulder, eyes wide in horror. Something has shot her. In the background, the others are returning fire. Laser flashes and the flares of the projectile weapons as they try to clear a path for themselves. She pushes Immanuel out of her way, stands up, and says, “I don’t feel it. I can’t use my arm, but I don’t feel it.”\n“Is there another way in?” calls Dmitri over his shoulder.\n“There are stairs and a lift, but they are all protected by passes we don’t have. If we can get into one of the offices, maybe we can access and override the system,” she replies.\n“Why didn’t you suggest that first?” Dmitri demands, turning to glare at her.\n“Because the offices are all in the upper areas, in the opposite direction from where we want to be, and where most of the Whistlers have gathered anyway,” she replies.\n“And besides,” adds Nanny, “I don’t think it matters anymore now that they know that we’re here.”\n“So, you think we can just shoot our way down?” asks Dmitri. He turns to Nil, “What about that Savreeni hologram thing? Can’t we just insert him somewhere? Didn’t he set up a shield around your house?”\n“That was different. He always had control of the house. To do any of that I need to get to the Hall of Connection,” she replies.\n“We’re wasting time and ammunition,” says one of Dmitri’s men.\n“Damn it!” Dmitri spits. To Nanny, he says, “I suggest we take the stairs. I might be able to disable the locks, and we can control some of the attacks.”\nSuddenly, the speakers crackle to life through the building and high-pitched whistles pierce the air. Immanuel presses his palms over his ears while Dmitri, Nanny, and the others wince. Nil takes it for the warning that it is and runs for the stairs.\nThe doors burst open before she gets there and a Whistler steps out, guns blazing. Up close, they are terrifying creatures. They look like the Savreeni, humanoid in form, but with a carbon-fiber exoskeleton protruding from their flesh. Nil gets another warning message, a hit to her thigh, but she dives through the Whistler’s legs as Dmitri hits it in the chest with an explosive round. The shot tears its back open and it collapses.\nImmanuel limp-runs over to her, reaches for her thigh, stops himself, and says, “If you get hit in anything major, you will die in this suit.”\n“I’m going to the Hall of Connection,” says Nil. “If I don’t go, we’ll all die in here. You can stay with them and get the weapons. I can get hit.”\n“Just because it doesn’t hurt doesn’t mean it’s not dangerous!” Immanuel says, nearly crying.\nNil looks past him to the others. Nanny nods and Yaa grabs Immanuel and drags him back. He turns to her, eyes wide, sputtering, “What? What are you doing?”\n“Remember, you promised,” Nil says, keeping her eyes on Nanny.\nDmitri glances between them and says, “Toman, go with her.”\n“No!” Immanuel protests.\n“Toman can shoot. He’ll bring her back,” says Dmitri.\nNil puts on a smile for him, then turns and leads the way down the corridor with Toman at her heels. Moments later, she can hear the slight scuffle as the others drag Immanuel after them to the weapons store.\nToman is silent for most of the way, only tapping her shoulder every now and then so that he can go ahead to scout their direction. Nil lets him take the lead, even when he lingers to stare at video loops playing along the walls or images of former leaders of the Savreeni colony. The Savreeni were long-lived, some of them were still alive and had gone in the Retreat; Nil wonders if he knew them.\nThe Hall of Connection is in the lowest level of the Community House. Nil has followed staff heading to this place more than once, but never entered the room because that was where the feeds ended. She turns to Toman at the door and says, “We will have to break in. I don’t know the pass.”\nToman aims at the screen beside the door and fires. The screen explodes in sparks and flying splinters, but the doors do not open. Nil asks, “Why did you think that would work?”\nToman does not reply but shoots the doors where they meet in the middle, blasting a hole through one door. Then he reaches through, pulls, and pushes the door open. Nil waits as he goes inside but after almost a minute of silence, she follows and stops in her tracks.\nA normal computer bank would be filled with servers, but this room is full of beds. And on each glass coffin-bed lays a Savreeni. They are of different ages, genders, ethnicities, all dressed in simple silver-gray pressure suits, and deeply asleep. But no, not asleep. They are all alive, eyes moving beneath their lids that corresponded to the images on the walls next to them. These are the processors managing the Community House and the colony.\n“What?” says Toman.\nNil looks around and finds the one computer in the room, then inserts Tuva’s drive. As soon as he uploads, his hologram appears beside her, looks around, and says, “Yes, this is . . . yes.”\nToman turns to him, eyes wide, and says, “What is this? Did you do this?”\n“No,” says Tuva, looking around again. “This is all part of it and the reason why the Whistlers keep finding us no matter where we run to. Why let these processors go to waste no matter how many times they turn on us? Why lose all this knowledge when the body dies?”\nToman is shaking his head, looking around wildly. Nil keeps her attention on the screens, looking for any sign of the other Whistlers noticing their intrusion. Tuva continues, “It was our greed that did this. We already live for so long, why should we try to get more time? Why shouldn’t we appreciate the time we are given? Why won’t we let go of those we’ve lost?” He turns to Nil and says, “My mother told Moltoch and me that we would only have a century and what did I do with most of that time? I went looking for other people’s artifacts. I did not spend enough time with you. But I can save you, and every—”\nHis hologram disappears and the screens freeze. And a moment later, the whistling starts, high and shrill. Toman covers his ears, squeezing his eyes shut, and drops to his knees.\nA hand slaps the glass side of a bed nearby. When she looks, the others have done the same, all toward her. Then Tuva’s hologram reappears, but his gaze is distant, and the person who speaks next is not him, “Why are you doing this to us? Aren’t we what you wanted us to be?”\nToman looks up in alarm, then swings his gun around and starts shooting. Nil is not quick enough to get out of the way, he hits her in the stomach, chest, and clips her ear before she is free. The warning messages across her eyes are angry red, in full caps. Her body is not going to survive this. She hopes that Nanny and the others find enough money to cover the cost.\nToman is still firing. All his shots go clear through Tuva’s hologram, but they hit the computer. One finally hits something important, and Tuva vanishes. One of the Savreeni on the bed jerks and collapses, blood streaming from their nose and ears. On the screens, a few Whistlers fall out of the sky, disintegrating on impact and sending debris crashing through windows and walls. A section of the colony grid goes dark.\nToman stops firing, face red and wet with tears. Nil stares at the sparking computer and realizes what it means. Whatever Tuva’s plan was, it’s done now, stopped by a bullet.\nThe screens are still frozen, and the screeching had never stopped. She turns to Toman and asks, “Why did you do that? They already know we’re in here. They’ll kill the others, and all of this will be for nothing.”\nToman turns to her and says, “We have to kill them all.”\n“We can’t! Not after what you just did! I don’t know how my father was going to do this!” Nil cries.\nThe alerts are still running before her eyes and most of her body has shut down. She won’t be able to leave this building without help, and if the Whistlers aren’t stopped, then that will be never. She looks again at the ruined computer. The machinery still runs. But of course, it does because it isn’t entirely machine. She turns to Toman and says, “Help me. Get me to the computer.”\n“What?” he asks.\n“I can’t move. Help me to the computer!” she snaps.\nHe stumbles across the floor to her, grasps her body by the arms, and drags her over to the computer. She cannot lift her arms anymore, and says, “Plug me in.”\n“What? Where?” he asks, looking over her ruined body. “Oh no.”\n“There’s a drive at the back of my neck, and there should be other ports on the computer. It’s still running so maybe it’s not too badly damaged. Connect me and let me do the rest. Guard the doors. If they get in before I’m finished, it’s over.”\nNil wonders for a moment if she should have said something for Immanuel. And then she connects to the system.\nAs she abandons the broken, restrictive shell of her borrowed body, Nil wonders how no one had considered the idea before. Humanity has been at war with itself almost from the beginning, why should anywhere else in the galaxy be any different?\nThe angry warning messages give way to codes, commands, and requests. Should they keep the lift support system in this chamber running? Yes. Should they freeze all lifts throughout the facility? Only the broken ones. Should they allow the Whistlers access to the facility’s power? No, but the command is ignored. Where is the Whistler, or was it more than one, who spoke to her through the mouths of the Savreeni and Tuva? No response. Would she like to see the progress of the intruders in the Hall of Human and Savreeni Cooperation? Yes, but deny access to Whistlers. If the command is fully obeyed, Nil does not know, but she does see that the pirates have made quick work of their booty. And Immanuel? He is nowhere to be found.\nNo, there he is. Somehow, Immanuel has slipped past Nanny and the others and is making his way down to the Hall of Connection. And there are Whistlers following him. No!\nNil reaches for the Community House’s security system. Alarms go off throughout the building. A camera in the room shows Toman holding his ears. He has not harmed the Savreeni in the beds, and they have made no further move to attack, but all their mouths are open, screaming. The Whistlers are furious at her intrusion.\nThey surge at her through the network, screaming commands to lock her out of the parts of the system they have already taken over. Nil lets chaos loose. She seals doors ahead of the approaching Whistlers, switches on the fire suppressant systems, and commands the computers to begin dumping files and shut down. Maintenance drones stream out of their ports to clean the building. She awakens repairs bots and sets them to repairing the damaged dome. They start up sluggish, and it takes a few attempts, but then they are jetting off throughout the colony.\nA request draws her attention: file name bRYN corrupted, program paused, recover program? Nil summons the file and it comes to her in broken lines of code. Yes, Nil commands. Seconds pass, and then the reply: file name bRYN corrupted, unable to recover, repair program? Tuva had uploaded himself, then transformed his code into a virus. The Savreeni processors and the Whistlers they sustain have already started attacking the program, eating up the damaged codes and forcing it into shut down. Nil can stop it, but she will have to replace the missing code with her own.\nImmanuel finally makes it to the Hall of Connection. She sees him come through the door but doesn’t have the means to project a hologram, so instead she says through the speakers, which turn out to be the mouths of the Savreeni, “I’m sorry. The drive got damaged. I have to finish Tuva’s work.”\n“Do you even know what he wanted to do?” demands Immanuel. He rushes to the first bed, seemingly not even slightly disturbed to hear her voice.\nHer father’s solution is simple but devastating. A computer virus that once uploaded would hack the Whistlers’ network and obliterate the system. Like the electromagnetic bomb he had set up in the house, this would destroy everything connected to it, including her. But Nil has already died once, and though she doesn’t remember it, she’s not afraid to do it again. And she cannot say any of this to Immanuel.\nInstead, while she repairs Tuva’s drive and allows the virus program full access to the network, she says, “I think I know what kind of body I want to get.”\n“W-what?” asks Immanuel. His brow furrows in his confusion, and he stands with his mouth open. “What are you talking about?”\n“I gave it a lot of thought and, well, I can’t get back the body I had,” says Nil. “It couldn’t keep me no matter what they tried, and it’s long gone anyway. And when I was the house, I could be everywhere at once, but I couldn’t leave, and that was terrible. I was so happy that you got me out of there that I didn’t really care where we were going, even if it was the wrong direction. I thought if I got a new body, one that you liked, instead of living in the drive, then I could walk with you forever. It turns out that this new body can’t keep me either.”\n“Nil, what are you talking about?” asks Immanuel. He walks away from the bed to go to the computer.\nNil watches his wide, worried eyes as he stares into the camera. She says, “But if I could choose a new body, I wouldn’t mind one a lot like the one I had before. Because it got me here to you.”\n“Nil . . . ” says Immanuel.\nThe virus moves rapidly, tearing through the network, replicating as it spread, seizing control, and shredding everything its wake. Nil watches the camera feeds glitch, then the Whistlers shudder. The Savreeni on the beds convulse and fall silent. Toman screams in alarm.\n“Nil, what are you doing?” cries Immanuel.\nNil wishes she had a body again to hold his hand, but she’s barely holding on as the virus spreads. The chaos in the facility transforms as the Whistlers catch on and try to cut her off or get out of the system. They wind up shooting each other all over the building, and then the city, and then, surprisingly, into space where their ships chase the Savreeni’s Retreat. Across the universe, a voice that sounds like Moltoch says, “Brunilda-sa?”\nShe watches them explode like fireworks and says, “Beautiful.”\n“Nil!” Immanuel screams.\nThe images begin to fade from her vision as the system starts to shut down. As her connections die, pathways shriveling, sparks cooling to embers, she focuses all her attention at Immanuel in the camera and says, “Thank you for taking me with you. You don’t know what even that little time means to me. I hope at least that you and your family can be safe, and you can find a way to live with the Savreeni who didn’t leave.”\n“Oh Nil,” says Immanuel. “I just wanted you to live.”\n“But I did,” she says, “everyday with you I did. Don’t worry about me. I’m just a program now, eventually I was going to be obsolete. I wisissshhhhhhh we could have morrre ti-time but you have to let this ‘me’ go.” The virus finds her and tears into her mercilessly, there’s no pain but a spreading nothingness. Staring at Immanuel through the camera as she had for so many months, she says, “Tuuuuuuva was riiiiight . . . heann;naiodiafhasifiua . . . raih . . . ”\n1.0\nImmanuel had once asked Nil what it was like when he “put her to bed,” as they had decided to call shutting down her program.\nNil, who had never thought about it before but remembered sleep, had told him that it was similar but different. Where his dreams are snatches of things he had experienced during the day or whatever the chemical cocktail in his brain decides to cook up for the night, hers are like a blink. She has no need to rest, so there is no difference between one state and the next. This time, like all the others, is no different.\n“Hi,” says Immanuel, smiling at her.\nNil is looking up at him from a hard surface. She can feel the softness of the fabric under her fingertips, wind coming through a window, and the pressure of something on her other hand. She turns, and Moltoch is looking at her with wet eyes, a soft smile on his face. He says, “I heard your voice, I-I had to come back Brunilda-sa.”\nImmanuel chatters on, “It took so long before anyone even thought about checking the bot’s memory. It was so badly damaged, it shut down to protect itself. I told them that we would have better luck finding the cargo ship, but they thought they might have wiped the system looking for spyware after the raid. Lucky for us, Moltoch brought back a technician, though our folks already did most of the work. Anyway, hello again.”\nThey’re in her old bedroom at the Curator’s house. The graffiti she drew all those years ago are on the wall directly across from her. Her new body, she finds when she looks down at herself, is as brown as her old one, aged up for the decade that passed between the old her and this new one. She does not remember calling for Moltoch, but she is happy to see him. She smiles and replies, “Hi.”\nShari Paul is a speculative fiction writer from Trinidad and Tobago. A clerk by day, Shari writes adventures in strange new worlds by night. Shari is published in Fiyah and The Dark, with reprints in Il Buio and Podcastle. Shari has BA in Literatures in English, and was awarded a Creative Writing prize for Fiction at the University of the West Indies, where she is now writing for an MFA in Creative Writing.", "source": "https://clarkesworldmagazine.com/paul_11_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Between Zero and One There is Infinity by Shari Paul"}