{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Xia Jia; Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "03I1B/haISEujQAkSMRisCI4YC0=", "id": null, "license": null, "comments": "", "raw_text": "5920 words, short story  A Hundred Ghosts Parade Tonight  2013 Nominee: Science Fiction and Fantasy Translation Awards Short Form Awakening of Insects, the Third Solar Term:  Ghost Street is long but narrow, like an indigo ribbon. You can cross it in eleven steps, but to walk it from end to end takes a full hour.  At the western end is Lanruo Temple, now fallen into ruin. Inside the temple is a large garden full of fruit trees and vegetable patches, as well as a bamboo grove and a lotus pond. The pond has fish, shrimp, dojo loaches, and yellow snails. So supplied, I have food to eat all year.  It’s evening, and I’m sitting at the door to the main hall, reading a copy of Huainanzi, the Han Dynasty essay collection, when along comes Yan Chixia, the great hero, vanquisher of demons and destroyer of evil spirits. He’s carrying a basket on the crook of his elbow, the legs of his pants rolled all the way up, revealing calves caked with black mud. I can’t help but laugh at the sight.  My teacher, the Monk, hears me and walks out of the dark corner of the main hall, gears grinding, and hits me on the head with his ferule.  I hold my head in pain, staring at the Monk in anger. But his iron face is expressionless, just like the statues of buddhas in the main hall. I throw down the book and run outside, while the Monk pursues me, his joints clanking and creaking the whole time. They are so rusted that he moves as slow as a snail.  I stop in front of Yan, and I see that his basket contains several new bamboo shoots, freshly dug from the ground.  “I want to eat meat,” I say, tilting my face up to look at him. “Can you shoot some buntings with your slingshot for me?”  “Buntings are best eaten in the fall, when they’re fat,” says Yan. “Now is the time for them to breed chicks. If you shoot them, there won’t be buntings to eat next year.”  “Just one, pleaaaaase?” I grab onto his sleeve and act cute. But he shakes his head resolutely, handing me the basket. He takes off his conical sedge hat and wipes the sweat off his face.  I laugh again as I look at him. His face is as smooth as an egg, with just a few wisps of curled black hair like weeds that have been missed by the gardener. Legend has it that his hair and beard used to be very thick, but I’m always pulling a few strands out now and then as a game. After so many years, these are all the hairs he has left.  “You must have died of hunger in a previous life,” Yan says, cradling the back of my head in his large palm. “The whole garden is full of food for you. No one is here to fight you for it.”  I make a face at him and take the basket of food.  The rain has barely stopped; insects cry out from the wet earth. A few months from now, green grasshoppers will be jumping everywhere. You can catch them, string them along a stick, and roast them over the fire, dripping sweet-smelling fat into the flames.  As I picture this, my empty stomach growls as though filled with chittering insects already. I begin to run.  The golden light of the evening sun splatters over the slate slabs of the empty street, stretching my shadow into a long, long band.  I run back home, where Xiao Qian is combing her hair in the darkness. There are no mirrors in the house, so she always takes off her head and puts it on her knees to comb. Her hair looks like an ink-colored scroll, so long that the strands spread out to cover the whole room.  I sit quietly to the side until she’s done combing her hair, puts it up in a moon-shaped bun, and secures it with a pin made of dark wood inlaid with red coral beads. Then she lifts her head and re-attaches it to her neck, and asks me if it’s sitting straight. I don’t understand why Xiao Qian cares so much. Even if she just tied her head to her waist with a sash, everyone would still think she’s beautiful.  But I look, seriously, and nod. “Beautiful,” I say.  Actually, I can’t really see very well. Unlike the ghosts, I cannot see in the dark.  Xiao Qian is happy with my affirmation. She takes my basket and goes into the kitchen to cook. As I sit and work the bellows next to her, I tell her about my day. Just as I get to the part where the Monk hit me on the head with the ferule, Xiao Qian reaches out and lightly caresses my head where I was hit. Her hand is cold and pale, like a piece of jade.  “You need to study hard and respect your teacher,” Xiao Qian says. “Eventually you’ll leave here and make your way in the real world. You have to have some knowledge and real skills.”  Her voice is very soft, like cotton candy, and so the swelling on my head stops hurting.  Xiao Qian tells me that Yan Chixia found me on the steps of the temple when I was a baby. I cried and cried because I was so hungry. Yan Chixia was at his wit’s end when he finally stuffed a handful of creeping rockfoil into my mouth. I sucked on the juice from the grass and stopped crying.  No one knows who my real parents are.  Even back then, Ghost Street had been doing poorly. No tourists had been coming by for a while. That hasn’t changed. Xiao Qian tells me that it’s probably because people invented some other attraction, newer, fresher, and so they forgot about the old attractions. She’s seen similar things happen many times before.  Before she became a ghost, Xiao Qian tells me, she had lived a very full life. She had been married twice, gave birth to seven children, and raised them all.  And then her children got sick, one after another. In order to raise the money to pay the doctors, Xiao Qian sold herself off in pieces: teeth, eyes, breasts, heart, liver, lungs, bone marrow, and finally, her soul. Her soul was sold to Ghost Street, where it was sealed inside a female ghost’s body. Her children died anyway.  Now she has white skin and dark hair. The skin is light sensitive. If she’s in direct sunlight she’ll burn.  After he found me, Yan Chixia had walked up and down all of Ghost Street before he decided to give me to Xiao Qian to raise.  I’ve seen a picture of Xiao Qian back when she was alive. It was hidden in a corner of a drawer in her dresser. The woman in the picture had thick eyebrows, huge eyes, a wrinkled face—far uglier than the way Xiao Qian looks now. Still, I often see her cry as she looks at that picture. Her tears are a pale pink. When they fall against her white dress they soak into the fabric and spread, like blooming peach flowers.  Every ghost is full of stories from when they were alive. Their bodies have been cremated and the ashes mixed into the earth, but their stories still live on. During the day, when all of Ghost Street is asleep, the stories become dreams and circle under the shadows of the eaves, like swallows without nests. During those hours, only I’m around, walking in the street, and only I can see them and hear their buzzing song.  I’m the only living person on Ghost Street.  Xiao Qian says that I don’t belong here. When I grow up, I’ll leave.  The smell of good food fills the room. The insects in my stomach chitter even louder.  I eat dinner by myself: preserved pork with stir-fried bamboo shoots, shrimp-paste-flavored egg soup, and rice balls with chives, still hot in my hands. Xiao Qian sits and watches me. Ghosts don’t eat. None of the inhabitants of Ghost Street, not even Yan Chixia or the Monk, ever eat.  I bury my face in the bowl, eating as fast as I can. I wonder, after I leave, will I ever eat such delicious food again?  Major Heat, the Twelfth Solar Term:  After night falls, the world comes alive.  I go alone to the well in the back to get water. I turn the wheel and it squeaks, but the sound is different from usual. I look down into the well and see a long-haired ghost in a white dress sitting in the bucket.  I pull her up and out. Her wet hair covers her face, leaving only one eye to stare at me out of a gap.  “Ning, tonight is the Carnival. Aren’t you going?”  “I need to get water for Xiao Qian’s bath,” I answer. “After the bath we’ll go.”  She strokes my face lightly. “You are a foolish child.”  She has no legs, so she has to leave by crawling on her hands. I hear the sound of crawling, creeping all around me. Green will-o’-the-wisps flit around, like anxious fireflies. The air is filled with the fragrance of rotting flowers.  I go back to the dark bedroom and pour the water into the wooden bathtub. Xiao Qian undresses. I see a crimson bar code along her naked back, like a tiny snake. Bright white lights pulse under her skin.  “Why don’t you take a bath with me?” she asks.  I shake my head, but I’m not sure why. Xiao Qian sighs. “Come.” So I don’t refuse again.  We sit in the bathtub together. The cedar smells nice. Xiao Qian rubs my back with her cold, cold hands, humming lightly. Her voice is very beautiful. Legend has it that any man who heard her sing fell in love with her.  When I grow up, will I fall in love with Xiao Qian? I think and look at my small hands, the skin now wrinkled from the bath like wet wrapping paper.  After the bath, Xiao Qian combs my hair, and dresses me in a new shirt that she made for me. Then she sticks a bunch of copper coins, green and dull, into my pocket.  “Go have fun,” she says. “Remember not to eat too much!”  Outside, the street is lit with countless lanterns, so bright that I can no longer see the stars that fill the summer sky.  Demons, ghosts, all kinds of spirits come out of their ruined houses, out of cracks in walls, rotting closets, dry wells. Hand-in-hand, shoulder-by-shoulder, they parade up and down Ghost Street until the narrow street is filled.  I squeeze myself into the middle of the crowd, looking all around. The stores and kiosks along both sides of the street send forth all kinds of delicious smells, tickling my nose like butterflies. The vending ghosts see me and call for me, the only living person, to try their wares.  “Ning! Come here! Fresh sweet osmanthus cakes, still hot!”  “Sugar roasted chestnuts! Sweet smelling and sweeter tasting!”  “Fried dough, the best fried dough!”  “Long pig dumplings! Two long pig dumplings for one coin!”  “Ning, come eat a candy man. Fun to play and fun to eat!”  Of course the “long pig dumplings” are really just pork dumplings. The vendor says that just to attract the tourists and give them a thrill.  But I look around, and there are no tourists.  I eat everything I can get my hands on. Finally, I’m so full that I have to sit down by the side of the road to rest a bit. On the opposite side of the street is a temporary stage lit by a huge bright white paper lantern. Onstage, ghosts are performing: sword-swallowing, fire-breathing, turning a beautiful girl into a skeleton. I’m bored by these tricks. The really good show is still to come.  A yellow-skinned old ghost pushes a cart of masks in front of me.  “Ning, why don’t you pick a mask? I have everything: Ox-Head, Horse-Face, Black-Faced and White-Faced Wuchang, Asura, Yaksha, Rakshasa, Pixiu, and even Lei Gong, the Duke of Thunder.”  I spend a long time browsing, and finally settle on a Rakshasa mask with red hair and green eyes. The yellow-skinned old ghost thanks me as he takes my coin, dipping his head down until his back is bent like a bow.  I put the mask on and continue strutting down the street. Suddenly loud Carnival music fills the air, and all the ghosts stop and then shuffle to the sides of the street.  I turn around and see the parade coming down the middle of the street. In front are twenty one-foot tall green toads in two columns, striking gongs, thumping drums, strumming huqin, and blowing bamboo sheng. After them come twenty centipede spirits in black clothes, each holding varicolored lanterns and dancing complicated steps. Behind them are twenty snake spirits in yellow dresses, throwing confetti into the air. And there are more behind them but I can’t see so far.  Between the marching columns are two Cyclopes in white robes, each as tall as a three-story house. They carry a palanquin on their shoulders, and from within Xiao Qian’s song rolls out, each note as bright as a star in the sky, falling one by one onto my head.  Fireworks of all colors rise up: bright crimson, pale green, smoky purple, shimmering gold. I look up and feel as though I’m becoming lighter myself, floating into the sky.  As the parade passes from west to east, all the ghosts along the sides of the street join, singing and dancing. They’re heading for the old osmanthus tree at the eastern end of Ghost Street, whose trunk is so broad that three men stretching their arms out can barely surround it. A murder of crows lives there, each one capable of human speech. We call the tree Old Ghost Tree, and it is said to be in charge of all of Ghost Street. Whoever pleases it prospers; whoever goes against its wishes fails.  But I know that the parade will never get to the Old Ghost Tree.  When the parade is about half way down the street, the earth begins to shake and the slate slabs crack open. From the yawning gaps huge white bones crawl out, each as thick as the columns holding up Lanruo Temple. The bones slowly gather together and assemble into a giant skeleton, glinting like white porcelain in the moonlight. Now black mud springs forth from its feet and crawls up the skeleton, turning into flesh. Finally, a colossal Dark Yaksha stands before us, its single horn so large that it seems to pierce the night sky.  The two Cyclopes don’t even reach its calves.  The Dark Yaksha turns its huge head from side to side. This is a standard part of every Carnival. It is supposed to abduct a tourist. On nights when there are no tourists, it must go back under the earth, disappointed, to wait for the next opportunity.  Slowly, it turns its gaze on me, focusing on my presence. I pull off my mask and stare back. Its gaze feels hot, the eyes as red as burning coal.  Xiao Qian leans out from the palanquin, and her cry pierces the suddenly quiet night air: “Ning, run! Run!”  The wind lifts the corner of her dress, like a dark purple petal unfolding. Her face is like jade, with orange lights flowing underneath.  I turn and run as fast as I can. Behind me I hear the heavy footsteps of the Dark Yaksha. With every quaking, pounding step, shingles fall from houses on both sides like overripe fruits. I am now running like the wind, my bare feet striking the slate slabs lightly: pat, pat, pat. My heart pounds against my chest: thump, thump, thump. Along the entire frenzied Ghost Street, mine is the only living heart.  But both the ghosts and I know that I’m not in any real danger. A ghost can never hurt a real person. That’s one of the rules of the game.  I run towards the west, towards Lanruo Temple. If I can get to Yan Chixia before the Yaksha catches me, I’ll be safe. This is also part of the performance. Every Carnival, Yan puts on his battle gear and waits on the steps of the main hall.  As I approach, I cry out: “Help! Save me! Oh Hero Yan, save me!”  In the distance I hear his long ululating cry and see his figure leaping over the wall of the temple to land in the middle of the street. He holds in his left hand a Daoist charm: red character written against a yellow background. He reaches behind his back with his right hand and pulls out his sword, the Demon Slayer.  He stands tall and shouts into the night sky, “Brazen Demon! How dare you harm innocent people? I, Yan Chixia, will carry out justice today!”  But tonight, he forgot to wear his sedge hat. His egg-shaped face is exposed to the thousands of lanterns along Ghost Street, with just a few wisps of hair curled like question marks on a blank page. The silly sight is such a contrast against his serious mien that I start to laugh even as I’m running. And that makes me choke and can’t catch my breath so I fall against the cold slate surface of the street.  This moment is my best memory for the summer.  Cold Dew, the Seventeenth Solar Term:  A thin layer of clouds hides the moon. I’m crouching by the side of the lotus pond in Lanruo Temple. All I can see are the shadows cast by the lotus leaves, rising and falling slowly with the wind.  The night is as cold as the water. Insects hidden in the grass won’t stop singing.  The eggplants and string beans in the garden are ripe. They smell so good that I have a hard time resisting the temptation. All I can think about is to steal some under the cover of night. Maybe Yan Chixia was right: in a previous life I must have died of hunger.  So I wait, and wait. But I don’t hear Yan Chixia’s snores. Instead, I hear light footsteps cross the grassy path to stop in front of Yan Chixia’s cabin. The door opens, the steps go in. A moment later, the voices of a man and a woman drift out of the dark room: Yan Chixia and Xiao Qian.  Qian: “Why did you ask me to come?”  Yan: “You know what it’s about.”  Qian: “I can’t leave with you.”  Yan: “Why not?”  Qian: “A few more years. Ning is still so young.”  “Ning, Ning!” Yan’s voice grows louder. “I think you’ve been a ghost for too long.”  Qian sounds pitiful. “I raised Ning for so many years. How can I just get up and leave him?”  “You’re always telling me that Ning is still too young, always telling me to wait. Do you remember how many years it has been?”  “I can’t.”  “You sew a new set of clothes for him every year. How can you forget?” Yan chuckles, a cold sound. “I remember very clearly. The fruits and vegetables in this garden ripen like clockwork, once a year. I’ve seen them do it fifteen times. Fifteen! But has Ning’s appearance changed any since the year he turned seven? You still think he’s alive, he’s real?”  Xiao Qian remains silent for a moment. Then I hear her crying.  Yan sighs. “Don’t lie to yourself any more. He’s just like us, nothing more than a toy. Why are you so sad? He’s not worth it.”  Xiao Qian just keeps on crying.  Yan sighs again. “I should never have picked him up and brought him back.”  Xiao Qian whispers through the tears, “Where can we go if we leave Ghost Street?”  Yan has no answer.  The sound of Xiao Qian’s crying makes my heart feel constricted. Silently, I sneak away and leave the old temple through a hole in the wall.  The thin layer of clouds chooses this moment to part. The cold moonlight scatters itself against the slate slabs of the street, congealing into drops of glittering dew. My bare feet against the ground feel so cold that my whole body shivers.  A few stores are still open along Ghost Street. The vendors greet me enthusiastically, asking me to sample their green bean biscuits and sweet osmanthus cake. But I don’t want to. What’s the point? I’m just like them, maybe even less than them.  Every ghost used to be alive. Their fake, mechanical bodies host real souls. But I’m fake throughout, inside and outside. From the day I was born, made, I was fake. Every ghost has stories of when they were alive, but I don’t. Every ghost had a father, a mother, a family, memories of their love, but I don’t have any of that.  Xiao Qian once told me that Ghost Street’s decline came about because people, real people, found more exciting, newer toys. Maybe I am one of those toys: made with newer, better technology, until I could pass for the real thing. I can cry, laugh, eat, piss and shit, fall, feel pain, ooze blood, hear my own heartbeat, grow up from a simulacrum of a baby—except that my growth stops when I’m seven. I’ll never be a grown up.  Ghost Street was built to entertain the tourists, and all the ghosts were their toys. But I’m just a toy for Xiao Qian.  Pretending that the fake is real only makes the real seem fake.  I walk slowly toward the eastern end of the street, until I stop under the Old Ghost Tree. The sweet fragrance of osmanthus fills the foggy night air, cool and calming. Suddenly I want to climb into the tree. That way, no one will find me.  The Old Ghost Tree leans down with its branches to help me.  I sit, hidden among the dense branches, and feel calmer. The crows perch around me, their glass eyes showing hints of a dark red glow. One of them speaks: “Ning, this is a beautiful night. Why aren’t you at Lanruo Temple, stealing vegetables?”  The crow is asking a question to which it already knows the answer. The Old Ghost Tree knows everything that happens on Ghost Street. The crows are its eyes and ears.  “How can I know for sure,” I ask, “that I’m a real person?”  “You can chop off your head,” the crow answers. “A real person will die with his head cut off, but a ghost will not.”  “But what if I cut off my head and die? I’ll be no more.”  The crow laughs, the sound grating and unpleasant to listen to. Two more crows fly down, holding in their beaks antique bronze mirrors. Using the little moonlight that leaks through the leaves, I finally see myself in the mirrors: small face, dark hair, thin neck. I lift the hair off the back of my neck, and in the double reflections of the mirrors, I see a crimson bar code against the skin, like a tiny snake.  I remember Xiao Qian’s cool hands against my spine on that hot summer night. I think and think, until tears fall from my eyes.  Winter Solstice, the Twenty-Second Solar Term:  This winter has been both dry and cold, but I often hear the sound of thunder in the distance. Xiao Qian says that it’s the Thunder Calamity, which happens only once every thousand years.  The Thunder Calamity punishes demons and ghosts and lost spirits. Those who can escape it can live for another thousand years. Those who can’t will be burnt away until no trace is left of them.  I know perfectly well that there’s no such thing as a “Thunder Calamity” in this world. Xiao Qian has been a ghost for so long that she’s now gone a little crazy. She holds onto me with her cold hands, her face as pale as a sheet of paper. She says that to hide from the Calamity, a ghost must find a real person with a good heart to stay beside her. That way, just like how one wouldn’t throw a shoe at a mouse sitting beside an expensive vase, the Duke of Thunder will not strike the ghost.  Because of her fear, my plan to leave has been put on hold. In secret I’ve already prepared my luggage: a few stolen potatoes, a few old shirts. My body isn’t growing any more anyway, so these clothes will last me a long time. I didn’t take any of the old copper coins from Xiao Qian though. Perhaps the outside world does not use them.  I really want to leave Ghost Street. I don’t care where I go; I just want to see the world. Anywhere but here.  I want to know how real people live.  But still, I linger.  On Winter Solstice it snows. The snowflakes are tiny, like white sawdust. They melt as soon as they hit the ground. Only a very thin layer has accumulated by noon.  I walk alone along the street, bored. In past years I would go to Lanruo Temple to find Yan Chixia. We would knock an opening in the ice covering the lotus pond, and lower our jury-rigged fishing pole beneath the ice. Winter catfish are very fat and taste fantastic when roasted with garlic.  But I haven’t seen Yan Chixia in a long time. I wonder if his beard and hair have grown out a bit.  Thunder rumbles in the sky, closer, then further away, leaving only a buzzing sensation in my ears. I walk all the way to the Old Ghost Tree, climb up into its branches, and sit still. Snowflakes fall all around me but not on me. I feel calm and warm. I curl up and tuck my head under my arms, falling asleep like a bird.  In my dream, I see Ghost Street turning into a long, thin snake. The Old Ghost Tree is the head, Lanruo Temple the tail, the slate slabs the scales. On each scale is drawn the face of a little ghost, very delicate and beautiful.  But the snake continues to writhe as though in great pain. I watch carefully and see that a mass of termites and spiders is biting its tail, making a sound like silkworms feeding on mulberry leaves. With sharp mandibles and claws, they tear off the scales on the snake one by one, revealing the flesh underneath. The snake struggles silently, but disappears inch by inch into the maws of the insects. When its body is almost completely eaten, it finally makes a sharp cry, and turns its lonesome head towards me.  I see that its face is Xiao Qian’s.  I wake up. The cold wind rustles the leaves of the Old Ghost Tree. It’s too quiet around me. All the crows have disappeared to who knows where except one that is very old and ugly. It’s crouching in front of me, its beak dangling like the tip of a long mustache.  I shake it awake, anxious. It stares at me with two broken-glass eyes, croaking to me in its mechanical, flat voice, “Ning, why are you still here?”  “Where should I be?”  “Anywhere is good,” it says. “Ghost Street is finished. We’re all finished.”  I stick my head out of the leaves of the Old Ghost Tree. Under the slate-grey sky, I see the murder of crows circling over Lanruo Temple in the distance, cawing incessantly. I’ve never seen anything like this.  I jump down from the tree and run. As I run along the narrow street, I pass dark doors and windows. The cawing of the crows has awakened many of the ghosts, but they don’t dare to go outside, where there’s light. All they can do is to peek out from cracks in doors, like a bunch of crickets hiding under houses in winter.  The old walls of Lanruo Temple, long in need of repairs, have been pushed down. Many giant mechanical spiders made of steel are crawling all over the main hall, breaking off the dark red glass shingles and sculpted wooden molding, piece by piece, and throwing the pieces into the snow on the ground. They have flat bodies, blue-glowing eyes, and sharp mandibles, as ugly as you can imagine. From deep within their bodies comes a rumbling noise like thunder.  The crows swoop around them, picking up bits of broken shingles and bricks on the ground and dropping them on the spiders. But they are too weak and the spiders ignore them. The broken shingle pieces strike against the steel shells, making faint, hollow echoes.  The vegetable garden has been destroyed. All that remains are some mud and pale white roots. I see one of the Monk’s rusted arms sticking out of a pile of broken bricks.  I run through the garden, calling for Yan Chixia. He hears me and slowly walks out of his cabin. He’s still wearing his battle gear: sedge hat over his head, the sword Demon Slayer in his hand. I want to shout for him to fight the spiders, but somehow I can’t spit the words out. The words taste like bitter, astringent paste stuck in my throat.  Yan Chixia stares at me with his sad eyes. He comes over to hold my hands. His hands are as cold as Xiao Qian’s.  We stand together and watch as the great and beautiful main hall is torn apart bit by bit, collapses, turns into a pile of rubble: shingles, bricks, wood, and mud. Nothing is whole.  They’ve destroyed all of Lanruo Temple: the walls, the main hall, the garden, the lotus pond, the bamboo grove, and Yan Chixia’s cabin. The only thing left is a muddy ruin.  Now they’re moving onto the rest of Ghost Street. They pry up the slate slabs, flatten the broken houses along the sides of the street. The ghosts hiding in the houses are chased into the middle of the street. As they run, they scream and scream, while their skin slowly burns in the faint sunlight. There are no visible flames. But you can see the skin turning black in patches, and the smell of burning plastic is everywhere.  I fall into the snow. The smell of burning ghost skin makes me vomit. But there’s nothing in my stomach to throw up. So I cry during the breaks in the dry heaves.  So this is what the Thunder Calamity looks like.  The ghosts, their faces burned away, continue to cry and run and struggle in the snow. Their footprints criss-cross in the snow, like a child’s handwriting. I suddenly think of Xiao Qian, and so I start to run again.  Xian Qian is still sitting in the dark bedroom. She combs her hair as she sings. Her melody floats in the gaps between the roaring, rumbling thunder of the spiders, so quiet, so transparent, like a dreamscape under the moon.  From her body come the fragrances of myriad flowers and herbs, layer after layer, like gossamer. Her hair floats up into the air like a flame, fluttering without cease. I stand and listen to her sing, my face full of tears, until the whole house begins to shake.  From on top of the roof, I hear the sound of steel clanging, blunt objects striking against each other, heavy footsteps, and then Yan Chixia’s shouting.  Suddenly, the roof caves in, bringing with it a rain of shingles and letting in a bright patch of grey sky full of fluttering snowflakes. I push Xiao Qian into a dark corner, out of the way of the light.  I run outside the house. Yan Chixia is standing on the roof, holding his sword in front of him. The cold wind stretches his robe taut like a grey flag.  He jumps onto the back of a spider, and stabs at its eyes with his sword. The spider struggles hard and throws Yan off its back. Then the spider grabs Yan with two sharp claws and pulls him into its sharp, metallic, grinding mandibles. It chews and chews, like a man chewing kimchee, until pieces of Yan Chixia’s body are falling out of its mandibles onto the shingles of the roof. Finally, Yan’s head falls off the roof and rolls to a stop next to my feet, like a hard-boiled egg.  I pick up his head. He stares at me with his dead eyes. There are no tears in them, only anger and regret. Then with the last of his strength, Yan closes his eyes, as though he cannot bear to watch any more.  The spider continues to chew and grind up the rest of Yan Chixia’s body. Then it leaps down from the roof, and, rumbling, crawls towards me. Its eyes glow with a deep blue light.  Xiao Qian jumps from behind me and grabs me by the waist, pulling me back. I pry her hands off of me and push her back into the dark room. Then I pick up Yan Chixia’s sword and rush towards the spider.  The cold blue light of a steel claw flashes before my eyes. Then my head strikes the ground with a muffled thump. Blood spills everywhere.  The world is now tilted: tilted sky, tilted street, tilted snow falling diagonally. With every bit of my strength, I turn my eyes to follow the spider. I see that it’s chewing on my body. A stream of dark red fluid drips out of its beak, bubbling, warm, the droplets slowly spreading in the snow.  As the spider chews, it slows down gradually. Then it stops moving, the blue light in its eyes dim and then go out.  As though they have received some signal, all the other spiders also stop one by one. The rumbling thunder stops, plunging the world into silence.  The wind stops too. Snow begins to stick to the spiders’ steel bodies.  I want to laugh, but I can’t. My head is now separated from my body, so there’s no way to get air into the lungs and then out to my vocal cords. So I crack my lips open until the smile is frozen on my face.  The spiders believed that I was alive, a real person. They chewed my body and tasted flesh and saw blood. But they aren’t allowed to harm real people. If they do they must destroy themselves. That’s also part of the rules. Ghosts, spiders, it doesn’t matter. Everyone has to follow the rules.  I never imagined that the spiders would be so stupid. They’re even easier to fool than ghosts.  The scene in my eyes grows indistinct, fades, as though a veil is falling from the sky, covering my head. I remember the words of the crows. So it’s true. When your head is cut off, you really die.  I grew up on this street; I ran along this street. Now I’m finally going to die on this street, just like a real person.  A pair of pale, cold hands reaches over, stroking my face.  The wind blows and covers my face with a few pale pink peach petals. But I know they’re not peach petals. They’re Xiao Qian’s tears, mixed with snow.  Originally published in Chinese in Science Fiction World in 2010. Xia Jia (aka Wang Yao) is Associate Professor of Chinese Literature at Xi'an Jiaotong University and has been publishing speculative fiction since college. She is a seven-time winner of the Galaxy Award, China's most prestigious science fiction award and has published three science fiction collections (in Chinese): The Demon-Enslaving Flask (2012), A Time Beyond Your Reach (2017), and Xi'an City Is Falling Down (2018). Her first English language short story collection, A Summer Beyond Your Reach, will be the first book published by Clarkesworld Books. She's also engaged in other science fiction related works, including academic research, translation, screenwriting, and teaching creative writing.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "5920 words, short story\nA Hundred Ghosts Parade Tonight\n2013 Nominee: Science Fiction and Fantasy Translation Awards\nShort Form\nAwakening of Insects, the Third Solar Term:\nGhost Street is long but narrow, like an indigo ribbon. You can cross it in eleven steps, but to walk it from end to end takes a full hour.\nAt the western end is Lanruo Temple, now fallen into ruin. Inside the temple is a large garden full of fruit trees and vegetable patches, as well as a bamboo grove and a lotus pond. The pond has fish, shrimp, dojo loaches, and yellow snails. So supplied, I have food to eat all year.\nIt’s evening, and I’m sitting at the door to the main hall, reading a copy of Huainanzi, the Han Dynasty essay collection, when along comes Yan Chixia, the great hero, vanquisher of demons and destroyer of evil spirits. He’s carrying a basket on the crook of his elbow, the legs of his pants rolled all the way up, revealing calves caked with black mud. I can’t help but laugh at the sight.\nMy teacher, the Monk, hears me and walks out of the dark corner of the main hall, gears grinding, and hits me on the head with his ferule.\nI hold my head in pain, staring at the Monk in anger. But his iron face is expressionless, just like the statues of buddhas in the main hall. I throw down the book and run outside, while the Monk pursues me, his joints clanking and creaking the whole time. They are so rusted that he moves as slow as a snail.\nI stop in front of Yan, and I see that his basket contains several new bamboo shoots, freshly dug from the ground.\n“I want to eat meat,” I say, tilting my face up to look at him. “Can you shoot some buntings with your slingshot for me?”\n“Buntings are best eaten in the fall, when they’re fat,” says Yan. “Now is the time for them to breed chicks. If you shoot them, there won’t be buntings to eat next year.”\n“Just one, pleaaaaase?” I grab onto his sleeve and act cute. But he shakes his head resolutely, handing me the basket. He takes off his conical sedge hat and wipes the sweat off his face.\nI laugh again as I look at him. His face is as smooth as an egg, with just a few wisps of curled black hair like weeds that have been missed by the gardener. Legend has it that his hair and beard used to be very thick, but I’m always pulling a few strands out now and then as a game. After so many years, these are all the hairs he has left.\n“You must have died of hunger in a previous life,” Yan says, cradling the back of my head in his large palm. “The whole garden is full of food for you. No one is here to fight you for it.”\nI make a face at him and take the basket of food.\nThe rain has barely stopped; insects cry out from the wet earth. A few months from now, green grasshoppers will be jumping everywhere. You can catch them, string them along a stick, and roast them over the fire, dripping sweet-smelling fat into the flames.\nAs I picture this, my empty stomach growls as though filled with chittering insects already. I begin to run.\nThe golden light of the evening sun splatters over the slate slabs of the empty street, stretching my shadow into a long, long band.\nI run back home, where Xiao Qian is combing her hair in the darkness. There are no mirrors in the house, so she always takes off her head and puts it on her knees to comb. Her hair looks like an ink-colored scroll, so long that the strands spread out to cover the whole room.\nI sit quietly to the side until she’s done combing her hair, puts it up in a moon-shaped bun, and secures it with a pin made of dark wood inlaid with red coral beads. Then she lifts her head and re-attaches it to her neck, and asks me if it’s sitting straight. I don’t understand why Xiao Qian cares so much. Even if she just tied her head to her waist with a sash, everyone would still think she’s beautiful.\nBut I look, seriously, and nod. “Beautiful,” I say.\nActually, I can’t really see very well. Unlike the ghosts, I cannot see in the dark.\nXiao Qian is happy with my affirmation. She takes my basket and goes into the kitchen to cook. As I sit and work the bellows next to her, I tell her about my day. Just as I get to the part where the Monk hit me on the head with the ferule, Xiao Qian reaches out and lightly caresses my head where I was hit. Her hand is cold and pale, like a piece of jade.\n“You need to study hard and respect your teacher,” Xiao Qian says. “Eventually you’ll leave here and make your way in the real world. You have to have some knowledge and real skills.”\nHer voice is very soft, like cotton candy, and so the swelling on my head stops hurting.\nXiao Qian tells me that Yan Chixia found me on the steps of the temple when I was a baby. I cried and cried because I was so hungry. Yan Chixia was at his wit’s end when he finally stuffed a handful of creeping rockfoil into my mouth. I sucked on the juice from the grass and stopped crying.\nNo one knows who my real parents are.\nEven back then, Ghost Street had been doing poorly. No tourists had been coming by for a while. That hasn’t changed. Xiao Qian tells me that it’s probably because people invented some other attraction, newer, fresher, and so they forgot about the old attractions. She’s seen similar things happen many times before.\nBefore she became a ghost, Xiao Qian tells me, she had lived a very full life. She had been married twice, gave birth to seven children, and raised them all.\nAnd then her children got sick, one after another. In order to raise the money to pay the doctors, Xiao Qian sold herself off in pieces: teeth, eyes, breasts, heart, liver, lungs, bone marrow, and finally, her soul. Her soul was sold to Ghost Street, where it was sealed inside a female ghost’s body. Her children died anyway.\nNow she has white skin and dark hair. The skin is light sensitive. If she’s in direct sunlight she’ll burn.\nAfter he found me, Yan Chixia had walked up and down all of Ghost Street before he decided to give me to Xiao Qian to raise.\nI’ve seen a picture of Xiao Qian back when she was alive. It was hidden in a corner of a drawer in her dresser. The woman in the picture had thick eyebrows, huge eyes, a wrinkled face—far uglier than the way Xiao Qian looks now. Still, I often see her cry as she looks at that picture. Her tears are a pale pink. When they fall against her white dress they soak into the fabric and spread, like blooming peach flowers.\nEvery ghost is full of stories from when they were alive. Their bodies have been cremated and the ashes mixed into the earth, but their stories still live on. During the day, when all of Ghost Street is asleep, the stories become dreams and circle under the shadows of the eaves, like swallows without nests. During those hours, only I’m around, walking in the street, and only I can see them and hear their buzzing song.\nI’m the only living person on Ghost Street.\nXiao Qian says that I don’t belong here. When I grow up, I’ll leave.\nThe smell of good food fills the room. The insects in my stomach chitter even louder.\nI eat dinner by myself: preserved pork with stir-fried bamboo shoots, shrimp-paste-flavored egg soup, and rice balls with chives, still hot in my hands. Xiao Qian sits and watches me. Ghosts don’t eat. None of the inhabitants of Ghost Street, not even Yan Chixia or the Monk, ever eat.\nI bury my face in the bowl, eating as fast as I can. I wonder, after I leave, will I ever eat such delicious food again?\nMajor Heat, the Twelfth Solar Term:\nAfter night falls, the world comes alive.\nI go alone to the well in the back to get water. I turn the wheel and it squeaks, but the sound is different from usual. I look down into the well and see a long-haired ghost in a white dress sitting in the bucket.\nI pull her up and out. Her wet hair covers her face, leaving only one eye to stare at me out of a gap.\n“Ning, tonight is the Carnival. Aren’t you going?”\n“I need to get water for Xiao Qian’s bath,” I answer. “After the bath we’ll go.”\nShe strokes my face lightly. “You are a foolish child.”\nShe has no legs, so she has to leave by crawling on her hands. I hear the sound of crawling, creeping all around me. Green will-o’-the-wisps flit around, like anxious fireflies. The air is filled with the fragrance of rotting flowers.\nI go back to the dark bedroom and pour the water into the wooden bathtub. Xiao Qian undresses. I see a crimson bar code along her naked back, like a tiny snake. Bright white lights pulse under her skin.\n“Why don’t you take a bath with me?” she asks.\nI shake my head, but I’m not sure why. Xiao Qian sighs. “Come.” So I don’t refuse again.\nWe sit in the bathtub together. The cedar smells nice. Xiao Qian rubs my back with her cold, cold hands, humming lightly. Her voice is very beautiful. Legend has it that any man who heard her sing fell in love with her.\nWhen I grow up, will I fall in love with Xiao Qian? I think and look at my small hands, the skin now wrinkled from the bath like wet wrapping paper.\nAfter the bath, Xiao Qian combs my hair, and dresses me in a new shirt that she made for me. Then she sticks a bunch of copper coins, green and dull, into my pocket.\n“Go have fun,” she says. “Remember not to eat too much!”\nOutside, the street is lit with countless lanterns, so bright that I can no longer see the stars that fill the summer sky.\nDemons, ghosts, all kinds of spirits come out of their ruined houses, out of cracks in walls, rotting closets, dry wells. Hand-in-hand, shoulder-by-shoulder, they parade up and down Ghost Street until the narrow street is filled.\nI squeeze myself into the middle of the crowd, looking all around. The stores and kiosks along both sides of the street send forth all kinds of delicious smells, tickling my nose like butterflies. The vending ghosts see me and call for me, the only living person, to try their wares.\n“Ning! Come here! Fresh sweet osmanthus cakes, still hot!”\n“Sugar roasted chestnuts! Sweet smelling and sweeter tasting!”\n“Fried dough, the best fried dough!”\n“Long pig dumplings! Two long pig dumplings for one coin!”\n“Ning, come eat a candy man. Fun to play and fun to eat!”\nOf course the “long pig dumplings” are really just pork dumplings. The vendor says that just to attract the tourists and give them a thrill.\nBut I look around, and there are no tourists.\nI eat everything I can get my hands on. Finally, I’m so full that I have to sit down by the side of the road to rest a bit. On the opposite side of the street is a temporary stage lit by a huge bright white paper lantern. Onstage, ghosts are performing: sword-swallowing, fire-breathing, turning a beautiful girl into a skeleton. I’m bored by these tricks. The really good show is still to come.\nA yellow-skinned old ghost pushes a cart of masks in front of me.\n“Ning, why don’t you pick a mask? I have everything: Ox-Head, Horse-Face, Black-Faced and White-Faced Wuchang, Asura, Yaksha, Rakshasa, Pixiu, and even Lei Gong, the Duke of Thunder.”\nI spend a long time browsing, and finally settle on a Rakshasa mask with red hair and green eyes. The yellow-skinned old ghost thanks me as he takes my coin, dipping his head down until his back is bent like a bow.\nI put the mask on and continue strutting down the street. Suddenly loud Carnival music fills the air, and all the ghosts stop and then shuffle to the sides of the street.\nI turn around and see the parade coming down the middle of the street. In front are twenty one-foot tall green toads in two columns, striking gongs, thumping drums, strumming huqin, and blowing bamboo sheng. After them come twenty centipede spirits in black clothes, each holding varicolored lanterns and dancing complicated steps. Behind them are twenty snake spirits in yellow dresses, throwing confetti into the air. And there are more behind them but I can’t see so far.\nBetween the marching columns are two Cyclopes in white robes, each as tall as a three-story house. They carry a palanquin on their shoulders, and from within Xiao Qian’s song rolls out, each note as bright as a star in the sky, falling one by one onto my head.\nFireworks of all colors rise up: bright crimson, pale green, smoky purple, shimmering gold. I look up and feel as though I’m becoming lighter myself, floating into the sky.\nAs the parade passes from west to east, all the ghosts along the sides of the street join, singing and dancing. They’re heading for the old osmanthus tree at the eastern end of Ghost Street, whose trunk is so broad that three men stretching their arms out can barely surround it. A murder of crows lives there, each one capable of human speech. We call the tree Old Ghost Tree, and it is said to be in charge of all of Ghost Street. Whoever pleases it prospers; whoever goes against its wishes fails.\nBut I know that the parade will never get to the Old Ghost Tree.\nWhen the parade is about half way down the street, the earth begins to shake and the slate slabs crack open. From the yawning gaps huge white bones crawl out, each as thick as the columns holding up Lanruo Temple. The bones slowly gather together and assemble into a giant skeleton, glinting like white porcelain in the moonlight. Now black mud springs forth from its feet and crawls up the skeleton, turning into flesh. Finally, a colossal Dark Yaksha stands before us, its single horn so large that it seems to pierce the night sky.\nThe two Cyclopes don’t even reach its calves.\nThe Dark Yaksha turns its huge head from side to side. This is a standard part of every Carnival. It is supposed to abduct a tourist. On nights when there are no tourists, it must go back under the earth, disappointed, to wait for the next opportunity.\nSlowly, it turns its gaze on me, focusing on my presence. I pull off my mask and stare back. Its gaze feels hot, the eyes as red as burning coal.\nXiao Qian leans out from the palanquin, and her cry pierces the suddenly quiet night air: “Ning, run! Run!”\nThe wind lifts the corner of her dress, like a dark purple petal unfolding. Her face is like jade, with orange lights flowing underneath.\nI turn and run as fast as I can. Behind me I hear the heavy footsteps of the Dark Yaksha. With every quaking, pounding step, shingles fall from houses on both sides like overripe fruits. I am now running like the wind, my bare feet striking the slate slabs lightly: pat, pat, pat. My heart pounds against my chest: thump, thump, thump. Along the entire frenzied Ghost Street, mine is the only living heart.\nBut both the ghosts and I know that I’m not in any real danger. A ghost can never hurt a real person. That’s one of the rules of the game.\nI run towards the west, towards Lanruo Temple. If I can get to Yan Chixia before the Yaksha catches me, I’ll be safe. This is also part of the performance. Every Carnival, Yan puts on his battle gear and waits on the steps of the main hall.\nAs I approach, I cry out: “Help! Save me! Oh Hero Yan, save me!”\nIn the distance I hear his long ululating cry and see his figure leaping over the wall of the temple to land in the middle of the street. He holds in his left hand a Daoist charm: red character written against a yellow background. He reaches behind his back with his right hand and pulls out his sword, the Demon Slayer.\nHe stands tall and shouts into the night sky, “Brazen Demon! How dare you harm innocent people? I, Yan Chixia, will carry out justice today!”\nBut tonight, he forgot to wear his sedge hat. His egg-shaped face is exposed to the thousands of lanterns along Ghost Street, with just a few wisps of hair curled like question marks on a blank page. The silly sight is such a contrast against his serious mien that I start to laugh even as I’m running. And that makes me choke and can’t catch my breath so I fall against the cold slate surface of the street.\nThis moment is my best memory for the summer.\nCold Dew, the Seventeenth Solar Term:\nA thin layer of clouds hides the moon. I’m crouching by the side of the lotus pond in Lanruo Temple. All I can see are the shadows cast by the lotus leaves, rising and falling slowly with the wind.\nThe night is as cold as the water. Insects hidden in the grass won’t stop singing.\nThe eggplants and string beans in the garden are ripe. They smell so good that I have a hard time resisting the temptation. All I can think about is to steal some under the cover of night. Maybe Yan Chixia was right: in a previous life I must have died of hunger.\nSo I wait, and wait. But I don’t hear Yan Chixia’s snores. Instead, I hear light footsteps cross the grassy path to stop in front of Yan Chixia’s cabin. The door opens, the steps go in. A moment later, the voices of a man and a woman drift out of the dark room: Yan Chixia and Xiao Qian.\nQian: “Why did you ask me to come?”\nYan: “You know what it’s about.”\nQian: “I can’t leave with you.”\nYan: “Why not?”\nQian: “A few more years. Ning is still so young.”\n“Ning, Ning!” Yan’s voice grows louder. “I think you’ve been a ghost for too long.”\nQian sounds pitiful. “I raised Ning for so many years. How can I just get up and leave him?”\n“You’re always telling me that Ning is still too young, always telling me to wait. Do you remember how many years it has been?”\n“I can’t.”\n“You sew a new set of clothes for him every year. How can you forget?” Yan chuckles, a cold sound. “I remember very clearly. The fruits and vegetables in this garden ripen like clockwork, once a year. I’ve seen them do it fifteen times. Fifteen! But has Ning’s appearance changed any since the year he turned seven? You still think he’s alive, he’s real?”\nXiao Qian remains silent for a moment. Then I hear her crying.\nYan sighs. “Don’t lie to yourself any more. He’s just like us, nothing more than a toy. Why are you so sad? He’s not worth it.”\nXiao Qian just keeps on crying.\nYan sighs again. “I should never have picked him up and brought him back.”\nXiao Qian whispers through the tears, “Where can we go if we leave Ghost Street?”\nYan has no answer.\nThe sound of Xiao Qian’s crying makes my heart feel constricted. Silently, I sneak away and leave the old temple through a hole in the wall.\nThe thin layer of clouds chooses this moment to part. The cold moonlight scatters itself against the slate slabs of the street, congealing into drops of glittering dew. My bare feet against the ground feel so cold that my whole body shivers.\nA few stores are still open along Ghost Street. The vendors greet me enthusiastically, asking me to sample their green bean biscuits and sweet osmanthus cake. But I don’t want to. What’s the point? I’m just like them, maybe even less than them.\nEvery ghost used to be alive. Their fake, mechanical bodies host real souls. But I’m fake throughout, inside and outside. From the day I was born, made, I was fake. Every ghost has stories of when they were alive, but I don’t. Every ghost had a father, a mother, a family, memories of their love, but I don’t have any of that.\nXiao Qian once told me that Ghost Street’s decline came about because people, real people, found more exciting, newer toys. Maybe I am one of those toys: made with newer, better technology, until I could pass for the real thing. I can cry, laugh, eat, piss and shit, fall, feel pain, ooze blood, hear my own heartbeat, grow up from a simulacrum of a baby—except that my growth stops when I’m seven. I’ll never be a grown up.\nGhost Street was built to entertain the tourists, and all the ghosts were their toys. But I’m just a toy for Xiao Qian.\nPretending that the fake is real only makes the real seem fake.\nI walk slowly toward the eastern end of the street, until I stop under the Old Ghost Tree. The sweet fragrance of osmanthus fills the foggy night air, cool and calming. Suddenly I want to climb into the tree. That way, no one will find me.\nThe Old Ghost Tree leans down with its branches to help me.\nI sit, hidden among the dense branches, and feel calmer. The crows perch around me, their glass eyes showing hints of a dark red glow. One of them speaks: “Ning, this is a beautiful night. Why aren’t you at Lanruo Temple, stealing vegetables?”\nThe crow is asking a question to which it already knows the answer. The Old Ghost Tree knows everything that happens on Ghost Street. The crows are its eyes and ears.\n“How can I know for sure,” I ask, “that I’m a real person?”\n“You can chop off your head,” the crow answers. “A real person will die with his head cut off, but a ghost will not.”\n“But what if I cut off my head and die? I’ll be no more.”\nThe crow laughs, the sound grating and unpleasant to listen to. Two more crows fly down, holding in their beaks antique bronze mirrors. Using the little moonlight that leaks through the leaves, I finally see myself in the mirrors: small face, dark hair, thin neck. I lift the hair off the back of my neck, and in the double reflections of the mirrors, I see a crimson bar code against the skin, like a tiny snake.\nI remember Xiao Qian’s cool hands against my spine on that hot summer night. I think and think, until tears fall from my eyes.\nWinter Solstice, the Twenty-Second Solar Term:\nThis winter has been both dry and cold, but I often hear the sound of thunder in the distance. Xiao Qian says that it’s the Thunder Calamity, which happens only once every thousand years.\nThe Thunder Calamity punishes demons and ghosts and lost spirits. Those who can escape it can live for another thousand years. Those who can’t will be burnt away until no trace is left of them.\nI know perfectly well that there’s no such thing as a “Thunder Calamity” in this world. Xiao Qian has been a ghost for so long that she’s now gone a little crazy. She holds onto me with her cold hands, her face as pale as a sheet of paper. She says that to hide from the Calamity, a ghost must find a real person with a good heart to stay beside her. That way, just like how one wouldn’t throw a shoe at a mouse sitting beside an expensive vase, the Duke of Thunder will not strike the ghost.\nBecause of her fear, my plan to leave has been put on hold. In secret I’ve already prepared my luggage: a few stolen potatoes, a few old shirts. My body isn’t growing any more anyway, so these clothes will last me a long time. I didn’t take any of the old copper coins from Xiao Qian though. Perhaps the outside world does not use them.\nI really want to leave Ghost Street. I don’t care where I go; I just want to see the world. Anywhere but here.\nI want to know how real people live.\nBut still, I linger.\nOn Winter Solstice it snows. The snowflakes are tiny, like white sawdust. They melt as soon as they hit the ground. Only a very thin layer has accumulated by noon.\nI walk alone along the street, bored. In past years I would go to Lanruo Temple to find Yan Chixia. We would knock an opening in the ice covering the lotus pond, and lower our jury-rigged fishing pole beneath the ice. Winter catfish are very fat and taste fantastic when roasted with garlic.\nBut I haven’t seen Yan Chixia in a long time. I wonder if his beard and hair have grown out a bit.\nThunder rumbles in the sky, closer, then further away, leaving only a buzzing sensation in my ears. I walk all the way to the Old Ghost Tree, climb up into its branches, and sit still. Snowflakes fall all around me but not on me. I feel calm and warm. I curl up and tuck my head under my arms, falling asleep like a bird.\nIn my dream, I see Ghost Street turning into a long, thin snake. The Old Ghost Tree is the head, Lanruo Temple the tail, the slate slabs the scales. On each scale is drawn the face of a little ghost, very delicate and beautiful.\nBut the snake continues to writhe as though in great pain. I watch carefully and see that a mass of termites and spiders is biting its tail, making a sound like silkworms feeding on mulberry leaves. With sharp mandibles and claws, they tear off the scales on the snake one by one, revealing the flesh underneath. The snake struggles silently, but disappears inch by inch into the maws of the insects. When its body is almost completely eaten, it finally makes a sharp cry, and turns its lonesome head towards me.\nI see that its face is Xiao Qian’s.\nI wake up. The cold wind rustles the leaves of the Old Ghost Tree. It’s too quiet around me. All the crows have disappeared to who knows where except one that is very old and ugly. It’s crouching in front of me, its beak dangling like the tip of a long mustache.\nI shake it awake, anxious. It stares at me with two broken-glass eyes, croaking to me in its mechanical, flat voice, “Ning, why are you still here?”\n“Where should I be?”\n“Anywhere is good,” it says. “Ghost Street is finished. We’re all finished.”\nI stick my head out of the leaves of the Old Ghost Tree. Under the slate-grey sky, I see the murder of crows circling over Lanruo Temple in the distance, cawing incessantly. I’ve never seen anything like this.\nI jump down from the tree and run. As I run along the narrow street, I pass dark doors and windows. The cawing of the crows has awakened many of the ghosts, but they don’t dare to go outside, where there’s light. All they can do is to peek out from cracks in doors, like a bunch of crickets hiding under houses in winter.\nThe old walls of Lanruo Temple, long in need of repairs, have been pushed down. Many giant mechanical spiders made of steel are crawling all over the main hall, breaking off the dark red glass shingles and sculpted wooden molding, piece by piece, and throwing the pieces into the snow on the ground. They have flat bodies, blue-glowing eyes, and sharp mandibles, as ugly as you can imagine. From deep within their bodies comes a rumbling noise like thunder.\nThe crows swoop around them, picking up bits of broken shingles and bricks on the ground and dropping them on the spiders. But they are too weak and the spiders ignore them. The broken shingle pieces strike against the steel shells, making faint, hollow echoes.\nThe vegetable garden has been destroyed. All that remains are some mud and pale white roots. I see one of the Monk’s rusted arms sticking out of a pile of broken bricks.\nI run through the garden, calling for Yan Chixia. He hears me and slowly walks out of his cabin. He’s still wearing his battle gear: sedge hat over his head, the sword Demon Slayer in his hand. I want to shout for him to fight the spiders, but somehow I can’t spit the words out. The words taste like bitter, astringent paste stuck in my throat.\nYan Chixia stares at me with his sad eyes. He comes over to hold my hands. His hands are as cold as Xiao Qian’s.\nWe stand together and watch as the great and beautiful main hall is torn apart bit by bit, collapses, turns into a pile of rubble: shingles, bricks, wood, and mud. Nothing is whole.\nThey’ve destroyed all of Lanruo Temple: the walls, the main hall, the garden, the lotus pond, the bamboo grove, and Yan Chixia’s cabin. The only thing left is a muddy ruin.\nNow they’re moving onto the rest of Ghost Street. They pry up the slate slabs, flatten the broken houses along the sides of the street. The ghosts hiding in the houses are chased into the middle of the street. As they run, they scream and scream, while their skin slowly burns in the faint sunlight. There are no visible flames. But you can see the skin turning black in patches, and the smell of burning plastic is everywhere.\nI fall into the snow. The smell of burning ghost skin makes me vomit. But there’s nothing in my stomach to throw up. So I cry during the breaks in the dry heaves.\nSo this is what the Thunder Calamity looks like.\nThe ghosts, their faces burned away, continue to cry and run and struggle in the snow. Their footprints criss-cross in the snow, like a child’s handwriting. I suddenly think of Xiao Qian, and so I start to run again.\nXian Qian is still sitting in the dark bedroom. She combs her hair as she sings. Her melody floats in the gaps between the roaring, rumbling thunder of the spiders, so quiet, so transparent, like a dreamscape under the moon.\nFrom her body come the fragrances of myriad flowers and herbs, layer after layer, like gossamer. Her hair floats up into the air like a flame, fluttering without cease. I stand and listen to her sing, my face full of tears, until the whole house begins to shake.\nFrom on top of the roof, I hear the sound of steel clanging, blunt objects striking against each other, heavy footsteps, and then Yan Chixia’s shouting.\nSuddenly, the roof caves in, bringing with it a rain of shingles and letting in a bright patch of grey sky full of fluttering snowflakes. I push Xiao Qian into a dark corner, out of the way of the light.\nI run outside the house. Yan Chixia is standing on the roof, holding his sword in front of him. The cold wind stretches his robe taut like a grey flag.\nHe jumps onto the back of a spider, and stabs at its eyes with his sword. The spider struggles hard and throws Yan off its back. Then the spider grabs Yan with two sharp claws and pulls him into its sharp, metallic, grinding mandibles. It chews and chews, like a man chewing kimchee, until pieces of Yan Chixia’s body are falling out of its mandibles onto the shingles of the roof. Finally, Yan’s head falls off the roof and rolls to a stop next to my feet, like a hard-boiled egg.\nI pick up his head. He stares at me with his dead eyes. There are no tears in them, only anger and regret. Then with the last of his strength, Yan closes his eyes, as though he cannot bear to watch any more.\nThe spider continues to chew and grind up the rest of Yan Chixia’s body. Then it leaps down from the roof, and, rumbling, crawls towards me. Its eyes glow with a deep blue light.\nXiao Qian jumps from behind me and grabs me by the waist, pulling me back. I pry her hands off of me and push her back into the dark room. Then I pick up Yan Chixia’s sword and rush towards the spider.\nThe cold blue light of a steel claw flashes before my eyes. Then my head strikes the ground with a muffled thump. Blood spills everywhere.\nThe world is now tilted: tilted sky, tilted street, tilted snow falling diagonally. With every bit of my strength, I turn my eyes to follow the spider. I see that it’s chewing on my body. A stream of dark red fluid drips out of its beak, bubbling, warm, the droplets slowly spreading in the snow.\nAs the spider chews, it slows down gradually. Then it stops moving, the blue light in its eyes dim and then go out.\nAs though they have received some signal, all the other spiders also stop one by one. The rumbling thunder stops, plunging the world into silence.\nThe wind stops too. Snow begins to stick to the spiders’ steel bodies.\nI want to laugh, but I can’t. My head is now separated from my body, so there’s no way to get air into the lungs and then out to my vocal cords. So I crack my lips open until the smile is frozen on my face.\nThe spiders believed that I was alive, a real person. They chewed my body and tasted flesh and saw blood. But they aren’t allowed to harm real people. If they do they must destroy themselves. That’s also part of the rules. Ghosts, spiders, it doesn’t matter. Everyone has to follow the rules.\nI never imagined that the spiders would be so stupid. They’re even easier to fool than ghosts.\nThe scene in my eyes grows indistinct, fades, as though a veil is falling from the sky, covering my head. I remember the words of the crows. So it’s true. When your head is cut off, you really die.\nI grew up on this street; I ran along this street. Now I’m finally going to die on this street, just like a real person.\nA pair of pale, cold hands reaches over, stroking my face.\nThe wind blows and covers my face with a few pale pink peach petals. But I know they’re not peach petals. They’re Xiao Qian’s tears, mixed with snow.\nOriginally published in Chinese in Science Fiction World in 2010.\nXia Jia (aka Wang Yao) is Associate Professor of Chinese Literature at Xi'an Jiaotong University and has been publishing speculative fiction since college. She is a seven-time winner of the Galaxy Award, China's most prestigious science fiction award and has published three science fiction collections (in Chinese): The Demon-Enslaving Flask (2012), A Time Beyond Your Reach (2017), and Xi'an City Is Falling Down (2018). Her first English language short story collection, A Summer Beyond Your Reach, will be the first book published by Clarkesworld Books. She's also engaged in other science fiction related works, including academic research, translation, screenwriting, and teaching creative writing.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/xia_02_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Hundred Ghosts Parade Tonight by Xia Jia, translated by Ken Liu"}