{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JxZlpxoO6hhmaBvvoBIMDIMnLU4=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Managing This Expectation  I’ve made no secret that I find writing these editorials to be difficult. It’s primarily because I’m a very slow writer, but also because it often feels like I’m standing in an empty field talking to myself. What other jobs have this sort of thing as an expectation? Is this the SF equivalent of a post-game locker room press conference? I know some editors who appear to follow that path, talking about the different players/authors and their actions/stories in this month’s game/issue. Trying to do that would just make my head spin. Maybe there’s something else . . .  How about the post-launch mission briefing where I tell you how the team is doing and what we hope to see in the days ahead? I’ve done some of those and this month I could even give you a brief on how fictionauts R.S.A. Garcia, Ray Nayler, and Suzanne Palmer have been selected as finalists for the eagerly-awaited 2022 Sturgeon Award mission, or how Samantha Murray just successfully landed a winning best novella at the 2021 Aurealis Awards in May.  Or perhaps, I’m filing a report of “criminal” acts? Earlier this week I was the victim of an ageist attack suggesting that I was “too old to be editing one of the leading science fiction magazines” and I should “get out of the way” so someone younger can do it. I’m only fifty-five, not the oldest editor I know, and not about to give up the magazine I started over one person’s disrespectful opinion on the matter. Their punishment is measured by the amount of time I continue to edit Clarkesworld.  Could be that it’s like being a referee, outlining how we’d like to see the game played? It’s perfectly fair to criticize or celebrate the finalists or winners of any award. Science fiction is a broad field with a variety of styles that might not appeal to everyone and the awards will reflect some of that. It’s only natural to be thrilled or disappointed when your favorite player wins, loses, or is benched. That said, we want a fair fight here. There should be no punching below the belt—criticizing or campaigning against based on anything other than the work they’ve done.  How about a school paper about my family vacation? It was several days of heavy fog and rain at the shore. We visited our old hotel and discovered that it had already been bulldozed to make room for four four-million-dollar condos on the boardwalk. Despite the weather, a good time was had by all. It ended too soon and I can’t wait to go back, hopefully sometime I can actually see the sky and the ocean.  I’ll have to keep thinking about this. There must be some path that will make this feel more natural. Maybe I should look into having an AI write these editorials . . . or just bring in someone younger with all the answers. (Too soon?) I think I’ll just continue to wander around this field until I figure it out. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Managing This Expectation\nI’ve made no secret that I find writing these editorials to be difficult. It’s primarily because I’m a very slow writer, but also because it often feels like I’m standing in an empty field talking to myself. What other jobs have this sort of thing as an expectation? Is this the SF equivalent of a post-game locker room press conference? I know some editors who appear to follow that path, talking about the different players/authors and their actions/stories in this month’s game/issue. Trying to do that would just make my head spin. Maybe there’s something else . . .\nHow about the post-launch mission briefing where I tell you how the team is doing and what we hope to see in the days ahead? I’ve done some of those and this month I could even give you a brief on how fictionauts R.S.A. Garcia, Ray Nayler, and Suzanne Palmer have been selected as finalists for the eagerly-awaited 2022 Sturgeon Award mission, or how Samantha Murray just successfully landed a winning best novella at the 2021 Aurealis Awards in May.\nOr perhaps, I’m filing a report of “criminal” acts? Earlier this week I was the victim of an ageist attack suggesting that I was “too old to be editing one of the leading science fiction magazines” and I should “get out of the way” so someone younger can do it. I’m only fifty-five, not the oldest editor I know, and not about to give up the magazine I started over one person’s disrespectful opinion on the matter. Their punishment is measured by the amount of time I continue to edit Clarkesworld.\nCould be that it’s like being a referee, outlining how we’d like to see the game played? It’s perfectly fair to criticize or celebrate the finalists or winners of any award. Science fiction is a broad field with a variety of styles that might not appeal to everyone and the awards will reflect some of that. It’s only natural to be thrilled or disappointed when your favorite player wins, loses, or is benched. That said, we want a fair fight here. There should be no punching below the belt—criticizing or campaigning against based on anything other than the work they’ve done.\nHow about a school paper about my family vacation? It was several days of heavy fog and rain at the shore. We visited our old hotel and discovered that it had already been bulldozed to make room for four four-million-dollar condos on the boardwalk. Despite the weather, a good time was had by all. It ended too soon and I can’t wait to go back, hopefully sometime I can actually see the sky and the ocean.\nI’ll have to keep thinking about this. There must be some path that will make this feel more natural. Maybe I should look into having an AI write these editorials . . . or just bring in someone younger with all the answers. (Too soon?) I think I’ll just continue to wander around this field until I figure it out.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_06_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Managing This Expectation by Neil Clarke"}