{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "sKCQMEqzH6kD9bP6mpWTh8Io3rE=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Returning to the Scene of the Crime  It’s time to be honest—I was very nervous about heading back to Readercon last month. I know the convention had nothing to do with last year’s heart attack, but it was the scene of the crime. Still I persevered and was welcomed back by many friends, old and new. In the end I’m glad my family and I went. A small weight has been lifted from my shoulders.  Fandom is an interesting place. Last year I noted how much support my family received from the Readercon community and this year, I’ve been thinking about how many of those positive stories are left unspoken. To that end I’d like to highlight the efforts of a group of people that I think deserve more attention: Operation Hammond (operationhammond.com). In their own words:   Operation Hammond is a non-profit organization of like-minded individuals within the anime, sci-fi, fantasy and pop culture convention community dedicated to bringing awareness of first aid, emergency preparedness and training to people who attend and staff anime, sci-fi, fantasy and pop culture conventions. The diversity and social dimensions of this social scene are unique. We are nerds helping nerds in times of need.  Our members and senior staff have the equipment, experience and know-how to effectively deal with medical emergencies, social needs and the unique requirements of those who attend pop culture events and conventions. We are a social medical organization. This means that we are able to carry out first aid, public safety and first responder duties at pop culture or fan events and conventions at the American Heart Association First Aid level.  Our members are trained and able to provide medical care and arrange transport for situations and injuries that require ambulance transfer to a hospital. Most of our members are EMTs, work in health care, veteran staffers of conventions and work in public service.  As someone who experienced a major medical event at a convention, I have to say that I found their presence at Readercon very reassuring. Yes, we should expect hotel staff to have basic emergency training, but response time from a trained professional can be critical. It is hard to beat having an EMT on-site and ready to act. Even if never called upon, these volunteers provide an extremely valuable service to our community and we should be proud to have people like this among our numbers. If you see them at a local convention, make sure you thank them for their service, and if you can, donate to their cause. We need more people like this.  Speaking of supporters, I was very pleased by the final results for my Kickstarter campaign for an original anthology of cyborg stories. I watched the final moments of the campaign from the Readercon dealer’s room and even met a few our backers in person. UPGRADED was fully-funded and then some. In the end, I had enough extra to add a few extra stories and pay our authors a bit more. I now have story commitments from Elizabeth Bear, Helena Bell, Tobias S. Buckell, Pat Cadigan, Greg Egan, Xia Jia, Caitlín R. Kiernan, Yoon Ha Lee, Ken Liu, Chen Qiufan, Robert Reed, E. Catherine Tobler, Genevieve Valentine, Peter Watts and E. Lily Yu. Julie Dillon (this month’s cover artist) will provide the cover. I’m looking forward to filling the rest of the table of contents and working with such a fine set of authors.   I also used Readercon as an opportunity to launch our fourth Clarkesworld anthology: CLARKESWORLD: YEAR FOUR. It sold very well and is now available in ebook and trade paperback formats. Here’s what’s included in this volume:  CONTENTS  Introduction by Neil Clarke  Between Two Dragons by Yoon Ha Lee  The Cull by Robert Reed  The Mermaids Singing Each to Each by Cat Rambo  Of Melei, of Ulthar by Gord Sellar  Night, in Dark Perfection by Richard Parks  The Grandmother-Granddaughter Conspiracy by Marissa Lingen  Brief Candle by Jason K. Chapman  All the King’s Monsters by Megan Arkenberg  Torquing Vacuum by Jay Lake  The Language of the Whirlwind by Lavie Tidhar  A Sweet Calling by Tony Pi  Alone with Gandhari by Gord Sellar  The History Within Us by Matthew Kressel  January by Becca De La Rosa  Messenger by J.M. Sidorova  A Jar of Goodwill by Tobias S. Buckell  Futures in the Memories Market by Nina Kiriki Hoffman  My Father’s Singularity by Brenda Cooper  Beach Blanket Spaceship by Sandra McDonald  The Association of the Dead by Rahul Kanakia  Spar by Kij Johnson  Paper Cradle by Stephen Gaskell  Thirteen Ways of Looking at Space/Time by Catherynne M. Valente  The Things by Peter Watts  Clarkesworld Citizens – Official Census  About Clarkesworld  That’s all for this month. Most of the Clarkesworld team are heading off to Worldcon in San Antonio at the end of the August. Here’s hoping to see some of you there! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Returning to the Scene of the Crime\nIt’s time to be honest—I was very nervous about heading back to Readercon last month. I know the convention had nothing to do with last year’s heart attack, but it was the scene of the crime. Still I persevered and was welcomed back by many friends, old and new. In the end I’m glad my family and I went. A small weight has been lifted from my shoulders.\nFandom is an interesting place. Last year I noted how much support my family received from the Readercon community and this year, I’ve been thinking about how many of those positive stories are left unspoken. To that end I’d like to highlight the efforts of a group of people that I think deserve more attention: Operation Hammond (operationhammond.com). In their own words:\nOperation Hammond is a non-profit organization of like-minded individuals within the anime, sci-fi, fantasy and pop culture convention community dedicated to bringing awareness of first aid, emergency preparedness and training to people who attend and staff anime, sci-fi, fantasy and pop culture conventions. The diversity and social dimensions of this social scene are unique. We are nerds helping nerds in times of need.\nOur members and senior staff have the equipment, experience and know-how to effectively deal with medical emergencies, social needs and the unique requirements of those who attend pop culture events and conventions. We are a social medical organization. This means that we are able to carry out first aid, public safety and first responder duties at pop culture or fan events and conventions at the American Heart Association First Aid level.\nOur members are trained and able to provide medical care and arrange transport for situations and injuries that require ambulance transfer to a hospital. Most of our members are EMTs, work in health care, veteran staffers of conventions and work in public service.\nAs someone who experienced a major medical event at a convention, I have to say that I found their presence at Readercon very reassuring. Yes, we should expect hotel staff to have basic emergency training, but response time from a trained professional can be critical. It is hard to beat having an EMT on-site and ready to act. Even if never called upon, these volunteers provide an extremely valuable service to our community and we should be proud to have people like this among our numbers. If you see them at a local convention, make sure you thank them for their service, and if you can, donate to their cause. We need more people like this.\nSpeaking of supporters, I was very pleased by the final results for my Kickstarter campaign for an original anthology of cyborg stories. I watched the final moments of the campaign from the Readercon dealer’s room and even met a few our backers in person. UPGRADED was fully-funded and then some. In the end, I had enough extra to add a few extra stories and pay our authors a bit more. I now have story commitments from Elizabeth Bear, Helena Bell, Tobias S. Buckell, Pat Cadigan, Greg Egan, Xia Jia, Caitlín R. Kiernan, Yoon Ha Lee, Ken Liu, Chen Qiufan, Robert Reed, E. Catherine Tobler, Genevieve Valentine, Peter Watts and E. Lily Yu. Julie Dillon (this month’s cover artist) will provide the cover. I’m looking forward to filling the rest of the table of contents and working with such a fine set of authors.\nI also used Readercon as an opportunity to launch our fourth Clarkesworld anthology: CLARKESWORLD: YEAR FOUR. It sold very well and is now available in ebook and trade paperback formats. Here’s what’s included in this volume:\nCONTENTS\nIntroduction by Neil Clarke\nBetween Two Dragons by Yoon Ha Lee\nThe Cull by Robert Reed\nThe Mermaids Singing Each to Each by Cat Rambo\nOf Melei, of Ulthar by Gord Sellar\nNight, in Dark Perfection by Richard Parks\nThe Grandmother-Granddaughter Conspiracy by Marissa Lingen\nBrief Candle by Jason K. Chapman\nAll the King’s Monsters by Megan Arkenberg\nTorquing Vacuum by Jay Lake\nThe Language of the Whirlwind by Lavie Tidhar\nA Sweet Calling by Tony Pi\nAlone with Gandhari by Gord Sellar\nThe History Within Us by Matthew Kressel\nJanuary by Becca De La Rosa\nMessenger by J.M. Sidorova\nA Jar of Goodwill by Tobias S. Buckell\nFutures in the Memories Market by Nina Kiriki Hoffman\nMy Father’s Singularity by Brenda Cooper\nBeach Blanket Spaceship by Sandra McDonald\nThe Association of the Dead by Rahul Kanakia\nSpar by Kij Johnson\nPaper Cradle by Stephen Gaskell\nThirteen Ways of Looking at Space/Time by Catherynne M. Valente\nThe Things by Peter Watts\nClarkesworld Citizens – Official Census\nAbout Clarkesworld\nThat’s all for this month. Most of the Clarkesworld team are heading off to Worldcon in San Antonio at the end of the August. Here’s hoping to see some of you there!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_08_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Returning to the Scene of the Crime by Neil Clarke"}