{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "A C Wise", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "48Sl96KoplqxUZIxGE547ZuK7YE=", "id": null, "license": null, "comments": "", "raw_text": "6740 words, short story, REPRINT  A Catalogue of Sunlight at the End of the World  June 21, 2232—Svalbard  The twenty-first of June, the Summer Solstice, the longest day and the shortest night. That means less here at the top of the world where, in this season, we have sunlight twenty-four hours a day. But it seemed like an appropriate day to start this project nonetheless.  In just over a week, the generation ship Arber will depart on its journey. The docking clamps will release, and it will go sailing off into space to find the future of humanity. This is my parting gift, a catalogue of sunlight from the world left behind.  Of course the sun will still be there, getting farther away as they travel, but it won’t be the same. The people on that ship—those ships, leaving from all points above the globe—will never again see sunlight the way it looks here and now. They won’t see the sky bruise purple and hushed gold or the violent shades of lavender, rose, and flame as the sun creeps toward the horizon. They’ll never see the way this sun sparkles off water in a fast-moving brook or dapples the ground beneath a canopy of leaves. It won’t pry its way through their blinds in the morning, or slip under doors and through all the cracks sealed up against its intrusion. They won’t know the persistence of it, the sheer amount of it. They’ll only know its loss.  Maybe the Arber’s children, or their children’s children will see starlight on the dust of some distant world, watch it pool in the craters of their first new footsteps and call it the sun. But not the ones leaving. The ones who grew up under its light. This is my gift to them. A little something to take with them into the cold and the dark.  Today, the light is pure. There isn’t a cloud in the sky to cut it, no breeze to stir it off our skins. All the shadows are sharp-edged. There’s so much of it, it’s easy to forget it’s there. Ubiquitous sun. It gets over everything and under everything and inside it. Today, the light of the sun has almost no color at all, but if you squint just right, you can prism it, see the rainbow fractures flaring away from it. That is the sun here today, children. The sun you’re leaving behind. There has never been another just like it, and there never will be again.  There. That part is for the future. This part is for the present and the past. For you and me, Mila.  Kathe came to see me today and asked me one more time to go with them. There’s room, she said. You could stay with me, Linde, Ivan, and the kids until we figure things out. She didn’t mention Thomas.  Kathe has pull. It comes with being Head of Resource Management, Northern Division. She could make it happen, our girl. That’s what she does, after all. She manages resources. If she says there’s room for me, then there’s room. She could probably get me the nicest berth on the ship, if I asked.  Space travel is for the young, I told her. It’s no place for an old man like me. Besides, this is my home. I like it here. This is where I belong.  But your children, she said. Your grandchildren.  Her eyes. It’s hard to look at them sometimes. They remind me so much of you. I think she knew she’d already lost the fight.  What’s the point of space? It’s just another place to be without you. I have my kettle here. I have my woolen socks and my favorite mug. I have a library full of books and music. I’ve even adopted a cat. Or it’s adopted me. A little gray kitten I’ve named Predator X. They won’t have cats in space. They’ll have genetic material, of course, but it’s hard to cuddle a test tube on a cold winter’s night and be comforted by its purr.  May 23, 2171—Prince Edward Island  To hell with separating past and future. This is my catalogue, and I’ll tell it how I choose and to who I choose, and I choose you, Mila.  Obviously May 23, 2171 isn’t today’s date, and I’m not on Prince Edward Island. It’s when and where we were married. The sunlight on that day deserves to be memorialized.  It was golden in the way sunlight never is outside of photographs and memories. It caught in your hair, turning those flyaway strands you could never get to behave—even on that day—into individual threads of crystal. It was sunlight in its ideal form, its most romantic form. They say it’s lucky to have rain on your wedding day, but I think that’s just something to make people feel better when their bouquets and tuxedoes and cakes and dozen white doves are all soggy and miserable.  We were married on the beach, on the dunes, with the waves in the background and wild seagrass running everywhere around us. Those dunes are gone now. In another few years, the whole island will be gone, lost to rising sea levels like New Orleans and Florida, London and Venice. So many cities swallowed whole. But back then, it was beautiful.  Lupines and red sand—those stick out in my mind. You insisted on traveling back to your family’s home because your grandmother wasn’t well enough to travel, and you wanted her to give you away. I didn’t have any people of my own left, so one place was as good as another to me. You were all the family I wanted and needed back then. Now that my life is coming full circle, I’m finding that’s true once again.  The day I proposed to you was the day I stole the Gibraltar Campion from the seed vault. Silene tomentosa, your favorite flower. The first time I saw you, you were looking at a 3-D projection of it, part of the vault’s new finding aid. I didn’t know it at the time, but that was your program. You were also the one who got rare and endangered flowers added to the vault along with staple crops. You said beautiful things should be saved as well as useful ones, and besides, bees and pollination and flowers—even rare and temperamental ones—are part of our ecosystem, too.  On the day we met, you were looking at the Gibraltar Campion from every angle, studying it with a scientist’s eye. I don’t think you knew anyone was watching you. Then, for just a moment, your expression changed; you weren’t looking at the flower like a scientist anymore. You frowned and reached out like you wanted to brush your finger along the pale silk of its petal.  Had you ever seen one in person? I imagined how many years you’d spent studying it and how you’d launched a whole program to protect it and other flowers like it. But had you ever held its thin stem between your fingers or breathed it in to see if it had a scent? That unguarded moment of fascination and longing—that’s the moment I fell in love.  It was hell getting the Campion to grow. I sweated over it in secret, afraid of giving it too much water, not enough. But I did get it to grow. That was always my gift. Can’t cook worth a damn. Never had a scrap of musical talent or enough coordination to play sports. Green thumbs, though. I have those like nobody’s business. It’s why I was hired on at the Global Seed Vault in the first place. It’s what led me to you, so I can’t complain.  Smuggling my Gibraltar Campion into Canada without getting caught— that was a special hell all of its own. Then I presented you with the bouquet—the sad, single-flower bouquet I was so proud of—right before you walked down the aisle of sand and seagrass, and you almost called the wedding off right then and there.  What the hell were you thinking? you said. Do you have any idea how rare the Gibraltar Campion is? They brought it back from the dead. It was nearly extinct. What the hell do you think the vault is for anyway?  Storing up flowers so no one ever sees them? A vault full of potential, but never the reality?  Of course I didn’t say that aloud. I wouldn’t dare.  Some things are meant to be enjoyed, is what I did say, and I tried to charm you with a smile. Sometimes you have to appreciate what you have while you have it, instead of holding on to it for someday. You just have to live and let go and stop worrying about the future.  You called me selfish and a dozen other more unsavory names. You almost shoved me into the water. God, I was young and stupid back then. But somehow, I convinced you to marry me anyway.  You stayed mad at me through the whole ceremony. You refused to hold the Campion, so I held it, and you glared at me the whole time you said your vows. At the end though, you smiled a little, too. Then you cried; we both cried, and you told me if I ever did anything that stupid again you would throw my body into a bottomless crevasse where it would never be found. When we kissed, it tasted like salt, and we crushed the Campion between us, and we laughed so hard we started crying all over again.  I miss you, Mila. Every goddamn day.  June 23, 2232—Svalbard  There was a big party down on the beach today. A goodbye for everybody leaving and everyone staying behind. We lit a huge bonfire, which seems strange in the middle of the day, but when the sun never goes down, what else can you do?  This is what the sun looked like five days before everyone went away. Weak, like tea or good scotch watered down a thousand times. Like if you took a glass and kept adding ice to it every time you took a sip, trying to stretch that last bit of alcohol just a little farther. Sunlight, divided infinitely and spread thin, the faintest hint of peat and smoke on the tongue.  It was mostly overcast, but every now and then something would break loose in the great patchwork of gray and a beam of light would come shooting through. It might pin the stones on the shore or a little boy’s hair as he ran toward the water. It might catch a mother and daughter in a tender moment of goodbye or fall on the waves and break over and over again. Sunlight is like that, fickle and faithless. It shines on us all.  Listen to me getting melancholy. Then again, it is the end of the world.  Everyone was there. We probably only made up a handful, compared to other celebrations around the world, but this was ours. We roasted fish on wooden spits. There were marshmallows and tofu hotdogs. Someone made a spicy curry with goat meat; someone else made a giant pot of borscht. There were real English popovers. There was even an attempt at poutine. You would have loved it.  A kitchen party. That’s what it reminded me of. Not that I’d ever been to one, but from your descriptions—everyone getting together, each person bringing food and something to drink and an instrument. Your grandmother used to throw them, just like the old days, you said. The whole house would be open to anyone who wanted to join in, music spilling out of every door and window all night long.  The party on the beach was like that, music and dancing, and all of it just seemed to roll on and on. Kathe was there with Linde and Ivan and the kids. Thomas was there, too, with Leena and their kids. Honestly, I’m surprised they never left Svalbard, Thomas especially. We chose this life, but Thomas and Kathe were born into it. Maybe they stayed because they’d already put down roots here or maybe because we have the illusion of safety up here at the top of the world, while wildfires and earthquakes, mudslides caused by deforestation and rising tide lines ravage the globe.  Whatever the reason, I’m glad they stayed; I got to see my grandchildren. On the day of the party, they all ran around on the shore together, chasing the black-legged kittiwakes and the long-tailed skua. Even Dani, who’s almost thirteen now, too old for playing and entering that awkward stage of being caught between everything.  Kathe came to talk to me when things quieted down and the mood turned somber. We all looked up and remembered the space elevator was still going nonstop, bringing people and supplies up to the station and then to the Arber, all those eager and heartbroken people, ready to start their future.  What will you do when we’re all gone, Dad? Kathe asked. We sat side by side, looking out at the ocean.  We’ll get by, I told her. There will just be less of us. The Andersens are staying, and the Guptas. Raj is already planning a rotating dinner party. Everyone will take a turn hosting, and we’ll keep each other company. Besides, things aren’t too bad here, not like it is further south, and we still have the elevator and the station if things do get bad. In the meantime, I’ll have my garden, and I have Predator X. Helen Holbrook is going to teach me how to make cheese if I help her milk her goats.  I tried to make it sound cheerful, like it would be a continuation of the party on the beach, but smaller. Kathe didn’t look like she believed me. In truth, I knew there would be lonely days, but there would be days I relished my solitude, too. When you get to be my age, you surprise yourself by how often you’re content to just sit and think.  We sat quietly for a bit then. It reminded me of when Kathe was little, before Thomas was born. In fact, it was when you were pregnant with Thomas. While you napped in the afternoons, I would bring Kathe to the beach to collect stones and look for fossils. She never shared our love of growing things, that one, though she was curious as hell. It was all about stillness with Kathe, the frozen remnants of the past. Funny, then, that she’s the one going up into the stars, not me.  And Thomas, well . . . Maybe I should have tried harder to understand him and the things he loved, but with Kathe it was so much easier. She wore her heart on her sleeve, while Thomas was so closed and serious. He was never a little boy, not really. It was more like he was born a grown-up, and he was just waiting for his body to catch up with his mind.  We’ll still talk, I told Kathe after a while, as long as the ship is in communication range. And after that, we’ll have the ansible. Besides, it’s not like I’ll be alone, if you’re worried about me.  I do worry, she said. That’s a daughter’s job.  When did you get old enough for that to be true? I asked, and that made her smile at last. It was good to see. Besides, I said, it’s not like the world is really ending. Just changing, that’s all.  I know, but there are some things I don’t want to change, Kathe said, and right then she wasn’t Head of Resource Management, Northern Division, she was just our little girl again, and it nearly broke my heart. You’ve been there for me my whole life, me and Tom both, and I don’t know what I’ll do without you.  I squeezed her hand, and we both blinked against more than just smoke from the bonfire.  You’ll be fine, kiddo.  I was searching for something else to say, something inspirational and comforting, but Thomas came over and nudged the tip of Kathe’s boot with his toe.  Can I talk to Dad for a minute? he said. Alone.  I can’t remember the last time I heard Thomas call me Dad. I didn’t think I would ever hear it again.  Kathe looked surprised, but she gave Thomas her spot and gave us our privacy.  I know Kathe has tried to talk you into taking a place on the ship about a hundred times. Thomas kept his hands in his pockets while he talked, his gaze on the horizon. I’m not going to rehash all that. I just wanted to let you know she’s not the only one. I know we haven’t always seen eye to eye, but you’re my father.  I opened my mouth to say something or maybe just take a breath in surprise, but Thomas held up his hand to stop me.  Just let me finish. He looked down and didn’t raise his head again.  When Mom died, it was the hardest thing I’d ever had to watch. I know, and Thomas held his hand up again, even though he didn’t look at me. I’m not here to open old wounds. I just wanted to say it was hard, but you were there for Mom, every day. Kathe and I were there, too. She had her family all around her. She didn’t have to go through any of it alone. When your time comes, I just thought . . . I always thought we’d be there for you.  He looked up finally. His eyes aren’t like yours, or Kathe’s. They’re more like my mother’s. I didn’t know what to say to him, Mila. I’ve never known. He touched my shoulder, let his hand rest for a moment, then walked away.  I’ve been thinking about it since leaving the beach. Thomas deserves an explanation. And Kathe. Maybe you deserve an explanation, too.  We spent our lives building the future, saving all those plants and flowers in the vault, not to mention our own future with Kathe and Thomas. Now that the future’s here, I’m terrified. Thomas was right, watching you die was the hardest thing I’ve ever had to do. I don’t want that for our children, and I don’t want that for myself.  Maybe a bit of it is selfish. A man gets to a certain age, and he wants to live his life on his own terms. I think I understand the choices you made now a little better than I used to. When the end comes, when my end comes, I want to go quick and painless, not hooked up to machines. I’ll choose the time and place of my death, when I’m ready, and I want it to be here on Earth with you.  In space, even death will be different. Kathe explained it to me. There’s a morgue on the generation ship that is also a chapel and a burial chamber and a cryo-storage unit. Aboard the Arber, people will have the option of being ejected into space, being recycled—protein and calcium and other vital elements broken down and reused in a variety of ways—or being stored until their remains can be buried on the same alien world where our new crops will grow. That’s what death looks like in the next great age of humanity.  I understand that Thomas and Kathe want to be with me at the end, but this is the point where our roads diverge. You and me, we did what we could to build the future, Mila, but it isn’t for us. Why should Kathe and Thomas bring grief with them among the stars when they can carry memories instead? I want them to remember me as I am now, not the way I might be one day down the road.  It’s like we said all those years ago—sometimes you just have to live in the moment and enjoy what you have now, not hold on for one day and what’s to come. I want to enjoy what’s here while I can. We were the last generation who could have turned the tide. By the time Kathe and Thomas came along, it was too late to undo the mess we’d made. Climate change had already passed the tipping point, and whatever measures we put in place from then on out could only slow things down, not reverse them.  Perhaps it sounds egotistical, but I feel I owe it to the Earth to stay with her as long as I can. No one, not even a planet, should have to die alone.  August 16, 2200—Colorado  I’m going to cheat and talk about starlight, instead of the sun. Then again, the sun is a star, even if we usually don’t think of it that way. The stars on this particular day are important to remember; it’s the day we started saying goodbye.  We were vacationing in Buena Vista, staying at a resort built up around a hot spring. We went skinny-dipping in the springs on our last night, and even though it was high season, we had the place entirely to ourselves. You leaned back against the pool’s edge, and said, Well, I’m dying. Just like that.  You’d been losing weight for a while, but I wanted to pretend it was just your appetite slowing down now that we were both past middle age. You’d already considered all your options, you told me, talked to all the doctors. You’d tried everything there was to try—radiation pills, alternative therapy, even the more aggressive forms of chemo like they had in the old days. Those weeks you told me you were visiting your sister? You were really puking your guts out, suffering, but you didn’t want me to worry until you were really sure there was something to worry about.  The only thing left to try was gene therapy, and that was a bridge too far. It’s fine for babies, you said, fetuses in the womb who don’t know any better, but I know who I am and I wouldn’t feel like myself anymore if I let them scrub me clean. It’s my own body’s cells betraying me. Maybe I just have to live with that. Besides, why go through all that trouble and expense when at my age, there’s only a five percent chance of success? I want to enjoy as much of the time I have left as I can, not spend it hooked up to machines.  Then you reached into the backpack you’d carried out to the hot springs with us and pulled out a small terra-cotta pot holding a Gibraltar Campion. It might have been from the very same seed batch as the one I grew for you all those years ago. Yours was barely a seedling though, growing crooked like it wouldn’t survive a strong wind.  I never did have your knack for it, you said. You held out the pot to me and smiled that lopsided smile of yours. Sometimes you just have to live for the moment, right? Appreciate what you have and not worry about the future.  Damn you for throwing my words back at me. How dare you give up? How dare you throw everything away when we still had so much living to do? But I could only stare at you and the Campion.  You let a full minute of silence go by before you asked me if I was okay. If I was okay when you were the one dying. What could I say? All my words dried up in that moment. You took my hand. We sat in the hot spring, your fingers in mine under the water, and tears ran down my face. Later, we made love, and I was crying then, too. I think I cried more that night than I did at your funeral.  The sky was utterly clear. There’s nothing like a skyscraper for miles in Buena Vista and next to no light pollution. On a night as clear as the one on which you told me you were dying, the sky was a bowl of blue so dark it passed into black and came out the other side.  That blue-dark bowl closed over the mountains, sealing us in, but everywhere we looked, there was light. I want to say the stars were bright, and they were, but they were so bright and there were so many of them, they looked fuzzy.  The stars between the stars were visible, and somehow it was different than looking at them from the top of the world, even though there isn’t much light pollution in Svalbard either. The stars seemed farther away. They seemed alive, like the whole of the dark was crawling with silver. I could almost see the arm of the Milky Way unfurling around us. It was enough to make me dizzy. Or maybe that was the hot water from the spring. Or the thought of letting you go.  Right before we fell asleep that night, you lay spooned against my back. I held your hands, your arms pulled all the way around me. I thought if I held on tight enough, maybe you wouldn’t go. You leaned forward and whispered in my ear, Take care of my flower for me, when I’m gone.  I still have the damn thing, Mila. Or at least its descendant. It’s sitting on my windowsill. Predator X hasn’t knocked it over yet, not for lack of trying. I want that flower to be the last thing I see in this world. When I’m too old and frail to walk around anymore, I’ll keep it by my bedside. It’s a little piece of you, so when I die, I won’t be doing it alone.  June 24, 2232—Svalbard  Linde and Ivan are taking the kids to get settled on the ship today. Kathe will join them just before launch. Thomas and Leena are already on board.  Before Linde and Ivan boarded, Ivan asked me if I was sure I hadn’t changed my mind. I never expected him to be the one. I had to bite my tongue to keep from asking if Kathe had put him up to it, but there was genuine regret in his eyes. Linde shook my hand, firm and strong as always. Ivan hugged me. I couldn’t ask for better children-in-law.  Sometimes I think of the dangers Kathe, Linde, Ivan, and even Thomas will face up there. What would you think of me, letting our children, their spouses, our grandchildren go off into the dark alone? Kathe, Linde, Ivan, Thomas, and Leena will likely never see an alien world, let alone set foot on one. It’ll be their children, their children’s children who will colonize the stars. If they make it that far.  I think of all the things that could go wrong—a critical failure in the engines; explosive decompression blowing them all out into space; a plague; failure of the shipboard crops and death by slow starvation. Those possibilities are next to none. Kathe gave me the figures, something like a 0.001% chance. Me being on board certainly wouldn’t tip the balance one way or another. Still, it’s a parent’s job to worry.  This is what the sun looked like on the day my grandchildren climbed aboard the space elevator and we all said goodbye.  The ocean was a sullen color, like pewter, but with a shine. Maybe tarnished silver would be a better comparison, the surface dull but with a brightness hidden underneath. The sun had a pinkish tint to it. Pink is normally a warm color, but this pink was cold. Like the inside of a shell fresh out of the sea or a thin sliver of pickled ginger. Like skin, when all the warmth of blood and a beating heart has gone out of it and it’s just a container, no longer full.  There were clouds, a very few of them, scattered across the sky. The kittiwakes and skua glided on the wing, and every now and then one of them would let out a cry.  Ella, that’s Kathe and Linde and Ivan’s youngest, cried when she hugged me. She put her arms around my waist, and pressed her face into my stomach. I think she’s too young to really understand the nature of this goodbye, but she could read the mood. Ryan, he’s the middle child, promised to video call every day as long as they were in range. Dani, the eldest, didn’t seem to know what to say. They shook my hand like Linde had, very formal, and that was the end.  I watched the elevator as far as I could. After a while the sun shifted to a white-yellow, cold, pure. The color of goodbye.  June 26, 2176—Luang Prabang  There’s nothing particularly special about this day, no reason it deserves to be memorialized, but life isn’t all about the big moments. In fact, life is mostly what happens in-between, and the sun shines on those days, too. That’s what this catalogue is intended to capture, after all.  I remember the day because it’s the day I stopped thinking about the future as an abstract. For as long as we’d known each other, we’d been working toward the future, cataloging and protecting and gathering seeds in the vault at Svalbard. But that future was a nebulous concept. It was for someone else, not us. That day, I started thinking about the future as a personal concept, like maybe one day we’d have a family, and they would make everything we were trying to do to make the world a better place—even in small ways—worthwhile.  We were about 60 miles outside of Luang Prabang on that day, hiking. I don’t remember the names of all the villages we passed through, but we started at the temple at Mt. Phoushi, overlooking the Mekong River.  We were there to pick up three new and heartier strains of Oryza sativa—rice, in layman’s terms. They could have been shipped to the vault, but you convinced the director to let us act as couriers. We changed each other over the years, Mila. When we first met, you would quote rules and regulations and procedure for hours on end. I like to think I taught you to appreciate the spirit of the law, as much as the letter of it. It’s like the way my concept of the future changed. I’d like to think I helped you see that we weren’t just protecting plants as a nebulous concept; we were protecting living things you could touch and hold in your hand and appreciate for more than just their potential.  And you taught me to see a wider world. Before I met you, I never thought much beyond the present moment. You expanded everything. I loved you more than I loved myself, and that made my world so much larger than it had ever been before. You taught me that the future is worth protecting, even the parts I won’t live to see. You taught me to have hope.  We did some touristy things in Luang Prabang—the temple, the Royal Palace, the Night Market—but it’s the hike I remember the most. Our guides took us in a boat across the Nam Xuang. I think there were about ten of us, total. Tourism was on the decline already in those days. We hiked for maybe five or six hours, past rice paddies and through jungles. We stopped in a little village where we watched children play soccer.  And that was where it hit me, the idea of having a personal stake in the future. We hadn’t even talked about kids yet, but I found myself wondering what our family would be like. Not if we would have one; it suddenly seemed like a given. We were so in love, how could that love help but spill over and spread outward and keep on multiplying itself?  I wondered if our kids would be happy. If they’d play soccer, running around with pure, unfettered joy. I wondered if they would grow up to have kids of their own.  When Kathe was born, I worried about so many things. I wanted to do everything to protect her. You were the one who finally got me to relax, to let go a little. She would be her own person; we’d given her everything she needed to get a good start in life. And you were right, Mila. We raised some good kids. Or, really, they grew into good people, and we managed to not fuck it up by getting in their way.  After that first village, we hiked to another village where all the houses were on stilts, and they gave us strong rice wine to sample. At our last stop, the villagers had set out a dinner to share with the hikers and our guides on a long wooden table in a barn. Before we ate, we watched the sun go down. It was less a sunset and more a sense of the light being swallowed by the mist, diffusing and turning the sky the color of a new peach, sliced thin and still holding the warmth of the day—sweet and melting and bright on the tongue.  What I remember most is the way the light caught in a curl of your hair, just before the sun vanished. It reminded me of our wedding day, except instead of flyaway strands, the hair stuck in the sweat on the back of your neck. It was like you’d found a way to braid the sunlight and make it a part of you.  I know that sounds incredibly sappy, but it’s true. Or, at least, I’ve built it into truth over the years. That’s what people left alone with their thoughts and their gray kittens named after prehistoric animals do. They invent narratives to make sense of their lives and to fix the pattern of those lives more firmly in their minds. Even if that isn’t the way the sunlight looked on that particular day, that is how I choose to remember it. That is the image I’m sending out among the stars.  June 30, 2232—Svalbard  Today was the last day, or the first day, depending on how you look at it. The Arber has officially set sail, or whatever word one uses for the departure of a ship the size of a city without masts or cloth or anything resembling a sail.  This is the first day of the new age of humanity.  Our children’s children’s children, will they even be human anymore? Born in space, living all those years on a ship under sunlamps and breathing recycled air. Will they still call themselves human when they land on a new world and make it their own?  I don’t have any answers. How can I speak to the big questions of life when the small ones still elude me? How do you love someone and let them go? How can someone be a stranger and still be your own flesh and blood? How can you feel closer to someone who isn’t even on Earth any more than you ever did when they were right there beside you?  Indulge me for a moment, Mila. I know you always hoped my relationship with Thomas would be more like my relationship with Kathe. The truth is, there was always a rift between us. Maybe we both sensed it, and so we kept our distance. Or maybe it was just a failure on both of our parts to try.  When you died, the rift widened, and everything came crashing down. Thomas blamed me. He told me in no uncertain terms that I should have forced you to undergo gene therapy. As if your body, and the decisions you made regarding it, were any business of mine. I told him over and over again it wasn’t what you wanted. You’d considered and discarded that option.  There were days I agreed with him though, and that hurt the most. I lashed out at him, when I really wanted to lash out at you. At the end, when you were delirious, I couldn’t help thinking—could I have done more? Could I have forced you? In the end, I respected your wishes. In the end, I sat by and watched you die.  I know, there are no guarantees that the gene therapy would have worked. It might have led to more suffering. But I can’t help wondering . . . You dedicated your life to the vault and to Svalbard, to cheating nature by finding stronger, heartier crops to withstand droughts and monsoons. You were determined to do everything you could to give them more than a fair and fighting chance to survive. Why wouldn’t you take that road yourself?  I didn’t understand at the time. I think I’m closer to understanding now. At my age, death is no longer a nebulous concept far away. I’ve thought about it and what I do and do not want it to be. I don’t want to be hooked up to machines on a spaceship fighting for a few more hours or months or years. I don’t want to be stuck in a cold-freeze drawer just so my distant descendants can put flowers on my grave under an alien sun. It’s my death; I want to own it. Death is the last thing we do as human beings, so I’m damned well going to do it on my own terms.  Does that make sense, Mila? That I can blame you and hate that you left me and still send our children off into space and insist on staying behind? I suppose we’re all a bundle of contradictions in the end. Maybe that’s what ultimately makes us human. No matter what other changes or adaptations occur, that will survive.  Kathe came and sat on the porch with me before boarding the last elevator to the station. We sipped strong black coffee. She held my hand. We didn’t speak. In the end, at the end, we sat and watched the skua and the kittiwakes. We watched the sun play on the water. Then she kissed my cheek and that was goodbye.  I watched the sky for a long time after she left. I imagined if I shaded my eyes just right, I would be able to see something as the Arber set sail. I would know, or feel it deep in my bones. But there wasn’t anything to see.  No, that isn’t quite true. There was the sun. On the last day, on the first day, the sun was bright and clean and it threw a halo around itself, a celebration or one last goodbye, although it was only those who were staying behind who would ever see. The light on the last day of the world was every color the sun could be, all the colors it won’t be in space.  I read once that every person who sees a halo around the sun or the moon sees their own individual halo. Even two people standing right next to each other wouldn’t see exactly the same thing. The light breaks through different atmospheric crystals for each of them, no two beams fracturing in quite the same way. Every halo is unique.  I suppose that’s all there is. I’m sending this out into the stars to travel to new worlds, so new generations will be able to look back to know how the sun looked on a particular day back where their parents’ parents’ parents came from. So they’ll know how the sun looked to one specific person as it bounced off the water or rested against the skin of someone he loved or slipped beneath the rim of the world.  Now, I’m going to make myself another cup of coffee and sit out on the porch a little while longer. Maybe I can even coax Predator X onto my lap. I may be alone, but I’m not lonely. I have everything I need. You’re buried here, and from the moment I met you, I’ve never known how to be anywhere else but with you. The future is out there among the stars, but I’m where I belong. I’m home.    Originally published in Sunvault: Stories of Solarpunk and Eco-Speculation, edited by Phoebe Wagner and Brontë Christopher Wieland. A.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers.", "text": "6740 words, short story, REPRINT\nA Catalogue of Sunlight at the End of the World\nJune 21, 2232—Svalbard\nThe twenty-first of June, the Summer Solstice, the longest day and the shortest night. That means less here at the top of the world where, in this season, we have sunlight twenty-four hours a day. But it seemed like an appropriate day to start this project nonetheless.\nIn just over a week, the generation ship Arber will depart on its journey. The docking clamps will release, and it will go sailing off into space to find the future of humanity. This is my parting gift, a catalogue of sunlight from the world left behind.\nOf course the sun will still be there, getting farther away as they travel, but it won’t be the same. The people on that ship—those ships, leaving from all points above the globe—will never again see sunlight the way it looks here and now. They won’t see the sky bruise purple and hushed gold or the violent shades of lavender, rose, and flame as the sun creeps toward the horizon. They’ll never see the way this sun sparkles off water in a fast-moving brook or dapples the ground beneath a canopy of leaves. It won’t pry its way through their blinds in the morning, or slip under doors and through all the cracks sealed up against its intrusion. They won’t know the persistence of it, the sheer amount of it. They’ll only know its loss.\nMaybe the Arber’s children, or their children’s children will see starlight on the dust of some distant world, watch it pool in the craters of their first new footsteps and call it the sun. But not the ones leaving. The ones who grew up under its light. This is my gift to them. A little something to take with them into the cold and the dark.\nToday, the light is pure. There isn’t a cloud in the sky to cut it, no breeze to stir it off our skins. All the shadows are sharp-edged. There’s so much of it, it’s easy to forget it’s there. Ubiquitous sun. It gets over everything and under everything and inside it. Today, the light of the sun has almost no color at all, but if you squint just right, you can prism it, see the rainbow fractures flaring away from it. That is the sun here today, children. The sun you’re leaving behind. There has never been another just like it, and there never will be again.\nThere. That part is for the future. This part is for the present and the past. For you and me, Mila.\nKathe came to see me today and asked me one more time to go with them. There’s room, she said. You could stay with me, Linde, Ivan, and the kids until we figure things out. She didn’t mention Thomas.\nKathe has pull. It comes with being Head of Resource Management, Northern Division. She could make it happen, our girl. That’s what she does, after all. She manages resources. If she says there’s room for me, then there’s room. She could probably get me the nicest berth on the ship, if I asked.\nSpace travel is for the young, I told her. It’s no place for an old man like me. Besides, this is my home. I like it here. This is where I belong.\nBut your children, she said. Your grandchildren.\nHer eyes. It’s hard to look at them sometimes. They remind me so much of you. I think she knew she’d already lost the fight.\nWhat’s the point of space? It’s just another place to be without you. I have my kettle here. I have my woolen socks and my favorite mug. I have a library full of books and music. I’ve even adopted a cat. Or it’s adopted me. A little gray kitten I’ve named Predator X. They won’t have cats in space. They’ll have genetic material, of course, but it’s hard to cuddle a test tube on a cold winter’s night and be comforted by its purr.\nMay 23, 2171—Prince Edward Island\nTo hell with separating past and future. This is my catalogue, and I’ll tell it how I choose and to who I choose, and I choose you, Mila.\nObviously May 23, 2171 isn’t today’s date, and I’m not on Prince Edward Island. It’s when and where we were married. The sunlight on that day deserves to be memorialized.\nIt was golden in the way sunlight never is outside of photographs and memories. It caught in your hair, turning those flyaway strands you could never get to behave—even on that day—into individual threads of crystal. It was sunlight in its ideal form, its most romantic form. They say it’s lucky to have rain on your wedding day, but I think that’s just something to make people feel better when their bouquets and tuxedoes and cakes and dozen white doves are all soggy and miserable.\nWe were married on the beach, on the dunes, with the waves in the background and wild seagrass running everywhere around us. Those dunes are gone now. In another few years, the whole island will be gone, lost to rising sea levels like New Orleans and Florida, London and Venice. So many cities swallowed whole. But back then, it was beautiful.\nLupines and red sand—those stick out in my mind. You insisted on traveling back to your family’s home because your grandmother wasn’t well enough to travel, and you wanted her to give you away. I didn’t have any people of my own left, so one place was as good as another to me. You were all the family I wanted and needed back then. Now that my life is coming full circle, I’m finding that’s true once again.\nThe day I proposed to you was the day I stole the Gibraltar Campion from the seed vault. Silene tomentosa, your favorite flower. The first time I saw you, you were looking at a 3-D projection of it, part of the vault’s new finding aid. I didn’t know it at the time, but that was your program. You were also the one who got rare and endangered flowers added to the vault along with staple crops. You said beautiful things should be saved as well as useful ones, and besides, bees and pollination and flowers—even rare and temperamental ones—are part of our ecosystem, too.\nOn the day we met, you were looking at the Gibraltar Campion from every angle, studying it with a scientist’s eye. I don’t think you knew anyone was watching you. Then, for just a moment, your expression changed; you weren’t looking at the flower like a scientist anymore. You frowned and reached out like you wanted to brush your finger along the pale silk of its petal.\nHad you ever seen one in person? I imagined how many years you’d spent studying it and how you’d launched a whole program to protect it and other flowers like it. But had you ever held its thin stem between your fingers or breathed it in to see if it had a scent? That unguarded moment of fascination and longing—that’s the moment I fell in love.\nIt was hell getting the Campion to grow. I sweated over it in secret, afraid of giving it too much water, not enough. But I did get it to grow. That was always my gift. Can’t cook worth a damn. Never had a scrap of musical talent or enough coordination to play sports. Green thumbs, though. I have those like nobody’s business. It’s why I was hired on at the Global Seed Vault in the first place. It’s what led me to you, so I can’t complain.\nSmuggling my Gibraltar Campion into Canada without getting caught— that was a special hell all of its own. Then I presented you with the bouquet—the sad, single-flower bouquet I was so proud of—right before you walked down the aisle of sand and seagrass, and you almost called the wedding off right then and there.\nWhat the hell were you thinking? you said. Do you have any idea how rare the Gibraltar Campion is? They brought it back from the dead. It was nearly extinct. What the hell do you think the vault is for anyway?\nStoring up flowers so no one ever sees them? A vault full of potential, but never the reality?\nOf course I didn’t say that aloud. I wouldn’t dare.\nSome things are meant to be enjoyed, is what I did say, and I tried to charm you with a smile. Sometimes you have to appreciate what you have while you have it, instead of holding on to it for someday. You just have to live and let go and stop worrying about the future.\nYou called me selfish and a dozen other more unsavory names. You almost shoved me into the water. God, I was young and stupid back then. But somehow, I convinced you to marry me anyway.\nYou stayed mad at me through the whole ceremony. You refused to hold the Campion, so I held it, and you glared at me the whole time you said your vows. At the end though, you smiled a little, too. Then you cried; we both cried, and you told me if I ever did anything that stupid again you would throw my body into a bottomless crevasse where it would never be found. When we kissed, it tasted like salt, and we crushed the Campion between us, and we laughed so hard we started crying all over again.\nI miss you, Mila. Every goddamn day.\nJune 23, 2232—Svalbard\nThere was a big party down on the beach today. A goodbye for everybody leaving and everyone staying behind. We lit a huge bonfire, which seems strange in the middle of the day, but when the sun never goes down, what else can you do?\nThis is what the sun looked like five days before everyone went away. Weak, like tea or good scotch watered down a thousand times. Like if you took a glass and kept adding ice to it every time you took a sip, trying to stretch that last bit of alcohol just a little farther. Sunlight, divided infinitely and spread thin, the faintest hint of peat and smoke on the tongue.\nIt was mostly overcast, but every now and then something would break loose in the great patchwork of gray and a beam of light would come shooting through. It might pin the stones on the shore or a little boy’s hair as he ran toward the water. It might catch a mother and daughter in a tender moment of goodbye or fall on the waves and break over and over again. Sunlight is like that, fickle and faithless. It shines on us all.\nListen to me getting melancholy. Then again, it is the end of the world.\nEveryone was there. We probably only made up a handful, compared to other celebrations around the world, but this was ours. We roasted fish on wooden spits. There were marshmallows and tofu hotdogs. Someone made a spicy curry with goat meat; someone else made a giant pot of borscht. There were real English popovers. There was even an attempt at poutine. You would have loved it.\nA kitchen party. That’s what it reminded me of. Not that I’d ever been to one, but from your descriptions—everyone getting together, each person bringing food and something to drink and an instrument. Your grandmother used to throw them, just like the old days, you said. The whole house would be open to anyone who wanted to join in, music spilling out of every door and window all night long.\nThe party on the beach was like that, music and dancing, and all of it just seemed to roll on and on. Kathe was there with Linde and Ivan and the kids. Thomas was there, too, with Leena and their kids. Honestly, I’m surprised they never left Svalbard, Thomas especially. We chose this life, but Thomas and Kathe were born into it. Maybe they stayed because they’d already put down roots here or maybe because we have the illusion of safety up here at the top of the world, while wildfires and earthquakes, mudslides caused by deforestation and rising tide lines ravage the globe.\nWhatever the reason, I’m glad they stayed; I got to see my grandchildren. On the day of the party, they all ran around on the shore together, chasing the black-legged kittiwakes and the long-tailed skua. Even Dani, who’s almost thirteen now, too old for playing and entering that awkward stage of being caught between everything.\nKathe came to talk to me when things quieted down and the mood turned somber. We all looked up and remembered the space elevator was still going nonstop, bringing people and supplies up to the station and then to the Arber, all those eager and heartbroken people, ready to start their future.\nWhat will you do when we’re all gone, Dad? Kathe asked. We sat side by side, looking out at the ocean.\nWe’ll get by, I told her. There will just be less of us. The Andersens are staying, and the Guptas. Raj is already planning a rotating dinner party. Everyone will take a turn hosting, and we’ll keep each other company. Besides, things aren’t too bad here, not like it is further south, and we still have the elevator and the station if things do get bad. In the meantime, I’ll have my garden, and I have Predator X. Helen Holbrook is going to teach me how to make cheese if I help her milk her goats.\nI tried to make it sound cheerful, like it would be a continuation of the party on the beach, but smaller. Kathe didn’t look like she believed me. In truth, I knew there would be lonely days, but there would be days I relished my solitude, too. When you get to be my age, you surprise yourself by how often you’re content to just sit and think.\nWe sat quietly for a bit then. It reminded me of when Kathe was little, before Thomas was born. In fact, it was when you were pregnant with Thomas. While you napped in the afternoons, I would bring Kathe to the beach to collect stones and look for fossils. She never shared our love of growing things, that one, though she was curious as hell. It was all about stillness with Kathe, the frozen remnants of the past. Funny, then, that she’s the one going up into the stars, not me.\nAnd Thomas, well . . . Maybe I should have tried harder to understand him and the things he loved, but with Kathe it was so much easier. She wore her heart on her sleeve, while Thomas was so closed and serious. He was never a little boy, not really. It was more like he was born a grown-up, and he was just waiting for his body to catch up with his mind.\nWe’ll still talk, I told Kathe after a while, as long as the ship is in communication range. And after that, we’ll have the ansible. Besides, it’s not like I’ll be alone, if you’re worried about me.\nI do worry, she said. That’s a daughter’s job.\nWhen did you get old enough for that to be true? I asked, and that made her smile at last. It was good to see. Besides, I said, it’s not like the world is really ending. Just changing, that’s all.\nI know, but there are some things I don’t want to change, Kathe said, and right then she wasn’t Head of Resource Management, Northern Division, she was just our little girl again, and it nearly broke my heart. You’ve been there for me my whole life, me and Tom both, and I don’t know what I’ll do without you.\nI squeezed her hand, and we both blinked against more than just smoke from the bonfire.\nYou’ll be fine, kiddo.\nI was searching for something else to say, something inspirational and comforting, but Thomas came over and nudged the tip of Kathe’s boot with his toe.\nCan I talk to Dad for a minute? he said. Alone.\nI can’t remember the last time I heard Thomas call me Dad. I didn’t think I would ever hear it again.\nKathe looked surprised, but she gave Thomas her spot and gave us our privacy.\nI know Kathe has tried to talk you into taking a place on the ship about a hundred times. Thomas kept his hands in his pockets while he talked, his gaze on the horizon. I’m not going to rehash all that. I just wanted to let you know she’s not the only one. I know we haven’t always seen eye to eye, but you’re my father.\nI opened my mouth to say something or maybe just take a breath in surprise, but Thomas held up his hand to stop me.\nJust let me finish. He looked down and didn’t raise his head again.\nWhen Mom died, it was the hardest thing I’d ever had to watch. I know, and Thomas held his hand up again, even though he didn’t look at me. I’m not here to open old wounds. I just wanted to say it was hard, but you were there for Mom, every day. Kathe and I were there, too. She had her family all around her. She didn’t have to go through any of it alone. When your time comes, I just thought . . . I always thought we’d be there for you.\nHe looked up finally. His eyes aren’t like yours, or Kathe’s. They’re more like my mother’s. I didn’t know what to say to him, Mila. I’ve never known. He touched my shoulder, let his hand rest for a moment, then walked away.\nI’ve been thinking about it since leaving the beach. Thomas deserves an explanation. And Kathe. Maybe you deserve an explanation, too.\nWe spent our lives building the future, saving all those plants and flowers in the vault, not to mention our own future with Kathe and Thomas. Now that the future’s here, I’m terrified. Thomas was right, watching you die was the hardest thing I’ve ever had to do. I don’t want that for our children, and I don’t want that for myself.\nMaybe a bit of it is selfish. A man gets to a certain age, and he wants to live his life on his own terms. I think I understand the choices you made now a little better than I used to. When the end comes, when my end comes, I want to go quick and painless, not hooked up to machines. I’ll choose the time and place of my death, when I’m ready, and I want it to be here on Earth with you.\nIn space, even death will be different. Kathe explained it to me. There’s a morgue on the generation ship that is also a chapel and a burial chamber and a cryo-storage unit. Aboard the Arber, people will have the option of being ejected into space, being recycled—protein and calcium and other vital elements broken down and reused in a variety of ways—or being stored until their remains can be buried on the same alien world where our new crops will grow. That’s what death looks like in the next great age of humanity.\nI understand that Thomas and Kathe want to be with me at the end, but this is the point where our roads diverge. You and me, we did what we could to build the future, Mila, but it isn’t for us. Why should Kathe and Thomas bring grief with them among the stars when they can carry memories instead? I want them to remember me as I am now, not the way I might be one day down the road.\nIt’s like we said all those years ago—sometimes you just have to live in the moment and enjoy what you have now, not hold on for one day and what’s to come. I want to enjoy what’s here while I can. We were the last generation who could have turned the tide. By the time Kathe and Thomas came along, it was too late to undo the mess we’d made. Climate change had already passed the tipping point, and whatever measures we put in place from then on out could only slow things down, not reverse them.\nPerhaps it sounds egotistical, but I feel I owe it to the Earth to stay with her as long as I can. No one, not even a planet, should have to die alone.\nAugust 16, 2200—Colorado\nI’m going to cheat and talk about starlight, instead of the sun. Then again, the sun is a star, even if we usually don’t think of it that way. The stars on this particular day are important to remember; it’s the day we started saying goodbye.\nWe were vacationing in Buena Vista, staying at a resort built up around a hot spring. We went skinny-dipping in the springs on our last night, and even though it was high season, we had the place entirely to ourselves. You leaned back against the pool’s edge, and said, Well, I’m dying. Just like that.\nYou’d been losing weight for a while, but I wanted to pretend it was just your appetite slowing down now that we were both past middle age. You’d already considered all your options, you told me, talked to all the doctors. You’d tried everything there was to try—radiation pills, alternative therapy, even the more aggressive forms of chemo like they had in the old days. Those weeks you told me you were visiting your sister? You were really puking your guts out, suffering, but you didn’t want me to worry until you were really sure there was something to worry about.\nThe only thing left to try was gene therapy, and that was a bridge too far. It’s fine for babies, you said, fetuses in the womb who don’t know any better, but I know who I am and I wouldn’t feel like myself anymore if I let them scrub me clean. It’s my own body’s cells betraying me. Maybe I just have to live with that. Besides, why go through all that trouble and expense when at my age, there’s only a five percent chance of success? I want to enjoy as much of the time I have left as I can, not spend it hooked up to machines.\nThen you reached into the backpack you’d carried out to the hot springs with us and pulled out a small terra-cotta pot holding a Gibraltar Campion. It might have been from the very same seed batch as the one I grew for you all those years ago. Yours was barely a seedling though, growing crooked like it wouldn’t survive a strong wind.\nI never did have your knack for it, you said. You held out the pot to me and smiled that lopsided smile of yours. Sometimes you just have to live for the moment, right? Appreciate what you have and not worry about the future.\nDamn you for throwing my words back at me. How dare you give up? How dare you throw everything away when we still had so much living to do? But I could only stare at you and the Campion.\nYou let a full minute of silence go by before you asked me if I was okay. If I was okay when you were the one dying. What could I say? All my words dried up in that moment. You took my hand. We sat in the hot spring, your fingers in mine under the water, and tears ran down my face. Later, we made love, and I was crying then, too. I think I cried more that night than I did at your funeral.\nThe sky was utterly clear. There’s nothing like a skyscraper for miles in Buena Vista and next to no light pollution. On a night as clear as the one on which you told me you were dying, the sky was a bowl of blue so dark it passed into black and came out the other side.\nThat blue-dark bowl closed over the mountains, sealing us in, but everywhere we looked, there was light. I want to say the stars were bright, and they were, but they were so bright and there were so many of them, they looked fuzzy.\nThe stars between the stars were visible, and somehow it was different than looking at them from the top of the world, even though there isn’t much light pollution in Svalbard either. The stars seemed farther away. They seemed alive, like the whole of the dark was crawling with silver. I could almost see the arm of the Milky Way unfurling around us. It was enough to make me dizzy. Or maybe that was the hot water from the spring. Or the thought of letting you go.\nRight before we fell asleep that night, you lay spooned against my back. I held your hands, your arms pulled all the way around me. I thought if I held on tight enough, maybe you wouldn’t go. You leaned forward and whispered in my ear, Take care of my flower for me, when I’m gone.\nI still have the damn thing, Mila. Or at least its descendant. It’s sitting on my windowsill. Predator X hasn’t knocked it over yet, not for lack of trying. I want that flower to be the last thing I see in this world. When I’m too old and frail to walk around anymore, I’ll keep it by my bedside. It’s a little piece of you, so when I die, I won’t be doing it alone.\nJune 24, 2232—Svalbard\nLinde and Ivan are taking the kids to get settled on the ship today. Kathe will join them just before launch. Thomas and Leena are already on board.\nBefore Linde and Ivan boarded, Ivan asked me if I was sure I hadn’t changed my mind. I never expected him to be the one. I had to bite my tongue to keep from asking if Kathe had put him up to it, but there was genuine regret in his eyes. Linde shook my hand, firm and strong as always. Ivan hugged me. I couldn’t ask for better children-in-law.\nSometimes I think of the dangers Kathe, Linde, Ivan, and even Thomas will face up there. What would you think of me, letting our children, their spouses, our grandchildren go off into the dark alone? Kathe, Linde, Ivan, Thomas, and Leena will likely never see an alien world, let alone set foot on one. It’ll be their children, their children’s children who will colonize the stars. If they make it that far.\nI think of all the things that could go wrong—a critical failure in the engines; explosive decompression blowing them all out into space; a plague; failure of the shipboard crops and death by slow starvation. Those possibilities are next to none. Kathe gave me the figures, something like a 0.001% chance. Me being on board certainly wouldn’t tip the balance one way or another. Still, it’s a parent’s job to worry.\nThis is what the sun looked like on the day my grandchildren climbed aboard the space elevator and we all said goodbye.\nThe ocean was a sullen color, like pewter, but with a shine. Maybe tarnished silver would be a better comparison, the surface dull but with a brightness hidden underneath. The sun had a pinkish tint to it. Pink is normally a warm color, but this pink was cold. Like the inside of a shell fresh out of the sea or a thin sliver of pickled ginger. Like skin, when all the warmth of blood and a beating heart has gone out of it and it’s just a container, no longer full.\nThere were clouds, a very few of them, scattered across the sky. The kittiwakes and skua glided on the wing, and every now and then one of them would let out a cry.\nElla, that’s Kathe and Linde and Ivan’s youngest, cried when she hugged me. She put her arms around my waist, and pressed her face into my stomach. I think she’s too young to really understand the nature of this goodbye, but she could read the mood. Ryan, he’s the middle child, promised to video call every day as long as they were in range. Dani, the eldest, didn’t seem to know what to say. They shook my hand like Linde had, very formal, and that was the end.\nI watched the elevator as far as I could. After a while the sun shifted to a white-yellow, cold, pure. The color of goodbye.\nJune 26, 2176—Luang Prabang\nThere’s nothing particularly special about this day, no reason it deserves to be memorialized, but life isn’t all about the big moments. In fact, life is mostly what happens in-between, and the sun shines on those days, too. That’s what this catalogue is intended to capture, after all.\nI remember the day because it’s the day I stopped thinking about the future as an abstract. For as long as we’d known each other, we’d been working toward the future, cataloging and protecting and gathering seeds in the vault at Svalbard. But that future was a nebulous concept. It was for someone else, not us. That day, I started thinking about the future as a personal concept, like maybe one day we’d have a family, and they would make everything we were trying to do to make the world a better place—even in small ways—worthwhile.\nWe were about 60 miles outside of Luang Prabang on that day, hiking. I don’t remember the names of all the villages we passed through, but we started at the temple at Mt. Phoushi, overlooking the Mekong River.\nWe were there to pick up three new and heartier strains of Oryza sativa—rice, in layman’s terms. They could have been shipped to the vault, but you convinced the director to let us act as couriers. We changed each other over the years, Mila. When we first met, you would quote rules and regulations and procedure for hours on end. I like to think I taught you to appreciate the spirit of the law, as much as the letter of it. It’s like the way my concept of the future changed. I’d like to think I helped you see that we weren’t just protecting plants as a nebulous concept; we were protecting living things you could touch and hold in your hand and appreciate for more than just their potential.\nAnd you taught me to see a wider world. Before I met you, I never thought much beyond the present moment. You expanded everything. I loved you more than I loved myself, and that made my world so much larger than it had ever been before. You taught me that the future is worth protecting, even the parts I won’t live to see. You taught me to have hope.\nWe did some touristy things in Luang Prabang—the temple, the Royal Palace, the Night Market—but it’s the hike I remember the most. Our guides took us in a boat across the Nam Xuang. I think there were about ten of us, total. Tourism was on the decline already in those days. We hiked for maybe five or six hours, past rice paddies and through jungles. We stopped in a little village where we watched children play soccer.\nAnd that was where it hit me, the idea of having a personal stake in the future. We hadn’t even talked about kids yet, but I found myself wondering what our family would be like. Not if we would have one; it suddenly seemed like a given. We were so in love, how could that love help but spill over and spread outward and keep on multiplying itself?\nI wondered if our kids would be happy. If they’d play soccer, running around with pure, unfettered joy. I wondered if they would grow up to have kids of their own.\nWhen Kathe was born, I worried about so many things. I wanted to do everything to protect her. You were the one who finally got me to relax, to let go a little. She would be her own person; we’d given her everything she needed to get a good start in life. And you were right, Mila. We raised some good kids. Or, really, they grew into good people, and we managed to not fuck it up by getting in their way.\nAfter that first village, we hiked to another village where all the houses were on stilts, and they gave us strong rice wine to sample. At our last stop, the villagers had set out a dinner to share with the hikers and our guides on a long wooden table in a barn. Before we ate, we watched the sun go down. It was less a sunset and more a sense of the light being swallowed by the mist, diffusing and turning the sky the color of a new peach, sliced thin and still holding the warmth of the day—sweet and melting and bright on the tongue.\nWhat I remember most is the way the light caught in a curl of your hair, just before the sun vanished. It reminded me of our wedding day, except instead of flyaway strands, the hair stuck in the sweat on the back of your neck. It was like you’d found a way to braid the sunlight and make it a part of you.\nI know that sounds incredibly sappy, but it’s true. Or, at least, I’ve built it into truth over the years. That’s what people left alone with their thoughts and their gray kittens named after prehistoric animals do. They invent narratives to make sense of their lives and to fix the pattern of those lives more firmly in their minds. Even if that isn’t the way the sunlight looked on that particular day, that is how I choose to remember it. That is the image I’m sending out among the stars.\nJune 30, 2232—Svalbard\nToday was the last day, or the first day, depending on how you look at it. The Arber has officially set sail, or whatever word one uses for the departure of a ship the size of a city without masts or cloth or anything resembling a sail.\nThis is the first day of the new age of humanity.\nOur children’s children’s children, will they even be human anymore? Born in space, living all those years on a ship under sunlamps and breathing recycled air. Will they still call themselves human when they land on a new world and make it their own?\nI don’t have any answers. How can I speak to the big questions of life when the small ones still elude me? How do you love someone and let them go? How can someone be a stranger and still be your own flesh and blood? How can you feel closer to someone who isn’t even on Earth any more than you ever did when they were right there beside you?\nIndulge me for a moment, Mila. I know you always hoped my relationship with Thomas would be more like my relationship with Kathe. The truth is, there was always a rift between us. Maybe we both sensed it, and so we kept our distance. Or maybe it was just a failure on both of our parts to try.\nWhen you died, the rift widened, and everything came crashing down. Thomas blamed me. He told me in no uncertain terms that I should have forced you to undergo gene therapy. As if your body, and the decisions you made regarding it, were any business of mine. I told him over and over again it wasn’t what you wanted. You’d considered and discarded that option.\nThere were days I agreed with him though, and that hurt the most. I lashed out at him, when I really wanted to lash out at you. At the end, when you were delirious, I couldn’t help thinking—could I have done more? Could I have forced you? In the end, I respected your wishes. In the end, I sat by and watched you die.\nI know, there are no guarantees that the gene therapy would have worked. It might have led to more suffering. But I can’t help wondering . . . You dedicated your life to the vault and to Svalbard, to cheating nature by finding stronger, heartier crops to withstand droughts and monsoons. You were determined to do everything you could to give them more than a fair and fighting chance to survive. Why wouldn’t you take that road yourself?\nI didn’t understand at the time. I think I’m closer to understanding now. At my age, death is no longer a nebulous concept far away. I’ve thought about it and what I do and do not want it to be. I don’t want to be hooked up to machines on a spaceship fighting for a few more hours or months or years. I don’t want to be stuck in a cold-freeze drawer just so my distant descendants can put flowers on my grave under an alien sun. It’s my death; I want to own it. Death is the last thing we do as human beings, so I’m damned well going to do it on my own terms.\nDoes that make sense, Mila? That I can blame you and hate that you left me and still send our children off into space and insist on staying behind? I suppose we’re all a bundle of contradictions in the end. Maybe that’s what ultimately makes us human. No matter what other changes or adaptations occur, that will survive.\nKathe came and sat on the porch with me before boarding the last elevator to the station. We sipped strong black coffee. She held my hand. We didn’t speak. In the end, at the end, we sat and watched the skua and the kittiwakes. We watched the sun play on the water. Then she kissed my cheek and that was goodbye.\nI watched the sky for a long time after she left. I imagined if I shaded my eyes just right, I would be able to see something as the Arber set sail. I would know, or feel it deep in my bones. But there wasn’t anything to see.\nNo, that isn’t quite true. There was the sun. On the last day, on the first day, the sun was bright and clean and it threw a halo around itself, a celebration or one last goodbye, although it was only those who were staying behind who would ever see. The light on the last day of the world was every color the sun could be, all the colors it won’t be in space.\nI read once that every person who sees a halo around the sun or the moon sees their own individual halo. Even two people standing right next to each other wouldn’t see exactly the same thing. The light breaks through different atmospheric crystals for each of them, no two beams fracturing in quite the same way. Every halo is unique.\nI suppose that’s all there is. I’m sending this out into the stars to travel to new worlds, so new generations will be able to look back to know how the sun looked on a particular day back where their parents’ parents’ parents came from. So they’ll know how the sun looked to one specific person as it bounced off the water or rested against the skin of someone he loved or slipped beneath the rim of the world.\nNow, I’m going to make myself another cup of coffee and sit out on the porch a little while longer. Maybe I can even coax Predator X onto my lap. I may be alone, but I’m not lonely. I have everything I need. You’re buried here, and from the moment I met you, I’ve never known how to be anywhere else but with you. The future is out there among the stars, but I’m where I belong. I’m home.\nOriginally published in Sunvault: Stories of Solarpunk and Eco-Speculation, edited by Phoebe Wagner and Brontë Christopher Wieland.\nA.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers.", "source": "https://clarkesworldmagazine.com/wise_11_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Catalogue of Sunlight at the End of the World by A.C. Wise"}