{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kali Wallace", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "mUam7CvjlT6aB59Dd+mYBMOGe/U=", "id": null, "license": null, "comments": "", "raw_text": "5950 words, short story  No Portraits on the Sky  The stranger fell from the sky just after dawn.  Rela heard the snap of branches and looked up. The sun was rising in a gray haze beyond the forest’s eastern edge, and the mist was retreating from the aerie. In the canopy above, a dark figure tumbled through the fog, bouncing from branches and whipping past leaves. Rela watched with her breath caught in her chest, her heart stuttering. But as the person fell closer she could see he was no skywarden. He wore no tools, no ropes, no soft sticky gloves the color of spider silk.  The stranger missed the bridge as he fell, but a line of cocoons caught him. He tangled in the ropes and set the pods swaying before twisting free again. Rela heard a thump as he landed. She couldn’t see the platform through the shivering leaves and broken cobwebs, and when she held her breath to listen, she heard no shouts of alarm, no curious cries. There was only the drip of dew and the rustle of settling branches.  Holding tight to the bridge, Rela leaned over the ropes for a better view of the sky. The canopy was thick, but she was high enough and there were breaks enough for her to see patches of bland gray through the trees, and the dark imperfections marring its smooth expanse.  Everybody in the forest knew the sky was falling. They muttered and fussed when scraps ripped free and fluttered down, draped over gardens and saplings and pods, left brown patches of crisp leaves and dead moss behind. Some days it was worse than others, a soft white rain, and spiders scurried to devour what they could before it did too much damage. Children, unconcerned, collected the tatters to poke them with sticks, burn them with embers, and laughed as the translucent threads pulled and curled and shriveled. The fallen sky made a high hissing noise as it burned, not unlike the call of the fat brown beetles that lived in knots and hollows.  Everybody knew the sky was falling, but Rela didn’t know if there were more wounds now than there had been yesterday. She rarely looked at the sky anymore.  Her spiders chattered and nipped at her bare arms. The ropes the stranger had struck were old, easily frayed, and the cocoons dangled precariously.  “Fix the line,” Rela said. The words trembled on her tongue, but her spiders calmed at the sound of her voice. One of the largest, a green and gold ropemaker with bright sparking eyes, crept down her arm and onto the rope. Rela stroked a hand over its back and let it nip at her fingers. “Fix the line, lovely. Go.”  The spider scurried away, and others followed, trailing fresh threads of silk. Rela left them to their repairs and followed the bridge to the nearest trunk, climbed down a ladder and crossed to a junction between three trees. There she stopped, and again she listened. This corner of the aerie was remote, little used and little visited, home only to the faded cocoons of sleepers whose names and faces were long forgotten. That was why she had chosen it for her morning routine, apart from her fellow weavers who spoke to her in soft voices, with pitying glances; they did not know what to say to her anymore, and she preferred to work alone. The swaying cocoons and bright blue lights of her spiders’ eyes were the only sign anything had disturbed the canopy.  Nobody else had seen the stranger fall.  Her heart still pounding, her throat tight, Rela crossed a bridge to an old platform. Its wooden planks were softened with mold, split and warped by water and time. Half a dozen cocoons hung around its perimeter: sleepers who had been wrapped and silent for longer than Rela had been alive. Silk webs draped the cocoons in delicate curtains, and through the veils their painted features were soft, indistinct, their eyes no more than dark, blank blotches, their solemn mouths washed away.  The stranger lay face-down at a corner of the platform. His shoulders were twisted, both legs bent, one arm tucked crookedly beneath his chest. Rela hesitated, uncertain, but she could not help if she could not see his injuries. She dragged him away from the edge and rolled him onto his back. An odd gray cloth, soft and slick to the touch, covered his entire body. He wore no harness and carried no tools. His arms were too short, his legs too long, and a smooth, blank mask hid his face.  Rela drew her knife. Her spiders crowded up her arms and back. She saw no blood yet, but they could smell it, and they clicked and flashed eagerly as she sliced into the gray cloth to free the man’s shoulders and arms, his neck beneath the unsettling blank mask, his hips and groin and peculiar long legs. Beneath the pliable gray fabric there was another layer, soft, white, damp with sweat and splotched with blood. Rela cut that away as well. It had been a long time since she had used her spiders to heal broken bones and battered flesh, but she remembered what to do, and with each careful step she pushed her worry about where the man had come from to the back of her mind.  “Go on,” she said, but quietly, a whisper that would not carry.  The spiders raced down her arms and picked away the white fabric to reveal the stranger’s skin. Beneath the man looked like no person Rela had ever seen. The people of the forest were the same color as the leaves, softer green for those who dwelt in the shade, deeper green for those who climbed in the canopies and worked in the sunlight, and their hair curled and tangled like vines. The stranger was as brown as wood and hairless all over.  And he was alive. Each breath was shuddering and shallow, but he was alive.  Rela pressed the tip of her knife into the man’s side and opened a cut the length of a finger. She held the skin apart to let a few of her smallest spiders pick their way through his seeping blood. They balked and blinked at the first taste, but Rela did not let them flee.  “Go in,” she said firmly. “You remember, little ones. Go in. Heal.”  Reluctant, flashing their dismay, a dozen quick red spiders burrowed into the stranger’s body and pulled the incision closed after them. Rela sent others down the man’s legs to chew away the last of the gray clothing and weave a sturdy cocoon around his feet.  She turned her attention to the man’s head. Bruises mottled his neck and shoulders, and the mask he wore was as hard as the shell of a nut. In its flat, reflective surface Rela saw only her own face and the sparking eyes of the spiders perched on her shoulders. She probed around the stranger’s jaw and neck with her fingertips, worked the mask loose and pulled it free. The stranger’s face was as brown as the rest of his body, round and young and smooth. His dark hair was shaved close to his scalp. Rela pressed a finger to one eyelid to pull it open.  The stranger gasped. Rela jerked back, but she caught herself before she lost her balance. The spiders chirped and flashed and fled before gathering again. A strangled half-word escaped the man’s throat. It drew into a long, pained groan when he tried to lift his head. Rela placed a hand on the man’s brow; his skin was hot and damp with sweat.  “Don’t move,” she said. “Don’t move. You’re hurt.”  She rubbed her thumb soothingly over his forehead and leaned close to look him in the eyes. His pupils were wide, his gaze unfocused. She did not know if he saw her at all.  “Who are you?” she asked. “Where did you come from?”  His lips moved again and for one sharp moment Rela thought he might answer, but the only sound he made was a hiss of pain. His eyes closed. He sank into himself, his breath slowing, his head lolling to the side, and he was silent.  At a gesture from Rela, the spiders closed the cocoon over his chest and shoulders and neck, and finally stitched the silk across his face and the crown of his head. Those spiders trapped within moved beneath the silk in roving lumps.  Rela cleaned her knife and tucked it into its sheath. With the stranger’s brown face hidden, his strange clothes piled to the side, the gasp of his voice and what he could not say caught now within a soft cocoon, she could almost pretend her hands weren’t shaking.  There was nothing she could do for the man but let the spiders heal him, if they could, if his body was not so broken it couldn’t be stitched together again. She waited until she was certain the spiders were settled in the cocoon, then left the platform. She paused again at the junction of three bridges and looked up. The day was growing brighter, colors shifting and deepening as the sun climbed.  The sky was falling, shedding pieces of itself like old skin, but even children knew not to ask why the wardens did nothing. Not a year had passed since six skywardens had fallen to their deaths. Most of the people of the forest had never known anybody to die; the elderly and ill wrapped themselves in cocoons to sleep and heal and one day, in a distant future, emerge as young and fit again, however long it might take. The weavers had hoped to heal the skywardens too, but the rootwardens had emerged from their hollows and taken the broken bodies from the aerie before the spiders could weave a single cocoon. They claimed, later, the unlucky skywardens had been shattered beyond what any long sleep could heal. It had been decades since the forest had held even a single funeral, and now it was holding six, all at once, for strong young men and women who had climbed too recklessly and too high. From every corner of the forest people had gathered to watch the six flat boats float the river, lined with torches and draped with flowers, from the boundary roots in the east to the western caves. Funeral spiders on delicate threads had dropped to the boats in a fine pale rain, burrowed into the shrouds and emerged, scattered again into the forest. Some onlookers had flinched away, closed their eyes and held their breath; others opened their mouths and welcomed the quick stinging bites on their tongues.  Rela had watched the funeral with Kef and their daughter Marun. She hadn’t known it then, but it was the last night they would spend together as a family, the last time she would sit beside her daughter and hold her hand, listen to her breath and know she was well. They had looped thick vines into swings above the river, and they hung, embraced by a low mist that never dissipated, their eyes hot with smoke, and they let the funeral spiders crawl over their lips and across their tongues. Rela had felt a rush of dizziness with the first bite, a spike of aching fear and the rush of sickening vertigo, the terrifying last moments of one young warden’s life, but it passed.  Marun had asked, “Does it always feel like that?”  Rela had been to only one funeral before, long before Marun was born, and that had been an eccentric old woman who had refused the comforting promise of sleep. Her memories had been as green and familiar as the forest itself, sunlight and shadows, a teasing mist of dew on skin before it was gone.  “I don’t know,” Rela had said. She did not lie to her daughter. The skywardens who had fallen had been Marun’s friends and partners, and the only thought in Rela’s mind had been cold relief that it had not been another day, another part of the sky, and Marun who had fallen.  The next morning, Marun and two other young skywardens had climbed the barren apex branches of the Dusk Man, one of the forest’s oldest and tallest trees, and disappeared through a tear in the sky. They never returned. The skywardens who remained refused to climb anymore. There was occasional talk, throughout the forest, of training new wardens, sending them up with ropes and hooks and tools to heal the sky, but more often now the gossip turned to wondering if perhaps the skywardens refused because they knew there was nothing to be done.  Laughter echoed below, and Rela startled from her memory. A spider nipped at her thumb. Rela released the rope and made for the ladders.  The forest darkened as she descended, and the canopy filled with the sounds of an ordinary morning: weavers talking and singing as they worked, spiders clicking eagerly, the coursing of collected water spilling into wooden troughs. Shouts echoed as builders hoisted a repaired bridge between two trees, ropes and wooden slats swinging, filling a blank space with a curved line; their rasping saws dusted the morning with the scent of fresh-cut wood. The aerie was more crowded below, not only with weavers and their spiders, but with sleepers in their hanging cocoons. Oblong white sacs lined every branch, swaying on every bridge, every platform, their colorful painted portraits turning in and out of sight. Rela spotted a pair of painters retouching a family of cocoons hanging in a cluster like pale berries, and she thought, for a moment, to ask them where Kef was working today, to find her, to grasp her hands and lean close, her lips to Kef’s ear, and tell her about the stranger.  The urge was a fleeting burn on her tongue, like a child’s dare to taste a scrap of fallen sky, and she could not imagine how Kef would reply. She could not remember when they had stopped carrying each other’s secrets and began instead hoarding their own. She did not even know if Kef had noticed.  The painters raised their hands in uncertain greeting. Rela turned away before they could call out, but somebody else had spotted her. Approaching from the other direction, moving briskly along a bridge, was Pira, an elder weaver with threads of spider-silk white in her hair. She wasn’t alone: following on the bridge were two rootwardens. Their faces were hidden beneath deep hoods of woven bark and muddy leaves, and the planks of the bridge groaned beneath their steps. It wasn’t unusual to see rootwardens high in the trees anymore, not as it had been when Rela was a child and they had kept themselves apart, emerging rarely, and only at night. People whispered, when rootwardens passed, that they ventured higher now because the trees were rotting on the inside and driving them out.  “Rela, there you are,” Pira said. She spoke softly, and she smiled. “I’ve been looking for you.”  Panic that almost felt like relief squeezed Rela’s chest. Somebody had seen, she thought. Somebody had seen and sent for the wardens.  But Pira went on before she could speak. “There was a great deal of fall over the Sisters last night,” she said. She tilted her chin and sunlight caught her face. The Three Sisters were a cluster of trees beneath one of the weakest patches of sky; they stood at a bend in the river, well away from where the stranger had fallen. Pira said, “They could use your help, if you can spare the time. They’re quite overwhelmed.”  Lips pressed together, Rela nodded, swallowed and looked away from the rootwardens. She could not see their faces beneath their dark hoods, if they had faces at all, but she knew they were watching her. One touched the rope with its thin hand, and Pira’s spiders, clinging beside her, recoiled and scattered. The warden’s fingers were like reeds the color of still, murky water, damp and slick but strong, and Rela half-expected to see the rope disintegrate at its touch. “Don’t let it touch you,” Rela’s mother had said, when she was a child and gawking at the first rootwarden she had ever seen, a memory long since faded like an old portrait, but vivid now, surprising in its clarity. They had been collecting pitcher flowers in a pond near the roots of the boundary trees, where caves breathed cool air into the forest and water dripped in distant echoes. Rela loved plucking the soft pink blooms from a curtain of vines and tipping the nectar into her mouth when her mother wasn’t looking. When the rootwarden had appeared, a dark shape in the shadow, tall and grim beneath the arch of a black root, Rela’s mother had grabbed her hand so hard her fingers twisted together, and she had said, “Don’t let it touch you,” though it was across the water and did not seem to notice them at all. Rela had asked, in her childish innocence, why her mother was so scared, and her mother had said, “I’m not scared,” and then she had said, “We’re done here,” but she hadn’t moved until the warden was gone.  “Rela? Are you well?”  Pira’s voice was warm, kind, and her green eyes soft with understanding. Rela felt the chance as a tug at the back of her throat, as the hesitation before flinging a net or throwing a spear, knowing the fish or frog or bird might escape if she waited too long. She could tell them, Pira and the rootwardens and anybody else who might overhear. They would think her mad, confused by grief, mourning a lost daughter, but she could take them to the stranger and ask her spiders to split the cocoon and let his blood flow.  The rootwardens would take him away. They would drag his odd brown body down from the aerie, careless as hunters dragging the marsh frogs they speared. He would vanish with them into their caverns, as the fallen skywardens had vanished before, and Rela would never have a chance to speak to him.  “Is there something wrong?” Pira asked.  Rela smiled. Her spiders nipped and clicked at the back of her neck. “No, of course not. I’ll go at once to help.”  She nodded to Pira before hurrying away. Across the bridge she looked back. The rootwardens had turned their hooded faces to follow her, dark smudges of brown in the morning light.  The weavers at work in the Three Sisters did not need Rela’s help, but one, with familiar pity in her voice, sent her to the Red Guardian to weave a cocoon for an old man who had been putting off sleep for too long. His joints were swollen, his hands unsteady, his eyes cloudy. Rela helped him across the last long bridge to a platform clinging snug to the tree’s red trunk. The old man fussed and squirmed as the spiders began to work, and he did not calm until Rela asked him which of the cocoons hanging around the platform belonged to his family. He could not remember all of their names, and the paint of their portraits had long since leached away, but sharing their stories soothed his worry.  “It will be good to see them when we wake,” he said. The spiders were creeping delicately around his shoulders and neck; he twitched his head, chased a faint itch. He exhaled, and frowned, and said, “If we wake.”  “You will,” Rela said. “We all will. Close your eyes. There’s no reason to be afraid.”  The old man huffed but did as she said. A small black spider eased itself beneath the silk at his neck to place the final sting, then he was sleeping. The spiders closed the cocoon over his face, spun a rope from the crown of his head and, with Rela’s help, lifted him to hang beside the sleepers who had been his wife and brothers and children. A painter would come to give him a face in a day or two, when the silk had stiffened and dried, and his portrait would be a splash of fresh bright color until time and age washed it away. The funeral spiders would nest in the fine threads of the cocoon, and those pale blind creatures would be the old man’s only company while he slept.  Rela stayed at the Red Guardian for the rest of the day, working alone to repair damaged ropes and cocoons, speaking to no one but her spiders. She did not let herself even look toward the nameless tree where she had left the stranger to heal. When twilight fell over the forest, she left the aerie with the other weavers, nodding at those who bid her a good evening. By the time she reached the Bearded Frog, the tree where she and Kef hung their home, the forest was filled with warm yellow light and smoke from cooking fires. Rela stepped off a spiraling ladder and onto the branch that held their pod, climbed down to the web beneath and sent the spiders to their nest. She felt naked without them crawling over her arms and shoulders, without their sharp, quick legs pricking her skin.  The scent of something rich and pungent drifted from inside. Kef was making supper.  “Rela? Are you hungry?”  Kef always sounded as though she was on the verge of laughing, even when she was serious; it was the second thing Rela had noticed about her. The first had been the light of her water-green eyes as she stared up at the sky. They had met on a fine, warm day years ago, when Rela had found Kef in a nest of tangled branches high above the aerie, lying on her back amongst white flowers and purple berries growing from the tree’s cradled patches of soil. Rela had said, “You’re not supposed to be up here,” and Kef had laughed and said, “Do you ever look at the sky? Look at the sky and tell me what you see.”  Rela checked that the spiders had food and collected buckets of water to carry inside. Kef took one from her and kissed her cheek. “I thought I might see you today, but they said you were helping at the Sisters.”  There was a moment, again, the heartbeat hesitation before a frog’s fearful leap, and Rela thought she might tell Kef about the stranger. But it had been so long since the laughter in Kef’s voice had been accompanied by a smile on her lips, since she had hummed while stirring supper in a pot and touched Rela’s hand with paint-flecked fingers, and those days grew ever rarer, stretched apart, dew drops on a silk thread.  “I was on the Red Guardian,” Rela said. “There was an old man.”  Kef withdrew her hand to return to the fire. “Supper is ready, if you’re hungry.”  They filled wooden bowls with soup made of fish and mushrooms. Kef spoke about her day, about the woman whose portrait she was preparing to paint, the stories and memories that through Kef’s brushes of silk and bristle would cover a fresh cocoon while the woman slept. Every cocoon was unique, every portrait singular. Kef had hoped, once, that Marun would follow in her footsteps, as Rela had hoped she might take a liking to the spiders. But Marun had chosen the sky.  There was still a seat for Marun at their table, and the hammock where she had slept as a child still hung high on the curved wall. She had not lived with them since she had joined the skywardens and moved to their tents in the east where the sky grew from fat gray branches, and they had long since traded away her childhood clothes and toys, but traces of her remained: the dried old vines she had braided in mimicry of Rela’s weaving, the knife she had forgotten the last time she came for dinner, a broken harness she had brought one evening to share and laugh about how close she had come to falling.  Rela’s appetite was gone. She scraped leftover soup into the pot and said, without turning, “I have to see to the spiders.”  The night air was warm and heavy with mist. All around the forest glowed with soft light, and the evening was hushed, but not silent, never silent. Insects chirped and clicked, birds called, and somewhere above there were bursts of music and laughter. A marsh frog bellowed, its deep, throaty cry carrying like a horn. The night smelled of smoke and spiced fish and boiled fruit, all of it mingled with the rich, mossy scent of the trees.  Rela climbed to the edge of the web and stretched out face-down, arms folded beneath her chin. The ropes pressed into her stomach and chest. A few spiders scurried to greet her with light pinches before settling into the hollow at the small of her back. Below, softened by smoke and mist, torches lined bridges with golden flames, and the river was a fat lazy snake curled around the roots.  The web swayed as Kef came to join her. She sat, legs dangling over the edge, and rested a hand between Rela’s shoulders.  “Sometimes I wonder if it would be easier,” Kef said, but she did not finish. She toyed with the fine hairs at the base of Rela’s neck; her touch was light, her palm warm. Rela could no longer identify the shades of unhappiness in Kef’s voice, but she knew where those words led: if Marun had fallen, if they had a body, if the shell of their daughter had drifted past shrouded on a funeral raft, if there were spiders in the forest with Marun’s blood in their bites.  Kef exhaled, and her hand on Rela’s back stilled.  “Do you remember when the Ugly Twin fell?” she asked.  Rela lifted her chin. She could see the gap the tree had left when it died. Its taller, straighter, more sturdy sibling remained, curiously alone where it towered over lesser trees. The Ugly Twin had been a gnarled, damaged thing, broken and healed so many times it was impossible to know which of its many trunks had been the original. Nobody had lived in the Ugly Twin for generations. Its sleepers had long ago been moved to safer corners of the aerie, its bridges cut away, its ladders and platforms left to rot, every link to the forest severed. The wardens had been guiding its slow, inevitable collapse for as long as Rela had been alive.  The Ugly Twin had toppled in the night ten or twelve years ago. The great tree had not died quietly. It had twisted and groaned against its own weight, against the unwilling support of its nearest neighbors, against its proud, handsome twin. Marun had climbed into their hammock, shaken them awake and said, “I can’t sleep. It’s too noisy.” Rela and Kef had taken her outside to watch and listen. Their neighbors were up too, huddled on their own webs, talking in quiet voices. It had been a clear night, unusually dry and free of fog.  When the Ugly Twin fell, it fell slowly, a tilting dark silhouette against the flat gray sky. Moments later the deafening roar reached them and a shudder passed over the forest, set bridges swaying and pods twisting. Marun held tight to Rela with one hand and Kef with the other, and for some time nobody spoke.  Then Marun had said, her little girl voice soft and high, “What happens when all the trees are too old to live?”  Kef smoothed a hand over her hair. “Young trees will take their place.”  “But what happens when those trees die too?” Marun asked. “Will we have to live somewhere outside the forest?”  “There is nowhere outside the forest,” Rela had said. It was what her own mother had said to her when she had asked where the water came from and where the river flowed, and what it was the rootwardens guarded so jealously in their damp caves beneath the boundary trees.  Marun had frowned and said, “Is it sky forever?”  Kef laughed. “Forever and ever, caterpillar.” Marun had considered this answer and found it satisfactory, and she asked if they could go see the fallen tree in the morning.  There was a gap in the forest where the Ugly Twin once stood, and lifetimes would pass before another tree would grow to take its place. There were sleepers in cocoons high in the aerie who had never even known the Ugly Twin was dying. Should they ever wake, long after their children’s children settled into their own cocoons and the forest slowly filled with hanging white shapes, after the very last weaver closed herself in and the last spiders spun a soft web to cover her face, they would find the forest less one ancient giant, and the sky pockmarked with tears as dark and unblinking as their painted eyes.  “I remember,” said Rela.  A quiet sigh, and Kef took her hand from Rela’s back. “You’ll be in soon?”  She waited for an answer, but Rela said nothing, and she went inside.  The forest relaxed into a peaceful night. The bridge-keepers extinguished torches far below; distant voices faded; birds fell silent. Only the insects still sang, accompanied by the drip of water from leaves. The fog thickened and Rela’s skin grew damp. She listened to Kef moving inside the pod, washing bowls, sorting her brushes, checking her pots and pouches of paint. A bittersweet odor surrounded her: Kef was crushing flowers and seeds for a bright red hue. She worked for a time, then extinguished the lamp. Ropes creaked as she climbed into their hammock. She would be curling into the woven mat and closing her eyes, and she would expect Rela to join her, to sink into the space beside her, press a kiss to her bare shoulder before falling asleep.  The bright startled morning and long anxious day felt unreal, a lingering dream, but evening passed into night and the knot in Rela’s gut would not ease. She waited until she was certain Kef was asleep, then she rose and called her spiders. They climbed up to her shoulders and gathered around her neck. Their blue eyes flashed with sleepy curiosity, lighting the mist. Rela made soothing noises until they calmed.  She made her way to the aerie, starting with guilty fear at every darting bat and croaking frog. But she saw no one. The forest slept.  When she reached the platform, Rela knelt beside the stranger. Healing spiders moved within the cocoon, slow wandering knots beneath the surface. She drew her knife from its sheath and cut a hole in the silk. Spiders spilled onto the wooden planks, their legs and bodies slicked with blood.  “Open,” she whispered.  Spiders swarmed over the cocoon to peel it away from the stranger’s face. The man was alive, but barely. His breath was labored and hoarse; the scent of blood was strong. Rela heard the funeral spiders wake in their nests. A single funeral spider was too tiny a creature to make a sound, but together, gathering, they were the whisper of a bird’s wind in still morning air, the rustle of a snake moving through leaves.  Rela curled her hand around the back of the stranger’s neck. Slack in unconsciousness, his face was young, round and unlined. He was no older than Marun. She wondered if he had a family somewhere outside the forest, a mother who waited for him to come home. The funeral spiders tasted his blood cautiously. They were small and clumsy, pale on her hands and the stranger’s skin, their eyes devoid of light, aggressive in their hunger. Rela held herself still, scarcely breathing, and let them crawl over her fingers and onto his face. They covered his cheeks and jaw like the mist, gray and silent, creeping into his nose and mouth, burrowing into the damp corners of his closed eyes.  The stranger gasped and opened his eyes. He began to speak, as he had before, the beginning of a single word. Rela clasped her hand over his nose and mouth. He fought, rolled his head from side to side, lips moving against her palm, but he was weak and bound in the cocoon. She held him until he stopped struggling.  Bloated and dark with his blood, the funeral spiders spilled from the dead man’s nose and mouth. Rela lifted her fingers to her lips and caught a few on her tongue. They nipped at the inside of her mouth, each bite a spark of pain.  Shadows gathered, and Rela closed her eyes. The stranger’s memories were jumbled and twisted, every moment of clarity shattered by a burst of pain. She felt the terrifying rush of falling through the canopy, the impact of every branch and snap of every bone, and she felt the panic of losing her grip as a slick strip of sky tore away high above the forest. The fear faded and a gray darkness engulfed her, soft light and sticky pale threads, and for a moment she was herself a spider, lost in a web she had not spun.  Then she was standing outside the sky. The heat was unbearable, even tempered by the suit and mask, and her balance was precarious at the edge of a tear just wide enough for a man to slip through. She stood on translucent fibers, soft and flexible, and beneath her feet the forest was dark shadows and shapes through a film of gray. The sky was brightening as the sun rose, a golden fire in the east, and fierce morning air whipped around her. She turned but the world was the same in every direction: larger than she had ever imagined, an unbounded forest so vast, so far below it looked, at first glance, like moss crowding around countless white nests, each as tall and round as the one on which she stood, smooth surfaces pockmarked by the jutting support of massive trees. Some were no more than barren remains, blackened skeleton forests from which the sky had been ripped away, leaving only wind-torn wisps caught in the highest dead branches.  There was no trail to show where the stranger had come from, no sign of where a curious explorer might go. The endless green and countless mounds rippled the land out to the horizon and the red-tinted sky.  Rela opened her eyes. The roar of the wind ceased, the heat faded, and she was alone. No fellow weavers watched aghast at what she had done; no rootwardens waited on the bridge in silent censure. Kef had not awakened and followed. The stranger was dead. Rela did not know if it was disappointment or relief that pressed like a fist against her throat.  She exhaled, and she said, “Close.”  Her mouth was swollen, and the funeral spiders, sluggish and depleted, picked their way along her lips, down the line of her jaw and neck. Her own spiders hesitated, sparking blue questions in the darkness.  Rela said again, “Close.”  The spiders stitched the cocoon closed across the dead man’s head. Rela brushed the last of the funeral spiders from her skin, blinked to clear the lingering threads of his memories. She pressed her thumbs to his blank face to leave twin smudges of blood in place of eyes.", "text": "5950 words, short story\nNo Portraits on the Sky\nThe stranger fell from the sky just after dawn.\nRela heard the snap of branches and looked up. The sun was rising in a gray haze beyond the forest’s eastern edge, and the mist was retreating from the aerie. In the canopy above, a dark figure tumbled through the fog, bouncing from branches and whipping past leaves. Rela watched with her breath caught in her chest, her heart stuttering. But as the person fell closer she could see he was no skywarden. He wore no tools, no ropes, no soft sticky gloves the color of spider silk.\nThe stranger missed the bridge as he fell, but a line of cocoons caught him. He tangled in the ropes and set the pods swaying before twisting free again. Rela heard a thump as he landed. She couldn’t see the platform through the shivering leaves and broken cobwebs, and when she held her breath to listen, she heard no shouts of alarm, no curious cries. There was only the drip of dew and the rustle of settling branches.\nHolding tight to the bridge, Rela leaned over the ropes for a better view of the sky. The canopy was thick, but she was high enough and there were breaks enough for her to see patches of bland gray through the trees, and the dark imperfections marring its smooth expanse.\nEverybody in the forest knew the sky was falling. They muttered and fussed when scraps ripped free and fluttered down, draped over gardens and saplings and pods, left brown patches of crisp leaves and dead moss behind. Some days it was worse than others, a soft white rain, and spiders scurried to devour what they could before it did too much damage. Children, unconcerned, collected the tatters to poke them with sticks, burn them with embers, and laughed as the translucent threads pulled and curled and shriveled. The fallen sky made a high hissing noise as it burned, not unlike the call of the fat brown beetles that lived in knots and hollows.\nEverybody knew the sky was falling, but Rela didn’t know if there were more wounds now than there had been yesterday. She rarely looked at the sky anymore.\nHer spiders chattered and nipped at her bare arms. The ropes the stranger had struck were old, easily frayed, and the cocoons dangled precariously.\n“Fix the line,” Rela said. The words trembled on her tongue, but her spiders calmed at the sound of her voice. One of the largest, a green and gold ropemaker with bright sparking eyes, crept down her arm and onto the rope. Rela stroked a hand over its back and let it nip at her fingers. “Fix the line, lovely. Go.”\nThe spider scurried away, and others followed, trailing fresh threads of silk. Rela left them to their repairs and followed the bridge to the nearest trunk, climbed down a ladder and crossed to a junction between three trees. There she stopped, and again she listened. This corner of the aerie was remote, little used and little visited, home only to the faded cocoons of sleepers whose names and faces were long forgotten. That was why she had chosen it for her morning routine, apart from her fellow weavers who spoke to her in soft voices, with pitying glances; they did not know what to say to her anymore, and she preferred to work alone. The swaying cocoons and bright blue lights of her spiders’ eyes were the only sign anything had disturbed the canopy.\nNobody else had seen the stranger fall.\nHer heart still pounding, her throat tight, Rela crossed a bridge to an old platform. Its wooden planks were softened with mold, split and warped by water and time. Half a dozen cocoons hung around its perimeter: sleepers who had been wrapped and silent for longer than Rela had been alive. Silk webs draped the cocoons in delicate curtains, and through the veils their painted features were soft, indistinct, their eyes no more than dark, blank blotches, their solemn mouths washed away.\nThe stranger lay face-down at a corner of the platform. His shoulders were twisted, both legs bent, one arm tucked crookedly beneath his chest. Rela hesitated, uncertain, but she could not help if she could not see his injuries. She dragged him away from the edge and rolled him onto his back. An odd gray cloth, soft and slick to the touch, covered his entire body. He wore no harness and carried no tools. His arms were too short, his legs too long, and a smooth, blank mask hid his face.\nRela drew her knife. Her spiders crowded up her arms and back. She saw no blood yet, but they could smell it, and they clicked and flashed eagerly as she sliced into the gray cloth to free the man’s shoulders and arms, his neck beneath the unsettling blank mask, his hips and groin and peculiar long legs. Beneath the pliable gray fabric there was another layer, soft, white, damp with sweat and splotched with blood. Rela cut that away as well. It had been a long time since she had used her spiders to heal broken bones and battered flesh, but she remembered what to do, and with each careful step she pushed her worry about where the man had come from to the back of her mind.\n“Go on,” she said, but quietly, a whisper that would not carry.\nThe spiders raced down her arms and picked away the white fabric to reveal the stranger’s skin. Beneath the man looked like no person Rela had ever seen. The people of the forest were the same color as the leaves, softer green for those who dwelt in the shade, deeper green for those who climbed in the canopies and worked in the sunlight, and their hair curled and tangled like vines. The stranger was as brown as wood and hairless all over.\nAnd he was alive. Each breath was shuddering and shallow, but he was alive.\nRela pressed the tip of her knife into the man’s side and opened a cut the length of a finger. She held the skin apart to let a few of her smallest spiders pick their way through his seeping blood. They balked and blinked at the first taste, but Rela did not let them flee.\n“Go in,” she said firmly. “You remember, little ones. Go in. Heal.”\nReluctant, flashing their dismay, a dozen quick red spiders burrowed into the stranger’s body and pulled the incision closed after them. Rela sent others down the man’s legs to chew away the last of the gray clothing and weave a sturdy cocoon around his feet.\nShe turned her attention to the man’s head. Bruises mottled his neck and shoulders, and the mask he wore was as hard as the shell of a nut. In its flat, reflective surface Rela saw only her own face and the sparking eyes of the spiders perched on her shoulders. She probed around the stranger’s jaw and neck with her fingertips, worked the mask loose and pulled it free. The stranger’s face was as brown as the rest of his body, round and young and smooth. His dark hair was shaved close to his scalp. Rela pressed a finger to one eyelid to pull it open.\nThe stranger gasped. Rela jerked back, but she caught herself before she lost her balance. The spiders chirped and flashed and fled before gathering again. A strangled half-word escaped the man’s throat. It drew into a long, pained groan when he tried to lift his head. Rela placed a hand on the man’s brow; his skin was hot and damp with sweat.\n“Don’t move,” she said. “Don’t move. You’re hurt.”\nShe rubbed her thumb soothingly over his forehead and leaned close to look him in the eyes. His pupils were wide, his gaze unfocused. She did not know if he saw her at all.\n“Who are you?” she asked. “Where did you come from?”\nHis lips moved again and for one sharp moment Rela thought he might answer, but the only sound he made was a hiss of pain. His eyes closed. He sank into himself, his breath slowing, his head lolling to the side, and he was silent.\nAt a gesture from Rela, the spiders closed the cocoon over his chest and shoulders and neck, and finally stitched the silk across his face and the crown of his head. Those spiders trapped within moved beneath the silk in roving lumps.\nRela cleaned her knife and tucked it into its sheath. With the stranger’s brown face hidden, his strange clothes piled to the side, the gasp of his voice and what he could not say caught now within a soft cocoon, she could almost pretend her hands weren’t shaking.\nThere was nothing she could do for the man but let the spiders heal him, if they could, if his body was not so broken it couldn’t be stitched together again. She waited until she was certain the spiders were settled in the cocoon, then left the platform. She paused again at the junction of three bridges and looked up. The day was growing brighter, colors shifting and deepening as the sun climbed.\nThe sky was falling, shedding pieces of itself like old skin, but even children knew not to ask why the wardens did nothing. Not a year had passed since six skywardens had fallen to their deaths. Most of the people of the forest had never known anybody to die; the elderly and ill wrapped themselves in cocoons to sleep and heal and one day, in a distant future, emerge as young and fit again, however long it might take. The weavers had hoped to heal the skywardens too, but the rootwardens had emerged from their hollows and taken the broken bodies from the aerie before the spiders could weave a single cocoon. They claimed, later, the unlucky skywardens had been shattered beyond what any long sleep could heal. It had been decades since the forest had held even a single funeral, and now it was holding six, all at once, for strong young men and women who had climbed too recklessly and too high. From every corner of the forest people had gathered to watch the six flat boats float the river, lined with torches and draped with flowers, from the boundary roots in the east to the western caves. Funeral spiders on delicate threads had dropped to the boats in a fine pale rain, burrowed into the shrouds and emerged, scattered again into the forest. Some onlookers had flinched away, closed their eyes and held their breath; others opened their mouths and welcomed the quick stinging bites on their tongues.\nRela had watched the funeral with Kef and their daughter Marun. She hadn’t known it then, but it was the last night they would spend together as a family, the last time she would sit beside her daughter and hold her hand, listen to her breath and know she was well. They had looped thick vines into swings above the river, and they hung, embraced by a low mist that never dissipated, their eyes hot with smoke, and they let the funeral spiders crawl over their lips and across their tongues. Rela had felt a rush of dizziness with the first bite, a spike of aching fear and the rush of sickening vertigo, the terrifying last moments of one young warden’s life, but it passed.\nMarun had asked, “Does it always feel like that?”\nRela had been to only one funeral before, long before Marun was born, and that had been an eccentric old woman who had refused the comforting promise of sleep. Her memories had been as green and familiar as the forest itself, sunlight and shadows, a teasing mist of dew on skin before it was gone.\n“I don’t know,” Rela had said. She did not lie to her daughter. The skywardens who had fallen had been Marun’s friends and partners, and the only thought in Rela’s mind had been cold relief that it had not been another day, another part of the sky, and Marun who had fallen.\nThe next morning, Marun and two other young skywardens had climbed the barren apex branches of the Dusk Man, one of the forest’s oldest and tallest trees, and disappeared through a tear in the sky. They never returned. The skywardens who remained refused to climb anymore. There was occasional talk, throughout the forest, of training new wardens, sending them up with ropes and hooks and tools to heal the sky, but more often now the gossip turned to wondering if perhaps the skywardens refused because they knew there was nothing to be done.\nLaughter echoed below, and Rela startled from her memory. A spider nipped at her thumb. Rela released the rope and made for the ladders.\nThe forest darkened as she descended, and the canopy filled with the sounds of an ordinary morning: weavers talking and singing as they worked, spiders clicking eagerly, the coursing of collected water spilling into wooden troughs. Shouts echoed as builders hoisted a repaired bridge between two trees, ropes and wooden slats swinging, filling a blank space with a curved line; their rasping saws dusted the morning with the scent of fresh-cut wood. The aerie was more crowded below, not only with weavers and their spiders, but with sleepers in their hanging cocoons. Oblong white sacs lined every branch, swaying on every bridge, every platform, their colorful painted portraits turning in and out of sight. Rela spotted a pair of painters retouching a family of cocoons hanging in a cluster like pale berries, and she thought, for a moment, to ask them where Kef was working today, to find her, to grasp her hands and lean close, her lips to Kef’s ear, and tell her about the stranger.\nThe urge was a fleeting burn on her tongue, like a child’s dare to taste a scrap of fallen sky, and she could not imagine how Kef would reply. She could not remember when they had stopped carrying each other’s secrets and began instead hoarding their own. She did not even know if Kef had noticed.\nThe painters raised their hands in uncertain greeting. Rela turned away before they could call out, but somebody else had spotted her. Approaching from the other direction, moving briskly along a bridge, was Pira, an elder weaver with threads of spider-silk white in her hair. She wasn’t alone: following on the bridge were two rootwardens. Their faces were hidden beneath deep hoods of woven bark and muddy leaves, and the planks of the bridge groaned beneath their steps. It wasn’t unusual to see rootwardens high in the trees anymore, not as it had been when Rela was a child and they had kept themselves apart, emerging rarely, and only at night. People whispered, when rootwardens passed, that they ventured higher now because the trees were rotting on the inside and driving them out.\n“Rela, there you are,” Pira said. She spoke softly, and she smiled. “I’ve been looking for you.”\nPanic that almost felt like relief squeezed Rela’s chest. Somebody had seen, she thought. Somebody had seen and sent for the wardens.\nBut Pira went on before she could speak. “There was a great deal of fall over the Sisters last night,” she said. She tilted her chin and sunlight caught her face. The Three Sisters were a cluster of trees beneath one of the weakest patches of sky; they stood at a bend in the river, well away from where the stranger had fallen. Pira said, “They could use your help, if you can spare the time. They’re quite overwhelmed.”\nLips pressed together, Rela nodded, swallowed and looked away from the rootwardens. She could not see their faces beneath their dark hoods, if they had faces at all, but she knew they were watching her. One touched the rope with its thin hand, and Pira’s spiders, clinging beside her, recoiled and scattered. The warden’s fingers were like reeds the color of still, murky water, damp and slick but strong, and Rela half-expected to see the rope disintegrate at its touch. “Don’t let it touch you,” Rela’s mother had said, when she was a child and gawking at the first rootwarden she had ever seen, a memory long since faded like an old portrait, but vivid now, surprising in its clarity. They had been collecting pitcher flowers in a pond near the roots of the boundary trees, where caves breathed cool air into the forest and water dripped in distant echoes. Rela loved plucking the soft pink blooms from a curtain of vines and tipping the nectar into her mouth when her mother wasn’t looking. When the rootwarden had appeared, a dark shape in the shadow, tall and grim beneath the arch of a black root, Rela’s mother had grabbed her hand so hard her fingers twisted together, and she had said, “Don’t let it touch you,” though it was across the water and did not seem to notice them at all. Rela had asked, in her childish innocence, why her mother was so scared, and her mother had said, “I’m not scared,” and then she had said, “We’re done here,” but she hadn’t moved until the warden was gone.\n“Rela? Are you well?”\nPira’s voice was warm, kind, and her green eyes soft with understanding. Rela felt the chance as a tug at the back of her throat, as the hesitation before flinging a net or throwing a spear, knowing the fish or frog or bird might escape if she waited too long. She could tell them, Pira and the rootwardens and anybody else who might overhear. They would think her mad, confused by grief, mourning a lost daughter, but she could take them to the stranger and ask her spiders to split the cocoon and let his blood flow.\nThe rootwardens would take him away. They would drag his odd brown body down from the aerie, careless as hunters dragging the marsh frogs they speared. He would vanish with them into their caverns, as the fallen skywardens had vanished before, and Rela would never have a chance to speak to him.\n“Is there something wrong?” Pira asked.\nRela smiled. Her spiders nipped and clicked at the back of her neck. “No, of course not. I’ll go at once to help.”\nShe nodded to Pira before hurrying away. Across the bridge she looked back. The rootwardens had turned their hooded faces to follow her, dark smudges of brown in the morning light.\nThe weavers at work in the Three Sisters did not need Rela’s help, but one, with familiar pity in her voice, sent her to the Red Guardian to weave a cocoon for an old man who had been putting off sleep for too long. His joints were swollen, his hands unsteady, his eyes cloudy. Rela helped him across the last long bridge to a platform clinging snug to the tree’s red trunk. The old man fussed and squirmed as the spiders began to work, and he did not calm until Rela asked him which of the cocoons hanging around the platform belonged to his family. He could not remember all of their names, and the paint of their portraits had long since leached away, but sharing their stories soothed his worry.\n“It will be good to see them when we wake,” he said. The spiders were creeping delicately around his shoulders and neck; he twitched his head, chased a faint itch. He exhaled, and frowned, and said, “If we wake.”\n“You will,” Rela said. “We all will. Close your eyes. There’s no reason to be afraid.”\nThe old man huffed but did as she said. A small black spider eased itself beneath the silk at his neck to place the final sting, then he was sleeping. The spiders closed the cocoon over his face, spun a rope from the crown of his head and, with Rela’s help, lifted him to hang beside the sleepers who had been his wife and brothers and children. A painter would come to give him a face in a day or two, when the silk had stiffened and dried, and his portrait would be a splash of fresh bright color until time and age washed it away. The funeral spiders would nest in the fine threads of the cocoon, and those pale blind creatures would be the old man’s only company while he slept.\nRela stayed at the Red Guardian for the rest of the day, working alone to repair damaged ropes and cocoons, speaking to no one but her spiders. She did not let herself even look toward the nameless tree where she had left the stranger to heal. When twilight fell over the forest, she left the aerie with the other weavers, nodding at those who bid her a good evening. By the time she reached the Bearded Frog, the tree where she and Kef hung their home, the forest was filled with warm yellow light and smoke from cooking fires. Rela stepped off a spiraling ladder and onto the branch that held their pod, climbed down to the web beneath and sent the spiders to their nest. She felt naked without them crawling over her arms and shoulders, without their sharp, quick legs pricking her skin.\nThe scent of something rich and pungent drifted from inside. Kef was making supper.\n“Rela? Are you hungry?”\nKef always sounded as though she was on the verge of laughing, even when she was serious; it was the second thing Rela had noticed about her. The first had been the light of her water-green eyes as she stared up at the sky. They had met on a fine, warm day years ago, when Rela had found Kef in a nest of tangled branches high above the aerie, lying on her back amongst white flowers and purple berries growing from the tree’s cradled patches of soil. Rela had said, “You’re not supposed to be up here,” and Kef had laughed and said, “Do you ever look at the sky? Look at the sky and tell me what you see.”\nRela checked that the spiders had food and collected buckets of water to carry inside. Kef took one from her and kissed her cheek. “I thought I might see you today, but they said you were helping at the Sisters.”\nThere was a moment, again, the heartbeat hesitation before a frog’s fearful leap, and Rela thought she might tell Kef about the stranger. But it had been so long since the laughter in Kef’s voice had been accompanied by a smile on her lips, since she had hummed while stirring supper in a pot and touched Rela’s hand with paint-flecked fingers, and those days grew ever rarer, stretched apart, dew drops on a silk thread.\n“I was on the Red Guardian,” Rela said. “There was an old man.”\nKef withdrew her hand to return to the fire. “Supper is ready, if you’re hungry.”\nThey filled wooden bowls with soup made of fish and mushrooms. Kef spoke about her day, about the woman whose portrait she was preparing to paint, the stories and memories that through Kef’s brushes of silk and bristle would cover a fresh cocoon while the woman slept. Every cocoon was unique, every portrait singular. Kef had hoped, once, that Marun would follow in her footsteps, as Rela had hoped she might take a liking to the spiders. But Marun had chosen the sky.\nThere was still a seat for Marun at their table, and the hammock where she had slept as a child still hung high on the curved wall. She had not lived with them since she had joined the skywardens and moved to their tents in the east where the sky grew from fat gray branches, and they had long since traded away her childhood clothes and toys, but traces of her remained: the dried old vines she had braided in mimicry of Rela’s weaving, the knife she had forgotten the last time she came for dinner, a broken harness she had brought one evening to share and laugh about how close she had come to falling.\nRela’s appetite was gone. She scraped leftover soup into the pot and said, without turning, “I have to see to the spiders.”\nThe night air was warm and heavy with mist. All around the forest glowed with soft light, and the evening was hushed, but not silent, never silent. Insects chirped and clicked, birds called, and somewhere above there were bursts of music and laughter. A marsh frog bellowed, its deep, throaty cry carrying like a horn. The night smelled of smoke and spiced fish and boiled fruit, all of it mingled with the rich, mossy scent of the trees.\nRela climbed to the edge of the web and stretched out face-down, arms folded beneath her chin. The ropes pressed into her stomach and chest. A few spiders scurried to greet her with light pinches before settling into the hollow at the small of her back. Below, softened by smoke and mist, torches lined bridges with golden flames, and the river was a fat lazy snake curled around the roots.\nThe web swayed as Kef came to join her. She sat, legs dangling over the edge, and rested a hand between Rela’s shoulders.\n“Sometimes I wonder if it would be easier,” Kef said, but she did not finish. She toyed with the fine hairs at the base of Rela’s neck; her touch was light, her palm warm. Rela could no longer identify the shades of unhappiness in Kef’s voice, but she knew where those words led: if Marun had fallen, if they had a body, if the shell of their daughter had drifted past shrouded on a funeral raft, if there were spiders in the forest with Marun’s blood in their bites.\nKef exhaled, and her hand on Rela’s back stilled.\n“Do you remember when the Ugly Twin fell?” she asked.\nRela lifted her chin. She could see the gap the tree had left when it died. Its taller, straighter, more sturdy sibling remained, curiously alone where it towered over lesser trees. The Ugly Twin had been a gnarled, damaged thing, broken and healed so many times it was impossible to know which of its many trunks had been the original. Nobody had lived in the Ugly Twin for generations. Its sleepers had long ago been moved to safer corners of the aerie, its bridges cut away, its ladders and platforms left to rot, every link to the forest severed. The wardens had been guiding its slow, inevitable collapse for as long as Rela had been alive.\nThe Ugly Twin had toppled in the night ten or twelve years ago. The great tree had not died quietly. It had twisted and groaned against its own weight, against the unwilling support of its nearest neighbors, against its proud, handsome twin. Marun had climbed into their hammock, shaken them awake and said, “I can’t sleep. It’s too noisy.” Rela and Kef had taken her outside to watch and listen. Their neighbors were up too, huddled on their own webs, talking in quiet voices. It had been a clear night, unusually dry and free of fog.\nWhen the Ugly Twin fell, it fell slowly, a tilting dark silhouette against the flat gray sky. Moments later the deafening roar reached them and a shudder passed over the forest, set bridges swaying and pods twisting. Marun held tight to Rela with one hand and Kef with the other, and for some time nobody spoke.\nThen Marun had said, her little girl voice soft and high, “What happens when all the trees are too old to live?”\nKef smoothed a hand over her hair. “Young trees will take their place.”\n“But what happens when those trees die too?” Marun asked. “Will we have to live somewhere outside the forest?”\n“There is nowhere outside the forest,” Rela had said. It was what her own mother had said to her when she had asked where the water came from and where the river flowed, and what it was the rootwardens guarded so jealously in their damp caves beneath the boundary trees.\nMarun had frowned and said, “Is it sky forever?”\nKef laughed. “Forever and ever, caterpillar.” Marun had considered this answer and found it satisfactory, and she asked if they could go see the fallen tree in the morning.\nThere was a gap in the forest where the Ugly Twin once stood, and lifetimes would pass before another tree would grow to take its place. There were sleepers in cocoons high in the aerie who had never even known the Ugly Twin was dying. Should they ever wake, long after their children’s children settled into their own cocoons and the forest slowly filled with hanging white shapes, after the very last weaver closed herself in and the last spiders spun a soft web to cover her face, they would find the forest less one ancient giant, and the sky pockmarked with tears as dark and unblinking as their painted eyes.\n“I remember,” said Rela.\nA quiet sigh, and Kef took her hand from Rela’s back. “You’ll be in soon?”\nShe waited for an answer, but Rela said nothing, and she went inside.\nThe forest relaxed into a peaceful night. The bridge-keepers extinguished torches far below; distant voices faded; birds fell silent. Only the insects still sang, accompanied by the drip of water from leaves. The fog thickened and Rela’s skin grew damp. She listened to Kef moving inside the pod, washing bowls, sorting her brushes, checking her pots and pouches of paint. A bittersweet odor surrounded her: Kef was crushing flowers and seeds for a bright red hue. She worked for a time, then extinguished the lamp. Ropes creaked as she climbed into their hammock. She would be curling into the woven mat and closing her eyes, and she would expect Rela to join her, to sink into the space beside her, press a kiss to her bare shoulder before falling asleep.\nThe bright startled morning and long anxious day felt unreal, a lingering dream, but evening passed into night and the knot in Rela’s gut would not ease. She waited until she was certain Kef was asleep, then she rose and called her spiders. They climbed up to her shoulders and gathered around her neck. Their blue eyes flashed with sleepy curiosity, lighting the mist. Rela made soothing noises until they calmed.\nShe made her way to the aerie, starting with guilty fear at every darting bat and croaking frog. But she saw no one. The forest slept.\nWhen she reached the platform, Rela knelt beside the stranger. Healing spiders moved within the cocoon, slow wandering knots beneath the surface. She drew her knife from its sheath and cut a hole in the silk. Spiders spilled onto the wooden planks, their legs and bodies slicked with blood.\n“Open,” she whispered.\nSpiders swarmed over the cocoon to peel it away from the stranger’s face. The man was alive, but barely. His breath was labored and hoarse; the scent of blood was strong. Rela heard the funeral spiders wake in their nests. A single funeral spider was too tiny a creature to make a sound, but together, gathering, they were the whisper of a bird’s wind in still morning air, the rustle of a snake moving through leaves.\nRela curled her hand around the back of the stranger’s neck. Slack in unconsciousness, his face was young, round and unlined. He was no older than Marun. She wondered if he had a family somewhere outside the forest, a mother who waited for him to come home. The funeral spiders tasted his blood cautiously. They were small and clumsy, pale on her hands and the stranger’s skin, their eyes devoid of light, aggressive in their hunger. Rela held herself still, scarcely breathing, and let them crawl over her fingers and onto his face. They covered his cheeks and jaw like the mist, gray and silent, creeping into his nose and mouth, burrowing into the damp corners of his closed eyes.\nThe stranger gasped and opened his eyes. He began to speak, as he had before, the beginning of a single word. Rela clasped her hand over his nose and mouth. He fought, rolled his head from side to side, lips moving against her palm, but he was weak and bound in the cocoon. She held him until he stopped struggling.\nBloated and dark with his blood, the funeral spiders spilled from the dead man’s nose and mouth. Rela lifted her fingers to her lips and caught a few on her tongue. They nipped at the inside of her mouth, each bite a spark of pain.\nShadows gathered, and Rela closed her eyes. The stranger’s memories were jumbled and twisted, every moment of clarity shattered by a burst of pain. She felt the terrifying rush of falling through the canopy, the impact of every branch and snap of every bone, and she felt the panic of losing her grip as a slick strip of sky tore away high above the forest. The fear faded and a gray darkness engulfed her, soft light and sticky pale threads, and for a moment she was herself a spider, lost in a web she had not spun.\nThen she was standing outside the sky. The heat was unbearable, even tempered by the suit and mask, and her balance was precarious at the edge of a tear just wide enough for a man to slip through. She stood on translucent fibers, soft and flexible, and beneath her feet the forest was dark shadows and shapes through a film of gray. The sky was brightening as the sun rose, a golden fire in the east, and fierce morning air whipped around her. She turned but the world was the same in every direction: larger than she had ever imagined, an unbounded forest so vast, so far below it looked, at first glance, like moss crowding around countless white nests, each as tall and round as the one on which she stood, smooth surfaces pockmarked by the jutting support of massive trees. Some were no more than barren remains, blackened skeleton forests from which the sky had been ripped away, leaving only wind-torn wisps caught in the highest dead branches.\nThere was no trail to show where the stranger had come from, no sign of where a curious explorer might go. The endless green and countless mounds rippled the land out to the horizon and the red-tinted sky.\nRela opened her eyes. The roar of the wind ceased, the heat faded, and she was alone. No fellow weavers watched aghast at what she had done; no rootwardens waited on the bridge in silent censure. Kef had not awakened and followed. The stranger was dead. Rela did not know if it was disappointment or relief that pressed like a fist against her throat.\nShe exhaled, and she said, “Close.”\nHer mouth was swollen, and the funeral spiders, sluggish and depleted, picked their way along her lips, down the line of her jaw and neck. Her own spiders hesitated, sparking blue questions in the darkness.\nRela said again, “Close.”\nThe spiders stitched the cocoon closed across the dead man’s head. Rela brushed the last of the funeral spiders from her skin, blinked to clear the lingering threads of his memories. She pressed her thumbs to his blank face to leave twin smudges of blood in place of eyes.", "source": "https://clarkesworldmagazine.com/wallace_04_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: No Portraits on the Sky by Kali Wallace"}