{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Regina Kanyu Wang; Emily Jin", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ETaBA9qA33mEoecCs8GSkXzu940=", "id": null, "license": null, "comments": "", "raw_text": "8660 words, novelette  The Language Sheath  1  Shall I go ahead? The recorder is on? All right, let me begin.  My name is Ilsa. I’m honored to have this job, acting as the sole sampling subject for Babel’s planned Kemorean language sheath. Honestly, I wasn’t surprised that they chose me. Let’s just say that I knew I would get it. You may not notice if you don’t speak Kemorean and can hear me only through translation, but years of experience as a KSL teacher forced me to adopt good habits: standard pronunciation, strict grammar, meticulous attention to usage and good style—after all, only a teacher who speaks flawless Kemorean can teach students properly. I’ve won the award for teaching excellence five years in a row, been extensively interviewed by the media, and even got to shake the hand of the Kemorean Minister of Culture. My teaching skill is as lauded as the elegance of my Kemorean. Babel is wise to choose me, the ideal candidate.  I have a good impression of Babel, whose global success is well-known. All the Babel staff I met through the multiple rounds of interviews were professional and friendly. In the last round, I had a very agreeable chat with Mr. Hanson, director of Babel’s Kemorean Project. Although he was speaking German and I was speaking Kemorean, with the help of Babel’s translation service, we understood each other pretty well. Babel’s earbuds transmitted each of our sentences up to the cloud service center, and the translations produced by the neural engine were then transmitted to the other person’s earbuds in real time.  For big languages such as Mandarin, English, German, Spanish, and over forty others, Babel’s translation service has performed extremely well, but the Kemorean translation that I heard during the interview process, an internal demo not available to the general public, was only passable. It generally conveyed the meaning of the words accurately, but the sentences were stilted, awkward, with little stylistic unity or natural fluency in expression. It so grated on the ear that I couldn’t imagine anyone would be willing to pay to use it for long. Babel hasn’t launched the Kemorean service because in its present form the product would ruin Babel’s reputation. They need to refine and polish the machine translation results with usage patterns distilled from a real human model speaker, to wrap the rough functional core in a smooth output filter called a “language sheath.” That’s why they need me.  At first, I didn’t realize that Babel was recruiting for a model for the Kemorean language sheath—I had never heard of the concept. I thought I was supposed to participate in the translation process itself. Having taught Kemorean for more than a decade, I thought my deep knowledge of grammar would be helpful. However, Hanson told me that current machine translation technology is no longer based on rules of grammar, and even statistics and probability are no longer central to the process. Recurrent neural networks can learn to map correspondences between different languages and generate translation results immediately. What they need from me is my style and speaking habits as a model Kemorean speaker.  He proceeded to explain to me the basic principle of the language sheath, which is easy to grasp. While the neural translation engine can be trained by a large corpus of linguistic examples from diverse sources, the language sheath requires tracking of an individual model Kemorean speaker over a long period of time to extract their habits and patterns to achieve consistency. Everyone has different language habits. Some are lavish with modal particles, some haggle over every word, some prefer to be roundabout, and some get right to the point. Good writers can thus allow their readers to infer who’s talking without using dialogue tags, and good readers can even discern the author behind an anonymous text.  I’m excited for this job. It’s even better than I imagined. I’ll be helping Babel craft a perfect sheet of Kemorean language sheath.  Wait. Is “sheet” the right noun classifier to use for a language sheath? My apologies. I’m not sure what noun classifier to assign to such a new invention. Oh, in case you’re confused, Kemorean has a rich repertoire of unique words called classifiers that must be applied to every noun in certain contexts, such as when things are measured or counted. Every noun has a classifier that’s just perfect for it. One of the reasons I joined the project team is to contribute to the preservation of the unique lushness of Kemorean. We all know that the Kemorean language is in decline. Take my son, Yakk. His father sent him to an international school in early childhood, and even though he transferred to a Kemorean public school later at my insistence, his Kemorean is execrable. He can only construct simple sentences and commits solecisms all the time. He even speaks with an odd accent, as though he weren’t a native speaker. It’s a terrible disappointment.  Yakk’s situation is hardly uncommon among Kemorean youth. Kemor is a small country, and native speakers of Kemorean number less than three million. More than a decade ago, the Kemorean government started to heavily promote English education in order to boost economic development and international trade. Kemor’s generous policy on foreign investment brought an influx of foreigners to the country. For a while, teaching Kemorean as a second language was a booming business, but many foreign students found Kemorean too difficult to learn. Soon, they gave up altogether when the new generation of young Kemoreans who grew up with English as an integral part of their education stepped into the job market. Kemoreans speak much better English than foreigners speak Kemorean.  From my perspective, this isn’t right. Foreigners are coming to Kemor, so why should Kemoreans learn their language instead? Enrollment at the language school I taught at decreased steadily, while Kemorean youth spent more and more time studying English. It’s ridiculous. Kemorean will be endangered if the trend continues. I can’t stand by and do nothing. Kemor’s tongue is distinct from the languages of all its neighbors. It’s an invaluable linguistic specimen. Kemorean phonology is elegant and mellifluous; even the daily speech one hears in the streets sound like pleasing melodies, euphonious and brimming with power. Kemorean literature has gained extraordinary critical acclaim in the global market as well. We’ve produced two winners of the Nobel Prize in Literature, more than any other country in the region. Anria’s Night Song and Temu’s Records of Floating Ice are so beautiful that everyone who has read them can’t help but heap praise on them. I cannot imagine a future in which Kemorean children will no longer be able to appreciate the literary jewels of their own nation. The young do not care, but speaking proper Kemorean is still greatly important to people of my generation and older. This is our language, our culture, our pride.  I must do what I can to protect Kemorean. I’ll dig a moat with the language sheath and stop foreign languages from encroaching on Kemorean. I’ve seen the studies that show that in countries and regions where the use of Babel is common, the number of people who study foreign languages is significantly lower. When a reliable translation service is available, why bother wasting time and energy on learning a foreign language? The sooner the Kemorean translation service can go public, the sooner Kemoreans can stop devoting so much effort to learning English. Through the translation earbuds, their words will be rendered into the target language of their interlocutors. Conversely, they’ll hear through those earbuds standard Kemorean, the translation having been properly processed by the language sheath that bears my habits and stylings. Over time, perhaps the younger generation’s Kemorean would even improve through my example.  How long has it been now? Only ten minutes! Here I thought that I’ve been talking forever, but I’m still a long way from seven hours. Babel demands that I record myself talking for seven hours a day, minimum. All right, let me have some water and continue when my son comes home.  2  The school bell rang, jolting the dozing Yakk up from his desk. The frames of his glasses had left two dents in his nose bridge, his right arm was numb, and his right cheek felt hot. It never failed; Kemorean class always put him to sleep.  He patted his burning face and pinched his arm to wake it up. Then, he pulled out a piece of tissue to wipe the saliva trailing from the corner of his mouth. The Kemorean textbook, which he had conveniently used as a pillow, was soaked in drool. The printed letters, once sharp and distinct, now looked smudged, as if the component strokes were escaping from their frame and spreading out in various directions, forcefully tearing themselves off the page.  Agitated, Yakk snapped the textbook shut. On the bright yellow cover, the title was printed in a large font: Kemorean. A subheading under the title proclaimed: for ages 16-18. Yakk had long since colored in the circles in the numerals 6 and 8 with his pen. He didn’t like Kemorean letters. They didn’t even have that many circles that he could fill in. The strokes in the letters, short or long, stretched taut like wires; some were tightly intertwined, sticking up like spikes; some hung suspended, curving or zigzagging, dissipating at the ends into a few dots, as though left by a clogged pen. Yakk could never figure out how far apart the inkblots were supposed to be from one another so that the letters would be considered elegant. His mother always said that his Kemorean handwriting was no better than the product of a preschooler.  He didn’t understand why Mother insisted on his Kemorean lessons. When he had been at the international school, all the classes were taught in English. His grades were not the best nor the worst. Since all the teachers and students spoke English, he had grown used to expressing himself in English, which felt more like his mother tongue. At the international school, Kemorean was only an elective, but Mother forced him to take it. The content of the class was too simple for him because most of his classmates were foreigners and literally had to start from scratch. After he complained, Mother suggested that he come audit her Advanced Kemorean class in her language school during the weekends. Terrified by the prospect, he turned her down immediately, claiming that on second thought, it was probably better to build a solid foundation in Kemorean together with his classmates.  He had been boarding in the international school dormitory at that time, going home only on weekends. Since Mother had to work during weekends, the longest time that they could spend together was the ride between school and home. Mother would pick him up on Friday evenings and drive him back to the school on Sunday evenings. There was always traffic. As the car grudgingly inched forward, halting every few meters, Yakk had to give a report of his week to Mother in Kemorean, no matter how reluctant or carsick he was. He sought refuge in using the simplest sentences to avoid making grammatical mistakes and to cover up for the fact that he had not read and memorized the selections from 100 Best Prose Passages in Kemorean his mother had assigned. Fortunately, Mother was usually too focused on driving to demand him to prove his diligence by reciting the assignments.  Later, Yakk transferred to a public school, where all courses were taught in Kemorean. The teaching style and exam format were completely different from what he had been accustomed to at the international school. His grades dropped to rock bottom. He would never forget the look on his mother’s face when she saw his first graded assignment from the new school. It was a Kemorean language proficiency test on which he got 25 out of 100. He couldn’t summarize the passages’ main ideas, nor could he identify the misused words. Mother sighed deeply and said nothing. However, after that, Yakk felt that his mother looked at him differently.  At first, Yakk had tried hard to study Kemorean and get his grades up, but it was just too difficult. Compared to his peers, his exposure to the language lagged by years. While his new classmates had been studying classical Kemorean and analyzing famous works of Kemorean literature, he had been busy with English composition and oral presentation. Science and math classes were no better. He struggled because he had to first translate the technical terms into English before he could understand what was going on. Biology and history were even more confusing.  After a few years, his mother no longer bothered to correct every single sentence that came out of his mouth. It seemed as if she had finally accepted the fact that he could not—and perhaps never would—speak good Kemorean. He secretly hoped that after suffering through the last few months of high school, Mother would allow him to apply for programs in English at universities outside of Kemor. He had suffered enough Kemorean.  But then Mother got this new job. At first, Yakk was happy for her. There were fewer and fewer students at her language school, and she was visibly stressed all the time. However, he soon realized that the new job led to a new kind of torture—not only for her but also for him. She had to talk for seven hours per day into a recorder for an entire year. Seven hours! And he had to listen to almost every single part of it. Yakk thought he was going batty after just a few days. Since the public school didn’t board students, he had to come home every day. As soon as he entered the door, Mother began to talk to him, chitchatting endlessly to fill the required seven hours. Yakk desperately tried to delay going home using every excuse he could think of.  The school day being over, his classmates dispersed, leaving campus or hurrying to different after-school activities. But Yakk didn’t follow them. He sat in his seat in the last row and quietly watched the classroom gradually empty itself. He was finally left alone. It was good to be alone. At least no one would talk to him. No one would force him to speak Kemorean. He took out the English science fiction novel that he had hidden away in his desk drawer. David had lent him the book last month when they met up. It was an exciting book, but he dared not take it home. After transferring to the public school, he lost touch with his old friends from the international school. Only David and William met up with him occasionally. They gave him English books and told him which of their old classmates had been admitted to top universities in other countries. He forced himself to smile and offer his congratulations, and David and William knew better than to pester him with questions about his new life.  He turned to the page with the bookmark and began to read.  3  I never realized it would be so difficult to talk. Yes, Kemorean is a rich and expressive language, but even a treasure trove of linguistic abundance would be exhausted after talking about the same things over and over. I don’t have that much to talk about after all—my life is just too simple, and every day is like every other day. I’ve already described every corner of my house in excruciating detail, waxed poetic about the straight, tall, white poplars outside in four different ways, and urged Yakk to return home early for dinner in six different combinations of moods, auxiliaries, and voices.  These days, Yakk comes home later and later. He sneaks into his own room as soon as he’s in the door. I know that he finds me a bore. He thinks that I chatter too much, but this is my job. He may have forgotten, but I remember it clearly: when his father and I first divorced, he stuck to me all the time. Why is he no longer willing to listen to a few of my words?  I used to think my marriage was ideal. My ex-husband and I were high school classmates. After dating for five years, we got married right after graduating from college, and we had Yakk the following year. He was in business and I was in education, both accomplishing much in our own respective fields: a power couple in the eyes of other people. Every time he went on an international business trip, he would buy me gifts from abroad: unique perfumes, scarves, and purses, knowing that I didn’t want the things easily available in Kemor. He was the best husband and the best father. He took Yakk skiing in the mountains and fishing on the coast—every boy Yakk’s age dreamed of doing such fun things with their father, and Yakk’s friends envied his life.  I never imagined that he would betray me.  It was Valentine’s Day, though after years of marriage, we no longer made a big deal out of it. He called home and said that he had to work late and Yakk and I shouldn’t wait for him to have dinner. I didn’t think anything was out of place. He often worked late. His company was in foreign trade and had to accommodate the time zones of partners abroad.  Maybe I thought he had been working too hard, or I was just feeling impulsive, but I decided to make him chocolate. He once said that the chocolate I made was the best in the world.  I bought raw materials of the highest quality and worked all afternoon. Chocolate has its own memory, even more enduring than the memory of humans. You have to be patient along the way, wait until it is at the right temperature before proceeding to the next step.  When I was done, I sprayed some of the perfume he had bought me on the insides of my wrists, tied up my hair with a scarf from him, and headed over to his office with the chocolate without telling him. I imagined his look of surprised delight.  I had never been to his office. His secretary, a foreigner who spoke no Kemorean, came to greet me. Her hair was a mess and the buttons of her blouse uneven. I frowned, thinking her incompetent and lacking in grace. She froze when she realized it was me. I asked to see him. Her expression was strange as she turned to go into his office. Not until then did I notice the scarf in her hair and the scent of her perfume. Both were exactly the same as mine.  I left before she or he could come out. Once I was home, I stuffed the chocolates down my throat, one after another. They were too sweet, so I chased them with a bottle of vodka. I couldn’t get over how he had been so lazy that he hadn’t even bothered to pick a different perfume! Eating, drinking . . . the sweetness of the chocolate and the bite of the vodka entangled into one in my mind. Small details that I had once been oblivious to now all made sense: why he was always working overtime, why he always treated Yakk and me so well after business trips . . . I didn’t even know when the affair had begun. There were too many things that I didn’t know. Was she the only one? Had she seen me without my knowing? Why was her style so similar to mine? How did they flirt and whisper sweet nothings to each other? She couldn’t even speak Kemorean! Did they do it in English?  He had been an English major in college, which I thought was useless. As I expected, he couldn’t get a job after graduation. Kemor’s flexible family leave policy allowed couples to pool time off without assuming either would be the primary care provider, and so while I returned to work soon after giving birth to Yakk, he had stayed home. Eventually, because he was smart and hardworking, he started a new business to take advantage of the influx of foreign trade, and our lives became materially better. He grew busier and busier.  Later, he insisted that Yakk go to an international school, saying that the faculty and facilities there were better. Moreover, if Yakk spoke English as well as his mother tongue, he would have an advantage in the job market when he grew up. I was not that keen on the idea. Our mother tongue is Kemorean. How could English be like our mother tongue? But I allowed him to get his way. I never expected those earnest suggestions were mere tricks to pave the way for his affairs, to give him the freedom to do whatever he wanted. He always claimed to be too busy and could only spend time with Yakk on holidays. I had to do the weekly pickups and the monthly parent-teacher conferences and care for Yakk when he was home.  The more I thought about it, the angrier I became, until my teeth were clenched so tight that they hurt and my hands trembled uncontrollably. Without thinking, I smashed the vodka bottle on the ground, the shards glistening in the setting sun. I picked up a jagged piece and held it against my wrist. Maybe it was all a nightmare and everything would be fine as soon as I woke up. Pain would awaken me. I pressed hard, but the edge was too blunt and my hand too unsteady. It only left a shallow scratch on my skin. I was about to try again when Yakk came home. He rushed over and snatched the shard out of my hand. He grabbed onto it so tight that the glass cut into his palm, oozing blood. But instead of crying, he hugged me tight and whispered, Don’t cry, Mom.  He said it in English. I stared at him, as though I didn’t know him.  He switched to Kemorean, Don’t cry, Mom.  I hugged him back, tighter. How old was he at the time? Ten? Eleven? It was all my fault. I shouldn’t have trusted his father blindly and followed that ridiculous plan that estranged my child from Kemorean. I should have been tougher on him, forced him to recite famous passages from our literature and pushed him to speak and write more in Kemorean. Oh, Yakk, my son, it was my fault that you spoke your mother tongue so poorly. No, not me, but your father, and the bitch who snatched your father away from us. Their fault. It was all their fault!  If Yakk studied English like his father, he would also be stolen away from me by some foreigner woman after he grew up. I couldn’t let that happen. After I won sole custody of Yakk, I immediately transferred him back to a Kemorean public school, where he could be immersed in his mother tongue. I tutored him myself, correcting every grammatical mistake and drilling him relentlessly with more pure and proper forms of expression.  But it was too late. Even though several years have gone by since then, his progress is far from satisfactory. Yakk still cannot get his trills and flaps completely right; neither does he shift consonants properly in liaisons. He speaks slowly, with the syllables tumbling out awkwardly from between his lips one by one, devoid of the fluid soul of Kemorean.  Even worse, Yakk has entered his adolescent rebellious phase. He’s always sullen and avoids me. I know that he’s still in touch with friends from the international school, with whom he speaks English. Maybe that’s why he cannot speak Kemorean well. The boy doesn’t feel a sense of crisis at all. I need to figure out his future.  Wait, maybe the language sheath can help him! If the sheath can be used to perfect translation results, then surely it can also be used to refine Yakk’s own speech. There must be others out there like Yakk who need this technology to help them speak perfectly. Genius! I need to speak with Hanson as soon as possible. Babel is such a powerful corporation that I’m sure they’ll figure out a way.  Until then, I’ll dedicate myself to the language sheath: to build an invisible wall that could protect Yakk from English. Babel’s translation service would separate him from those foreign friends and make him realize that they are fundamentally different from him. He is Kemorean. A true Kemorean should speak nothing but the Kemorean language. This is the indelible mark of our cultural heritage. No change. No abandonment. The present confusion and chaos is only temporary. When the language sheath is ready and Babel publicly releases the Kemorean translation service, order will be restored. People will slowly give in to Babel’s convenience. Over time, everyone will once again realize the differences between distinct communities. Yes, they’ll be able to understand one another, but only via Babel’s processed translations. Without Babel, without the language sheath, they won’t be able to communicate at all. People will have to accept our respective differences and remain divided in diversity. This is the only way to preserve the beauty of each individual language.  Oh dear! I didn’t mean to go on for so long. It must be the alcohol. Fortunately, Babel promised me that no human employee would be involved in the processing of my recorded linguistic samples. The neural network won’t keep the content of my words, abstracting and extracting only my speech habits and styles. Still, I must admit, it feels good to say these words out loud. It feels like shoveling out the aged, unhusked rice long stored away in the bottom of a granary: damp, mildewed, and rotten. Then, with the aid of alcohol, the rancid pile burns, its essence rising and coming back to life.  4  Yakk waited ’til nightfall to go home.  No window was lit. Plugging the key into the lock, he turned it slowly, trying to be as quiet as possible. The deadbolt clicked as it retracted. In the silent night, the noise sounded like a piercing siren. Yakk’s heart clenched. Please don’t hear it. Don’t wake up. He pressed his ear to the door and listened. More silence. Gingerly, he pressed down on the handle and pushed the door open, moving inch by inch to avoid making noise. The same painstaking process was repeated as he squeezed in, closed the door, and took off his shoes. Just when he was about to sneak into his bedroom on tiptoes, a voice came from the darkness.  “Yakk?”  He bit down on his lip, refusing to answer.  The lamp in the living room snapped to life. Dazzling light was everywhere. Instinctively, he squinted and retreated to the door, as if he were a criminal caught red-handed by the policeman’s flashlight.  “Do you know how long I’ve been waiting for you?”  Yakk continued his silence. He wanted to escape into his bedroom and shut the door behind him, but he knew it wouldn’t work. She would just chase after him and talk and talk and talk.  “Where have you been? It’s as if you don’t even remember this is your home. I’m not telling you that you can’t have fun, but you have to be responsible.” She staggered toward him, the strong odor of alcohol permeating the air.  Don’t make her angry. Don’t fight back.  “You think I don’t know what’s going on? You’re dating a foreigner girl, aren’t you? Do you understand what kind of trouble you’re getting into? They are all the same, coming from other places to Kemor, seducing and cheating good-hearted Kemorean men. They have no mercy at all. Yakk, oh my Yakk, do you remember your father? Don’t be like him.”  He clenched his fist and told himself to simply take the blow. She had been hurt so deeply by Father that she became paranoid. There was no foreigner girlfriend. He didn’t even have many friends. Since he didn’t want to go home, he could only wander the city alone listlessly after the school locked its doors at 6:00 PM. In the past, he didn’t understand why Father didn’t like to come home, but now he felt like he could relate. Mother always wanted to be perfect and correct, and she pushed people around her to be just like her. When she drank, though, she felt more like a real person. He would rather have her drunk and speak her mind instead of seeing her under constant tension, holding everything inside.  “I’ve taught many girls from abroad like that. They are stupid. They can never master the fifteen tenses of Kemorean verbs. They’re always mixing up the four noun genders. Ugh, I can’t stand how they butcher our language. Kemorean should be smooth, graceful, and dynamic. But their grammatical mistakes and inappropriate usages feel like choking on a fish bone while drinking milk or bumping into insect eggs when caressing a piece of silk. Uncomfortable. Disgusting. Embarrassing. Add to that the awful pronunciations and odd intonations . . . they just don’t get it, no matter how many times you teach them. They don’t deserve to speak Kemorean at all!”  He reminded himself again that Mother was not talking about him. She was only firing insults at an imagined enemy who had abducted her son in her own muddled mind. But he couldn’t help thinking, Is this really how she feels while listening to me speak Kemorean? Is it really that disgusting? Afraid of her judgment, he had been talking less and less in front of her. He felt like a perpetual child whenever he spoke Kemorean: belittled, powerless, misbehaving, always mending some mistake that he had made. Only when speaking English did he feel like himself, but Mother never let him speak English in front of her.  “Why don’t you answer me? I guessed right, didn’t I? All right, listen to me. Come home early. Don’t stay out late. Don’t date foreigner girls. If you want someone to talk to, you can always talk to me. I have a lot of things to say to you. I can tell you stories. I can read you rhymes. You can lie on my knees and we can gaze up at the stars together, just like when you were still a little child. Wouldn’t that be wonderful? Don’t leave me, Yakk. Remember what you said to me when your father left us? You said, Don’t cry, Mom. You said you would take care of me and stay by my side.”  She was too close now, backing Yakk into a corner. She was holding a bottle of vodka by its neck. Yakk turned his head to the side, trying to look over her shoulder to count the empty bottles on the floor. How much had she drunk?  Abruptly, she pulled him into a tight embrace. “My son, my precious . . . ”  He was drowning in hot, rotten breath. Instinctively, he tried to get away from her, but his movement threw her balance off, and she crumpled to the floor.  “Careful!” he exclaimed in English. His arms, extended to help her, stopped midway between them, helpless.  She sat on the ground, her head down, hair shielding her face and her trembling shoulders. At first, Yakk thought she was crying, but then he realized that she was actually laughing.  “Ha! Haha! Is this how you treat your mother? I see how it is. Your wings have grown strong; you can fly on your own now, so you push away the person who brought you up. Is this how you treat your mother tongue? You studied English, and now you’ve forgotten who you are. You no longer want to be my son, is that it? You no longer want to be Kemorean, is that it? Kemorean is dying because of people like you. You don’t speak your own mother tongue. You don’t respect your own culture. You are a traitor, seduced by foreign languages and foreign girls. Do you know how awful your Kemorean is? Do you know how disappointed I am? Why am I working so hard for this language sheath? Why am I suffering so much? It’s all for you! Do you understand? Of course you don’t. You know nothing!”  Again. There she goes. But she was the one who knew nothing. For all his life she had been imposing her own thoughts on him, never bothering to listen to what he had to say. He tried to be as obedient and dutiful as possible, but that only made her feel like he was weak and incompetent. She made him feel small, an utter failure. He was a bucket full of explosives and she a barrel of alcohol. Just a single spark, and the whole house would blow up into dust. English and Kemorean intertwined in his body. Rebuttals and curses roiled in confusing tides at the tip of his tongue. He clamped his lips tightly and ran away. He had to get out, had to leave this place, before the words imprisoned behind his lips could break out in an uncontrollable flood.  He truly hoped that the gloomy, cold night could wipe his existence off the surface of this planet. And perhaps her existence, as well.  5  I think talking must be a kind of punishment.  To even make a single syllable, multiple vocal organs must collaborate. Your throat vibrates; your soft palate opens and closes; your tongue rolls; your lips change shape. Vowels and consonants. Long, short, light, and heavy. Speaking is a complex physical act. Day and night, I speak and speak, until my lips are numb and my throat burns, until I’m thirsty and exhausted. What’s more, coming up with things to talk about is torture for the soul. It feels like pushing my head into my own skull, like the ouroboros devouring itself. I dig for content, concepts expressible and unspeakable, in every nook and cranny of my brain with the tip of my tongue, licking through the folds, capturing leftover rotten crumbs of my long-gone mind, mixing them with saliva and vomiting them out.  I’ve hollowed myself of words, but still, I cannot stop. As soon as I stop, the earbuds ring with a droning alarm, like swarms of bees or mosquitoes spiraling around my head, buzz, buzzzz, buzzzzzz. Sometimes, even when I’m talking, my ears fill with hallucinated humming. Then I have to pause and check whether I’ve broken any rules by repeating the same content too many times or imitating someone else’s speaking style unconsciously. But if I pause too long, then the alarm starts going for real. I press my palms against my temples and cover my ears, but it’s no use. The sound is even louder that way because the earbuds are buried in my aural canals.  I can no longer distinguish whether my speech is real. The present I live in, the moment, no longer feels authentic after being described again and again. I’ve combed through my memories so much that they’ve been reduced to cold ashes. I can only make up stories, tell lies, abandon logic, and give up on reality. The contents of my speech don’t matter. I just have to keep my lips moving. I need to output. When my mouth isn’t eating, it is talking. Eating is necessary to sustain my life, with no pleasure in it; speaking, however, makes me feel alive because it hurts.  I’m like a silkworm, gulping down mulberry leaves and then spitting out threads, eventually enclosing myself in a cocoon. After a year’s metamorphosis, I—no, the language sheath—will emerge from the cocoon. Bearing my life’s expectations and the studied perfection of my Kemorean, the sheath will be a truly magnificent creation. She’ll dance elegantly in the wind, wrapping her rainbow-colored gossamer wings around all the coarse, crude, broken bits of Kemorean in the world, and turn them into the beautiful and elegant language that I possess.  The language sheath won’t disappoint me like Yakk. I’ve poured in all I have left to mold her. She bathes in the purist form of Kemorean every day and absorbs its nutrients. She’ll become the most perfect creation the world has ever seen, with the most graceful grammar, the most standardized sentence structure, the most proper punctuation, the most eloquent forms of expression. I will construct her skeleton with my words, nourish her flesh with my blood, and embellish her soul with my memories. Finally, with a hint of my alcohol, her aroma will be sublimated as well. I want to make up for all the regrets that I harbor regarding Yakk’s education. I’ll give her the best gift possible—Standard Model Kemorean. She is my most obedient and dutiful daughter.  Yes, the language sheath is my daughter, my second child. This agonizing and protracted process is no different from giving birth. Why, I went through just as much discomfort when I was pregnant with Yakk! Soon, soon she’ll be born. Look, Yakk, you’ll have a little sister. But where is Yakk? I haven’t seen him for days. What’s wrong with him? Is he jealous because I’m teaching Kemorean to his little sister with more patience?  Don’t be like that, Yakk. Listen to me. You are the big brother. You must care for and protect your baby sister. She’ll help you after she’s born. With her to polish your speech, you needn’t worry about not speaking perfect Kemorean anymore. Your little sister will help many other people, too. She has a loving heart, and she’ll treat everyone with equal kindness, perfecting their language after my perfect style. Kemorean ears deserve the best language in the world.  The language sheath is both a model and a specimen. Even if a catastrophe strikes the linguistic landscape in the future, she’ll still be there, a memorial to Standard Model Kemorean. Even if no one speaks Kemorean anymore, she’ll remind them of the glory that had once been its due.  Oh, she’s kicking me, telling me that she needs nourishment. She needs alcohol. Ha, she’s making requests. [Drinking sounds.] Alcohol is such a wonderful creation. Vodka is my favorite. Because of its purity. Its simplicity. No pretentious rituals when drinking vodka. Anytime. Anywhere. Just a quick injection of unadulterated alcohol. It has no color and no taste, so it can serve as the base of countless cocktails. How do you make a Bloody Mary? Vodka plus blood. Ha, kidding. But you can also use blood. Do you want to try?  Knife. I have a knife. A good knife. Clean and smooth enough to use as a mirror. Oh my . . . who is this woman? Look, she has dark circles under her eyes. She must be in so much distress. So tired. Poor thing. Come on. I’ll pour you a shot as well. You’ll be fine after a drink.  What does it feel like to have a knife cut into you? Well, there’s no pain. Your blood oozes out, not very fast. Drop after drop, like crimson beads. Beads falling into the glass, blossoming in the transparent medium. So pretty. Oh, it does hurt. Pain just kicks in late, I guess. A lovely feeling, this pain. Makes me feel alive. I see fireworks. Fireworks of blood.  Blood. So much blood. Yakk, where are you? Help me, help your mother. Phone, contacts, Yakk. Will you come, Yakk? You will. You promised. You promised you’d protect me—  6  Again, Yakk found himself in that recurring nightmare.  He was standing in the center of a circle of people, each person about a dozen meters away from him. Tall, short, robust, and slim, all their faces blurred. Everyone mumbled. He couldn’t hear them clearly since they were so far away. However, at some point in the dream, the circle shrank as they stepped toward him in unison. Each of them spoke in the voice of Mother, speaking Mother’s tongue, besieging him from all directions.  “Yakk, listen to me, you must respect Kemorean. You have to speak your mother tongue well. This is about honoring your culture . . . ”  “No more English! Stop seeing her immediately. I’ll find you a nice Kemorean girl who can speak perfect standard Kemorean just like me . . . ”  “White. Everything is pale white. White wall and white ceiling. White dribbles down from the overhead lamp, lands on my left wrist, wraps around it . . . then a tiny drop of red blossoms in the center of the whiteness . . . ”  Yakk wanted to shove them aside and break away from the circle, but more people stood behind them, ring after ring, surging toward him like tides. He couldn’t breathe.  He opened his eyes and sat up, gasping.  He saw Mother was already awake. She had been talking for some time, probably as soon as she returned to consciousness. She was describing the ward to herself in meticulous detail.  He stretched to return circulation to his stiff body, fumbled for his glasses, and put them on. The blurry world became clear again. He saw Mother trying to unwrap the bandage around her left wrist with her right hand. He rushed over and stopped her before she could succeed.  “Yakk.” She was startled to see him. “You . . . Where am I? What happened to my hand? How long have I been asleep? I’ve got to get back to work. The language sheath will soon be finished. Don’t worry. The sheath can help you . . . ”  He had no idea what he should say or what he could say. Instead, he opened his arms, leaned toward her and hugged her tight, just like the way he used to hug her as a child. He couldn’t remember the last time he had held her like this. He had forgotten that she was so skinny, her protruding bones digging deep into his chest and arms. He began to weep.  The man from Babel introduced himself as Hanson, the executive in charge of the Kemorean Project. He spoke to Yakk in English and shook his hand like an adult. Yakk didn’t like him, though. Mother’s condition was Babel’s fault.  Hanson said that he wanted to talk with Mother in private, so Yakk left.  It was a beautiful day outside. Wisps of cloud decorated the edge of the sky. A mild breeze brushed his cheeks, carrying the smell of fresh soil, sprouting plants, and wild mushrooms. All this mess will soon be over, Yakk thought. He would talk to his mother about his university application and his plans for the future. His throat itched, and he started to cough. Spring had arrived. Willow fuzz was everywhere in the air.  He went back into the hospital and waited outside the ward. A few minutes later, Hanson emerged.  “The prototype is finished,” Hanson said in accented English. He held out his hand to Yakk, palm up. “Try them. You can speak Kemorean, and I’ll speak German. It will be more comfortable for me.”  Yakk picked the tiny pair of spiral-grooved mini earbuds out of Hanson’s palm. He pushed them into his ears, the spiraling shapes digging into his ear canals perfectly, sealing and blocking out noise. He almost couldn’t feel they were there. He saw that Hanson was wearing a similar pair of earbuds. Tiny blue lights blinked at the visible ends of the earbuds from time to time.  “This is our latest and most advanced hardware. Can you understand me?”  Yakk nodded. Hanson’s words had been translated and then delivered into his ears by a female voice in Kemorean. He didn’t recognize the voice, but something beneath the words rang familiar.  “The language sheath, modeled on the corpus provided by your mother, is applied to all Kemorean output. Any user who chooses Kemorean as their target language will hear translation results polished by her speech style.”  So that’s why the translation feels familiar, thought Yakk. Neither the voice nor the words belonged to his mother, but they both did belong to her in another sense. He had never expected the effect of the language sheath to be so . . . uncanny.  “Don’t worry. Her proposal has been approved and implemented. No problem with the job either. Usually, Babel requires a college degree, but we can make an exception for you. After all, your mother has done so much for us. You’ll be graduating from high school soon, right? Come to Babel right after. You can start as a salesperson. Your personal story of struggling with languages could serve as a good showcase to our customers.”  Babel? Job? What did Hanson mean? Did Mother just decide on a future for him without asking for his opinions at all? He didn’t want a job. He wanted to go to university.  “Go spend some time with her. She went through a lot to make the Kemorean sheath. Because of her, Babel’s performance in this country will be exceptional. You absolutely don’t need to worry anymore about your Kemorean!”  Yakk opened his mouth and wanted to argue, but nothing came out. He didn’t know whether to speak Kemorean or English to the man.  “You’re lucky to have such a loving mother.” Hanson patted him on the shoulder and left.  Yakk returned to the ward. Mother was half-reclining on the bed, reading a small three-fold leaflet. On the cover was a pair of spiral-grooved earbuds. Blue lights flashed from inside her ears.  “Did you thank Mr. Hanson? He’s been so helpful to us. When you join Babel later, you have to work hard.”  Yakk’s lips moved, releasing a few mumbled syllables. English and Kemorean warred in his head, and as he strove to distinguish and hypercorrect, the syntax became mangled. Words hung suspended in air, light and carefree as the willow fuzzes, reluctant to come back down to earth.  “What did you say?” Mother tapped her earbuds.  Yakk repeated himself, clumsy word by clumsy word, in Kemorean: “Babel, I do not go. Want to go university.”  “Yakk, I know that you have ambition, but you need to be realistic. Your grades aren’t good enough for university. The job at Babel is a rare opportunity. They’re always named in surveys as one of the best employers in the world. Do you know how many people want a job at Babel? Even if you could get a university to accept you, can you find a job better than this one at Babel after you graduate? I’ve made the arrangements for you. Do as I say and you’ll be all right.”  “International school, send me back,” he continued in Kemorean. “I can go to foreign university.”  “That’s impossible. You’ve been educated in the Kemorean public school system for years, and you’re not prepared for foreign university applications. You can’t even speak your mother tongue well. The idea of using English—”  “Mother tongue yours, not mine,” Yakk said. “I, you do not know.”  “Yakk, I know you and your speaking habits too well. I’m your mother. Even if the sheath is fixing all your mistakes, I can still imagine what your original words sound like.”  Yakk frowned. “My original words. You hear not?”  “Yes, Babel has realized my dream. You don’t need to worry about speaking poor Kemorean anymore. Every sentence you speak now will be polished by the language sheath before being transmitted to my ears. The language sheath doesn’t just have to be used for translations! It can be used for a better way of speaking. You can hear my original words only because the sheath uses my language style. Aren’t I a genius? The sheath can be applied to your words, your foreign friends’ words, artificial intelligence’s words, everywhere that needs Standard Model Kemorean output. I proposed the idea to Hanson, but I didn’t expect that they could have made it reality so fast.”  “Everyone’s words, you tamper?” Yakk couldn’t believe it. From now on, everyone would hear only a single unified Kemorean language style. They would lose individual quirks and personality. After the filtration of Babel’s language sheath, all Kemorean speech would be standardized into Mother’s language.  “Not tampering, but embellishment. What I provided is only a sheath. The content of the speech won’t change. The sheath only makes the words more elegant and pleasant to the ear.”  Yakk could hear a droning against his eardrums. He switched to English. “Then what’s the difference between my speaking Kemorean, English, or any other language to you? All you hear is your own language. You won’t hear my voice at all.”  “Of course I can hear your voice. Hanson told me that Babel’s Voice Imitation Project will soon be finished. Data from just a few sentences will be enough for the algorithm to synthesize the waveform of the speaker’s voice. Everyone will be speaking perfect Standard Model Kemorean in their own voice. Imagine that wonderful future! It will start a storm, a revolution.”  Yakk felt as if a bucket of icy water had been thrown in his face. Thinking about the monotonous world after his mother’s “revolution” terrified him. With the new language sheath and the voice synthesizer, everyone in Kemor would be speaking in Mother’s language, the graceful and noble language of sterile perfection.  I never understood her, he realized. He had thought that his mother just didn’t want to hear improper Kemorean, but the truth was, she didn’t want to hear any voice other than her own. She had tried, without success, to mold Yakk according to her ideal, to make him speak her style of “authentic” Kemorean. Her disappointment in him was rooted in her own sense of failure. In Mother’s eyes, Yakk wasn’t only bad at speaking Kemorean, but without any redeeming qualities.  Having given up on him, she had turned all her efforts to the creation of the language sheath, her pride and joy, her second child, whom she could mold and shape completely in accordance with her ideals and substitute for her son. And even so, she still wouldn’t give up on interfering with his life, still hoped to control his path, decide his future. She had deprived him of his voice, deprived everyone else of their voice, but she remained completely oblivious to what she had done.  “What’s wrong, Yakk? Hanson said that the corpus he collected from me was enough. I finished the job sooner than planned. Let’s celebrate once I’m discharged! See, I’ve saved Kemorean. You don’t need to speak English, and you no longer need to feel inferior for your improper Kemorean. Aren’t you happy?”  Yakk clenched his jaw. He had to speak, let it all out. No one had told Mother that Father had chosen to escape for the refuge of other women, and Yakk had chosen to endure. But he had to speak out now, to tell her how he felt in his own language. He had to speak in English, the language in which he felt at home, not the “mother tongue” that only left him feeling inferior, insecure, and tongue-tied. She would hear only the perfect Kemorean improved by the language sheath, as she wished, but the content would be the reality that he wanted to tell her. Maybe after he’s done talking he should take out the Babel earbuds, throw them onto the ground, and crush them with his heels, so that he could force her to listen to him speak in English. But first he had to make sure that she would listen, and that she could really hear it.  He opened his mouth and began to speak, in his real mother tongue.    Author and Translators’ Note: We’d like to deliver a special thank you to Ken Liu, whose amazing comments and advice have greatly refined and enriched the story.    Originally published in Chinese in Harvest: A Literary Bimonthly, 4th issue of 2019.    Translated and published in partnership with Storycom.  Regina Kanyu Wang is a a writer, researcher, and editor, currently pursuing her PhD under the CoFUTURES project at the University of Oslo. She writes science fiction, nonfiction and academic essays in both Chinese and English. She has won multiple Xingyun Awards for Global Chinese SF (Chinese Nebula), SF Comet International SF Writing Competition, Annual Best Works of Shanghai Writers’ Association and more. Her stories can be found in her individual collections Of Cloud and Mist 2.2 and The Seafood Restaurant, various magazines, and anthologies. She is co-editor of the Chinese SF special issue of Vector, the critical journal of BSFA, The Way Spring Arrives and Other Stories, an all-women-and-non-binary anthology of Chinese speculative fiction, and the English version of The Making of The Wandering Earth: A Film Production Handbook. When she is not working on science fiction related projects, you can find her practicing krav maga, kali, boxing and yoga, or cooking various dishes and baking her favorite desserts.  Emily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature.", "text": "8660 words, novelette\nThe Language Sheath\n1\nShall I go ahead? The recorder is on? All right, let me begin.\nMy name is Ilsa. I’m honored to have this job, acting as the sole sampling subject for Babel’s planned Kemorean language sheath. Honestly, I wasn’t surprised that they chose me. Let’s just say that I knew I would get it. You may not notice if you don’t speak Kemorean and can hear me only through translation, but years of experience as a KSL teacher forced me to adopt good habits: standard pronunciation, strict grammar, meticulous attention to usage and good style—after all, only a teacher who speaks flawless Kemorean can teach students properly. I’ve won the award for teaching excellence five years in a row, been extensively interviewed by the media, and even got to shake the hand of the Kemorean Minister of Culture. My teaching skill is as lauded as the elegance of my Kemorean. Babel is wise to choose me, the ideal candidate.\nI have a good impression of Babel, whose global success is well-known. All the Babel staff I met through the multiple rounds of interviews were professional and friendly. In the last round, I had a very agreeable chat with Mr. Hanson, director of Babel’s Kemorean Project. Although he was speaking German and I was speaking Kemorean, with the help of Babel’s translation service, we understood each other pretty well. Babel’s earbuds transmitted each of our sentences up to the cloud service center, and the translations produced by the neural engine were then transmitted to the other person’s earbuds in real time.\nFor big languages such as Mandarin, English, German, Spanish, and over forty others, Babel’s translation service has performed extremely well, but the Kemorean translation that I heard during the interview process, an internal demo not available to the general public, was only passable. It generally conveyed the meaning of the words accurately, but the sentences were stilted, awkward, with little stylistic unity or natural fluency in expression. It so grated on the ear that I couldn’t imagine anyone would be willing to pay to use it for long. Babel hasn’t launched the Kemorean service because in its present form the product would ruin Babel’s reputation. They need to refine and polish the machine translation results with usage patterns distilled from a real human model speaker, to wrap the rough functional core in a smooth output filter called a “language sheath.” That’s why they need me.\nAt first, I didn’t realize that Babel was recruiting for a model for the Kemorean language sheath—I had never heard of the concept. I thought I was supposed to participate in the translation process itself. Having taught Kemorean for more than a decade, I thought my deep knowledge of grammar would be helpful. However, Hanson told me that current machine translation technology is no longer based on rules of grammar, and even statistics and probability are no longer central to the process. Recurrent neural networks can learn to map correspondences between different languages and generate translation results immediately. What they need from me is my style and speaking habits as a model Kemorean speaker.\nHe proceeded to explain to me the basic principle of the language sheath, which is easy to grasp. While the neural translation engine can be trained by a large corpus of linguistic examples from diverse sources, the language sheath requires tracking of an individual model Kemorean speaker over a long period of time to extract their habits and patterns to achieve consistency. Everyone has different language habits. Some are lavish with modal particles, some haggle over every word, some prefer to be roundabout, and some get right to the point. Good writers can thus allow their readers to infer who’s talking without using dialogue tags, and good readers can even discern the author behind an anonymous text.\nI’m excited for this job. It’s even better than I imagined. I’ll be helping Babel craft a perfect sheet of Kemorean language sheath.\nWait. Is “sheet” the right noun classifier to use for a language sheath? My apologies. I’m not sure what noun classifier to assign to such a new invention. Oh, in case you’re confused, Kemorean has a rich repertoire of unique words called classifiers that must be applied to every noun in certain contexts, such as when things are measured or counted. Every noun has a classifier that’s just perfect for it. One of the reasons I joined the project team is to contribute to the preservation of the unique lushness of Kemorean. We all know that the Kemorean language is in decline. Take my son, Yakk. His father sent him to an international school in early childhood, and even though he transferred to a Kemorean public school later at my insistence, his Kemorean is execrable. He can only construct simple sentences and commits solecisms all the time. He even speaks with an odd accent, as though he weren’t a native speaker. It’s a terrible disappointment.\nYakk’s situation is hardly uncommon among Kemorean youth. Kemor is a small country, and native speakers of Kemorean number less than three million. More than a decade ago, the Kemorean government started to heavily promote English education in order to boost economic development and international trade. Kemor’s generous policy on foreign investment brought an influx of foreigners to the country. For a while, teaching Kemorean as a second language was a booming business, but many foreign students found Kemorean too difficult to learn. Soon, they gave up altogether when the new generation of young Kemoreans who grew up with English as an integral part of their education stepped into the job market. Kemoreans speak much better English than foreigners speak Kemorean.\nFrom my perspective, this isn’t right. Foreigners are coming to Kemor, so why should Kemoreans learn their language instead? Enrollment at the language school I taught at decreased steadily, while Kemorean youth spent more and more time studying English. It’s ridiculous. Kemorean will be endangered if the trend continues. I can’t stand by and do nothing. Kemor’s tongue is distinct from the languages of all its neighbors. It’s an invaluable linguistic specimen. Kemorean phonology is elegant and mellifluous; even the daily speech one hears in the streets sound like pleasing melodies, euphonious and brimming with power. Kemorean literature has gained extraordinary critical acclaim in the global market as well. We’ve produced two winners of the Nobel Prize in Literature, more than any other country in the region. Anria’s Night Song and Temu’s Records of Floating Ice are so beautiful that everyone who has read them can’t help but heap praise on them. I cannot imagine a future in which Kemorean children will no longer be able to appreciate the literary jewels of their own nation. The young do not care, but speaking proper Kemorean is still greatly important to people of my generation and older. This is our language, our culture, our pride.\nI must do what I can to protect Kemorean. I’ll dig a moat with the language sheath and stop foreign languages from encroaching on Kemorean. I’ve seen the studies that show that in countries and regions where the use of Babel is common, the number of people who study foreign languages is significantly lower. When a reliable translation service is available, why bother wasting time and energy on learning a foreign language? The sooner the Kemorean translation service can go public, the sooner Kemoreans can stop devoting so much effort to learning English. Through the translation earbuds, their words will be rendered into the target language of their interlocutors. Conversely, they’ll hear through those earbuds standard Kemorean, the translation having been properly processed by the language sheath that bears my habits and stylings. Over time, perhaps the younger generation’s Kemorean would even improve through my example.\nHow long has it been now? Only ten minutes! Here I thought that I’ve been talking forever, but I’m still a long way from seven hours. Babel demands that I record myself talking for seven hours a day, minimum. All right, let me have some water and continue when my son comes home.\n2\nThe school bell rang, jolting the dozing Yakk up from his desk. The frames of his glasses had left two dents in his nose bridge, his right arm was numb, and his right cheek felt hot. It never failed; Kemorean class always put him to sleep.\nHe patted his burning face and pinched his arm to wake it up. Then, he pulled out a piece of tissue to wipe the saliva trailing from the corner of his mouth. The Kemorean textbook, which he had conveniently used as a pillow, was soaked in drool. The printed letters, once sharp and distinct, now looked smudged, as if the component strokes were escaping from their frame and spreading out in various directions, forcefully tearing themselves off the page.\nAgitated, Yakk snapped the textbook shut. On the bright yellow cover, the title was printed in a large font: Kemorean. A subheading under the title proclaimed: for ages 16-18. Yakk had long since colored in the circles in the numerals 6 and 8 with his pen. He didn’t like Kemorean letters. They didn’t even have that many circles that he could fill in. The strokes in the letters, short or long, stretched taut like wires; some were tightly intertwined, sticking up like spikes; some hung suspended, curving or zigzagging, dissipating at the ends into a few dots, as though left by a clogged pen. Yakk could never figure out how far apart the inkblots were supposed to be from one another so that the letters would be considered elegant. His mother always said that his Kemorean handwriting was no better than the product of a preschooler.\nHe didn’t understand why Mother insisted on his Kemorean lessons. When he had been at the international school, all the classes were taught in English. His grades were not the best nor the worst. Since all the teachers and students spoke English, he had grown used to expressing himself in English, which felt more like his mother tongue. At the international school, Kemorean was only an elective, but Mother forced him to take it. The content of the class was too simple for him because most of his classmates were foreigners and literally had to start from scratch. After he complained, Mother suggested that he come audit her Advanced Kemorean class in her language school during the weekends. Terrified by the prospect, he turned her down immediately, claiming that on second thought, it was probably better to build a solid foundation in Kemorean together with his classmates.\nHe had been boarding in the international school dormitory at that time, going home only on weekends. Since Mother had to work during weekends, the longest time that they could spend together was the ride between school and home. Mother would pick him up on Friday evenings and drive him back to the school on Sunday evenings. There was always traffic. As the car grudgingly inched forward, halting every few meters, Yakk had to give a report of his week to Mother in Kemorean, no matter how reluctant or carsick he was. He sought refuge in using the simplest sentences to avoid making grammatical mistakes and to cover up for the fact that he had not read and memorized the selections from 100 Best Prose Passages in Kemorean his mother had assigned. Fortunately, Mother was usually too focused on driving to demand him to prove his diligence by reciting the assignments.\nLater, Yakk transferred to a public school, where all courses were taught in Kemorean. The teaching style and exam format were completely different from what he had been accustomed to at the international school. His grades dropped to rock bottom. He would never forget the look on his mother’s face when she saw his first graded assignment from the new school. It was a Kemorean language proficiency test on which he got 25 out of 100. He couldn’t summarize the passages’ main ideas, nor could he identify the misused words. Mother sighed deeply and said nothing. However, after that, Yakk felt that his mother looked at him differently.\nAt first, Yakk had tried hard to study Kemorean and get his grades up, but it was just too difficult. Compared to his peers, his exposure to the language lagged by years. While his new classmates had been studying classical Kemorean and analyzing famous works of Kemorean literature, he had been busy with English composition and oral presentation. Science and math classes were no better. He struggled because he had to first translate the technical terms into English before he could understand what was going on. Biology and history were even more confusing.\nAfter a few years, his mother no longer bothered to correct every single sentence that came out of his mouth. It seemed as if she had finally accepted the fact that he could not—and perhaps never would—speak good Kemorean. He secretly hoped that after suffering through the last few months of high school, Mother would allow him to apply for programs in English at universities outside of Kemor. He had suffered enough Kemorean.\nBut then Mother got this new job. At first, Yakk was happy for her. There were fewer and fewer students at her language school, and she was visibly stressed all the time. However, he soon realized that the new job led to a new kind of torture—not only for her but also for him. She had to talk for seven hours per day into a recorder for an entire year. Seven hours! And he had to listen to almost every single part of it. Yakk thought he was going batty after just a few days. Since the public school didn’t board students, he had to come home every day. As soon as he entered the door, Mother began to talk to him, chitchatting endlessly to fill the required seven hours. Yakk desperately tried to delay going home using every excuse he could think of.\nThe school day being over, his classmates dispersed, leaving campus or hurrying to different after-school activities. But Yakk didn’t follow them. He sat in his seat in the last row and quietly watched the classroom gradually empty itself. He was finally left alone. It was good to be alone. At least no one would talk to him. No one would force him to speak Kemorean. He took out the English science fiction novel that he had hidden away in his desk drawer. David had lent him the book last month when they met up. It was an exciting book, but he dared not take it home. After transferring to the public school, he lost touch with his old friends from the international school. Only David and William met up with him occasionally. They gave him English books and told him which of their old classmates had been admitted to top universities in other countries. He forced himself to smile and offer his congratulations, and David and William knew better than to pester him with questions about his new life.\nHe turned to the page with the bookmark and began to read.\n3\nI never realized it would be so difficult to talk. Yes, Kemorean is a rich and expressive language, but even a treasure trove of linguistic abundance would be exhausted after talking about the same things over and over. I don’t have that much to talk about after all—my life is just too simple, and every day is like every other day. I’ve already described every corner of my house in excruciating detail, waxed poetic about the straight, tall, white poplars outside in four different ways, and urged Yakk to return home early for dinner in six different combinations of moods, auxiliaries, and voices.\nThese days, Yakk comes home later and later. He sneaks into his own room as soon as he’s in the door. I know that he finds me a bore. He thinks that I chatter too much, but this is my job. He may have forgotten, but I remember it clearly: when his father and I first divorced, he stuck to me all the time. Why is he no longer willing to listen to a few of my words?\nI used to think my marriage was ideal. My ex-husband and I were high school classmates. After dating for five years, we got married right after graduating from college, and we had Yakk the following year. He was in business and I was in education, both accomplishing much in our own respective fields: a power couple in the eyes of other people. Every time he went on an international business trip, he would buy me gifts from abroad: unique perfumes, scarves, and purses, knowing that I didn’t want the things easily available in Kemor. He was the best husband and the best father. He took Yakk skiing in the mountains and fishing on the coast—every boy Yakk’s age dreamed of doing such fun things with their father, and Yakk’s friends envied his life.\nI never imagined that he would betray me.\nIt was Valentine’s Day, though after years of marriage, we no longer made a big deal out of it. He called home and said that he had to work late and Yakk and I shouldn’t wait for him to have dinner. I didn’t think anything was out of place. He often worked late. His company was in foreign trade and had to accommodate the time zones of partners abroad.\nMaybe I thought he had been working too hard, or I was just feeling impulsive, but I decided to make him chocolate. He once said that the chocolate I made was the best in the world.\nI bought raw materials of the highest quality and worked all afternoon. Chocolate has its own memory, even more enduring than the memory of humans. You have to be patient along the way, wait until it is at the right temperature before proceeding to the next step.\nWhen I was done, I sprayed some of the perfume he had bought me on the insides of my wrists, tied up my hair with a scarf from him, and headed over to his office with the chocolate without telling him. I imagined his look of surprised delight.\nI had never been to his office. His secretary, a foreigner who spoke no Kemorean, came to greet me. Her hair was a mess and the buttons of her blouse uneven. I frowned, thinking her incompetent and lacking in grace. She froze when she realized it was me. I asked to see him. Her expression was strange as she turned to go into his office. Not until then did I notice the scarf in her hair and the scent of her perfume. Both were exactly the same as mine.\nI left before she or he could come out. Once I was home, I stuffed the chocolates down my throat, one after another. They were too sweet, so I chased them with a bottle of vodka. I couldn’t get over how he had been so lazy that he hadn’t even bothered to pick a different perfume! Eating, drinking . . . the sweetness of the chocolate and the bite of the vodka entangled into one in my mind. Small details that I had once been oblivious to now all made sense: why he was always working overtime, why he always treated Yakk and me so well after business trips . . . I didn’t even know when the affair had begun. There were too many things that I didn’t know. Was she the only one? Had she seen me without my knowing? Why was her style so similar to mine? How did they flirt and whisper sweet nothings to each other? She couldn’t even speak Kemorean! Did they do it in English?\nHe had been an English major in college, which I thought was useless. As I expected, he couldn’t get a job after graduation. Kemor’s flexible family leave policy allowed couples to pool time off without assuming either would be the primary care provider, and so while I returned to work soon after giving birth to Yakk, he had stayed home. Eventually, because he was smart and hardworking, he started a new business to take advantage of the influx of foreign trade, and our lives became materially better. He grew busier and busier.\nLater, he insisted that Yakk go to an international school, saying that the faculty and facilities there were better. Moreover, if Yakk spoke English as well as his mother tongue, he would have an advantage in the job market when he grew up. I was not that keen on the idea. Our mother tongue is Kemorean. How could English be like our mother tongue? But I allowed him to get his way. I never expected those earnest suggestions were mere tricks to pave the way for his affairs, to give him the freedom to do whatever he wanted. He always claimed to be too busy and could only spend time with Yakk on holidays. I had to do the weekly pickups and the monthly parent-teacher conferences and care for Yakk when he was home.\nThe more I thought about it, the angrier I became, until my teeth were clenched so tight that they hurt and my hands trembled uncontrollably. Without thinking, I smashed the vodka bottle on the ground, the shards glistening in the setting sun. I picked up a jagged piece and held it against my wrist. Maybe it was all a nightmare and everything would be fine as soon as I woke up. Pain would awaken me. I pressed hard, but the edge was too blunt and my hand too unsteady. It only left a shallow scratch on my skin. I was about to try again when Yakk came home. He rushed over and snatched the shard out of my hand. He grabbed onto it so tight that the glass cut into his palm, oozing blood. But instead of crying, he hugged me tight and whispered, Don’t cry, Mom.\nHe said it in English. I stared at him, as though I didn’t know him.\nHe switched to Kemorean, Don’t cry, Mom.\nI hugged him back, tighter. How old was he at the time? Ten? Eleven? It was all my fault. I shouldn’t have trusted his father blindly and followed that ridiculous plan that estranged my child from Kemorean. I should have been tougher on him, forced him to recite famous passages from our literature and pushed him to speak and write more in Kemorean. Oh, Yakk, my son, it was my fault that you spoke your mother tongue so poorly. No, not me, but your father, and the bitch who snatched your father away from us. Their fault. It was all their fault!\nIf Yakk studied English like his father, he would also be stolen away from me by some foreigner woman after he grew up. I couldn’t let that happen. After I won sole custody of Yakk, I immediately transferred him back to a Kemorean public school, where he could be immersed in his mother tongue. I tutored him myself, correcting every grammatical mistake and drilling him relentlessly with more pure and proper forms of expression.\nBut it was too late. Even though several years have gone by since then, his progress is far from satisfactory. Yakk still cannot get his trills and flaps completely right; neither does he shift consonants properly in liaisons. He speaks slowly, with the syllables tumbling out awkwardly from between his lips one by one, devoid of the fluid soul of Kemorean.\nEven worse, Yakk has entered his adolescent rebellious phase. He’s always sullen and avoids me. I know that he’s still in touch with friends from the international school, with whom he speaks English. Maybe that’s why he cannot speak Kemorean well. The boy doesn’t feel a sense of crisis at all. I need to figure out his future.\nWait, maybe the language sheath can help him! If the sheath can be used to perfect translation results, then surely it can also be used to refine Yakk’s own speech. There must be others out there like Yakk who need this technology to help them speak perfectly. Genius! I need to speak with Hanson as soon as possible. Babel is such a powerful corporation that I’m sure they’ll figure out a way.\nUntil then, I’ll dedicate myself to the language sheath: to build an invisible wall that could protect Yakk from English. Babel’s translation service would separate him from those foreign friends and make him realize that they are fundamentally different from him. He is Kemorean. A true Kemorean should speak nothing but the Kemorean language. This is the indelible mark of our cultural heritage. No change. No abandonment. The present confusion and chaos is only temporary. When the language sheath is ready and Babel publicly releases the Kemorean translation service, order will be restored. People will slowly give in to Babel’s convenience. Over time, everyone will once again realize the differences between distinct communities. Yes, they’ll be able to understand one another, but only via Babel’s processed translations. Without Babel, without the language sheath, they won’t be able to communicate at all. People will have to accept our respective differences and remain divided in diversity. This is the only way to preserve the beauty of each individual language.\nOh dear! I didn’t mean to go on for so long. It must be the alcohol. Fortunately, Babel promised me that no human employee would be involved in the processing of my recorded linguistic samples. The neural network won’t keep the content of my words, abstracting and extracting only my speech habits and styles. Still, I must admit, it feels good to say these words out loud. It feels like shoveling out the aged, unhusked rice long stored away in the bottom of a granary: damp, mildewed, and rotten. Then, with the aid of alcohol, the rancid pile burns, its essence rising and coming back to life.\n4\nYakk waited ’til nightfall to go home.\nNo window was lit. Plugging the key into the lock, he turned it slowly, trying to be as quiet as possible. The deadbolt clicked as it retracted. In the silent night, the noise sounded like a piercing siren. Yakk’s heart clenched. Please don’t hear it. Don’t wake up. He pressed his ear to the door and listened. More silence. Gingerly, he pressed down on the handle and pushed the door open, moving inch by inch to avoid making noise. The same painstaking process was repeated as he squeezed in, closed the door, and took off his shoes. Just when he was about to sneak into his bedroom on tiptoes, a voice came from the darkness.\n“Yakk?”\nHe bit down on his lip, refusing to answer.\nThe lamp in the living room snapped to life. Dazzling light was everywhere. Instinctively, he squinted and retreated to the door, as if he were a criminal caught red-handed by the policeman’s flashlight.\n“Do you know how long I’ve been waiting for you?”\nYakk continued his silence. He wanted to escape into his bedroom and shut the door behind him, but he knew it wouldn’t work. She would just chase after him and talk and talk and talk.\n“Where have you been? It’s as if you don’t even remember this is your home. I’m not telling you that you can’t have fun, but you have to be responsible.” She staggered toward him, the strong odor of alcohol permeating the air.\nDon’t make her angry. Don’t fight back.\n“You think I don’t know what’s going on? You’re dating a foreigner girl, aren’t you? Do you understand what kind of trouble you’re getting into? They are all the same, coming from other places to Kemor, seducing and cheating good-hearted Kemorean men. They have no mercy at all. Yakk, oh my Yakk, do you remember your father? Don’t be like him.”\nHe clenched his fist and told himself to simply take the blow. She had been hurt so deeply by Father that she became paranoid. There was no foreigner girlfriend. He didn’t even have many friends. Since he didn’t want to go home, he could only wander the city alone listlessly after the school locked its doors at 6:00 PM. In the past, he didn’t understand why Father didn’t like to come home, but now he felt like he could relate. Mother always wanted to be perfect and correct, and she pushed people around her to be just like her. When she drank, though, she felt more like a real person. He would rather have her drunk and speak her mind instead of seeing her under constant tension, holding everything inside.\n“I’ve taught many girls from abroad like that. They are stupid. They can never master the fifteen tenses of Kemorean verbs. They’re always mixing up the four noun genders. Ugh, I can’t stand how they butcher our language. Kemorean should be smooth, graceful, and dynamic. But their grammatical mistakes and inappropriate usages feel like choking on a fish bone while drinking milk or bumping into insect eggs when caressing a piece of silk. Uncomfortable. Disgusting. Embarrassing. Add to that the awful pronunciations and odd intonations . . . they just don’t get it, no matter how many times you teach them. They don’t deserve to speak Kemorean at all!”\nHe reminded himself again that Mother was not talking about him. She was only firing insults at an imagined enemy who had abducted her son in her own muddled mind. But he couldn’t help thinking, Is this really how she feels while listening to me speak Kemorean? Is it really that disgusting? Afraid of her judgment, he had been talking less and less in front of her. He felt like a perpetual child whenever he spoke Kemorean: belittled, powerless, misbehaving, always mending some mistake that he had made. Only when speaking English did he feel like himself, but Mother never let him speak English in front of her.\n“Why don’t you answer me? I guessed right, didn’t I? All right, listen to me. Come home early. Don’t stay out late. Don’t date foreigner girls. If you want someone to talk to, you can always talk to me. I have a lot of things to say to you. I can tell you stories. I can read you rhymes. You can lie on my knees and we can gaze up at the stars together, just like when you were still a little child. Wouldn’t that be wonderful? Don’t leave me, Yakk. Remember what you said to me when your father left us? You said, Don’t cry, Mom. You said you would take care of me and stay by my side.”\nShe was too close now, backing Yakk into a corner. She was holding a bottle of vodka by its neck. Yakk turned his head to the side, trying to look over her shoulder to count the empty bottles on the floor. How much had she drunk?\nAbruptly, she pulled him into a tight embrace. “My son, my precious . . . ”\nHe was drowning in hot, rotten breath. Instinctively, he tried to get away from her, but his movement threw her balance off, and she crumpled to the floor.\n“Careful!” he exclaimed in English. His arms, extended to help her, stopped midway between them, helpless.\nShe sat on the ground, her head down, hair shielding her face and her trembling shoulders. At first, Yakk thought she was crying, but then he realized that she was actually laughing.\n“Ha! Haha! Is this how you treat your mother? I see how it is. Your wings have grown strong; you can fly on your own now, so you push away the person who brought you up. Is this how you treat your mother tongue? You studied English, and now you’ve forgotten who you are. You no longer want to be my son, is that it? You no longer want to be Kemorean, is that it? Kemorean is dying because of people like you. You don’t speak your own mother tongue. You don’t respect your own culture. You are a traitor, seduced by foreign languages and foreign girls. Do you know how awful your Kemorean is? Do you know how disappointed I am? Why am I working so hard for this language sheath? Why am I suffering so much? It’s all for you! Do you understand? Of course you don’t. You know nothing!”\nAgain. There she goes. But she was the one who knew nothing. For all his life she had been imposing her own thoughts on him, never bothering to listen to what he had to say. He tried to be as obedient and dutiful as possible, but that only made her feel like he was weak and incompetent. She made him feel small, an utter failure. He was a bucket full of explosives and she a barrel of alcohol. Just a single spark, and the whole house would blow up into dust. English and Kemorean intertwined in his body. Rebuttals and curses roiled in confusing tides at the tip of his tongue. He clamped his lips tightly and ran away. He had to get out, had to leave this place, before the words imprisoned behind his lips could break out in an uncontrollable flood.\nHe truly hoped that the gloomy, cold night could wipe his existence off the surface of this planet. And perhaps her existence, as well.\n5\nI think talking must be a kind of punishment.\nTo even make a single syllable, multiple vocal organs must collaborate. Your throat vibrates; your soft palate opens and closes; your tongue rolls; your lips change shape. Vowels and consonants. Long, short, light, and heavy. Speaking is a complex physical act. Day and night, I speak and speak, until my lips are numb and my throat burns, until I’m thirsty and exhausted. What’s more, coming up with things to talk about is torture for the soul. It feels like pushing my head into my own skull, like the ouroboros devouring itself. I dig for content, concepts expressible and unspeakable, in every nook and cranny of my brain with the tip of my tongue, licking through the folds, capturing leftover rotten crumbs of my long-gone mind, mixing them with saliva and vomiting them out.\nI’ve hollowed myself of words, but still, I cannot stop. As soon as I stop, the earbuds ring with a droning alarm, like swarms of bees or mosquitoes spiraling around my head, buzz, buzzzz, buzzzzzz. Sometimes, even when I’m talking, my ears fill with hallucinated humming. Then I have to pause and check whether I’ve broken any rules by repeating the same content too many times or imitating someone else’s speaking style unconsciously. But if I pause too long, then the alarm starts going for real. I press my palms against my temples and cover my ears, but it’s no use. The sound is even louder that way because the earbuds are buried in my aural canals.\nI can no longer distinguish whether my speech is real. The present I live in, the moment, no longer feels authentic after being described again and again. I’ve combed through my memories so much that they’ve been reduced to cold ashes. I can only make up stories, tell lies, abandon logic, and give up on reality. The contents of my speech don’t matter. I just have to keep my lips moving. I need to output. When my mouth isn’t eating, it is talking. Eating is necessary to sustain my life, with no pleasure in it; speaking, however, makes me feel alive because it hurts.\nI’m like a silkworm, gulping down mulberry leaves and then spitting out threads, eventually enclosing myself in a cocoon. After a year’s metamorphosis, I—no, the language sheath—will emerge from the cocoon. Bearing my life’s expectations and the studied perfection of my Kemorean, the sheath will be a truly magnificent creation. She’ll dance elegantly in the wind, wrapping her rainbow-colored gossamer wings around all the coarse, crude, broken bits of Kemorean in the world, and turn them into the beautiful and elegant language that I possess.\nThe language sheath won’t disappoint me like Yakk. I’ve poured in all I have left to mold her. She bathes in the purist form of Kemorean every day and absorbs its nutrients. She’ll become the most perfect creation the world has ever seen, with the most graceful grammar, the most standardized sentence structure, the most proper punctuation, the most eloquent forms of expression. I will construct her skeleton with my words, nourish her flesh with my blood, and embellish her soul with my memories. Finally, with a hint of my alcohol, her aroma will be sublimated as well. I want to make up for all the regrets that I harbor regarding Yakk’s education. I’ll give her the best gift possible—Standard Model Kemorean. She is my most obedient and dutiful daughter.\nYes, the language sheath is my daughter, my second child. This agonizing and protracted process is no different from giving birth. Why, I went through just as much discomfort when I was pregnant with Yakk! Soon, soon she’ll be born. Look, Yakk, you’ll have a little sister. But where is Yakk? I haven’t seen him for days. What’s wrong with him? Is he jealous because I’m teaching Kemorean to his little sister with more patience?\nDon’t be like that, Yakk. Listen to me. You are the big brother. You must care for and protect your baby sister. She’ll help you after she’s born. With her to polish your speech, you needn’t worry about not speaking perfect Kemorean anymore. Your little sister will help many other people, too. She has a loving heart, and she’ll treat everyone with equal kindness, perfecting their language after my perfect style. Kemorean ears deserve the best language in the world.\nThe language sheath is both a model and a specimen. Even if a catastrophe strikes the linguistic landscape in the future, she’ll still be there, a memorial to Standard Model Kemorean. Even if no one speaks Kemorean anymore, she’ll remind them of the glory that had once been its due.\nOh, she’s kicking me, telling me that she needs nourishment. She needs alcohol. Ha, she’s making requests.[Drinking sounds.]\nAlcohol is such a wonderful creation. Vodka is my favorite. Because of its purity. Its simplicity. No pretentious rituals when drinking vodka. Anytime. Anywhere. Just a quick injection of unadulterated alcohol. It has no color and no taste, so it can serve as the base of countless cocktails. How do you make a Bloody Mary? Vodka plus blood. Ha, kidding. But you can also use blood. Do you want to try?\nKnife. I have a knife. A good knife. Clean and smooth enough to use as a mirror. Oh my . . . who is this woman? Look, she has dark circles under her eyes. She must be in so much distress. So tired. Poor thing. Come on. I’ll pour you a shot as well. You’ll be fine after a drink.\nWhat does it feel like to have a knife cut into you? Well, there’s no pain. Your blood oozes out, not very fast. Drop after drop, like crimson beads. Beads falling into the glass, blossoming in the transparent medium. So pretty. Oh, it does hurt. Pain just kicks in late, I guess. A lovely feeling, this pain. Makes me feel alive. I see fireworks. Fireworks of blood.\nBlood. So much blood. Yakk, where are you? Help me, help your mother. Phone, contacts, Yakk. Will you come, Yakk? You will. You promised. You promised you’d protect me—\n6\nAgain, Yakk found himself in that recurring nightmare.\nHe was standing in the center of a circle of people, each person about a dozen meters away from him. Tall, short, robust, and slim, all their faces blurred. Everyone mumbled. He couldn’t hear them clearly since they were so far away. However, at some point in the dream, the circle shrank as they stepped toward him in unison. Each of them spoke in the voice of Mother, speaking Mother’s tongue, besieging him from all directions.\n“Yakk, listen to me, you must respect Kemorean. You have to speak your mother tongue well. This is about honoring your culture . . . ”\n“No more English! Stop seeing her immediately. I’ll find you a nice Kemorean girl who can speak perfect standard Kemorean just like me . . . ”\n“White. Everything is pale white. White wall and white ceiling. White dribbles down from the overhead lamp, lands on my left wrist, wraps around it . . . then a tiny drop of red blossoms in the center of the whiteness . . . ”\nYakk wanted to shove them aside and break away from the circle, but more people stood behind them, ring after ring, surging toward him like tides. He couldn’t breathe.\nHe opened his eyes and sat up, gasping.\nHe saw Mother was already awake. She had been talking for some time, probably as soon as she returned to consciousness. She was describing the ward to herself in meticulous detail.\nHe stretched to return circulation to his stiff body, fumbled for his glasses, and put them on. The blurry world became clear again. He saw Mother trying to unwrap the bandage around her left wrist with her right hand. He rushed over and stopped her before she could succeed.\n“Yakk.” She was startled to see him. “You . . . Where am I? What happened to my hand? How long have I been asleep? I’ve got to get back to work. The language sheath will soon be finished. Don’t worry. The sheath can help you . . . ”\nHe had no idea what he should say or what he could say. Instead, he opened his arms, leaned toward her and hugged her tight, just like the way he used to hug her as a child. He couldn’t remember the last time he had held her like this. He had forgotten that she was so skinny, her protruding bones digging deep into his chest and arms. He began to weep.\nThe man from Babel introduced himself as Hanson, the executive in charge of the Kemorean Project. He spoke to Yakk in English and shook his hand like an adult. Yakk didn’t like him, though. Mother’s condition was Babel’s fault.\nHanson said that he wanted to talk with Mother in private, so Yakk left.\nIt was a beautiful day outside. Wisps of cloud decorated the edge of the sky. A mild breeze brushed his cheeks, carrying the smell of fresh soil, sprouting plants, and wild mushrooms. All this mess will soon be over, Yakk thought. He would talk to his mother about his university application and his plans for the future. His throat itched, and he started to cough. Spring had arrived. Willow fuzz was everywhere in the air.\nHe went back into the hospital and waited outside the ward. A few minutes later, Hanson emerged.\n“The prototype is finished,” Hanson said in accented English. He held out his hand to Yakk, palm up. “Try them. You can speak Kemorean, and I’ll speak German. It will be more comfortable for me.”\nYakk picked the tiny pair of spiral-grooved mini earbuds out of Hanson’s palm. He pushed them into his ears, the spiraling shapes digging into his ear canals perfectly, sealing and blocking out noise. He almost couldn’t feel they were there. He saw that Hanson was wearing a similar pair of earbuds. Tiny blue lights blinked at the visible ends of the earbuds from time to time.\n“This is our latest and most advanced hardware. Can you understand me?”\nYakk nodded. Hanson’s words had been translated and then delivered into his ears by a female voice in Kemorean. He didn’t recognize the voice, but something beneath the words rang familiar.\n“The language sheath, modeled on the corpus provided by your mother, is applied to all Kemorean output. Any user who chooses Kemorean as their target language will hear translation results polished by her speech style.”\nSo that’s why the translation feels familiar, thought Yakk. Neither the voice nor the words belonged to his mother, but they both did belong to her in another sense. He had never expected the effect of the language sheath to be so . . . uncanny.\n“Don’t worry. Her proposal has been approved and implemented. No problem with the job either. Usually, Babel requires a college degree, but we can make an exception for you. After all, your mother has done so much for us. You’ll be graduating from high school soon, right? Come to Babel right after. You can start as a salesperson. Your personal story of struggling with languages could serve as a good showcase to our customers.”\nBabel? Job? What did Hanson mean? Did Mother just decide on a future for him without asking for his opinions at all? He didn’t want a job. He wanted to go to university.\n“Go spend some time with her. She went through a lot to make the Kemorean sheath. Because of her, Babel’s performance in this country will be exceptional. You absolutely don’t need to worry anymore about your Kemorean!”\nYakk opened his mouth and wanted to argue, but nothing came out. He didn’t know whether to speak Kemorean or English to the man.\n“You’re lucky to have such a loving mother.” Hanson patted him on the shoulder and left.\nYakk returned to the ward. Mother was half-reclining on the bed, reading a small three-fold leaflet. On the cover was a pair of spiral-grooved earbuds. Blue lights flashed from inside her ears.\n“Did you thank Mr. Hanson? He’s been so helpful to us. When you join Babel later, you have to work hard.”\nYakk’s lips moved, releasing a few mumbled syllables. English and Kemorean warred in his head, and as he strove to distinguish and hypercorrect, the syntax became mangled. Words hung suspended in air, light and carefree as the willow fuzzes, reluctant to come back down to earth.\n“What did you say?” Mother tapped her earbuds.\nYakk repeated himself, clumsy word by clumsy word, in Kemorean: “Babel, I do not go. Want to go university.”\n“Yakk, I know that you have ambition, but you need to be realistic. Your grades aren’t good enough for university. The job at Babel is a rare opportunity. They’re always named in surveys as one of the best employers in the world. Do you know how many people want a job at Babel? Even if you could get a university to accept you, can you find a job better than this one at Babel after you graduate? I’ve made the arrangements for you. Do as I say and you’ll be all right.”\n“International school, send me back,” he continued in Kemorean. “I can go to foreign university.”\n“That’s impossible. You’ve been educated in the Kemorean public school system for years, and you’re not prepared for foreign university applications. You can’t even speak your mother tongue well. The idea of using English—”\n“Mother tongue yours, not mine,” Yakk said. “I, you do not know.”\n“Yakk, I know you and your speaking habits too well. I’m your mother. Even if the sheath is fixing all your mistakes, I can still imagine what your original words sound like.”\nYakk frowned. “My original words. You hear not?”\n“Yes, Babel has realized my dream. You don’t need to worry about speaking poor Kemorean anymore. Every sentence you speak now will be polished by the language sheath before being transmitted to my ears. The language sheath doesn’t just have to be used for translations! It can be used for a better way of speaking. You can hear my original words only because the sheath uses my language style. Aren’t I a genius? The sheath can be applied to your words, your foreign friends’ words, artificial intelligence’s words, everywhere that needs Standard Model Kemorean output. I proposed the idea to Hanson, but I didn’t expect that they could have made it reality so fast.”\n“Everyone’s words, you tamper?” Yakk couldn’t believe it. From now on, everyone would hear only a single unified Kemorean language style. They would lose individual quirks and personality. After the filtration of Babel’s language sheath, all Kemorean speech would be standardized into Mother’s language.\n“Not tampering, but embellishment. What I provided is only a sheath. The content of the speech won’t change. The sheath only makes the words more elegant and pleasant to the ear.”\nYakk could hear a droning against his eardrums. He switched to English. “Then what’s the difference between my speaking Kemorean, English, or any other language to you? All you hear is your own language. You won’t hear my voice at all.”\n“Of course I can hear your voice. Hanson told me that Babel’s Voice Imitation Project will soon be finished. Data from just a few sentences will be enough for the algorithm to synthesize the waveform of the speaker’s voice. Everyone will be speaking perfect Standard Model Kemorean in their own voice. Imagine that wonderful future! It will start a storm, a revolution.”\nYakk felt as if a bucket of icy water had been thrown in his face. Thinking about the monotonous world after his mother’s “revolution” terrified him. With the new language sheath and the voice synthesizer, everyone in Kemor would be speaking in Mother’s language, the graceful and noble language of sterile perfection.\nI never understood her, he realized. He had thought that his mother just didn’t want to hear improper Kemorean, but the truth was, she didn’t want to hear any voice other than her own. She had tried, without success, to mold Yakk according to her ideal, to make him speak her style of “authentic” Kemorean. Her disappointment in him was rooted in her own sense of failure. In Mother’s eyes, Yakk wasn’t only bad at speaking Kemorean, but without any redeeming qualities.\nHaving given up on him, she had turned all her efforts to the creation of the language sheath, her pride and joy, her second child, whom she could mold and shape completely in accordance with her ideals and substitute for her son. And even so, she still wouldn’t give up on interfering with his life, still hoped to control his path, decide his future. She had deprived him of his voice, deprived everyone else of their voice, but she remained completely oblivious to what she had done.\n“What’s wrong, Yakk? Hanson said that the corpus he collected from me was enough. I finished the job sooner than planned. Let’s celebrate once I’m discharged! See, I’ve saved Kemorean. You don’t need to speak English, and you no longer need to feel inferior for your improper Kemorean. Aren’t you happy?”\nYakk clenched his jaw. He had to speak, let it all out. No one had told Mother that Father had chosen to escape for the refuge of other women, and Yakk had chosen to endure. But he had to speak out now, to tell her how he felt in his own language. He had to speak in English, the language in which he felt at home, not the “mother tongue” that only left him feeling inferior, insecure, and tongue-tied. She would hear only the perfect Kemorean improved by the language sheath, as she wished, but the content would be the reality that he wanted to tell her. Maybe after he’s done talking he should take out the Babel earbuds, throw them onto the ground, and crush them with his heels, so that he could force her to listen to him speak in English. But first he had to make sure that she would listen, and that she could really hear it.\nHe opened his mouth and began to speak, in his real mother tongue.\nAuthor and Translators’ Note: We’d like to deliver a special thank you to Ken Liu, whose amazing comments and advice have greatly refined and enriched the story.\nOriginally published in Chinese in Harvest: A Literary Bimonthly, 4th issue of 2019.\nTranslated and published in partnership with Storycom.\nRegina Kanyu Wang is a a writer, researcher, and editor, currently pursuing her PhD under the CoFUTURES project at the University of Oslo. She writes science fiction, nonfiction and academic essays in both Chinese and English. She has won multiple Xingyun Awards for Global Chinese SF (Chinese Nebula), SF Comet International SF Writing Competition, Annual Best Works of Shanghai Writers’ Association and more. Her stories can be found in her individual collections Of Cloud and Mist 2.2 and The Seafood Restaurant, various magazines, and anthologies. She is co-editor of the Chinese SF special issue of Vector, the critical journal of BSFA, The Way Spring Arrives and Other Stories, an all-women-and-non-binary anthology of Chinese speculative fiction, and the English version of The Making of The Wandering Earth: A Film Production Handbook. When she is not working on science fiction related projects, you can find her practicing krav maga, kali, boxing and yoga, or cooking various dishes and baking her favorite desserts.\nEmily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature.", "source": "https://clarkesworldmagazine.com/wang_05_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Language Sheath by Regina Kanyu Wang, translated by Emily Jin and Regina Kanyu Wang"}