{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Amal Singh", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "fc/1whbAuP2FWWObuTCMSdtf1Kc=", "id": null, "license": null, "comments": "", "raw_text": "5530 words, short story  A Home for Mrs. Biswas  Once she saw the red sands stretch across miles, craters as big as the stadium her father played hockey in, and golden spires shimmering brighter than Amritsar’s Golden Temple, Aparna Biswas didn’t want to live on Earth. Of course they were a far cry from her own backyard where, in summers, she would sit on a cane chair and watch the bougainvillea bloom the shade of a bride’s blush, “string of pearls” flowers wrapped around the wooden railing on her porch, eating a succulent dussehri aam as a pair of ducks swam in the small pond she liked to call her Pacific. But those summers only existed behind a dim haze of memory. She would take a living planet over a dying one any day.  “Beta, I think I might find god there,” she said to her son, tearing her gaze away from the Mars hologram. “Build me a home on that planet and all will be mangal.” She chortled at her own joke. Puns on the red planet had filled the Internet, and ever since Sunehri, her granddaughter, had taught her how to use a phone, she kept finding these odd little information trinkets.  “I might have to break all our deposits and still not be able to book a single one-way ticket, Maa,” said Nishant, her son. “Forget about building a home.” In his eyes too, there was a deep yearning to go to the red planet. He stood near the window of the living room of his Chembur apartment, looking at the once-blue sky, blotted out by an eternal gray smog that was here to stay.  “But our PM said in his last speech there was a lottery system,” she said. “And you know how lucky I am.” It was true. Stories of Aparna Biswas’ luck were splattered on the walls of Kolkata, and the gullies of Bombay.  When she was twelve years old, Aparna once sat in the front row seats of a stadium, watching her father, Ashok “the lightning” Biswas, drive the hockey ball around like it was glued to his stick. When he was six yards from the penalty line, a sparrow perched atop a stadium floodlight took flight and glided toward the goalpost, thinking it was an eagle. Near the penalty line, Ashok took his trademark stance, right leg backward, hanging in the air, left foot firmly on the ground, the hockey stick coming down on the ball like Indra’s vajra. The ball sped like a bullet, missing the goalpost by six inches, toward the stands where Aparna stood cheering her father. It would have shattered her skull had it not been for the timely intervention of the poor sparrow, who hit the ground immediately in a tangle of feathers and beak.  It was her extreme good luck that she met Sujit, her later husband—a writer of Bengali pulp magazines and a great admirer of Basu Chatterjee’s cinema—inside a dingy movie theater that smelled of cigarettes and leather and moist fabric. She was on her way out, leaving a movie in between, and he was on his way in, hiding from cops. That day, Aparna ended up watching a movie two times in a row when she had no intention of watching more than twenty minutes. During the first showing, her eyes were glued to the neon-lit exit sign, even as Sujit rambled on about how his latest book had caused a stir. The second show, they both actually watched the movie in silence, while sharing a massive tub of oversalted popcorn.  Aparna’s string of good luck rubbed off on people she loved. This shower of good fortune saved Sujit from two cancers in life. But, in the end, he was undone by a fall. A fall that Aparna couldn’t quite recover from. Now she saw Sujit in all faces and all movies, even at seventy-eight years of age. But she had also come to accept that if her luck was Hari’s will, then so was Sujit’s passing. And that’s just the way things were.  Perhaps Mars—mangal—wouldn’t make her miss Sujit as much. Perhaps making a life there would be its own challenge that would drown out all past griefs in one giant wave.  So, on the day she expressed her desire to go to the red planet to her son, she also expressed the same desire in mute prayer, with incense and chants, and fruits and laddoos, and a garland of dahlias, to Hari, her god. And her wish was fulfilled.  Nishant’s work in the Department of External Affairs was of a clerical nature. The department was an island of nontechnological bureaucracy amid a sea of other departments where supercomputers had replaced every human. And thus, in the last year of the twenty-second century, he still had to push papers around. Stacks of applications for the generation ship Madhubani stood in front of him, all with a red stamp of rejection where the wax was still wet. One of the applications was his, which had miraculously escaped the Attorney General’s stamp. An application that wasn’t rejected already was automatically accepted—no one wanted to waste extra wax of a different color to signify acceptance.  “See, I told you,” said Aparna Biswas, gazing at the bright golden card embossed with the new crimson insignia of ISRO that was issued to the passengers of Madhubani, even as the generation ship left Earth’s orbit, and spun to bring Earthlike gravity inside. Soon, as per the new travel directive, the gravity would reduce to a third to acclimatize passengers to a Martian way of existence. It was to happen so gradually that the passengers wouldn’t feel the change.  On the fifteenth day of the voyage, as Aparna Biswas sat in her climate-controlled resting pod, looking out toward the unmoving stars against the purple-black expanse of the Milky Way, she heard faint music sieve through the metallic walls of the cabin. Her granddaughter had long since given up listening to her iPod, and her son hadn’t taken up softly humming old classical music from his father, much to her chagrin.  “What time is it, Nishant?” she asked, wondering if it was still night, as the space outside suggested. She couldn’t much tell, but she wondered if there was any point to a twenty-four-hour cycle, considering soon, all of that would change. She always considered herself a good adapter to change in patterns, and this was the biggest change of all. Her medications, though, would still need to be consumed, only the intervals would change. She was sure a doctor on board would sort it out.  “It’s four in the afternoon,” said Nishant.  “Someone is playing Pancham Da’s songs,” she said. Putting on her glasses, she strutted toward the source of the sound barefoot. She crossed a narrow corridor that was filled with people at all times, some the crew of the Madhubani engrossed in eternal calculations, some the passengers, engrossed in eternal small talk that would last them the voyage.  A bend later Aparna arrived in a spacious foyer. Gray-white walls, with large windows looking out into the universe speckled with wonder and stardust. Bright Narad droids wheeling about carrying trays of food and beverages. A smattering of chosen populace who had given up their old home, now sitting huddled in front of a mock stage. And on the stage, the source of the music. A man with wavy gray hair, and a thin moustache, and of an overall bashful bearing was playing the sitar. A man who reminded Aparna very much of her Sujit. A man who kindled an intense yearning in Aparna to be young again.  She sat on the cold floor and listened to the music. Each note a reminiscence of a warm and cloudy past. An evening inside a radio station building, walls a dusky sepia, scents of cement and tea and jasmine and tobacco and almond oil. A midmorning rush of the Virar fast local train, and the visions of sunbaked stones beside gleaming metal rails. The air rented with shrill sounds of the motor of the auto rickshaws, the ring of their meters. All sounds, all scents, all sights, snuffed out in space, yet brought together in space. An irony.  The music played on, plunging Aparna deeper and deeper into the memories of Sujit. In that moment, she considered herself profoundly lucky, having an anchor to hold on to in the vastness of space. But perhaps her good fortunes were reserved only for Earth.  In that moment, the hull of the Madhubani became an innocent sparrow to the hockey ball of an approaching meteor, perhaps saving Earth in the process. In space, feather and beak, metal and rock and bone, like a million shards of a metal star.  “Mn Lla, what is that star?”  Tripti pointed a finger at a blue dot, a hazy smear against the Mars sky. Mn Lla, an indigenous Martian, skin like ceramic, six-limbed invertebrate, yet held together vertically by a life force yet alien to humans, looked at her, and then at the sky, then back at her. Mn Lla spoke in a vocal register only Tripti could discern, because of the nature of their relationship—Martian Guardian to a second-generation Terran.  “That’s not a star,” said Mn Lla. “That’s the home of your ancestors.”  “You mean that’s Dharti?”  “You’re looking at it through the translucence of the dome. That’s why it appears the way it appears.”  “I dream of it sometimes,” said Tripti. “A vast green field. Sky gray as graphite. I see a boy who calls me by a name that is not mine.”  “Are these dreams recurring?”  “On and off.”  “And are they causing any trouble to you, Tripti?”  She shook her head. But what was trouble for a fourteen-year-old child who had grown knowing the red planet as her only home? Born inside the Sistrom-Raja facility, a great campus spreading across a thousand acres of Martian land, surrounded by a shimmering dome that controlled the climate inside, Tripti had gone only as far as the Holden Crater, and that too, suited up and supervised. Her best friend was a Martian child named Kka.  And yet in her dreams she dreamed of a boy who was a Terran and grinned at her, a front tooth missing. A boy who called himself Sujit.  “Well, if they do cause trouble, let me know,” said Mn Lla. Mir wiry frame swayed against the manufactured wind inside the dome.  “Is Dharti dying?” she asked.  “It is,” said Mn Lla after a long, lingering pause. Tripti could almost taste the mournful bitterness in Mn Lla’s answer.  “I’m afraid of dying,” said Tripti. In her dreams, she was always falling. In her dreams, her skin crawled with spiders and pus oozed out of wrinkles. And now she had told Mn Lla about her troubles.  Mn Lla held her hand with one of mir limbs. A warmth surged through her in that moment. Mem understood her fear.  Kka lay beside her on the rug staring at the ceiling, a history book sprawled open on mir porcelain body. Tripti’s nineteenth attempt to solve a 32x32x32 Rubik’s Cube had failed miserably, and her twentieth try—where the cube was now an impossible jumble of colors deep into the spectrum that the human eye couldn’t even appreciate—didn’t look like it would come to fruition, either. Kka flipped the book to the thirtieth page and spoke aloud the first line.  “Not subscribing to the idea of monotheism, one of the world’s largest religions had in its pantheon a multitude of deities.”  “What are you reading?” asked Tripti.  “The Idea of God by Astrid Ahuja,” said Kka. “Fascinating. People on terra really were into this stuff you know.”  “Oh Lord, asked Arjun to Lord Krishna. The ones standing before me are my own brothers. How could I pick up my bow and arrow to strike them down?” Tripti said, but the register of her voice was alien. Kka sat up straight, mir spineless frame undulating without wind, mir bulbous eyes fixated on Tripti.  “What did you say?”  “It’s in the ‘Bhagavad Gita,’ the scripture,” she said, her voice reverting to normalcy. “Lord Krishna responded by urging Arjuna, the great warrior, to do his duty.”  “How do you know all this?”  The words she had given shape to vaporized inside her. She had always known these details, and these weren’t even from her dreams. She was born with an inexplicable knowledge, and it was only now, at eight years of age, that she had disclosed any of it.  “Let’s go outside,” she said, putting the cube aside. Kka followed her as she strode out of the room, into the metallic hallway that led to Garden Karla, a playground for Martians and Earthlings alike, with myriad surfaces, carefully controlled zero-G slides, and stick and ball games of a kind where the ground was just a nuisance and the sky was the limit.  In that moment an inexplicable trance took hold of Tripti as she strode toward a group playing a stick and ball game. One Terran child was floating in the air, clumsily holding a stick as the ball bounced between the sticks of the other children, similarly hovering a few yards away, in a haphazard formation.  “I want to see the captain,” she said to the child. Kka stopped in mir tracks, looking at the scene unfold with increased trepidation.  “Can you step away from the line, please?” said the child.  “Your way of holding the stick is all wrong. You can’t swing it with enough momentum if your grip is faulty,” said Tripti with a surge of confidence.  Somewhere a shrill whistle blew. The other hovering children came down to the gray-purple ground in one collective heap. Play was stopped and Tripti was the cause. The child she was speaking to walked over to her, his eyes narrow as slits. He was joined by a girl whose skin flushed with anger.  “You have quite a nerve obstructing play like this,” said the girl.  “You look like the captain,” said Tripti. “Good. I want to play.”  “What makes you think you can join us just like that? What makes you think you can master Kekepes?”  “I can hit the ball better than most of you,” said Tripti.  “Tripti, it’s a waste of time, c’mon,” Kka interjected. Tripti gave Kka a look, then raised her hand, palm raised, toward the captain, as if expecting her to just hand over the stick. Then Tripti gazed stoically at the captain and she relented, almost miraculously. What was a moment ago an altercation, became a camaraderie.  In Tripti’s dreams the boy grew up to be a tall, gaunt man, who sang songs in a language she hadn’t heard, and wrote on surfaces she hadn’t seen. And yet she found herself singing and humming the same songs, and searching throughout the Sistrom-Raja facility for old video files. Perhaps in those videos there lay a key to solving the mystery of the boy she saw so often in her dreams. Perhaps in those videos lay answers to her inexplicable abilities to play a sport like the best champions.  But as she grew up all these memories and visions faded like afterthought, like dew evaporating from a snake plant. She became a Champion of Kekepes, but left the game when she got riddled with frequent injuries. In every game, as she hit the ball, and it came flying back, an ancient, childhood fear of dying soared back to haunt her. In her dreams, she was always getting hit by a stone, or a ball. In her dreams, she was always falling.  She soon joined Mn Lla and Kka in an expedition far beyond the Holden Crater, to look for the elusive Rock of Esnu. Mn Lla, a Martian archeologist, and his nephew—Tripti’s friend, Lla—a chemist, had between them postulated that the rock held an entirely new kind of mineral, an inorganic compound that had properties to aid life span, a mineral called elasium. It was only recently found that elasium was present in trace quantities in Martians but not in humans. But Mn Lla’s experiments had suggested that ingesting elasium might work in favor for humans who were bound by the zincs and magnesiums and sodiums and potassiums of the old world. And so, twenty years after remarking upon the smear in the sky that was old Earth, Tripti willingly became an object of experimentation to two Martians she loved.  “Tripti, you can say no and I will understand. I don’t want the burden of this discovery to hinge on your decision,” said Mn Lla. The shadow of mir undulating figure fell upon the red sands like a dark flag fluttering. Tripti’s breath fogged her helmet as she held Mn Lla’s gaze. Kka stood by her right. The words mem spoke radiated inward, to her mind, finding a home in her, a technique they’d learned when they were younger and had just learned the mechanics of telepathy. Those were the words of hope, a promise of a better future.  “I will do this,” she said out loud to Mn Lla. Mem injected Tripti with a concoction that held a tenth of a microgram of elasium, the recommended quantity as per their experiments, which would not overwhelm the human body. But of course Tripti was the first live subject, and anything could have gone wrong. But Tripti had in her being a far greater force that worked by its own rules. Tripti ingested the mineral.  For a week, there was no noticeable change in her metabolism. For a month, she waited to see any side effects. There were none. Tripti began actively participating in Kekepes again, for she felt a renewed vigor for the game like a fire by the seaside that refused to go out, embers licking wood relentlessly. For the next four years, her body refused to show any ill effects of elasium. For the next fifteen years, her liver secreted bile like it always did, her stomach digested food like it always did, her skin glowed radiant, like a bougainvillea blooming in the shade of a bride’s blush, not wrinkling at all.  It was after twenty-five years, sitting two feet from where the dome met the red ground, in a garden at the north edge of the Sistrom-Raja facility, holding in her hands an old videocassette of the old Terran movie named Rajnigandha, that she realized she had stopped aging. On the contrary, though, Kka—her friend and companion—lay beside her on the sand, mir once-smooth ceramic skin now blackened like soot in places and wrinkly like dried lemon.  “I enjoyed what you showed me, even though I didn’t understand it,” said Kka.  “Companionship in terra didn’t work like companionship here,” said Tripti. “What we have . . . this movie’s characters didn’t and never could.”  “Do you yearn for that other type of companionship?”  Tripti didn’t have an answer to Kka’s question. She had never told Kka, but she knew Kka understood the nature of her recurring dreams. She had yearned to meet the boy who had called her with a different name. In the eyes of that boy who often changed form and took the appearance of a young man, there was a love the kind that Kka couldn’t give her.  “How does it feel to defeat death?” asked Kka. Tripti knew this question was coming, but she didn’t have an answer to it. Not yet.  “I haven’t defeated it. Just prolonged life.” It felt like the right answer. Until she could see otherwise.  “They remove the dome tomorrow,” said Kka. “Sistrom-Raja will never be the same again.”  “It will be better,” said Tripti. “Children born now will know a life beyond the Holden Crater.”  Kka’s skin shimmered a golden sigh. “Do you think terra will accept elasium?” Mem asked.  “I don’t know,” said Tripti with a sigh. She hadn’t considered the many elaborate viewpoints of Terrans when it came to nigh immortality. Inside the Sistrom-Raja facility, first-generation Terrans who had grown old on Mars had expressed a deep longing for Earth. They had lived their time here on an alien land and when it came to bid goodbye to their lives, they wanted to do so in their homeland. When given an option to ingest elasium and elongate their lives, they had plainly refused. When she was chosen as the Chief Ambassador from Sistrom-Raja to visit Earth, Tripti had eaten a ripe mango in front of a cheering crowd full of aging Terrans who gave her longing, mournful glances, perhaps tasting the juiciness of the king of fruits, the memory of their once-glorious home given a form. At that moment the gesture had felt symbolic, special. Now it felt hollow.  But she understood.  “I will miss you,” said Kka, in an un-Martian manner. The rhythm of the words was all wrong, the vocal register barren. Kka’s shimmering sigh was gone and now replaced by a greenish hue over the ceramic skin. To make up for the broken vocals, in their mute, telepathic way, they communicated again, through shapes and figures, their love for each other. A lone tear trickled down Tripti’s cheek, dropped on the Martian soil, marked their separation briefly, and fizzled away.  When Aparna Biswas was six years old she had painted on a canvas a city inside a dome with skies the color of mud. Inside the dome there was a small rectangular nook atop which she had scribbled, in dull black paint, home. The curve of the “e” had begun to weep soon, forming a trail of black across the length of the painting, pooling on the floor in a small puddle.  Her father had come home, sweaty from a training session, and found her gazing at the unfinished painting. “I don’t like it,” she’d said, choking back a hitch and a sob.  “You can make it again,” said Ashok Biswas. “Until you get it right.”  Tripti, at the age of eight, had seen a splinterfly—a seven-winged, Martian bug species—buzzing near her residential quarters. She had gazed at it in mute wonder; it was impossible for it to have taken birth inside the facility. Now, at the age of thirty-nine, inside the generation ship Kalamkari, she wondered if it had merely been a vision, or was it really a fossilized specimen come to life. She remembered, though, the wonder in her eyes, and the same wonder was reflected when she saw Earth approaching, a burst of blue surrounding swathes of dark green and foamy white.  As the Kalamkari descended, she could already feel the difference in gravity, the extra weighty pull, inexorable, the pull of a land that was once home to her ancestors. She looked around her cabin and saw wrinkled faces light up, de-aging twenty years in three seconds.  “All descendants are requested to assemble in the waiting pod where they will be provided with breathing masks and sanitizing equipment.” A robotic voice chimed through the walls of her cabin. She got up, and took a deep, clean, almost metallic-smelling breath of the generation ship, for the last time.  “If you could just listen, for once!”  The front porch was caked in mud. Dark crumbs of soil mixed with bug entrails lay all over the creaking wood. The lower half of an ivy creeper lay sprawled on the floor, the green leaves gathering brown motes even as its upper half dangled from a railing. The pond outside had mostly evaporated in the heat and all that remained was watery mulch. Through that mulch, Sujit had dragged his sandals, as he’d come back from work in rage. And in his rage, he had slipped his sandals off carelessly, splattering mud all over the porch, much to Aparna’s anguish.  “I’ll clean it later,” said Sujit, lighting a cigarette, his dark face engulfed by a smoke cloud. Aparna waited for it to vanish before speaking.  “What’s the matter?”  “The movie is not happening. I am getting no advance.” He said simply, as if it were the plainest, most ordinary thing to say in the whole world. “We might have to sell the house.”  In that moment, Aparna could have said what she had always wanted to say to him, but she knew he wouldn’t listen. If only Sujit could hear without her saying it. If only Sujit could see inside her mind. She wanted what he wanted, and she wanted it harder and better. But there was no way to get it.  “Maybe I should apologize to that harami bank manager who fired me. Beg him to take me back.” Sujit laughed as he spoke these words. His thin frame rattled as he laughed and coughed.  They spent ten minutes in silence; Sujit gazing at the dried pond, Aparna looking at Sujit’s creased, tired face. Then, Sujit asked her where she had put the broom.  The idea of a home she’d carried with her vaporized as she set foot inside the dome. Tripti blinked as a fading sun sent rays filtering through the dome’s cracked surface. The skies were a thick gray, and the ever-present smog she’d only heard of in stories leaked through the protective shield one mote at a time. This wasn’t what her dreams of a perfect land had prepared her for.  She was inside the Govardhan sector, a sprawling two hundred-acre rocky land to the south of what was once known as the Hooghly River. To the east was a marshy wasteland. To the west was a hill that rose to an annoying height and then stopped, as if told to not exist anymore. Much of the population was densely concentrated in a small town-like unit, with blocky, cement houses. An inhabitant of one of those houses was to be the first resident to receive elasium. Aparna, accompanied by a doctor who had been debriefed by Mn Lla, entered the house. The house was bare and empty and cold and so was the person who lived in it.  “Why are you here?” said the old man, whose wispy white hair fell on his shoulders in a broken way. Tripti didn’t understand what he said. It was the problem of the vocal register she’d grown up speaking with. The doctor elaborated and Tripti nodded alongside him.  “I won’t take it,” said the man after listening to the doctor. His voice was solemn, his skin sallow, and his eyes resigned. It was enough. What help would elasium be to him? Even if he ingested the mineral, and didn’t die of any natural causes, what use would that be in a land such as this?  When they came out, the doctor lit a cigarette. The thick plume of smoke shaded his face for a brief moment.  “Why are we even doing this? This place, these people don’t need a magic mineral. They need a home.”  “It’s a trinket to keep them satiated,” said the doctor. “The government here has promised them big things, and this is just a start.”  “Does Mn Lla know this?”  The doctor nodded. It sounded like a betrayal, but Tripti knew it wasn’t.  “I hope this entire endeavor doesn’t go to waste,” said the doctor.  The dingy Mumbai chawl was a far cry from the airy mini-bungalow Aparna had lived in most of her life. Cobwebs clung to walls where plaster came off in gray-black splotches. Moss grew with abandon in the wet corners of an Indian-style toilet, whose white marble was smeared with the brown of age and neglect. A small window gave a view of Dharavi below, matchbox homes with blue and white roofs, sprawled across acres.  “This could be home,” said Sujit, sitting down cross-legged on the cold stone floor. Aparna placed incense sticks on the windowsill to keep away the stench of cow dung wafting from below. She turned and saw Sujit dusting his Remington typewriter. The entire space of the chawl was barely twice their porch area. This wasn’t home by any stretch of imagination. But they’d have to make do. Until Sujit got a promotion at the bank or a hefty advance, neither of which was likely soon considering his whimsical nature and inclination toward tobacco.  That evening, when Sujit had gone out, Aparna thumbed through the classifieds section of Navbharat Times. Perhaps her profound good luck would help her land a job and then all will be mangal, as her father would say most days after dinner.  Tripti spent six weeks inside the Govardhan sector. Her instinct was right; no one was keen on ingesting elasium. A good day of living was hard to find, and no one wanted prolonged agony. When the sun set, the nights were chillier than usual inside the dome, and there weren’t enough blankets to go around. When the acid rains came, the ill-maintained dome took a hit, and fumes hissed out of its cracked surface, death liquid falling down on the ground in drops, killing the grass and flowers and soil.  Tripti and the doctor went on a trip across the wasteland, to see the farther reaches of the sector, where the ground met the edge of the dome, way beyond the Hooghly River, where there were close-knit dwellings made of rock and cement. Grass managed to grow with abandon here. Slanted sunrays splashed on mud puddles where once rested small ponds.  “My great-great-great grandfather was born here,” said the doctor, gazing forlornly at the last of the huts. “A place known as Murshidabad. I’ve only ever seen it in yellowed photos shown to me by my mother on Mangal.”  “An orchard might have grown there,” said Tripti, after a long pause. “A small lake there. This place was home to many, now only a place to some.”  The doctor nodded. A young woman wearing a yellow sari waved at them from inside her hut. Tripti waved back. Then, she bent down and dug her fingers inside the warm, moist soil.  When she got back up, her hands were caked with mud, holding a piece of a different home.  “Come, Doctor, it’s time to go home,” she said.  On the Kalamkari’s trip back to Mars, Tripti dreamed of the boy again. She dreamed of falling, of things hitting her, relentlessly. A ball, a meteor, a bird. She dreamed of a pond, of mangoes in sunbaked orchards, of flowers blooming. She brushed aside these dreams, taking comfort in the fact that they didn’t mean anything, really.  Aparna clutched the cool, sweat-soaked hand of her son, Nishant, as she watched the monitors attached to the wall by Sujit’s bedside. His dark frame, once lean and muscular, now a husk, lay on an elevated bed, his beady eyes staring at the ceiling, his patchy lips murmuring something.  “Nishant, go outside, Maa has to speak to Papa,” said Aparna. Nishant let go of her hand and touched his father’s feet. Sujit’s eyes watched Nishant go, then rested on Aparna.  “I’m sorry,” he wheezed. “I wanted to give you . . . him . . . a good life, but look where we are.”  Aparna took a bony finger of his and curled her own fingers around it. Like they did in the theater all those years ago.  “You remember Rajnigandha?” she said.  “How could I forget?”  “Did you know Basu Chatterjee originally wanted Amitabh in the film?”  Sujit smiled. “I’m glad that didn’t happen.”  “Something tells me if that had happened, we wouldn’t have happened,” said Aparna. Sujit’s fingers curled tightly around Aparna’s. The silence was long and lingered until Sujit’s fingers went limp. The monitor didn’t make any sound. It was better this way.  “We’ll be together in another age, another time,” whispered Aparna. “We’ll have another home.”  The Sistrom-Raja facility was exactly the way she had left it, eighteen months ago, sans the dome. The blocky, metallic dwellings underneath a gray, sometimes mud-colored sky she called home. The spacious library where she’d spent hours poring over old books and requesting videocassettes and USB drives containing Earth movies. The playground she’d played Kekepes in.  She saw Kka in a deep state of meditation, levitating four feet from the ground, mir four limbs undulating against an absent wind. Mem was inside their old quarters, mir skin the same porcelain, albeit with some splotches of age. She didn’t want to announce out loud her arrival.  “I’m here.” She reached out to Kka. “I brought you something.” A warm pulse inside Tripti’s brain told her that Kka had listened.  “Welcome, Tripti.” Kka responded. “I’m doing something for the first time. I’m sure you would want to hear all about it.”  “What is that?”  “I’m dreaming,” said Kka. “In my dream, I’m a small boy from Earth and you’re a small girl. We have a home near a pond. There’s a porch that is caked with mud.”  Tripti placed the gift she had got for Kka—a piece of Earth soil she’d picked, encased inside a bulbous dome—on a table. Then, she curled her finger against Kka’s undulating limb. The limb responded with genuine warmth. Kka’s porcelain skin changed colors, a dull gray to a vibrant purple.  “Show it to me,” she said, and closed her eyes. Amal Singh is a screenwriter, author, and a cat dad from Mumbai, India. While his cat silently judges him, he can be seen drafting a novel, or trying to bake brownies in a cooker. His short fiction has appeared in venues like Apex Magazine, Clarkesworld, F&SF, and Fantasy Magazine, among others.", "text": "5530 words, short story\nA Home for Mrs. Biswas\nOnce she saw the red sands stretch across miles, craters as big as the stadium her father played hockey in, and golden spires shimmering brighter than Amritsar’s Golden Temple, Aparna Biswas didn’t want to live on Earth. Of course they were a far cry from her own backyard where, in summers, she would sit on a cane chair and watch the bougainvillea bloom the shade of a bride’s blush, “string of pearls” flowers wrapped around the wooden railing on her porch, eating a succulent dussehri aam as a pair of ducks swam in the small pond she liked to call her Pacific. But those summers only existed behind a dim haze of memory. She would take a living planet over a dying one any day.\n“Beta, I think I might find god there,” she said to her son, tearing her gaze away from the Mars hologram. “Build me a home on that planet and all will be mangal.” She chortled at her own joke. Puns on the red planet had filled the Internet, and ever since Sunehri, her granddaughter, had taught her how to use a phone, she kept finding these odd little information trinkets.\n“I might have to break all our deposits and still not be able to book a single one-way ticket, Maa,” said Nishant, her son. “Forget about building a home.” In his eyes too, there was a deep yearning to go to the red planet. He stood near the window of the living room of his Chembur apartment, looking at the once-blue sky, blotted out by an eternal gray smog that was here to stay.\n“But our PM said in his last speech there was a lottery system,” she said. “And you know how lucky I am.” It was true. Stories of Aparna Biswas’ luck were splattered on the walls of Kolkata, and the gullies of Bombay.\nWhen she was twelve years old, Aparna once sat in the front row seats of a stadium, watching her father, Ashok “the lightning” Biswas, drive the hockey ball around like it was glued to his stick. When he was six yards from the penalty line, a sparrow perched atop a stadium floodlight took flight and glided toward the goalpost, thinking it was an eagle. Near the penalty line, Ashok took his trademark stance, right leg backward, hanging in the air, left foot firmly on the ground, the hockey stick coming down on the ball like Indra’s vajra. The ball sped like a bullet, missing the goalpost by six inches, toward the stands where Aparna stood cheering her father. It would have shattered her skull had it not been for the timely intervention of the poor sparrow, who hit the ground immediately in a tangle of feathers and beak.\nIt was her extreme good luck that she met Sujit, her later husband—a writer of Bengali pulp magazines and a great admirer of Basu Chatterjee’s cinema—inside a dingy movie theater that smelled of cigarettes and leather and moist fabric. She was on her way out, leaving a movie in between, and he was on his way in, hiding from cops. That day, Aparna ended up watching a movie two times in a row when she had no intention of watching more than twenty minutes. During the first showing, her eyes were glued to the neon-lit exit sign, even as Sujit rambled on about how his latest book had caused a stir. The second show, they both actually watched the movie in silence, while sharing a massive tub of oversalted popcorn.\nAparna’s string of good luck rubbed off on people she loved. This shower of good fortune saved Sujit from two cancers in life. But, in the end, he was undone by a fall. A fall that Aparna couldn’t quite recover from. Now she saw Sujit in all faces and all movies, even at seventy-eight years of age. But she had also come to accept that if her luck was Hari’s will, then so was Sujit’s passing. And that’s just the way things were.\nPerhaps Mars—mangal—wouldn’t make her miss Sujit as much. Perhaps making a life there would be its own challenge that would drown out all past griefs in one giant wave.\nSo, on the day she expressed her desire to go to the red planet to her son, she also expressed the same desire in mute prayer, with incense and chants, and fruits and laddoos, and a garland of dahlias, to Hari, her god. And her wish was fulfilled.\nNishant’s work in the Department of External Affairs was of a clerical nature. The department was an island of nontechnological bureaucracy amid a sea of other departments where supercomputers had replaced every human. And thus, in the last year of the twenty-second century, he still had to push papers around. Stacks of applications for the generation ship Madhubani stood in front of him, all with a red stamp of rejection where the wax was still wet. One of the applications was his, which had miraculously escaped the Attorney General’s stamp. An application that wasn’t rejected already was automatically accepted—no one wanted to waste extra wax of a different color to signify acceptance.\n“See, I told you,” said Aparna Biswas, gazing at the bright golden card embossed with the new crimson insignia of ISRO that was issued to the passengers of Madhubani, even as the generation ship left Earth’s orbit, and spun to bring Earthlike gravity inside. Soon, as per the new travel directive, the gravity would reduce to a third to acclimatize passengers to a Martian way of existence. It was to happen so gradually that the passengers wouldn’t feel the change.\nOn the fifteenth day of the voyage, as Aparna Biswas sat in her climate-controlled resting pod, looking out toward the unmoving stars against the purple-black expanse of the Milky Way, she heard faint music sieve through the metallic walls of the cabin. Her granddaughter had long since given up listening to her iPod, and her son hadn’t taken up softly humming old classical music from his father, much to her chagrin.\n“What time is it, Nishant?” she asked, wondering if it was still night, as the space outside suggested. She couldn’t much tell, but she wondered if there was any point to a twenty-four-hour cycle, considering soon, all of that would change. She always considered herself a good adapter to change in patterns, and this was the biggest change of all. Her medications, though, would still need to be consumed, only the intervals would change. She was sure a doctor on board would sort it out.\n“It’s four in the afternoon,” said Nishant.\n“Someone is playing Pancham Da’s songs,” she said. Putting on her glasses, she strutted toward the source of the sound barefoot. She crossed a narrow corridor that was filled with people at all times, some the crew of the Madhubani engrossed in eternal calculations, some the passengers, engrossed in eternal small talk that would last them the voyage.\nA bend later Aparna arrived in a spacious foyer. Gray-white walls, with large windows looking out into the universe speckled with wonder and stardust. Bright Narad droids wheeling about carrying trays of food and beverages. A smattering of chosen populace who had given up their old home, now sitting huddled in front of a mock stage. And on the stage, the source of the music. A man with wavy gray hair, and a thin moustache, and of an overall bashful bearing was playing the sitar. A man who reminded Aparna very much of her Sujit. A man who kindled an intense yearning in Aparna to be young again.\nShe sat on the cold floor and listened to the music. Each note a reminiscence of a warm and cloudy past. An evening inside a radio station building, walls a dusky sepia, scents of cement and tea and jasmine and tobacco and almond oil. A midmorning rush of the Virar fast local train, and the visions of sunbaked stones beside gleaming metal rails. The air rented with shrill sounds of the motor of the auto rickshaws, the ring of their meters. All sounds, all scents, all sights, snuffed out in space, yet brought together in space. An irony.\nThe music played on, plunging Aparna deeper and deeper into the memories of Sujit. In that moment, she considered herself profoundly lucky, having an anchor to hold on to in the vastness of space. But perhaps her good fortunes were reserved only for Earth.\nIn that moment, the hull of the Madhubani became an innocent sparrow to the hockey ball of an approaching meteor, perhaps saving Earth in the process. In space, feather and beak, metal and rock and bone, like a million shards of a metal star.\n“Mn Lla, what is that star?”\nTripti pointed a finger at a blue dot, a hazy smear against the Mars sky. Mn Lla, an indigenous Martian, skin like ceramic, six-limbed invertebrate, yet held together vertically by a life force yet alien to humans, looked at her, and then at the sky, then back at her. Mn Lla spoke in a vocal register only Tripti could discern, because of the nature of their relationship—Martian Guardian to a second-generation Terran.\n“That’s not a star,” said Mn Lla. “That’s the home of your ancestors.”\n“You mean that’s Dharti?”\n“You’re looking at it through the translucence of the dome. That’s why it appears the way it appears.”\n“I dream of it sometimes,” said Tripti. “A vast green field. Sky gray as graphite. I see a boy who calls me by a name that is not mine.”\n“Are these dreams recurring?”\n“On and off.”\n“And are they causing any trouble to you, Tripti?”\nShe shook her head. But what was trouble for a fourteen-year-old child who had grown knowing the red planet as her only home? Born inside the Sistrom-Raja facility, a great campus spreading across a thousand acres of Martian land, surrounded by a shimmering dome that controlled the climate inside, Tripti had gone only as far as the Holden Crater, and that too, suited up and supervised. Her best friend was a Martian child named Kka.\nAnd yet in her dreams she dreamed of a boy who was a Terran and grinned at her, a front tooth missing. A boy who called himself Sujit.\n“Well, if they do cause trouble, let me know,” said Mn Lla. Mir wiry frame swayed against the manufactured wind inside the dome.\n“Is Dharti dying?” she asked.\n“It is,” said Mn Lla after a long, lingering pause. Tripti could almost taste the mournful bitterness in Mn Lla’s answer.\n“I’m afraid of dying,” said Tripti. In her dreams, she was always falling. In her dreams, her skin crawled with spiders and pus oozed out of wrinkles. And now she had told Mn Lla about her troubles.\nMn Lla held her hand with one of mir limbs. A warmth surged through her in that moment. Mem understood her fear.\nKka lay beside her on the rug staring at the ceiling, a history book sprawled open on mir porcelain body. Tripti’s nineteenth attempt to solve a 32x32x32 Rubik’s Cube had failed miserably, and her twentieth try—where the cube was now an impossible jumble of colors deep into the spectrum that the human eye couldn’t even appreciate—didn’t look like it would come to fruition, either. Kka flipped the book to the thirtieth page and spoke aloud the first line.\n“Not subscribing to the idea of monotheism, one of the world’s largest religions had in its pantheon a multitude of deities.”\n“What are you reading?” asked Tripti.\n“The Idea of God by Astrid Ahuja,” said Kka. “Fascinating. People on terra really were into this stuff you know.”\n“Oh Lord, asked Arjun to Lord Krishna. The ones standing before me are my own brothers. How could I pick up my bow and arrow to strike them down?” Tripti said, but the register of her voice was alien. Kka sat up straight, mir spineless frame undulating without wind, mir bulbous eyes fixated on Tripti.\n“What did you say?”\n“It’s in the ‘Bhagavad Gita,’ the scripture,” she said, her voice reverting to normalcy. “Lord Krishna responded by urging Arjuna, the great warrior, to do his duty.”\n“How do you know all this?”\nThe words she had given shape to vaporized inside her. She had always known these details, and these weren’t even from her dreams. She was born with an inexplicable knowledge, and it was only now, at eight years of age, that she had disclosed any of it.\n“Let’s go outside,” she said, putting the cube aside. Kka followed her as she strode out of the room, into the metallic hallway that led to Garden Karla, a playground for Martians and Earthlings alike, with myriad surfaces, carefully controlled zero-G slides, and stick and ball games of a kind where the ground was just a nuisance and the sky was the limit.\nIn that moment an inexplicable trance took hold of Tripti as she strode toward a group playing a stick and ball game. One Terran child was floating in the air, clumsily holding a stick as the ball bounced between the sticks of the other children, similarly hovering a few yards away, in a haphazard formation.\n“I want to see the captain,” she said to the child. Kka stopped in mir tracks, looking at the scene unfold with increased trepidation.\n“Can you step away from the line, please?” said the child.\n“Your way of holding the stick is all wrong. You can’t swing it with enough momentum if your grip is faulty,” said Tripti with a surge of confidence.\nSomewhere a shrill whistle blew. The other hovering children came down to the gray-purple ground in one collective heap. Play was stopped and Tripti was the cause. The child she was speaking to walked over to her, his eyes narrow as slits. He was joined by a girl whose skin flushed with anger.\n“You have quite a nerve obstructing play like this,” said the girl.\n“You look like the captain,” said Tripti. “Good. I want to play.”\n“What makes you think you can join us just like that? What makes you think you can master Kekepes?”\n“I can hit the ball better than most of you,” said Tripti.\n“Tripti, it’s a waste of time, c’mon,” Kka interjected. Tripti gave Kka a look, then raised her hand, palm raised, toward the captain, as if expecting her to just hand over the stick. Then Tripti gazed stoically at the captain and she relented, almost miraculously. What was a moment ago an altercation, became a camaraderie.\nIn Tripti’s dreams the boy grew up to be a tall, gaunt man, who sang songs in a language she hadn’t heard, and wrote on surfaces she hadn’t seen. And yet she found herself singing and humming the same songs, and searching throughout the Sistrom-Raja facility for old video files. Perhaps in those videos there lay a key to solving the mystery of the boy she saw so often in her dreams. Perhaps in those videos lay answers to her inexplicable abilities to play a sport like the best champions.\nBut as she grew up all these memories and visions faded like afterthought, like dew evaporating from a snake plant. She became a Champion of Kekepes, but left the game when she got riddled with frequent injuries. In every game, as she hit the ball, and it came flying back, an ancient, childhood fear of dying soared back to haunt her. In her dreams, she was always getting hit by a stone, or a ball. In her dreams, she was always falling.\nShe soon joined Mn Lla and Kka in an expedition far beyond the Holden Crater, to look for the elusive Rock of Esnu. Mn Lla, a Martian archeologist, and his nephew—Tripti’s friend, Lla—a chemist, had between them postulated that the rock held an entirely new kind of mineral, an inorganic compound that had properties to aid life span, a mineral called elasium. It was only recently found that elasium was present in trace quantities in Martians but not in humans. But Mn Lla’s experiments had suggested that ingesting elasium might work in favor for humans who were bound by the zincs and magnesiums and sodiums and potassiums of the old world. And so, twenty years after remarking upon the smear in the sky that was old Earth, Tripti willingly became an object of experimentation to two Martians she loved.\n“Tripti, you can say no and I will understand. I don’t want the burden of this discovery to hinge on your decision,” said Mn Lla. The shadow of mir undulating figure fell upon the red sands like a dark flag fluttering. Tripti’s breath fogged her helmet as she held Mn Lla’s gaze. Kka stood by her right. The words mem spoke radiated inward, to her mind, finding a home in her, a technique they’d learned when they were younger and had just learned the mechanics of telepathy. Those were the words of hope, a promise of a better future.\n“I will do this,” she said out loud to Mn Lla. Mem injected Tripti with a concoction that held a tenth of a microgram of elasium, the recommended quantity as per their experiments, which would not overwhelm the human body. But of course Tripti was the first live subject, and anything could have gone wrong. But Tripti had in her being a far greater force that worked by its own rules. Tripti ingested the mineral.\nFor a week, there was no noticeable change in her metabolism. For a month, she waited to see any side effects. There were none. Tripti began actively participating in Kekepes again, for she felt a renewed vigor for the game like a fire by the seaside that refused to go out, embers licking wood relentlessly. For the next four years, her body refused to show any ill effects of elasium. For the next fifteen years, her liver secreted bile like it always did, her stomach digested food like it always did, her skin glowed radiant, like a bougainvillea blooming in the shade of a bride’s blush, not wrinkling at all.\nIt was after twenty-five years, sitting two feet from where the dome met the red ground, in a garden at the north edge of the Sistrom-Raja facility, holding in her hands an old videocassette of the old Terran movie named Rajnigandha, that she realized she had stopped aging. On the contrary, though, Kka—her friend and companion—lay beside her on the sand, mir once-smooth ceramic skin now blackened like soot in places and wrinkly like dried lemon.\n“I enjoyed what you showed me, even though I didn’t understand it,” said Kka.\n“Companionship in terra didn’t work like companionship here,” said Tripti. “What we have . . . this movie’s characters didn’t and never could.”\n“Do you yearn for that other type of companionship?”\nTripti didn’t have an answer to Kka’s question. She had never told Kka, but she knew Kka understood the nature of her recurring dreams. She had yearned to meet the boy who had called her with a different name. In the eyes of that boy who often changed form and took the appearance of a young man, there was a love the kind that Kka couldn’t give her.\n“How does it feel to defeat death?” asked Kka. Tripti knew this question was coming, but she didn’t have an answer to it. Not yet.\n“I haven’t defeated it. Just prolonged life.” It felt like the right answer. Until she could see otherwise.\n“They remove the dome tomorrow,” said Kka. “Sistrom-Raja will never be the same again.”\n“It will be better,” said Tripti. “Children born now will know a life beyond the Holden Crater.”\nKka’s skin shimmered a golden sigh. “Do you think terra will accept elasium?” Mem asked.\n“I don’t know,” said Tripti with a sigh. She hadn’t considered the many elaborate viewpoints of Terrans when it came to nigh immortality. Inside the Sistrom-Raja facility, first-generation Terrans who had grown old on Mars had expressed a deep longing for Earth. They had lived their time here on an alien land and when it came to bid goodbye to their lives, they wanted to do so in their homeland. When given an option to ingest elasium and elongate their lives, they had plainly refused. When she was chosen as the Chief Ambassador from Sistrom-Raja to visit Earth, Tripti had eaten a ripe mango in front of a cheering crowd full of aging Terrans who gave her longing, mournful glances, perhaps tasting the juiciness of the king of fruits, the memory of their once-glorious home given a form. At that moment the gesture had felt symbolic, special. Now it felt hollow.\nBut she understood.\n“I will miss you,” said Kka, in an un-Martian manner. The rhythm of the words was all wrong, the vocal register barren. Kka’s shimmering sigh was gone and now replaced by a greenish hue over the ceramic skin. To make up for the broken vocals, in their mute, telepathic way, they communicated again, through shapes and figures, their love for each other. A lone tear trickled down Tripti’s cheek, dropped on the Martian soil, marked their separation briefly, and fizzled away.\nWhen Aparna Biswas was six years old she had painted on a canvas a city inside a dome with skies the color of mud. Inside the dome there was a small rectangular nook atop which she had scribbled, in dull black paint, home. The curve of the “e” had begun to weep soon, forming a trail of black across the length of the painting, pooling on the floor in a small puddle.\nHer father had come home, sweaty from a training session, and found her gazing at the unfinished painting. “I don’t like it,” she’d said, choking back a hitch and a sob.\n“You can make it again,” said Ashok Biswas. “Until you get it right.”\nTripti, at the age of eight, had seen a splinterfly—a seven-winged, Martian bug species—buzzing near her residential quarters. She had gazed at it in mute wonder; it was impossible for it to have taken birth inside the facility. Now, at the age of thirty-nine, inside the generation ship Kalamkari, she wondered if it had merely been a vision, or was it really a fossilized specimen come to life. She remembered, though, the wonder in her eyes, and the same wonder was reflected when she saw Earth approaching, a burst of blue surrounding swathes of dark green and foamy white.\nAs the Kalamkari descended, she could already feel the difference in gravity, the extra weighty pull, inexorable, the pull of a land that was once home to her ancestors. She looked around her cabin and saw wrinkled faces light up, de-aging twenty years in three seconds.\n“All descendants are requested to assemble in the waiting pod where they will be provided with breathing masks and sanitizing equipment.” A robotic voice chimed through the walls of her cabin. She got up, and took a deep, clean, almost metallic-smelling breath of the generation ship, for the last time.\n“If you could just listen, for once!”\nThe front porch was caked in mud. Dark crumbs of soil mixed with bug entrails lay all over the creaking wood. The lower half of an ivy creeper lay sprawled on the floor, the green leaves gathering brown motes even as its upper half dangled from a railing. The pond outside had mostly evaporated in the heat and all that remained was watery mulch. Through that mulch, Sujit had dragged his sandals, as he’d come back from work in rage. And in his rage, he had slipped his sandals off carelessly, splattering mud all over the porch, much to Aparna’s anguish.\n“I’ll clean it later,” said Sujit, lighting a cigarette, his dark face engulfed by a smoke cloud. Aparna waited for it to vanish before speaking.\n“What’s the matter?”\n“The movie is not happening. I am getting no advance.” He said simply, as if it were the plainest, most ordinary thing to say in the whole world. “We might have to sell the house.”\nIn that moment, Aparna could have said what she had always wanted to say to him, but she knew he wouldn’t listen. If only Sujit could hear without her saying it. If only Sujit could see inside her mind. She wanted what he wanted, and she wanted it harder and better. But there was no way to get it.\n“Maybe I should apologize to that harami bank manager who fired me. Beg him to take me back.” Sujit laughed as he spoke these words. His thin frame rattled as he laughed and coughed.\nThey spent ten minutes in silence; Sujit gazing at the dried pond, Aparna looking at Sujit’s creased, tired face. Then, Sujit asked her where she had put the broom.\nThe idea of a home she’d carried with her vaporized as she set foot inside the dome. Tripti blinked as a fading sun sent rays filtering through the dome’s cracked surface. The skies were a thick gray, and the ever-present smog she’d only heard of in stories leaked through the protective shield one mote at a time. This wasn’t what her dreams of a perfect land had prepared her for.\nShe was inside the Govardhan sector, a sprawling two hundred-acre rocky land to the south of what was once known as the Hooghly River. To the east was a marshy wasteland. To the west was a hill that rose to an annoying height and then stopped, as if told to not exist anymore. Much of the population was densely concentrated in a small town-like unit, with blocky, cement houses. An inhabitant of one of those houses was to be the first resident to receive elasium. Aparna, accompanied by a doctor who had been debriefed by Mn Lla, entered the house. The house was bare and empty and cold and so was the person who lived in it.\n“Why are you here?” said the old man, whose wispy white hair fell on his shoulders in a broken way. Tripti didn’t understand what he said. It was the problem of the vocal register she’d grown up speaking with. The doctor elaborated and Tripti nodded alongside him.\n“I won’t take it,” said the man after listening to the doctor. His voice was solemn, his skin sallow, and his eyes resigned. It was enough. What help would elasium be to him? Even if he ingested the mineral, and didn’t die of any natural causes, what use would that be in a land such as this?\nWhen they came out, the doctor lit a cigarette. The thick plume of smoke shaded his face for a brief moment.\n“Why are we even doing this? This place, these people don’t need a magic mineral. They need a home.”\n“It’s a trinket to keep them satiated,” said the doctor. “The government here has promised them big things, and this is just a start.”\n“Does Mn Lla know this?”\nThe doctor nodded. It sounded like a betrayal, but Tripti knew it wasn’t.\n“I hope this entire endeavor doesn’t go to waste,” said the doctor.\nThe dingy Mumbai chawl was a far cry from the airy mini-bungalow Aparna had lived in most of her life. Cobwebs clung to walls where plaster came off in gray-black splotches. Moss grew with abandon in the wet corners of an Indian-style toilet, whose white marble was smeared with the brown of age and neglect. A small window gave a view of Dharavi below, matchbox homes with blue and white roofs, sprawled across acres.\n“This could be home,” said Sujit, sitting down cross-legged on the cold stone floor. Aparna placed incense sticks on the windowsill to keep away the stench of cow dung wafting from below. She turned and saw Sujit dusting his Remington typewriter. The entire space of the chawl was barely twice their porch area. This wasn’t home by any stretch of imagination. But they’d have to make do. Until Sujit got a promotion at the bank or a hefty advance, neither of which was likely soon considering his whimsical nature and inclination toward tobacco.\nThat evening, when Sujit had gone out, Aparna thumbed through the classifieds section of Navbharat Times. Perhaps her profound good luck would help her land a job and then all will be mangal, as her father would say most days after dinner.\nTripti spent six weeks inside the Govardhan sector. Her instinct was right; no one was keen on ingesting elasium. A good day of living was hard to find, and no one wanted prolonged agony. When the sun set, the nights were chillier than usual inside the dome, and there weren’t enough blankets to go around. When the acid rains came, the ill-maintained dome took a hit, and fumes hissed out of its cracked surface, death liquid falling down on the ground in drops, killing the grass and flowers and soil.\nTripti and the doctor went on a trip across the wasteland, to see the farther reaches of the sector, where the ground met the edge of the dome, way beyond the Hooghly River, where there were close-knit dwellings made of rock and cement. Grass managed to grow with abandon here. Slanted sunrays splashed on mud puddles where once rested small ponds.\n“My great-great-great grandfather was born here,” said the doctor, gazing forlornly at the last of the huts. “A place known as Murshidabad. I’ve only ever seen it in yellowed photos shown to me by my mother on Mangal.”\n“An orchard might have grown there,” said Tripti, after a long pause. “A small lake there. This place was home to many, now only a place to some.”\nThe doctor nodded. A young woman wearing a yellow sari waved at them from inside her hut. Tripti waved back. Then, she bent down and dug her fingers inside the warm, moist soil.\nWhen she got back up, her hands were caked with mud, holding a piece of a different home.\n“Come, Doctor, it’s time to go home,” she said.\nOn the Kalamkari’s trip back to Mars, Tripti dreamed of the boy again. She dreamed of falling, of things hitting her, relentlessly. A ball, a meteor, a bird. She dreamed of a pond, of mangoes in sunbaked orchards, of flowers blooming. She brushed aside these dreams, taking comfort in the fact that they didn’t mean anything, really.\nAparna clutched the cool, sweat-soaked hand of her son, Nishant, as she watched the monitors attached to the wall by Sujit’s bedside. His dark frame, once lean and muscular, now a husk, lay on an elevated bed, his beady eyes staring at the ceiling, his patchy lips murmuring something.\n“Nishant, go outside, Maa has to speak to Papa,” said Aparna. Nishant let go of her hand and touched his father’s feet. Sujit’s eyes watched Nishant go, then rested on Aparna.\n“I’m sorry,” he wheezed. “I wanted to give you . . . him . . . a good life, but look where we are.”\nAparna took a bony finger of his and curled her own fingers around it. Like they did in the theater all those years ago.\n“You remember Rajnigandha?” she said.\n“How could I forget?”\n“Did you know Basu Chatterjee originally wanted Amitabh in the film?”\nSujit smiled. “I’m glad that didn’t happen.”\n“Something tells me if that had happened, we wouldn’t have happened,” said Aparna. Sujit’s fingers curled tightly around Aparna’s. The silence was long and lingered until Sujit’s fingers went limp. The monitor didn’t make any sound. It was better this way.\n“We’ll be together in another age, another time,” whispered Aparna. “We’ll have another home.”\nThe Sistrom-Raja facility was exactly the way she had left it, eighteen months ago, sans the dome. The blocky, metallic dwellings underneath a gray, sometimes mud-colored sky she called home. The spacious library where she’d spent hours poring over old books and requesting videocassettes and USB drives containing Earth movies. The playground she’d played Kekepes in.\nShe saw Kka in a deep state of meditation, levitating four feet from the ground, mir four limbs undulating against an absent wind. Mem was inside their old quarters, mir skin the same porcelain, albeit with some splotches of age. She didn’t want to announce out loud her arrival.\n“I’m here.” She reached out to Kka. “I brought you something.” A warm pulse inside Tripti’s brain told her that Kka had listened.\n“Welcome, Tripti.” Kka responded. “I’m doing something for the first time. I’m sure you would want to hear all about it.”\n“What is that?”\n“I’m dreaming,” said Kka. “In my dream, I’m a small boy from Earth and you’re a small girl. We have a home near a pond. There’s a porch that is caked with mud.”\nTripti placed the gift she had got for Kka—a piece of Earth soil she’d picked, encased inside a bulbous dome—on a table. Then, she curled her finger against Kka’s undulating limb. The limb responded with genuine warmth. Kka’s porcelain skin changed colors, a dull gray to a vibrant purple.\n“Show it to me,” she said, and closed her eyes.\nAmal Singh is a screenwriter, author, and a cat dad from Mumbai, India. While his cat silently judges him, he can be seen drafting a novel, or trying to bake brownies in a cooker. His short fiction has appeared in venues like Apex Magazine, Clarkesworld, F&SF, and Fantasy Magazine, among others.", "source": "https://clarkesworldmagazine.com/singh_05_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Home for Mrs. Biswas by Amal Singh"}