{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "2EaEsxFq/ptxdL5cZ/nyoLjpetg=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Navigating the Seas of South Asian Diversity: A Conversation with Tarun K. Saint  Independent scholar and writer Tarun K. Saint was born in Kenya and moved to Long Island, New York at the age of two. He started reading around age five or six. His father taught at Friends World College. They moved to Udaipur in Rajasthan, India in 1972, and Saint was deschooled until 1977, “with the chance to read voraciously under my parents’ guidance.” Saint joined Mayo College in Ajmer, and went to Hindu College in Delhi, where he earned a BA and an MA in English literature. In 1992, he completed an MPhil and in 2006, he earned a PhD from the Department of English at Delhi University. He taught at Hindu College until 2016.  In 2010, he published Witnessing Partition: Memory, History, Fiction (Routledge India), which went into a second edition in 2020. He coedited Translating Partition (Katha) with Ravikant in 2001, edited Bruised Memories: Communal Violence and the Writer (Seagull) in 2002, and coedited Looking Back: The 1947 Partition of India, 70 Years On (Orient BlackSwan) in 2017 with Rakhshanda Jalil and Debjani Sengupta.  Both volume one of The Gollancz Book of South Asian Science Fiction and 2020 anthology Avatar अवतार: Indian Science Fiction–Fantascienza Indiana, coedited with Francesco Verso, landed on Locus Recommended Reading lists.  When he’s not changing the landscape of the science fiction industry with groundbreaking anthologies, he likes listening to jazz, especially jazz-rock fusion. He also travels when possible. Tarun K. Saint lives in Delhi, India.   How did you become a reader of genre fiction? What were some of the first science fiction books or stories that were important to you?  At the age of seven or eight, I was presented a copy of Robert Heinlein’s Red Planet, which struck a chord with its evocative description of Mars. Later, I was lucky to have a visionary librarian at school who encouraged eclectic tastes in reading, including SF. While Golden Age classics by Asimov, Clarke, and Bradbury predominated, I recall being struck by Philip K. Dick’s work, especially Martian Time-Slip, and Joe Haldeman’s remarkable The Forever War, as an allegory about a never-ending war.  Later, the works of Ursula K. Le Guin (The Lathe of Heaven) and J. G. Ballard (especially his short stories) spoke to me with respect to exploring the dialectics of inner and outer space. I came across the novels of Arkady and Boris Strugatsky, especially Roadside Picnic and The Doomed City, and Stanisław Lem (Solaris, The Invincible) at a later stage, as a teacher of science fiction (mainly Asimov—Foundation) seeking to expand my horizons, especially in the domain of non-Anglophone SF. I began to realize the extent of writing that exists beyond mainstream SF, including writing from South Asian spaces.  Some readers and writers in the US and the UK draw sharp lines between “literary” and “genre.” Are there similar ideas in South Asia in terms of demarcating various kinds of fiction?  Yes, the demarcation between literary and genre or popular fiction has been in place since the colonial era. The snobbery associated with “literary” fiction has led some writers to consciously dissociate themselves from genre fiction, though there are some notable exceptions, such as Amitav Ghosh’s The Calcutta Chromosome (1995). In the anthologies I have edited, I have sought to undo this binary through a juxtaposition of the different styles and registers of South Asian SF and speculative poetry.  How did you get into the publishing side of genre? How did your career start, and where would you like to see it go?  As a freelancer, I have a tangential relationship to the publishing world. I submitted the proposal for the first Gollancz Book of South Asian SF initially as an anthology of Indian SF, an area that I felt had not received its due. The ambit expanded as this became a series, which I hope will continue in times to come.  What are some of the most important differences between newer South Asian science fiction and classic South Asian science fiction?  Early proto-SF and SF from South Asia was heavily influenced by Western, mostly Golden Age models. Much of this writing had a pedagogic imperative, seeking to convey the wonder of scientific discovery through stories with a didactic thrust. There were some exceptions that brought in a different form of futuristic speculation, whimsicality, and humor. The best of recent writing has a more skeptical and self-critical view of science, especially in the light of the damage done by the modern developmental discourse to communities and the environment. The perils of AI-based surveillance, corporate pillaging of nature, and the unleashing of ethically unhinged forms of social media are at the forefront of attention of New Wave writers.  Do you have favorite science fiction, fantasy, or horror writers whose work is still fairly unknown to Western readers?  I really like the work of Manjula Padmanabhan, Anil Menon, Vandana Singh, Shovon Chowdhury, Muhammed Zafar Iqbal (in translation from Bengali), and Vajra Chandrasekera in the domain of SF/speculative fiction, while Usman T. Malik, Saad Z. Hossain, and Tashan Mehta, among others, have extended the boundaries of fantastika/the weird/horror in fascinating ways.  For writers in South Asia, what are the most common barriers to breaking into science fiction publishing in the US or the UK?  I have no firsthand experience of submitting stories to SF publishers in the West. My publisher, Hachette India, is a sister imprint of Orion, of which the well-known Gollancz SF imprint is a subsidiary. The first volume was liked by the Gollancz team, hence the title, which was eventually reprinted by Gollancz UK with a new title, New Horizons: The Gollancz Book of South Asian Science Fiction. Let us see if the second volume follows suit.  As I understand, this rarely happens, since the flow of books is usually from the West to India/South Asia. So, this is welcome as a precedent for future volumes in the genre. Samit Basu’s SF novel Chosen Spirits has been taken up by Tor.com and is being reprinted in the US as The City Inside.  Unfamiliarity with the cultural context and idiom is a common hurdle for South Asian writers, besides a certain degree of insularity and the overwhelming strength of the Western SF scene, which may lead to a certain undervaluation of writing from “other” spaces.  Is publishing in the West a goal that many writers in South Asia have, or are they generally more concerned with speaking to South Asian readers?  In earlier times, many writers like R. K. Narayan made their breakthrough in the West. Since the 1990s, many international publishers have opened offices in India and are releasing titles directly to the Indian market. This has obviated the need to find a Western publisher and audience to an extent, though an international audience is always welcome, as we have seen in the careers of Vikram Seth, Arundhati Roy, and Amitav Ghosh.  Of course, there are many writers working in the regional languages who do not perceive the need for a wider audience, unless this happens as a result of translation, as in the case of Satyajit Ray’s SF stories translated from Bengali, and Jayant V. Narlikar’s SF novels and stories from Marathi. More high-quality translations would certainly enable a better sense of this diverse field of literary expression.  The first The Gollancz Book of South Asian Science Fiction came out in 2019. What are some of the most important differences between that book and volume two?  Much of the first volume focused on a specific theme, since I invited writers to reflect on what South Asia might look like in 2087, seventy years from now, extrapolating from current trends. Some unrelated SF stories and speculative poems, including samples from classic SF, were included as well.  Volume two expanded the scope to include SF as well as high concept fantasy and horror, not necessarily tied into a central theme. Furthermore, we were able to reach out to Sri Lankan writers, and more authors from Pakistan and Bangladesh, besides India, as well as from the respective diasporas. I am especially pleased that we have a story here by a writer from the Tibetan community in exile. Therefore, we have more diversity in volume two, both in terms of themes, as well as geographical and cultural origins of authors (with some translations from Marathi and Bengali).  Since I had traced the history of the genre synoptically in the Introduction to volume one, in this anthology I focused more on the texts included in my critical introduction, seeking to contextualize this new work.  South Asia comprises so many languages and cultures. Most of the stories in The Gollancz Book of South Asian Science Fiction Volume Two are written in English (as opposed to being translated works). Some of the authors have cultural roots in South Asia but don’t necessarily live there. Is sourcing works that represent a broad spectrum of South Asian cultures especially challenging?  That’s a really good question.  Yes, indeed, navigating the seas of South Asian cultural diversity, whether in terms of language, culture, or nationality can seem a daunting task at times, especially if one is trying to provide a representative selection from the region. The predominance of English (an inheritance from the colonial era) and the diasporic location of many of the authors can seem like a mixed blessing while sourcing material. Since the two volumes in this series were to carry mostly original material, approaching various authors who already work in the field to write new stories/poems was a challenge indeed, besides locating promising new voices.  Finding translators for the selections from classic SF in Hindi and Bengali was an additional hurdle to cross in the first volume, to a certain extent faced in the second volume as well, also with respect to recent SF in the regional languages, not all of which have strong SF traditions. This entailed quite a bit of reading and delving into the archive. The pleasure of rediscovering forgotten classics of futuristic writing, such as Rahul Sankrityayan’s Baisvin Sadi (Tr. Twenty-Second Century) was its own reward, even if we could only carry extracts. There are many layers to this cultural archive still to be unearthed, which we hope future volumes will continue to showcase.  The publishing industry has its own internal hierarchies and priorities, of course, where the politics of language and translation play a role. In recent times we can see more of adventurousness and willingness to support offbeat ventures. Networking and coordination among academics, authors, and enlightened publishers can make a lot of difference, once the initial set of suspicions and misunderstandings are set aside.  What we often see in terms of works coming to Western audiences, is that readers have no idea how important or respected some of the authors are in the context of their own cultures. Who, for you, are the “big name” authors in volume two, and who are the “up and coming” authors that really excite you?  In this volume we sought to achieve a judicious blend of well-known and “up and coming” authors. Manjula Padmanabhan, Vandana Singh, Anil Menon, Priya S. Chabria, and Shovon Chowdhury (who sadly passed away before the volume’s release) are recognizable names, as are Jayant Narlikar (from an earlier generation in Marathi, but still with us) and Muhammed Zafar Iqbal in Bengali). Sri Lankans Vajra Chandrasekera and Yudhanjaya Wijeratne, and Saad Z. Hossain from Bangladesh, are established presences in SF circles, as is Kaiser Haq from the same country in the sphere of poetry. Usman T. Malik, Haris Durrani, and Bina Shah are major forces to reckon with in Pakistani speculative fiction.  Among the “new” or “up and coming” writers, Gautam Bhatia, Premee Mohamed, and Lavanya Lakshminarayan have brought out substantive new work recently, while Kehkashan Khalid, Medha Singh, Navin Weeraratne, and Soham Guha (a bilingual writer from Bengal) are instances of promising talent to look out for.  Another aspect of this can be that Western audiences don’t always understand when a piece is being socially or politically daring. Are there a few pieces here that are fairly daring in their subjects or subtext, in one way or another, in ways that Western readers might miss?  That’s an interesting question. Yes, I think some of the stories, especially in the vein of satirical SF, might have a contemporary and allusive dimension that might be difficult to grasp. However, like all good fiction, South Asian SF for the most part does find its way to the universal through the narrow door of the particular. In the age of Google, finding out more about “background,” culture, and sociopolitical constructs is certainly possible, even if some levels of meaning remain context-sensitive.  Were there stories that you really liked, but that didn’t end up in the anthology?  No, fortunately not! We in fact exceeded our projected length somewhat due to the quality of submissions.  When you were making selections for the anthology, what were the most important things for you, what were your priorities?  Quality of writing, thematic appropriateness, and ability to make an effective intervention in the moment.  If someone will read only two or three stories to see if the book is for them, which stories would you tell them to read, and why?  It is always difficult to pick a few. Perhaps Vajra Chandrasekera’s “The Maker of Memorials” for its sensitive exploration of the afterlife of violence and war, and complex reflection on the question of memorialization of the dead from an SF angle, Manjula Padmanabhan’s “The Pain Merchant” for its uncanny fabulation with an SF anchor, and Saad Z. Hossain’s “Bring Your Own Spoon” for its weaving together of elements from jinn lore with an SF style reflection on contemporary authoritarianism.  Do some of the stories in The Gollancz Book of South Asian Science Fiction Volume Two stand in conversation with Western, South Asian, or other science fictional narratives in important ways?  Yes, though this may be a matter of interpretation rather than preconceived design or intention. Muhammed Zafar Iqbal’s “The Zoo” certainly takes on board the interrogation of modern science bereft of ethicality seen in works like H. G. Wells’ The Island of Dr. Moreau, while redirecting such questioning of the relationship between knowledge and power to include the media. Bina Shah’s “Looney ka Tabadla” is in self-conscious dialogue with Saadat Hasan Manto’s “Toba Tek Singh,” as an updated version of that superb satire of the partition era. There are similar self-reflexive and metafictional dimensions to many of the stories.  What are the best resources you can recommend for readers who want to find more South Asian science fiction?  Besides my own earlier cited introduction to the first anthology, there are some really good scholarly studies now available, though the focus has been on Indian SF for the most part. See Suparno Banerjee’s Indian Science Fiction (2020), Sami Ahmad Khan’s Star Warriors of the Modern Raj (2021), and Bodhisattva Chattopadhyay, Aakriti Mandhwani, and Anwesha Maity’s (eds.) Indian Genre Fiction (2019), which include extensive bibliographies. Similar work needs to be done for the SF traditions in other major countries such as Pakistan, Bangladesh, and Sri Lanka, perhaps extending to a consolidated view of the South Asian SF scene.  Is there anything else you’d really like readers to know about The Gollancz Book of South Asian Science Fiction Volume Two, the authors and their stories, or yourself and your work?  It is a really good sign that a sense of community and concomitant understanding is emerging among South Asian SF writers, rather than the often to be seen hostility and mutual devaluation. This platform may enable a bridging of the gulf that ensued after the partition of 1947, at least to an extent, and a restoration of awareness about some crucial civilizational patterns at risk of being lost, albeit in a futurist mode, as we see in Vandana Singh’s story “A Different Sea,” with its recuperation of alternate timelines and perspectives, including the subaltern and feminist variants. Here’s hoping for a warm reception for this omnibus and possibly a third volume to come. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nNavigating the Seas of South Asian Diversity: A Conversation with Tarun K. Saint\nIndependent scholar and writer Tarun K. Saint was born in Kenya and moved to Long Island, New York at the age of two. He started reading around age five or six. His father taught at Friends World College. They moved to Udaipur in Rajasthan, India in 1972, and Saint was deschooled until 1977, “with the chance to read voraciously under my parents’ guidance.” Saint joined Mayo College in Ajmer, and went to Hindu College in Delhi, where he earned a BA and an MA in English literature. In 1992, he completed an MPhil and in 2006, he earned a PhD from the Department of English at Delhi University. He taught at Hindu College until 2016.\nIn 2010, he published Witnessing Partition: Memory, History, Fiction (Routledge India), which went into a second edition in 2020. He coedited Translating Partition (Katha) with Ravikant in 2001, edited Bruised Memories: Communal Violence and the Writer (Seagull) in 2002, and coedited Looking Back: The 1947 Partition of India, 70 Years On (Orient BlackSwan) in 2017 with Rakhshanda Jalil and Debjani Sengupta.\nBoth volume one of The Gollancz Book of South Asian Science Fiction and 2020 anthology Avatar अवतार: Indian Science Fiction–Fantascienza Indiana, coedited with Francesco Verso, landed on Locus Recommended Reading lists.\nWhen he’s not changing the landscape of the science fiction industry with groundbreaking anthologies, he likes listening to jazz, especially jazz-rock fusion. He also travels when possible. Tarun K. Saint lives in Delhi, India.\nHow did you become a reader of genre fiction? What were some of the first science fiction books or stories that were important to you?\nAt the age of seven or eight, I was presented a copy of Robert Heinlein’s Red Planet, which struck a chord with its evocative description of Mars. Later, I was lucky to have a visionary librarian at school who encouraged eclectic tastes in reading, including SF. While Golden Age classics by Asimov, Clarke, and Bradbury predominated, I recall being struck by Philip K. Dick’s work, especially Martian Time-Slip, and Joe Haldeman’s remarkable The Forever War, as an allegory about a never-ending war.\nLater, the works of Ursula K. Le Guin (The Lathe of Heaven) and J. G. Ballard (especially his short stories) spoke to me with respect to exploring the dialectics of inner and outer space. I came across the novels of Arkady and Boris Strugatsky, especially Roadside Picnic and The Doomed City, and Stanisław Lem (Solaris, The Invincible) at a later stage, as a teacher of science fiction (mainly Asimov—Foundation) seeking to expand my horizons, especially in the domain of non-Anglophone SF. I began to realize the extent of writing that exists beyond mainstream SF, including writing from South Asian spaces.\nSome readers and writers in the US and the UK draw sharp lines between “literary” and “genre.” Are there similar ideas in South Asia in terms of demarcating various kinds of fiction?\nYes, the demarcation between literary and genre or popular fiction has been in place since the colonial era. The snobbery associated with “literary” fiction has led some writers to consciously dissociate themselves from genre fiction, though there are some notable exceptions, such as Amitav Ghosh’s The Calcutta Chromosome (1995). In the anthologies I have edited, I have sought to undo this binary through a juxtaposition of the different styles and registers of South Asian SF and speculative poetry.\nHow did you get into the publishing side of genre? How did your career start, and where would you like to see it go?\nAs a freelancer, I have a tangential relationship to the publishing world. I submitted the proposal for the first Gollancz Book of South Asian SF initially as an anthology of Indian SF, an area that I felt had not received its due. The ambit expanded as this became a series, which I hope will continue in times to come.\nWhat are some of the most important differences between newer South Asian science fiction and classic South Asian science fiction?\nEarly proto-SF and SF from South Asia was heavily influenced by Western, mostly Golden Age models. Much of this writing had a pedagogic imperative, seeking to convey the wonder of scientific discovery through stories with a didactic thrust. There were some exceptions that brought in a different form of futuristic speculation, whimsicality, and humor. The best of recent writing has a more skeptical and self-critical view of science, especially in the light of the damage done by the modern developmental discourse to communities and the environment. The perils of AI-based surveillance, corporate pillaging of nature, and the unleashing of ethically unhinged forms of social media are at the forefront of attention of New Wave writers.\nDo you have favorite science fiction, fantasy, or horror writers whose work is still fairly unknown to Western readers?\nI really like the work of Manjula Padmanabhan, Anil Menon, Vandana Singh, Shovon Chowdhury, Muhammed Zafar Iqbal (in translation from Bengali), and Vajra Chandrasekera in the domain of SF/speculative fiction, while Usman T. Malik, Saad Z. Hossain, and Tashan Mehta, among others, have extended the boundaries of fantastika/the weird/horror in fascinating ways.\nFor writers in South Asia, what are the most common barriers to breaking into science fiction publishing in the US or the UK?\nI have no firsthand experience of submitting stories to SF publishers in the West. My publisher, Hachette India, is a sister imprint of Orion, of which the well-known Gollancz SF imprint is a subsidiary. The first volume was liked by the Gollancz team, hence the title, which was eventually reprinted by Gollancz UK with a new title, New Horizons: The Gollancz Book of South Asian Science Fiction. Let us see if the second volume follows suit.\nAs I understand, this rarely happens, since the flow of books is usually from the West to India/South Asia. So, this is welcome as a precedent for future volumes in the genre. Samit Basu’s SF novel Chosen Spirits has been taken up by Tor.com and is being reprinted in the US as The City Inside.\nUnfamiliarity with the cultural context and idiom is a common hurdle for South Asian writers, besides a certain degree of insularity and the overwhelming strength of the Western SF scene, which may lead to a certain undervaluation of writing from “other” spaces.\nIs publishing in the West a goal that many writers in South Asia have, or are they generally more concerned with speaking to South Asian readers?\nIn earlier times, many writers like R. K. Narayan made their breakthrough in the West. Since the 1990s, many international publishers have opened offices in India and are releasing titles directly to the Indian market. This has obviated the need to find a Western publisher and audience to an extent, though an international audience is always welcome, as we have seen in the careers of Vikram Seth, Arundhati Roy, and Amitav Ghosh.\nOf course, there are many writers working in the regional languages who do not perceive the need for a wider audience, unless this happens as a result of translation, as in the case of Satyajit Ray’s SF stories translated from Bengali, and Jayant V. Narlikar’s SF novels and stories from Marathi. More high-quality translations would certainly enable a better sense of this diverse field of literary expression.\nThe first The Gollancz Book of South Asian Science Fiction came out in 2019. What are some of the most important differences between that book and volume two?\nMuch of the first volume focused on a specific theme, since I invited writers to reflect on what South Asia might look like in 2087, seventy years from now, extrapolating from current trends. Some unrelated SF stories and speculative poems, including samples from classic SF, were included as well.\nVolume two expanded the scope to include SF as well as high concept fantasy and horror, not necessarily tied into a central theme. Furthermore, we were able to reach out to Sri Lankan writers, and more authors from Pakistan and Bangladesh, besides India, as well as from the respective diasporas. I am especially pleased that we have a story here by a writer from the Tibetan community in exile. Therefore, we have more diversity in volume two, both in terms of themes, as well as geographical and cultural origins of authors (with some translations from Marathi and Bengali).\nSince I had traced the history of the genre synoptically in the Introduction to volume one, in this anthology I focused more on the texts included in my critical introduction, seeking to contextualize this new work.\nSouth Asia comprises so many languages and cultures. Most of the stories in The Gollancz Book of South Asian Science Fiction Volume Two are written in English (as opposed to being translated works). Some of the authors have cultural roots in South Asia but don’t necessarily live there. Is sourcing works that represent a broad spectrum of South Asian cultures especially challenging?\nThat’s a really good question.\nYes, indeed, navigating the seas of South Asian cultural diversity, whether in terms of language, culture, or nationality can seem a daunting task at times, especially if one is trying to provide a representative selection from the region. The predominance of English (an inheritance from the colonial era) and the diasporic location of many of the authors can seem like a mixed blessing while sourcing material. Since the two volumes in this series were to carry mostly original material, approaching various authors who already work in the field to write new stories/poems was a challenge indeed, besides locating promising new voices.\nFinding translators for the selections from classic SF in Hindi and Bengali was an additional hurdle to cross in the first volume, to a certain extent faced in the second volume as well, also with respect to recent SF in the regional languages, not all of which have strong SF traditions. This entailed quite a bit of reading and delving into the archive. The pleasure of rediscovering forgotten classics of futuristic writing, such as Rahul Sankrityayan’s Baisvin Sadi (Tr. Twenty-Second Century) was its own reward, even if we could only carry extracts. There are many layers to this cultural archive still to be unearthed, which we hope future volumes will continue to showcase.\nThe publishing industry has its own internal hierarchies and priorities, of course, where the politics of language and translation play a role. In recent times we can see more of adventurousness and willingness to support offbeat ventures. Networking and coordination among academics, authors, and enlightened publishers can make a lot of difference, once the initial set of suspicions and misunderstandings are set aside.\nWhat we often see in terms of works coming to Western audiences, is that readers have no idea how important or respected some of the authors are in the context of their own cultures. Who, for you, are the “big name” authors in volume two, and who are the “up and coming” authors that really excite you?\nIn this volume we sought to achieve a judicious blend of well-known and “up and coming” authors. Manjula Padmanabhan, Vandana Singh, Anil Menon, Priya S. Chabria, and Shovon Chowdhury (who sadly passed away before the volume’s release) are recognizable names, as are Jayant Narlikar (from an earlier generation in Marathi, but still with us) and Muhammed Zafar Iqbal in Bengali). Sri Lankans Vajra Chandrasekera and Yudhanjaya Wijeratne, and Saad Z. Hossain from Bangladesh, are established presences in SF circles, as is Kaiser Haq from the same country in the sphere of poetry. Usman T. Malik, Haris Durrani, and Bina Shah are major forces to reckon with in Pakistani speculative fiction.\nAmong the “new” or “up and coming” writers, Gautam Bhatia, Premee Mohamed, and Lavanya Lakshminarayan have brought out substantive new work recently, while Kehkashan Khalid, Medha Singh, Navin Weeraratne, and Soham Guha (a bilingual writer from Bengal) are instances of promising talent to look out for.\nAnother aspect of this can be that Western audiences don’t always understand when a piece is being socially or politically daring. Are there a few pieces here that are fairly daring in their subjects or subtext, in one way or another, in ways that Western readers might miss?\nThat’s an interesting question. Yes, I think some of the stories, especially in the vein of satirical SF, might have a contemporary and allusive dimension that might be difficult to grasp. However, like all good fiction, South Asian SF for the most part does find its way to the universal through the narrow door of the particular. In the age of Google, finding out more about “background,” culture, and sociopolitical constructs is certainly possible, even if some levels of meaning remain context-sensitive.\nWere there stories that you really liked, but that didn’t end up in the anthology?\nNo, fortunately not! We in fact exceeded our projected length somewhat due to the quality of submissions.\nWhen you were making selections for the anthology, what were the most important things for you, what were your priorities?\nQuality of writing, thematic appropriateness, and ability to make an effective intervention in the moment.\nIf someone will read only two or three stories to see if the book is for them, which stories would you tell them to read, and why?\nIt is always difficult to pick a few. Perhaps Vajra Chandrasekera’s “The Maker of Memorials” for its sensitive exploration of the afterlife of violence and war, and complex reflection on the question of memorialization of the dead from an SF angle, Manjula Padmanabhan’s “The Pain Merchant” for its uncanny fabulation with an SF anchor, and Saad Z. Hossain’s “Bring Your Own Spoon” for its weaving together of elements from jinn lore with an SF style reflection on contemporary authoritarianism.\nDo some of the stories in The Gollancz Book of South Asian Science Fiction Volume Two stand in conversation with Western, South Asian, or other science fictional narratives in important ways?\nYes, though this may be a matter of interpretation rather than preconceived design or intention. Muhammed Zafar Iqbal’s “The Zoo” certainly takes on board the interrogation of modern science bereft of ethicality seen in works like H. G. Wells’ The Island of Dr. Moreau, while redirecting such questioning of the relationship between knowledge and power to include the media. Bina Shah’s “Looney ka Tabadla” is in self-conscious dialogue with Saadat Hasan Manto’s “Toba Tek Singh,” as an updated version of that superb satire of the partition era. There are similar self-reflexive and metafictional dimensions to many of the stories.\nWhat are the best resources you can recommend for readers who want to find more South Asian science fiction?\nBesides my own earlier cited introduction to the first anthology, there are some really good scholarly studies now available, though the focus has been on Indian SF for the most part. See Suparno Banerjee’s Indian Science Fiction (2020), Sami Ahmad Khan’s Star Warriors of the Modern Raj (2021), and Bodhisattva Chattopadhyay, Aakriti Mandhwani, and Anwesha Maity’s (eds.) Indian Genre Fiction (2019), which include extensive bibliographies. Similar work needs to be done for the SF traditions in other major countries such as Pakistan, Bangladesh, and Sri Lanka, perhaps extending to a consolidated view of the South Asian SF scene.\nIs there anything else you’d really like readers to know about The Gollancz Book of South Asian Science Fiction Volume Two, the authors and their stories, or yourself and your work?\nIt is a really good sign that a sense of community and concomitant understanding is emerging among South Asian SF writers, rather than the often to be seen hostility and mutual devaluation. This platform may enable a bridging of the gulf that ensued after the partition of 1947, at least to an extent, and a restoration of awareness about some crucial civilizational patterns at risk of being lost, albeit in a futurist mode, as we see in Vandana Singh’s story “A Different Sea,” with its recuperation of alternate timelines and perspectives, including the subaltern and feminist variants. Here’s hoping for a warm reception for this omnibus and possibly a third volume to come.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/saint_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Navigating the Seas of South Asian Diversity: A Conversation with Tarun K. Saint by Arley Sorg"}