{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Yukimi Ogawa", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "dG0fQRW0fhZ/gCPjgGln4cZO8as=", "id": null, "license": null, "comments": "", "raw_text": "9380 words, novelette  Ripen  Kiriko was having a hard time keeping her eyes off the clutch bag the client had brought with her. The client, a woman of about forty—or maybe fifty? it was hard to tell—sat on a flat cushion placed at the lip of the raised floor of the atelier’s reception, crossing and uncrossing her legs in a sluggish manner. “I really cannot believe there’s any place in this city that has no chair,” the woman said, for the fourth or fifth time. “This is ridiculous.”  “Such a beautiful bag you have,” Kiriko had stopped apologizing for the lack of chairs after the second time. She herself was standing on the earthen floor that ran, right beside the wall-less reception room, across the entire length of the building. “That must be the work of a very good craftsperson. I haven’t seen some of the methods adopted there, though.” It was too small for Kiriko’s liking, of course, who wanted bags to be just as huge as they could be. But this client must have only carried a mirror, and maybe a cigarette box and a book of matches, at most. Rectangle shaped, its lid flipped over the entire length and width of the bag, and the inside was apparently lined with silk, which was embroidered with natural-color silk thread in a minute pattern; the whole lining seemed to ripple with shimmers to a casual eye. Every other surface was covered with more colored embroidery and lace, with beads threaded here and there, surrounding cabochons of enamel—which looked a lot like the client’s own skin.  The client woman almost snorted. “Made abroad, of course. A gift from a foreigner. This subtle yet wild demonstration of pattern and color is nothing the craftspersons of this country can even dream of.”  All right, then, go abroad and get the fix you want overseas. Kiriko downed the words with lukewarm tea, and cocked her head just a little, to hear the noise from outside better. Did she just hear him say hi to the neighbors? Yes—the sliding door burst open with a loud clang, the glass tiles on its upper half rattled badly in their grids. “No rice straw, can you believe? They burned them all!” Kiriko’s mentor, the owner of this atelier, threw an empty cloth bag towards the reception floor. “I made them promise me their next batch—oh, hello, good day.”  The bag he’d thrown had bounced off the client’s shoulder and landed on her own bag. “What the—” She flicked the coarse bag off her smaller, elaborate one, as if the coarse thing could somehow contaminate her spotless possession. “I . . . ” She glared at the young man who’d just assaulted her. “I heard this is the best place in the city, for crafts related to human skin! How can a boy like you be the best? Are you even good?”  He shrugged. “They say I am. I myself never said I am. What service do you seek here?”  For a moment the woman sat there glaring at him, and Kiriko thought she’d walk out right through the door. But then she shook her head and said, “I have heard. About those . . . surgeries.”  Her mentor eyed at Kiriko, who too was feeling the wrong turn coming. “Surgeries,” he echoed.  “I see a lot of foreigners, you see. Part of my job.” She’d introduced herself as the proprietor of one of the teahouses in the High District—the area which expanded just off the seafront to serve, entertain and accommodate tourists from abroad. This particular woman’s place wasn’t actually on the High Street, the spine of the High District and the center of this country’s tourism, but in the western patch of the District, where things were slightly cheaper. She did seem to earn enough for her fancy one-piece dress, her soft- and warm-looking scarf, her high-heeled yet miraculously comfortable-looking shoes . . . or were they all gifts from her patrons?  “They tell me and my girls and boys how rare, how beautiful we are, but very often, that talk slips towards the”—she looked around and lowered her voice—“‘cosmetics’ they have overseas, as they get more and more drunk. Our government discourages them to talk about things like those colors they use to hide circles under the eye, or acne spots. Or, even, just to change the color of your eyelid!” She sat back and crossed her legs. “You know, tourists do like talking about those things, they love it when we go, ‘oh, how sensational!’ even though we are hearing it for the hundredth time.”  Kiriko’s mentor retrieved the disrespected cloth bag and fidgeted with it. Of course, they had heard stories about those obscene, crazy stuff. Kiriko had recently met in a lavatory of a souvenir shop a woman who was drawing eyebrows with a soft pencil. That woman had let Kiriko have a used, very short pencil of the same kind. She and her mentor had spent days taking that thing apart. “And . . . surgeries?” he said, reluctantly.  “There are many, many, they say! Ways to alter your appearance!” the woman exclaimed, as if merely mentioning it was off-limits. “But the thing I’m interested in—I heard they have something to inject into human skin, so the skin stays nice and smooth, even as you age? Or the thing where you transplant healthy skin onto a different part? I need something like that.”  The two young craftspersons looked at each other, then back at the client. “But your skin is impeccable, Madam.”  The woman’s skin was mostly the color of ripe plum, with the soft sheen of enamel thinly applied all over her surface. Here and there—like inside her eyelids or the skin beneath her nails—the mellow yellow of the fruit could be seen. People said her skin used to be fresh green when she was the age of Kiriko now, twenty years or more ago. Her entire skin had ripened, they’d say, the way a young, hard, and sour meat turned to the sweet, juicy thing.  “Impeccable. That’s the way it should be, of course,” she said. “But the thing about age. Look.”  The woman tucked her hard-bark brown hair away from her neck, and there, the two could see: a crack. Underneath it the color was one of fruit gone foul.  “I have several more like this, in parts where I cannot show you now. And these lines are spreading, I can see. I need a way to stop it.”  Kiriko was doing everything she could to not touch the cracked skin. “This looks pretty, too, though. When you’re full of it, it’ll be a totally new pattern!”  The woman released her hair from her grip and looked at Kiriko side-eye. “You’d never understand.”  Of course she wouldn’t. Kiriko’s—and her mentor’s, for that matter—skin, hair, teeth, and bones were all just like foreigners’: plain. That was why she worked as a craftsperson in the first place. Those without a color or pattern on their skin had no place in the tourism industry of this country, where people like this client earned foreign currency for the island by showing off themselves to the sightseers. Kiriko had long been used to this kind of casual insult. But her mentor said, “No, she wouldn’t. We wouldn’t. Which maybe means we wouldn’t feel like helping you, Madam. Thanks for your visit, sorry for the trouble.”  The woman’s plum deepened, to a color closer to the one inside her crack. “I’m going to lose my teahouse if I let my color spoil!”  “And we’re losing a business opportunity here just for what we are, sorry we could not come to an agreement.”  A few seconds passed in an uncomfortable silence. Kiriko’s mentor stood there tall, his shoulders square. But Kiriko didn’t need his protection, really. She, or they, needed money. “Sensei—”  But then the enamel woman inhaled and exhaled. She was the oldest person here right now; she took back control of her emotions sooner than the atelier’s young owner. “Fine. Well. Those small pieces of paper stacked right there, by the way?” She was pointing at the finished products stored temporarily in a corner of the reception. “Those are remedy transfer-print sheets, aren’t they? One of my neighbors uses it for his allergy. I saw him put one to his lower eyelid, transfer the pattern on the sheet to the membrane. He said it eases the itches and soreness he gets as allergic reactions.”  This is going to be bad, Kiriko thought. She could feel her mentor having the same thought, too.  “You make things to transfer patterns onto human skin. How obscene, eh?”  The young man breathed in, and out. “Temporary. And just for a medical effect.”  “But what if more people hear about it? Those folks like you born without colors and patterns on your skin, you can fake what you want on you, in theory. The one for my neighbor, it soon went away with enough of his tears, sure. But if you used a different kind of ink? If you applied it to some drier surface? Oh, so very appalled, I am, to imagine such a thing done to one of my girls and boys!” She placed her hands over her chest and shook herself. Kiriko almost laughed.  “Madam, are you trying to blackmail us?” he said, and Kiriko could hear his temper sliding off to something different than anger.  “No, young man, I am not. I am just trying to strike a deal.”  Kiriko’s mentor sat at the low table of their reception, drumming his finger on its surface, looking grim.  The apprentice placed a tray with a teapot and cups on the floor near him and sat down herself. “She did offer a nice sum of money, at the very least. You can buy me a bottle of fancy ink if that makes you feel any better.”  “Why do you think that would make me feel any better? What do you know about these surgeries?”  Not much, really. Changing your complexion was illegal in this country. Even if the color to be applied came from the same person’s skin. That would probably impose the patient a large sum of fine, and . . . the people who performed this surgery, putting a knife into an allegedly perfect skin? The government would never let them work as craftspersons again. Kiriko shrugged like a foreigner, making him smile a little. “You?”  He shook his head. “Even if we, like, actually get to watch those surgeries, or read about their procedure details, I’m sure they are for the clinic, not for us, common folk-remedy place. I know she came here because she cannot possibly ask the government-run clinic, but here we don’t have adequate equipment for that. Not even injection needles!”  Of course—neither of them had any kind of certificate or license or whatever, to do anything, that would involve actually slicing into human skin. This place was called an atelier because they put out patterned artifacts like cloths for apparel or furnishings, carved wood boards for furniture and home interior, et cetera, et cetera. But that was only one part of what these two craftspersons did. They tended to small discomfort of human body, like minor yet persistent headache, inefficient digestive system, regular cases of dizziness and so on, with their only weapon—the patterns they drew.  To them, currents of fluid within human body, the way muscles flowed, and the air glided over them, were just another kind of pattern. The two craftspersons called these “silent” patterns, as opposed to plainly visible, real lines and colors; everything, including human body parts, had a pattern to it, the curls of air and swirls of energy around it, marking its place in the world. Their treatment was conducted a lot of the time by finding another silent pattern that could affect the existing one and applying it over the affected area, to adjust the currents that had gone just a little bit amiss, correcting blood flow to make the body work more efficiently, or let the patient move their muscle more freely. Some patterns worked generally, while others had to be customized to the patient and their condition.  But they couldn’t treat diseases that were too severe, or perform any kind of surgical operation. And here, in this country where altering your complexions was a crime, of course they couldn’t speak openly of what they did behind their doors with screens shut, as they often had to draw patterns directly on human skin, which was regarded highly inappropriate.  “Couldn’t we just make a pigment portion and fill the cracks with it? I’m sure that’s what she expects, anyway.”  “I think she wants permanent, and we cannot just fill a human skin with foreign matter, even if she’s an enamel.” He grinned. “Even if she loves foreign stuff.”  His apprentice ignored this. “If we make—even if we can—something that changes the color there forever, once we do that the city will no longer overlook what we do.”  “But how long, exactly, is forever?”  “Huh?”  He took his cup up off the tray. “With the remedy transfer sheet for allergy, the pattern stays there only for a few minutes. We have those sheets with ink that remains on the skin for a few hours, for cases where slowness and steadiness are more important. Stretch that procedure time little by little, and then . . . ”  “Sensei,” Kiriko pointed her finger at her mentor, “that is a quibble, and a feeble one at that.”  “Oh come on, a few days cannot possibly be that huge a trouble. Even though that’s far longer than any we’ve made here.”  Kiriko considered this. “A few days . . . ” she whispered. “Days . . . ”  “Right. Days.”  She blinked. “So she’ll have to reapply the pigment every few days. The cracks are small but slowly spreading? Usual transfer method won’t be much convenient here. And she must be very good with brushes to do it in a way people cannot tell there’s been some tampering . . . ”  “Oh, I don’t like that word.”  “Wait. Wait, but if the pigment is manipulated in a way it will attach itself to certain places . . . ”  Her mentor sighed. “Finally. How long did it take for you to get there?”  She glared at him. “We’ll still have to find a way to confect this pigment—what substance can be used, to closely stick to human skin, remain there a few days, and that would do no harm to the bearer.”  “Step by step, my dear apprentice,” he said, touching his lips to the cup of hot tea. “One problem at a time.”  At least the client probably wasn’t as heartless as she’d seemed. She placed some ordinary orders too, a patterned cloth for a sofa cover and garlands to be installed around the ceiling light, among other smaller things. Kiriko went to deliver the crafts, and also to take a sample of the proprietor’s skin. While repeat tourists who were more or less familiar with the country dominated this area, a lot of islanders—though only colorful ones—loitered and enjoyed themselves, too. Not the cleanest or safest part of the city, but many of the places around here had a distinct taste for fancy stuff and paid the atelier well.  Kiriko entered, careful not to draw the guests’ attention, into the dimly-lit hall of Madam Enamel’s teahouse. “Delivery for Madam,” she whispered to one of the waiters standing near the door.  “Been expecting you, Craftsperson. This way.”  The higher parts of the windows in the hall were filled with a cheap kind of stained glass—not the real, super-luxurious stuff seen around the most expensive area of this country. There was only one proper chandelier, and other lights that hung from the ceiling were simple gas-mantle lamps, some with old garlands swinging around them. Still, Kiriko could see the labor and money the proprietor put into this place. After a short walk along a narrow corridor on the other side of a small door, the waiter opened another of the same size for Kiriko, behind which the woman sat at a desk with reading glasses over her nose. “Hello Craftsgirl,” the woman said, slightly squinting. “Come here and let me see those best pretties of the city.”  Together they spread the delivered goods. The woman did seem to care a lot about these things unlike other clients around this area, who’d just order a thing, get it delivered, and then forget all about it once it got installed in their shop; she turned the goods around, checking every surface, trying the feels of every pattern to the touch.  “I don’t know why, but I really like these things. How different are they, from the stuff other places put out? Maybe you really are the best.”  Kiriko and her mentor did choose those patterns which would soothe people’s mind, by relaxing muscles around the eye and lifting some tension off a certain area of the brain. “Thank you,” Kiriko only said.  “So?” The woman sat back in her chair. “Have you figured out anything . . . for me?”  Just then the waiter came back with cups of tea and a plate of confectionary. Kiriko squeaked silently at the beauty of the ridiculously small yet elaborately shaped sweet pieces, and the woman watched her eat for a while.  “You really aren’t that different from my girls.” To Kiriko’s surprise, the woman was smiling.  Kiriko swallowed a bite, which was almost a whole of one very fragrant cake. “I am so very different from them, I am totally colorless.”  “That is quite extraordinary in itself, indeed, you know?”  “Not for the tourists.” Kiriko listened to check if no one was within the earshot, and then said: “I need samples. Of the inside of your crack.”  “Does it hurt?”  “It may hurt roughly to the same extent as when you snap a rubber band against your skin. If that’s too much . . . ”  “No, that’s fine. Anything is fine, actually, as long as there’s something you can do.”  Kiriko scraped bits of skin and membrane off the woman, closed the caps tight on the sample vials. The sample wasn’t just for color reference. Sometimes silent patterns could be seen easily only if she strained her consciousness enough to channel through. Other times, though, they could be hard for naked craftsperson eyes to see. These could be examined with good microscopes customized by the atelier over the years, which helped taking elements apart through the lenses.  When she was done, Kiriko slurped up the last of her tea. “We’ll still need some time,” she said, as she stood up. “We’ll get back to you as soon as we can.”  The woman nodded. “Take those sweets. Does your mentor eat those, too? Or prefer something that goes better with alcohol?”  “He likes sweets, thank you!”  The woman saw Kiriko off to the exit. Along the way, the proprietor exchanged a few words with each of the girls and boys she encountered, and the interaction seemed kind, or even affectionate, perhaps. “Are you sure you don’t need an escort out of this part of town?” she said when they were at the door.  Kiriko nodded. “It’s not so late, and I do know safer paths.”  “Take care, then. Good night.”  “Good night, Madam.”  “I like her,” Kiriko said as soon as she was inside the atelier.  Her mentor frowned, said nothing.  “Look, she gave us some sweet things.”  “Oh okay, maybe she’s nice.”  “And I mean, she’s a bitch, all right, but she does seem to care for her place and her employees. I think she needs to remain enamel that badly because she needs to keep her place nice and popular, for her employees rather than for herself.”  He opened the wrapping cloth and picked up one of the tiny cakes. “You do realize that you tend to attach yourself to any kind of client, don’t you?”  She almost pouted and stopped herself. “She likes our crafts!”  He popped the cake into his large mouth and chewed, and looked very happy.  “See? Nice. And anyway, every client has their own reason. We’re here to help them.”  He swallowed loudly and sighed contentedly. “Should have prepared some bitter tea first. Let’s get working on the samples now.”  Kiriko never hung around in the High District without very good reasons. She always felt nervous around the foreigners; she’d had no education on the official language, as the government deemed it a waste of resources for the colorless folks who had no direct business with the tourists; and most of the time, she didn’t get their gestures. Shrugging was one of the first few she’d understood after she first moved to the city from her village in the mountains, and sometimes she even used it, because there was no gesture native to this country that could convey what it did. Then, not all the foreigners shrugged, them coming from many different parts of the continent. She just didn’t like the feeling of being at a loss.  She walked through one of the narrower avenues on the eastern side of the High District, where many inns stood between the High Street and the waterfront. Accommodation was cheaper here than the hotels along the coastline. There were a few cafes and teahouses, not the fancy kind like in the west but those which simply served just-okay coffee. On the terrace of one of these places, a foreign woman was seated, looking down at her coffee beside which the milk and sugar sat untouched.  It was a bit chilly this morning, and the woman was the only patron on the terrace. Just as Kiriko had hoped. “Nova-san,” she said, tasting the unfamiliar pronunciation of the woman’s name at the edge of her lips. “Good day.”  The woman looked up from her cup. “Hello Craftsperson Kiriko-san!” She beamed, engaging in the local language of this island for Kiriko’s sake. “How nice to see you! Come have a seat!”  Nova ordered black tea for Kiriko. (This place didn’t have green tea, and black was slightly better than coffee for the craftsperson.) Her hair was black, just like Kiriko’s, but it glowed as if there was a layer of faint light over it; Kiriko had heard foreigners took very good care of their own conditions, not quite the way the islanders did. And she was almost as deeply-tanned as Kiriko’s mentor, while Kiriko herself was pale and her skin hated the sun. Something glimmered on the woman’s eyelids, and her peridot earrings went very well with her skin and also with those golden shimmers around her eyes. But it wasn’t these carefully aligned looks that attracted Kiriko; Nova was the first foreigner who talked to Kiriko in the local language from the start, instead of the official language.  And of course, there was that eyebrow-pencil thing. “I want to thank you again,” Kiriko said, wanting to shift to more formal speech but afraid the foreigner might not understand her then. “It was such fun to take that pencil apart.”  “Good to hear! You didn’t get into trouble? We are told not to talk too much about cosmetics, before we depart the continent.”  “Not at all. We are careful. And . . . we hate to take advantage of your kindness, but . . . hope you don’t mind telling me more about how you paint your face? What you use, and how you decide the appropriate amount and such.”  “You want to know more about what we do? How diligent!”  “May I see that thing on your eyelid? Is that a pencil, too?”  Nova winked. “This? No, this comes from a palette.”  “Palette!” Kiriko almost squeaked.  “Yes, a tiny palette. I can show you, but is it okay to do that here? Isn’t that regarded obscene?”  Kiriko’s shoulders slumped down. “Yes. That would attract a lot of unwanted attention.”  “Strange people, you all. But so are we, in your eyes.” The foreign woman laughed just a little. “Any place? I don’t think I can afford a space at that luxurious hotel down the coastline.”  Kiriko considered this. “Oh. Maybe I know a place.” She considered it again. “Maybe?”  Like many of the teahouses in the west, Madam Enamel’s place offered a quiet space at the back for those who needed privacy. Kiriko didn’t know the reservation cost, but as she had hoped, Madam Enamel said she wouldn’t charge for this particular case.  “I still don’t see how a foreigner can help with this,” the woman said. But Kiriko could hear excitement in her voice.  “Thank you for your cooperation, Madam. Nova-san, after you, if you please.”  The foreign woman said quick thanks to the proprietor in the local language, and Kiriko saw the enamel woman blush, her ripe plum cheeks turning to a warmer color. One of the waiting boys escorted Kiriko and Nova, an adolescent with peacock smudges on his face, one of his eyes amber. “Green tea is free of charge, Craftsperson,” he said to Kiriko. “What can we offer your honorable company here? We do serve alcohol, too.”  Nova looked at the menu and ordered a few things, including small cakes for herself and Kiriko, too. “Can you even read our language?” Kiriko asked.  “Some. Not everything. Your colors are beautiful, you look like you come from a myth,” Nova said, the latter sentence to the waiter.  His ears turned pink. “Thank you. Oh, it feels so much better when a guest compliments in our own language, if I may say so.”  “Does it, now? Then please send my regards to your proprietor. Her skin is perfect. I would like to have my nails enameled in that color in her honor, if that’s not an obscene thing to say.”  “It is not. She would be very pleased. If you’d excuse me.”  After he left Kiriko said, “You should tell that to Madam in person. And I think the enamel color would go very well with your tan color.”  “Thank you, Kiriko-san. You are beautiful, too, don’t forget. The way your eyes twinkle when you talk about crafts, the way your jaws are set when you are focused.”  Kiriko swallowed loudly. “Do you say that to everyone?”  “Mm? Maybe. But everyone I like is beautiful in their own way, and I think it’s important to tell them so. Let’s get to work?”  The craftsperson nodded and started going through the cosmetics purse Nova carried with her. She touched everything, one after another, trying the various textures. Powder, paste, liquid that seeped onto the brush when you rotated the stem . . . her mentor would love this brush. These things wouldn’t last a day, the bearer would even have to retouch the colors on her face from time to time! How strange, these foreign customs. Some of the things even included colorant that she had never seen—she swallowed, braced herself, and bored her consciousness into these.  Her plan was to grasp how these cosmetic things were made—how the substances worked, the percentage of those substances contained, the way these things mingled—from the silent patterns those substances emitted and the way they moved around each other. She also copied the names of the chemicals, with Nova’s help on the language, so that she could later look them up; once she learned the precise description of the substance’s property, she’d get to combine the knowledge with the patterns she felt from these cosmetic products, and then she could start probing for other ways of using these substances.  “Thank you,” she said after she scribbled everything she could as fast as possible. “Sorry to have kept you waiting.”  “No problem at all. This place is lovely. Wasn’t in the travel guidebook.”  “Not the best part of this country that the government wants to boast about. And foreigners must be careful if they need to walk around this area late at night.”  Together they left the place, and like the last time the proprietor saw them off at the door. She bowed deeper and longer than the last time, though. Maybe it was just because Nova was a foreigner. But the waiters and waitresses, too, looked sad to see Nova leave.  “I hope you’ll visit us again soon,” the proprietor said, as she handed a business card to the foreign woman.  “I will, thank you,” replied Nova, touching Madam’s hand lightly as she accepted the card.  “So this Nova person. What exactly does she do?” Kiriko’s mentor asked as the two craftspersons started their work in their lab. “Is she on a mission or something? An ambassador?”  “She is a researcher. She said she’s here to study our culture, but not necessarily the colorful folks.”  “What is there to study at all, apart from the colors of the tourism workers?”  “She says there’s always something to learn as long as people live there. And that the hierarchy of the people is very peculiar here.”  Her mentor sat back and looked away from the microscope for once. “But isn’t that just obvious? The colorful rule. The colorless obey.”  “On the continent there are different criteria for that. Because no colorful folks.”  He shook his head and looked back down the lenses. Then they started their long discussion—how could they stretch the flow of the silent pattern inside Madam’s cracks so that it’d welcome the one in the pigment portion they concocted? Was there a way to enhance the affinity of it all, or could they just draw a straight, taut line between them, so that no other thing would even think of intervening?  After hours of yeses and a lot of noes and buts, they agreed on a configuration. Her mentor drew the tiniest reproduction of the silent pattern found inside Madam’s crack, on an impossibly thin, almost see-through piece of soft paper, which took hours of making itself. They wrapped the dried ingredients with the paper and let the colorant absorb the pattern from inside. Madam Enamel could put one wrapped potion in her bath, immerse herself in the solution, and let the pigment settle in her cracks, drawn in by its pattern twin. The fibers of the paper would land around the affected areas, too, working for better smoothness. It would require a slightly-acidic bath to get rid of it.  “I love it,” the woman said on the phone, after the first try. “You cannot see the cracks unless you look very, very carefully. And that’s only if you know what to look for. And it also improves the way my skin feels as a whole. This is perfect.”  Kiriko sighed into the receiver, relieved. “Good to hear that, Madam. But please refrain from overusing it? We’ve been very careful, but this is the first time we made something like this, so.”  “Of course. I’ll call when I need the second batch.”  Kiriko grinned at her mentor as she put down the receiver. He shrugged, then laughed and started humming to himself. Kiriko soon joined in the tune. A moment like this, it was one of the best things about this trade.  But when they did hear about her again, the words didn’t come from the woman herself. It came in the form of an officer in uniform. “Craftspersons,” they said, when Kiriko opened the door. “If you please.”  Madam Enamel looked exhausted behind the transparent wall, but that didn’t explain the cracks that had spread, covering most of her neck and invading her jawline. Kiriko had imagined the cracks to be a beautiful, treelike pattern if and when they spread, but something was wrong with the actual thing in front of her now. The color, for instance, wasn’t the bad fruit they’d seen when the woman first visited their place. It had a strange tinge of green to it. And the way it progressed . . . there were jumps and starts here and there, instead of branches going forward in the fan-form, using the momentum of its own growth; as if some unknown force tried to rip the skin randomly.  “One of the places in our area got suspended for being a site matching the locals to the tourists who need . . . special services,” Madam Enamel said on the other half of the cubicle, behind the see-through wall. “Many more places got raided, and I was caught while I was having a bath with Nova-san. Not the best timing, is it?”  Kiriko raised her brows. “You were having a bath with Nova-san?”  “It wasn’t like I was selling myself to a foreign stranger. And . . . ” She rolled her eyes towards the officer who was standing behind her, who couldn’t see her doing it. “She explained that we are friends, to the authority, that she had brought in the bath bomb for the two of us.”  “Then what happened to your skin?”  “I’ve no idea. It never happened before this time, the . . . thing had worked so well so far.” She blinked, waiting for a question from the officer at attention; they didn’t seem to have one—apparently.  “Do you know when you’re getting out?” asked Kiriko.  The woman looked uneasy at this. “No. Nova is doing what she can to prove that no money was exchanged between us. The government hates us, don’t they? Those of us who don’t do business exclusively for rich foreigners but serve our fellow locals, too.”  Kiriko massaged her brow with a finger. “We’d like to look more closely . . . at your condition. Did you put anything in your bath along with the bath bomb?” She hastily added, “I’m just curious.”  “She added scented water. I think that is all.”  Ordinary scented water shouldn’t have been able to change anything in the composition. At least not like this. “I’ll talk to Nova-san,” Kiriko said after a moment.  “Please do. I—I hope I didn’t get her into too much trouble.” At that, her lips trembled, though just a little.  They couldn’t reach Nova very soon, though, as the foreigner was busy talking to the embassy and authority. Madam Enamel was released two days later. By the time she made it to the atelier, her steps were unsteady, her eyes murky, and there was another thin but unbreakable layer of sweat over her enamel. Kiriko piled cushions on the reception’s raised floor while the woman’s peacock subordinate and the owner of the atelier helped the woman up onto the makeshift cot.  “What is this?” Kiriko’s mentor said, sounding bewildered. “This—this looks so much worse. The cracks are all over.”  Yes; the cracks had spread even wider, to the extent that there was no smooth surface on her visible now. Nova might have said something at the embassy, but more likely this was the reason the authority had decided to let her go. Kiriko dabbed at the woman’s forehead with a cloth of a heat-absorbing pattern. “Did we do this?” It hurt to word this question.  “I don’t know.” His admission bit like a ragged edge of ice. “Let’s just do whatever we can, for now.”  The two craftspersons looked more closely at the cracks, and again, Kiriko was struck by how unnatural, the way all those lines ran. It felt very abrupt—a blister that erupted, swathing the area with its nasty fluid, not a seam gradually extending. Was this just a result of aging? Unlikely, though perhaps they should have taken it into account. It had to be solely the atelier’s fault.  Kiriko traced some of the cracks with her finger and quickly started adding a new pattern that would alleviate the wrongness of the one currently there. They’d discovered Kiriko was better at this even than her mentor—he had much wider knowledge on many things, on application of those things, and his thoroughness and meticulousness of the deployment was almost impeccable; but when it came to time-critical treatment or one-shot goes, Kiriko’s instinct bloomed under the pressure and she usually had control over the situation within minutes. But this . . . her hand steadied around the stem of the brush, as if she knew where the ink had to be; she had to do this, but how much would she be able to help, randomly groping for solution as she was?  “This might hurt a little,” Kiriko’s mentor was saying to the woman, but there was no reply.  He spread thin acid over the woman’s enamel skin, to slow the cracks going farther. Kiriko started working on the worst-looking ones, those that were thicker, with that foul, greenish tinge, applying a dusty red colorant with bold yet precise strokes. Even as she did so, thread-thin lines were spreading around the bad ones, bypassing the acid. Soon her mentor started tending to these smaller ones.  The peacock boy rubbed his face fiercely. “What the hell did she do?”  “It’s us,” the owner of the atelier told him. “Our doing.”  “But she asked for it, didn’t she? We knew she’d do something stupid on herself. She’s been so obsessed with her own skin. Like that was all that there was keeping her house upright. But it was her. You know? It was she herself who bound that place in one, not just the skin—”  “Shut up, we’ll apologize and hear you boast how much you love her later, but now make yourself useful and bring us washing water for the brushes.” For once, Kiriko’s mentor raised his voice. “The kitchen’s behind that door. There are small pots and buckets lying around.”  And hours afterwards ticked away like that—two craftspersons drawing patterns as fast as they could on an immobilized woman, a peacock adolescent moving to-and-fro over the atelier floor. When the dawn arrived, the enamel woman’s breathing was finally even, and the three young people collapsed onto the reception floor around her.  They didn’t have beds for patients—that, too, was for the clinic—so after a few hours’ nap they wrapped up the woman and let the peacock boy and his coworkers carry her via a coach. The two craftspersons prepared emergency transfer-print sheets that the workers of the teahouse could apply on the woman if and when need be. And they started trying to figure out what had gone wrong, right away.  But they couldn’t see anything; they’d thoroughly examined every possibility, checked her allergic reactions and the state of the ingredients, the devices and equipment they’d used to prepare the treatment. Kiriko told him about the scented water that Nova had brought in. But with the configuration they’d made, and the fact that the foreigner herself had been in that water, too, that this scented water thing could do any harm to just Madam Enamel seemed unlikely.  “We do have to check what that water is, anyway,” her mentor said over a hundredth cup of tea. “It is possible that there was something in that water, a substance that we have not heard of, that Madam can be allergic to.”  Kiriko sighed. “I’ll go talk to Nova-san.”  The foreign woman was almost equally disconcerted, if not unwell, when Kiriko finally managed to arrange a meeting. “I was waiting for her to call me when she was released,” she said as she let Kiriko into her hotel room.  Kiriko didn’t like going behind a closed door alone with a foreigner, not because of Nova, but of custom. But this was an emergency. “Madam was too ill to make a phone call,” Kiriko replied, and took a seat near the window. “We asked Peacock to let us know of any change of state, so she must be still resting.”  The foreign woman poured tea for Kiriko and herself. “How bad is it?”  “We believe we managed to stop its progress. But to eliminate it entirely—we still aren’t sure if it’s a disease or some other kind of disturbance—we need to know exactly what is causing it.” Kiriko bit her lip for a second. “We heard you added scented water to the bath? Do you have its container with you still?”  “No, sorry, it never occurred to me—” She shook her head. “Is it my fault?”  She hesitated one moment. “Our fault, more likely. Me and my mentor. Do you remember its maker or seller?”  “Oh, I’ll ask my sister on the continent by phone, she gave me the thing. Let me see . . . ”  Nova went to the closet, came back with a datebook, sat down near the phone machine. Then she blinked hard down at the datebook, and sighed. “Kiriko-san, my old tired eyes need the light on. Can you close the curtains for me?”  “Sure.” She stood and started drawing the curtains. Nova was fumbling for the light’s switch. Now just one part of window was still uncovered, and Kiriko reached out to shut it there, too. But then—  “Wait,” Kiriko said, “don’t turn that light on.”  “W-what?”  A sliver of setting sun came through between the curtains, fell on the table beside the window, and bounced off the polished surface to dimly illuminate the foreigner’s face. Colors danced over her skin—green seemed to be dominant, but the sheen shifted with bronze, orange, and something that reminded of Madam’s color.  Jewel-beetle.  “Nova-san, are your ancestors from this island?” Kiriko asked.  “Oh, I haven’t mentioned that? Yes, but a very long time ago. That’s why I’m so much into this country.”  “I see,” Kiriko said, her hand still hovering near the curtain. “I think now I know what caused Madam’s condition.”  The locals looked; of course, foreigners almost never wandered out to this part of the city. But Kiriko—of all people, that introvert, entirely-colorless craftsperson—leading a foreigner to the pattern atelier in this shadowed area of the city seemed even more surreal than it should.  Kiriko moved stiffly all the way, even when she waved to a local or two she knew well. When they finally reached their destination, Kiriko almost cried out in relief. “Sensei!” she called her mentor loudly to cover that urge.  “What—oh.” He went as stiff as Kiriko had been. “This . . . honorable guest here must be Nova-san?”  “Yes. Nova-san, this is my mentor, the owner of this atelier. Please take a seat; you need to take your shoes off first.”  As the foreign woman did so, Kiriko went around the atelier, closing all the shutters and covering the opaque glass on the door with a cloth. Her mentor tried to catch her, failed, shifted his weight on his feet, and flailed a little. Finally, he almost twitched and said, “I should offer tea!”  “Sensei, stop being nervous,” his apprentice scolded him, forgetting her own previous stiff walk. “And look.”  She’d brought a device which emitted light that had the same characteristics as natural sunlight. Now with Nova sitting on a flat cushion, Kiriko aimed the light to the surface of the low table beside the foreigner. Immediately her mentor saw what this was all about.  “Oh,” he said.  “She has an ancestor from this island. I heard that once you leave this island the colors start to fade, I didn’t know it could be preserved like this.”  “Me, either. But this is jewel-beetle, right? Maybe not entirely impossible.”  “Okay, you two, now tell me what is going on.” Nova looked as uncomfortable as the two locals here had been a few moments ago.  Kiriko put away the lighting device and switched on the ordinary bulbs. “Your ancestor must have been a jewel-beetle colored person. Jewel-beetle people have strange properties. Have you seen the insects themselves?” Nova shook her head. “Well, they wear metallic colors that change with the angle, which keeps birds away. And the colors never fade even after the bug dies because they are not pigment, but come from the shell’s structure. That may be the reason your colors survived. Anyway, most of the colors of the islanders only have any kind of effect—physically and mentally—on the bearer themselves. But very few colors can affect others. Jewel-beetle, and Madam’s enamel, are two of these very few. Though enamel is more prone to taking, than giving.”  Kiriko was speaking slowly, but even locals would have trouble understanding all of this instantly. But Nova was a researcher of this island; after a quick thinking, she said, “So my color, even though I never knew it existed, did some harm to her.”  “Your colors are weak, but sharing a bath, with substances we composed for her, worked almost magically, I think, invading her native color.” Kiriko knelt beside the woman. “If you let us take samples of your skin, we might be able to find a pattern that would cure Madam Enamel.”  “Do it, then.” Nova looked sharply up at the craftspersons. “Do it, by all means. Cure her. I don’t care what it takes out of me.”  First they had to find a silent pattern that had caused the malfunction in Madam, and then construct a new one which would offset the effect of it, considering at the same time the substances they used for the original crack-remedy bath treatment. They went through everything on Nova, and hours later, found a part of membrane deep inside her eyelid that spread an almost-invisible pattern that seemed to click. Kiriko scratched the part off and looked into it with a microscope to be sure, and then started on combinations of patterns that would counterwork Nova’s effect on Madam. Kiriko’s mentor gave Nova eye drop medicine, and they made her stay at their atelier while her eye cured to some extent.  And so by the morning, they had a pattern to, hopefully, heal Madam Enamel.  Nova (and the craftspersons) had forgotten to inform her hotel that she was staying out, so in the morning the foreigner had to call in and then go back to the place very quickly. “Let me know how it goes. As soon as you find out,” she said, as Kiriko saw her off at an intersection to the High Street.  They parted, and Kiriko started jogging towards the western quarters of the city. At the door of the teahouse Peacock was waiting for her. “Your boss is already inside.”  “He’s not my boss—how is Madam?”  “Resting. Not worse, not better.”  The teahouse was closed. Kiriko walked through the eerily quiet place, though she soon heard commotion in the backyard. There, Kiriko’s mentor was already drawing on Madam’s arms. Kiriko took her coat off and dropped her bag onto the floor and started doing the same.  As soon as she spread the latest remedy-pattern over Madam’s skin, Kiriko felt the current shift under her fingers. This was going to work. This was going to be okay. She almost let a sigh of relief slip, stopped herself with an effort. And felt her mentor feeling the same relief.  She spared one split second and smiled at the few staff who were holding their breath around the two craftspersons. They smiled and nodded back, then resumed helping them.  Of course—there were other issues than the patient herself, to be addressed later. They’d both tried to brush that thought off, or to hold on to the possibility that maybe nothing would go into that direction this once. But the next day, the same officer who had come to notify them of Madam being held in custody, stood at their door looking almost sorry. “We’d just pass on something like this between locals. But this time, a foreigner is involved.”  “But we didn’t do anything to Nova-san.”  “She didn’t get back to the hotel one night, came back the next morning with scratches all over and a patterned eye patch. We cannot call that ‘didn’t do anything.’”  When they got to the Officers’ Station, Madam Enamel was there, too, with a girl with pastel-colored cotton-candy hair they remembered from the previous day accompanying her. The enamel woman looked frail, pale in her own way, but was sitting straight on the cushioned chair.  “Madam isn’t properly well! How dare you drag her here?” Kiriko’s mentor hissed furiously.  “Craftsperson, easy.” Madam Enamel raised her hand. “I told them I wanted to be here and give accounts of the incident myself. I asked them, I wanted to be in the same room as you two, so that you can do whatever you need to when something goes wrong with me.” At this stage, it was no use pretending that the atelier had nothing to do with Madam’s condition or its treatment. “They don’t usually listen to this kind of request, but they made this exception for me. That much, I should be grateful.”  He backed off, still fuming. Kiriko looked around. “Where is Nova-san?”  “She is being asked to talk in a separate room, of course.”  The two craftspersons took their seats on the other side of the table from Madam. “And what are we charged for, exactly?” he asked.  “What, exactly, did you do to the foreigner? She wouldn’t talk.”  “That’s because there’s nothing to talk about. Maybe she fell off a stair or something, nothing to do with any of us,” Madam said.  “Then why wouldn’t she just say so?”  “Maybe she doesn’t understand you.”  “Madam,” the officer frowned as they said, “we know she likes you. And it’s good to see a foreigner liking one of us that way. But if there was a crime involving a foreigner, we must know.”  “But there’s no crime committed! And the foreigner herself doesn’t recognize one, does she?”  The officer looked very unhappy at that. For a moment, Kiriko thought they might win—except there was no win or lose, not really—only their atelier’s future poised on the officer’s finger.  They said, “So she just fell off a stair. But what about your disease?”  “What about it?”  “You obviously got ill right after being caught with the foreigner. Or maybe after that bath that smelled a bit funny. We do know that you had dealings with the atelier, at around the same time. You’d had no conditions before then, we heard?”  Still crack-strewn, Madam Enamel stared at the officer. The progress had stopped entirely, malfunction of Madam’s systems thoroughly eliminated, but there was no hiding the cracks now—once this kind of change happened, there was no turning back, just like her plum color itself, ripening. They held their eyes that way for some time, while the two craftspersons could do nothing but just sit there, finding even simple breathing hard, so hard. “This has nothing to do with the situation here,” the enamel woman finally said, her voice even—too much so.  “We can investigate, you see. You cannot go on without knowing the cause. What if it is contagious? You may be exposing your fellow islanders to danger, even as we speak now.”  “How dare you—” Her cotton candy subordinate, who had been growing impatient by the minute, was about to bang her fists on the table, but Madam Enamel stopped her with a hand.  “Candy, no,” she said and shook her head. Candy breathed deep but then sprang to her feet as if to shake fume off, went to stand facing the mirrored wall.  “What is it, Madam Enamel?” the officer continued. “If you really have no idea, you should consider closing down your place, at least until we have done proper investigation and everybody knows what caused it. If it’s to do with the foreign researcher, either something she did to you or she brought into our country, we must expel her from the island, never admit her any future entrance. You should never see her again. Or,” they paused, just a fraction too long to be for breathing, “if that’s the atelier’s fault, we can just order them to discontinue their trade.”  Madam lifted her head and looked to the officer. Candy turned around.  “Look, Madam Enamel,” said the officer, slowly, as if Madam wasn’t quite getting them. “Tell us the truth. What do you owe these colorless laborers, anyway?”  There. The two craftspersons had known it would come to this sooner or later, all along. Yes—as long as the colorless were to blame, everything would be fine. Nova would get to stay on the island, keep on with her research, stay with Madam; Madam would be able to resume her position as proprietor as soon as she was well enough. The government would have no dispute with the continent.  Happy ending to all.  Madam Enamel looked at Kiriko and her mentor. Kiriko stared back, sending no message through that one moment of eye contact. Because after all, what did Madam owe them, really? Just a sorry end of lizard tail cut, and discarded; there were enough colorless craftspersons in the city, to replace these two.  Madam Enamel looked back at the officer. “Sorry, I think I’ve been mistaken a few moments ago.”  “Okay, Madam. Tell us.”  “It’s the foreigner. She is a descendant of islanders, and has properties that can be harmful to me.”  “What?” the officer came to stand closer to her, their hands on the table. “Look, you don’t have to—”  “I don’t have to what? These two craftspersons did study the foreigner. They can give you the data as proofs. Or you can do it all over again, hurting her even more, and get into more trouble with the continent. And oh, I can tell there are more officers watching us behind, let me see, that mirror maybe?” She pointed at the wall and Candy jumped away from it with a small cry. “Surely you’re recording this. You cannot erase my testimony here. Right?”  The officer stood back up straight. “Are you sure—”  “I am.” Madam stood up. Candy came to support her. “The foreign researcher is harmful only to me, or to enamel people. But I haven’t seen any other enamel than me in the city, so. I would not say this is contagious.” She shrugged like a foreigner. “Can we all go home now?”  She stood tall, and nobody would have guessed she’d been down with illness only a day ago. Her eyes were hard. The officer swallowed, before they stepped back to let her pass.  “Madam,” Kiriko said, when they were back in the western end of the city. “Madam.” But she didn’t know how she could continue.  Madam Enamel stopped there, and turned, to face the craftspersons. She looked both of them in the eye, one of them after the other, and then touched Kiriko’s shoulder. “I remember,” she said. “I was as young as you are now, I think, when I started working in this area. A lot older than you two when I finally established my own place. I worked hard. Real hard.”  A wind blew. Candy brushed a strand of Madam’s tree-bark hair out of her face, and Madam smiled at her employee.  “You, too, might want to have your own place, some day,” Madam said to Candy. Candy shrugged and they both giggled. Then Madam turned back to the craftspersons. “I know you are working hard. How can I take that away from you? Nova would understand. She is a foreigner, she’ll have a chance to resume her research some time. But if you lose what you have now, you’ll never get it back again . . . sorry, but that’s true, I think.”  Kiriko’s mentor nodded. “Thank you. There in the station, I thought I lost my atelier forever.”  Kiriko stood there, silent. She knew she should be grateful and say it, too. But—but what? This was the best possible outcome. “But you two. You two might not see each other again.” Her voice shook, embarrassing her with her own naïveté.  “Again, she is a foreigner. I am a colorful. We’ll find our way to each other in time.”  Kiriko looked down and couldn’t lift her head back up. When she was old enough, if there ever came a time that she had to choose between someone else’s future and her mentor, would she ever be able to make the same choice?  “I do everything to protect my place. You to protect your crafts. Don’t let that make you feel bad, Craftsperson.”  Only when Madam was well away from them, Kiriko looked up. The world was blurry. Her mentor nudged her. “Let’s get home. I’m starving,” he said.  Kiriko nodded. In the weeks to come, they’d hear the rumor that Madam Enamel turned into Madam Fallen Fruit. That sounded sexy, in a way foreigners and west-loitering locals liked. But Madam Enamel was lost forever, and even after years, Kiriko would mourn for that loss.", "text": "9380 words, novelette\nRipen\nKiriko was having a hard time keeping her eyes off the clutch bag the client had brought with her. The client, a woman of about forty—or maybe fifty? it was hard to tell—sat on a flat cushion placed at the lip of the raised floor of the atelier’s reception, crossing and uncrossing her legs in a sluggish manner. “I really cannot believe there’s any place in this city that has no chair,” the woman said, for the fourth or fifth time. “This is ridiculous.”\n“Such a beautiful bag you have,” Kiriko had stopped apologizing for the lack of chairs after the second time. She herself was standing on the earthen floor that ran, right beside the wall-less reception room, across the entire length of the building. “That must be the work of a very good craftsperson. I haven’t seen some of the methods adopted there, though.” It was too small for Kiriko’s liking, of course, who wanted bags to be just as huge as they could be. But this client must have only carried a mirror, and maybe a cigarette box and a book of matches, at most. Rectangle shaped, its lid flipped over the entire length and width of the bag, and the inside was apparently lined with silk, which was embroidered with natural-color silk thread in a minute pattern; the whole lining seemed to ripple with shimmers to a casual eye. Every other surface was covered with more colored embroidery and lace, with beads threaded here and there, surrounding cabochons of enamel—which looked a lot like the client’s own skin.\nThe client woman almost snorted. “Made abroad, of course. A gift from a foreigner. This subtle yet wild demonstration of pattern and color is nothing the craftspersons of this country can even dream of.”\nAll right, then, go abroad and get the fix you want overseas. Kiriko downed the words with lukewarm tea, and cocked her head just a little, to hear the noise from outside better. Did she just hear him say hi to the neighbors? Yes—the sliding door burst open with a loud clang, the glass tiles on its upper half rattled badly in their grids. “No rice straw, can you believe? They burned them all!” Kiriko’s mentor, the owner of this atelier, threw an empty cloth bag towards the reception floor. “I made them promise me their next batch—oh, hello, good day.”\nThe bag he’d thrown had bounced off the client’s shoulder and landed on her own bag. “What the—” She flicked the coarse bag off her smaller, elaborate one, as if the coarse thing could somehow contaminate her spotless possession. “I . . . ” She glared at the young man who’d just assaulted her. “I heard this is the best place in the city, for crafts related to human skin! How can a boy like you be the best? Are you even good?”\nHe shrugged. “They say I am. I myself never said I am. What service do you seek here?”\nFor a moment the woman sat there glaring at him, and Kiriko thought she’d walk out right through the door. But then she shook her head and said, “I have heard. About those . . . surgeries.”\nHer mentor eyed at Kiriko, who too was feeling the wrong turn coming. “Surgeries,” he echoed.\n“I see a lot of foreigners, you see. Part of my job.” She’d introduced herself as the proprietor of one of the teahouses in the High District—the area which expanded just off the seafront to serve, entertain and accommodate tourists from abroad. This particular woman’s place wasn’t actually on the High Street, the spine of the High District and the center of this country’s tourism, but in the western patch of the District, where things were slightly cheaper. She did seem to earn enough for her fancy one-piece dress, her soft- and warm-looking scarf, her high-heeled yet miraculously comfortable-looking shoes . . . or were they all gifts from her patrons?\n“They tell me and my girls and boys how rare, how beautiful we are, but very often, that talk slips towards the”—she looked around and lowered her voice—“‘cosmetics’ they have overseas, as they get more and more drunk. Our government discourages them to talk about things like those colors they use to hide circles under the eye, or acne spots. Or, even, just to change the color of your eyelid!” She sat back and crossed her legs. “You know, tourists do like talking about those things, they love it when we go, ‘oh, how sensational!’ even though we are hearing it for the hundredth time.”\nKiriko’s mentor retrieved the disrespected cloth bag and fidgeted with it. Of course, they had heard stories about those obscene, crazy stuff. Kiriko had recently met in a lavatory of a souvenir shop a woman who was drawing eyebrows with a soft pencil. That woman had let Kiriko have a used, very short pencil of the same kind. She and her mentor had spent days taking that thing apart. “And . . . surgeries?” he said, reluctantly.\n“There are many, many, they say! Ways to alter your appearance!” the woman exclaimed, as if merely mentioning it was off-limits. “But the thing I’m interested in—I heard they have something to inject into human skin, so the skin stays nice and smooth, even as you age? Or the thing where you transplant healthy skin onto a different part? I need something like that.”\nThe two young craftspersons looked at each other, then back at the client. “But your skin is impeccable, Madam.”\nThe woman’s skin was mostly the color of ripe plum, with the soft sheen of enamel thinly applied all over her surface. Here and there—like inside her eyelids or the skin beneath her nails—the mellow yellow of the fruit could be seen. People said her skin used to be fresh green when she was the age of Kiriko now, twenty years or more ago. Her entire skin had ripened, they’d say, the way a young, hard, and sour meat turned to the sweet, juicy thing.\n“Impeccable. That’s the way it should be, of course,” she said. “But the thing about age. Look.”\nThe woman tucked her hard-bark brown hair away from her neck, and there, the two could see: a crack. Underneath it the color was one of fruit gone foul.\n“I have several more like this, in parts where I cannot show you now. And these lines are spreading, I can see. I need a way to stop it.”\nKiriko was doing everything she could to not touch the cracked skin. “This looks pretty, too, though. When you’re full of it, it’ll be a totally new pattern!”\nThe woman released her hair from her grip and looked at Kiriko side-eye. “You’d never understand.”\nOf course she wouldn’t. Kiriko’s—and her mentor’s, for that matter—skin, hair, teeth, and bones were all just like foreigners’: plain. That was why she worked as a craftsperson in the first place. Those without a color or pattern on their skin had no place in the tourism industry of this country, where people like this client earned foreign currency for the island by showing off themselves to the sightseers. Kiriko had long been used to this kind of casual insult. But her mentor said, “No, she wouldn’t. We wouldn’t. Which maybe means we wouldn’t feel like helping you, Madam. Thanks for your visit, sorry for the trouble.”\nThe woman’s plum deepened, to a color closer to the one inside her crack. “I’m going to lose my teahouse if I let my color spoil!”\n“And we’re losing a business opportunity here just for what we are, sorry we could not come to an agreement.”\nA few seconds passed in an uncomfortable silence. Kiriko’s mentor stood there tall, his shoulders square. But Kiriko didn’t need his protection, really. She, or they, needed money. “Sensei—”\nBut then the enamel woman inhaled and exhaled. She was the oldest person here right now; she took back control of her emotions sooner than the atelier’s young owner. “Fine. Well. Those small pieces of paper stacked right there, by the way?” She was pointing at the finished products stored temporarily in a corner of the reception. “Those are remedy transfer-print sheets, aren’t they? One of my neighbors uses it for his allergy. I saw him put one to his lower eyelid, transfer the pattern on the sheet to the membrane. He said it eases the itches and soreness he gets as allergic reactions.”\nThis is going to be bad, Kiriko thought. She could feel her mentor having the same thought, too.\n“You make things to transfer patterns onto human skin. How obscene, eh?”\nThe young man breathed in, and out. “Temporary. And just for a medical effect.”\n“But what if more people hear about it? Those folks like you born without colors and patterns on your skin, you can fake what you want on you, in theory. The one for my neighbor, it soon went away with enough of his tears, sure. But if you used a different kind of ink? If you applied it to some drier surface? Oh, so very appalled, I am, to imagine such a thing done to one of my girls and boys!” She placed her hands over her chest and shook herself. Kiriko almost laughed.\n“Madam, are you trying to blackmail us?” he said, and Kiriko could hear his temper sliding off to something different than anger.\n“No, young man, I am not. I am just trying to strike a deal.”\nKiriko’s mentor sat at the low table of their reception, drumming his finger on its surface, looking grim.\nThe apprentice placed a tray with a teapot and cups on the floor near him and sat down herself. “She did offer a nice sum of money, at the very least. You can buy me a bottle of fancy ink if that makes you feel any better.”\n“Why do you think that would make me feel any better? What do you know about these surgeries?”\nNot much, really. Changing your complexion was illegal in this country. Even if the color to be applied came from the same person’s skin. That would probably impose the patient a large sum of fine, and . . . the people who performed this surgery, putting a knife into an allegedly perfect skin? The government would never let them work as craftspersons again. Kiriko shrugged like a foreigner, making him smile a little. “You?”\nHe shook his head. “Even if we, like, actually get to watch those surgeries, or read about their procedure details, I’m sure they are for the clinic, not for us, common folk-remedy place. I know she came here because she cannot possibly ask the government-run clinic, but here we don’t have adequate equipment for that. Not even injection needles!”\nOf course—neither of them had any kind of certificate or license or whatever, to do anything, that would involve actually slicing into human skin. This place was called an atelier because they put out patterned artifacts like cloths for apparel or furnishings, carved wood boards for furniture and home interior, et cetera, et cetera. But that was only one part of what these two craftspersons did. They tended to small discomfort of human body, like minor yet persistent headache, inefficient digestive system, regular cases of dizziness and so on, with their only weapon—the patterns they drew.\nTo them, currents of fluid within human body, the way muscles flowed, and the air glided over them, were just another kind of pattern. The two craftspersons called these “silent” patterns, as opposed to plainly visible, real lines and colors; everything, including human body parts, had a pattern to it, the curls of air and swirls of energy around it, marking its place in the world. Their treatment was conducted a lot of the time by finding another silent pattern that could affect the existing one and applying it over the affected area, to adjust the currents that had gone just a little bit amiss, correcting blood flow to make the body work more efficiently, or let the patient move their muscle more freely. Some patterns worked generally, while others had to be customized to the patient and their condition.\nBut they couldn’t treat diseases that were too severe, or perform any kind of surgical operation. And here, in this country where altering your complexions was a crime, of course they couldn’t speak openly of what they did behind their doors with screens shut, as they often had to draw patterns directly on human skin, which was regarded highly inappropriate.\n“Couldn’t we just make a pigment portion and fill the cracks with it? I’m sure that’s what she expects, anyway.”\n“I think she wants permanent, and we cannot just fill a human skin with foreign matter, even if she’s an enamel.” He grinned. “Even if she loves foreign stuff.”\nHis apprentice ignored this. “If we make—even if we can—something that changes the color there forever, once we do that the city will no longer overlook what we do.”\n“But how long, exactly, is forever?”\n“Huh?”\nHe took his cup up off the tray. “With the remedy transfer sheet for allergy, the pattern stays there only for a few minutes. We have those sheets with ink that remains on the skin for a few hours, for cases where slowness and steadiness are more important. Stretch that procedure time little by little, and then . . . ”\n“Sensei,” Kiriko pointed her finger at her mentor, “that is a quibble, and a feeble one at that.”\n“Oh come on, a few days cannot possibly be that huge a trouble. Even though that’s far longer than any we’ve made here.”\nKiriko considered this. “A few days . . . ” she whispered. “Days . . . ”\n“Right. Days.”\nShe blinked. “So she’ll have to reapply the pigment every few days. The cracks are small but slowly spreading? Usual transfer method won’t be much convenient here. And she must be very good with brushes to do it in a way people cannot tell there’s been some tampering . . . ”\n“Oh, I don’t like that word.”\n“Wait. Wait, but if the pigment is manipulated in a way it will attach itself to certain places . . . ”\nHer mentor sighed. “Finally. How long did it take for you to get there?”\nShe glared at him. “We’ll still have to find a way to confect this pigment—what substance can be used, to closely stick to human skin, remain there a few days, and that would do no harm to the bearer.”\n“Step by step, my dear apprentice,” he said, touching his lips to the cup of hot tea. “One problem at a time.”\nAt least the client probably wasn’t as heartless as she’d seemed. She placed some ordinary orders too, a patterned cloth for a sofa cover and garlands to be installed around the ceiling light, among other smaller things. Kiriko went to deliver the crafts, and also to take a sample of the proprietor’s skin. While repeat tourists who were more or less familiar with the country dominated this area, a lot of islanders—though only colorful ones—loitered and enjoyed themselves, too. Not the cleanest or safest part of the city, but many of the places around here had a distinct taste for fancy stuff and paid the atelier well.\nKiriko entered, careful not to draw the guests’ attention, into the dimly-lit hall of Madam Enamel’s teahouse. “Delivery for Madam,” she whispered to one of the waiters standing near the door.\n“Been expecting you, Craftsperson. This way.”\nThe higher parts of the windows in the hall were filled with a cheap kind of stained glass—not the real, super-luxurious stuff seen around the most expensive area of this country. There was only one proper chandelier, and other lights that hung from the ceiling were simple gas-mantle lamps, some with old garlands swinging around them. Still, Kiriko could see the labor and money the proprietor put into this place. After a short walk along a narrow corridor on the other side of a small door, the waiter opened another of the same size for Kiriko, behind which the woman sat at a desk with reading glasses over her nose. “Hello Craftsgirl,” the woman said, slightly squinting. “Come here and let me see those best pretties of the city.”\nTogether they spread the delivered goods. The woman did seem to care a lot about these things unlike other clients around this area, who’d just order a thing, get it delivered, and then forget all about it once it got installed in their shop; she turned the goods around, checking every surface, trying the feels of every pattern to the touch.\n“I don’t know why, but I really like these things. How different are they, from the stuff other places put out? Maybe you really are the best.”\nKiriko and her mentor did choose those patterns which would soothe people’s mind, by relaxing muscles around the eye and lifting some tension off a certain area of the brain. “Thank you,” Kiriko only said.\n“So?” The woman sat back in her chair. “Have you figured out anything . . . for me?”\nJust then the waiter came back with cups of tea and a plate of confectionary. Kiriko squeaked silently at the beauty of the ridiculously small yet elaborately shaped sweet pieces, and the woman watched her eat for a while.\n“You really aren’t that different from my girls.” To Kiriko’s surprise, the woman was smiling.\nKiriko swallowed a bite, which was almost a whole of one very fragrant cake. “I am so very different from them, I am totally colorless.”\n“That is quite extraordinary in itself, indeed, you know?”\n“Not for the tourists.” Kiriko listened to check if no one was within the earshot, and then said: “I need samples. Of the inside of your crack.”\n“Does it hurt?”\n“It may hurt roughly to the same extent as when you snap a rubber band against your skin. If that’s too much . . . ”\n“No, that’s fine. Anything is fine, actually, as long as there’s something you can do.”\nKiriko scraped bits of skin and membrane off the woman, closed the caps tight on the sample vials. The sample wasn’t just for color reference. Sometimes silent patterns could be seen easily only if she strained her consciousness enough to channel through. Other times, though, they could be hard for naked craftsperson eyes to see. These could be examined with good microscopes customized by the atelier over the years, which helped taking elements apart through the lenses.\nWhen she was done, Kiriko slurped up the last of her tea. “We’ll still need some time,” she said, as she stood up. “We’ll get back to you as soon as we can.”\nThe woman nodded. “Take those sweets. Does your mentor eat those, too? Or prefer something that goes better with alcohol?”\n“He likes sweets, thank you!”\nThe woman saw Kiriko off to the exit. Along the way, the proprietor exchanged a few words with each of the girls and boys she encountered, and the interaction seemed kind, or even affectionate, perhaps. “Are you sure you don’t need an escort out of this part of town?” she said when they were at the door.\nKiriko nodded. “It’s not so late, and I do know safer paths.”\n“Take care, then. Good night.”\n“Good night, Madam.”\n“I like her,” Kiriko said as soon as she was inside the atelier.\nHer mentor frowned, said nothing.\n“Look, she gave us some sweet things.”\n“Oh okay, maybe she’s nice.”\n“And I mean, she’s a bitch, all right, but she does seem to care for her place and her employees. I think she needs to remain enamel that badly because she needs to keep her place nice and popular, for her employees rather than for herself.”\nHe opened the wrapping cloth and picked up one of the tiny cakes. “You do realize that you tend to attach yourself to any kind of client, don’t you?”\nShe almost pouted and stopped herself. “She likes our crafts!”\nHe popped the cake into his large mouth and chewed, and looked very happy.\n“See? Nice. And anyway, every client has their own reason. We’re here to help them.”\nHe swallowed loudly and sighed contentedly. “Should have prepared some bitter tea first. Let’s get working on the samples now.”\nKiriko never hung around in the High District without very good reasons. She always felt nervous around the foreigners; she’d had no education on the official language, as the government deemed it a waste of resources for the colorless folks who had no direct business with the tourists; and most of the time, she didn’t get their gestures. Shrugging was one of the first few she’d understood after she first moved to the city from her village in the mountains, and sometimes she even used it, because there was no gesture native to this country that could convey what it did. Then, not all the foreigners shrugged, them coming from many different parts of the continent. She just didn’t like the feeling of being at a loss.\nShe walked through one of the narrower avenues on the eastern side of the High District, where many inns stood between the High Street and the waterfront. Accommodation was cheaper here than the hotels along the coastline. There were a few cafes and teahouses, not the fancy kind like in the west but those which simply served just-okay coffee. On the terrace of one of these places, a foreign woman was seated, looking down at her coffee beside which the milk and sugar sat untouched.\nIt was a bit chilly this morning, and the woman was the only patron on the terrace. Just as Kiriko had hoped. “Nova-san,” she said, tasting the unfamiliar pronunciation of the woman’s name at the edge of her lips. “Good day.”\nThe woman looked up from her cup. “Hello Craftsperson Kiriko-san!” She beamed, engaging in the local language of this island for Kiriko’s sake. “How nice to see you! Come have a seat!”\nNova ordered black tea for Kiriko. (This place didn’t have green tea, and black was slightly better than coffee for the craftsperson.) Her hair was black, just like Kiriko’s, but it glowed as if there was a layer of faint light over it; Kiriko had heard foreigners took very good care of their own conditions, not quite the way the islanders did. And she was almost as deeply-tanned as Kiriko’s mentor, while Kiriko herself was pale and her skin hated the sun. Something glimmered on the woman’s eyelids, and her peridot earrings went very well with her skin and also with those golden shimmers around her eyes. But it wasn’t these carefully aligned looks that attracted Kiriko; Nova was the first foreigner who talked to Kiriko in the local language from the start, instead of the official language.\nAnd of course, there was that eyebrow-pencil thing. “I want to thank you again,” Kiriko said, wanting to shift to more formal speech but afraid the foreigner might not understand her then. “It was such fun to take that pencil apart.”\n“Good to hear! You didn’t get into trouble? We are told not to talk too much about cosmetics, before we depart the continent.”\n“Not at all. We are careful. And . . . we hate to take advantage of your kindness, but . . . hope you don’t mind telling me more about how you paint your face? What you use, and how you decide the appropriate amount and such.”\n“You want to know more about what we do? How diligent!”\n“May I see that thing on your eyelid? Is that a pencil, too?”\nNova winked. “This? No, this comes from a palette.”\n“Palette!” Kiriko almost squeaked.\n“Yes, a tiny palette. I can show you, but is it okay to do that here? Isn’t that regarded obscene?”\nKiriko’s shoulders slumped down. “Yes. That would attract a lot of unwanted attention.”\n“Strange people, you all. But so are we, in your eyes.” The foreign woman laughed just a little. “Any place? I don’t think I can afford a space at that luxurious hotel down the coastline.”\nKiriko considered this. “Oh. Maybe I know a place.” She considered it again. “Maybe?”\nLike many of the teahouses in the west, Madam Enamel’s place offered a quiet space at the back for those who needed privacy. Kiriko didn’t know the reservation cost, but as she had hoped, Madam Enamel said she wouldn’t charge for this particular case.\n“I still don’t see how a foreigner can help with this,” the woman said. But Kiriko could hear excitement in her voice.\n“Thank you for your cooperation, Madam. Nova-san, after you, if you please.”\nThe foreign woman said quick thanks to the proprietor in the local language, and Kiriko saw the enamel woman blush, her ripe plum cheeks turning to a warmer color. One of the waiting boys escorted Kiriko and Nova, an adolescent with peacock smudges on his face, one of his eyes amber. “Green tea is free of charge, Craftsperson,” he said to Kiriko. “What can we offer your honorable company here? We do serve alcohol, too.”\nNova looked at the menu and ordered a few things, including small cakes for herself and Kiriko, too. “Can you even read our language?” Kiriko asked.\n“Some. Not everything. Your colors are beautiful, you look like you come from a myth,” Nova said, the latter sentence to the waiter.\nHis ears turned pink. “Thank you. Oh, it feels so much better when a guest compliments in our own language, if I may say so.”\n“Does it, now? Then please send my regards to your proprietor. Her skin is perfect. I would like to have my nails enameled in that color in her honor, if that’s not an obscene thing to say.”\n“It is not. She would be very pleased. If you’d excuse me.”\nAfter he left Kiriko said, “You should tell that to Madam in person. And I think the enamel color would go very well with your tan color.”\n“Thank you, Kiriko-san. You are beautiful, too, don’t forget. The way your eyes twinkle when you talk about crafts, the way your jaws are set when you are focused.”\nKiriko swallowed loudly. “Do you say that to everyone?”\n“Mm? Maybe. But everyone I like is beautiful in their own way, and I think it’s important to tell them so. Let’s get to work?”\nThe craftsperson nodded and started going through the cosmetics purse Nova carried with her. She touched everything, one after another, trying the various textures. Powder, paste, liquid that seeped onto the brush when you rotated the stem . . . her mentor would love this brush. These things wouldn’t last a day, the bearer would even have to retouch the colors on her face from time to time! How strange, these foreign customs. Some of the things even included colorant that she had never seen—she swallowed, braced herself, and bored her consciousness into these.\nHer plan was to grasp how these cosmetic things were made—how the substances worked, the percentage of those substances contained, the way these things mingled—from the silent patterns those substances emitted and the way they moved around each other. She also copied the names of the chemicals, with Nova’s help on the language, so that she could later look them up; once she learned the precise description of the substance’s property, she’d get to combine the knowledge with the patterns she felt from these cosmetic products, and then she could start probing for other ways of using these substances.\n“Thank you,” she said after she scribbled everything she could as fast as possible. “Sorry to have kept you waiting.”\n“No problem at all. This place is lovely. Wasn’t in the travel guidebook.”\n“Not the best part of this country that the government wants to boast about. And foreigners must be careful if they need to walk around this area late at night.”\nTogether they left the place, and like the last time the proprietor saw them off at the door. She bowed deeper and longer than the last time, though. Maybe it was just because Nova was a foreigner. But the waiters and waitresses, too, looked sad to see Nova leave.\n“I hope you’ll visit us again soon,” the proprietor said, as she handed a business card to the foreign woman.\n“I will, thank you,” replied Nova, touching Madam’s hand lightly as she accepted the card.\n“So this Nova person. What exactly does she do?” Kiriko’s mentor asked as the two craftspersons started their work in their lab. “Is she on a mission or something? An ambassador?”\n“She is a researcher. She said she’s here to study our culture, but not necessarily the colorful folks.”\n“What is there to study at all, apart from the colors of the tourism workers?”\n“She says there’s always something to learn as long as people live there. And that the hierarchy of the people is very peculiar here.”\nHer mentor sat back and looked away from the microscope for once. “But isn’t that just obvious? The colorful rule. The colorless obey.”\n“On the continent there are different criteria for that. Because no colorful folks.”\nHe shook his head and looked back down the lenses. Then they started their long discussion—how could they stretch the flow of the silent pattern inside Madam’s cracks so that it’d welcome the one in the pigment portion they concocted? Was there a way to enhance the affinity of it all, or could they just draw a straight, taut line between them, so that no other thing would even think of intervening?\nAfter hours of yeses and a lot of noes and buts, they agreed on a configuration. Her mentor drew the tiniest reproduction of the silent pattern found inside Madam’s crack, on an impossibly thin, almost see-through piece of soft paper, which took hours of making itself. They wrapped the dried ingredients with the paper and let the colorant absorb the pattern from inside. Madam Enamel could put one wrapped potion in her bath, immerse herself in the solution, and let the pigment settle in her cracks, drawn in by its pattern twin. The fibers of the paper would land around the affected areas, too, working for better smoothness. It would require a slightly-acidic bath to get rid of it.\n“I love it,” the woman said on the phone, after the first try. “You cannot see the cracks unless you look very, very carefully. And that’s only if you know what to look for. And it also improves the way my skin feels as a whole. This is perfect.”\nKiriko sighed into the receiver, relieved. “Good to hear that, Madam. But please refrain from overusing it? We’ve been very careful, but this is the first time we made something like this, so.”\n“Of course. I’ll call when I need the second batch.”\nKiriko grinned at her mentor as she put down the receiver. He shrugged, then laughed and started humming to himself. Kiriko soon joined in the tune. A moment like this, it was one of the best things about this trade.\nBut when they did hear about her again, the words didn’t come from the woman herself. It came in the form of an officer in uniform. “Craftspersons,” they said, when Kiriko opened the door. “If you please.”\nMadam Enamel looked exhausted behind the transparent wall, but that didn’t explain the cracks that had spread, covering most of her neck and invading her jawline. Kiriko had imagined the cracks to be a beautiful, treelike pattern if and when they spread, but something was wrong with the actual thing in front of her now. The color, for instance, wasn’t the bad fruit they’d seen when the woman first visited their place. It had a strange tinge of green to it. And the way it progressed . . . there were jumps and starts here and there, instead of branches going forward in the fan-form, using the momentum of its own growth; as if some unknown force tried to rip the skin randomly.\n“One of the places in our area got suspended for being a site matching the locals to the tourists who need . . . special services,” Madam Enamel said on the other half of the cubicle, behind the see-through wall. “Many more places got raided, and I was caught while I was having a bath with Nova-san. Not the best timing, is it?”\nKiriko raised her brows. “You were having a bath with Nova-san?”\n“It wasn’t like I was selling myself to a foreign stranger. And . . . ” She rolled her eyes towards the officer who was standing behind her, who couldn’t see her doing it. “She explained that we are friends, to the authority, that she had brought in the bath bomb for the two of us.”\n“Then what happened to your skin?”\n“I’ve no idea. It never happened before this time, the . . . thing had worked so well so far.” She blinked, waiting for a question from the officer at attention; they didn’t seem to have one—apparently.\n“Do you know when you’re getting out?” asked Kiriko.\nThe woman looked uneasy at this. “No. Nova is doing what she can to prove that no money was exchanged between us. The government hates us, don’t they? Those of us who don’t do business exclusively for rich foreigners but serve our fellow locals, too.”\nKiriko massaged her brow with a finger. “We’d like to look more closely . . . at your condition. Did you put anything in your bath along with the bath bomb?” She hastily added, “I’m just curious.”\n“She added scented water. I think that is all.”\nOrdinary scented water shouldn’t have been able to change anything in the composition. At least not like this. “I’ll talk to Nova-san,” Kiriko said after a moment.\n“Please do. I—I hope I didn’t get her into too much trouble.” At that, her lips trembled, though just a little.\nThey couldn’t reach Nova very soon, though, as the foreigner was busy talking to the embassy and authority. Madam Enamel was released two days later. By the time she made it to the atelier, her steps were unsteady, her eyes murky, and there was another thin but unbreakable layer of sweat over her enamel. Kiriko piled cushions on the reception’s raised floor while the woman’s peacock subordinate and the owner of the atelier helped the woman up onto the makeshift cot.\n“What is this?” Kiriko’s mentor said, sounding bewildered. “This—this looks so much worse. The cracks are all over.”\nYes; the cracks had spread even wider, to the extent that there was no smooth surface on her visible now. Nova might have said something at the embassy, but more likely this was the reason the authority had decided to let her go. Kiriko dabbed at the woman’s forehead with a cloth of a heat-absorbing pattern. “Did we do this?” It hurt to word this question.\n“I don’t know.” His admission bit like a ragged edge of ice. “Let’s just do whatever we can, for now.”\nThe two craftspersons looked more closely at the cracks, and again, Kiriko was struck by how unnatural, the way all those lines ran. It felt very abrupt—a blister that erupted, swathing the area with its nasty fluid, not a seam gradually extending. Was this just a result of aging? Unlikely, though perhaps they should have taken it into account. It had to be solely the atelier’s fault.\nKiriko traced some of the cracks with her finger and quickly started adding a new pattern that would alleviate the wrongness of the one currently there. They’d discovered Kiriko was better at this even than her mentor—he had much wider knowledge on many things, on application of those things, and his thoroughness and meticulousness of the deployment was almost impeccable; but when it came to time-critical treatment or one-shot goes, Kiriko’s instinct bloomed under the pressure and she usually had control over the situation within minutes. But this . . . her hand steadied around the stem of the brush, as if she knew where the ink had to be; she had to do this, but how much would she be able to help, randomly groping for solution as she was?\n“This might hurt a little,” Kiriko’s mentor was saying to the woman, but there was no reply.\nHe spread thin acid over the woman’s enamel skin, to slow the cracks going farther. Kiriko started working on the worst-looking ones, those that were thicker, with that foul, greenish tinge, applying a dusty red colorant with bold yet precise strokes. Even as she did so, thread-thin lines were spreading around the bad ones, bypassing the acid. Soon her mentor started tending to these smaller ones.\nThe peacock boy rubbed his face fiercely. “What the hell did she do?”\n“It’s us,” the owner of the atelier told him. “Our doing.”\n“But she asked for it, didn’t she? We knew she’d do something stupid on herself. She’s been so obsessed with her own skin. Like that was all that there was keeping her house upright. But it was her. You know? It was she herself who bound that place in one, not just the skin—”\n“Shut up, we’ll apologize and hear you boast how much you love her later, but now make yourself useful and bring us washing water for the brushes.” For once, Kiriko’s mentor raised his voice. “The kitchen’s behind that door. There are small pots and buckets lying around.”\nAnd hours afterwards ticked away like that—two craftspersons drawing patterns as fast as they could on an immobilized woman, a peacock adolescent moving to-and-fro over the atelier floor. When the dawn arrived, the enamel woman’s breathing was finally even, and the three young people collapsed onto the reception floor around her.\nThey didn’t have beds for patients—that, too, was for the clinic—so after a few hours’ nap they wrapped up the woman and let the peacock boy and his coworkers carry her via a coach. The two craftspersons prepared emergency transfer-print sheets that the workers of the teahouse could apply on the woman if and when need be. And they started trying to figure out what had gone wrong, right away.\nBut they couldn’t see anything; they’d thoroughly examined every possibility, checked her allergic reactions and the state of the ingredients, the devices and equipment they’d used to prepare the treatment. Kiriko told him about the scented water that Nova had brought in. But with the configuration they’d made, and the fact that the foreigner herself had been in that water, too, that this scented water thing could do any harm to just Madam Enamel seemed unlikely.\n“We do have to check what that water is, anyway,” her mentor said over a hundredth cup of tea. “It is possible that there was something in that water, a substance that we have not heard of, that Madam can be allergic to.”\nKiriko sighed. “I’ll go talk to Nova-san.”\nThe foreign woman was almost equally disconcerted, if not unwell, when Kiriko finally managed to arrange a meeting. “I was waiting for her to call me when she was released,” she said as she let Kiriko into her hotel room.\nKiriko didn’t like going behind a closed door alone with a foreigner, not because of Nova, but of custom. But this was an emergency. “Madam was too ill to make a phone call,” Kiriko replied, and took a seat near the window. “We asked Peacock to let us know of any change of state, so she must be still resting.”\nThe foreign woman poured tea for Kiriko and herself. “How bad is it?”\n“We believe we managed to stop its progress. But to eliminate it entirely—we still aren’t sure if it’s a disease or some other kind of disturbance—we need to know exactly what is causing it.” Kiriko bit her lip for a second. “We heard you added scented water to the bath? Do you have its container with you still?”\n“No, sorry, it never occurred to me—” She shook her head. “Is it my fault?”\nShe hesitated one moment. “Our fault, more likely. Me and my mentor. Do you remember its maker or seller?”\n“Oh, I’ll ask my sister on the continent by phone, she gave me the thing. Let me see . . . ”\nNova went to the closet, came back with a datebook, sat down near the phone machine. Then she blinked hard down at the datebook, and sighed. “Kiriko-san, my old tired eyes need the light on. Can you close the curtains for me?”\n“Sure.” She stood and started drawing the curtains. Nova was fumbling for the light’s switch. Now just one part of window was still uncovered, and Kiriko reached out to shut it there, too. But then—\n“Wait,” Kiriko said, “don’t turn that light on.”\n“W-what?”\nA sliver of setting sun came through between the curtains, fell on the table beside the window, and bounced off the polished surface to dimly illuminate the foreigner’s face. Colors danced over her skin—green seemed to be dominant, but the sheen shifted with bronze, orange, and something that reminded of Madam’s color.\nJewel-beetle.\n“Nova-san, are your ancestors from this island?” Kiriko asked.\n“Oh, I haven’t mentioned that? Yes, but a very long time ago. That’s why I’m so much into this country.”\n“I see,” Kiriko said, her hand still hovering near the curtain. “I think now I know what caused Madam’s condition.”\nThe locals looked; of course, foreigners almost never wandered out to this part of the city. But Kiriko—of all people, that introvert, entirely-colorless craftsperson—leading a foreigner to the pattern atelier in this shadowed area of the city seemed even more surreal than it should.\nKiriko moved stiffly all the way, even when she waved to a local or two she knew well. When they finally reached their destination, Kiriko almost cried out in relief. “Sensei!” she called her mentor loudly to cover that urge.\n“What—oh.” He went as stiff as Kiriko had been. “This . . . honorable guest here must be Nova-san?”\n“Yes. Nova-san, this is my mentor, the owner of this atelier. Please take a seat; you need to take your shoes off first.”\nAs the foreign woman did so, Kiriko went around the atelier, closing all the shutters and covering the opaque glass on the door with a cloth. Her mentor tried to catch her, failed, shifted his weight on his feet, and flailed a little. Finally, he almost twitched and said, “I should offer tea!”\n“Sensei, stop being nervous,” his apprentice scolded him, forgetting her own previous stiff walk. “And look.”\nShe’d brought a device which emitted light that had the same characteristics as natural sunlight. Now with Nova sitting on a flat cushion, Kiriko aimed the light to the surface of the low table beside the foreigner. Immediately her mentor saw what this was all about.\n“Oh,” he said.\n“She has an ancestor from this island. I heard that once you leave this island the colors start to fade, I didn’t know it could be preserved like this.”\n“Me, either. But this is jewel-beetle, right? Maybe not entirely impossible.”\n“Okay, you two, now tell me what is going on.” Nova looked as uncomfortable as the two locals here had been a few moments ago.\nKiriko put away the lighting device and switched on the ordinary bulbs. “Your ancestor must have been a jewel-beetle colored person. Jewel-beetle people have strange properties. Have you seen the insects themselves?” Nova shook her head. “Well, they wear metallic colors that change with the angle, which keeps birds away. And the colors never fade even after the bug dies because they are not pigment, but come from the shell’s structure. That may be the reason your colors survived. Anyway, most of the colors of the islanders only have any kind of effect—physically and mentally—on the bearer themselves. But very few colors can affect others. Jewel-beetle, and Madam’s enamel, are two of these very few. Though enamel is more prone to taking, than giving.”\nKiriko was speaking slowly, but even locals would have trouble understanding all of this instantly. But Nova was a researcher of this island; after a quick thinking, she said, “So my color, even though I never knew it existed, did some harm to her.”\n“Your colors are weak, but sharing a bath, with substances we composed for her, worked almost magically, I think, invading her native color.” Kiriko knelt beside the woman. “If you let us take samples of your skin, we might be able to find a pattern that would cure Madam Enamel.”\n“Do it, then.” Nova looked sharply up at the craftspersons. “Do it, by all means. Cure her. I don’t care what it takes out of me.”\nFirst they had to find a silent pattern that had caused the malfunction in Madam, and then construct a new one which would offset the effect of it, considering at the same time the substances they used for the original crack-remedy bath treatment. They went through everything on Nova, and hours later, found a part of membrane deep inside her eyelid that spread an almost-invisible pattern that seemed to click. Kiriko scratched the part off and looked into it with a microscope to be sure, and then started on combinations of patterns that would counterwork Nova’s effect on Madam. Kiriko’s mentor gave Nova eye drop medicine, and they made her stay at their atelier while her eye cured to some extent.\nAnd so by the morning, they had a pattern to, hopefully, heal Madam Enamel.\nNova (and the craftspersons) had forgotten to inform her hotel that she was staying out, so in the morning the foreigner had to call in and then go back to the place very quickly. “Let me know how it goes. As soon as you find out,” she said, as Kiriko saw her off at an intersection to the High Street.\nThey parted, and Kiriko started jogging towards the western quarters of the city. At the door of the teahouse Peacock was waiting for her. “Your boss is already inside.”\n“He’s not my boss—how is Madam?”\n“Resting. Not worse, not better.”\nThe teahouse was closed. Kiriko walked through the eerily quiet place, though she soon heard commotion in the backyard. There, Kiriko’s mentor was already drawing on Madam’s arms. Kiriko took her coat off and dropped her bag onto the floor and started doing the same.\nAs soon as she spread the latest remedy-pattern over Madam’s skin, Kiriko felt the current shift under her fingers. This was going to work. This was going to be okay. She almost let a sigh of relief slip, stopped herself with an effort. And felt her mentor feeling the same relief.\nShe spared one split second and smiled at the few staff who were holding their breath around the two craftspersons. They smiled and nodded back, then resumed helping them.\nOf course—there were other issues than the patient herself, to be addressed later. They’d both tried to brush that thought off, or to hold on to the possibility that maybe nothing would go into that direction this once. But the next day, the same officer who had come to notify them of Madam being held in custody, stood at their door looking almost sorry. “We’d just pass on something like this between locals. But this time, a foreigner is involved.”\n“But we didn’t do anything to Nova-san.”\n“She didn’t get back to the hotel one night, came back the next morning with scratches all over and a patterned eye patch. We cannot call that ‘didn’t do anything.’”\nWhen they got to the Officers’ Station, Madam Enamel was there, too, with a girl with pastel-colored cotton-candy hair they remembered from the previous day accompanying her. The enamel woman looked frail, pale in her own way, but was sitting straight on the cushioned chair.\n“Madam isn’t properly well! How dare you drag her here?” Kiriko’s mentor hissed furiously.\n“Craftsperson, easy.” Madam Enamel raised her hand. “I told them I wanted to be here and give accounts of the incident myself. I asked them, I wanted to be in the same room as you two, so that you can do whatever you need to when something goes wrong with me.” At this stage, it was no use pretending that the atelier had nothing to do with Madam’s condition or its treatment. “They don’t usually listen to this kind of request, but they made this exception for me. That much, I should be grateful.”\nHe backed off, still fuming. Kiriko looked around. “Where is Nova-san?”\n“She is being asked to talk in a separate room, of course.”\nThe two craftspersons took their seats on the other side of the table from Madam. “And what are we charged for, exactly?” he asked.\n“What, exactly, did you do to the foreigner? She wouldn’t talk.”\n“That’s because there’s nothing to talk about. Maybe she fell off a stair or something, nothing to do with any of us,” Madam said.\n“Then why wouldn’t she just say so?”\n“Maybe she doesn’t understand you.”\n“Madam,” the officer frowned as they said, “we know she likes you. And it’s good to see a foreigner liking one of us that way. But if there was a crime involving a foreigner, we must know.”\n“But there’s no crime committed! And the foreigner herself doesn’t recognize one, does she?”\nThe officer looked very unhappy at that. For a moment, Kiriko thought they might win—except there was no win or lose, not really—only their atelier’s future poised on the officer’s finger.\nThey said, “So she just fell off a stair. But what about your disease?”\n“What about it?”\n“You obviously got ill right after being caught with the foreigner. Or maybe after that bath that smelled a bit funny. We do know that you had dealings with the atelier, at around the same time. You’d had no conditions before then, we heard?”\nStill crack-strewn, Madam Enamel stared at the officer. The progress had stopped entirely, malfunction of Madam’s systems thoroughly eliminated, but there was no hiding the cracks now—once this kind of change happened, there was no turning back, just like her plum color itself, ripening. They held their eyes that way for some time, while the two craftspersons could do nothing but just sit there, finding even simple breathing hard, so hard. “This has nothing to do with the situation here,” the enamel woman finally said, her voice even—too much so.\n“We can investigate, you see. You cannot go on without knowing the cause. What if it is contagious? You may be exposing your fellow islanders to danger, even as we speak now.”\n“How dare you—” Her cotton candy subordinate, who had been growing impatient by the minute, was about to bang her fists on the table, but Madam Enamel stopped her with a hand.\n“Candy, no,” she said and shook her head. Candy breathed deep but then sprang to her feet as if to shake fume off, went to stand facing the mirrored wall.\n“What is it, Madam Enamel?” the officer continued. “If you really have no idea, you should consider closing down your place, at least until we have done proper investigation and everybody knows what caused it. If it’s to do with the foreign researcher, either something she did to you or she brought into our country, we must expel her from the island, never admit her any future entrance. You should never see her again. Or,” they paused, just a fraction too long to be for breathing, “if that’s the atelier’s fault, we can just order them to discontinue their trade.”\nMadam lifted her head and looked to the officer. Candy turned around.\n“Look, Madam Enamel,” said the officer, slowly, as if Madam wasn’t quite getting them. “Tell us the truth. What do you owe these colorless laborers, anyway?”\nThere. The two craftspersons had known it would come to this sooner or later, all along. Yes—as long as the colorless were to blame, everything would be fine. Nova would get to stay on the island, keep on with her research, stay with Madam; Madam would be able to resume her position as proprietor as soon as she was well enough. The government would have no dispute with the continent.\nHappy ending to all.\nMadam Enamel looked at Kiriko and her mentor. Kiriko stared back, sending no message through that one moment of eye contact. Because after all, what did Madam owe them, really? Just a sorry end of lizard tail cut, and discarded; there were enough colorless craftspersons in the city, to replace these two.\nMadam Enamel looked back at the officer. “Sorry, I think I’ve been mistaken a few moments ago.”\n“Okay, Madam. Tell us.”\n“It’s the foreigner. She is a descendant of islanders, and has properties that can be harmful to me.”\n“What?” the officer came to stand closer to her, their hands on the table. “Look, you don’t have to—”\n“I don’t have to what? These two craftspersons did study the foreigner. They can give you the data as proofs. Or you can do it all over again, hurting her even more, and get into more trouble with the continent. And oh, I can tell there are more officers watching us behind, let me see, that mirror maybe?” She pointed at the wall and Candy jumped away from it with a small cry. “Surely you’re recording this. You cannot erase my testimony here. Right?”\nThe officer stood back up straight. “Are you sure—”\n“I am.” Madam stood up. Candy came to support her. “The foreign researcher is harmful only to me, or to enamel people. But I haven’t seen any other enamel than me in the city, so. I would not say this is contagious.” She shrugged like a foreigner. “Can we all go home now?”\nShe stood tall, and nobody would have guessed she’d been down with illness only a day ago. Her eyes were hard. The officer swallowed, before they stepped back to let her pass.\n“Madam,” Kiriko said, when they were back in the western end of the city. “Madam.” But she didn’t know how she could continue.\nMadam Enamel stopped there, and turned, to face the craftspersons. She looked both of them in the eye, one of them after the other, and then touched Kiriko’s shoulder. “I remember,” she said. “I was as young as you are now, I think, when I started working in this area. A lot older than you two when I finally established my own place. I worked hard. Real hard.”\nA wind blew. Candy brushed a strand of Madam’s tree-bark hair out of her face, and Madam smiled at her employee.\n“You, too, might want to have your own place, some day,” Madam said to Candy. Candy shrugged and they both giggled. Then Madam turned back to the craftspersons. “I know you are working hard. How can I take that away from you? Nova would understand. She is a foreigner, she’ll have a chance to resume her research some time. But if you lose what you have now, you’ll never get it back again . . . sorry, but that’s true, I think.”\nKiriko’s mentor nodded. “Thank you. There in the station, I thought I lost my atelier forever.”\nKiriko stood there, silent. She knew she should be grateful and say it, too. But—but what? This was the best possible outcome. “But you two. You two might not see each other again.” Her voice shook, embarrassing her with her own naïveté.\n“Again, she is a foreigner. I am a colorful. We’ll find our way to each other in time.”\nKiriko looked down and couldn’t lift her head back up. When she was old enough, if there ever came a time that she had to choose between someone else’s future and her mentor, would she ever be able to make the same choice?\n“I do everything to protect my place. You to protect your crafts. Don’t let that make you feel bad, Craftsperson.”\nOnly when Madam was well away from them, Kiriko looked up. The world was blurry. Her mentor nudged her. “Let’s get home. I’m starving,” he said.\nKiriko nodded. In the weeks to come, they’d hear the rumor that Madam Enamel turned into Madam Fallen Fruit. That sounded sexy, in a way foreigners and west-loitering locals liked. But Madam Enamel was lost forever, and even after years, Kiriko would mourn for that loss.", "source": "https://clarkesworldmagazine.com/ogawa_04_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ripen by Yukimi Ogawa"}